[
  {
    "headline": "Agency clamps down on illegal real estate practitioners",
    "summarized_story": "The Lagos State Real Estate Regulatory Authority on Thursday, clamped down on signages of unregistered real estate practitioners operating in the state.\nThe News Agency of Nigeria quoted the Special Adviser to the Lagos State Governor on Housing, Mrs Toke Benson-Awoyinka, as saying that the exercise was to enforce compliance with its directive to real estate practitioners to be duly registered with the authority.\nShe said the exercise was in line with LASRERA’s mandate to regulate, sanitise and effectively monitor the real estate sector in Lagos State.\n“It is part of the strategies by LASRERA to raise public awareness about the state government’s efforts to sanitise the real estate sector in the state,” she said.\nBenson-Awoyinka explained that many members of the public had been defrauded in the past by imposters and fraudulent real estate practitioners."
  },
  {
    "headline": "Focus on South-East security, Northern Elders’ Forum tells Ohanaeze",
    "summarized_story": "The Northern Elders Forum on Thursday asked the Ohaneze Ndigbo to redirect its attention toward ensuring the security of South-East people rather than threatening other section of the country.\nThe Northern Elders Forum said should anything happen to him, it knows who should be held responsible.\nHe said, “My attention has been drawn to comments by spokesman of Ohaneze Ndigbo, Dr. Alex Ogbonnia, on the Director of Publicity and Advocacy of Northern Elders Forum, Dr. Hakeem Baba-Ahmed.\n“The Northern Elders Forum states categorically that all comments and statements made by Dr. Baba-Ahmed are authorized, and they represent its positions.\n“We serve notice that we know who to hold responsible in the event of any harm to Dr. Baba-Ahmed."
  },
  {
    "headline": "Edo street residents obstruct okada operations as thunderstorm kills one",
    "summarized_story": "The incident that was said to have happened during a heavy downpour on Wednesday evening also left others injured and some with lacerations in their hand and legs.\nSome have attributed the incident to the use of phones during the rain while others said there is more to it.\nThe young man is very popular in our street and I was told he recently went for introduction ahead of his coming marriage.\nMy last born was very close to him because he is a very friendly person.\nMy son has been crying over the matter and has not been himself."
  },
  {
    "headline": "CUPP spokesman alleges fresh plot to use fake list for Imo primaries",
    "summarized_story": "By Joseph Erunke, ABUJAOpposition political parties’ spokesperson and leading House of Representatives aspirant,Ikenga Imo Ugochinyere, has alleged fresh plot by some officials of the Peooles Democratic Party,PDP, working for external forces to exclude the opposition party in the 2023 election by using what he called cooked up delegate list from aborted congress.\n“According to him ,”the paid agents in their desperate bid to return APC to power in Imo in 2023 ,has ignored even the court order which restrained the party from using any list from the purported congress and have perfected plot to resurface the fake list for use this weekend.\n““The plot is to clear way for the APC to use that to void all the primaries in Imo State from State Assembly, to House of Reps and Senate.\na repeat of what happened in Zamfara(where all winners were removed), Rivers (where their candidate never made it to the ballot), Anambra (where supreme canceled their candidate), etc”,he said.\nHe alleged that in that circumstance,” Imo PDP candidates will be out of the 2023 election, and APC will run unopposed because the primaries were held with an illegal and invalid three-man ad-hoc list."
  },
  {
    "headline": "Okada ban: Lagos residents express divergent views",
    "summarized_story": "Some Lagos residents on Thursday expressed divergent views over the ban on commercial motorcycles in the state by the state government..Gov.\nBabajide Sanwo-Olu on Wednesday imposed a total ban on activities of commercial motorcycle operators in six local government areas of Eti-Osa, Ikeja, Surulere, Lagos Island, Lagos Mainland, and Apapa.\nSome residents, however, told NAN in Lagos that the government decision on the ban was a welcome development while others frowned at it.\nMr Gbenga Ajayi, a teacher, resident of Ayobo, said that ‘okada’ ban was a good decision but should be extended to other local government areas, not only in selected areas.\n“My brother was beaten and almost lynched last month over N100 by some okada riders."
  },
  {
    "headline": "Naira depreciates further, exchanges at N420.33 against the dollar",
    "summarized_story": "The Naira, on Thursday, exchanged at 420.33 to the dollar at the Investors and Exporters window, compared to 419.25 traded on Wednesday, representing 0.26 per cent depreciation.\nThe open indicative rate closed at N417.70 to the dollar on Thursday.\nAn exchange rate of N444.00 to the dollar was the highest rate recorded within the day’s trading before it settled at N420.33.\nThe Naira sold for as low as 410 to the dollar within the day’s trading.\nA total of 75.56 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "Average price for 5kg cooking gas increases to N3,800.47 – NBS",
    "summarized_story": "The National Bureau of Statistics (NBS), says the average price for refilling a 5kg gas cylinder of Liquefied Petroleum Gas (Cooking Gas) increased to N3,800.47 in April 2022.\nThis is contained in the NBS Liquefied Petroleum Gas (Cooking Gas) Price Watch for April 2022 released in Abuja on Thursday.\nHowever, on a year-on-year basis, it said the average retail price for cooking gas increased by 83.67 per cent from N2,069.21 in April 2021.\nSimilarly, on a year-on-year basis, the average retail price for refilling a 12.5kg cooking gas increased by 89.10 per cent from N4,317.55 in April 2021.\nIt said the average retail price of a 12.5kg cylinder of cooking gas by zones showed that the average retail price was highest in the South-West with N8,573.28."
  },
  {
    "headline": "Bad leadership responsible for insecurity in Nigeria – Saraki",
    "summarized_story": "Former Senate President, Bukola Saraki, on Thursday, blamed the dwindling security of Nigeria which have led to wanton destruction of lives and property to leadership failure.\nSaraki, who made this known in Jalingo, Taraba State while interacting with delegates and stakeholders of the state chapter of the Peoples Democratic Party (PDP), felt sad that Nigeria as a nation, has gone through so much.\nHe said, “We can not have the same type of leaders tomorrow as we have today.\nDarius Dickson Ishaku, who also agreed with what Saraki said, lamented the present state to the country.\nHe admitted that “We need someone that will fix insecurity and bring investment.”Saraki os one of the fifteen presidential aspirants jostling for the sole presidential ticket of the PDP for 2023 general elections."
  },
  {
    "headline": "One dead, scores injured as Ndume’s supporters, thugs clash in Borno",
    "summarized_story": "Reports reaching DAILY POST on Thursday evening have it that some political thugs and supporters of the Borno South Senatorial District Senator, Muhammadu Ali Ndume clashed in Biu Local Government Area of Borno State.\nThe incident, DAILY POST gathered, happened when the Senator visited the local government to meet with delegates ahead of the APC primaries in Borno.\nAn eyewitness, Usman Miringa, told DAILY POST that trouble started shortly after the meeting at the government lodge.\nWe also saw other thugs and supporters of the Senator being taken to the hospital in Biu,” Said Miringa.\nAccording to residents of Biu, there have always been clashes whenever Senator Ndume comes to Biu for political activities."
  },
  {
    "headline": "Okada ban: Deadline date won’t stop enforcement – Government warns",
    "summarized_story": "The Lagos State Government on Thursday warned that the seizure of commercial motorcycles by the Lagos State Task Force will continue in spite of the June 1 deadline.\nGovernor Babajide Sanwo-Olu of Lagos State had on Wednesday given a fresh total ban on Okada riders’ operations in six Local Government Areas, which are Ikeja, Lagos Island, Eti-Osa, Apapa, Surulere and Lagos Mainland.\nHowever, in a statement by the Commissioner for Information and Strategy, Mr Gbenga Omotoso, on Thursday, said that the deadline doesn’t invalidate the provisions of the Lagos State Transport Sector Reform Law of 2018.\nAccording to him, the Lagos State Task Force, led by CSP Shola Jejeloye, had continued to enforce the law, and had seized 238 motorcycles (Okada) in Lekki on Tuesday and Wednesday.\nHe said in Iba, on Lagos-Badagry Expressway, where it was violently resisted on Thursday, the Task Force seized 195 motorcycles."
  },
  {
    "headline": "Yobe lawmakers clear air on alleged move to impeach Gov Buni",
    "summarized_story": "The Yobe State House of Assembly has distanced itself from a rumour that members of the Assembly were making moves to impeach Governor Mai Mala Buni from office.\nThe House through its Chairman House Committee on Information, Gafo Mai Zabo Bizi, represented by his vice, Hon.\nAbdullahi Adamu Bazuwa, made the position of Assembly on Thursday during a press briefing in Damaturu.\n“The entire members of the house wish to categorically state that the above statement is false, baseless and malicious.\nThe lawmakers reiterated their continuous support and cooperation to Governor Mai Mala Buni for the respect and cordial relationship that have been existing between the two arms of the government."
  },
  {
    "headline": "‘We’ll not give any compensation’ – FCTA demolishes over 30 houses in Abuja",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) has demolished over 30 houses, which it described as illegal at Trademore Estate, Lugbe, in an attempt to prevent incessant flooding in the area.\n“This is an ongoing removal of illegal structures on the flood plain at the Trademore Estate, Lugbe, along Airport Road.\n“There has been excessive development on the floodplain in Trademore Estate, Lugbe, by some persons and this is very worrisome.\nFor now, 30 houses are going but over 100 were marked, but we are still engaging critical stakeholders around there.\n”After removing the first 30 houses, we will engage them to look at how we can use land solution act to find a lasting solution."
  },
  {
    "headline": "EPL: Chelsea secure third-place with Leicester draw",
    "summarized_story": "Chelsea all but secured a third-place finish in the Premier League with a draw against Leicester at Stamford Bridge.\nHowever, Marcos Alonso equalised towards the end of the first half when he was picked out superbly by Reece James and volleyed in.\nChelsea dominated the second half and had numerous chances to take all three points.\nHakim Ziyech went close with a free kick while Romelu Lukaku – who had been largely quiet – headed wide.\nThe result means Chelsea stay third, three points ahead of Tottenham, but with a vastly superior goal difference."
  },
  {
    "headline": "EPL: Aston Villa, Burnley settle for draw",
    "summarized_story": "Burnley secured a precious point at Aston Villa that was enough to move them out of the Premier League’s relegation zone and put their fate in their own hands heading into the final game of the season.\nAshley Barnes’ well-taken penalty put the Clarets in front just before half-time.\nHowever, Villa were the better side and the least they deserved was the draw given to them by Emiliano Buendia’s equaliser in the 48th minute.\nBurnley’s goal difference advantage over Leeds means there is no realistic chance of them going down if they beat Newcastle at Turf Moor on Sunday.\nTheir position would have been even better had Wout Weghorst not somehow failed to convert after being set up by Connor Roberts, whose own effort had been brilliantly saved by Emiliano Martinez."
  },
  {
    "headline": "EPL: Stunning Everton comeback secures Premier League status",
    "summarized_story": "Everton secured their Premier League status with an incredible fightback where they came from two goals down to beat Crystal Palace.\nBut conjuring up a fighter’s spirit once more and spurred on by they vociferous support, Everton turned the game around in the second half, thanks to a more attacking approach.\nYet the best was to come with five minutes left.\nThe excitement boiled over as fans descended on the pitch to celebrate, with blue mist shrouding the stadium as smoke flares were let off.\nThe crucial result avoided the kind of final-day nerves that Everton fans had to experience in 1998 and 1994, where the team also preserved their Premier League status."
  },
  {
    "headline": "Yoruba; remember how we got here",
    "summarized_story": "Thus with the characteristic display of Yoruba false sense of self-worth, Akintola resolved that if he could not have it, no one else would have it.\nConsequently, he sought the help of the Fulani and Igbo political elite that had an axe to grind with his leader.\nAnd with their help, he and his group of self-serving Yoruba leaders on May 29, 1962 buried their leader along with their 10 years of unparalleled achievements.\nFor instance, they helped in the procurement of farmers’ farm products which they also helped to sell in foreign markets.\nThe Coker Commission and it sponsors were obsessed with the #6,210,000 pounds NIPC owed Western Region Marketing Board, WRMB."
  },
  {
    "headline": "Reps Minority to Buhari: sign Electoral Act amendment",
    "summarized_story": "The Minority Caucus in the House of Representatives has asked President Muhammadu Buhari to immediately sign the amendment to the Electoral Act 2022 transmitted to him by the National Assembly to avoid political crisis.\nThe amendment is to allow elected representatives, including the President, Vice President, Governors and Deputy Governors to vote during party primaries as statutory delegates.\nThe amendment was recently passed and transmitted to the President for assent.\nThe Miniority Reps said: “As representatives of the people, the Minority Caucus urges Mr. President to avert an imminent political crisis which has the capacity of exacerbating the security situation in the country by immediately signing the Amendment to the Electoral Act 2022 and leave a legacy of a credible electoral process to the nation.\n“Our caucus calls on all Nigerians, the Civil Society, the International Community and all lovers of democracy to prevail on President Buhari to immediately sign the amendment to the Electoral Act 2022 and save our nation from an avoidable crisis.”"
  },
  {
    "headline": "President’s silence, non-show of preference so far leave contenders in quandary",
    "summarized_story": "By Wilfred EyaBarely two weeks to the national convention, President Muhammadu Buhari’s silence on his preferred candidate has unsettled All Progressives Congress (APC) presidential aspirants.\nDaily Sun learnt that the aspirants have become jittery as they cannot decipher the body language of the president on who his successor would be.\nEarn in US Dollars weekly by trading in US Stock options from companies like Apple, Facebook, Twitter, Amazon, Tesla, etc.\nThe rumour in town is that Buhari encouraged most of the aspirants to join the race.\nThe Special Convention where the party’s presidential candidate would be elected is slated for Sunday, May 29-Monday, May 30."
  },
  {
    "headline": "Nigeria can overcome security challenges in 2 years with right leader –Obasanjo",
    "summarized_story": "From Laide Raheem, AbeokutaFormer president, Chief Olusegun Obasanjo, yesterday, said Nigeria’s security challenges could be resolved within two years with the right person willing to take tough decisions at the helm of leadership.\nObasanjo said Nigeria required a visionary, passionate and innovative leader who also has adequate knowledge about the challenges confronting the country.\nObasanjo said he had no apology for his “mad passion” for Nigeria, saying the country’s challenges required the collective efforts of all citizens.\nSo, Nigerians have to brace themselves up to do what needs to be done to put Nigeria back on the right path.\nIf that knowledge is adequate, we will do what is right, when it is right and how it is right."
  },
  {
    "headline": "Sit-at-home: Delta govt advises IPOB to adopt other means of agitation",
    "summarized_story": "From Paul Osuyi, AsabaDelta State Government has urged members of the Indigenous People of Biafra (IPOB) to adopt other ways of driving home their agitation.\nThe government said the current sit-at-home order was not only putting lives of residents in danger but also negatively affecting the economy of the South East and neighbouring states.\nEarn in US Dollars weekly by trading in US Stock options from companies like Apple, Facebook, Twitter, Amazon, Tesla, etc.\n“It is affecting our economy in the South East, I use the word ‘our’ because whatever that happens to our brothers in the South East also happens to us.\nPremature Ejaculation & \"Small Joystick\" Resolved in 7Days... Click Here For Details ."
  },
  {
    "headline": "2023: Reps caucus tasks Buhari on amended Electoral Act – The Sun Nigeria",
    "summarized_story": "From Ndubuisi Orji, AbujaMinority caucus in the House of Representatives has charged President Muhammadu Buhari to sign the amendment to the Electoral Act passed last week by the chambers of the National Assembly.\nThe caucus in a statement by the Minority Leader, Ndudi Elumelu, yesterday, said this had become necessary to avert “an imminent political crisis in the country.”Are you a Man 40 yrs and above?\nThe parliament had last week altered Section 84(8) of the Electoral Act to provide for statutory delegates at political parties congresses and conventions for the nomination of candidates for the 2023 polls.\nEarn in US Dollars weekly by trading in US Stock options from companies like Apple, Facebook, Twitter, Amazon, Tesla, etc.\nOur caucus calls on all Nigerians, the civil society, the international community and all lovers of democracy to prevail on President Buhari to immediately sign the amendment to the Electoral Act 2022 and save our nation from an avoidable crisis.”"
  },
  {
    "headline": "Magu’ll face prosecution if indicted –FG",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government has said though ex-Acting Chairman of the Economic and Financial Commission (EFCC), Mr. Ibrahim Magu, has been promoted and retired, he would be prosecuted if indicted.\nThe panel upon conclusion of its assignment had turned-in its report to the President recommending Magu’s removal as EFCC boss.\n“But what I know is that Mr. Magu has already retired and that is what I can tell you now.\nThe fact that he was promoted is a matter for the Police Commission to maybe throw more light on.\nI want to tell you that they are unknown gunmen and they are also criminals."
  },
  {
    "headline": "Returning Ministers: Buhari to Determine Sylva, Ngige, Tallen’s Fate, Says Mohammed",
    "summarized_story": "FEC also approved the sum of N3, 491,622,340 for the purchase of a property in Abuja for the Ministry of Aviation.\nMohammed, who briefed newsmen after the FEC meeting yesterday at the State House, Abuja, said he would need to confirm the status of the returning ministers from the president.\nMalami was physically present at yesterday’s council meeting, while Tallen and Sylva attended the meeting virtually from their offices in Abuja.\n“A memo of the Minister of Agriculture seeking approval for a national agricultural technology innovation policy was approved.\n“The policy is also going to help promote knowledge creation and transfer through reorganising, unbundling and strengthening agricultural research and training systems."
  },
  {
    "headline": "The 23 APC Members Seeking to Replace Buhari",
    "summarized_story": "But questions remain about the strange rush to make a visible impression on the APC presidential dashboard.\nBello remains one interesting character in the race for the APC ticket and can no longer be taken for granted.\nA US-based Nigerian pastor at the Miracle Church International, is the second pastor in the race for APC ticket after Bakare.\nAbubakar BadaruA prominent and critical factor in some of the APC power centres is the Jigawa State Governor, Abubakar Badaru.\nWhatever they are, all eyes on him as the battle for the APC ticket thickens."
  },
  {
    "headline": "FG Declines Consent to Seplat, Mobil Oil Producing Assets Acquisition Deal",
    "summarized_story": "Obinna ChimaThe federal government declined its consent to the proposed acquisition of oil and gas assets belonging to Mobil Oil Producing Nigeria Unlimited (MPNU) by Seplat Energy.\nThe government among others, cited overriding national interest as one of the reasons for rejecting the deal.\nSeplat Energy had in February this year, announced its acquisition of oil and gas assets belonging to MPNU.\nBut the deal was subject to Ministerial Consent and other required regulatory approvals.\n“We regret to inform you that His Excellency, the Minister of Petroleum Resources has declined his consent to the transaction."
  },
  {
    "headline": "Buhari to Determine Fate of Malami, 3 Other Returning Ministers, Says Mohammed",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari will decide the fate of those members of the Federal Executive Council (FEC) who made a u-turn on their political ambitions and continue to serve in the current administration.\nHe said: “The question about ministers returning or not going, I think you need to give me more time so that I can tell you exactly what the situation is.\nI need to confirm again from Mr President what the situation is.\nMalami was physically present at Wednesday’s Council meeting, while Tallen and Sylva attended the meeting virtually from their various offices in Abuja.\nNgige is said to be away on official engagement in Durban, South Africa, where he is attending the International Labour Organization’s (ILO) global conference on Child Labour."
  },
  {
    "headline": "Breaking: You can’t Get Bail Now, Court Tells IPOB Leader, Nnamdi Kanu",
    "summarized_story": "Alex Enumah in AbujaJustice Binta Nyako of the Abuja Division of the Federal High Court on Wednesday, told the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, that he cannot be granted bail until he explains to the court why he breached the previous bail given to him in April 2017.\nHis absence stalled his trial until he was rearrested and brought to the country last year to continue trial.\n“However, the defendant is at liberty to re-file the application,” Justice Nyako held.\nJustice Nyako observed that Kanu’s trial had suffered various setbacks owing to over 19 interlocutory applications that have been filed in the matter.\nShe appealed to parties to allow the case to proceed on trial and justice dispensed accordingly."
  },
  {
    "headline": "BREAKING: Alleged N47bn Fraud: Nigerian Anti-graft Agency, EFCC Arrests Ex-Managing Director Of Niger Delta Development Commission, Nsima Ekere",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested the former Managing Director of the Niger Delta Development Commission (NDDC), Nsima Ekere.\nEkere was arrested on Wednesday for allegedly diverting N47 billion through registered contractors of the agency.\nSimilarly, on Tuesday, the EFCC arrested a former Speaker of the Nigerian House of Representatives, Patricia Etteh.\nThe contract was awarded by the Niger Delta Development Commission (NDDC).\nThe EFCC on Monday arrested the Accountant-General of the Federation (AGF), Ahmed Idris, over alleged N80 billion fraud."
  },
  {
    "headline": "BREAKING: Alleged N47bn Fraud: Nigerian Anti-graft Agency, EFCC Arrests Ex-Managing Director Of Niger Delta Development Commission, Nsima Ekere",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested the former Managing Director of the Niger Delta Development Commission (NDDC), Nsima Ekere.\nEkere was arrested on Wednesday for allegedly diverting N47 billion through registered contractors of the agency.\nSimilarly, on Tuesday, the EFCC arrested a former Speaker of the Nigerian House of Representatives, Patricia Etteh.\nThe contract was awarded by the Niger Delta Development Commission (NDDC).\nThe EFCC on Monday arrested the Accountant-General of the Federation (AGF), Ahmed Idris, over alleged N80 billion fraud."
  },
  {
    "headline": "BREAKING: Nigerian Government Suspends Accountant-General Of The Federation, Ahmed Idris, Indefinitely Over N80billion Alleged Fraud",
    "summarized_story": "The Nigerian government has suspended the Accountant General of the Federation, Ahmed Idris indefinitely.\nAhmed IdrisHis suspension followed his indictment for fraud worth N80 billion by the Economic and Financial Crimes Commission (EFCC).\nHis suspension letter signed by Zainab Ahmed on a letterhead of the Federal Ministry of Finance, Budget and National Planning, dated May 18 and addressed to the Accountant General of the Federation, Alhaji Ahmed Idris, was obtained by SaharaReporters on Wednesday.\nSaharaReporters had reported that Idris was arrested by the EFCC on Monday while on his way to Kano.\nThe shareholdings of both firms indicate a spread of Idris family members on the official board."
  },
  {
    "headline": "BREAKING: Nigerian Government Suspends Accountant-General Of The Federation, Ahmed Idris, Indefinitely Over N80billion Alleged Fraud",
    "summarized_story": "The Nigerian government has suspended the Accountant General of the Federation, Ahmed Idris indefinitely.\nAhmed IdrisHis suspension followed his indictment for fraud worth N80 billion by the Economic and Financial Crimes Commission (EFCC).\nHis suspension letter signed by Zainab Ahmed on a letterhead of the Federal Ministry of Finance, Budget and National Planning, dated May 18 and addressed to the Accountant General of the Federation, Alhaji Ahmed Idris, was obtained by SaharaReporters on Wednesday.\nSaharaReporters had reported that Idris was arrested by the EFCC on Monday while on his way to Kano.\nThe shareholdings of both firms indicate a spread of Idris family members on the official board."
  },
  {
    "headline": "Nigeria Needs A Mother, So I Will Take Country As My Child – APC Female Presidential Aspirant",
    "summarized_story": "A female presidential aspirant on the platform of the ruling All Progressives Congress (APC), Uju Ken-Ohanenye, has said that she will take Nigeria as her child if elected as president because the country needs a mother.\n“I will take Nigeria as my child, the country wants a mother and that is why I am in the race to bring in that mother’s touch that the country needs at this time.\n“We cannot continue that way, a woman should be given a chance, we need a mother; that is what the country has been lacking,” she said.\nKen-Ohanenye promised to give 60 per cent of political appointments to women across the country and 40 percent to men if elected president in 2023.\nAccording to the female aspirant, “I need a chance to prove how education and how important every Nigerian is, and I cannot get that chance without all of you."
  },
  {
    "headline": "Obasanjo: We need a leader who is passionate, mad about Nigeria",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria needs a leader who is passionate about the country.\nAdvertisement“You are right in saying that wherever you go now, one of the things you hear is that Nigeria is not at the table.\nWhat should it cost Nigeria to be at the table?” he asked.\nI was telling some people this morning that passion means madness — that you are mad about Nigeria.\nPassion means being mad about Nigeria — having a touch of madness."
  },
  {
    "headline": "Obasanjo: We need a leader who is passionate, mad about Nigeria",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria needs a leader who is passionate about the country.\nAdvertisement“You are right in saying that wherever you go now, one of the things you hear is that Nigeria is not at the table.\nWhat should it cost Nigeria to be at the table?” he asked.\nI was telling some people this morning that passion means madness — that you are mad about Nigeria.\nPassion means being mad about Nigeria — having a touch of madness."
  },
  {
    "headline": "'Coverage for 83m Nigerians' -- Buhari signs national health insurance bill into law",
    "summarized_story": "President Muhammadu Buhari has signed the National Health Insurance Authority Bill 2022 into law.\nThe new legislation repeals the National Health Insurance Scheme Act 2004.\nAdvertisementThe president also said there will be collaborations with state government health insurance schemes to accredit primary and secondary health facilities to ensure the delivery of quality health services.\nHe asked the health sector reform committee — inaugurated in January 2022 — to work with state governments, the federal ministry of health, and the national health insurance authority to ensure the implementation of the new act.\nAccording to the statement, under the new act, the health insurance authority and state governments will also develop information management systems and digital records for better data collection, monitoring, and quality assurance."
  },
  {
    "headline": "'Coverage for 83m Nigerians' -- Buhari signs national health insurance bill into law",
    "summarized_story": "President Muhammadu Buhari has signed the National Health Insurance Authority Bill 2022 into law.\nThe new legislation repeals the National Health Insurance Scheme Act 2004.\nAdvertisementThe president also said there will be collaborations with state government health insurance schemes to accredit primary and secondary health facilities to ensure the delivery of quality health services.\nHe asked the health sector reform committee — inaugurated in January 2022 — to work with state governments, the federal ministry of health, and the national health insurance authority to ensure the implementation of the new act.\nAccording to the statement, under the new act, the health insurance authority and state governments will also develop information management systems and digital records for better data collection, monitoring, and quality assurance."
  },
  {
    "headline": "INSIDE STORY: How death of passenger led to riot at Abuja market",
    "summarized_story": "On Wednesday, there was chaos at Dei-Dei, a suburb of Abuja, which houses the popular building materials market.\nAn accident said to have occurred in the area led to riot, which resulted in the destruction of shops and vehicles.\n“The road safety said they will take the okada man and the corpse of the woman.\nThe people there said they will be the ones to take the okada man.\nAdvertisementBaba Ado, the chairman of the market, also said a total of five persons were reported dead, with 30 injured."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Disney+ launches in South Africa. Here’s how much it costs",
    "summarized_story": "Earlier in January, the Walt Disney Company confirmed the expansion of its streaming service, Disney+, to 42 new countries, including 6 African countries—Egypt, Morocco, Algeria, Libya, Tunisia, and South Africa.\nDisney+ South Africa’s arm offers users the Standard Plan, at R119 ($7.47)/month or R1,190 ($74.64)/annum.\nOn the service, South Africans will access original Disney content like the Star Wars series and Encanto; and features from the Marvel Cinematic Universe (MCU) like Moon Knight.\nWhile Netflix does have an affordable R49/month Mobile plan in South Africa, the plan only allows 1 user and 1 device.\nThe only Netflix plan similar to Disney+’s Standard R119 plan is Netflix’s Premium plan which costs R199 plan and allows Ultra HD streaming on up to 4 devices."
  },
  {
    "headline": "How Adora Nwodo is making a name for herself in the cloud",
    "summarized_story": "She currently works as a cloud engineer at Microsoft and is the author of Cloud Engineering for beginners.\nAdora Nwodo on cloud engineering and mixed realityKoromone Koroye: Hi Adora, thanks for agreeing to speak with me.\nAdora Nwodo: I am a software engineer currently building mixed reality on the cloud at Microsoft.\nCloud engineers literally do their engineering on the cloud, whether software engineering or DevOps engineering.\nAN: Before I talk about mixed reality, let me briefly explain the difference between augmented reality (AR) and virtual reality (VR)."
  },
  {
    "headline": "TikTok on a “Branded Mission”",
    "summarized_story": "For more information on this acquisition, listen to today’s episode of the Techpoint Africa Podcast here.\nTikTok to roll out a new ad productTikTok has announced the launch of “Branded Mission,” a new advertising product.\nIn summary, Branded Mission allows emerging and aspiring creators to respond to ad casting calls directly on TikTok.\nBranded Mission is currently in beta testing and is available to brands in over a dozen markets.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in two days!"
  },
  {
    "headline": "[PODCAST] Tax evasion in Nigeria to get harder",
    "summarized_story": "Share this article:Taxation is not a subject that Nigerians want to talk about, but the Federal Inland Revenue Service (FIRS) is about to make it unavoidable.\nUsing the National Identification Number (NIN), the organisation wants to track financial transactions in the country to tax Nigerians effectively.\nCompared to Q1 2021, the company witnessed impressive growth with revenue growing to $47.6 million, orders growing to 9.3 million, and gross merchandise value hitting $252.7 million.\nWith the company announcing that it had acquired a payment service solution provider license (PSSP), we explored the possibility of the company growing its fintech footprints.\nEmmanuel shared a Technext report that revealed that most car marketplaces in Nigeria made up to 150% profit from car sales."
  },
  {
    "headline": "SEC regulations: Nigeria Crypto exchange CEOs to retire after 10 years",
    "summarized_story": "Share this article:Nigeria’s Securities and Exchange Commission (SEC) issued rules and guidelines for all crypto and digital asset service providers on Friday, May 13, 2022.\nDigital Assets Exchange (DAX): This is “an electronic platform which facilitates the trading of a virtual asset or digital asset.” They are simply crypto exchanges such as Binance and Quidax.\nSEC crypto regulations on creating or issuing tokensThere are currently 19,443 crypto tokens in existence, according to CoinMarketCap.\nIf the SEC considers a digital asset a security under the Securities Act of 2007, the asset will be registered as a digital asset and security.\nRules for Digital Assets Offering Platforms (DAOPs)DAOPs are platforms where digital assets are issued."
  },
  {
    "headline": "Binance To Host “Block and Brunch” Networking Event For Professionals In Lagos",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nThe event targets professionals who are crypto newbies and enthusiasts for an afternoon of learning and networking.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Traction Appoints Babatope Oni as Chief Technology Officer",
    "summarized_story": "This article is a Brand Press post.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Leading financial services platform, Traction has appointed Babatope Oni as Chief Technology Officer (CTO).\nI am excited to join the Traction team,” said the new Traction CTO, Babatope Oni.\nTo learn more about Traction, please visit https://tractionapps.co/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "TotalEnergies appoints bank to lead sale of stake in Nigerian oil joint venture",
    "summarized_story": "TotalEnergies appoints bank to lead sale of stake in Nigerian oil joint ventureTotalEnergies has finally launched the sale of its 10% stake in Nigerian joint venture SPDC, with Canada’s Scotiabank leading the sale as financial adviser, a sale document tendering for interest showed, reports Reuters.\nTotalEnergies announced the sale in late April.\nTotalEnergies confirmed it was selling its interest in 13 onshore fields and three in shallow water, producing over 20,000 barrels of oil equivalent per day.\nSPDC is a joint venture in which Shell holds a 30% working interest, NNPC holds 55% and Eni has 5%.\nShell is also selling its stake in SPDC but these efforts have been held up by a court case"
  },
  {
    "headline": "Three reasons why FG rejected consent for Seplat/ExxonMobil $1.2bn deal",
    "summarized_story": "The Federal government has turned down the application for ministerial consent necessary to seal a $1.3bn planned deal between Seplat Energy Plc, a major energy company in Nigeria, and US-based ExxonMobil.\nOverriding national interestConcerning overriding national interest, NUPRC acknowledged Mobil Oil still remains to all intents and purposes, the assignor of the asset under the Nigerian law.\nHowever, under the Nigerian law, NUPRC said “that overriding National interest will always be the compass of the law.\n“Thus, regardless of the mode of the transaction, MPNU, remains, to all intents and purposes, the assignor under Nigerian law and is the proper person to bring an application for Ministerial consent to the transaction, not Seplat.\nConsequently, you are hereby requested to revert to MPNU, the assignor, to receive updates on your application,” it stated."
  },
  {
    "headline": "83 million poor Nigerians to enjoy coverage, as Buhari signs NHIS Act",
    "summarized_story": "President Muhammadu Buhari on Thursday signed the recently passed National Health Insurance Authority Bill 2022, repealing the National Health Insurance Scheme Act, Cap N42, Laws of the Federation of Nigeria, 2004.\nPresident Buhari said at the signing of the new law that a Fund will be set up “to ensure coverage of 83 million poor Nigerians who cannot afford to pay premiums as recommended by the Lancet Nigeria Commission.”He then went on to elaborate on how the Fund will be sourced: “For the large number of vulnerable individuals who are not able to pay health insurance premiums.\nAccording to the President, “ the Vulnerable Group Fund will be set up to include a component of the Basic Health Care Provision Fund due to the Authority, Health Insurance Levy, Special Intervention Fund, and any investment proceeds, donations and gifts to the Authority.”The President announced that the Authority will collaborate with state government Health Insurance Schemes to accredit primary and secondary health facilities and enroll Nigerians into the scheme in order to ensure the delivery of quality health care.\nRead also: Buhari silent as Malami, Sylva, others return to workThe new Act also enables the Authority and state governments to develop information management systems and digital records for better data collection, monitoring and quality assurance.\nPresident Buhari tasked the Health Reform Committee to work with state governments, the Federal Ministry of Health and the National Health Insurance Authority to ensure the implementation of the articles in the new Act."
  },
  {
    "headline": "Eko Bridge: Motorists call out FG, Lagos govt as suffering intensifies",
    "summarized_story": "Motorists and other road users, especially those that are frequently on Eko Bridge, have cried out to both federal and Lagos State governments to end their suffering arising from long hours in terrible traffic on that bridge.\nSince March 23, 2022, when the bridge was partially closed to traffic following the fire incident on Akpangbon bridge, the driving experience on Eko Bridge which is a major route to Lagos Island from the Mainland, has been anything but pleasurable.\nA Lagos resident who lives on the island but has his business on the mainland shared his daily harrowing experience with BusinessDay.\nHe called on the authorities concerned, whether it is the federal government or Lagos state or both, to hasten the palliative work on the burnt Akpangbon Bridge to enable the reopening of the closed bridge and end people’s suffering.\nPopoola was not available to comment on the current status of the repair work as his phone rang full circle when this reporter called Thursday afternoon but he did not pick up."
  },
  {
    "headline": "Nigeria reneges on filing oil receipt report to IOPC fund",
    "summarized_story": "Nigeria has been identified as one of the 14 oil receiving countries in the world that have failed to report oil receipt to the International Oil Pollution Compensation (IOPC) Fund, to which the country is a signatory.\nOfodile, who disclosed this while giving feedback on the efforts of the sub-committee on the identification of receivers of contributing oil, said the sensitisation of oil receiving organisations in Nigeria would lead to mass registration and contribution towards the IOPC Fund secretariat.\nAccording to her, NIMASA has a register for contributing oil receivers in Nigeria, in which oil receiving firms are expected to put their names and report their receipt as an obligation to the IOPC Fund.\n“It is good we have a record as a contributing oil receiver and also important because it is our obligation to ensure we give the IOPC Fund the names of all contributing oil receivers in Nigeria,” she added.\nNigeria is a party to the International Convention for Civil Liability for Oil Pollution Damage 1992 and the International Convention on the Establishment of an International Fund for Compensation for Oil Pollution Damage 1992."
  },
  {
    "headline": "Woman Saved From Gallows in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinteresta white Thorsday made by God– Barr Olayiwola Afolabi based in Benin, Edo State led a team of journalists to Oko Prisons in the city of Benin- He was not on a prison visit to dole out his known provrrbial gifts to the prison inmates-On the contrary, he was at the prison to effect the release of Mrs Enobong Isonguyo who was incarcerated there since 2013 for the suspected murder of her husband Engr Victor Gabriel Isonguyo, a senior director at Nigerian National Petroleum Company in Benin-An Edo High Court judge, Geraldine Imadegbelo, sentenced her to death by hanging alongside their family psstor Udoka Ukachukwu The trial judge accepted that the prosecutor proved the murder case beyond resonable doubt-Counsel to Mrs Enobong lsonguyo , Barr Olayiwola Afolabi, was dissatisfied by the verdict of the judge- Therefore , after legai consultatoon with his client, he got her approval to proceed on appeal- Behold, the court of appeal upheld the ruling of the high court in Benin-Olayiwola Afolabi was not detered by the setback because he was duobly confident he had a good case- Aferall, all the material ingredients of murder alleged against his client had not been fully proven by the prosecutor- Given this fact , it is trite law for the judge to err in freeing her than err in coñdenming her to death that ìs irreversibĺe-Furthrrmore, Olayiwola Afolabi reasoned that total empirical evidence is very critical in determining whether a murder suspect is guilty of the offence- Judges shouid not base their verdicts on absurd fiction , speculation and volatile imagination as it is now the case-According to him, such issues should not arise in law- They are unknown in Nigerian crimminal code-What is more?\nOlayiwola Afolabi discovered that a major pillar of the prosecutor’s case was legally puerile- His evidence linking Mrs Enobong Isonguyo to her husband’s death is the confessional statement of the co-accused Pastor Udoka Ukachukwu – Impliedly, there is no direct evidence associating her with the alleged crime- She was not at the scene of crime neither did the prosecutor provide concrete evidence of her conspiracy in the death of her husband-Based on all these assured lines of legal thought, Olayiwola Afolabi– after due approval of his client– proceeded to the Supreme Court- In a landmark judgment delivered by Justice Mary Odili in April 2022 she overturned the verdicts of both the lower court and court of appeal that sentenced Mrs Enobong Isonguyo to death- She ordered her to be released without any conditions, noting that the two courts miscarried justice in finding her guilty of murder- And, so, Mrs Enobong Isonguyo was saved from the gallows in strict adherence to the dikta of the crimminal còde while ignoring the whims and caprices of the uninformed, laymen in beer parlours-It is to effect the release of Mrs Enobong Isonguyo , in accordance with Justice Mary Odili’s directive, that took Olayiwola Afolabi to Oko Prisons, Benin on May 5, 2022 accompanied by his legal team and a corpus of journalists -After he emerged from the prison with Mrs Enobong Isonguyo, an elated Olayiwola Afolabi eulogized Justice Mary Odili for her fair, upright and monumental judgment which according to him demonstrates that “the judiciary is the last hope of the common man”-On her part, Mrs Enobong Isonguyo fought back tesrs of freedom- Then, she said– “I thank God and my lawyer for everything- I am now an ambassador of Christ-” As she spoke, a big bibie was positioned under her left armpit-Her co- accused Pastor Udoka Ukachukwu — founder of Land Of Evidence Church, Benin–escaped from Oko Prisons, Benin during the ENDSARS protesr in 2020 with his death sentence hanging on his head-The prosecutor in the murder trial in his investigative report tended in court alleged a steaming amorous affairs beteeen Mrs Enobong Isonguyo and Pastor Udoka Ukachukwu resulted in a disputed pregnancy complained about by her husband- Following this, Pastor Udoka Ukachukwu conspired with Mrs Enobong Isonguyo to get her husband out of the way- Thereafter, the pastor killed him while riding one night in the man’s Toyota Corolla car inside which the pastor also burnt him beyond recognition-Mrs Enobong Isonguyo denied any affairs with the pastor- She explained–“He has been very honest to us; so I don’t know what is happening—–God should intervene because I have never committed any crime before in my life- ”Olayiwola Afolabi recommends the landmark judgment of Justice Mary Odili to lawyers and law teachers/ students for use in updating their knowledge in legal jurisprudence on the murder case-Meanwhile, following victory at the Supreme Court in the murder case Olayiwola Afolabi inched his way to achieving the status of SAN- Also, he has shown that diligence , sacrifice, doggedness perseverance and emotive organic solidarity with a client are formidable foundations for building a succesful legal career- Lastly, by saving the life "
  },
  {
    "headline": "Obaseki hails military for support in tackling insecurity, setting up of operative base in Ehor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has lauded the Nigerian Army for setting up a forward operating base in Ehor, Uhunmwode Local Government Area of the state.\nObaseki gave the commendation while addressing the wife of Chief of Army Staff and President, Nigerian Army Officers’ Wives Association (NAOWA), Mrs. Salamatu Yahaya, who led other members of the association on a courtesy visit, at the Government House, Benin City.\nIt’s our people first because it’s people that create everything first; it’s people that create money, as well as technology, among others.\nIn the case of education, our focus is on the foundation, because once you have a sound foundation, that child can build on that foundation subsequently.\nThe Edo Basic Education Sector Transformation (EdoBEST) is acclaimed as one of the most transparent educational projects on the continent."
  },
  {
    "headline": "Edo urges submission of e-copy of documents to ease application for building plans, permits – Nigerian Observer",
    "summarized_story": "Edo urges submission of e-copy of documents to ease application for building plans, permitsShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has called for electronic submission of processing documents to the Ministry of Physical Planning, Urban and Regional Development to ease and fast track processing of building plans, permits and other approvals.\nCommissioner of Physical Planning, Urban and Regional Development, Isoken Omo, in a statement, said all documents submitted in support of applications for building permits and other approvals from the Ministry must be both hard and electronic copies.\nShe stated that the soft copies should be submitted in a flash drive.\nAccording to her, “This is in line with the state’s implementation of e-governance in service delivery procedures, which mandates electronic processing of documents.\n“The Ministry reiterates that its offices across the state are open for document processing as the Operation Plan Edo (OPE) intensifies and urges adherence to the new guidelines for speedy processing of approvals and permits.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo to screen pensioners in Diaspora via Skype from May 23 – Nigerian Observer",
    "summarized_story": "Edo to screen pensioners in Diaspora via Skype from May 23Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has announced the commencement of revalidation exercise for pensioners resident outside Nigeria.\nIn a statement, Permanent Secretary/Chairman, Edo State Pensions Bureau, Mrs. Aikefe O. Aigbavboa, said the revalidation exercise for pensioners residing outside Nigeria will be conducted virtually, via Skype.\nThe letter should be addressed to the Managing Director, ICT Agency and sent via email to: bvsonline.state@edostate.gov.ng.”“During the Skype screening, pensioners will be required to show their biometric slip and identity cards.\nFor the avoidance of doubt, screening via Skype is strictly for pensioners outside the country,” she added.\n“For further enquiries on the above, pensioners should kindly contact Daniel on 0706 421 4083 (WhatsApp),” she added."
  },
  {
    "headline": "Dalilin da ya sa Buhari ya dakatar da Akanta Janar ɗin da ake zargi da kantara satar naira biliyan 80",
    "summarized_story": ""
  },
  {
    "headline": "HAJJIN BANA: Duk wanda ya zarce shekaru 65 bashi ba Hajji bana – Hukumar Alhazai",
    "summarized_story": ""
  },
  {
    "headline": "Almajirai da mabarata sun kwararo Abuja – Mahukunta",
    "summarized_story": ""
  },
  {
    "headline": "HARƘALLAR KWANGILA: EFCC ta kama Patricia Etteh, tsohuwar Kakakin Majalisar Tarayya",
    "summarized_story": ""
  },
  {
    "headline": "Ƴan bindiga sun ƙona hedikwatar karamar hukumar Idemili ta Arewa a jihar Anambra",
    "summarized_story": ""
  },
  {
    "headline": "Nigerian booksellers hold conference, restate call for ‘long-overdue’ national book policy.",
    "summarized_story": "Nigerian booksellers under the aegis the Booksellers Association of Nigeria (BAN), have restated their call for speedy passage of national book policy, which they said is long overdue.\nThe booksellers made the call in a communique signed Dare Oluwatuyi, BAN president, and issued at the close of the 2022 Booksellers Conference held at Harbour Point Events Centre, Lagos, on Saturday, May 14.\n-Other stakeholders in the book trade and government should open up to more readily supporting and cooperating with booksellers in order to ensure a win-win scenario for all.\n-Booksellers in Nigeria, organised under the aegis of the Booksellers Association of Nigeria, BAN restate their total aversion to piracy and copyright violations and pledge to continue working with all other stakeholders in containing and combating the scourge.\nThey also undertake to continue to work with other stakeholders in correcting the existing distortions of the book chain and towards ensuring the speedy coming into effect of the long-overdue National Book Policy."
  },
  {
    "headline": "Iwobi’s Everton beats Crystal Palace to keep Premier League status",
    "summarized_story": "Premier league side, Everton, on Thursday night, defeated Crystal Palace by 3-2 to ensure premier league safety after an underwhelming campaign.\nWith the victory, the Liverpool based side which parades Nigerian international, Alex Iwobi, now has 39 points to place 16th on the log, above both Burnley, 17 and Leeds, 18, both of whom have 35 points each with one match to go.\nNorwich and Watford are already relegated, and would be joined by either Burnley or Leeds on the final weekend.\nEverton came into the final two matches of the season knowing one win would be enough, and despite going down 2-0 in the first half, the Toffees put together a comeback that will be remembered for years in club lore.\nGoals from Michael Keane, Richarlison and Calvert-Lewin ensured that the Frank Lampard coached side overcome the odds 3-2 to ensure safety."
  },
  {
    "headline": "BBNaija organizers give update on audition for season 7",
    "summarized_story": "Organizers of reality TV show, Big Brother Naija (BBNaija) have announced that auditions for for season 7 of the show, which began on May 15, is billed to end on May 30.\nThis is according to an announcement made by the organizers via their official Twitter page on Thursday.\nMeanwhile, the organizers announced June 2 as the date for BBNaija Season 6 ‘Shine Ya Eye’ reunion.\n“The Shine Ya Eye Lockdown reunion is back.\nAs usual, the reunion show willbe hosted by Ebuka Obi Uchendu, who will revisit some highlights and memorable moments from the 2021 season 6 edition won by WhiteMoney."
  },
  {
    "headline": "Father alleges neglect as Chidera Eze, 5-yr-old son dies during swimming lesson in Lagos",
    "summarized_story": "Some teachers and caregivers of the school took Chidera and his colleagues for the swimming lesson at the Ivory Health Club, Ogundana Street, Ikeja, during which he drowned.\nAnthony, while speaking to Punch on Wednesday, said the teachers, caregivers and lifeguards were not aware that his son had fallen into the pool until he drowned.\nI asked the teachers, caregivers and workers at the club what happened and they gave no explanation.\n“When we got there, we discovered that it was the adult swimming pool section that they took the pupils to.\nAll these happened and none of the teachers, caregivers, and lifeguards took notice of what was happening."
  },
  {
    "headline": "Beware, I’m not on Twitter – Obi Cubana warns",
    "summarized_story": "Socialite, Obi Iyiegbu, alias Obi Cubana, has said he doesn’t use Twitter, a microblogging platform and that accounts bearing his name on it should be disregarded.\nA Twitter user have been impersonating the 47-year-old entrepreneur on the microblogging application by using his name.\nIt is a fake tweeter account!!\nObi Cubana is not on tweeter.\nMeanwhile, the impersonator has now added “Parody” on his bio to indicate that he using the account as a parody account."
  },
  {
    "headline": "Employment Scam: Worker In Head Of Service Office Bags 7-year Jail Term",
    "summarized_story": "The Independent Corrupt Practices and other related offences Commission (ICPC) has secured a seven-year jail term for a public officer in the Office of the Head of Civil Service of the Federation, Amdii Monday Gideon, for his involvement in employment scam.\nICPC spokesperson, Azuka Ogugua, said in the case filed against Gideon by ICPC at the Federal Capital Territory (FCT) High Court 17 in Gwagwalada, the convict was accused of demanding the sum of N250,000 and receiving the sum of N162,500 from an applicant with the promise to procure a job for him at the Federal Civil Service Commission (FCSC).\nThe ICPC said the victim had reported the matter to ICPC after the convict failed to procure the said job and refused to refund his money.\nDuring the trial, counsel to ICPC, Michael Adesola, had in a 5-count charge told the court of how the action of the convict negates Sections 8 and 10 of the Corrupt Practices and Other Related Offences Act 2000 and Section 1 (3) of the Advanced Fee Fraud and Other Related Offences Act 2006.\nHe was, therefore, convicted and was sentenced to seven years imprisonment without an option of fine."
  },
  {
    "headline": "Ex-EFCC Chair, Magu, Not Free From Prosecution If Indicted",
    "summarized_story": "Minister of Police Affairs, Maigari Dingyadi, disclosed this to State House correspondents on Thursday during the weekly ministerial briefing organised by the presidential communication team at the Presidential Villa.\nThe Salami panel upon conclusion of its assignment had submitted its report in November of the same year to the President.\nBut what I know is that Mr. Magu has already retired and that is what I can tell you now.\nWhile noting that the demands of the ENDSARS protesters boiled down to police welfare, which the government has begun to implement, the minister disclosed that 25,000 constabularies have been trained for community policing.\nI want to tell you that they are unknown gunmen and they are also criminals."
  },
  {
    "headline": "No Civil Unrest On Abuja’s Airport Road – Police",
    "summarized_story": "The Nigeria Police Force has said that there was no civil unrest along the Lugbe Airport Road or any other part of Abuja on Thursday.\nThe clarification became necessary following fake videos circulating on the social media, showing some vehicles being attacked and claiming to have emanated from Lugbe.\nMaking the clarification, the FCT Police spokesperson, DSP Josephine Adeh, said the FCT Commissioner of Police, Babaji Sunday, personally visited Lugbe area of Abuja and there was no report of any violence or crime there.\nThe spokesperson said: “The attention of the commissioner of police, FCT police command, CP Babaji Sunday, has been drawn to a video making the rounds on social media platforms about an incident which is being credited to have happened in Lugbe, FCT Abuja.\n“The CP wishes to state categorically that there is no such incident in Lugbe as he is currently on patrol with operatives around the Lugbe-Airport Road axis."
  },
  {
    "headline": "No Civil Unrest On Abuja’s Airport Road – Police",
    "summarized_story": "The Nigeria Police Force has said that there was no civil unrest along the Lugbe Airport Road or any other part of Abuja on Thursday.\nThe clarification became necessary following fake videos circulating on the social media, showing some vehicles being attacked and claiming to have emanated from Lugbe.\nMaking the clarification, the FCT Police spokesperson, DSP Josephine Adeh, said the FCT Commissioner of Police, Babaji Sunday, personally visited Lugbe area of Abuja and there was no report of any violence or crime there.\nThe spokesperson said: “The attention of the commissioner of police, FCT police command, CP Babaji Sunday, has been drawn to a video making the rounds on social media platforms about an incident which is being credited to have happened in Lugbe, FCT Abuja.\n“The CP wishes to state categorically that there is no such incident in Lugbe as he is currently on patrol with operatives around the Lugbe-Airport Road axis."
  },
  {
    "headline": "Navy Confiscates 6m Litres Of Crude Oil, Arrests 20 Suspects",
    "summarized_story": "The Nigerian Navy (NN) said its troops conducting Operation ‘Dakatar Da Barawo’ (OPDDB) have seized over six million litres of crude oil and arrested 20 suspects in weeks five and six of the exercise.\nAyo-Vaughan, said the period between May 1-14, 2022 revealed the resort to armed resistance by the economic saboteurs.\nHe, however, said such development would not deter the Service from enforcing zero tolerance for economic sabotage and criminality in Nigeria’s maritime domain especially the backwaters.\n“Weeks 5 and 6 of OPDDB witnessed seizures and arrests of over 6 million litres of products and stolen crude oil including more than 20 suspects many of whom have been handed over for prosecution.\n“This development will not deter the Nigerian Navy from enforcing zero tolerance for economic sabotage and criminality in Nigeria’s Maritime Environment particularly at the backwaters,” the Naval spokesperson said."
  },
  {
    "headline": "Europe, U.S. panic over spread of monkeypox",
    "summarized_story": "Europe and the United States have raised alarm over the rising cases of monkeypox, a viral disease, which spreads through close contact and was first found in monkeys.\nBritain, Portugal, Spain and the United States have reported a handful of cases.\nNeither country has reported cases before.\nTRANSMISSIONThe virus spreads through close contact, both in spillovers from animals and, less commonly, between humans.\n“This isn’t going to cause a nationwide epidemic like COVID did, but it’s a serious outbreak of a serious disease – and we should take it seriously,” said Whitworth."
  },
  {
    "headline": "Sowore needs to graduate from “Students’ Union” mentality",
    "summarized_story": "Sowore was president of the University of Lagos Students’ Union (ULSU) in 1992.\nI often encourage students to take an interest in their Students’ Union activities.\nFor the records, I served the Great Ife Students’ Union as a two-time member of the Students’ Representative Council (SRC) and I know there were attempts to amend its Constitution.\nThose who served in this period know it was nearly impossible to include this clause in the sacrosanct Constitution of the Great Ife Students’ Union.\nTo know this, he needs to graduate from this students’ union mentality – and fast!"
  },
  {
    "headline": "Obasanjo: Nigeria needs leaders with a touch of madness",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria requires a leader driven by passion and madness to rule the country and put it on the right footing.\nHe lamented that the current situation in Nigeria is not only agonising for him, but for other Nigerians who also desire a better country.\nThe former President insisted that, Nigeria can overcome its security challenges within two years with the right leader who is willing to make tough decisions.\nObasanjo, therefore urged Nigerians to brace up and be ready to made sacrifices to put the country back on the right path.\nSo, Nigerians have to brace themselves up to do what needs to be done to put Nigeria back on the right path."
  },
  {
    "headline": "Kano Assembly member rejoins APC after losing tickets in NNPP",
    "summarized_story": "A member, representing Bagwai/Shanono Constituency, in the State House of Assembly, Ali Ibrahim Isah Shanono has deactivated his membership of the NNPP and rejoined the All Progressives Congress APC, after failing to obtain a ticket.\nShanono had in the wake of the mass defections from APC in Kano, also defected to NNPP hoping to have a chance to re-contest his House of Assembly seat but was denied a ticket by Kwankwaso.\nAngered by the development he deactivated his NNPP membership and rejoined APC in a letter sent to the House, notifying it of the development."
  },
  {
    "headline": "JUST IN: Cancel planned crusade in South-East, IPOB tells Kumuyi",
    "summarized_story": "In a statement on Thursday, the group’s Media and Publicity Secretary, Emma Powerful, cautioned Kumuyi to take note of the security situation in the South-East as he comes to Aba for his gospel crusade.\nPowerful said, “Let him and the organisers of the crusade make sure that nothing happens.\nThe security of this region is not good because of political and criminal activities, therefore we advise him to stop this crusade for security reasons.\n“IPOB will not allow anyone to die because of this crusade scheduled to hold in Aba.\nThe operation of criminals operating as unknown gunmen infiltrating the events is high and they will blame it on IPOB."
  },
  {
    "headline": "JUST IN: Again, Another Top Ganduje’s Commissioner Resigns, Joins NNPP",
    "summarized_story": "Kura has subsequently defected to the the New Nigeria Peoples Party (NNPP).\nThe State’s Commissioner for Information, Malam Muhammad Garba, disclosed this in a statement sent to journalists in Kano on Thursday.\nKura’s resignation from Ganduje cabinet comes on the heels of the resignation of the governor’s Chief of Staff, Ali Haruna Makoda, who subsequently defected to the NNPP led by a former governor of the State, Senator Rabiu Musa Kwankwaso.\nAccording to Garba, Kura was appointed as Commissioner into the Ministry of Finance at the request of a former governor of the State, Senator Ibrahim Shekarau, after the 2019 elections.\nThe statement reads, “One of the commissioners nominated for appointment by Senator Ibrahim Shekarau into the administration of Governor Abdullahi Umar Ganduje in the lucrative Ministry of Finance and Economic Development, Shehu Na’Allah Kura has resigned and joined his boss.”The commissioner added that until the recent defection of Shekarau to NNPP, Kura was a member of the All Progressives Congress (APC) and had previously served as Commissioner of Planning and Budget."
  },
  {
    "headline": "Supporting schools with FirstEdu Loan, FirstEdu Portal",
    "summarized_story": "First Bank of Nigeria Limited has developed different products that support schools operating in Nigeria.\nFirst Bank supports for schoolsFirstBank of Nigeria Limited, Nigeria’s most valuable banking brand, has been on the frontline supporting schools with educational products and solutions to boost the sector.\nThe product tagged FirstEdu comprises of the FirstEdu Loan and FirstEdu Portal.\nFirstBank FirstEdu loanApart from government providing funds to support education industry, the FirstBank’s FirstEdu loan offers short-term finance to private pre-primary, primary and secondary schools/A level educational institutions.\nThe loan is targeted at all private schools duly registered with CAC with 90 days to 12 months tenor."
  },
  {
    "headline": "[Breaking] Electoral Act: FCT Minister suspends inauguration of newly elected area council chairmen, councillors",
    "summarized_story": "The Minister of the Federal Capital Territory, Mallam Musa Bello Muhammad, has announced the suspension of scheduled inauguration of newly elected chairmen and councillors of the six area council.\nPart of the statement reads, “As you are all aware, in March of 2019, we held the Area Council elections in the Federal Capital Territory, whereby Six Council Chairmen and their Councillors were elected after a very competitive and rigorous process.\n“These six Council Chairmen of the FCT were then inaugurated on the 20th of May 2019, under the 2010 Electoral Act.\nBased on that Act, the tenure of the Chairmen would end today and the new Chairmen, based on the elections held in February this year, would be sworn in on 20th May 2022.\n“In the interim therefore, we are very conscious of the fact that the stand of the court has raised a lot of concerns within certain sections of the Federal Capital Territory residents."
  },
  {
    "headline": "Minister orders closure of Abuja ‘s Dei-Dei market, reveals real cause of violence",
    "summarized_story": "Minister of the Federal Capital Territory Administration (FCTA), Mallam Muhammad Musa Bello, has revealed that the violence that erupted at one of Abuja’s popular markets in Dei-Dei was not triggered by religion or ethnicity, but criminal elements.\nMallam Bello who spoke Wednesday evening when he visited the market to ascertain the cause and extent of the violence which claimed four lives and resulted in the razing of shops and vehicles within the market.\nHe said, “What I told the community leaders is that they have to fish out the hoodlums and the bad eggs amongst them.\nThis is because this time around, hoodlums carried arms and they shot innocent people.\nAll the leadership of the various stakeholders have lived here in peace for many, many years."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Gbemi Saraki Takes Charge As Amaechi Bows Out As Transport Minister",
    "summarized_story": "By Naomi DouglasMinister of State for Transport, Senator Gbemi Saraki, has now taken full charge of the Ministry of Transport, follwoing the formal resignation of Frontline presidential aspirant on the platform of All Progressives Congress APC, Chibuike Rotimi Amaechi, yesterday.\nIn a statement issued by Amaechi Presidential Media Committee, APMC, in Abuja yesterday, Amaechi in his resignation letter, expressed profound gratitude to the President for considering him fit to serve in his administration.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\n“Your Excellency, whilst humbly seeking your kind consideration of my request please accept the assurances of my highest esteem.”"
  },
  {
    "headline": "Delta-2 Progrmme: Nigeria , Czech Republic Flags off $16.2 million Bilateral Co-funding",
    "summarized_story": "By Eunice OrikeAs part of economic diversification priority of the present administration, the Federal Government and Czech Republic has launched a Call for Public Proposals on Delta-2 Programme worth $16.2 million Co-funding Research and Development R&D,project.\nThe Delta-2 Programme is the cooperation model of the Technology Agency of Czech Republic TA CR, running for the period from 2020-2025, through which TA CR sponsors applied research and innovation of manufacturing companies and innovative institutions.\nProf. Mohammed Sani Haruna said the Call for Public Proposal for the Delta-2 programme is one of the projects to be implemented under the Agreement between the two countries.\n“The PICTT would be sourcing technologies from the Czech Republic’s manufacturing companies; tertiary; research; and development institutions.\nThe Delta-2 Programme is uniquely designed to catalyze technology transfer and mobilize positive interventions and investments among private sectors and relevant stakeholders in Nigeria and Czech Republic for technology advancement."
  },
  {
    "headline": "Naira in free fall, now N600 to $1",
    "summarized_story": "By Our CorrespondentThe free fall of our national currency the Naira against major currencies continued yesterday as it weakened against the United States of America dollar to trade at N600 at the parallel market.\nThis non-stop depreciation of the Naira, which incidentally has been officially devalued thrice under this administration, is a pointer that the fiscal policies are not responding to market trends.\nAbubakar, a BDC operator in Ikorodu, told an online medium that buying and selling prices stood at N595 and N600 per dollar.\nA parallel market (street/black market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira."
  },
  {
    "headline": "Oil price hits $115 a barrel, highest in seven weeks",
    "summarized_story": "Oil prices rose on Tuesday amid an ongoing push by the European Union for the Russian oil imports ban.\nBrent crude climbed 1.04 per cent to $115.29 a barrel on Tuesday — the highest since March 28.\nOn Monday, EU foreign ministers failed in their effort to pressure Hungary to sign up to a proposed embargo on Russian oil.\nJeffrey Halley, analyst at brokerage OANDA, said: “Oil prices have remained near multi-week highs this week, supported by surging gasoline and distillate prices in the U.S., and fears around an EU ban on Russian oil imports remaining in play”.\nHigh oil prices, among other underlying factors, continue to affect Nigeria’s deregulated oil market."
  },
  {
    "headline": "I Have No Apology For Being ‘Mad About Nigeria’ – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo on Thursday said he is “mad” about Nigeria and he has no apology for being passionate about Africa’s most populous nation.\n“Passion means madness; that you are mad about Nigeria.\nI am and I have no apology for that because I have no other country I can call my own,” Obasanjo said.\nOn insecurity, Obasanjo maintained that Nigeria can overcome its numerous challenges with the right leader who would be willing to make tough decisions.\nSo, Nigerians have to brace themselves up to do what needs to be done to put Nigeria back on the right path."
  },
  {
    "headline": "El-Rufai Raises Alarm Over Presence Of Boko Haram, ISWAP In Kaduna",
    "summarized_story": "The Kaduna State Government has raised an alarm about the activities of terrorist groups in the State.\nGovernor Nasir El-Rufai expressed concern that the terrorists are moving from the North-East to the North-West with the intention of causing havoc.\nHe added that those who attacked the Abuja-Kaduna-bound train were Boko Haram terrorists.\nThe Governor is also worried that the conduct of the 2023 general elections might be compromised in Kaduna state if the security challenges are not addressed.\nMeanwhile, Aruwan said no fewer than 360 people have been killed by suspected terrorists in different parts of Kaduna State from January to April."
  },
  {
    "headline": "Supreme Court Joins Rivers In Buhari’s Suit Against Section 84 (12) Of Electoral Act",
    "summarized_story": "The Supreme Court has granted Rivers State’s request to join in President Muhammadu Buhari’s suit against Section 84 (12) of the Electoral Act.\nThe Supreme Court fixed the date after joining Rivers State as an interested party.\nIn the suit filed on April 29, the President and AGF, who are the plaintiffs, listed the National Assembly as the sole defendant.\nThey are seeking an order of the apex court to strike out the section of the Electoral Act, saying it is inconsistent with the nation’s Constitution.\nThey argued that the 1999 Constitution, as amended gave the National Assembly the power to make laws for good governance in Nigeria."
  },
  {
    "headline": "Delivery Riders, Power Bikes Not Affected By Okada Ban – Police Commissioner",
    "summarized_story": "﻿Lagos State Police Commissioner, Abiodun Alabi, on Thursday clarified that residents who operate motorcycles for courier services or other private dealings will not be affected the latest okada ban.\nThe state government had announced restrictions on motorcycles, popularly known as okada, from operating in six local government areas of the state.\nThis is not the first time the activities of okada riders have been restricted in Lagos.\nHe said most okada riders are criminals and must be taken off the road.\n“We know that banning the Okada riders can actually increase crime rate."
  },
  {
    "headline": "Buhari Arrives In Abu Dhabi, To Meet New President",
    "summarized_story": "President Muhammadu Buhari has arrived in Abu Dhabi, the United Arab Emirates to meet with the country’s new President, His Highness Sheikh Mohamed bin Zayed Al Nahyan.\nIn the Arab nation, Buhari will convey his condolences on the passing of the ex-President and ruler of Abu Dhabi, His Highness, Sheikh Khalifa bin Zayed Al Nahyan.\nPresidential spokesman, Mallam Garba Shehu said that President Buhari is also expected to extend congratulations to the new President, renewing bonds of the longstanding friendship between Nigeria and the UAE.\n“Under the new leadership, President Buhari looks forward to a bigger and stronger partnership for peace, stability, and prosperity of both countries,” Shehu stated.\nOthers included the National Security Adviser, Major-General Mohammed Monguno (retd), and the Director-General, National Intelligence Agency, Ambassador Ahmed Rufai Abubakar."
  },
  {
    "headline": "39-year-old Tinok Andrew-Nok joins Kaduna South Senatorial race -",
    "summarized_story": "More women in Northern Nigeria are indicating interest to contest for political positions in the coming general elections.\nAmong them is 39 Year-old Tinok Andrew-Nok, a Public Health expert, who has presented herself to contest for the Senatorial seat of Kaduna South zone, under the platform of the New Nigerians People’s Party (NNPP)The Southern Kaduna region has been a soft target for banditry, ethnic and religious conflicts and others forms of insecurity.\nMrs Tinok is of the belief that bad leadership has left the zone in this deplorable state.\nShe has promised she will work to see peace, stability and development return to the region if elected.\nAlthough Northwest Nigeria has 7 states,186 local councils and at least 2004 wards, only one woman has managed to emerge as a lawmaker at both State and Federal levels in the last 8 years."
  },
  {
    "headline": "Court affirms Sadiq Achida as Sokoto APC chairman",
    "summarized_story": "Federal High Court sitting in Sokoto has affirmed Sadiq Achida as the duly elected chairman of the All Progressives Congress APC in Sokoto state.\nThe chairmanship of the party in Sokoto state has been a subject of ligation between Sadiq Achida and Mainasara Abubakar since the party held a parallel state Congress at different venues in the stateIt would be recalled that the Association of the Sokoto State All Progressive Congress, APC Chairmen had earlier reaffirmed that Sodiq Isah Achida remained the duly elected State Chairman.\nSenator Aliyu Wamakko was also elected the leader of All Progressive Congress, Sokoto State chapter.\nAlaru said; ”We the Association of 23 elected Local Government Chairmen of the party in Sokoto State have reaffirmed the leadership of Isah Achida as Chairman APC and Senator Aliyu Wamakko as only leader of the Party in Sokoto… This comes after our election on the 4th of September, 2021 and we believe we are true representative of APC and it’s Supporters in our local government areas.”On behalf of the Association, Alaru further appealed to National Caretaker and Extra Ordinary Convention Planning Committee of APC under the leadership of the Yobe State Governor, Maimala Buni to recognise Isah Achida’s led State Executives and put all the necessary mechanism for their inauguration.\nHe urged the Minister of Justice and Attorney General of the Federation, Abubakar Malami, to stay away from all activities of APC in Sokoto State."
  },
  {
    "headline": "APC adjusts schedule of activities for 2023 primary elections",
    "summarized_story": "The National Working Committee (NWC) of the All Progressives Congress (APC) on Wednesday approved an adjusted Timetable/Schedule of Activities for the party’s primary elections.\nThis is contained in a statement issued on Wednesday by the party’s spokesman, Felix Morka.\nThe adjusted schedule of activities affects the Governorship, State House of Assembly, House of Representatives, Senate and Presidential Primaries and Appeals.\nAccording to the adjusted schedule, the following is the new new order of activities:PRIMARY ELECTIONGovernorship and House of Representatives – Thursday, 26th of May, 2022Senate and House of Assembly – Friday, 27th of May, 2022ELECTION APPEALSGovernorship and House of Representatives – Friday, 27th of May, 2022Senate and House of Assembly – Saturday, 28th of May, 2022SPECIAL CONVENTION FOR PRESIDENTIAL PRIMARIES: Sunday 29th – Monday, 30th of May, 2022"
  },
  {
    "headline": "APC Screen 28 House Of Assembly Aspirants In Zamfara -",
    "summarized_story": "The All Progressive Congress APC has screened twenty eight aspirants of the State House of Assembly in ZamfaraThe Seven Man Screening Committee Delegated by the Party’s National Headquarters led by Babagana Tijjani Banki Described the exercise as a Successhttps://www.tvcnews.tv/purplegold/post-new.php#Addressing Newsmen shortly after the screening exercise, the Committee Chairman Commend the aspirants and the state Party Officials for the support they enjoyed before and during the screeningHe said the exercise was smooth and well coordinatedhttps://www.tvcnews.tv/purplegold/post-new.php#Babagana adds that the Committee will Continue it’s work internally and assures of fairness to all aspirantsThe Committee according to him will submit its report to the National Headquarters of the party at the end of it’s workOne of the Aspirants who is the current Speaker of the state House of Assembly Mu’azu Magarya, Commend the party for delegating Competent hands to handle the screening exerciseMu’azu Magarya said all the aspirants are satisfied with the conduct of the Screening exercise and are sure of fairness from the CommitteeHe also expressed optimism that the APC in Zamfara will win all Political Seats in the forth coming General Elections, as the party is now united and more formidableA development he said will translate to the Peace, Unity and progress of Zamfara and Nigeria at LargeThe aspirants include the Current Speaker, Zamfara State House of Assembly Nasiru Mu’azu Magarya, His Deputy Musa Bawa Yankuzo, Chairman House Committee on Information Shamsuddeen Bosko, Nasiru Bello Lawal and a few Serving Members among othersZamfara State House of Assembly has Twenty four seats across the fourteen Local Government area of the stateThe All Progressive Congress Headquarters had announced Wednesday 18th for the screening of State Assembly aspirants across the country.\nZamfara is one of the states that has conducted it’s Screening exercise peacefully with all aspirants fully Happy with the exercise and optimistic of Justice and fairness from the Seven Man Screening Committee."
  },
  {
    "headline": "Sanwo-Olu Bans Commercial Motorcyclist Again+Greenfield Students’ Killers Arrested-Trending With Ojy Okpe",
    "summarized_story": "Following a nation-wide condemnation over the gruesome murder of David Imoh a sound engineer by motorcyclists in the Lekki Area of lagos state, Babajide Sanwo Olu, the lagos state governor announced a total ban on the operations of commercial motorcycles in six Local government areas of the state.\nAminu Lawal a suspect in the April 2021 kidnaping of the Students from the Greenfield University in Kaduna State on Wednesday, narrated how he and his gang members kidnapped, raped and killed the students.\nIn another development, violence broke out in Abuja on Wednesday as a result of a clash between traders and commercial motorcyclists in the Dei Dei community of the nations capital."
  },
  {
    "headline": "Nigeria’s Presidency Not For Moneybags, Governors’ Chairman Fayemi Tells Kaduna Delegates",
    "summarized_story": "Ekiti state Governor and Presidential aspirant of the All Progressives Congress (APC), Kayode Fayemi, has said that Nigeria’s presidency is not for the money bags.\nFayemi, who is also the chairman of the Nigerian Governors Forum, stated this on Thursday while soliciting the support of Kaduna delegates for the forthcoming APC Presidential primaries.\n“Kaduna state is one of the major food baskets in the country.\nHe urged the delegates to critically assess the aspirants and their vision, temperament, capacity, competence and the courage to do the right thing.\nIn his remarks, the Kaduna state governor, Mallam Nasir El-Rufai, described Fayemi as a man of great patience whom he has known for over 20 years."
  },
  {
    "headline": "Turkey’s Erdogan Digs in Over NATO Expansion as Biden Hosts Finnish, Swedish Leaders",
    "summarized_story": "U.S. President Joe Biden hosted Swedish Prime Minister Magdalena Andersson and Finnish President Sauli Niinistö, a chance for Washington to demonstrate that Russia’s invasion has backfired, bringing about the very expansion of NATO that Moscow has said it was fighting to halt.\nWe have told allies that we will say no to Finland and Sweden’s NATO membership,” Erdogan said in an interview with students late on Wednesday.\nUkrainian officials say they cannot comment publicly on the fate of the fighters while negotiations are under way to rescue them.\nRussian forces “suffered significant losses” around Slovyansk to the north of Donetsk.\nIn Russia, the regional governor of the Kursk border region accused Ukrainian forces of shelling a border village, killing at least one civilian."
  },
  {
    "headline": "Taliban Say Female Afghan TV Presenters Must Cover Faces on Air",
    "summarized_story": "The Taliban have ordered female Afghan TV presenters and other women on screen to cover their faces while on air.\nMedia outlets were told of the decree on Wednesday, a religious police spokesman told BBC Pashto.\n“They are putting indirect pressure on us to stop us presenting on TV,” she told the BBC.\nFor the Taliban, women are a disease,” one activist tweeted.\nDuring their first stint in power in the 1990s the Taliban forced women to wear the all-encompassing burka in public."
  },
  {
    "headline": "Nigeria President Buhari Leads 7-Man Team to Visit New UAE President In Abu Dhabi",
    "summarized_story": "Nigeria’s President Muhammadu Buhari is leading a seven-man team to meet with the new President of the United Arab Emirates (UAE), His Highness Sheikh Mohamed bin Zayed Al Nahyan, in Abu Dhabi, to discuss the need to sustain existing cordial relationship between Nigeria and UAE.\nPresident Buhari, according to a release issued by his spokesman, Mallam Garba Shehu, will also extend his congratulations to the new President, renewing bonds of the longstanding friendship between Nigeria and the UAE.\nUnder the new leadership, the President looks forward to a bigger and stronger partnership for peace, stability and prosperity of both countries.\nPresident Buhari, in an earlier congratulatory message to the new UAE leader, had reaffirmed Nigeria’s cordial relationship with the country, noting that the cooperation between both governments have helped Nigeria in tracking down illegal assets and tracing terrorist funds.\nPresident Buhari is expected back in the country on Saturday."
  }
]