[
  {
    "headline": "BREAKING: Buhari nominates new ministers, sends list to Senate",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has nominated seven persons for screening and confirmation by the Senate for appointment as Ministers.\nSenate President Ahmad Lawan read Buhari’s letter of request on the floor of the Senate, in Abuja, on Tuesday.\nIn the letter read by Lawan, the president said the nominees would replace the former ministers that resigned from his cabinet.\nThe letter read in part, “In accordance with Section 8 Subsection 2 of the Constitution of the Federal Republic of Nigeria as amended, I hereby forward the underlisted ministerial nominees for your confirmation."
  },
  {
    "headline": "Senator Aduda replaces Abaribe as Senate Minority Leader",
    "summarized_story": "By Henry Umoru – AbujaSenator Philip Aduda, Peoples Democratic Party, PDP, Federal Capital Territory, FCT has been announced as the Senate Minority leader, thereby replacing the immediate past Minority Leader, Senator Enyinnaya Abaribe, Abia South.\nThe Senate also announced Senator Chukwuka Utazi, PDP, Enugu North as the Senate Minority Whip, thereby replacing Senator Aduda.\nThe letter is titled “Confirmation of the Senate Caucus Nomination of Sen. Philip Aduda as Senate Minority Leader.”The letter read, “leadership of the PDP is pleased to confirm to you the nomination of Sen. Aduda as the new Senate Minority Leader.\n“The nomination of Aduda is for the replacement of the vacant seat of the minority leader created by the defection of Abaribe to the APGA.\n“The nomination of Utazi for the replacement of the vacancy to the minority whip followed the elevation of Aduda to the Senate minority Leader.”Lawan, thereafter congratulated the duo on the nomination."
  },
  {
    "headline": "World Refugee Day: Nigeria has over 80,000 refugees, hosts 3.2M IDPs— UN",
    "summarized_story": "By Victoria Ojeme, ABUJATHE United Nations High Commission for Refugees, UNHCR, has said that Nigeria presently hosts 3.2 million displaced persons, including some 82,000 refugees , representing a 9 per cent increase from last year.\nThis was contained in a UNHCR World Refugee Statement, signed by Ms. Chansa Kapaya UNHCR Representative Nigeria, June 20, 2022.\nIt, however, revealed that In Nigeria, displacement has been growing rapidly since 2018, with 500,700 people newly displaced during 2021.\nKapaya further noted that Nigeria also hosts an additional 6,900 refugees and asylum seekers from other countries.\n“Nigeria currently has 3.2 million Internally displaced persons and 84,000 refugees."
  },
  {
    "headline": "Coalition blames FG on poor SSB tax implementation",
    "summarized_story": "Calls for extra effort on implementation of SSB TaxBy Ezra Ukanwa – AbujaCivil Society Organisations, CSOs, including National Action on Sugar Reduction, NASR; Diabetes Association of Nigeria; among eleven others, on Monday, blamed the Federal Government on poor implementation of tax on Sugar-sweetened beverages in Nigeria.\nRecall that the Minister of Finance recently announced a tax on sugar-sweetened beverages, saying that an excise tax of N10 per litre will now be imposed on non-alcoholic, carbonated and sweetened beverages.\nThe federal government failed to commence implementation of its tax on non-alcoholic, carbonated drinks and sweetened beverages, signaling a flop in the government’s revenue drive, on June 1, 2022.\nPeople think that the sugar tax is trying to impoverish them and add to inflation.”Enyia, however, explained that the tax is meant to ease the suffering of people living with diabetes.\nThe coalition applauded the swift action of the Nigeria Customs Service for takinginitiative towards enforcing the tax by reaching out to the beverage industries to beginthe implementation of the SSB Tax."
  },
  {
    "headline": "NSCDC arrests Vigilante for defiling 13 year old girl in Nasarawa",
    "summarized_story": "By David OdamaA 45 years old vigilante official, Yusuf Dallah has been arrested by the Nasarawa State Command of the Nigeria Security and Civil Defense Corps for allegedly defiling a 13 year old girl Ummi in the state.\nParading the suspect, the public Relations Officer of the NSCDC, Jerry Victor told journalists that the minor, Ummulkhulthum Musa who was suspected to have stolen some wrappers, was apprehended and taken to Vigilante office, Jos road in Lafia.\nThe NSCDC spokesman stated that Ummulkhulthum Musa was allegedly taken to somewhere at the outskirt of Lafia town where Yusuf Dallah took advantage of her.\n“The suspect Yusuf Dallah was arrested and brought to our office for interogation and investigation on the matter when the victim reported the matter to her elder brother who later informed the NSCDC which swung into action that led to the arrest of the suspect.\nWhen interviewed, the suspect, Yusuf Dallah denied committing the alleged offence and said investigations will set him free while the victim Ummulkhulthum Musa insisted that she was raped by the suspect."
  },
  {
    "headline": "Hajj: Batch of Nigerian pilgrims arrive Madinah; Bauchi, Sokoto, Kaduna expected today",
    "summarized_story": "Bauchi , Sokoto, Kaduna to arrive Madinah todayBy Kemi BalogunAnother set of pilgrims from Lagos numbering 400 were airlifted from Murtala Muhammad International Airport to Madinah on Tuesday.\nThe AZMAN flight AZM2362 which departed Lagos to Madinah at 20:31hrs, arrived Madinah 2:40am.\nAt the moment, over 9000 pilgrims have been transported to the holy land in 20 flights.\nAgain, MAXAIR flight VM3015 departed Bauchi to Madinah via Kano at 04:31hrs with 545 Bauchi pilgrims and 10 Officials..\nToday Kaduna will launch its first flight to the holy land."
  },
  {
    "headline": "Tinubu reels out three key attributes of Pastor Osagie Ize-Iyamu",
    "summarized_story": "All Progressives Congress (APC) National Leader and 2023 Presidential candidate, Bola Ahmed Tinubu, on Tuesday, identified three key attributes of Pastor Osagie Ize-Iyamu.\nTinubu said Ize-Iyamu, the APC candidate for the 2020 governorship election in Edo State, is a true progressive, grassroots politician and a formidable leader of men.\nTinubu said: “Today, I join his family, friends and associates to congratulate Pastor Osagie Ize-Iyamu as he attains 60 on Tuesday, June 21st, 2022.\n“He has made important contributions to Edo State and Nigeria as he has done to our party, the All Progressives Congress.\n“I congratulate Pastor Ize-Iyamu on his accomplishments at 60."
  },
  {
    "headline": "BREAKING: Motion seeking to override Buhari on Section 84(8) rejected at plenary",
    "summarized_story": "The House of Representatives has rejected a motion seeking to cause the National Assembly to override President Muhammadu Buhari’s veto on the amendment made to Section 84(8) of the Electoral Act 2022.\nThe House at plenary presided over by the Deputy Speaker, Ahmed Idris Wase, directed the mover of the motion, Hon.\nBen Igbakpa, from Delta State to “follow proper procedure.”Recall that the honourable members, shortly after the primary elections, had criticised the amended Section 84(8) of the Electoral Act 2022 after most of them failed to clinch tickets to enable them to return to the House in the next political dispensation.\nThe development had made most of the legislators angry, prompting some of them to mull overriding the President."
  },
  {
    "headline": "Ganduje title: Olubadan replies Sunday Igboho",
    "summarized_story": "The Olubadan of Ibadanland, Oba Lekan Balogun, has replied Sunday Adeyemo a.k.a.\nSunday Igboho over his position on Governor Abdullahi Ganduje’s title.\nIgboho had condemned the monarch for conferring chieftaincy titles on the Kano helmsman and his wife, Hafsat.\nHe noted that the Olubadan is too refined to be seeking who to honour with chieftaincy title for whatever purpose.\n“If and when the Yoruba nation project comes to be, are we saying there won’t be interaction between the Yoruba people and others in the country again?” it asked."
  },
  {
    "headline": "BREAKING: Insecurity: Archbishop Chukwuma calls for revolution, Buhari’s resignation",
    "summarized_story": "Emmanuel Chukwuma has warned that a revolution is coming to chase away those holding the country down.\nWhile noting that the church is very much concerned about the state of the nation, Chukwuma said, “Nigerians should prepare for a revolution, enough is enough.\n“This is because of the security situation in Nigeria; kidnappings and killings have become the order of the day.\n“The church is not happy, the church is angry, the church is crying for a revolution, for a new Nigeria.\nArchbishop Chukwuma also stated that the case involving the Accountant General of the Federation was a serious dent on President Buhari’s anti-corruption stance."
  },
  {
    "headline": "We didn’t sign to impeach Kogi Speaker – Lawmakers fume",
    "summarized_story": "Lawmakers in the Kogi State House of Assembly have distanced themselves from the signatures collected to impeach the Speaker, Rt Hon.\nMathew Kolawole.\nThe position of the lawmakers is coming a few days after the suspended former Deputy Speaker, Hon.\nReacting to the lawmakers’ comments, the Speaker, Prince Mathew Kolawole, said the suspended lawmakers have violated the house rule and will be investigated by the committee on ethics and privileges.\n“The Chairman of this committee should write to these suspended lawmakers."
  },
  {
    "headline": "Don't privatise Ajaokuta Steel, CSO tells Buhari The Nation Newspaper",
    "summarized_story": "The organisation noted that the Ajaokuta steel company was too vital to be concessioned to strangers.\nThe Federal Government had in April approved the engagement of transaction advisors for consultancy services for the concessioning of Ajaokuta Steel Company Limited.\nHe said: “We have been hearing about the so-called concessioning of the Ajaokuta Steel Mill.\nPermit me to use this opportunity to appeal to President Buhari to please reconsider and put this move on hold in the interest of the nation.\nAjaokuta Steel is too vital and interesting to be concessioned to strangers."
  },
  {
    "headline": "Nasarawa PDP flag-bearer picks running-mate The Nation Newspaper",
    "summarized_story": "Peoples Democratic Party (PDP) governorship candidate in Nasarawa State David Umbugadu has announced Yahaya Usman Ohinohyi as his running mate.\nOhinohyi is a two-term former member of Nasarawa State House of Assembly representing the Umesha/Ugya State Constituency of Toto Local Government Area of the state.\nThe governorship candidate said all the stakeholders were involved in the consultations that arrived at Yahaya Usman Ohinohyi from the western part of the state.\nUmbugadu, who is a two-term former member of the House of Representatives, said he is in the governorship race of the state purely on his records as a member of the House of Representatives.\nAccepting his nomination, the deputy governorship candidate Yahaya Usman Ohinohyi said he will support the candidate and the party to defeat the ruling party."
  },
  {
    "headline": "Lawan contested Yobe North primary, says Adamu The Nation Newspaper",
    "summarized_story": "All Progressives Congress (APC) National Chairman, Senator Abdullahi Adamu, yesterday said Senate President Ahmad Lawan participated in Yobe North Senatorial Primary.\nAbdullahi spoke when he led party members to present the Ekiti State governor-elect, Biodun Oyebanji, to President Muhammadu Buhari.\nLawan was one of the 23 APC presidential aspirants who contested on June 8.\nBashir Machina had claimed to be the authentic senatorial candidate for the senatorial district.\nRead Also: Lawan denies defection to PDPAsked how Lawan emerged senatorial candidate, Adamu said: “Don’t get yourself in the court of law."
  },
  {
    "headline": "Petrol marketers increase pump price amid scarcity The Nation Newspaper",
    "summarized_story": "Nigerians are now paying more for petrol despite the official price still fixed at N162.50 and N165 per litre.\nIndependent marketers, who started implementing a new price regime of between N170 to N190 at the weekend, insisted yesterday that it would be difficult for them to sell at the official pump price.\nIn Lagos yesterday, many independent stations were shut, the few that were dispensing recorded long queues.\nHe said the government fixed pump price at N165 per litre even when current realities showed that the minimum price should be N180.\nThis is a common situation with Muhammad, who has always been evasive in responding to media inquiries about petrol scarcity."
  },
  {
    "headline": "Abdulsalami stable in UK, says Presidency The Nation Newspaper",
    "summarized_story": "The Presidency yesterday allayed fears on the health of former Head of State Gen. Abdulsalami Abubakar.\nBut the Presidency said the one-time leader was stable and recuperating in a private apartment in the UK after treatment.\nGen. Abdulsalami, 80, was head of state between 1998 and 1999 when he handed over power to President Olusegun Obasanjo.\nRead Also: Abdulsalami Abubakar at 80The tweets: “Alhamdu Lillahi for Allah’s mercy.\nI just ended a visit to His Excellency Abdulsalami Abubakar, former Head of State."
  },
  {
    "headline": "Uzodinma puts stranded father of triplets on payroll",
    "summarized_story": "Hope Uzodimma to pay a stranded father of triplets, Mr Chinegbomkpa Onuoha, N100,000 monthly for one year.\nIbeh made the disclosure when he visited the family of the triplets at Owugha Alike Community in Obowo Local Government Area of the state.\nHope Uzodimma to the family of the triplets.\nHope Uzodimma, and he has assured that Imo government, under his leadership, will continue to deliver good governance,” he said.\nThe speaker who delivered to the family, N100,000 for the month of June, also assured Obowo people of quality and selfless representation."
  },
  {
    "headline": "Police confirm release of abducted former NFF scribe Toro, others",
    "summarized_story": "From Paul Orude, BauchiKidnapped former Secretary General of the defunct Nigeria Football Association (NFA) now Nigeria Football Federation (NFF), Sani Ahmed Toro has been released.\nPolice confirmed Toro was released alongside two others who were kidnapped in Nassarawa State.\nThe trio, Sani Ahmed Toro, Garba Ila and Isa Jaa were said to be at an undisclosed health facility receiving treatment.\nThe release was confirmed by the Bauchi state Police Command through the PPRO, SP Ahmed Wakili.\nThe Village Head and his son were abducted at gunpoint by unidentified gunmen who later demanded for an undisclosed amount of money as ransom."
  },
  {
    "headline": "Just in: Resident doctors at OAUTH embark on two day warning strike",
    "summarized_story": "The Association of Resident Doctors at Obafemi Awolowo University Teaching Hospital, Ile-Ife, on Tuesday, embarked on a two-day warning strike over an alleged assault on one of them by a nurse.\nThe resident doctors said the warning strike would commence from 8 am Tuesday, June 21, 2022, to 7:59 am on Thursday, June 23, 2022.\n“The female house officer had gone to the said ward with her team which comprised different cadres of doctors, to carry out a procedure on the only patient in the ward at that time.\n“The team on arrival at 4:30 pm informed the nurse on duty.\n“After obtaining the patient’s consent, they requested a trolley from the nurse who pointed the trolley to them and told them to get it."
  },
  {
    "headline": "BREAKING: Former NFF Secretary, Toro regains freedom",
    "summarized_story": "Former Nigerian Football Federation (NFF) Secretary, Alhaji Sani Toro has been freed days after being kidnapped by hoodlums on his way to Bauchi from Abuja.\nThe cheering news was relayed to the media by a family source who said the former Bauchi State Commissioner of Sports was released late last night.\nIt however could not be confirmed if any ransom was paid before his release.\nDetails soon…Partner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Gunmen bomb Imo market, scores injured, vehicles burnt",
    "summarized_story": "From Stanley Uzoaru, OwerriGunmen enforcing the sit-at-home order of the Indigenous People of Biafra (IPOB) yesterday bombed the popular Izombe market in Oguta Local Government Area of Imo State.\nA witness told Daily Sun that the incident led to a pandemonium as the traders and customers in the market scampered for safety.\nIrked by their defiance, the gunmen set two vehicles ablaze in the market, which caused serious pandemonium before bombing the market.\n“They came and threw a local bomb inside the market and everybody started running for safety; they poured fuel on two vehicles and everywhere went up in flame,” a witness narrated.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "BREAKING: Buhari Seeks Senate’s Nod for Seven Ministerial Nominees",
    "summarized_story": "* Senate gets new minority leader, whip* Bauchi, Katsina, Edo senator dump APC for PDPSunday Aborisade in AbujaPresident Muhammadu Buhari has sent a letter to the Senate asking the red chamber to confirm the appointment of seven new ministerial nominees.\nThey are: Henry Ikechukwu Iko (Abia State); Umana Okon Umana (Akwa Ibom State); Ekuma Joseph (Ebonyi State); Goodluck Opia (Imo State); Umar Ibrahim El-Yakukub, (Kano State), Ademola Adewale Adegoroye, (Ondo State) and Odum Odi (Rivers State).\nThey replaced ministers who resigned their appointments at the wake of the All Progressives Congress (APC) presidential primary election recently.\nThe Senate President, Ahmad Lawan, read Buhari’s letter on the floor of the Senate during plenary Tuesday.\nAlso at plenary on Tuesday, three APC senators official defected to the PDP."
  },
  {
    "headline": "Breaking: Kidnapped Former NFF Secretary, Sani Toro, Others Regain Freedom",
    "summarized_story": "From Segun Awofadeji in BauchiBauchi State Police command has confirmed the release of the kidnapped former Secretary of the Nigeria Football Federation (NFF), Alhaji Sani Ahmed Toro, former Assistant Coach of the Nigeria Super Eagles, Garba Yila, and Alhaji Isa Jah.\nIt could be recalled that the former NFF Secretary and his co travellers were kidnapped while coming back from a wedding ceremony in Abuja around Akwanga in Nasarawa state.\nThe kidnappers were reported to have demanded for N150 million ransom before they were released.\nIt was reported that the kidnapped victims were driving back from Abuja last week Saturday when they were kidnapped along Akwanga road in Nasarawa state at about 7.30pm.\nThe report added that the abductees were returning to Bauchi from Abuja after attending the wedding of the son of former NFF President, Aminu Maigari."
  },
  {
    "headline": "Tinubu: If My VP Nominee Decides to Step Down Within Timeframe, That’ll Be No Breach",
    "summarized_story": "“And it is that Asíwájú Tinubu has duly completed his nomination forms, including giving the particulars of his running mate.\nI know he has picked a running mate.”He, however, reiterated that consultations were still ongoing between President Muhammadu Buhari, Tinubu, his running mate, Masari and the APC national leadership.\nHe said, “I must add, however, that there are ongoing consultations involving President Buhari, the party’s governors and the APC leadership with Asíwájú Tinubu and his running mate.\nDeadline for all the 18 political parties to submit the names of their presidential candidates and running mates had elapsed on June 17 2022.\nThe issue of space or place holder is a unique Nigerian invention, that has no place in our constitutional and legal framework."
  },
  {
    "headline": "Fuel Scarcity: IPMAN Faults PPMC, Says Sale of PMS at N165 No Longer Sustainable",
    "summarized_story": "Gilbert EkugbeThe Independent Petroleum Marketers Association of Nigeria (IPMAN) yesterday faulted the Pipelines and Product Marketing Company (PPMC) for the recent scarcity of premium motor spirit (PMS) in the country.\n“Our members are registered to load with PPMC, but since December last year, not a litre has been lifted at the NNPC’s Satellite depots in Ejigbo.\nHe recommended that based on current economic realities, the sustainable price to sell PMS should be pegged at N180 per litre.\n“As I am talking to you today, no private depot is selling below N162 per litre ex depot.\nOur members can no longer sell at N165 and in fact, there is no reasonable businessman that can sell below N180 per litre,” he lamented."
  },
  {
    "headline": "State Govts Not Subservient to FG, Says Body of Attorneys-General",
    "summarized_story": "The communique was jointly signed by BOAG’s Chairman and Secretary, the Attorney-General and Commissioner for Justice, Lagos State, Mr. Moyosore Onigbanjo and his Nasarawa State counterpart, Dr. Abdulkarim Kana.\nThe communique read: “Regarding the FIRS’ threat to recover unremitted tax deductions by states and local governments, the conference stresses that state governments are equal and not subservient to the federal government.\nBOAG will publicly announce its opposition to the federal government’s proposed amendments to the Stamp Duties Act.\n“BOAG will sensitise the governors of the various states concerning the detrimental effects of the federal government’s proposed amendments to the Stamp Duties Act.\nThe consultant should present a position paper to BOAG outlining the appropriate steps to take on the matter,” the statement added."
  },
  {
    "headline": "Protest letter by supreme court judges akin to dancing naked in public, says CJN",
    "summarized_story": "Ibrahim Muhammad, chief justice of Nigeria (CJN), has reacted to a letter sent to him by justices of the supreme court.\n“The supreme court definitely does not exist outside its environment, it is also affected by the economic and socio-political climate prevailing in the country.\nBesides that, the Apex Court has to a larger extent, been living to its constitutional responsibility,” he said.\n“The apex court has to make do with the resources at its disposal to meet their needs over time.\nAdvertisement“There is none of the apex court justices without SUV and backup cars."
  },
  {
    "headline": "Protest letter by supreme court judges akin to dancing naked in public, says CJN",
    "summarized_story": "Ibrahim Muhammad, chief justice of Nigeria (CJN), has reacted to a letter sent to him by justices of the supreme court.\n“The supreme court definitely does not exist outside its environment, it is also affected by the economic and socio-political climate prevailing in the country.\nBesides that, the Apex Court has to a larger extent, been living to its constitutional responsibility,” he said.\n“The apex court has to make do with the resources at its disposal to meet their needs over time.\nAdvertisement“There is none of the apex court justices without SUV and backup cars."
  },
  {
    "headline": "Buhari defends Emefiele's ‘unorthodox’ policies, says it's alternative economic model",
    "summarized_story": "Again, President Muhammadu Buhari has expressed a vote of confidence in Godwin Emefiele, governor of the Central Bank of Nigeria (CBN).\nIn an interview with Bloomberg, the president said Emefiele is following an alternative economic model, which Nigeria should be free to adopt.\nAdvertisement“Instead, the governor is following an alternative economic model that puts people at the heart of policy.\nPresident Buhari, however, sent Emefiele’s name to the senate for reappointment for another five-year term.\nUpon approval, Emefiele became the very first person appointed to serve two terms as CBN governor since the return of Democracy in 1999."
  },
  {
    "headline": "Buhari defends Emefiele's ‘unorthodox’ policies, says it's alternative economic model",
    "summarized_story": "Again, President Muhammadu Buhari has expressed a vote of confidence in Godwin Emefiele, governor of the Central Bank of Nigeria (CBN).\nIn an interview with Bloomberg, the president said Emefiele is following an alternative economic model, which Nigeria should be free to adopt.\nAdvertisement“Instead, the governor is following an alternative economic model that puts people at the heart of policy.\nPresident Buhari, however, sent Emefiele’s name to the senate for reappointment for another five-year term.\nUpon approval, Emefiele became the very first person appointed to serve two terms as CBN governor since the return of Democracy in 1999."
  },
  {
    "headline": "Amaechi, Onu, Akpabio not returning as Buhari nominates new ministers",
    "summarized_story": "President Muhammadu Buhari has asked the senate to confirm seven nominees for appointment as ministers.\nBuhari’s request was contained in two letters read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday.\nThe ministers resigned in accordance with the provisions of section 84(12) of the electoral act.\nAdvertisementUche Ogah resigned as minister of state for mines and steel development to pursue Abia governorship.\nThe upper legislative chamber will screen the nominees in the “committee of the whole” on a date yet to be announced."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Afropolitan wants to build a digital nation for Africans",
    "summarized_story": "Afropolitan, a startup that wants to build a digital nation for Africans, has raised pre-seed funding of $2.1 million, according to its co-founder, Eche Emole.\nSrinivasan envisions that this new country, the “network state,” he calls it, will be ”built on the cloud first.\nSrinivasan conceives a network state as a digital nation built without the historical constraints of a physical nation, and that presents citizens with a fresh stab at societal and financial freedom.\nEmole is convinced that Africa has the most need for a digital nation because of the numerous failed states on the continent.\nEmole envisions a digital nation as Facebook—the biggest social media platform in the world with over almost 3 billion users—filled with people with shared values and governed by a single cryptocurrency,Afropolitan’s digital nation will be built in 4 phases."
  },
  {
    "headline": "Abena, a voice assistant, wants to preserve African languages",
    "summarized_story": "But these voice technologies support only Western languages and are unavailable in African languages because of the low-revenue opportunities in African markets.\n“Working on voice tech for African languages has been a completely different ball game.\nHe spent 6 years building Abena AI, and released it in the Google Play Store this April as a Mobobi product.\nAbena AI works with smart lights, smart plugs, and other smart home devices.\n“The feedback from a few people who tried Abena AI out before it was released kept us going."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Buhari sends names of 7 ministerial nominees to Senate for confirmation",
    "summarized_story": "President Muhammadu Buhari has sent the names of seven nominees to the Senate for confirmation as ministers.\nThe nominees include, Henry Ikechukwu Ikoh from Abia State; Umana Okon Umana from Akwa Ibom State; Ekumankama Joseph Nkama, from Ebonyi State and Goodluck Nana Opiah from Imo State.\nOthers are Umar Ibrahim El-Yakub from, Kano State; Ademola Adewole Adegoroye from Ondo State and Odum Odi from Rivers State.\nRead also: ‘Great Resignation’ to hit Buhari’s cabinetThe confirmation request was contained in a letter addressed to the Senate President, Ahmad Lawan, and read on the floor at the start of plenary on Tuesday.\nPresident Buhari, in the letter, explained that the confirmation request was in accordance with the provisions of Section 147 subsection 2 of the 1999 Constitution of the Federal Republic of Nigeria as amended."
  },
  {
    "headline": "Tech firms put brakes on hiring amid global layoffs",
    "summarized_story": "Tech companies in Nigeria are starting to put the brakes on hiring as they weigh the impact of the global economic meltdown that has seen venture capital (VC) firms withhold signatures on new funding deals and forced many tech companies to lay off workers.\nTech companies worldwide have laid off a total of 39,480 tech workers from January to June across 212 layoff events.\nAfrican tech companies in the process of raising funds have raised concerns that VCs are pulling back and in most cases refusing to go forward with the deals.\nHilda Kragha, CEO of the African Talent Company, said the impact had been slow in trickling down to the African tech ecosystem.\nThose organisations will now be forced to evaluate the value they place on tech talents in the country,” Adeyeye said."
  },
  {
    "headline": "Half of Africans without electricity live in Nigeria, four others",
    "summarized_story": "Almost half of Africans without access to electricity today live in the Democratic Republic of the Congo, Ethiopia, Nigeria, Tanzania and Uganda, a new report by Paris-based International Energy Association (IEA) has said while calling for new investments to ramp up energy access in Africa.\nAccording to the IEA report, more than 25 million more people in Africa are living without electricity today compared with before the pandemic.\nThe overlapping crises are affecting many parts of Africa’s energy systems, including reversing positive trends in improving access to modern energy, the report said.\nThe report said that with demand for energy services in Africa set to grow rapidly, ensuring affordability is an urgent priority.\nAchieving Africa’s energy and climate goals means more than doubling energy investment this decade."
  },
  {
    "headline": "Osayomore Joseph: A Bundle of Talents – Nigerian Observer",
    "summarized_story": "By the time his chartbuster ‘Efenedo’ was released, Osayomore Joseph and His Ulele Power Sound Band, were already dazzling exponents of the Benin rich musical repertoire.\nBorn Joseph Osayomore Erhinmwioghae, Osayomore Joseph “set forth” very early in life on the path to musical stardom.\nHe had his roots in a family of musical talent; his elder brother, Pullen’s extraordinary musical talent was extinguished by his painful early death.\nOsayomore Joseph or OJ to many of his fans and friends, took the Benin musical scene by storm.\nOsayomore Joseph was also a crusader for social justice."
  },
  {
    "headline": "Edo PDP: Obaseki sues for peace, appoints Igbinedion to chair Peace Committee – Nigerian Observer",
    "summarized_story": "The governor disclosed this while meeting with over 135 PDP members drawn from the National Executive Committee, State Executive Committee, and Zonal Committee of the party, at the party Secretariat in Benin City.\nI have consulted and for the time being decided that Chief Lucky Igbinedion, a former Governor of the State to chair the peace committee of the party in the state.\nThe internal wrangling is the only thing that can stop us as it has stopped PDP in Ekiti State.\n“If we sue for peace in the party, we will certainly find one.\nHe called on the party leaders to activate the youths wing to bring youths into the party in preparation for the 2023 general election."
  },
  {
    "headline": "CVR: Ex Edo LG Chairman task stakeholders on mobilization – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbudu – With 10 days to the end of the Continuous Voters Registration (CVR) by the Independent National Electoral Commission (INEC), a former chairman of Orhionmwon local government, Hon.\nOtamere Aigbogun on Sunday called on political stake holders in the area to mobilize those who are yet to register to visit Esigie college and the Primary Health Center (PHC) at Abudu for registration.\nAigbogun who made the call in message made available to The Nigerian OBSERVER stated that the registration will continue at Abudu (Abiokunla Ward 1) on Monday, 20th June, 2022 through Wednesday, 22nd June 2022.\nThe exercise is expected to move to Ogan community in the area on Thursday 23rd June 2022 and Friday 24th June 2022.\nThe online registration is scheduled to end on 30th June year 2022 with the commission undecided on the issue of extension."
  },
  {
    "headline": "Obaseki inspects ongoing revamp of Abudu College of Education, reassures on September resumption date – Nigerian Observer",
    "summarized_story": "Obaseki, who inspected the demonstration school by the Universal Basic Education Commission (UBEC) and the main campus of the college, said his government is committed to human capacity development.\n“The demonstration school would be like a laboratory for training basic teachers because what we are trying to do is to make these facilities in Abudu another education hub.\n“The college will help in training teachers, particularly those to teach basic education.\nYou can see that the same thing is happening in the school of agriculture, as well as the school of nursing.\nFirst, you have to have quality schools, and then quality teachers to now produce the kind of students you need."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "NDLEA seizes 1,699kg of illicit drugs, arrests 149 suspects in Kogi",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has arrested 149 suspects and seized 1,699kg of illicit drugs between January and June in Kogi.\nThe NDLEA Commander in Kogi, Abdulkadir Abdullahi-Fakai, made the disclosure at a news conference on Tuesday in Lokoja, as part of a week-long celebration of the United Nations Day Against Drug Abuse and Trafficking.\nHe described the drug abuse situation in Kogi as highly disturbing and called for collective efforts to tackle it, NAN reported.\n“The drug situation in Nigeria and indeed Kogi is disturbing, especially being a microcosm of Nigeria.\n“And as a federating unit, Kogi cannot stand alone in the face of this ominous threat of drug abuse and trafficking."
  },
  {
    "headline": "S/Court judges accuse CJN, Muhammad of misappropriating judiciary funds",
    "summarized_story": "Nigeria’s Supreme Court justices, have written to chief justice of Nigeria (CJN), Ibrahim Muhammad, accusing him of abandoning his responsibilities as the leader of the court.\n14 justices of the apex court in a letter, ccused the CJN of abandoning his responsibilities as the leader of the court.\nThis is unacceptable!”On the issue of healthcare, the justices said: “The supreme court clinic has become a mere consulting clinic.\n“With regard to justice’s vehicles, several are due for replacement, while the new Justices have not received their full complement of vehicles to date.\nThe supreme court of Nigeria, just like the Presidential Villa and the national assembly, is the seat of the judiciary as an arm of government."
  },
  {
    "headline": "JUST IN: Buhari appoints new ministers, replaces Akpabio, Amaechi, others",
    "summarized_story": "President Muhammadu Buhari has appointed new ministers to replace, Rotimi Amaechi, Godswill Akpabio Ogbonnaya Onu, and other cabinet members who resigned to contest the APC presidential primary.\nThe president, on Tuesday, wrote to the senate seeking the confirmation of seven ministerial nominees.\nThe nominees are: Henry Ikechukwu – Abia State, Umana Okon Umana – Akwa-Ibom State; Ekuma Joseph – Ebonyi State; Goodluck Nana Obia – Imo State; Umar Ibrahim Yakub – Kano State; Ademola Adewole Adegorioye – Ondo State; Odo Udi – Rivers State."
  },
  {
    "headline": "Sokoto man receives death threats for supporting Peter Obi",
    "summarized_story": "He said person threatening him has incidentally made contact with his wife and has vowed to kill her if he (Sufi) refuses to desist from supporting Mr Obi.\n“I don’t succumb to blackmail and threats,” Mr Sufi said in the post.\nMr Sufi said the unidentified person speaks Igbo and Hausa languages fluently.\nHe said of Mr Obi : “a president in the making”.\nNigeria, he said, would be safe under Mr Obi."
  },
  {
    "headline": "Amazon to begin operation in Nigeria in 2023",
    "summarized_story": "Amazon, American e-commerce giant, will begin operations in Nigeria in 2023, as it sets to expand presence to five more countries across Africa, South America and Europe.\nAlready operating in 20 countries, the development will see the e-commerce giant kick start operations in Belgium, Chile, Colombia, Nigeria, and South Africa in April 2023.\nAmazon will create a marketplace in all five countries, with access to Amazon’s fulfillment service called Fulfillment by Amazon.\nThe entry of Amazon into Nigeria’s e-commerce space will further intensify competition in the sector dominated by Jumia, Konga, and Jiji, among others.\nDespite being present in 20 countries with robust economies, Amazon’s presence in developing markets like South America and Africa has been relatively poor"
  },
  {
    "headline": "JUST-IN: Gunmen Kidnap Mother Of Jigawa Central Senatorial Candidate B",
    "summarized_story": "Mother of the All Progressives Congress (APC) candidate for Jigawa Central senatorial zone, Hon.\nTijjani Ibrahim Gaya, has been abducted by unknown gunmen.\nThe 70-year-old victim, Hajiya Jaja, was abducted from her house in Kiyawa local government of Jigawa State.\nHe explained that the suspected kidnappers stormed the family house of the APC senatorial candidate in Kiyawa town and forcefully whisked aged woman away.\nLEADERSHIP reports that the abduction comes barely three weeks after the mother of the Kano Central senatorial candidate on the platform of APC, A.A. Zaura, was also abducted in the neighbouring Kano State and rescued days later by the Police."
  },
  {
    "headline": "JUST-IN: Gunmen Kidnap Mother Of Jigawa Central Senatorial Candidate B",
    "summarized_story": "Mother of the All Progressives Congress (APC) candidate for Jigawa Central senatorial zone, Hon.\nTijjani Ibrahim Gaya, has been abducted by unknown gunmen.\nThe 70-year-old victim, Hajiya Jaja, was abducted from her house in Kiyawa local government of Jigawa State.\nHe explained that the suspected kidnappers stormed the family house of the APC senatorial candidate in Kiyawa town and forcefully whisked aged woman away.\nLEADERSHIP reports that the abduction comes barely three weeks after the mother of the Kano Central senatorial candidate on the platform of APC, A.A. Zaura, was also abducted in the neighbouring Kano State and rescued days later by the Police."
  },
  {
    "headline": "VP Ticket: Coalition Insists On Youth Inclusion, Backs Dauda, Others",
    "summarized_story": "A coalition of about 58 northern groups, under the aegis of Northern Nigerian Youth Coalition, yesterday, reemphasized that for democracy to flourish and have a meaning, presidential candidates need to pick young persons as running mates from their respective parties.\nIt said there must be demographic inclusion and decried how the two major political parties systematically schemed younger aspirants out of their presidential tickets.\nHe pointed out that the running mate selected by the PDP is relatively not within the bracket of the young generation.\nHe said all eyes are now on the APC to complement the Tinubu ticket with young people and cited Dr Ibrahim Bello Dauda as an example.\n“Popular young aspiring personalities like Dauda shall be the ones to be considered in order to bridge the widening generation gap,” he added."
  },
  {
    "headline": "VP Ticket: Coalition Insists On Youth Inclusion, Backs Dauda, Others",
    "summarized_story": "A coalition of about 58 northern groups, under the aegis of Northern Nigerian Youth Coalition, yesterday, reemphasized that for democracy to flourish and have a meaning, presidential candidates need to pick young persons as running mates from their respective parties.\nIt said there must be demographic inclusion and decried how the two major political parties systematically schemed younger aspirants out of their presidential tickets.\nHe pointed out that the running mate selected by the PDP is relatively not within the bracket of the young generation.\nHe said all eyes are now on the APC to complement the Tinubu ticket with young people and cited Dr Ibrahim Bello Dauda as an example.\n“Popular young aspiring personalities like Dauda shall be the ones to be considered in order to bridge the widening generation gap,” he added."
  },
  {
    "headline": "Nigeria’s Economic Situation Affecting Us, CJN Reacts To Protest Letter By S’Court Justices",
    "summarized_story": "However, the CJN, through his senior media aide, Mr Ahuraka Isah, said the economic situation in the country was also affecting the running of the apex court.\n“Of importance is the state of health care in the Supreme Court which has deteriorated; the Supreme Court clinic has become a mere consulting clinic.\nThe Apex Court has to make do with the resources at its disposal to meet their needs over time.\n“Besides, two Supreme Court Justices died within the period under consideration.\nThere is none of the Apex Court Justices without SUV and back up cars."
  },
  {
    "headline": "Just In: CJN Muhammad replies Supreme Court justices’ protest letter",
    "summarized_story": "The CJN said in the letter that he held a meeting with his brother Justices last Thursday on the issues raised in their letter.\nTake for instance, the Supreme Court budgeted this year to re-roof and rehabilitate its complex built over 30 years ago and that is being done.\nBesides, two Supreme Court Justices died within the period under consideration.\nTwo weeks ago, eight Supreme Court Justices were nominated for a workshop in London as the court cannot take all of them there at once otherwise the job would suffer.\nThe CJN held a meeting with his brother Justices last Thursday and another one is due to hold this week."
  },
  {
    "headline": "Fuel scarcity: Lagos bus operators hike fares",
    "summarized_story": "Commercial bus operators on Tuesday hiked their fares on various routes in Lagos State due to the lingering scarcity of Premium Motor Spirit (PMS), also known as petrol in the state.\nIt was observed that buses were carrying passengers from Iyana-Ipaja to Oshodi for N400 against the normal N300 while bus fare from Iyana-Ipaja to Ikeja increased from N200 to N300.\nAlso, the bus fare from Ketu to Constain went up from N300 to N400, leaving many passengers frustrated and stranded especially with the few available buses on the road.\n“I am appealing to the government to intervene quickly to ensure that there is fuel everywhere to reduce this suffering.\nWe explained that with the current price, there is no way we can sell less than N180 per litre."
  },
  {
    "headline": "JUST IN: Amaechi, Onu Not Returning As Buhari Nominates New Ministers",
    "summarized_story": "JUST IN: Amaechi, Onu Not Returning As Buhari Nominates New MinistersPresident Muhammadu Buhari has requested that the Senate confirm seven ministerial nominees.\nOn Tuesday, Senate President Ahmad Lawan read two letters containing Buhari’s request on the floor of the upper legislative body.\nDespite earlier conjecture, Rotimi Amaechi, Ogbonnaya Onu, Godswill Akpabio, and Emeka Nwajiuba, who all left to pursue presidential campaigns, will not return.\nMore to come…"
  },
  {
    "headline": "BREAKING: Buhari replaces ex-ministers, sends nominees list to Senate",
    "summarized_story": "The Nigerian Senate has received the executive communication with the nomination of six names as replacements for ministers that resigned to contest the presidential election.\nIn a letter that was read by the Senate President, Dr Ahmad Ibrahim Lawa,n on Tuesday, President Muhammadu Buhari said the nominees would replace the former ministers that resigned from his cabinet.\nThe letter read: “In accordance with Section 8 Subsection 2 of the Constitution of the Federal Republic of Nigeria as amended, I hereby forward the underlisted ministerial nominees for your confirmation.”The nominees are:Henry Ikechukwu Ikoh – Abia StateUmana Okon Umana – Akwa Ibom StateEgwumakama Joseph Nkama – Ebonyi StateGoodluck Nnana Opiah – Imo StateUmar Ibrahim El-Yakub – Kano StateAdemola Adewole Adegoroye – Ondo StateOdum Odih – Rivers State"
  },
  {
    "headline": "Health Concern: ‘I’m Out Of Hospital And Doing Well’ — Abdulsalami",
    "summarized_story": "Health Concern: ‘I’m Out Of Hospital And Doing Well’ — AbdulsalamiAbdulsalami Abubakar, former head of state, says there’s no cause for alarm over his health as his medical condition has improved significantly.\n“I had a swollen knee and was unable to walk for days in the last week of May,” he said.\n“After initial care by my doctors, they advised that I should seek further expert care abroad.\nThat was why I had to cancel my birthday programme”He also extended his gratitude to Nigerians for their concern and care.\n“I appreciate the support, love and care that Nigerians have been showing since the story went on social media."
  },
  {
    "headline": "Chief Justice Of Nigeria, Tanko Takes Wife, Children Abroad For Workshops But Blocks Us From Overseas Training – Supreme Court Judges Kick In Memo",
    "summarized_story": "Chief Justice Of Nigeria, Tanko Takes Wife, Children Abroad For Workshops But Blocks Us From Overseas Training – Supreme Court Judges Kick In MemoThe Chief Justice of Nigeria, Ibrahim Tanko Muhammad, has been alleged to be junketing abroad for workshops with his wife, children and backroom staff while blocking other justices of the Supreme Court from overseas training.\nIn a protest memo sent to the CJN by the angry Supreme Court judges, the justices demanded to know what had happened to their legitimate entitlements under Tanko.\nThe justices of the apex court in Nigeria said their annual foreign training, meant to enhance capacity building for the country’s judicial process, had been blocked by Tanko.\nIn the same memo, fresh details emerged where the judges accused the CJN, Tanko of junketing abroad with his wife, children, and cronies while denying them (justices) from doing the same.\nThe justices berated Tanko further, saying his weak leadership had drastically deteriorated the standards known with the nation’s highest court."
  },
  {
    "headline": "Breaking: Buhari names new ministers-designate, to replace Amaechi, others *See full list",
    "summarized_story": "The Senate has received the names of seven Ministerial nominees from President Muhammadu Buhari for confirmation as Ministers of the Federal Republic of Nigeria.\nThe confirmation request was contained in a letter addressed to the Senate President, Ahmad Lawan, and read on the floor at the start of plenary onnTuesday.\nPresident Buhari, in the letter, explained that the confirmation request was in accordance with the provisions of Section 147 subsection 2 of the 1999 Constitution of the Federal Republic of Nigeria as amended.\nThe nominees for confirmation include: Henry Ikechukwu Ikoh – Abia State; Umana Okon Umana – Akwa Ibom State; Ekumankama Joseph Nkama- Ebonyi State; and Goodluck Nana Opiah – Imo State.\nOthers are Umar Ibrahim El-Yakub – Kano State; Ademola Adewole Adegoroye – Ondo State; and Odum Odi – Rivers State."
  },
  {
    "headline": "Breaking: Kidnapped ex-NFF General Secretary Sani Toro, 2 others regain freedom",
    "summarized_story": "Armed kidnappers in Nigeria have released three men including Ahmed Sani Toro, a former secretary-general of the then Nigeria Football Association (NFA).\nToro’s son told BBC Sport Africa that his father is on his way home after the ordeal.\nNigeria is facing a worsening spate of kidnappings for ransom by armed gangs who frequently attack travellers and rural communities.\nToro spent six years in his role at what is now known as the Nigeria Football Federation (NFF) between 1993 and 1999.\nToro played a huge administrative role – including during bonus rows involving the NFA and players – at the 1996 Olympics football event and the 1998 World Cup in France."
  },
  {
    "headline": "Presidential running mate: APC’s placeholder sign of ill-preparedness – Atiku",
    "summarized_story": "The former number two man said the nation’s top job does not need someone who is hesitant to make decision in picking his running mate.\nThe PDP standard bearer said picking running mates by candidates vying for any big office like the presidency is very important in a democracy.\n“In developed democratic countries, the process and picking of a running mate by a presidential candidate is a step to understanding the capacity of a candidate and his capability to do the job,” he said.\nTinubu hits backBut in a reaction, Asiwaju Tinubu told Atiku to focus more on resolving the internal crisis within PDP.\nAs far as we are concerned, the parties didn’t submit the names as a placeholder."
  },
  {
    "headline": "ITPN FCT Chapter set to hold maiden edition of interactive workshop for industry players",
    "summarized_story": "By Palma IleyeFCT Chapter of Institute for Tourism Professionals of Nigeria, ITPN, has said it was set to organize a One-Day Interactive Workshop with industry players aimed at fostering the growth and development of the sector.\nIn a press release issued by the Chairman of the FCT Chapter of the Institute, Dr. Mrs. Ebikaboere Seimodei, stated that the one-day event being the first to be organized by the Chapter, will create a platform to brainstorm on harnessing the benefits of the sector adding that it promises to be insightful, engaging and beneficial for critical industry players and stakeholders of the tourism industry in the country.\nSeimodei who is also the Technical Adviser to the Bayelsa State Governor on Tourism and Hospitality, asserted that for the growth and development of the industry, such occasion that brings relevant stakeholders in all facets of the industry together was imperative to be able to rub minds, wear the proverbial thinking caps and come up with laudable ideas and innovations that will move the industry forward in line with best global practices.\nAccording to her, the workshop with the theme: ‘Effective Customer Service for Tourism and Hospitality Professionals’ scheduled to hold on Thursday, 23rd June, 2022 at White Hart Hotel & Apartments, Wuye District, Abuja beginning from 10:00am, is expected to feature activities such as Discourse Sessions by stakeholders of the Travel Tourism and Hospitality Industry; Capacity Training and Development for practitioners in the sector; Networking among attendees from the public and private sectors of the industry as well as registration of new members into the Institute.\nShe explained that the FCT Chapter of the Institute for Tourism Professionals of Nigeria came into existence in 2016 with a membership of about a hundred, and as the Chapter of the nation’s capital, it was challenged as a fore-runner to galvanize all key players in the industry so that the FCT and indeed the Nigeria as a whole, will have a purposeful and well guided direction to position the tourism and hospitality industry as a viable economic sector that has a vital role to play for the socio-economic benefits of the country."
  },
  {
    "headline": "FG reaffirms commitment to complete Idukpani- Itu – Ikot Ekpene road in 2023",
    "summarized_story": "Chioma NnodimThe Federal Government has reaffirmed its commitment to completing the ongoing dualization and rehabilitation of the Odukpani – Itu – Ikot Ekpene road in Cross River and Akwa Ibom States.\nHe disclosed that funding is not a problem as the road is being funded by the Nigerian National Petroleun Company ( NNPC) under the Federal Government Tax Credit Scheme.\nThe Director expressed satisfaction at the pace of work by Julius Berger and SERMATECK companies while urging CCECC to improve on its pace of work.\nThe Federal Controller of Works in Cross River State, Engineer Bassey Nsentip said the contractors have the equipments and are willing to work, adding that the road project include five bridges and several culverts.\nEngineer Bakari Kehinde and EngineerJoseph Ukpata, site engineers of Julius Berger and SERMATECK respectively also called on the state governments to help in resolving the problem of the right of way."
  },
  {
    "headline": "Honeywell group partners Lagos innovates to upskill young tech entrepreneurs",
    "summarized_story": "Kehinde Ibrahim, LagosLEADING Nigerian investment holding company, Honeywell Group (HGL), has partnered with the Lagos State Government and Lagos Innovates, the tech arm of Lagos State Employment Trust Fund (LSETF) to support the growth of one of Africa’s most exciting tech ecosystems.\nThe partnership is executed via a talent development programme under ‘Lagos Innovates’ – a training project conceptualised to ease the process of building successful tech start-ups in Lagos State.\nCommenting on the partnership, Head of Corporate Services, Honeywell Group, Tomi Otudeko said: “Creating long-term value for Nigeria and its people has always been at the heart of Honeywell Group’s mission.\nLSETF and Honeywell Group are committed to ensuring that young people are equipped to drive the growing tech ecosystem in Lagos and Nigeria at large, in addition to positioning themselves for the gig economy.\nIn partnership with HGL, Lagos Innovates is supporting capacity development in Lagos State by facilitating access to an integrated development environment (IDE) or tech-focused entrepreneurship content and programming."
  },
  {
    "headline": "Hallmark Insurance records N10.5bn gross premium",
    "summarized_story": "Kehinde Ibrahim, LagosCONSOLIDATED Hallmark Insurance Plc’s gross written premium rose to N10.5bn by the end of 2021 financial period.\nThe Chairman, Board of Directors of the company, Obinna Ekezie, disclosed this during the company’s 27th annual general meeting in Lagos.\n“Both the top and bottom lines recorded growths as we generated an all-time high gross premium written of N10.5bn.\n“Having paid an interim dividend of the same figure earlier, the total dividend we wish to pay or the 2021 financial year now amounts N433.6m or four kobo per share,” he said.\nThis is another year of stock taking– to reflect on where we are coming from and how we have fared."
  },
  {
    "headline": "UBEC begins processes of full implementation of E-learning",
    "summarized_story": "By Ngozi NwankwoManagement of Universal Basic Education Commission, UBEC, has commenced discreet efforts to ensure full implementation of E-learning programmes in basic education across the country following the challenges occasioned in the sub-sector by the COVID-19 pandemic lockdown and closure of schools.\nExecutive Secretary of UBEC, Dr Hamid Bobboyi disclosed this in his speech delivered at the 5-day workshop for the development of Course Outline and Course Contents for the training of education managers, teachers, technical support personnel and other stakeholders for the Smart Schools and E-Learning programmes in basic education in Nigeria.\n“Fortunately, the Commission, even before the outbreak of the Covid-19 pandemic, has been vigorously pursuing two important projects; the Smart Schools and the E-learning projects.\nBobboyi further explained that the capacity building for the different categories of stakeholders would include general training on ICT tools and facilities.\nOn digital pedagogical training, the UBEC boss said this would focus on developing teachers’ skills on e-learning lesson delivery, explaining that the pedagogical skills required for e-learning delivery is far different from the face-face pedagogical skills."
  },
  {
    "headline": "President Buhari Sends Ministerial List To Senate For Screening",
    "summarized_story": "President Muhammadu Buhari has written to the Senate seeking the confirmation of seven ministerial nominees.\nThe nominees are: Henry Ikechukwu – Abia State, Umana Okon Umana – Akwa-Ibom State; Ekuma Joseph – Ebonyi State; Goodluck Nana Obia – Imo State; Umar Ibrahim Yakub – Kano State; Ademola Adewole Adegorioye – Ondo State; Odo Udi – Rivers State.\nThe Senate has, however, not fixed a date yet for the screening exercise.\nMeanwhile, the Peoples Democratic Party (PDP) has nominated Senator Philip Aduda as the new minority leader to fill the vacant seat created by Senator Enyinnaya Abariba’s defection.\nAlso, the party nominated Senator Chukwuka Utazi as the new senate minority whip."
  },
  {
    "headline": "Electoral Act Amendment: Bill To Override Buhari Stepped Down",
    "summarized_story": "A bill to override President Muhammadu Buhari over his delay in signing the amendment to the Electoral Act 2022, has been stepped down at the House of Representatives.\nThe bill was stepped down on Tuesday after the Deputy Speaker faulted it, stating that any move to override requires 2/3rd of members.\nHe advised the mover of the motion – Ben Igbakpa to step it down as it violates procedure for overriding the President.\nMore to follow…"
  },
  {
    "headline": "Bayelsa Boat Accident: Corpses Of Corps Members Found, Two Toddlers Still Missing",
    "summarized_story": "The corpses of the four out of six victims of a boat accident along the Otuan and Ayama communities of Southern Ijaw Local Government council in Bayelsa State, have been found.\nChannels Television gathered that the boat accident, which occurred on Saturday at about 4:00 pm, was reportedly caused by bad weather, poor visibility and lack of life jackets for the passengers.\nOgoniba also said the the National Youths Service Corps (NYSC) authorities have been notified of the recovery of the corpses of the deceased female corps member.\nMeanwhile, the spokesman of the Bayelsa State Police Command, Asinim Butswat, has denied the reported arrest of the boat rider, Lucky Christopher.\nAccording to Butswat, Lucky Christopher was only invited as part of procedures into investigations over the accident."
  },
  {
    "headline": "Selling Petrol At N165 Unrealistic, Says IPMAN As Scarcity Hits Lagos",
    "summarized_story": "In an interview with Channels Television, the Lagos Zonal Chairman of IPMAN, Akin Akinrinade, explained the rationale behind the fuel scarcity.\n“Members of Independent Petroleum Marketers Association of Nigeria IPMAN have shut down their stations, not because we are striking; we are not on strike,” he said.\n“Rather, the business environment has been very hostile to us such that we can no longer do business under this condition.\n“You now have to add the cost of transportation which is between N6 to N8, depending on the distance within Lagos,” he explained.\nThere is no station in Lagos that uses less than 50 litres (of diesel) per day."
  },
  {
    "headline": "Suspected Terrorists Attack Motorcade Of Intending Pilgrims In Sokoto",
    "summarized_story": "Suspected terrorists have attacked a motorcade of intending pilgrims from Isa Local Government in Sokoto state allegedly leaving three police personnel dead in the process.\nSome of the sources confirmed the terrorists had allowed the first vehicle carrying the security personnel to go on ahead before opening fire on them.\nThe security personnel were said to have engaged the gunmen in a gun duel for several hours, thereby stopping them from abducting any of the intending pilgrims in which three of the officers reportedly lost their lives in the process.\nIt was also confirmed that two vehicles conveying the intending pilgrims made it to the airport, while the remaining vehicle returned the pilgrims to their local government.\nConfirming the incident, the Sokoto state government said that the pilgrims from the Isa local government area of the state had been rescued and were unscathed."
  },
  {
    "headline": "Buhari writes Senate, seeks confirmation of Seven ministerial-nominees -",
    "summarized_story": "President Muhammadu Buhari has written to the Senate seeking the confirmation of seven Ministerial nominees to replace those who earlier resigned to pursue their political ambitions ahead of the 2023 general elections.\nIn a letter read by the President of the Senate on Tuesday, the president requests the senate to confirm the nominees to replace the former ministers.\nThe nominees are Henry Iko (Abia State), Umana Umana, (Akwa Ibom), Ekuma Joseph, (Ebonyi), Goodluck Opiah, (Imo), Umar El-Yakub, (Kano), Ademola Adegoroye, (Ondo( and Odum Odi, (River State).\nIt would be recalled that ministers of Transportation, Rotimi Amaechi; Niger Delta Affairs, Godswill Akpabio; Science, Technology and Innovation, Ogbonnaya Onu, Minister of State, Mines and Steel Development and the Minister of State for Niger Delta Affairs, Tayo Alasoadura resigned few weeks to the APC Special convention to pursue their presidential ambitions.\nThe ministerial nominees are expected to replace those who resigned from the cabinet after they must have screened and confirmed by the senate."
  },
  {
    "headline": "Court restrains INEC from ending Voter registration on June 30 -",
    "summarized_story": "The federal high court judgment in Abuja has restrained the Independent National Electoral Commission from ending voter registration on 30 June 2022.\nJustice Mobolaji Olajuwon granted an order of interim injunction following the hearing of an argument on motion exparte by Socio-Economic Rights and Accountability Project (SERAP).\nSERAP and 185 other concerned Nigerians had earlier filed a lawsuit against INEC asking the court to “declare unconstitutional, illegal, and incompatible with international standards the failure of the electoral body to extend the deadline for voter registration to allow eligible Nigerians to exercise their rights”.\nIn the suit, SERAP asked the court for “an order restraining INEC, its agents, privies, assigns, or any other person(s) claiming through it from discontinuing the continuous voters’ registration exercise from the 30th June 2022 or any other date pending the hearing and determination of the motion on notice”."
  },
  {
    "headline": "'We are looking beyond South Africa at WAFCON' says Oshoala -",
    "summarized_story": "Nigeria striker, Asisat Oshoala said the Super Falcons are looking beyond facing title rivals South Africa at this year’s Women’s Africa Cup of Nations in Morocco.\nThe record nine-time African champions will open their 2022 tournament campaign just as they ended the last edition against 2018 runners-up, the Banyana Banyana.\nBoth teams are in Group C, alongside Botswana, and Burundi.\nThe Super Falcons bowed twice in last three meetings with South African since 2018 but the Barcelona forward believes the Falcons will leave nothing to chance in the quest for another record-extending 10th continental crown."
  },
  {
    "headline": "Ekiti governor-elect, Oyebanji visits Buhari at Presidential villa",
    "summarized_story": "Ekiti state governor-elect, Abiodun Abayomi Oyebanji, on Monday paid a thank you visit to President Muhammadu Buhari following his victory at the poll on Saturday.\nAccompanied by the outgoing governor, Kayode Fayemi and minister of Industry, Adebayo, Mr Oyebanji thanked the president and the party for the support.\nHe promised to consolidate on the successes of the outgoing administration.\nHe was also joined at the villa by the National chairman of the All Progressives Congress, Abdullahi Adamu."
  },
  {
    "headline": "Amaechi, Nwajiuba, Onu Won’t Return as Buhari Nominates 7 New Ministers",
    "summarized_story": "President Muhammadu Buhari has asked the senate to confirm seven nominees for appointment as ministers.\nBuhari’s request was contained in two letters read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday.\nRotimi Amaechi, Ogbonnaya Onu, Godswill Akpabio and Emeka Nwajiuba who all resigned to pursue presidential bids will not return.\nThe President sought confirmation of 7 ministerial nominees; Henry Iko (Abia State), Umana Umana (Akwa Ibom), Ekuma Joseph (Ebonyi), Goodluck Opiah (Imo), Umar El-Yakub (Kano), Ademola Adegoroye (Ondo) and Odum Odi (Rivers State).\nDetails later…"
  },
  {
    "headline": "Moscow Fumes Over EU Blockade of Baltic Outpost",
    "summarized_story": "The EU ambassador in Moscow appeared at the Russian foreign ministry headquarters on Tuesday, Russia’s RIA state news agency reported.\nOvernight, the Kaliningrad governor told Russian television EU ambassador Marcus Ederer was to be summoned and “told of the appropriate conditions involved here”.\nMoscow had summoned a Lithuanian diplomat on Monday, but the EU has deflected responsibility from the Lithuanians.\nThe governor of Ukraine’s surrounding Luhansk region said Russian forces had gained some territory on Monday.\nMoscow is running out of fresh troops, while Ukraine is receiving newer and better equipment from the West, tweeted retired U.S."
  },
  {
    "headline": "Samuel Eto’o Escapes Jail Term in Spain, Handed Suspended Sentence Over Tax Fraud",
    "summarized_story": "Former Barcelona striker Samuel Eto’o has escaped a jail term for fraud after he was handed a 22-month suspended prison sentence.\nEto’o has been ordered to pay a sum of four fines in response, around the sum of €1.8m (£1.6m/$1.9m), but has avoided an immediate jail term in part due to his prior clean record and because he has already returned some of the defrauded money.\nEto’o is not the only individual to be indicted and plead guilty, with Mesalles also handed a suspended sentence of a year for his part in committing the fraud.\nA third individual – Jesus Lastre, the administrator of the Hungarian-based company – was meanwhile acquitted on all charges.\nIt remains to be seen whether Eto’o will be forced to stand down from the office of President of the Cameroonian Football Federation following his conviction."
  },
  {
    "headline": "Nigeria: Tobacco Industry Exploiting Social Media to Promote Product in Contravention of Law",
    "summarized_story": "The tobacco industry in Nigeria is allegedly exploiting social networking platforms to promote and market its products in contravention of provisions of the National Tobacco Control Act 2015 and its regulations, a new report has revealed.\nThe Executive Director of CAPPA, Mr. Akinbode Oluwafemi during the public presentation of the report decried how the tobacco industry was making use of social media platforms to aggressively promote sales of tobacco products and a smoking culture.\nThe report therefore blamed existing gaps in the National Tobacco Control Act 2015 and the National Tobacco Control Regulations 2019, as it pertains to enforcing the ban and endorsement of tobacco industry CSR activities by state actors and institutions for the manipulation of the space by the tobacco industry.\nIt recommended that the federal government should enforce penalties for Tobacco Advertising Promotion and Sponsorship (TAPS) and tobacco control violations in compliance and accordance with national tobacco control and policy.\nIt also urged the government to revoke all Ministries, Departments and Agencies’ (MDAs’) collaboration with the tobacco industry and their front groups."
  },
  {
    "headline": "19% Eligible Nigerians Vaccinated Against Covid, Says FG",
    "summarized_story": "Nigeria’s federal government on Monday said the country has been able to fully vaccinate 21,236,404 of its eligible population with COVID-19 vaccine.\nWhile giving updates on Monkeypox infection in the country, the NCDC DG said as of June 19, 2022, 41 confirmed Monkeypox cases and one death had been reported.\n“We have ensured continued working with NYSC camps for safe reopening to minimise infection risk,” he said.\nThe Director of the Department of Family Health, Dr. Salmat Ibrahim gave update on the present challenges posed by female genital mutilation in the country.\nShe said about two million Nigerians were still at risk of female genital mutilation, while 200 million persons face similar risk globally."
  }
]