[
  {
    "headline": "Politicians, students must undergo drug test, says Marwa",
    "summarized_story": "The Chairman of the National Drug Law Enforcement Agency, Brigadier General Buba Marwa (retd.\n), has emphasised on the need for politicians seeking public offices and students seeking admission into higher institutions to undergo drug integrity tests.\nThe statement titled ‘Why politicians, students, must undergo drug test – Marwa’ was made public by the NDLEA Director of Publicity and Media, Femi Babalola, where the Chairman pointed out that politicians in the forthcoming elections should undergo drug tests.\n“He said because of the evidence-based strong nexus between drug abuse and security challenges across the country, concerted efforts must be made towards tackling the drug scourge headlong.\n“In this regard, we are doing our best in our area of responsibility in the NDLEA,” Marwa revealed."
  },
  {
    "headline": "Six fighter jets to arrive in August —Emefiele",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, has disclosed that Nigeria will get 12 fighter planes from the United States of America to help fight insecurity in Nigeria.\nHe disclosed this while answering questions at the end of a two-day monetary policy committee meeting in Abuja on Tuesday.\nEmefiele, who lamented how the economy is being crippled by insecurity, stated that the arrival of the planes is in line with a pact made between the Nigerian government and the US government three years ago.\nAbout three years ago, the Federal Government and the United States signed a pact that resulted in a government-to-government acquisition of military equipment“Out of which, we are expecting 12 fighter planes that would help us solve our insecurity.\n“I am optimistic before the end of the year, around the year of the end, the security challenges confronting the country will substantially abate,” he added."
  },
  {
    "headline": "Nigeria will remain one despite challenges — Edwin Clark -",
    "summarized_story": "Kindly Share This Story:Elder statesman and Ijaw leader, Chief Edwin Clark, has said that Nigeria would remain united in spite of her many challenges.\n“Nigeria will remain one country.\n“I’m appealing to everybody, let’s have one Nigeria; a united Nigeria where everybody is equal.\nA united Nigeria where everybody has a right to aspire to whatever position he wants to aspire to.\n“A united Nigeria where religion does not determine what it should be and where ethnicity does not determine what it should be,” Clark said."
  },
  {
    "headline": "Teargas on policeman on duty exploded, not bomb ― Ebonyi PPRO",
    "summarized_story": "DSP Loveth Odeh, Command’s Public Relation Officer (PPRO) told newsmen on Tuesday in Abakaliki that the pictures were not in connection with a suicide bomber.\n“There is no bomb explosion in Ebonyi, but regrettably, this morning, one of our mobile police personnel attached to Afikpo on special duty was wounded by teargas.\n“The officer mistakenly hit a teargas hung on his belt, and unfortunately, the device exploded and wounded him and he died.\n“The lifeless body, the man in the picture is Inspector Idi Aminu, attached to 32 PMF Abakaliki but on special duty at Afikpo.\n“So, there is no bomb blast or explosion in Ebonyi."
  },
  {
    "headline": "GOFAMINT GO’s son, Folorunsho Abina, for burial Friday",
    "summarized_story": "Kindly Share This Story:The final home journey for Pastor Folorunsho Abina, the first child of the General Overseer of The Gospel Faith Mission International (GOFAMINT), Pastor E. O. Abina, will begin tomorrow, in Lagos.\nPastor Folorunsho Abina, who died on Wednesday, April 28, 2021, at the age of 55, was the pioneer pastor of the Kingdom House Assembly of GOFAMINT in FESTAC, Lagos.\nThe funeral service will be held at the Region 12 Headquarters of GOFAMINT, 20, Adekunle Banjo Avenue, Magodo Phase 2 Gate, Shangisha, Magodo, Lagos, followed by interment with family members and select pastors.\nA statement by the church said all COVID-19 protocols shall be adhered strictly to throughout the burial programmes which will be streamed live on the church social media site.\nThe family also used this medium to ask for peace to prevail in all regions, sectors, and states of the country."
  },
  {
    "headline": "Gov Emmanuel vows to complete all road projects before 2023",
    "summarized_story": "Kindly Share This Story:By Chioma Onuegbu UyoGovernor Udom Emmanuel of Akwa Ibom State has vowed that all road projects embarked upon by his administration would be completed before leaving office in 2023.\nEmmanuel spoke on Tuesday while commissioning some road and erosion control projects in the area Oron local government area, namely 2.1km Oron Highway, 1.8km Murtala Muhammed Way, 0.85km Customs road, and 0.4km Market Square Road, with standard side, drains measuring 5.1 kilometres.\nHe said he would however not be distracted by peddlers of the falsehood, and assured Akwa Ibom people that his government would remain focused on delivering its promises to the people.\nHe said, “Akwa Ibom is not like any other state.\nAkwa Ibom is PDP and PDP is Akwa Ibom and all the development in Akwa Ibom are by the PDP government”In her welcome remarks, the Senator representing Akwa Ibom South, Senator Akon Eyakenyi thanked the Governor for making the development of Oron among the priorities of his administration."
  },
  {
    "headline": "Criminality, banditry will not end in Nigeria without restructuring — Peter Obi",
    "summarized_story": "Kindly Share This Story:By Ikechukwu Odu, NSUKKAThe former governor of Anambra State, Mr Peter Obi, on Tuesday said only restructuring can end the escalating criminality, banditry and other forms of insecurity in Nigeria.\nAlso read:He also said that if Nigeria must grow, the nation must diversify the economy and equally invest in her youths to acquire a knowledge-based economy.\nMr Obi also said “Security is the most vital ingredient in a country’s existence.\nThe engine of our problem in Nigeria is restructuring and until that is done, things would continue to go wrong.\nThis is one of the reasons we should restructure Nigeria in order to put things right,” he said."
  },
  {
    "headline": "Constitutional review: Fayemi opens public consultation",
    "summarized_story": "The one-day consultation was held to harmonise views of the Government and people of Ekiti State on the review process of the 1999 Constitution (as amended).\nFayemi said the 1999 Constitution had been under severe criticism because it was largely a product of military decrees, adding that it did not emanate from process of public involvement, consultation nor pass through any referendum.\n“No doubt, constitutional making and review have always been a challenging issue in any society, and the reason for the challenges is not farfetched.\nSome of the speakers, who made presentations at the forum included the Attorney General and Commissioner for Justice, Olawale Fapohunda; Speaker Ekiti State House of Assembly, Rt.\nHon Funminiyi Afuye represented by his Deputy, Hakeem Jamiu; Chief Judge of Ekiti State, Justice Ayodeji Daramola represented by Justice John Adeyeye; Chairman Traditional Rulers Council and Alawe of Ilawe Ekiti, Oba Ajibade Alabi, Bishop, Catholic Diocese of Ekiti, Rev Felix Ajakaiye and Chairman Ekiti State Civil Society Organisation, Professor Christopher Oluwadare."
  },
  {
    "headline": "Northern elders declare position on open grazing ban, call for national dialogue",
    "summarized_story": "Northern Elders Forum, NEF, has declared support for the ban on open grazing by governors of the southern states.\nNEF said that it support any programmed transition that will eliminate open grazing and the establishment of productive, safe and sustainable options in managing the country’s huge national asset in animal husbandry.\n“So are postures that issue opportunistic ultimatums over convening national dialogue by the President.\nThe forum supports a citizen-driven national dialogue and a campaign to get the government to accord its outcome the respect it deserves.\nWe just want an end to insecurity, escalating cost of living and the hate and the fear which our leaders are triggering."
  },
  {
    "headline": "Open grazing: Garba Shehu has degraded office of Nigerian President",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has accused Garba Shehu, Senior Special Assistant on Media to President Muhammadu Buhari of degrading the office of Nigerian President following series of “provoking” statements from him.\nDAILY POST reports that the president’s spokesman via a statement on Monday, tackled the southern governors for banning open grazing in the region.\nRecall that the governors under the aegis of Southern Nigerian Governors Forum, during it’s recent meeting in Asaba the Delta State capital, resolved to ban open grazing in the region as a means of curbing the incessant clash between farmers and Fulani herdsmen.\nHIRIWA said Garba Shehu has used his public office to speak for “Fulani herdsmen since the present administration came on board in 2015”.\nThe group also carpeted Garba Shehu for “shamelessly siding with Miyetti Allah Cattle Dealers against the considered and well thought out proposal of 17 governors of Southern Nigeria who spoke on behalf of over 80 million citizens of Nigeria to ban open grazing of livestocks in a lasting bid to stop the incessant unprovoked attacks of farmers by some armed Fulani herdsmen”."
  },
  {
    "headline": "Workers protest non-payment of over three years salaries in Cross River",
    "summarized_story": "Workers in services of Cross River State have protested the non-payment of over three years and eight months’ salaries.\nThe aggrieved protesters, who staged a peaceful protest on Tuesday at the front of Government House in Calabar, carried placards with various inscriptions.\n“We have been dialoguing with the Cross River State government for months now to no avail.\n“The way things are going now, if something is not done by 2023, the civil service will be empty, call it December, 2023.\n“We are the ones to take over, we have worked and understudied the civil service,” he lamented."
  },
  {
    "headline": "NYSC: Reps under fire over move to scrap scheme",
    "summarized_story": "The Centre for Social Justice, Equity and Transparency, CESJET, has said the move by the House of Representatives to scrap the National Youth Service Corps, NYSC, was evil.\nCESJET said the amendment of the 1999 constitution aimed at discontinuing the NYSC scheme is an evil plot against Nigerian youths.\nRecall that a bill seeking to scrap the scheme, sponsored by Awaji Abiante, a lawmaker from Rivers State on Wednesday, passed through second reading at the green chamber.\nAddressing journalists in Abuja, the Executive Secretary of the group, Isaac Ikpa said the relevance of the scheme to contemporary Nigeria can not be overemphasised.\n“The Centre for Social Justice, Equity and Transparency is therefore alarmed that the Bill seeking for the scrapping of the NYSC has reached second reading in the House of Representatives."
  },
  {
    "headline": "Edo PDP takes over APC's factional secretariat",
    "summarized_story": "Leaders of the governing PDP in ward 2, while approving the relocation of the party secretariat, cited administrative conveniences for the decision.\nThe ward leaders also stated a committee should be set up to look for a ward secretariat within four weeks after a voice affirmation at the enlarged meeting.\nThey described the plot as undemocratic and unacceptable while asking Edo Governor to drop his deputy, Philip Shaibu, for full harmonisation.\nOn May 12, Obaseki met with members of PDP SWC while begging them to sheathe their swords to move the party forward.\nBut some stakeholders insisted the Governor should not be trusted with the olive branch he extended to SWC members"
  },
  {
    "headline": "Osun APC elders’ caucus suspends ex-chairman",
    "summarized_story": "By Toba Adedeji, OsogboThe Elders’ Caucus of All Progressives Congress (APC) in Osun State has suspended an ex-chairman, Elder Adebiyi Adelowo, for pioneering a splinter group within the party.\nThe elders also reaffirmed support for Governor Adegboyega Oyetola and his second-term ambition.\nA communiqué by signed by the chairman of the caucus, Chief Sola Akinwumi, “dissociated itself completely from a recent radio interview whereby a member of our body, Elder Adelowo promoted internal divisions within the party particularly on the formation of “The Osun Progressives -TOP” and accordingly suspends the said Elder Adebiyi Adelowo from the membership of APC Elders’ caucus forthwith.\nADVERTISEMENTREAD ALSO: Police in Jigawa arrest five over alleged attack on APC chairman“That the body enjoined every member of our party to remain committed, loyal and resolute towards strengthening of our party in Osun state.”Leaders and chieftains of APC in Ijesha North Federal Constituency had dissociated themselves from TOP."
  },
  {
    "headline": "JUSUN: Wike threatens to activate no work no pay",
    "summarized_story": "The governor spoke on Tuesday in Port Harcourt at the special court session in honour of the retiring Chief Judge of Rivers State, Justice Adama Iyayi-Lamikanra.\nADVERTISEMENTThe governor maintained that in the appointment of an Acting Chief judge, the most senior judge in the hierarchy remained an absolute condition.\nHe said the condition was not the same in the appointment of a substantive chief judge.\nHe stressed that under the leadership of Justice Iyayi-Lamikanra the state’s judiciary effectively enjoyed both administrative and financial autonomy never before experienced in this state.\nOkocha (SAN), said Justice Iyayi-Lamikanra judicial career was unblemished and commended her for digitalisation of the state judiciary."
  },
  {
    "headline": "APC responsible for burning of INEC offices",
    "summarized_story": "By Gbade Ogunwale, AbujaThe Peoples Democratic Party (PDP) has blamed the All Progressives Congress (APC) for the burning of assets and offices of the Independent National Electoral Commission (INEC) in different parts of the country.\nAccording to the main opposition party, the burning of INEC offices is meant to create an emergency situation and frustrate the smooth conduct of the 2023 general elections.\n“The PDP invites Nigerians to note the failure of the APC and its leaders to forcefully condemn this clear assault on our frontline institution of democracy.\nThis is also as the APC administration has failed to take decisive steps to protect INEC facilities from assailants.\nThe PDP called on the Inspector General of Police to immediately invite and question APC leaders over the burning of INEC offices."
  },
  {
    "headline": "BREAKING: CBN retains all policy parameters",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) said it again voted to retain the monetary policy rate at 11.5 percent.\nCentral Bank of Nigeria Governor Godwin Emefiele made the announcement during a press briefing at the CBN headquarters on Tuesday.\nThe MPC also noted that at least 70% of Nigeria’s population must be vaccinated if the country means to achieve economic recovery.\nResponding to questions on the CBN ban on cryptocurrency transactions in Nigerian banks, the CBN governor insisted that the encrypted nature of cryptocurrency transactions makes it hard for fraud to be investigated and criminals apprehended.\nAccording to Emefiele, no responsible Central Bank will support such transactions."
  },
  {
    "headline": "Breaking : gunmen raze Orji police station",
    "summarized_story": "From Stanley Uzoaru,OwerriAgain, weird looking gunmen has set the Divisional police station in Orji,Imo State on fire.\nThe incident is presently on now.\nOur correspondent gathered that the gunmen adorned in black and red beret are also shooting sporadically in the air ,scaring residents of the area.\nAs at the time of this report, the gunmen were said to be having fun wielding their gun unchallenged while the residents scamper for safety.\nDetails later."
  },
  {
    "headline": "Explosion rocks Ebonyi town, 1 killed",
    "summarized_story": "From Magnus Eze, EnuguThere is confusion in Afikpo, Afikpo North Local Government Area of Ebonyi following an explosion in the area.\nSources said the incident which took place at about 12:50pm around the Ndibe Beach-Eke Market Road, shattered the bearer of the item suspected to be an Improvised Explosive Device (IED).\nThe victim whose identity was not known as at time of filling the report was said to have been decked in military uniform.\nConfusion reigned in the whole place as the explosion happened close to Amaizu-Amamgbala Primary School, the Junior Secondary School and the ever busy Eke Ukwu Daily Market, Afikpo.\nDetails later"
  },
  {
    "headline": "BREAKING: 5 policemen feared dead as gunmen raze Police station in Enugu – The Sun Nigeria",
    "summarized_story": "Geoffrey Anyanwu, EnuguThe Iwollo Oghe Police station in Ezeagu local government of Enugu state was in the early hours of today attacked and burnt by unknown gunmen.\nNo fewer than five persons including police personnel were feared to have been killed in the attack.\nThe Police station building was fully razed with some property in the premises.\nThe State Police high authorities have left the Command headquarters to the station for an on the sport assessment of the damages and casualties.\nDetails later."
  },
  {
    "headline": "Fuel tanker explodes on Egbeda area of Lagos",
    "summarized_story": "The National Emergency Management Agency (NEMA) said a truck laden with Premium Motor Spirit (PMS) burst into flame in the early hours of Tuesday at the Banire/Ejigbadero Bus stop in the Egbeda area of Lagos.\nA Statement by NEMA spokesman Ibrahim Farinloye on its whatsApp platform said no live was lost or property destroyed, “however, the tanker with no registration number is still half filled with PMS and cross the major highway.”Farinloye said the incident occurred at about midnight, explaining that, “the NEMA received distress alert on a tanker fully loaded with about 45,000 litres of PMS exploded immediately after crashing at Banire/Ejigbadero Busstop, Egbeda, Lagos State.”He said the tankers was said to have loaded at Abule Ado, noting that the Police Disaster Management Unit and Gowon Estate Police Station have apprehended the driver of the truck.\nEfforts are on to decan and transload the content to another tanker before road can be opened for trafficFuel tanker explosion on Egbeda-Ipaja road today Tuesday May 25, 2021 pic.twitter.com/1puQIwYMy0 — The Sun Nigeria (@thesunnigeria) May 25, 2021Agencies on at the scene are NEMA, LASEMA Response Unit, Police DMU and the Gowon Estate Division"
  },
  {
    "headline": "£4.2m Ibori Loot Returned to Delta, Says Accountant General",
    "summarized_story": "By Adedayo AkinwaleThe Accountant General of the Federation, Mr. Ahmed Idris, has revealed that the £4.2 million loot recovered from a former Governor of Delta State, James Ibori, and his associates, which was recently repatriated from the United Kingdom, has been returned to Delta State.\nMalami’s stance consequently led to calls from the Delta State government and other stakeholders on the federal government to return the recovered loot to the state in line with established precedents whereby such funds were returned to states from which the recovered loot was stolen.\nHe explained that such funds like that of Ibrori which was looted from the treasury of a state were always returned to the state.\nSome recoveries are for State governments – specific state governments.\nSuch recoveries goes specifically to thoseStatess.”When asked where the Ibori loot was paid into, Idris without mincing words, said it was paid to Delta State government."
  },
  {
    "headline": "CBN Retains Interest Rate at 11.5%",
    "summarized_story": "By James EmejoThe Central Bank of Nigeria (CBN), Tuesday resolved to retain Monetary Policy Rate (MPR) otherwise known as interest rate at 11.5 per cent.\nThe CBN Governor, Mr. Godwin Emefiele, after the two-day monthly Monetary Policy Committee meeting, said the committee also resolved to maintain the asymmetric corridor of +100/-700 basis points around the MPR.\nThe apex bank also left the Cash Reserve Ratio at 27.5 per cent and Liquidity Ratio at 30 per cent.\nThe MPR is the rate at which the CBN lends to commercial banks and often determines the cost of borrowing in the economy.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Queries Legality of Southern Governors’ Ban on Open Grazing",
    "summarized_story": "•Okays ranching, revival of grazing reserves’ take-off in JuneBy Deji ElumoyePresident Muhammadu Buhari yesterday took issue with Southern governors over their ban on open cattle grazing in the region.\nThe president’s stance on the Southern governors’ Asaba Declaration came a few days after the Attorney-General of the Federation and Minister of Justice, Mr. Abubakar Malami (SAN), expressed similar views.\nMalami, while fielding questions on a live television programme, had kicked against the open grazing ban, saying it was unconstitutional.\nThe AGF had compared the Southern governors’ decision to their Northern counterparts banning spare parts trading in the North, considering the fact that the majority of spare parts traders in the North are from the South.\nIt is as good as saying maybe the Northern governors coming together to say that they prohibit spare parts trading in the North."
  },
  {
    "headline": "OPS Excited over Manufacturing Sector’s Recovery from COVID-19 Headwinds",
    "summarized_story": "The data also showed that the manufacturing sector recorded a 3.40 per cent growth rate in Q1 2021 after recording negative growth in the Q4 of 2020.\nIn addition, its Q1 2021 performance was also higher than the 0.81 per cent and 0.43 per cent it recorded in Q1 2019 and Q1 2020 respectively, which were pre-COVID-19 era.\n“In Q1 2021, manufacturing activities more or less rebounded to the level of pre-COVID-19 period.\nSo, it is expected that the sector will present a better performance in Q1 2021 than what obtained in Q4 2020.\nThe MCCI is a quarterly survey of the manufacturing sector."
  },
  {
    "headline": "Buhari Questions Legality of Southern Govs’ Ban on Open Grazing, Okays Ranching, Revival of Forest Reserves",
    "summarized_story": "The plan of action include approved actionable plan of rehabilitating grazing reserves in the states, starting with those that are truly committed to the solution and compliant with specific requirements.\nThe President also picked on the Southern Governors and described their recent decision to ban open grazing as illegal saying it infringes on the constitutional right of Nigerians to move freely in any part of the country.\nSouthern governors had at their summit in Asaba recently banned open grazing in the region to end the frequent clashes between farmers and herders and called for restructuring of the country.\nThe statement said it was very clear that there was no solution offered from the Southern Governors resolutions to the herder-farmer clashes that had been continuing in the country for generations.\n“The entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States."
  },
  {
    "headline": "EXCLUSIVE: How Gunmen Killed Mother Of IPOB Lawyer, Okoroafor 3 Months After He Escaped Assassination",
    "summarized_story": "Gunmen believed to be working for political actors have attacked and shot dead Madam Edith Okoroafor, the mother of a top lawyer of the Indigenous People of Biafra, Barrister Richard Okoroafor, in Ekiti State.\nBarrister Chukwuemeka OkoroaforThe IPOB lawyer’s mother was killed last Wednesday.\nWe shall be burying her in her hometown, Ekerawen in Agharho, Delta State, on Saturday,” the lawyer said in the notice.\nSee Also Military How Nigerian Army Attempted To Assassinate Biafran Lawyer, Nnamdi Kanu Cries OutIn the third week of February, there was an assassination attempt on Okoroafor’s life.\nThe IPOB leader, Nnamdi Kanu, had accused the Nigerian Army of attempting to assassinate Okoroafor."
  },
  {
    "headline": "EXCLUSIVE: How Gunmen Killed Mother Of IPOB Lawyer, Okoroafor 3 Months After He Escaped Assassination",
    "summarized_story": "Gunmen believed to be working for political actors have attacked and shot dead Madam Edith Okoroafor, the mother of a top lawyer of the Indigenous People of Biafra, Barrister Richard Okoroafor, in Ekiti State.\nBarrister Chukwuemeka OkoroaforThe IPOB lawyer’s mother was killed last Wednesday.\nWe shall be burying her in her hometown, Ekerawen in Agharho, Delta State, on Saturday,” the lawyer said in the notice.\nSee Also Military How Nigerian Army Attempted To Assassinate Biafran Lawyer, Nnamdi Kanu Cries OutIn the third week of February, there was an assassination attempt on Okoroafor’s life.\nThe IPOB leader, Nnamdi Kanu, had accused the Nigerian Army of attempting to assassinate Okoroafor."
  },
  {
    "headline": "#MySARSStory: Framed Into A Cultist",
    "summarized_story": "After his arrest, Eze Ebuka insisted he was not a cultist, so SARS tortured him into admitting he was.\nMy mother asked why they did not wait till daybreak.\nThe officers asked me to throw on some clothes, then scattered my room, looking for something.\nOn the way to the station, the officers asked me to provide names of five cult members if I wanted to be released.\nIn my neighbourhood, people really believed that I was a cultist, after hearing that I had confessed to being one."
  },
  {
    "headline": "#MySARSStory: Framed Into A Cultist",
    "summarized_story": "After his arrest, Eze Ebuka insisted he was not a cultist, so SARS tortured him into admitting he was.\nMy mother asked why they did not wait till daybreak.\nThe officers asked me to throw on some clothes, then scattered my room, looking for something.\nOn the way to the station, the officers asked me to provide names of five cult members if I wanted to be released.\nIn my neighbourhood, people really believed that I was a cultist, after hearing that I had confessed to being one."
  },
  {
    "headline": "Mob Burns Mentally Challenged Caught With AK47s In Lagos",
    "summarized_story": "A mentally challenged woman has reportedly been set ablaze by hoodlums after she was allegedly caught with three AK-47 rifles at Abule-Ado, Trade fair area in Badagry, Lagos State.\nAfter retrieving the weapons from her, the woman was mercilessly beaten by the angry hoodlums before they set her ablaze.\nAccording to an eyewitness who took the video, the unidentified woman had put the three sophisticated weapons in one of her bags and hid the bag to prevent people from seeing its contents.\nResidents claimed the woman who was said to be pretending to be mentally ill, was responsible for supplying weapons to armed robbers threatening the community.\nMeanwhile, when SaharaReporters contacted the Lagos State Police spokesperson, Muyiwa Adejobi, he said the police had not been briefed about the incident and had not received any reports to that effect."
  },
  {
    "headline": "Northern coalition asks FG to evacuate all herders from south",
    "summarized_story": "The Coalition of Northern Groups (CNG) has asked the federal government to relocate all herdsmen currently in the south “back home”.\nAdvertisementAbdul-Azeez Suleiman, the spokesman of the group, said the south is no more safe for the herders.\nThe call follows the resolution by governors of the southern region to enforce the ban on open grazing.\nAdvertisementIn reaction, the CNG released a statement on Tuesday saying the security of herders can no longer be guaranteed.\nThe group called on President Muhammadu Buhari and northern governors “to act now to protect law-abiding members of Fulani communities” from the “aggressive policy of the southern governors”."
  },
  {
    "headline": "Northern coalition asks FG to evacuate all herders from south",
    "summarized_story": "The Coalition of Northern Groups (CNG) has asked the federal government to relocate all herdsmen currently in the south “back home”.\nAdvertisementAbdul-Azeez Suleiman, the spokesman of the group, said the south is no more safe for the herders.\nThe call follows the resolution by governors of the southern region to enforce the ban on open grazing.\nAdvertisementIn reaction, the CNG released a statement on Tuesday saying the security of herders can no longer be guaranteed.\nThe group called on President Muhammadu Buhari and northern governors “to act now to protect law-abiding members of Fulani communities” from the “aggressive policy of the southern governors”."
  },
  {
    "headline": "£4.2m Ibori loot returned to Delta, says accountant-general",
    "summarized_story": "Ahmed Idris, accountant-general of the federation, says the £4.2 million loot recovered from James Ibori, former Delta governor, and his associates has been returned to the state government.\n“All agencies’ revenues go into the treasury single account (TSA), but the TSA does not apply to the federation account,” he said.\nSome recoveries are for state governments, and when they come, we will send them to the state governments, including the Ibori loot.\nAdvertisement“The recovery of the Ibori loot was paid to Delta state.\nThe committee had accused him of taking N3 billion from recovered loot on February 20, 2017."
  },
  {
    "headline": "£4.2m Ibori loot returned to Delta, says accountant-general",
    "summarized_story": "Ahmed Idris, accountant-general of the federation, says the £4.2 million loot recovered from James Ibori, former Delta governor, and his associates has been returned to the state government.\n“All agencies’ revenues go into the treasury single account (TSA), but the TSA does not apply to the federation account,” he said.\nSome recoveries are for state governments, and when they come, we will send them to the state governments, including the Ibori loot.\nAdvertisement“The recovery of the Ibori loot was paid to Delta state.\nThe committee had accused him of taking N3 billion from recovered loot on February 20, 2017."
  },
  {
    "headline": "Reps give accountant-general 48 hrs to account for 'missing' €5m recovered loot",
    "summarized_story": "The house of representatives ad hoc committee investigating recovered loot has given Ahmed Idris, the accountant-general of the federation (AGF), 48 hours to account for €5 million recovered funds said to be missing.\nHis admission adds to the many controversies that have surrounded recovered funds in Nigeria over the years.\nThere have also been questions on the transparency of the Buhari administration’s use of recovered funds, including from Sani Abacha, former head of state, who Transparency International estimates stole up to $5 billion from Nigeria.\nHis motion was, however, stepped down as Wole Oke from Osun state requested that more time be given to the accountant-general to update his records.\n“And, as I have said, what is important to Nigerians is an account for the total amount recovered from loot and proceeds from financial crimes and its application."
  },
  {
    "headline": "Jo’Burg, Marrakesh, Lagos: Which African cities have the highest internet speeds?",
    "summarized_story": "In a world of online gaming, Zoom meetings and video-on-demand streaming, internet speed is everything.\nSouth Africa leads mobile, Ghana fixed broadbandUsers can test internet speed using a number of options.\nFor this, we’ll focus on mobile internet speeds and latency – a measure of how responsive an internet connection is.\nAs such, we are limited in how certain we are of the cities with the top internet speeds in Africa.\nHowever, the numbers show a wide gap between internet speeds in Africa and the rest of the world."
  },
  {
    "headline": "Ethiopia awards its first private telecoms licence to Vodafone consortium",
    "summarized_story": "Ethiopia has awarded one out of the two private telco licences it intends to award to a consortium that includes the Vodafone group.\nThe consortium, which made a winning bid of $850 million, comprises Vodafone, Nairobi-based Safaricom Ltd, CDC Group Plc and Sumitomo Corp.\nEtisalat, Orange Telecoms, MTN and Saudi Telecom Company were some of the companies that registered interest.\nIn the end, only two companies put bids forward; the Vodafone consortium and MTN.\nRegardless, MTN also made a bid of $600 million which was considered not good enough, and now the second telecoms licence will now be retendered for new offers."
  },
  {
    "headline": "Successful product managers are walking encyclopedias.",
    "summarized_story": "Successful product managers need to learn a little bit about each of them because we do a lot of directing in our work.\nShould aspiring product managers expect to manage diverse teams?\nHow then do successful product managers navigate team management?\nI asked her what other skills she believes aspiring product managers need to be excellent in their roles?\nSuccessful product managers must own the product and visualize the bigger picture at all times."
  },
  {
    "headline": "Samsung A12 Vs Infinix HOT 10T: Which Is A Better Buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inches.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "New FirstBank Website Puts YOU, the customer, First!",
    "summarized_story": "With this design, the FirstBank website reformats to fit the screen of whatever device the visitor is using to view it and allows users the flexibility to conduct business wherever they may be.\nOn its new website, FirstBank puts an obvious button to online banking in top navigation so visitors know exactly where to go.\nSeparate Product Pages with Strong Calls-to-ActionThe FirstBank website has unique secondary pages for every product, and clear calls-to-action for people to be able to navigate to those pages.\nWith the new FirstBank website, customers are at an edge in the industry as they establish a relationship with the Bank that puts YOU, its customers, First.\nYou can visit the new FirstBank website here."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "[SPONSORED] Techuncode reviews Samsung A12 vs Infinix HOT 10T: Which is a better buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inch.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "[SPONSORED] Techuncode reviews Samsung A12 vs Infinix HOT 10T: Which is a better buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inch.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "Egyptian agritech startup, Mozare3, raises over $1 million pre-seed to grow its network of farmers",
    "summarized_story": "Egyptian agritech startup, Mozare3, has raised over $1 million in a pre-seed round.\nThe startup also plans to develop the first digital community for Egyptian farmers and offer them agronomy support through its professional network.\nThe agritech startup assists farmers sell their crops by working with institutional buyers like frozen vegetable processors, large retailers, and wholesalers.\nAccording to MENabytes, Abou Bakr said they currently have offtake agreements with 100 farmers and three large institutional buyers.\nAdvertisementThe Egyptian agritech startup plans to introduce credit solutions to fund purchases of different products like motorbikes for the farmers and their families."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Shell’s $10bn Bonga project to proceed in N320bn boost to govt revenue",
    "summarized_story": "Shell’s $10bn Bonga project to proceed in N320bn boost to govt revenueThe long-delayed $10billion Shell Bonga South West project is likely to commence soon as partners resolve a lingering dispute over terms and ink a deal that will restart the project.\nThis development could create jobs, boost Nigeria’s revenue, and prompt other operators whose projects have also been suspended due to contract disputes with the Nigerian…"
  },
  {
    "headline": "Starved of dollars, Nigeria struggles to meet cash-call obligations",
    "summarized_story": "The uncertainties surrounding access to foreign currency are currently making it difficult for Nigeria to meet cash-call arrears owed to multinational oil companies, which are joint-venture partners of the state-owned Nigerian National Petroleum Corporation (NNPC).\nThe development is a huge stain on NNPC, whose previous default rate of meeting cash-call obligations in various joint venture…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Real estate GDP improving but concerns remain",
    "summarized_story": "In the last two quarters, the Nigerian real estate sector has shown significant improvement, recording positive growth and showing prospects for investors.\nIts last positive growth of 0.93 percent before this period was recorded in Q1 2019.\nThe positive growth has also been attributed to increased construction activities and investment by investors scrambling for attractive yields in real estate as a preferred investment destination.\nAnalysts estimate that every square metre of real estate activity creates jobs for three people.\n“At this cement price, you cannot deliver at your price,” he lamented."
  },
  {
    "headline": "Nigerian car owners share sad experiences with mechanics",
    "summarized_story": "ADVERTISEMENTNigerian car owners, on Twitter, shared bitter experiences they had with mechanics in several parts of the country,The car maintenance business is largely informal in Nigeria with many mechanic workshops being individual standalone businesses.\nHowever, the Nigerians that shared their experiences, suggested that while the mechanics may not be working in groups, they share similar traits in cheating or defrauding car owners.\n“I gave mechanic my car to fix the A/C, nigga went to drop my car as a collateral for his debt,” a Tweeter user, Emmy Walker wrote.\n“The man who collected the car as collateral completely refused to release the car.\n“I started leaving the bare minimum petrol in my car before they pick up the car and the mechanic actually had the gut to complain,” she added."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "CBN’s MPC retains Monetary Policy Rate at 11.5%",
    "summarized_story": "OBINNA EZUGWUThe Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) on Tuesday, voted unanimously to retain Monetary Policy Rate (MPR) at 11.5 percent.\nThe committee also retained Cash Reserve Ratio (CRR) at 27.5 percent, and Liquidity Ratio at 30 percentIt equally maintained Asymmetric Window of +100 and -700 basis points around the MPR.\nMore later…"
  },
  {
    "headline": "Police kill two gunmen in Imo, recover arms",
    "summarized_story": "The Imo State Police Command says it killed two gunmen during a gun duel that lasted for hours in the Ohaji/ Egbema axis of the state on Tuesday.\nHe said the bandits were suspected to be part of the gang that attacked the Owerri Correctional Centre and the state Police command headquarters in Owerri, on April 5.\n“Imo Police Command neutralised hoodlums that masterminded the attack on the Command Headquarters and Correctional Centre in April, 2021.Recovered AK 47 Rifle with a cache of live ammunition,” he said.\n”One Ak47 Rifle with breach number 11654 and a cache of live ammunition were recovered.\nAlso recovered are a number of expanded ammunition, matchets and criminal charms tied around the waist of the suspects."
  },
  {
    "headline": "Just in: £4.2m Ibori loot paid to Delta State govt – Accountant General",
    "summarized_story": "The Accountant General of the Federation, Mr. Ahmed Idris has said the £4.2m ‘looted’ by ex-governor of the state, James Ibori, has since been transmitted to Delta state government.\nMr. Idris made the disclosure before the House of Representatives Ad hoc Committee on “Assessment and Status of all Recovered Loots Movable and Immovable Assets from 2002-2020 by agencies of the Federal Government of Nigeria for Effective Efficient Management and Utilization”.\nHe was responding to posers from the legislators on the difference between the Federation and Consolidated Revenue Fund Accounts of the Federation, and the desegregation of Recovered Assets and funds, according to Vanguard.\nRecall that the Federal Government had recently announced that the government of United Kingdom had returned £4.2m said to have been looted by Ibori and his associates while he was in office as governor."
  },
  {
    "headline": "‘You’re a dynamic leader’ – Ayedun salutes Aregbesola @64",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe former commissioner fo Home Affairs, Culture and tourism in Osun State, Prince Sikiru Adetona Ayedun, has described the minister of interior, Ogbeni Rauf Adesoji Aregbesola, as a dynamic leader whose leadership style is worthy of emulation.\nAyedun in a congratulatory message issued on Tuesday night the occasion of Aregbesola’s 64th birthday anniversary, noted that the giant strides of ‘Ogbeni’ in transformation of the state of virtues cannot be wiped away.\nHe said Aregbesola has demonstrated the passion to develop human capital thus, governed the state with the fear of God.\nThe former commissioner stressed further that, the interior minister has used his God’s endowed wisdom and knowledge to developed what will be called ‘ modern Osun’ today, and his legacies are there for people to see.\nHAPPY BIRTHDAY OUR SYMBOL”"
  },
  {
    "headline": "EFCC Arrests Niger Politician Over Alleged Employment Scam",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested one Mohammed Umar, a Bida, Niger State based politician and businessman, for alleged employment scam.\nEFCC spokesperson, Wilson Uwujaren, said operatives from the Cybercrime section at the EFCC headquarters, Abuja arrested Umar on May 18, 2021 following a petition from a victim whom he allegedly defrauded through a fake employment offer with the Nigeria Customs Service.\nHe said Umar allegedly requested for the sum of N750, 000 from the victim to facilitate the employment.\nHowever, the victim gave him a deposit of N200, 000 and promised to pay the balance when he gets his appointment letter.\nThe distraught victim consequently petitioned the EFCC, leading to the arrest of the suspect."
  },
  {
    "headline": "EFCC Arrests Niger Politician Over Alleged Employment Scam",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested one Mohammed Umar, a Bida, Niger State based politician and businessman, for alleged employment scam.\nEFCC spokesperson, Wilson Uwujaren, said operatives from the Cybercrime section at the EFCC headquarters, Abuja arrested Umar on May 18, 2021 following a petition from a victim whom he allegedly defrauded through a fake employment offer with the Nigeria Customs Service.\nHe said Umar allegedly requested for the sum of N750, 000 from the victim to facilitate the employment.\nHowever, the victim gave him a deposit of N200, 000 and promised to pay the balance when he gets his appointment letter.\nThe distraught victim consequently petitioned the EFCC, leading to the arrest of the suspect."
  },
  {
    "headline": "Chadian Crisis May Compound Insecurity In Nigeria, Others – Buhari",
    "summarized_story": "President Muhammadu Buhari on Tuesday in Abuja has said the consequences of a destabilised Chad to the West African sub-region cannot be imagined, saying it will compound the insecurity in Nigeria and other neighboring countries.\n‘‘The need to support the Chadian government to effectively carry out its planned 18-month transition is sacrosanct.\n‘‘The transition period should be civilian-led, with requisite powers given to the constitutionally mandated organs of government saddled with the responsibility of administering the country,’’ President Buhari in a statement by presidential spokesman, Femi Adesina, said.\nEulogising the Marshal of Chad, President Buhari described the late President as a committed African leader and statesman who stood for peace and stability of the Lake Chad Region, the Sahel and the African continent in general.\n‘‘His passion, commitment and zeal to the cause of the Lake Chad and African unity would be greatly missed,’’ he added."
  },
  {
    "headline": "Chadian Crisis May Compound Insecurity In Nigeria, Others – Buhari",
    "summarized_story": "President Muhammadu Buhari on Tuesday in Abuja has said the consequences of a destabilised Chad to the West African sub-region cannot be imagined, saying it will compound the insecurity in Nigeria and other neighboring countries.\n‘‘The need to support the Chadian government to effectively carry out its planned 18-month transition is sacrosanct.\n‘‘The transition period should be civilian-led, with requisite powers given to the constitutionally mandated organs of government saddled with the responsibility of administering the country,’’ President Buhari in a statement by presidential spokesman, Femi Adesina, said.\nEulogising the Marshal of Chad, President Buhari described the late President as a committed African leader and statesman who stood for peace and stability of the Lake Chad Region, the Sahel and the African continent in general.\n‘‘His passion, commitment and zeal to the cause of the Lake Chad and African unity would be greatly missed,’’ he added."
  },
  {
    "headline": "MOPOL Inspector Killed In Ebonyi Grenade Explosion Not Suicide Bomber – Police",
    "summarized_story": "The Ebonyi State Police Command has said that the explosion that rocked Afikpo community on Tuesday was not from a suicide bomber as initially suspected but a Mobile Police officer on special deployment to Afikpo North local government area of Ebonyi State, Mr Idi Aminu.\nThe Police Public Relations Officer (PPRO) DSP Loverth Odah, in a statement said that Mr. Aminu lost his life in an accidental hand grenade explosion.\nShe explained that the MOPOL Inspector mistakenly hit the lead of his grenade which was hanging on his waist with his elbow resulting in the deadly explosion.\nShe noted that the police officer was an operative of MOPOL 32 and not a suicide bomber, adding that his remains had been evacuated to a mortuary.\nSimilarly, the Ebonyi State government on Tuesday said that henceforth, there will be no procession in whatever guise in the state at any point in time."
  },
  {
    "headline": "Covid-19: We have achieved 96% target of our vaccination status",
    "summarized_story": "*Urges individuals eligible for second doses to do soDoosuur Iwambe, AbujaThe Federal Government, FG, has revealed that it has been able to achieve over 96%( 1,929,237) of its covid-19 vaccination target in Nigeria.\nWe have now provided the first COVID-19 vaccine doses to a total number of 1,929,237 Nigerians, representing 96% of the targeted population.\nIn addition, we have begun providing second doses, and that number has reached 4,683.\nThose individuals currently eligible for second doses will have received their first dose 6 to 12 weeks ago.\nAdditionally, the United States announced it will donate 20 million vaccine doses by the end of June to the COVAX scheme”."
  },
  {
    "headline": "Sifax boss, Afolabi, donates 4,000 copies of Obasanjo’s book to varsities, libraries",
    "summarized_story": "The biography account of the former president, written by his former aide, Otunba Femmy Carrena, was officially launched in December 2020.\nThe donation of the books to the Obasanjo Library for onward distribution to schools and libraries is to commemorate Obasanjo’s 84th birthday in arrears.\nREAD ALSO: Coup: Mali’s Military Detains President, Prime Minister, Defence Minister as UN KicksAccording to Afolabi: “Chief Obasanjo has done so much for Nigeria and he should be celebrated.\nThe entire 4,000 copies will be received by the former President Obasanjo on behalf of the Library.\nAccording to Carrena, who is the author of the book, he is passionate about anything on the former President Obasanjo because he has impacted humanity at all levels."
  },
  {
    "headline": "BREAKING: NAF sets up committee to conduct safety audit, following multiple crashes",
    "summarized_story": "The Nigerian Air Force has formed a committee to conduct a safety audit of its operational and engineering units after several air crashes, according to our correspondents.\nThe statement was signed by NAF Director of Public Relations and Information, Air Commodore Edward Gabkwet, on Tuesday.\n‘NAF Establishes Committee To Conduct Safety Audit Of Its Operational And Engineering Units,’ read the document.\nAt least 20 military officers have died in three crashes involving Nigerian Air Force jets in the last three months.\nDetails shortly…"
  },
  {
    "headline": "BREAKING: Recovered £4.2m Ibori loot returned to Delta -Accountant-General",
    "summarized_story": "The Accountant General of the Federation, Mr. Ahmed Idris, has said the £4.2m looted by a former Governor of Delta State, James Ibori, which the Federal Government recently repatriated from the United Kingdom, has been returned to the state.\nIdris made this known in Abuja on Tuesday when he appeared before the House of Representatives’ Ad hoc Committee on Assessment and Status of All Recovered Loots Movable and Immovable Assets from 2002 to 2020 by Agencies of the Federal Government of Nigeria for Effective Efficient Management and Utilisation.\nREAD ALSO: Coup: Mali’s Military Detains President, Prime Minister, Defence Minister as UN KicksThe Accountant-General, who was grilled by the committee for over one hour, stated that such funds looted from the treasury of a state are always returned to the state.\nHe added that states can sue the Federal Government to recover such funds.\nDetails later…"
  },
  {
    "headline": "Plateau auto crash: PDP financial secretary dead, other officials injured",
    "summarized_story": "PDP financial secretary dead, eight injured in Plateau auto crashThe Peoples Democratic Party Zonal tour for Plateau central was on Tuesday put on hold following an auto accident involving the party leaders which claimed the life of the state Financial Secretary, Mrs Mary Adar Gar.\nIt was gathered that those inside the 18-seater bus conveying the PDP leaders were the state Deputy chairman,Captain Bitrus Golden (retd.\nA speeding Vectra car hit the 18-seater bus carrying the PDP officials and the bus plunged into a lagoon after summersaulting several times.\n“The financial Secretary who was sitting at the back was flown out of the vehicle.\n“Unfortunately, she was confirmed dead at the Jos University Teaching hospital, where she was rushed to while others only sustained injuries."
  },
  {
    "headline": "Plateau auto crash: PDP financial secretary dead, other officials injured",
    "summarized_story": "PDP financial secretary dead, eight injured in Plateau auto crashThe Peoples Democratic Party Zonal tour for Plateau central was on Tuesday put on hold following an auto accident involving the party leaders which claimed the life of the state Financial Secretary, Mrs Mary Adar Gar.\nIt was gathered that those inside the 18-seater bus conveying the PDP leaders were the state Deputy chairman,Captain Bitrus Golden (retd.\nA speeding Vectra car hit the 18-seater bus carrying the PDP officials and the bus plunged into a lagoon after summersaulting several times.\n“The financial Secretary who was sitting at the back was flown out of the vehicle.\n“Unfortunately, she was confirmed dead at the Jos University Teaching hospital, where she was rushed to while others only sustained injuries."
  },
  {
    "headline": "Again, cholera outbreak kills 20 in Bauchi",
    "summarized_story": "Cholera outbreak in Bauchi State has killed no fewer than 20 people in the state, the state government has disclosed.\nThe Commissioner of Health in the state, Dr. Aliyu Maigoro, disclosed this at a press conference held at the Ministry’s Headquarters in Bauchi on Tuesday.\nDetails later…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Again, cholera outbreak kills 20 in Bauchi",
    "summarized_story": "Cholera outbreak in Bauchi State has killed no fewer than 20 people in the state, the state government has disclosed.\nThe Commissioner of Health in the state, Dr. Aliyu Maigoro, disclosed this at a press conference held at the Ministry’s Headquarters in Bauchi on Tuesday.\nDetails later…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Massive gun-battle in Imo: Army, air force, police confront gunmen",
    "summarized_story": "Security forces have engaged gunmen in massive gun-battle in Imo as the gunmen attempted to burn down the Orji Divisional Headquarters located at Owerri-Okigwe Road.\nThere was pandemonium in the area as people ran helter and skelter with sporadic shootings heard in different direction.\nCombined team of policemen, air force and soldiers engaged the hoodlums numbering about 20 in fierce battle to salvage the police station being reconstructed.\nImo State Police Command’s spokesman, Bala Elkana said the police and others were able to repel the gunmen and prevented them from destroying the police station.\nThe arrested suspects are: Chigaemezu Sabastine, 26; Casmir Ibe, 36; John Chinonso, 24; Chukwudi Okoro, 28 and Alozie Daberechi, 25."
  },
  {
    "headline": "Irate mob kills, sets mentally challenged woman ablaze in Lagos",
    "summarized_story": "By Kazeem UgbodagaA mentally challenged woman has been burnt to death by irate mob for allegedly being in possession of a stolen baby and three AK-47 rifle at Abule Ado Under Bridge, FESTAC, Lagos.\nA statement issued by the Lagos State Police Command’s spokesman, Muyiwa Adejobi said the woman was burnt to death on Monday.\nHe said the command has begun investigation into the killing and setting ablaze the mentally challenged woman.\n“The Commissioner of Police has therefore ordered that the matter be transferred to the State Criminal Investigation Department, Panti, Yaba-Lagos for proper investigation and the culprits should be arrested and charged to court with murder,” he said.\nAdejobi added that “The Commissioner of Police, Lagos State, CP Hakeem Odumosu, also warned against jungle justice which is inhumane, criminal and detrimental to smooth Administration of Criminal Justice in Lagos and in Nigeria at large."
  },
  {
    "headline": "Open grazing: Akeredolu stings Garba Shehu, says he’s a pitiable messenger",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has attacked Senior Special Assistant to the President on Media and Publicity, Garba Shehu for criticising the ban on open grazing by Southern governors.\nAkeredolu’s reaction was contained in a statement issued by the Senior Special Assistant on Special Duties and Strategy, Dr Doyin Odebowale, on Tuesday, title ‘Mr Garba Shehu: On the trail of an agent provocateur’.\nIt is our duty to continually nudge him off his current state of cognitive dissonance.\nAccording to Akeredolu, most traditional families in Nigeria have occupations, saying that pastoralism is not an exception.\n“Mr Garba Shehu is a major supporter of the current pervasive anarchy in the land,” he added."
  },
  {
    "headline": "BREAKING: Suicide Bomber Strikes Near Primary School In Ebonyi",
    "summarized_story": "According to Vanguard, a suspected suicide bomber detonated explosives in Ebonyi on Tuesday.\nAccording to witnesses in the area, the attack happened around 12:00 p.m. near a primary school in Afikpo community, Afikpo North Local Government Area.\n“He attempted to enter Amaizu/ Amangballa Primary School, but was turned away by school security since he could not justify his presence.\n“He quickly began rushing inside an adjacent bush before a loud bang was heard,” a witness told Vanguard.\nThe incident comes as Nigerian troops hunt down suspected IPOB members in Ebonyi and other parts of the country’s south-east, where separatist agitations have grown in recent weeks."
  },
  {
    "headline": "BREAKING: Recovered £4.2m Ibori Loot Returned To Delta — Accountant-General",
    "summarized_story": "The £4.2 million looted by a former Governor of Delta State, James Ibori, which the Federal Government recently repatriated from the United Kingdom, has been restored to the state, according to the Accountant General of the Federation, Mr. Ahmed Idris.\nIdris revealed this in Abuja on Tuesday when he testified before the House of Representatives’ Ad hoc Committee on Assessment and Status of All Recovered Loots Movable and Immovable Assets by Agencies of the Federal Government of Nigeria for Effective Efficient Management and Utilisation from 2002 to 2020.\nThe Accountant-General, who was interrogated for nearly an hour by the committee, maintained that funds plundered from a state’s treasury are always restored to the state.\nStates can sue the federal government to recoup such payments, he added.\nMore details later…"
  },
  {
    "headline": "BREAKING: Cholera Outbreak Kills 20 People In Bauchi",
    "summarized_story": "In Bauchi State, a new cholera outbreak has killed at least 20 people in different regions of the state.\nAccording to reports, 322 people have been affected with the sickness.\nDuring a press conference on Tuesday morning, the State Commissioner for Health, Dr Aliyu Mohammed Maigoro, provided an update on the situation.\nSince the first case was reported in April, he said, the disease has spread to nine local government regions.\nThe index instance, according to the Commissioner, was a 37-year-old patient admitted to Burra General Hospital on April 24, 2021."
  },
  {
    "headline": "Pictures: President Buhari presides over extraordinary summit of the Lake Chad Basin Commission in Abuja",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Gunmen invade, burn another Police station, 5 dead",
    "summarized_story": "Another Police station located in Iwollo Oghe Police station in Ezeagu local government area of Enugu state has been invaded and burnt on Tuesday morning.\nUp to five persons, including police personnel were feared killed in the attack that saw the police facility totally razed.\nIt was also learnt most of the vehicles and other property in the premises were burnt down.\nAlready, Police Public Relations Officer in Enugu state Daniel Ndukwe has confirmed the attack but could not give further details as at the time of filling this report.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Breaking: 20 dead as cholera hits 322 in Bauchi",
    "summarized_story": "At least 20 people have died while 322 have been infected with cholera following the outbreak of the disease in Bauchi state.\nState commissioner of health Dr Aliyu Maigoro disclosed this Tuesday while briefing newsmen on the epidemic at the ministry of health headquarters Bauchi.\nMaigoro explained that nine of the people who died hailed from Bauchi local government, four in Misau, three in Ningi, three in Toro and one person in Giade local governments.\nHe said the ministry through the state primary health care development agency responded immediately having been notified of the disease to avoid its spread to other communities in the state.\n“Four cholera treatment units have been activated in Bauchi metropolis in Abubakar Tafawa Balewa University Teaching Hospital (ATBUTH), urban maternity and primary health centre Kandahar."
  },
  {
    "headline": "Electronic giant bags Red Dot award for excellence in product design -NigPilot",
    "summarized_story": "Electronic giant, LG has bagged the Red Dot award for its strength in consumer product design and quality for most of its products across the globe.\n“Among the most meaningful is the honor bestowed upon LG designer appliances in the Materials and Surfaces category for their implementation of color, material, and finish CMF.\n“Introduced as a bold reimagining of conventional appliances, LG’s designer appliance is a melding of technologically advanced home appliances with premium materials that can be customized to meet the specifications of each customer.\nOther honors include recognition for LG WashTower™, a single-unit, vertical laundry solution that frees up more floor space while handling ultra-large loads, for exceptional design.\nThe Red Dot Design Award is one of the three most prestigious professional design competitions in the world and the distinctive mark has become established internationally as one of the most sought-after seals of quality for exceptional design.."
  },
  {
    "headline": "Environmental: LG to partner key stakeholders on improved planet -NigPilot",
    "summarized_story": "President, LG Electronics, Middle East & Africa Region, Mr. IL Hwan Lee has expressed the readiness to partner with key organizations with shared goals across the globe to promote an improved environment.\nAccording to him, LG’s pledge is to support stakeholders’ growth and independence through partnership.\nThe Achievement of the United Nations Sustainable Development Goals (SDGs) by 2030 is a Grand Challenge, especially for businesses.\n“As a responsible global corporate citizen, LG Electronics is set to contributing to the achievement of the SDGs as the main goal of its social contribution activities.\nSome of such that promote eco-friendly society include LG DUAL Inverter, LG NeON 2, LG WashTower and the CordZero M9 robot vacuum cleaner."
  },
  {
    "headline": "Lagos-lbadan Railway project is 90% Ready for Commissioning next month: Ameachi",
    "summarized_story": "Minister of Transportation, Rotimi Amaechi Chibuike, has said that the Lagos-Ibadan railway project is 90% ready for commissioning by next month.\nHe further urged the contractor, China Civil Engineering Construction Corporation CCECC, to employ more hands so that work can be completed quickly.\n“What we want to make sure that happens is the movement of cargo from the seaport to at least Ibadan.\nThere is a contract from Ebute Metta to Ibadan and then the other one from Ebute Metta to the seaport.\nReacting to questions on the vandalization of railway tracks and components on the Warri-Itakpe and Abuja-Kaduna corridors, the Minister directed the Managing Director of the Nigeria Railway Corporation NRC Engr."
  },
  {
    "headline": "ARAN commends FG over efforts to recover stolen artifacts -NigPilot",
    "summarized_story": "Artifacts Rescuers Association of Nigeria , (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral.\nObalosa reiterated committment of his associations’ readiness to continue working with the Federal Government and all security agents in the country, assuring that all Nigeria’s treasures will be returned."
  },
  {
    "headline": "Ibori’s £4.2m Loot Returned To Delta State Govt – Accountant-General",
    "summarized_story": "The Accountant General of the Federation, Ahmed Idris on Tuesday said the £4.2m looted by ex-Delta State Governor, James Ibori, has been returned to the state.\nAccording to him, any recovery arising from looted funds from a particular state would go directly to the states.\n“It was paid to Delta State,” he said when asked where the money was diverted to.\nHonourable Chairman, any recovery arising from the looted funds from a particular state goes to the state.\nThe state governors will not even allow this to fly.”READ ALSO: FG Expects £4.2m Ibori Loot From UK Govt SoonHe added, “Some recoveries are for some state governments, specific state governments."
  },
  {
    "headline": "FG’s Insistence On Open Grazing Points To A Hidden Agenda – Benue Govt",
    "summarized_story": "Benue State Governor, Samuel Ortom on Tuesday said the Federal Government’s insistence on open grazing suggests it has a hidden agenda.\nThe Presidency had on Monday faulted the recent resolutions of the Southern Governors, including the ban on open grazing in the entire southern part of the country.\nThe Southern Governors, the Benue leader added, adopted ranching as the alternative method of rearing animals.\nHe added, “As it stands, the Presidency is the lone hand pushing for the continuation of open grazing and the return of cattle routes of 1950s and 60s.\nBesides, the international best practice of animal husbandry is ranching; and that’s the stand of Benue State.”"
  },
  {
    "headline": "CBN Retains Monetary Policy Rates At 11.5%",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) has again voted to retain the monetary policy rate at 11.5 percent.\nThe announcement was made by the CBN governor, Godwin Emefiele during a press briefing at the CBN headquarters on Tuesday.\nHe explained that the move is expected to allow further economic growth, after the country exited recession in the fourth quarter of 2020, amid rising inflation.\nThe MPC also noted that at least 70% of Nigeria’s population must be vaccinated if the country means to achieve economic recovery.\nResponding to questions on the CBN ban on cryptocurrency transactions in Nigerian banks, the CBN governor insisted that the encrypted nature of cryptocurrency transactions makes it hard for fraud to be investigated and criminals apprehended."
  },
  {
    "headline": "Gunmen Kill Four Police Officers, Burn Down Station In Enugu",
    "summarized_story": "Gunmen on Tuesday attacked Iwollo Oghe Police Station in Ezeagu Local Government Area of Enugu State, killing four officers.\nThe officers died of gunshot wounds sustained in a gun duel while trying to repel the attack.\nAn investigation has been launched into the attack to fish out the assailants and their cohorts.\nEarlier in April, two officers were killed in an attack on a police station in Adani, Uzo-Uwani Local Government Area of Enugu State, raising concerns over incessant assaults on security formations in the largely peaceful South-East region.\nTo curtail these attacks, the Inspector-General of Police (IGP), Usman Baba last week launched a special operation designed to restore peace to the South-East."
  },
  {
    "headline": "Police Battle Gunmen In Imo, Five Suspects Arrested",
    "summarized_story": "Sporadic gunshots were reported on Tuesday as gunmen engage security operatives in a gun battle in the Orji area of Owerri, the Imo State capital.\nThe affected police station – Orji Divisional Headquarters – is located near the Government House and a correctional facility in Owerri.\nHe disclosed that the Commissioner of Police in Imo, Abutu Yaro, personally led the enforcement team to the scene.\nElkana stated that no life was lost during the shootout and the police recovered three vehicles from the suspects.\nHe assured the residents in the area that a mop-up operation was ongoing to arrest more suspects and recover their firearms."
  },
  {
    "headline": "Police, Local Vigilante Group Neutralise Ten Bandits In Zamfara",
    "summarized_story": "Police in collaboration with local vigilante group has neutralised ten armed bandits in ZamfaraThe bandits were neutralised when they attempted to invade Hayin Daudu village of Mada district in Gusau local government area of the stateA press statement from the police says troops of the police Tactical operatives deployed to keep peace in the area received a distress call from the local vigilante group on the attackThe statement adds that the Bandits stormed the area Monday night with the intention to attack the community, but the local vigilante group in collaboration with the police repelled the attackSpokesperson of the Zamfara state Police Command Shehu Mohammed noted that, the armed bandits carrying sophisticated weapons were heavily engaged in a gun duel by the Police and vigilante operativesAdvertisementMany of the bandits were said to have escaped into the forest with possible gunshot woundsThe police further says normalcy has been restored in the affected area with rigorous confidence building patrol being intensfied to forestall further attack on innocent citizens.\nThe Command insist it will not relent in its continious onslaught against the activities of recalcitrant bandits and other criminal elements in Zamfara State."
  },
  {
    "headline": "Osun APC “Igbimo Agba” suspends former Chairman, Adelowo Adebiyi",
    "summarized_story": "The “Igbimo Agba” of the All Progressives Congress in Osun State has suspended a former Chairman of the party in the State, Elder Adelowo Adebiyi for causing disunity within the party.\nThe decision to suspend Elder Adelowo Adebiyi was reached at the monthly meeting of the group held on Tuesday.\nIn statement Signed by the Chairman of the group, Chief Sola Akinwumi, the body also passed “a vote of confidence” in the administration of Governor Gboyega Oyetola and the leadership of Prince Gboyega Famoodun as the State Chairman of the APC.\nThe State enjoins every member of the party to remain committed, loyal and resolute towards strengthening the party in the State.\nRead the full statement here"
  },
  {
    "headline": "IPOB Forms Alliance With Cameroon’s Separatist Group To Purchase Weapons – Trending With Ojy Okpe",
    "summarized_story": "Robotic engineer, Dr. Olusola Ayoola has developed a Carbon Emission tracker drone for aerial surveillance in detecting hideouts of criminals within caves and forest areas.\nThe Indigenous People of Biafra has reportedly formed an alliance with a pro-independence movement in western Cameroon, known as Ambazonia Governing Council.\nOn Monday, members of Gauraka community in Niger state took to the streets to protest against the continuing spate of kidnappings in their community."
  },
  {
    "headline": "Nigeria: Ondo Governor Akeredolu Lambasts President’s Spokesman Shehu, Says He Works For Extraneous Interests",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has heavily lashed out at Garba Shehu, the Nigerian Presidential spokesman over his recent comment that queried the legality of the resolutions reached by the country’s 17 southern state governors made at a meeting in Asaba Delta State.\nMr Akeredolu observed that the presidential spokesman assiduously works for extraneous interests and must disclose the real motives of those he serves, and who’s definitely not the President.\nGovernor Akeredolu’s views were expressed in a statement on Tuesday and issued by his Senior Special Assistant on Special Duties and Strategy, Dr Doyin Odebowale.\nIt is clear that Mr Garba seems to have issues understanding the difference between licentious criminality and qualified rights under our law.\nMr Garba Shehu is a major supporter of the current pervasive anarchy in the land.”The Governor also warned “Mr Garba Shehu and his cohorts to desist from hurling insults at the elected representatives of the people."
  },
  {
    "headline": "Volcano Aftershocks Rock East DRC, Raise Fears of Fresh Eruption",
    "summarized_story": "Powerful aftershocks from the Mount Nyiragongo volcano have rocked the eastern Democratic Republic of the Congo (DRC) as the death toll from a recent eruption that left hundreds of families displaced rose to 32.\nThree days after Africa’s most active volcano roared back into life, tremors were shaking the region every 10 to 15 minutes on Tuesday morning.\nPeople don’t know which way to go,” a resident told AFP news agency.\nTwo rivers of molten rock flowed from the volcano at a height of 1,800 metres (5,900 feet).\nSeveral strong aftershocks were also felt in Rwanda on Monday, including a magnitude 5.1 earthquake under Lake Kivu, the Rwanda Seismic Monitor said."
  },
  {
    "headline": "Australia to Close Afghanistan Embassy Over Security Fears",
    "summarized_story": "Australia has abruptly announced it will close its embassy in Afghanistan this week, expressing fears over the “increasingly uncertain security environment” in Kabul in the wake of the US decision to withdraw its troops from the war-torn country.\nThe Taliban on Tuesday pledged to provide a “safe environment” to foreign diplomats after Australia announced it would shutter its embassy over security concerns.\nThe US withdrawal is part of an agreement Washington signed last year with the Taliban to end the war.\nAll US troops are expected to leave by September 11, the 20th anniversary of the 9/11 attacks.\nIn recent days, violence in the country has soared and Afghan forces have clashed with Taliban fighters not far to the east of Kabul."
  },
  {
    "headline": "Angelique Kidjo, Fally Ipupa, Omah Lay, Others to Join Idris Elba for 2021 Africa Day Concert",
    "summarized_story": "A star-studded line-up of guest appearances from some of the most well-known faces on the continent has been announced for the 2021 Africa Day Concert.\nThe day marks the establishment of the Organisation of African Unity 58 years ago.\nThe concert will also shine a spotlight on some of the most dynamic, emerging artistes from Africa.\nThese talented young African artistes are on the cusp of immense success and for the first time, they will perform on a global stage.\n“The Africa Day Concert 2021 will be a spectacular display of African excellence fitting of this year’s anniversary which also reflects current youth culture and energy."
  }
]