[
  {
    "headline": "2023: Ned Nwoko, Nollywood actors see me as trustworthy presidential candidate -Anyim",
    "summarized_story": "Former Secretary to the Government of the Federation and presidential hopeful, Pius Anyim, said he met with billionaire businessman, Ned Nwoko, and some Nollywood stars who promised to support his presidential ambition.\nAccording to him, they see him as a diligent, trustworthy and visionary candidate who can lead Nigeria into the future.\nNed Nwoko, Chairman Actors Guild of Nigeria, Mr Emeka Rollas, President, Actors Guild of Nigeria, Barr.\nKenneth Okonkwo, veteran Nollywood actor and other notable Nollywood actors to discuss how Nigeria can be better.\n“They all reiterated their commitment in supporting me in my quest as they see me as a diligent, trustworthy and visionary candidate who can lead Nigeria into the future,” the post read."
  },
  {
    "headline": "NDLEA intercepts 40,250kg codeine worth N2bn at Lagos port",
    "summarized_story": "The National Drug Law Enforcement Agency has intercepted 40,250 kilograms of Codeine based syrup at the Apapa seaport in Lagos which were imported from India.\nThis comes barely a week after the Agency seized 14,080kg of the banned substance at the same seaport.\nBoth seizures followed intelligence from foreign partners and cooperation of other port stakeholders such as Customs, DSS, Navy and others.\nGen. Mohamed Buba Marwa (Retd), commended officers and men of the Apapa Port Special Area Command of the Agency for their vigilance.\nHe expressed gratitude to foreign partners for sharing timely intelligence and other port stakeholders for their cooperation."
  },
  {
    "headline": "FG/ASUU impasse: We demand implementation of 2020 Memorandum of Action — ASUU AE-FUNAI",
    "summarized_story": "By Peter Okutu, AbakalikiThe Academic Staff Union of Universities, ASUU, branch of Alex Ekwueme Federal University Ndufu-Alike, AE-FUNAI, Ebonyi State, yesterday organized a solidarity rally to press home their demand for the implementation of the 2020 Memorandum of Action (MOA) by the Federal Government.\nMembers of the Union of AE-FUNAI during their rally, which took place within the University complex in Ikwo Local Government Area of Ebonyi State, were seen carrying placards with the various inscriptions including,“FGN will not rest until outstanding issues are resolved.\nFGN is unserious with the implementation of UTAS, comrades say no to amputated salaries and withheld allowances.\nAlso Read:Strike: ASUU takes decision at NEC meeting in UNILAG weekend“FGN, we are tired of your deceit; Government is unconcerned, unresponsive to the development of ASUU.\nFGN listen to the words of wisdom and ASUU must salvage the university system.”In a Resolution of Mobilization Congress of ASUU AE-FUNAI reached today, Wednesday, February 9, 2022, signed by Comrade Ogugua Egwu and Comrade Joseph N. ChukwuChairman and Secretary, the Union expressed readiness to comply with the proposed strike action of ASUU."
  },
  {
    "headline": "FG not showing integrity to our demands, forced members into IPPIS — ASUU",
    "summarized_story": "We have given FG enough timeBy Ike Uchechukwu — CalabarThe Academic Staff Union of Universities, ASUU, has accused the Federal Government of not showing concern towards the agreement it entered with the union in 2009.\nDr Patrick Ineji, Chairman of the University of Cross River State (UNICROSS) branch of the Union, said this in Calabar on Thursday after a congress with union members in the institution.\nThe ASUU Chairman maintained that UTAS has passed an integrity test and found it worthy to be used for payment of salaries for universities lecturers.\n“The Federal Government has refused to sign and implement the 2009 renegotiated agreement with ASUU.\n“The Federal Government forced ASUU into IPPIS with all the abnormalities that followed the exercise and refused to deploy UTAS that is a better option to IPPIS."
  },
  {
    "headline": "How to address Nigeria’s socio-economic challenges – Uche Nwankwo",
    "summarized_story": "It is noteworthy that one of the chief characteristics of Nigerian professionals is the trend towards fragmentation and the establishment of one-man practices.\nWhat are those peculiarities of the Nigerian professionals that seemingly make them so different from professionals from other lands?\nIndeed, in recent times, many leading Nigerian professional architects and engineers have turned into portfolio consultants.\nThe model is applicable to all private sector players and operators in the Nigerian economy, be they in the commercial, industrial or agricultural sectors.\nThese then are some of the main factors or manifestations that shape the decidedly parlous Nigerian economy."
  },
  {
    "headline": "OOU Convocation: Abiodun tasks universities on innovations",
    "summarized_story": "The beneficiary – graudands are Iloka Peter Ebuka of the Faculty of Pharmacy and Awolumate Adebisi Fatima of the Faculty of Agricultural economics.\nIloka scored Cumulative Grade Point Aggregate(CGPA) of 4.92 to emerge the overall best graduating student for 2020/2021 academic session, while Awolumate Adebisi Fatima of the Department of Cooperative Management and Rural Development emerged overall best graduating student for 2019/2020 session with 4.86 CGPA.\nUniversities of the 21st Century must embrace ingenuity and innovation to surmount the challenges that confront them”.\nHe also also urged the youth, particularly students, to emulate the best graduating students in learning and character of diligence and hardwork.\nThis is yet another initiative of your government to provide a wholesome and awesome university education experience for our students”."
  },
  {
    "headline": "Govs, politicians have hijacked NNPC’s N621bn road rehabilitation fund — PTD",
    "summarized_story": "The PTD National Chairman, Comrade Samon Akanni Oladiti, told journalists in Abuja yesterday that over three months after it reached an agreement with NNPC for the rehabilitation of the roads, no work has taken place.\nNNPC Group Managing Director, Mallam Mele Kyari, had in December last year, presented a symbolic N621 billion cheque to the Minister of Works and Housing, Babatunde Fashola, to signify the commencement of the roads’ rehabilitation programme.\nOladiti, however, claimed that despite the transfer of the fund to the Ministry, no work had taken place, leaving PTD members in grave danger in the hands of bandits.\n“Every kobo of the approved fund must be accounted for and we must see and broadcast the pre and post rehabilitation of all the identified 21 federal roads to the whole nation.\nOladiti lamented that its members were spending over three weeks on the road transporting petroleum products across the country, saying the situation has become unbearable."
  },
  {
    "headline": "Fuel scarcity: Queues surface in Osogbo, Ile-Ife, Ilesa",
    "summarized_story": "Long vehicular queues have started to surface in fuel stations in Osogbo and across other major towns in Osun State.\nDAILY POST gathered on Wednesday that many fuel stations were not dispensing Premium Motor Spirit (PMS), a situation which led to queues in the few outlets that were selling the product.\nIt was also gathered that as a result of the queues, gridlocks have started to surface in the major towns like Ilesa and Ile-Ife as some fuel stations were not open while the few that had the products had long queues extending into some sections of the road.\nDAILY POST also learnt that in Ilesa town, most of the fuel stations which have PMS were filled with anxious motorists waiting to buy the products.\nThe PMS, DAILY POST gathered, was discharged by MT Nord Garnier and it had 20 per cent methanol."
  },
  {
    "headline": "Fuel scarcity: 300 million litres arrive Nigeria",
    "summarized_story": "Following the scarcity of Premium Motor Spirit, PMS, in some major cities, about 300 million litres of the product have arrived Nigeria.\nPersonal Assistant to President Muhammadu Buhari on New Media, Bashir Ahmed stated this in a tweet on Thursday, quoting the CEO of the Nigerian Midstream and Downstream Petroleum Regulatory Authority, Farouk Ahmed.\nAccording to him, the newly imported 300 million litres would close the gap and ensure the availability of the product for Nigerians.\n“At least six vessels ordered by the @NNPCgroup have arrived in the country, the vessels came in with 300 million litres of PMS (petrol) meant to close the gap created by the contaminated petrol withdrawn from depots and filling stations,” Bashir said, quoting Farouk.\nDAILY POST reports that the Federal Government, after confirming that the scarcity was birthed by the importation of over 100 million adulterated fuel into the country, vowed to investigate the cause of the matter."
  },
  {
    "headline": "Mass media will remain strategic partners to NCC – Danbatta",
    "summarized_story": "The mass media, whether print, broadcast, online, or other specialised genres, will remain central and strategic stakeholders to the Nigerian Communications Commission (NCC) in its commitment to delivering on its regulatory mandates as enshrined in the Nigerian Communications Act (NCA) 2003 and other policy instruments.\nSpeaking through the Commission’s Director of Public Affairs, Dr Ikechukwu Adinde, Danbatta said NCC remains irrevocably committed to deepening its already established relationship with media.\nThe EVC said by the reckoning of stakeholders the Commission has performed well, and it recognises the role of the mass media in its successes.\nWhile thanking the Management of National Economy for the visit, commendation and support to the Commision over the years, Danbatta also expressed NCC’s commitment to sustaining its favourable relationship with the media.\nThe delegation from the National Economy was led by Chief Mike Okpare, Vice Chairman."
  },
  {
    "headline": "Zamfara Assembly commences impeachment process against Deputy Governor",
    "summarized_story": "Alhaji Nasiru Magarya, the Speaker, Zamfara State House of Assembly, has told Shehu Anka, the Clerk, to issue all members with the impeachment notice of the deputy governor, Mahdi Gusau.\nA statement from the spokesman of the House, Mustafa Kaura stated that the action was pursuant to Section 188 of the 1999 constitution of the Federal Republic of Nigeria (as amended).\nThe statement explained that the Speaker gave the directive under an announcement contained in the House’s Order Paper of Wednesday that enable the House members to carefully study all the allegations levelled against the deputy governor.\nAccording to the statement, “With this development, the House is following due diligence of the law as contained in the relevant provisions of the 1999 constitution of the Federal Republic of Nigeria (as amended).”Zamfara: I was suspended for initiating Speaker’s impeachment – Lawmaker"
  },
  {
    "headline": "Katsina: 50 innocent citizens killed in one month – CNG",
    "summarized_story": "The Coalition of Northern Groups, Katsina State chapter, has described the killing of over 50 innocent citizens in the state by terrorists in one month as worrisome and demoralizing while reacting to the recent killing of a Divisional Police Officer (DPO) in Jibia among others.\nIn a condolence message to the bereaved and the state, the CNG Northwest Coordinator, Jamilu Aliyu Charanchi said, “it is quite shocking and frightening to note that “some of our villages are firmly under the control of the bandits where levies or taxes are imposed on our people, subjecting them to further economic deprivation and devastation.\nThe stories are condemnably demoralizing as over 50 innocent, defenceless and impoverished citizens of the state were killed systematically in the last four weeks.”Considering the recent spike in the rate of attack in the state, CNG says it is obvious that “the government and its functionaries have lost the political will and determination to decisively deal with the problems once and for all,” citing the recent unchecked decimation, destruction of lives, abuse and exploitation of women, and extortion of poverty-stricken communities by terrorists in the state.\nWhile decrying the ongoing killings, abductions, maiming and exploitations by terrorists of helpless and defenceless citizens in the state, CNG says it appears that “the Federal Government have completely surrendered prerogative of the use of force to the bandits/ terrorists who now operate parallel governments in villages and communities in the state, where they impose taxes and levies on villages and kill people at will.”To end the tide, the CNG charged the youth to rise up to the occasion and equally called on traditional rulers to stand with their people over the difficult and scary situation in the bid to combat the menace for the collective survival of people in the state.\n“Communities must work together under the traditional institutions, religious leaders and community leaders are to source for an alternative method of preserving and protecting their lives, properties and communities as our security architecture proves incapacitated and or reluctant to decisively and resolutely deal with the problem,” CNG noted."
  },
  {
    "headline": "Toxic fuel: Was it off spec or contaminated?",
    "summarized_story": "NNPC, as the sole importer of PMS into the country, awards contracts to its vendors for shipment of the commodity.\nThe vendors, depending on their partnership with oil merchants in turn contract them for shipment into the country.\nBut the question on stakeholders mind is at what point could the product have been contaminated?\nThis is because the vendor contracted to import the fuel already knows the standard requirement of the country.\n- Advertisement -However, for some stakeholders, attention should be focused on the importer, Duke oil and Litasco, for the “off spec” brought into the country."
  },
  {
    "headline": "IPOB warns against defaming Kanu’s lawyer",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has warned one Emeka Ugwuonye against defaming and distracting its legal luminary, Barrister Ifeanyi Ejiofor.\nThe group accused Ugwuonye, who it termed as attention seeker of being hired by enemies of its struggle, to distract the legal representative, describing his mission as dead on arrival.\nIPOB also demanded Ugwuonye desist from making further derogatory remarks against its lead Counsel and retrace his steps.\n“We wish to put it to this man that he cannot succeed in his evil mission by writing fiction against our most respected lawyer.\n“Emeka Ugwuonye is aware that IPOB can never hire him no matter how much he schemes."
  },
  {
    "headline": "Lawyer: Ex-JAMB Registrar Ojerinde shielded firms, assets in ‘N5.2b fraud’",
    "summarized_story": "Oyewole said Ojerinde did this by listing his children, friends and associates as directors and shareholders of the companies.\nThe lawyer also told the court that he acted on instructions from Ojerinde, including the houses he bought for the defendants in his (the lawyer’s) firm’s name.\nWhen taken through series of documents tendered as exhibits, the lawyer identified some shareholders and directors of some of the companies.\nA moment later, the prosecuting lawyer showed the witness a document containing names of the bank’s shareholders and their allotted shares.\nOjerinde and a company – Dolaf Nigeria Limited – are also shareholders in the bank."
  },
  {
    "headline": "Hushpuppi: CAC urges Buhari to reinstate Kyari after panel report",
    "summarized_story": "CAC further stressed: “The letter was very clear on the fact that all investigations done have cleared DCP Kyari of all criminal and corruption allegations”.\nKyari was implicated by Abbas Ramon, popularly known as Hushpuppi, a Nigerian undergoing prosecution in USA for fraud.\n“Second investigations also cleared Kyari on all criminal/Corruption grounds but it was clear from the first investigation and second investigations that, two key areas of infractions on police duties were mentioned against Kyari.\n“These infractions were deemed disciplinary offences relating to internal police matters and not corruption or criminal offences.\nThese infractions which are not criminal offences are always handled internally between the Police and Police Service Commission based on disciplinary laid down rules.”"
  },
  {
    "headline": "Sylva: govt will unravel how toxic petrol was imported",
    "summarized_story": "These and other issues around the toxic petrol are to be unravelled after a probe by the Federal Government, Minister of State Petroleum Resources Timipre Sylva said yesterday.\nIt is responsible for the inspection of the imported petroleum products.\nNMDPRA on Tuesday said methanol above Nigeria’s specification was discovered in a limited quantity of petrol in the supply chain.\nIn Ebonyi State, the Nigeria Security and Civil Defence Corps (NSCDC) arrested six persons conveying 90,000 litres of adulterated petroleum products.\nTotal crude oil and gas export receipt for the period of August 2020 to August 2021 stood at $1.84billion."
  },
  {
    "headline": "Fuel queues persist in Lagos, Abuja",
    "summarized_story": "The development has equally led to a slight increase in the cost of Transportation.\nAlso, the assurance by the Independent Petroleum Marketers Association of Nigeria(IPMAN) to consumers that fuel would be available from yesterday(Wednesday) proved unrealistic as queues at both independent and major fuel outlets persisted, yesterday.\nSpeaking after the meeting of the Federal Executive Council (FEC) presided over by President Buhari at the presidential villa, Abuja, Sylva cautioned against drawing conclusions before the investigation is completed.\nMinister of Interior, Rauf Aregbesola, on his part said the council granted approval made by the Advisory Committee on Nigeria citizenship for 286 foreign nationals out of 600 applications received.\nHe said 208 of those approved were granted citizenship by Naturalisation, while 78 others were granted citizenship by registration."
  },
  {
    "headline": "14 govs, 13 ex-govs, 3 former senate presidents, others meet on state-of-the-nation",
    "summarized_story": "By Chukwudi NwejeAs the 2023 transition to a new administration approaches, a group, The 2022 Committee, comprising no fewer than 14 incumbent governors, 13 ex-governors, three former Senate Presidents and other prominent citizens, cut across various sectors, have met in Lagos on how the chart a way forward for the country.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nWe must have a secure, peaceful and united nation before we can have candidates for political offices.\n“The Committee believes that what Nigeria needs today is for all patriots to come together to rescue our nation from all political, economic and security threats, and promote the unity of Nigeria."
  },
  {
    "headline": "NNPC names MRS, Oando, Emadeb Consortium, Duke Oil as importers of methanol-blended petrol",
    "summarized_story": "The Nigerian National Petroleum Company Limited has named MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium, Oando and Duke Oil as importers of the methanol blended petrol into the country.\nHe said MRS imported the methanol-blended fuel through a vessel named MT Bow Pioneer, while Emadeb/Hyde/AY Maikifi/Brittania-U Consortium brought in the product through a vessel MT Tom Hilde.\nOando, he said, imported its product through a vessel, MT Elka Apollon, while Duke Oil brought its product through MT Nord Gainer vessel.\n“NNPC investigation revealed the presence of methanol in four (4) PMS cargoes imported by the following DSDP suppliers namely MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium, Oando and Duke Oil.\n“The allegation reported against the Company that MRS imported contaminated products, is therefore mischievous, false and untrue."
  },
  {
    "headline": "2023: PDP’s unity important to wrest power from APC –Wike",
    "summarized_story": "From Gyang Bere, Jos and TONY JOHN, Port HarcourtRivers State Governor, Nyesom Wike, has said the unity of the Peoples Democratic Party (PDP) ahead of the 2023 presidential election is sacrosanct to salvaging the country from the failed APC government in 2023.\nHe noted that APC had failed Nigeria woefully and the only hope that the country had was the Peoples Democratic Party (PDP).\nHe explained that the 2023 presidential election in PDP was not about North or South, neither was it about Christian or Muslim, but about the unity of PDP to take over power in Nigeria and Plateau State.\n“I want every individual to keep his or her aspiration and focus on how the party will be united to salvage the country and to salvage Plateau State from APC.\n“Plateau State is ripe for PDP to take over, because APC has performed woefully as far as Nigeria and this state is concerned, I stand to be challenged by anybody.”"
  },
  {
    "headline": "No going back on strike if govt fails to honour agreements –ASUU",
    "summarized_story": "The decision was taken at ASUU-FUOYE branch congress and in reaction to the lingering failure of the Federal Government to honour the agreements reached with the union.\nPrincipal officers present at the congress include; Olu Olu Olufayo, zonal coordinator, ASUU, Akure Zone; Yinka Awopetu, chairperson, ASUU-FUTA; Kayode Arogundade, chairperson, ASUU-EKSU and other leaders in ASUU, Akure Zone.\n“The government has not been sincere regarding the performance of Integrate Personnel Payroll Information System as a payment platform in that some lecturers of the Federal University Oye-Ekiti are owed salary and promotion arrears by the government.\n“We are ready to speak the language the government understands to get it adhere to the agreements signed with the union.\n“The only pragmatic solution to avert the impending strike is to sign and implement the renegotiated agreements."
  },
  {
    "headline": "2022 Committee Mobilising Nigerians for Quality Leadership",
    "summarized_story": "•Building consensus for country’s rebirthEmmanuel AddehThe 2022 Committee has resolved to mobilise Nigerians across party lines and social strata for quality leadership of the country at all levels as the elections to choose new leaders in 2023 draw near.\nThe meeting, which held from February 4 to 6 under the aegis of “The 2022 Committee”, the conveners pointed out, remained non- partisan.\nThey said the retreat to chart a new consensus for national rebirth was attended by 14 incumbent governors, 13 former governors, and three former senate presidents.\n“The 2022 Committee” conveners stated, “Whilst the 2022 committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction.\nBut the coordinators of the meeting stated that although all the 100 leading lights of the 2022 committee had the capacity for national leadership, it should not be linked to the politics of 2023."
  },
  {
    "headline": "Adulterated Fuel: Kyari Names MRS, Emadeb-consortium, Oando, Duke Oil as Culprits",
    "summarized_story": "But the NNPC GMD’s explanation ran contrary to an earlier press statement released by MRS, where the company denied culpability.\nThe petroleum products delivered are usually equivalent in value to the crude oil received from NNPC subject to the general terms and conditions as advised.\nAccording to him, as soon as the vessels complete discharging and start pushing products to oil marketers, the fuel queues in Lagos should fully disappear by Friday.\nOther attendees at the meeting included top officials of NNPC, Major Oil Marketers Association of Nigeria (MOMAN), and members of the Depots and Petroleum Products Marketers Association of Nigeria (DAPPMAN).\nNARTO had threatened to stop haulage of petroleum products across the country over the hike in the price of diesel to N430 per litre and other operational challenges."
  },
  {
    "headline": "NNPC Rakes in N2.613trn from Petrol Sales in One Year",
    "summarized_story": "•Posts $224.29m Crude Oil RevenueEmmanuel Addeh in Abuja and Peter Uzoho in LagosThe Nigerian National Petroleum Company (NNPC) Limited yesterday announced that it made N2.613 trillion from the sale of petrol between August 2020 and August 2021.\nA breakdown of the figures captured in the August 2021 NNPC Monthly Financial and Operations Report (MFOR) indicated that export of crude oil amounted to $7.77 million.\nTotal crude oil and gas export receipt for the period of August 2020 to August 2021 stood at $1.84billion, the company revealed.\nNNPC said in the report, “A breakdown of the figure indicates that petrol accounted for 99 per cent of total sales, while Automotive Gas Oil (AGO), also known as diesel, accounted for the rest.\n“Total sale of white products for the period of August 2020 to August 2021 stood at 20.032 billion, with petrol accounting for 99.81 per cent."
  },
  {
    "headline": "JUST IN: Bandits Kill DPO, Soldier in Katsina",
    "summarized_story": "Injure army captainFrancis Sardauna in KatsinaThe Divisional Police Officer (DPO) of Jibia Local Government Area of Katsina State, DSP Abdulkadir Rano and one soldier have been killed in a gun battle between terrorists and security personnel at Magamar Jibia community.\nTHISDAY gathered that the terrorists who invaded the border community on Tuesday night, also shot an army captain on his lap and left many residents with varying degrees of injuries.\nA vigilante commandant in the community who pleaded anonymity, told THISDAY on Wednesday that the marauding terrorists abducted the wife of a businessman in the community.\nThe attack was said to be carried out by the terrorists under the groups of Dangote, Dan Karami and Turji.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "The 2022 Committee: Eminent Leaders Met to Build Consensus for National Rebirth",
    "summarized_story": "The meeting of 100 leading business, political, civil society and thought leaders in Lagos over the last weekend was to build consensus for national rebirth, the 2022 Committee has said.\nA statement issued Wednesday on behalf of the Conveners by the Chairman of THISDAY/Arise Media Group, Mr. Nduka Obaigbena, and former Presidential Liaison Officer to the Senate, Mr. Kashim Ibrahim-Imam, said the meeting which held from February 4 to 6 under the aegis of The 2022 Committee, in a non- partisan retreat to map a new consensus for national rebirth, was attended by 14 current governors, 13 former governors and three former Senate Presidents.\nParticipants, working in 3 Sub-Committees of National Security, The Economy and Nigeria in Transition, the statement said, “recognised that there is an urgent need to seek common ground and irreducible minimum actions to stabilise the polity at this critical time of transition.”The statement, coming on the heels of unfounded narratives on the purpose of the meeting, said ”whilst The 2022 Committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the Committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction – candidates are only chosen by political parties and we are not a political party.”Noting that all the 100 leading lights of the 2022 Committee have the capacity for national leadership, it said amongst the active participants in the work of the Committee were over seven persons, from three or more political parties, who had already publicly declared their aspirations to lead the country but were desirous of working with other patriots for non-partisan greater national goals.\n“We must have a secure, peaceful and united nation before we can have candidates for political offices,” it added.\nThe statement further said that The 2022 Committee believes that “what Nigeria needs today is for all patriots to come together to rescue our nation from all political, economic and security threats, and promote the unity of Nigeria.”It said the meetings will continue, “as we work with Federal and State Governments, current and future political leaders of all political persuasions, as well as other eminent patriotic citizens, for the greater good of the Nigerian people.”It therefore called on all patriotic volunteers, who are willing and able, to join this collective effort to stabilise the system so that a new Nigeria, that all can be proud of, could be builtShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "ISIS Expanding In Nigeria, Other Africa Countries Despite Leader’s Death, United Nations Warns",
    "summarized_story": "The United Nations Office of Counter-Terrorism says the Islamic State of Iraq and Levant (ISIL or ISIS), a terrorist group, is expanding its affiliates and network beyond Syria and Iraq to Africa.\nISISThe under-secretary-general said that the terrorist activities were gaining ground in the Central and West Africa, which he said continues at an “unsettling” scale and pace.\nAccording to him, the terrorist activities intensifying in Central and West Africa – especially Nigeria, Burkina Faso, Cameroon, the Democratic Republic of Congo, Mali and Niger and attacks increasingly reported in the border area between Mozambique and Tanzania.\nHe added that a subsequent targeted attack reportedly resulted in the death of the ISIL/Da’esh leader, Amir Muhammad Sa’id Abdal-Rahman al-Salbi, widely known as Abu Ibrahim al-Hashimi al-Quraishi.\n“We have learned over the past two decades that counter-terrorism is a long-term game and that there are no quick fixes,” he stressed."
  },
  {
    "headline": "ISIS Expanding In Nigeria, Other Africa Countries Despite Leader’s Death, United Nations Warns",
    "summarized_story": "The United Nations Office of Counter-Terrorism says the Islamic State of Iraq and Levant (ISIL or ISIS), a terrorist group, is expanding its affiliates and network beyond Syria and Iraq to Africa.\nISISThe under-secretary-general said that the terrorist activities were gaining ground in the Central and West Africa, which he said continues at an “unsettling” scale and pace.\nAccording to him, the terrorist activities intensifying in Central and West Africa – especially Nigeria, Burkina Faso, Cameroon, the Democratic Republic of Congo, Mali and Niger and attacks increasingly reported in the border area between Mozambique and Tanzania.\nHe added that a subsequent targeted attack reportedly resulted in the death of the ISIL/Da’esh leader, Amir Muhammad Sa’id Abdal-Rahman al-Salbi, widely known as Abu Ibrahim al-Hashimi al-Quraishi.\n“We have learned over the past two decades that counter-terrorism is a long-term game and that there are no quick fixes,” he stressed."
  },
  {
    "headline": "ISIS Expanding In Nigeria, Other Africa Countries Despite Leader’s Death, United Nations Warns",
    "summarized_story": "The United Nations Office of Counter-Terrorism says the Islamic State of Iraq and Levant (ISIL or ISIS), a terrorist group, is expanding its affiliates and network beyond Syria and Iraq to Africa.\nISISThe under-secretary-general said that the terrorist activities were gaining ground in the Central and West Africa, which he said continues at an “unsettling” scale and pace.\nAccording to him, the terrorist activities intensifying in Central and West Africa – especially Nigeria, Burkina Faso, Cameroon, the Democratic Republic of Congo, Mali and Niger and attacks increasingly reported in the border area between Mozambique and Tanzania.\nHe added that a subsequent targeted attack reportedly resulted in the death of the ISIL/Da’esh leader, Amir Muhammad Sa’id Abdal-Rahman al-Salbi, widely known as Abu Ibrahim al-Hashimi al-Quraishi.\n“We have learned over the past two decades that counter-terrorism is a long-term game and that there are no quick fixes,” he stressed."
  },
  {
    "headline": "BREAKING: Court Adjourns Appeal To Nullify Buhari's 2019 Election Victory, Declare Atiku As President",
    "summarized_story": "An appeal to nullify President Muhammadu Buhari's victory in the 2019 election, was on Wednesday, adjourned by the Court of Appeal in Abuja to May 18, 2022.\nAccording to CSOCLC, the affidavit made by Buhari in the 2019 general elections was false.\nBut the three-member panel presided over by Justice Haruna Tsamani, during the hearing on Wednesday, adjourned the appeal to enable Buhari's administration to reconcile sort out an issue regarding the right legal representation for the President.\nThis was after two lawyers, Oluwole Afolabi and F. O. Amedu, announced appearances for both the All Progressives Congress (APC) and Buhari, each claiming to be the genuine legal representative.\nDue to the confusion, the court, therefore, adjourned the case till May 18, 2022."
  },
  {
    "headline": "BREAKING: Court Adjourns Appeal To Nullify Buhari's 2019 Election Victory, Declare Atiku As President",
    "summarized_story": "An appeal to nullify President Muhammadu Buhari's victory in the 2019 election, was on Wednesday, adjourned by the Court of Appeal in Abuja to May 18, 2022.\nAccording to CSOCLC, the affidavit made by Buhari in the 2019 general elections was false.\nBut the three-member panel presided over by Justice Haruna Tsamani, during the hearing on Wednesday, adjourned the appeal to enable Buhari's administration to reconcile sort out an issue regarding the right legal representation for the President.\nThis was after two lawyers, Oluwole Afolabi and F. O. Amedu, announced appearances for both the All Progressives Congress (APC) and Buhari, each claiming to be the genuine legal representative.\nDue to the confusion, the court, therefore, adjourned the case till May 18, 2022."
  },
  {
    "headline": "Diri: Bayelsa broke because of unfavourable federation allocation",
    "summarized_story": "Douye Diri, governor of Bayelsa state, says the state is broke owing to unfavorable federation allocation.\nA report by Economic Confidential listed Bayelsa among the insolvent states in the country.\nDiri said Bayelsa has not been treated fairly despite being an oil-producing state.\nAdvertisementHe said the reason for the clamour for restructuring is so that all states can get their deserved allocation.\n“The question I ask myself is, is it just or fair that what is generated here as income comes back to Bayelsa as federal allocation."
  },
  {
    "headline": "Diri: Bayelsa broke because of unfavourable federation allocation",
    "summarized_story": "Douye Diri, governor of Bayelsa state, says the state is broke owing to unfavorable federation allocation.\nA report by Economic Confidential listed Bayelsa among the insolvent states in the country.\nDiri said Bayelsa has not been treated fairly despite being an oil-producing state.\nAdvertisementHe said the reason for the clamour for restructuring is so that all states can get their deserved allocation.\n“The question I ask myself is, is it just or fair that what is generated here as income comes back to Bayelsa as federal allocation."
  },
  {
    "headline": "Mele Kyari: Nigeria doesn't test for methanol content in petrol imports",
    "summarized_story": "Mele Kyari, group managing director of the Nigerian National Petroleum Company (NNPC) Limited, says the country doesn’t test for methanol content in petrol.\nSince Monday, Nigerians have been facing a fuel shortage after petrol, with methanol quantities above specification discovered in the supply chain.\nAccording to him, the off-spec petrol cargoes were able to get into the country because Nigeria does not usually test for methanol content.\nAdvertisementKyari explained that quality inspectors certified the product to have met the country’s specifications at the point of import in Belgium and the point of arrival in Nigeria.\nHigh percentages lower the energy density of petrol to the point where it can potentially damage the engines of automobiles."
  },
  {
    "headline": "Mele Kyari: Nigeria doesn't test for methanol content in petrol imports",
    "summarized_story": "Mele Kyari, group managing director of the Nigerian National Petroleum Company (NNPC) Limited, says the country doesn’t test for methanol content in petrol.\nSince Monday, Nigerians have been facing a fuel shortage after petrol, with methanol quantities above specification discovered in the supply chain.\nAccording to him, the off-spec petrol cargoes were able to get into the country because Nigeria does not usually test for methanol content.\nAdvertisementKyari explained that quality inspectors certified the product to have met the country’s specifications at the point of import in Belgium and the point of arrival in Nigeria.\nHigh percentages lower the energy density of petrol to the point where it can potentially damage the engines of automobiles."
  },
  {
    "headline": "Do you know foreigners are begging to be citizens of Nigeria?",
    "summarized_story": "AdvertisementA foreigner running a successful business in Nigeria told me: ‘’Only Nigerians don’t see the opportunities in their country’’.\nThe Lebanese have been thriving in the retail, construction and hospitality sectors in Nigeria for decades.\nIn 2017, the federal government granted citizenship to 335 foreigners out of 500 who applied to become Nigerians.\nI learnt some foreign nationals lobby to be granted citizenship – but Nigerian citizenship processes are thorough.\nOn Wednesday, Rauf Aregbesola, minister of interior, announced that the federal government had granted citizenship to 286 foreign nationals out of 600 who applied."
  },
  {
    "headline": "The viral photographer that Afcon Cameroon made",
    "summarized_story": "As the African Cup of Nation (Afcon) fiesta rages in Cameroon, a young photographer is positioned to make a name for himself.\nIn a few minutes, he will be triggering his camera, producing incredible shots that will go viral and bring him fame.\nThe accreditation document gives journalists and photographers the right to access stadiums and venues where the Afcon takes place.\nEvery picture I was posting was going viral, it was amazing.”Amid the excitement of his work going viral, Lefa was still worried about his accreditation.\nImage source: Didier Lefa."
  },
  {
    "headline": "Bantaba wants to help African startups tap into diaspora resources",
    "summarized_story": "“Like its origin, our Bantaba is a digital meeting place that bridges the gap between Africa’s tech startup ecosystem and diaspora capital, knowledge, and network,” he said.\nAfrican startups can create pages on Bantaba detailing the problems they’re solving to be discovered by diaspora mentors, consultants, and investors.\nWith that opportunity, the diaspora can invest in promising African startups listed on and vetted by Bantaba, which will make money off each transaction.\nSince launching its beta platform in July 2021, Bantaba has onboarded more than 150 African tech startups from at least 20 African countries and over 300 diaspora experts and investors.\nIn addition to serving as a platform where diaspora talent and capital is accessible to African startups, Bantaba aims to provide relevant news updates to both parties, among other services."
  },
  {
    "headline": "Twitter wants its African users to have safer conversations",
    "summarized_story": "Today marks the 19th edition of Safer Internet Day, and this year’s theme—a repeat of last year’s—is “together for a better internet”.\nLike most avid Twitter users, I have had a few of my tweets end up on the wrong side of bird avenue.\nIn recent times, Twitter users have opened up about experiencing one form of internet abuse or the other.\nThe platform has, over the past several years, marked Safer Internet Day by rolling out various initiatives such as dedicated emojis, blog posts, events, and more.\n“We’re excited to join safety partners from all over the world to mark #SaferInternetDay2022 and to play our part in creating a safer internet for all."
  },
  {
    "headline": "Asa joins Spotify EQUAL Music Programme as ambassador of the month",
    "summarized_story": "Paris-born Nigerian singer, Asa, was recently announced the Spotify EQUAL Global Music Programme ambassador for the month of February.\nIn April 2021, months after it expanded to 38 African countries, Spotify launched the Spotify EQUAL Music Programme in commemoration of International Women’s Day.\nThis research helped fuel the drive for its EQUAL Global Music Programme.\nMayana already has over 560,000 streams on Spotify, and the addition to EQUAL playlists will boost it further.\nSpeaking about her selection, the singer said, “I’m honoured to be the Spotify EQUAL ambassador of the month."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Where does your data go when you die?",
    "summarized_story": "A seldom asked yet important question is what happens to our data when we die?\nLaws like the Nigeria Data Protection Regulation and the European Union’s General Data Protection Regulation protect the data of living people.\nOrdinarily, the Terms of Service, which she agreed to, bars third party users like her family from gaining access to her profile data.\nThe will could also determine how your data is used after you die.\nStill wondering what could happen to your data after you die if you don’t take action now?"
  },
  {
    "headline": "How to crowdfund your wedding",
    "summarized_story": "AdvertisementToday, we’re discussing:How to crowdfund your wedding?\nOn-demand mechanicsA fintech Incubation programme in RwandaHow to crowdfund celebrationsIn a few days, Emmanuel and our designer, Daniel, will be celebrating their birthdays.\nUnboxd is a fintech startup that enables users to share a wishlist for birthdays, weddings, and other celebrations with friends and family.\nIf you’re wondering why I’m so sure, read the story here: Fintech startup, Unboxd, helps crowdfund celebrations, no matter how much you haveMechanic on-demandIn Nigeria and most parts of Africa, the road is the most popular form of transportation.\nThe programme will support 15 fintech startups to the minimum viable product stage (MVP) and give a $10,000 grant to each."
  },
  {
    "headline": "Fintech startup, Unboxd, helps crowdfund celebrations, no matter how much you have",
    "summarized_story": "What if you could get exactly what you wanted as a wedding gift without your friends breaking the bank or getting you unnecessary items?\nOn November 1, 2020, about one month after sharing their wishlist, Egbeyemi and his wife get married.\nWishlists for every celebrationAccording to Adesina, Unboxd is a fintech brand, “but we are currently offering a gifting solution with a crowdfunding component.\nWith Unboxd, we’ve been able to simplify that.\n“Everything we’ve been able to build with Unboxd has been with our own money, and we’ve had to hire on contract."
  },
  {
    "headline": "More pain for small businesses as diesel price rises by 24%",
    "summarized_story": "The price of diesel, which is not regulated by the government, has surged by over 24 percent on the back of the soaring price of Brent crude, dollar price, and the forces of demand and supply, sources said.\nCrude oil price accounts for a large chunk of the final cost of petroleum products such as diesel, kerosene, and such associated products.\nBrent crude, the benchmark for Nigeria’s crude oil has gained more than 28percennt to $91 on February 09, 2022.\nIt said states with the highest average price of diesel were States with the highest price Enugu (N349.29), Borno (N340.00), and Oyo (N326.25).\n“States with the lowest average price of diesel were Kebbi (N232.36), Yobe (N226.61), and Katsina (N225.00),” the NBS noted."
  },
  {
    "headline": "Dirty petrol saga questions NNPC role as sole importer",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) was never meant to be the country’s sole importer of refined products, stakeholders note.\nThe NNPC gradually became the sole importer of petrol because the retail price capped at N162 per litre will not guarantee commercial returns to marketers who will pay a higher landing cost.\nThe addition of the first nine items sums up the product’s landing cost, or the cost of product sold at the depot.\nWhen all charges are included, at the current oil prices, the landing cost of petrol is estimated at over N282.\nAll these costs are factored into determining the landing cost of petrol for the pricing template since 2020."
  },
  {
    "headline": "Investment in food drives retail rebound",
    "summarized_story": "The World Trade Organisation (WTO) ranks Nigeria as the largest food market in Africa, with significant investment in the local industry and a high level of imports.\nNigeria’s young population represents a promise for the food market and the retail sector in general.\nRead also: How FMN’s Food for Innovation Prize helps SMEs tackle food loss, wasteBut the Nigerian market has not always lived up to its promise.\nIn 2013, Mckinsey & Company projected a $40 billion growth opportunity in food and consumer goods between 2008 and 2020.\nThe retail sector along with others suffered a decline."
  },
  {
    "headline": "Obaseki mourns passing of Comrade Ogbeide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of Comrade Osarunmwense Ogbeide, who passed on January 25, 2022.\n“A kind, compassionate and loving gentleman, he was a good father, who loved deeply and warmed the hearts of friends and family around him.\n“Osarunmwense was good-natured and made sacrifices for the benefit of others, a trait which endeared him to all.\n“He will be remembered for his large heart, affable nature and commitment to his family.\n“I commiserate with the Ogbeide family, friends and associates of the deceased and pray that God will grant all the fortitude to bear this irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Kidnappers Rape Lawyer, Collect N12Million Ransom – Nigerian Observer",
    "summarized_story": "The lawyer, who was attached to a law firm for her National Youth Service Corps scheme was released with four other victims after payment of N12million ransom.\nAmid a staccato of gunshots, the victims were kidnapped by bandits at Ehor area of the Benin-Ekpoma-Auchi-Abuja Road.\nThey were traveling from Warri, Delta State to Sabongida Ora High Court in Edo State with their driver, when they were abducted.\nThe lady, who cannot be mentioned, was assisting senior solicitors in the conduct of legal matters as a youth corps member.\nAccording to official records, there have been more than 400 cases of reported kidnappings in Southwest Nigeria in the past three years."
  },
  {
    "headline": "Work for Edo’s devt, Obaseki charges new Commissioners, Special Adviser – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… warns against indiscipline in Edo PDPBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in eight new Commissioners and a Special Adviser with a charge to ensure effective service delivery to Edo people.\nThe Commissioners, who were sworn in include, Chris Nehikhare, Omololu Ojehomon, Afishetu Braimoh, and Stephen Idehenre.\nOur party, the PDP, is the party in power and wouldn’t condone opposition within the party.\nWe can’t tolerate indiscipline and disloyalty to the party.\nWe have been patient enough and want to know who the real opposition is and can’t tolerate disloyalty within the party."
  },
  {
    "headline": "ASSASSINATION: Unknown Gunmen In Army Uniform Shot Dead Owner of Osofem Oil And Gas company, Escaped With His Car At Ifo Area, Ogun State – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The owner of Osofem Oil and Gas company, Mr. Olowufemi James has been shot dead by unknown gunmen dressed in Army uniform at Ifo area of Ogun State last Sunday.\nThe father of three, it was learnt was about going home on Sunday January 6, after the sales for the day when the gunmen stormed the petrol station and ordered everyone to remained where they are or they would be killed.\n“He was chased down from his car and they demanded for his car key which he declined.\nI am also begging the State Governor Prince Dapo Abiodun to assist me because my husband was killed in his prime.\nWe are suspecting the manager and the security officer of the petrol station, because since the incident occurred will couldn’t found the two of them after the incident."
  },
  {
    "headline": "SEC Harps on Professionalism in the Capital Market",
    "summarized_story": "The Securities and Exchange Commission (SEC) has again restated the need for capital market operators to maintain professionalism and good ethical conduct in the discharge of their duties.\nAccording to him, “It is very important for us to work harmoniously we want a harmonious capital market where the regulators and the Self-Regulatory Organisations complement each other.\nWe want a harmonious capital market where the forces compliment and rein-enforce each other and not fight.\nAlso speaking, Past President of CIS Mr. Ariyo Olushekun said the CIS is committed to working with the SEC to ensure professionalism in the capital market, improve ethical standards and weed out bad eggs in the market.\nHe therefore pledged the commitment of the CIS to always work with the SEC to develop the market and also to police the market."
  },
  {
    "headline": "Contaminated petrol: NNPC lists MRS, Oando, Duke Oil, others as importers",
    "summarized_story": "OBINNA EZUGWUThe Nigerian National Petroleum Corporation (NNPC) has listed MRS, Oando Plc, Duke Oil, among others, as importers of contaminated petrol into the country.\nThe Corporation in a press release on Thursday, an apparent response to an earlier press statement by MRS Oil stating that NNPC subsidiary, Duke Oil, imported the problematic petrol into country, promised to take remedial action against the listed defaulting importers.\n“NNPC Ltd has reassured Nigerians of its capacity to restore sanity in the supply and distribution of quality PMS (petrol) across the country within a short period,” the statement by Garba Deen Muhammad, Group General Manager, Group Public Affairs Division, NNPC said.\n“He explained that NNPC Ltd investigation revealed the presence of Methanol in four PMS cargoes imported by the following Direct-Sale-Direct-Purchase (DSDP) suppliers as listed below.\n“The NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification,’’ he said."
  },
  {
    "headline": "Heirs Life promises retirees a guaranteed pension for life",
    "summarized_story": "Heirs Life Assurance (HLA) says has rolled out an awareness campaign for its pension-regulated Annuity Plan, promising retirees a steady income for as long as they live.\nHeirs Annuity Plan pays retirees a steady amount, monthly or quarterly for as long as the annuitant lives.\nBeyond the Heirs Annuity plan, Heirs Life has introduced a variety of interesting life assurance plans for different customers.\nHeirs Life continues to transform life insurance in Nigeria through its digital service delivery and by providing simple, quick, reliable, and accessible financial security plans to individuals and businesses.\nHeirs Life is a subsidiary of Heirs Holdings, a pan-African investment group."
  },
  {
    "headline": "Valentine: Fidelity Bank set to delight customers with Euphoria Event",
    "summarized_story": "Fidelity Bank Plc says its customers Customers are in for a treat this Valentine as it has announced plans to host a delightful evening of music, fun games and delightful experiences for its customers.\nAccording to the bank, non-customers can also stand a chance to be part of the event by downloading the Fidelity Bank mobile app and carrying out five transactions.\n“Over the years, Fidelity Bank has developed a reputation for going the extra-mile in servicing our esteemed customers.\nWhether it is through interactions with our online services or our staff, people have come to associate us with delightful experiences.\nFidelity Bank is a full-fledged commercial bank operating in Nigeria, with about 6million customers who are serviced across its 250 business offices and digital banking channels."
  },
  {
    "headline": "CSOs Worry Over Non-legislation On Data Privacy",
    "summarized_story": "The inability of Nigeria to have a law that protects its citizens’ data privacy is now a source of concern to Civil Society Organisations (CSOs) and other stakeholders.\nAlso, the CSOs were concerned that many Nigerians are not aware of their data rights.\nLEADERSHIP reports that despite the absence of comprehensive legislation on data privacy in Nigeria, in January 2019, the National Information Technology Development Agency (NITDA) issued the Nigerian Data Protection Regulation, 2019 (NDPR) which makes provision for the rights of data subjects, the obligations of data controllers and data processors, transfer of data to foreign territory and others.\nDo you think that your data rights are human rights?” Nkem asked.\nThis figure is projected to grow to 131.7 million internet users by 2023, and internet penetration is setto reach 65.2% in 2025."
  },
  {
    "headline": "NDLEA Intercepts N2bn Codeine Syrup At Lagos Port",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has intercepted 40,250 kilograms of codeine-based syrup worth over N2billion imported into Nigeria in two 40ft containers from India.\nSpokesperson of the anti-narcotic agency, Femi Babafemi, said the drug bust comes on the heels of a similar seizure of 14,080kg codeine syrup and 4,352.43kg cold caps used to conceal the former in a 40ft container imported from India, on Wednesday February 2, 2022 at the Apapa port.\nBoth seizures followed intelligence from foreign partners and cooperation of other port stakeholders such as Customs, DSS, Navy and others.\nWhile reacting to the seizures, chairman/chief executive of NDLEA, Brig.\nMarwa also expressed gratitude to foreign partners for sharing timely intelligence and other port stakeholders for their cooperation and commended the officers and men of the Apapa Port special area command of the agency for their vigilance."
  },
  {
    "headline": "LASUED, LASUST Will Be Reference Points In Academic Circle, Says Sanwo-Olu",
    "summarized_story": "Lagos State Governor, Mr. Babajide Sanwo-Olu has expressed optimism that the two newly approved state-owned universities; Lagos State University of Education (LASUED), Ijanikin and Lagos State University of Science and Technology (LASUST), Ikorodu, 39years after the first State-owned University, Lagos State University was established would be reference points in academic circle in no distant time.\nThe governor stated this when the National Universities Commission (NUC) Executive Secretary, Prof. Abubakar Rasheed handed over certificates for the two new Lagos universities at the commission’s headquarters in Federal Capital Territory (FCT) Abuja.\nWith the issuance of clearance certificates of operation by NUC, Lagos State University of Education is now the 56th state university and 204th University in Nigeria, as well as the second University of education in Nigeria while Lagos State University of Science and Technology is 57th state university and 205th university in Nigeria.\nLagos State now has three state-owned universities.\nHe commended the Speaker of the Lagos State House of Assembly, Rt."
  },
  {
    "headline": "LASUED, LASUST Will Be Reference Points In Academic Circle, Says Sanwo-Olu",
    "summarized_story": "Lagos State Governor, Mr. Babajide Sanwo-Olu has expressed optimism that the two newly approved state-owned universities; Lagos State University of Education (LASUED), Ijanikin and Lagos State University of Science and Technology (LASUST), Ikorodu, 39years after the first State-owned University, Lagos State University was established would be reference points in academic circle in no distant time.\nThe governor stated this when the National Universities Commission (NUC) Executive Secretary, Prof. Abubakar Rasheed handed over certificates for the two new Lagos universities at the commission’s headquarters in Federal Capital Territory (FCT) Abuja.\nWith the issuance of clearance certificates of operation by NUC, Lagos State University of Education is now the 56th state university and 204th University in Nigeria, as well as the second University of education in Nigeria while Lagos State University of Science and Technology is 57th state university and 205th university in Nigeria.\nLagos State now has three state-owned universities.\nHe commended the Speaker of the Lagos State House of Assembly, Rt."
  },
  {
    "headline": "UBEC Boss Harps On Imperative Of Reading Aloud To Children",
    "summarized_story": "Nigeria recently joined the rest of the world to celebrate World Read Aloud Day and Universal Basic Education Commission (UBEC), while marking the day in Abuja harped on the need to read aloud to children to bring literacy to the world.\nUBEC executive secretary, Dr Hamid Bobboyi stated this in Abuja during the commentation of World Read Aloud Day, which is being recognised on February 2 every year to motivate children, teens, and adults to celebrate the power of words to show that the right to read and write belongs to all people.\nJolly Phonics is a fun and child-centred approach to teaching literacy through synthetic phonics, with actions for each of the 42 letter sounds.\nADVERTISEMENTUzu said, “In total 161,379 public school teachers and 6,107 government officials have now received training reaching 13.2 million pupils.\nShe said the benefits of the programme cannot be over-emphasized, therefore, the celebration of the World Read Aloud Day is celebrated today by gathering children, friends and families to read aloud and share stories through written books to the audience."
  },
  {
    "headline": "The 4 companies that Imported bad fuel into Nigeria",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Limited, on 9 February, named the four companies involved in the importation of methanol laden petrol into Nigeria.\nMRS, shipped into Nigeria the fuel with the vessel MT Bow Pioneer.\nOando also loaded the bad fuel on MT Elka Apollon, while Duke Oil lifted it with the tanker, MT Nord Gainer.\nThe four shipped in the fuel from LITASCO Terminal in Antwerp, Belgium.\n“The NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification,’’ he said."
  },
  {
    "headline": "APC Chairmanship: Adamawa delegates endorse Salihu Mustapha",
    "summarized_story": "By Emmanuel MogbedeStatutory Adamawa delegates to the Feb. 26 national convention of the All Progressive Congress (APC) have promised to support Malam Saliu Mustapha’s quest for the national chairmanship position.\nThe statutory delegates include serving and former Adamawa lawmakers pledged during a courtesy visit to the aspirant at his campaign headquarters in Abuja.\nLed by Umar Yapak (APC, Verre), the Adamawa lawmakers said they decided because they regarded Mustapha as a unifier based on his antecedents.\nMustapha who is also the Turaki of Ilorin, assured the delegates that he would not disappoint them.\n“This will go a long way to manage any possible crisis even before it becomes a major problem,’’ Okubanjo quoted Mustapha as having said in his response."
  },
  {
    "headline": "(BREAKING): Court Nullifies Elevation Of Ibadan Baales/Mogajis",
    "summarized_story": "Justice Munta Abimbola, the Chief Judge of Oyo State on Thursday ordered elevated Baales and Mogajis in Ibadan land to return to their original positions before the setting up of the Justice Boade Commission of inquiry.\nThe court further issued an order of Perpetual Injunction, restraining them from the status of elevation or wearing crowns or coronets.\nJustice Abimbola in his judgment said he finds no merit in their application before the court, dismissed it in its entirety and answered all their questions in the negative.\nHe further held that all government’s actions must be in compliance with the law of the land."
  },
  {
    "headline": "2023 Presidency: Northern Elders Blast Gov. Akeredolu",
    "summarized_story": "The Northern Elders Forum (NEF), has expressed dismay with the utterances of Governor of Ondo State, Rotimi Akeredolu, for saying a northern presidential candidate will lose the 2023 election if fielded by any political party.\nDr Hakeem Baba-Ahmed, the Director of Publicity and Advocacy of NEF said every northerner had the right to aspire for the presidential position in 2023.\nHe opined that the utterances of Gov.\nHe explained that all the threats, ultimatums and demands that were coming from politicians from the South would not help matters.\nHe observed that what was missing in Nigeria presently was an elite consensus of what it takes to get the country to survive between now and 2023 elections."
  },
  {
    "headline": "Govs Wike, Makinde, Ishaku hate Muslims, they’ve been blacklisted – Islamic group",
    "summarized_story": "The Muslim Rights Concern, MURIC, has accused some state governors of being Muslim-haters.\nMURIC, an Islamic human rights organization, identified Darius Ishaku of Taraba State, Nyesom Wike of Rivers State, and Seyi Makinde of Oyo State, as haters of Muslims in Nigeria.\nThe group warned the governors against attempting to occupy any federal office because they have been blacklisted.\nMURIC accused the Taraba State Governor of marginalizing Muslims in the state.\nIt described as legendary, Ishaku’s alleged reckless violation of Allah-given fundamental rights of Muslims in his state."
  },
  {
    "headline": "Nigerian Movie Star, Natty Of ‘New Masquerade’ Is Dead",
    "summarized_story": "Nigerian Movie Star, Natty Of ‘New Masquerade’ Is DeadNigerian veteran actor Romanus Amuta popularly known as Natty is dead.\nAmuta rose to limelight after featuring in Popular Nigerian Soap Opera ‘The New Masquerade’ where he played the role of ‘Natty’.\nThe movie veteran passed away on Wednesday, February 9, 2022, after battling a protracted illness.\nHe rose to stardom in the popular TV drama series ‘New Masquerade.’ The show aired on the Nigerian Television Authority (NTA) from the 80s to the mid-90s.\nUntil his death, Natty was survived by a wife and six children."
  },
  {
    "headline": "Breaking: Super Eagles rise in latest FIFA ranking, 4 days after AFCON 2021 tourney",
    "summarized_story": "Despite dropping out of the just concluded Africa Cup of Nations in Cameroon, Nigeria’s Super Eagles have pushed up in latest February 2022 FIFA ranking.\nNigeria is currently placed third on the continent, and 32nd globally, according to ranking released Thursday morning, four days after AFCON 2021 ended in Cameroon.\nMorocco is now placed 2nd (Africa) and 24th (globally).\nEgypt (34th) and Tunisia (36th) in fourth and fifth positions respectively complete current top five in the continent.\nBelgium, Brazil and France are topping global ranking in the first, second and third places respectively."
  },
  {
    "headline": "Breaking: NNPC exposes companies responsible for importing adulterated fuel *See full list",
    "summarized_story": "The Nigeria National Petroleum Company Limited (NNPC) has disclosed that MRS, Duke Oil, OandO, and Emadeb imported the adulterated fuel that is responsible for the present fuel scarcity being experienced in Nigeria.\nIn a statement by NNPC spokesman, Mohammed Garba Deen, the GMD of NNPC, Mele Kyari, was quoted as explaining that after investigations, the Company discovered the presence of Methanol in four PMS cargoes imported by Direct-Sale-Direct-Purchase (DSDP) suppliers.\nHe noted that cargoes quality certificates issued at loadport (Antwerp-Belgium) by AmSpec Belgium indicated that the gasoline complied with Nigerian Specification.\n“The NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification,’’ he said.\nImporter Vessel Name Load Port1 MRS — MT Bow Pioneer — LITASCO Terminal, Antwerp-Belgium2 Emadeb/Hyde/AY Maikifi/Brittania-U Consortium —- MT Tom Hilde —- LITASCO Terminal, Antwerp-Belgium3 Oando — MT Elka Apollon — LITASCO Terminal, Antwerp-Belgium4 Duke Oil —– MT Nord Gainer —-LITASCO Terminal, Antwerp-Belgium"
  },
  {
    "headline": "Re-amended Electoral Bill: Why Buhari must avoid conspiracy by power interests – IPAC",
    "summarized_story": "He said this is the most inclusive electoral bill capturing the inclusion of Persons with Disabilities (PWDs), Women and the Youth in the general elections.\n“He should also know that there are implications for delaying the re-amended bill which will obviously affect the 2023 general elections.\n“We hope that he quickly ascents the bill so as to also allow INEC make adequate preparations ahead of the coming general elections.\n“I think Nigerians are looking out for Electronic transmission of results during the general elections when the bill is passed into law.\nPresident Buhari has no reason not to assent the Bill because the Bill will deepen the Electoral processes,” he said."
  },
  {
    "headline": "JUST IN: Reps Ask NNPC To Suspend Companies That Imported Adulterated Fuel",
    "summarized_story": "Members of the House of Representatives have called on the Nigerian National Petroleum Company (NNPC) Limited to suspend the four companies which recently imported adulterated fuel into the country.\nThe lawmakers also mandated its committee on petroleum downstream to investigate the release and sale of the off-spec Premium Motor Spirit by petrol stations across the country, to bring the culprits to book.\nThe issue was raised on Thursday as a motion of urgent public importance by the Chief Whip of the House, Mohammed Monguno.\nThe House is also concerned that adulterated petrol poses severe risks to motor vehicles and their owners.\nMore to follow…"
  },
  {
    "headline": "Restructuring: ‘No Justice’ In What Bayelsa Gets From Oil Revenues, Says Governor Diri",
    "summarized_story": "﻿Bayelsa State Governor Douye Diri on Thursday criticised the federal allocation revenue system as unfair to Bayelsa State and the Niger-Delta region.\n“And that’s why we are talking about restructuring, that’s why we are talking about the amendment of our country’s constitution.\nAnd anybody who bandies these figures, you are annoying the people of Bayelsa State, and indeed the people of the Niger-Delta.\nAnd nobody will be talking about Bayelsa State being insolvent or any other state in the Niger Delta for that matter.\n“A lot of people make a mistake and say we used cocoa money to developed oil, that’s not true."
  },
  {
    "headline": "NNPC GMD Reveals How ‘Adulterated Fuel’ Was Imported And The Importers",
    "summarized_story": "He said, “Cargoes quality certificates issued at load port (Antwerp-Belgium) by AmSpec Belgium indicate that the gasoline complied with Nigerian Specification.\n“The NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification.\nOn 20th January 2022, NNPC received a report from our quality inspector on the presence of emulsion particles in PMS cargoes shipped to Nigeria from Antwerp-Belgium.\nCargoes quality certificates issued at load port (Antwerp-Belgium) by AmSpec Belgium indicate that the gasoline complied with Nigerian Specification.\nThe NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification."
  },
  {
    "headline": "Marwa Seeks ‘Integrity Test’ In All Universities To Combat Drug Abuse",
    "summarized_story": "Gen. Mohamed Buba Marwa (rtd) has asked all tertiary institutions in Nigeria to make drug integrity tests an institutional policy for both new and returning students as part of efforts to fight the menace of drug abuse among Nigerian youths.\nAccording to him, “part of the measures to reduce drug use in the university is the proposed introduction of the Drug Integrity Test for both new and returning students.\nRead Also: Troops Neutralise Notorious IPOB Gunman, Three Others In Anambra“The Drug Integrity Test is anticipated to metamorphose into an anti-drug policy for all higher institutions of learning in Nigeria.\nMarwa added that “the Drug Integrity Test is not a punitive measure; rather it is an early detection tool to ascertain an individual’s drug use status for appropriate intervention, and timely treatment and care.\nThey commended the collaboration between NDLEA and the university as part of renewed efforts to stamp out the problem of drug abuse in the country."
  },
  {
    "headline": "APC Has Failed To Protect Plateau State, PDP Ready To Takeover – Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike has said that the All Progressives Congress (APC) – led administration in Plateau State has failed to tackle the security crisis in the state and the People’s Democratic Party (PDP) is ready to take over.\nGovernor Wike said this on Wednesday while responding to questions from journalists within the premises of Plateau State High Court in Jos, where the fraud trial of former governor of Plateau State, Jonah Jang, was heard.\n“Plateau State is ripe for Peoples Democratic Party (PDP) to take over because APC has performed woefully as far as Nigeria and this state is concerned.\n“Every individual has to focus on how the party will be united to salvage the country and to salvage Plateau State too from APC,” he said.\nHe explained that his visit to Plateau State was to see to reconcile Jeremiah Useni and Jonah Jang."
  },
  {
    "headline": "Niger State APC adopts consensus to choose National Convention delegates -",
    "summarized_story": "The Niger state chapter of the All Progressives Congress says it will use consensus to choose a candidate to represent the state at the upcoming national chairmanship election.\nState Chairman of the party Haliru Jikantoro disclosed this while receiving reports of the reconciliation committee at the state party secretariat in Minna.\nThis led to the formation of factions running a parallel state Congress.\nBarely a week after the state APC chairmen were in inaugurated at the national office in Abuja, the reconciliation committee led by Bawa Bwari are in the Niger state office of the party to present the report of the committee to the state working committee.\nThere is Yet another problem up ahead with three aspirants contesting for the position of national chairman of the party from the state."
  },
  {
    "headline": "Emir of Ilorin's brother joins 2023 House of Reps race",
    "summarized_story": "Yusuf Zulu-Gambari, one of the brothers of the Emir of Ilorin, Dr Ibrahim Zulu-Gambari, has joined the race for the house of representatives from Kwara state.\nHe’s planning to represent Ilorin East and Ilorin South federal Constituency in the green chamber of the national assembly on the platform of the Peoples Democratic Party.\nAdvertisementAdvertisementZulu-Gambari presented his letter of intent to the PDP leadership at his Balogun Fulani ward one, Ilorin.\nThe house of representatives hopeful also encouraged the electorate to obtain their permanent voter cards in order to be eligible to vote and be voted for.\nAdvertisementYusuf Zulu Gambari is planning to replace Abdulganiyu Cook-Olododo who was elected in 2019 on the platform of the All Progressives Congress."
  },
  {
    "headline": "Any party that field northern candidate will lose- Akeredolu -",
    "summarized_story": "Chairman of the Southern Governors’ Forum and Ondo State Governor, Rotimi Akeredolu has warned that any party that fields a northern candidate in the 2023 Presidential election will lose.\nGovernor Akeredolu disclosed that Governors in the Southern part of the country under the auspices of the Southern Governors Forum are determined to ensure that next President comes from the south.\nGovernor Akeredolu said: “In about two or three meetings, we have come out and declared that power must move to the south.\nAdvertisement“Only a party that is determined to lose will field a northern candidate.\nWhat we stand for is fair and equitable power rotation."
  },
  {
    "headline": "Ondo former deputy governor, Ali Olanusi loses wife",
    "summarized_story": "The wife of a former deputy governor of Ondo State, Alhaja Bejide Olanusi is dead.\nShe died in Akure, having complained of stress and was taken to an hospital.\nAdvertisementIn the meantime time, the Ondo State chapter of the All Progressives Congress (APC) has commiserated with the family of former deputy governor in the State, Alhaji Ali Olanusi, over the death of his wife, Alhaja (Chief) Bejide.\nState Chairman of the party, Ade Adetimehin, described sad development as ill-timed, shocking and unfortunate.\nHe said Alhaja was a strong pillar behind the husband’s political success story."
  },
  {
    "headline": "AfCFTA Secretariat, Afreximbank Seal Deal on $10bn Fund to Boost African Economies – Arise News",
    "summarized_story": "Already, Afreximbank has committed $1 billion towards the ADF, which is made up of a base fund, a general fund and a credit fund.\nThe AfCFTA Secretariat and the Afreximbank stated that base fund would consist of contributions from state parties (which is AfCFTA member countries), grants and technical assistance funds to address tariff revenue losses as tariffs are progressively eliminated.\nThe base fund, according to the two continental institutions, would also support countries to implement various provisions of the AfCFTA agreement, its protocols and annexes while the general fund would mobilise concessional funding.\n“These are some of the initiatives that we are proud to implement in close collaboration with the AfCFTA Secretariat, setting the conditions that will undoubtedly lead to a smooth implementation of the AfCFTA.\nWe will be launching the general fund and credit fund very soon to address the needs of the private sector including the small and medium enterprises, women and youth."
  },
  {
    "headline": "P&ID: Court Revives Nigeria’s Bid in $10bn Award Feud",
    "summarized_story": "The appeals court vacated US District Judge, Paul A. Engelmayer’s late 2020 decision denying Nigeria’s petition to subpoena VR Advisory Services Limited for information the country hopes would bolster criminal proceedings in Nigeria.\nVR Advisory is a Manhattan asset manager that acquired a 25 per cent stake in P&ID in 2018.\nJudge Engelmayer had concluded in his decision that Nigeria’s petition appeared to be an attempt to avoid US DOJ scrutiny of its request.\nThe appeals court said neither the US Supreme Court nor any federal appellate court had previouslyconsidered whether a foreign sovereign that has a mutual legal assistance treaty with the U.S. circumvents that treaty by filing a Section 1782 application in the district court.\nVR Advisory was represented by Michael S. Kim, Zachary Rosenbaum, Josef M. Klazen and Darryl Stein of Kobre & Kim."
  },
  {
    "headline": "Africa’s GDP Declined by $165bn in 2020, Lowest in 20 Years, Says AfDB Chief Adesina – Arise News",
    "summarized_story": "President of the African Development Bank (AfDB), Dr. Akinwunmi Adesina, has painted a gloomy picture of Africa, saying dwindling economic fortunes in 2020 resulted in $165 billion decline in the continent’s Gross Domestic Product (GDP).\nAfrica witnessed a decline in GDP growth of 2.1 per cent in 2020, its lowest in 20 years.\nThe African Development Bank plans to invest $3 billion to support pharmaceutical and vaccines manufacturing capacity for Africa.\nHe added, “To enhance the security of Africa, the African Development Bank is currently developing Security Indexed Investment Bonds.\nTo boost financial support for the businesses of our youth, the African Development Bank Group is exploring with countries the establishment of Youth Entrepreneurship Investment Banks."
  },
  {
    "headline": "Nigeria: NNPC Names MRS, Oando, Duke Oil as Culprits in Importation of Dirty Fuel, MRS Blames NNPC",
    "summarized_story": "But the NNPC GMD’s explanation ran contrary to an earlier press statement released by MRS, where the company denied culpability.\nThe petroleum products delivered are usually equivalent in value to the crude oil received from NNPC subject to the general terms and conditions as advised.\nAccording to him, as soon as the vessels complete discharging and start pushing products to oil marketers, the fuel queues in Lagos should fully disappear by Friday.\nOther attendees at the meeting included top officials of NNPC, Major Oil Marketers Association of Nigeria (MOMAN), and members of the Depots and Petroleum Products Marketers Association of Nigeria (DAPPMAN).\nNARTO had threatened to stop haulage of petroleum products across the country over the hike in the price of diesel to N430 per litre and other operational challenges."
  },
  {
    "headline": "2022 Committee Mobilising Nigerians for Quality Leadership",
    "summarized_story": "RelatedStories No Content AvailableThe 2022 Committee has resolved to mobilise Nigerians across party lines and social strata for quality leadership of the country at all levels as the elections to choose new leaders in 2023 draw near.\nThe meeting, which held from February 4 to 6 under the aegis of “The 2022 Committee”, the conveners pointed out, remained non- partisan.\n“The 2022 Committee” conveners stated, “Whilst the 2022 committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction.\nThe statement came against the backdrop of speculations that the well-attended event was to select a presidential candidate among the attendees.\nBut the coordinators of the meeting stated that although all the 100 leading lights of the 2022 committee had the capacity for national leadership, it should not be linked to the politics of 2023."
  }
]