[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Labour’s protest not illegal, says Falana",
    "summarized_story": "Human rights activist, Femi Falana, SAN, has said that the strike declared by the Nigeria Labour Congress, NLC, in solidarity with the ASUU is not illegal as claimed by the Federal Government.\n‘’However, the Federal Government has declared the proposed protest illegal.\n“It is a trend recognised and deeply entrenched in the system of governance in civilised countries.\nIt will not only be primitive but also retrogressive if Nigeria continues to require a pass to hold a rally.\n“The Act has imposed a duty on the Nigeria Police Force to provide adequate security during meetings, rallies and processions convened by Nigerian citizens."
  },
  {
    "headline": "Tinubu best candidate to drive Nigeria to prosperity, says Fashola",
    "summarized_story": "By Miftaudeen RajiMinister of works and housing, Babatunde Fashola has described the presidential candidate of the ruling All Progressives Congress, APC, Asiwaju Bola Tinubu as the best candidate to drive Nigeria to prosperity.\nHe noted that Tinubu is a leader, who is capable of moving the people towards the prosperity that is imminent for Nigeria.\nHe said, “In my own opinion, Asiwaju is the best person to drive that vehicle because I’ve worked with him at very close quarters.\nI know his tenacity.”The Minister also said right-thinking Nigerians will vote for the APC in the 2023 general election.\nFashola expressed confidence that people will vote APC based on its achievements, compared to previous governments."
  },
  {
    "headline": "15 candidates lock horns with Sanwo-Olu in Lagos",
    "summarized_story": "By Miftaudeen RajiNo fewer than 15 governorship candidates are bracing up to challenge reigning Governor Babajide Sanwo-Olu to the Lagos State governorship election in 2023.\nAlso listed are Zenith Labour Party, ZLP, Mr. Adenipe Adekunle; Action Peoples Party, APP, Adeyimi Abiola; and Boot Party, BP, Mr. Oluwo Olawale.\nHowever, only APC, PDP, Labour Party, NNPP, and ADP fielded candidates for all the 40 seats in the state parliament.\nThe APP and NRM fielded candidates in nine state constituencies each while YPP, PRP, Accord and APM fielded candidates in five, four, three and one state constituencies respectively.\nThe Action Alliance (AA), All Progressives Grand Alliance (APGA) and People’s Redemption Party (PRP) did not have governorship candidates in the publication."
  },
  {
    "headline": "No one ‘ll give Nigeria debt relief, Moghalu laments country’s borrowings",
    "summarized_story": "By Biodun BusariFormer deputy governor of the Central Bank of Nigeria, Professor Kingsley Moghalu has decried the Nigeria’s current borrowing status, saying no financial organisation will grant the country debt relief.\nMoghalu also said the next country’s leader would do something extraordinarily to achieve proper fiscal policy for the country.\nReacting on Twitter, the political economist on Monday said Nigeria’s case is weak because the government has been irresponsible.\nThe issue for us as a developing country was always the ratio of debt to our revenues.\n“Anyone quoting the debt figures of the US and Japan – seriously productive economies – in relation to Nigeria’s debt crisis deserves to be flogged in the public square.”"
  },
  {
    "headline": "Anti-corruption War: Make Whistleblower policy attractive, transparent, CSOs tell FG",
    "summarized_story": "“As a result of this the citizens could not trust government and decided to ignore the policy.\n“Nigerians and citizens world over, we always forget policies or active policies once it is not not spoken about all the time.\n“They also failed to get influential voices and faces involved in the policy because Nigerians were not able to see how successful thepolicies were.\n“That is one way that the federal government can rejig and encourage Nigerians to actively participate in the whistleblowing policy.\n“Secondly, it boils down to the sincerity of the people pursuing this fight against corruption, and if that is properly established then other strategies would follow including the whistleblower policy."
  },
  {
    "headline": "Niger Gov lauds quick response in rescuing victims of boat mishap",
    "summarized_story": "Niger State Governor, Abubakar Sani Bello has commended the efforts of the Niger State Emergency Agency (NSEMA) and other members of the riverine community for their swift response in rescuing victims and recovery of the body of the deceased in the Saturday boat mishap in Zumba, Shiroro local government of the state.\nHe directed relevant Agencies to take necessary steps to avert a recurrence.\nHowever, thanks be to Allah for rescuing almost all of them except for one that died and his body has been recovered.\nWhile commiserating with the family members of the deceased and praying for quick recovery of the injured, the Governor directed relevant Agencies to take necessary steps to avert a recurrence.\nHe then prayed for the repose of the soul of the deceased and directed NSEMA to provide succour to the affected households."
  },
  {
    "headline": "Motorcycle ban will lead to 40 million job loss – ACOMORAN",
    "summarized_story": "The Association said the outright ban may throw over 40 million Nigerians, who make a living through motorcycles, into the saturated labour market.\nApelogun said, “Commuters see motorcycles as a relief to their transportation problems, while motorcycle riders see their adventure as a source of livelihood.\n“If ten million of these 40million people they plan to render jobless take to crime, can the government contain them?\nIf you attribute the movement of terrorists to motorcycles, don’t criminals operate with vehicles?\nWhen terrorists regrettably attacked Kuje prison, was it the motorcycle riders that caused the failure of intelligence gathering?”"
  },
  {
    "headline": "Buhari a disgrace – Aisha Yesufu reacts as terrorists threaten to kidnap President",
    "summarized_story": "Aisha Yesufu, a human rights activist has reacted to the threat by terrorists to abduct President Muhammadu Buhari.\nShe wondered why there was cowardly silence over the threat to kidnap the President.\nIn a tweet, the activist lamented that the terrorists were not under fire after threatening to kidnap Buhari.\nYesufu tweeted: “Muhammadu Buhari @MBuhari is an absolute disgrace!\nTerrorists dared to say they will abduct the Commander-in-Chief of the Federal Republic of Nigeria and there is cowardly silence everywhere."
  },
  {
    "headline": "Peoples Gazette raid: Powerful Nigerians using police to harass media – MRA",
    "summarized_story": "Media Rights Agenda (MRA) has condemned the police raid on the head office of the Peoples Gazette.\nThe security agency arrested the assistant editor, John Adenekan, and four other staff of the newspaper in the Utako area of Abuja on July 22.\nIn a statement on Monday, MRA Programme Director, Ayode Longe called on the federal government to rein in the police.\nLonge accused the agency of “becoming a tool in the hands of rich or powerful individuals and entities for harassing journalists and media organizations”.\nHe said policemen raiding media outfits, arresting and detaining staff, and intimidating media professionals over complaints had become a trend."
  },
  {
    "headline": "FG, not Dapo Abiodun to blame for dilapidated Ota-Abeokuta road – Ibitoye",
    "summarized_story": "A public affairs analyst, Alhaji Malik Ibitoye has absolved the Ogun State governor, Prince Dapo Abiodun of any blame over the dilapidated state of Sango/Ota-Abeokuta road.\n“The governor has touched all the 236 wards in the state and there is no doubt that he has been able to change the face of the state.\nWe need to understand the workings of that office and give him the opportunity to work.\n“While I am not holding the brief for the governor, I want the people to know the difference between federal and State roads.\n“Governor Abiodun is doing his best for the people and we should see him as a man that has the love of his people at heart,” he said."
  },
  {
    "headline": "'How we're deepening Tinubu, APC's 2023 campaigns in Enugu communities' The Nation Newspaper",
    "summarized_story": "The coordinator of the LMI in Enugu State, Hon.\nEzeh said LMI remains a firm believer in good governance, and would continue to promote same in the country.\nHe noted: “It is on record that the 2023 APC presidential flag bearer, Ahmed Bola Tinubu proved him self worthy when he was the Lagos State governor.\n“We are talking of a man who governed Lagos State for some years without the monthly statutory federal allocation, yet, he delivered real democracy dividends to the good people of Lagos state.\nAnd so far, we are deepening the messages in rural communities in Enugu State."
  },
  {
    "headline": "How gunmen killed Police Inspector in Ondo The Nation Newspaper",
    "summarized_story": "Sketchy details have emerged on how a Police Inspector, Boluwaji Temenu, was killed when gunmen attacked the Police Division at Okuta Elerinla area of Akure, the Ondo State capital.\nIt was gathered the two policemen on duty exchanged gunfire with the gunmen in an attempt to repel the attack.\nSources said it was torch light switched on by the slain policeman that gave him away and the gunmen fired towards his direction killing him instantly.\nWhen The Nation visited the station, policemen were seen discussing the incident in groups even as security was beefed up in the area.\nOndo Police spokesman, SP Fumilayo Odunlami, who confirmed the attack said policemen on duty engaged the attackers in a shootout and stopped them from gaining access into the station."
  },
  {
    "headline": "Abuja-Kaduna train: Families protest at transport ministry The Nation Newspaper",
    "summarized_story": "Families of kidnapped passengers of the AK9 Abuja-Kaduna train have grounded activities at the Federal Ministry of transportation.\nThey arrived at the ministry before 8am to demand the release of their loved ones.\nStaff, including the Minister of Transportation, Permanent Secretary of the ministry and Directors were prevented from entering.\nThe family members vowed to remain at the gate until the Federal Government gives them a date that their loved ones will be released.\nThe Minister, the Permanent Secretary and a few staff of the ministry later entered the ministry with representatives of the families around 12:16 pm"
  },
  {
    "headline": "Buhari celebrates Amusan, Brume over World Athletics feats The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has celebrated the winner of the women’s 100m hurdles gold at the World Athletics Championship 2022, Tobi Amusan, thanking her for promoting Nigeria’s image on the world stage.\nThe President also congratulated another star at the events, Ese Brume, who won the silver medal in the women’s long jump event.\n“President Muhammadu Buhari expresses heartfelt congratulations to Tobi Amusan for winning the women’s 100m hurdles gold for Nigeria at the World Athletics Championship 2022, setting a new world record in the semifinals of the athletic event and becoming the first Nigerian to win a World Championship.\n“The President joins millions of Nigerians in celebrating this outstanding feat by a compatriot and two-time African Games champion, who in one night stunned the athletics world with her superlative and stellar performance.\n“President Buhari says the legendary career and achievements of the golden girl will continue to inspire the upcoming generations of Nigerian athletes to achieve spectacular success."
  },
  {
    "headline": "FCT taskforce begins massive demolition of 'illegal' shops The Nation Newspaper",
    "summarized_story": "Minister of Federal Capital Territory (FCT), Malam Muhammad Bello has ordered the demolition of alleged illegal corner shops in Utako.\nBulldozers of the FCT Administration are demolishing the shops while traders are running around to salvage the what they can from their stuff.\nSenior Special Assistant on Monitoring, Inspection and Enforcement to FCT Minister, Comrade Ikharo Attah, who is leading the FCTA demolition team, said the Minister is not happy with the sad development of illegal building in Abuja.\nAttah noted the residents had taken for granted the administration’s decision to use stakeholders engagement and respect for human rights in dealing with developmental issues before any enforcement.\nHe bemoaned the activities by some persons that were gradually turning the Utako area to a security risk."
  },
  {
    "headline": "JUST IN: 3 Guards Brigade soldiers injured in terrorists ambush in Abuja",
    "summarized_story": "From Molly Kilete, AbujaThree soldiers are said to have been been injured in an ambush by the Boko Haram terrorists in Bwari Area Council of the Federal Capital Territory(FCT).\nThe soldiers from Guards Brigade, were said to have been on patrol of Bwari Area where the Nigerian Law School and the Joint Admission Matriculation Board(JAMB), is located.\nThe soldiers from 7 Guards Battalion who have been carrying out patrol in the town following intelligence report of an impending attack on the Nigerian Law School, came under heavy fire around the Kubwa-Bwari road.\nDaily Sun gathered that the wounded soldiers have been moved to the 7 Guards Medical center where they are currently receiving treatment and in stable condition.\nThe Guards in charge of the security of the President, his entire family, the Vice President, Very Important Personalities(VIP), the Federal Capital Territory and its surrounding states."
  },
  {
    "headline": "Russia moves to create own international court to try Ukrainians",
    "summarized_story": "Russian plans to bring more than 200 Ukrainians to trial for crimes against humanity before an international court it is in the process of creating.\nThe Head of the Russian Investigative Committee, Alexander Bastrykin said such a tribunal would be under the leadership of a partner organisation of Russia.\nBastrykin added that there are investigations against British, U.S., Canadian, Dutch and Georgian citizens for mercenary activities.\n“The appeal proceedings are still ongoing.”Russia, however, is facing more than 1,300 criminal proceedings against some 400 people at the International Criminal Court (ICC) for alleged war crimes committed against the civilian population in Ukraine.\nIn the south, the general staff reported heavy artillery battles and Russian air strikes in Kherson."
  },
  {
    "headline": "Insecurity: FG’s planned motorcycle ban will throw 40m Nigerians into job market – ACOMORAN",
    "summarized_story": "Addressing a press conference on Monday, the National President of ACOMORAN, Samsudeen Apelogun, noted that their membership base stands at 12 million nationwide, with 6 million adequately registered.\nApelogun said, “Commuters see motorcycles as a relief to their transportation problems while motorcycle riders see their adventure as a source of livelihood.\n“If 10 million of these 40 million people they plan to render jobless take to crime, can the government contain them?\nThe epileptic natures of our power supply have grounded many small-scale industries thereby making it difficult for artisans to operate.\nIf a solution is found to power supply today, I am very confident that many of the youths who are involved in criminality will be gain-fully emplpyed or engaged."
  },
  {
    "headline": "Usain Bolt salutes record breaker Tobi Amusan",
    "summarized_story": "Retired Jamaican sprinter, Usain Bolt has congratulated Nigeria’s Tobi Amusan, who smashed the world record in the Women’s 100 metres hurdles, to win gold at the World Athletics Championships in Oregon, USA.\nBolt took to Twitter to tweet the message: “Congrats”, retweeting World Athletics tweet celebrating her feat.\nThe feat by the 25-year-old meant that she made history as the first Nigerian to win a world title and an unprecedented world record in one day.\nAmusan first ran a blistering 12:12 seconds to shatter the world record of 12:20 seconds set by Kendra Harrison of U. S. in the semi-finals.\nShe became the first Nigerian to win a world title and an unprecedented world record in one evening."
  },
  {
    "headline": "BBNaija show welcomes 12 more housemates",
    "summarized_story": "Twelve more housemates were on Sunday introduced into the Big Brother Naija (BBNaija) reality show season seven.\nHowever, there was a new twist in the show as another house was unveiled for the second batch of the BBNaija housemates.\nThe second set of housemates were placed in a separate house, different from that of the first 12 housemates that were introduced during the live launch show on Saturday.\nThe house occupied by the first 12 contestants is called the “Level Two” house while the 12 new entrants are in the “Level One” house.\nHe said this was done to be able to divide the housemates into each of the two BBNaija houses."
  },
  {
    "headline": "ADC: Social Media Support for Obi will Wane Before 2023 Election – THISDAYLIVE",
    "summarized_story": "David-Chyddy Eleke in AwkaThe African Democratic Congress (ADC) has stated that the support for the Presidential Candidate of the Labour Party (LP), Mr. Peter Obi, would wane before the February 2023 election.\nArinze, who formally unveiled the Presidential Candidate of the ADC, Mr. Dumebi Kachikwu, said that the party is confident of beating other parties in the election, including Peter Obi.\nHe said: “We have resolved to deepen our presence in Anambra State.\n“We are not bothered about the noise on social media about the Candidate of the Labour Party, Mr. Peter Obi.\nIn their separate remarks, some candidates of the party stated their motivating factor and expressed hope that the party would win in their constituencies convincingly."
  },
  {
    "headline": "Gunmen Kill Three Policemen, Cart Away Two AK-47 Rifles in Delta – THISDAYLIVE",
    "summarized_story": "Sylvester Idowu in WarriSuspected gunmen yesterday killed three policemen at Okpanam in Oshimili North Local Government Area of Delta State.\nAlso, another policeman is critically injured and his is receiving treatment at an undisclosed hospital in the area.\n“The DPO detailed four patrol men, but as the patrol team drove out of the station, gunmen suspected to be IPOB members opened fire on them and killed three on the spot,” the source said.\nSources disclosed that two AK-47 rifles were carted away by the suspected gunmen allegedly led by a man popularly known as ‘Okputo’ in the area.\nEffort to get the Delta State Police Public Relations Officer (PPRO), Edafe Bright’s reaction proved abortive as he refused to answer his phone calls."
  },
  {
    "headline": "Delta Community Vows to Continue to Protest Agip’s Neglect – THISDAYLIVE",
    "summarized_story": "The Delta State Government invited them twice to discuss our complaints, they failed to honour the invitations.\nAnd when we began the protest on July 6, the Delta State Commissioner for Oil and Gas invited us to a meeting with NAOC officials on July 11.\nAt that meeting, the oil company attested to the fact Idheze Community has been a very peaceful host without any history of vandalism or oil theft.\nNAOC refused to sign a new MoU since then.\nWe have appealed to NAOC through the Delta State Ministry of Oil and Gas and other agencies but the company has refused to listen to us."
  },
  {
    "headline": "Buhari Congratulates Amusan for Winning World 100m Hurdles Gold – THISDAYLIVE",
    "summarized_story": "*Commends Ese Brume, Team Nigeria for making nation proudDeji Elumoye in AbujaPresident Muhammadu Buhari has congratulated Nigeria’s Tobi Amusan for winning the women’s 100m hurdles gold at the World Athletics Championship 2022, setting a new world record in the semifinals of the athletic event and becoming the first Nigerian to win a World Championship.\nThe President thanked the track superstar for making the Nigerian national anthem resonate again from the international podium, leaving the nation with the excitement and unforgettable memories of tears of joy and triumph; hope and victory; incredulity and belief.\nPresident Buhari said the legendary career and achievements of the golden girl will continue to inspire the upcoming generations of Nigerian athletes to achieve spectacular success.\nThe President also commended Ese Brume for representing Nigeria with honour and pride, winning silver medal in the Women’s long jump event.\nHe lauded Team Nigeria for displaying courage, integrity and good sportsmanship at the world stage, proving that with hard work and determination, success is achievable."
  },
  {
    "headline": "Insecurity: Arewa Youths Call for NSA’s Resignation – THISDAYLIVE",
    "summarized_story": "* Say Munguno has run out of ideasJohn Shiklam in KadunaThe Arewa Youth Assembly (AYA) has called for the resignation of the National Security Adviser (NSA), Babagana Munguno, over the embarrassing activities of terrorists in the country.\nIt is just a matter of time, these ragtag elements will draw inspiration from the Afghanistan terrorists and take over leadership of our country.\nHence, the honourable thing for him to do is to pack his luggage and return to his retirement destination.\nWhere he fails to, Mr. President should urgently sack him and get him replaced.\n“The youths will not participate in activities in the build up to 2023 general election and the election proper if our brothers and sisters in captivity are not released."
  },
  {
    "headline": "Alleged N109Billion Fraud: High Court Remands Suspended Nigerian Accountant-General, Idris In Kuje Prison",
    "summarized_story": "A Federal Capital Territory High Court, Abuja has ordered that the suspended Accountant General of the Federation, Ahmed Idris, be remanded in Kuje Correctional Centre pending the hearing and determination of his bail application.\nThe Economic and Financial Crimes Commission had arraigned Idris alongside three others on 14 counts of stealing and criminal breach of trust to the tune of N109, 485,572,691.9.\nOthers arraigned with him are Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nThe EFCC had accused Idris and his co-defendants of stealing and criminal breach of trust to the tune of N109.5 billion.\nMinister of Finance, Zainab Ahmed thereafter suspended Idris indefinitely without pay."
  },
  {
    "headline": "Alleged N109Billion Fraud: High Court Remands Suspended Nigerian Accountant-General, Idris In Kuje Prison",
    "summarized_story": "A Federal Capital Territory High Court, Abuja has ordered that the suspended Accountant General of the Federation, Ahmed Idris, be remanded in Kuje Correctional Centre pending the hearing and determination of his bail application.\nThe Economic and Financial Crimes Commission had arraigned Idris alongside three others on 14 counts of stealing and criminal breach of trust to the tune of N109, 485,572,691.9.\nOthers arraigned with him are Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nThe EFCC had accused Idris and his co-defendants of stealing and criminal breach of trust to the tune of N109.5 billion.\nMinister of Finance, Zainab Ahmed thereafter suspended Idris indefinitely without pay."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "BudgIT asks FG to discontinue 'indiscriminate' borrowing",
    "summarized_story": "BudgIT, a civic-tech organisation, has expressed concerns over the poor fiscal performance of the federal government’s 2022 budget and the growing subsidy payments.\nBudgIT said this in a statement on Monday signed by Iyanu Fatoba, assistant head, media and communications.\nAccording to BudgIT, the most pressing concern is the debt service-to-revenue ratio, which has reached alarming levels within the first four months of 2022.\nIn particular, the debt service spending is only N93.6 billion less than the combined total personnel and capital expenditure for the period under review.\nThe civic-tech group advised the federal government to discontinue indiscriminate borrowing through ways and means."
  },
  {
    "headline": "BudgIT asks FG to discontinue 'indiscriminate' borrowing",
    "summarized_story": "BudgIT, a civic-tech organisation, has expressed concerns over the poor fiscal performance of the federal government’s 2022 budget and the growing subsidy payments.\nBudgIT said this in a statement on Monday signed by Iyanu Fatoba, assistant head, media and communications.\nAccording to BudgIT, the most pressing concern is the debt service-to-revenue ratio, which has reached alarming levels within the first four months of 2022.\nIn particular, the debt service spending is only N93.6 billion less than the combined total personnel and capital expenditure for the period under review.\nThe civic-tech group advised the federal government to discontinue indiscriminate borrowing through ways and means."
  },
  {
    "headline": "'He has run out of ideas' -- CSO demands Monguno's resignation as NSA",
    "summarized_story": "A group known as Arewa Youth Assembly (AYA) has called for the resignation of Babagana Monguno, national security adviser (NSA), over the insecurity in the country.\nMohammed Danlami, spokesman of the group, in a statement on Monday said the NSA has run out of ideas in tackling the security challenges in the country, and therefore should resign or be sacked by the president.\n“The Arewa Youth Assembly shares in the pain and agony of the immediate families and friends of those in captivity and pray God to intervene through His supernatural power and set them free,” Danlami said.\nAdvertisement“We have observed that this insult to our country sovereignty would not have been possible if the National Security Adviser, who is supposed to guide Mr President had not run out of ideas.\nAdvertisement“Also most of our Local Government Areas and communities that are now under the control of either Ansaru terrorists in North Central and North West or ISWAP in North East should be recovered."
  },
  {
    "headline": "'He has run out of ideas' -- CSO demands Monguno's resignation as NSA",
    "summarized_story": "A group known as Arewa Youth Assembly (AYA) has called for the resignation of Babagana Monguno, national security adviser (NSA), over the insecurity in the country.\nMohammed Danlami, spokesman of the group, in a statement on Monday said the NSA has run out of ideas in tackling the security challenges in the country, and therefore should resign or be sacked by the president.\n“The Arewa Youth Assembly shares in the pain and agony of the immediate families and friends of those in captivity and pray God to intervene through His supernatural power and set them free,” Danlami said.\nAdvertisement“We have observed that this insult to our country sovereignty would not have been possible if the National Security Adviser, who is supposed to guide Mr President had not run out of ideas.\nAdvertisement“Also most of our Local Government Areas and communities that are now under the control of either Ansaru terrorists in North Central and North West or ISWAP in North East should be recovered."
  },
  {
    "headline": "PHOTOS: Families of abducted Kaduna-train passengers protest at ministry of transportation",
    "summarized_story": "Families of Kaduna-train-attack victims are protesting at the ministry of transportation in Abuja.\nThe protesters converged on the ministry’s gate on Monday and barred staff from entry.\nThey asked the government to secure the release of their relatives held captive by bandits.\nBelow are pictures.\nAdvertisement"
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "From Nigeria to the UK with the Global Talent Visa",
    "summarized_story": "When writers Ope Adedeji and Chika Jones decided to apply for the UK Global Talent Visa, both thought the process would be like all other visa applications—grueling and 3 months long, filled with insurmountable documentation, and lingering interviews.\nMany more are looking to take advantage of this opportunity, and if you’re one of them, here’s how 2 exceptionally talented individuals japa-ed with the UK Global Talent Visa.\nExceptional Talent v Exceptional PromiseThe first stage of applying for the UK Global Talent Visa is getting endorsed by any of 6 relevant endorsing bodies.\nUnlike other visa applications where you have to book interviews at consulates, the Global Talent Visa has 6 governing bodies that review applications from applicants who can bid for the visa under 2 circumstances: Exceptional Talent or Exceptional Promise.\nThe best part about the Global Talent Visa, according to Koroye, is that awardees don’t have to be in the UK all year round."
  },
  {
    "headline": "Netflix loses 970,000 subscribers in Q2",
    "summarized_story": "Yesterday, global streaming service Netflix announced via its Q2 2022 financial results that it lost 970,000 subscribers in the second quarter of the year.\nAccording to Netflix, over 100 million of its 222 million paying subscribers are sharing their passwords with people outside of their households.\nNetflix, however, still has the biggest share of the streaming service market with 220 million subscribers while Amazon’s Prime Video holds 200 million, while Disney+ and HBO Max hold 87.6 million and 74 million subscribers respectively.\n1 million subscribers in Q3The service also plans to keep its top spot and add 1 million subscribers to its tally by Q3.\nWhile its total number of subscribers might have declined by 970,000, its year-on-year revenue, however, increased by 9% in Q2 2022."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How I Work: Oluwapelumi Oyetimein, Marketing & Growth Lead at Umba",
    "summarized_story": "Today, Oyetimein has made a name for himself in the industry, leading marketing and growth for several top companies.\nToday on How I Work, he talks about his transition from software development to marketing and how he consistently stays on top of his game.\nI think because over the past 10 years I’ve done more of marketing, it slightly eroded into the background.\nSo, I decided that I needed to figure out how proper businesses work and eventually be able to build a business on my own.\nOne is to “be at the right place, at the right time, doing the right thing”."
  },
  {
    "headline": "Making, understanding the new NNPC Ltd – Nigerian Observer",
    "summarized_story": "In line with Section 53(1) of the PIA 2021, with the transition, the government will no longer have control over the staffing of the NNPC limited.\nThe new NNPC limited will no longer remit funds into the Federation Accounts Allocation Committee (FAAC).\nApart from profit-seeking, NNPC Limited is expected to operate above board by mandatorily making disclosures for every financial year.\nMost importantly, the NNPC Limited will be ready for an Initial Public Offer (IPO) in the next 18 months.\n“The provisions of the PIA 2021 have given the Nigerian petroleum industry a new impetus."
  },
  {
    "headline": "Northern youths urge President Buhari, NASS to end banditry, kidnapping – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Speaker, Northern Youths Assembly of Nigeria(NYAN), Malam Mohammed Lawal, has called on President Muhammadu Buhari and the National Assembly to eliminate the raving menace of banditry and kidnappings in the north.\nLawal, in a statement on Sunday in Abuja, also emphasised the need for the northern governors to evolve new strategy to rid the region of all forms of criminality.\nHe said it was very imperative for the President and northern governors to eliminate banditry in the north before “banditry eliminates the region.\nThe youth leader, however, expressed confidence in the ability and capability of Buhari to tackle the ugly situation in no distance time.\n“This is because we believe President Buhari has the best intention for the country, but intentions are clearly not good enough.” (NAN)Share this: TweetWhatsAppEmailPrint..."
  },
  {
    "headline": "Nigeria Customs Service hails modernisation project court judgment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigeria Custom Service (NCS) said on Sunday that it would immediately commence its modernisation plan following the vacation of an interim order earlier placed on it by a Federal High Court in Abuja.\nHe noted that it was necessary for the court to formally make a pronouncement to vacate the order.\nEx-Parte Order on Customs Modernisation ProjectEx-Parte Order on Customs Modernisation ProjectAccording to him, it is imperative to vacate the order, given that the order is affecting the revenue collection of the Federal Government.\nHe added that the NCS was optimistic about the modernisation project as it was expected to transform how the service does its business.\nNAN reports that Trade Modernisation Project Ltd, a Nigerian company, signed a 20-year concession agreement with the Federal Government on May 30, 2022, to improve the business processes of the Service."
  },
  {
    "headline": "Gunmen Kill Omo-Agege’s Aide In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – An aide to the Deputy Senate President, Ovie Omo-Agege, has been shot dead by yet to be identified gunmen in Sapele, Sapele Local Government Area of Delta State.\nThe deceased, Mr Cyril Mudiagbe, popularly called Cyril Makanaki, was a popular member of the All Progressives Congress (APC) in Ward 6 in Sapele.\n“The unknown gunmen came directly to the late Cyril Makanaki’s apartment and instructed him to open the door for them, which the late Cyril refused.\n“The unknown gunmen forcefully gained entrance by breaking the door into the apartment and shot him.\n“This looks like an assassination because the late Cyril was not robbed of anything."
  },
  {
    "headline": "JUST-IN: Gunmen Attack Ondo Police Division, Kill Policeman",
    "summarized_story": "Unknown gunmen have attacked Okuta Elerinla Police Division in Akure, the Ondo State Capital, killing one policeman on duty.\nThe attack was carried out in the wee hours of Monday.\nLEADERSHIP learnt that the police officer was shot dead during the shootout that ensued.\nConfirming the incident, the Ondo State Police Public Relations Officer (PPRO), Funmilayo Odunlami, said the attempt by the hoodlums to gain entrance into the police division headquarters was, however, repelled by the gallant police officers on duty.\nAccording to her, “Policemen who were at alert and alive to their duty repelled them accordingly and the miscreants were unable to gain entrance into the station."
  },
  {
    "headline": "JUST-IN: Gunmen Attack Ondo Police Division, Kill Policeman",
    "summarized_story": "Unknown gunmen have attacked Okuta Elerinla Police Division in Akure, the Ondo State Capital, killing one policeman on duty.\nThe attack was carried out in the wee hours of Monday.\nLEADERSHIP learnt that the police officer was shot dead during the shootout that ensued.\nConfirming the incident, the Ondo State Police Public Relations Officer (PPRO), Funmilayo Odunlami, said the attempt by the hoodlums to gain entrance into the police division headquarters was, however, repelled by the gallant police officers on duty.\nAccording to her, “Policemen who were at alert and alive to their duty repelled them accordingly and the miscreants were unable to gain entrance into the station."
  },
  {
    "headline": "You Stunned The Athletics World With Your Superlative Performance, Buhari Reacts To Amusan’s Feat",
    "summarized_story": "President Muhammadu Buhari has expressed heartfelt congratulations to Tobi Amusan for winning the women’s 100m hurdles gold for Nigeria at the World Athletics Championship 2022, setting a new world record in the semifinals of the athletic event and becoming the first Nigerian to win a World Championship.\nThe President, in a statement by his media aide, Femi Adesina, on Monday, joined millions of Nigerians in celebrating this outstanding feat by a compatriot and two-time African Games champion, who in one night stunned the athletics world with her superlative and stellar performance.\nPresident Buhari said the legendary career and achievements of the golden girl will continue to inspire the upcoming generations of Nigerian athletes to achieve spectacular success.\nThe President also commended Ese Brume for representing Nigeria with honour and pride, winning silver medal in the Women’s long jump event.\nThe President lauded Team Nigeria for displaying courage, integrity and good sportsmanship at the world stage, proving that with hard work and determination, success is achievable."
  },
  {
    "headline": "You Stunned The Athletics World With Your Superlative Performance, Buhari Reacts To Amusan’s Feat",
    "summarized_story": "President Muhammadu Buhari has expressed heartfelt congratulations to Tobi Amusan for winning the women’s 100m hurdles gold for Nigeria at the World Athletics Championship 2022, setting a new world record in the semifinals of the athletic event and becoming the first Nigerian to win a World Championship.\nThe President, in a statement by his media aide, Femi Adesina, on Monday, joined millions of Nigerians in celebrating this outstanding feat by a compatriot and two-time African Games champion, who in one night stunned the athletics world with her superlative and stellar performance.\nPresident Buhari said the legendary career and achievements of the golden girl will continue to inspire the upcoming generations of Nigerian athletes to achieve spectacular success.\nThe President also commended Ese Brume for representing Nigeria with honour and pride, winning silver medal in the Women’s long jump event.\nThe President lauded Team Nigeria for displaying courage, integrity and good sportsmanship at the world stage, proving that with hard work and determination, success is achievable."
  },
  {
    "headline": "7 Expert Tips To Help You Win In Apex Legends",
    "summarized_story": "Are you a big fan of Apex Legends?\nWhat is Apex Legends?\nReleased for Microsoft Windows, PlayStation 4, and Xbox One, Apex Legends is a free-to-play battle royale game.\nHow to win in Apex legends?\nThere are several Apex Legends cheats that can be used to win in Apex Legends."
  },
  {
    "headline": "Elon Musk denies reported affair with wife of Google co-founder",
    "summarized_story": "The world’s richest man and CEO of Tesla Motors, Elon Musk has debunked claims that he had an affair with Nicole Shanahan, wife of Google’s co-founder, Sergey Brin.\nThis comes after the Wall Street Journal reported that his friendship with Brin ended over the alleged affair.\nWhen asked what can be done, Musk tweeted “Call them out on it, I guess.\n“WSJ should be running stories that actually matter to their readers and have solid factual basis, not third-party random hearsay.\nNone of the key people involved in these alleged wrongdoings were even interviewed!”"
  },
  {
    "headline": "Ijeoma Odiaze, 4 others docked for N7.6m theft",
    "summarized_story": "By Adepote ArowojobeFive people were on Monday docked in an Ikorodu Magistrates’ Court in Lagos State for allegedly stealing N7.6 million belonging to “Beyond” Micro Finance Bank.\nThe police charged Ijeoma Odiaze, 52; Ogana Joy,48; Victoria Omidime, 34; Victor Nweke, 29 and John Ipu 32; whose addresses were not given, with conspiracy and felony to wit theft.\nThe Prosecution Counsel, Insp Adegeshin Famuyiwa, said the defendants committed the offence sometime in September 2021 in Ikorodu, Lagos.\nThe offence, the police said, contravenes the provisions sections 411, 280 and punishable under sections 287 of the Criminal Law of Lagos State, 2015.\nMagistrate O.A Ogbe admitted the defendants to bail in the sum of N100, 000 each, with two sureties each in like sum."
  },
  {
    "headline": "You Must Perform As Governor, Or I Will Lead An Opposition Against You,",
    "summarized_story": "The founder of the AU noted that, in addition to the nation’s need for better leadership, the nation also lacked the best followership when he spoke at the university’s eighth convocation in Ede.\nHe said, “I told the governor-elect (Senator Ademola Adeleke) and his colleagues.\nHe added, “Meanwhile, people were waiting to vote but materials, result sheets, and BVAS machines were taken somewhere else.\n“Until a director started calling to make sure that those people reported to where they were supposed to, my brother wouldn’t have been the governor-elect today.\nPeople blame INEC, forgetting that the young ones that have been entrusted with this responsibility are the ones wrecking their own future.”"
  },
  {
    "headline": "Families Of Abuja-Kaduna Train Attack Victims Protest",
    "summarized_story": "The families of the train victims protested outside the Ministry of Transportation on Monday in opposition to their loved ones’ continuing detention in the terrorists’ den.\nThis happened after the terrorists posted a video showing the brutal flogging of the male victims.\nThe family who had been at the ministry since 6 am claimed that they were there to vent their annoyance at the captives’ ongoing detention.\nThey vowed to stay put until they were certain that their loved ones would return."
  },
  {
    "headline": "BREAKING: Gunmen Invade Police Station, Kill Officer In Ondo",
    "summarized_story": "After gunmen invaded the Okuta Elerinla Police Division, one police officer was slain in Ondo State.\nAccording to NEWS DIRECT, the gunmen rushed the station on Monday about 1:00 am, catching the on-duty officers off guard.\nBoluwaji Temenu, a police officer with the registration number AP 207538, was killed in the attack during the frenzied gunfire.\nPolice Public Relations Officer in the State, SP Funmilayo Odunlami, confirmed the attack and said that the station’s officers were successful in fighting it off.\nOdunlami stated that the State Criminal Investigation Department, SCID, had been instructed by Police Commissioner Oyeyemi Oyediran to take over the investigation right away."
  },
  {
    "headline": "BBNaija S7: Biggie Introduces New Twist, Unveils 13 New Housemates",
    "summarized_story": "The producers of Big Brother Naija have, for the first time in the reality series’ history, included a fresh twist that will keep viewers riveted to their TVs.\nDuring the second premiere of the “level up” edition, the show’s host, Ebuka Obi Uchendu, revealed a second house.\nIt is unclear, though, whether residents of the two residences will be pitted against one another.\nRecall that during the first unveiling on Saturday, 13 housemates were revealed.\nEbuka welcomed 12 new housemates to the new home on Sunday."
  },
  {
    "headline": "Plateau NLC mobilises for solidarity protest over ASUU strike",
    "summarized_story": "The Plateau State chapter of the Nigeria Labour Congress (NLC), has begun mobilisation of its members and other affiliate unions ahead of the planned nationwide solidarity protest by the organised labour in support of the lingering strike by the Academic Staff Union of Universities (ASUU).\nThe nationwide protest is expected to come up on the July 26 and 27, 2022.\nA notice circulated to Plateau workers on Sunday by the leadership of the state NLC said there was no going back on the protest.\nThe notice signed by the state Secretary of the NLC, Mr Dalyop Badung, was obtained by The PUNCH in Jos on Sunday.\n“All affiliates are to assemble under the bridge of the Secretariat flyover by 8am prompt for the protest."
  },
  {
    "headline": "Breaking: Abuja-Kaduna train victims’ families storm Abuja, launch protest",
    "summarized_story": "The families of Abuja-Kaduna train kidnapped victims have stormed the Federal Ministry of Transportation on Monday to protest against the continued stay of their loved ones in the terrorists’ den.\nBlueprint reported that the terrorists released a video where the male victims were being mercilessly flogged.\nThe families in their huge number stormed the ministry at about 6 am to express their frustration over the continued stay of those in captivity.\nThey vowed not to leave until they were assured of the return of their loved ones.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "VIDEO: Watch as Nigeria’s Tobi Amusan grabs $100, 000, celebrates after breaking record at World athletics championship Oregon 2022",
    "summarized_story": "Tobi Amusan has made the day of all Nigerians and her fans around the world after winning women’s 100m hurdles gold at the World Athletics Championships in Eugene, Oregon.\nThree years ago when the competition was held in Doha, Tobi Amusan finished as fourth best before coming back this year to record her name in the history books of athletics.\nNigeria’s Tobi Amusan defeated Jamaica’s Britany Anderson who finished second, while Jasmine Camacho-Quinn ended as third best in the challenging race.\nTobi Amusan was presented with her cheque of $100,000 after the race in which the Nigerian was in joyous momentum.\nAs records stand now for Tobi Amusan, she has really done well for her country as she was also Commonwealth champion in 2018."
  },
  {
    "headline": "NERC, NOA sign MoU for orientation of electricity consumers on relationship improvement",
    "summarized_story": "By Onu OkorieNigerian Electricity Regulatory Commission (NERC) has formed partnership with the National Orientation Agency (NOA over the weekend as efforts are intensified accross Nigeria to effectively sensitise the public over improved relationship in the sector relationship .\nThe partnership was consumated at the headquarters of NERC, where the both agencies signed a Memorandum of Understanding (MoU).\nSanusi Garba, the Chairman of NERC, said the Nigerian Electricity Supply Industry (NESI) requires more sensitization and Nigerians need knowledge on how they get electricity, noting that the NOA platform is for educating Nigerians on electricity theft, safety and other issues.\nHe said, “There is a huge amount of ignorance among our populace on how things are done especially in technical areas like electricity supply.\nOn this NOA pact whose process began in January, she said: “They have been sending bulk SMS to invite customers to our programmes wherever NERC goes to sensitise consumers,” adding that consumers will be educated on their rights and responsibilities."
  },
  {
    "headline": "UN applauds Sterling One Foundation over Africa social impact summit",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE United Nations Resident and Humanitarian Coordinator, Nigeria Mr. Matthias Schmale, has commended the Sterling One Foundation for creating a convening to accelerate growth towards the 2030 Sustainable Development Goals across Africa.\nThis was shared during the 2-day hybrid event held on July 13-14, 2022, at the prestigious Transcorp Hilton Hotel Abuja which had about 4,000 registered delegates from 55 countries.\nMost of these businesses already have conditional commitments from our investors at the event and we expect to seal these deals in the coming weeks working with the investees.\nWe will continue facilitating financing for purpose and profit driven business solutions that will help promote access to health and education for all while guaranteeing returns for impact investors locally and globally’’, she added.\nShe noted that the Foundation was already working with various partners and will continue in this light as the event was organized in partnership with the United Nations Global Compact Network Nigeria, Sterling Bank, the Coca Cola Company, VFD Group, the Impact Investors Foundation, Giving.ng, the Nigeria Climate Innovation Center (NCIC), the Nigerian Economic Summit Group (NESG), Ventures Africa, Proshare and Tech Cabal."
  },
  {
    "headline": "NASENI MD Prof Haruna bags outstanding performance Award",
    "summarized_story": "By Eunice OrikeThe Executive Vice Chairman/Chief Executive of the National Agency for Science and Engineering Infrastructure(NASENI), Engr.Prof.\nMohammed Sani Haruna has received Business Day outstanding performance Award ahead over 100 Ministries Departments and Agencies (MDAs) of Government assessed by a special panel set up by the newspaper.\nAccording to Business Day Panel’s assessment in year 2021, NASENI under Prof. Haruna’s leadership recorded impeccable achievements in areas of inventions, innovations and products development through multi-sector interventions.\nThe verdict of the judges was that the Executive Vice Chairman of NASENI distinguished himself as an administrator per excellence through the various innovations introduced to NASENI.\nBecause of the leadership by Prof. Haruna, NASENI rose from an obscure agency in the Federal Ministry of Science and Technology to an agency that has contributed immensely to national development."
  },
  {
    "headline": "SEC Implementing Initiatives to Boost More Listings – Yuguda",
    "summarized_story": "He said, “let me reiterate that the SEC is continually focused on increasing the visibility and attractiveness of our market, and will continue to focus on building and sustaining a fair, transparent and efficient capital market.\n“You may be aware that the Commission is in the implementation phase of a comprehensive market and institutional reform program – the Capital Market Masterplan that is intended to reposition the Nigerian Capital Market to be globally competitive.\nThe reviewed plan is expected to guide further development of the capital market so as to attract more funds for economic growth and development” he stated.\nThis is to align the law with current realities and global trends in capital market regulation, including growing changes in market practices, processes and products.\n“We have consistently focussed on the creation of an ecosystem in which governments, entrepreneurs and other issuers can efficiently access capital."
  },
  {
    "headline": "Orange Telecom vows to play in Nigeria’s big market",
    "summarized_story": "By Our CorrespondentAfter a closer analysis of the huge potentials of the Nigerian telecom market, international telecom investor-operator, Orange Group, has vowed to play a big part in Africa’s biggest service space, in diversified areas including mobile, data, and fixed and financial technology support services.\n“We are here to ensure steady investment for a long term.\nWe also want to support the vision of the Commission in driving broadband penetration for a robust digital economy and leverage on local content development initiatives,” she said.\nAdefala said Nigeria is missing in Orange Group’s portfolio of combined networks of over 140 million subscribers across 18 countries of its operations.\n“The large market potentials buoyed by the huge population, impressive Gross Domestic product (GDP) figure, proximity to our operations in the neighbouring African countries, as well as the appreciable friendly operating environment are great motivators for our expansion plan into the Nigerian telecom market”."
  },
  {
    "headline": "Relatives Of Kaduna Train Attack Victims Picket Transportation Ministry",
    "summarized_story": "﻿Relatives of the victims of the Abuja-Kaduna train attack have picketed the headquarters of the Ministry of Transportation in Abuja, following the release of a new video by the bandits.\nA spokesperson for the protesters, Ahmed Aruwa, said they would continue to block the entrance of the Ministry of Transportation until they get a definite response from the government.\nAlthough some of the train passengers have been released after ransoms were reportedly paid, dozens of victims are said to be left in the custody of the bandits.\nHe pleaded with members of the international community, including the United Nations, the United Kingdom, the United States, and France, among others to help secure their release.\n“The dilemmas in dealing with the specific case of train terrorists are manifold: punitive action like the popular call for carpet bombing of the known locations may assuage the desire of an angry public for revenge, but what about the hostages?"
  },
  {
    "headline": "All Hail The Queen: Tobi Amusan Wins Historic Gold For Nigeria",
    "summarized_story": "Tobi Amusan has become the first Nigerian athlete to win a World Athletics Championship gold as she blazed to victory in the women’s 100m hurdles in Eugene, Oregon.\nAmusan, who had smashed the world record in the semi-final where she clocked 12.12 seconds, powered over the line at Hayward Field in an incredible 12.06 seconds.\nHowever, her winning time will not be recognised as a world record due to an illegal tailwind of 2.5 metres per second.\n“Honestly, I believe in my abilities, but I was not expecting a world record at these championships,” Amusan said after her final victory.\nSo, the world record is a bonus."
  },
  {
    "headline": "PHOTOS: Emotions Run High As Nigeria’s Amusan Grabs Historic Gold",
    "summarized_story": "It was a mixed feeling of tears and excitement for Tobi Amusan after she stormed to victory in the women’s 100m hurdles in Oregon, bagging Nigeria’s first gold medal in a World Athletics Championship.\nAmusan, 25, blazed over the line at Hayward Field in 12.06sec, not long after she smashed the world record in an overwhelming semi-final where she clocked 12.12sec.\nShe delivered a jaw-dropping world record in the semis when she shattered the previous best mark of 12.20secs held by Keni Harrison of the United States since 2016.\nREAD ALSO: Tobi Amusan Wins Nigeria’s First-Ever World Athletics Championships GoldThe Nigerian athlete, along with her two runners-up in the race, later proceeded to the podium where they received their medals.\nThe photos below captured Amusan’s emotional moments after winning a historic gold for her country…"
  },
  {
    "headline": "Lagos-Ibadan Expressway To Be Completed This Year – Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has reiterated the Federal Government’s commitment to delivering infrastructural projects to Nigerians, saying the Lagos-Ibadan Expressway project will be delivered before December 25, 2022.\nWhen asked when the project will be completed, the Minister said the Federal Government plans to deliver the project before Christmas.\nSecond Niger BridgeThe Minister also unveiled the government’s plan toward ending the Second Niger Bridge project in the South-Eastern part of the country.\nFashola said the current administration also plans to open the bridge before Christmas, despite the challenges facing the project.\nAccording to Fashola, he has directed the contractor to see that the project is delivered before the deadline, adding that the main bridge deck has been completed."
  },
  {
    "headline": "China Swelters Under Record Heat",
    "summarized_story": "Cities across China were on red alert for heatwaves on Monday, as tens of millions of people were warned to stay indoors and record temperatures strained the energy supply.\nChina is no exception and is sweating through one of its hottest summers on record.\nPeople in areas under red heat alerts — mostly concentrated in the southeast and northwest — are being ordered to “cease all outdoor activities” and “pay special attention to fire prevention,” the national meteorological service said in multiple notices over the weekend.\nSome local governments have resorted to turning off street lamps and raising peak period electricity tariffs for factories this month.\nThe ongoing heat wave, which has struck the lower reaches of the Yangtze River especially hard, will also “adversely affect local crops,” warned Fu Jiaolan, chief forecaster at the National Meteorological Centre."
  },
  {
    "headline": "𝗔𝗸𝗶𝗻𝗹𝗮𝗱𝗲, 𝗖𝗵𝗶𝗲𝗳 𝗗𝗮𝗱𝗮 𝗺𝗲𝗲𝘁 𝗢𝗴𝘂𝗻 𝗪𝗲𝘀𝘁 𝗣𝗗𝗣 l𝗲𝗮𝗱𝗲𝗿𝘀",
    "summarized_story": "The Deputy Governorship Candidate of the People’s Democratic Party, Adekunle Akinlade on Tuesday met with the leadership of the party in Ogun West, at the private residence of Chief Alani Akinde, in Ota.\nThis is in line with the spirited campaign for the restoration of a people-centered government and adequate security in Ogun State."
  },
  {
    "headline": "APC to unveil Shettima as Tinubu's running mate on Wednesday -",
    "summarized_story": "The All Progressives Congress (APC) will formally unveil its Vice Presidential Candidate, Senator Kashim Shettima, to the Nigerian public on Wednesday, 20th July.\nThe event which will start at 11am prompt will hold at the Shehu Musa Yar’Adua Centre, Abuja.\nAdvertisementIn a statement signed by the party’s Organising secretary, Sulaiman Muhammad Argungu, all members of the National Executive Committee (NEC), members of the Progressives Governors’ Forum, members of APC Caucus in the National Assembly, members of the Federal Executive Council (FEC) are to attend.\nOther are members of the Diplomatic Corps, Presidential Aspirants at the June 2022 Special National Convention, APC State Chairmen, APC State Secretaries and APC State Organising Secretaries.\nAdvertisementAdvertisement"
  },
  {
    "headline": "Oyebanji seeks Ekiti stakeholders' cooperation as he begins thank you tour of LGAs -",
    "summarized_story": "Ekiti State Governor-elect, Biodun Abayomi Oyebanji, has said he would run an inclusive government and give equal opportunity to all Ekiti indigenes, regardless of political leanings and background.\nOyebanji stated this on Monday during his ‘thank you tour’ in Ikole, Oye and Ilejemeje local government areas, where he met traditional rulers, party leaders and other stakeholders and shared some of his plans and programmes for the state.\nIn particular, I appreciate our traditional rulers for their support and prayers.\nAdvertisementAdvertisement“To our party members and other people of Ekiti State, I thank you because you are truthful to yourselves, God and the generation yet unborn.\nThe Governor-elect called on party members to be magnanimous in victory by reaching out to aggrieved members and intending members and integrating them into the progressive fold."
  },
  {
    "headline": "Ekiti APC, Governor-elect begin thank you tour, road show",
    "summarized_story": "Ekiti State Governor- elect, Biodun Abayomi Oyebanji and the deputy governor- elect, Monisade Afuye on Monday (today) July 18, commenced a ‘thank you tour’ to all the 16 local government areas of the state to express their gratitude to the people of the State for their support in the June 18 governorship election.\nThe tour kicked off from Ikole local Government on Monday by 10am.\nAdvertisementAdvertisementThe second phase of the tour would involve visitation to ethnic groups, trade unions and community leaders.\nRecall that the Governor-Elect had visited prominent Ekiti leaders and stakeholders within and outside the state shortly after his election.\nAdvertisementOyebanji said the consultation would continue till his inauguration, adding that regular consultation with stakeholders and leaders will be a major feature of his administration’s Public engagement policy."
  },
  {
    "headline": "Wakanda Forever: Nigeria’s Tems Stars on Black Panther Sequel Soundtrack with ‘No Woman, No Cry’",
    "summarized_story": "Nigerian pop star, Temilade Openiyi, popularly known as Tems, features on the soundtrack for one of 2022’s most anticipated movies, ‘Black Panther: Wakanda Forever’ with a rendition of the Bob Marley classic ‘No Woman, No Cry’.\nThe teaser begins with Tems’ version of ‘No Woman, No Cry’ before it seamlessly transitions to Kendrick Lamar’s ‘Alright’.\nTems feature on the ‘Wakanda Forever’ soundtrack is sure to excite potentially millions on the mother continent, because it corrects an earlier oversight.\nConsidering that the ‘Black Panther’ franchise is based on a fictional African country, Wakanda, the soundtrack album for the first installment curated by Kendrick Lamar featured no Afrobeats artiste.\nWatch the “Black Panther: Wakanda Forever” trailer belowDemola Ojo"
  },
  {
    "headline": "Nigeria Women’s Team Breaks 30-Year-Old 4x100m African Record",
    "summarized_story": "The team ran a time of 42.22s to break the long-standing 42.39s African Record set by their compatriots, Christy Opara-Thompson, Faith Idehen, Beatrice Utondu and Mary Onyali, at the Barcelona 92 Olympics where Nigeria ended with a bronze medal.\nUdo-Gabriel ran a well-executed first leg before handing over to Ofili who sustained the momentum.\nNigeria had initially been kicked out of the women’s relay events in Oregon because of doping infractions established against Blessing Okagbare.\nHowever France pulled out to make a way for Nigeria to not just come on board but to set a new African record.\nDespite the disappoiment of not winning a medal, the relatively young Nigerian women’s relay team have the Commonwealth Games starting this week in Birmingham to look forward to for possible medals."
  },
  {
    "headline": "Biden’s Health Improving, No Close Contacts Tested Positive for Covid, White House Says",
    "summarized_story": "US President Joe Biden, who tested positive for COVID-19 on Thursday, is improving in health and none of his 17 identified close contacts have so far tested positive for the coronavirus, White House COVID coordinator Ashish Jha said on Sunday.\nJha told ABC News Biden “had a great day yesterday, was feeling well,” and that Biden’s close contacts were continuing to follow the protocols of the U.S. Centers for Disease Control and Prevention.\nBiden, 79, had experienced mild symptoms, according to the White House.\nThe White House has sought to underscore Biden’s ability to work through his illness.\nOn Thursday it released a video of him reassuring Americans he was doing fine, and on Friday he participated in virtual meetings with White House staff."
  },
  {
    "headline": "Terrorists Torture Abducted Kaduna Train Passengers, Threaten Buhari, El-Rufai, Governors, Senators",
    "summarized_story": "A new video released by terrorists shows abducted passengers of an Abuja-Kaduna train service being tortured by their captors.\nAfter a series of releases for ransom, 43 Nigerians are still held by the terrorists somewhere within the Birnin Gwari forest in Kaduna.\nIn the viral video recorded in Hausa, the terrorists threatened to kidnap Nigeria President Muhammadu Buhari and Kaduna State Governor Nasir El-Rufai, as well as other government officials.\nThe terrorists told him to come get them both, as long as he comes with food and water.\nHowever, Tukur Mamu who negotiated their release – as well as previous negotiations with the terrorists – insisted that no ransom was paid."
  },
  {
    "headline": "‘Explosive’ Wildfire Tears Through Homes as Thousands Forced to Flee in California",
    "summarized_story": "A state of emergency has been declared in a part of California as the largest active wildfire in the US rapidly spreads near Yosemite National Park.\nThe Oak Fire has quickly grown since starting on Friday, and firefighters have struggled to get the blaze under control.\nThe state of emergency, which has been declared in Mariposa County, will allow the state to access some federal assistance to tackle the fires.\nThe redwoods were threatened by another blaze earlier this month, but firefighters managed to save them.\nSeveral European governments have struggled to contain dozens of separate wildfires which have ripped across the continent in recent weeks."
  }
]