[
  {
    "headline": "22 govs apply as FG begins model ranch fund’s disbursement next week",
    "summarized_story": "No fewer than 22 states have written to the Federal Government to indicate interest in the National Livestock Transformation Programme.\nThe presidential aide explained that the model ranches would be used to train pastoralists and help them build their own ranches.\nWe’ve submitted business plan, says OndoWhen contacted, the Ondo State Government confirmed that it had submitted its business plan to the NLTP.\n“Cattle rearing is a private business and anybody who engages in the business should look for land and acquire it.\nThe grazing control law does not give land, but for the herder to rent and renew land at intervals."
  },
  {
    "headline": "Security agencies lack intelligence, can’t arrest insecurity – VC",
    "summarized_story": "THE Vice-Chancellor of the University of Abuja, Prof. Abdul-Rasheed Na’Allah, has said the security agencies and the political class were not doing enough to curb the insecurity in the country.\nHe blamed the lack of intelligence for the failure of the security forces to arrest the deteriorating security situation.\nHe said, “We have a lot of lessons to learn, we have a lot of work to do.\n“We can’t mobilise intelligence to know what is going to happen the next hour; it is a total failure.\n), said the emerging trend reinforced the need to deploy kinetic and non- kinetic approach in achieving the desired results."
  },
  {
    "headline": "Synagogue must not die, cries boxing champ, Apostle Oboh",
    "summarized_story": "Oboh said it was worth remembering that the Bible when the good Shepherd is killed all the flock will scatter.\nThe boxing champion turned-cleric said: “We have a lot to learn from Jesus.\n“Not just that, he made the whole church to know that Apostle Simon Peter is the very one that will take over from him.\n“One thing we must learn is that Jesus and Simon Peter were not related.\nIt is not all the time a family member of the late leader of a church must take over."
  },
  {
    "headline": "Propetrol Founder, Ebohon, wins Forbes Outstanding CEO award",
    "summarized_story": "Harry EbohonFounder and CEO of Propetrol Limited, Harry Ebohon, has been slated to receive the Outstanding CEO Award at the Forbes Energy 2021 Best of Africa awards.\nPropetrol is renowned as a leader among oil and gas firms successfully providing ethical solutions to the industry that drives Africa’s biggest economy.\nFrom its days of humble beginnings as a petroleum products hauling services provider, Propetrol now has proven capabilities in bunker trading, oil and gas products trading, trade financing, and value engineering across shipping and general maritime services.\nThe letter continued: “You have repeatedly shown yourself to be a thought leader, leading the charge in redefining the bunker trading industry in West Africa.\n“Under your leadership, Propetrol’s business model continues to evolve, expanding operations to other niche markets in Southern Africa and South Asia."
  },
  {
    "headline": "Alliance asks FG to operationalise Tobacco Control Fund",
    "summarized_story": "The Nigeria Tobacco Control Alliance, NTCA, has called on the Federal Government to operationalise the tobacco control fund in the interest of Nigerians and their safety.\nParticipants at the briefing themed ‘Operationalise Tobacco Control Fund’ demanded the immediate setting up of the administrative unit for the Tobacco Control Fund.\nThey include but are not limited to the following: reliable, dedicated, and protected source of funding for specific programmes, treatment of tobacco-related diseases, and other tobacco control priorities.\nOlaniyan said the Tobacco Control Fund will help the Ministry of Health avoid going to the tobacco industry cap-in-hand for support because there is also a limit to support civil societies can give to the ministry.\nAlso stressing that Tobacco Control Fund is a product of the Nigerian law as established by National Tobacco Control Act 2015 was Chibuike Nwokorie, the Project Officer of Nigerian Tobacco Control Alliance."
  },
  {
    "headline": "Why many are denied Canadian visa — Angela Ogundele",
    "summarized_story": "Reeling out these was Angela Ogundele, CEO, HisCharis Immigration Citizenship Service, while speaking at the virtual launch of HisCharis, recently.\nSpeaking on the theme ‘Study in Canada and Immigrate’, Ogundele said it is important to stick to one’s previous field of study if seeking to study in Canada.\nShe said: “You can come into Canada either as a student, a worker or business personnel.\n“Also, if you wish to come along with your family on a student visa, it is advisable you seek to secure your own visa first before applying for that of your family members.\nSpeaking further, the licensed immigration consultant and Canadian Commissioner for Oath, shared her journey into the immigration service terrain."
  },
  {
    "headline": "Udom flags off PDP membership E- registration in Akwa Ibom",
    "summarized_story": "UdomAhead of 2023 general elections, the Peoples Democratic Party (PDP) has commence membership electronic registration and revalidation exercise to expand its membership base in Akwa Ibom State.\nThe Akwa Ibom State Governor, Mr. Udom Emmanuel who performed the flag-off exercise on Tuesday at Ibom Hall Ground, Uyo, enjoined party faithfuls to take advantage of the exercise which puts an end to rigorous procedure posed by the analogue method.\nGovernor Emmanuel further advised Party members to accommodate one another in order to strengthen the party especially those who defected and are willing to rejoin the party.\n“This exercise we strongly believe as a party will ensure that we migrate from the analogue process of registration to a digital platform with attendant benefits.\n“Apart from making the registration process easier, faster, open and less cumbersome, it also provides members with a transparent platform for self-registration and eliminate cases of registration denial”, Akpan added."
  },
  {
    "headline": "Police recruitment: Ogun command gives update",
    "summarized_story": "The Ogun State Police Command has announced to indigenes of the state, who took part in the 2020 recruitment exercise that “the Nigeria Police Force, in collaboration with the Police Service Commission, will be concluding the exercise nationwide with Computer-Based Test for shortlisted candidates.”A statement by the State Police Public Relations Officer, Abimbola Oyeyemi, on Tuesday, explained that the computer-based test would hold on Friday, October 29 and Saturday, October 30 at the Federal University of Agriculture Abeokuta (FUNAAB), starting from 8:00am daily.\n“In view of this, all candidates who applied and attended the physical exercise last year 2020 are advised to visit the recruitment portal on www.policerecruitment.gov.ng and print the CBT examination slip, if qualified for the next stage of the exercise, on or before 28th of October, 2021,” Oyeyemi stated.\nHe added that the Ogun Commissioner of Police, Lanre Bankole, while wishing the candidates success, warned them against falling victim of job scammers, saying “the recruitment exercise is absolutely free and devoid of any financial obligation on the part of the candidates.”"
  },
  {
    "headline": "Police recruitment: Date for Computer-Based Test announced",
    "summarized_story": "The Kaduna State Police Command on Tuesday evening announced date for Computer Based Test examination for all eligible job seekers wishing to be recruited into the police force.\nThe Computer Based Test which will take place at three designated centres across the state on Friday, 29th and Saturday, 30th October, 2021 are; Dambo International College BarnawaSardauna Memorial College (SMC) and Iya Abubakar CBT Center, Ahmadu Bello University Zaria.\nIn a statement on Tuesday evening by Kaduna Command’s Public Relations Officer, ASP Mohammed Jalige called on those who participated in the 2020 Physical and Credential Screening Exercise that, the Nigeria Police Force in collaboration with the Police Service Commission will be concluding the ongoing 2020 recruitment exercise of Ten Thousand (10,000) Police Constables into the service of the Nigeria Police Force.\n“To this effect, the Command enjoins all applicants to check their names in the comprehensive list pasted at the Police Command Headquarters Bidda Road Kaduna,” the statement said.\nThe statement urged the successful candidates to print out their examination slip which must be presented during the Computer Based Test ExaminationHe said the Command reiterates that the recruitment exercise is absolutely free of charge and without any pecuniary obligation, and warns all and sundry to desist from any form of extortion, as anybody found wanting will be sanctioned accordingly."
  },
  {
    "headline": "Anambra Guber: Babagana Monguno issues strong warning to troublemakers",
    "summarized_story": "The National Security Adviser, retired Maj.-Gen. Babagana Monguno, says those planning to disrupt the Anambra governorship election scheduled to hold on Nov. 6 should have a rethink.\nHe gave an assurance that the security agencies would ensure that the people of Anambra State elected their next governor without any rancour.\nAccording to him, the Anambra elections will witness the joint deployment of all security operatives across the state.\n“The security agencies have also been told to exhibit the highest level of professionalism, self-restraint, discipline and adherence to what is written in the statute.\nHe assured them that the police would behave in conformity with the laws of the land and ensure that the people of Anambra State were protected."
  },
  {
    "headline": "Tordue Salem: NHRC urges security agencies to locate missing Vanguard reporter",
    "summarized_story": "The Executive Secretary of the National Human Rights Commission (NHRC), Tony Ojukwu on Tuesday, pleaded with the security agencies to as a matter of urgency, find out the whereabouts of the Vanguard Newspapers journalist, Mr. Tordue Salem.\nMr.Tordue Salem, a journalist reporting for Vanguard Newspapers was declared missing since on October 13, 2021, in Abuja.\nNHRC Secretary in a statement on Tuesday expressed sadness over the news of the National Assembly Correspondent who has been missing for the past 14 days.\nHe said, there was no place for an enforced disappearance in modern history, describing the act as one of the worst human rights violations which leave the victims, family members and the society traumatized.\nHe noted that enforced disappearance is one of the hazards associated with the practice of journalism in Nigeria."
  },
  {
    "headline": "Yobe: Theater Commander visits Gov. Buni",
    "summarized_story": "The Theatre Commander, Operation Hadin Kai, Major General Christopher Musa, said Nigerian Army has constituted two court-martials in Maiduguri and Damaturu for trial of officers and soldiers as part of efforts to enforce and maintain internal discipline within the theatre of operation.\nThe Theatre Commander disclosed this when he paid a courtesy visit on Governor Mai Mala Buni in Damaturu on Tuesday.\nHe then solicited for a sustained partnership with the state government in the renewed fight against insurgency in the state.\nBuni called on people in the state to always appreciate, support and provide useful information to the security agencies to clear remnant of terrorists.\nHe attributed the relative peace being enjoyed in the state to the commitment of the Chief of army staff and other security operatives."
  },
  {
    "headline": "What you must tell your friends at all cost – IK Ogbonna",
    "summarized_story": "What you must tell your friends at all cost – IK OgbonnaActor Ikechukwu Mitchel Ogbonna popularly known as IK Ogbonna has revealed what is expected of a true friend.\nAccording to the model, people should always tell their friends the truth even when it may be at the expense of their friendship.\n- Advertisement -Reiterating his stance, the movie star noted for him, his friends will always be told the truth regardless of their feelings.\nHe wrote: “TELL YOUR FRIENDS THE TRUTH AT ALL COST.\nIf you’re friends with someone, and you can’t tell them the home truth when necessary, then you guys have no business being together.”jeffryprettypretty said: “Truth.”3d_tech_ng wrote: “If I lose friends because of the truth, so be it.”"
  },
  {
    "headline": "No plans to adopt PDP candidate in Anambra, says Labour Party",
    "summarized_story": "The Labour Party in Anambra State has said that it is fully in the race for the Anambra Nov. 6 governorship election with Mr Obiora Agbasimalo as its candidate.\n- Advertisement -He described as ‘fake news’ the story that it was planning to adopt the candidate of the Peoples Democratic Party (PDP), Valentine Ozigbo for the Anambra election.\nOjukwu said the publication on Oct. 22 was the handiwork of detractors wishing to de-market the Labour Party and its candidate because of his growing popularity among the people.\n“Labour Party and its flagbearer Chief Obiora Agbasimelo and the PDP candidate Chief Valentine Ozigbo are vying for the same seat in the same Election.\nLabour Party hereby reserves all its Legal Rights at Law as a duly Registered Political Party in the Federal Republic of Nigeria.”"
  },
  {
    "headline": "Massive defection will hit APC soon- Saraki",
    "summarized_story": "Saraki, who debunked the insinuation that he may defect to the APC, said the reverse was the case as the ruling party will witness a gale of defection this week.\nThe former Senate President noted that the recent defection of some PDP Governors to APC was not surprising, as the party was aware of their moves.\nAlso in this week, there is a former governor that is going to join our party, PDP.\nBut the APC Caretaker Extra-Ordinary Convention Planning Committer (APC) Secretary, Senator John James Akpanudoedehe, said the former Senate President was only playing to the gallery.\nHe maintained that the ruling party has never been so solid, insisting that the defection theory of Saraki was nothing but his imagination."
  },
  {
    "headline": "Anambra 2021: Security operatives will respect rules of engagement- NSA",
    "summarized_story": "The National Security Adviser, Major General Babagana Monguno (rtd) has assured that security personnel deployed for the November 6 Anambra State governorship election will ensure nothing ‘theatrical happens’ during the polls.\nHe said those planning to destabilise the polls should have a rethink because the security agencies will not sit and wait to be harmed.\n- Advertisement -“More importantly they should not be put in a situation whereby they are reluctant to come out and vote,” he said.\nRead Also: We have enough manpower for Anambra election – INEC official- Advertisement -He assured that the security agencies have also been told to exhibit the highest level of professionalism,self-restraint, discipline and adherence to what is written in the statute.\nHe explained that alot of things have happened in the Sout East in recent months which he said is not just peculiar to Nigeria."
  },
  {
    "headline": "IPOB: UN probes Nigeria, Kenya’s roles in Kanu’s rendition",
    "summarized_story": "From Magnus Eze, EnuguThe United Nations has issued ‘Urgent Appeals’ in the case of leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu against Nigeria and Kenya, the separatist activist’s younger brother, Kingsley Kanunta has disclosed.\nKanunta said Tuesday, that he had undertajen a number of urgent steps within the realm of the international community, particularly in Britain and the United Nations in the last three months.\nAccording to Kanunta, these interventions were kept secret because the applicable rules, especially that of the United Nations, required them to be kept confidential for 60 days.\nKanu noted that the UN had also made public an acknowledgment it received on September 17, 2021 from the ‘Permanent Mission of the Federal Republic of Nigeria to the United Nations’.\n“It is important to emphasize that this is just the beginning of more United Nations and other global strong actions that would be seen in the coming weeks."
  },
  {
    "headline": "Terrorists: Ohanaeze, MBF, CAN, NINAS, Kaigama, Mogekwu, Kokori, Okorie hit Gumi over comment",
    "summarized_story": "“If the Governor of Kaduna State, where Gumi lives, is asking the Federal Government to declare bandits as terrorists, who is Gumi to say otherwise?\nHe also called on government to, as a matter of urgency, arrest Sheikh Gumi.\n“What I think Sheikh Gumi and many good Nigerians should do is how do we conquer the situation?\n“So if he wishes to declare bandits as saints, let him continue to do so.\nLet the president declare them saints if that is his advice; advising the president to declare bandits as saints."
  },
  {
    "headline": "Allow Igbo secede, northern leaders tell court",
    "summarized_story": "From Godwin Tsa, AbujaA group of northern elders have commenced legal process for the secession of South East from the Nigerian federation.\nHowever, lawyers from the South East have applied to the court to join them as defendants in a suit.\nThe lawyers are asking for order of the court to allow them join in the suit as representatives of the people of the South East.\nThat the Igbo Lawyers Association represented by the applicants are an indigenous association of lawyers from the South East of Nigeria and other indigenous Igbo speaking tribe in Nigeria.\nThat the Igbo Lawyers Association and its objective is to represent the interest of the Igbo people which said people are indigenous in the South East of Nigeria."
  },
  {
    "headline": "2023: Middle Belt youths meet in Enugu, back S’East presidency",
    "summarized_story": "From Magnus Eze, EnuguYouth leaders from the ethnic nationalities of the Middle Belt have declared support for a president of South East extraction in 2023.\nPresident General and leader of delegation of youth leaders of Middle Belt, to a one-day strategic partnership meeting, Timothy Hembaor, disclosed this to newsmen, at the weekend in Enugu.\nHembaor said the Middle Belt was preparing for the 2023 presidency but decided to drop the ambition and back the South East after considering the magnitude of injustice meted to the Igbo in Nigeria.\n“Let us know we are the same people, let us know we are one Nigeria; let us love one another.\n“The more South East is held down, the more our nation would be in a quagmire situation, unable to make any meaningful progress."
  },
  {
    "headline": "Wike, CJN berate NBA over silence on national crisis, assault on judiciary",
    "summarized_story": "From Tony John, Port HarcourtRivers State Governor Nyesom Wike, and the Chief Justice of Nigeria, Justice Tanko Mohammed, have flayed the Nigerian Bar Association (NBA) for keeping silent on the crisis confronting the nation and assault on judiciary.\n“But, the central question is whether the NBA has been living up to its credo and responsibility?\n“Another challenge being faced by the judiciary is the assault by litigants against the institution of the judiciary when their cases are not met.\nUnfortunately, some members of the Bar also join them in ridiculing our courts in their private discussions and on national dailies.\nI wish, therefore, on behalf of the Senate and, in deed, the National Assembly thank the NBA for organising this conference."
  },
  {
    "headline": "Politicians Still Influencing Judges to Use Court against Democracy",
    "summarized_story": "Whether the appellate court would accede to the demand or not is another, particularly, taking into consideration the recent position of appellate court justices with respect to exparte granted by High Court judges.\nIt is worthy of mention that the appellate court and even the Supreme Court had descended heavily on the High Court judges particularly, in the Anambra governorship suits.\nThe appellate court claimed that the trial court erred by entertaining a suit wherein it lacked jurisdiction.\nBut Okeke challenged the authenticity of the Oye leadership at a Federal High Court in Jigawa State, where judgment was given in his favour.\nBut before Secondus could carry out the order, Justice Edem Kooffreh of a Cross River State High Court on August 28, restrained him from resuming."
  },
  {
    "headline": "Buhari Unveils eNaira as CBN Launches Instrument to Support 300 Companies",
    "summarized_story": "He stressed that Nigeria was the first country in Africa and one of the first in the world to introduce digital currency.\nHe disclosed that the journey to create a digital currency for Nigeria began in 2017.\nCBN decided to implement its own CBDC and to name the digital currency eNaira, with the expectation that the innovation would make significant positive difference to Nigeria and Nigerians, he stated.\nThe eNaira wallet is required to access, use and hold eNaira, which will be exchangeable for other Central Bank Digital Currencies (CBDC).\nThe CBN added that the AML/CFT checks for fraud prevention and detection would apply on the eNaira platform."
  },
  {
    "headline": "NSA: IPOB Must Not Test Our Will to Guarantee Peaceful Poll in Anambra",
    "summarized_story": "“INEC is determined to proceed with the Anambra State Governorship election as scheduled.\n“I am sure the Commissioner Police, Anambra State, in his briefing, will provide more details regarding preparations on the ground.\n“The professionalism and neutrality exhibited by the security agencies in the two elections have been widely praised nationally and internationally.\nWe are confident that this will be replicated in Anambra State,” Yakubu said.\nHe, therefore, commended the security agencies for the support INEC had received from religious, traditional and community leaders for peaceful elections."
  },
  {
    "headline": "Buhari Swears in Two INEC National Commissioners",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has sworn in two National Commissioners of the Independent National Electoral Commission (INEC).\nThe swearing-in took place on Monday at the Conference Hall of the First Lady’s office at the State House, Abuja, before the official launch of the eNaira and 2022 Armed Forces Remembrance Day emblem.\nThe new National Commissioners are Prof. Muhammad Sani Kallah (Katsina State) and Prof. Kunle Cornelius Ajayi (Ekiti State).\nThe duo are part of the six INEC commissioners cleared by the Senate in July this year.\nPresident Buhari had on September 15, 2021, sworn in three of the cleared National Commissioners."
  },
  {
    "headline": "Buhari: Peace Now Returning to Troubled Areas in Nigeria",
    "summarized_story": "Wants Nigerians to celebrate gallantry of nation’s troopsBy Deji ElumoyePresident Muhammadu Buhari has disclosed that peace has started to return to troubled areas which in the past faced terrorism and banditry attacks across the country.\n”The exploits of our Armed Forces to maintain peace as well as their disposition to the unity of Nigeria have contributed in no small measure to our stability.\nOur faith in our Armed Forces remains unshaken and as a government we will do all within our powers to ensure that our Armed Forces are motivated to perform optimally.\n“The same call goes to all visitors and friends of Nigeria as well as corporate bodies operating in Nigeria,” he said.\n”I have the pleasure to acknowledge the contributions of retired officers and men of the Nigerian Armed Forces to the ongoing war on insurgency."
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Electoral Commission Chairman, Yakubu Holding Secret Meetings With Senate President Lawan, Ruling APC Party Leaders Ahead Of Elections",
    "summarized_story": "Chairman of the Independent National Electoral Commission (INEC), Mahmood Yakubu has been holding secret meetings with top leaders of the All Progressives Congress (APC), SaharaReporters has learnt.\nSources explained that the INEC chair, who is supposed to be neutral and non-partisan has been holding frequent meetings with Ahmad Lawan, Senate President and Mai Mala Buni, Caretaker Chairman of the ruling APC and governor of Yobe State.\nIt was gathered that the trio had a meeting last Friday, October 22 at a guest house belonging to the Senate President between 10 pm and 1 am.\nOne of the sources stated: “INEC chairman is frequently having private meetings with the duo of the Senate President and Buni at a private guest house owned by the Senate President in Maitama, Abuja.\nIt was between the Senate President, INEC chairman and Buni."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Electoral Commission Chairman, Yakubu Holding Secret Meetings With Senate President Lawan, Ruling APC Party Leaders Ahead Of Elections",
    "summarized_story": "Chairman of the Independent National Electoral Commission (INEC), Mahmood Yakubu has been holding secret meetings with top leaders of the All Progressives Congress (APC), SaharaReporters has learnt.\nSources explained that the INEC chair, who is supposed to be neutral and non-partisan has been holding frequent meetings with Ahmad Lawan, Senate President and Mai Mala Buni, Caretaker Chairman of the ruling APC and governor of Yobe State.\nIt was gathered that the trio had a meeting last Friday, October 22 at a guest house belonging to the Senate President between 10 pm and 1 am.\nOne of the sources stated: “INEC chairman is frequently having private meetings with the duo of the Senate President and Buni at a private guest house owned by the Senate President in Maitama, Abuja.\nIt was between the Senate President, INEC chairman and Buni."
  },
  {
    "headline": "'We don't want to discuss our decisions publicly' -- south-west governors meet on security",
    "summarized_story": "Governors of the south-west region, on Tuesday, met in Lagos state to discuss issues of interest concerning the region, including security challenges.\nPresent at the meeting were Dapo Abiodun, Rotimi Akeredolu, Babajide Sanwo-Olu, Kayode Fayemi, and Gboyega Oyetola, governors of Ogun, Ondo, Lagos, Ekiti, and Osun, respectively.\nAddressing journalists after the meeting, Rotimi Akeredolu, chairman of the south-west governors forum, said part of their deliberations was on the security situation in the region.\n“We, the six governors of the south-west under the south-west governors’ forum, met today and deliberated on a number of issues that we have in common,” he said.\nA number of them that have to do with security is not what we want to discuss in the open."
  },
  {
    "headline": "'We don't want to discuss our decisions publicly' -- south-west governors meet on security",
    "summarized_story": "Governors of the south-west region, on Tuesday, met in Lagos state to discuss issues of interest concerning the region, including security challenges.\nPresent at the meeting were Dapo Abiodun, Rotimi Akeredolu, Babajide Sanwo-Olu, Kayode Fayemi, and Gboyega Oyetola, governors of Ogun, Ondo, Lagos, Ekiti, and Osun, respectively.\nAddressing journalists after the meeting, Rotimi Akeredolu, chairman of the south-west governors forum, said part of their deliberations was on the security situation in the region.\n“We, the six governors of the south-west under the south-west governors’ forum, met today and deliberated on a number of issues that we have in common,” he said.\nA number of them that have to do with security is not what we want to discuss in the open."
  },
  {
    "headline": "Paris Club refund: We'll not accept arbitrary deductions from FG, says Fayemi",
    "summarized_story": "Kayode Fayemi, governor of Ekiti, says state governments will not accept arbitrary deductions of funds from the federation account.\nHe said state governments are currently dealing with the issue and will find a solution soon.\nThey do not accept that funds belonging to the federation account are deducted arbitrarily without their input,” Fayemi said.\nAdvertisementConsultants had claimed the amount as a percentage for the payment of services rendered to the states and local government councils.\nBut the amount did not go down well with the governors who requested a forensic audit over the claim made by consultants."
  },
  {
    "headline": "Paris Club refund: We'll not accept arbitrary deductions from FG, says Fayemi",
    "summarized_story": "Kayode Fayemi, governor of Ekiti, says state governments will not accept arbitrary deductions of funds from the federation account.\nHe said state governments are currently dealing with the issue and will find a solution soon.\nThey do not accept that funds belonging to the federation account are deducted arbitrarily without their input,” Fayemi said.\nAdvertisementConsultants had claimed the amount as a percentage for the payment of services rendered to the states and local government councils.\nBut the amount did not go down well with the governors who requested a forensic audit over the claim made by consultants."
  },
  {
    "headline": "'Rights violation': UN writes Nigeria, seeks detailed information on Nnamdi Kanu",
    "summarized_story": "The United Nations has asked the federal government to provide detailed information on the circumstances surrounding Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB).\nIn the document dated August 27, the UN said it received information of various allegations of human rights violation against Kanu by the federal government.\nAdvertisement“We are further alarmed by the alleged torture and ill-treatment Mr Kanu has been subjected to during his detention by the DSS in Nigeria.\n“Please provide detailed information on the circumstances in which Mr Kanu was arrested, forcibly disappeared before being handed over to Nigerian authorities and transferred from Nairobi to Abuja.\n“Please provide information on whether an investigation was carried out into the alleged enforced disappearance of Mr. Kanu during this period of time, and whether those responsible have been held accountable,” the letter reads."
  },
  {
    "headline": "Africa eShop, DHL’s online retail service, is shutting down this month",
    "summarized_story": "After two years of operation, DHL Africa is shutting down its pan-African online retail platform, e-Shop, at the end of the month.\nSorry for any inconvenience this may have caused,” a message on the Africa eShop website reads.\nTechCabal reached out to DHL Africa for answers but has yet to receive a response at the time of publication.\n— DHL Africa (@DHLAfrica) October 21, 2021A white-labeled productWhile the Africa eShop appears to be a standalone e-commerce platform owned by DHL, that isn’t the case.\nBeing a white-labeled product, DHL’s Africa eShop website and offerings are very similar to that of MallforAfrica."
  },
  {
    "headline": "How Koa is helping Kenyans build and manage wealth",
    "summarized_story": "After doing that for a while, she joined MEST Africa.\nAfter leaving MEST Africa, the duo forayed into different businesses but kept in touch and would always meet up whenever they were in the same city.\nSo, Koa is killing two birds with one stone by holding its users’ money in a money market through a partnership with Britam, an asset manager in the Kenyan market.\nOn Koa, users earn up to 10% interest on their money annually, depending on market conditions.\nSo are Koa users aware that their money is being invested in a money market?"
  },
  {
    "headline": "Here’s everything you need to know about Apple’s new releases",
    "summarized_story": "In a beautiful transition between Tim Cook and Zain Lowe, Apple also revealed the Music Voice Plan, a new subscription category for Apple Music that allows users to seamlessly use Siri with Apple Music.\nThe fall event started off with the introduction of Apple Music Voice Plan, a new subscription offering that allows users to seamlessly enjoy Siri with Apple Music.\nApple Music plansNew colours for Apple HomePod Mini Smart SpeakerAesthetics—that’s the simplest way to describe this update.\nM1 Pro And M1 Max ChipsEarlier in this article, we called these updates the two biggest surprises of the night.\nThe basic models come as standard with the M1 Pro, 16GB of Unified Memory and a 512GB SSD."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "2023: Implications of PDP’s internal crisis ahead national convention",
    "summarized_story": "Some chieftains and stakeholders of the People’s Democratic Party (PDP) have expressed concern that the internal wrangling besetting the party is capable of working against its determination to take back power from the All Progressives Congress (APC) in 2023.\nThey also warn against the party going to the National Convention a divided house.\nThe outcome of the ruling, observers say, could make or mar the party’s planned national convention.\nOlafeso, who was aspiring to become the PDP national publicity secretary, expresses concern over the future of the party.\nKola Ologbondiyan, PDP national publicity secretary, had said that nothing would stop the convention from holding."
  },
  {
    "headline": "Contributory Pension Scheme: Retirees now access monthly pay with ease",
    "summarized_story": "Retirees under the Contributory Pension Scheme (CPS) have confirmed receiving their monthly pensions regularly and promptly, outliving the biggest challenge that confronted the old pension scheme.\nThe retirement funds in retirement are the Programme Withdrawal managed by PFAs and retiree life annuity managed by life insurance companies, respectively.\nJoe Oda, who retired in 2015 as a director in an educational training institute in one of the financial services sub-sectors, is happy with the regularity of his monthly pension.\nShe is also happy with the regularity of her monthly pensions since she began receiving it late 2020.\nShe however calls on the government to remember retiree annuitants when it starts to implement the planned Minimum Pension Guarantee as provided for in the Pension Reform Act 2014."
  },
  {
    "headline": "8 questions about e-Naira you are too embarrassed to ask",
    "summarized_story": "8 questions about e-Naira you are too embarrassed to askAfter weeks of anticipation and postponement, Nigeria’s President Muhammadu Buhari finally launched the Central Bank Digital Currency (CBDC).\nThe eNaira has many people asking questions and we hear there is some unease in the banking industry on whether the digital currency would affect their operations and profit margins.\nHere are answers to eight questions you may be too embarrassed to ask.\nthe eNaira is merely a digital version of the naira currency.\nThe notion of freedom that cryptocurrencies introduced – not under the control of central banks and banks – has become appealing to many hence the growing adoption around the world."
  },
  {
    "headline": "FG to present policy on casualisation of employment in Nigeria – Minister – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Minister of Employment, Labour and Productivity, Sen. Chris Ngige, on Tuesday in Abuja, disclosed that the Federal Executive Council would soon present a policy directive on the casualisation of employment in the country.\nNgige made the disclosure at a one-day public hearing on Prohibition of Casualisation of Employment Establishment Bill, 2021.\nThe public hearing was organised by the Senate Committee on Employment, Labour and Productivity.\nThe minister also described the casualisation of employment in Nigeria as worrisome, while accusing the banking, oil and gas, communication sectors as major perpetrators of casualisation of workers in the country.\nNgige also said that most of the companies that were involved in casualisation of workers were doing so at a high risk."
  },
  {
    "headline": "IGP deploys strategic commanders for Anambra governorship election – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Inspector-General of Police (IGP), Mr Usman Baba, has ordered the deployment of selected strategic commanders to Anambra, ahead of the Nov. 6 governorship election in the state.\nHe said the strategic commanders affected by the deployment were from the rank of Assistant Commissioner of Police and above.\nMba said that the deployment was to ensure effective supervision of security personnel and operations during the election.\nAccording to him, Egbunike is saddled with the responsibility of overseeing the implementation of the ‘Operation Order’ which evolved from the election security threat assessment.\n“Other strategic commanders deployed in Anambra include five Assistant Inspectors-General of Police (AIGs), 14 Commissioners of Police (CPs), 31 Deputy Commissioners of Police (DCPs) and 48 Assistant Commissioners of Police (ACPs)."
  },
  {
    "headline": "ASUP faults establishment of new polytechnics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Academic Staff Union of Polytechnics (ASUP), has urged the Federal Government to stop the establishment of new Polytechnics in the country.\nASUP President, Mr Anderson Ezeibe, made the call at a two-day workshop tagged: “Advocacy Roundtable on the Future of Nigerian Polytechnics”, organised by the union on Tuesday in Abuja.\n“We do not agree with the continued establishment of new Polytechnics on the largely unsubstantiated premise of providing greater access to tertiary education as the existing ones remain unattractive to young Nigerians.\nHe further said that polytechnics are nowhere close to preferred destinations for Nigerian students seeking tertiary education as the sector suffers from, ”deep seated discrimination in different facets mainly driven by anachronistic tendencies”.\nSen. Ibrahim Shekarau, Chairman of the occasion, said that the persisting problem that bedeviled the education sector and the incessant industrial action was the failure of government to do the right thing."
  },
  {
    "headline": "Edo commissioner charges residents on tax payment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo state commissioner of communication and orientation, Bar.\nEwanta Andrew, has charged residents to support the governor Obaseki-led administration by paying tax to the state government.\nEwanta gave the charge yesterday in Benin when his family member paid him a solidarity visit on his appointment as commissioner.\nHe said the payment of tax by the citizenry enables the government to fulfil its responsibility to the citizens through infrastructural development among others.\nEarlier, the leader of the family Roland Ewanta, said the visit was to assure the commissioner of their support in the discharge of his duty."
  },
  {
    "headline": "NAFDAC shuts 27 water factories over non-compliance with regulations",
    "summarized_story": "The National Agency for Food and Drug Administration and Control (NAFDAC) has shut 27 water companies over non-compliance with rules and regulations on quality assurance.\nThe Director-General of NAFDAC, Mojisola Adeyeye, said the action was part of the agency’s efforts towards sustaining good hygiene in the packaged water industry.\nMrs Adeyeye said this at the National Convention of the Association for Table Water Producers of Nigeria (ATWAP) in Abuja on Tuesday.\nThe event is themed; “Developing a packaged water industry as a catalyst to economic growth and a greener economy in Nigeria.”Water industryMrs Adeyeye said the package water industry is a multi-billion naira business that the agency is taking seriously.\nShe also said NAFDAC has registered 2,153 new water factories in the country between January and august, 2021."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Senate condemns Health Ministry’s plans to borrow N82bn for mosquito nets",
    "summarized_story": "Senate condemns Health Ministry’s plans to Borrow N82bn for mosquito netsThe Nigerian Senate has kicked against move by the Federal Ministry of Health to borrow $200 million (about N82bn at the official exchange rate of N410/$) under the malaria programme to buy mosquito nets in the 2022 budget.\nSenator Gershom Bassey, a member of the Senate Committee on Health, on Tuesday opposed the move by the Ministry during the 2022 budget defence of the Federal Ministry of Health.\nBassey told the Permanent Secretary, Mahmuda Mamman that the proposal with respect to borrowing $200 million to purchase mosquito nets was outrageous considering the amount involved.\nThe Committee’s condemnation was in response to the Permanent Secretary’s earlier submission of the intention to borrow the said amount for the purchase of mosquito nets.\nMeanwhile, the Executive Director, National Primary Health Care Development Agency, NPHCDA, Faisal Shuaib had said the $200 million was for importation and local production of mosquito nets."
  },
  {
    "headline": "Osun APC caucus, Igbimo Agba inducts Omisore, Ajibola, others",
    "summarized_story": "By Sunday Oguntuyi OsogboThe Osun All Progressives Congress (APC) caucus, ‘Igbimo Agba’ on Tuesday inducted new members to its fold to, according to it, further see to the uprightness and stability of the party in the state.\nThe new members inducted at ameeting held at the residence of Chief Bisi Akande in Ila Orangun include, Senator Iyiola Omisore, Senator Ajibola Bashiru and Ambassador Yemi Farounbi .\nAkande noted that APC in the state is one, and will remain one big family, adding that whatever may be the grievances of some members would be critically looked into and resolved amicably.\nIn his address, Chairman, Igbimo Agba APC Osun, Engineer Sola Akinwumi expressed gratitude to Governor Adegboyega Oyetola for his assistance to the platform at all timesEngineer Akinwumi disclosed that the core objective of the Igbimo Agba Osun is to act as a buffer for the party and also to serve as a support for the government at all levels.\nHe stressed further that the body is also saddled with the responsibility of providing a platform for solving problems."
  },
  {
    "headline": "Chinese envoy says country’s banks to operate in Nigeria soon",
    "summarized_story": "Mr. Cui Jianchun, Chinese ambassador to Nigeria, has said his country’s banks will soon begin operations in Nigeria.\nHe also said that Nigerian banks should also be expected to be given the same reception in China, noting that this is one of the major requirements to make the Currency Swap agreement between Nigeria and China work, ThisDay reported.\nThe Chinese envoy, who said he was working hard to ensure Nigerian banks commence operations in China, revealed that he was taking the necessary steps that would lead to the setting up of Chinese financial institutions in Nigeria.\nThe envoy said: “The agreement is being implemented by the two central banks; the framework would be expanded.\nI believe it is already working and I am working to have Chinese banks here in Nigeria and also for Nigerian banks to operate in China.”Jianchun, who said the Chinese government was desirous of having closer collaboration between the Chinese lawmakers and their Nigerian counterparts, said the eighth Ministerial Conference of the Forum on China-Africa Cooperation will be held in Senegal in late November."
  },
  {
    "headline": "World Bank says Nigeria’s per capita income has not improved in 40 years",
    "summarized_story": "The World Bank has said per capita income (PCI) in Nigeria, has remained at the same level as it was 40 years ago.\nAccording to Chaudhurie, the country needs to make strategic decisions to set it on the path to realising its potential.\nHe noted that in 1981, Nigeria’s PCI was $2,180.2 and $2,097 in 2020.\n“Nigeria today has real per capita income that was the same as 40 years — in 1981.\n“But our sense is that Nigeria is at a point in time where some critical decisions need to be made."
  },
  {
    "headline": "Find Abuja Missing Journalist Now, NHRC Tells Police, Others",
    "summarized_story": "Ojukwu expressed sadness over the news of the National Assembly Correspondent who has been missing for the past 14 days.\nThe human rights boss described Mr. Salem as a journalist who has passion for his work.\n“He has painstakingly reported human rights issues as well as educated the masses on their rights since his days with the leadership newspaper” Ojukwu added.\nWhile calling on the authorities to respect the rights of journalists, Ojukwu urged the journalists to always work within the ambit of the law and ethics of the profession.\nHe assured the family members of the Commission’s support to ensure that Tordue Salem is found and reunited with them."
  },
  {
    "headline": "Find Abuja Missing Journalist Now, NHRC Tells Police, Others",
    "summarized_story": "Ojukwu expressed sadness over the news of the National Assembly Correspondent who has been missing for the past 14 days.\nThe human rights boss described Mr. Salem as a journalist who has passion for his work.\n“He has painstakingly reported human rights issues as well as educated the masses on their rights since his days with the leadership newspaper” Ojukwu added.\nWhile calling on the authorities to respect the rights of journalists, Ojukwu urged the journalists to always work within the ambit of the law and ethics of the profession.\nHe assured the family members of the Commission’s support to ensure that Tordue Salem is found and reunited with them."
  },
  {
    "headline": "Police Arrest 4 Students Over Attack On Teachers In Ogun",
    "summarized_story": "“What happened was that the students imported hoodlums into the school premises to beat their teachers who punished them for making noises”.\nThe two teachers were in another classes teaching, while students in other class were shouting, making noises and distrusting the environment.\nThe teachers however, published the entire class which allegedly infuriated some of them and so, they decided to also punished the teachers”.\nThe PPRO however, assured that appropriate punishment will be meted out on the affected students as soon as investigation was concluded.\nADVERTISEMENTArmed with machetes and axes among other dangerous weapons, the hoodlums stormed the school premises and descended on the teachers where they inflicted varying degrees of injury on them."
  },
  {
    "headline": "Police Arrest 4 Students Over Attack On Teachers In Ogun",
    "summarized_story": "“What happened was that the students imported hoodlums into the school premises to beat their teachers who punished them for making noises”.\nThe two teachers were in another classes teaching, while students in other class were shouting, making noises and distrusting the environment.\nThe teachers however, published the entire class which allegedly infuriated some of them and so, they decided to also punished the teachers”.\nThe PPRO however, assured that appropriate punishment will be meted out on the affected students as soon as investigation was concluded.\nADVERTISEMENTArmed with machetes and axes among other dangerous weapons, the hoodlums stormed the school premises and descended on the teachers where they inflicted varying degrees of injury on them."
  },
  {
    "headline": "Suspect Withdrew N500,000 After Stealing Victim’s Phone In Kwara",
    "summarized_story": "The 37-year-old Purple, who specialised in withdrawing money from people’s bank accounts after stealing their phones, was arrested by NSCDC’s operatives at their hideout along Offa Road, G.R.A, Ilorin.\nPurple was arrested alongside his accomplices, Alfred Adegoke, 34, and Yusuf Saman, 30.\nThe spokesman of NSCDC in Kwara State, Babawale Afolabi, confirmed the arrest of the suspects.\nHe added that the suspect claimed to have withdrawn N400,000 only from the two bank accounts of the complainant and not N500,000 asclaimed by the owner of the phone.\nAfolabi stated that the State Commandant of NSCDC, Mr Iskilu Ayinla Makinde, has ordered full scale investigations into the matter."
  },
  {
    "headline": "Alleged treachery: Oba of Benin bans palace’s head of servants",
    "summarized_story": "The Oba of Benin, Omo N’Oba N’Edo Uku Akpolokpolo, Oba Ewuare II, has banned the palace’s former Omuada (head of servants), Roland Ogbebor, for posing as his second in command.\nOgbebor also allegedly got involved in other abominable and sacrilegious acts not allowed in Benin Kingdom.\nThe Secretary, Benin Traditional Council (BTC), Frank Irabor, who was accompanied by prominent Benin chiefs, disclosed these in Benin at a briefing, where he announced the formal banning of Ogbebor.\nIrabor stated that the ban on the former Omuada was extended to his participation at all Oba palace’s traditional establishments and functions, including spiritual groups, activities, festivals, shrines and Oguedion in Benin kingdom.\n“The former Omuada also behaved in treacherous ways to the throne of the Oba of Benin that are akin to being a traitor."
  },
  {
    "headline": "Alleged treachery: Oba of Benin bans palace’s head of servants",
    "summarized_story": "The Oba of Benin, Omo N’Oba N’Edo Uku Akpolokpolo, Oba Ewuare II, has banned the palace’s former Omuada (head of servants), Roland Ogbebor, for posing as his second in command.\nOgbebor also allegedly got involved in other abominable and sacrilegious acts not allowed in Benin Kingdom.\nThe Secretary, Benin Traditional Council (BTC), Frank Irabor, who was accompanied by prominent Benin chiefs, disclosed these in Benin at a briefing, where he announced the formal banning of Ogbebor.\nIrabor stated that the ban on the former Omuada was extended to his participation at all Oba palace’s traditional establishments and functions, including spiritual groups, activities, festivals, shrines and Oguedion in Benin kingdom.\n“The former Omuada also behaved in treacherous ways to the throne of the Oba of Benin that are akin to being a traitor."
  },
  {
    "headline": "BBNaija star, Yousef, loses elder brother",
    "summarized_story": "Former Big Brother Naija Shine Ya Eye housemate, Yousef Garba, has announced the demise of his eldest brother.\nThe reality TV star took to his Instagram page on Tuesday to share the sad news, stating that prayers and condolences would be immensely appreciated.\nHe said, “Hello everyone, I just lost my eldest brother and I’m going to be off for a bit.\nThank you.”Yousef was one of the contestants in the recently concluded Big Brother Shine Ya Eye season where Whitemoney emerged as the winner.\nIn an interview with The PUNCH, Yousef had stated that he came into the show to represent the North."
  },
  {
    "headline": "BBNaija star, Yousef, loses elder brother",
    "summarized_story": "Former Big Brother Naija Shine Ya Eye housemate, Yousef Garba, has announced the demise of his eldest brother.\nThe reality TV star took to his Instagram page on Tuesday to share the sad news, stating that prayers and condolences would be immensely appreciated.\nHe said, “Hello everyone, I just lost my eldest brother and I’m going to be off for a bit.\nThank you.”Yousef was one of the contestants in the recently concluded Big Brother Shine Ya Eye season where Whitemoney emerged as the winner.\nIn an interview with The PUNCH, Yousef had stated that he came into the show to represent the North."
  },
  {
    "headline": "Southwest governors meet Tinubu at Bourdillon",
    "summarized_story": "Southwest governors on Tuesday night met with the National leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu in Lagos.\nThe meeting with Tinubu was held at his Bourdillon residence in Ikoyi.\nThe Southwest governors decided to visit Tinubu after their meeting at the Lagos House, Marina.\nEkiti State Governor, Dr. Kayode Fayemi excused himself after the meeting of the governors at the State House, Marina and did not go with others to Bourdillon.\nThe Ondo Governor had recently said they were waiting for Tinubu, who is their Cappo to come back from London before they could take decision on the 2023 presidency."
  },
  {
    "headline": "Villagers burn three suspected bandits’ informants to death in Kaduna",
    "summarized_story": "By Mohammed TijjaniKaduna State Governor, Nasiru El-Rufai has directed security agencies to investigate the lynching of three suspected bandits’ informants in Zangon Aya village, Igabi Local Government Area of the state.\nThe Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan, made the disclosure in a statement issued to newsmen on Tuesday in Kaduna.\nHe said that the directive followed report by security agencies that a man, his wife and son were lynched through mob action in the village on Monday.\n“The mob action was in response to the suspects’ alleged collaboration with bandits, especially in relation to recent kidnappings in the area.\nThe governor urged citizens to maintain law and order and always report suspects to constituted authorities."
  },
  {
    "headline": "BREAKING: 5 Governors Storm Tinubu’s House [PHOTOS]",
    "summarized_story": "The 5 governors include Governor Babajide Sanwo-Olu, Rotimi Akeredolu of Ondo state, Dapo Abiodun of Ogun state as well as Oyetola of Osun state.\nThe Oyo state Governor was represented by his deputy while the Governor Kayode Fayemi of Ekiti was absent.\nRecall that Mr. Tinubu has been away from Nigeria for 3 months and returned quietly recently.\nOtunba Gbenga Daniel, a former Ogun state governor as well as Ayo Fayose, an ex-Governor of Ekiti state were the first set of VIPs to visit the former Lagos state governor when he arrived in Nigeria.\nMallam Mai Mala Buni, the chairman of the APC caretaker committee equally visited Asiwaju at his Ikoyi home."
  },
  {
    "headline": "South African Firm, Multichoice Loses Appeal, Ordered To Pay N194Billion Tax To Nigeria",
    "summarized_story": "According to the Daily Post, the Tax Appeal Tribunal dismissed the company’s appeal for lack of diligence and ordered it to pay the $342 million tax assessment handed over to them by the FIRS.\nWhile delivering its judgment on the company’s appeal, the tribunal upheld the FIRS’ preliminary objection to Multichoice Africa Holdings B.V.’s appeal.\nThe Tribunal upheld the South African company’s failure to comply with Order 3 Rule 6 of the Tax Appeal Tribunal (Procedure) Rules, 2021, which requires an appellant to deposit half of the assessed sum in dispute before being heard on appeal.\nThe sum is to be paid as a security for the hearing of any tax appeal, according to the Tribunal.\nMultichoice Africa Holdings, the parent company of Multichoice Nigeria, is believed to have avoided paying VAT from its establishment, despite delivering services to its Nigerian arm."
  },
  {
    "headline": "Will Not Enact Law For Financial Independence For Judiciary – Wike",
    "summarized_story": "Nyesom Wike, the governor of Rivers State, has declared that the state government will not pass any legislation giving the state judiciary financial autonomy.\nAccording to the administration, the Nigerian judiciary already has independence under the 1999 constitution.\nNobody can say send this bill to the legislature for judiciary autonomy.\nThe constitution has already guaranteed that the judiciary must be independent and we have agreed on that.\nGovernor Wike, therefore, advised the Federal Government to stop “playing to the gallery” with the issue of financial autonomy for the judiciary."
  },
  {
    "headline": "BREAKING: Police Detonate Bomb Found At Oyo Prison",
    "summarized_story": "The police in Oyo State on Tuesday detonated a bomb discovered at the Medium Security Custodial Centre, Oyo.\nOfficers of the custodial centre were said to have discovered the bomb and they invited the Bomb Disposal Unit of the police whose officers came to carry out the detonation of the material.\nThe Public Relations Officer of the Nigerian Correctional Service, Oyo State Command, Lanre Anjorin, confirmed the detonation of the bomb.\nThe PRO said, “It is true that a bomb was detonated at the custodial centre in Oyo today ( Tuesday).\nBut the bomb disposal unit of the police was responsible for the detonation of the material."
  },
  {
    "headline": "Buhari at Saudi investment summit: Underinvestment in humane projects cause of global insecurity",
    "summarized_story": "By so doing, it will go a long way in reenergizing the global economy in a post COVID-19 era.\n“The humane approach to investment,” he said, “is the only way to address the global challenges we face, especially in the Covid-19 era.\n“We have the Nigeria Sovereign Investment Authority and more recently, I approved the creation of Infrastructure Corporation of Nigeria.\nNigeria and many countries in Africa are already facing the challenges posed by climate change.\nClimate change has triggered conflicts, food insecurity, irregular youth migration, raising level of sea waters, drought and desertification, as well as the drying-up of the Lake Chad."
  },
  {
    "headline": "NPower batch C employment: How to check non-graduate Npower batch C training posting",
    "summarized_story": "Npower has begun training posting of the non-graduate Tech-Software beneficiaries of the Programme following the deployment of the graduate component beneficiaries.\nSuccessfully selected applicants for the non-graduate, tech category can now check the self-service portal to see their posting.\nFollow the steps below to check your training posting status:Go to https://www.nasims.gov.ng Click on the deployment page to see your training posting status.\nHowever, if you are not yet posted, try to check back again as the posting process is ongoing.\nNote that the Npower non-graduate programme remuneration is N10,00 per month."
  },
  {
    "headline": "Sheikh Gumi to Yoruba, Igbo clerics: Talk to IPOB, Igboho as I talk to bandits",
    "summarized_story": "But when terrorists bandits are affected, he speaks.\nHow long shall a government that is after Igboho and Kanu continue tolerating the PR work Gumi is doing for terrorists bandits?\nWe have always preached the multi-level policing in Ondo state.\nThings are changing and have really changed in Ondo state.\nSpeaking on the recent ban on open grazing, Governor Akeredolu said the culture of nomadic pastoralist must be discouraged in the interest of those involved."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "FG praised for award of road projects -NigPilot",
    "summarized_story": "Honorable members representing Biu/Bayo/Kwaya Kvsar/Shani Federal Constituency of Borno State, Hon.\nAhmed Jaha Babawo also in Borno State have expressed appreciation to the Federal Ministry of Works and Housing on the award of contract for the re-construction of Gombe-Biu road, and urged the Ministry to ensure the contractor expedite action to complete the road.\nThis was made known to Journalists in a press release by the Director, Press and Public Relations, Boade Akinola, Tuesday in Abuja.\nBabaginda informed the law makers that the major challenge in road infrastructure development was funding as the budgetary allocation was grossly inadequate to address the needs in the road sector.\nFurthermore, Hussaini averred that the Ministry was engaging with the contractors since the rains have abated in most parts of the country."
  },
  {
    "headline": "NAFDAC shuts down 27 water companies; partners ATWAP on safe water delivery -NigPilot",
    "summarized_story": "The National Agency for Food Drug and Administration NAFDAC has informed that 27 water companies has been shut down between January and August 2021 due to their non-compliance with the safety guidelines.\nDirector General of the agency, Prof Mojisola Adeyeye ably represented by the Director of public information and public affairs,Dr.\nJimoh Abubakar made this known yesterday at the National conference of the Association for Table Water Producers (ATWAP) in Abuja, with the theme”Developing a packaged water industry as a catalyst to economic growth and a greener environment in Nigeria”.\nHe said that NAFDAC was partnering with ATWAP as one of her regulatory agency to ensure that producers of table water and pure water adhere strictly to the safety measures of maintaining a healthy and production for all hence water is a consumable that no human can live without.\nShe further commended NAFDAC under the leadership of Prof Mojisola Adeyeye in her efforts to not to leave any stone unturn in making sure that Nigerians are given wholesome water."
  },
  {
    "headline": "Brazilian Govt, Embraer Lauds Air Peace At 7 -NigPilot",
    "summarized_story": "Brazilian Government, represented by the Head of Mission, Embassy of Brazil in Nigeria, Ambassador Ricardo Guerra de Araujo, and the country’s aerospace conglomerate, Embraer, have both celebrated indigenous carrier, Air Peace, as it marked its 7th Anniversary on October 24.\nSpeaking at the 2021 Brazil-Nigeria Aviation and Defence Trade Forum organised by the Embassy on Monday in Abuja, Ambassador Guerra de Araujo commended the visionary leadership of Air Peace Chairman, Allen Onyema, and the entire Management Team for their tremendous efforts in taking the airline to great heights it has attained within a period of seven years.\n“Air Peace has made remarkable achievements, investing in brand new airplanes and should be proud of itself for becoming a leader in Nigeria’s aviation,” a statement issued by the Airline’s Spokesman, Stanley Olisa quoted the diplomat as saying.\nGeneral Manager, MEA, for Embraer, Hussein Dabbas, who felicitated with the airline for its consistent show of strength and vibrancy since commencing commercial operations in 2014, stressed that Embraer will continue to partner with Air Peace in its drive to interconnect Africa and beyond through the provision of peaceful connectivity with brand new airplanes.\nAir Peace currently services 19 domestic routes, six regional routes, and two international destinations, while it boasts of a varied fleet of 30 aircraft, the latest being four brand new 124-seat capacity Embraer 195-E2s."
  },
  {
    "headline": "Farouq Bags award from Yusuf Sule Malta a University -NigPilot",
    "summarized_story": "The award was presented to her yesterday by the Faculty of Humanities at their 2nd International Conference themed “Nigeria in the 21st Century: Culture, State and Society.\nIn a statement signed by Nneka lkem Anibeze Special Advisal on media to the minister yesterday in Abuja said.\nIn her response, the Minister Umar Farouq thanked the Governing Council of the university for finding her worthy of an award.\nThe Minister expressed gratitude adding that the award will nudge her to further serve humanity through the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development.\n“It must be noted that all interventions, policies and frameworks being fashioned by the Ministry of Humanitarian Affairs, Disaster Management and Social Development have been created to support and improve the lives of Nigerians."
  },
  {
    "headline": "Politicians Fuelling Crisis In Plateau, Says Governor Lalong",
    "summarized_story": "The Chairman of the Northern Governors Forum and Plateau State Governor, Simon Lalong, has accused politicians of fuelling crisis in his state.\nHe noted that Plateau has long been known as a state of peace and tourism before some political actors started creating problems in the state.\nHe lamented that as part of some measures in tackling religious and ethnic violence, some state governors would use resources at their disposal to acquire some technological equipment, which may end up not being used.\nAccording to him, a situation where the Federal Government makes arbitrary deductions without the input of state governors is wrong.\nHe said state governors have agreed not to collect any allocation from the Federation Allocation Account (FAAC) until the issues are resolved."
  },
  {
    "headline": "Appeal Court Strikes Out Suit Challenging Secondus’ Suspension From PDP",
    "summarized_story": "The Court of Appeal sitting in Port Harcourt has dismissed an application challenging the suspension of Mr Uche Secondus from the Peoples Democratic Party (PDP).\nThe PDP had filed the application at the appellate court to test the validity of Secondus’ suspension from the main opposition party.\nFollowing the suspension of Secondus, Mr Yomi Akinwonmi has been serving as the PDP National Chairman in an acting capacity.\nListed as plaintiffs in the suit were Mr Eddy Olafeso, Mr Rashidi Sunmonu, Mr Daisi Akintan, Mr Bunmi Jenyo, and Mr Wahab Owokoniran.\nThose listed as defendants were the PDP, Secondus, Yomi Akinwonmi (PDP Deputy National Chairman, South), Senator Suleiman Nazif (PDP Deputy National Chairman, North), Senator Ibrahim Tsauri (National Secretary, PDP), Independent National Electoral Commission (INEC), and the Attorney-General of the Federation (AGF)."
  },
  {
    "headline": "FG Cannot Start Paris Club Deduction Now, Says Fayemi",
    "summarized_story": "﻿Chairman of the Nigerian Governors Forum and Governor of Ekiti State, Kayode Fayemi, says the Federal Government cannot commence its plans to make deductions from the federation account for payment of consultants for the Paris Club Refund.\nThe Federal Government plans to begin deduction from the federation account for payment of $418 million private consultants who took part in the Paris Club Refund.\nRead Also: Appeal Court Strikes Out Suit Challenging Secondus’ Suspension From PDPFor this reason, the chairman of the Nigerian Governors’ Forum says the state governors are not in support of the decision.\nAccording to him, a situation where the Federal Government makes arbitrary deductions without the input of state governors is wrong.\nHe says state governors have agreed not to collect any allocation from the Federation Allocation Account (FAAC) until the issues are resolved."
  },
  {
    "headline": "Our Government Took Painful Decisions To Invest For Prosperous Future – Buhari",
    "summarized_story": "President Muhammadu Buhari has explained how his administration took painful decisions to invest for a prosperous future of all Nigerians.\nBuhari attributed the growing social unrest to inequalities and unfair policies that exclude majority from opportunities for participation, admonishing world leaders and global investors to prioritize on inclusive and humane policies.\nPresident Buhari told the gathering of world leaders, global investors and asset managers that the oil sector was already undergoing a reform that would make it more attractive and inclusive.\n“We have the Nigeria Sovereign Investment Authority and more recently, I approved the creation of Infrastructure Corporation of Nigeria.\nThe Nigerian leader urged more interest in infrastructure such as healthcare and education, which “present enormous opportunities for investors in a country our size.”"
  },
  {
    "headline": "2023: Nigeria Needs Credible Leader Irrespective Of Tribe, Religion – Governor Fintiri",
    "summarized_story": "﻿Adamawa State Governor, Ahmadu Fintiri has said that Nigeria needs a credible leader irrespective of tribe and religion to pilot the affairs of the country.\nFintiri, who is also the Chairman of the PDP National Convention Organising Committee, stated this on Tuesday during an interview on Channels Television’s Politics Today.\nWhile noting that Nigerian youths need a leader who will build a future for them, the governor said his party is committed to the cause.\nAnywhere that person comes from, irrespective of his religion or tribe,” he said.\nHe simply said the former vice president has all the qualities to vie for the highest office in the country."
  },
  {
    "headline": "Phyno announces fourth Solo Studio Album",
    "summarized_story": "Nigerian rapper, Phyno has announced his fourth solo studio album, Something To Life For.\nHe made the announcement via his Instagram page @phynofino.\nThe album will be released on November 12.\nAs of this moment, no one can confirm the number of tracks or the producers on the album, which will be a follow-up to 2019 effort, ‘Deal With It.’In Phyno’s esteemed career, he has produced the classic album, No Guts, No Glory, the commercially successful The Playmaker and the critically acclaimed, Deal With It.\nHe also released the collaboration album, 2 Kings, with his brother and friend, Olamide."
  },
  {
    "headline": "Banky W, wife to remake their first dance in new music video",
    "summarized_story": "Nigerian singer, executive and politician, Banky W took to his Instagram page to announce a new single titled, ‘Jo.’‘Jo’ is a Yoruba word for ‘Dance.’In his caption, he wrote that, “The first time my Wife danced for me, I knew I’d hit the jackpot.\nSo we made a song and video about it.“Jo” drops on November 11th.\nAre you ready?\nPre-save link in bio.”Banky’s wife is popular actor, Adesua Etomi.\nThis is the second time that Wellington and his wife, Etomi will appear together in a music video this year."
  },
  {
    "headline": "1000 litres of AGO meant for bandits intercepted in Zamfara",
    "summarized_story": "The 207 Quick Response Group of the Nigerian Airforce in Gusau, Zamfara State has intercepted one thousand Litres of AGO known as Diesel meant for delivery to a location suspected to be bandits hideout.\nThe driver of the vehicle and two other Suspects were also arrested.\nThe Suspects were arrested along Gusau Kaura Namoda road while on their way to deliver the bandits EnclaveA press statement signed by the Chairman of the Zamfara State Joint Security Monitoring Team Abubakar Dauran says the suspects are undergoing interrogation by the policeAbubakar Dauran adds that the committee is working alongside security Agencies to clampdown on all bandits and their collaborators across the stateOver two thousand bandit collaborators have so far been arrested since the commencement of the recent unslaught against bandits and their collaboratorsIt would be recalled that the Zamfara State Government had in August banned sale of all petroleum products in jerrycans as part of measures to address Insecurity"
  },
  {
    "headline": "Zamfara Police Commissioner visits Correctional Facility in Gusau -",
    "summarized_story": "Police in Zamfara have beefed up Security at the Gusau Correctional Centre to forestall any attack that could lead to jailbreak.\nThe police say the move becomes necessary following upsurge in criminal activities across and the recent attack at the Abolongo Custodial centre in Oyo State that led to the release of unspecified number of inmates.\nThe Zamfara state Commissioner of police, Ayuba Elkanah assures that the Police is fully committed to the security and safety of all Correctional centres in the state.\nCP Elkanah stated this when he visited the Gusau Correctional facility to assess the existing security arrangements with a view to averting any security threats at the Centre.\nHe adds that his office is always open to approve any security request regarding Correctional facilities, adding that same security arrangements will be extended to all Correctional facilities across Zamfara State."
  },
  {
    "headline": "Potential Legal Woes Mount after ‘Rust’ Shooting Tragedy",
    "summarized_story": "But Alec Baldwin the producer might be, along with several others in leadership positions for the Western.\nExperts predict a tremendous legal fallout from the tragedy, definitely in civil lawsuits and potentially in criminal charges.\nThe payouts — which could be covered in part by insurance held by the production company, Rust Movie Productions — would likely be in the “millions and millions” of dollars.\n“There was clearly negligence on the set,” said Adam Winkler, a professor at the UCLA School of Law and a gun policy expert.\nRust Movie Productions, the production company, says it is cooperating with Santa Fe authorities in their investigation."
  },
  {
    "headline": "Sudan’s Toppled PM Hamdok Taken Back Home, Military Sources Say",
    "summarized_story": "Sudan’s toppled Prime Minister Abdallah Hamdok has been taken back to his own home in the Sudanese capital, Khartoum, military sources told Al Jazeera.\nCoup leader and army chief Abdel Fattah al-Burhan had said earlier that he was keeping Hamdok at his residence “for his own safety”.\nHours earlier, tens of thousands of pro-democracy protesters began pouring onto the streets as news spread that soldiers had arrested several government officials, including Hamdok.\nSources at the Health Ministry told Al Jazeera that seven people were killed on Monday.\nThe military also cut off access to the internet and closed some roads, bridges and the airport in Khartoum."
  },
  {
    "headline": "Paradigm Initiative Launches Short Film FOCUS",
    "summarized_story": "Speaking on the need for digital rights, the Director of the short film, Tolu Ajayi stated,“This is a story of the Judas’ kiss and the smeared lips.\nCommenting on the purpose of the short film, the Communications Officer, Paradigm Initiative, Valery Njiaba, said,“What we are doing with FOCUS is simple.\nFOCUS is a co-production of Paradigm Initiative and Up In The Sky Films with backing from The Kingdom of Netherlands, United States Department of States and Open Society Initiative for West Africa.\nParadigm Initiative is a Nigeria-based pan-African social enterprise.\nSince its establishment in 2017, Paradigm Initiative has been working to advance digital rights and inclusion in Africa and empower youths with life-changing digital, life and business skills."
  },
  {
    "headline": "‘Climate Catastrophe’: World Faces 2.7C Temperature Rise",
    "summarized_story": "Current commitments to cut greenhouse gas emissions put the planet on track for a “catastrophic” average 2.7-degree Celsius temperature rise this century, the United Nations said on Tuesday, another stark warning ahead of crunch climate talks.\nAs extreme weather events such as superstorms, wildfires and floods increasingly hit countries around the world, even the slightest increase in global temperatures will worsen the situation.\nUN chief Antonio Guterres said Tuesday’s report showed the world was “still on track for climate catastrophe”.\nThe time for closing the leadership gap must begin in Glasgow.”UNEP said most recent commitments would shave 7.5 percent off previously predicted 2030 emissions levels.\nThe report said even if all net-zero pledges were delivered in full, there was a 60-percent chance that temperature rises would hit 2.7C by 2100."
  },
  {
    "headline": "Brazilian Government, Embraer Commend Air Peace as Airline Turns 7",
    "summarized_story": "The Brazilian Government, represented by the Head of Mission, Embassy of Brazil in Nigeria, Ambassador Ricardo Guerra de Araujo, and the country’s aerospace conglomerate, Embraer, have both celebrated the steady growth of Air Peace as the Nigerian foremost carrier marked its 7th Anniversary on October 24, 2021.\n“Air Peace has made remarkable achievements, investing in brand new airplanes and should be proud of itself for becoming a leader in Nigeria’s aviation,” the diplomat said.\nGeneral Manager, MEA, for Embraer, Hussein Dabbas, who felicitated with the airline for its consistent show of strength and vibrancy since commencing commercial operations in 2014, stressed that Embraer will continue to partner with Air Peace in its drive to interconnect Africa and beyond through the provision of peaceful connectivity with brand new airplanes.\nAir Peace currently services 19 domestic routes, 6 regional routes and 2 international destinations, while it boasts of a varied fleet of 30 aircraft, the latest being four brand new 124-seat capacity Embraer 195-E2s.\nJohn Shiklam in Kaduna"
  }
]