[
  {
    "headline": "Hearing strange voices sign of schizophrenia, not madness –Mental health experts",
    "summarized_story": "The experts also stated that a recent study suggested that about 1.86 million people suffer from schizophrenia in Nigeria.\nThe experts were reacting to recent reports that hardship and frustrations are fuelling schizophrenia and other mental health challenges in the country.\nAccording to the experts, a recent study by the World Health Organisation has confirmed that schizophrenia is a chronic and severe mental disorder affecting 20 million people worldwide.\nThe health condition, they said, is characterised by distortions in thinking, perception, emotions and language, as well as hallucinations and delusions.\nIn some cases patients may exhibit a deficit of functions such as lack of motivation, reduced speech, social withdrawal, or bluntness of effect,” Peters said."
  },
  {
    "headline": "Hearing strange voices sign of schizophrenia, not madness –Mental health experts",
    "summarized_story": "The experts also stated that a recent study suggested that about 1.86 million people suffer from schizophrenia in Nigeria.\nThe experts were reacting to recent reports that hardship and frustrations are fuelling schizophrenia and other mental health challenges in the country.\nAccording to the experts, a recent study by the World Health Organisation has confirmed that schizophrenia is a chronic and severe mental disorder affecting 20 million people worldwide.\nThe health condition, they said, is characterised by distortions in thinking, perception, emotions and language, as well as hallucinations and delusions.\nIn some cases patients may exhibit a deficit of functions such as lack of motivation, reduced speech, social withdrawal, or bluntness of effect,” Peters said."
  },
  {
    "headline": "Global COVID-19 deaths near 4m with 7,951 new fatalities",
    "summarized_story": "They exclude revisions made by other statistical organisations, which show that the number of deaths is much higher.\nThe United States is the worst-affected country with 597,628 deaths from 33,362,633 cases.\nAfter the US, the hardest-hit countries are Brazil with 473,404 deaths from 16,947,062 cases, India with 349,186 deaths from 28,909,975 cases, Mexico with 228,804 deaths from 2,433,681 cases, and Peru with 186,511 deaths from 1,983,570 cases.\nLatin America and the Caribbean overall has 1,180,726 deaths from 33,979,026 cases, Europe 1,143,053 deaths from 53,256,433 infections, and the United States and Canada 623,352 deaths from 34,754,889 cases.\nAsia has reported 505,866 deaths from 37,489,435 cases, the Middle East 144,897 deaths from 8,748,996 cases, Africa 132,299 deaths from 4,924,631 cases, and Oceania 1,104 deaths from 49,548 cases."
  },
  {
    "headline": "Global COVID-19 deaths near 4m with 7,951 new fatalities",
    "summarized_story": "They exclude revisions made by other statistical organisations, which show that the number of deaths is much higher.\nThe United States is the worst-affected country with 597,628 deaths from 33,362,633 cases.\nAfter the US, the hardest-hit countries are Brazil with 473,404 deaths from 16,947,062 cases, India with 349,186 deaths from 28,909,975 cases, Mexico with 228,804 deaths from 2,433,681 cases, and Peru with 186,511 deaths from 1,983,570 cases.\nLatin America and the Caribbean overall has 1,180,726 deaths from 33,979,026 cases, Europe 1,143,053 deaths from 53,256,433 infections, and the United States and Canada 623,352 deaths from 34,754,889 cases.\nAsia has reported 505,866 deaths from 37,489,435 cases, the Middle East 144,897 deaths from 8,748,996 cases, Africa 132,299 deaths from 4,924,631 cases, and Oceania 1,104 deaths from 49,548 cases."
  },
  {
    "headline": "People with disability protest insecurity, sues for peace in South-East",
    "summarized_story": "By Ugochukwu Alaribe, UmuahiaPeople with disabilities under the aegis of the Joint National Association of Persons with Disability, JONAPWD, South-East zone, has decried the high state of insecurity in the South East and sued for peace in the zone.\nThat when people with legs, vision, and able-bodied will be running and escaping for their dear lives, persons with disabilities cannot help themselves.\nThat we are crying and dying of hunger, hardship and insecurity, and suffering disability.\nNone of us gave life and none of us has the right to take life; life belongs to the Almighty God.\nThose who want crisis and destroy peoples’ lives and those who are in the bush destroying peoples’ lives should stop."
  },
  {
    "headline": "Twitter Ban: Sanwo-Olu seeks for restraints, dialogue",
    "summarized_story": "Recall that FG had last Friday, announced indefinite suspension on the operations of microblogging and social networking service, Twitter, in Nigeria.\nHowever, Nigeria’s businesses, reportedly lost over N4.3 billion in days after suspension of Twitter operations in Nigeria.\nAccording to Sanwo-Olu: “Though, I will not want to join issues concerning the Twitter ban.\nWe have research grants to support the sector which are in N20 million, N10 million, N5 million, and we did over N250 million last year.\n“There is also the security issues, let us be circumspect, don’t let us throw the baby with the bath water."
  },
  {
    "headline": "NIMC registers 1.2m Nigerians in Bauchi",
    "summarized_story": "The National Identity Management Commission (NIMC) has so far registered 1.2 million Nigerians into the National Identity Database and has issued them with the National Identification Number (NIN) in Bauchi.\nMalam Isa Abdulmumin, NIMC Bauchi state coordinator, made this known in an interview with the News Agency of Nigeria NAN in Bauchi.\n”The number ought to be much higher than what was recorded considering the population size of the state,” he said.\nHe commended a lawmaker Jamilu Barade, representing Bauchi Central Constituency in the state House of Assembly for spending N800,000 to overhaul the commission’s transformer.\nBy this act, he said electricity has been restored in the state NIMC office."
  },
  {
    "headline": "NPA, LASG map out strategies to tackle Apapa gridlock",
    "summarized_story": "Worried by the worsening gridlock on the access roads leading to the country’s two busiest ports in Apapa, the Nigerian Ports Authority (NPA) has met with the Lagos State Government to map out strategies to tackle the menace.\nThe statement quoted Bello-Koko as harping on the need to strengthen enforcement of traffic laws along the Apapa and Tin Can Ports roads.\nBello-Koko lamented that no less than 30 “toll-points” had sprung up around the Apapa and Tin Can Port, where bribes were allegedly being collected before trucks were allowed into the Port.\n“Because of the involvement of several security units, many checkpoints have been created; we believe there are over 30 checkpoints within the Apapa and Tin Can Port axis.\n“Trucks going to Tin Can now use the Apapa Port road, so no matter how much you control the traffic in Apapa, it will not be noticed."
  },
  {
    "headline": "Ban on motorcycles: Niger govt provides minibuses as alternative, urges patience among residents",
    "summarized_story": "This development was coming barely a week after the govt’s announced ban on motorcycles, tricycles plying major roads in the state capital, Minna.\n“In view of the ban on the operations of commercial motorcycle in Minna metropolis, the Commissioner of Transport, Rahmatu Mohammed Yar’adua, has directed the deployment of buses for township services.” He noted.\n“Hence, NSTA vehicles commenced township services on Saturday 5th May, 2021.\nWESTERN BYPASS: Brighter junction, Barikin sale junction, Sauke ka huta junction, Kpakungu, Kure market and Dutsen Kura Junction.\nTALBA ESTATE: Justice Fati Lami CAILS, Gbeganu junction, Gurara junction, Talba Estate."
  },
  {
    "headline": "You can't be law unto yourself, I'll keep tweeting",
    "summarized_story": "A former Governor of Ekiti State, Ayodele Fayose, has again declared that he will continue to use the suspended social media platform, Twitter.\nAnd on Monday, Fayose said he will keep tweeting and believes that many other Nigerians are doing the same.\nLike Buhari, no President elected by Nigerians can be a law unto himself.\n“It is our right to use twitter and other social media platforms and we’ll keep tweeting.\nThe Federal Government of Nigeria had on Friday, announced the suspension of microblogging and social networking service, Twitter, in the country."
  },
  {
    "headline": "Again, Ortom, Akume, Suswam meet over insecurity in Benue",
    "summarized_story": "Governor Samuel Ortom and two of his predecessors – Minister of Special Duties and Intergovernmental Affairs, Senator George Akume and Senator representing Benue North East, Gabriel Suswam met again on Sunday to discuss security issues bedevilling the state.\nGovernor Ortom briefed journalists shortly after a meeting with the two former governors, the Tor Tiv, Professor James Ayatse and first-class chiefs in Tiv land which took place in Makurdi.\nThe Governor noted that Benue belongs to all and it behoves them to secure the state for future generations.\nGovernor Ortom stated that it was observed that the Fulanis had misinterpreted the ranching law of the state, saying a committee would be constituted to sensitize and create greater awareness on the content of the law.\nInsecurity: Ortom, Akume, Suswam meet in Makurdi"
  },
  {
    "headline": "Ignore NBC’s order to stop using Twitter – Adeyanju tells broadcasting stations",
    "summarized_story": "An Abuja-based rights activist, Comrade Deji Adeyanju, has reacted to the National Broadcasting Commission’s (NBC) directives to all broadcasting stations in the country to suspend the use of Twitter.\nDAILY POST had reported that NBC on Monday directed all broadcasting stations in the country to suspend the use of Twitter.\nNBC, in a statement issued by its Director General, Armstrong Idachaba, advised television and radio stations to de-install twitter handles and stop using it as a source of user generated content (UGC) of information gathering for news and programs.\nBREAKING: NBC orders broadcasting stations to stop using TwitterIt further warned that it will be unpatriotic for any broadcaster in Nigeria to continue to patronise the suspended Twitter.\nReacting, Adeyanju in a post via his Twitter account told the broadcasting station to ignore the hopeless and baseless order."
  },
  {
    "headline": "Malami summons Sarkin Fulani, Abdulkadir over Igangan attack",
    "summarized_story": "Minister of Justice and Attorney-General of the Federation (AGF), Abubakar Malami, has invited the evicted Sarkin Fulani of Igangan, Ibarapa North Local Government Area of Oyo State, Alhaji Salihu Abdulkadir, to Abuja over last Sunday’s violence, which claimed many lives in the community.\nThe invitation to Abuja is coming on the heels of a petition by an international human rights organisation to the justice minister.\nConfirmed sources close to the Sarkin Fulani, informed DAILY POST in Ilorin, Kwara State capital, on Monday, that the Sarkin is billed to meet the minister on Tuesday in Abuja.\nYoruba activist, Sunday Adeyemo, popularly known as Sunday Igboho, had early this year sent Sarkin Fulani and his people packing from their Igangan base following allegations of kidnapping and other crimes.\nAbdulkadir’s house was also burnt with properties worth millions of naira destroyed during an attack on his domain in Igangan."
  },
  {
    "headline": "IPOB: FG convenes town hall meeting over attacks on assets in S/East",
    "summarized_story": "The Minister of Information and Culture, Lai Mohammed, made this known at a town hall meeting on the protection of public infrastructure in Abuja.\nAccording to Mohammed, the destruction of public infrastructure and facilities in the South-East is not just vandalism but a form of terrorism.\n“On another level are the incessant attacks on critical public facilities such as police stations and INEC offices.\nAs a matter of fact, the destruction of public infrastructure and facilities is not just vandalism, it is a form of terrorism.\n“And this is why we have decided to organize a series of town hall meetings to address this incessant and worsening destruction of public infrastructure and facilities."
  },
  {
    "headline": "Sanwo-Olu reacts to Twitter ban",
    "summarized_story": "Lagos Governor Babajide Sanwo-Olu on Monday reacted to the Federal Government’s suspension of the operations of the micro blogging and social networking service, Twitter.\nThe Nation reports Minister of Information, Lai Mohammed had announced the “indefinite” suspension in a statement last week by his spokesman Segun Adeyemi.\nSanwo-Olu, in an interview with Arise TV monitored by The Nation, explained he does not have the same prognosis as the President and Commander in Chief, and so, he cannot say if what was done is wrong or right.\nHe would have the prognosis and security information that I do not have and I cannot begin to say that was it done is right or wrong.”Sanwo-Olu however suggested that both sides — Twitter and the Federal Government — should come together to resolve the issues at hand.\n“On both sides, there are issues that can be resolved between Twitter and the Government and I think what they’ve done is not a ban but a suspension like they said, so in the period of suspension let us sit down…we need to have that conversation with them,” he explained."
  },
  {
    "headline": "BREAKING: FG to meet foreign diplomats over twitter ban",
    "summarized_story": "Following reactions to the Federal Government’s suspension of twitter operations, the Minister of Foreign Affairs Geoffrey Onyeama will meet with foreign diplomats by noon today.\nUS, UK, EU, Sweden have all reacted against the ban, which they condemned as infirngment on rights of the people.\nThe meeting, it was gathered, is meant to explain government’s stance on the issue.\nSnippet about the meeting reads: “Following the recent ban on Twitter by the Federal Government and Press Statement issued by some Heads of Diplomatic Missions Accredited to Nigeria on the subject matter, the Honourable Minister of Foreign Affairs, His Excellency, Geoffrey Onyeama has invited the affected Ambassadors to a Meeting.”Details shortly…"
  },
  {
    "headline": "N-Power begins enrolment for Batch C applicants",
    "summarized_story": "The Ministry of Humanitarian Affairs, Disaster Management and Social Development has announced the next step for the N-Power Batch C Stream I applicants.\nThe Permanent Secretary in the ministry, Bashir Alkali, announced this in a statement yesterday in Abuja.\nHe said the ministry has commenced the next stage of enrollment with the verification of email addresses by applicants.\nThe permanent secretary advised the shortlisted applicants to check their email addresses for confirmation and further information.\nHe also advised the applicants to contact N-Power helplines on 018888340 or 018888189 or send email for support to: support.npower@nasims.gov.ng for other enquiries."
  },
  {
    "headline": "How I escaped from ritualists - Chris Iheuwa",
    "summarized_story": "Nollywood actor Chris Iheuwa has narrated his narrow escape from ritualists, human organ harvesters and cultists in faraway Port Harcout, Rivers state.\nThe ‘La Femme Anjola’ actor, on June 4, 2021, narrated his ordeal in a long statement documenting his narrow escape.\nAccording to him: “Our moviemaking job takes us to various locations, towns, villages, States and in some cases countries.\n“Some hours later, we arrived PH and the Artiste Liaison Officer came to pick me from the airport or so I thought.\nI had narrowly escaped a case of ritualists and cultists who were rampant in that side of PH."
  },
  {
    "headline": "IPOB strongman Dragon killed in police shootout",
    "summarized_story": "Its spokesman, Bala Elkana, said Dragon and his gang were neutralised before they could access the headquarters.\nFive of the hoodlums were killed during an exchange of fire and others were injured.\nCommissioner’s houses razed in ImoAlso yesterday, arsonists razed two houses belonging to Imo Commissioner for Information and Strategy, Chief Declan Emelumba.\nOne killed, others abducted in AnambraSecurity agencies allegedly stormed the home of Ifeanyi Ejiofor in Oraifite, Ekwusigo Local Government Area.\nIPOB spokesman Emma Powerful said in a statement: “It was around 2.30 am that they surrounded his (Ejiofor’s) country home."
  },
  {
    "headline": "Breaking: FG summons US, UK, EU, other envoys over statements on Twitter ban",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Federal Government, has summoned some envoys over their responses to its ban on Twitter’s operations in the country.\nThe Minister of Foreign Affairs, Geoffrey Onyeama, summoned the envoys to a meeting holding later today at the Tafawa Balewa House, Abuja.\nRecall that The United States (US), the United Kingdom (UK), the Delegation of European Union (EU) to Nigeria and the Economic Community of West African States (ECOWAS), the Canadian Government, the Kingdom of Norway, and the Republic of Ireland, in a joint statement at the weekend, expressed disappointment over the ban on Twitter’s operations in Nigeria.\nPrior to the joint statement, the United States Diplomatic Mission to Nigeria, had issued a separate statement where it said the ban on Twitter’s operations in the country was an infringement on the rights of Nigerians to freedom of expression."
  },
  {
    "headline": "DSS storms Adoration Ministry, summons Mbaka to Abuja",
    "summarized_story": "From Jude Chinedu, EnuguThere appears to be more trouble coming the way of the Spiritual Director of Adoration Ministry Enugu, Nigeria (AMEN) Rev.\nEjike Mbaka, as he has been summoned to Abuja for interrogation by operatives of the Department of State Services.\nJust last week, Mbaka returned from a 30-day compulsory prayer retreat imposed on him by the Catholic Bishop of Enugu Diocese, Most Rev.\nThis was followed by a letter from the Bishop which stripped Mbaka of total control of the adoration ministry as it was converted to a Chaplaincy.\n“I got a call on Thursday that the DSS people from Abuja came here (Enugu) with a letter of invitation to Abuja."
  },
  {
    "headline": "Massacre in Oyo: 45 dead bodies recovered, Oba’s palace, 60 houses burnt, over 160 vehicles destroyed",
    "summarized_story": "From Oluseye Ojo, IbadanBlood flowed freely in Igangan, one of the seven principal towns of Ibarapaland in Oyo State, on Saturday night, as gunmen dispatched over 45 persons to their early graves in the town.\nSalihu was evicted from the town based on allegations of aiding and abeitting killings, kidnapping and destruction of farmland in the area.\nThe bandits, according to sources, were about 50 and they invaded the town on more than 20 motorcycles.\nWe are assembled here.”Police confirm incident, begin investigationThe Oyo State Police Command has confirmed the invasion of Igangan in Ibarapa zone of the state by unknown assailants during which many lives and property were destroyed.\nAlso, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, condemned the and call on residents of Igangan and the entire state to be calm."
  },
  {
    "headline": "Nigeria at crossroads as oil price nears $75 per barrel",
    "summarized_story": "Brent crude, the global oil price benchmark is gradually making a rebound with a barrel of oil likely to hit $75 in the weeks ahead and probably above, a development that signaled a ray of hope for the troubled sector which has battled a low price regime occasioned by the coronavirus pandemic since last year.\nIronically, while other oil producing countries with robust refining capacity are anxious to reap the gains of higher oil prices, Nigeria seems to be fretting because a higher price regime will definitely translate to increased cost of refining and higher fuel subsidy.\nOn the other hand, gains will be reaped for the country as its 2021 oil price projection was based on an estimate of $40 per barrel, indicating a daily gain of $57.6 daily for the country at 1.8 million barrels of oil production per day.\nWhile pump price steadily rose, the face-off between labour and Federal Government kept the latter in a tight corner.\nThe unions had earlier forced the government to reverse the pump price from N168 per litre last year to N162."
  },
  {
    "headline": "T.B Joshua: Buhari, Jonathan, govs, Kalu, others mourn",
    "summarized_story": "Condolence messages have been pouring in following the demise of Prophet TB Joshua.\n“Prophet Joshua was committed to giving and was more often, inexorably imbued with calmness while lifting the downtrodden.\nHe said he was saddened to hear about the death of T.B Joshua, at a young age of 57.\n“TB Joshua was a devout man of God who served God and humanity with relentless passion.\nProphet T.B."
  },
  {
    "headline": "How Popular Nigerian Televangelist TB Joshua Died",
    "summarized_story": "The Founder of the Synagogue Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, died on the way to the hospital, SaharaReporters has gathered.\nHe died on the way to the hospital,\" a source told Saharareporters.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended.\nTB JOSHUA AT 58: Important Birthday Message!"
  },
  {
    "headline": "How Popular Nigerian Televangelist TB Joshua Died",
    "summarized_story": "The Founder of the Synagogue Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, died on the way to the hospital, SaharaReporters has gathered.\nHe died on the way to the hospital,\" a source told Saharareporters.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended.\nTB JOSHUA AT 58: Important Birthday Message!"
  },
  {
    "headline": "How Nigerians Criticised Pastor Adeboye For Calling Yahaya Bello “Man Of Faith”",
    "summarized_story": "The General Overseer, the Redeemed Christian Church of God, Pastor Enoch Adeboye, has come under fire for reportedly describing the Governor of Kogi State, Yahaya Bello as a man of faith.\n@A3Adewunmi wrote, “So, Pastor Adeboye can visit Yahaya Bello (not Yahaya Bello visiting Adeboye).\n#freekogi2.”@Oluomoofderby said, “So ashamed of Pastor Adeboye.\nLike prophet Ezekiel etc.”@JosephMonehin wrote, “Why is Pastor Adeboye doing this?\nNow Yahaya Bello."
  },
  {
    "headline": "How Nigerians Criticised Pastor Adeboye For Calling Yahaya Bello “Man Of Faith”",
    "summarized_story": "The General Overseer, the Redeemed Christian Church of God, Pastor Enoch Adeboye, has come under fire for reportedly describing the Governor of Kogi State, Yahaya Bello as a man of faith.\n@A3Adewunmi wrote, “So, Pastor Adeboye can visit Yahaya Bello (not Yahaya Bello visiting Adeboye).\n#freekogi2.”@Oluomoofderby said, “So ashamed of Pastor Adeboye.\nLike prophet Ezekiel etc.”@JosephMonehin wrote, “Why is Pastor Adeboye doing this?\nNow Yahaya Bello."
  },
  {
    "headline": "How Nigerians Criticised Pastor Adeboye For Calling Yahaya Bello “Man Of Faith”",
    "summarized_story": "The General Overseer, the Redeemed Christian Church of God, Pastor Enoch Adeboye, has come under fire for reportedly describing the Governor of Kogi State, Yahaya Bello as a man of faith.\n@A3Adewunmi wrote, “So, Pastor Adeboye can visit Yahaya Bello (not Yahaya Bello visiting Adeboye).\n#freekogi2.”@Oluomoofderby said, “So ashamed of Pastor Adeboye.\nLike prophet Ezekiel etc.”@JosephMonehin wrote, “Why is Pastor Adeboye doing this?\nNow Yahaya Bello."
  },
  {
    "headline": "The Next Wave: When tweeting becomes a crime",
    "summarized_story": "At the time, Nigeria’s president complained of “the spreading of deliberate falsehood and misinformation through the social media in particular.”Eight months later, Twitter deletes the president’s tweet for threatening violence.\nThe government combines this with grievances about Twitter’s indirect role in empowering #EndSARS, ordering internet service providers to ban Twitter indefinitely.\n[ Read: Twitter ban rewinds Nigeria to pre-internet darkness and reign of fear ]But it’s happening and curious plans are in store for internet-enabled platforms in general – WhatsApp, YouTube and maybe even Netflix.\nBut from the Twitter ban alone, at least three concerns are playing out:Stifling social services: Twitter is a mainstream SOS platform in Nigeria.\nWith Nigeria’s crippled healthcare and education, social media lends traction to the many GoFundMe’s standing between salvation and death."
  },
  {
    "headline": "Twitter ban rewinds Nigeria to pre-internet darkness and reign of fear",
    "summarized_story": "An infamous banAs of the morning of Saturday June 5, most people living in Nigeria could no longer access Twitter.\nSome users say they still have access from some internet service providers, but VPNs have become the primary medium to stay on Twitter for most people.\nALTON confirms telcos have shut down Twitter in NigeriaBut of course the whole responsibility for Nigeria’s Twitter darkness lies at the top.\nBasically, any media and communication service that uses data provided by internet service providers.\nBy suspending Twitter, Nigeria has stepped into the internet control realm currently championed by China, Iran and India, a fellow country under democracy."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes.\nUpdate: Twitter has now been shutdown in Nigeria."
  },
  {
    "headline": "WHY AGRO-CROWDFUNDING PLATFORM FARM SPONSOR IS RESCHEDULING SHORT-TERM PAYMENTS DESPITE INSURED OPERATIONS",
    "summarized_story": "The past few days has been quite a challenge as the company has been facing some difficulties which has destabilized our crowd funding operations.\nWe are taking appropriate measures to see that all funds collected from every sponsor will be paid back accordingly.\n• 128,000 birds per week state of the art hatchery.\nOur mid term strategy is through equity investment from institutional investors and we are willing to relinquish 30-50% of directors shares in the company.\nOur long term strategy would be direct revenue from the business, hence the 18-24 months."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "#Twitterban: Nigeria is borrowing a leaf from China’s playbook",
    "summarized_story": "The Human Rights Watch report 2019 specifically highlighted ways the Chinese authorities infringed on the human rights of its citizens.\nHowever, Nigeria’s clampdown on social media did not start with the Twitter suspension.\nThe bill sought to control online and print media as well as regulate social media.\nIn 2019, the social media bill officially titled “Protection from Internet Falsehoods and Manipulations and Other Related Matters Bill 2019″ was introduced.\nInterestingly, the Federal Ministry of Information and Culture has also directed the Nigerian Broadcasting Commission (NBC) to start licensing over-the-top (OTT) and social media platforms."
  },
  {
    "headline": "What rhymes with SAN and blocks your access to Twitter?",
    "summarized_story": "The government, in an official statement by the Minister for Information and Culture, Lai Mohammed, disclosed that it would be indefinitely banning the microblogging platform, Twitter, from operating in the country.\nIf you’ve thought about the economic effects this might have, you should take a peek at this: 4 ways Nigeria’s Twitter ban could affect businesses.\nAdvertisementMeanwhile, Nigerian Twitter users have taken to using Virtual Private Networks (VPNs) to bypass the ban after telcos followed the government’s directive and restricted access to the platform.\nAlso, Nigerians on Twitter react to Nigeria’s Twitter Suspension.\nRead: #TwitterBan: Nigeria reportedly meets China to control access to social media, VPNs, othersSudden decision?"
  },
  {
    "headline": "#Twitterban: Nigeria reportedly meets China to control access to social media, VPNs, others",
    "summarized_story": "The Internet Firewall will be similar to China’s Great Firewall, which allows the Chinese government to prevent access to social media platforms like Facebook, Google, Twitter, Instagram, Whatsapp, and any other website it chooses.\nThe Nigerian Broadcasting Commission (NBC) was also required to licence over-the-top (OTT) platforms like YouTube, Netflix, or other social media platform.\nHowever, we raised a major issue: a lack of the required technical expertise to implement regulations on or collect taxes from OTT platforms.\nIf the Nigerian Internet Firewall comes to fruition, Internet censorship of Nigerians, social media regulations, and taxation might become possible.\nConsequently, Nigeria’s growing partnership with China could extend to much more than just building an Internet firewall."
  },
  {
    "headline": "Opportunity for micro-insurers as 18m Nigerians show interest",
    "summarized_story": "Some 18 million uninsured adult Nigerians have indicated interest in microinsurance products, according to the result from EFInA’s 2020 survey on Access to Financial Services in Nigeria released on Thursday.\nThis opens a huge opportunity for insurers in the country who are struggling to grow their customer base.\nTop among reasons for this are lack of tailor-made insurance products and low disposable income on account of the sluggish economic growth that has remained fragile since 2015.\nThe unwillingness by many Nigerians to take up insurance products has kept the insurance penetration rate in Africa’s largest economy at less than 1 percent in the last decade.\nThe pandemic and population growth could see that figure rise to almost 100m by 2023, says the World Bank."
  },
  {
    "headline": "FX trade doubles as Nigeria’s central bank restores market transparency",
    "summarized_story": "The Central Bank of Nigeria (CBN) is demonstrating its commitment towards the deepening of the foreign exchange (FX) market and the Nigerian financial market, as the apex bank, in collaboration with FMDQ Securities Exchange Limited (FMDQ) and FX authorised dealers (banks), activate an on-system trading and reporting of all FX transactions on the FMDQ-advised FX…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "How Nigeria’s 1999 Constitution is stifling economy",
    "summarized_story": "Nigeria’s 1999 Constitution began with a lie.\n“We the people of the Federal Republic of Nigeria having firmly and solemnly resolved, to live in unity and harmony as one indivisible and indissoluble sovereign nation under God…” But Nigerians were never consulted in the negotiation for this ‘indissoluble union’ now hurtling towards implosion.\nThe disparate groups…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "State police will address insecurity in Nigeria – Gyang – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestVom (Plateau) – Sen. Istifaus Gyang (PDP-Plateau) says the creation of state police will help to address myriad of security challenges facing the country.\nGyang, representing Plateau North Senatorial District, said this on Sunday during an interactive session with newsmen in Vom, Jos South Local Government Area of the state.\nHe was in Vom for the inauguration of some projects executed by Rep. Dachung Bagos, the lawmaker representing Jos South/Jos East Federal Constituency of the state.\nThe lawmaker, therefore, urged the Federal Government to heed to the public demand for the creation of state police.\nSpeaking on the projects by his NASS counterpart, Gyang commended Bagos for the successful completion of the projects."
  },
  {
    "headline": "Edo to strengthen tax laws, eliminate cash payment to tackle evasion, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has said his government will enact new laws and strengthen existing laws to improve revenue collection, and address tax evasion and other corrupt practices in the system.\nObaseki disclosed this while addressing participants during a stakeholders’ engagement of the Edo State Transition Committee with artisan groups at the New Festival Hall, Government House, Benin City.\nHe said his government is working to eliminate all forms of cash payment for taxes across the State as it will minimise corrupt practices in the system.\nObaseki noted: “As a government, we are looking at all the processes of tax collection; we will ensure no more cash tax payment, as it will enable us to check corruption in the system.\n“We are simplifying the tax system in the State to encourage more people to key into the system."
  },
  {
    "headline": "ppointments: We‘ll select the best, tech savvy persons to drive our government’s vision – Obaseki – Nigerian Observer",
    "summarized_story": "I will get Special Assistants (SAs) from each ward across the six local government areas.\nLeaders must sit down to nominate qualified and the best people that will represent them well in government.\n“I will appoint three persons per ward, and one of them must be a woman.\nObaseki continued: “Leaders must meet at the local government level to nominate four persons each that will be appointed as Senior Special Assistants (SSAs).\n“I urge all the leaders in these council areas and wards to give me their very best as I thrive to build a world-class government."
  },
  {
    "headline": "Migration and IOM Perspective – Nigerian Observer",
    "summarized_story": "Recently, the International Organisation for Migration (IOM) organised a training programme for selected journalists in the print, radio, television and digital media spread across different states of Nigeria.\nIOM offers Technical Support for the implementation of Labour Migration policy Action Plan which aims at managing labour migration and mobilising diaspora for international development.\nIt helped review the National Labour Migration Policy and the National Policy on Migration to ensure that emerging migration issues were well captured and facilitated the high level meeting that led to the adoption of draft and final policies.\nIts migration policy based research contributes to evidenced-based policies on migration that address the needs of migrants and supports the national capacity to address them.\nIt is well positioned to build on its grassroots experience and provide guidance on migration policy."
  },
  {
    "headline": "Two shot as protesters block Kebbi governor’s convoy",
    "summarized_story": "The protest followed the killing of 88 persons by bandits in Danko-Wasagu Local Government Area of the state on Thursday.\nResidents said a vehicle attached to the governor’s convoy was burnt by the protesters after shots fired by security agents to disperse the crowd hit two persons.\nPREMIUM TIMES reported how 88 people were killed by bandits in attacks on some communities in Danko-Wasagu Local Government Area.\nPassing blames not the solution – GovernorThe governor, following the incidents, urged residents to be optimistic about the security situation in their area.\nWhat is required (is) mutual trust and respect for all,” the governor’s spokesperson, Yahaya Sarki, said in a statement."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "CBN gas policy holds out promise for domestic market",
    "summarized_story": "We are major resource holders, major exporter of gas, at the same time we struggle on the domestic front with de-industrialization, with unmet domestic gas demand and insufficiency in gas supply to the power sector for power generation,” President of the Nigerian Gas Association (NGA), Mrs Audrey Joe-Ezigbo, once said.\nUnder the NGEP, the CBN is providing N250 billion loan to help stimulate investment in the gas value chain as part of its efforts to stimulate finance to critical sectors of the economy.\nHe urged operators in the gas industry to take advantage of the fund to further expand the sector and increase the penetration of gas consumption.\nMr. Lambert Ojo, a gas processing and evaporative cooling specialist, believes the intervention for local investors in the gas sector would stimulate the economy.\n“We have enough to do in the domestic gas space."
  },
  {
    "headline": "Two shot as protesters block Kebbi governor’s convoy",
    "summarized_story": "Two persons were reportedly shot and injured on Saturday after residents of a community, recently attacked by bandits, blocked the convoy of Governor Atiku Bagudu of Kebbi State while protesting against insecurity in the state.\nThe protest followed the killing of 88 persons by bandits in Danko-Wasagu Local Government Area of the state on Thursday.\nResidents said a vehicle attached to the governor’s convoy was burnt by the protesters after shots fired by security agents to disperse the crowd hit two persons.\nThe governor, following the incidents, urged residents to be optimistic about the security situation in their area.\nWhat is required (is) mutual trust and respect for all,” the governor’s spokesperson, Yahaya Sarki, said in a statement."
  },
  {
    "headline": "Nigerian govt summons US, EU, UK, Canada, Sweden envoys over comments on Twitter ban",
    "summarized_story": "Nigeria’s Federal Government has summoned the ambassadors of the United States, United Kingdom, Canada and the European Union in Nigeria over their comments on the suspension of microblogging site Twitter in Nigeria.\nThe envoys had criticised the government’s decision to ban the social media platform, calling it an abuse of right to freedom of speech.\nThis was disclosed in an invite to journalists by Kimiebi Ebienfa of the Crisis Monitoring and Public Communications Division of the Nigerian Ministry of Foreign Affairs, on Monday.\n“The venue is Minister’s Conference Room, 8th Floor.\nYou are here invited to cover the Meeting."
  },
  {
    "headline": "Nigerian govt orders broadcast stations to go off Twitter",
    "summarized_story": "The National Broadcasting Commission (NBC) has directed all broadcast stations in the country to suspend the patronage of Twitter with immediate effect.\n“In Compliance to the above directive, Broadcasting Stations are hereby advised to de-install Twitter handles and desist from using Twitter as a source (UGC) of information gathering for News and programmes Presentation especially phone-in.\n“Section 2(1) r of the NBC Act entrusts the Commission with responsibility to ensure strict adherence to the national laws, rules and regulations.\nAlso, Section 3.11.2 of the Nigeria Broadcasting Code provides that “the broadcaster shall ensure that law enforcement is upheld at all times in a matter depicting that law and order are socially superior to or more desirable than crime and anarchy.\n“Note that it will be unpatriotic for any broadcaster in Nigeria to continue to patronise the suspended Twitter as a source of its information therefore strict compliance is enjoined.”"
  },
  {
    "headline": "DSS Storm Adoration Ministry, Summon Father Mbaka To Abuja —",
    "summarized_story": "Ejike Mbaka, a controversial clergyman, has been summoned to Abuja by Department of State Services agents for questioning.\nThe reason the intelligence agency summoned the priest was not disclosed, but it could be linked to Mbaka’s recent criticism of the Buhari administration.\nMbaka, the Spiritual Director of the Adoration Ministry in Enugu, has recently drawn notice for his criticism of President Muhammadu Buhari’s administration.\nThe priest recently stated that God had rejected the President and was dissatisfied with his leadership.\nIn a video obtained by SaharaReporters, Mbaka responded to the summons, saying, “I got a call that the DSS officials from Abuja arrived here (Enugu) with a letter of invitation to Abuja."
  },
  {
    "headline": "Suspected IPOB, ESN Fighters Abduct Police Officer, Others, In Anambra",
    "summarized_story": "Gunmen believed to be members of the Indigenous People of Biafra (IPOB) and its militant arm, the Eastern Security Network (ESN), struck in the Nnewi area of Anambra State, kidnapping a police officer and setting a car on fire.\nThe masked gunmen took all of the occupants of the vehicle, including the police officer, according to eyewitnesses.\nAnambra has been tense since the weekend, when the Personal Assistant to IPOB lawyer was killed by police and Nigerian Army personnel.\nAccording to reports, the soldiers also took his body, which was placed in the boot of a lawyer’s vehicle.\nAccording to an IPOB spokesman, Emma Powerful, on Sunday morning, security agents shot randomly before removing the lawyer."
  },
  {
    "headline": "Minority caucus condemns suspension of twitter — Daily Times Nigeria",
    "summarized_story": "By Tom OkpeMinority Caucus in the House of Representatives has condemned, in its entirety, the suspension of Twitter in Nigeria by the Federal Government, describing it as a clear violation of freedom of speech and other democratic rights and tenets as provided by the 1999 constitution.\nREAD ALSO: Allow Igbos to get Biafra, says CNG to Buhari and others“The Minority Caucus is disturbed that the suspension of Twitter in the country came after the social media platform deleted President Muhammadu Buhari’s tweets.\n“Such response by the Federal Government has raised further concerns over the APC-led administration’s disturbing rating on issues of political intolerance, abuse of rights and violation of rules in our country.\n“The minority caucus cautions that the development is capable of leading to further restiveness among Nigerians and worsen the situation in the country.\nThe Minority caucus, therefore, calls on President Muhammadu Buhari to immediately reverse the suspension placed on Twitter so as not to exacerbate the already tensed situation in the country."
  },
  {
    "headline": "BREAKING: NBC threatens to sanction media houses still using Twitter —",
    "summarized_story": "The National Broadcasting Commission has ordered that all broadcast stations in the country terminate Twitter’s patronage immediately.\nThe Commission ordered broadcast stations to “de-install Twitter handles and refrain from utilizing Twitter as a source (UGC) of information collection for news and program presentation, particularly phone-in,” according to the Commission.\n“In Compliance to the above directive, Broadcasting Stations are hereby advised to de-install Twitter handles and desist from using Twitter as a source (UGC) of information gathering for News and programmes Presentation especially phone-in.\n“Section 2(1) r of the NBC Act entrusts the Commission with responsibility to ensure strict adherence to the national laws, rules and regulations.\n“Note that it will be unpatriotic for any broadcaster in Nigeria to continue to patronize the suspended Twitter as a source of its information therefore strict compliance is enjoined.”"
  },
  {
    "headline": "Exhibition fight: Mayweather fails to knock-out Youtube star, Logan",
    "summarized_story": "Floyd Mayweather predictably dominated YouTube star Logan Paul on Sunday night in an eight round exhibition fight at Hard Rock Stadium in Miami, Florida.\nMayweather, who weighed in at 155 lbs with his opponent tipping the scales at 189.5 lbs, produced a typically slick performance much to the delight of a substantial crowd at the home of the Miami Dolphins.\nIntermittent rain throughout the evening failed to put a damper on Mayweather’s first performance since beating Japanese kickboxer Tenshin Nasukawa in December 2018.\nThis was declared an exhibition rather than a licensed, professional bout which meant there were no judges and the only way to triumph was to stop or knock-out the opponent within the eight scheduled three minute rounds.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Exhibition fight: Mayweather fails to knock-out Youtube star, Logan",
    "summarized_story": "Floyd Mayweather predictably dominated YouTube star Logan Paul on Sunday night in an eight round exhibition fight at Hard Rock Stadium in Miami, Florida.\nMayweather, who weighed in at 155 lbs with his opponent tipping the scales at 189.5 lbs, produced a typically slick performance much to the delight of a substantial crowd at the home of the Miami Dolphins.\nIntermittent rain throughout the evening failed to put a damper on Mayweather’s first performance since beating Japanese kickboxer Tenshin Nasukawa in December 2018.\nThis was declared an exhibition rather than a licensed, professional bout which meant there were no judges and the only way to triumph was to stop or knock-out the opponent within the eight scheduled three minute rounds.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Bad luck! Lady who lodged with boyfriend in Lagos hotel falls sick, dies",
    "summarized_story": "A lady, identified only as Esther, has died after lodging with her boyfriend, Emmanuel Isibor, at the T1 Suites in the Festac area of the Amuwo Odofin Local Government Area of Lagos State.\nPUNCH Metro gathered that the lovers visited the hotel to spend the night together.\nJolted by the turn of events, Isibor was said to have sought help by calling the manager of the hotel to rescue his girlfriend.\nThe source said, “What happened on May 31, 2021 was that around 11.30pm, the manager of T1 Suites, Obijomi Adedeji, reported that one of the lodgers, Emmanuel Isibor, came with his girlfriend, Esther.\n“But around 11pm, Emmanuel Isibor called on the manager for assistance as the lady developed a sudden ailment, which caused foamy substances to come out from her mouth and nostrils."
  },
  {
    "headline": "Bad luck! Lady who lodged with boyfriend in Lagos hotel falls sick, dies",
    "summarized_story": "A lady, identified only as Esther, has died after lodging with her boyfriend, Emmanuel Isibor, at the T1 Suites in the Festac area of the Amuwo Odofin Local Government Area of Lagos State.\nPUNCH Metro gathered that the lovers visited the hotel to spend the night together.\nJolted by the turn of events, Isibor was said to have sought help by calling the manager of the hotel to rescue his girlfriend.\nThe source said, “What happened on May 31, 2021 was that around 11.30pm, the manager of T1 Suites, Obijomi Adedeji, reported that one of the lodgers, Emmanuel Isibor, came with his girlfriend, Esther.\n“But around 11pm, Emmanuel Isibor called on the manager for assistance as the lady developed a sudden ailment, which caused foamy substances to come out from her mouth and nostrils."
  },
  {
    "headline": "Twitter ban: Buhari regime summons Canada, UK, US, EU envoys",
    "summarized_story": "By AbankulaThe Buhari-led government continues to dig in on its Twitter ban as foreign minister Geoffrey Onyeama summoned envoys of the United States, United Kingdom, Canada and the EU.\nIn standard diplomatic practice, Onyeama plans to use the meeting to condemn the envoys over their comments on the suspension of Twitter in Nigeria.\nKimiebi Ebienfa of the Crisis Monitoring and Public Communications Division of the Nigerian Ministry of Foreign Affairs issued the summons in a statement today.\n“The path to a more secure Nigeria lies in more, not less, communication to accompany the concerted efforts of Nigeria’s citizens in fulsome dialogue toward unity, peace and prosperity.\n“As Nigeria’s partners, we stand ready to assist in achieving these goals."
  },
  {
    "headline": "Twitter ban: Nigerians are losing money, says Sanwo-Olu",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu, said the suspension of Twitter by the Federal Government has made Nigerians lose money and a source of income for others.\nSanwo-Olu added that the government can sign ‘rules of engagement’ with the San Francisco-based social media giant on Twitter usage in Nigeria.\nHe said, “People are losing money but there are also security issues.\nSo, in the period of suspension, let us sit down…we need to have that conversation with them (Twitter).\nLagos is hurting, our youths are hurting, Nigeria is hurting, let us understand the issues and put it behind us so that we don’t politicise it.”"
  },
  {
    "headline": "Fleeing Igangan killer herdsmen invade Ogun community",
    "summarized_story": "At least three persons have been reportedly killed in Ogun State by herdsmen believed to be among those who wreaked havoc in Igangan, Oyo State, on Sunday.\nReports have it that the trio were murdered at Amule Kanji village, via Imeko, Imeko/Afon Local Government Area of Ogun State.\nWe need help.”The Balogun raised the alarm that the Igangan killers had relocated to a village called Sagada in Imeko/Afon.\n“Those herdsmen who escaped after killing people in Igangan are now in Ogun State.\nScores of Igangan residents, in the Ibarapa North local government of Oyo State, were gruesomely murdered by suspected herdsmen on Saturday night."
  },
  {
    "headline": "BREAKING: Armed herdsmen invade Benue community, kill over 40 residents",
    "summarized_story": "Armed men suspected to be Fulani herdsmen have again launched a deadly attack in Odugbeho community in Agatu Local Government Area of Benue State, killing over 40 residents.\nDAILY POST gathered that the armed men invaded the community on Sunday night, killing residents and injuring scores.\nHowever, the Senator representing the Benue South Senatorial District, Senator Abah Moro, confirmed the incident in a statement he posted on his official Facebook page.\n“I’m deeply saddened by the attack on Odugbeho community in Agatu LGA on Sunday, which claimed over 40 lives of my constituents.\n“For how long will this carnage continue unabated in Benue South?"
  },
  {
    "headline": "BREAKING: Buhari Summons US, UK Envoys, Others Over Comments On Twitter Ban",
    "summarized_story": "President Muhammadu Buhari-led government has summoned envoys of the United States, United Kingdom, Canada and the European Union in Nigeria over their comments on the suspension of the operation of Twitter in the country.\nThe invitation has contained a statement released by Kimiebi Ebienfa of the Crisis Monitoring and Public Communications Division of the Nigerian Ministry of Foreign Affairs.\nThanks for your usual cooperation.”Recall that Canada, EU, UK, US, and the Republic of Ireland in a joint statement said banning systems of expression is not the way forward.\nThe statement was titled, ‘Joint Statement From The Diplomatic Missions Of Canada, The European Union (Delegation To Nigeria), The Republic Of Ireland, The United Kingdom And The United States Of America’.\n“As Nigeria’s partners, we stand ready to assist in achieving these goals.”"
  },
  {
    "headline": "BREAKING: NBC Orders TV, Radio Stations To Delete Twitter Accounts",
    "summarized_story": "Following the Federal Government’s decision to prohibit the microblogging app, the National Broadcasting Commission (NBC) has ordered all broadcast stations in the country to delete their Twitter accounts.\nEkanem Antia, the NBC Assistant Director of Public Affairs, made the announcement in an email to NEWS DIRECT on Monday in Abuja.\nMore details later…"
  },
  {
    "headline": "BREAKING: NBC Threatens To Punish TV, Radio Stations Using Twitter",
    "summarized_story": "Prof. Armstrong Idachaba, Acting Director-General of the National Broadcasting CommissionThe National Broadcasting Commission has ordered that all broadcast stations in the country terminate Twitter’s patronage immediately.\nThe Commission ordered broadcast stations to “de-install Twitter handles and refrain from utilizing Twitter as a source (UGC) of information collection for news and program presentation, particularly phone-in,” according to the Commission.\n“In Compliance to the above directive, Broadcasting Stations are hereby advised to de-install Twitter handles and desist from using Twitter as a source (UGC) of information gathering for News and programmes Presentation especially phone-in.\n“Section 2(1) r of the NBC Act entrusts the Commission with responsibility to ensure strict adherence to the national laws, rules and regulations.\n“Note that it will be unpatriotic for any broadcaster in Nigeria to continue to patronise the suspended Twitter as a source of its information therefore strict compliance is enjoined.”"
  },
  {
    "headline": "Breaking – Twitter ban comment: FG invites US, UK, EU, Canada Envoys",
    "summarized_story": "Barely 48 hours after criticising the federal government for banning Twitter, the envoys of the United States, United Kingdom, Canada and the European Union in Nigeria have been summoned.\n“The venue is Minister’s Conference Room, 8th Floor.\n“You are hereby invited to cover the meeting.\nThanks for your usual cooperation,” the invite read.\nOn Saturday, Canada, EU, UK, US, and the Republic of Ireland condemned ban on Twitter in Nigeria."
  },
  {
    "headline": "Amidst tension, security operatives kill 11 gunmen in Delta, Imo",
    "summarized_story": "And in yet another attack in Delta state, a police station was set ablaze with police killing six suspected kidnappers in a fierce gun duel.\nFive of the hoodlums were killed in action (KIA) including Joseph Uka Nnachi alias King of Dragons.\nDeltaMeanwhile, the Delta state Police command Sunday killed six suspected armed robbers and kidnappers terrorising the state.\nUnprovoked attacks on the police will not deter the police from providing the needed security in any community in Delta state,” the statement said.\nThe PPRO also said: “On 5/6/21 at about 2130hours, the men of Delta state command while on stop and search duty along Patani-Bayelsa road intercepted a sienna bus with Reg."
  },
  {
    "headline": "Senate probes Maritime Academy over ‘N1.05bn fraud’",
    "summarized_story": "The Senate, through its Committee on Public Accounts, has commenced investigation into alleged diversion and irregular withdrawal of N1.05 billion from United Bank of Africa by the Maritime Academy.\nHe told the Senator Mathew Urhoghide-led committee that the alleged diversion and withdrawals were made before he assumed office.\nI want an Ad-hoc Committee to be set up and get to the root of the matter,” he said.\nThe queryIn the query, the “Audit observed that the sum of N457 million released to the Academy on 13th December, 2012 was irregularly diverted to UBA account number; 1006476693.\nWas management as at the time of this report Risk Diversion of public fund for purposes other than intended?”"
  },
  {
    "headline": "AuGF seeks independent, protection of audited entity from external influence -NigPilot",
    "summarized_story": "Auditor-General for the Federation AuGF Aghughu Adolphus, has reiterated that the United Nations General Assembly’s resolutions of 2011 and 2014 recognized the fact that the Supreme Audit Institutions can accomplish their tasks objectively and effectively only if they are independent of the audited entity and are protected against outside influence.\nHe made this known during a presentation at the National Public hearing of the Senate Committee on the review of the Constitution of the Federal Republic of 1999 (as amended).\nHe emphasized that strengthening the Supreme Audit Institutions will enable them to promote their public mandate with efficiency, effectiveness, transparency and accountability.\nThe AuGF went ahead to call amendments that will strengthen the Audit Institutions both at the Federal and state levels administratively and financially in terms of independence.\nHe also mentioned that the national public hearing provided another opportunity for citizens to be actively involved by contributing to decisions that will undoubtedly have impacts on their lives."
  },
  {
    "headline": "AuGF seeks independent, protection of audited entity from external influence -NigPilot",
    "summarized_story": "Auditor-General for the Federation AuGF Aghughu Adolphus, has reiterated that the United Nations General Assembly’s resolutions of 2011 and 2014 recognized the fact that the Supreme Audit Institutions can accomplish their tasks objectively and effectively only if they are independent of the audited entity and are protected against outside influence.\nHe made this known during a presentation at the National Public hearing of the Senate Committee on the review of the Constitution of the Federal Republic of 1999 (as amended).\nHe emphasized that strengthening the Supreme Audit Institutions will enable them to promote their public mandate with efficiency, effectiveness, transparency and accountability.\nThe AuGF went ahead to call amendments that will strengthen the Audit Institutions both at the Federal and state levels administratively and financially in terms of independence.\nHe also mentioned that the national public hearing provided another opportunity for citizens to be actively involved by contributing to decisions that will undoubtedly have impacts on their lives."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Twitter Ban: FG Meets Envoys Of Top Diplomatic Missions",
    "summarized_story": "Federal Government is in a closed-door meeting with some of the top envoys of various Diplomatic Missions in Nigeria.\nEnvoys present at the meeting include those of Canada, the United States, the European Union, the United Kingdom, and the Republic of Ireland.\nThis meeting is occasioned by the recent Twitter ban and the envoys’ reactions to the indefinite suspension of the microblogging platform.\nThe diplomatic missions had on Saturday said they were let down by the decision to suspend Twitter operations in Nigeria.\nAs Nigeria’s partners, we stand ready to assist in achieving these goals.”Bad for BusinessEarlier the United States had chided the Nigerian government’s over its decision."
  },
  {
    "headline": "FG Holds Town Hall Meeting On Protection Of Public Infrastructure",
    "summarized_story": "A town hall meeting on the protection of public infrastructure is currently holding in Abuja, the nation’s capital.\nThe Ministry of Information and Culture had earlier launched the town hall meeting series in Lagos on April 25th, 2016.\nThey include Otedola bridge, Kara bridge, Tamburawa bridge, Obalande bridge among others which according to him costs the government over N4billion to repair.\nMinister of Transportation, Rotimi Amaechi said foreigners also support the destruction of rail lines in Nigeria.\nHe explained how a Chinese was caught in Jos, the Plateau State capital vandalising rail lines alongside some Nigerians."
  },
  {
    "headline": "NBC Directs All Broadcasting Stations In Nigeria To Suspend Twitter Usage",
    "summarized_story": "The National Broadcasting Commission (NBC) has directed all broadcasting stations to suspend the use of the microblogging service provider, Twitter.\nCiting the persistent use of Twitter for activities that are capable of undermining Nigeria’s corporate existence, the government suspended Twitter operations indefinitely.\nIn line with this, NBC directed all broadcasting stations not to patronize the social networking service.\nIt further advised all stations to uninstall Twitter and desist from using the platform as a source of information.\nBelow is a copy of the NBC communique obtained by Channels Television."
  },
  {
    "headline": "PDP Caucus Threatens Legal Action Against FG Over Twitter Ban",
    "summarized_story": "The Peoples Democratic Party (PDP) caucus in the House of Representatives has threatened legal action against the Federal Government over its ban of Twitter operations in Nigeria.\nA statement by the leader of the caucus Kingsley Chinda on Sunday noted that the Nigerian government does not have the power to ban the social media platform, arguing that the action lowers the country’s image in the eyes of other democratic nations.\nREAD ALSO: Twitter Ban: There Is No Constitutional Authority To Support FG’s Peremptory Action – NBAThe caucus faulted the directive to the National Broadcasting Commission to license social media operators in the country, describing it as an attempt to introduce the ‘Social Media Bill’ by mere executive fiat.\nAccording to them, the move is a violation of the doctrine of separation of powers and an erosion of the rule of law.\n“Whilst, these manifestly undemocratic actions of government on its own is grave enough, we fear that it may be a precursor to more ominous actions of blotting out dissenting voices,” the lawmakers explained."
  },
  {
    "headline": "105 Medical Doctors Resign In Ondo",
    "summarized_story": "At least 105 Medical Doctors have resigned in Ondo State in the past year.\nThis was disclosed by the Nigerian Medical Association (NMA) in the state on Monday.\nREAD ALSO: NBC Directs All Broadcasting Stations In Nigeria To Suspend Twitter Usage“We have it on good records that about 105 medical doctors have resigned their employment from the Teaching Hospital in the last year alone.\n“Ondo State has not been able to engage requisite numbers of House Officers since 2019.\nThe doctors in a statement issued at the weekend said they received their February salary in June."
  },
  {
    "headline": "Naira crashes to N502 after CBN devaluation",
    "summarized_story": "The Naira has crashed at the parallel market to N502 per dollar after the Central Bank of Nigeria adopted the Nigeria Autonomous Foreign Exchange ( NAFEX) rate.\nThe CBN devalued the naira from the official rate of N379 to N410, which is close to the Investors’ & Exporters’ (NAFEX) Windows rate, where investors and exporters trade.\nThe naira has been devalued four times since the outbreak of the Covid-19 pandemic, including the most recent devaluation in 2021.\nAdvertisementThe bank had devalued the naira from N305 per dollar to N360/ dollar and N379 per dollar.\nThe CBN said the country had a foreign exchange backlog of over $2bn with a lot of foreign portfolio investors trapped in the Nigerian economy."
  },
  {
    "headline": "NSCDC Women Special Security Squad undergoes training",
    "summarized_story": "The Nigerian Civil Defence Corps has unveiled a new tactical all women security outfit, to help tackle rising insecurity in the country.\nThe squad is currently undergoing training and will be deployed to different locations in the country, especially the federal capital territory.\nThe squad is patterned after the Nigerian army women that now patrols the Abuja-Kaduna highway."
  },
  {
    "headline": "Atiku preoccupied with helping to find solutions to Nigeria’s challenges",
    "summarized_story": "The media office of former Vice President, Atiku Abubakar, has denied knowledge of the 2023 Presidential aspiration posters of him and former CBN governor, Charles Soludo, that has surfaced in parts of the Federal Capital Territory.\nIt added that It is obvious that this is a work of mischief pointing out that the former Vice President, Atiku Abubakar is a PDP member while Charles Soludo is of APGA.\nIt said it is silly of anyone to attempt to drag the former Vice President into an election in Anambra which outcome will be determined by the people of the state.\nAtiku Abubakar is currently preoccupied with joining hands with other well-meaning Nigerians to help in finding solutions to the myriad of challenges plaguing the nation such as insecurity and economic downturn marked by joblessness and extreme poverty.\nWe wish to restate that the purported 2023 campaign posters in circulation linking Atiku to Soludo is the handiwork of mischief makers and should be ignored."
  },
  {
    "headline": "Twitter Ban: Nigerian Government Could Have Handled Dispute Better, Lagos Governor Sanwo-Olu Says",
    "summarized_story": "The Nigerian government could have handled the dispute it has with the microblogging platform, Twitter a lot better considering the number of e-commerce and youths who earn a living through the social media site, Lagos state governor Babajide Sanwo-Olu has said.\nIn a veiled manner, the governor queried Twitter’s decision to invest in Ghana that has about five million users and sidelined Nigeria with 40 million users.\nHe suggested that the present disagreement would have been tackled differently if the microblogging platform had an office in that acclaimed giant of Africa.\nSanwo-Olu spoke with ARISE News on Monday and noted that in the period that Twitter has been suspended, both parties should sit and have a conversation about having the issue resolved.\nWatch this insightful video…"
  },
  {
    "headline": "BREAKING: Nigeria Orders Broadcast Stations to Deactivate Twitter Handles Immediately",
    "summarized_story": "The National Broadcasting Commission (NBC) has ordered broadcasting stations in Nigeria to suspend the patronage of Twitter immediately.\nActing director-general of the NBC, Armstrong Idachaba gave the directive in a statement on Monday and comes three days after the Nigerian government suspended Twitter operations in the country.\nThe Commission directed all broadcast stations to de-install their Twitter handles and desist from using them as a source of information gathering for news and programmes presentation, especially phone-in.\n“Consequent on the suspension of Twitter operations in Nigeria by the Federal Government over the persistent use of the platform for activities that are capable of undermining the corporate existence of Nigeria, the National Broadcasting Commission directs all broadcasting stations in Nigeria to suspend the patronage of Twitter immediately,” Mr Idachaba said in the statement.\n“In compliance to the above directive, Broadcasting stations are hereby advised to de-install Twitter handles and desist from using Twitter as a source (UGC) of information gathering for News and programmes presentation especially phone-in."
  },
  {
    "headline": "‘It’s Time for State Policing’: Lagos Governor Sanwo-olu on Insecurity, Twitter Ban and Two Years of Stewardship",
    "summarized_story": "A week ago, Governor Babajide Sanwo-Olu of Lagos State marked his second year in office.\nIn those two years, the governor has been confronted with a mixed bag of issues, especially having to deal with a debilitating pandemic, which threatened to derail his agenda.\nThe challenges notwithstanding, a lot more is expected of Sanwo-Olu as he embarks on the second half of his first term in office.\nThe Lagos governor was on ARISE NEWS’ Morning Show to touch on these issues and many more of national importance, from insecurity to the recent ban on Twitter by the federal government.\nWatch this engaging interview for more.."
  },
  {
    "headline": "Boko Haram Leader Abubakar Shekau ‘Dead’, Claims Rival ISWAP",
    "summarized_story": "Abubakar Shekau, the leader of Nigeria’s terrorist group Boko Haram killed himself in a fight against rival jihadist fighters, AFP is reporting.\nBoko Haram has not yet officially commented on the death of their leader while the Nigerian army said it was investigating the claim.\nHe killed himself instantly by detonating an explosive,” said a voice resembling that of ISWAP leader Abu Musab Al-Barnawi, speaking in the Kanuri language.\nAfter finding him in the bush, ISWAP fighters urged him and his followers to repent, the voice added, but Shekau refused and killed himself.\nBut ISWAP may also struggle to control or persuade Boko Haram factions loyal to Shekau outside Sambisa, especially in border areas."
  },
  {
    "headline": "Turkish Mafia Boss Dishes Dirt, Becomes YouTube Phenomenon",
    "summarized_story": "They have also exposed alleged rifts between rival factions within the ruling party and added to Erdogan’s troubles as he battles an economic downturn and the coronavirus pandemic.\n“I’ve added (Peker’s videos) to the category of TV series I watch every week,” Gulistan Atas said.\nPeker justifies the tell-all by saying Soylu betrayed him despite the crime leader’s help to defeat a rival faction within the ruling party.\nErdogan ignored the Peker videos for weeks, but broke his silence on May 26, when he dismissed earlier allegations by the mafia leader as a conspiracy against Turkey.\nAfter his last release from prison in 2014, he held rallies to support Erdogan’s party and leveled threats against his opponents."
  }
]