[
  {
    "headline": "WHO re-elects Ghebreyesus as DG for second term",
    "summarized_story": "Member States of the World Health Organisation have re-elected Dr. Tedros Ghebreyesus to serve a second five-year term as the organisation’s Director-General.\nAccording to a news release posted on its official website on Tuesday, the organisation’s governing body affirmed Ghebryesus’ re-appointment as the head of the organisation, during its ongoing 75th World Health Assembly held in Geneva, Switzerland.\nIn his remark after to his re-election, Ghebreyesus said, “I am humbled by the opportunity provided by the member states to serve a second term as WHO Director-General.\nIt also said his new mandate would officially commence on August 16, 2022, and end in 2027, as ‘’a Director-General can be re-appointed once, in accordance with World Health Assembly rules and procedures’’.\n‘’Before first being appointed WHO Director-General, Dr Tedros served as Minister of Foreign Affairs, Ethiopia from 2012–2016 and as Minister of Health, Ethiopia from 2005–2012."
  },
  {
    "headline": "I’ll change nature of Nigeria’s politics, says Hayatu-deen",
    "summarized_story": "A presidential aspirant on the platform of the Peoples Democratic Party, Mohammed Hayatu-Deen, has said career politicians were recycling themselves and running Nigeria aground.\nAccording to a statement on Tuesday, Hayatu-deen, who spoke at an interactive session with the media, however, said his venture into the country’s politics was to change its character.\nHe expressed the optimism that he can clinch the PDP presidential ticket while citing examples of people who rose to leadership positions without holding any political position in the past.\n“Career politicians are recycling themselves and running the country into the ground.\n“My aim is to change the character and complexion of our politics."
  },
  {
    "headline": "Residents jittery over approval for 2nd container terminal at Kirikiri Canal",
    "summarized_story": "Vanguard gathered that the new terminal, Terminal and Cargo Limited, TCL, has commenced construction work after acquiring property around the area for about N200 million.\nVanguard gathered that officials of the NPA, NCS, and NIWA mostly from their headquarters are already in Lagos for Environmental Impact Assessment, EIA, ahead of the final approval.\nWhile the broken down trucks are being fixed right there on the road, the others are parked there awaiting businesses.\nBomodi said what the Customs look out for is whether there is a motorable road to the facility and if the necessary cargo handling equipment are available.\nHe said it is the duty of the Lagos State government to decide if such a facility can be sited there."
  },
  {
    "headline": "There is no limit in afrobeats — Zillarous",
    "summarized_story": "ZillarousSinfulSaint Entertainment’s protege, Ogberagha Lucky, popularly known as Zillarous, has said there is no limit to the relevance of afro music in the world.\nThe Yola-born artiste said afrobeat has a universal appeal and is being made more popular by top artistes from Africa, especially Nigeria.\nInternational artistes are sampling the beat while seeking collaborations with afrobeat artistes because it has become a universally acceptable sound,” he said.\nThe Love them all singer said he had to do menial jobs in order to overcome his financial challenges.\nHe said his plan in the music industry is to be recognized and remembered for his sound."
  },
  {
    "headline": "ASUU strike: US calls for creative ways to fund Nigerian varsities",
    "summarized_story": "By Ebunoluwa SessouAs the ASUU strike enters its 13th week, U.S educational experts have called on Nigerian universities to look outside the government for the funding of their institutions.\nOne of the U.S. higher education experts, Dr. Patrick Bennett, vice-president of Academic Quality and Planning at Franklin University, Ohio, shared the U.S perspective on higher education partnerships and funding.\nDr. Bennett discussed best practices in exploring potential revenue streams and resources outside of government funding for higher education and how universities can build and maintain productive relationships with alumni, private sector, and other donor institutions.\nThe U.S Mission has a longstanding commitment to supporting educational institutions and strengthening an education system that enables students to access quality education throughout Nigeria.\nThe move by the U.S Consulate-General was to collaborate with Nigerian universities – both public and private – especially as funding to seek foreign education has remained uncertain for Nigerian families."
  },
  {
    "headline": "IOPC Fund harps on progress, worry over non-submission of report by Nigeria",
    "summarized_story": "By Eguono OdjegbaThe National Standing Committee, NSC, on International Oil Pollution Compensation, IOPC, Fund implementation in Nigeria has said Nigeria is upbeat about her plans to submit names of Contributing Oil Receivers to the IOPC Fund, to enable the organization have the right data to work with.\nJeddah expressed satisfaction about the immense work done by the Sub-Committees, including Nigeria’s commitment towards effective implementation of the IOPC Funds.\nShe noted that as a member of the IOPC Fund, Nigeria cannot afford to be unconcerned about the international convention which she said has been domesticated by Nigeria.\nShe stated: “Nigeria is a party to the International Convention for Civil Liability for Oil Pollution Damage 1992 and the International Convention on the Establishment of an International Fund for Compensation for Oil Pollution Damage 1992.\nAlso speaking, Chairperson, Sub Committee on Pricing Index, Mrs. Oma Ofodile, expressed the belief that sensitisation of oil receiving organisations would culminate in mass registration and contribution towards the IOPC Fund."
  },
  {
    "headline": "APM Terminals Apapa provides level playing field for genders — Onyia",
    "summarized_story": "As a female employee at APM Terminals, I am happy to note that my opinions are respected.\nIf you have a good and informed idea, which would have a positive impact, APM Terminals definitely looks into it.\nNot everybody from the opposite gender has come to accept the female gender in this traditionally male-dominated field.\nWhat progress have you witnessed in APM Terminals in terms of the continuous strive for a diverse and more inclusive environment?\nIt has been equal opportunities, equal progression, equal rights, equal playing field."
  },
  {
    "headline": "Ogun: Abiodun commissions Pansheke-Adigbe-Opako road in Abeokuta metropolis",
    "summarized_story": "Governor Dapo Abiodun of Ogun State, on Tuesday, officially inaugurated the 3km Panseke-Adigbe-Opako Road within the Abeokuta metropolis.\nSpeaking at the inauguration ceremony at the popular Panseke Junction, Abiodun described the event as symbolic, as the road was one of the inherited road projects from his predecessor’s administration.\nHe further described the project as fulfilment of his administration’s promise to the people of Ogun state.\nThis is to show that our words are our bond with the people of Ogun State”, the governor noted.\n“In fact, we are still looking forward to how to handle some major roads such as Sagamu/Ogijo/Ikorodu road; Abeokuta/Ifo/Sango/Lagos road and other Federal roads across our major cities."
  },
  {
    "headline": "NCC committed to promoting organisational efficiency, capacity building – Danbatta",
    "summarized_story": "The Nigerian Communications Commission (NCC) has once again reiterated its stance on professionalizing its workforce and strengthening collaborations with strategic partners such as the Nigerian Institute of Management (NIM) in order to enhance operational efficiency.\nThe Executive Vice Chairman (EVC) of NCC Prof. Umar Danbatta, stated this while receiving a delegation led by the Acting Registrar and CEO of NIM, Jude Iheanacho, who paid a courtesy visit to the NCC Head Office recently.\nMalah also said that it was in the Commission’s best interest to deepen its collaboration with NIM, through strategic partnering, so that NCC can improve organisational efficiency and regulatory excellence.\nThe Nigerian Institute of Management (NIM) was established in 1961, though the enabling Act, the Nigerian Institute of Management (Establishment) Act was enacted by the National Assembly on July 19, 2003.\nThe objectives of the institute include the development of good management, professionalizing management, and improving and standardizing management in Nigeria."
  },
  {
    "headline": "2023 presidency: Buhari’s body language favours South – Umahi",
    "summarized_story": "Ebonyi State Governor Dave Umah, says President Muhammadu’s body language favours the emergence of a Southerner as his successor in 2023.\nUmahi told Nigerians not to be apprehensive of an individual from the South-East becoming president.\nThe governor also wants power rotation between the North and South maintained.\nHe appealed to the South-South and the South-West to support the South-East to produce the best President.\n“The North-East and South-East are the two regions that are most marginalized”, Umahi said."
  },
  {
    "headline": "Fatima: Fani-Kayode reacts to killing of pregnant woman, four children in South-East",
    "summarized_story": "A former Aviation Minister, Femi Fani-Kayode, on Tuesday condemned the killing of a pregnant woman identified as Fatima, her four children and six others in Anambra State.\nThe victims, who are of northern extraction, were reportedly killed at Isulo, Orumba North Local Government Area of the state, on Sunday.\nHe also called on the authority to treat those who committed this atrocity as a beast.\nHe tweeted: “The killing of a heavily pregnant northern lady by the name of Fatima together with her 4 children and 6 others in Anambra State by unknown gunmen is shameful & barbaric.\n“Those who committed this atrocity are beasts and they should be treated as such."
  },
  {
    "headline": "2023: Police ban political thuggery, use of weapons during primary elections in Jigawa",
    "summarized_story": "The Nigeria Police force have banned political thuggery and use of any weapon especially during the conduct of the political parties primary elections.\nThis was contained in a statement signed by the police Spokesman, Jigawa State command, ASP Lawan Shiisu Adam issued to DAILY POST.\nAccording to the statement, “Sequel to the forthcoming primary elections in the state, the Commissioner of Police, Jigawa state Police Command CP.\nAliyu Sale Tafida psc, wishes to remind political parties and their followers in the state, that the ban on political thuggery, use of weapons such as; cutlasses, sticks, bow and arrows, guns, machetes, jack knives and other dangerous weapons, during political primaries is still enforced.”He urged political actors to advise their followers to refrain from such and strictly adhere and abide by the rules and regulation governing the electoral processes.\nHe explained that the police will not hesitate to arrest anybody who wishes to use the opportunity to foment trouble and violate the provision of the law as contained in the electoral act and regulations."
  },
  {
    "headline": "17.7m fully vaccinated against COVID-19, says Fed Govt",
    "summarized_story": "The Federal Government yesterday disclosed that over 17.7 million Nigerians are fully vaccinated against COVID-19 pandemic, representing 15.8 per cent of the eligible population.\nIt said as of May 24, 29,651,708 eligible persons have received the 1st dose of the COVID-19 vaccines, which represents 23.4 per cent of the country’s eligible population, while 14,179,966 people have received the second dose.\nIt said 1,178,604 people have received the booster dose of the vaccine.\nThe Executive Director of the National Primary Health Care Development Agency (NPHCDA), Dr. Faisal Shuaib, made this known in Abuja while receiving four million, four hundred thousand (4,400,000) doses of Johnson & Johnson COVID-19 vaccines donated by the Government of Spain.\nThe single-dose regimen of the Johnson & Johnson vaccine will enable us to move rapidly towards achieving herd immunity."
  },
  {
    "headline": "CJ transfers 17 Federal High Court judges",
    "summarized_story": "Seventeen judges of the Federal High Court (FHC) have received new postings.\nThe development follows the recent appointment of six new judges for the court and other “exigencies”.\nThe posting of the six new judges take effect immediately, while that of the other judges take effect from September.\n“The Pre-Election Cases already before such Judges should be concluded before the commencement of the New Legal Year.\nA. Okeke – Ibadan; Justice M. A. Onyetenu – Akure; Justice P. H. Mallong – Jos; Justice B. O. Quadri – Owerri; Justice J. E. Inyang – Asaba; Justice S. A. Amobeda, Kano; Justice T. B. Adegoke – Minna; Justice J. K. Omotosho – Abuja; Justice Emmanuel Gakko – Bayelsa; Justice Musa Sulaiman Liman – Umuahia; Justice M. T. Segun-Bello – Owerri; Justice Bala K. M. Usman – Jalingo; Justice A. G. Mahmud – Sokoto and Justice Garba Aminu – Lokoja."
  },
  {
    "headline": "JAMB remitted N27.2b in five years, says Oloyede",
    "summarized_story": "The Registrar, Joint Admissions and Matriculation Board (JAMB), Prof. Ishaq Oloyede, has said the board remitted N27.2 billion from 2017 to date to the Federal Government’s coffers.\nHe made this known yesterday in Abuja at the opening session of a three-day workshop for public relations officials of the board.\nThe workshop, organised in collaboration with Premium Times Academy, has the theme: “Media, Publicity and Public Relations in the Modern Age”.\nOloyede said N7.8 billion, N5.2 billion, N3.76 billion, N4 billion, N3.5 billion and N3 billion were remitted in 2017, 2018, 2019, 2020, 2021 and 2022.\nThe JAMB registrar said the board had taken another major step to put an end to use of fake ‘A’ Level certificates to secure admission."
  },
  {
    "headline": "Fed Govt to spend N999m on pupils",
    "summarized_story": "Federal Government yesterday said N999 million would be spent daily to feed approximately 10 million pupils in the National Home Grown School Feeding Programme (NHGSFP) across the country.\nShe said the Minister of Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiya Umar Farouq, got the approval of spending N100 per person daily on feeding in the programme.\nShe said 9, 990, 862 pupils from primary one to three in the programme “will now be fed with N100 daily for 20 days in a month, which will amount to N999,086,200 million daily.\n“Prior to this, we were feeding school children with N70 per child, per meal.\nThat was since 2016, but the President has approved N100 upward review.”"
  },
  {
    "headline": "BREAKING: EFCC arrests Okorocha after nine-hour siege",
    "summarized_story": "After close to one hour of sporadic shooting, operatives of the Economic and Financial Crimes Commission (EFCC) have finally whisked former Imo Governor Senator Rochas Okorocha away.\nThey broke into his Maitama, Abuja residence after laying siege to it for nine hours.\nThe operatives gained entrance into Okorocha’s sitting room after dispersing his supporters, who were chanting solidarity songs to protest the siege.\nBriefing journalists before he was arrested, Okorocha described the siege at his residence as an ugly development that does not portray those those involved in good light.\nThe EFCC however said in a statement that Okorocha was needed to explain his roles in ongoing investigations, alleging he jumped administrative bail."
  },
  {
    "headline": "EFCC rearrests Okorocha, vows to prosecute him",
    "summarized_story": "From Fred Itua, AbujaAfter 10 hours of stand-off, operatives of the Economic and Financial Crimes Commission (EFCC), yesterday, arrested a former governor of Imo State, Rochas Okorocha.\nA source from the anti-graft agency, who confirmed Okorocha’s arrest, yesterday, simply said, “After nearly 10hours standoff, EFCC arrests Senator Okorocha.”Are you a Man 40 yrs and above?\nUwujaren said the former Imo governor jumped bail and has refused to keep his side of the deal of his bail conditions.\n“EFCC had, on January 24, 2022, filed a 17-count criminal charge bordering on diversion of public funds and properties to the tune of N2.9 billion against Okorocha.\n“The case was assigned to Honourable Justice Inyang Ekwo of the Federal High Court, Abuja, but attempts to arraign Senator Okorocha were twice stalled, owing to the absence of the ex-governor who evaded service of processes."
  },
  {
    "headline": "Enugu guber: Ekweremadu may join APC, opens discussion with party stakeholders – The Sun Nigeria",
    "summarized_story": "Former deputy Senate president and governorship aspirant in Enugu State, Dr. Ike Ekweremadu, has opened discussion with top shots of the APC which may lead to his joining the party.\nWhile chieftains of PDP said the governorship position would go to Enugu East in line with subsisting zoning, Ekweremadu said there was nothing like that.\nIt is believed that should he lose the governorship ticket of PDP, he and his supporters may join the APC to actualise their ambition.\nSources revealed that Ekweremadu is negotiating to get assurances that the APC governorship ticket would be given to him should he dump PDP.\nHe started his political career when he was elected chairman of Aniri Local Government Area of Enugu State on the platform of United Nigerian Congress Party (UNCP) in 1997."
  },
  {
    "headline": "JAMB remitted N27.2bn to FG coffers from 2017 to date –Oloyede",
    "summarized_story": "Registrar, Joint Admissions and Matriculation Board (JAMB), Prof. Ishaq Oloyedehas said the board remitted N27.2 billion from 2017 to date to the Federal Government’s coffers.\nOloyede disclosed this in Abuja, yesterday, at the opening session of a three-day workshop for public relations staff of the board.\nThe workshop, organised in collaboration with Premium Times Academy, had the theme: “Media, Publicity and Public Relations in the Modern Age”.\nGiving a breakdown of remittances, Oloyede said N7.8 billion, N5.2 billion, N3.76 billion, N4 billion, N3.5 billion and N3 billion were remitted in 2017, 2018, 2019, 2020, 2021 and 2022 respectively.\nThe workshop was attended by JAMB’s public relations staff from across the country and several resource persons."
  },
  {
    "headline": "ASUU, polytechnic lecturers, others to get N34bn minimum wage adjustment arrears –FG",
    "summarized_story": "Ngige made the disclosure while responding to questions from newsmen at the third national productivity summit in Abuja, yesterday.\nHe said beneficiaries of the Minimum Wage Consequential Adjustments included the members of the striking ASUU and their counterparts in the polytechnics and Colleges of Education.\nAccording to Ngige, the universities will get N23.5 billion, the polytechnics N6 billion and the Colleges of Education N4 billion, bringing the total sum to N33.5 billion.\n“Also the University Transparency Accountability Solution (UTAS) of ASUU and the Universities Peculiar Personnel Payroll System (UPPPS) of the non-teaching staff.\n“So, the committee of Prof. Briggs is on it, discussing with the university unions and their employer, the Federal Ministry of Education."
  },
  {
    "headline": "Okigwe leaders endorse Ohakim for APC senatorial ticket",
    "summarized_story": "From Ndubuisi Orji, AbujaLeaders of Okigwe senatorial zone, in Imo State under the aegis of Okigwe Unity Forum have charged the people of the zone to support the senatorial aspiration of former Imo State governor, Ikedi Ohakim.\nThey said Ohakim, if elected, would be of immense benefit to the zone, Imo State and the entire Igbo nation.\n“It’s noteworthy that the highest nationally relevant office common to Ndi Okigwe zone today is the office of the Senate of the Federal Republic of Nigeria.\nWe know the value content of an Ohakim being in the Senate for Ndi Okigwe, Imo and indeed the South East at this point in time.\nThe forum, while appealing to Governor Hope Uzodimma to support Ohakim to emerge as the APC senatorial candidate for Okigwe zone, implored leaders of the zone to shun “pull-him-down” syndrome in the overall interest of the people."
  },
  {
    "headline": "Breaking: CBN Raises Interest Rate to 13%",
    "summarized_story": "James EmejoThe Central Bank of Nigeria (CBN) Tuesday resolved to raise the Monetary Policy Rate (MPR), otherwise known as the interest rate by 150 basis points to 13 per cent from 11.5 per cent.\nThis is the first time the apex bank has raised MPR in two and a half years.\nCBN Governor, Mr. Godwin Emefiele, at the end of the two-day meeting of the Monetary Policy Committee (MPC), said the move was in response to the global inflationary pressures.\nDetails later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Despite Global Headwinds, NSIA Grows Net Asset to N920bn in 2021",
    "summarized_story": "According to him, it posted core income of N100.8 billion in 2021, down eight per cent compared to N109.6 billion in 2020.\nThe core income excluded forex gains of N45.8 billion in 2021 and N51.2 billion in 2020.\nHe said: “Reactions to the raging global inflation may lead to recessions in certain economies as central banks have announced varying measures of rate hikes and halt to balance sheet expansion.\nThe World Bank, CBN, and Fitch have projected the Nigerian economy will grow by 2.5 per cent, 3.1 per cent, and 2.8 per cent respectively.\nAlso, this issue of rising interest rates as we curtail inflation I think will continue to affect, emerging market debt, particularly the Eurobonds."
  },
  {
    "headline": "It’s a Four Horse Race",
    "summarized_story": "But with the governor recently openly declaring support for Wike, votes here would be shared between the Rivers State governor and Obi, although Wike stands a better chance with Ikpeazu.\nSo Ogun will be shared between Saraki, Atiku and WikeOndo StateOndo is giving a sizeable number of its votes to Saraki.\nSokoto is, however, marked a waste of votes as Tambuwal is believed not to stand any chance in the race.\nAtiku mainly with some votes to othersYobe StateYobe State is waiting to share its votes between Atiku and Hayatu-Deen.\nIt’s a four horse race given, however given that Hayatu-Deen is new in the race, he may not make much impact."
  },
  {
    "headline": "Adamu: Ekiti My First Test, I Will Not Fail to Deliver",
    "summarized_story": "Adamu stated this yesterday in Abuja at the inauguration of the Ekiti State Gubernatorial Campaign Council.\nAdamu stated, “With this inauguration today, we are giving a marching order to the campaign council and our great people of Ekiti State on the platform of our great party, the APC.\n“Ekiti is the first election that we will be having in this dispensation of APC.\nSo we are on a bond like him to see that he has soft landing and that is to deliver this party to victory and Ekiti State is the first test.\nArgungu said, “Our confidence is further reinforced by the legacy of service and delivery of quality projects the outgoing governor of Ekiti State has imprinted on the process and environment of governance in the state."
  },
  {
    "headline": "Buhari Meets Families of Kano Explosion Victims, Describes Incident as Sad, Unfortunate",
    "summarized_story": "* Says he was extremely pained by casualty recordedDeji ElumoyePresident Muhammadu Buhari Monday commiserared with the families of victims of the recent explosion in Kano and expressed his condolences and that of the nation, describing the incident as sad and unfortunate.\nI hope the injured will recover fully at the earliest possible time.”President Buhari drew parallels between Kano and his native Daura and described the palace of the emir as his own home.\nHe commended the traditional institution and the people of Kano for standing with him at all times.\nIn his speech, the emir thanked the president for the condolences and commended him for providing a fair and just leadership.\nOn his part, Governor Abdullahi Ganduje announced cash support in various sums for the families of the deceased, the injured and others whose property were partly damaged or destroyed."
  },
  {
    "headline": "Buhari Government To Spend N999million Daily On School Feeding Programme",
    "summarized_story": "President Muhammadu Buhari’s government has disclosed that it will spend N999 million daily to feed approximately 10 million pupils in the National Home Grown School Feeding Programme (NHGSFP) across the country.\n“Prior to this, we were feeding school children with N70 per child, per meal.\n“We are planning on having ‘Egg Wednesday’, where each child in the programme will be given one egg every Wednesday.\nMeanwhile, Umar Bindir, the National Resource Person of the National Social Investment Programme, said that the programme was not the responsibility of the federal government alone.\nMeanwhile, there have been allegations of massive corruption in the programme, allegations that the organisers have vehemently denied."
  },
  {
    "headline": "Buhari Government To Spend N999million Daily On School Feeding Programme",
    "summarized_story": "President Muhammadu Buhari’s government has disclosed that it will spend N999 million daily to feed approximately 10 million pupils in the National Home Grown School Feeding Programme (NHGSFP) across the country.\n“Prior to this, we were feeding school children with N70 per child, per meal.\n“We are planning on having ‘Egg Wednesday’, where each child in the programme will be given one egg every Wednesday.\nMeanwhile, Umar Bindir, the National Resource Person of the National Social Investment Programme, said that the programme was not the responsibility of the federal government alone.\nMeanwhile, there have been allegations of massive corruption in the programme, allegations that the organisers have vehemently denied."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Attorney-General Malami Writes Emefiele, Asks Central Bank Gov To Release $418m To Ned Nwoko, 5 Other Controversial Paris Club Consultants",
    "summarized_story": "GVD/GOV/CON/DGC/210/071 and addressed to Malami said the apex bank was willing to pay millions of dollars to the creditors.\nOne of the beneficiaries is Dr Ted Iseghohi Edwards, who was indicted by the Economic and Financial Crimes Commission (EFCC).\nDocuments seen by SaharaReporters showed that Edwards did not represent the Association of Local Governments of Nigeria (ALGON) as claimed.\nThey also directed the DMO and the Ministry of Finance to release the promissory notes to Edwards and others so that they could take their shares, a source had said.\n“Yet, Malami who knows this is recommending that Ted Edwards be paid $159,000,000 as fees from ALGON instead of the actual lawyer."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Attorney-General Malami Writes Emefiele, Asks Central Bank Gov To Release $418m To Ned Nwoko, 5 Other Controversial Paris Club Consultants",
    "summarized_story": "GVD/GOV/CON/DGC/210/071 and addressed to Malami said the apex bank was willing to pay millions of dollars to the creditors.\nOne of the beneficiaries is Dr Ted Iseghohi Edwards, who was indicted by the Economic and Financial Crimes Commission (EFCC).\nDocuments seen by SaharaReporters showed that Edwards did not represent the Association of Local Governments of Nigeria (ALGON) as claimed.\nThey also directed the DMO and the Ministry of Finance to release the promissory notes to Edwards and others so that they could take their shares, a source had said.\n“Yet, Malami who knows this is recommending that Ted Edwards be paid $159,000,000 as fees from ALGON instead of the actual lawyer."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Attorney-General Malami Writes Emefiele, Asks Central Bank Gov To Release $418m To Ned Nwoko, 5 Other Controversial Paris Club Consultants",
    "summarized_story": "GVD/GOV/CON/DGC/210/071 and addressed to Malami said the apex bank was willing to pay millions of dollars to the creditors.\nOne of the beneficiaries is Dr Ted Iseghohi Edwards, who was indicted by the Economic and Financial Crimes Commission (EFCC).\nDocuments seen by SaharaReporters showed that Edwards did not represent the Association of Local Governments of Nigeria (ALGON) as claimed.\nThey also directed the DMO and the Ministry of Finance to release the promissory notes to Edwards and others so that they could take their shares, a source had said.\n“Yet, Malami who knows this is recommending that Ted Edwards be paid $159,000,000 as fees from ALGON instead of the actual lawyer."
  },
  {
    "headline": "FAKE NEWS ALERT: No plane crash in Lagos, says FAAN",
    "summarized_story": "The Federal Airports Authority of Nigeria (FAAN) has denied reports making the rounds that a plane crashed at Ikeja area of Lagos state.\nSeveral reports surfaced on Tuesday that a plane crash-landed in Ikeja, and the incident was said to have caused heavy traffic in the area.\nHowever, in a statement issued on Tuesday night, the agency said while an aircraft was spotted in the area, it was being transported to a different location, and wasn’t the result of a crash.\n“The Federal Airports Authority of Nigeria would like to inform the general public to disregard the news making the rounds on social media about an alleged crash at Ikeja Airport,” the statement reads.\nAdvertisement“The aircraft was sold by the owner to a buyer, who was taking it to its final destination.”"
  },
  {
    "headline": "FAKE NEWS ALERT: No plane crash in Lagos, says FAAN",
    "summarized_story": "The Federal Airports Authority of Nigeria (FAAN) has denied reports making the rounds that a plane crashed at Ikeja area of Lagos state.\nSeveral reports surfaced on Tuesday that a plane crash-landed in Ikeja, and the incident was said to have caused heavy traffic in the area.\nHowever, in a statement issued on Tuesday night, the agency said while an aircraft was spotted in the area, it was being transported to a different location, and wasn’t the result of a crash.\n“The Federal Airports Authority of Nigeria would like to inform the general public to disregard the news making the rounds on social media about an alleged crash at Ikeja Airport,” the statement reads.\nAdvertisement“The aircraft was sold by the owner to a buyer, who was taking it to its final destination.”"
  },
  {
    "headline": "PHOTOS: Pastor presents house, car to family of Deborah, student killed over alleged blasphemy",
    "summarized_story": "Chibuzor Chinyere, general overseer of Omega Power Ministry (OPM), has presented a house and car to the family of Deborah Emmanuel, a female student recently murdered over alleged blasphemy.\nDeborah, a student of Shehu Shagari College of Education in Sokoto, was beaten with sticks and stoned before she was set ablaze in the school premises on May 12.\nThe OPM general overseer made the presentation of the house and car on Tuesday, when he met with Deborah’s family in Port Harcourt, the Rivers capital.\nAdvertisementThe family members were flown in from Niger state to Rivers.\nAccording to OPM, the funds for the house and the car — for “Uber business” — were from the “tithes and offerings” of church members."
  },
  {
    "headline": "PHOTOS: Pastor presents house, car to family of Deborah, student killed over alleged blasphemy",
    "summarized_story": "Chibuzor Chinyere, general overseer of Omega Power Ministry (OPM), has presented a house and car to the family of Deborah Emmanuel, a female student recently murdered over alleged blasphemy.\nDeborah, a student of Shehu Shagari College of Education in Sokoto, was beaten with sticks and stoned before she was set ablaze in the school premises on May 12.\nThe OPM general overseer made the presentation of the house and car on Tuesday, when he met with Deborah’s family in Port Harcourt, the Rivers capital.\nAdvertisementThe family members were flown in from Niger state to Rivers.\nAccording to OPM, the funds for the house and the car — for “Uber business” — were from the “tithes and offerings” of church members."
  },
  {
    "headline": "EXCLUSIVE: Petrol subsidy gulps N271bn in April as NNPC declares ZERO remittance for the 4th time",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Limited has deducted another N271.13 billion as a shortfall for the importation of petrol (subsidy) in April 2022.\nSubsidy or under-recovery is the underpriced sales of premium motor spirit (PMS), better known as petrol.\nSo far, NNPC has spent N947.53 billion on petrol subsidy this year — more than half of 2021 subsidy spending.\nNNPC said this in its monthly presentation to the Federation Account Allocation Committee (FAAC) meeting on Tuesday, April 24.\nNNPC also said it would deduct N371 billion for the shortfall in May 2022 during next month’s FAAC meeting."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Can proptech solve Nigeria’s urbanisation crisis?",
    "summarized_story": "At the current growth rate of about 2.8%–3% a year, Nigeria’s urban population is expected to double in the next 2 decades.\nUrbanisation, especially one as rapid as Nigeria’s, comes with challenges, most notably the insufficiency of basic infrastructures.\nWith Nigeria’s proptech industry raising $2 million in investments in 2021 alone, TechCabal sought to answer these questions in a Live session.\n“At the beginning, it was a herculean task to get landlords to agree to collect monthly rent,” Olaghere explains.\nIn closing, Olaghere reiterates the importance of collaboration between the government, the proptech sector, and more importantly, the end users."
  },
  {
    "headline": "Nigeria to generate over ₦90 billion annually from new phone call tax",
    "summarized_story": "The Nigerian government has created a new tax on phone calls in the bid to fund free healthcare for Nigerian citizens who cannot afford healthcare—the vulnerable group.\nThe law defines the “vulnerable group” in society as “Children under five, pregnant women, aged, physically and mentally challenged persons, and indigent people as may be defined from time to time”.\nThe law also requires that all persons resident in Nigeria are expected to obtain health insurance.\nNigerians made 150.83 billion minutes of calls in 2020 according to a report by the Nigerian Communications Commission.\nThis translates to 9.05 trillion seconds of calls, meaning the new tax will generate at least 9.05 trillion Kobo, which converts to ₦90.49 billion ($18.09 million), annually."
  },
  {
    "headline": "Cryptocurrency company, Bitnob signs sponsorship deal with the NPFL",
    "summarized_story": "Share this article:The official unveiling of Bitnob, a financial technology company, as the official elite sponsor for the Nigerian professional football league (NPFL) was held on May 17th, 2022.\nThe event had members of the media, along with officials of the league management company (LMC), Nigerian Professional Football League (NPFL), the Nigerian Football Federation (NFF) and other related bodies and stakeholders in the Nigerian football space in attendance.\nBitnob deals in Bitcoin transactions, and they leverage technology to bring ease to the movement of funds in the blockchain.\nIn his opening remarks, Amaju Pinnick, the NFF president, commended the CEO of Bitnob and assured him of the NFF’s support.\nDespite the Government’s reservations on bitcoin, Bitnob is constantly working on rightly projecting that bitcoin and blockchain technology can be used for good in society."
  },
  {
    "headline": "MTN Foundation partners Google and Microsoft, trains young entrepreneurs on digital skills",
    "summarized_story": "The training session began with Google, and after a two-week-long intensive training on the virtual platform, Oluwatumise Ife-Abidakun led the concluding training session on Friday, May 6, 2022.\nThe Google training had three learning agendas.\nThe first focused on how business owners can set up and optimise their Google My Business (GMB) listing.\nThe second training session was in partnership with Microsoft, and the training ran for a period of one week.\nThe ICT and Business Skills training by the MTN Foundation is aimed at improving the entrepreneurial and employability abilities of young Nigerian entrepreneurs."
  },
  {
    "headline": "How companies can shape the narrative for tech-enabled mobility in Africa",
    "summarized_story": "Share this article:In 2019, Nigerian mobility companies were high-flying.\nSince then, funding for mobility companies ($147m in 2021) have largely gone to companies on the vanguard of innovation and sustainability in Africa’s mobility space.\nWhile Africa’s mobility companies have witnessed varying fortunes, there are important factors that are currently not being addressed in the sector.\nLed by mobility giant, GIG Mobility, major players in Africa’s mobility space are gearing up to have important conversations at the inaugural Africa Mobility Conference taking place on June 2, 2021 with theme: Pathways to the future of mobility in Africa.\n“Just stepping into the mobility space, I realised the players in the space are not trying to shape the narrative,” says Enahoro Okhae, newly appointed CEO of GIG mobility."
  },
  {
    "headline": "The Nigerian Tech Entrepreneur who has created the Airbnb of Luxury Cars",
    "summarized_story": "Clients using Starr Luxury Cars include corporate professionals, families on holiday in the UK, film industry professionals and couples on their wedding day.\nOffering a wide choice of electric luxury car hire options too, the prestigious car hire company also recognise the need to respond to climate change as an industry.\nStarr Luxury Cars respond by actively encouraging their fleet partners to promote electric vehicles, stocking only the best-performing electric cars available on the market such as Tesla, Jaguar and Audi.\nWith Starr Luxury Cars’ presence now in LA, Atlanta and Miami to name a few new spots, it’s impossible not to see continued growth for this enthusiastic entrepreneur.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Hyperia In Partnership with Yahclick set to provide broadband Satelite internet outside the reach of fiber connectivity",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:﻿Lagos, Nigeria.\nAbout HyperiaHyperia is a Nigerian Telecommunications Company, in partnership with YahClick (powered by Hughes) that offers cutting-edge broadband satellite services in Nigeria.\nFor more information visit:www.YahClick.comBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "IOM, PAU train journalists on migration reportage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The International Organization for Migration (IOM), in collaboration with the School of Media Communication (SMC), Pan-Atlantic University has organised a 3-day training programme for 26 journalists covering migration beats in the print, television, radio and digital media in Nigeria.\nThe Journalists were drawn from various media spread across Nigeria.\nThrough behavioural change communication campaigns, outreaches and media reports, he said that IOM seeks to equip vulnerable migrants with the information they need to migrate safely and access necessary assistance.\nHe also disclosed that IOM implements projects designed to support positive behavioural change for the prevention of human trafficking and exploitation, support migrants to make informed decisions and as well sensitise communities on the dangers of irregular migration.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Iyoba College Emerges champions Of 4th Edition of Patreli Secondary School Female Cricket Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Iyoba College has emerged Champions of the 4th Edition of Patreli Secondary Schools Girls Cricket Competition as they defeated Glorious Crown Group of Schoolsi after winning the toss and elected to bat first.\nThe first Innings saw Iyoba College dominate the game by scoring the highest number of runs recorded in the competition, a total of 95 runs for the loss of 7 wickets in 20 overs.\nThe 4th edition of the Patreli secondary school girls competition which held between Monday 16 to Friday 20, May 20, 2022 featured Seven Schools from Benin City and one school from Ekpoma in Edo state.\nThe schools were seeded into two groups as Group A comprised Ohonre Grammar School, Glorious Crown Group of Schools, Christlike Secondary School (IDP Camp) and Government Science and Technical College(GSTC).\nWhile Group B had Idia College, Evbareke Secondary School, Ujoelen Grammar School (Ekpoma) and Iyoba College."
  },
  {
    "headline": "Best Training Contributor: LAPO MfB Bags ITF Award – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – LAPO Microfinance Bank, Benin City, has emerged the ITF Best Organization in Training Contribution for year 2021 amongst all other organizations in Edo State.\nThe ITF Chief Executive, while commending the Financial institution for what he described as “no mean feat”, however , urged the management and Staff of LAPO MfB, Benin City, to keep the flag flying and to do more in the years ahead.\nThe ITF Benin Area office Manager enumerated the different categories of training programmes that LAPO MfB had proposed and implemented for it’s staff in conjunction with ITF and other HRD institutions and profusely appreciated its genuine efforts in human capital development of staff.\nAccording to him, “this year, ITF has implemented Occupational Safety and Workplace Violence Prevention Workshop for 20 members of your staff.\nFaith Ojo, Executive Director, Operations, LAPO MfB, representing Cynthia Ikponmwonsa, Managing Director, LAPO MfB, thanked ITF for the Award, stating that “in LAPO MfB, we have always believed in making the staff better than they came into the organization.”She noted that it was quite heart-warming and very exciting for LAPO MfB to be appreciated and given an Award by the ITF on account of its commitment to staff training and human capital development."
  },
  {
    "headline": "2023: PDP submits results of Edo Assembly, House of Reps primary elections to INEC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Peoples Democratic Party (PDP), on Monday, submitted the results of the Edo State House of Assembly and the House of Representatives primary elections to the Independent National Electoral Commission (INEC).\nThe Chairman of Edo PDP House of Representatives Primaries Committee, Mr. Kolawole Shittu, and his Edo State House of Assembly Committee counterpart, Mr. Agbateyiniro Isaac, along with other members of their committees submitted the results at the Edo INEC office, in Benin City.\nThe primary elections were held on Sunday, May 22, across the state and monitored by officials of INEC in the state.\nBriefing journalists shortly after the submission, Shittu said, “We are here to submit the results of the House of Representatives primary election that was held yesterday in Edo to the state chapter of INEC.\nWe want to thank the Edo PDP faithful for their support and the enabling environment that was given to us to conduct this primary election.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Private jet blocks Ikeja Along, causes traffic gridlock",
    "summarized_story": "A private jet with damaged wing has blocked Ikeja Along, causing heavy traffic on the ever busy road.\nBusiness Hallmark learnt that the jet was was being towed to the facility of nearby Federal Airport Authority (FAAN) when it got stuck on the road next to FAAN.\nFAAN has meanwhile, explained in a tweet that the aircraft was being towed to where it would be repaired by its new owner when it got stuck on the road.\n“The Federal Airports Authority of Nigeria would like to inform the general public to disregard the news making the rounds on social media about an alleged crash at Ikeja Airport,” the tweet reads.\n“The aircraft was sold by the owner to a buyer, who was taking it to its final destination."
  },
  {
    "headline": "Osun 2022: Your achievements qualify you for second term, Bolowaduro monarchs tell Oyetola",
    "summarized_story": "Oba Fadipe who described the administration of Governor Oyetola as unprecedented, said he has been tested and trusted and is therefore qualified for a second term.\n“As traditional rulers, we are good assessors.\n“You have demonstrated good intentions in all you do, and you have been tested, trusted and you are worthy of re-election for second term.\nTo us, you have done excellently well, and as traditional rulers, what you have done particularly for traditional rulers in Osun, no one or no Governor has done it in the history of this State.\nAddressing the mammoth crowd of the party loyalists at the St. Thomas, Otan-Ayegbaju, the campaign venue, Governor Oyetola promised to consolidate his modest achievements and improve on them in his second term."
  },
  {
    "headline": "JUST IN: Okorocha finally whisked away by EFCC operatives",
    "summarized_story": "Rochas Okorocha, former governor of Imo State, has been taken away from his Abuja apartment by operatives of the Economic and Financial Crimes Commission (EFCC).\nThe operatives arrested the embattled former governo at 06:48 pm after breaking into his living room.\n“The EFCC operatives are here with some gunmen and they have broken all my bulletproof doors.\nThe women had come to protest the continued siege on Okorocha’s residence by the operatives, demanding an end to the siege.\n“In the circumstances, the commission is left with no option than to effect the arrest of Senator Okorocha and bring him to trial,” the spokesman said."
  },
  {
    "headline": "2022: Olufi, Alayegun, Olowu, throw weight behind Oyetola’s re-election",
    "summarized_story": "This is as Oyetola continued his re-election campaign in Ode-Omu, Orile-Owu and Gbongan on Monday, following the flag off in Ife last Thursday.\nAccording to him: “God made a promise to Osun and fulfilled it with the emergence of Governor Adegboyega Oyetola.\nOyetola, who reiterated that he is in government to serve, called on citizens to support his drive and aspiration to collectively fix Osun.\nWe are not in government to struggle for relevance, we came to serve, we came to fix Osun.\n“Let us all come out in our large numbers to vote, but let us also not be tired of propagating the good works of Governor Oyetola."
  },
  {
    "headline": "2023: Group drums support for Ijesa north house of reps aspirant, Ogungbangbe",
    "summarized_story": "By Sunday Oguntuyi, OsogboAn APC group in Osun State, The Progressives Conscience (TPC), has urged the leadership of the party to cede the house of representatives ticket to Dr. Thomas Ogungbangbe.\nThe group described Ogungbangbe as a philanthropist who is capable of representing Obokun /Oriade federal constituency.\nHe said that their decision was hinged on the Philanthropic gesture of Ogungbangbe across different parts of the country and his people-oriented programmes.\n“We need him because we have the believe that he’s the only person, going by his antecedents, that can liberate us.\nThomas Ogungbangbe is the Group Managing Director/Chief Executive Officer of CITA Group."
  },
  {
    "headline": "Primaries: PDP’s Oghene Egoh Wins Amuwo-Odofin Federal Constituency Ticket",
    "summarized_story": "Emmannuel Oghene Egoh of the Peoples Democratic Party (PDP) has emerged the candidate of the party for the Amuwo-Odofin Federal Constituency in the 2023 elections.\nThe party’s returning officer, Mr Yahaya Saminu, made this known at end of the party’s primary election in Amuwo-Odofin federal constituency on Monday in Lagos.\nDorathy had zero vote; Mr Akeem Raji also had zero vote; Mr Pascal Nwankwo scored seven votes; Mr Aliasau Azeez had zero vote, while Hon.\nOghene Egoh polled 20 votes to clinch the party’s ticket to contest the Amuwo-Odofin Federal Constituency seat in 2023.\nEmmanuel Oghene Egoh as the winner of the primary election held in Amuwo-Odofin Federal Constituency."
  },
  {
    "headline": "Buhari Honoured With Global Integrity, Anti-corruption Award",
    "summarized_story": "In recognition of his lifetime outstanding commitment to the fight against corruption and selfless service with exceptional integrity, President Muhammadu Buhari has been honoured with the Chartered Institute of Forensics and Certified Fraud Examiners of Nigeria’s (CIFCFEN) Global Integrity And Anti-corruption Corruption Award of Excellence.\nThe President was presented with the Award on Tuesday in Abuja by the chairman, Governing Council, CIFCFEN Board of Trustees, Dr Iliyasu Gashinbaki.\nThe award is the highest honour of the Institute reserved for only African Heads of States with impeccable character and unimpeachable ideals.\nHe directed the anti-corruption agencies to continue partnering with the Institute for the benefit of the country.\n”This is the first independent review of graft fighting strategy and I commend the Institute for this initiativ,” he said."
  },
  {
    "headline": "Buhari Honoured With Global Integrity, Anti-corruption Award",
    "summarized_story": "In recognition of his lifetime outstanding commitment to the fight against corruption and selfless service with exceptional integrity, President Muhammadu Buhari has been honoured with the Chartered Institute of Forensics and Certified Fraud Examiners of Nigeria’s (CIFCFEN) Global Integrity And Anti-corruption Corruption Award of Excellence.\nThe President was presented with the Award on Tuesday in Abuja by the chairman, Governing Council, CIFCFEN Board of Trustees, Dr Iliyasu Gashinbaki.\nThe award is the highest honour of the Institute reserved for only African Heads of States with impeccable character and unimpeachable ideals.\nHe directed the anti-corruption agencies to continue partnering with the Institute for the benefit of the country.\n”This is the first independent review of graft fighting strategy and I commend the Institute for this initiativ,” he said."
  },
  {
    "headline": "PDP Primaries: Benue Commissioner, Olofu, Hails Peaceful Conduct",
    "summarized_story": "Benue State Commissioner of Finance, Hon.\nDavid Olofu, has lauded the leadership of the Peoples Democratic Party (PDP) in the State for conducting a peaceful primaries for House of Assembly and House of Representatives seats across the state on Sunday.\nWhile monitoring the exercise in his Apa local government area of the State, Hon.\n“Let me also use this opportunity to congratulate the House of Assembly candidate for Apa State Constituency, Hon.\nThe primaries for the House of Assembly in Apa saw the emergence of Hon."
  },
  {
    "headline": "PDP Primaries: Benue Commissioner, Olofu, Hails Peaceful Conduct",
    "summarized_story": "Benue State Commissioner of Finance, Hon.\nDavid Olofu, has lauded the leadership of the Peoples Democratic Party (PDP) in the State for conducting a peaceful primaries for House of Assembly and House of Representatives seats across the state on Sunday.\nWhile monitoring the exercise in his Apa local government area of the State, Hon.\n“Let me also use this opportunity to congratulate the House of Assembly candidate for Apa State Constituency, Hon.\nThe primaries for the House of Assembly in Apa saw the emergence of Hon."
  },
  {
    "headline": "Ibori’s Daughter Beats Okowa’s Candidate In Delta PDP Run-Off Primary",
    "summarized_story": "Honourable Erhiatake Ibori-Suenu, daughter of former Governor of Delta State, James Ibori, on Tuesday polled 46 votes against her rival, Hon.\nBen Igbakpa, who scored only 22 votes in the Peoples Democratic Party run-off primaries election for the Ethiope Federal Constituency of Delta.\nBen Igbakpa, the serving lawmaker representing the constituency, is widely believed to be the favourite candidate of the incumbent Governor of the State, Dr. Ifeanyi Okowa.\nHe added, “The only candidate Okowa and I were on same page with was Ben Igbakpa.\nBen Igbakpa, had earlier tied by scoring 34 votes respectively when the primaries was initially conducted."
  },
  {
    "headline": "Drama As Namadi Sambo’s Son Asks Delegates To Return His Money After Losing PDP Ticket",
    "summarized_story": "Drama As Namadi Sambo’s Son Asks Delegates To Return His Money After Losing PDP TicketAdam Namadi, son of former Vice-President Namadi Sambo has reportedly requested delegates to refund the N2 million each he doled out before the election.\nAt the end, Samaila Suleiman, the incumbent representative of the constituency carried the day as he defeated Namadi and Shehu Usman ABG.\nSuleiman, who recently decamped from the ruling All Progressives Congress (APC) to the PDP, won with 22 votes against Shehu Usman ABG who polled 14 votes.\nAccording to delegates, Suleiman had distributed between N3.5m and N4m to each delegate while ABG gave out N2.5m in cash and Namadi had distributed N2m to delegates.\nHowever, having lost the contest, both ABG and Namadi demanded an immediate refund."
  },
  {
    "headline": "PDP May Not Have Candidates In Anambra – Group",
    "summarized_story": "There is currently chaos in Anambra chapter of the PDP as party stakeholders have alleged a high level conspiracy not to hold 3-man delegates and primaries in the state.\nIn a press release signed by Barr Jude Onyia and Hon.\nPeter Udalor the Anambra Stakeholders alleged a plot by the National Leadership of PDP to violate article 1.12 of INEC Guidelines “as it concerns the issue of rescheduling of congress/ ward Congresses.\n“As it stands, majority of the aspirants are now negotiating with YPP and APC as they know that Anambra PDP will most likely not present candidates.\nPDP NWC has failed Anambra PDP,” the stakeholders said."
  },
  {
    "headline": "Petrol Station Saved As Diesel Tanker Goes Up In Flame In Anambra",
    "summarized_story": "Petrol Station Saved As Diesel Tanker Goes Up In Flame In AnambraA petrol station on the Enugu-Onitsha Expressway’s Umunya Road was saved from fire on Tuesday when a truck carrying diesel crashed into the area and caught fire.\nAccording to a source, the tanker crashed into the gutter when the driver lost control.\nAccording to the source, the tanker quickly caught fire after the collision.\nOn Tuesday morning, the event occurred at the famed Odumodu Junction in Umunya, Oyi Local Government Area.\n“The diesel flowing out of the truck flowed through the gutter, generating flames and burning everything in its way."
  },
  {
    "headline": "Why we nabbed Rochas Okorocha on APC screening day – EFCC",
    "summarized_story": "Okorocha, in a video, earlier in the day had asked the EFCC operatives who surrounded his house to allow him go for his presidential screening.\nThere are policemen and EFCC operatives all over my compound and my gate has been blocked with their cars.\n“As I speak now, I have requested for an arrest warrant arrest, any court order but none seems to be available.\n“I want to kindly appeal to the EFCC to allow me to give for my screening and do my election.\n“In the circumstances, the Commission is left with no option than to effect the arrest of Senator Okorocha and bring him to trial.”Share this: TwitterFacebook"
  },
  {
    "headline": "Alleged killing of northerners: Anambra government cautions on reportage… CNG, CAN warn on conspiracy of silence",
    "summarized_story": "The Anambra state government has said contrary to insinuations making the rounds, there is no religious or ethnic killing in the state.\n“While it is true that there is general insecurity across the country, there is no targeted religious or ethnic killings in Anambra State.\nAs a matter of fact, Anambra indigenes have suffered more casualties as a result of the unfortunate killings,” the statement said.\nCAN hits IPOBSimilarly, the Kaduna state chapter of the Christian Association of Nigeria (CAN) has condemned the alleged killing of the northerners in Anambra state.\n“That’s why there are a lot of suspicions between the two major ethnic groups and it is affecting our politics."
  },
  {
    "headline": "After losing PDP senatorial ticket to Reps member, TJ Yusuf, Dino Melaye breaks silence",
    "summarized_story": "Former Senator representing Kogi West, Dino Melaye, has reacted after losing the People’s Democratic Paty (PDP) primary election which ended his bid to return to the Senate.\nMelaye in his reaction via his official Facebook handle on Tuesday, alleged that gang up against him led to his loss.\nT.J YUSUF and thank all those who voted in the first and second ballot for me.\nSDM.”Melaye polled total vote of 99, while Yusuf got 163 votes from the delegates to clinch the PDP ticket for the Kogi West senatorial constituency.\nIt was at this point that supporters of Aro decided to pitch their tent with Yusuf which gave the House of Rep member block votes to defeat Melaye."
  },
  {
    "headline": "CIBN appoints Fidelity Bank’s Ken Opara as 22nd President",
    "summarized_story": "Fidelity Bank Plc Executive Director, South West and Lagos, Dr Ken Onyewuchi Opara will tomorrow take over the mantle of leadership of the Chartered Institute of Bankers of Nigeria, CIBN.\nDr Opara, who was elected a month ago, will be sworn in as the 22nd President and Chairman in Council of the highly revered Institute.\nA graduate of Finance from the University Of Nigeria, Dr opara has had a distinguished career in banking spanning over 30years.\nHis Bank, Fidelity Bank Plc is one of the leading financial institutions leveraging in this area .\nDr Ken Opara is married with four Children."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Gbemi Saraki Takes Charge As Amaechi Bows Out As Transport Minister",
    "summarized_story": "By Naomi DouglasMinister of State for Transport, Senator Gbemi Saraki, has now taken full charge of the Ministry of Transport, follwoing the formal resignation of Frontline presidential aspirant on the platform of All Progressives Congress APC, Chibuike Rotimi Amaechi, yesterday.\nIn a statement issued by Amaechi Presidential Media Committee, APMC, in Abuja yesterday, Amaechi in his resignation letter, expressed profound gratitude to the President for considering him fit to serve in his administration.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\n“Your Excellency, whilst humbly seeking your kind consideration of my request please accept the assurances of my highest esteem.”"
  },
  {
    "headline": "Delta-2 Progrmme: Nigeria , Czech Republic Flags off $16.2 million Bilateral Co-funding",
    "summarized_story": "By Eunice OrikeAs part of economic diversification priority of the present administration, the Federal Government and Czech Republic has launched a Call for Public Proposals on Delta-2 Programme worth $16.2 million Co-funding Research and Development R&D,project.\nThe Delta-2 Programme is the cooperation model of the Technology Agency of Czech Republic TA CR, running for the period from 2020-2025, through which TA CR sponsors applied research and innovation of manufacturing companies and innovative institutions.\nProf. Mohammed Sani Haruna said the Call for Public Proposal for the Delta-2 programme is one of the projects to be implemented under the Agreement between the two countries.\n“The PICTT would be sourcing technologies from the Czech Republic’s manufacturing companies; tertiary; research; and development institutions.\nThe Delta-2 Programme is uniquely designed to catalyze technology transfer and mobilize positive interventions and investments among private sectors and relevant stakeholders in Nigeria and Czech Republic for technology advancement."
  },
  {
    "headline": "Naira in free fall, now N600 to $1",
    "summarized_story": "By Our CorrespondentThe free fall of our national currency the Naira against major currencies continued yesterday as it weakened against the United States of America dollar to trade at N600 at the parallel market.\nThis non-stop depreciation of the Naira, which incidentally has been officially devalued thrice under this administration, is a pointer that the fiscal policies are not responding to market trends.\nAbubakar, a BDC operator in Ikorodu, told an online medium that buying and selling prices stood at N595 and N600 per dollar.\nA parallel market (street/black market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira."
  },
  {
    "headline": "Shots Fired As EFCC Arrests Okorocha In Abuja",
    "summarized_story": "﻿The Economic and Financial Crimes Commission (EFCC) has picked up Senator Rochas Okorocha from his residence.\nREAD ALSO: Why We Are At Okorocha’s Residence – EFCCA Channels Television cameraman, Kabiru Owoyemi, was among those brutalised during the clearance.\n‘Left with no option’The EFCC had arrived Okorocha’s residence in Maitama to effect his arrest on Tuesday.\nAt the last adjourned date, March 28th, 2022, Justice Ekwo before adjourning until May 30th, 2022, had warned that it was “the last adjournment I shall grant in this matter”.\nAccording to the EFCC, it was “left with no option than to effect the arrest of Senator Okorocha and bring him to trial.”"
  },
  {
    "headline": "Gunmen Kill Pregnant Woman, Four Children In Anambra",
    "summarized_story": "Gunmen have killed at least 12 people, including a pregnant woman and her four children in Anambra State, the BBC reported on Tuesday.\nThe State Governor, Charles Soludo and the police have reacted to the killings but did not specify the number of persons killed.\nA community leader told the BBC that the pregnant woman and her children were returning home on a motorcycle taxi when gunmen ambushed them in the Orumba area of the state.\nThe killings come about 24 hours after gunmen beheaded a lawmaker in the state, Okechukwu Okoye.\nIn a statement on Tuesday, Governor Soludo said “there is no targeted ethnic or religious killings in Anambra State."
  },
  {
    "headline": "At Least 12 Killed As Terrorists Attack Katsina Community",
    "summarized_story": "At least twelve people have been killed by terrorists at Gakurdi village in Jibia Local Government Area of Katsina State.\nThe terrorists were also said to have burnt a lot of farmlands belonging to the residents of the village during their early morning operation that took hours.\nEyewitness told Channels Television that the terrorists, armed with weapons, arrived the village on motorcycles and started shooting sporadically in the air to disperse the residents.\nThe bandits were at the village this Tuesday morning and killed twelve villagers,” Isah said.\n“The Commissioner of Police, CP Idris Dauda Dabban had in response led a team of security operatives to the village this morning.”"
  },
  {
    "headline": "UPDATED: CBN Raises Interest Rate For First Time In Over Two Years To 13%",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) has voted unanimously to raise the Monetary Policy Rate (MPR) to 13 per cent.\nCBN Governor, Godwin Emefiele, announced this on Tuesday while briefing reporters at the end committee’s meeting at the apex bank’s headquarters in Abuja.\nIt is the first time in two and a half years that the policy-setting committee of the nation’s financial regulator would increase the MPR, which measures the interest rate.\nThe MPR is the baseline interest rate in an economy while every other interest rate used within such an economy is built on it.\nHe advised the various banks in the country and the Federal Government to redouble efforts in supporting monetary authority."
  },
  {
    "headline": "FIBA Threatens Sanctions Over Nigeria’s Basketball Suspension",
    "summarized_story": "World basketball body FIBA has threatened to sanction Nigeria over its decision to withdraw from international competitions for two years.\n“National member federations shall manage their affairs independently and with no influence from third parties,” the letter addressed to Nigeria Basketball Federation President, Musa Ahmadu-Kida, read in part.\n“As you already are aware, Nigeria is due to participate in the following FIBA competitions in the upcoming months: FIBA 2023 Basketball World Cup Qualifiers (FBWC23 Qualifiers) FIBA 2022 Women’s Basketball World Cup (FWBWC22).\n“As you are aware, any withdrawal of Nigeria from the abovementioned competitions will trigger potential disciplinary sanctions as per the FIBA Internal Regulations.\nFurthermore, if the absence of Nigeria from international competitions for the next two years materialises, the consequences may spread out well past such a two-year period."
  },
  {
    "headline": "Jim Nwobodo backs Peter Mbah to succeed Gov Ugwuanyi",
    "summarized_story": "In his statement Senator Nwobodo described Peter Mbah as a quintessential technocrat with a calm disposition to cope with the rigours of governance.\nPeter Mbah is not talkative, it’s not being heard here in Enugu state.\n“As far back as October 2019 to be specific, I invited Peter Mbah to my house.\n“I am not going to talk about it because it is unnecessary but I know Peter Mbah also know that.\nEkweremmadu had met with Peter Mbah and he is supporting Peter Mbah now."
  },
  {
    "headline": "Ogun 2023: Otegbeye, Modele Sharafa-Yusuf drum support as Akinlade formally declares -",
    "summarized_story": "The candidate of the Allied People’s Movement (APM) in 2019 governorship election in Ogun State, Adekunle Akinlade has formally declared to contest again on the platform of the All Progressives Congress.\nHe made the declaration in Abeokuta where he promised to reset the state for a greater height.\nTwo other governorship aspirants of the All Progressives Congress, Biyi Otegbeye and Modele Sarafa-Yusuf also graced the occasionThe former member of the House of Representatives said his programme will be on 6-point Agenda which include security, agriculture Driven Human capital development, strategic Internally Generated Revenue modules, healthcare, social justice and urban renewal."
  },
  {
    "headline": "Rivers Governor, Nyesom Wike, dissolves cabinet, COS, Others sacked -",
    "summarized_story": "Rivers State Governor, Nyesom Ezenwo Wike, has announced the dissolution of the State Executive Council.\nThe statement read “The Chief of Staff to the governor and Senior Special Assistant (Protocol), have also been relieved of their office.\n“His Excellency, Governor Nyesom Ezenwo Wike, commends the members the Rivers State Executive Council for their service and contribution to the development of the State.\nHe was also a local government Chairman in Rivers State and has always touted his experience at all levels of government as one that has prepared him for the highest office in the Land.\nGovernor Nyesom Wike’s tenure will end in 2023."
  },
  {
    "headline": "Zulum hosts APC presidential aspirant TS Jack-Rich",
    "summarized_story": "Borno State Governor, Babagana Zulum said the people of Borno State are appreciative of the visible footprints and humanitarian strides of a frontline Presidential Aspirant of the All Progressives Congress, Tein T.S.\nJack-Rich, in the state.\nGovernor Zulum disclosed this at the government House Maiduguri while hosting an APC Presidential Aspirant and his entourage who were on a consultative visit to the state to meet with Stakeholders and Delegates of the Party ahead of the Presidential Primaries.\nThe Borno State Governor notes with gratitude the people-oriented projects executed by Mr Jack-Rich in parts of the State which includes world-class Potable Water Facilities of 250,000 Litre Capacity each at Gonidangari and Shehuri North in Maiduguri as well as the ongoing ultra-modern Faculty of Engineering and 180-Bed capacity Hotel projects at the Nigerian Army University in Biu.\nOn his part the Presidential aspirant Jack-Rich vowes to address the problems militating against the ease of doing business in Borno in order to attract private sector investments if he emerged as President in 2023."
  },
  {
    "headline": "Bode George: PDP Primaries Are In Line With INEC’s Procedures",
    "summarized_story": "It has been different strokes for different aspirants at the ongoing Peoples Democratic Party primaries across the country.\nIn the Federal Capital Territory Abuja, incumbent senator representing the FCT, Senator Philip Aduda, emerged the winner of the People’s Democratic Party senate primaries.\nIn Enugu, there were huge losses with Deputy Minority Leader of the House of Reps, Toby Okechukwu, losing his bid to return to the green chamber.\nIn Aramoko Ekiti, Lere Olayinka defeated Victor Adeyinka in the Reps primary poll, a situation which didn’t go down well with Adeyinka’s supporters.\nOur guest is Chief Bode George, Former Deputy National Chairman, South West of the Peoples Democratic Party (PDP)"
  },
  {
    "headline": "Unknown Gunmen Attack Anambra + Buhari Visits Kano Explosion Victims – Trending With Ojy Okpe",
    "summarized_story": "Following the insecurity crisis in Anambra state; A former Minister of Education, Oby Ezekwesili, called on the National Assembly on Thursday to invite President Muhammadu Buhari to account for insecurity in the country.\nIn the meantime, Seven persons including a mother and four of her children were killed by unknown gunmen in Anambra state.\nMeanwhile The Anambra Police Command has alleged that some communities in the state are shielding criminals attacking, killing and maiming innocent people.\nFinally, President Muhammadu Buhari on Thursday condoled with the victims of the recent explosion in Kano state."
  },
  {
    "headline": "Based On Supreme Court Judgement, I Am The APGA Chairman – Edozie Njoku",
    "summarized_story": "National Chairman, All Progressives Grand Alliance, APGA, Victor Oye has dismissed claims by some individuals purportedly identifying as a faction of the party, maintaining that APGA has no faction in Anambra State.\nIn his submission, Oye described “Edozie Njoku” as an impostor saying his role and attempts to obtain a forged judgment were “sacrilegious”.\nIt will be recalled that Njoku was sacked as APGA’s national chairman by the lower court in Jigawa State, and lost at the appellate court afterwards.\nBased on unfolding events, the former National Vice Chairman of the party, Edozie Njoku, told newsmen in Abuja that an FCT High Court has pronounced him the new National Chairman of APGA after a judgement.\nOur guest is APGA Factional Chairman, Chief Edozie Njoku."
  },
  {
    "headline": "Bode George: Who Owns Alpha-Beta",
    "summarized_story": "Bode George responds to Bayo Onanuga, a Campaign Spokesman for Presidential Aspirant Bola Ahmed Tinubu, who last week referred to Bode Georgie as a ‘perpetual political failure, who is diminished by Tinubu, and rejected by Lagosians’"
  },
  {
    "headline": "UK PM Johnson Facing Fresh Criticism after New Partygate Photos Emerge",
    "summarized_story": "Boris Johnson is facing fresh questions after photos showing the prime minister drinking at an event during a Covid lockdown were published.\nThe pictures, released by ITV News, are believed to show the prime minister at a leaving party on 13 November 2020.\nThe Metropolitan Police are facing calls to explain why Mr Johnson did not receive a fine.\nA government source told BBC News the photos may have been taken by the official No 10 photographer and proved Mr Johnson was there in a work capacity.\nMr Johnson is pictured toasting colleagues while standing by a table laden with wine bottles, wine glasses, food and other drinks."
  }
]