[
  {
    "headline": "Hackers now unlock, steal vehicles, NCC warns Nigerians",
    "summarized_story": "The Nigerian Communications Commission, on Sunday, said hackers now unlock vehicles for purpose of stealing and other vices, saying the new trend also offers hackers the opportunity to make away with the cars they hacked.\nAccording to the NCC, the ongoing cyber-vulnerability allows a nearby hacker to unlock vehicles, start their engines wirelessly and make away with cars.\nThe NCC stated this in a statement on Sunday signed by its Director, Public Affairs, Dr. Ikechukwu Adinde, titled, ‘Hackers can unlock, steal your vehicles, NCC alerts Nigerians’.\n“Multiple researchers disclosed a vulnerability, which is said to be used by a nearby attacker to unlock some Honda and Acura car models and start their engines wirelessly.\nThe RKE system, on the other hand, represents the standard solution for conveniently locking and unlocking a vehicle’s doors and luggage compartment by remote control.”Copyright PUNCH."
  },
  {
    "headline": "SERAP sues Buhari over N1.48tn spent for refineries’ maintenance",
    "summarized_story": "), “over his failure to probe allegations that over N1.48 trillion reportedly spent on maintaining the country’s four refineries between 2015 and 2020 may have been stolen, mismanaged or diverted into private pockets.”According to SERAP, the government reportedly spent N10.23 billion in June 2020 on three refineries that processed zero crude.\nDespite the huge spending, the refineries are still not working while fuel scarcity persists.\n“According to reports, the government spends over N264 billion annually to operate and maintain the country’s refineries.\nSuccessive governments have reportedly spent trillions of Naira to rehabilitate, operate and maintain the refineries that have produced little or no fuel.\n“The government reportedly spent $396 million for maintenance of the country’s refineries between 2015 and 2020 alone."
  },
  {
    "headline": "Nnamdi Kanu unhappy over killings, sit-at-home order in Southeast, says Soludo",
    "summarized_story": "Chukwuma Soludo of Anambra says Mazi Nnamdi Kanu, the detained leader of the terrorist group, Indigenous People of Biafra (IPOB), is unhappy with the killings and enforcement of the protracted sit-at-home order in the South-East.\nBut Soludo said this was part of his interaction with Kanu during a visit to the proscribed IPOB leader in his detention facility on Friday in Abuja.\nMr Christian Aburime, Chief Press Secretary to Soludo who issued a Statement on Sunday in Awka, reported Soludo as saying that kanu was in a stable condition.\nAccording to him, “Kanu informed me that if given the opportunity, he would make a broadcast that would address the degenerating security situation in the South-East under the guise of agitation.\nSince the detention of Kanu more than a year ago, the illegal pro-Biafran group had declared every Monday sit-at-home, in sympathy for their leader."
  },
  {
    "headline": "Murder of Deborah: Archbishop Martins wants perpetrators punished",
    "summarized_story": "Late Deborah SamuelBy Sam EyobokaTHE Catholic Archbishop of Lagos, Most Rev.\nAlfred Adewale Martins has condemned in very strong terms the stoning and killing of Miss Deborah Yakubu in Sokoto State by a mob of overzealous students for alleged blasphemy.\nHe said that the alleged killing of young Deborah Yakubu, a female student of the Shehu Shagari College of Education is appalling, provocative, and inhuman.\n“I feel very saddened by the callous manner Deborah Yakubu’s life was cut short in her prime by a bloodthirsty jungle justice mob.\nIt shows how little the value that some people place on human life."
  },
  {
    "headline": "Deborah: A deep wound in the soul of our country — Pat Utomi",
    "summarized_story": "Pat Utomi, in a statement he personally signed and Titled, “A TIME TO LEAD”, blamed the current insecurity bedevilling the country on a lack of worthy leadership.\nHe noted that Nigeria is truly at a crossroads and anyone who fails to take a stand is not worthy of the people.\nAlso Read:Deborah Samuel: Prophet Muhammad didn’t kill anyone for insulting him – Sheikh GumiHe said, “The incidents in Sokoto in the last two days have opened a deep wound in the Soul of our country.\nThe Sokoto state government has imposed a one-week curfew after youths protested the arrest of the perpetrators.\nNorthern Governors Forum has called for calm while the Christian Association of Nigeria, CAN, has called for investigation into the matter."
  },
  {
    "headline": "Deborah Samuel: Prophet Muhammad didn’t kill anyone for insulting him – Sheikh Gumi",
    "summarized_story": "Sheik Ahmad GumiBy Emmanuel OkogbaIslamic cleric, Ahmad Gumi has joined the conversation of death for blasphemy, saying that Prophet of Islam, Muhammad (SAW), did not at anytime kill anyone despite the fact that he was insulted severally.\nGumi said this while conducting a religious teaching class in his Kaduna Juma’at mosque, according to reports.\nHis statement was a reaction to the recent lynching of Deborah Samuel, a female Christian student at Shehu Shagari College of Education in Sokoto, over alleged blasphemy.\nHe said: “Anyone who kills a non-Muslim who they have agreed to live peacefully with, will not smell the fragrance of Paradise for 40 years.\n“If we think by killing Deborah, people who are not of the same faith with us will stop insulting our prophet, then we are in delusion,” he concluded."
  },
  {
    "headline": "SERAP sues Buhari for spending N1.48trn on refineries maintenance in 5yrs without crude oil",
    "summarized_story": "The government reportedly spent N10.23 billion in June 2020 on three refineries that processed zero crude.\nAlso in 2021, the government approved $1.5 billion (about N600 billion) to repair the Port Harcourt refinery.\nDespite the huge spending, the refineries are still not working while fuel scarcity persists.\nSuccessive governments have reportedly spent trillions of Naira to rehabilitate, operate and maintain the refineries that have produced little or no fuel.\n“The government reportedly spent $396 million for maintenance of the country’s refineries between 2015 and 2020 alone."
  },
  {
    "headline": "Deborah Samuel: Prophet Muhammad never killed despite insults – Sheikh Gumi condemns murder",
    "summarized_story": "Sheikh Ahmad Gumi has condemned the gruesome murder of Deborah Samuel in Sokoto State.\nGumi stated that Holy Prophet Muhammad (SAW) never killed anyone despite insults by non-Muslims.\nIn the message translated by PRNigeria, Gumi said the best way Muslims can prove their love for the Prophet is adherence to his words.\nThe Sheikh explained that Islam doesn’t allow anyone to take laws into their hands and warned Islamic leaders against instigating their followers.\n“If we think by killing Deborah, people who are not of the same faith with us will stop insulting our prophet, then we are in delusion”, he added."
  },
  {
    "headline": "NCC alerts Nigerians on new ways hackers unlock, steal vehicles, android apps",
    "summarized_story": "The Nigerian Communications Commission (NCC) says it wishes to alert telecom consumers and members of the public on an ongoing cyber-vulnerability that allows a nearby hacker to unlock vehicles, start their engines wirelessly and make away with the cars.\nAdditionally, in a related advisory, the NCC, based on another detection by CSIRT, informed the general public about the resurgence of Joker Trojan-Infected Android Apps on Google Play Store.\nThis arose due to the activities of criminals who intentionally download legitimate apps from the Play Store, modify them by embedding the Trojan malware and then uploading the app back to the Play Store with a new name.\nIt said that the malicious payload is only activated once the apps goes live on the Play Store, which enables the apps to scale through Google’s strict evaluation process.\nIt warned that to avoid falling victim to the manipulation of hackers deploying Joker Trojan-Infected Android Apps, Android users must avoid downloading unnecessary apps or installing apps from unofficial sources."
  },
  {
    "headline": "SERAP takes Buhari govt to court for spending N1.48 trillion on non-functional refineries",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari “over his failure to probe allegations that over N1.48 trillion reportedly spent on maintaining Nigeria’s four refineries between 2015 and 2020 may have been mismanaged, stolen or diverted into private pockets.”The present government under Buhari reportedly spent N10.23 billion in June 2020 on three refineries that processed no crude oil.\nAlso, in 2021, the Buhari government approved $1.5 billion (almost N600 billion) to repair the Port Harcourt refinery.\nDespite the spending, the refineries are still not working, while fuel scarcity persists.\nJoined in the suit as respondent is Abubakar Malami, SAN, the Attorney General of the Federation and Minister of Justice.\nHowever, no date has been fixed for the hearing of the suit."
  },
  {
    "headline": "Deborah Samuel: Sokoto Govt suspends school resumption, sends message to corps members",
    "summarized_story": "The Sokoto State Government has announced the suspension of the resumption of basic and secondary schools in the State by one week.\nThe suspension was made known in a statement by Malam Ibrahim Iya, spokesperson of the Ministry of Basic and Secondary Education, on Sunday in Sokoto.\nThis was contained in another statement from Malam Sani Idris, the spokesperson of the scheme in Sokoto State, on Sunday.\n“Arrangements have also been made for the Police and Army patrol vehicles to intensify surveillance in all of the corps members’ locations.\nDeborah, a 200-level Home Economics student of the Shehu Shagari College of Education, Sokoto, was alleged to have committed blasphemy in a school WhatsApp group."
  },
  {
    "headline": "Board issues four-day ultimatum to intending pilgrims in Jigawa",
    "summarized_story": "Jigawa State Pilgrims Welfare Board has given four days ultimatum to the 2020/2021 prospective pilgrims to pay their Hajj fare.\nHe said the directives was for those who deposited part of their Hajj fares but were to pay the outstanding fare.\nMurtala explained that the board had given up to the 17th of this month for the intending pilgrims to complete the payment ahead of this year`s Hajj exercise.\nThe statement said any intending pilgrim who failed to complete the payment within the stipulated time may lose this year’s Hajj.\nHe urged the intending pilgrims to comply with the deadline."
  },
  {
    "headline": "Nnamdi Kanu unhappy over killings, sit-at-home order in Southeast, says Soludo",
    "summarized_story": "Chukwuma Soludo of Anambra says Mazi Nnamdi Kanu, the detained leader of the terrorist group, Indigenous People of Biafra (IPOB), is unhappy with the killings and enforcement of the protracted sit-at-home order in the South-East.\nBut Soludo said this was part of his interaction with Kanu during a visit to the proscribed IPOB leader in his detention facility on Friday in Abuja.\nMr Christian Aburime, Chief Press Secretary to Soludo who issued a Statement on Sunday in Awka, reported Soludo as saying that kanu was in a stable condition.\nAccording to him, “Kanu informed me that if given the opportunity, he would make a broadcast that would address the degenerating security situation in the South-East under the guise of agitation.\nSince the detention of Kanu more than a year ago, the illegal pro-Biafran group had declared every Monday sit-at-home, in sympathy for their leader."
  },
  {
    "headline": "2023: PDP’S presidential contenders and pretenders",
    "summarized_story": "Fourteen days to the presidential primaries of the opposition Peoples Democratic Party, (PDP), leading contenders for the presidential ticket of the party are emerging as the aspirants get set to do battle later in the month.\nThe serious ones among the aspirants have reached out to the delegates who will be voting at the primary election.\nWe need someone who can finance a presidential election with little or no support,” a party source said.\nHe first contested for the PDP presidential ticket in 2019 but came second to Atiku in the primary election.\nOTHERSUdom Emmanuel, the two-term governor of Akwa Ibom state is a surprise inclusion in the race for the PDP presidential ticket."
  },
  {
    "headline": "JUST IN: Soludo visits IPOB leader Kanu in detention",
    "summarized_story": "Anambra Governor Charles Soludo has visited Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu.\nThe visit, according to Soludo took place on Friday.\nSoludo said the IPOB leader expressed sadness over the killings in the Southeast.\nThe g6overnor said the IPOB leader, assured that if the opportunity arises, he will be glad to personally broadcast to his followers to maintain the peace.\nThe group is seeking for the creation of an independent state of Biafra to be carved out of the southeast and parts of South South."
  },
  {
    "headline": "Politicians mopping up forex ahead party primaries – BDC operators",
    "summarized_story": "Indications are that the relative stability in the nation’s foreign exchange market is about to get awfully unstable if the trend within the political scene is anything to go by.\nThis is just as operators in the black-market are having a field day, The Nation can authoritatively report.\nMeanwhile, Nigeria’s ruling party, the All Progressives Congress (APC), has reviewed its timetable for primary elections into various elective positions.\nThese adjustments are coming amidst call for the Independent National Electoral Commission (INEC) to extend the deadline for the conclusion of all primaries.\nThe electoral body has insisted on June 3 as the deadline for party primaries."
  },
  {
    "headline": "Presidential primaries (3) Endorsements and conclusion",
    "summarized_story": "DESPITE the initial dilly-dallying by the Governor Samuel Ortom-led committee to determine the Peoples Democratic Party (PDP) presidential zoning formula, it was all but clear weeks ago that the party would throw the contest open.\nThe party will stick to zoning, as informal as it may be, and stay true to it, win or lose.\nThe few northerners in the race of 25 remaining APC aspirants are in it as a fail-safe device, they argue.\nShould President Buhari be succeeded by another northern president, what would stop that region from producing the president in perpetuity?\nIt was mortifying that the ministers recklessly engaged in political junkets around the country in search of party tickets."
  },
  {
    "headline": "Northern Governors’ Forum, TEKAN condemn murder of Deborah Yakubu",
    "summarized_story": "From Gyang Bere, JosThe Northern Governors’ Forum has condemned the murder of Deborah Samuel Yakubu, a student of Shehu Shagari College of Education Sokoto who was killed on allegation of blasphemy.\nChairman of the Northern Governors’ Forum and Governor of Plateau State Simon Bako Lalong said in a statement that the governors were concerned about the development which is clearly an extra-Judicial measure of addressing perceived infractions.\nThe Northern Governors also appealed for calm following reports of the hijack of a peaceful protest which later turned violent and led to the imposition of a curfew in Sokoto metropolis.\nWe call on our members not to take the law into their hands but allow the authorities to act swiftly and appropriately.\n“TEKAN extends deepest condolences to the family of Ms Deborah Samuel and her entire community and calls on all its members to be fervent in prayers for justice and peace in our land.”"
  },
  {
    "headline": "2023: 9 APC presidential aspirants set to step down for Lawan –Orji Kalu",
    "summarized_story": "The Chief Whip of the Senate, Dr Orji Uzor Kalu, yesterday disclosed that nine presidential aspirants of the ruling All Progressives Congress (APC) are set to step down to support the presidential ambition of the Senate President, Dr Ahmad Lawan.\nKalu, who was the first to drop his presidential ambition in support of Lawan on the grounds of failure of APC to zone the presidential ticket to the Southeast, did not, however, disclose the names of the aspirants.\nThe issue of the APC presidential candidate will be settled even before the primaries.\n“As I am talking to you, about nine presidential aspirants from our party have intimated me of their plans to drop their presidential ambition to support Ahmad Lawan.\n“I have repeated my reasons for dropping my ambition for Lawan severally and I am sure Nigerians are aware already."
  },
  {
    "headline": "2023 presidency: I’m right man for the job, Saraki tells Okowa, Delta delegates",
    "summarized_story": "Saraki spoke in Asaba, Delta State while addressing PDP’s delegates ahead of the party’s national convention.\nHe stressed that the country needed to be fixed urgently from its failed and deteriorating state.\n“We need somebody who can unite Nigeria, who the youths and the old, North and South, can be comfortable with.\n“We need somebody that can bridge the gap between the young and the old.\nWe need somebody that can create jobs and shore up employment and that can only be done through agriculture, through non-reliance on oil."
  },
  {
    "headline": "Bandits kill 1, kidnap 20 in Kaduna",
    "summarized_story": "From Noah Ebije, KadunaBandits on Saturday kidnapped 20 persons and killed one at Kurmin Sata a few kilometers from Millennium City in Chikun Local Government Area of Kaduna State.\nReports said there were sporadically shootings from which a stray bullet hit and killed one person in his house.\nA source at Joint Task Force (JTF) within the community said the bandits attacked the Kurmin Sata around 12:16am on Saturday morning.\nAccording to the source, out of the 20 persons kidnapped, four including two women and men escaped during the attack.\nIt was gathered that the village head of the community and some traditional titleholders, women and children were among the kidnapped victims."
  },
  {
    "headline": "Tears as Deborah Yakubu is buried in Niger",
    "summarized_story": "From Tunde Omolehin, Sokoto, Stanley Uzoaru, Owerri and John Adams, MinnaTears flowed freely yesterday as the body of the late Deborah Yakubu was laid to rest in her Niger home state.\nIt was a moment of anguish and grief as parents and well-wishers wept uncontrollably as her remains were committed to mother earth in Tunga Magajiya in Rijau Local Government Area of Niger state.\nAfter the drama, the body of the late Deborah was eventually laid to rest at about 6.30 pm at the Christian Cemetary in Tunga Magajiya.\nAnthony Godonu, the archbishop, condoled with the family of the deceased student and the good people of Sokoto State, and indeed all Nigerians of goodwill.\n“I feel very saddened by the callous manner Deborah Yakubu’s life was cut short in her prime by a bloodthirsty jungle justice mob."
  },
  {
    "headline": "To Avert Major Religious Riots, Tambuwal Declares Curfew as Protests Rock Sokoto",
    "summarized_story": "Following the protests in Sokoto, Governor Nasir-el-Rufai of Kaduna State has banned any form of religious protest across the state.\nThe declaration of the curfew in Sokoto followed the protests that greeted the condemnation of the killing by the Sultan of Sokoto, Alhaji Muhammad Sa’ad Abubakar III.\nThe protesters set a car ablaze around St. Mary Catholic Church and destroyed properties in the church.\nTo avert major religious riots, Tambuwal therefore declared a 24-hour curfew within the metropolis.\nTunga Magaiya youths had insisted that Sokoto State Government should have been responsible for her burial."
  },
  {
    "headline": "Before Another Deborah is Lynched",
    "summarized_story": "The general lull, in my opinion, is not because anything has changed in the animosity but possibly because there is a bigger enemy at the door: Boko Haram.\nWith Boko Haram becoming a common threat, the confrontations reduced.\nThe factory for the production of Boko Haram and ISIS militants is very much in full production.\nBoko Haram would have their eyes on them.\nMeanwhile, I want to commend all the Muslims and Muslim groups who have been courageous enough to condemn the killing of Deborah."
  },
  {
    "headline": "Alleged Blasphemy: Tension in Sokoto, Tambuwal Declares Curfew",
    "summarized_story": "The irate youth also demanded that those arrested over the killing should be released with immediate effect.\nHe appealed to the people of Sokoto state to continue to observe law and order.\n“Everyone should, please, in the interest of peace go back home and observe this measures, with a view to re-establishing peace, law and order in the state”, he stated..\nHe noted that it was not in the interest of anyone to have a breakdown of law and order.\n“I, therefore, appeal for restraint; and, for people to observe and respect the rule of law”, he said ."
  },
  {
    "headline": "COVID Under Control in China",
    "summarized_story": "I would like to assure my Nigerian friends that China will be able to win the battle.\nChina’s anti-epidemic experience has demonstrated that its dynamic zero-COVID policy is not only the best option but also the bottom line that must be maintained for the country’s current epidemic prevention and control work.\nBy pursuing the dynamic zero-COVID approach, China has managed to safeguard people’s lives and well-being and has minimized the epidemic’s impact on economic and social development to the largest extent.\nAs a result, it is not difficult to conclude that China’s dynamic zero-COVID policy complements and bolsters the normal operation of the economy and society.\nFacing the COVID-19 pandemic, China has carried out its largest emergency humanitarian action since the founding of the People’s Republic of China in 1949."
  },
  {
    "headline": "Northern Christian Elders, CAN, UK Demand Arrest, Prosecution of Deborah’s Killers",
    "summarized_story": "Likewise, President Muhammadu Buhari strongly flayed the resort to self-help by the mob in Sokoto, resulting in violence, destruction and killing of Deborah.\nThe Christian group noted that anything short of apprehending and prosecuting those involved in the heinous act was unacceptable.\nDeborah had shared a voice note on her class Whatsapp group in which she challenged her colleagues who were posting religious information there.\nFormer President of the Senate, Anyim Pius Anyim also condemned, in the strongest terms, the gruesome and unlawful killing of Deborah.\nIn a statement he personally signed, Anyim decried the killing of Deborah as cruel, illegal, callous and inhuman."
  },
  {
    "headline": "Commercial Motorcyclists Beat, Burn Sound Engineer To Death In Lagos Due To Disagreement Over N100 Balance",
    "summarized_story": "Nigeria Nigeria Nigeria https://t.co/qfoxlRQGGb.\"\nTo cut the long story short, try were beaten to a pulp and the sound engineer lost his life right there.\n\"As if that was not enough, the sound engineer was burnt right there on the road.\nGoing on at admiralty way lekki phase 1.\nHe was the sound engineer in my church."
  },
  {
    "headline": "Commercial Motorcyclists Beat, Burn Sound Engineer To Death In Lagos Due To Disagreement Over N100 Balance",
    "summarized_story": "Nigeria Nigeria Nigeria https://t.co/qfoxlRQGGb.\"\nTo cut the long story short, try were beaten to a pulp and the sound engineer lost his life right there.\n\"As if that was not enough, the sound engineer was burnt right there on the road.\nGoing on at admiralty way lekki phase 1.\nHe was the sound engineer in my church."
  },
  {
    "headline": "BREAKING: FCT Ministry Demolishes Multi-Million Naira Mansion Belonging To Tonto Dikeh's Ex-lover, Kpokpogri In Abuja",
    "summarized_story": "A multi-million naira mansion belonging to Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has been demolished by the Federal Capital Territory Administration (FCTA) in Abuja.\nSpeaking with SaharaReporters, the owner of the building, Kpokpogri and ex-lover of Dikeh, expressed shock saying he was not pre-informed by the officials about the demolition which he described as illegal.\n\"I don't have any issue with anybody that will warrant the wicked and illegal destruction of my house this morning without any pre-notice from the FCT ministry.\nBecause, my house is seated on a rock and an attraction of everybody; so everybody wants to have my house.\"\nPrince Joseph Kpokpogri has been having a serious battle with his estranged lover, Dikeh, resulting to series of arrest, legal actions and counter-arrest and actions."
  },
  {
    "headline": "BREAKING: FCT Ministry Demolishes Multi-Million Naira Mansion Belonging To Tonto Dikeh's Ex-lover, Kpokpogri In Abuja",
    "summarized_story": "A multi-million naira mansion belonging to Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has been demolished by the Federal Capital Territory Administration (FCTA) in Abuja.\nSpeaking with SaharaReporters, the owner of the building, Kpokpogri and ex-lover of Dikeh, expressed shock saying he was not pre-informed by the officials about the demolition which he described as illegal.\n\"I don't have any issue with anybody that will warrant the wicked and illegal destruction of my house this morning without any pre-notice from the FCT ministry.\nBecause, my house is seated on a rock and an attraction of everybody; so everybody wants to have my house.\"\nPrince Joseph Kpokpogri has been having a serious battle with his estranged lover, Dikeh, resulting to series of arrest, legal actions and counter-arrest and actions."
  },
  {
    "headline": "Corps Member Killed As Security Operatives, Bandits Clash On Kaduna-Abuja Road",
    "summarized_story": "A member of the National Youth Service Corps (NYSC) identified as Aliyu Muhammed Lawal, has died from a stray bullet during a crossfire between security operatives and bandits along Kaduna-Abuja Road.\nThe bandits were said to have been engaged by the security agents while they were trying to cross the highway at Kasarami village at about 8pm on Friday.\nA top police officer in the state who spoke on condition of anonymity because he was not authorised to speak however said about seven bandits were killed during the crossfire.\n“The victim was hit by a stray bullet because there was a serious crossfire between the security agencies and the bandits that tried to cross the main road at Kasarami village which is a route they use.\nBut the security men, among them soldiers, at Rijana engaged them killing about seven of them and recovered motorcycles,” he said."
  },
  {
    "headline": "Oshiomhole undergoes APC senatorial screening -- 10 days after declaring presidential bid",
    "summarized_story": "In what appears to be a u-turn from his presidential ambition, Oshiomhole presented himself for the screening on Saturday in Abuja.\nWith you supporting the project [for me] to be the senator, I will be the senator representing Edo north,” Oshiomhole had said.\nA few days ago, Oshiomhole also declared his intention to contest the 2023 presidential election on the platform of the APC.\nTheCable cannot independently verify if Oshiomhole bought the N100 million APC presidential form.\nThe name of the former governor was not listed among APC presidential aspirants who have submitted their forms, according to a report by THISDAY."
  },
  {
    "headline": "Oshiomhole undergoes APC senatorial screening -- 10 days after declaring presidential bid",
    "summarized_story": "In what appears to be a u-turn from his presidential ambition, Oshiomhole presented himself for the screening on Saturday in Abuja.\nWith you supporting the project [for me] to be the senator, I will be the senator representing Edo north,” Oshiomhole had said.\nA few days ago, Oshiomhole also declared his intention to contest the 2023 presidential election on the platform of the APC.\nTheCable cannot independently verify if Oshiomhole bought the N100 million APC presidential form.\nThe name of the former governor was not listed among APC presidential aspirants who have submitted their forms, according to a report by THISDAY."
  },
  {
    "headline": "10 killed in 'racially motivated' shooting at US supermarket",
    "summarized_story": "Payton Gendron, an 18-year-old white man, has shot dead 10 people in a black neighbourhood of New York state.\nThree others were wounded in an attack described as racially motivated.\nJoseph Gramaglia, Buffalo police commissioner, said the suspect killed nine customers and a retired police officer working as an armed security guard.\nAdvertisementStephen Belongia, special agent in charge of the FBI’s Buffalo field office, told reporters that the shooting is being investigated as “both a hate crime and a case of racially motivated violent extremism”.\nGendron has now been arraigned on a charge of first-degree murder, which carries a sentence of life without parole."
  },
  {
    "headline": "10 killed in 'racially motivated' shooting at US supermarket",
    "summarized_story": "Payton Gendron, an 18-year-old white man, has shot dead 10 people in a black neighbourhood of New York state.\nThree others were wounded in an attack described as racially motivated.\nJoseph Gramaglia, Buffalo police commissioner, said the suspect killed nine customers and a retired police officer working as an armed security guard.\nAdvertisementStephen Belongia, special agent in charge of the FBI’s Buffalo field office, told reporters that the shooting is being investigated as “both a hate crime and a case of racially motivated violent extremism”.\nGendron has now been arraigned on a charge of first-degree murder, which carries a sentence of life without parole."
  },
  {
    "headline": "SEC issues new regulations on issuance, exchange of cryptocurrencies in Nigeria",
    "summarized_story": "The Securities and Exchange Commission (SEC) has released a set of new regulations guiding the issuance, exchange and custody of digital assets in Nigeria.\nThe development is coming more than a year after the commission issued the classification and treatment of digital assets.\nAccording to SEC, a digital asset means a digital token that represents assets such as a debt or equity claim on the issuer.\nAdvertisementBut, in its new regulations, SEC said mandates the registration of “the offering and sale of digital tokens that are considered securities”.\nAccording to the regulation, digital asset actors include digital asset offering platforms (DAOPs), digital asset custodians (DACs), virtual assets service providers (VASPs), and digital assets exchange (DAX)."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Google unveils first smartwatch, new phones, virtual cards and more",
    "summarized_story": "Google also announced updates to several of its most popular tools including Maps, Google Translate and its core search product.\nGoogle search which started from only text queries has over the years added the option to use voice and picture queries options.\nGoogle maps’ new immersive view for cities comes off as a challenger to Apple’s 3D mode map view.\nVirtual cardsSource: GoogleGoogle is rolling out virtual credit cards to help protect users’ financial information while they’re shopping online.\nThese virtual cards are typically used for one-time purchases, but users will also be able to use these cards for subscriptions."
  },
  {
    "headline": "Nigeria’s Central Bank edges close to eNaira use case with much-needed upgrade",
    "summarized_story": "Share this article:Nigeria’s central bank digital currency (CBDC), eNaira, will get an update that will allow it to perform more functions such as bill payment and USSD access.\n“Fundamentally, there were faults that would not have allowed the eNaira to achieve its full potential.”There were issues with setting up the eNaira Speed Wallet application at launch.\nOnly 1.3% had completed a transaction with the eNaira Wallet, while 34.4% were indifferent about the CBDC project.\nHow eNaira USSD could workWhile there’s little detail on how the eNaira will work with USSD, we can make educated guesses on how the service will work based on our understanding of the eNaira and USSD protocols in Nigeria.\nAccording to the CBN, the first tier of Speed Wallet users can set up a wallet without a Bank Verification Number (BVN)."
  },
  {
    "headline": "Interswitch raises $110m",
    "summarized_story": "Perhaps now’s a good time to ask how many fintech startups you know do not provide lending and payment options in Nigeria.\nIntelligence by Techpoint, the data and research arm of Techpoint Africa, has partnered with YC to give an account of its activities in Africa since 2009.\nThe fintech company is well known for its Point-of-Sale terminals and online consumer payment platforms like Quickteller and Verve.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in less than nine days!\nPolygon is sponsoring 50 free tickets to Techpoint Africa Blockchain Summit (TABS), holding on May 21, 2022."
  },
  {
    "headline": "Does Nigeria have too many fintech startups? What the numbers say",
    "summarized_story": "Share this article:There are at least 150 fintech startups in Nigeria, depending on who you ask.\nStatista reports that there were 144 fintech startups as of 2021 and a 2020 McKinsey report puts the number of standalone fintech startups at over 200.\nConsequently, it is not unusual to hear comments on the proliferation of fintech startups in the country, which begs the question, are there too many fintech startups in Nigeria?\nWhile the United States has 8,775 fintech startups for its 334.6 million people, the United Kingdom has 1,600 fintech startups serving 68.5 million people.\nLooking at the numbers, one could say that we need at least 1,000 more fintech startups in the country."
  },
  {
    "headline": "MARA Raises $23M to Build Africa’s Portal to the Crypto Economy",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nMARA Chain – a layer-1 blockchain, powered by the native MARA token, that gives savvy developers a place to build decentralized applications that will help shape the future of the African crypto economy.\nThe MARA Chain will launch later in 2022, giving savvy developers a place to build decentralized applications that will help shape the future of the African crypto economy.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "5 Organisations providing ‘Tech’ and ICT solutions for SMEs in Nigeria",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nSMEDANSmall and Medium enterprise development agency of Nigeria commonly known as SMEDAN, organizes e-business and empowerment training for young entrepreneurs across Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Cabinet reshuffle: Buhari’s opportunity to engage technocrats – Experts",
    "summarized_story": "Ahead of the planned Cabinet reshuffle by President Muhammadu Buhari, Nigerians have advised him to see it as an opportunity to revamp the ailing economy, through appointment of technocrats.\nThey were given up to Monday to resign, so they can either resign or decide to remain in office,” he said.\nHe also urged the Buhari administration to push the modular refineries issues beyond the current efforts, by waiving some of the payments.\n“The government can encourage governments at the sub-national levels to come in and invest in building these refineries,” he said.\nAccording to him, “Most ridiculous of them all is the case of Governor of the Central Bank of Nigeria."
  },
  {
    "headline": "Intrigues await aspirants at APC, PDP presidential primaries",
    "summarized_story": "The ruling All Progressives Congress (APC) and the main opposition People’s Democratic Party (PDP) will hold their presidential primaries between May 28 and 30, 2022.\nObservers say that the contest for the presidential ticket in the APC may be between the consensus candidate and Tinubu in the primary.\nEzegwu predicted that the presidential primaries of the two major political parties may not be predictable as many Nigerians may think.\nAccording to him, “The forthcoming presidential primaries of the two major political parties in the country would be interesting.\nThe PDP Presidential primaries were strictly zoned to the north for the 2019 election."
  },
  {
    "headline": "APC nets over N28 billion from sale of presidential, governorhsip, NASS forms",
    "summarized_story": "The All Progressives Congress (APC) has generated over N28 billion from the sale of expression of interest and nomination forms to presidential, governorship and National Assembly aspirants.\nAPC fixed the cost of presidential forms at N100 million, governorship for N50 million; Senate at N20 million and of Representatives for N10 million.\nAt the end of the sale and submission of forms, there are 28 presidential aspirants, 145 governorship contenders, 351 contestants for the senate and 1197 House of Representatives aspirants.\nThe sale of forms for the State Houses of Assembly is handled by the respective state secretariats of the party.\nArgungu also said the screening for the presidential aspirants begins on May 24, adding that some contenders for the highest office have started withdrawing from the race."
  },
  {
    "headline": "Obaseki receives Saraki in Edo, as former Senate President meets Edo PDP delegates – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, has received former Governor of Kwara State and ex-Senate President, Sen. Olubukola Saraki in the state.\nThe governor hosted Saraki, who is a presidential aspirant under the Peoples Democratic Party (PDP), at the Government House on Saturday, in Benin City.\nSaraki is to meet with PDP delegates in the state after the courtesy call on the governor.\nThe housing sector will stimulate the economy, create jobs for the youths and improve lives for the people.\n“My plan is to have vocational training for about one million people and stop importing workers in the housing sector."
  },
  {
    "headline": "Obaseki intensifies ongoing construction of Edo agric hub – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government will sustain investment in the agriculture sector in a renewed effort to attain food sufficiency, drive job creation and improve livelihoods.\nThe governor, who spoke to journalists in Benin City, said his government has intensified ongoing construction of the Edo Agricultural Development Hub, reassuring timely completion of the projectThe Edo State Commissioner for Agriculture and Food Security, Mr. Stephen Idehenre, who spoke on behalf of the governor, said the government has also completed the construction of an input warehouse to support agricultural production at the Edo Agricultural Development Hub.\nHe noted that the ongoing construction work on the Edo Agricultural Development Hub comprises administrative building (Ministry, ADP and Donor Project offices), state-of-the-art agricultural processing factory, farm mechanization hub, pig and poultry production prototype buildings, and produce/soil laboratory, among others.\n“We have also established a Mechanization Hub, and purchased tractors and Harvesters to boost agricultural production and reduce drudgery.”“In addition to these programmes, we are making progress with the construction of the Edo Agricultural Development Hub.\nThe hub will house the administrative building (Ministry, ADP and Donor Project offices), state-of-the-art agricultural processing factory, farm mechanization hub, pig and poultry production prototype buildings, and produce/soil laboratory, among others,” he added."
  },
  {
    "headline": "Continuous Voters Registration to end soon- INEC …as CSOs charge INEC to do more to improve on the conduct of Ekiti election – Nigerian Observer",
    "summarized_story": "Continuous Voters Registration to end soon- INEC …as CSOs charge INEC to do more to improve on the conduct of Ekiti electionShare FacebookTwitterStumbleuponLinkedInPinterestChairman of the Independent National Electoral Commission, INEC, Prof. Mahmood Yakubu has said the on-going continous voters registration exercise nationwide will be ending soon.\nAccording to the chairman, the ongoing Continuous Voter Registration (CVR) exercise will be ending on the 30th June 2022.\nThese Regulations and Guidelines, together with the Constitution and the Electoral Act, constitute the electoral legal framework that govern the conduct of elections.\n“There are many progressive provisions of the Electoral Act 2022 which require clear understanding to guide implementation.\n“Section 54(2) of the Electoral Act makes provision for assistive materials for Persons with Disabilities (PWDs)."
  },
  {
    "headline": "Gov Obaseki committed to special, inclusive education – Edo SUBEB – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – Stakeholders in the special education sector have chatted a roadmap with a view to making education available and accessable to every child irrespective of their disability and location in Edo state.\n“His Excellency is absolutely committed to special and inclusive education”, Salami said while describing the workshop as “timely”.\nExecutive Director of NAPVID, Barr Melody Omosah expressed appreciation to the governor for his administration’s partnership with the organization.\nAccording to Omosah, inclusive education is the core of inclusive governance hence NAPVID is working closely with the state government to ensure the mainstreaming of appreciable numbers of persons with disabilities into the public service is achieved.\n“I want to thank Mr governor for the partnership and we are over confident that this will be sustained throughout his term."
  },
  {
    "headline": "2023: Lawan’s candidature’ll rock like hurricane, 9 aspirants to step down for him – Orji Kalu",
    "summarized_story": "Senate Chief Whip and former governor of Abia State, Orji Uzor Kalu, has said nine presidential aspirants of the All Progressives Congress (APC) are ready to step down to for Ahmad Lawan, president of the senate.\nLawan, a late entrant into the 2023 presidential race, obtained the N100 million APC presidential forms last week.\nThe issue of the APC presidential candidate will be settled even before the primaries.\nAs I am talking to you, about nine presidential aspirants from our party have intimated me of their plans to drop their presidential ambition to support Ahmad Lawan.”“Does that not signify victory before the election?\nINEC should discipline any party that fails to meet up, because that is the only way they can take their jobs seriously,” Kalu said."
  },
  {
    "headline": "Deborah’s Murder: Only truth can heal the wounds — Pat Utomi",
    "summarized_story": "Utomi who reacted to the incident in a statement he personally signed and Titled, “A TIME TO LEAD”, blamed the current insecurity bedevilling the country on a lack of worthy leadership.\n“The incidents in Sokoto in the last two days have opened a deep wound in the Soul of our country.\nThe only thing that can heal this deep gash now is leadership and truth, like the sore in the saying by the founder of the caliphate Uthman Dan Fodio.\nOnly truth can heal this one.\nThe Sokoto state government has imposed a one-week curfew after youths protested the arrest of the perpetrators."
  },
  {
    "headline": "What Nnamdi Kanu told me – Soludo says as he visits IPOB leader",
    "summarized_story": "Anambra State governor, Charles Soludo, at the weekend, paid a visit to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nKanu who is facing treason trial, is being detained by the the federal government in Abuja.\nThe Anambra governor who announced his visit early Sunday said, it was aimed at finding lasting peace to the issue of insecurity in the Southeast.\nHe said the IPOB leader is unhappy with killings in the southeast and expressed sadness over the development.\n“He (Kanu) expressed sadness over what he described as ‘sacrilegious killings’ of innocent persons, kidnappings and all forms of criminalities, including the brutal enforcement of the senseless ‘sit at home’ perpetuated by sundry groups claiming to be acting for or on behalf of IPOB,” Soludo said."
  },
  {
    "headline": "Nigeria’s GDP grows by 3.98% in Q4 2021— NBS",
    "summarized_story": "Nigeria’s Gross Domestic Product (GDP) increased by 3.98 per cent in the fourth quarter of 2021, according to figures from the National Bureau of Statistics (NBS) Quarterly Report released in Abuja on Saturday.\nThe report said Nigeria’s GDP grew by 3.98 per cent year-on-year in real terms in the fourth quarter of 2021.\n“The Q4 2021 growth rate was higher than the 0.11 per cent growth rate recorded in Q4 of 2020 by 3.87 per cent points and lower than 4.03 per cent recorded in Q3 of 2021 by 0.05 per cent points.\n“Nevertheless, quarter on quarter, real GDP grew at 9.63 per cent in Q4 of 2021 compared to Q3 of 2021, reflecting a higher economic activity than the preceding quarter.\nThe report revealed that the non-oil sector grew by 4.73 per cent in real terms during Q4 of 2021."
  },
  {
    "headline": "2nd Term Governors Name Likely Successors For 2023",
    "summarized_story": "Nineteen of the 36 state governors are in their second and final terms in office and will exit on May 29, 2023.\nOur correspondents compiled reports on who the governors have endorsed or are believed to be backing and, thus, likely to win their party tickets.\nObservers are narrowing the PDP governorship candidature to a two-horse race between Manir Muhammad Dan’Iya and Muktari Shagari.\nThere is also a cold war between the governor and former governor James Ibori over who should take over in 2023.\nSeven governorship aspirants have already been screened and cleared to contest the governorship primaries under the PDP in the state."
  },
  {
    "headline": "Atiku To PDP: We’re Finished If We Lose 2023 Poll",
    "summarized_story": "Atiku, who was addressing PDP delegates at the state secretariat of the party in Port Harcourt yesterday, appealed to the delegates of the PDP in Rivers State to give him 60 percent of their votes in the forthcoming presidential primariy of the party.\nHe was accompanied on the visit by former Adamawa State governor, Boni Haruna, former Senate Leader, Senator Abdul Ningi and Chairman of Daar Communications, Chief Raymond Dokpesi.\nHe said: “PDP must win this time; we have been in the opposition for eight years.\n“If the PDP fails to win the presidential election in 2023, we are finished.\nAtiku said: “Governor Wike was in Adamawa recently to meet with our delegates, he asked for 50 percent of the votes."
  },
  {
    "headline": "APC Shifts Screening Of Presidential Aspirants To May 23",
    "summarized_story": "The ruling All Progressives Congress (APC) yesterday commenced screening of governorship and National Assembly aspirants, with a pledge to pick credible candidates for the 2023 general election.\nThis is even as the governing party has fixed Monday May 23 for screening of its presidential aspirants.\nSpeaking during the inauguration of the screening committees in Abuja, national organizing secretary of the party, Suleiman Muhammad Argungu, gave a breakdown of the number of the contenders to include 28 presidential aspirants, 145 governorship aspirants, 351 senatorial aspirants and 1,197 aspirants for the House of Representatives.\nArgungu said, “We have so far 145 aspirants for the gubernatorial and we have constituted three panels to screen the governorship aspirants.\nThe governorship and senatorial aspirants were directed to return by 7pm for their screening at Frasier suits, Abuja."
  },
  {
    "headline": "APC Shifts Screening Of Presidential Aspirants To May 23",
    "summarized_story": "The ruling All Progressives Congress (APC) yesterday commenced screening of governorship and National Assembly aspirants, with a pledge to pick credible candidates for the 2023 general election.\nThis is even as the governing party has fixed Monday May 23 for screening of its presidential aspirants.\nSpeaking during the inauguration of the screening committees in Abuja, national organizing secretary of the party, Suleiman Muhammad Argungu, gave a breakdown of the number of the contenders to include 28 presidential aspirants, 145 governorship aspirants, 351 senatorial aspirants and 1,197 aspirants for the House of Representatives.\nArgungu said, “We have so far 145 aspirants for the gubernatorial and we have constituted three panels to screen the governorship aspirants.\nThe governorship and senatorial aspirants were directed to return by 7pm for their screening at Frasier suits, Abuja."
  },
  {
    "headline": "Malami Confirms Withdrawal From Kebbi Governorship Race",
    "summarized_story": "Attorney General of the Federation and Minister of Justice, Abubakar Malami, has confirmed that he has not resigned from office, sayinghe rather withdrew his ambition to contest for the 2023 Kebbi State gubernatorial election.\nAccording to the special assistant to the minister on media and public relations, Dr. Umar Jibrilu Gwandu, Malami has the right to choose to voluntarily shelve his gubernatorial ambition.\nDr Gwa.du said; ‘’It is a matter of personal conviction and individual right which didn’t violate any law.\n‘’Right thinking members of the society accord respect to individual’s right to freedom of choice in matters relating to this.\n‘’As individual Nigerian citizens with inalienable fundamental rights, we are not aware of any legally justifiable and reasonable tenable obligations compelling the person of Abubakar Malami, SAN or as an Attorney General of the Federation to do otherwise."
  },
  {
    "headline": "Milan, Dubai-bound Tramadol, Ecstasy busted in Lagos [Video]",
    "summarized_story": "Operatives of The National Drug Law Enforcement Agency have foiled fresh bids by drug cartels to export Tramadol, Ecstasy MDMA and Cannabis to Milan and Dubai.\nThe export bids were busted at the Murtala Muhammed International Airport, MMIA, Ikeja Lagos.\nThe operatives also seized 203, 879 tablets of various pharmaceutical opioids and illicit substances in raids across Abia, Kaduna, Yobe and Kogi state.\nIn Abia, three trucks loaded with drugs coming from Lagos and Onitsha, Anambra were intercepted in Aba, Abia state.\nRecovered from him include: 45,000 tablets of Diazepam weighing 41.5kg; 50,000 tablets of Exol, weighing 15.6kg; 1,500 tablets of Rohypnol weighing 700 grams and 300 bottles of codeine weighing 41.5kg."
  },
  {
    "headline": "Gov. Soludo hails Obi of Onitsha Alfred Achebe",
    "summarized_story": "By Chimezie AnasoGovernor Chukwuma Soludo has congratulated Igwe Alfred Achebe, the Obi of Onitsha, on his 81st birthday anniversary.\nSoludo also congratulated Achebe on his 20th-year reign on the throne and described him as a man of exemplary life and outstanding leadership qualities.\nHe said Achebe, who was also the Chairman of Anambra State Council of Traditional Rulers and the Southeast Council of Traditional Rulers, had provided wise counsel and contributed immensely to the growth and development of Anambra, Southeast and the country.\n“As Igwe Achebe marks his 81st birthday anniversary, I join millions of Nigerians and well-wishers home and abroad in celebrating the auspicious occasion and wish him many more years of good health, wisdom and selfless service to God and humanity.\n“Governor Soludo also leverages this occasion to congratulate HRM Igwe Nnaemeka Achebe on his 20th anniversary as the Obi of Onitsha,” he said."
  },
  {
    "headline": "Bishop Kukah Commends Tambuwal’s Action, Debunks Attack On Residence",
    "summarized_story": "The Catholic Bishop of Sokoto Dioceses, Most Reverend Matthew Kukah has commended the state Governor, Rt.\nThe development however prompted Governor Tambuwal to swiftly declare a 24-hours curfew in the city.\nReacting, Most Reverend Kukah, in a statement signed by the Director of Social Communications of the Catholic Diocese of Sokoto, Reverend Father Christopher A. Omotosho, commended Gov.\nBishop Kukah, in the statement, also debunked the rumored attack on his residence.\n“Contrary to information in circulation, we wish to disclaim that there was attack on any sort on the residence of Bishop Matheny Hassan Kukah”."
  },
  {
    "headline": "BREAKING: Jihadists In Borno Plot To Kill Another Young Woman For Alleged Blasphemy, Post Death Threats On Facebook",
    "summarized_story": "BREAKING: Jihadists In Borno Plot To Kill Another Young Woman For Alleged Blasphemy, Post Death Threats On FacebookSome religious extremists in Borno State have threatened to kill a young woman named Naomi Goni, accusing her of insulting Prophet Muhammad (SAW) on Facebook.\nIn the Borno episode, SaharaReporters learnt that the police had taken Naomi Goni into custody over the death threats by the Jihadists.\nWriting partly in Hausa, Tanko Izge said, “A message to Government of Borno State.\nAkwai wata yarinya me suna Naomi Goni wanda tayi batanci ga manzo Allah wanda hakan a musulunci kisa ne hukunci Ko da soho ne koda musulmi ne ya kafurta.\nWe therefore call on the Borno State Government to take immediate action or else we Muslims will not sleep and we will take action).”He made the post on his Facebook as seen by SaharaReporters."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: Terrorists Free Pregnant Woman Among Abducted Passengers",
    "summarized_story": "Terrorists who kidnapped and attacked passengers on an Abuja-Kaduna train have released one of their captives, a pregnant woman.\nThe woman was reportedly let free, though it is unclear whether her family members paid a ransom.\nMeanwhile, a woman dressed in black Muslim robes and wearing a face mask claimed that the terrorists had released her due to her health.\nShe urged the Nigerian authorities to talk with the kidnappers in order to free the other victims held captive in their cave.\nThe terrorists are taking care of us; they feed us well and give us our medication.”It could be recalled that the terrorists attacked a train on the Abuja-Kaduna Railway on March 28, where at least eight passengers were killed in the incident."
  },
  {
    "headline": "BREAKING: Sokoto Residents Plan Mass Protest Over Police Arrest Of Suspected Killers Of Female Student, Claim Suspects Were ‘Defending Islam, Prophet Muhammad’",
    "summarized_story": "Some residents of Sokoto State will on Saturday embark on a “mass” protest against the arrest of two people suspected to be involved in the killing of a female student of Shehu Shagari College of Education, identified as Deborah Samuel, for alleged blasphemy.\nFollowing the incident, the police in Sokoto said two suspects had been arrested and taken into custody.\nAccording to the Sokoto police spokesman, Sanusi Abubakar, the mob overpowered campus security before killing the female student and setting her remains on fire.\nHowever, a leaflet obtained by SaharaReporters on Saturday, written in Hausa, asked Muslims to come out en mass to protest against the arrest.\n“We’re inviting Muslims in Sokoto to come and help them rescue our brothers that were arrested because they were defending Islam and uplifting prophet Muhammad S.A.W,” the leaflet read."
  },
  {
    "headline": "Kawo ƙarshen cutar maleriya a Afirka",
    "summarized_story": ""
  },
  {
    "headline": "Ko kamfanin NNPC zai iya magance matsalar tsadar mai a Nijeriya?",
    "summarized_story": ""
  },
  {
    "headline": "Jamhuriyar Afirka ta tsakiya (CAR) ta mayar da Bitkoyin kuɗin ƙasarta",
    "summarized_story": ""
  },
  {
    "headline": "Najeriya ce ta 8 a jerin ƙasashen da ake sayar da fetur da arha – Bincike",
    "summarized_story": ""
  },
  {
    "headline": "TCN reconstructs vandalized transmission tower in Uyo",
    "summarized_story": "… Set to energise transmission line soonBy Onu OkorieTransmission Company of Nigeria TCN has disclossed that the reconstruction works on the vandalized transmission Tower Number 104 on Odukpani – Ikot Ekpene 330kV double-circuit transmission line in Akwa Ibom has been completed, while work is ongoing to fortify other towers minimally vandalized along the same line route, to enable the restringing and tensioning of the 330kV DC transmission line, before it is energized.\nThe Executive Director, Transmission Service Provider (TSP) at TCN, Engr.\nAdewumi, who briefed newsmen at the site, said the tower has been reconstructed and work has reached an advanced stage after three weeks, even with difficulties posed by the terrain.\nAdewumi appealed to the public to help TCN in the fight against the vandalism of power infrastructure, saying that such acts are detrimental to Nigerians and the expansion of power infrastructure in Nigeria.\nHe also assured residents of Cross River State and parts of Akwa Ibom State that the company was fast-tracking the completion and restoration process."
  },
  {
    "headline": "Mastercard Foundation subsidized loans will break barriers to MSMEs productivity in Nigeria – Mrs Edu",
    "summarized_story": "By Onu OkorieThe Managing Director, First City Monument Bank FCMB, Yemisi Edun has described the Mastercard Foundation subsidized loans to 100,000 Micro, Small, and Medium Enterprises MSMEs as a purpose-driven intervention that would further help break the barriers that limit MSMEs’ productivity and overall success in Nigeria.\nThe program, which is part of the Mastercard Foundation’s Young Africa Works strategy in Nigeria, aims to sustainably move Nigerian youth out of poverty.\nThe remaining 30 percent will be deployed to meet the funding needs of youth-owned enterprises and businesses run by vulnerable members within Nigeria.\nShe said, “The past few years have been very challenging for individuals, households, and businesses in Nigeria.\n“We are proud to partner with the Mastercard Foundation to rebuild businesses, drive recovery, and stimulate economic growth by providing the much-needed support to Nigerians to engage in productive activities."
  },
  {
    "headline": "ABCON unveils roadmap on ‘save naira’ campaign",
    "summarized_story": "By Kehinde Ibrahim, LagosAssociation of Bureaux De Change Operators of Nigeria (ABCON) has developed a roadmap campaign plan needed to save the naira from further decline and enhance exchange rate stability.\nThe ABCON National Executive Council said the move to save the naira was agreed by the body at the conclusion of its meeting in Lagos, where it unveiled strategies for save the local currency, bridge the exchange rate gaps and curb volatility in the forex market.\nThe naira exchanges at N596 to dollar at the parallel market and N415.83 to dollar at the official market creating a rate gap of N180.17 per dollar.\nGwadabe insisted that now is the time to break the current industry monopoly that puts the remittances market in the hands of few players depriving others from tapping into the plan.\nThe ABCON can also be recognized as self-regulatory organization to enable it operate effectively and sanction erring members,” he stated."
  },
  {
    "headline": "Nigeria set to become destination for medical tourism, reverse brain drain – Mohammed",
    "summarized_story": "By Palma IleyeMinister of Information and Culture, Alhaji Lai Mohammed, has said that with the establishment of world class healthcare facilities in Nigeria, the country was set to become a destination for medical tourism, in addition to reversing the brain drain in the health sector.\nMohammed who spoke after a media tour of Duchess International Hospital in Lagos, said the world class healthcare facilities springing up in Nigeria will also curb medical tourism abroad, conserve foreign reserves and create jobs.\n“Today, we are here at the Duchess International Hospital.\nThe Minister said the Federal Government, through the Central Bank of Nigeria and the Bank of Industry, provided financial support for Duchess International Hospital, as part of its intervention in the health sector.\n“With that, we can conserve our foreign reserves, earn foreign exchange for the country, create jobs, reverse brain drain, become a destination for medical tourists and also ensure affordable and standard healthcare for Nigerians,” he said."
  },
  {
    "headline": "Halo financial services launches into Nigeria Fintech space",
    "summarized_story": "By Kehinde Ibrahim, LagosHALO Financial Services Ltd, a fintech start-up has launched with an innovative approach to help Nigerians manage and grow their money.\nSpeaking at a media round table to introduce the company, the Chief Executive Officer and co-founder, Chidimma Onyeokoro disclosed that Halo enables communities to provide financial services to their members.\nCommunity members are able to leverage the strength of their union for better financial returns.\nBy focusing on communities, Halo will be able to scale faster.\nThis allows us to offer a full spectrum of financial services from basic banking to sophisticated investments."
  },
  {
    "headline": "Kaduna Train Attack: Terrorists Release Kidnapped Pregnant Woman",
    "summarized_story": "A pregnant woman who was one of the abducted passengers in the Kaduna train attack of March 28, has been released by the terrorists.\nA member of the Concerned Relatives of Abducted Persons, Sani Musa confirmed the development to Channels Television on Sunday.\nThe pregnant woman, Thamina Mahmood, was said to have been released in compassionate spirit on Saturday afternoon after she and 61 others had spent 45 days in captivity.\nShortly after her release, the freed lady was seen in a viral video, where she appealed to the Federal Government to negotiate with the terrorists.\nAccording to her, the appeal has become necessary because of the uncertainty surrounding the plight of other kidnap victims who are still in the custody of the terrorists inside the forest."
  },
  {
    "headline": "Deborah Samuel: Northern Governors Condemn Sokoto Killing, Appeal For Calm",
    "summarized_story": "The Northern Governors Forum (NGF) has condemned the killing of Deborah Samuel, a student of Shehu Shagari College of Education Sokoto who was killed on allegations of blasphemy.\nChairman of the forum Simon Lalong and Governor of Plateau State in a statement expressed the governors’ concern about the development which was clearly an extra-judicial measure of addressing perceived infractions.\nCitizens of the region and Nigerians were also called upon to show love, tolerance, and respect for one another irrespective of faith, ethnicity, or other affiliations.\nDeborah, a second-year student of the Shehu Shagari College of Education in Sokoto State, was killed on Thursday following an allegation that she had blasphemed the prophet of Islam.\nHer death has sparked outrage from various individuals and groups across the country, including the Christian community who demanded that her killers be brought to justice."
  },
  {
    "headline": "Sokoto: Bishop Kukah Says He Is Safe, House Not Burnt As Curfew Commences",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Mathew Kukah, on Saturday said he is safe after protests rocked parts of Sokoto city over the detention of two persons linked to the gruesome killing of Deborah Samuel.\nContrary to some reports online, the Bishop also told Channels Television that his house was not set ablaze.\nIn a statement sent to Channels Television, Kukah called for calm and commended Governor Aminu Tambuwal for acting promptly by declaring the curfew.\nHe noted that all Masses in Sokoto metropolis have been suspended until the curfew is lifted.\nCalm returningMeanwhile, calm appears to be returning to Sokoto city after the earlier violence, according to a Channels Television correspondent in the city."
  },
  {
    "headline": "Deborah’s Killing: Tambuwal Declares 24-Hour Curfew In Sokoto Metropolis",
    "summarized_story": "﻿Governor Aminu Tambuwal of Sokoto State has declared a 24-hour curfew within the metropolis in a bid to prevent a curtail further spread of civil unrest trailing the death of Miss Deborah Samuel.\nHe announced the curfew on Saturday at the Government House in Sokoto, the state capital.\nGovernor Aminu Tambuwal of Sokoto State has declared a 24-hour curfew within the metropolis in a bid to prevent a curtail further spread of civil unrest trailing the death of Miss Deborah Samuel.He announced the curfew on Saturday at the Government House in Sokoto, the state capital.\nDeborah, a second-year student of the Shehu Shagari College of Education in Sokoto State, was killed on Thursday following an allegation that she had blasphemed Muhammad (SAW), the prophet of Islam.\n“I appeal to the good people of Sokoto state to kindly continue to observe law and order and calm down (on the) restiveness currently pervading in the metropolis."
  },
  {
    "headline": "COVID-Hit Shanghai Announces Gradual Reopening Of Businesses",
    "summarized_story": "Shanghai announced a gradual reopening from Monday of businesses, though it remains unclear when the millions of people still locked down in China’s economic capital will finally be allowed out of their homes.\nThe rigid strategy to root out virus cases at all costs has wreaked havoc on supply chains, crushed small businesses and imperilled the country’s economic goals.\nShanghai vice mayor Chen Tong on Sunday announced a reopening of businesses “in stages” from May 16.\nBeijing has repeatedly tested its residents and locked down buildings with positive cases and closed metro stations and non-essential businesses in certain neighbourhoods.\nIn an attempt to curb the outbreak, Fangshan district in the southwest of Beijing, which has 1.3 million residents, suspended taxi services from Saturday."
  },
  {
    "headline": "APC inaugurates screening committee ahead party's primaries",
    "summarized_story": "The National Working Committee of the All Progressives Congress has inaugurated its screening committee ahead of the party’s primaries scheduled for 30th of May.The party set up various panels for its two-day screening of 1,693 aspirants.\nThe development was disclosed by the APC National Organising Secretary, Sulaiman Argungu, shortly after the inauguration of chairmen and secretaries of the screening committees.\nHe also disclosed that the party has a set of guidelines in the aspirant assessment and verification forms that will be given to each committee for the screening.\nThe Electoral umpire also says it is ready to monitor political parties’ primary election ahead of the next election and dateline is non-Negotiable.\nHe stated that candidates should send UTMERESULT to 55019 using the same phone number used to register for the examination."
  },
  {
    "headline": "APC Screening for NASS, Governorship candidates Starts in Abuja -",
    "summarized_story": "The All Progressives Congress.APC, has inaugurated the screening committees for its House of Representatives, Senate and Governorship aspirants.\nThe committees were inagurated on Saturday and have since commnced work.https://www.tvcnews.tv/purplegold/post.php?post=197134&action=edit#The screening exercise for each of the three committees has since commenced at various designated centres in Abuja.\nA statement by the National Organising Secretary of the APC, Sulaiman Muhammad Argungu, in Abuja indicated Chairmen and Secretaries of the committees will be inaugurated by noon while the screening exercise will begin immediately at various centres.\nAspirants for the House of Representatives will be screened at Zeus Paradise Hotel, Mabushi, in Abuja while Senatorial and governorship aspirants will have their exercise carried out at Fraser Suites, within the Central Business District, Abuja.\nThe publication of the screening exercise is expected to be released on Sunday."
  },
  {
    "headline": "Why I deleted tweet condemning murder of Sokoto student",
    "summarized_story": "The People’s Democratic Party’s Presidential Hopeful, and former Vice President, Atiku Abubakar says the directive to pull down the reaction to the killing of Sokoto College student, Deborah Samuel should not be misconstrued for condoning religious intolerance.\nThe former vice president said he has been loud on religious issues that tend to divide NigeriansMr. Abubakar spoke, this Friday when he visited Governor Godwin Obaseki in continuation of his effort to woo delegates ahead of the PDP presidential primaries"
  },
  {
    "headline": "DSS Distances Self from alleged Tenure Elongation plot -",
    "summarized_story": "The Department of State Services (DSS) has distanced itself from media reports that it called for the elongation of the tenure of President Muhammadu Buhari.\nIn a press statement e-signed and released to the National Association of Online Security News Publishers, NAOSNP by the Service’s Spokesperson, Peter Afunanya on Thursday stated that, “The attention of the Department of State Services (DSS) has been drawn to a misleading and mischievous publication by SaharaReporters titled Nigeria’s Secret Police, DSS Tests the Water on Tenure Elongation for Buhari, Tells Journalists, CSOs 2023 Elections May Not Hold.\nIn the said report, the Service was accused of informing participants at its April 6th brainstorming session with CSOs/NGOs that the 2023 general elections might not hold due to insecurity.\nThe Online paper, in its characteristic gutter journalism, had initially claimed that participants at the session were harassed.\nWhile the Service, in the circumstance, aligns with the Presidency, it urges the public to disregard the lies of SaharaReporters and its promoter whose activities are usually antithetical to a decorous environment.https://www.tvcnews.tv/purplegold/post-new.php#It is common knowledge that SaharaReporters is mischievously desperate and takes delight in promoting negative narratives against Government and its officials."
  },
  {
    "headline": "Elon Musk Says Twitter Legal Team Told Him He Violated an NDA",
    "summarized_story": "Elon Musk on Saturday tweeted that Twitter Inc’s legal team accused him of violating a nondisclosure agreement by revealing that the sample size for the social media platform’s checks on automated users was 100.\n“Twitter legal just called to complain that I violated their NDA by revealing the bot check sample size is 100!” tweeted Musk, chief executive of electric car maker Tesla Inc.Musk on Friday tweeted that his $44-billion cash deal to take the company private was “temporarily on hold” while he awaited data on the proportion of its fake accounts.\nread moreHe said his team would test “a random sample of 100 followers” on Twitter to identify the bots.\nHis response to a question prompted Twitter’s accusation.\nHe later said that “There is some chance it might be over 90% of daily active users.”"
  },
  {
    "headline": "Buffalo Shooting: Ten Dead in Suspected Race Attack at New York State Store",
    "summarized_story": "An 18-year-old white man has shot dead 10 people in a black neighbourhood of New York state in what authorities are calling a racially motivated attack.\nThe man, named as Payton Gendron in court papers, was arrested after a stand-off at the scene – a supermarket in the city of Buffalo.\nThe suspect is believed to have driven for some 200 miles to reach the predominantly black area of the city.\nThirteen people were shot in total and the majority of the victims were black, Buffalo Police Commissioner Joseph Gramaglia said.\nHe said the suspect surrendered his weapon after a tense stand-off and was taken into custody."
  },
  {
    "headline": "Buhari Congratulates New UAE President Sheikh Zayed, Says Nigeria Expects Improved Relations",
    "summarized_story": "RelatedStories No Content AvailableNigeria’s President Muhammadu Buhari has congratulated the new President of the United Arab Emirates, Sheikh Mohamed bin Zayed, who was elected President by a Federal Supreme Council to succeed his half-brother, the late Sheikh Khalifa Bin Zayed.\n“Your predecessor made a mark in the impressive transformation of the UAE, making it a vast business and tourist attraction, building infrastructure, and creating one of the best living standards in the world.\nI’m confident that you’re going to build on this great legacy created by your half-brother.”According to the President: “Nigeria looks forward to greater cooperation with the UAE which has tremendously helped Nigeria in tracking down illegal assets and tracing terrorist funds”He added that “Dubai is a reliable partner for the progress of Nigeria and I’m confident that under the new leader, such cooperation will grow bigger and stronger.\n“I wish President Sheikh Mohammed bin Zayed God’s guidance and wisdom in the discharge of this enormous responsibility,” President Buhari prayed.\nDeji Elumoye in Abuja"
  },
  {
    "headline": "A Big Night for ‘Rattlesnake – The Ahanna Story’ at 8th AMVCA",
    "summarized_story": "The Ramsey Nouah-directed movie ‘Rattlesnake – The Ahanna Story’ took home the top three awards, including Best Director, Best Actor and Best Actress awards.\nThe win was a first for its lead actor Stan Nze and an emotional Osas Ighodaro.\nThe Best Overall Movie sponsored by Amstel Malta went to Izu Ojukwu and Okey Ogunjiofor’s film ‘Amina,’ which had the highest number of nominations.\nThe trailblazer award went to Teniola Aladese while Industry Award went to Taiwo Ajai-Lycett.\nReturning after the pandemic year, The 2022 AMVCA celebrated creative talents in the film, digital and TV platforms."
  },
  {
    "headline": "Nine APC Presidential Aspirants Set to Step down for Senate President Lawan, Says Orji Kalu",
    "summarized_story": "The Chief Whip of the Senate, Senator Orji Uzor Kalu, on Saturday disclosed that nine presidential aspirants of the ruling All Progressives Congress (APC) are set to step down and support the presidential ambition of the Senate President, Dr. Ahmad Lawan.\nAPC has 25 presidential aspirants, who met the deadline for the submission of their forms.\nKalu, who was the first to drop his presidential ambition in support of Lawan on the grounds of failure of APC to zone the presidential ticket to the South-east, did not, however, disclose the names of the aspirants.\nThe issue of the APC presidential candidate will be settled even before the primaries.\n“As I am talking to you, about nine presidential aspirants from our party have intimated me of their plans to drop their presidential ambition to support Ahmad Lawan."
  }
]