[
  {
    "headline": "Again, bandits hit Niger, kill 30, Kaduna shuts phone services",
    "summarized_story": "“The relevant federal agencies have today informed the Kaduna State Government that the processes for telecoms shutdown in parts of the state have commenced.\nHe said, “I applaud the Kaduna State governor on the ban.\n“Now that the Kaduna State governor has banned their operations, the next thing you will see is that most of them will start moving to Abuja, Nasarawa and Niger because there is no heat in these places.\nHe said, “When you ban Okada, what options have you given them?\nSo, there is a need to restore sanity on the roads.”The PUNCH gathered that Lagos State would soon get tough with okada riders."
  },
  {
    "headline": "Suspect on trial for robbery, cow thief kidnaps manager, collects N7m",
    "summarized_story": "A suspect, Suleiman Ibrahim, was paraded on Wednesday at the Katsina State Police Command headquarters .\nIbrahim also confessed to have participated in the kidnap of the Regional Manager of Sokoto Rima River Basin Authority in July, 2021.\nHe confessed that he and his gang members collected N7m ransom before the River Basin Manager was released.\nWe have taken part in many attacks; kidnapping and cattle rustling in villages under Danmusa ,Safana, Dutsinma and Batsari LGAs in Katsina State.\nWe made millions of naira from the business of kidnap and cattle rustling."
  },
  {
    "headline": "‘Say No Campaign’, community networks resolve to expose corrupt contractors in Enugu, Akwa Ibom States",
    "summarized_story": "By Gabriel Ewepu – AbujaAs Nigerians suffer lack of basic amenities to make life comfortable, a non-profit making organization, Say No Campaign and Community networks, yesterday, resolved to expose corrupt contractors who have failed to execute projects awarded to them in Enugu and Akwa Ibom States.\n“The team monitored ongoing projects in the National Arbovirus and Vectors Research Centre to avoid proliferation of abandoned projects in the State.\n“They have taken actionable steps to ensure a satisfactory completion of projects monitored so far, and revisiting of abandoned projects by project contractors.\nThe Resident Commissioner, Amedu Sule expressed willingness to work with the network in enforcing accountability in Enugu State.\nHe also assured the network his commitment to support the network in escalating their demands with the appropriate institutions."
  },
  {
    "headline": "Buhari greets former deputy speaker, Chibudom Nwuche at 60",
    "summarized_story": "President Muhammadu Buhari has felicitated with former Deputy Speaker of House of Representatives, Rt.\nChibudom Nwuche, as he turns 60.\nThe statement read: “President Muhammadu Buhari warmly felicitates with former Deputy Speaker of House of Representatives, Rt.\nChibudon Nwuche and his family, as he turns 60 on September 30, 2021, praying that the Almighty God will continue to guide and protect him.\n“President Buhari rejoices with the former deputy speaker on his impressive achievements working in the private and public sectors, which include legal practice, business, humanitarian services and as an elected lawmaker, rising to a leadership position in the National Assembly."
  },
  {
    "headline": "Victim of Festac kidnap rescued, reunites with family",
    "summarized_story": "…..CP Odumosu urge residents‘not panic, Lagos is safe’By Esther OnyegbulaOgbuagu Kingsley Kachi who was kidnapped from the premises of a church at FESTAC Town, Amuwo-Odofin, Lagos State has been rescued and reunited with his family.\nIt would be recalled that Ogbuagu was kidnapped from his church premises on Sunday 26th September, 2021 around 11am by unknown gunmen in a Lexus.\nThe Commissioner of Police who spoke through CSP Adekunle Ajisebutu, the command’s spokesperson, revealed that the victim who was kidnapped from the premises of a church at FESTAC Town, Amuwo-Odofin, Lagos State on Sunday 26th September, 2021 has been rescued.\n“Operatives of the Command are being tactical so as not to jeopardize the lives of the AVM and the pastor.\n“The isolated incidents notwithstanding, Lagos State is, and will remain one of the safest states in Nigeria”, he added."
  },
  {
    "headline": "APC needs a computerized membership database, says PGF DG",
    "summarized_story": "Describing the project as capable of repositioning the party, Lukman said a reliable membership database is at the soul of political party management.\nHe said; “I believe as a party, immediately after the Convention, the first thing the new leadership should do is to have a membership database that is computerized.\n“Secondly, we must have a national database because membership is everything to a political party.\nIt is difficult to have a political party where people do not have diverse interests.\nThe major issue is that you can’t have a political party without a credible membership register."
  },
  {
    "headline": "Senate debates Bill to empower, provide jobs for poor Nigerians",
    "summarized_story": "… As Bill Scales Second ReadingBy Henry UmoruMOVES by the Senate to provide the legal framework for the empowerment and provision of jobs for poor Nigerians, got a boost Wednesday, as a bill to that effect scaled second reading in the Senate.\nThe Senate today considered a bill seeking to empower poor Nigerians in rural areas with guaranteed income and jobs that would provide 100 days of paid work per year.\nThe Rural Employment Guarantee Bill, 2021 was sponsored by Senator Mohammed Sani Musa, APC, Niger East.\nThe President of the Senate, Senator Ahmad Lawan thereafter, referred the bill to the Committee on Agriculture and Rural Development for further work after passing second reading.\nThe Committee which is chaired by Senator Abdullahi Adamu was given four weeks to report back to the Senate."
  },
  {
    "headline": "Okonjo-Iweala reacts to killing of Chike Akunyili",
    "summarized_story": "The Director-General of the World Trade Organisation, Ngozi Okonjo-Iweala, has expressed sadness over what she termed as ‘brutal killing’ of DrChike Akunyili, husband of the late Director-General of the National Agency for Food and Drug Administration and Control (NAFDAC), Dora Akunyili.\nDAILY POST reported that Akunyili was murdered by unknown gunmen alongside his driver and escort on Tuesday on his way from Onitsha to Umuoji at Eke Nkpor.\nIt was learnt that Akunyili had attended a lecture at Sharon Hall, All Saints Cathedral, Onitsha,which was organized by the University of Nigeria Nsukka Alumni Association (UNAA), Onitsha branch, in honour of his late wife, Prof Dora Akunyili.\nReacting to the sad incident, Okonjo-Iweala on her verified Twitter page wrote: “It is with deep sadness that we hear of the brutal killing of Dr Chike Akunyili; eminent physician, beloved husband of Prof Dora Akunyili-Nigerian icon.”Okonjo-Iweala offered her condolences to the children and family of the deceased.\nMeanwhile, President Muhammadu Buhari has assured that killers of Akunyili will face judgement."
  },
  {
    "headline": "DSS denies assassinating Chike Akunyili",
    "summarized_story": "The Department of State Services (DSS) has condemned claims that its agents assassinated Dr. Chike Akunyili.\nThe agency, in a statement Wednesday night, reacted to a social media video claiming it carried out the act.\nThe spokesman said there was no basis for the elimination of Akunyili and fellow law enforcement agents.\nThe DSS assured it is working with other agencies to track down those behind the breakdown of law and order and bring them to justice.\nIPOB reveals those who killed Dora Akunyili’s husband, Chike"
  },
  {
    "headline": "Obiano places N20m bounty on killers of Akunyili, others",
    "summarized_story": "Anambra State Governor, Willie Obiano, has placed a N20million bounty on the killers of Dr. Chike Akunyili, husband of the late ex-NAFDAC Director General, Dora Akunyili.\nObiano met with heads of security agencies on Wednesday after the assassination.\nHe condemned the violence that has been witnessed in Anambra in the past few days.\nObiano said individuals, political parties, campaign offices and vehicles in different areas have been targeted.\n“I urge every security personnel on duty in Anambra State to do his utmost best to secure our people”, he said."
  },
  {
    "headline": "Insecurity: Why there is evil in Nigeria – Pastor Enenche",
    "summarized_story": "Pastor Paul Enenche, Senior Pastor of Dunamis International Gospel Centre has revealed why security crisis persists in the country.\nIn a live church service on Dunamis TV monitored by our correspondent on Wednesday, Pastor Enenche slammed security agencies for arresting kidnappers who have plunged the entire nation into chaos.\nAccording to him, arresting and detaining them is unnecessary, stressing that they should be gunned down when sighted.\n“The kidnappers that they are arresting is a waste of time.\nAccording to the man of God, “Every community wake-up for your people, every security man should rise-up."
  },
  {
    "headline": "Rivers lawmakers threaten to protest exclusion of state from FG’s fresh loan request",
    "summarized_story": "Members of the Rivers State House of Assembly have threatened to embark on a protest to the National Assembly against the exclusion of the state from states benefiting from the fresh loan request by the federal government.\nThe House issued the threat during plenary after a motion presented by the leader of the House, Martin Amaewhule, asking the House to condemn the exclusion.\nThe lawmakers urged the National Assembly not to approve the request by the President if Rivers State is not included in the list of benefiting states.\nThe House, however, resolved that the protest will be after “due consultation” with members of the National Assembly from Rivers State.\nSpeaker of the house, Ikuiyi Owaji-Ibani, while speaking on the motion, described the said exclusion as “divisive”."
  },
  {
    "headline": "Senate asks Buhari to declare bandits as terrorists",
    "summarized_story": "By Sanni Onogu, Abuja- Advertisement -The Senate has urged President Muhammadu Buhari to declare bandits ravaging the North West and other parts of the country as terrorists.\nThe Upper Chamber also called on the President to declare known leaders of bandits in the country wanted and track them wherever they are for arrest and prosecution.\nIt also urged the President to direct the National Emergency Management Agency (NEMA) to urgently support all victims of banditry in Sokoto and other parts of the country.\nThese resolutions of the Senate followed its consideration of a motion titled: “Banditry in Sokoto State particularly Sokoto East Senatorial District” sponsored by Senator Ibrahim Gobir."
  },
  {
    "headline": "DSS denies killing Dr Chike Akunyili",
    "summarized_story": "By Nicholas Kalu, Abuja- Advertisement -The Department of State Services(DSS) has denied allegations that its operatives killed Dr Chike Akunyili, husband to the former Director-General of the National Agency for Food and Drug Administration and Control (NAFDAC), late Prof Dora Akunyili.\nPublic Relations Officer, Department of State Services, National Headquarters, Dr Peter Afunanya, in a statement late Wednesday, said the attention of the Service was drawn to the allegation.\nIt reads: “Also, the Service was alerted to a social media video claiming that the “Nigerian DSS” murdered security escorts at Nkpor, Anambra State on 28th September, 2021.\n“The Service hereby denies these allegations and wishes to clearly state that they are spurious and illogical.\nThere was no basis for the DSS to kill the Medical Doctor and/or fellow law enforcement agents."
  },
  {
    "headline": "Rain of tributes for Sunny Ade’s wife",
    "summarized_story": "The service of songs is part of a two-day funeral programme organised for the deceased.\nThe deceased is survived by Sunny Ade and her son, George Folarin.\nMembers of the House of Assembly led by the Majority Leader, Sanni Agunbiade, monarchs and other dignitaries attended the service of songs.\nTaking his message from John 14:1-4, the cleric said: “Heaven is a prepared place only for prepared people.\nChristians do not die; they are resting in the bosom of the Lord.”Sunny Ade described his wife as a heroine and an achiever."
  },
  {
    "headline": "Anambra governor places N20m bounty on killers of Akunyili’s husband, others",
    "summarized_story": "He said that the N20 million bounty was to show how seriously the state government took the matter.\n“I urge citizens to report to us anybody bearing firearm who is not a security or vigilante personnel, so we can deal with this monster, once and for all.\nFinally, I urge all citizens of the state to unite in this fight against all forms of terror, intimidation and tyranny.\n“I have charge everyone involved in the security architecture of Anambra State to take very seriously, this threat to our livelihood and boldly rise to confront same.\nMy directive to this effect is clear and I urge every security personnel on duty in Anambra State to do his utmost best to secure our people."
  },
  {
    "headline": "Kaduna govt officially shuts telecoms services",
    "summarized_story": "From Sola Ojo, KadunaAs one of the critical measures to tackle the nefarious activities of fleeing bandits in parts of the state, the Kaduna State Government on Wednesday officially announced the shutdown of telecommunications services in undisclosed locations.\nThis development may not be unconnected to the security information that fleeing bandits from Katsina, Zamfara and Sokoto states where telecommunications services have been shut, are now coming to Kaduna state to make phone calls.\nIn response to that request, the relevant federal agencies had on Wednesday informed the Kaduna State Government that the processes for telecoms shutdown in parts of the state have commenced, Aruwan said.\n“Ban on felling of trees and forestry activities in Birnin Gwari, Giwa Igabi, Chikun, Kachia, Kagarko and Kajuru LGAs.\nCessation of weekly markets in the frontline local government areas of Birnin Gwari, Giwa, Chikun, Igabi, Kajuru and Kawo weekly market of Kaduna North local government”."
  },
  {
    "headline": "Breaking: Court stops FG from retrial of ex- Abia Gov, Orji Kalu",
    "summarized_story": "Justice Inyang Ekwo in his judgment held that the Supreme Court did not in the verdict it gave on May 8, 2020, order the retrial of either Kalu or his his firm, Slok Nigeria Limited.\nThe Court noted that the Supreme Court only ordered the retrial of former Director of Finance in Abia State, Jones Udeogu, who was the Appellant before it.\nCorrectional Centre”He noted that the Supreme Court had in the judgement it delivered on May 8, 2020, on Appeal No: SC.62C/2019, which was filed by his co-Defendant, Udeogu, held that the trial of the Appellant at the trial Court was conducted without jurisdiction.\nHe argued that the apex court thereafter, only ordered the retrial of the Appellant (Udeogu), without reference to himself (Kalu).\nFHC/ABJ/CR/56/07 F. R. N. VS. Orji Uzor Kalu & 2 Ors”, Kalu argued."
  },
  {
    "headline": "BREAKING: Gunmen kill Dora Akunyili’s husband",
    "summarized_story": "Dr. Chike Akunyili, the husband of late former Information Minister and NAFDAC boss, Prof. Dora Akunyili, has been murdered by unknown gunmen.\nA source said: “I was with this man yesterday same yesterday at Sharon Hall, All Saints Cathedral, Onitsha.\nIt was an occasion of University of Nigeria Nsukka Alumni Association (UNAA), Onitsha branch event where they honoured late Dora Akunyili.\n“He spoke glowingly about Dora and made a donation of N500,000 to the association.\nGod have mercy!”Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "EndSARS: Military didn’t fire live high velocity projectiles-Forensic Expert",
    "summarized_story": "The Lagos State judicial panel on restitution for victims of SARS related abuses and other matters was told on Tuesday by a UK based security consultant and forensic expert that the military did not fire live high velocity ammunition at EndSARS protesters at the Lekki tollgate.\nWillie-Harry also stated that four of the victims who sustained gunshot injuries were discovered to be projectiles from low velocity firearm which is not associated with the military or any of the security agencies.\nThe witness said the investigation of the Lekki tollgate incident was conducted by his organization in December 2020 and the report compiled in February 2021 and submitted.\nThe witness was then discharged at the end of the cross examination by all the counsels and the panel adjourned sitting for the day.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Buhari Replaces Auwalu As CEO of NPRA, Seeks Senate Approval",
    "summarized_story": "This is just as the Red Chamber moved on Wednesday to stop illegal charges on cargo transport by freight agents in the country.\nThe President’s request was contained in a letter dated September 28, 2021, and read at Wednesday plenary by the Senate President, Dr Ahmad Lawan.\nIn his new request, President Buhari is, however, asking for the approval of the Senate to replaceSarki Auwalu with Engr.\nThe motion tilted: “The need to streamline Import and Export Cargo Processing in the Aviation Sector” was sponsored by Senator Bala Ibn Na’Allah.\nMeanwhile, the Senate President, Dr Ahmad Lawan, has referred President Muhammadu Buhari’s request for the confirmation of Engr."
  },
  {
    "headline": "FG Approves 14 Days Paternity Leave for Civil Servants",
    "summarized_story": "By Deji ElumoyeThe federal government has approved a 14-day paternity leave to make federal male workers properly bond with their newborn babies or adopted ones.\nThe Head of Civil Service of the Federation, Dr (Mrs) Folasade Yemi-Esan, made this known on Wednesday while speaking with newsmen at the State House, Abuja at the end of the weekly Federal Executive Council meeting presided over by Vice-President Yemi Osinbajo.\nThe HOS, who spoke in the company of the Minister of Information and Culture, Alhaji Lai Mohammed, explained that the paternity leave was approved for men when their wives deliver new babies.\nAccording to her, the bonding is important to help the newly born or adopted baby properly bond with the father at the early period just like the baby bonds with the mother.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Gunmen Kill Dora Akunyili’s Husband, Chike",
    "summarized_story": "By David-Chyddy ElekeUnidentified gunmen have killed Dr Chike Akunyili, husband of late former Director General of National Agency for Food and Drug Administration and Control (NAFDAC) and minister for information, Prof Dora Akunyili.\nAkunyili, a medical doctor, was killed on Tuesday on his way from Onitsha to Umuoji at Eke Nkpor.\nTHISDAY gathered that Akunyili had Tuesday attended a lecture at Sharon Hall, All Saints Cathedral, Onitsha, which was organized by the University of Nigeria Nsukka Alumni Association (UNAA), Onitsha branch, in honour of his late wife, Prof. Dora Akunyili.\nThe source said: “He spoke glowingly about Dora his wife, and made a donation of N500,000 to the association.\n“He was there with his son, Obum, who now works with Anambra State government."
  },
  {
    "headline": "Buhari: Funding Police Remains Huge Challenge for Govt",
    "summarized_story": "In his speech, Minister of Niger Delta Affairs, Senator Godswill Akpabio, disclosed that NDCC was struggling to complete 13, 777 abandoned projects across the Niger Delta states.\nInspector General of Police Alkali Baba Usman commended Buhari for the police quarters, saying it is a key security project.\nBuhari stated, “Funding of the police force remains a huge challenge, which is why we work with the National Assembly to enact the police trust fund Act.\nAnd it is also another important milestone in our administration’s pursuit of the peace, prosperity and the development of the Niger Delta.\nThe minister said, “The Niger Delta region is the most peaceful region to live and do business today."
  },
  {
    "headline": "NEITI: 77 Oil Companies Owing Nigeria N2.659trn Unremitted Funds",
    "summarized_story": "The Nigeria Extractive Industries Transparency Initiative (NEITI) which disclosed that 77 oil and gas companies were indebted to the federal government, attributed the debt to their failure to remit petroleum profit tax, company income tax, education tax, value added tax, withholding tax, royalty and concession on rentals.\n“This is why NEITI is set to work with the government to provide relevant information and data to support efforts at recovering this money.\n“NEITI will no longer watch while these debts continue to remain in its reports unaddressed.\nHe reiterated the commitment of President Muhammadu-led administration to EITI implementation in Nigeria, noting that the administration was passionate about the EITI process.\nCrude Oil export revenue received in August 2021 amounted to $7.78 million, equivalent to N2.98 billion, while domestic gas receipts in the month was N5.69 billion."
  },
  {
    "headline": "EXCLUSIVE Buhari’s Chief Of Staff, Gambari, Attorney-General Malami Fume At Finance Minister, Plot Sack For Stopping $418million Paris Club Payment To Consultants",
    "summarized_story": "Angered by the suspension of the controversial payment of $418million to Paris Club consultants by President Muhammadu Buhari, the Attorney-General of the Federation, Abubakar Malami, and the Chief of Staff to the President, Prof Ibrahim Gambari, are presently plotting the sack of the Minister of Finance, Zainab Ahmed, SaharaReporters has gathered.\nAhmed was first appointed on September 14, 2018 after the resignation of Kemi Adeosun and re-appointed months after the 2019 general election.\nThey also convinced the president to heed the governor’s warning and stop the controversial payment of the $418million to the consultants.\n“They were shocked that the President could suspend the payment; Gambari, Malami, Buhari’s son-in-law, Gambari’s son, were promised about 40 per cent of the total payment.\nSee Also Corruption REVEALED: How Chief Of Staff, Gambari, Attorney-General Malami Tricked Buhari To Fraudulently Pay N90.6billion To Controversial Paris Club Lawyer“They got angry with Ahmed Zainab, claiming she advised the President against releasing the money."
  },
  {
    "headline": "EXCLUSIVE Buhari’s Chief Of Staff, Gambari, Attorney-General Malami Fume At Finance Minister, Plot Sack For Stopping $418million Paris Club Payment To Consultants",
    "summarized_story": "Angered by the suspension of the controversial payment of $418million to Paris Club consultants by President Muhammadu Buhari, the Attorney-General of the Federation, Abubakar Malami, and the Chief of Staff to the President, Prof Ibrahim Gambari, are presently plotting the sack of the Minister of Finance, Zainab Ahmed, SaharaReporters has gathered.\nAhmed was first appointed on September 14, 2018 after the resignation of Kemi Adeosun and re-appointed months after the 2019 general election.\nThey also convinced the president to heed the governor’s warning and stop the controversial payment of the $418million to the consultants.\n“They were shocked that the President could suspend the payment; Gambari, Malami, Buhari’s son-in-law, Gambari’s son, were promised about 40 per cent of the total payment.\nSee Also Corruption REVEALED: How Chief Of Staff, Gambari, Attorney-General Malami Tricked Buhari To Fraudulently Pay N90.6billion To Controversial Paris Club Lawyer“They got angry with Ahmed Zainab, claiming she advised the President against releasing the money."
  },
  {
    "headline": "EXCLUSIVE Buhari’s Chief Of Staff, Gambari, Attorney-General Malami Fume At Finance Minister, Plot Sack For Stopping $418million Paris Club Payment To Consultants",
    "summarized_story": "Angered by the suspension of the controversial payment of $418million to Paris Club consultants by President Muhammadu Buhari, the Attorney-General of the Federation, Abubakar Malami, and the Chief of Staff to the President, Prof Ibrahim Gambari, are presently plotting the sack of the Minister of Finance, Zainab Ahmed, SaharaReporters has gathered.\nAhmed was first appointed on September 14, 2018 after the resignation of Kemi Adeosun and re-appointed months after the 2019 general election.\nThey also convinced the president to heed the governor’s warning and stop the controversial payment of the $418million to the consultants.\n“They were shocked that the President could suspend the payment; Gambari, Malami, Buhari’s son-in-law, Gambari’s son, were promised about 40 per cent of the total payment.\nSee Also Corruption REVEALED: How Chief Of Staff, Gambari, Attorney-General Malami Tricked Buhari To Fraudulently Pay N90.6billion To Controversial Paris Club Lawyer“They got angry with Ahmed Zainab, claiming she advised the President against releasing the money."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Emefiele, Kemi Adeosun, Ex-Governor Yari Diverted N19billion Paris Club Legal Service Fees",
    "summarized_story": "Despite the President approving some percentage of the money to him as legal fees, Malami and others have refused to pay him.\nThe accounts were; HAD Properties Ltd with Jaiz Bank Plc - Account No.\n0002184449, HASSAN AHMED DAN BABA with Guaranty Trust Bank Plc - Account No 00256000864, MELROSE GENERAL SERVICES company with Access Bank Plc- Account No.\n0045824054 and BINA CONSULT AND INTEGRATED SERVICES with Zenith Bank Plc- Account No.\n1010948906.”The source added that the Economic and Financial Crimes Commission despite being aware of the fraudulent activities refused to investigate Malami, Adeosun, Emefiele and Yari."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Emefiele, Kemi Adeosun, Ex-Governor Yari Diverted N19billion Paris Club Legal Service Fees",
    "summarized_story": "Despite the President approving some percentage of the money to him as legal fees, Malami and others have refused to pay him.\nThe accounts were; HAD Properties Ltd with Jaiz Bank Plc - Account No.\n0002184449, HASSAN AHMED DAN BABA with Guaranty Trust Bank Plc - Account No 00256000864, MELROSE GENERAL SERVICES company with Access Bank Plc- Account No.\n0045824054 and BINA CONSULT AND INTEGRATED SERVICES with Zenith Bank Plc- Account No.\n1010948906.”The source added that the Economic and Financial Crimes Commission despite being aware of the fraudulent activities refused to investigate Malami, Adeosun, Emefiele and Yari."
  },
  {
    "headline": "'Ndigbo losing its finest to attacks' -- south-east governors condemn killing of Chike Akunyili",
    "summarized_story": "The south-east governors’ forum has condemned the killing of Chike Akunyili, husband of the late Dora Akunyili, ex-minister of information and communications.\nAdvertisementAkunyili was reportedly killed alongside his police escort and one Aloysius, identified as his driver, on Tuesday night at Umuoji, Idemili North LGA of Anambra state.\nAdvertisementHe appealed to security agencies to arrest all the perpetrators and ensure that they are made to face justice.\nIn a related development, the Department of State Services (DSS) says it has no hand in the killing of the late Akunyili.\nBut Peter Afunanya, DSS spokesman, in a statement, described the claim as “spurious and illogical”."
  },
  {
    "headline": "'Ndigbo losing its finest to attacks' -- south-east governors condemn killing of Chike Akunyili",
    "summarized_story": "The south-east governors’ forum has condemned the killing of Chike Akunyili, husband of the late Dora Akunyili, ex-minister of information and communications.\nAdvertisementAkunyili was reportedly killed alongside his police escort and one Aloysius, identified as his driver, on Tuesday night at Umuoji, Idemili North LGA of Anambra state.\nAdvertisementHe appealed to security agencies to arrest all the perpetrators and ensure that they are made to face justice.\nIn a related development, the Department of State Services (DSS) says it has no hand in the killing of the late Akunyili.\nBut Peter Afunanya, DSS spokesman, in a statement, described the claim as “spurious and illogical”."
  },
  {
    "headline": "Three killed as gunmen attack police station, emir's palace in Niger",
    "summarized_story": "Three persons were killed when gunmen attacked the palace of Ahmed Attahiru, Emir of Kagara, and the divisional police headquarters in Rafi LGA of Niger state.\nAdvertisementHe also said some gunmen attacked Kachiwe village in Sarkin Pawa headquarters of Munya LGA of the state.\nHe alleged that bandits sneaked into Niger from their hideout in Kaduna state to carry out the attack.\nAdvertisement“I don’t have the actual number of people killed during the attack,” he said.\nMusa, who spoke during an interview on Channels Television, said the security situation in the state has worsened."
  },
  {
    "headline": "Three killed as gunmen attack police station, emir's palace in Niger",
    "summarized_story": "Three persons were killed when gunmen attacked the palace of Ahmed Attahiru, Emir of Kagara, and the divisional police headquarters in Rafi LGA of Niger state.\nAdvertisementHe also said some gunmen attacked Kachiwe village in Sarkin Pawa headquarters of Munya LGA of the state.\nHe alleged that bandits sneaked into Niger from their hideout in Kaduna state to carry out the attack.\nAdvertisement“I don’t have the actual number of people killed during the attack,” he said.\nMusa, who spoke during an interview on Channels Television, said the security situation in the state has worsened."
  },
  {
    "headline": "Niger senator: FG needs to be ruthless with bandits... Gumi should be questioned",
    "summarized_story": "Mohammed Sani Musa, senator representing Niger east, says the federal government needs to be “very ruthless” with bandits.\nAnd we had some kind of peace for some time, until now, when the terrorists all went back,” he said.\nSo, when they all went back to Zamfara, and the government decided to hit them in Zamfara, they’re now spreading.\nWe had some peace in the last two months, but now, they’re back and they’re very ruthless.\nThe senator, who insisted that “there is a need to declare these bandits as terrorists”, wondered why Gumi has not helped the government with information on addressing banditry."
  },
  {
    "headline": "Led by Softbank, Andela raises $200m at $1.5 billion valuation",
    "summarized_story": "Andela, a global engineering talent outsourcing company, has secured $200 million at a $1.5 billion valuation in a Series E funding round led by Softbank Vision Fund 2, the venture capital arm of Japanese conglomerate – SoftBank.\nThis funding round brings the total venture funding raised by Andela to $380 million.\nAlongside Softbank, the round included Whale Rock, a new investor and existing investors like Generation Investment Management, Chan Zuckerberg Initiative, and Spark Capital.\nNow that the world has come to embrace remote work, Andela has become the obvious choice for companies because we can find better talent, faster,” said Jeremy Johnson, CEO and co-founder of Andela.\nImage credit: AndelaIn July 2020, Andela changed its model, closing its physical offices in Nigeria, Uganda and Rwanda to become a fully remote company."
  },
  {
    "headline": "MIT to test 3D printing and mobile delivery of prostheses in Sierra Leone",
    "summarized_story": "Researchers at a new bionics centre established at the Massachusetts Institute of Technology (MIT) plan to pilot a mobile imaging and delivery system of prosthetic limb services for disabled Sierra Leoneans.\nThe service will initially roll out in rural Sierra Leone, a West African country where thousands of people suffered amputations during an 11-year civil war.\nMIT adds that while the population of people with amputated limbs continues to increase each year in Sierra Leone, less than 10% of that population currently benefits from functional prostheses.\nSengeh is an MIT and Harvard inventor whose research work to improve prosthetic limbs in Sierra Leone will be leveraged by the MIT bionics centre.\n“I am proud that Sierra Leone will be the first site for deploying this state-of-the-art digital design and fabrication process,” Bio said."
  },
  {
    "headline": "China plans to deploy digital satellite TVs in 200 Togolese villages",
    "summarized_story": "The Chinese government plans to distribute digital satellite television and reception kits in 200 villages across Togo.\nChinese presence in Africa’s mediaStarTimes is one of the most popular pay-TV operators on the continent.\nOver the years, Beijing has invested significantly in the African media landscape, through projects like the DTT coverage.\nIt currently allows local media outlets to get content via its newswire without charge.\nBut the Asian power’s increasing investment in African media is seen as a strategy to positively shape its image, which is key to achieving Beijing’s longer-term ambitions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "This is the time to build the architecture for Africa’s future – Ndubuisi Ekekwe on funding startups in Africa",
    "summarized_story": "In January 2021, he launched Tekedia Capital, an investment syndicate that allows individuals to invest in companies operating largely in Africa.\nThat was how Tekedia Capital came about.”Starting Tekedia Capital was not just about making money though.\nIn addition to the $1,000 required to gain access, Tekedia Capital charges a 20% carried interest of the invested amount.\nInvestments in startups are determined by members of the syndicate and not Tekedia Capital.\nYou have to be physically present.”When choosing startups to invest in, Ekekwe discloses that the syndicate picks startups with teams that show the required technical and managerial abilities."
  },
  {
    "headline": "5 tech tools to help people with handwriting difficulties",
    "summarized_story": "Graphic organisers are simple but powerful tools that can help people with dysgraphia, executive functioning issues, or other issues that cause writing difficulties.\nGraphic organisers are visual thinking tools that help individuals visualise their ideas.\nMapping a process in a flow chart format can help clarify the process and show where the process can be improved.\nInstead of writing by hand or with a keyboard, dictation allows people to write words by speaking them aloud.\nOther tools that can be usedTools like predictive text, writing guide, raised-line paper, lettering stencils, electronic dictionaries and Thesaurus, and Word Banks are examples of other tools that can help people with dysgraphia."
  },
  {
    "headline": "Celebrating access to information, home for the homeless, meet Abake Adenle, Gokada in Ibadan",
    "summarized_story": "This post is a delayed version of Techpoint Digest , a week-daily newsletter that rounds up major happenings in African tech.\nAdd to this zero transparency in governmental activities, and what you have is freedom of access to information dragged in the mud.\nOur reporters, Oluwanifemi and Emmanuel, did a deep dive, where they extensively discussed the right to access information, with opinions from senior journalists from different companies in between.\nA foundation’s move to empower homeless children in NigeriaThe Destiny Trust Children Foundation WebpageIt’s the 21st century, the age of technology.\nThere is access to information, and yes, there are still homeless people trying to make it from one day to the next."
  },
  {
    "headline": "Labour shortage in the UK triggers petrol crisis",
    "summarized_story": "The current fuel crisis experienced in the United Kingdom has negatively impacted the region’s economic activities as vehicular mobility and other private business concerns have been hit by the event.\nFor this reason, the firm has decided to close down some of its petrol stations for a while.\nCommenting on the current situation, Business Secretary Kwasi Kwarteng assures the public that the crisis is stabilising.\nThe government has also assured its citizens that fuel supply at the more significant level is not affected despite the current situation.\nThe average price of petrol at UK forecourts was £135.10 a litre on Monday, up from £134.86 a week earlier."
  },
  {
    "headline": "Mastercard, MTN Nigeria, others back BusinessDay’s 2021 CEO Forum",
    "summarized_story": "Under the theme ‘Reboot: Regaining Strategic Flexibility in the Age of Uncertainty,’ the 2021 CEO Forum by BusinessDay is backed by Mastercard as the flagship sponsor, MTN Nigeria; gold sponsor, Commercio Partners, and Eat‘N’Go as valued sponsors.\nThe CEO Forum presents a unique opportunity for business leaders to sharpen the strategic assumptions, future plans, tactical priorities, and execution prowess with chief executives of leading companies and ranking thought leaders.\nWhile BusinessDay has hosted the CEO Forum every year since 2009, this year’s edition is a must-attend for decision-makers in Nigeria’s private sector as it is geared towards addressing two main issues.\nThe 13th edition of the CEO Forum, which will take place tomorrow (September 30), features a keynote address by Michael Raynor, best-selling author, and expert on strategy and innovation.\nOn the list of speakers lined up to give presentations at this year’s Forum is Jean-Michel Paul, author of The Economics of Discontent: From Failing Elites to The Rise of Populism."
  },
  {
    "headline": "Rising maintenance cost drives Nigerian airlines to Ethiopia",
    "summarized_story": "BusinessDay’s aviation analyst on a trip to Addis Ababa, Ethiopia and has observed that Ethiopian Airlines maintenance facility has aircraft and engines belonging to some Nigerian airlines undergoing routine and other levels of maintenance.\nBusinessDay also learnt that some Nigerian airlines recently took their aircraft back to Nigeria from Ethiopia after completing comprehensive maintenance.\nHenok Yazew Haile, acting manager, sales and marketing Ethiopian Airlines told BusinessDay that Nigerian airlines are bringing their aircraft for maintenance in Ethiopia airline’s MRO facility because aircraft maintenance is cheaper here than in Europe, America, and other continents.\nHe further disclosed that the firm is receiving orders to maintain more aircraft from Nigerian airlines and other countries.\nNigerian airlines are also setting up MRO facilities in a bid to reduce capital flight, save cost and create job opportunities locally."
  },
  {
    "headline": "Obaseki hails judiciary for peace, harmony in Edo, assures of more support – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the President of the National Industrial Court, Hon.\n“So, as a state, we will continue to support the court system, whether they are ours or federal.\nI won’t be sitting here as a governor if we don’t have the strength of character of the judges in our court system.\n“For us to have progress, stability, and an enduring democracy, we must invest in all tiers of the judiciary system, particularly the magistrates.\nCommending the president of the National Industrial Court, Obaseki said: “You have placed the industrial court on such a pedestal that people have come to respect the judgment from your court."
  },
  {
    "headline": "Edo, investors begin devt of Emotan Gardens Phase II – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the Edo Development and Property Agency (EDPA) has signed an agreement with six construction firms to commence the development of phase II of Emotan Gardens.\nThe Executive Chairman, EDPA, Isoken Omo, who supervised the signing of the agreement, said that the Emotan Garden sits on a 70-hectare of land situated within three communities.\nThe new developers are: Nigerian Air force Housing and Construction Company Limited; Options for Good and Affordable Homes Foundation Limited; Alpha Mead Development Company Limited; WTF Construction Nigeria Limited; Parakuo Nigeria Limited and Helpline Homes Limited.\nOne of the developers, Dr. Nosa Omere, a representative of Wall-Ties Form Construction Company Nigeria Limited, noted, “As we speak, we already have off-takers; we apparently started marketing online from the United Kingdom, the United States and Europe.\nPeople have been waiting for the signing of this agreement to be able to come in.”..."
  },
  {
    "headline": "COVID-19 3rd wave: Edo urges vaccination to reduce casualties as three more unvaccinated persons die – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has restated the need for more residents to get inoculated with the COVID-19 vaccines to reduce deaths from the deadly virus and contain the third wave of the pandemic.\nNoting that the state recorded three more deaths of unvaccinated persons, Osagie urged residents to complement the government’s efforts at ensuring the health and safety of citizens by getting vaccinated.\nThey were all unvaccinated.”On his part, Permanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa further urged citizens to ensure they are vaccinated to protect themselves from the dreaded COVID-19 disease.\nHe said: “We have seen more deaths from unvaccinated persons; we are losing so many persons from preventable causes.\nWe can prevent these persons from dying from COVID-19 because it makes primary disease conditions worsen and make the person succumb to death."
  },
  {
    "headline": "INEC Committed to Conducting Credible Election in Anambra and Beyond- Yakubu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIndependent National Electoral Commission(INEC) has reiterated its commitment to the conduct of credible election in Anambra state in the forthcoming election taking place on the 16th, November, 2021, other bye-elections in the country and the 2023 general election.\n“We assure the people of Anambra State and indeed all Nigerians that the votes of the people will be the only determinant of leadership succession in Anambra State”.\nOn our part, we are determined to conduct a good election in Anambra and in other parts of Nigeria.\nWe shall not compromise on the conduct of a good election in any part of Nigeria”, he added.\nWhile congratulating the INEC Press Corp for organizing this program, Yakubu stated that the program is timely and germane considering the fact that the Governorship election in Anambra State is a few weeks away."
  },
  {
    "headline": "Alleged N7.1Billion Fraud: Why we will appeal against ruling stopping Orji Kalu’s retrial",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has vowed to appeal against Wednesday’s ruling of the Federal High Court in Abuja stopping the retrial of a former Governor of Abia State, Orji Kalu, on N7.1billion fraud charges.\nHe was already serving the 12-year jail term for the offences when the Supreme Court, on 8 May 2020, nullified the proceedings leading to his and his co-defendants’ conviction.\nThe Supreme Court’s judgment delivered on an appeal by Mr Kalu’s co-defendant, Ude Udeogu, had ordered a retrial at the Federal High Court.\nThe Supreme Court had ordered a retrial at the Federal High Court.\nBut kalu who profited from the ruling to secure release from Kuje Correctional Centre, filed an application before the Federal High Court in Abuja to stop his retrial."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Ecobank appoints Bola Adesola chairman, names Titilayo Olujobi, Bimbola Wright as directors",
    "summarized_story": "Ecobank Nigeria has announced the appointment of Mrs. Bola Adesola, Mrs. Titilayo Olujobi and Mrs. Bimbola Wright, as non executive directors.\nShe retired from Standard Chartered Bank as the Senior Vice-Chairman, Africa.\nMrs. Adesola was also the Chairperson of the Board of Standard Chartered Bank Mauritius and a Director at Standard Chartered, Ghana.\nThe new Ecobank Nigeria chairman had also served as an Executive Director, Corporate Banking and Executive Director Lagos Directorate at First Bank of Nigeria Plc; Managing Director, Kakawa Discount House, Nigeria.\nCommenting on her appointment as Director and Chairman of the Board, Mrs. Adesola said; “I am honoured to be appointed as Chairman of the Board of Ecobank Nigeria."
  },
  {
    "headline": "Dr. Akunyili: Obiano charges security agencies to fish out criminals killing Anambra residents",
    "summarized_story": "By Obinna EzugwuAnambra State governor, Chief Willie Obiano, has charged security agencies in the state to step up efforts towards bringing criminals killing residents of the state to justice, while condemning rising spate of violence in the state.\n“Since last weekend, some armed persons have unleashed terror with sporadic attacks on innocent citizens in various parts of the State.\n“I have therefore conducted an extensive security meeting and have directed all Security Agencies to step up and confront this monster ravaging our land.\nI charge everyone involved in the security architecture of Anambra State to take very seriously, this threat to our livelihood and boldly rise to confront same.\nMy directive to this effect is clear and I urge every security personnel on duty in Anambra State to do his utmost best to secure our people."
  },
  {
    "headline": "Nigerians mourn death of Dr. Chike Akunyili",
    "summarized_story": "OBINNA EZUGWUNigerians have continued to mourn the death of Dr. Chike Akunyili, husband of former Minister of Information and Director General of NAFDAC, late Prof Dora Akunyili, who was murdered by some unknown gunmen in Anambra State on Tuesday.\nWe need a proactive leadership right now.”Also reacting to the murder, Dr. Ayoade Alakija, @yodifiji said, “I’m heartbroken by the news of the senseless murder of Dr. Chike Akunyili.\nThe statement titled, ‘Senate mourns brutal killing of Dr. Chike Akunyili’ partly read, “Coming under order 43 of the Senate Standing Rules – Personal Explanation, Ekwunife noted with concern that on Tuesday 28th September, 2021, Dr. Chike Akunyili was gunned down in a most gruesome and very horrifying manner at Afor Nkpor, Anambra State.\n“According to the lawmaker, the late Dr. Chike Akunyili, until his death, was the Medical Director of St. Leo Hospital Enugu.\nAnything to the contrary should be disregarded.”IPOB further claimed that those who killed Prof Akunyili were responsible for the death of her husband."
  },
  {
    "headline": "You’re a gift to Osun people – Oluga salutes Oyetola @67",
    "summarized_story": "By Sunday Oguntuyi, OsogboFederal lawmaker representing Irewole/ Isokan/ Ayedaade federal constituency in Osun State in the House of Representatives, Hon.\nTaiwo Oluga has described the governor of the state, Mr. Adegboyega Oyetola as a rare gem and a blessing to the people of the state, just as she congratulate the governor on his 67th birthday anniversary.\nThe lawmaker saluted the relentless efforts of the governor in moving the state to higher pedestra in the comity of states in Nigeria, adding that the state has witnessed tremendous development under the watch of governor Oyetola.\nOluga added that kudos should be given to governor Oyetola for the prudent management of the state resources even during this tight period of crunched economy.\nShe prayed for long life in good health and more wisdom for the governor to continue the good work he has started in the state."
  },
  {
    "headline": "Group Urges Ex-Deputy Gov To Participate In Politics",
    "summarized_story": "A group known as Coalition for Good Governance (CGG) has urged former deputy governor of Imo State, Prince Eze Madumere, to participate effectively in Imo and national politics.\nThe group made the call through its national coordinator, Mike Ilechukwu, rising from its general meeting after it had reviewed political and economic developments in the South East.\nThe group, however, extolled the leadership qualities of some Igbo leaders who distinguished themselves by bequeathing lasting legacies in their states.\nIlechukwu described Orji Kalu as the only governor who showed a level of good governance in its comparative analysis.\nToday, the state that used to be a pride of Ndi Igbo is fast deteriorating, causing so much hardship to the people”, he said."
  },
  {
    "headline": "Group Urges Ex-Deputy Gov To Participate In Politics",
    "summarized_story": "A group known as Coalition for Good Governance (CGG) has urged former deputy governor of Imo State, Prince Eze Madumere, to participate effectively in Imo and national politics.\nThe group made the call through its national coordinator, Mike Ilechukwu, rising from its general meeting after it had reviewed political and economic developments in the South East.\nThe group, however, extolled the leadership qualities of some Igbo leaders who distinguished themselves by bequeathing lasting legacies in their states.\nIlechukwu described Orji Kalu as the only governor who showed a level of good governance in its comparative analysis.\nToday, the state that used to be a pride of Ndi Igbo is fast deteriorating, causing so much hardship to the people”, he said."
  },
  {
    "headline": "Independence Day: FG Declares Friday Public Holiday",
    "summarized_story": "The federal government has declared Friday , October 1, as public holiday to mark the nation’s 61st Independence Anniversary celebration.\nMinister of interior, Ogbeni Rauf Aregbesola who made the declaration on behalf of the federal government, in Abuja yesterday, congratulated all Nigerians on this year’s independence celebration.\nAregbesola assured Nigerians of government’s commitment to tackle and eradicate all forms of challenges–be it political, socio-economic and all diverse problems.\nWe are indeed the leading black nation in the entire world and no doubt Africa’s pride and beacon of hope”, Aregbesola said.\nWhile wishing Nigerians a fruitful independence celebration, the minister reminded citizens of the fact that our founding fathers, in spite of the differences in faith, tribe and tongue came together for Nigeria’s independence."
  },
  {
    "headline": "Independence Day: FG Declares Friday Public Holiday",
    "summarized_story": "The federal government has declared Friday , October 1, as public holiday to mark the nation’s 61st Independence Anniversary celebration.\nMinister of interior, Ogbeni Rauf Aregbesola who made the declaration on behalf of the federal government, in Abuja yesterday, congratulated all Nigerians on this year’s independence celebration.\nAregbesola assured Nigerians of government’s commitment to tackle and eradicate all forms of challenges–be it political, socio-economic and all diverse problems.\nWe are indeed the leading black nation in the entire world and no doubt Africa’s pride and beacon of hope”, Aregbesola said.\nWhile wishing Nigerians a fruitful independence celebration, the minister reminded citizens of the fact that our founding fathers, in spite of the differences in faith, tribe and tongue came together for Nigeria’s independence."
  },
  {
    "headline": "How Nigeria Can Reduce Poverty – Chinese Envoy",
    "summarized_story": "The Ambassador of the People’s Republic of China to Nigeria, Cui Jianchun has said that Nigeria can reduce poverty ravaging the nation by investing in human capital development and in the critical sectors of the economy.\nHe added that his country is ready to help Nigeria reduce the level of poverty in the country, adding that China eradicated extreme poverty in February 2021 through good leadership dedicated to policies that revamped the Chinese economy from its backward state to a modern economy with a GDP of $15.7 trillion between 1952 and 2020.\nHe noted that as part of the robust 50-year-old bilateral relations with Nigeria, China can assist in replicating its successes in Nigeria by sending young Nigerians to China to understudy the system, get the experience and impact on the Nigerian system.\n“The most important aspect is that we mobilize the whole society to work together to eradicate poverty from rural areas.\n“I think there is a need for the two countries to work on this poverty eradication."
  },
  {
    "headline": "VIDEO: MINOR NARRATES TO COURT HOW BABA IJESHA ABUSED, INSERTED CAR KEY INTO HER PRIVATE PART",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: MINOR NARRATES TO COURT HOW BABA IJESHA ABUSED, INSERTED CAR KEY INTO HER PRIVATE PART",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: FRAUDSTERS AT WAR: COMPARING ME WITH HUSHPUPPI , A HUGE INSULT – JAILED INVICTUS OBI – Daylight",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: FRAUDSTERS AT WAR: COMPARING ME WITH HUSHPUPPI , A HUGE INSULT – JAILED INVICTUS OBI – Daylight",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Kelechi Iheanacho barred from entering Poland",
    "summarized_story": "Nigeria international Kelechi Iheanacho was left stranded at Warsaw airport on Wednesday after a documentation issue saw him blocked from entering Poland with Leicester.\nThe Nigerian was expected to return to the United Kingdom as soon as transport could be arranged, reports Mail Online.\nLeicester boss Brendan Rodgers confirmed Iheanacho, 24, would have started the game, meaning he will have to revise his plans for the Group C encounter.\nA club official is likely to accompany Iheanacho back to Leicester.\n‘We’ve had an issue with Kelechi – his documentation coming into the country wouldn’t suffice,’ said Rodgers."
  },
  {
    "headline": "Divided U.S. Democrats endanger Biden's agenda, crucial vote today",
    "summarized_story": "The White House said talks over twin bills that would revitalize the nation’s roads and airports and fund social programs and climate change measures, were at a “precarious” point.\nRepresentative Stephanie Murphy, a moderate Democrat who backs the infrastructure bill, warned against defeat or delay of the legislation.\n“The only way the vote happens (Thursday) is if we have the votes to pass the bill,” Representative Dan Kildee, House Democrats’ chief deputy whip, told reporters.\n“We’re obviously at a precarious and important time,” White House press secretary Jen Psaki said on Wednesday.\nThe House passed a bill on Wednesday suspending the limit through December 2022, by a mostly partisan vote."
  },
  {
    "headline": "Panic, Tension As Bandits Kill 55 Persons In Northern Nigeria",
    "summarized_story": "At least 55 people have been killed by bandits in Northern Nigeria, NewsDirect can report.\nWhile 25 people were killed in Gatawa, a village in the Sabon Birni Local Government Area of Sokoto State, 30 persons were killed by bandits at Kachiwe village, Sarkin Pawa in the Munya Local Government Area of Niger State.\nIt was learnt that the bandits also attacked Katsira village, shot four persons and abducted three others from the community.\nConfirming the attack in Niger state, Ahmed Ibrahim Matane, Secretary to the Niger State Government, urged residents to provide security agencies with credible information to enable them effectively tackle banditry, kidnapping and other criminal activities.\nHe noted that three people were earlier killed in a similar attack on the Kagara Rafi Local Government Area of the state."
  },
  {
    "headline": "Northern Governors Are Selfish— Miyetti Allah Lambasts Their Leaders",
    "summarized_story": "The Bauchi State chapter of Miyetti Allah Kautal Hore has condemned Northern Governors Forum for showing concern about which region should present President Muhammadu Buhari’s successor.\nHussaini said it was disappointing that the governors and emirs met to discuss issues affecting the region, without deliberating on the plight of Fulani herders.\nHe said Fulani herders, who were searching for greener pasture for their animals, were being humiliated, maimed, and even killed outright in the southern part of the country.\nHe said, “Instead of the Northern governors to show concern about the forms of treatment or copulation on herders by the Southern governors, they simply sat and discussed issues of personal vendetta without recourse to the people they govern.\n“For this, we condemn in totality the Northern Governors Forum meeting with emirs in attendance."
  },
  {
    "headline": "Nigeria @ 61: Primate Ayodele Releases Prophetic Messages About Buhari, Security, Economy, Others",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has issued a prophetic word about Nigeria ahead of the country’s 61st independence celebration.\nGod told Primate Ayodele that bandits will kidnap important government officials, and that the North and Abuja were targeted for attacks.\nDespite his criticism of Nigeria’s current leadership, banditry, and economy, Primate Ayodele stated that God is ready to expose corrupt officials and catch bandits and terrorist organization leaders.\n“In this New Year, some governors will regret being governors because of issues they will be facing especially in the north.\n“Nigeria will still battle with the economy as I see political assassination that will involve a prominent politician."
  },
  {
    "headline": "FG Declares October 1 Public Holiday",
    "summarized_story": "Nigeria’s government has designated October 1st a national holiday to commemorate the country’s 61st anniversary of independence.\nOgbeni Rauf Aregbesola, the Minister of Interior, made the announcement while congratulating Nigerians on their 61st independence.\nIn a statement issued by the Permanent Secretary of the Ministry, Shuaib Belgore, Aregbesola reassured Nigerians that the administration is committed to addressing and resolving all types of challenges and concerns.\n“A nation of about 200 million and above people whose natural talent, grit and passion glitter like the precious DIAMOND that we are.\n“Nigerians are sparkling like diamonds in Academia, Business, Innovation, Music, Movie, Entertainment, Fashion and culture.”Nigeria, according to the minister, is the world’s leading black nation and, without a question, Africa’s pride and light of hope."
  },
  {
    "headline": "500 killed in Sokoto within 2 months, 50, 000 flee to Niger Republic as Senate makes crucial demand",
    "summarized_story": "Classification of bandits as terrorists by the Senate came on the heels of killings being carried out by the criminal elements across the three senatorial zones of Sokoto state.\nHe said losing such number of trained security personnel would further deplete the numerical strength of the nation’s security agencies and jeopardise the security architecture of the country.\nIn his remarks, Senate President Ahmad Lawan commended the security agencies were doing their best in curtailing crimes and criminalities in the country.\n“I am here to announce the implementation of certain measures to assist the security agencies in parts of the state.\nThe state government is advised that certain measures are now necessary to assist the spirited efforts of these security agencies."
  },
  {
    "headline": "Breaking: Benfica batter Barcelona, Chelsea lose as Ronaldo rescues Manchester United at Champions League",
    "summarized_story": "Benfica on Wednesday night defeated Barcelona 3-0 on a day Chelsea without playmaker Kante lost 0-1 away during one of the champions league games.\nFederico Chiesa’s goal 10 seconds into the second half secured victory for Juventus.\nSimilarly, Manchester United defeated Villarreal 2-1 at Old Trafford.\nDetails loading…"
  },
  {
    "headline": "VIDEO: Watch late Dora Akunyili husband’s last moments before he was shot dead",
    "summarized_story": "PreviousPictures: Dare celebrates ANOCA at 40, predicts brighter future for sports in Africa"
  },
  {
    "headline": "Celebrating NN ship building effort -NigPilot",
    "summarized_story": "Thus, to bolster its hydrographic survey capability, the NN recently acquired a Hydrographic Survey Vessel NNS LANA.\nThis development would further boost the maritime trade and shipping activities along the nation’s maritime domain for enhanced national development”.\nThe FALCON EYE System incorporates surveillance and intelligence capabilities which allows for real time monitoring of activities in the nation’s maritime environment.\nThe cost of sustaining a ship such as NNS THUNDER and the entire NN Fleet can thus be better imagined.\nIt is only rational therefore, that the NN considers the option of stakeholder contributions to the logistics cost of sustaining the NN fleet in furtherance of maritime security."
  },
  {
    "headline": "Insecurity will persist unless Nigerians are meaningfully engaged – APC chieftain -NigPilot",
    "summarized_story": "A chieftain of the ruling All Progressives Congress, APC, and Director-General of Progressive Governors Forum, PGF, Dr. Salihu Moh.\nLukman also took time to explain some of the measures he thinks should be implemented to make the APC to function more effectively as a real progressive political party.\n“It is important to return to the basic framework that every party is an organization that has various interests.\nIt is difficult to have a political party where people do not have diverse interests.\nThe major issue we have insisted is that you can’t have a political party without a credible membership register."
  },
  {
    "headline": "Oyetola, Badaru represent shinning lights of APC politics – PGF -NigPilot",
    "summarized_story": "Progressive Governors Forum, PGF, has described two of their colleagues, Governors Gboyega Oyetola of Osun State and Muhammad Badaru Abubakar of Jigawa State as the shinning lights of APC politics.\nIn a congratulatory message issued Wednesday to felicitate with the two governors on their 67th and 59th birthday respectively, the PGF acknowledged and commended their leadership, visions and commitments to a united and prosperous Nigeria.\nThe forum noted that both have been consistent and selfless contributors to the team of Progressive Governors, providing insightful and resolute inputs to the processes of managing governance in Jigawa and Osun States respectively, as well as at the national level.\n“As Governors of Jigawa and Osun State, through all the development initiatives being implemented by APC-led governments, they represent the shining light of our politics!\n“As we rejoice with, HE Muhammad Badaru Abubakar and HE Gboyega Oyetola, we also reaffirm our collective to continue to implement programmes that strengthen the capacities of our progressive states to create jobs, stimulate economic activity, reduce inequality and diminish poverty in Nigeria,” the statement reads in parts."
  },
  {
    "headline": "NHRC, Calls FG to endorse safe school declaration -NigPilot",
    "summarized_story": "National Human Rights Commission, Executive secretary Tony Ojukwu has called on the Federal Government to endorse safe school declarations in various states of the country.\nTony said this at the opening of the multi-stakeholder forum on safe schools declaration, which took place yesterday in Abuja.\nNHRC and it’s partners both agreed that endorsing the safe school declarations in all states of the federation will help reduce the negative impact of insurgency on education.\nTony also said the safe school declaration has become crucial as a response to the spate of abductions and kidnapping of school children even within the confines of their schools.\n“The community-based protection monitoring intervention by the commission across several Northem States will increasingly mainstream the safe declaration."
  },
  {
    "headline": "Declare Bandits As Terrorists, Senate Tells Buhari",
    "summarized_story": "The Senate has urged President Muhammadu Buhari to declare bandits as terrorists.\nDuring the plenary on Wednesday, the federal lawmakers also asked President Buhari to declare all the known leaders of the bandits wanted and track them wherever they are for arrest and prosecution.\nThe resolutions followed a motion moved by the Senator representing Sokoto East, Senator Ibrahim Abdullahi Gobir, and eight others.\nSenator Gobir lamented that his senatorial district has become a safe haven for bandits fleeing from the current onslaught against them in Zamfara State.\n“The operation should be holistic instead of restrictive in order to produce effective and the desired results,” the Senator stated."
  },
  {
    "headline": "Banditry: Kaduna Govt Shuts Down Telecoms Services In Some LGAs, Bans Motorcycles",
    "summarized_story": "The Kaduna State Government has shut down telecommunication services in some Local Government Areas of the state as part of critical measures towards ending banditry.\nHe explained that the move is part of many steps taken to address the current security situation in Kaduna State and neighbouring states in the North-West and North-Central regions.\n“The relevant federal agencies have today informed the Kaduna State Government that the processes for telecoms shutdown in parts of the state have commenced,” Mr Aruwan said.\n“As part of the steps to address the current security situation in Kaduna State and neighbouring states in the North-West and North-Central, Kaduna State State Government has held several meetings with security agencies to adopt critical measures towards crushing bandits in identified hideouts”.\nIn addition, Aruwan said all commercial tricycles are to remove curtains in their tricycles."
  },
  {
    "headline": "Court Prohibits FG From Retrying Orji Kalu Over Alleged N7.1bn Fraud",
    "summarized_story": "Justice Ekwo held that the Supreme Court only ordered the retrial of former Director of Finance in Abia State, Jones Udeogu, who was the appellant before it.\nJustice Idris had sentenced Kalu to 12 years imprisonment in his judgement delivered on December 5, 2019.\nHowever, the Supreme Court nullified the judgement in May 2020 following an appeal by Kalu.\nIn a unanimous verdict on the appeal delivered by Justice Ejembi Eko, the Supreme Court declared the conviction null and void.\nHe held that a Justice of the Court of Appeal cannot operate as a judge of the Federal High Court."
  },
  {
    "headline": "Gunmen Kill Late Dora Akunyili’s Husband In Anambra",
    "summarized_story": "Dr. Chike Akunyili, the husband of the late former Director-General of the National Agency for Food and Drug Administration and Control (NAFDAC), Dora Akunyili has been killed by gunmen.\nDr. Akunyili was killed on Tuesday alongside his driver and a police escort around the Nkpor junction in Idemili North, Anambra State.\nHe was said to have been returning from an event where he received a posthumous award of excellence for his late wife when he ran into the hoodlums at Nkpor and was shot and killed.\nDuring the attack, a police patrol van and the Labour Party campaign vehicle were set ablaze.\nBut the State Commissioner of Police, Tony Olufu has visited the scenes of the attack in Nkpor, Umuoji, and Onitsha."
  },
  {
    "headline": "Ronaldo Scores Late Winner As Man United Defeat Villarreal",
    "summarized_story": "Cristiano Ronaldo marked his record-breaking 178th Champions League appearance with a 95th-minute winner as Manchester United snatched a 2-1 victory over Villarreal at Old Trafford on Wednesday.\nUnited were staring down the barrel of another embarrassing group stage exit from the Champions League after deservedly falling behind early in the second half to Paco Alcacer’s smart finish.\nSolskjaer had named an extremely offensive line-up with Ronaldo flanked by Jadon Sancho and Mason Greenwood, and Paul Pogba alongside Fernandes in midfield.\nDe Gea saved United once more five minutes from time in a goalmouth scramble to deny Moi Gomez and Boulaye Dia.\nJesse Lingard turned a loose ball Ronaldo’s way deep into stoppage time and his effort had too much power for Rulli."
  },
  {
    "headline": "Magistrate orders police to release corpse of Monsurat Ojuade for burial -",
    "summarized_story": "A magistrate has ordered the Nigeria Police Force, Lagos Command to produce a warrant, which the court will sign for the release of the corpse of one Monsurat Ojuade, who was shot dead by a police officer on September 10, 2021.\nSenior Magistrate, Bola Folarin-Williams, of the Magistrate Court 5, in Ebute Metta, made the order on Wednesday, during a preliminary Inquest into the murder.\nLawyer for the Ojuade family, Israel Mbaebie,had written to the Chief Coroner of Lagos State on Monday, requesting an investigation of the circumstances leading to the 18-year old’s death.\nA Police Sergeant, Samuel Philips, who has now been dismissed over the act, appeared at a Magistrates’ Court in Yaba, last Friday before Chief Magistrate Adeola Adedayo.\nHe is alleged to have fired at Miss Ojoade hitting her on her two thighs, while on a criminal raid on September 10, 2021, at the Ijeshatedo area of Lagos State."
  },
  {
    "headline": "Hunters arrest five-man kidnap gang in Kogi",
    "summarized_story": "Five members of a notorious kidnap gang have been arrested by professional hunters in Okehi Local Government Area of Kogi State,The suspects were apprehended in an early morning operation at Atami, a suburb of Osara community on Tuesday.\nAccording to King Habib, Senior Assistant to Okehi LG Chairman, Hon Abdulraheem Ohiare Ozovehe on Media & Publicity, who confirmed the arrest in a statement, said the gang has been terrorizing Kogi State’s Okene-Lokoja and Okene-Auchi roads.\nAccording to the statement, the suspects are currently being held by security forces while an investigation to retrieve their sophisticated weapons is underway.\nThe suspects are: Tukur Saleh, Ahmadu Sanni, Yusuf Sanni, all from Bauchi; Abubakar Saleh (Baba Wuro) and Isah Saleh, both from Kano State.\n“We shall leave no stone unturned in a bid to rid Okehi LGA and our environs of all forms of criminality,” Hon Ohiare said."
  },
  {
    "headline": "Agulu Community of Anambra State in mourning over Chike Akunyili murder -",
    "summarized_story": "Agulu community in Anaocha local government area has been thrown into mourning, as the villages under the community are in grieve over the death of Dr. Chike Akunyili.\nA visit to his house at Ifiteani village Agulu, saw the compound deserted, with not a single soul in the compound.\nA source revealed to TV.C News that prominent indigenes of Agulu community are currently holding a meeting at the traditional ruler’s palace , Igwe Innocent Obodoakor, which many say may not be unconnected with the demise of Dr. Chike Akunyili.\nAgulu is a large town comprising of twenty villages, being the home to prominent people including the former Governor of Anambra State, Peter Obi, former Senator Joy Emodi and Dora Akunyili the past NAFDAC Director General."
  },
  {
    "headline": "Governor El-Rufai Asks Residents To prepare for shutdown of telecommunication services -",
    "summarized_story": "Governor Nasir El-Rufai of Kaduna State has asked residents to prepare for a shutdown of telecommunication services in the state.\nIn a chat with some radio stations, the governor revealed that security agents are prepared to launch an offensive against bandits taking refuge in some parts of the state.\nHe explained that due to the shutdown of telecommunication services in Zamfara and Katsina states, some bandits have crossed over to neighbouring local government areas in Kaduna to make phone calls and demand ransom.\nAccording to him, the advice to shutdown telecommunication services was given by security agencies and has been approved by president Muhammadu BuhariThe governor however noted that the shutdown would only affect areas bordering troubled states where military onslaught against bandits are ongoing.\nThey will also ensure that fuel stations and markets are closed in those areas to prevent the bandits from recieving logistics supply."
  },
  {
    "headline": "With Free Data, 75m MTN Subscribers Can Get THISDAY on Zigi Chatbox",
    "summarized_story": "THISDAY is now available via the MTN Zigi Chatbox where PDF versions of the paper are available daily.\nThe MTN Zigi Chatbot would give millions of people free data to access the soft copy of THISDAY to help get them updated on daily happenings around the globe.\nLaunched last year, the MTN Zigi Chatbot, is the telco’s new digital personal assistant that can answer questions, and assist subscribers with products, services, and activations.\nZigi chats in English language and is available to chat with both existing MTN customers and non-MTN customers as a guest.\nThe Zigi chatbot saves the time of customers waiting for customer care representative to respond to questions."
  },
  {
    "headline": "Reps Probe NYSC Over Handbook On Ransom Payment – Trending with Ojy Okpe",
    "summarized_story": "Dr. Joseph A. Ladipo is Florida’s new surgeon general.\nHe graduated from Harvard Medical School in 2008 and also received a separate doctorate that year in health policy from the university’s Graduate School of Arts and Sciences.\nDr. Ladapo, made waves for setting new guidelines allowing parents to decide whether their children should quarantine or stay in school if they’re asymptomatic following exposure to COVID-19, and he’s also spoken critically about the public health focus on vaccines as a key tool for battling the pandemic.\nMeanwhile, a handbook that made the rounds on social media advising National Youth Service Corps members to prepare ransom in case they are kidnapped, is now being investigated by the House of Representatives.\nA video that is now circulating on social media captures the moment some officers of the Nigerian police in the federal capital territory, Abuja, brutalized some protesters of the proscribed Shi’ite Group, the Islamic Movement of Nigeria."
  },
  {
    "headline": "La Palma Volcano: Toxic Gas Fears as Lava Reaches Ocean",
    "summarized_story": "Lava from an erupting volcano on Spain’s La Palma island has reached the Atlantic Ocean, raising fears of toxic gases being released and explosions.\nWhen lava comes into contact with ocean water, it produces a gas plume known as laze – lava and haze.\nLaze forms through a series of chemical reactions as hot lava boils the colder sea water.\nVolcanic explosions were also possible, he added, because lava entering sea water creates “a pressure-cooker situation” that “might fling out volcanic debris”.\nAuthorities have set up an exclusion zone around the lava, including in the sea, to keep people away from any potential danger."
  },
  {
    "headline": "Manny Pacquiao Retires from Boxing to Focus on Political Career",
    "summarized_story": "Boxing legend Manny Pacquiao has announced his retirement from the sport to focus on his political career.\nThe 42-year-old’s final fight was a defeat by Cuba’s Yordenis Ugas in Las Vegas last month.\nBoxing is over,” said Pacquiao.\nAfter growing up in poverty in the south of the Philippines, Pacquiao moved to the capital Manila as a teenager to start a boxing career that would make him one of the world’s most highly paid athletes.\nSpeaking after his defeat to Ugas in August, Pacquiao said he was “60-40” in favour of quitting."
  },
  {
    "headline": "Nigeria: Gunmen Kill Chike Akunyili, Late Dora Akunyili’s Husband",
    "summarized_story": "Dr. Chike Akunyili, husband of late former Director-General of National Agency for Food and Drug Administration and Control (NAFDAC), Prof Dora Akunyili has been killed by unidentified gunmen.\nDr. Akunyili who is a medical doctor was killed in the company of his driver and escort on Tuesday evening while returning from Onitsha to Umuoji at Eke Nkpor, Anambra State.\nThe Guardian learnt that Dr. Akunyili had attended a lecture at Sharon Hall, All Saints Cathedral, Onitsha, organised by the University of Nigeria Nsukka Alumni Association (UNAA), Onitsha branch, in honour of his late wife, Prof Dora Akunyili before he was shot in the head.\nChike reportedly talked about his wife and made a donation of N500,000 to the association.\nDetails later…"
  }
]