[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Vaginal hygiene: Adding cleanliness to beauty",
    "summarized_story": "The use of vaginal hygiene products claiming to clean, freshen and balance the vagina are rather deleterious than achieving those unfounded claims that their manufacturers market them as having.\nJust imagine why there are no penile hygiene products, are men God’s special creations?\nThis odor, though never as comely as in a rose garden but is characteristic of a normal vagina, albeit, there is no unique vaginal smell since vaginal smell changes with each stage of the menstrual cycle.\nHence, a vagina smells stronger during the ovulation period, when there is more cervical mucus produced, than during any other stage of the menstrual cycle.\nIn conclusion, it is good to also point out that vaginal hygiene also encompasses some things to always remember."
  },
  {
    "headline": "Osun governorship poll should be free, fair",
    "summarized_story": "AS arrangements for the Osun governorship election scheduled for July 16 peak, all eyes are on the Independent National Electoral Commission to ensure a credible and peaceful balloting.\nThe Osun ballot will once again demonstrate the level of INEC’s preparedness and capability for the 2023 general elections.\nINEC and the police have a duty to ensure free and fair elections on Saturday and beyond.\nThey should beam their searchlight on leaders of the transport unions who have become the major perpetrators of political and electoral violence in the South-West.\nSecurity agencies should ensure that the Osun election is peaceful and credible."
  },
  {
    "headline": "GLOBAL HEALTH: WHO calls for equitable expansion of genomics",
    "summarized_story": "By Chioma ObinnaThe World Health Organisation, WHO’s Science Council of experts, has called for equitable expansion of genomics for global health, arguing that, it is not justifiable ethically or scientifically for less-resourced countries to gain access to such technologies long after rich countries do.\nThe report called for expanding access to genomic technologies, particularly in low- and middle-income countries (LMICs), by addressing shortfalls in financing, laboratory infrastructure, materials, and highly trained personnel.\nWhile the costs of establishing and expanding genomic technologies are declining making it increasingly feasible for all countries to pursue they can and should be further lowered.\nSpeaking, WHO Chief Scientist, Dr Soumya Swaminathan said: “Genomic technologies are driving some of the most ground-breaking research happening today.\nGenomic surveillance has played a crucial role in the global COVID-19 response, with countries like South Africa able to make crucial contributions in detecting variants, due to their capacities in this area."
  },
  {
    "headline": "Why we can no longer campaign for Tinubu’s presidential bid – Northern APC Christians",
    "summarized_story": "By Luminous Jannamike, AbujaCHRISTIANS of Northern extraction in the All Progressive Congress (APC) have said they can no longer campaign for the party’s presidential candidate, Asiwaju Bola Tinubu, because of his choice of a Muslim running mate.\nIt warned that if the selection of Senator Kashim Shettima as the party’s vice presidential resident candidate is not reversed before July 15, there would be serious and grave consequences.\n“The meeting decided as follows: that as Christians within APC, we cannot in all fairness to our consciences and our faith go to our various constituencies to campaign for a Muslim – Muslim ticket.\n“Muslim – Muslim ticket would undermine the election chances of Christians candidates in APC in the various states in the North.\n“If this selection of a Muslim Vice President candidate is not changed, there will be serious and grave consequences."
  },
  {
    "headline": "NMA to Abia govt: Unpaid doctors ‘re security risks",
    "summarized_story": "Threatens to escalate on-going strike after 7 daysBy Steve OkoThe Nigeria Medical Association, NMA, has told Abia State Government that any doctor being owed wages is unhappy and constitutes serious security risk to his patients.\nDoctors in the state proceeded on “every Tuesday strike action” to register their grievances over 25 and 11 months of salary arrears owed doctors in the Abia State University Teaching Hospital Aba, ABSUTH; and the state Hospital Management Board, respectively.\nAfter the 4th week, there is likelihood of escalation of this strike to magnitude of affecting health services adversely in Abia State.\nThe NMA boss decried the condition of health sector in the state and pleaded with the state Government to save the sector from total collapse.\n“Service delivery, residency training, teaching of Medical Students and research have been adversely affected by epileptic and sub-optimal services in the teaching hospital."
  },
  {
    "headline": "Kuje jailbreak: Osinachi’s husband, Wadume still in custody – NCoS",
    "summarized_story": "The Nigeria Correctional Service (NCoS) has dismissed reports that Peter Nwachukwu, husband of the late gospel singer, Osinachi, and a suspected kidnap kingpin, Hamisu Bala (a.k.a.\nWadume), escaped from custody during July 5 jailbreak at Kuje Custodial Centre, Abuja.\nSome media reports had claimed that Osinachi’s husband and Wadume escaped during July 5 terrorists’ attack on the custodial centre.\nHumphrey said that the clarification became necessary in view of a publication by an online medium alleging that Wadume and Osinachi’s husband escaped.\nNAN reports that a Federal Capital Territory High Court had ordered the remand of Osinachi’s husband at the custodial centre in connection with the singer’s death in April."
  },
  {
    "headline": "Peter Obi’s presidency won’t stop Biafra agitation – MASSOB￼",
    "summarized_story": "By Dennis AgboThe Movement for the Actualization of the Sovereign State of Biafra, MASSOB, has lambasted Muslim cleric, Sheikh Mohammed Gunmi, describing his statement on the alleged tone down of Biafra agitation after Mr. Peter Obi’s emergence as the Presidential candidate of Labour Party as hypocritical.\nMASSOB said that Gumi’s statement against pro Biafra agitation is deceiving and full of falsehood.\nMadu in his reply to Gunmi noted that MASSOB and other pro Biafra organizations have nothing against Mr Peter Obi and his intention to save Nigeria from further collapse since he believes in Nigeria, but that MASSOB believe in Biafra.\nMr Peter Obi is not the first person to contest presidential election since September 1999 when we started the MASSOB non violent self-determination struggle.\nDon’t use Mr Peter Obi and pro Biafra agitation to divert attentions,” Madu chided Gunmi."
  },
  {
    "headline": "2023 census: Hackers attack NPC recruitment portal",
    "summarized_story": "The National Population Commission (NPC) has foiled an attempt to hack its recruitment portal for the 2023 census.\nEzeoke said that the NPC had established a digitalised online geo-fenced portal to recruit personnel from selected communities across Nigeria.\nThe official assured that the commission was committed to correcting anomalies to ensure an accurate and reliable census next year.\n“If hackers were not able to succeed in this, we want to ensure and assure that it will be difficult for them to hack during the 2023 census.\nJoachim Ulasi, NPC State Director refuted alleged substitution of recruited officers, saying the ones dropped were those absent during the 12-day training."
  },
  {
    "headline": "Ayade swears in president customary court, reviews judiciary workers’ salary",
    "summarized_story": "Governor Ben Ayade of Cross River State has sworn in the new President of Cross River Customary Court of Appeal, Justice Anjor Mbe.\nHe has also approved upward review of salaries and welfare of judicial officers by 100 per cent.\nJudges of the Customary Court of Appeal will also have their salaries increased by 100 percent while those of Magistrates will be increased by 50 percent.\nAt today’s event, the governor further granted all judicial officers in the state immediate land allocation.\nAccording to Ayade, “As a matter of state government’s policy, any judicial officer sworn-in will have his or her official car ready for delivery."
  },
  {
    "headline": "Tinubu/Shettima ticket: Don’t allow Pastors, Imams deceive you – Keyamo to Nigerians",
    "summarized_story": "Amid the controversy trailing the All Progressives Congress, APC, Muslim-Muslim presidential ticket, Nigerians have been urged not to allow clerics deceive them to vote against the party in 2023.\nFollowing the emergence of Bola Tinubu as APC presidential candidate, Nigerians had charged him to pick a Christian from the northern part of the country as his running mate.\nHowever, the Minister of State for Labour and Employment, Festus Keyamo, on Tuesday urged Nigerians not to allow any pastor or Imam deceive them into voting against Tinubu.\nIn a series of tweets, Keyamo said Nigerians should base their decisions on the performance of Tinubu as governor of Lagos State and not on religion.\n“No one should deceive us, as ordinary Nigerians, be it a pastor or Imam, to vote or not to vote for anyone based on the religious colouration of the ticket."
  },
  {
    "headline": "LG Chairmen reject enactment of advertising bill in Akwa Ibom",
    "summarized_story": "Local Government Council Chairmen in Akwa Ibom State have rejected the proposed enactment of a bill to regulate outdoor advertising platforms by the State House of Assembly.\nThe bill, if enacted, would ensure that any person who wishes to establish or operate any billboard or commercial advertising outfit must be a member of a recognized body or get permission from the Akwa Ibom State Ministry of Environment.\nBut the council Chairmen, speaking through the Chairman of the Association of Local Government of Nigeria (ALGON), the state chapter Hon.\nRobson added that Local Government Councils in Nigeria are constitutionally empowered with regulatory power for outdoor structures and advertisement, stressing that Nigeria’s constitution is supreme.\nAmong the Council Chairmen who attended the event were Hon."
  },
  {
    "headline": "Osun 2022: 1,479,595 PVC collected as INEC extends deadline",
    "summarized_story": "The Chairman, Independent National Electoral Commission (INEC), Prof. Mahmood Yakubu said out of 1,955,657 registered voters in Osun State, 1,479,595 Permanent Voters’ Cards have been collected as of Sunday.\nThis was disclosed during an election stakeholders meeting held in Osogbo on Tuesday for the Osun gubernatorial poll coming on Saturday.\nHe said the figure is approximately 76 percent of the registered voters.\nProf Yakubu said the INEC has extended the last date for the collection of PVCs to Thursday 14, 24 hours before the election.\nAmong other candidates who were present and represented at the stakeholders’ meeting, are the Deputy Governor of Osun State, Benedict Alabi and Governor Gboyega Oyetola of All Progressives Congress (APC), Ademola Adeleke."
  },
  {
    "headline": "Tinubu, Lawan, APC Govs, others rally Osun for Oyetola The Nation Newspaper",
    "summarized_story": "The presidential candidate of All Progressives Congress (APC) Asiwaju Bola Tinubu; APC national chairman Senator Abdullahi Adamu; Senate President Ahmed Lawan and 10 Governors of the ruling party have told Osun residents to reelect Governor Adegboyega Oyetola on Saturday.\nInterim National APC chair Chief Bisi Akande; former APC National chair Adams Oshiomhole; National Secretary of APC Senator Iyiola Omisore, Senator Remi Tinubu and other big wig of the party attended the rally.\nTinubu said: “Please do the same thing that was done in Ekiti and vote massively for APC.\nWe are taking no chances with the affairs of Osun because the state deserves a leader like Oyetola in its quest for development.\nI want you to be the APC ambassadors, telling those who are not here what you have seen."
  },
  {
    "headline": "Man allegedly kills brother with rat poison over land dispute The Nation Newspaper",
    "summarized_story": "A middle-aged man, Kosara Ugwuka, has allegedly killed his elder brother with rat poison over land dispute in Akala village in Ezinifite, Nnewi South Local Government Area of Anambra State.\nUgwuka was said to have publicly confessed being responsible for the mysterious death of the deceased, Mr. Chukwudi Ugwuka, before a shrine at Nando in Anambra East Local Government Area.\nThey have to take them to a popular shrine at Nando last Sunday, to swear before the deity, to prove their innocence.\n“It was during the confession that he revealed that he killed his elder with rat poison because of land dispute.”A viral video showed Ugwuka kneeling and confessing at the shrine, while being interrogated by the villagers.\nPolice spokesperson, Tochukwu Ikenga, did not pick his calls nor responded to text messages as at press time."
  },
  {
    "headline": "PDP zonal treasurer resigns over 'unjust treatment' of Wike The Nation Newspaper",
    "summarized_story": "The Peoples Democratic Party (PDP) North-East treasurer Hon.\nGaladima Abba Itas has dumped the party over what he described as the ‘unjust treatment’ to Rivers Governor Nyesom Wike, during and after the presidential primary convention.\nHe faulted the choice of Delta Governor Ifeanyi Okowa as running mate to PDP presidential candidate Atiku Abubakar, saying it contradicts the principles and ideologies of the party.\nIn the letter of resignation addressed to the Ward Chairman, Itas Gadau Local Government Area, Bauchi State on Tuesday, Itas said the current situation in the party does not inspire confidence, adding the PDP is not ready to regain power in 2023.\nParts of the letter read: “I write to tender my resignation as zonal treasurer (North-east) and a member of People’s Democratic Party, (PDP) My resignation was as a result of wide consultations with my teaming supporters, political associates and in response to the unfair and unjust treatment extended to His Excellency, Barr Nyesom Ezenwo Wike CON, the Executive Governor of Rivers State during and after the presidential primary convention”“As a critical stakeholder, unjust and unfair treatment of founding members posed a great threat to the collective political interest of our leaders and us, thereby necessitating my resignation in protest of the ways things are unfolding in the party.”The Nation had reported Wike and his supporters are aggrieved following what they claimed was the conspiracy that not only denied Wike the party’s presidential ticket but also the opportunity to emerge as running mate to Atiku."
  },
  {
    "headline": "Firemen avert disaster as PMS laden tanker falls at Costain The Nation Newspaper",
    "summarized_story": "The tanker fell around 2pm while ascending the bridge and residents around Iponri trooped out to scoop petrol which spilled ion the road and into drainages.\nIt was gathered that before the tanker fell, it rolled backwards and hit a saloon car.\nTo prevent an explosion, firemen who immediately raced to the scene cordoned off all access roads and started blanketing the PMS.\nThey also sent messages across the neighbourhood urging people to avoid lighting naked fires or doing anything that could cause an inferno.\n“Residents should avoid lighting any naked flame until the situation has been fully contained."
  },
  {
    "headline": "Osinachi's husband didn't escape, says Correctional Service The Nation Newspaper",
    "summarized_story": "Peter Nwachukwu, husband of the late gospel singer, Osinachi Nwachukwu, is still in custody, the Nigerian Correctional Service (NCoS) said on Tuesday.\nThe Service dismissed reports that Nwachukwu escaped with Boko Haram insurgents and other inmates declared missing when the Kuje Medium Custodial Centre was attacked last Tuesday.\nSpeaking with The Nation on the alleged escape of Nwachukwu, the Public Relations Officer of the Service, Umar Abubakar, said there was no iota of truth in the report.\n“There was no way high profile inmates would escape because where would they run to, and where would they hide?\n“I even asked my FCT Public Relations Officer, Humphrey Chukwuendo when I saw the report that why is it that some people just sit down and concort unverified reports."
  },
  {
    "headline": "Strike: ASUU hits back at Buhari",
    "summarized_story": "Academic Staff Union of Universities (ASUU), yesterday, mocked President Muhammadu Buhari over his enough is enough comment and description of ongoing five-month-old strike as inimical to future generation of Nigerians.\nThe union claimed the president’s statement was not only comical but a clear sign of leadership failure claiming the Federal Government had reduced public universities to glorified secondary schools.\nIn a statement addressed to President Buhari entitled: “Mr President Sir: When and why Enough cannot be Enough”signed by ASUU Zonal Coordinator, Lagos, Dr. Adelaja Odukoya, the union taunted the President for waking up from his slumber to the reality that the strike had grounded public universities and taken a toll on parents, students and other stakeholders in the sector.\nASUU accused the Buhari’s administration of constantly resorting to window-dressing and buck-passing saying the inability to rise up to occasion and resolve issues was affecting the country, particularly the education sector.\nThe union said other sister unions in the nation’s public university system and unions in other tertiary institutions were on strike for similar reasons, belied and exposed the ridiculous disposition and propaganda to paint ASUU black in the face of the Nigerian public who have seen through the shenanigan, deliberate, systemic and orchestrated agenda of the present government."
  },
  {
    "headline": "Northern APC Christian leaders reject same faith ticket, say it’s recipe for disaster",
    "summarized_story": "From Paul Orude BauchiThe All Progressives Congress (APC) Christian leaders in the 19 northern states have tagged the Muslim-Muslim ticket of the party as a display of crass insensitivity to the complexity of modern Nigeria and the entire church.\nThey warned that any attempt to manipulate the multi religious complexity of Nigeria would have dire political consequences on the country’s peaceful co-existence .\nThey opined that the current Nigerian environment and political atmosphere of the country is different from what occurred in 1993, therefore a Muslim-Muslim ticket is unacceptable.\nIt described the Muslim-Muslim Muslim ticket as unjust, considering the fact that the President, National Chairman of the APC, President of the Senate, the Speaker of the House of Representatives, Deputy Speaker of the House, and now both the Presidential and Vice Presidential candidates are all Muslims.\n“Assuming that such lopsidedness does not violates S.14 (3) of the Constitution: if this was to be reversed so that all these were Christians, can any contentious Muslim in Nigeria attempt to sell such patently unjust and unfair arrangement to the Muslim Ummah in Nigeria,” the APC Christian leaders asked."
  },
  {
    "headline": "Pro-Biafra groups not interested in who succeeds Buhari ­–MASSOB",
    "summarized_story": "From Magnus Eze, EnuguThe Movement for the Actualization of the Sovereign State of Biafra (MASSOB), yesterday, said that pro-Biafra agitators were not keen about who emerges Nigeria President next year.\nMadu said: “The statement of Gumi against pro-Biafra agitation is deceiving and full of falsehood.\nMASSOB and other pro-Biafra agitators have been in the self-determination struggle for Biafra actualization and restoration.\n“MASSOB and other pro-Biafra organizations have nothing against Mr Peter Obi and his intentions to save Nigeria from further collapse.\nThe group told the Islamic cleric not to use Obi and pro-Biafra agitation to divert attentions."
  },
  {
    "headline": "NDDC: We’ll resist attempt to appoint another interim administrator –Clark",
    "summarized_story": "Chief Edwin Clark has described the attempt to appoint another interim administrator for the Niger Delta Development Commission (NDDC) as an aberration that would be resisted.\nThe yearning of the people of the Niger Delta region is for the Federal Government to constitute a substantive board.\nAny other agitation, especially from some greedy and self-centred persons, for Mr. President to appoint another interim administrator will be resisted.\nBecause there are rumours of some persons making moves for the appointment of another interim administrator for the NDDC.\nThe people of the Niger Delta have been patient and understanding enough."
  },
  {
    "headline": "Kalu sponsors 2 more bills to strengthen armed forces, Court of Appeal",
    "summarized_story": "From Kenneth Udeh, AbujaTwo bills sponsored by the Chief Whip, Orji Uzor Kalu, to provide for fixed tenure for service chiefs and increase in the number of Court of Appeal justices has passed first hurdle.\nThe first readings were taken during the final week of plenary before the National Assembly proceeded for the Muslim festive holiday.\n1024).”The explanatory memorandum of the Armed Forces Amendment Act bill revealed that the bill sought to enhance professionalism in the armed forces by deleting and replacing the provisions in sections: 7.\nThe bill, among others, when passed into law would make the appointment of the chief of defence staff by the president subject to the National Assembly, and such a person shall be the most senior officer based on rank in the armed forces and shall be saddled with the day-to-day command and general superintendence of the armed forces.\nThe Court of Appeal amendment bill on its part, among others, aims to increase the number of its justices from 40 one to 100, and according to Kalu to accelerate the dispensation of justice."
  },
  {
    "headline": "KSM Provides Succour to 3,480 Needy in Lagos – THISDAYLIVE",
    "summarized_story": "This time, however, they fed about 3,480 needy families from all religions, tribes and the physically challenged through the Feed The Hungry (FTH) initiative.\nThe Worthy Grand Knight (WGK) VGC sub-council, Sir Tony Ukairo expressed fulfilment that the initiative met its goal in its second edition.\nAccording to him, this little show of kindness will continue to be extended to the needy quarterly.\nEchoing the words of Ukairo, Sir Don Ezeh the Lagos Metropolitan Grand Knight (MGK) of KSM, Sir Don Ezeh, emphasised that this move is designed for the needy and the hungry.\nWhile appreciating members of the KSM for their unwavering support, Don Ezeh encouraged them to raise the gear in their monthly contributions for the course."
  },
  {
    "headline": "Encomium as Princess Elizabeth Ogunbeku Joins Septuagenarian Club – THISDAYLIVE",
    "summarized_story": "Friends and families overwhelmed Princess Elizabeth Ogunbeku with encomium as she recently joined the septuagenarian club in grandeur.\nFor the guests, there was no perfect time to dine, wine, and dance with the latest septuagenarian, Princess Elizabeth Ogunbeku other than now.\nHence, friends and families feasted with Ogunbeku, a Princess of Ilesa kingdom and daughter of the King of Osu in Ilesa, Osun State.\nOgunbeku also admitted that she filled the vacuum in her life with total service to God while keeping up with life as an entrepreneur.\n“The secret to a good life is Jesus."
  },
  {
    "headline": "ENYATA: Facilitating Tech Empowerment through Opportunities – THISDAYLIVE",
    "summarized_story": "Ifedolapo OseniThere is no doubt that people in the tech ecosystem have gained a growing amount of societal respect.\nOur community efforts at Enyata are motivated by a desire to effect change within the country.\nEnyata Academy creates a learning environment for anyone interested in becoming a tech player.\nWe want to build a world where great ideas, products, and companies come to fruition quickly whilst achieving the required impact.\nUltimately, Enyata hopes to become, not only the preferred community for exceptional engineers in Africa but the biggest tech solution provider very soon."
  },
  {
    "headline": "Excitement over Okowa’s Job Creation Scheme in Delta – THISDAYLIVE",
    "summarized_story": "As part of his strategic wealth creation in the SMART Agenda, the Delta State governor, Senator Ifeanyi Okowa, initiated the Women Empowerment Skill Acquisition Programme.\nBesides the strategic wealth creation schemes, an additional one million direct and indirect jobs have also been created through the various infrastructural and urban renewal projects.\n“As of June 1, 2022, 128,813 direct and indirect jobs have been created through the various job creation, youth empowerment, and social investments delivery platforms of the administration.\nHe pledged the partnership of the bank to the job and wealth creation programmes of the state government.\nNPDI while commending Governor Okowa on his job creation schemes urged him to as a matter of urgency to carry the job creation formula to Abuja for the benefit of the nation as vice-president."
  },
  {
    "headline": "HiFL 2022: Tillers, UNIMAID Warriors, Others to Know Opponents – THISDAYLIVE",
    "summarized_story": "*As debutants EKSU, KASU aim to reach quarter finalsTeams in the Round of 16 of the ongoing 2022 Higher Institutions Football League (HiFL) season will know their opponents tomorrow when the draws scheduled to hold at Protea Hotel, Lagos take place.\nMatches in the group stages which were completed penultimate week produced some new entrants such as Ekiti State University and Kaduna State University into this stage of the competition.\n“We have grouped the 16 teams into four pots.\nThe possibility of two former champions, UAM Tillers and the UNIMAID Warriors meeting at this stage is high as both teams have been drawn into the Sahel zone.\nUAM Tillers in 2018, UNICAL Malabites in 2019 and UNIMAID Desert Warriors in 2021."
  },
  {
    "headline": "FLASHBACK: How Tinubu’s Running Mate, Shettima’s Government In Borno Contributed To Abduction Of Chibok Schoolgirls By Boko Haram In 2014",
    "summarized_story": "On April 14, 2014, the schoolgirls were abducted when insurgents attacked the Government Girls’ Secondary School (GGSS) in Chibok, Borno State.\nIt, however, had to buckle when Shettima assured the Council, in writing, that adequate security would be provided.\n“We also asked the various state governments to relocate all the centres to the state capitals where there would be adequate security.\n“The three governors did not respond to our request but instead said they had made adequate security arrangements.\n“Borno State government only agreed to relocate the remaining 189 pupils after the abduction of the girls,” he said."
  },
  {
    "headline": "FLASHBACK: How Tinubu’s Running Mate, Shettima’s Government In Borno Contributed To Abduction Of Chibok Schoolgirls By Boko Haram In 2014",
    "summarized_story": "On April 14, 2014, the schoolgirls were abducted when insurgents attacked the Government Girls’ Secondary School (GGSS) in Chibok, Borno State.\nIt, however, had to buckle when Shettima assured the Council, in writing, that adequate security would be provided.\n“We also asked the various state governments to relocate all the centres to the state capitals where there would be adequate security.\n“The three governors did not respond to our request but instead said they had made adequate security arrangements.\n“Borno State government only agreed to relocate the remaining 189 pupils after the abduction of the girls,” he said."
  },
  {
    "headline": "FLASHBACK: How Tinubu’s Running Mate, Shettima’s Government In Borno Contributed To Abduction Of Chibok Schoolgirls By Boko Haram In 2014",
    "summarized_story": "On April 14, 2014, the schoolgirls were abducted when insurgents attacked the Government Girls’ Secondary School (GGSS) in Chibok, Borno State.\nIt, however, had to buckle when Shettima assured the Council, in writing, that adequate security would be provided.\n“We also asked the various state governments to relocate all the centres to the state capitals where there would be adequate security.\n“The three governors did not respond to our request but instead said they had made adequate security arrangements.\n“Borno State government only agreed to relocate the remaining 189 pupils after the abduction of the girls,” he said."
  },
  {
    "headline": "Lagos Newly Created Agency Imposes Millions Of Naira Tax On Car Park Operators",
    "summarized_story": "The newly-created Lagos State Parking Authority (LASPA) has taken over open parking spaces in the state.\nThe government had claimed it created the agency to enforce parking violations and offences in the state.\nIn a document seen by SaharaReporters, park operators (commercial) were asked to pay to between N2million and N23million annually, depending on the location as “license” fee.\nSaharaReporters learnt that the government had started serving notices of trespass on landmarks that were not on government roads.\n“The Lagos State government has commenced exploration of off street parking lots operators again under the state's illegal LASPA agency,” a resident said."
  },
  {
    "headline": "Lagos Newly Created Agency Imposes Millions Of Naira Tax On Car Park Operators",
    "summarized_story": "The newly-created Lagos State Parking Authority (LASPA) has taken over open parking spaces in the state.\nThe government had claimed it created the agency to enforce parking violations and offences in the state.\nIn a document seen by SaharaReporters, park operators (commercial) were asked to pay to between N2million and N23million annually, depending on the location as “license” fee.\nSaharaReporters learnt that the government had started serving notices of trespass on landmarks that were not on government roads.\n“The Lagos State government has commenced exploration of off street parking lots operators again under the state's illegal LASPA agency,” a resident said."
  },
  {
    "headline": "ICYMI: If I cannot get presidency, I can recommend Tinubu, says Kwankwaso",
    "summarized_story": "Rabiu Kwankwaso, presidential candidate of the New Nigeria Peoples Party (NNPP), says if he feels he won’t stand a chance in the 2023 general election, he could recommend Bola Tinubu.\nKwankwaso said this on Sunday, in an interview with ARISE TV.\nThe former Kano governor also said he doesn’t feel threatened by Tinubu and Kashim Shettima, who are the presidential and vice-presidential candidates of the All Progressives Congress (APC), respectively.\n“I know he is a strategist — Bola Tinubu — he is a good man.\nOrdinarily, if I cannot get it, I can recommend him, but it’s going to be like building something on zero."
  },
  {
    "headline": "ICYMI: If I cannot get presidency, I can recommend Tinubu, says Kwankwaso",
    "summarized_story": "Rabiu Kwankwaso, presidential candidate of the New Nigeria Peoples Party (NNPP), says if he feels he won’t stand a chance in the 2023 general election, he could recommend Bola Tinubu.\nKwankwaso said this on Sunday, in an interview with ARISE TV.\nThe former Kano governor also said he doesn’t feel threatened by Tinubu and Kashim Shettima, who are the presidential and vice-presidential candidates of the All Progressives Congress (APC), respectively.\n“I know he is a strategist — Bola Tinubu — he is a good man.\nOrdinarily, if I cannot get it, I can recommend him, but it’s going to be like building something on zero."
  },
  {
    "headline": "Twitter sues Musk over termination of $44 billion acquisition deal",
    "summarized_story": "Twitter, popular microblogging platform, says it has sued Elon Musk in order to compel him to continue with his planned buyout of the social media company for $44 billion.\nThe lawsuit accuses Musk of hypocrisy and bad faith in his dealings with Twitter.\nIt also puts Twitter and Musk up for a lengthy, expensive, and high-stakes battle in which the former will try to force the hand of the latter.\nBut after several internal turmoils on the buyout, Musk decided to soft-pedal on his acquisition bid, citing reasons of fake accounts on the platform.\nHowever, on Friday, Musk said he was terminating the $44 billion Twitter deal, adding that the social media company had failed to provide information about fake accounts on the platform."
  },
  {
    "headline": "Twitter sues Musk over termination of $44 billion acquisition deal",
    "summarized_story": "Twitter, popular microblogging platform, says it has sued Elon Musk in order to compel him to continue with his planned buyout of the social media company for $44 billion.\nThe lawsuit accuses Musk of hypocrisy and bad faith in his dealings with Twitter.\nIt also puts Twitter and Musk up for a lengthy, expensive, and high-stakes battle in which the former will try to force the hand of the latter.\nBut after several internal turmoils on the buyout, Musk decided to soft-pedal on his acquisition bid, citing reasons of fake accounts on the platform.\nHowever, on Friday, Musk said he was terminating the $44 billion Twitter deal, adding that the social media company had failed to provide information about fake accounts on the platform."
  },
  {
    "headline": "'Crass insensitivity' -- northern APC Christian leaders fault Muslim-Muslim ticket",
    "summarized_story": "Christian political leaders within the All Progressives Congress (APC) in the north say they cannot campaign for the party over the decision to field Muslims as presidential and vice-presidential candidates.\nThe Christian leaders across the 19 northern states, in a communique issued after a meeting on Monday, expressed reservations over the APC Muslim-Muslim ticket.\nAdvertisementThey also said the Muslim-Muslim ticket would make it hard for people to believe that the party is not pursuing an “Islamisation” agenda.\n“The selection of a Muslim running mate is a display of crass insensitivity to the complexity of modern Nigeria and the entire Church,” they said.\nAdvertisement“That the rejection of a Muslim – Muslim ticket by Christians would undermine the electoral fortunes of the APC and its candidates across all States and constituencies where Christians enjoy a numerical advantage."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "What to look for in a startup lawyer",
    "summarized_story": "Being a relatively new development, it is not far-fetched to assume that startups might not know what to look for in a startup lawyer.\nTo identify the unique qualities a startup lawyer should have, I asked 4 lawyers what qualities startups should look for in an in-house counsel.\nThe role of a startup lawyer is essential to support the startup from a legal perspective such that it can function at optimum capacity.\nWhether the startup is pre-seed, bootstrapped or VC-funded, a good startup lawyer is crucial for its day-to-day running.\nA startup lawyer should also be able to work in a startup environment, which is not as rigid as a law firm."
  },
  {
    "headline": "South African charged in largest fraud scheme involving bitcoin",
    "summarized_story": "The U.S Commodities Futures Trading Commission (CFTC) has charged South African resident Cornelius Johannes Steynberg in a bitcoin fraud scheme case totalling $1.7 billion.\nIn a press statement published on its website, the CFTC alleges that Steynberg, through a South Africa-registered company, Mirror Trading International Proprietary Limited (MTI), created and operated a global foreign currency commodity pool.\nThe pool, which had a value of $1.7 billion, only accepted bitcoin from users who wanted to purchase participation in it.\nJohnson said Steynberg in general operated the pool as a Ponzi scheme.\nSternberg is a fugitive from South African law enforcement but was recently detained in Brazil on an Interpol arrest warrant."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Cameroon’s Patricia Pedhom Nono is driving tech evolution in Francophone Africa",
    "summarized_story": "Patricia is the Transformation Director and Technology Leader at the international audit and consulting firm, PwC in sub-Saharan Francophone Africa.\nTransformation Director and Technology Leader, PwC, sub-Saharan Francophone Africa.\nTransformation Director and Technology Leader, PwC, sub-Saharan Francophone Africa.\nSince she’d spent those years in an English-speaking environment, Patricia needed to learn the ropes in a Francophone work situation.\nTransformation Director and Technology Leader, PwC, sub-Saharan Francophone Africa."
  },
  {
    "headline": "Angola produces more oil than Nigeria for second straight month",
    "summarized_story": "Angola produces more oil than Nigeria for second straight monthFor the second straight month, Angola produced more crude oil than Nigeria in June despite the increase in the output of Africa’s biggest economy, according to a new report by the Organization of the Petroleum Exporting Countries (OPEC).\nOPEC’s monthly oil market report for July 2022 show that Nigeria’s oil production increased by 134,000 barrels per barrel (bpd) to 1.158 million bpd in June from 1.024 million in May, based on direct communication.\nRead also: Angola overtakes Nigeria as Africa’s biggest oil producerAngola’s oil production rose to 1.175 million bpd in June, up from 1.162 million bpd in May, based on direct communication.\n“Crude oil output increased mainly in Saudi Arabia, the UAE, IR Iran, Kuwait and Angola, while production in Libya and Venezuela declined,” the 13-member oil cartel said.\nThe report said: “The share of OPEC crude oil in total global production decreased by 0.1 percentage points to 28.8 percent in June compared with the previous month."
  },
  {
    "headline": "Nigerian businesses flock to solar as diesel cost bites",
    "summarized_story": "Nigeria’s solar companies are seeing a surge in demand for mini-grids and equipment as businesses in Africa’s biggest oil producer look for alternative power sources as the cost of diesel soars locally due to rising global oil prices.\nThe price of diesel, not subsidised like petrol, has nearly tripled to N800 a litre ($1.93).\nSolar power adoption is estimated at below 2 percent and some businesses perceive it as unsuitable for large-scale use, industry executives said.\nThat is changing as energy costs eat into company margins, forcing businesses to actively consider solar, a clean form of energy, said Prince Ojeabulu, CEO at Rensource Energy.\nIn 2021, Rensource installed under a megawatt of solar panels but it is now constructing 6 MW plants."
  },
  {
    "headline": "Exxon-Seplat deal: NNPC’s push puts investors on notice",
    "summarized_story": "Analysts say NNPC’s action could have a material effect on future divestment plans based on how it communicates its intention to investors.\nIn February, Seplat Energy Plc, a major energy company, had agreed to buy the entire onshore and shallow-water assets of ExxonMobil in Nigeria but the NNPC had opposed the deal.\nBut Mobil Oil Producing said the deal was not an asset sale but merely a sale of its shares to another entity, an argument the NNPC has refused to accept.\nRead also: NNPC, Sahara JV to build LPG jetties across West AfricaFollowing this refusal, the battle to see the deal through moved to the courts.\nThe hearing date for the motion on notice in the NNPC suit has been fixed for July 15."
  },
  {
    "headline": "IGP deploys 21,000 police officers for Osun election – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestMr Usman Alkali Baba, Inspector General of Police on Tuesday said 21,000 police officers would be deployed for the Osun July 16 governorship election.\nAlkali Baba stated this in Osogbo at the Independent National Electoral Commission (INEC) Osun 2022 Governorship Election Stakeholders’ Meeting.\nHe said the deployed officers would provide security, protect the electorate, INEC personnel and materials before, during and after the election.\nIn his address, Prof. Mahmood Yakubu, INEC National Chairman, said the commission was fully ready to conduct the Osun election.\nAccording to him, the election materials have already been deployed to all the state INEC local government area offices."
  },
  {
    "headline": "Shaibu urges Edo Pilgrims to pray for success of 2023 general elections – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Acting Governor, Rt.\nComrade Philip Shaibu has charged Edo State Pilgrims travelling to Israel for the 2022 pilgrimage to pray for Nigeria ahead of the 2023 general elections.\nShaibu gave the charge while addressing Edo State pilgrims to the holy land, urging them to be good ambassadors of the state, as they pray for Edo State and Nigeria over her many challenges.\nWe are faced with insecurity, economic retrogression and other serious challenges troubling the nation.”Shaibu charged the Edo State Pilgrims to pray for the unity and progress of the nation, adding: “2023 is another election year.\nFourteen pilgrims are traveling from Edo State for the 2022 pilgrimage to Israel.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Less than 1 percent of enrollees benefitting from healthcare fund, Edo Health Commissioner decries – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…urges residents to take advantage of funding to reduce out-of-pocket spendingThe Edo State Commissioner for Health, Prof. Obehi Akoria has urged residents who have been enrolled into the Basic Healthcare Provision Fund (BHCPF) to take advantage of the funding provision for indigent persons in the state to access quality healthcare services.\nThe Commissioner decried that fewer than 50 enrollees of the healthcare fund had benefited from the services since it became active in the state in 2021.\nFrom just over 2000 enrollees, we had 29,211 enrollees State-wide as at June 30, 2021.\n“We have taken the pains to reach thousands of enrollees by calling them directly and we found that majority of enrollees who ought to be benefitting from the healthcare funding are not.\nIn Uteh PHC (Ikpoba-Okha LGA) which topped the charts in performance – Nurse Thelma Kokobili has been marked for special recognition."
  },
  {
    "headline": "Russia-Ukraine war and global gas supply: Nigeria as `a buffer’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Russia and Ukraine standoff, vis a vis boycott of Russian gas has triggered significant disruptions and created a huge shortage in global gas supply chain.\nIt implies that any dislodgement in Russia’s gas supply would leave a deep crater which must be exploited by Nigeria, with natural gas reserve of 209.5 trillion cubic feet.\n“The first memo, council approved for the NNPC Ltd to execute MoU with ECOWAS for the construction of the Nigeria-Morocco Gas Pipeline.\nHe urged EU to increase investments in gas and hydrocarbons in Nigeria to be able to meet the bloc’s energy needs.\nThey say that the interregnum in global gas supply presents a gaping opportunity for Nigeria to ramp up gas export and reap bountifully from a ready market."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "2023: Muslim-Muslim ticket a disastrous error, dead on arrival – Babachir Lawal",
    "summarized_story": "Mr. Babachir Lawal, former secretary to the government of the federation (SGF), has pronounced as dead on arrival, the Muslim-Muslim presidential ticket of the ruling All Progressives Congress (APC).\nIn a statement he personally signed on Tuesday, BD Lawal described the choice of a Muslim-Muslim presidential ticket as a disastrous error.\n“The northern governors and some northern moslem elite must have persuaded him that they will never vote for a ticket that has a northern Christian on it.\nBut, we’re to win and become President of Nigeria, it will be as a sectional President; an Islamic President.\nI have also on several occasions passed on to him counsels and messages from some well meaning Nigerians intended to alert him on the possible outcomes of the Presidential ticket permutations."
  },
  {
    "headline": "Neimeth Pharmaceuticals set to raise N3.68bn via rights issue",
    "summarized_story": "Adebayo ObajemuNeimeth International Pharmaceuticals Plc has disclosed plan to float a rights issue of N3.67bn via the Nigerian capital market.\nThe rights issue which billed to commence in August would be deployed to raise N3,679,618,625 at the cost of N1.55k per 50 Kobo share.\nThe pharmaceutical giant said Neimeth its shareholders had in March, 2022 at the 63rd annual general meeting, given their nod to the creation of 2,373,947,500 additional ordinary shares which would be allotted at the rate of five new shares for every four shares currently held in the company.\nThe Chairman of the Board, Dr. Ambrosie Orjiako, said the money was being raised to construct a new multi products facility that would be tailored to comply with the World Health Organization’s current standards of Good Manufacturing Practice at Amawbia in Anambra State.\nIt is also to be used to support the company’s strategic plan of maintaining a sustainable capital structure, leverage the company’s balance sheet, reduce cost of borrowing or finance costs and fund working capital."
  },
  {
    "headline": "Tinubu, Adamu, governors, other APC leaders rally support for Oyetola in Osun",
    "summarized_story": "The progressive governors, therefore, reaffirmed their unalloyed support for Governor Oyetola, just as they declared their readiness to do all necessary within the law to ensure his re-election.\nWe are taking no chances with the affairs of Osun because the state deserves a leader like Oyetola in its quest for development.\nIn his words; “We thank the originator of IleriOluwa political slogan, our dear Governor Oyetola, the one because of whom we are here.\nIt is a job that is gratifying and doable because Governor Oyetola has indeed performed excellently well.\nIn his short remarks, Governor Oyetola, said Osun is on the path of consolidating on the gains of the last three and a half years."
  },
  {
    "headline": "Northern APC Christians withdraw support for Tinubu over Muslim-Muslim ticket",
    "summarized_story": "A coalition of Christians from the north in the All Progressive Congress (APC) has withdrawn support for Bola Tinubu, the party’s presidential candidate, warning that the Muslim-Muslim ticket of the party for the 2023 general election will have serious and grave consequences.\nThe organisation made up of Christian politicians in the 19 northern states within the APC, said they would not go against their conscience and faith, and go to their various constituencies to campaign for a Muslim-Muslim ticket.\nThe group made its position known in a communique issued on Tuesday in Abuja after its meeting, which discussed the issues of the APC Muslim-Muslim ticket and the implications to the nation, signed by its Chairman, Prof. Doknan Sheni, and Secretary-General, Ishaya Bauka.\nThe communique read, “The selection of a Muslim vice presidential candidate portrayed insensitivity to the Christians in the nation.\n“The fear of the Christians in the North and the nation, in general, is that the APC will be viewed as an Islamic party and the Muslim -Muslim ticket was not possible in 2015, why should it be possible in 2023?"
  },
  {
    "headline": "2023: Afenifere declares support for Peter Obi",
    "summarized_story": "Afenifere, Yoruba sociocultural group, has declared support for Mr. Peter Obi, presidential candidate of the Labour Party for the 2023 general election.\n“It is only Peter Obi that can rule independently without the influence of these criminals in the government.\n“We know Peter Obi very well , that’s why we endorsed him.\nNone of them loves Nigeria.”The Afenifere leader said the south-east should be trusted with power, adding that the geopolitical zone deserves to lead the country.\nI am sure Peter Obi will not subject himself to the northerners like Tinubu and Atiku would do if elected,” he added."
  },
  {
    "headline": "Leave PAP Administrator Alone, Ex-Agitators Warn NASS",
    "summarized_story": "Former agitators in the Niger Delta region, have warned the National Assembly, especially the Senate, to withdraw its threat of arrest warrant against the Interim Administrator of the Presidential Amnesty Programme (PAP), Colonel Milland Dikkio (Rtd).\nThis is as they reminded the National Assembly that the PAP was not an automated teller machine (ATM) for politicians from the Niger Delta region and Nigeria at large.\nTherefore, the allegation by the Senator that the Interim Administrator shunned the Senate Committee on Public Accounts is not correct.\n“From our findings, the said Senator made series of private attempts to see the Interim Administrator with a view to having some assistance as party primaries were being awaited.\n“We therefore urge Senator Urhogbide to act with caution and not visit his failure at the last Senatorial primary in Edo State on the Amnesty coordinator."
  },
  {
    "headline": "Leave PAP Administrator Alone, Ex-Agitators Warn NASS",
    "summarized_story": "Former agitators in the Niger Delta region, have warned the National Assembly, especially the Senate, to withdraw its threat of arrest warrant against the Interim Administrator of the Presidential Amnesty Programme (PAP), Colonel Milland Dikkio (Rtd).\nThis is as they reminded the National Assembly that the PAP was not an automated teller machine (ATM) for politicians from the Niger Delta region and Nigeria at large.\nTherefore, the allegation by the Senator that the Interim Administrator shunned the Senate Committee on Public Accounts is not correct.\n“From our findings, the said Senator made series of private attempts to see the Interim Administrator with a view to having some assistance as party primaries were being awaited.\n“We therefore urge Senator Urhogbide to act with caution and not visit his failure at the last Senatorial primary in Edo State on the Amnesty coordinator."
  },
  {
    "headline": "Muslim-Muslim Ticket Dead On Arrival, Says Ex-SGF Babachir Lawal",
    "summarized_story": "The immediate-past Secretary to the Government of the Federation (SGF), Mr Babachir David Lawal, has declared that the Muslim-Muslim presidential ticket of the ruling All Progressives Congress (APC) is dead on arrival.\nIn a statement he personally signed on Tuesday, BD Lawal described the choice of a Muslim-Muslim presidential ticket as a disastrous error.\n“The northern governors and some northern moslem elite must have persuaded him that they will never vote for a ticket that has a northern Christian on it.\nBut if he thinks a Moslem-Moslem ticket will win him the northern Muslim votes, he should have a rethink.\nI have also on several occasions passed on to him counsels and messages from some well meaning Nigerians intended to alert him on the possible outcomes of the Presidential ticket permutations."
  },
  {
    "headline": "Muslim-Muslim Ticket Dead On Arrival, Says Ex-SGF Babachir Lawal",
    "summarized_story": "The immediate-past Secretary to the Government of the Federation (SGF), Mr Babachir David Lawal, has declared that the Muslim-Muslim presidential ticket of the ruling All Progressives Congress (APC) is dead on arrival.\nIn a statement he personally signed on Tuesday, BD Lawal described the choice of a Muslim-Muslim presidential ticket as a disastrous error.\n“The northern governors and some northern moslem elite must have persuaded him that they will never vote for a ticket that has a northern Christian on it.\nBut if he thinks a Moslem-Moslem ticket will win him the northern Muslim votes, he should have a rethink.\nI have also on several occasions passed on to him counsels and messages from some well meaning Nigerians intended to alert him on the possible outcomes of the Presidential ticket permutations."
  },
  {
    "headline": "Osinbajo To Attend Africa International Housing Show 2022",
    "summarized_story": "The coordinator of the Africa’s largest housing and construction expo, Africa International Housing Show (AIHS), Festus Adebayo, has said that Vice President Yemi Osinbajo, has been invited to declare open the 16th annual Africa International Housing Show (AIHS), scheduled for July 25 – 28, 2022.\nThe event with the theme, “Housing For All: The Role of Government in Creating an Effective Enabling Environment” holds at the International Conference Center, Abuja.\n“We have invited the Vice President of the Federal Republic of Nigeria to the 16th AIHS, who is also expected to declare the event open.\nThis is premised on his initiative of N2 million affordable housing idea and for his initiative in bringing alive the idea of social housing on which the Family Homes Funds was birthed,” the statement reads in part.\n“We cannot host AIHS 2022 without him because of his painstaking and passionate interest in social and affordable housing in Nigeria."
  },
  {
    "headline": "Osun 2022: Osinbajo, Aregbesola Absent At APC Mega Rally",
    "summarized_story": "Vice President Yemi Osinbajo and ex-Osun State Governor, Rauf Aregbesola, were noticeably absent at the All Progressives Congress mega rally for the re-election of Osun State Governor, Adegboyega Oyetola, held in Osogbo on Tuesday.\nThe mega rally committee in a statement on Monday, signed by its spokesperson, Funke Egbemode, had listed Osinbajo as one of the guests expected at the rally.\nAlso in attendance were; a former APC national chairman, Adams Oshiomhole; the 2023 APC presidential flagbearer and his running mate, Senator Bola Tinubu, Kashim Shettima respectively.\nHe was not invited (for Osun rally).\nIn his remarks, the APC presidential flagbearer, Senator Bola Tinubu, urged the people of Osun State to replicate the victory recorded last month in Ekiti."
  },
  {
    "headline": "PDP zonal treasurer resigns over ‘unjust treatment’ of Wike",
    "summarized_story": "The Peoples Democratic Party (PDP) North-East treasurer Hon.\nGaladima Abba Itas has dumped the party over what he described as the ‘unjust treatment’ to Rivers Governor Nyesom Wike, during and after the presidential primary convention.\nHe faulted the choice of Delta Governor Ifeanyi Okowa as running mate to PDP presidential candidate Atiku Abubakar, saying it contradicts the principles and ideologies of the party.\nIn the letter of resignation addressed to the Ward Chairman, Itas Gadau Local Government Area, Bauchi State on Tuesday, Itas said the current situation in the party does not inspire confidence, adding the PDP is not ready to regain power in 2023.\nParts of the letter read: “I write to tender my resignation as zonal treasurer (North-east) and a member of People’s Democratic Party, (PDP) My resignation was as a result of wide consultations with my teaming supporters, political associates and in response to the unfair and unjust treatment extended to His Excellency, Barr Nyesom Ezenwo Wike CON, the Executive Governor of Rivers State during and after the presidential primary convention”“As a critical stakeholder, unjust and unfair treatment of founding members posed a great threat to the collective political interest of our leaders and us, thereby necessitating my resignation in protest of the ways things are unfolding in the party.”"
  },
  {
    "headline": "Edwin Clark Reveals Real Reason Jonathan Shunned PDP Since 2015",
    "summarized_story": "Chief Clark stated: “Now coming home politically, Jonathan was the president for some time as the result of the death of President Yar’Adua.\nEven in 2015, the northern PDP leaders ganged up with APC, Tinubu and removed Jonathan from office.\n“So, when people say why is Jonathan not in PDP, he knows how they betrayed him, how the northern PDP governors contributed money towards Buhari’s success, how members of government betrayed him.\nSo, the PDP, a party we love, PDP a party of southern Nigeria disappointed us.\nSo, if he becomes president what will he do?”Clark also accused the PDP presidential candidate of having been opposing Dr Jonathan since 2010."
  },
  {
    "headline": "APC Mega Rally: Oyetola has brought purpose to governance – APC Govs, party leadership",
    "summarized_story": "The progressive governors, therefore, reaffirmed their unalloyed support for Governor Oyetola just as they declared their readiness to do all necessary within the law to ensure his re-election.\nWe are taking no chances with the affairs of Osun because the state deserves a leader like Oyetola in its quest for development.\nIn his words; “We thank the originator of IleriOluwa political slogan, our dear Governor Oyetola, the one because of whom we are here.\nIt is a job that is gratifying and doable because Governor Oyetola has indeed performed excellently well.\nIn his short remarks, Governor Oyetola, said Osun is on the path of consolidating on the gains of the last three and a half years."
  },
  {
    "headline": "Osun July 16 governorship poll: INEC warns on vote-buying, insists on Electoral Offences Commission, Tribunal",
    "summarized_story": "The Independent National Electoral Commission (INEC) has cautioned against vote-buying and called for the establishment of the Electoral Offences Commission and Tribunal as recommended by the Uwais Committee in 2009, reinforced by the Lemu Committee in 2011 and the Nnamani Committee in 2017.\nYakubu said the choice of who becomes the next governor in the state is entirely in the hands of Osun state voters.\nIn this regard, the 2022 Osun state governorship election will also make history, being the first election in which INEC is deploying PwDs as ad hoc staff.\nWe had several engagements with the security agencies at national, state and Local Government levels.\nOf the 1,955,657 registered voters in Osun State, 1,479,595 (or 76%) have collected their cards as at Sunday 10th July 2022."
  },
  {
    "headline": "Why I picked Funke Akindele as running mate, Lagos PDP governorship candidate opens up",
    "summarized_story": "The Peoples Democratic Party (PDP) Lagos State governorship candidate, Olajide Adediran, has given reason for the party’s choice of actress Funke Akindele as his running mate.\nHe said, “I appeal to the entire populace to work with me and my running mate, who will add more value to my candidacy.\nMy running mate is someone who is large-hearted with a well-known history of service and advocacy.\n“I am proud to present Barrister Olufunke Ayotunde Akindele as my running mate and the Deputy Governorship candidate of the People’s Democratic Party in Lagos for the 2023 general elections.\n“Together, we will serve and offer you a breath of fresh air.”While confirming her candidacy, Akindele noted that she is suspending her acting career to take on her new assignment."
  },
  {
    "headline": "FirstBank: Introducing Saving Accounts products to suit customers’ lifestyle",
    "summarized_story": "The savings account enables one to save towards a project or helps keep money aside, may be for a rainy day.\nFirst Bank of Nigeria Limited is one of the nation’s banks that introduced different savings account products to meet the demand and lifestyle of its customers.\nSome of these products include FirstInstant savings, FirstInstant plus, FirstSavings plus account, XploreFirst savings account and among others.\nFirstInstant Savings AccountThe FirstBank’s Firstinstant savings account was designed for customers who live an ‘on the go’ lifestyle.\nUnlike a current account, a savings bank account earns interest."
  },
  {
    "headline": "Mining: Research, devt pivotal to achieving economic diversification- Asuquo",
    "summarized_story": "Prof. Linus Asuquo has said that research and development should be given priority if the nation was bent on achieving its goals on economic diversification.\nLet me say this, as I have repeated many times, we should not play with the Ajaokuta Steel company.\n“So, if we start doing research and development and the Ajaokuta Steel Company is working, there will be development, without Ajaokuta working, then we are just playing lip service.\nWe just seat down at home here and criticize that our Ajaokuta Steel Company is outdated.\nEven if it’s outdated, we can modernize it into sections; that’s why it’s called Ajaokuta Steel Company."
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "REA, FADAMA sign MoU for Agriculture, water resources programmes electrification",
    "summarized_story": "By Onu OkorieRural Electrification Agency REA has signed a Memorandum of Understanding MoU with the National Fadama Development Project NFDP to collaborate on several activities during the planning and implementation of electrification programmes targeted at agriculture, land and water resources.\nAccording to him, “The MoU will mutually benefit both the REA and FADAMA.\nThese “Agro-Energy” programmes are intended to provide electricity for productive use and unlock the economic potential/activities in rural and agrarian communities alike.\nREA intends to provide decentralised solar pumps and/or centralised solar mini-grids to viable FADAMA irrigation schemes.\nREA intends to provide Solar Home Systems (SHS) and Solar Street Lights (SSLs) to viable IDP communities."
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "2023: Tinubu’s Muslim-Muslim Ticket Is ‘A Disastrous Error, Dead On Arrival’ – Babachir Lawal",
    "summarized_story": "Former Secretary to the Government of the Federation, Babachir Lawal, has faulted the announcement of a Muslim-Muslim ticket by the presidential candidate of the All Progressives Congress, Bola Ahmed Tinubu.\n“But if he thinks a Moslem-Moslem ticket will win him the northern Muslim votes, he should have a rethink.\nI have also on several occasions passed on to him counsels and messages from some well meaning Nigerians intended to alert him on the possible outcomes of the Presidential ticket permutations.\nThe northern governors and some northern moslem elites must have persuaded him that they will never vote for a ticket that has a northern Christian on it.\nBut, were he to win and become President of Nigeria, it will be as a sectional President; an Islamic President."
  },
  {
    "headline": "Kuje Prison Attack: If Nigerians Fail To Appreciate Govt’s Efforts, It Will Be Too Sad – Aregbesola",
    "summarized_story": "Minister of Interior, Rauf Aregbesola has described the attack on the Kuje custodial centre and similar attacks across the country as a “fallout” of the Federal Government’s success against terrorism.\nAregbesola argued that the insurgents have been decimated and are only seeking relevance, noting that it would be a shame if Nigerians do not appreciate the efforts of the Federal Government.\nREAD ALSO: Police Recapture Inmate Who Fled Kuje Prison In NigerHe said the government was committed to completely eliminating the criminals.\n“I want us to be very clear in our minds, that if you fail to appreciate the efforts of government, it would be too sad.\nA time was when almost three-quarter of North-East was under the siege of the insurgents."
  },
  {
    "headline": "2023: Labour Party Has Better Structure Than APC, PDP – Pat Utomi",
    "summarized_story": "﻿A political economist, Professor Pat Utomi, on Tuesday said the Labour Party has a better structure than the nation’s two dominant parties – the ruling All Progressives Congress (APC) and the Peoples Democratic Party (PDP).\nUtomi, a member of the Labour party, made the comment as a guest on Channels Television’s Politics Today.\nHe expressed confidence that his party will coast to victory in the 2023 presidential election, which is barely seven months away.\nREAD ALSO: Lagos PDP Gov Candidate, Jandor Picks Funke Akindele As Running Mate“Labour Party has a super structure, much better than the structures APC and the PDP have,” he said.\nOn the possibility of a merger with other parties, the Labour party chieftain stated that talks are ongoing with several political parties, although he did not disclose any specific one."
  },
  {
    "headline": "Osun Election: Tinubu, Lawan, APC Governors Campaign For Oyetola In Osogbo",
    "summarized_story": "﻿Presidential candidate of the All Progressives Congress in the 2023 election, Bola Ahmed Tinubu, attended a rally in Osogbo on Tuesday to campaign for Governor Adegboyega Oyetola.\nOyetola is seeking a second term of four years in Saturday’s governorship election in Osun state.\nMr Tinubu attended the rally alongside Senate President, Ahmad Lawan and several APC Governors, including campaign lead, Governor Babajide Sanwo-Olu of Lagos State.\nOther Governors present at the rally include Abdullahi Ganduje of Kano State, Babagana Zulum of Borno State and Atiku Bagudu of Kebbi State.\nNational Chairman of the APC, Abdullahi Adamu and the party’s Vice Presidential candidate, Kassim Shettima, were also present."
  },
  {
    "headline": "Sri Lanka President Flees His Country On A Military Aircraft",
    "summarized_story": "Sri Lanka’s embattled president flew out of his country early Wednesday, in a probable prelude to his resignation after months of widespread protests over the island nation’s worst-ever economic crisis.\nAs president, Rajapaksa enjoys immunity from arrest, and he is believed to have wanted to go abroad before stepping down to avoid the possibility of being detained.\nREAD ALSO: Ukraine, Russia To Hold Grain Talks As War Sends Food Prices Soaring“Their passports were stamped and they boarded the special air force flight,” an immigration official involved in the process told AFP.\nPremadasa is the son of former president Ranasinghe Premadasa, who was assassinated in a Tamil rebel suicide bombing in May 1993.\nSri Lanka defaulted on its $51-billion foreign debt in April and is in talks with the IMF for a possible bailout."
  },
  {
    "headline": "Ondo youths movement drums support for NNPP Assembly Candidate, Kolawole Oluwaseyi -",
    "summarized_story": "AdvertisementAlabi said Akoko North-West youths are backing his candidacy, because of his antecedents and love for development of the youths.\nThe communique reads in part, “Many aspire to lead, even when they don’t have what it takes to lead.\nThe group added that it is time to support a personality with a vision and mission to redefine development in the constituency.\nAdvertisementIt also called on all stakeholders in Akoko North-West beyond party affiliations to support aspiration of Oluwaseyi, so that the constituency can move forward.\n“His antecedents in diverse professions are clear pointers that he is more fit than any other person to lead the constituency”, the group stressed."
  },
  {
    "headline": "Chief Whip dismisses Rumoured Defection of 8 PDP Oyo Lawmakers -",
    "summarized_story": "Hon Adedibu, who is also the Chief Whip of the House debunked the rumor during Wednesday’s plenary under personal explanation.\nAdvertisementHe explained that though he and the other seven members will not be returning to the House in 2023, there is no plan by them to leave the ruling Peoples Democratic Party, PDP in Oyo State.\nHon Adedibu urged members of the public to disregard the unfounded rumour.\n” On behalf of other seven members, i Hon Hakeem Adedibu wish to state categorically that there was never a plan by me or any of the other seven members of the PDP to defect to another party .\n” Hon Hakeem Adedibu."
  },
  {
    "headline": "Oyo assembly directs CJ to set up panel against Deputy Governor -",
    "summarized_story": "AdvertisementRecall that on the 17th of June, 2022 a correspondence/petition titled ” Notice of Allegations of Gross Misconduct Against the Deputy Governor of Oyo State, Engr Rauf Olaniyan” was read at the floor of the plenary.\nIn the petition, the 23members accused the Deputy Governor of Gross Misconduct, abuse of office, financial recklessness, abandonment of office and insubordination.\nAdvertisementAdvertisementThe House thereafter served the Deputy Governor and all other members of the Legislature a copy of the allegations.\nWhile reading the motion, the Majority Leader noted that up till now the Deputy Governor had not responded to the copy of the allegations served him by the House.\n“We have no say whether the State Deputy Governor is guilty or not."
  },
  {
    "headline": "Over 78,000 persons have completed their registration in Oyo- INEC -",
    "summarized_story": "The Independent National Electoral Commission says a total of 78,420 persons have completed the Continuous Voters Registration in Oyo State but only about 45,000 are valid out of them.\nThe Oyo state Resident Electoral Commissioner Mutiu Agboke disclosed this at a media briefing held in Ibadan.\nAdvertisementAdvertisementAccording to him, we have 78,420 registrants that completed registration during these period but there were only 45,187 valid registration out of it all.\nThe Independent National Electoral Commission, INEC, had originally scheduled the deadline for the stoppage of registration for the PVC’s for the 30th of June but has now extended the deadline indefinitely.\nThis is another in the Series of regular update by the Election Mangement Body, INEC."
  },
  {
    "headline": "We’ll Make Promoters of Muslim-Muslim Ticket Pay Heavily – Sam Ayedogbon",
    "summarized_story": "The All Progressives Congress (APC), put the speculations of a Muslim Muslim ticket to rest on Sunday when its presidential candidate, Asiwaju Bola Tinubu, announced former Borno State governor, Senator Kashim Shettima, as his running mate.\nThe news of Shettima becoming Tinubu’s running mate wasn’t well received by different stakeholders around the country.\nTinubu’s choice is contrary to the advice given by the Christian Association of Nigeria (CAN), which had earlier warned presidential candidates not to field running mates of the same religion.\nAlso, South South Leader, Chief Edwin Clark has lampooned the nomination of Senator Kashim Shettima.\nTo discuss the ruling party’s choice of a Muslim-Muslim ticket ahead of the 2023 election in Nigeria, is Abraham Sam Aiyedogbon, Senior Apostolic Leader, Realm of Glory International Churches and Convener, Catalyst for Global Peace and Justice Initiative."
  },
  {
    "headline": "Over 13m Nigerians Hold Cryptocurrencies, Says UN Report",
    "summarized_story": "According to the report, although expected to remain positive, trade growth has continued to slow during Q2 2022.\nThe report stressed that trade growth rates in Q1 2022 remained strong across all geographic regions, although somewhat lower in the East Asia and Pacific regions.\nThe report showed that most economic sectors recorded substantial year-over-year increases in the value of their trade in Q1 2022.\nTrade growth was also above average for metals and chemicals.\nOther factors expected to influence global trade this year are continuing challenges for global supply chains, regionalisation trends and policies supporting the transition towards a greener global economy."
  },
  {
    "headline": "UK PM Johnson’s Replacement to Be Announced September 5",
    "summarized_story": "The new UK prime minister to replace the outgoing Boris Johnson will be announced on September 5, the ruling Conservative party said Monday, with 11 hopefuls currently vying for the job.\nThe influential 1922 Committee of non-ministerial Tory MPs in parliament on Monday outlined a timetable for the party’s leadership election, TimesNow News reported.\nThe joint-executive secretary of the 1922 Committee, Bob Blackman, said they were committed to doing that before parliament breaks for the summer on July 21.\nAmong those running are Rishi Sunak and Sajid Javid, whose departures as finance minister and health minister sparked the wave of resignations.\nBrexit figurehead Johnson dramatically announced his departure as party leader last Thursday, but is staying on in Downing Street until a replacement is found."
  },
  {
    "headline": "Report: Why Europe’s Rush for Africa’s Gas Smacks of Hypocrisy",
    "summarized_story": "Europe’s growing pressure on Nigeria and a handful of other African countries to produce more gas for export, while declining to fund such projects citing carbon emission reasons has hypocrisy written all over it.\n“In another climb-down, European Union lawmakers recently voted to classify gas and nuclear energy projects within the bloc as ‘green investments’, potentially opening up billions of euros in fresh funding,” it added.\nIt noted that that approach has irked African leaders who need fuel to lift millions out of poverty.\n“It does not help their energy security, it does not help Nigeria’s economy, and it does not help the environment.\nMeanwhile, there’s a dearth of new funding for power plants to burn gas within Africa."
  },
  {
    "headline": "Buhari ‘Eager’ to Leave Office, Urges University Lecturers to End Strike",
    "summarized_story": "With about 10 months to the end of his second term tenure, President Muhammadu Buhari om Monday said he was eager to leave office and retire to his home town, Daura in Katsina State.\nBuhari, in a statement by his Senior Special Assistant on Media and Publicity, Garba Shehu, said: “I am eager to go.\nBuhari urged those in political positions and places of privilege to be mindful in helping the many Nigerians that were looking for opportunities.\n“If you are greedy, you won’t look around to see what is happening with those who are less endowed,’’ he said.\nThe president told the governors and political leaders that he had not been to his house in Daura for close to a year due to the demands of office."
  }
]