[
  {
    "headline": "Omicron variant mutation likely came from unvaccinated persons –Virologist",
    "summarized_story": "Amarachi OkehA professor of virology at the College of Medicine, University of Lagos, Sunday Omilabu, says that the Omicron COVID-19 variant is most likely a mutation from unvaccinated persons.\nAccording to Omilabu, mutations of the COVID-19 virus are most likely to come from unvaccinated persons.\nSpeaking further in an interview with PUNCH HealthWise, Omilabu said, “These variants are very likely to come from people who are not vaccinated.\nAnd once the variants come, the possibility is that that variant might not be taken care of by those that have already received the vaccine.\n“All of us must be covered with the vaccine so that there will be no place for the variant to develop."
  },
  {
    "headline": "Omicron variant mutation likely came from unvaccinated persons –Virologist",
    "summarized_story": "Amarachi OkehA professor of virology at the College of Medicine, University of Lagos, Sunday Omilabu, says that the Omicron COVID-19 variant is most likely a mutation from unvaccinated persons.\nAccording to Omilabu, mutations of the COVID-19 virus are most likely to come from unvaccinated persons.\nSpeaking further in an interview with PUNCH HealthWise, Omilabu said, “These variants are very likely to come from people who are not vaccinated.\nAnd once the variants come, the possibility is that that variant might not be taken care of by those that have already received the vaccine.\n“All of us must be covered with the vaccine so that there will be no place for the variant to develop."
  },
  {
    "headline": "UN warns countries against compulsory COVID-19 vaccination",
    "summarized_story": "Countries considering introducing vaccine mandates in the fight against COVID-19 must ensure they respect human rights, the UN rights chief said on Wednesday, stressing that forced vaccination was never acceptable.\nSpeaking to a Human Rights Council seminar via video message, Michelle Bachelet warned there were significant rights considerations that needed to be taken into account before making vaccination compulsory.\nAny “vaccine mandates must comply with the principles of legality, necessity, proportionality and non-discrimination”, she said, according to a transcript.\nBut she insisted that “vaccine mandates should be employed only when necessary for achieving compelling public health ends”.\n“Unless all people have genuine, practical access to vaccines, vaccine requirements will not be consistent with fundamental human rights principles of equality and non-discrimination,” she said."
  },
  {
    "headline": "UN warns countries against compulsory COVID-19 vaccination",
    "summarized_story": "Countries considering introducing vaccine mandates in the fight against COVID-19 must ensure they respect human rights, the UN rights chief said on Wednesday, stressing that forced vaccination was never acceptable.\nSpeaking to a Human Rights Council seminar via video message, Michelle Bachelet warned there were significant rights considerations that needed to be taken into account before making vaccination compulsory.\nAny “vaccine mandates must comply with the principles of legality, necessity, proportionality and non-discrimination”, she said, according to a transcript.\nBut she insisted that “vaccine mandates should be employed only when necessary for achieving compelling public health ends”.\n“Unless all people have genuine, practical access to vaccines, vaccine requirements will not be consistent with fundamental human rights principles of equality and non-discrimination,” she said."
  },
  {
    "headline": "Terror War: Troops rescue 20 policemen kidnapped by Boko Haram/ISWAP terrorists in Yobe",
    "summarized_story": "**Neutralize 91 bandits, terrorists, kidnappers nationwide**Arrest 82 terrorists and bandits accomplices.\n“Cumulatively, 14 armed bandits were neutralized, 4 of them were arrested and their collaborators.\nIn the course of the operations within the period, troops intercepted and arrested criminal elements as well as recovered arms and ammunitions.\n“Furthermore, the Air Component of Operation Thunder Strike, within the period carried out airstrikes against armed bandits at their enclaves.\n“During the operation, 45 armed bandits were neutralized and their structures housing logistics items and weapons were destroyed."
  },
  {
    "headline": "State of the Nation: I don’t sympathise with you, you applied to be President — Akande tells Buhari",
    "summarized_story": "By Olasunkanmi AkoniFormer National Chairman of All Progressives Congress, APC, Chief Bisi Akande, has said he has no sympathy for President Muhammadu Buhari over bashes being received on the challenges of insecurity bedevilling the nation, saying, he applied to be Nigeria President.\nOther personalities on the occasion were: All Progressives Congress, APC, National Leader, and former Governor of Lagos State, Bola Ahmed Tinubu, Governor of Osun State, Adegboyega Oyetola and Speaker Lagos State House of Assembly, Mudashiru Obasa.\nFormer Ogun State Governor, Gbenga Daniel, Ogbeni Rauf Aregbesola, Minister of Interior, represented by his son, Governor of Kano State, Abdullahi Ganduje, represented by his deputy, Gawuna, Governor of Kwara State Abdulraham Abdulrasak, Ooni of Ife, Oba Enitan Ogunwusi.\nAkande said: “We (Nigerians) know you love the country, but we want Nigeria to be peaceful, to prosper.\nI don’t sympathise with you because you applied for the job.”Details later…Vanguard News Nigeria"
  },
  {
    "headline": "Sokoto Attack: Bandits have turned Nigeria into killing field — Northern group",
    "summarized_story": "By Arogbonlo IsraelA coalition of Northern Youth Group under the aegis of Northern Ethnic Group Assembly, NEYGA, has condemned the killing of travellers by bandits in Isa Local Government Area of Sokoto.\nVanguard earlier reports bandits on Wednesday, openly set travellers ablaze in Sokoto leaving 23 dead while several others injured.\nReacting, the group in a statement forwarded to Vanguard Thursday, lamented that “this is one attack that cannot be forgotten in a hurry”.\n“Nigeria has been turned into a killing field by these bandits terrorising the country where innocent civilians looking for their daily breads are forced to live in perpetual fear,” the group added.\nHe added; “Virtually all parts of Nigeria are currently battling with one form of insecurity or the other with various crimes going on, largely unabated."
  },
  {
    "headline": "Undue interference by NBTE Boss ‘ll affect KADPOLY — Group alleges",
    "summarized_story": "By Ibrahim Hassan-WuyoA group, the Kaduna Polytechnic ( KADPOLY) Stakeholders Forum which comprised critical stakeholders in the administration and future of the Kaduna Polytechnic, has said it was not unaware of the huge concern that the alleged undue interference of the Executive Secretary of the National Board for Technical Education (NBTE) Professor Idris Mohammed Bugaje in the affairs of the institution was rapidly generating.\nThis was made known in a statement signed by Malam Musa Muhammad, Chairman and Joseph Kazachan, Secretary of the Forum, issued to journalists in Kaduna.\nProfessor Idris Mohammed Bugaje should refrain from undue interference in the affairs of the Kaduna Polytechnic.\nThe Federal Ministry of Education should warn the NBTE ES against such undue interference which will hinder smooth administration of the Polytechnic.\nEfforts are still being made to reach the NBTE boss for his reaction as of time of filing this report."
  },
  {
    "headline": "CSOs condemn alleged fake news on Buhari’s rejection of Electoral Bill",
    "summarized_story": "…say handiwork of enemies of democracyBy Gabriel Ewepu, ABUJACIVIL Society Organisations, CSOs, Thursday, condemned alleged fake news over rejection of Electoral Act Amendment Bill by President Muhammadu Buhari, allegedly published by one of the national dailies.\nThe statement reads in part, “Fellow Nigerians, we woke up this morning (Thursday) to the FAKE NEWS HEADLINE by The Sun Newspapers which read ‘Buhari Rejects Electoral Bill’.\n“We can authoritatively confirm that Mr President has not forwarded any letter rejecting the Electoral Amendment Bill to the National Assembly.\n“We reiterate again that Mr President promised on several occasions when he spoke about the Electoral Bill that he would sign an Electoral Amendment Bill sent to him by the National Assembly and in time for the elections.\n“Lastly, we urge the President to invite representatives of CSOs, Youth groups and Women groups to the Electoral Bill signing ceremony.”Vanguard News Nigeria"
  },
  {
    "headline": "OAU student’s murder: Allow Hilton owner access to choice medical facilities – Court to IGP",
    "summarized_story": "A Federal High Court in Abuja on Thursday ordered the Inspector General of Police (IGP) to allow the detained proprietor of Hilton Hotel in Ile-Ife, Osun State, Dr. Ramon Adegoke Adedoyin, access to medical facilities of his choice.\nThis is pending the hearing and determination of his fundamental human rights enforcement suit filed before the court.\nIn the alternative, he sought a court order to compel the police to allow him access medical facility of his choice as a diabetic and hypertensive patient.\nAdedoyin in the ex-parte motion, filed along with a fundamental human rights enforcement suit before the court, prayed to be admitted to bail pending the conclusion of an investigation by the police or pending the determination of his fundamental human rights enforcement suit.\nJustice Ekwo has however fixed January 21 for a hearing of the substantive fundamental human rights enforcement suit."
  },
  {
    "headline": "Akwa Ibom community spits fire over quit notice issued to proposed refinery",
    "summarized_story": "The people of Ibeno Local Government Area of Akwa Ibom State have spoken against the quit notice given to BUA Group, a prospective refinery in the state, by the people of Eket local council of the state.\nRecall that Eket and Esit Eket local governments had issued a quit notice to BUA Group, which is currently processing the land for the construction of a refinery, as they lay claim to the proposed land.\nThey noted that BUA Group, if allowed to operate in the state, would not only improve on the economic well being of Akwa Ibom people but Nigerians in general.\nThe statement in parts, “We regard the recent brazen and audacious quit notice which the Ekid people have issued to BUA group, a prospective investor as baseless.\n“To this end, we wish to sound a note of warning that: no part of Ibeno land belongs to Eket."
  },
  {
    "headline": "Lawmaker laments indiscriminate dumping of refuse in Abia",
    "summarized_story": "The member representing Umuahia North Constituency at the Abia State House of Assembly, Hon Kelechi Onuzuruike, has bemoaned the indiscriminate dumping of refuse in some areas of the state.\nOnuzuruike regretted that the streets and roads in Umuahia, the state capital, and Aba have been taken over by refuse, emphasising that the former had become an eyesore, which made him have an interface with the General Manager of Abia State Environments Protection Agency (ASEPA).\nThe Abia lawmaker, who is also the House Committee Chairman on Environment, made his feelings known while presenting a matter of urgent public importance on the floor of the state House of Assembly during its plenary sitting on Wednesday.\nOnuzuruike also used the medium to call on the executive arm of government to pay for those trucks so that the agency can effectively do its job.\nThe committee on the environment has been directed by the Assembly leadership to report back to the house on the summon."
  },
  {
    "headline": "Provide relief materials to fire victims – IYC appeals to Okowa",
    "summarized_story": "The Ijaw Youth Council, IYC, Western Zone on Thursday appealed to Governor Arthur Ifeanyi Okowa of Delta State as well as the Delta State Oil Producing Areas Development Commission, DESOPADEC, to provide relief materials to affected victims of an inferno.\nThe IYC, in a statement signed by its Information Officer, Lugard Izuokumor, said she is not happy with the manner the Delta State Government abandoned the victims without relief materials.\nDr Okotete urged the affected victims to be strong and hopeful.\nHe also appealed to the Director-General of the National Emergency Management Agency to also provide relief materials for the victims to ameliorate the effects of the inferno on them.\nOur correspondent reports that some of the affected victims are now domiciled in churches and primary school buildings."
  },
  {
    "headline": "Troops kill terrorists, recover arms, ammunition – Army",
    "summarized_story": "The Nigerian Army on Thursday said that the troops of Sector 1 Operation HADIN KAI (OPHK) have neutralized three Boko Haram/Islamic State West Africa Province terrorists.\nHe said the troops rained heavy fire on the terrorists, inflicting maximum casualty on them, adding that after gallantly eliminating the terrorists, the troops recovered one General Purpose Machine Gun (GPMG), three hand grenades, 62 links of 7.62mm ammunition, one motorcycle and three bicycles from the terrorists.\nHe further said that troops are currently exploiting further to clear the area of any escaping terrorists.\nThe Chief of Army Staff, Lt Gen Faruk Yahaya, has commended the vigilance and gallantry of the troops.\nTroops neutralise 20 terrorists in Borno"
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Why I left my borehole business to care for over 66,000 widows- Pastor",
    "summarized_story": "Pastor Tony Bassey, Founder of the Good-News Widows Outreach, on Thursday said he left his borehole business in Katsina to care and generate data of widows in Cross River.\n- Advertisement -“I travelled down to Ikom and asked for the widows in the community and was shown two of them.\nI started having meetings with them and from there, I started keeping their data and progressed to other LGAs,” he said.\nThe Pastor disclosed: “Although, later, some people joined me in 2011 we had files containing the data of 40,000 widows in Cross River; in 2016, we updated our records after going round again and had 66,000 widows.\nHe said in his work, he had always dissuaded the widows from begging but the government had a lot to do to encourage the widows and their children."
  },
  {
    "headline": "I won’t resign over jailbreaks, says Aregbesola",
    "summarized_story": "Interior Minister Rauf Aregbesola yesterday said the recent frequent jailbreaks across the country will not be a good reason for him to resign his position as minister.\nAregbesola explained that the jailbreaks did not happen as a result of lack of preparedness but through number of factors.\nI still don’t see any need for that because it’s not for lack of preparedness that the attacks were successful.\nAregbesola said the vehicles, which would be procured from local manufacturers, would complement the ones already in use by the Correctional Service.\nHe also announced the approval of N136.2 million for operational vehicles for the National Agency for the Control of AIDS (NACA)."
  },
  {
    "headline": "We didn’t sell PDP governorship ticket to Obaseki, says spokesman",
    "summarized_story": "The outgoing leadership of the Peoples Democratic Party (PDP) has dismissed insinuations that the party “taxed” Governor Godwin Obaseki for the September 2020 governorship ticket.\nBut, in an apparent reaction to the speed with which Osaseki secured the party’s ticket, Rivers State Governor Nyesom Wike had branded the PDP leaders “tax collectors”, a veiled accusation of selling the ticket to the highest bidder.\nHowever, the spokesman for the PDP, Kola Ologbondiyan, rejected the “tax collectors” tag as he urged Obaseki to explain to Nigerians and PDP members the processes that led to his emergence as a PDP candidate.\n“I will like to place on record that this NWC did not demand any form of gratification from Obaseki before he got the ticket of our party.\nIt is also important to restate that this NWC did not demand any form of “tax” from Governor Obaseki nor did we collect the same."
  },
  {
    "headline": "Money does not build a nation",
    "summarized_story": "SIR: President Muhammadu Buhari and his men and women in government have again proved that no amount of money builds a nation.\nBut the states of the nation and economy say it all – No amount of money builds a nation.\nPMB has been borrowing streams of billions of dollars claiming that he wants to build critical infrastructure with the money.\nHow long does it take to build a road in Nigeria, judging from the West-East and Ibadan-Lagos roads-building experiences?\nMere capital investment on infrastructure does not promote sustainable economic growth and industrialisation."
  },
  {
    "headline": "Happening now: Buhari arrives Naval base in Lagos",
    "summarized_story": "President Muhammadu Buhari has arrive the Nigerian Navy Dockyard for the commissioning of a locally built warship, NNS OJI, which he laid the keel in 2017.\nDetails soon100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here .\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nClick Here to Apply ."
  },
  {
    "headline": "Ojodu truck accident: Buhari, Sanwo-Olu condole with parents of dead students",
    "summarized_story": "By Lukman Olabiyi and Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has commiserated with parents, relations and friends of Ojodu Grammar School students who lost their lives in an accident, on Tuesday, along Isheri Road, Ojodu, in Lagos State.\nLagos State Governor, Babajide Sanwo-Olu, also expressed deep sorrow over the students who were crushed to death by a truck driver, on Tuesday.\nIn a condolence message signed by his Chief Press Secretary, Mr. Gboyega Akosile, yesterday, Sanwo-Olu described the demise of the students as sad, unfortunate and avoidable.\nThe governor sympathised with families of the bereaved students, their relatives, friends, management and staff of Ojodu Grammar school.\nHe said: “I commiserate with the parents, management, staff and students of Ojodu Grammar School over this unfortunate death of our students, whose lives were cut short by a truck driver yesterday."
  },
  {
    "headline": "UBA takes over Abuja Disco for loan default",
    "summarized_story": "By Adewale SanyaoluThe crises rocking the Abuja Electricity Distribution Company (AEDC) over a loan default by the majority shareholder/core investor, Kann Utility Company Limited, may have taken a new dimension as the lender, United Bank for Africa (UBA), has appointed a receiver/manager for the troubled Disco.\nAEDC is one of the 11 Discos unbundled from the defunct Power Holding Company of Nigeria (PHCN) and handed over to its core investor on November 1, 2013.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe utility rm serves enduse customers in its franchise areas covering Kogi, Nasarawa, Niger and the Federal Capital Territory.\nThe statement further explained that arising from Kann’s inability to service its acquisition loan and the en- suing dispute over the servicing of the loan from UBA Plc, the lender exercised its rights by appointing a Receiver/ Manager over Kann."
  },
  {
    "headline": "Security agencies’ welfare: Don’t leave your responsibility to states, Wike tells FG",
    "summarized_story": "From Tony John, Port HarcourtRivers State Governor, Nyesom Wike, has stressed the need for the Federal Government not to abandon its responsibility for the welfare of men and officers of the security agencies to the States.\nWike spoke at the 2022 Armed Forces Remembrance Day (AFRD) Emblem Appeal Fund Launching ceremony at the Government House Port Harcourt, stressing that state governments only provide necessary support.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“If you check for the six years, I’ve launched this emblem with not less than N20 million in every year.\nSo, when you calculate, you can have your own secretariat.”The governor urged the federal government not to abdicate its responsibility to fend for security agencies to the States."
  },
  {
    "headline": "Nembe oil spill: Aiteo stops leaking well head",
    "summarized_story": "From Femi Folaranmi, YenagoaThirty- eight days after it began spewing crude oil and hydrocarbon into the environment, the leaking Oil Mining Lease (OML 29) Santa Barbara south field Well 01, Nembe Local Government Area of Bayelsa State has finally been contained.\nAccording to investigations control packages have also been successfully being installed at both arms of the well.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nSuccessfully installed control packages on both arms,” a statement from the company said.\nMeanwhile, the senator representing Bayelsa West in the National Assembly, Seriake Dickson, has called on Aiteo, the Ministry of Petroleum Resources, the Ministry of Environment, National Oil Spill Detection and Response Agency and others to take immediate steps to rescue the threatened environment from total destruction and provide relief materials to the communities affected by the spill."
  },
  {
    "headline": "BREAKING: Court Strikes Out N2billion Suit Against SaharaReporters, Others Over Alleged Defamation Of Buhari's Minister, Malami",
    "summarized_story": "The Federal High Court in Abuja has struck out a N2 billion suit instituted against SaharaReporters and others for alleged defamatory publication against the Attorney General of the Federation and Minister of Justice, Abubakar Malami.\nA group, Incorporated Trustee of Global Integrity Crusade Network, had in the suit accused SaharaReporters, Vanguard Media Limited and two others of defamation against Malami.\nSee Also News Sowore Tackles Malami's Proxy Over Suit Challenging SaharaReporters Story on Justice Minister's Lavish LifestyleBut during the trial held on Thursday, the court dismissed the case.\nIn his judgement, justice Obiora Egwuatu awarded N100,000 against the litigants, saying they have no right to approach the Federal High Court to sue on behalf of the AGF.\nSee Also Corruption REVEALED: Multi-million Naira Property Built By Nigeria's Attorney-General, Malami For 22-year-old Son Uncovered"
  },
  {
    "headline": "BREAKING: Court Strikes Out N2billion Suit Against SaharaReporters, Others Over Alleged Defamation Of Buhari's Minister, Malami",
    "summarized_story": "The Federal High Court in Abuja has struck out a N2 billion suit instituted against SaharaReporters and others for alleged defamatory publication against the Attorney General of the Federation and Minister of Justice, Abubakar Malami.\nA group, Incorporated Trustee of Global Integrity Crusade Network, had in the suit accused SaharaReporters, Vanguard Media Limited and two others of defamation against Malami.\nSee Also News Sowore Tackles Malami's Proxy Over Suit Challenging SaharaReporters Story on Justice Minister's Lavish LifestyleBut during the trial held on Thursday, the court dismissed the case.\nIn his judgement, justice Obiora Egwuatu awarded N100,000 against the litigants, saying they have no right to approach the Federal High Court to sue on behalf of the AGF.\nSee Also Corruption REVEALED: Multi-million Naira Property Built By Nigeria's Attorney-General, Malami For 22-year-old Son Uncovered"
  },
  {
    "headline": "BREAKING: Lagos Governor, Sanwo-Olu Cancels Planned #EndSARS Peace Walk",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos State has cancelled the earlier announced peace walk which was scheduled for this month.\nThis comes amid the increasing cases of Omicron variant of the COVID-19 pandemic in Nigeria with the current number of cases at 6.\nSanwo-Olu, during a press briefing at theGovernment House in Alausa, Ikeja said he would be leading the peace walk to herald the healing of the land.\nA legal practitioner and Member of the Body of Benchers in Lagos, Chief 'Kunle Uthman recently advised the state governor against going ahead with the Peace Walk.\nUthman had described the planned Peace Walk as a bad idea, especially with the emergence of a new variant of COVID-19 known as Omicron."
  },
  {
    "headline": "BREAKING: Lagos Governor, Sanwo-Olu Cancels Planned #EndSARS Peace Walk",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos State has cancelled the earlier announced peace walk which was scheduled for this month.\nThis comes amid the increasing cases of Omicron variant of the COVID-19 pandemic in Nigeria with the current number of cases at 6.\nSanwo-Olu, during a press briefing at theGovernment House in Alausa, Ikeja said he would be leading the peace walk to herald the healing of the land.\nA legal practitioner and Member of the Body of Benchers in Lagos, Chief 'Kunle Uthman recently advised the state governor against going ahead with the Peace Walk.\nUthman had described the planned Peace Walk as a bad idea, especially with the emergence of a new variant of COVID-19 known as Omicron."
  },
  {
    "headline": "How Over 10 Gunmen Stormed Imo Community, Kidnapped Traditional Ruler",
    "summarized_story": "Some gunmen on Thursday morning kidnapped Damian Nwaigwe, the traditional ruler of Mbutu ancient kingdom in the Aboh Mbaise Local Government Area of Imo State.\nGunmenThe monarch was abducted at his palace around 2: 30am, a community source told The Punch.\nThe source said, \"The traditional ruler of Mbutu ancient kingdom in the Aboh Mbaise Local Government Area of Imo state, Eze Damian Nwaigwe, has been kidnapped.\nThe respected king was kidnapped at his palace around 2.30 am, on Thursday.\nThe incident has caused apprehension in the community, and villagers were said to have kept vigil from the time of the incident till dawn."
  },
  {
    "headline": "MATTERS ARISING: Can the minors arrested over Sylvester Oromoni's death be prosecuted?",
    "summarized_story": "“It’s a bit a dicey situation since the event leading to his death took place in Lagos within the school.\nAdvertisement“To avoid conflict of jurisdiction, if an incident happens in Lagos; Lagos has its own chief judge that will appoint the coroner to investigate the cause of death.\nHe said Lagos was chosen to conduct the coroner’s inquest because the cause of Oromoni’s death has been traced to Dowen College.\n“The essence of the coroner inquest is to find out, for anyone who died unnaturally in Lagos, how it happened.\nTHE QUESTION OF PROSECUTING MINORSThree of the accused, all of whom are believed to be under the age of 18, were detained by the Lagos state police."
  },
  {
    "headline": "MATTERS ARISING: Can the minors arrested over Sylvester Oromoni's death be prosecuted?",
    "summarized_story": "“It’s a bit a dicey situation since the event leading to his death took place in Lagos within the school.\nAdvertisement“To avoid conflict of jurisdiction, if an incident happens in Lagos; Lagos has its own chief judge that will appoint the coroner to investigate the cause of death.\nHe said Lagos was chosen to conduct the coroner’s inquest because the cause of Oromoni’s death has been traced to Dowen College.\n“The essence of the coroner inquest is to find out, for anyone who died unnaturally in Lagos, how it happened.\nTHE QUESTION OF PROSECUTING MINORSThree of the accused, all of whom are believed to be under the age of 18, were detained by the Lagos state police."
  },
  {
    "headline": "From Jan 1, Nigerians will pay 7.5% VAT on Facebook ads",
    "summarized_story": "Facebook says Nigerians will pay 7.5 percent value-added tax (VAT) on all ad placements from January 1, 2022.\nAccording to the statement, the charge will apply to those buying ads for businesses or personal purposes.\n“Due to implementation of a value-added tax (VAT) in Nigeria, Facebook is required to charge VAT on the sale of ads to advertisers, regardless of whether you’re buying ads for business or personal purposes,” the statement reads.\n“If you’re registered for VAT and provide your VAT ID, your VAT ID will show up on your ads receipts,” it added.\nTheCable understands that the new 7.5 percent VAT charge will also apply to Instagram ads."
  },
  {
    "headline": "From Jan 1, Nigerians will pay 7.5% VAT on Facebook ads",
    "summarized_story": "Facebook says Nigerians will pay 7.5 percent value-added tax (VAT) on all ad placements from January 1, 2022.\nAccording to the statement, the charge will apply to those buying ads for businesses or personal purposes.\n“Due to implementation of a value-added tax (VAT) in Nigeria, Facebook is required to charge VAT on the sale of ads to advertisers, regardless of whether you’re buying ads for business or personal purposes,” the statement reads.\n“If you’re registered for VAT and provide your VAT ID, your VAT ID will show up on your ads receipts,” it added.\nTheCable understands that the new 7.5 percent VAT charge will also apply to Instagram ads."
  },
  {
    "headline": "'We want them to be self-reliant' -- Borno bans NGOs from giving food to resettled communities",
    "summarized_story": "The Borno government has banned non-governmental organisations from distributing food and non-food items to resettled communities in the state.\n“As you are aware, the Borno State government is deeply committed to supporting our people to build resilience and support themselves out of poverty.\n“To this end, government has committed to closing all official IDP camps in Maiduguri by December 2021.\n“In furtherance of this, the Borno State government, after consultation with our communities, have decided that no partner organisation shall henceforth be allowed to distribute food and non-food items in any of our resettled communities.\nThe Borno government has closed four IDP camps in Maiduguri and resettled displaced persons in their ancestral communities or in areas of their choice."
  },
  {
    "headline": "This may be African languages’ best bet against extinction",
    "summarized_story": "How can this be avoided, especially for African languages?\nA diverse team building a diverse productAs the duo built, they realised they needed more diverse hands.\nThe startup also accepts volunteers that can help create learning content around the languages currently on its platform and upcoming ones.\nThe third Apiou raised is about niche: their product focuses on Africa and African languages and culture.\nUnlike other language learning apps that are including African languages just to check a diversity-and-inclusion box, Madla’s mission is deeper than educational or entertainment purposes; it’s really about cultural preservation."
  },
  {
    "headline": "Could Africa ditch cash?",
    "summarized_story": "The era of cash could be drawing to an end as central bank-backed digital currencies (CBDC”s) takes root in Africa.\nSo far, it’s only Nigeria that has launched an official, state-backed digital currency – christened the eNaira – on the continent as more countries continue to express interest.\nThe Baobab Network has traced at least 60 cryptocurrency companies in Africa, with the majority (43 percent) of them headquartered in Nigeria, followed by South Africa (18 percent) and Kenya (11 percent).\nThis is affirmed by another comparative study by GSMA published in March 2021 showing more than half of 310 live mobile money services in 2020 across the globe were found in Africa.\nWith over 55 percent of the world’s mobile money services recorded in Africa and a significant population turning to e-wallets and cryptocurrency, the question now becomes whether the continent might ditch paper money altogether."
  },
  {
    "headline": "CinetPay gets $2.4m seed to digitise payments in francophone Africa",
    "summarized_story": "CinetPay, an Ivory Coast-based startup that enables merchants in francophone Africa to accept and make electronic payments online or via mobile Point of Sale (PoS) devices, on Wednesday said it has raised $2.4 million seed funding.\nOn CinetPay’s mobile and web-based platform, businesses can sign up to process payments from over 130 different payment operators—including MTN mobile money, M-Pesa, Orange Money, Visa, Mastercard, etc—via a single interface.\nIn Ivory Coast, CinetPay’s first market, up to 75% of the population owns a mobile money account whereas less than 25% have a bank account.\nCinetPay’s payment gateway aggregates all mobile money available in the region, enabling merchants, through digital accounts, to accept online payments and reduce the reliance on cash.\nWalter Baddoo, co-founder and General Partner at 4DX Ventures reveals that the VC firm has been “tracking the francophone Africa market” for some time now and is impressed by CinetPay’s ambitious goal to digitise payments across the region."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Open banking and its progenitor, nominees, Techpoint Awards 2021, and some exciting news out of Africa",
    "summarized_story": "However, the open banking system is arguably one of his most significant achievements.\nOluwanifemi Kolawole had a chat with the finance expert, and he dished about his career, life, and the open banking system.\nRead: Adedeji Olowe is building a global reputation as Africa’s open banking leaderAnd the nominees are…By now, I’m sure you’ve heard about the biggest tech event in West Africa — Techpoint Build 2021.\nNominees for Techpoint Awards (Nigerian edition) are out!\nTo check if your favourite Nigerian startup made the list, click here: Techpoint Awards 2021: And the nominees are…Some exciting newsCinetPay Founders."
  },
  {
    "headline": "Road to super app? GIGM adds e-wallet, bill payment features",
    "summarized_story": "Share this article:Nigeria-based mobility giant, GIGM, has launched a payment service for its users.\nSource: SuppliedThe super app model has gained popularity in emerging economies following the successes of WeChat and Alipay in China.\nFor GIGM, this could be building on its tech-enabled transportation platform to offer payment services to its users.\nNigeria’s fragmented transportation services mean that users cannot travel comfortably over short distances.\nWith its position as a leading transportation service provider and the addition of a payment option, the company looks to be on the right path."
  },
  {
    "headline": "“We like to invest in businesses where the founders are in control.” – Ian Lessem on HAVAÍC’s investment thesis",
    "summarized_story": "Techpoint Africa had a chat with Ian Lessem, where he explained the firm’s origins and how they make investment decisions.\nImportantly, we like to invest in businesses where the founders are in control.\nThere are many, but in South Africa, it would be hearX, which provides audiology solutions to the mass market using technology.\nIn South Africa, we call them spaza shops, but they’re just local shops.\nSo while their main operations are in South Africa, Kenya, or Nigeria, they are very much international businesses."
  },
  {
    "headline": "Obaseki swears in five SSAs, 40 SAs in Ikpoba-Okha LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in five Senior Special Assistants (SSAs) and 40 Special Assistants (SAs) in Ikpoba-Okha Local Government Area (LGA) of the state.\nObaseki, who swore in the appointees at Idogbo, the administrative headquarters of Ikpoba-Okha, hailed the LGA for being politically organized and united.\nAccording to him, “Ikpoba-Okha is an LGA with a very high number of PDP members in the country.\n“Ikpoba-Okha is the largest local government in terms of population in Edo State and it’s setting the example in terms of politics.\nYou are well organized and it shows in the unity of leaders in the council, which has made harmonization possible."
  },
  {
    "headline": "WhatsApp launches ‘YouSaid’ campaign to curb false news – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – WhatsApp on Wednesday launched ‘YouSaid,’ a campaign that educates people on how to verify information and reduce the spread of false news in Nigeria.\nWhatsApp in a statement said that the campaign offers tips for users to spot false news and take responsibility in minimising its spread.\n“Regardless of the person you received the information from, as soon as you share, it becomes something people think ‘YouSaid’.\n“If you are unsure whether a message is true, check trusted news sites to see where the story came from.\nThe WhatsApp official noted that today the app protects the personal communication of over two billion users all over the world, securing it with end-to-end encryption by default."
  },
  {
    "headline": "Finance Bill 2021 scales 2nd reading in Senate – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Finance Bill 2021 on Wednesday, scaled second reading in Senate.\nThis followed a presentation of the lead debate by the Senate Leader, Mr Yahaya Abdullahi at plenary.\nThe News Agency of Nigeria (NAN) reports that the bill was transmitted by President Muhammadu Buhari to the senate and was read by Senate President, Dr Ahmad Lawan on the floor of the upper chamber on Tuesday.\n“The Finance Bill, 2021 seeks to support the implementation of the 2022 Federal Budget of Economic Growth and Sustainability by proposing key reforms to specific taxation, customs, excise, fiscal and other relevant laws.\nLawan said: “this joint committee will report to the senate, they will lay and consider on Tuesday."
  },
  {
    "headline": "Why interim management was appointed for AEDC- FG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal Government has clarified issues surrounding Tuesday appointment of an interim management for the Abuja Electricity Distribution Company (AEDC).\nAEDC franchise areas include the Federal Capital Territory (FCT), Kogi, Nasarawa and Niger States.\nAliyu said that the ministry’s engagement with the organised labour had led to the restoring of electricity service to the AEDC franchise areas.\nHe said that the takeover of the majority stake in AEDC by UBA has consequently led to the reported changes in the management of AEDC.\n“The changes in shareholding in AEDC and the appointment of an interim management for AEDC by the shareholders has been endorsed by the Nigerian Electricity Regulatory Commission (NERC) and the Bureau of Public Enterprises (“BPE) as co-shareholders in AEDC,” he said."
  },
  {
    "headline": "9mobile, NIMC reiterate commitment to effective national identity management",
    "summarized_story": "Nigerian telecommunication services provider, 9mobile, has reiterated its support to the nation’s identity management commission.\nThe telco gave the assurance at the one-day stakeholder engagement workshop and capacity building interactive session organized in collaboration with the National Identity Management Commission (NIMC), held last weekend in Abuja.\nThe workshop was organized to examine the capabilities and challenges in the NIMC service delivery process to proffer solutions to identified challenges.\nDelivering his remarks, Chief Executive Officer, 9mobile, Juergen Peschel, commended the management of NIMC for supporting the workshop to engage stakeholders in the industry.\nHe said, “9mobile will continue to play a pivotal role in the country’s national identity management enrollment scheme, especially in the rural areas where we have the mandate to register 10 million individuals."
  },
  {
    "headline": "SEC to collaborate with stakeholders to reduce Nigeria’s housing deficit",
    "summarized_story": "The Securities and Exchange Commission (SEC) has pledged to collaborate with relevant stakeholders on real estate investments in a bid to bring about a reduction in the housing deficit in the country.\nYuguda stated that the SEC Values the service that NIESV provides to the capital market and the nation adding that there is a large room for greater collaboration between the Commission and the Institution.\nAccording to him, “There is a renewed focus on Real Estate Investment Trust now, we are getting to see how the sector contributes more to our GDP by facilitating the trading of assets in the real estate sector.\nI think there is a huge room for collaboration, you have a very big role in the real estate sector.\nYou have a crucial role to play in the capital market especially as we focus on the Real Estate Investment Trust sector."
  },
  {
    "headline": "FirstBank DecemberIssaVybe: Showing Kindness as You Vybe",
    "summarized_story": "Across the spectrum of human endeavour, FirstBank stands tall behind its over 32 million customers and counting.\nAs FirstBank makes every day a vybe every December, it is also passionate about ensuring that everyone vybes with kindness.\nAt FirstBank, SPARK stands for Start Performing Acts of Random Kindness.\nIn promoting the need for kindness in education and ‘cyber kindness’, FirstBank sponsored two impactful webinars during its corporate responsibility & sustainability week in July 2021.\nJoin the kindness train, vybe with kindness this Yuletide and always!"
  },
  {
    "headline": "Gender based violence: U.S. Consulate, partners IACP, WARIF to train 100 Police, Civil Defense officers on countering menace",
    "summarized_story": "The U.S. Consulate General on Wednesday, concluded a three-day capacity building program for 100 police officers and civil defense operatives as part of efforts to counter gender-based violence in Nigeria.\nThe law enforcement training program covered several topics including ways of overcoming complexities of gender-based violence, trauma-informed first response, and investigative strategies to improve law enforcement response to gender-based violence.\nShe noted that a more open, inclusive and democratic society that respects the diversity and rights of women is critical to preventing and responding to gender-based violence.\nOn December 4, U.S. Consulate staff and members of the Young African Leaders Initiative (YALI), joined WARIF for its third annual advocacy march to call attention to combatting gender-based violence.\nIn addition, Consul General Pierangelo participated in a December 1 dialogue with civil society representatives working to end the scourge of gender-based violence in Nigeria."
  },
  {
    "headline": "Anyim to Nigerians: You’ll be proud of my presidency",
    "summarized_story": "By CHIKA CHIMEZIEFrontline Presidential aspirant, Senator Anyim Pius Anyim has promised to make Nigerians happy and proud if he becomes their President.\nAnyim said the problem in the country was that a large number of people are losing hope, feeling that they have no stake in the country.\n“When I become the President of this country, you will be proud to be called a Nigerian”, Anyim assured.\nIn his response, Alhaji Mohamed Lawan, leader of the League of Nigerian Youth for Equity said the group was supporting Anyim’s ambition because of his track record of good performance.\nNigeria, she said needs new leadership which she said Anyim represents hence her group had resolved to work for the emergence of the former senate president as Nigeria’s president in 2023."
  },
  {
    "headline": "Anyim to Nigerians: You’ll be proud of my presidency",
    "summarized_story": "By CHIKA CHIMEZIEFrontline Presidential aspirant, Senator Anyim Pius Anyim has promised to make Nigerians happy and proud if he becomes their President.\nAnyim said the problem in the country was that a large number of people are losing hope, feeling that they have no stake in the country.\n“When I become the President of this country, you will be proud to be called a Nigerian”, Anyim assured.\nIn his response, Alhaji Mohamed Lawan, leader of the League of Nigerian Youth for Equity said the group was supporting Anyim’s ambition because of his track record of good performance.\nNigeria, she said needs new leadership which she said Anyim represents hence her group had resolved to work for the emergence of the former senate president as Nigeria’s president in 2023."
  },
  {
    "headline": "EFCC Arraigns Man Who Concealed 2,863 ATM Cards in Noodles",
    "summarized_story": "By JUMOKE SANNIThe Lagos Command of the Economic and Financial Crimes Commission, EFCC, on Wednesday, December 8, 2021, arraigned one Ishaq Abubakar before Justice P.O.\nLifu of the Federal High Court sitting in Ikoyi, Lagos on an 11-count charge bordering on cybercrimes.\nHe was subsequently handed over to the EFCC on Thursday, September 10, 2020 by the Deputy Comptroller, Enforcement, NCS, Abudulmumuni Bako, for further investigation and prosecution.\n“Investigation revealed that 10 of the 2,863 ATM cards were stolen, as the owners had confirmed losing their cards, which were found in his possession.\nIt was further revealed that the remaining ATM cards were handed over to him by some persons in Kano for onward delivery to their contacts in Dubai for monetary benefits."
  },
  {
    "headline": "EFCC Arraigns Man Who Concealed 2,863 ATM Cards in Noodles",
    "summarized_story": "By JUMOKE SANNIThe Lagos Command of the Economic and Financial Crimes Commission, EFCC, on Wednesday, December 8, 2021, arraigned one Ishaq Abubakar before Justice P.O.\nLifu of the Federal High Court sitting in Ikoyi, Lagos on an 11-count charge bordering on cybercrimes.\nHe was subsequently handed over to the EFCC on Thursday, September 10, 2020 by the Deputy Comptroller, Enforcement, NCS, Abudulmumuni Bako, for further investigation and prosecution.\n“Investigation revealed that 10 of the 2,863 ATM cards were stolen, as the owners had confirmed losing their cards, which were found in his possession.\nIt was further revealed that the remaining ATM cards were handed over to him by some persons in Kano for onward delivery to their contacts in Dubai for monetary benefits."
  },
  {
    "headline": "Buhari, Tinubu, Sanwo-Olu, others eulogise Akande’s qualities",
    "summarized_story": "Nigeria’s President, Muhammadu Buhari; APC National leader, Asiwaju Bola Tinubu; Governor Babajide Sanwo-Olu and others on Thursday eulogised the qualities of former APC Interim Chairman, Chief Bisi Akande.\nSpeaking, Buhari said he was duty bound to be at the book presentation because Akande is a decent, truthful and friendly person.\nAkande is a unique personality who deserved to be celebrated, he worked very hard and determined to succeed in life.\nThrough home studies and correspondence he worked hard to become an accountant.\nIt showed Nigeria has a bright future, our nation can benefit from th life of Akande,” Onu stated."
  },
  {
    "headline": "Lagos leads as Nigeria's COVID-19 cases surge",
    "summarized_story": "NCDC stated on Thursday that Lagos State, the epicentre of the virus reported more 84.2 percent of the new infections.\nLagos State, it added reported a backlog of 225 cases for Dec. 7, 2021.\nRivers State in the South-South followed on the log with 17 cases; Enugu State, 10 cases and Edo, five cases.\nBauchi and Ogun States reported three cases each, while Oyo State recorded two cases.\nThe agency said that Bayelsa and Lagos states reported a backlog of five and two discharged cases respectively for Dec. 7, 2021."
  },
  {
    "headline": "BREAKING: Tanker Drivers Barricade Asaba-Benin Road Over Alleged Shooting Of Colleague By Police",
    "summarized_story": "Tanker drivers flocked to the Asaba-Benin Expressway in Delta state on Thursday to protest the alleged shooting of one of their colleagues by a police officer.\nAccording to SaharaReporters, the incident that sparked the Thursday protest occurred on Tuesday, when a police officer allegedly shot a tanker driver near the River Niger Bridge’s Asaba tollgate area.\nThe drivers were demonstrating against police intimidation and the suspected shooting of one of their colleagues by a police officer, according to an eyewitness.\nThen out of fear of being beaten and arrested, the tanker driver took to his heels and as he was running, one of the police officers in the convoy shot him in the leg,” the eyewitness said.\nThe gridlock caused by the tanker drivers started around 7:00 am on Thursday and lasted several hours, as commuters and motorists were seen stranded."
  },
  {
    "headline": "Nigeria’s COVID-19 Infections Surge As NCDC Registers 268 New Cases",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) reported 268 new COVID-19 infections in ten states on Wednesday.\nThe current illness count represents a 161 percent rise over the 107 infections announced on Tuesday.\nRivers State was next on the list, with 17 cases, Enugu State had ten, and Edo had five.\nEach of the states of Bauchi and Ogun reported three cases, while Oyo State reported two.\nAccording to the agency, the states of Bayelsa and Lagos have a backlog of five and two discharged cases, respectively, as of December 7, 2021."
  },
  {
    "headline": "BREAKING: Sanwo-Olu Cancels Peace Walk",
    "summarized_story": "Babajide Sanwo-Olu, the Lagos state governor, has canceled the proposed Peace Walk following the release of the state government’s white paper on the Judicial Panel of Inquiry’s report which probed the EndSARS incident at the Lekki Toll Gate.\nMr Sanwo-Olu in a press statement made available to NEWS DIRECT said the walk was canceled due to the increased cases of the Omicron variant of Coronavirus in Lagos state.\n“Given this development, I am constrained to stand down all preparations for the Walk for Peace.\nGiven this development, I am constrained to stand down all preparations for the Walk for Peace.\nGod bless Lagos State."
  },
  {
    "headline": "BREAKING: Buhari Arrives In Lagos [PHOTOS]",
    "summarized_story": "President Muhammadu Buhari has arrived in Lagos.\nThe President, who arrived at the presidential lounge of the Murtala Muhammed International Airport, Ikeja, was received by the Lagos State Governor, Mr. Babajide Sanwo-Olu.\nWhile in Lagos, Buhari is expected to commission some Naval boats and helicopters as well as attend the book launch of the former National Chairman of the All Progressives Congress (APC), Chief Bisi Akande.\nDetails shortly"
  },
  {
    "headline": "CJN talks tough: Enough of judges’ harassment, let no one test our will",
    "summarized_story": "Chief Justice of Nigeria (CJN) Tanko Muhammad has warned that the judiciary would no longer tolerate harassment and embarrassment of its officials from anyone or agency of government.\nCJN Muhammad sounded the warning Wednesday at the special session marking the official commencement of the Supreme Court’s 2021/2022 legal year.\nJustice Muhammad spoke against the backdrop of the invasion of a Justice of Supreme Court, Mary Odili’s Abuja residence during the legal year by some armed security operatives.\nAnd in his remarks, President Nigerian Bar Association (NBA) Olumide Akpata faulted the recruitment process of judges, just as he called for protection of judges from danger.\nAkpata, who recalled with sadness the raid on Justice Odili’s residence, urged that perpetrators of the act must be brought to justice."
  },
  {
    "headline": "2022 Budget: Buhari toughens tax law, no TIN, no bank account",
    "summarized_story": "On personal Income Tax, the Finance Bill 2021 by Buhari requires banks in the country to demand from their customers evidence of their Tax Identification Number (TIN) before opening bank accounts for individuals.\nOn Value Added Tax (VAT), Buhari introduces VAT exemption on group reorganisations on the conditions that the sale is to a Nigerian company and it is for the better organisation of the trade or business.\nThe proposed tax law however made provisions for various penalties for defaulters.\nThe proposed Finance Bill by Buhari also recommends penalty for operators whose responsibility it is to deduct the taxes.\nBuhari, however, removed all the conditions attached to tax exemption on gratuities making it unconditionally tax exempt."
  },
  {
    "headline": "Breaking: Barcelona submit to ‘heavy’ Bayern Munich defeat, crash out of UEFA Champions League",
    "summarized_story": "Barcelona to Bayern Munich to miss out on a Champions League last-16 place and drop down into the Europa League.\nBayern scored their first when Robert Lewandowski’s cross found Thomas Muller and his header just crossed the line.\nThe hosts doubled their lead thanks to a superb 30-yard strike from former Manchester City forward Leroy Sane.\nJamal Musiala added a third goal in the second half with a routine finish after a pull-back from Alphonso Davies on an embarrassing evening for Barcelona.\nDetails loading…"
  },
  {
    "headline": "Buhari Inaugurates Made-In-Nigeria Vessel, Reiterates Support For Navy",
    "summarized_story": "The vessel was inaugurated on Thursday and built by NNS Oji, is the third of its series to be built by the Nigerian Navy, according to a statement by a presidential aide, Femi Adesina.\n“Let me assure you that the Government will continue to support the ideals of the Nigerian Navy in the performance of its constitutional duties.\nGod bless the Nigerian Navy, God bless the Federal Republic of Nigeria.\n“Local partners should share in this commendation for their efforts at local facilitation as outlined in the Government’s local content policy,’’ he said.\nWhile acknowledging the efforts of the Nigerian Navy in securing Nigeria’s vast oil and gas industry, he said the Navy is a major contributor to the nation’s economic development."
  },
  {
    "headline": "Sanwo-Olu Halts Preparations For Peace Walk",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu, has announced that preparations towards Lagos peace walk planned for December 2021 be put on hold.\nThe governor disclosed this in a statement signed by him on Thursday, November 9, 2021.\nHe said he is “constrained to stand down all preparations for the Walk for Peace” so as not to “endanger the life of any Lagosian” amid the outbreak of the Omicron COVID-19 variant.\nREAD ALSO: Yuletide: Lagos Govt Issues Guidelines On Parties, OthersHe said the suspension of the Peace Walk was necessary due to “unseen enemy called COVID-19 which began to ravage the world and indeed our nation.” He added that as the Incident Commander in the quest to protect the lives of Lagos residents, “we subjected ourselves to the dictates of science.”The governor, in an address on November 30, 2021, had called on some popular entertainers in the state to join him on a peace walk.\nThe peace walk according to the governor would herald the healing of the land “in the face of the misinformation and misunderstanding following the recent leak of a report by the Judicial Panel of Enquiry on the #EndSARS debacle.”See the full statement released by the governor on Thursday below…"
  },
  {
    "headline": "Enough Of Harassment Of Judicial Officers, We Can No Longer Take It – CJN",
    "summarized_story": "﻿The Chief Justice of Nigeria (CJN), Tanko Muhammad, has warned individuals and agencies of the government against any form of harassment and embarrassment of judicial officers in the country.\n“I must make it known to all and sundry that we have had enough dosage of such embarrassments and harassments of our judicial officers across the country and we can no longer take any of such shenanigans.\nAccording to the CJN, the era of oppressing, suppressing, and intimidating judicial officers is long gone and such action will no longer be condoned.\nJustice Muhammad stated that the judiciary would begin to resist any clandestine attempt to silence or ridicule judicial officers to oblivion.\n“No law permits anyone to invade, subdue or overawe any Nigerian citizen in his or her residence with a flimsy, fraudulently obtained search warrant.”"
  },
  {
    "headline": "Gunmen Block Highway In Zamfara For Five Days, Kill Six Motorists",
    "summarized_story": "Gunmen in Zamfara went on a rampage recently as they blocked a major highway in the state for at least five straight days, locals told Channels Television on Wednesday.\nAlthough the police authorities in Zamfara confirmed the incidents, they stated that the Shinkafi–Moriki–Kaura-Namoda Road has since been cleared and is safe for use.\n“They have burnt down six vehicles, killed six motorists, kidnapped several others, and caused an accident involving a trailer carrying potatoes from Shinkafi market.\n“Now, we have put our heads together with other security chiefs and deployed enough security operatives along the road.\nHe added that the farmers were injured, but they were taken to the hospital by the security operatives deployed in the area."
  },
  {
    "headline": "UK’s Boris Johnson Welcomes Second Child With Wife Carrie",
    "summarized_story": "UK Prime Minister Boris Johnson on Thursday became a father again, after his wife, Carrie, gave birth to a girl, Downing Street said.\nHe is also under pressure from the public after claims that Downing Street staff held a Christmas party last year in defiance of restrictions on social gatherings.\nThrice-married Johnson, 57, has four children from his second marriage to the lawyer Marina Wheeler, and now two with Carrie, 33, a former Conservative Party media adviser whom he wed in May.\nThe couple’s first child, Wilfred, was born in April last year, not long after Johnson was treated in hospital intensive care for Covid.\nThe prime minister has another child, a daughter, from an extra-marital affair."
  },
  {
    "headline": "Osoba returns, hosts Ogun exco members, scores Abiodun high on roads, others -",
    "summarized_story": "Former Governor of Ogun state, Olusegun Osoba, on Wednesday, hosted members of the Ogun State Executive Council, with a charge to Governor Dapo Abiodun to focus more on projects and programmes that would be of great benefit to the people of the state.\nI know he is doing very well on road construction and other sectors; more attention should also be given to security.\nOgun is the fastest growing state in Nigeria because the governor is taking the advantage of our closeness to Lagos”, Osoba added.\nHe, however, urged Governor Abiodun to remain resolute in executing sustainable projects across the state.\nMy prayer is that you will leave Ogun state better than you met it”."
  },
  {
    "headline": "Resign now if you have political ambition, Gov Abiodun tells appointees -",
    "summarized_story": "Ogun State Governor, Prince Dapo Abiodun, has directed all serving political appointees with 2023 political ambitions in the State to resign on or before Jan 31 2022 to pursue their dreams.\nA statement issued in Abeokuta on Tuesday by his Chief Press Secretary, Mr. Kunle Somorin, said the directive had become expedient to avoid observed distractions and loss of focus in the discharge of their responsibilities.\nWhilst noting that it is legitimate to have such ambitions, the Governor, however, said: “As an Administration unwaveringly committed to delivering on its electoral promises, any activity that is capable of undermining the implementation of the Building Our Future Together Agenda of the Administration will not be tolerated”.\nGovernor Abiodun counselled that those who cannot wait till the appropriate time for 2023 electioneering process should take their leave to pursue their ambitions without constituting a clog in the wheel of the implementation of government programmes and activities, the statement concluded."
  },
  {
    "headline": "Nigeria needs thorough review of 1999 Constitution",
    "summarized_story": "Nigeria Needs Thorough Review of Constitution - Group"
  },
  {
    "headline": "I don't see anything wrong In Sanwo-Olu's Peace Walk initiative",
    "summarized_story": "In this interview, Babajide Kolade-Otitoju shares his views on the peace walk suggested by the Lagos State Governor, Babajide Sanwo-Olu.\nThe veteran journalist added that the move by the state governor is a good one, that is geared towards healing the wounds created by the unfortunate incident of October 20, 2020."
  },
  {
    "headline": "Justice for Sylvester: Dowen College Parents Hold Candlelight Vigil",
    "summarized_story": "Parents of pupils of Dowen College in Lekki Lagos have held a candlelight procession for the late Sylvester Oromoni who died last Tuesday.\nSome of the parents called on the authorities to ensure that little Sylvester does not die in vain by ensuring that justice is done.\nARISE correspondent Tokunbo Oyetunji, has the details…"
  },
  {
    "headline": "Saudi Arabia Bans Flights From Nigeria Over Omicron",
    "summarized_story": "The Saudi Arabia Government has suspended Nigerians from entering into the kingdom in its bid to prevent further spread of Omicron variant of coronavirus after six reported cases in Nigeria.\nA source from the kingdom noted that the Saudi government suspension of flights from Nigeria into the country was in order to check the spread of omicron in the holy land.\nHe said that though circular has been issued to flight operators on the suspension, all the flights currently enroute to Saudi from Nigeria would be allowed into the kingdom till official announcement.\nCircular has been issued to travel operators and other stakeholders to suspend airlifting of passengers from Nigeria.\nAccording to him, a circular has been issued that all Lesser Hajj flights should be canceled and there will be no more flights from Nigeria until further notice."
  },
  {
    "headline": "Ethiopia War: UN Halts Food Aid in Two Towns after Warehouses Looted",
    "summarized_story": "The World Food Programme (WFP) has suspended distribution of food aid in two northern Ethiopian towns after gunmen looted its warehouses.\nLooters from rebel Tigrayan forces held aid staff at gunpoint in the town of Kombolcha, the United Nations said.\nNorthern Ethiopia is facing mass starvation amid an ongoing civil war between Tigrayan and government forces.\nThe Tigrayan rebels have not commented on the allegations that their fighters stole food aid.\nThe Ethiopian government had recently announced that it had recaptured the towns from the Tigray rebels."
  },
  {
    "headline": "Spanish Media: Barcelona’s Champions League Exit, ‘A resignation from Football Elite’",
    "summarized_story": "One Spanish newspaper called it Barcelona’s “resignation from the football elite” as their dramatic decline culminated in a generational event – being knocked out of the Champions League before Christmas.\nWe got ourselves into this mess and it hurts a lot.”The last time they were not in the Champions League knockout stages was 2003-04, which was also their last season in the Uefa Cup/Europa League.\nThe last time they failed to qualify from a Champions League group was 2000, when Leeds finished above them.\nThat is a game against a Europa League group runner-up for the right to play the group winners in the last 16.\nPerhaps most damning, former Real Madrid midfielder Steve McManaman suggested on BT Sport demotion to the Europa League might be a good thing as winning it would mean they qualify for the Champions League next season."
  },
  {
    "headline": "Nigeria Warns Civil Servants to Prepare for Delay in December Salary",
    "summarized_story": "Nigeria’s federal government has advised civil servants to exercise caution in spending their November salary because of the possible delay in the payment of their remuneration for December.\nThe Head of Civil Service of the Federation, Dr Folasade Yemi-Esan issued the advisory on Wednesday in a circular.\nShe said workers should make provisions for Christmas celebration from their November salary because of recurrent trends of shortfall in budgetary allocation and its attendant effect on payment of salary in recent times across various MDAs.\nA memo issued by the Federal Medical Center, Keffi, Nasarawa State, warned staff of an impending delay in the payment of December salaries.\nTherefore, the situation has resulted to unease among federal staff and personnel of security agencies 14 days to Christmas."
  }
]