[
  {
    "headline": "APC screens Al-Makura, Yari, Adamu, others today, aspirants dump consensus",
    "summarized_story": "The All Progressives Congress will today screen aspirants vying for the position of its national chairman and others at its national headquarters in Abuja.\nThe aspirants visited the party headquarters on Friday to submit their nomination forms.\nOther national chairmanship aspirants who returned their nomination forms include a former governor of Nasarawa State, Tanko Al-Makura, former governor of Benue State, George Akume, another former governor of Nasarawa State, Abdullahi Adamu, Saliu Mustapha and Mohammed Etsu.\nOthers who have purchased forms include former Governor Abdullahi Adamu of Nasarawa State and a former Governor of Zamfara State, Abdul’Aziz Yari.\nHe noted that “I am coming as Deputy National chairman to balance the religious agenda because all over Nigeria, people see the APC as a Muslim party."
  },
  {
    "headline": "Police arrest property owner, others over attack on Lagos officials",
    "summarized_story": "No fewer than four persons, including a property owner, have been arrested by the Nigeria Police for allegedly attacking officials of the Lagos State Government in the Ajao Estate area of the state.\nIt was learnt that officials from the Lagos State Physical Planning Permit Authority and the Lagos State Building Control Agency were on an enforcement operation for the removal of illegal constructions and shanties in the area when they were attacked.\nThey were said to have gone to remove an illegal construction at 1, Robinson Gbagi Street, Ajao Estate when the hoodlums swooped on them with various weapons.\nOsinaike, in a statement titled, ‘LASG condemns attack on officials,’ on Friday, added that the thugs stormed the area, started shooting at officials, and caused mayhem.\nHe, however, warned that the state government would take decisive actions against individuals and groups who attack its officials on lawful duties."
  },
  {
    "headline": "YABATECH approves cut-off marks for 2021/2022 admission",
    "summarized_story": "The Yaba College of Technology (YABATECH) has approved the cut-off marks for the 2021/2022 Post-Unified Tertiary Matriculation Examination (Post-UTME) for its National Diploma programme.\nEjiofor said that the admission cut-off marks were released by the Admission Committee after its meeting on Thursday.\nAccording to him, the cut-off marks have been uploaded to the college portal.\nEjiofor explained that the cut-off marks superseded the different cut-off marks which had been circulating online purported to be those of the college.\nHe also listed some of the departments and their cut-off marks as; Electrical Electronics Engineering, 60.67, Public Administration 60.65 and Accountancy 60.62, among others."
  },
  {
    "headline": "NiMet warns of temperature rise in Northern states",
    "summarized_story": "By Dirisu YakubuABUJA- The Nigerian Meteorological Agency, NiMet has predicted a a slight rise in temperature in the days ahead , particularly in the Northern part of the country.\nThis warning is contained in a weather alert issued issued on Friday and signed by Muntari Ibrahim, General Manager, Public Relations of the agency.\nAccording to the statement, parts of Sokoto, Zamfara, Kebbi, Borno, Adamawa, Taraba, Plateau, Niger, Nasarawa, Benue, and Kwara are expected to experience temperatures higher than 40°C.\nOther parts of the Northern, Central, and Southern states will mostly experience temperatures within 35°C to 40°C.\nNiMet further disclosed that the temperature is expected to continue for a while with parts of Sokoto, Kebbi, Jigawa, Yobe, Borno, Gombe, Taraba, Plateau, Nasarawa, Adamawa, Borno, Niger, Kwara, FCT, Kogi, Benue, Cross River, and Ebonyi states are expected to experience temperatures higher than 40°C."
  },
  {
    "headline": "2023: You deserve the best, Gowon tells Nigerians",
    "summarized_story": "Yakubu GowonWhy we visited ex-Head of State -Osinbajo groupBy Omeiza Ajayi, AbujaFormer Head of State, General Yakubu Gowon has counselled Nigerians to be prayerful ahead of the next general election, saying the country deserves the best in terms of leadership.\nThe PCG is one of the support groups in the ruling All Progressives Congress APC which has elected to work to actualize a Prof. Yemi Osinbajo presidency in 2023.\n“Sustain hope, believe in Nigeria and believe in the cause of unity and peace,” General Gowon said.\nSpeaking on their visit to General Gowon’s residence, Alhaji Zagi emphasized that their consultation visit was a matter of courtesy, adding that as an elder statesman, General Gowon embraces everyone without any involvement in partisan politics.\n“General Gowon took us down memory Lane to scenario’s of 13th January 1966 and he believes that the scenario of ascension to high position without desperation or unnecessary intrigues is something that all must consider."
  },
  {
    "headline": "Obiano’s wife was clearly drunk, I was stunned by stench of whisky in her breath, Bianca tells her story",
    "summarized_story": "Narrating the story in a statement on Friday, the former beauty queen, Bianca stated that she was stunned by the stench of whisky in Ebele’s breath which showed that she was “clearly intoxicated”, drunk when she verbally attacked her.\nBianca said “She arrived some one-and-a-half hours later while the ceremony was on.\n“She held on to her wig with her two hands and tried to take the wig away from me.\nFurthermore, Bianca said what struck her through the whole episode was the fact that Obiano’s wife was clearly intoxicated and she was stunned by the stench of whisky in her breath at such an early hour of the day.\nIt is unfortunate that she threw all caution to the wind and imported this kind of melodrama to a state ceremony."
  },
  {
    "headline": "Russian invasion of Ukraine horrifying, say Heads of Int’l Finance Institutions",
    "summarized_story": "“We are horrified and deeply concerned about the Russian invasion of Ukraine and the ensuing crisis.\n“In addition to the devastating human catastrophe unfolding in Ukraine, the war is disrupting livelihoods throughout the region and beyond.\nCountries, particularly those neighboring Ukraine will suffer disruptions in trade, supply chains and remittances as well as surges in refugee flows.\n“Our institutions have responded with emergency support to Ukraine and its neighbors.\nThe Fund stands ready to support neighboring and other countries affected by the spillovers of the war through all its relevant instruments."
  },
  {
    "headline": "Soludo’s inauguration slap: Bianca did what Ojukwu taught her in 1995 – Reno Omokri",
    "summarized_story": "Bianca, wife of late Dim Chukwuemeka Odimegwu Ojukwu, may have taken a slapping lesson from her late husband, if Reno Omokri’s suggestion is anything to take home.\nWillie Obiano, Ebelechukwu and Mrs Bianca Ojukwu engaged in a physical combat during the event.\nThe action drew the attention of security agents and some personalities who pulled Mrs Obiano off the hold of Bianca who was visibly shocked at the action.\nReacting to the drama, Reno Omokri recalled that Ojukwu had once slapped Umaru Dikko, during Sani Abacha Constitutional Conference in 1995.\n“He was speaking during the Abacha Constitutional Conference when Umaru Dikko insulted him."
  },
  {
    "headline": "Post-UTME: YABATECH announces cut-off marks",
    "summarized_story": "Yaba College of Technology (YABATECH) has approved cut-off marks for the 2021/2022 Post-Unified Tertiary Matriculation Examination (Post-UTME) for its National Diploma (ND) programme.\nThe official said that the marks were released by the Admission Committee after its meeting on Thursday.\nAbout 9,000 candidates took part in the Post-UTME held online in February, Ejiofor disclosed.\nEjiofor noted that the cut-off marks were authentic as against those circulating on the internet.\nScience Laboratory Technology has the highest cut-off mark – 62.62, followed by Computer Science – 60.87."
  },
  {
    "headline": "ASUU thanks Gov. Ugwuanyi for rekindling their hope of land ownership in Enugu",
    "summarized_story": "The union stressing that “no governor has done what he (Ugwuanyi) has done for us today”.\nAccording to him, “At a point our hope of getting land was almost being dashed.\nBut coming to him has given us hope today.\n“Today marks a great day in the history of ASUU UNN.\nWe will remember today because today, our hope of having land in Enugu has been actualized."
  },
  {
    "headline": "Buhari returns to Nigeria after medical trip to London",
    "summarized_story": "President Muhammadu Buhari has returned to Abuja on Friday, following a medical check-up in London, UK.\nBuhari left the country on March 6.\nHe had earlier planned to embark on the medical trip from Nairobi, Kenya after attending the United Nations Environmental Programme at 50, but returned to Nigeria on March 4.\nWhile in London, the president met with Mai Mala Buni, the Interim National Chairman of the All Progressives Congress Caretaker Extraordinary Convention Committee.\nThe presidential aircraft carrying Buhari touched down at the Presidential Wing of the Nnamdi Azikiwe International Airport, Abuja, at about 7.09pm."
  },
  {
    "headline": "War: US says Russia has made number of missteps as Ukraine shoots down 3 cruise missiles",
    "summarized_story": "United States Defense Secretary, Lloyd Austin, on Friday, said that America has already “seen a number of missteps” by Russia in its invasion of Ukraine.\nAccording to Austin, Putin’s government thought they would move rapidly and very quickly seize the capital city, they’ve not been able to do that.\nMeanwhile, at least three cruise missiles were shot down by air defenses in the central Ukrainian city of Vinnytsia on Friday morning.\nThe head of Vinnytsia war and civil administration reported that the region, which has faced increasing rocket fire from Russian forces, made some resistance on Friday.\nThe city’s TV tower and airport have both been hit by airstrikes in the past two weeks, according to Ukrainian authorities."
  },
  {
    "headline": "Two dead, many missing as boat sinks goods",
    "summarized_story": "Two persons have been confirmed dead and several missing when a Cameroon-bound commercial boat with 25 passengers sank in the high sea between Nigeria and Cameroon.\nThe boat, which reportedly left its base off Marina road in Calabar by the shorelines on Tuesday, ran into high tidal waves on the high sea near the Cameroon waterways and sank with goods worth millions.\nA businessman, whose goods were in the boat, also confirmed the incident.\nREAD ALSO: Police confirm missing BRT passenger deadHe said about 25 persons, including passengers, the boat crew and others were in the boat when they left Calabar.\n“The person didn’t tell me what was the actual issue until Wednesday morning that I got the information that the boat sank and all the goods and passengers could not be found,” he stated."
  },
  {
    "headline": "Court vacates order barring APC National convention",
    "summarized_story": "A High Court of the Federal Capital Territory (FCT) sitting in Kubwa, Abuja, on Friday, vacated the order of interim injunction that stopped the All Progressive Congress (APC) from holding its National Convention planned for March 26, 2022.\nThe interim order had followed a suit by an aggrieved member of the party, Salisu Umoru.\nThe judge, Justice Bello Kawu, vacated the injunction following an application by APC.\nThe court held that the order of injunction issued against the APC on November 18, 2021, has been overtaken by a recent judgment the Supreme Court delivered on a similar matter.\nREAD ALSO: Long walk to APC national conventionJustice Kawu however adjourned the plaintiff’s substantive suit till March 30 for hearing."
  },
  {
    "headline": "Why I slapped Obiano’s wife, by Bianca Ojukwu",
    "summarized_story": "Wife of late Chukwuemeka Odumegwu Ojukwu, Bianca, has explained why she slapped immediate past Anambra First Lady, Ebele Obiano on Thursday afternoon in Awka, the Anambra State capital.\nThe two women had engaged in a public fight at the inauguration ceremony of Governor Charles Soludo, an incident that momentarily disrupted the swearing-in ceremony.\nSetting the records straight on Friday, Mrs. Ojukwu said she slapped Ebele Obiano to defend herself after the wife of the former Governor attempted to remove her headgear in public.\nShe held on to her wig with her two hands and tried to take the wig away from me.\n“It is unfortunate that she threw all caution to the wind and imported this kind of melodrama to a state ceremony."
  },
  {
    "headline": "BREAKING: EFCC relocates Obiano to Abuja",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has relocated ex- Anambra Governor Willy Obiano from Lagos to Abuja for grilling.\nBut the details of the allegations against him have not been released by the anti-graft commission.\nIt was learnt that Obiano was moved to Abuja because the desk handling his case in the last two years is at the EFCC’s headquarters.\nThe Head of Media and Publicity of EFCC, Mr. Wilson Uwujaren, said: “Yes, the ex-governor is now with our team in Abuja.\n” It is too early to talk about ongoing investigation.”Details Shortly…"
  },
  {
    "headline": "Haaland keeps clubs guessing over summer move",
    "summarized_story": "Norwegian superstar Erling Haaland is keeping his options open for a summer move, according to Jose Felix Diaz of Marca.\nReal Madrid are the side that have been most heavily linked with Haaland, along with Manchester City.\nThey also noted that whatever decision Haaland takes, his agent Mino Raiola likes to ensure his clients have an escape clause.\nThe saga of the summer started several months early and there might not be an end in sight.\nRaiola and Haaland have no set date by which they wish to make a decision."
  },
  {
    "headline": "Insecurity: DHQ solicits The Sun’s support to win insurgency, other wars",
    "summarized_story": "From Molly Kilete, AbujaThe Defence Headquarters (DHQ) has solicited the support of The Sun Publishing Limited in the military’s counter insurgency operations and determination to keep the country safe.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe Director, Defence Information (DDI), Major General Jimmy Akpor, made the appeal when he paid a courtesy visit on the Abuja office of The Sun.\nHe commended The Sun for the positive publications of military activities and urged the newspaper to keep the good work.\nWhile commending officers and men of the Armed forces, who she said have continued in their determination to keep the country safe, she described the armed forces as the backbone of Nigeria’s sovereignty, while urging them to keep doing the good work of protecting the nation."
  },
  {
    "headline": "Breaking: Court vacates order against APC Convention",
    "summarized_story": "Justice Bello Kawu, had issued the restraining order at the behest of a suit that was filed by an aggrieved member of the party, Salisu Umoru.\nDissatisfied with the interim order, the APC approached the court with an application to set it aside.\nWhile granting APC’s application on Friday, Justice Bello Kawu, held that Plaintiff lacked the locus to sustain the restraining order.\nJustice Kawu however adjourned Plaintiff’s substantive suit till March 30 for hearing.\nJustice Kawu had after listening to him, granted an interim injunction restraining the APC from proceeding with the convention billed for March 26."
  },
  {
    "headline": "Buni to harmonise zoning arrangements with govs",
    "summarized_story": "On March 7, Governor Bello took over as acting national chairman in the absence of Buni who was out of the country for medical treatment.\n“It would be recalled that I had duly transmitted power to Governor Bello to enable me undergo medical attention.\nTherefore, all actions and measures taken by the committee under the leadership of the Acting Chairman, remain effective.\nOn the purpose for the meeting, Governor Buni, said: “You know that since I travelled the party has not stopped.\nHis Excellency, Governor Bello, has done very well in managing the affairs of the party in my absence."
  },
  {
    "headline": "Soludo takes oath, tells IPOB: We can’t turn against ourselves",
    "summarized_story": "From Obinna Odogwu, AwkaThe new governor of Anambra State, Prof. Chukwuma Soludo, has lamented the economic losses incurred by the South East states each day sit-at-home is observed in the geopolitical zone.\n“Every day, there is a “sit at home”, these poor masses lose an estimated N19.6 billion in Anambra alone.\n“I know the limitations imposed upon a sub-national state such as Anambra by the peculiar structure of our federation.\nIn his first appointment shortly after his inauguration, Governor Soludo retained Prof. Solo Chukwulobelu as Secretary to the State Government (SSG), Solo Chukwulobelu.\nHe said he would send the list of commissioner-nominees to the state House of Assembly next week for confirmation."
  },
  {
    "headline": "Russia/Ukraine war: FG plans new trade policy with former USSR nations",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government has said following the war between Russia and Ukraine, it is working on a new trade policy with countries in the former Union of Soviet Socialist Republics (USSR) with whom it shares important mutual trade relations.\nMinister of Industry, Trade and Investments, Niyi Adebayo, disclosed this, yesterday, at the weekly inter-ministerial press briefing organised by the Presidential Communications Team at the Presidential Villa, Abuja.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nHe said the trade department of his ministry had been mandated to analyse the crisis in the region as its concerns trade relations with Nigeria and come up with a report.\nAdebayo, also spoke on ports decongestion in Nigeria, saying new ports would soon come on board to ease the pressure on Apapa and Tincan ports in Lagos."
  },
  {
    "headline": "Electoral Act: Senate not Aware of Court Judgment on Section 84 (12), Says Spokesperson",
    "summarized_story": "Sunday Aborisade in AbujaThe Senate said on Friday that it was not aware of any court judgment which struck out the controversial Section 84 (12) from the newly amended Electoral Act 2022.\nThe Federal High Court sitting in Umuahia, the Abia State capital, had earlier on Friday, ordered that Section 84 (12) should be deleted from the newly amended Electoral Act 2022.\nPresident Muhammadu Buhari had penultimate week, written to the National Assembly, urging it to delete the controversial section by a way of amendment.\n“I cannot react to newspaper reports of court judgment without seeing the actual court judgment.”President Buhari had, while signing the amended Electoral Act, urged the National Assembly to delete the provision.\nThe president thereafter wrote a letter to both chambers of the National Assembly seeking an amendment by way of deleting the provision."
  },
  {
    "headline": "Court Orders AGF to Delete Section 84(12) of Amended Electoral Act",
    "summarized_story": "Emmanuel Ugwu-Nwogo in UmuahiaA Federal High Court in Umuahia Friday nullified the controversial Section 84(12) of the Amended Electoral Act and ordered the Attorney General of the Federation (AGF) “to delete it forthwith”, saying that it is unconstitutional, illegal, null and void.\nThe controversial section had pitted the National Assembly against President Muhammadu Buhari, who had extracted a promise from the federal lawmakers to remove the vexacious section before he signed the amended Electoral Act.\nFHC/UM/CS/26/2022, which had received accelerated hearing, Justice Evelyn Anyadike held that Section 84(12) of the Electoral Act, as amended, is inconsistent with Sections 66, 107, 137 and 182 of the 1999 Constituion of the Federal Republic of Nigeria as amended.\nPresident Buhari had, while signing the amended Electoral Act, urged the National Assembly to go back and delete the controversial provision as it violated the constitution and breached the rights of government appointees.\nThough he followed it up with a letter to both Chambers of the National Assembly seeking amendment by way of deleting the provision, the National Assembly members stuck to their gun and refused to do the bidding of the president."
  },
  {
    "headline": "Inauguration Fight: My Story, By Bianca Ojukwu",
    "summarized_story": "The two women had engaged in a fight at the venue of Soludo’s inauguration as governor in Awka on Thursday when Mrs Obiano walked up to Mrs Ojukwu where she was seated.\nMrs Ojukwu, wife of the late Igbo leader, Chief Emeka Odimegwu-Ojukwu, was later seen in a trending video slapping her before they were separated by guests at the venue.\nHow could a first lady be so drunk and proceeded to turn up in that state at an Inauguration ceremony that began at 9am?\n“It is on record that I took Obiano and his wife, Ebere to Bianca Ojukwu where they knelt down while seeking the party’s governorship ticket.\nHer conduct shows that she lacks proper training and it shows that she has no respect for constituted authority and even her husband, Former Governor Obiano."
  },
  {
    "headline": "Buni Overrules Akpanudoedehe, Says All Bello’s Decisions Stand",
    "summarized_story": "Despite boasting that he remained the secretary of CECPC, Senator John Akpanudoedehe was yesterday absent at a meeting convened by Buni with Bello’s team.\nThe meeting, held at the lodge of the Yobe State governor in Abuja, was his first since his return to the country.\nAhmed, who has been briefing the media since the leadership crisis started, urged party members and the media to ignore the falsehood being spread by Akpanudoedehe.\nSpeaking to journalists at his lodge, Buni applauded CECPC members on the level of preparations towards the national convention.\n“We are now at the finishing line in the preparations for our national convention, which is at hand, on March 26."
  },
  {
    "headline": "Soludo Talks Tough at Inauguration, Says Every Criminality Must End",
    "summarized_story": "Soludo was sworn in by the Chief Judge of the state, Justice Onochie Anyachebelu at the Government House, Awka, in a low key ceremony.\nOn why his inauguration was a low key event, Soludo said, “Today is my first day at work.\nEarlier, THISDAY witnessed the arrival of Mrs Obiano as she was stopped at the gate, when her convoy attempted to use the main gate.\nMrs Obiano and her husband however left the ceremony immediately after Soludo was sworn in.\nSoludo hereby apologises to all Anambra people, friends and guests, who attended his inauguration this morning as the Anambra State governor for the breach of protocol."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos Airport",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested former Anambra State Governor Willie Obiano.\nObiano was arrested at the Murtala Muhammed International Airport, Lagos.\nHe was said to be on his way to Houston, Texas in the United States.\nThe EFCC had last November placed Obiano on a watch-list.\nThe anti-graft agency had requested the Nigeria Immigration Service to inform it anytime the former governor was travelling out of the country from any of the international airports, as well as other points of entry and exit."
  },
  {
    "headline": "BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos Airport",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested former Anambra State Governor Willie Obiano.\nObiano was arrested at the Murtala Muhammed International Airport, Lagos.\nHe was said to be on his way to Houston, Texas in the United States.\nThe EFCC had last November placed Obiano on a watch-list.\nThe anti-graft agency had requested the Nigeria Immigration Service to inform it anytime the former governor was travelling out of the country from any of the international airports, as well as other points of entry and exit."
  },
  {
    "headline": "Sleep-Walking Into Universal Disaster By Owei Lakemfa.",
    "summarized_story": "I often hear an exclamation like: ‘The Devil is a liar’; but in reality, the Devil is a realist; the best way to avoid a nuclear disaster is to rid the world of nuclear weapons.\nBut nuclear weapons increased to 3,000 in 1955 and to over 37,000 by 1965 (US, 31,000 and the Soviet Union 6,000).\nAt this point, there were demands that nuclear weapons should first be drastically reduced, then eliminated.\nYet, humanity and nuclear weapons cannot co-exist; one will have to give way to the other.\nThe way out is decommissioning all nuclear weapons; but will the powerful agree to give up their lethal weapons?"
  },
  {
    "headline": "PHOTOS: Buhari returns to Abuja after 12-day trip to London for medical checkup",
    "summarized_story": "President Muhammadu Buhari has returned to Nigeria after spending close to two weeks in London, United Kingdom, for a medical checkup.\nThe president arrived the Nnamdi Azikiwe International Aiport, Abuja on Friday night.\nBuhari had departed Nigeria for London on March 6 for “routine medical checks” according to Femi Adesina, presidential spokesman.\nIbrahim Gambari, chief of staff; Muhammed Bello, FCT minister; Sulieman Adamu, minister of water resources; Hassan Sanusi, DIG of police and Yusuf Bichi, director-general of the Department of State Services (DSS), were among those who welcomed the president at the airport.\nAdvertisementBelow are photos."
  },
  {
    "headline": "PHOTOS: Buhari returns to Abuja after 12-day trip to London for medical checkup",
    "summarized_story": "President Muhammadu Buhari has returned to Nigeria after spending close to two weeks in London, United Kingdom, for a medical checkup.\nThe president arrived the Nnamdi Azikiwe International Aiport, Abuja on Friday night.\nBuhari had departed Nigeria for London on March 6 for “routine medical checks” according to Femi Adesina, presidential spokesman.\nIbrahim Gambari, chief of staff; Muhammed Bello, FCT minister; Sulieman Adamu, minister of water resources; Hassan Sanusi, DIG of police and Yusuf Bichi, director-general of the Department of State Services (DSS), were among those who welcomed the president at the airport.\nAdvertisementBelow are photos."
  },
  {
    "headline": "Reps not served notice as party to court case on electoral act, says spokesman",
    "summarized_story": "The house of representatives says it was not served a notice as being a party to a court case on the Electoral Act 2022.\nOn Friday, a federal high court in Umuahia, Abia state, ordered the attorney-general of the federation to delete section 84(12) of the amended electoral act.\nAdvertisement“But we have read from the social media and traditional media platforms that the judgment borders on section 84(12) of the electoral act.\n“We are talking about political appointees and section 318 defines what a public servant is.\nSo, the ability to differentiate between these two will help us understand what the electoral act is trying to do as against what is being roped in as what it is trying to do."
  },
  {
    "headline": "Reps not served notice as party to court case on electoral act, says spokesman",
    "summarized_story": "The house of representatives says it was not served a notice as being a party to a court case on the Electoral Act 2022.\nOn Friday, a federal high court in Umuahia, Abia state, ordered the attorney-general of the federation to delete section 84(12) of the amended electoral act.\nAdvertisement“But we have read from the social media and traditional media platforms that the judgment borders on section 84(12) of the electoral act.\n“We are talking about political appointees and section 318 defines what a public servant is.\nSo, the ability to differentiate between these two will help us understand what the electoral act is trying to do as against what is being roped in as what it is trying to do."
  },
  {
    "headline": "FG will effect court ruling deleting section 84 of electoral act, says Malami",
    "summarized_story": "Abubakar Malami, attorney-general of the federation (AGF), says the federal government will effect a judgment which ordered the removal of section 84 (12) of the amended Electoral Act, 2022.\nPresident Muhammadu Buhari had assented to the electoral act amendment bill on February 25.\n“The judgment of the court will be recognised by the government printers in printing the Electoral Act,” the statement reads.\n“The Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "Digital Nomads: The Nigerians escaping Ukraine’s war",
    "summarized_story": "Students, all of whom are given temporary residence permits, can work unofficially or do small businesses by registering as private entrepreneurs.\n“I finished last year, and I was going to leave Ukraine this year.\nYou can’t get out that easily.”A day after Russia’s invasion, Ukraine’s president Volodymyr Zelenskyy instituted martial law and grounded commercial flights.\n“I was already applying for visas to leave Ukraine for the UK where my brother is.”Kemi’s journey is not so certain.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Big Cabal Media’s seed funding",
    "summarized_story": "This means that sharing your Netflix password with someone else may soon become expensive, as account sharing will incur an additional fee.\nToday, I’ll be discussing:Dream VC’s pipeline planBig Cabal Media’s seed fundingDream VC’s pipeline planNowadays, it appears that many people want to work in technology companies.\nHowever, only a small percentage are familiar with the Venture Capital (VC) industry.\nInterestingly, venture capital funding only became common in the last decade, leaving a considerable talent gap, which Dream VC was founded to fill.\nBig Cabal Media’s seed fundingIf you are on Twitter, you might likely have read content from Zikoko, TechCabal, or both."
  },
  {
    "headline": "Inside Dream VC’s plan to build a pipeline for African VC talent",
    "summarized_story": "However, very few understand or are even aware of the venture capital space, but Mark Kleyner and Cindy Ai want to demystify the space with Dream VC.\nInterestingly, VC funding only became common in the past decade, and so there is a gaping talent hole, which Dream VC was launched to fill.\nThe goal was to help them break into the VC space,” he added.\nHaving tested their hypothesis, Dream VC would be launching two programmes: the Launch into VC Program and the Investor Accelerator Program.\nLaunch into VC is a fully remote 13-week programme targeted at early-stage professionals looking to break into the VC space."
  },
  {
    "headline": "African B2B eCommerce on growth streak",
    "summarized_story": "The eCommerce startup also got a makeover, changing its name from Sokowatch to Wasoko, meaning people of the market.\nThe B2B model: Like TradeDepot, Alerzo and other eCommerce startups that have raised funds from 2021, B2B is the dominant model.\nAs B2B continues to be the go-to model for eCommerce in Africa, only time will tell how sustainable it is.\n4G Capital’s $18m fundingKenyan fintech startup, 4G Capital, has raised $18 million in a Series C round led by Lightrock.\nA touch of eCommerce: 4G Capital plans to roll out new products, including an app, later this year."
  },
  {
    "headline": "Nigeria records worst ranking in World Happiness index",
    "summarized_story": "Africa’s biggest economy has recorded the worst performance in the 2022 World Happiness Report, ranking 118 out of 146 countries.\nThe report which was released today, two days before the annual International Day of Happiness is issued annually by the UN’s Sustainable Development Solutions Network.\nThe report ranks nations based on factors such as personal sense of well-being, levels of GDP, life expectancy among others.\nThe report also highlighted that Finland retained its position as the world’s happiest place, while Mauritius, standing at 52 positions, is the happiest country in Africa.\nLibya is now the second happiest country in Africa, followed by Ivory Coast, South Africa, Gambia, and Algeria."
  },
  {
    "headline": "Every Nigerian owes N191,889 of national debt",
    "summarized_story": "It is the most each Nigerian would owe as a function of debt per capita (or debt per person) in 10 years.\nData released yesterday by the Debt Management Office (DMO), has shown that Nigeria’s total debt as at December 31, 2021, was N39.55 trillion.\nWhen non-Nigerians who are part of the population estimate are removed, the debt owed by every Nigerian would increase, at least theoretically.\nWhen 2019 began, the debt had increased to N24.3 trillion, and each Nigerian owed N124,503.\nThis implies that at the start of last year, each Nigerian owed N159,675 based on a population of 206 million people."
  },
  {
    "headline": "Blackout reigns in Nigeria as reforms suffer setback",
    "summarized_story": "Total power generation in the country stood at 3,051MW as of 6am on Thursday, according to data from the Nigeria Electricity System Operator.\nBetween 2015 and 2018, Barack Obama’s Power Africa Initiative said it injected about $1 billion to revive Nigeria’s power sector.\nA lot of the current investment will take time before we noticed any improvement in the national grid,” Oni said.\nConsequences of national grid collapseAccording to the Nigerian Electricity Regulatory Commission (NERC), the grid collapse is divided into two basically; which include the total grid collapse and the partial grid collapse.\nThe total system collapse according to NERC means a total blackout nationwide while the partial system collapse is a failure of the section of the grid."
  },
  {
    "headline": "Edo offers property developers 2-week window for issuance of free building plans …begins farming season March 25 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, as part of efforts at ensuring all property in the state are with building plans, is offering property developers a 2-week window for issuance of free building plan permits.\nShe noted, “The ‘Operation show you building plan’ seeks to encourage all land developers and those building to come for their building plan in the ministry.\nThe objective of the exercise is to capture all into the Edo State Master Plan as it’s necessary for development.\nThis year’s farming season should be taken seriously as there will be an interface between farmers and off-takers.\n“The disease is a pandemic that is still ravaging some communities across local government areas in Edo State."
  },
  {
    "headline": "AAU VC Lauds Outgoing Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE acting Vice Chancellor of the Ambrose Alli University, (AAU), Ekpoma, Edo State, Prof. Sonnie Adagbonyin has showered encomiums on the outgoing acting Registrar of AAU, Mr. Edward Aihevba for his outstanding achievements in office.\nHe gave the commendation while speaking at the Second Registry Lecture of the institution, titled: Administrative Imperatives for Universities: A case Study of Ambrose Alli University; delivered by the outgoing acting Registrar, Mr. Edward Aihevba.\nThe acting vice chancellor asserted that the outgoing Registrar in his short time in office recorded numerous achievements which were of benefit to the staff, students and the university in general.\nPraised the registry department and outgoing Registrar for the registry lecture initiative, and called on other departments of the university to emulate the registry department by organising similar lectures for staff members.\nHe explained that the registry lecture was introduced in his time as acting Registrar because of his desire to broaden and sharpen the administrative skills of staff of the registry for optimum performance."
  },
  {
    "headline": "Obaseki partners centre on construction of Benin Cultural Village, assures policies to preserve Edo heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has assured support for the construction of the Benin Cultural Village, being built by the Benin Cultural Heritage Centre (BCHC), reassuring that his government will sustain policies and reforms to preserve the state’s rich cultural heritage.\nObaseki, who received the executives and members of the Benin Cultural Heritage Centre on a courtesy visit at the Government House, said his government is paying critical attention to the state’s cultural assets to boost social-economic activities in the culture and tourism sector.\nWe have huge plans for our history and cultural heritage as this administration has a lot to showcase, knowing it can drive our Internally Generated Revenue (IGR) in Edo State.\n“Our governor is very passionate about our cultural heritage.\n“We have trained 300 teachers in Edo language and the government has employed them.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo Community head send SOS to Security Agencies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe people of Ogheghe Community, Uhuowmonde Local Government Area of Edo State has notified security agencies in the state over the planned attacked by some evil doers been spearheaded by the current chief priest Samuel Emokpae.\nPa Kingsley Iziengbe Amayo in a statement personally singed by him said the community has endured lasting peace since August 2017 judgment by His Royal Majesty, Oba Ewuare II.\nAccording to the statement; Priest Samuel Emokpae from all indications is bent on sabotaging the peace that we have been enjoying for the past four years.\nThe Community still and will continue to abide by the judgment of 15 August 2017 as pronounced by our Royal Majesty.\n” All we want is that various security agencies including the Nigerian Police and Army to take note of this threat by Priest Emokpae before it degenerate to crisis."
  },
  {
    "headline": "AfDB secures $15.6bn to link Nigeria and Ivory Coast by road",
    "summarized_story": "African Development Bank (AfDB) says it has secured $15.6 billion for the construction of the Lagos-Abidjan highway corridor, that would link Nigeria and Ivory Coast, to ease transportation across West Africa.\nThe bank had in April 2020, approved funding of $13.67 billion for the Lagos-Abidjan highway corridor project.\nAdesina said the project would go a long way to support trade in West Africa and reduce transport costs and increase intra-regional trade volume.\n“The biggest deal for the boardroom is the $15.6bn deal for the Lagos-Abidjan highway corridor.\n“The AfDB will also be establishing a $1m AFAWA women advisory facility to support women with advisory services,” he added"
  },
  {
    "headline": "Access Bank grows profit by 51% to N160bn in 2021",
    "summarized_story": "Access Bank Plc recorded 51.13% growth in profit to N160 billion for the full year 2021, ended December 31.\nAccording to a release announcing the results, the bank’s net interest income grew by 14.64% from N262.95 billion to N301.46 billion in the current period.\nThe bank earned N601.70 billion, from its lending business as Interest income grew by 22.99% from N489.22 billion.\nDespite a 32.3% spike in loan losses, net interest income after impairments still appreciated by 9.09% to stand at N218.25 billion.\nThe company had earlier paid an interim dividend of N0.30 kobo in September 2021, hence bringing the total dividend for the financial year to N1.00 kobo."
  },
  {
    "headline": "Osun DMO warns ex-finance commissioner against dishing out wrong data on state’s debt profile",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Debt Management Office (DMO) has cautioned the immediate past Commissioner for Finance in the state, Dr Wale Bolorunduro against misleading the public with wrong narratives as regards the state’s debt portfolio.\nTherefore, the unending narratives on Osun State’s Debt Stock and loan repayments from the former Commissioner of finance, in our view are mischievous and needless,” he said.\n“For avoidance of doubts, we wish to add that till date, the current administration has applied over =N=70billion for the State’s loan repayment.\nAs fiscally logical as this argument sounds, it is quite astonishing that this was not the case when the self-acclaimed Financial Guru was in charge of the State’s finance.\nAs a matter of fact, the State’s IGR was at best, only about 25% of the State’s loan repayment throughout his 3 year tenor as Finance commissioner in the State,” the DG, DMO noted."
  },
  {
    "headline": "Yoruba started glass technology, were the easiest scientists – Ooni of Ife",
    "summarized_story": "He said the community is making history in the world through culture and anthropological artwork, showcasing cultural heritage.\n“It has now been established that technology is behind the glass.\nHe traced it back here in 1830 and was marvelled to see a very broad-based industry rolling out glass technology in millions and it is being spread across the world.\nSome of the first sets were taken from Wumonije compound all the way to British museum, but this was freshly discovered here and it is actually linked to bronze technology, Iron technology which is the Iron and Bronze age, all the way to using Aluminum as a technology, using Copper, using Gold.\nWhat we are using as a symbol for the Yoruba people was first of all dug here.”"
  },
  {
    "headline": "The Art of Having a Conversation",
    "summarized_story": "The dictionary describes a conversation as an informal talk between two or more people in which information and ideas are exchanged.\nThis will enable you to determine if a conversation is safe or unsafe.\nTier 1: Small TalkMovies, sports, the weather, food, pop culture and music are all usually safe topics anywhere and with anybody.\nLearn about these topics so that at any given time you can hold a good conversation on any of them.\nConversation Killers· Why aren’t you getting married or having kids?"
  },
  {
    "headline": "Monalisa Chinda Coker",
    "summarized_story": ""
  },
  {
    "headline": "Trans-fat: How healthy is your meal?",
    "summarized_story": "There are two types of hydrogenated oils – partially hydrogenated and fully hydrogenated oil.\nThe World Health Organisation (WHO) in 2021 reported that cardiovascular diseases (CVDs) are the leading cause of deaths globally.\nTo avoid the accumulation of trans-fatty acids, caution must be applied when consuming foods with partially hydrogenated oil and fried foods.\nWe must be careful with margarine, crackers, packaged and frozen foods and opt instead for fully hydrogenated oil which poses less risk.\nAs it is almost impossible to identify foods that are prepared with trans-fat oil without proper labelling and regulations on limit of trans-fat in processed foods, consumption must be done with caution and in moderation."
  },
  {
    "headline": "Buhari Returns To Abuja From London",
    "summarized_story": "President Muhammadu Buhari has returned to the country after spending two weeks in London for a medical vacation.\nThe President was received at the Nnamdi Azikwe International Airport on Friday night by his Chief of Staff, Prof Ibrahim Gambari; Minister of FCT, Mallam Muhammed Musa Bello; Minister of Water Resources, Engr Sulieman Adamu, and other senior government officials.\nHis spokesman, Femi Adesina, explained that his early return to the country showed that all is well with the President.\nHe added that his presence will bring cohesion back to the ruling All Progressives Congress (APC) which has been in disarray in the run-up to its national convention slated for March 26, 2022.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Deleting Section 84 Of Electoral Act Will Cripple Democratic Choices – TMG",
    "summarized_story": "The Transition Monitoring Group (TMG) has called on the National Assembly not delete Section 84 (12) in the Electoral Act 2022, stating that it will cripple democratic choices.\nTMG chairman, Awwal Musa Rafsanjani, stated this on Friday during a meeting aimed at ensuring electoral transparency in the forthcoming 2023 general election.\nAccording to Rafsanjani, TMG strongly do not support the call to delete sSction 84 (12) in the new electoral law and urged the National Assembly to disregard the call.\n“So, we call on the National Assembly to totally disregard this call because this call is not meant to defend democracy.\nSo, Transition Monitoring Group is solidly calling on the National Assembly not to consider this amendment."
  },
  {
    "headline": "Nigeria has 2 laws, if Obiano’s wife, Bianca Ojukwu are not arrested- Falana",
    "summarized_story": "Human rights lawyer, Mr. Femi Falana (SAN), on Friday, stressed that Nigeria operates two sets of laws, one for the rich and one for the poor, if the wife of Anambra’s ex-Governor- Willie Obiano, Ebelechukwu; and a former Ambassador to Spain, Bianca Ojukwu, are not arrested for the offence of affray.\n“The offence of affray occurs when two or more people engage in a fight in public.\nThe senior advocate argued that the police would have immediately arrested the two of them, if they were not dignitaries.\nBut that is not the end of the case as the offence of affray was committed.\n“If two workers had committed affray in that ceremony, they would have been arrested, detained, and charged for disrupting the new governor’s inauguration.”"
  },
  {
    "headline": "Why I slapped ‘drunken’ Obiano’s wife – Bianca Ojukwu",
    "summarized_story": "Bianca Ojukwu has opened up on the fight incident involving her and Ebelechukwu Obiano, the immediate past first lady of Anambra state during the inauguration of Charles Soludo as the new governor of the state, on Thursday.\nRecall, News Direct had reported that Bianca slapped the former First lady during the inauguration after she abused her, leading to a fight between the duo.\nBianca, who spoke about the incident while appearing on Arise TV on Friday, said Mrs. Obiano who was drunk, came to abuse her, which prompted her own reaction.\n“The former APGA chairman, Victor Umeh, told her to leave me and told everyone to leave.\nI was stunned by the stench of whisky in her breath at such an early hour of the day."
  },
  {
    "headline": "I’m not thinking of 2023 elections – Peter Obi",
    "summarized_story": "The former governor of Anambra State, Mr. Peter Obi, Friday, said that he is preoccupied with the thought of a better Nigeria, not how to win political elections in 2023.\nWe are in a society today where poor businesses cannot get diesel to do their businesses, unfortunately, nobody is discussing that.\nWhile talking about Prof. Nwala, he also said “Prof.\nWe are in a knowledge economy and development.\n“For me as a student who passed through the tutelage of Prof. Nwala, I remain his son and I celebrate him everyday,” he said."
  },
  {
    "headline": "Why We Arrested Ex-Governor Willie Obiano – EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission, EFCC, has revealed why it arrested the immediate past Governor of Anambra State, Willie Obiano.\nThe development came just a few hours after he handed over power to the new Governor of the State, Chukwuma Charles Soludo.\nSpeaking with BBC Pidgin, the Public Relations Officer of the commission, Wilson Uwajaren confirmed the arrest.\nAccording to the commission’s spokesman, Obiano had been on the watchlist of the EFCC prior to the transition on Thursday.\n“Today he lost the immunity and was traveling out of the country before we finally arrested him”."
  },
  {
    "headline": "Medical trip: From United Kingdom, Buhari returns to Abuja",
    "summarized_story": "After 12 days, President Muhammadu Buhari has has to the Nigeria’s seat of power, Aso Rock Villa Abuja.\nThe President according to his media team returned Friday evening.\nPresident Buhari had left for medical checkup almost two weeks ago.\nWith his return, plans by the ruling party, the All Progressives Congress (APC) to stage its long-awaited national convention is expected to be on top gear.\nThe convention which has witnessed postponements is scheduled for March 26, 2022 in Abuja."
  },
  {
    "headline": "At last, EFCC breaks silence on Willie Obiano",
    "summarized_story": "Willie Obiano of Anambra is currently in its custody undergoing interrogation after his arrest on Thursday.\nHe said Obiano who arrested at the Murtala Mohammed International Airport in Lagos, was brought to Abuja on Friday morning.\n“The former governor is currently in our custody undergoing interrogation and I can not say exactly when he will be released.\n“All I can tell you now is that he is still in the EFCC custody in Abuja,” he said.\nNAN reports that Obiano was arrested by the EFCC on Thursday night, hours after his handover to the new Anambra governor, Prof. Chukwuma Soludo."
  },
  {
    "headline": "2023: Atiku no longer relevant – Ohuabunwa",
    "summarized_story": "…Says Buhari has tried, but…A presidential aspirant on the platform of the Peoples Democratic Party (PDP), Mazi Samuel Iheanyichukwu Ohuabunwa, has bombed former vice-president Atiku Abubakar who has asked Nigerians to help him achieve his lifetime ambition of becoming the country’s next president, come 2023.\nMazi Ohuabunwa, in an exclusive interview with Blueprint Weekend, said as far as he was concerned, the Turakin Adamawa’s time had come and gone.\nAnd I haven’t seen any of them or Nigerians haven’t seen any of these men who meet that expectation.\nMany are good, but you know when better things come, good things give way.\nSo, good things will give way because Nigeria wants a transformation."
  },
  {
    "headline": "FG To Gazette Electoral Act, Remove Section Barring Political Appointees From Elections",
    "summarized_story": "The Federal Government says it will go ahead to gazette the Electoral Act 2022, but remove the contentious Section 84 (12) of the law.\n“The judgment of the court will be recognised by the government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\nPresident Muhammadu Buhari assented to the Electoral Act 2022 on February 25, following a series of attempts by the National Assembly to amend the nation’s electoral laws.\nHe later asked the Senate to amend the section of the Act, but the request was rejected by the lawmakers."
  },
  {
    "headline": "PHOTOS: President Buhari Returns To Abuja From London",
    "summarized_story": "President Muhammadu Buhari has returned to the country after spending some time in the United Kingdom for medical checkup.\nThe President had departed for the United Kingdom on March 6 after handing over to Vice President Yemi Osinbajo.\nHe was scheduled to be away for two weeks.\nPresidential spokesperson Femi Adesina had described the medical checks as routine.\nSee more photos of the President’s return below:"
  },
  {
    "headline": "Obiano Arrested For Alleged Misappropriation Of N42bn – Source",
    "summarized_story": "The arrested former Governor of Anambra State was arrested for alleged misappropriation of public funds.\nAccording to the EFCC source, he was arrested for misappropriating N5bn Sure-P and N37 billion Security Vote funds, which was withdrawn in cash.\nFormer Anambra State Commissioner for Information, Don Adinuba, had, at the time, condemned the EFCC watchlist reports, claiming that they were politically motivated.\n“Governor Obiano has a whole four months to remain in office as the Anambra State chief executive,” Adinuba said.\n“The EFCC went too far to announce in November that it is observing him."
  },
  {
    "headline": "Court Vacates Order Stopping APC National Convention",
    "summarized_story": "A High Court in the Federal Capital Territory (FCT) on Friday vacated an order stopping the National Convention of the All Progressives Congress (APC) billed for March 26.\nThe judge relied on a recent supreme court judgment ( Aguma Vs APC), to conclude his ruling.\nThe ruling followed the twists in the leadership of the ruling party as it plans for the convention.\nREAD ALSO: Buni Names Umahi, Fani-Kayode, And Others In National Convention Sub-CommitteesIn recent days, there were tussles over the leadership of the party.\nHe reiterated that he had duly transmitted power to Governor Bello who acted on his authority while he was away."
  },
  {
    "headline": "Russia Accuses Google, YouTube Of ‘Terrorist’ Activities",
    "summarized_story": "Russian regulators on Friday accused US tech giant Google and its video subsidiary YouTube of “terrorist” activities, the first step towards a possible access ban.\nRussia has already blocked access to other global tech giants including Facebook, Twitter and Instagram as well as several independent media.\nRussian media regulator Roskomnadzor said YouTube users “are sharing adverts with calls to shut down railway communications between Russia and Belarus”.\n“The YouTube administration’s activities are terrorist in nature and threaten the life and health of Russian citizens,” Roskomnadzor said, quoted by Interfax news agency.\nRussia is one of the most restrictive countries for press freedom and freedom of expression, but the situation has worsened in the past few weeks since the operation in Ukraine began on February 24."
  },
  {
    "headline": "We will implement Court Ruling on Electoral Act",
    "summarized_story": "The office of the Attorney General of the Federation and Minister of Justice will accordingly give effect to the Court judgment in line with the dictates of the law and the spirit of the judgment.\nThe judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\nThe provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly.\nThis is in line with the dictates of chapter 7, Part 4, Section 287 of the 1999 Constitution of the Federal Republic of Nigeria (as amended) on enforcement of decisions that makes it a point of duty and obligation on all authorities and persons to have the judgment of the federal High Court, among others, to be enforced."
  },
  {
    "headline": "Court Vacates Injunction against APC National Convention -",
    "summarized_story": "An FCT High Court has vacated a restraining injunction against the March 26 convention of the All Progressives Congress (APC).\nHe said the the order of November 18, 2021, has been overtaken by a recent Supreme Court judgement on a similar matter.\nSalisu Umoru, had sought to restrain the APC, Governor Buni and the Independent National Electoral Commission (INEC) from organising any convention until the determination of the suit.\nThe application seeking to set aside the November 18, 2021 ruling of the court restraining the convention was stalled on Tuesday after two lawyers, Shuaibu Aruwan (SAN) and Michael Adoyi, both announced appearances for the APC.\nIn the application dated March 9, 2022, the APC was asking for “an order of this honourable court striking out the suit in its entirety for want of jurisdiction."
  },
  {
    "headline": "Federal High Court declares Section 84(12) of Electoral Act Unconstitutional -",
    "summarized_story": "A Federal High Court sitting in Umuahia the Abia State capital has declared unconstitutional Section 84(12) of the newly amended Electoral Act.\nThe court presided over by Justice Evelyn Anyadike while delivering judgement Friday held that the section is in violation of a provision in the 1999 Constitution as amended and should therefore be deleted.\nIt would be recalled that President Muhammadu Buhari had while signing the amended Electoral Act called the attention of the National Assembly to amend the section as it violates the Constitution and breached the rights of political appointees.\nSwiftly, President Muhammadu Buhari wrote a letter to both Chambers of the National Assembly seeking amendment of the section but the Senate rejected the President’s request.\nThe Presiding judge holds that the Constitution has already stipulated that appointees of government seeking to contest elections were only to resign at least 30 days to the date of the election and that any other law that mandated such appointees to resign or leave office at any time before that is unconstitutional, invalid, illegal null and void to the extent of its inconsistency to the clear provisions of the Constitution."
  },
  {
    "headline": "GIZ, KAS organise workshop for Journalists -",
    "summarized_story": "The Independent National Electoral Commission has lamented the poor Infrastructure and road network in Nigeria has great negative impact on its operations.\nOne of its National Commissioners revealed this while speaking on the topic, “INEC and the Electoral Act 2022: operational challenges and emerging risks” at a workshop for journalists on the new Electoral actThe workshop was organised by the German Cooperation, Konrad Adenauer Stiftung in AbujaMany have lauded the signing of the 2022 electoral bill into law but still point out some minor flaws in the Act which could prove contentiousBeyond this, the media has a crucial role to play in enlightening the public, which places on Journalists the need to have a deep rooted knowledge of the Electoral Act.\nThis media workshop is a training on the provisions and changes made to the Electoral Act 2022.\nThe current Act addresses many gaps in the previous Electoral Act but is not without its shortfallsEven officials of INEC have expressed satisfaction with the Electoral Act, 2022 and believe many of its new provisions will assist the Electoral body in conducting credible electionsOrganisers of the workshop also applaud the inherent checks and balances in the new Electoral ActProvisions of the new Electoral Act 2022 will henceforth guide all elections in Nigeria"
  },
  {
    "headline": "Abramovich Handed Chelsea Director Control of Firm on Day of Ukraine Unvasion",
    "summarized_story": "It was the second time Chelsea owner Abramovich moved assets to a close associate before Britain and the European Union imposed sanctions on him this month.\nA Reuters analysis of corporate filings in London and Amsterdam showed Abramovich was previously listed as the “beneficial owner” of Cyprus-based Ervington Investments Limited.\nAbramovich has handed control of two companies to business associates since the war began, according to corporate filings.\nBritain imposed sanctions on Abramovich on March 10, saying he had profited from transactions with the Russian government and special tax breaks.\nTenenbaum was among 10 of Evraz’s board members who quit on March 11 because of the Abramovich sanctions, the company said."
  },
  {
    "headline": "“Ambassador Bianca’s Narrative of the Unfortunate Event is the Truth” – Senator Victor Umeh",
    "summarized_story": "Senator Victor Umeh, Former Chairman, All Progressives Grand Alliance in an interview with ARISE, says the rancor between Ambassador Bianca Ojukwu and Ebelechukwu Obiano was a stain in what was a perfect day for the people of Anambra and it was completely avoidable."
  },
  {
    "headline": "‘Sacrilege to a Titled Matriarch’: Bianca Ojukwu Reacts to Altercation with Ex-Gov Obiano’s Wife",
    "summarized_story": "Read her explanation below:MY STORYAs the inaugural ceremonies for Prof Charles Soludo and his deputy began and all guests were seated, the former First Lady of Anambra State, Mrs Ebele Obiano, was noticeably absent.\nThis very act is considered a sacrilege to a titled matriarch such as myself in Igbo culture.\nShe held on to her wig with her two hands and tried to take the wig away from me.\nIt is unfortunate that she threw all caution to the wind and imported this kind of melodrama to a state ceremony.\n– Ambassador Bianca Odimegwu- Ojukwu, former Nigerian Ambassador to Spain and APGA BOT member."
  },
  {
    "headline": "Soludo Warns IPOB + Bianca & Obiano’s Wife’s Scuffle – Trending With Ojy Okpe",
    "summarized_story": "Bianca, Widow of Chukwuemeka Ojukwu has been trending on social media after Bianca Issued Obiano’s wife two hot slaps during the inauguration of Chukwuemeka Soludo as governor of Anambra state.\nIn another development Willie Obiano the immediate past governor of Anambra state was arrested by the Economic and Financial Crimes Commission on Thursday evening at the Murtala Muhammed International Airport in Lagos on his way to Texas.\nFinally, Former Governor of the Central Bank of Nigeria Prof. Chukwuma Soludo, on Thursday during his inauguration as the sixth elected governor of Anambra State said his administration would do everything humanly possible to end criminality in the state."
  },
  {
    "headline": "Nigeria: Court Declares Section 84(12) of Amended Electoral Act Illegal, Orders AGF Malami to Delete It",
    "summarized_story": "A Federal High Court sitting in Umuahia has today struck down Section 84(12) of Nigeria’s newly amended Electoral Act which President Muhammadu Buhari had written to the National Assembly to delete.\nIt would be recalled that President Muhammadu Buhari had while signing the amended Electoral Act urged the National Assembly to delete the provision as it violated the Constitution and breached the rights of government appointees.\nThe President further wrote a letter to both Chambers of the National Assembly seeking amendment by way of deleting the provision an amendment the Senate rejected in plenary.\nCounsel to the Plaintiff Emeka Ozoani, SAN while addressing newsmen stated that by this judgment, the National Assembly is not required to further make any amendments to the section as the import of this judgment is that Section 84(12) of the Electoral Act is no longer in existence or part of the Electoral Act.\nThe Judge thereafter ordered the Attorney General of the Federation to forthwith delete the said Subsection 12 of Section 84 from the body of the Electoral Act, 2022."
  }
]