[
  {
    "headline": "Cooking gas demand falls by 38%, marketers clash over price",
    "summarized_story": "National cooking gas demand has dropped by 38 percent, according to the Nigerian Association of Liquefied Petroleum Gas Marketers, NALPGAM.\nThe revelation came on the heels of clamours by a group of experts on Tuesday that demand for Liquefied Natural Gas, popularly known as cooking gas, had dropped to a record low across the country.\nThe President of the Nigerian Gas Association, Ed Ubong, said at a downstream event in Lagos that national gas consumption had dropped due to high prices.\nFollowing the clamour, NALPGAM, President Oladapo Olatunbosun, on Wednesday, said gas demand had dropped from 1.2 million metric tonnes per annum (mmtpa) to around 750,000mtpa.\nThis brings to fore, the achievement of President Buhari’s National Gas Expansion Programme which seeks to deepen local gas usage within the next decade."
  },
  {
    "headline": "Ex-Ogun gov, Daniel, wins APC senatorial ticket",
    "summarized_story": "Former Governor of Ogun State, Gbenga Daniel, has won the ticket of the All Progressives Congress to emerge as the party’s senatorial candidate in Ogun East.\nDaniel polled 450 votes to defeat the incumbent Senator Lekan Mustapha, who polled 29 votes.\nMustapha had stepped down for Daniel after the intervention of the Awujale of Ijebuland, Oba Sikiru Adetona, who held a meeting with the duo while the election commenced.\nAt the commencement of the shadow election held on Saturday at Itoro Hall in Ijebu-Ode, the former Commissioner for Health in the state, Babatunde Ipaye, had announced that Senator Mustapha, had stepped down for Daniel.\nDaniel, who defected from the People’s Democratic Party to the APC, stressed that his followers insisted that he could not retire from politics yet."
  },
  {
    "headline": "Atiku lauds Tambuwal for supporting his presidential bid",
    "summarized_story": "By Miftaudeen RajiPresidential candidate on the platform of the People’s Democratic Party, PDP, Atiku Abubakar has applauded his co-contender in the race, Governor Aminu Tambuwal of Sokoto for withdrawing.\nAtiku, in a tweet, said he looked forward to working with Tambuwal.\nI look forward to working with you as we unite our party and our country.”Vanguard recalls that Tambuwal had withdrawn from the PDP race to rally support for Atiku.\nA presidential aspirant in the PDP would need the votes of fewer than 767 delegates to secure the party’s presidential ticket.\n-AA #PDPPresidentialPrimaries — Atiku Abubakar (@atiku) May 28, 2022"
  },
  {
    "headline": "Suspended Benue Catholic priest, Alia, wins APC guber ticket; other aspirants protest",
    "summarized_story": "Alia with the group, Alia Alliance.\nBy Peter Duru, MakurdiThe suspended Benue Catholic Priest, Reverend Father Hyacinth Alia, has clinched the governorship ticket of the All Progressives Congress, APC, in Benue state.\nMr. Terlumun Ikya polled 3,680 votes while the member of the House Representative for Konshisha/Vandeikya Federal Constituency, Mr. Herman Hembe garnered 2,473 votes.\nFormer National Chairman of Peoples Democratic Party, PDP, Senator Barnabas Gemade garnered 2,365 votes, Mr. Godwin Tyoapine polled 1,228 votes while Bernard Yisa garnered 742 votes.\nPart of the letter read, “The direct primaries of the APC held on Friday 27, 2022, was to say the least a sham and an aberration of democracy."
  },
  {
    "headline": "Soyinka cancels engagement with Anambra school over killing of pregnant woman, children",
    "summarized_story": "File: Professor Wole SoyinkaProfessor Wole Soyinka has cancelled an engagement with a school in Anambra State over the murder of a pregnant woman, her four children, and six other persons in Isulo, Orumba North Local Government Area of the state.\nThe Nobel Laureate made his decision known in a statement entitled “Drawing the Red Line on Infanticide,” stating that ‘We must begin somewhere, “draw a line” – however individual and limited’.\nGunmen, on Sunday, May 22, killed Mrs. Harira Jubril, her four children and six others, all of northern extraction, causing a wave of outcry.\nAgain, I insist that it is long past time to move beyond pious denunciations – essential, yes, but insufficient.\nIn empathy with those innocents whose scholastic careers have been so brutally annulled, I serve notice of cancellation of that engagement with the Anambra school, scheduled for August."
  },
  {
    "headline": "Drawing the Red Line on Infanticide",
    "summarized_story": "Then of course one would be held responsible for inserting the notion in the heads of others.\nAnd we know that unless they are pre-emptively denounced and exposed, they will strike and strike again.\nI admitted, in Abuja, that I nearly cancelled that engagement as an expression of that revulsion, and in solidarity with the bereaved.\nI totally repudiate the killing of guests, of the unarmed, of innocents , the vulnerable, indeed, the murder of humanity.\nIn empathy with those innocents whose scholastic careers have been so brutally annulled, I serve notice of cancellation of that engagement with the Anambra school, scheduled for August."
  },
  {
    "headline": "PDP Primary: Tambuwal’s sacrifice will unite PDP — Supporters",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto stateBy Johnbosco AgbakwuruFew hours after the governor of Sokoto state, Aminu Tambuwal announced his withdrawal from the presidential primaries, his supporters have expressed the hope that such sacrifice will unite the Peoples Democratic Party, PDP, and give it victory in the general elections.\nReacting to the development one of the supporters of Tambuwal and former member of the House of Representatives, Hon.\nREAD ALSO:“Though painful and difficult for us, his ardent supporters, we wholeheartedly commend the leadership and sacrifice of His Excellency, Alhaji Aminu Tambuwal, Mutawallen Sokoto, for acting in the overall interest of the country.\nFor those who understand the vision of tomorrow, he has earned the leadership of the country and time will tell.\n“We sincerely hope that this unparalleled sacrifice will unite the party and translate into an outstanding victory for the PDP in 2023."
  },
  {
    "headline": "Lagos Central ticket: Deputy Speaker, Wasiu Sanni beats ex-Minister Demola Seriki",
    "summarized_story": "Wasiu Eshinlokun Sanni, Deputy Speaker, Lagos State House of Assembly, will contest the state’s Central Senatorial election in 2023.\nHe won the All Progressives Congress (APC) ticket on Saturday, after defeating three other contestants.\nTolani Sule, Chairman, APC Electoral Committee/Returning Officer announced Eshinlokun-Sanni’s victory.\nThe former Chairman of Lagos Island Local Government scored 185 votes to defeat his closest rival, Demola Seriki who got 97.\nSeriki, Nigeria’s Ambassador to Spain, was at different times the Minister of Water Resources, Mines & Steel, (Agriculture – State) and (Defence – State)."
  },
  {
    "headline": "EFCC officials storm venue of PDP National Convention",
    "summarized_story": "Personnel of the Economy and Financial Crime Commission (EFCC) on Saturday stormed the venue of the Peoples Democratic Party (PDP) national convention holding in Abuja.\nThe officers, who were in red jackets with the “EFCC” crested at the back, were seen in their numbers walking around and inside the venue.\nThe News Agency of Nigeria (NAN) correspondents covering the convention reports that the anti-graft officers, whose purpose of presence was still unknown, declined to speak with the media.\nMeanwhile, PDP National Director of Publicity, Chinwe Nnorom announced that phones are barred from the voting area.\nShe said, “If you are not a delegate don’t go close to the cubicles, delegates should also note that phones are not allowed around the voting cubicle.”"
  },
  {
    "headline": "Buhari backs setting up of special force to fight terrorism in Africa",
    "summarized_story": "President Muhammadu Buhari Saturday in Malabo, Equatorial Guinea, endorsed the recommendation of setting up an African Standby Force on Terrorism.\nHe called on leaders to muster the political will that will fuel synergy, enhance intelligence gathering and bring more urgency to tackling violent crimes.\nFollowing the presentation of a report on Terrorism and Violent Extremism in Africa at the meeting, President Buhari highlighted four items on the recommendation for immediate action.\nChairman, these efforts, however, need to be strengthened and complemented by the African Union, through the African Union Peace and Security Architecture.\nThe Commission Reports on the Prevention and Combating of Terrorism and Violent Extremism and on Unconstitutional Changes of Government in Africa was presented by the Chairperson of the African Union Commission, H.E."
  },
  {
    "headline": "Another top ISWAP Commander surrenders to troops",
    "summarized_story": "Musa Mani, a top Commander of the Islamic State of the West Africa Province (ISWAP) has surrendered to the troops of the Multi-National Joint Task Force (MNJTF) following sustained joint operations on the fringes of the Lake Chad.\nMakama gathered that Mani, who was from Diffa in the Niger Republic, surrendered to troops of the task force in Damasak and Malam Fatori.\nThe 43-year-old suspect, according to Makama’s tweet confessed that the ongoing offensive by troops of Operation Hadin Kai and Operation Lake Sani made him escape and surrender.\n“The suspects told troops that dozens of fighters had died while many have escaped due to the fear of being killed,” he said.\n“The suspect is currently undergoing profiling in troops’ custody,” he added."
  },
  {
    "headline": "Over 20 persons reportedly die while seeking free food, gifts in Port Harcourt church",
    "summarized_story": "There was pandemonium in Port Harcourt, the Rivers State capital, on Saturday as over 20 persons scrambling for free food and gifts in a new generation church reportedly died in a stampede.\nThe Nation reports that the church had invited members of the public for its fourth edition of free gifts and food items distribution at the church premises.\nDAILY POST gathered that the incident occurred in the early hours of Saturday when a crowd of persons stormed the gate of the church and pushed it causing scrambling that led to the stampede.\nDetails of the incident are still sketchy as of press time, however, it was learnt that scores of victims who sustained injuries have also been rushed to hospital.\nWhen contacted by DAILY POST, the state’s Police Public Relations Officer, Iringe Grace Koko, pledged to revert with details."
  },
  {
    "headline": "Osun 2022: Between money politics and good governance",
    "summarized_story": "Rather, he would be bringing to the table his competence and imbued capacity to transform the state through good governance.\nThat’s why it will be foolhardy for anybody to ignore the role or impact of money in politics.\nThat Nigeria has Americanized her politics by lacing it with money has created an erroneous impression that the influence of money is absolute.\nImpliedly, we are not only spending the money we didn’t work for but also indirectly sending the money to another country.\nMay the Lamb of God, who takes away the sin of the world, grant us peace in Osun State!"
  },
  {
    "headline": "New thinking in public service and administration",
    "summarized_story": "The challenge, however, and especially with a public service in a difficult administrative environment like Africa, is how easy it is for the public service to be caught up in its bureaucratic rules and processes in ways that deeply circumscribed its efficiency and service delivery mandate.\nHere, we survey the significant areas that constitute the locus of new thinking for the public service and the transformation of its efficiency and service delivery capacity.\nThe idea of open government aligns the public service with the necessity of (re)creating public value(s) that will transform the quality of life of the citizens.\nIndeed, the joint production of public value(s) by the government, nonstate actors and the citizens places the public service squarely within the ambit of the New Public Governance approach, the New Public Administration, and the New Public Service approaches that place the active citizens at the core of democratic governance, and the center of service delivery by the public service.\nThus, even though institutional reform is inevitable within the public service system in Nigeria, such a reform must be constrained by the imperatives of new thinking that arms the public service system with the wherewithal by which it must facilitate its own transformation."
  },
  {
    "headline": "Buhari must not bequeath today’s level of insecurity or worse to his successor. But the omens are not good",
    "summarized_story": "– President Muhammadu Buhari, speaking at the ceremonial parade to commemorate NAF’s 58th anniversary in Kano, Monday, 24 May, 2022.\nBut these are not the only ways President Buhari has tacitly encouraged and, ipso facto, sparked insecurity in Nigeria.\nOr what in all decency should be more urgent than getting to the very root of terrorism funding in Nigeria?\nThis is one reason insecurity is fated to be a recurring decimal during the Buhari administration.\nAnd this is one thing that baffles me about President Buhari."
  },
  {
    "headline": "President Buhari: You need not seek foreign loans!",
    "summarized_story": "In the original submission to the SPAC by the Office of the Accountant General of the Federation, there was non-reporting of this figure.\nIn a swift response, the Accountant General evasively stated that the seeming discrepancy was already appropriated as the 2015 ECOWAS Stabilization Fund to which there was no empirical documentation to substantiate.\nWas there any query from the Presidency regarding this incident to the Office of the Accountant General of the Federation?\nMr. President: Let us begin somewhereThis present government of President Muhammadu Buhari has exactly one year in office.\nPresident Muhammadu Buhari, as the father of this house called Nigeria, must not allow this house to fall even as the cracks are widening."
  },
  {
    "headline": "Obasanjo and his ‘touch of madness’",
    "summarized_story": "And responding to his visitor’s opening remarks, Chief Obasanjo adumbrated four panaceas he believed were indispensable to the resolution of the country’s crises.\nChief Obasanjo spoke of the ideal leader needing to possess a ‘touch of madness’ as a prerequisite for successful leadership.\nThe touch of madness Chief Obasanjo referred to is a hangover of military methods, a needless and foolish recourse to extralegal measures to tackle often routine but sometimes complex problems, and counterproductive measures involving the abrogation of the rule of law.\nFortunately, it was not Mr HayatuDeen who spoke about a touch of madness; he spoke only of his passion for Nigeria.\nThe madness rhetoric came from Chief Obasanjo who, as always, is convinced, that his analysis is irrefutable."
  },
  {
    "headline": "BREAKING: Atiku wins PDP presidential ticket",
    "summarized_story": "From Ndubuisi Orji, AbujaFormer Vice President Atiku Abubakar has won the People’S Democratic Party (PDP) presidential primary for the 2023 general elections.\nAtiku polled a total of 371 votes to defeat Rivers State governor Nyesom Wike, who came in second place with a total of 237 votes.\nFormer Ekiti State Governor Ayodele Fayose, publisher of Ovation Magazine Dele Momodu, Charles Ugwu and Chikwendu Kalu scored zero vote, while 12 votes were voided.\nThis is the second time Atiku, who is seeking to be president for the sixth time, would be nominated as the presidential standard bearer of the PDP.\nThe former vice president, who first sought the Presidency in 1993 on the platform of the defunct Social Democratic Party (SDP), was the opposition party candidate in the 2019 general elections."
  },
  {
    "headline": "Road to 2023: Tambuwal drops out of PDP presidential contest",
    "summarized_story": "From Ndubuisi Orji, AbujaSokoto State Governor Aminu Tambuwal has withdrawn from the People’s Democratic Party (PDP) presidential contest.\nGovernor Tambuwal announced his withdrawal from the contest at 8:34 pm, shortly before the commencement of voting at the ongoing PDP national convention.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Road to 2023: Jonathan absent as PDP begins national convention",
    "summarized_story": "From Ndubuisi Orji, AbujaFormer President Goodluck Jonathan was conspicuously absent on Saturday as the People’s Democratic Party (PDP) commenced its national convention in Abuja.\nThe convention, which was held at the Velodrome of the MKO Abiola Stadium, is to nominate the PDP presidential candidate for the 2023 presidential poll.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nFormer Vice President Namadi Sambo was, however, present at the event, which commenced at about 6.12 pm with Christian and Muslim prayers.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Terrorism: Buhari endorses African standby force",
    "summarized_story": "According to a statement by the Senior Special Assistant to the President on Media and Publicity, Garba Shehu, Buhari said this while speaking at the 16th African Union Extra-ordinary Session of the Assembly of African Union on Terrorism and Violent Extremism in Africa.\nFollowing the presentation of a report on Terrorism and Violent Extremism in Africa at the meeting, President Buhari highlighted four items on the recommendation for immediate action.\n“In the West African region, we are working very hard through the instrumentality of ECOWAS to combat terrorism.\n“Mr Chairman, these efforts, however, need to be strengthened and complemented by the African Union, through the African Union Peace and Security Architecture.\nThe Commission Reports on the Prevention and Combating of Terrorism and Violent Extremism and on Unconstitutional Changes of Government in Africa was presented by the Chairperson of the African Union Commission, H.E."
  },
  {
    "headline": "Oshiomhole, 2 others emerge APC senatorial candidates in Edo",
    "summarized_story": "From Tony Osauzo and Ighomuaye Lucky, BeninFormer National Chairman of the All Progressives Congress (APC) Adams Oshiomhole emerged on Saturday as the senatorial candidate of the party for the Edo North senatorial district.\nOshiomhole, who is the former governor of Edo State, was returned unopposed following the withdrawal of his rival and incumbent Senator representing Edo North, Sen. Francis Alimikhena, who also resigned his membership of the APC on Friday.\nIn Edo South, former state youth leader of the party, Valentine Asuen, defeated former deputy governor, Hon Lucky Imasuen to clinch the party’s ticket.\nAsuen scored 216 while Imasuen garnered 158 votes at the primary where four votes were voided.\nIn Edo Central, Monday Okpebholo was returned unopposed after he was affirmed by 242 out of the 244 accredited delegates."
  },
  {
    "headline": "Breaking: Atiku is PDP Presidential Candidate",
    "summarized_story": "Former Vice President Atiku Abubakar on Saturday in Abuja emerged as the Peoples Democratic Party (PDP) candidate for 2023 presidential election.\nAbubakar scored 371 votes to emerge as the party flagbearer l, defeating his close contender, Gov.\nHe also announced the votes scored by other aspirants as Gov.\nHe alsonserved as Obasanjo’s vice president following their reelection in 2003 until 2007.\nHe also run as the PDP presidential candidate in 2019, but lost to President Buhari of APC."
  },
  {
    "headline": "Breaking: Atiku is PDP Presidential Candidate",
    "summarized_story": "Former Vice President Atiku Abubakar has emerged as the presidential candidate of the Peoples Democratic Party.\nHe was declared winner of the party’s presidential primary Sartuday night in Abuja by chairman of the convention committe, former Senate President David Mark.\nAtiku polled 371 votws to defeat his closest rival, Rivers State Governor Nyesom Wike, who scored 237 votes.\nFormer Senate President Bukola Saraki got 70 votes.\nSokoto State Govenor Aminu Tambuwal had earlier withdrew from the race and urged his supporters to vote for Atiku, a development which was the game changer for the the former Vice President."
  },
  {
    "headline": "Breaking: Tambuwal Steps down for Atiku",
    "summarized_story": "Chuks Okocha in AbujaSokoto State governor and Chairman, People’s Democratic Party (PDP) Governors Forum, Aminu Waziri Tambuwal, has stepped down for former Vice President Atiku Abubakar.\nTambuwal who announced this at the ongoing National Convention at the Moshood Abiola Stadium in Abuja, urged all his delegates to vote for Atiku in national interestDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EFCC Officials Storm PDP Convention Venue",
    "summarized_story": "Chuks Okocha in AbujaOver twenty officers of the Economic Financial Crime Commission have just arrived the MKO Abiola International Stadium, Abuja, the venue of the Peoples Democratic Party Special National Convention.\nThe officers arrived the venue around 4.30pm.\nThe purpose of their visit is still unknown.\nNo fewer than 811 Peoples Democratic Party (PDP) delegates are undergoing accreditation at the national convention groundThe exercise will enable the party’s national delegates to decide the presidential flag bearer of the party.\nThe delegates are drawn from the 774 local government areas of the country."
  },
  {
    "headline": "Breaking: 31 Die in Rivers Church Stampede",
    "summarized_story": "Blessing Ibunge in Port Harcourt31 persons have been confirmed dead in a stampede Saturday, during a church free food programme in Port Harcourt, capital of Rivers State.\nIt was learned that the programme was scheduled for 9am, but the invitees were already at the gate three hours earlier.\nThe State Police Public Relations Officer, DSP Grace Iringe-Koko, who confirmed the incident to THISDAY, disclosed that 31 persons lost their lives in the stampede.\n“31 persons lost their lives at the church programme in Polo Club, Port Harcourt.\nAs at the time of filing this report, the church was yet to react to the incident."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Organisers Of Headies 2022 Petition Inspector-General Police Over Singer, Portable’s Alleged Threats To Kill Nominees",
    "summarized_story": "The organisers of one of Nigeria’s prestigious awards, Headies, have written a petition to the Inspector-General of Police, Usman Baba, concerning the threat to the life of some nominees of the award ceremony by artiste, Habeeb Okikiola popularly known as Portable.\nAnybody else who wins, I will ask for them to be killed.\nIn the petition, the organisers of the award demanded a retraction from the up-and-coming artiste.\nFurthermore, it was demanded by the organisers of The Headies that Portable should publish a written apology to all the nominees in the two categories.\nThe organisers of the award further stated that if the singer does not meet their demands, they will not only disqualify him from participating in the Headies but “also enforce the instrumentalities of the law to the fullest.”"
  },
  {
    "headline": "Atiku fends off Wike, Saraki to win PDP presidential primary election",
    "summarized_story": "Former Vice-President Atiku Abubakar has won the presidential ticket of the Peoples Democratic Party (PDP).\nTo clinch the ticket to represent the party in the 2023 elections, he floored Bukola Saraki, former senate president; Emmanuel Udom, Akwa Ibom governor; Nyesom Wike, Rivers governor; Ayo Fayose, former governor of Ekiti; Bala Mohammed, Bauchi governor, among others.\nAtiku polled 371 votes to emerge the winner, while Wike, his closest challenger, secured 237 votes.\nSaraki placed third with 70 votes, followed by Udom Emmanuel (38), and Bala Mohammed (20).\nI am honoured to be named the presidential candidate of the Peoples Democratic Party (PDP),” he wrote."
  },
  {
    "headline": "Atiku fends off Wike, Saraki to win PDP presidential primary election",
    "summarized_story": "Former Vice-President Atiku Abubakar has won the presidential ticket of the Peoples Democratic Party (PDP).\nTo clinch the ticket to represent the party in the 2023 elections, he floored Bukola Saraki, former senate president; Emmanuel Udom, Akwa Ibom governor; Nyesom Wike, Rivers governor; Ayo Fayose, former governor of Ekiti; Bala Mohammed, Bauchi governor, among others.\nAtiku polled 371 votes to emerge the winner, while Wike, his closest challenger, secured 237 votes.\nSaraki placed third with 70 votes, followed by Udom Emmanuel (38), and Bala Mohammed (20).\nI am honoured to be named the presidential candidate of the Peoples Democratic Party (PDP),” he wrote."
  },
  {
    "headline": "Smart Adeyemi loses Kogi west APC ticket to ex-house of reps member",
    "summarized_story": "Smart Adeyemi, senator representing Kogi west, has lost the All Progressives Congress (APC) senatorial primary.\nHe lost the ticket to Sunday Karimi, a former lawmaker who represented Yagba federal constituency between 2011 to 2016 in the house of representatives.\nKarimi polled 288 votes to defeat Adeyemi and four other aspirants at the election held in Kabba.\nAdvertisementIn his remarks, Karimi expressed joy at the conclusion of the exercise, and thanked God and the delegates for believing him worthy of representing the senatorial district.\nAdvertisementAlso, on Saturday, Abubakar Ohere won the APC ticket for Kogi central senatorial district, while Jibrin Isah, a sitting senator, beat Yahaya Audu, brother to Abubakar Audu, former governor of Kogi, to emerge as the party’s flagbearer for Kogi east senatorial district."
  },
  {
    "headline": "Smart Adeyemi loses Kogi west APC ticket to ex-house of reps member",
    "summarized_story": "Smart Adeyemi, senator representing Kogi west, has lost the All Progressives Congress (APC) senatorial primary.\nHe lost the ticket to Sunday Karimi, a former lawmaker who represented Yagba federal constituency between 2011 to 2016 in the house of representatives.\nKarimi polled 288 votes to defeat Adeyemi and four other aspirants at the election held in Kabba.\nAdvertisementIn his remarks, Karimi expressed joy at the conclusion of the exercise, and thanked God and the delegates for believing him worthy of representing the senatorial district.\nAdvertisementAlso, on Saturday, Abubakar Ohere won the APC ticket for Kogi central senatorial district, while Jibrin Isah, a sitting senator, beat Yahaya Audu, brother to Abubakar Audu, former governor of Kogi, to emerge as the party’s flagbearer for Kogi east senatorial district."
  },
  {
    "headline": "Real Madrid beat Liverpool to win record 14th Champions League title",
    "summarized_story": "Real Madrid scored a second-half winner to pip Liverpool to the 2021/2022 UEFA Champions League title following a 1-0 win over Parc des Princes stadium in Paris on Saturday night.\nThe win is also a record-extending 14th UCL title for Real Madrid who last won it in 2018 — also against Liverpool.\nLiverpool dominated the first half and went close through Sadio Mane and Mohamed Salah, but Thibaut Courtois, Real Madrid goalkeeper, repelled the relentless attack, brilliantly diverting Mane’s fierce shot from close range onto the post in the pick of the bunch.\nReal Madrid, who have not lost to Liverpool in their last six meetings, made it seven with astute defending to claim their 14th UCL title.\nCarlo Ancelotti, Real Madrid coach, also became the manager with the highest number of UCL titles, following his fourth title and second as Real Madrid coach."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Elon Musk’s Starlink receives approval to provide internet service in Nigeria and Mozambique",
    "summarized_story": "On Friday, Tesla CEO Elon Musk announced on Twitter that Starlink, the satellite internet service launched by SpaceX, his space exploration company, has been approved in Nigeria and Mozambique.\nThis licensing follows a visit to Nigeria by the company’s team in May last year to discuss the possibility of obtaining a licence.\n“The company received two licenses, which include the International Gateway license and Internet Service Provider (ISP) license, and will be trading as Starlink Internet Services Nigeria Ltd.\nStarlink approved by Nigeria 🇳🇬 & Mozambique 🇲🇿https://t.co/Q1VvqVmJ2i — Elon Musk (@elonmusk) May 27, 2022Starlink is a low latency broadband internet system created to meet the needs of consumers in rural areas with low internet penetration across the globe.\nStarlink enters a Nigerian Internet service provider space that is dominated by telcos like MTN and Airtel, as well as individual ISPs such as Spectranet, SMILE and others."
  },
  {
    "headline": "Kenya’s digital products for PwDs",
    "summarized_story": "AdvertisementThis weekend, I’m also following my advice and billing you.\nKenya’s digital products for people with disabilitiesAccording to a report, approximately 40% of Africa’s population is disabled, including 10-15% of school-age children.\nThis means that people with disabilities, and older people who are largely disconnected from most e-government services and business-owned digital platforms, will be connected, supported, and empowered by digital products to increase their digital inclusion.\nAlso, public and private sector digital products and services (like websites and mobile applications) will be more accessible and usable by all Kenyan citizens.\nThis is similar to EnableMe Kenya, an online platform, aimed at providing community-oriented technological support and increasing digital inclusion for people with disabilities."
  },
  {
    "headline": "Dear healthtech startups, Jumia is coming for your bread!",
    "summarized_story": "It also represents a more formidable competitor for existing healthcare startups.\nThis makes it imperative that healthtech startups build solutions for this purpose.\nIn a chat with Techpoint Africa, he said, “Jumia can potentially build out its healthtech play through more partnerships to facilitate diagnostics.\nHealthtech startups, for example, can provide faster and more efficient services by partnering with Jumia.\nDespite being boosted by the COVID-19 pandemic, healthtech startups are still a long way from meeting Africa’s healthcare needs."
  },
  {
    "headline": "Reclaiming stolen African artefacts",
    "summarized_story": "Also, a Nigerian, Chidi Nwaubani, launched the “Looty” project to reclaim African artefacts stolen by European colonists.\nThe project will create 3D images of these artefacts, sell them as non-fungible tokens (NFTs), and use the proceeds to support young African artists.\nThis is because some of us mistake mental health for a mental illness, which it is not.\nMental health is more than just the absence of a mental disorder.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with mental disorders."
  },
  {
    "headline": "How to Transition into Tech in 1 Year",
    "summarized_story": "This piece answers some of your questions about pursuing a career in tech and how to transition.\nA sizeable number of people that transition to tech do so by leveraging their previously acquired skills—though these skills are mostly no-code or non-technical.\nOn a final note:It is very much possible to transition into tech within one year.\nIn the meantime, let’s circle back to where we began:A quick guide on How to Transition into Tech in 1 Year?\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Get a foreign bank account and card in minutes on Geegpay by Raenest",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:The world is now fully digital.\nWith Geegpay, African talents can create USD, GBP, and EUR virtual bank accounts for faster payments for their work.\nThey can automate their employer billing through our smart invoicing, and build their credit score while spending with Geegpay virtual card.\nAfter your identity verification, you can then request a virtual bank accountAnd that’s itGeegpay PageIdentity verification and request for a virtual bank account are instant!\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Buhari warns against tenure elongation",
    "summarized_story": "President Buhari also noted that attempts at tenure elongation by some leaders reverses the gains of democracy and good governance in Africa, and serves as recipe for volatility and violence.\nPresident Buhari advised leaders to consider strengthening democratic structures and cultures by adhering to the constitution.\nRead also: Buhari, African leaders meet on security in Malabo“Mr.\nWe must shun all calls for tenure elongation beyond the provisions of our respective constitutions,’’ the President told the African leaders.\nAccording to President Buhari, calls for tenure elongation, undoubtedly, only contribute to heating up the political climate and serves as catalyst for crises and political instability."
  },
  {
    "headline": "ASUP calls off strike, directs members to resume Monday",
    "summarized_story": "The Academic Staff Union of Polytechnics (ASUP) has called off its two-week strike and directed its members to resume work on Monday, May 30, 2022.\nThe union disclosed that the federal government has met four of its demands, hence the decision to resume work, and give the government more time to meet its remaining demands.\nPolytechnic lecturers commenced a two-week warning strike on the 16th of May to protest what it termed the lethargic attitude of the government towards fulfilling some aspects of the memorandum of action (MoA) signed with the union 2021.\nThe union’s National publicity secretary, Abdullahi Yalwa, in a statement on Saturday said, “The 2 weeks definite strike of the Union will be rounding off on the 29th of May, 2022 as agreed by the emergency meeting of the National Executive Council.\nConsequently, the Union is requesting members to resume duties effective 30th of May, 2022 while hoping that the government will take advantage of the window to address the 5 outstanding items."
  },
  {
    "headline": "2023: Zoning not part of conditions for Nigeria’s presidency – Falae",
    "summarized_story": "The Former Minister of Finance, Olu Falae has faulted the calls that the presidency should be zoned to a particular region, saying there is no provision for zoning in the Nigerian Constitution.\nFalae, while speaking on the contentious issue of zoning, said it was not part of the conditions for Nigeria’s presidency.\n“Politicians should stop deceiving the people by putting zoning in party constitution, where it is not valid.\nNigerian Constitution supercedes party’s constitution.\nZoning is not part of the conditions for Nigeria’s presidency."
  },
  {
    "headline": "Ethiopia Jasin Haji, Dessie Adchiniau Win Male, Female 8th Okpekpe 10Km Road Race – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIt was a day of glory for athletes from Ethiopia as they emerged Winners of Male and Female Categories of the 8th Okpekpe International 10Km Road Race, 2022 Edition, leaving the Second and Third positions for their Kenyan counterparts.\nEthiopians Jasin Haji (male) and Dessie Adchiniau (female ) ran 29.\n*We are looking at domesticating different sports in the state and Okpekpe is in our plan for camping and training of long distance runners.\nOkowa lauded the people of Okpekpe for supporting the Championship by coming out emasse during the race, just as he called for sponsorship across the country for road race Championship in Nigeria.\nIt would be recall that the Okpekpe International 10Km Road Race was last held in 2019 as advent of Corona Virus halted 2020 and 2021 Editions."
  },
  {
    "headline": "Edo Poly, NIMASA, Port of Antwerp partner on capacity building for dockworkers, seafarers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Chairman of the Greg Ogbeifun Institute of Maritime Technology (GOMIT) at the Edo State Polytechnic, Usen, Engr.\nOgbeifun made the submission during an official visit to the Director-General, Nigerian Maritime Administration and Safety Agency (NIMASA), Dr. Bashir Jamoh and the agency’s management.\nHe was accompanied on the visit by some representatives of the Port of Antwerp, and officials of the Edo State Polytechnic Usen, where GOMIT is domiciled.\nGOMIT is a newly established professional training institute at the Edo State Polytechnic aimed at building capacity in the maritime industry and grooming youths for careers in seafaring and transport management.\nDirector-General, (NIMASA), Dr. Jamoh emphasized the agency’s commitment to the pursuit of capacity domestication, in a bid to save Nigeria’s scarce foreign exchange."
  },
  {
    "headline": "Obaseki eulogizes late Dr. Akele, hails support for reforms in healthcare system – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has eulogized late Dr. Mrs. Clara Akele, hailing her contributions to the development of the state’s health sector while she was alive.\nI think that as Christians, we should take solace given the fact that the person we are here to mourn her transition is a person who lived a good life.\n“She is somebody who lived a good life that was meaningful, not just her immediate family but many members of the society.\n“We thank God for her life; we thank God for her service to humanity.\nWe have every reason to celebrate her life and not be sad about her passage."
  },
  {
    "headline": "Enageed Resource Initiates Free Healthcare, ICT Training for Host Community in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – As part of its Corporate Social Responsibility (CSR) to host communities, Enageed Resource Limited, a Sahara Group Company, has initiated free healthcare, ICT training for the people of Ajoki, in Ovia North East local government area of Edo State.\nThe firm also engaged local contractors in the area on how to improve production, facilitate development, personal financing, and business registration.\nHe also stated that Enageed developed this initiative with the objective to improve the capacity of local community contractors and ensure their businesses continue to grow.\n“To ensure community contractors have the right skills for an increasingly digital and globalized world, the ICT session which is a key component of this training would bridge that gap.\nIn his goodwill message, the Secretary General of Ajoki Community, Scott Omesan, thanked Sahara Group for coming up with the initiative to foster better relationship between it and the host Community."
  },
  {
    "headline": "BREAKING: Atiku Abubakar wins PDP presidential ticket",
    "summarized_story": "Alhaji Atiku Abubakar, former vice-president, has clinched the presidential ticket of the Peoples Democratic Party (PDP) for the 2023 general election.\nAtiku polled 371 votes at the election which held at MKO Abiola Stadium in Abuja on Saturday.\nGovernor Nyesom Wike of Rivers State trailed with 237 Votes, while former Senate President Bukola Saraki garnered 70 votes to come third."
  },
  {
    "headline": "Victor Umeh loses APGA senatorial primary",
    "summarized_story": "Former national chairman of the All Progressives Grand Alliance (APGA), Chief Victor Umeh, has lost the party’s senatorial ticket for Anambra Central.\nUmeh lost to Dozie Nwankwo, member representing Anaocha/Dunukofia/Njikoka in the federal house of representatives.\nIn 2019, Umeh won the APGA primary, but lost the seat to Ekwunife.\nElizabeth Nwokeocha, the returning officer while announcing the primary results, said Nwankwo won with 162 votes against Umeh who had 151 votes.\nNwankwo, in his acceptance speech, thanked the APGA delegates in Anambra central for their support and promised to make them proud in the general election."
  },
  {
    "headline": "PDP Primary: Atiku’s supporters begin celebration as ex-VP takes early lead",
    "summarized_story": "OBINNA EZUGWUSupporters of former vice president, Alhaji Atiku Abubakar have begun to celebrate at the MKO Abiola Stadium, venue of the PDP presidential primary.\nThe former vice president, who was the party’s candidate in 2019, is looking poised to take the ticket again, as sorting of votes continue.\nAtiku is so far maintaining a healthy lead against Nyesom Wike, Rivers State governor who appears destined for second place.\nBukola Saraki, former senate president appears to be coming third from the results being announced.\nRecall that earlier, Aminu Tambuwal, Sokoto State governor, stepped down for Atiku as the north sought a consensus to beat Wike."
  },
  {
    "headline": "Real Madrid beat Liverpool to win Champions League",
    "summarized_story": "Real Madrid, Spanish giants, have beaten English side, Liverpool by one goal to win the 2021/22 edition of UEFA Champions League.\nA 59th minute strike by Vinícius Junior was all it took to hand the Spanish side the trophy for the 14th time in Paris.\nBut Carlo Ancelotti’s men have mostly their Belgian goalkeeper, Thibaut Courtois who put up a man of the match display to thank for their success over a determined Liverpool side."
  },
  {
    "headline": "ASUP suspends strike, asks members to resume work on Monday",
    "summarized_story": "The Academic Staff Union of Polytechnics (ASUP), has directed its members to resume work on Monday May 30, 2022.\nThe directive follows the expiration of its two-week warning strike which it had embarked on to press home its demands from the federal government.\nAccording to union, the decision to resume work was to give the federal government more time to meet the remaining five demands.\nWithin the period of the action, the government commenced the payment of arrears of the new minimum wage in all affected Federal Polytechnics.\nOthers include: continued delay in the appointment of substantive Rectors for Federal Polytechnics in Mubi, Offa, and Kaduna and resolution of issues with members in Colleges of Agriculture."
  },
  {
    "headline": "Tinubu congratulates Atiku, says PDP's bad record will dog him",
    "summarized_story": "National Leader of All Progressives Congress and frontline presidential aspirant, Asiwaju Bola Ahmed Tinubu has congratulated former Vice President Atiku Abubakar for emerging as the flag bearer of the opposition Peoples Democratic Party.\n“I welcome the victory of Alhaji Atiku Abubakar as the candidate of the Peoples Democratic Party in the just concluded primary.\nI have known the former Vice President as a formidable politician and a patriot who believes in the unity and progress of our dear country.\n“ As we move further into the election season, I charge the PDP presidential candidate and all political actors across Party lines that we should make this election season one that is devoid of bitterness, rancour and strife.\nElection season should be a festival of ideas that will uplift our country and improve the living condition of all our people."
  },
  {
    "headline": "I will unify Nigeria disunited by Buhari-led APC govt",
    "summarized_story": "The Peoples Democratic Party (PDP) Presidential candidate in the forthcoming 2023 presidential election, Atiku Abubakar has pledged to unify Nigeria plunged into disunity by the President Muhammadu Buhari-led APC government.\nAtiku was declared winner of the PDP Presidential primary election late Saturday night after polling 371 votes to defeat 11 other aspirants.\n“We are making another history, a history we believe will bring about fundamental changes in governance and political processes.\n“We have witnessed another one of the freest elections to be conducted by our great party, today marks another milestone in the process of consolidating our democratic gains,” he said.\n“I pledge to deal with insecurity and economic challenges caused by the APC government,” he said, adding that the PDP brought about economic prosperity in Nigeria and that the APC came to destroy it."
  },
  {
    "headline": "2023 Presidency: ‘You’ll be my opponent by God’s grace’, Tinubu congratulates Atiku",
    "summarized_story": "National Leader of All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, has congratulated former Vice President Atiku Abubakar for emerging as the flag bearer of the opposition Peoples Democratic Party (PDP) for the 2023 general elections.\nAtiku secured the highest votes at the primary election conducted at the Moshood Abiola Stadium in Abuja on Saturday.\n“I welcome the victory of Alhaji Atiku Abubakar as the candidate of the Peoples Democratic Party in the just concluded primary.\nI have known the former Vice President as a formidable politician and a patriot who believes in the unity and progress of our dear country.\nElection season should be a festival of ideas that will uplift our country and improve the living condition of all our people."
  },
  {
    "headline": "BREAKING: Atiku Wins PDP Presidential Primaries",
    "summarized_story": "Atiku Abubakar, Nigeria’s former vice-president, has emerged as the flagbearer of the Peoples Democratic Party [PDP] for the 2023 presidential election.\nMr Atiku defeated his closest rival, the Rivers state governor, Nyesome Wike who polled 237 votes.\nAtiku emerged victorious after polling 371 votes.\nBelow are the results from the Primaries;Atiku Abubakar – 371Nyesom Wike – 237 votesBukola Saraki – 70 votesAnyim Pius – 14 votesBala Mohammed – 20 votesEmmanuel Udom – 38 votesSam Ohuabunwa – 1 voteOliver Teriela Diana – 1 voteVoid Votes – 12Earlier, the Sokoto state governor, Aminu Tambuwal had stepped down for the former VP.\nTwo candidates were disqualified by the David Mark-led screening committee while Former Governor of Anambra State, Mr. Peter Obi opted out of the race and resigned from the party, leaving 14 contenders."
  },
  {
    "headline": "Atiku Abubakar Emerges PDP Presidential Candidate For 2023 Election",
    "summarized_story": "Former Vice President Atiku Abubakar has been elected president of the Peoples Democratic Party, making him the party’s frontrunner in the race for the general elections in 2023.\nThe PDP held its presidential primary polls on Saturday at the Moshood Abiola Stadium in Abuja, despite the Independent National Electoral Commission’s decision to extend the primaries (INEC).\nAminu Tambuwal, the governor of Sokoto state and a fellow presidential candidate, had previously withdrawn from the contest.\nMr Tambuwal asked delegates to vote for the former vice president, putting him ahead of his major rival Nyesom Wike.\nThe former vice president had tried five times unsuccessfully to become Nigeria’s president, starting in 1992 when he ran under the Social Democratic Party."
  },
  {
    "headline": "BREAKING: Tambuwal Steps Down, Endorses Atiku As PDP Presidential Candidate",
    "summarized_story": "Aminu Tambuwal, the governor of Sokoto and a presidential candidate for the Peoples Democratic Party, has resigned from the campaign.\nHe also asked his supporters among the delegates to vote for Atiku Abubakar, Nigeria’s former president.\nAt the PDP national conference in Abuja, Tambuwal addressed just before the election began.\nI urge my supporters to vote for Atiku Abubakar,” he said.\nDetails later…"
  },
  {
    "headline": "Breaking: Atiku stops Wike, Bala, Anyim, others, emerges PDP 2023 presidential candidate",
    "summarized_story": "Former Vice President, Atiku Abubakar, has emerged as the Peoples Democratic Party (PDP) Presidential candidate for the 2023 election.\nAtiku was the party’s presidential candidate in the 2019 general election.\nOut of the 774 delegates expected across all local governments in the 36 states and Federal Capital Territory (FCT), Abuja, only 767 delegates were accredited.\nAtiku, also known as Waziri Adamawa emerged after a keenly contested primary held at MKO Abiola Stadium, Abuja on Saturday.\nAtiku polled 371 votes while Rivers State Governor, Nyesom Wike polled 237 votes to place second."
  },
  {
    "headline": "Breaking: Real Madrid humble Liverpool, win 14th UEFA Champions League",
    "summarized_story": "Real Madrid have just beat Liverpool to win 2021/22 UEFA Champions League.\nA lone strike by Vinicious Junior in the 59th minute sealed the victory for Real Madrid who now won Champions League a record 14 times.\nAnd just six days after Manchester City’s comeback against Aston Villa robbed them of the Premier League title, Liverpool were pipped again.\nAfter chasing an unprecedented quadruple for so long, Liverpool end up with ‘just’ two domestic Cups – and both of those won on penalties after goalless draws.\nBut even here, they never ran of gas and they never ran out of conviction either."
  },
  {
    "headline": "Breaking: Tambuwal steps down from PDP Presidential race, backs Atiku",
    "summarized_story": "Sokoto State governor and Chairman, People’s Democratic Party (PDP) Governors Forum, Aminu Waziri Tambuwal, has withdrawn from the 2023 presidential race for former Vice President, Atiku Abubakar.\nTambuwal who stated this at the ongoing National Convention at Moshood Abiola Stadium in Abuja, urged all his delegates to in National interest vote former Vice President, Atiku Abubakar.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "FBNInsurance Shareholders Approve 74 Kobo Dividend",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSSHAREHOLDERS of FBNInsurance Limited has approved a full year dividend of 74 kobo per ordinary share for the year end 2021.\nSpeaking at the Annual General Meeting, Mr. Val Ojumah, the Managing Director/Chief Executive Officer of FBNInsurance Limited, stated that FBNInsurance financial performance in 2021 demonstrates the company’s strong footing despite the challenging operating environment in 2021.\nThe dividend declared for year 2021 is a 6% increase from 70k that was declared in 2020.\nIt is worthy to note that FBNInsurance Limited has consistently paid dividend to its shareholders in the last eight years.\nFBNInsurance is also a member of the Sanlam Group, a leading diversified, pan-African financial services group."
  },
  {
    "headline": "FCMB Offers Up to N30m Auto Loan to Make Vehicle Ownership Easy",
    "summarized_story": "The FCMB auto loan supports acquiring brand new and pre-owned vehicles (popularly known as “Tokunbo”), with N500,000 as the minimum loan amount that a customer can access for a repayment duration of up to 5 years.\nNigerians can now finance their dream vehicle with an auto loan from FCMB at a low-interest rate with monthly or yearly payment options depending on their income.\nWe, therefore, urge the populace, including, but not limited to salaried individuals, to take advantage of this opportunity to fulfil their vehicle ownership dream”.\nFCMB Auto Loan empowers qualified Nigerians to part-finance the purchase of brand-new and pre-owned vehicles while spreading the repayment between one and five years.\nHowever, vehicle ownership in the country has been declining because of increased prices."
  },
  {
    "headline": "Excess Crude Account, $35.377m as of 25th May 2022 – FG",
    "summarized_story": "602bn in AprilBY ONU OKORIEFederal Government has revealed that the balance in the Nigeria’s Excess Crude Account as of 25th May 2022 stands at $35.377 million.\nThe communiqué indicated that the Gross Revenue available from the Value Added Tax (VAT) for April 2022 was N166.522 billion.\nThe distribution is as follows; Federal Government got N24.978 billion, the States received N83.261 billion, Local Government Councils got N58.283 billion.\nAccording to the communique, Gross Statutory Revenue of N461.189 billion, from which the Federal Government was allocated the sum of N217.412 billion, States got N110.275 billion, LGCs got N85.017, Derivation (13% Mineral Revenue) got N48.485 billion.\nThe communiqué also revealed that Petroleum Profit Tax (PPT), Oil and Excise Duty increased marginally, while Oil and Gas Royalties, Import Duty, Companies Income Tax (CIT) and Value Added Tax (VAT) all recorded significant decreases."
  },
  {
    "headline": "Atiku Emerges PDP’s 2023 Presidential Flagbearer",
    "summarized_story": "﻿Former Vice President Atiku Abubakar has been elected as the Peoples Democratic Party’s flagbearer for the 2023 presidential election.\nHe was also the PDP’s candidate in the last election in 2019, which he lost to President Muhammadu Buhari.\nTo win the PDP’s 2023 ticket, Atiku had to beat the likes of Rivers State Governor Nyesom Wike, Akwa Ibom Governor, Udom Emmanuel and former Senate President, Bukola Saraki.\nBefore voting commenced on Friday at the primary election in Abuja, Sokoto State Governor Aminu Tambuwal stepped down for Atiku, a move that strengthened the Adamawa politician’s bid for the ticket.\nSigns that Atiku would emerge as the flagbearer surfaced after Adamawa State Governor Umaru Fintiri revealed that Mohammed Hayatu-Deen had stepped down for the former Vice President."
  },
  {
    "headline": "Real Madrid Beat Liverpool To Win 2021/2022 Champions League",
    "summarized_story": "Instead Real have a fifth Champions League in nine seasons to go with their Spanish title, as Carlo Ancelotti becomes the first coach to win European club football’s greatest prize for a fourth time.\nAncelotti was also in charge of Real when they won the 2014 final having also triumphed with AC Milan in 2003 and in 2007, the latter victory coming against Liverpool.\nThe Frenchman prodded home after the ball broke back to him inside the area but the offside flag was raised.\nThe decision to disallow the goal was upheld after a lengthy VAR check, despite Fabinho deflecting Valverde’s touch through to Benzema.\nCourtois was superb, flying to his right to keep out a Salah curler before two saves in quick succession late on."
  },
  {
    "headline": "PDP Presidential Primary: Tambuwal Steps Down For Atiku",
    "summarized_story": "Governor Aminu Tabuwal of Sokoto State has stepped down for former Vice President Atiku Abubakar in the Peoples Democratic Party (PDP) presidential primary race.\nHe made the move on Saturday during the 2022 PDP National Convention holding at the Moshood Abiola Stadium in Abuja, saying it was after consultations.\nWhile the former managing director of the now-defunct FSB International Bank did not state he was supporting another aspirant, the Adamawa State governor Ahmadu Fintiri said Hayatu-Deen stepped down for Atiku.\n“Hayatu-Deen has stepped down for him (Atiku),” Mr Fintiri told Channels Television on the sidelines of the party’s convention.\nHe has instructed his delegates to vote for Atiku.”"
  },
  {
    "headline": "Police Confirm 31 Dead In Rivers Church Stampede",
    "summarized_story": "At least 31 persons have died in a stampede at a programme organised by a Pentecostal church, Kings Assembly, in Port Harcourt, the Rivers State capital.\nChannels Television gathered that the stampede occurred at the Polo Club in Port Harcourt.\nThe tragedy occurred when a large crowd of persons attempted to push through a small entrance.\nREAD ALSO: One Killed As Youths Clash In BauchiIt was gathered that guests began arriving the Polo Club as early as 6:30am for the event slated for 9am, but met the gate locked.\nA similar incident in December 2020 also claimed some lives when a crowd gathered for a Christmas palliative organized by an online sales platform in Port Harcourt."
  },
  {
    "headline": "I Will Restore Unity, Bring Sense Of Belonging To All Nigerians – Atiku",
    "summarized_story": "The Peoples Democratic Party (PDP) presidential candidate Atiku Abubakar has pledged to unify the country following his victory in the party’s primary poll.\n“The reason I feel that unity is important is because APC has disunited Nigerians completely,” the PDP chieftain added.\n“I will work to restore unity and bring a sense of belonging to all Nigerians.”The Adamawa-born politician accused the ruling All Progressives Congress (APC) of mismanaging the country but promised to fix the economy and tackle Nigeria’s security challenges.\n“The PDP made Nigeria one of the most prosperous countries in Africa,” Atiku said.\nEarlier in the day, Governor Aminu Tambuwal of Sokoto State had withdrawn from the race, asking his supporters to back Atiku."
  },
  {
    "headline": "Zamfara APC elects Former Governor Yari, Others as Candidates -",
    "summarized_story": "Former governor Abdulaziz Yari, Senator Kabiru Marafa and Senator Sahabi Ya’u have emerged Senatorial Candidates of the All Progressive Congress in the Three Senatorial Zones of Zamfara StateEx- Governor Yari will contest the Senatorial seat for the APC in Zamfara West, while Senator Kabiru Marafa will contest for the Central zone and Senator Sahabi Ya’u goes for Zamfara North Senatorial Zone respectivelyThe three Candidates emerged through Concensus at the Senatorial primary election held SaturdayAbdul’azeez Yari was Zamfara State Governor between 2011-2019, While Senator Kabiru Marafa represented Zamfara Central Senatorial Zone at the red Chamber between 2011-2019Senator Sahabi Ya’u is vying for the Zamfara North Senatorial seat for the fourth timeHe served as Senator between 2007-2011, 2019- 2023 and is now contesting for another four years termThe election was monitored by Officials of the Independent National Electoral Commission, Security agencies, National and State Officials of the APCGovernor Bello Matawalle and the State Chairman of the APC Tukur Danfulani commend the delegates for their Maturity and unity in partyThey Further assures of their Commitment to ensure the party’s Victory in the forthcoming Elections.\nThe issue of sharing of Political offices had been a matter of controversy within the ruling All Progressives Congress following the defection of State Governor, Bello Matawalle to the Party.\nThe recent settling of the rift between the former Governor, Abbdulaziz Yari, Senator Kabiru Marafa and their supporters according to observers was responsible for the rapproachment leading to their emergence as Senatorial candidates under the All Progressives Congress.\nThe rift had threatened to make the 2023 election’s outcome like the 2019 elections in the State where all the Candidates of the All Progressives Congress in the State were disqualified for the Candidates of the Peoples Democratic Party leading to the emergence of Governor Bello Matawalle and Others as elected public officials in the State."
  },
  {
    "headline": "Breaking: Tambuwal withdraws, declares support for Atiku -",
    "summarized_story": "Governor of Sokoto State, Aminu Tambuwal, has withdrawn his participation from the PDP presidential race.\nThe former speaker of the House of Representatives, however, declared his support for the candidacy of Atiku Abubakar.\nHe stated this while addressing delegates and party members at the Moshood Abiola Stadium, Abuja, venue of the presidential primary."
  },
  {
    "headline": "Bandits kill new groom, abduct pregnant wife, four others -",
    "summarized_story": "Bandits have killed a newly married groom and abducted his pregnant wife in Jere town, Kagarko Local Government Area of Kaduna State.\nThe bandits also abducted four members of the family of a former commissioner of Poverty Alleviation in Kaduna State, Abdulrahman Ibrahim Jere.\nThe bandits, who stormed the community on motorcycles moved from house-to-house until they located the home of Jere who it was gathered may be their main target.\nAlthough, the former Commissioner was not at home when the bandits visited his home, they however abducted his wife, a baby girl, his younger sister and his wife’s sister.\nA resident of the community told Journalists the bandits also attacked the home of a newly married couple and attempted to abduct the bride but the groom resisted and while dragging his wife with the bandits, they shot him dead."
  },
  {
    "headline": "Ambode's deputy, Adebule wins Lagos West Senatorial ticket",
    "summarized_story": "Former Deputy Governor of Lagos, Idiat Adebule has won the All Progressives Congress Senatorial primary election in the state.\nAdebule defeated her opponents, Musiliu Obanikoro and Kayode Opeifa to emerge winner of the primary election which held on Saturday.\nDeclaring the results, Chairman of the Lagos West Senatorial primary Committee, Barrister Emeka Okafor said Adebule polled 424 voteswhile Musiliu Obanikoro had 119 votes, Kayode Opeifa had 4 votes while 10 votes were declared invalid.\nTotal number of accredited delegates is 557.\nChairman of the election committee described exercise as peaceful."
  },
  {
    "headline": "BREAKING: Atiku Abubakar Emerges PDP Presidential Candidate for Nigeria’s 2023 Election",
    "summarized_story": "Former Vice President of Nigeria Atiku Abubakar has emerged the presidential candidate of the People’s Democratic Party with 371 votes.\nAnother top contender, Governor of Sokoto State Aminu Tambuwal stepped down and urged his supporters to vote for Atiku.\nThis pushed the 2019 flagbearer of the party past his closest challenger, Rivers State Governor Nyesom Wike who scored 237 votes.\nDetails later…Demola Ojo"
  },
  {
    "headline": "More Than 30 People, Including Children, Killed in Stampede at Church Event in Port Harcourt",
    "summarized_story": "More than 30 people were killed and others injured when a stampede broke out at a church event in the southeastern Nigerian city of Port Harcourt on Saturday, according to police and security officials.\n“During the process of distributing the gift items, there was a stampede due to overcrowding,” he said.\n“Casualties were children mostly.”The drive had not yet started when the stampede took place, said Grace Woyengikuro Iringe-Koko, a spokeswoman for the state police.\nWoyengikuro Iringe-Koko said the crowd forced their way into the venue, despite the fact that the gate was closed, resulting in the deadly charge.\nThirty-one people have been confirmed dead, Woyengikuro Iringe-Koko said."
  },
  {
    "headline": "The Issue Of Zoning Heavily Weighs In On The Conscience Of Nigerian Delegates – Dickson Iroegbu",
    "summarized_story": "Director, New Media, Pius Anyim Campaign Organization, Dickson Iroegbu, weigh in on the subject of money, playing a central role and being a major obstacle for his candidate in securing votes from delegates in the PDP Primaries scheduled for today."
  },
  {
    "headline": "Trump: US Should Fund Safe Schools Before Ukraine",
    "summarized_story": "Former President Donald Trump has called on US lawmakers to prioritise funding for school security over sending military aid to Ukraine.\nSpeaking at a pro-gun conference, Mr Trump questioned how the US “has $40 billion to send to Ukraine” but cannot ensure security in schools.\nThe intervention comes days after 21 people died in a Texas school shooting.\n“Before we nation-build the rest of the world, we should be building safe schools for our own children in our own nation,” Mr Trump said in Friday’s speech, drawing loud applause.\n“Congress should vote immediately to take back every penny of unused Covid relief money,” Mr Trump went on."
  },
  {
    "headline": "Peter Obi Is Opportunistic, Labour Party Conflicts with His Ideology – Reno Omokri",
    "summarized_story": "Reno Omokri, former spokesman to Ex-President Goodluck Jonathan and a staunch Peoples Democratic Party member, reacts to presidential aspirant Peter Obi dumping the PDP for the Labour Party a few days before party primaries."
  }
]