[
  {
    "headline": "Again, Buhari meets Jonathan over Mali",
    "summarized_story": "), on Thursday, received the Head of the ECOWAS Mediation Team, former President Goodluck Jonathan, at the Presidential Villa, Abuja.\nJonathan seized the opportunity of the visit to brief Buhari about next Sunday’s special meeting of ECOWAS, slated to hold in Ghana, which is meant to deliberate on the political situation in Mali.\nHours earlier, the President had pledged Nigeria’s support to Mali as its transitional leadership works to restore the country to civilian rule.\nNigeria will work within ECOWAS limitations to assist Mali.\nBut we will make as much sacrifice as we can for Mali, within ECOWAS requirements,” he said."
  },
  {
    "headline": "Plateau drug dealer shot dead, accomplices flee, hemp, drugs recovered",
    "summarized_story": "THE Economic and Financial Crimes Commission said it secured 2,220 convictions across all its commands in 2021.\nThe figure, which reportedly emerged from a review of the commission’s performance last year, showed that the Lagos command recorded the highest convictions of 481.\nThe command is closely followed by the Ibadan command with 324 convictions, while the Port Harcourt zonal command had 230.\nIt said, “Before 2021, the highest record of conviction by the commission was secured in 2019 with 1,280 convictions.\nThe 2,220 record of 2021 is a 127.5 per cent improvement over the 2019 record."
  },
  {
    "headline": "EFCC flaunts 98.5% prosecution success rate in 2021",
    "summarized_story": "THE Economic and Financial Crimes Commission said it secured 2,220 convictions across all its commands in 2021.\nThis, it said, represented a 98.49 per cent success rate in prosecution as it lost only 34 cases during the period.\nA statement on Thursday, by the commission’s spokesman, Wilson Uwujaren, titled, ‘EFCC secures 2,220 convictions in 2021,’ said the convictions were the highest ever recorded by the anti-graft agency since inception.\nIt said, “Before 2021, the highest record of conviction by the commission was secured in 2019 with 1,280 convictions.\nThe 2,220 record of 2021 is a 127.5 per cent improvement over the 2019 record."
  },
  {
    "headline": "We’re yet to begin sale of 2022 UTME/DE application forms – JAMB",
    "summarized_story": "By Joseph ErunkeABUJA–THE Joint Admissions and Matriculation Board, JAMB,has denied reports in some quarters that it had begun sale of 2022 Unified Tertiary Matriculation Examinations,UTME and Direct Entry,DE application documents.\n“It should be noted that the commencement of the sale of the Board’s application documents in any given year has never been shrouded in mystery rather it is always a well-publicised undertaking in the print media as well as online and electronic platforms.\n“Although, the Board has concluded all arrangements to commence the sale of the 2022 UTME/DE Application Documents in due course but it is yet to fix any date for its commencement.\n“The general public is, therefore, by this notice urged to be mindful of speculators who are in the habit of second-guessing the Board’s on certain procedural issues with the aim of defrauding hapless candidates.\n“The Board wishes to inform the general public that they would be sufficiently informed of the commencement of the sale of EPINs once approval has been granted by relevant authorities."
  },
  {
    "headline": "Novena varsity commences law degree programme",
    "summarized_story": "The Vice-Chancellor of Novena University Ogume, Delta State, Professor Godwin Chukwuenweniwe Nduka has said the institution’s College of Law has commenced the LL.B Degree programme.\nHE added that the degree covered Civil Law, Common Law, Customary Law, Religious Law and Mixed Legal Systems.\nSpeaking in Asaba, Professor Nduka said the LL.B Degree programme is expected to contribute to the enrichment and enhancement of legal education and practice in Nigeria.\nIn 2018, the College of Law was granted approval by the National Universities Commission, NUC, to commence the LL.B Degree programme.\nIn 2021 the institution was granted approval to commence the LL.B Degree programme."
  },
  {
    "headline": "Och’Idoma Stool: Senator Moro urges contending parties to sheathe swords",
    "summarized_story": "Senator MoroBy Peter Duru, MAKURDIThe lawmaker representing Benue South District, Senator Abba Moro has appealed to the parties contesting the emergence of Pastor John Elaigwu as the new Och’Idoma to sheathe their swords and observe restraint.\nSenator Moro, whose constituents are the Idoma people of the state, cautioned that the continuous denigration of the election process and its eventual outcome would only further diminish the institution of the stool of the Och’Idoma.\n“The reality on ground is that Dr. John Elaigwu won.\n“After all, he is the governor of the whole of Benue State.\n“Besides, we must accept that Dr. John Elaigwu is, himself, a bonafide son of the land."
  },
  {
    "headline": "Why Buhari don’t want to pardon Nnamdi Kanu – Ogbonna",
    "summarized_story": "In his words: “President Muhammadu Buhari has power to pardon Mazi Nnamdi Kanu.\n“But does the President see Nnamdi Kanu as one who has shown remorse to change his ways if pardoned?\n“Buahri’s fear may be that if Nnamdi Kanu is pardoned, he will return to the trenches to continue the agitation.\n“It would have been a different thing if Kanu were agitating for Biafra under a body that is Biafra.\n“It is a bad strategy that their leader, Nnamdi Kanu was talking as if there was no other person in Igbo land except him."
  },
  {
    "headline": "Ekiti Guber: UP threatens INEC with legal action for rejecting notice of primary",
    "summarized_story": "By Chris Ochayi, ABUJAThe National Working Committee, NWC, of United Patriots, UP, has described as sad and unfortunate the decision by the Independent National Electoral Commission, INEC, to reject its notice of party primary for the Ekiti State Governorship election scheduled for June 18.\nNational Chairman of UP, Barrister Chukwudi Ezeobika, in a statement issued Thursday in Abuja, warned on the dire consequences of INEC’s decision to undermine the integrity of judiciary.\nEzeobika accused INEC of ignoring the subsistence of the unanimous judgment of the Court of Appeal delivered by its President on the 10th of August, 2020.\nHe said the judgment affirmed the corporate existence of United Patriots as a duly registered political party in Nigeria.\n“We, as a responsible political party, shall explore all legal options open and available to us to ensure that our rights under the Nigerian Constitution are fully protected and that such abuse and affront on the judiciary by INEC is curtailed.”Vanguard News Nigeria"
  },
  {
    "headline": "Buhari not like Sani Abacha – Femi Adesina",
    "summarized_story": "Presidential media adviser, Femi Adesina, has stated that President Muhammadu Buhari is not like the late Head of State, Sani Abacha.\nIn an article on Thursday, “PMB and The Futurologists”, the spokesman mocked the then military ruler for refusing to leave Aso Rock because he was scared of prophetic visions and predictions.\nAdesina disclosed that a cleric told Buhari to send emissaries to him with bags of money, so he could pray and stave off the tragedy.\n“That was what the marabouts did to Sani Abacha, that he remained holed in Aso Rock.\n“At another time, he had been confirmed to visit Lagos, to commission projects, including the Marwa Gardens, in Alausa area of Ikeja.”“Visiting Lagos would have been good for Abacha himself."
  },
  {
    "headline": "At 79, rigours of office telling on me – President Buhari",
    "summarized_story": "As the last lap of President Muhammadu Buhari’s administration draws close, the President has for the first time admitted that old age is telling on him.\nBuhari said he was not in a position to complain because he asked for the job of presiding over the affairs of the country.\n“I think that COVID-19 came to my rescue in the sense that the number of people that need to see you can’t see you.\nThe age is telling on me, working now for 6, 7, 8 hours per day in the office is no joke.\nBuhari simply said the APC should learn from the fate that befell the PDP in the 2015 general elections."
  },
  {
    "headline": "Buhari will retire to tend his cattle with glory – Femi Adesina",
    "summarized_story": "Adesina disclosed that Buhari would retire to Daura, Katsina State, where he would tend to his cattle.\nIn his weekly article entitled: “PMB AND THE FUTUROLOGISTS,” Adesina said Buhari will retire in a blaze of glory.\nAdesina noted that Nigerians should not allow what he termed “so-called prophet” to hoodwink them into the contrary.\nThe article reads partly: “In about 17 months, President Buhari would land safely, as God wills.\nHe would finish his tenure in a blaze of glory, and retire to Daura to tend his cattle."
  },
  {
    "headline": "Gov Ortom pays 21m allowance to Benue law school students",
    "summarized_story": "Benue State Governor, Samuel Ortom, has released for payment the sum of N21 million allowance for the 2020/2021 Benue Law School Students.\nBarrister Martin Mue confirmed the payment on Thursday, January 6, 2022, while speaking on Day Break Benue, a Benue Television Breakfast show.\nHe said law students of 2020/2021 who attended the school have been paid their allowances.\nHe also applauded the payment process describing it as transparent, efficient and without stress.\nHe urged the governor to sustain his support for students of the State who are undergoing studies in different academic disciplines across the country and beyond."
  },
  {
    "headline": "Plateau govt to sell filling stations hoarding petrol",
    "summarized_story": "Plateau State Government has threatened to seal filling stations hoarding petrol.\nProf. Danladi Atu, Secretary to the State Government, gave the warning in a statement on Thursday.\nAtu announced that the Committee on Road Traffic Administration and Vehicle Inspectors have been tasked to monitor filling stations.\n“The task force has been directed to seal off any station found hoarding the product and auction same”, the SSG said.\nIn November, the Nigerian National Petroleum Corporation (NNPC) allayed fears of an increase in pump price and advised against panic buying."
  },
  {
    "headline": "Fed Govt says it pays N10b to 2 million Nigerians monthly",
    "summarized_story": "Fed Govt says it pays N10b to 2 million Nigerians monthlyThe Federal Government on Thursday said it pays two million households N5000 monthly, which amounts to N10billion.\nIt was also revealed that over 10 million Nigerian pupils benefit from its school feeding programme.\nNational Coordinator of the National Social Investment Programme (NSIP), Dr Umar Bindr, stated these during the NSIP annual strategic review meeting.\nSpeaking on its efforts to lift 100 million Nigerians out of poverty, Bindr said: “We have more than 10 million applicants nationwide.\n- Advertisement -“We have successfully managed to onboard two million, and we are consistently paying these households N5000 per month."
  },
  {
    "headline": "Down College: coroner’s inquest on Oromoni for Jan 15",
    "summarized_story": "A coroner’s inquest into the death of 12-year-old Sylvester Oromoni (Junior), a deceased pupil of Dowen College, Lekki, Lagos, will begin on January 15.\nBut Dowen College had dismissed the claim, saying the boy sustained injuries while playing football with his colleagues.\n- Advertisement -The Lagos State Government on Wednesday cleared the five accused Dowen College students of complicity in the death of Oromoni (Jnr).\nThe letter was titled, ‘Re: Request for Inquest into the tragic death of Sylvester Oromoni killed at Dowen College, Lekki.\nLagos State’."
  },
  {
    "headline": "Lagos set to reopen Dowen College",
    "summarized_story": "The Lagos State Ministry of Education has said that Dowen College Lekki would be re-opened only after the school fixes all lapses identified by the ministry officials during a visit following Sylvester Oromoni’s death last month.\nThe ministry also said all boarding schools in Lagos will be re-validated after resumption from the second term mid-term break ending February 18.\nThis is coming after the Director of Public Prosecution absolved five pupils accused of complicity in Oromoni’s death on Wednesday.\nThe statement also noted that the ministry was reviewing the operational guidelines of boarding schools and the requirement for establishing them.\nIt is also overhauling the “departments and agencies responsible for monitoring and inspection of schools.”"
  },
  {
    "headline": "JUST IN: Navy intercepts N10b worth of cocaine",
    "summarized_story": "JUST IN: Navy intercepts N10b worth of cocaineThe Nigerian Navy on Thursday said it intercepted N10billion worth of cocaine last October 9 and 28.\nCommander, Nigerian Navy Ship (NNS) BEECROFT, Rear Admiral Bashir Mohammed, also said the 261 bags of cannabis worth over N100 million in the local market were intercepted during the Yuletide.\n- Advertisement -“However, in the course of our patrols, the Navy intercepted and arrested some drug traffickers, smugglers of contraband items and petroleum products within the maritime environment.\n“Pertinently, five crew were arrested on board the large boat and investigation revealed that they were all foreigners.\n“The cocaine seized in both occasions were worth over N10 billion in the local market."
  },
  {
    "headline": "BREAKING: Gunmen bomb police division, free detainees in Imo",
    "summarized_story": "Gunmen on Thursday bombed the Ideato South Local Government Area Police Headquarters in Dikenafai, Imo State.\nThe explosives destroyed the administrative office, the Divisional Police Officer’s office, and the reception desk.\n- Advertisement -Chairman of Ideato South LGA Interim Management Committee, Pastor Bede Ikeaka, expressed shock at the incident.\nImo Police Command spokesman, Michael Abattam, a Chief Superintendent of Police, said he was yet to be briefed.\nIt was learnt that some of the detainees have been caught by a local vigilante group."
  },
  {
    "headline": "UPDATED: Gunmen bomb Imo police station, set free detainees",
    "summarized_story": "From Stanley Uzoaru, OwerriSome heavily armed gunmen on Thursday evening attacked the Dikenafai police station in Idea to south Local Government Area of Imo State and set free some detained suspects.\nA source who disclosed the incident to Daily Sun revealed that the gunmen invaded the station in large numbers and threw into the premises of the station an IED which caused part of it to go up in flames.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nHowever, the State Police Public Relation Officer, Michael Abattam when contacted by our correspondent confirmed the incident but said the gunmen where repelled by the police.\n“Yes I’m aware of the incident ,our men repelled it before it could happen, they were engaged in gun duel and most of them escaped into the bush with bullet wounds.” Abattam said."
  },
  {
    "headline": "Age telling on me for working long hours – Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has admitted that the long hours he spent working is telling on him because of his age, saying that he looks forward to the end of his tenure in 17 months to join his colleagues in retirement.\n“The age is telling on me, working now for 6,7,8 hours a day flight in the office is no joke.\n“I have given my best and I hope after I leave Nigerians will reflect and at least not show appreciation.\nBuhari said: “I don’t like to accept that joining our party will check our insistence on accountability.\nSo, the party, because I’m concerned about my party, the party, in all constituents they will know their positions, coming up."
  },
  {
    "headline": "Gunmen attack Imo Police Division, release detainees",
    "summarized_story": "From George Onyejiuwa, OwerriGunmen in the early hours of Thursday attacked the Police Divisional headquarters at Ideato South council area located at Dikenafai and allegedly released suspected criminals detained at the station.\nDaily Sun learnt that the gunmen deployed locally made explosive devices to attack the Ideato South Divisional Police Headquarters which did extensive damage to the administrative office , the office of the DCP and the reception desk.\nHowever, it was learnt the released suspects who were re- arrested by members of the community vigilante who were within the scene.\nHowever , efforts made to reach the spokesman of the command Michael Abbattam for confirmation proved abortive as he refused to pick his calls ,nor did he return the calls."
  },
  {
    "headline": "Oromoni’s death: LASG gives conditions for reopening of Dowen College",
    "summarized_story": "By Gabriel DikeLess than 24 hours after the legal advice from the Director Public Prosecutions (DPP), Lagos State Government on Thursday gave the management of Dowen College, Lekki, Lagos, conditions to be met before the school will be reopened for academic activities.\nThe conditions were stated in a statement signed by the Assistant Director, Public Affairs, Lagos State Ministry of Education, Mr. Ganiu Lawal, titled: Dowen College: Aftermath Of DPP advice, ministry of education directs school to fix administrative lapses, set to review boarding school guidelines.\nShe concluded that Dowen College management has been mandated to fix school governance gaps and other regulatory issues, adding ‘’we will consider the possibility of reopening the school only when all issues surrounding school administration have been appropriately attended to,’’ Adefisayo said.\nLagos State Government in December 3, 2021 ordered the closure of Dowen College, indefinitely following the death of Sylvester Oromoni, who was beaten to death by fellow students.\nThe education commissioner, Mrs. Adefisayo announced the closure after she met with the school management and staff."
  },
  {
    "headline": "Customs generates N2.240 trillion revenue in 2021",
    "summarized_story": "By Steve Agbota, LagosThe Nigeria Customs Service (NCS) has said it generated the sum of N2.240 trillion in revenue for the year 2021, just as the amount generated was over the target of N1,678 trillion set for the year.\nCommenting on this feat in a statement released by the National Public Relations Officer, Joseph Attah, quoted the Comptroller General of Customs, Col Hameed Ibrahim Ali (retd), saying that the revenue generated was over the sum of N1,562 trillion generated in 2020 representing 43.45 per cent increase.\nHowever, Ali described the revenue generated as a result of the resolute pursuit of what is right and willingness to adapt to changes brought about by global health challenges occasioned by COVID-19.\n‘Other landmark achievements in 2021 that are capable of boosting national security and economy are the installation of three (3) brand new scanners in Apapa, Tin-Can Island and Onne Ports.\nE-customs take-off process now at the stage of the final signing of the agreement,’ he added."
  },
  {
    "headline": "Budget Highlights: FG Introduces 6% Tax on Digital Services, Non-resident Companies",
    "summarized_story": "The Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, disclosed this during the public presentation and breakdown of the 2022 budget held in Abuja.\nAhmed had in November last year disclosed that the sum of N178.09 billion had been approved for the national population census in the 2022 budget.\n“The 2022 Budget was prepared taking into consideration the policies/strategies contained in the 2022–2024 Medium Term Expenditure Framework and Fiscal Strategy Paper (MTEF/FSP).\nThe 2022 federal government budget is the first key public sector contribution to implementing the plan,” she explained.\nEarly passage of the 2022 Budget for implementation from January 1, will significantly contribute towards achieving government macro-fiscal and sectoral objectives."
  },
  {
    "headline": "2023: Identity of My Successor Remains a Secret, Says Buhari",
    "summarized_story": "On the electoral bill, Buhari maintained that primaries must not be direct, but rather, people should be given options to make their choice.\nBuhari said, “Nigerians know that I don’t interfere with the judiciary.\n“Nigerians should remind President Buhari that people evolve and societies evolve.\nTherefore, being trapped in a time capsule of the past about state police is not an option Nigerians are willing to accept from him.\n“The more Buhari promises to lift Nigerians out of poverty, the poorer Nigerians become."
  },
  {
    "headline": "Ararume Loses Out as Buhari Appoints 9-member NNPC Board",
    "summarized_story": "The president also appointed four Executive Commissioners for the Nigerian Upstream Petroleum Regulatory Commission (NUPRC).\nOther members of the Board are: Dr. Tajudeen Umar (North East), Mrs Lami O. Ahmed (North Central), Mallam Mohammed Lawal (North West), Engr.\nHenry Obih (South East), Barrister Constance Harry Marshal (South South), and Chief Pius Akinyelure(South West).\nThey are to join the Board Chairman, Executive Director, Downstream Systems, Storage and Retailing Infrastructure, the CEO, and Executive Director, Finance and Accounts, who had earlier been appointed by President Buhari.\nNo reason was given for the removal of Ararume from the board."
  },
  {
    "headline": "CBN Deputy Governor, Ahmad Chairs NCX’s Re-constituted Board",
    "summarized_story": "•Sere-Ejembi, Yusuf appointed directorsJames Emejo in Abuja andNume Ekeghe in LagosCentral Bank of Nigeria (CBN) Deputy Governor, Mrs. Aisha Ahmad has been appointed the chairman of the re-constituted Board of the Nigeria Commodity Exchange (NCX) Plc.\nIn addition, three new directors were appointed for the exchange, out of which Ahmad was one of them.\nOthers included CBN Director, Development Finance Department, Mr. Yusuf Yila and Dr. Angela Sere-Ejembi.\nAhmad, was subsequently appointed Chairman of the board at the inaugural board meeting which held same day.\nEmefiele, who chairs the SteerCo, said the federal government’s premier commodity exchange had not been able to catalyse agricultural production due to structural and idiosyncratic challenges."
  },
  {
    "headline": "The Recording Academy Postpones Grammy Awards",
    "summarized_story": "By Vanessa ObiohaFollowing the spike in COVID-19 cases in the United States, the Recording Academy has postponed the 64th Grammy awards earlier scheduled for January 31.\nAccording to a statement by the Recording Academy, “After careful consideration and analysis with city and state officials, health and safety experts, the artist community and our many partners, the Recording Academy® and CBS have postponed the 64th Annual GRAMMY Awards® Show.\nGiven the uncertainty surrounding the Omicron variant, holding the show on January 31 simply contains too many risks.”This year’s Grammy nominations have Nigerian artists nominated in the Global Music Album and Global Music Performance categories.\nBurna Boy and Wizkid who won a Grammy last year are among this year’s nominees.\nHis son Made however shares the spotlight with him in the Global Music Album category."
  },
  {
    "headline": "President Buhari Gives Incoherent Answers, Strays Away From Many Questions During Latest Television Interview As Concern Over Dementia Grows",
    "summarized_story": "Instead, the President strayed in different directions from important questions asked to the shock of many Nigerians.\n“So, if those cattle were taken away from them, they normally become wild because that is the only thing they know.\nIn the South, there is problem of land ownership, very serious one based on families, the ruling classes and so on.\nThat was the last I had from them.”Indeed, all through the duration of his latest television interview, President Buhari failed to address key questions asked, instead shooting off the mark on several occasions and showing strong signs of a man battling with chronic dementia.\nTop sources in the Presidency had told SaharaReporters that Buhari was not only incoherent but spoke for only a short time."
  },
  {
    "headline": "President Buhari Gives Incoherent Answers, Strays Away From Many Questions During Latest Television Interview As Concern Over Dementia Grows",
    "summarized_story": "Instead, the President strayed in different directions from important questions asked to the shock of many Nigerians.\n“So, if those cattle were taken away from them, they normally become wild because that is the only thing they know.\nIn the South, there is problem of land ownership, very serious one based on families, the ruling classes and so on.\nThat was the last I had from them.”Indeed, all through the duration of his latest television interview, President Buhari failed to address key questions asked, instead shooting off the mark on several occasions and showing strong signs of a man battling with chronic dementia.\nTop sources in the Presidency had told SaharaReporters that Buhari was not only incoherent but spoke for only a short time."
  },
  {
    "headline": "National Assembly Earmarks N5billion To Build Library, N1billion For Constitution Review Despite Nigeria’s Dwindling Revenue",
    "summarized_story": "In the figures released, N100billion was earmarked for zonal interventions, while National Assembly liabilities to gulp N10billion.\nIn the data, the National Assembly library building will consume N5billion and the lawmakers are billed to spend N1billion on Constitution Review.\nOther projected expenses are National Assembly e-library with N300 million and National Assembly dashboard with N139 million.\nRecall that SaharaReporters had published last week how President Muhammadu Buhari lamented some worrisome changes made by the National Assembly on 2022 Budget he signed into law.\nThe President had said, \"It is in this regard that I must express my reservations about many of the changes that the national assembly has made to the 2022 executive budget proposal."
  },
  {
    "headline": "National Assembly Earmarks N5billion To Build Library, N1billion For Constitution Review Despite Nigeria’s Dwindling Revenue",
    "summarized_story": "In the figures released, N100billion was earmarked for zonal interventions, while National Assembly liabilities to gulp N10billion.\nIn the data, the National Assembly library building will consume N5billion and the lawmakers are billed to spend N1billion on Constitution Review.\nOther projected expenses are National Assembly e-library with N300 million and National Assembly dashboard with N139 million.\nRecall that SaharaReporters had published last week how President Muhammadu Buhari lamented some worrisome changes made by the National Assembly on 2022 Budget he signed into law.\nThe President had said, \"It is in this regard that I must express my reservations about many of the changes that the national assembly has made to the 2022 executive budget proposal."
  },
  {
    "headline": "Labour Union Warns Anti-graft Agency, ICPC, Not To Take Sides In Investigating Senior Civil Servants",
    "summarized_story": "The Congress of Senior Civil Servants of Nigeria has urged the Independent Corrupt Practices and other related offences Commission not to take sides in its investigation over alleged financial fraud against some senior civil servants.\nThe anti-graft agency had invited some senior civil servants, who are executive members of Association of Senior Civil Servants of Nigeria, over alleged financial fraud in the association.\n“The CSCSN is a body of concerned members of the Association of Senior Civil Servants of Nigeria, an affiliate of the Trade Union Congress of Nigeria.\n“We are also aware that you have invited top officials of ASCSN for investigations concerning the corruption in the association.\nWe are also aware that many present and past union officials have been invited for questioning by your agency and other different anti graft agencies."
  },
  {
    "headline": "WHO: Omicron killing people like other COVID variants — it shouldn’t be classified as mild",
    "summarized_story": "The World Health Organisation (WHO) says the Omicron COVID variant should not be classified as mild.\nAdvertisementTedros Ghebreyesus, WHO director-general, said this on Thursday at a media briefing on COVID.\n“Just like previous variants, Omicron is hospitalising people and it is killing people,” he said.\nAdvertisement“In fact, the tsunami of cases is so huge and quick, that it is overwhelming health systems around the world.\n“Booster after booster in a small number of countries will not end a pandemic while billions remain completely unprotected."
  },
  {
    "headline": "WHO: Omicron killing people like other COVID variants — it shouldn’t be classified as mild",
    "summarized_story": "The World Health Organisation (WHO) says the Omicron COVID variant should not be classified as mild.\nAdvertisementTedros Ghebreyesus, WHO director-general, said this on Thursday at a media briefing on COVID.\n“Just like previous variants, Omicron is hospitalising people and it is killing people,” he said.\nAdvertisement“In fact, the tsunami of cases is so huge and quick, that it is overwhelming health systems around the world.\n“Booster after booster in a small number of countries will not end a pandemic while billions remain completely unprotected."
  },
  {
    "headline": "Buhari: Age is telling on me — working for six hours a day is no joke",
    "summarized_story": "President Muhammadu Buhari says he looks forward to finishing his tenure as “age is telling” on him.\nWhen asked about how he feels after clocking 79 recently, Buhari said being president is hard work and that he looks forward to when his tenure would end in 2023.\n“The age is telling on me, working now for six, seven to eight hours per day in the office is no joke — there are questions of executive council, memos from as many states as possible to be considered virtually every week.\nReally, it’s a lot of hard work, but as I’ve said, I asked for it and I cannot complain.\n“I have been a governor, I have been a minister, and I’m in my second term as president."
  },
  {
    "headline": "Buhari: Age is telling on me — working for six hours a day is no joke",
    "summarized_story": "President Muhammadu Buhari says he looks forward to finishing his tenure as “age is telling” on him.\nWhen asked about how he feels after clocking 79 recently, Buhari said being president is hard work and that he looks forward to when his tenure would end in 2023.\n“The age is telling on me, working now for six, seven to eight hours per day in the office is no joke — there are questions of executive council, memos from as many states as possible to be considered virtually every week.\nReally, it’s a lot of hard work, but as I’ve said, I asked for it and I cannot complain.\n“I have been a governor, I have been a minister, and I’m in my second term as president."
  },
  {
    "headline": "Buhari: I'm not expecting appreciation after 2023 -- but I hope Nigerians say I did my best",
    "summarized_story": "President Muhammadu Buhari says he’s not “expecting any appreciation” from Nigerians after the end of his administration.\nSo, I’ve gone through all the systems, and what else can I do for this country?” Buhari said.\n“I’ve given my best, and I hope after I leave, Nigerians will reflect.\nI’m not expecting any appreciation but what I’m expecting is for Nigerians to say this man has done his best.\nThat’s what I’m expecting from Nigerians.”"
  },
  {
    "headline": "How mobile phones and digital tools have helped Togo tackle COVID-19",
    "summarized_story": "Globally, the COVID-19 disease has infected more than 290 million people, claimed well over 5 million lives, and plunged millions into extreme poverty.\nMore than 1.6 million Togolese registered for the monetary support through their mobile phones, according to data on the Novissi website.\n“People should not have to choose between death by COVID-19 or by hunger,” President Faure Gnassingbe said on the Novissi programme.\nIn a month, more than 50,000 people registered for COVID-19 vaccination through Togo’s digital platforms.\nAuthorities launched a mobile and web-based service that allows Togolese to register for vaccination using their phones."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Nigerian fintech predictions for 2022: Dollar exchanges go the way of Bitcoin",
    "summarized_story": "That’s how significant the exponential growth in the fintech space has been in recent years, and it creates room for bullishness in the space.\nFor instance, Nigerian fintech funding in 2021, $800 million, was 120% higher than funding in the last three years combined.\nPhoto by Kglavin via Wikipedia CommonsIn 2021, Africa minted five unicorns, two of which were Nigerian fintech companies.\nIt’s unlikely that WhatsApp’s payment play would be good news to existing banks and fintech players.\nWhat do you think about predictions for the fintech space?"
  },
  {
    "headline": "Africa’s $4.9bn funding, crypto predictions for 2022, and mPharma’s $35m Series D",
    "summarized_story": "Fintech still rules: As usual, fintech startups received the lion share, going as high as 62% — $3 billion.\nCrypto price predictions for 2022Photo by CardMapr.nl on UnsplashThe crypto market in 2021 started on a very bullish note.\nBesides Bitcoin, 2021 had interesting tokens such as SHIBA INU that grew by 49,000,000%.\nInvesting $100 in the token in 2020 would have culminated into a whopping $53 million during its 2021 ATH.\nPer TechCrunch, the funding comprises $30 million equity funding and $5 million debt financing by Citibank."
  },
  {
    "headline": "Twitter’s second African office? Gahez’s pre-seed funding, FedaPay secures funding",
    "summarized_story": "Share this article:Hi there,Here’s what we’re discussing today:Twitter’s second African office?\nGahez’s pre-seed fundingFedaPay secures fundingTwitter’s second African officeAfter over six months of accessing Twitter using Virtual Private Networks (VPNs), Nigerians may soon access the social media platform freely.\nAdvertisementAccording to a source quoted by The Nation, Twitter’s hesitance to open an office in Nigeria last year stemmed from it not being part of its 2021 budget.\nThe first is that going by the report, Twitter is being coerced into opening an office in Nigeria.\nGahez raises $2 million in pre-seed fundingEgyptian eCommerce startup, Gahez, has raised $2 million in pre-seed funding."
  },
  {
    "headline": "Inside Mafab’s plan to become major Nigerian telco",
    "summarized_story": "After emerging as one of the two provisional winners of the 5G spectrum licence, Mafab Communications has set out plans to become a major Nigeria’s telecommunications operator, according to a proposed document seen by BusinessDay.\nTo achieve the targets, it has itemised three strategies – first of which is to secure the licence for 5G.\nHowever, deploying the 5G network without pre-existing 3G or 4G infrastructure will be a tall order for the company.\nWhile 2017 was a big year for MTN and Airtel, it wasn’t for Globacom and 9Mobile, which continued to see declines.\nThe company also holds an operational interest in the banking, banking, insurance, hospitality, and telecom spheres of the Nigerian economy."
  },
  {
    "headline": "How Lagos backlogs led to highest daily COVID-19 cases",
    "summarized_story": "Adetifa Ifedayo, NCDC director-general, in an exclusive interview with BusinessDay, said over 2,000 of those cases accrued from unreported cases in Lagos between December 13 and 19.\nThe centre collates COVID-19 cases based on reports from states across the country daily, and cases reported daily are often an aggregate of positive results of PCR and rapid diagnostic tests done the previous day.\nBut sometimes and maybe slightly more frequently, some states report backlogs of cases that failed to come in before NCDC’s typical reporting.\nThe record-shattering surge of December 22 shifted worries over undercounting of COVID-19 cases to the question of whether the NCDC data now reflect the true scale of coronavirus incidence.\nEven in places that test more, considering that a lot of COVID-19 cases are asymptomatic, they have far more cases than any country is able to actually report,” the director-general said."
  },
  {
    "headline": "Buhari kicks against restructuring, state police",
    "summarized_story": "President Muhammadu Buhari has kicked against agitations for restructuring of the country and state police as a solution to Nigeria’s woes, saying that the agitators are not clear on their demands.\nBuhari stated this during an exclusive pre-recorded interview with Channels Television at the presidential villa, Abuja, aired on Wednesday.\nThe President noted that advocates of restructuring were not clear if they wanted new states to be created.\nWhen asked if there was any chance of a political solution to the issue, the President said such can happen if Kanu had behaved himself.\n“There is a possibility of political solution if people behave themselves, but you cannot do all that; let him account for what he was doing”."
  },
  {
    "headline": "Kids Club Charity Donates Educational Materials To Schools In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In its resolved to helping humanity particularly the downtrodden and vulnerable in the society, one of the leading Non Governmental Organisations (NGO) in the country, Kids Club Charity, recently distributed “back to school materials” to schools across Edo state.\nSome of the ‘back to school items’ distributed by the NGO include School Uniforms; Sandals; books, biros and other educational materials.\nThe Kids Club Charity which is the brainchild of Dr. Awele Eucharia Ilobah, according to her is an NGO that is committed to catering for the less privileged and vulnerable children in the society.\nIn their separate remarks, the beneficiary schools and children expressed appreciations and commended the humanitarian gesture of Kids Club Charity for reaching out to them.\nAt the end of the NGO 2021 annual humanitarian services, about 20 schools were reached."
  },
  {
    "headline": "DOCUMENTING EDO STATE GOVERNMENTS – Nigerian Observer",
    "summarized_story": "As a journalist, writer and social scientist I have interacted with hundreds of politicians, public office seekers, academics, civil servants, clerics, critics and scores of other individuals in Edo State.\nFollowing this development, I resolved to start documenting all Edo State Governments in power since 2007 for public consumption beginning with Comrade Adams Aliu Oshiomhole whose administration oversaw the affairs of Edo State from 2007-2016.\nMaterials used for government documentation are from on/offline sources, most especially reports carried in the state-owned Nigerian Observer published by Bendel Newspapers Company Limited with headquarters in Benin City, capital of Edo State.\nGovernor Godwin Nogheghase Obaseki assumed office as Edo State Governor on November 12, 2016.\nRather, the works were put together by a team of researchers who believe passionately in providing resources material with which Edo citizens and other interested persons can get relevant facts about Edo State Government."
  },
  {
    "headline": "With 40MW power plant operational, investors scramble for space in Benin Industrial Park – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… as Edo govt earmarks 100ha for first phase, assures incentives for investors… Ossiomo Power generation capacity now 95MWBENIN CITY – With the coming on stream of the 40MW Independent Power Plant (IPP) built by Ossiomo Power and dedicated to provide power to the Benin Industrial and Enterprise Park, investors are trooping in to harness the benefit of the 24-hour electricity and other benefits available at the mixed-purpose park.\nOssiomo Power had announced that its new 40MW plant became operational in December 29 and had already connected and powering Ologbo and Obayantor communities in Ikpoba Okha Local Government Area of the State.\nThe new plant increases the generation capacity of Ossiomo Power to 95MW, as a 55MW plant had been operational since 2020.\nManaging Director, Edo State Investment Promotion Office (ESIPO), Kelvin Uwaibi, in a chat with journalists, said the state government has earmarked 100 hectares for the first phase of the mixed-purpose Benin Industrial and Enterprise Park, which measures about 997-hectares.\nAccording to him, “We are being inundated by enquiries from investors and are ready for those who want to set up shop as quick as possible."
  },
  {
    "headline": "Obaseki advances on digital economy, to provide optic fibre connectivity across 18 LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured residents that his government will sustain ongoing reforms and programmes aimed at achieving digital economy in the state, promising to provide fibre optic connectivity to all Edo communities to enhance access to the internet and expand the state’s digital economy.\nObaseki, who spoke to journalists in Benin City, said his administration is committed to building physical and digital infrastructure, leveraging technology to drive sustainable growth and development in the state.\nHe stated, “Our operation Light Up Edo is in full gear with the street-lighting project being rolled out in Benin City, Ekpoma and Auchi.\n“As a government, we are recommitting ourselves to deepen growth across all sectors of the state and provide more opportunities for our people to realise their full potential.\nThese we will do by leveraging the innate abilities of our people and providing them with the tools and enablement to dominate and conquer their world.”..."
  },
  {
    "headline": "FirstBank’s focus on putting customers first continues to be a driving force – Adeduntan",
    "summarized_story": "FirstBank’s focus on putting the customers first continues to be a driving force as we keep supporting our customers in meeting their business needs.\nThe Central Bank of Nigeria (CBN) as the regulator of the banking industry continues to lead and drive development in the industry.\nDuring the peak of the lockdown, the Firstmonie network provided an alternative channel for the Bank’s customers to conduct transactions and meet their basic financial service needs, serving as quasi-physical touchpoint for the bank’s customers.\nBuilt an industry leading digital banking (electronic banking) business.\nAnd the confidence that our stakeholders including our customers repose in us is reflective in 10.3% y-t-d growth customers’ deposits."
  },
  {
    "headline": "2023: Southeast PDP leaders endorse Anyim’s presidential ambition",
    "summarized_story": "The Southeast zonal and state executives of the Peoples Democratic Party (PDP), including political leaders and elders from the zone, have endorsed the presidential aspiration of former Senate President, Anyim Pius Anyim.\n“I was also schooled to appreciate the value of social justice, equity and fairness as building blocks for social harmony and inclusion.\n“My records show effective and efficient management of the nation’s diversity on the basis of equity, justice, fairness and inclusiveness.\n“If it is not zoned to the South East, it will remain a burden on the conscience of the nation.\nOrji; Senator Enyinnaya Abaribe; Dr. Ali Odefa, PDP National Vice Chairman, Southeast; Iyom Josephine Anenih, Senator Obinna Ogba; Dr. Frank Nweke; Prof. Elochukwu Amucheazi; Nze Ozichukwu Chukwu; Senator Emma Nwaka; Senator Chuka Utazi, among others."
  },
  {
    "headline": "BUA Foods, Airtel lead gainers as stock market advances by 1.05%",
    "summarized_story": "Adebayo ObajemuTransactions on the floor of the Nigerian Exchange on Wednesday ended on a bullish side , fuelled by 10% gain in the share prices of Airtel Africa and BUA Foods respectively.\nThe All Share Index gained by 1.05% to close at 43,476.75 points from the previous close of 43,026.23 points.\nInvestors profited by N243 billion as Market Capitalisation grew by 1.05% to close at N23.427 trillion from the previous close of N23.184 trillion.\nThe Market Breadth closed on a positive note as 22 equities came up as gainers against 17 equities that plummeted in their share prices.\nOando and AIICO Insurance among other gainers also grew their share prices by 9.73% and 8.33% respectively."
  },
  {
    "headline": "First Bank names new executive directors",
    "summarized_story": "Adebayo ObajemuIn the midst of recent controversy around the bank over largest shareholders, the Board of Directors of FBN Holdings Plc, on Wednesday, made public the appointments of three executive directors for its commercial banking arm, First Bank Nigeria Limited.\nThe foremost bank named Olusegun Alebiosu as executive director, risk management and executive compliance officer, while Oluwatosin Adewuyi is named executive director, corporate banking.\nBefore his current position, Alebiosu was a group executive and the chief risk officer of the FirstBank Group, since 2016.\nHe has previously had a stint at the United Bank for Africa Plc, the defunct Omega Bank Plc, Peak Merchant Bank as well as Oceanic Bank Plc.\nMr Adewuyi was group executive, corporate banking at FirstBank, where he was responsible for the bank’s corporate banking business following the exit of the previous executive director."
  },
  {
    "headline": "Inter-states Travel App Debuts In Nigeria",
    "summarized_story": "An App-based carpooling platform for inter-states travel, CoolRide Services, has debuted in Nigeria.\nAccording to Omorogbe, CoolRide App is secure as everyone is profiled, and all payments are made with Bank details for security purposes.\n“It is very risky to travel out of town with someone you don’t know today.\n“CoolRide provides a safer and cheaper way to travel out of town.\nYou can also make a significant income by becoming a verified CoolRide driver with your personal car,” Omorogbe stated."
  },
  {
    "headline": "Obasanjo Condoles Makinde Over Soun Of Ogbomoso, Olubadan’s Death",
    "summarized_story": "Former President Olusegun Obasanjo, on Thursday, paid condolence visit to the Governor of Oyo State governor, ‘Seyi Makinde, over the demise of the Soun of Ogbomosoland and the Olubadan of Ibadanland, who died on December 12, 2021 and January 2, 2022 respectively.\nBut getting up on my feet, I thought I should pay condolence visit to Oyo State where, within a short period of time, you have lost two of your highest traditional rulers to death.\nADVERTISEMENT“So, I had to take it upon myself to pay condolence visit to the families of the late Olubadan and late Soun of Ogbomoso land.\nAnd I thought that it would be inappropriate for me to come to Ibadan, go to Ogbomoso and the governor is not visited.\nADVERTISEMENTHe said: “On behalf of the governor of Oyo State, we are receiving you to the state."
  },
  {
    "headline": "IYC Protests Sylvester Oromoni Jr’s Death, Threatens To Disrupt College Activities",
    "summarized_story": "Members of the Ijaw Youth Council (IYC), Lagos State chapter, on Thursday, staged a protest in front of Dowen College, Lekki Phase 1, Lagos, demanding justice for the death of 12-year-old Sylvester Oromoni Jr, who died from injuries he sustained from bullying by fellow students in the school.\nThe group also kicked against the exoneration of the 10 suspected staff and students for the alleged murder and negligence of the school by the Lagos State government.\nIt would be recalled that the State’s directorate of public prosecution at the ministry of justice had cleared the school, students and staff of complicity in the death of Oromoni Jr, stating that there was nothing linking the school and the suspects to the alleged crimes.\nThe group threatened to disrupt activities at the school if it reopens for normal activities next Monday as reported.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "IYC Protests Sylvester Oromoni Jr’s Death, Threatens To Disrupt College Activities",
    "summarized_story": "Members of the Ijaw Youth Council (IYC), Lagos State chapter, on Thursday, staged a protest in front of Dowen College, Lekki Phase 1, Lagos, demanding justice for the death of 12-year-old Sylvester Oromoni Jr, who died from injuries he sustained from bullying by fellow students in the school.\nThe group also kicked against the exoneration of the 10 suspected staff and students for the alleged murder and negligence of the school by the Lagos State government.\nIt would be recalled that the State’s directorate of public prosecution at the ministry of justice had cleared the school, students and staff of complicity in the death of Oromoni Jr, stating that there was nothing linking the school and the suspects to the alleged crimes.\nThe group threatened to disrupt activities at the school if it reopens for normal activities next Monday as reported.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Activist Condemns Clearance Of Suspects In Dowen College Student’s Death",
    "summarized_story": "Political activist, Comrade Timi Frank, has condemned the clearance of 10 suspects arrested in connection with the death of 12-year-old Sylvester Oromoni Jr.Oromoni Jr. until his sudden illness and death was a student of Dowen College in Lagos.\nHe called on all fathers and mothers in the country to rise up and demand justice for late Oromoni Jr and his grieving parents.\nADVERTISEMENTAccording to him, “it is Sylvester Oromoni Jr today.\n“Today, Oromoni Jr’s death has been added to the growing number of mysterious deaths.\nHe insisted that the death of Oromoni Jr would hunt the perpetrators and their collaborators for life should justice be compromised in this manner."
  },
  {
    "headline": "Group indicts NERC, begs Buhari to scrap it",
    "summarized_story": "A group, the All Electricity Consumers Protection Forum, said the displeasure of the President, Major General Muhammadu Buhari (retd.\n), with the performance of the power sector is an indictment on the Nigerian Electricity Regulatory Commission.\nThe group advised the president to scrap NERC, which is the power sector regulator, and move its responsibilities to the Federal Competition and Consumer Protection Commission.\nNAN reports that Buhari had in a televised interview on Wednesday said he was not happy with the state of electricity in Nigeria.\nHe said, “Our advice to the president is to scrap NERC for not living up to its responsibilities of regulating the industry."
  },
  {
    "headline": "Group indicts NERC, begs Buhari to scrap it",
    "summarized_story": "A group, the All Electricity Consumers Protection Forum, said the displeasure of the President, Major General Muhammadu Buhari (retd.\n), with the performance of the power sector is an indictment on the Nigerian Electricity Regulatory Commission.\nThe group advised the president to scrap NERC, which is the power sector regulator, and move its responsibilities to the Federal Competition and Consumer Protection Commission.\nNAN reports that Buhari had in a televised interview on Wednesday said he was not happy with the state of electricity in Nigeria.\nHe said, “Our advice to the president is to scrap NERC for not living up to its responsibilities of regulating the industry."
  },
  {
    "headline": "Unpaid arrears: Crisis brews as National Assembly workers begin strike, picketing on Monday",
    "summarized_story": "Workers at the National Assembly under the auspices of the Parliamentary Staff Association of Nigeria have resolved to begin industrial action accompanied with picketing of the federal parliament on Monday.\nThe workers are protesting against non-payment of a backlog of unpaid salaries and allowances, among others.\nThe National Assembly and National Assembly Service Commission chapters of PASAN held a joint congress in Abuja on Thursday where it was resolved that the workers should down tools, about one week before the lawmakers are to return from recess.\nMembers of the Senate and the House of Representatives had embarked on Christmas and New Year break.\n“In addition to the MOU, congress also demands implementation of 50 per cent balance of CONLESS, immediate release of year 2022 training template for staff, (and) evidence of provision of gratuity for retiring staff."
  },
  {
    "headline": "Unpaid arrears: Crisis brews as National Assembly workers begin strike, picketing on Monday",
    "summarized_story": "Workers at the National Assembly under the auspices of the Parliamentary Staff Association of Nigeria have resolved to begin industrial action accompanied with picketing of the federal parliament on Monday.\nThe workers are protesting against non-payment of a backlog of unpaid salaries and allowances, among others.\nThe National Assembly and National Assembly Service Commission chapters of PASAN held a joint congress in Abuja on Thursday where it was resolved that the workers should down tools, about one week before the lawmakers are to return from recess.\nMembers of the Senate and the House of Representatives had embarked on Christmas and New Year break.\n“In addition to the MOU, congress also demands implementation of 50 per cent balance of CONLESS, immediate release of year 2022 training template for staff, (and) evidence of provision of gratuity for retiring staff."
  },
  {
    "headline": "Jonathan hits Aso Rock again for Buhari (Photos)",
    "summarized_story": "Former President, Dr. Goodluck Jonathan has hit Aso Rock again, the second time in less than a month to visit President Muhammadu Buhari.\nJonathan visited The State House, Abuja on Thursday to brief Buhari on the political situation in Mali.\nThe former president is ECOWAS’ Special Envoy to Mali to try and salvage the political situation in the West African country.\nThe 2021 Malian coup d’état began on the night of 24 May 2021 when the Malian Army led by Vice President Assimi Goïta captured President Bah N’daw."
  },
  {
    "headline": "Mukhtar reacts to board’s invitation",
    "summarized_story": "Kannywood movie director, Aminu Umar Mukhtar, who was declared wanted by the Kano state film censorship board over his latest film ‘Makaranta’, said he remains unperturbed by the board’s invitation.\nThe executive director of the board, Na Abba Afakallah, had earlier said the filmmaker was declared wanted after he failed to honour the board’s invitation over the film.\n“My film is not about Kano or Hausa people alone, about 17 languages featured in the project.\n“My film is not only about sex education, it captures other things such as female genital mutilation (FGM).\nThe last scene in the trailer showed the students in a typical party setting, with male and female colleagues dancing together."
  },
  {
    "headline": "Oromoni: Lagos Yet To Decide On Reopening Of Dowen College",
    "summarized_story": "Oromoni: Lagos Yet To Decide On Reopening Of Dowen CollegeThe Lagos State Government has yet to make a decision on reopening Dowen College in Lekki, which was closed following the murder of Sylvester Oromoni, 12, who was allegedly manhandled by fellow students.\nThe state government had agreed to reopen the school under certain conditions, according to a statement attributed to the Ministry of Education on Thursday night.\n“Dear Colleagues,” said the statement, which was placed on the ministry’s social media channel where it communicates with its media partners.\nHowever, on Wednesday, the Lagos State Directorate of Public Prosecutions (DPP) released a report exonerating five students and the college’s management from any responsibility in Sylvester’s murder.\nThe deceased’s family, led by his father, Sylvester Oromoni, Snr, quickly condemned the story and urged President Muhammadu Buhari and others to guarantee that justice was served."
  },
  {
    "headline": "BREAKING: Gunmen Bomb Police Division, Free Detainees In Imo",
    "summarized_story": "Gunmen on Thursday bombed the Ideato South Local Government Area Police Headquarters in Dikenafai, Imo State, the Nation reports.\nThe explosives destroyed the administrative office, the Divisional Police Officer’s office, and the reception desk.\nChairman of Ideato South LGA Interim Management Committee, Pastor Bede Ikeaka, expressed shock at the incident.\nImo Police Command spokesman, Michael Abattam, a Chief Superintendent of Police, said he was yet to be briefed.\nIt was learnt that some of the detainees have been caught by a local vigilante group."
  },
  {
    "headline": "AFCON: Musa Rejoins Super Eagles, Names Nigerian Star More Dangerous Than Salah",
    "summarized_story": "Ahmed Musa, the captain of the Super Eagles, has returned to the squad ahead of the Africa Cup of Nations match against Egypt.\nMusa claimed that Villarreal winger Samuel Chukwueze is more dangerous than Liverpool’s Mohamed Salah in a press conference before the team’s departure to Cameroon on Thursday morning.\nThe Pharaohs should be concerned about Chukwueze’s threat, according to Musa, who added that the Super Eagles are more experienced now than they were in Egypt’s last edition of the competition.\nIn Egypt, we had only two players that had been in the AFCON, me and Kenneth Omeruo, and then we finished in the third position,” he said.\n“Definitely, I know everybody will be talking about Salah but if you look at our own side we have a lot of players they would be worried about."
  },
  {
    "headline": "AFCON 2021: All Five Players Who Have Withdrawn From Super Eagles’ Squad [Full List]",
    "summarized_story": "AFCON 2021: All Five Players Who Have Withdrawn From Super Eagles’ Squad [Full List]At least five players from Nigeria’s original 28-man roster for the 2021 Africa Cup of Nations have withdrawn.\nOdion Ighalo of Al Shabab is the latest player to withdraw due to contractual responsibilities with his Saudi Arabian club.\nPrior to it, after contracting COVID-19, Napoli’s hotshot Osimhen was left off the final list.\nDennis Emmanuel, a forward for Watford, was similarly excused when his club prevented him from leaving, saying the Nigeria Football Federation (NFF) had submitted his invitation letter late.\nTyrone Ebuehi and Semi Ajayi have returned to the squad, while Osimhen has been replaced by Henry Onyekuru, who was also in Egypt for the previous competition."
  },
  {
    "headline": "Gunmen Storm Rivers Police Station, Release Detainees",
    "summarized_story": "On Tuesday, the Rivers State Police Command stated that a cell break occurred in its division in the Okrika Local Government Area.\nSome shooters are claimed to have attacked the division and forced open the cell’s back door, from which all of the captives managed to flee.\nThe Commissioner of Police, Friday Eboka, has directed Deputy Commissioner in Charge of the State Criminal Investigation Department, Patrick Longe, to expedite the investigation into the cause of the cell break, according to a statement issued by the command’s Public Relations Officer, Grace Iringe-Koko, on Wednesday.\nThe CP ordered the DCP to ensure that all cops engaged in the incident were detained.\nLonge is also expected to ensure the capture of all fugitives, who will be held accountable to the full extent of the law."
  },
  {
    "headline": "Imo: Again, hoodlums bomb another Police station",
    "summarized_story": "Part of Ideato South Area Police station at Dikenafai was Thursday set ablaze by yet to be identified gunmen who came in large numbers.\nBlueprint learnt that the Administrative Office, that of the Divisional Police Officer (DPO), and the reception were touched during the attack which also witnessed the release of some of the detainees.\nUnfortunately for the escaping detainees, about three of them were caught by the local government vigilante who took them back to custody.\nCommenting, the Chairman, Interim Management Committee(IMC) of the LGA, Pastor Bede Ikeaka, said he was shocked at the incident.\nWhen asked to speak on the matter, the Imo Police Command’s spokesman, CSP Mike Abattam, said he had not been briefed."
  },
  {
    "headline": "Breaking: COVID-19 hits Manchester City hard ahead FA Cup clash *Pep Guardiola tests positive, 21 others affected",
    "summarized_story": "Manchester City have suffered a major Covid-19 outbreak with manager Pep Guardiola testing positive and 21 of their first-team bubble isolating.\nHowever, Friday night’s FA Cup third round tie at Swindon Town is set to go ahead as only seven players are affected, with the other 14 cases being staff members, including Guardiola.\nDetails loading…"
  },
  {
    "headline": "Miraculous! Veteran actress, Iyabo Oko, resurrects hours after doctor pronounced her dead",
    "summarized_story": "A veteran actress, Sidikat Odukanwi, popularly known as Iyabo Oko on Thursday resurrected hours after she was confirmed dead.\nHer daughter Bisi Aisha had on Wednesday evening revealed via her social media handle that Iyabo Oko passed on, aged 61.\nHowever, Aisha on Thursday morning said, “Wonderful being, she moved her hand after being confirmed dead three hours ago.\nGod, we will forever praise your holy name,” Aisha stated on Thursday morning.\nAisha also confirmed that Iyabo is now at the hospital receiving treatment."
  },
  {
    "headline": "2022 Budget Won’t Fail Because APC Leads National Assembly – Buhari",
    "summarized_story": "President Muhammadu Buhari has said that he is certain the 2022 budget will accomplish the purpose for which it was created.\nSpeaking exclusively to Channels Television on Wednesday, the president said he is confident that the budget will succeed because the National Assembly is led by trusted members of the All Progressives Congress (APC).\n“It’s APC party and the leadership; look at the Senate President, he was in the House of Reps for two or three terms before he went to the Senate.\nFollowing President Buhari’s assent to the 2022 budget, there were reports of friction between the presidency and the parliament.\nThe president had expressed strong reservations on the “worrisome changes” made by the National Assembly to the 2022 Executive Budget proposal."
  },
  {
    "headline": "950 Terrorists, 537 Bandits Killed In Seven Months – DHQ",
    "summarized_story": "The Defence Headquarters on Thursday said 950 terrorists including high-profile commanders and emirs between May 20, 2021, and January 6.\nIt also said in the period under review, a total of 537 bandits and other criminal elements, including two key bandits’ leaders in Zamfara State, namely Alhaji Auta and Kachalla Ruga, were neutralised.\nHe said Nigerian troops also rescued about 1,000 kidnapped civilians and recovered assorted weapons from the criminal elements.\n“Within the period under review, own troops operational activities resulted in the neutralisation of 950 terrorists including their high profile commanders and amirs.\nThe total of 537 armed bandits and other criminal elements were neutralised in action by own troops.”"
  },
  {
    "headline": "‘We Cannot Release Him,’ Buhari Says Nnamdi Kanu Should Defend Himself In Court",
    "summarized_story": "President Muhammadu Buhari has ruled out the option of pardoning the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nFor those who are saying that we should release him, no we cannot release him.\nApart from the trial of the IPOB leader, the President also spoke about a number of burning issues including security, economy, and politics, among others.\nSo, in that respect, we have done something,” President Buhari asserted.\nHe went on to defend his government’s decision to source loans from China, saying anyone willing to help Nigeria’s infrastructure was welcome."
  },
  {
    "headline": "I Will Sign Electoral Bill If NASS Includes Consensus Candidates, Indirect Primaries – Buhari",
    "summarized_story": "﻿President Muhammadu Buhari has stated his readiness to sign the Electoral Act Amendment Bill after the National Assembly makes the necessary adjustments.\nHe, however, said such changes must include the addition of consensus candidates, indirect primary options to the mode of selecting a candidate for an election, as against the initial direct mode as the only option to conduct primaries by political parties.\nWhile the lawmakers have yet to resume from recess or deliberate on the bill, President Buhari said it was wrong to force an option on the people.\n“Personally, I do not support direct primary because I want people to be given a choice,” the President stated.\nNot as a result of direct primary, it is as a result of opposition parties coming together and fighting the PDP."
  },
  {
    "headline": "Gunmen Raid Six Zamfara Communities, Kill Many",
    "summarized_story": "Gunmen have raided six communities in Zamfara State, killing an unspecified number of people including women and children and displacing many othersThe communities are Rafin Gero, Laho, Wanu, Barayar Zaki, Lallaho, Kurfar Danya and Dutsin dan ajiya in Anka and Bukkuyum Local Government Area of Zamfara StateZamfara State Commissioner for Information, Ibrahim Dosara confirmed the attacks to Channels Television via a telephone conversation on Thursday.\nThe commissioner said he is still expecting more reliable information to give a more accurate report on the incident.\nSurely the attack was carried on some communities,” he said.\nHowever, an indigene of the community Abdullahi Anka told Channels TV that most residents of these communities have fled the areas to Anka town for safety.\nHe said the bandits numbering about 300 were armed with dangerous weapons and rode on motorcycles to launch simultaneous attacks on the communities."
  },
  {
    "headline": "Buhari receives briefing from ex-President Jonathan over Mali crisis -",
    "summarized_story": "Former President Goodluck Jonathan has disclosed that a special meeting of ECOWAS will hold in Ghana, this Sunday, to deliberate on the political situation in Mali.\nHe made this known at a parley at State House, Abuja, Thursday when he met President Muhammadu as the Head of the ECOWAS Mediation Team.\nPresident Buhari repeated his earlier avowal that whatever Nigeria would do on the Mali situation would be done within the ambit of ECOWAS."
  },
  {
    "headline": "Ladoja breaks silence, says Lekan Balogun is next in line to Olubadan -",
    "summarized_story": "The Osi Olubadan of Ibadanland and former governor of Oyo State, Rashidi Ladoja, has described the controversy trailing succession to the throne of Olubadan is needless.\nEgbon Lekan Balogun is the most senior in our line and so he is the next in line to the throne.\n“For those asking, my ‘body and mouth language’ is that Egbon Lekan is my senior and he is next in line to the Olubadan stool.\nTwo weeks after we started the case, Egbon Balogun said he was no longer interested in the case.\nLadoja is the second most senior chief in the Civil Line that is to produce the next Olubadan of Ibadan, following the death of Oba Saliu Adetunji."
  },
  {
    "headline": "Olubadan: Obasanjo pays condolence visit to Oyo gov",
    "summarized_story": "A former Nigerian president, Olusegun Obasanjo has commiserated with Governor of Oyo state, Seyi Makinde over the death of the Olubadan, Oba Saliu Adetunji.\nHe prayed that the family of the deceased monarchs be consoled and the soul of the late traditional rulers be granted eternal rest.\nIn his remark, the Deputy Governor of Oyo state Rauf Olaniyan who represented the Governor of Oyo state appreciated the former president for his kind gesture, describing him as an elder statesman who has the interest of his people at heart.\nIt’s a tag all over your body, and that tag brought you down here even at your age, he said.\nOlusegun Obasanjo was accompanied by a former secretary to the Oyo state government, Olayiwola Olakojo, and a highly respected socialite, Otunba Oyewole Fasawe."
  },
  {
    "headline": "Video: Olubadan in Council announces Senator Lekan Balogun as next monarch -",
    "summarized_story": "Ten out out of the eleven Olubadan-in-Council members, Wednesday, endorsed the nomination of the Otun Olubadan, High Chief Lekan Balogun, as the next heir to the throne of Olubadan, as the Osi Olubadan, High Chief Rashidi Ladoja was absent.\nThe endorsement, followed the ratification by members of the Olubadan-in-Council, during a press conference, held at the ancient Mapo Hall, Ibadan."
  },
  {
    "headline": "Inebehe Effiong: EFCC Beginning to Operate Like SARS",
    "summarized_story": "INEBEHE EFFIONG discussed the many issues that have been thrown up over the Magodo Estate stand off and the reaction of the Attorney General of the Federation, Abubakar Malami, to the statement by southwest governors.\nHe also talked about a recent Supreme Court ruling, which declared that the Economic and Financial Crimes Commission could not hide under its establishment Act to usurp the functions of other law enforcement and prosecutorial agencies in the country."
  },
  {
    "headline": "Femi Falana Rejects Sylvester Oromoni’s Autopsy Report- Trending with Ojy Okpe",
    "summarized_story": "Human rights lawyer and senior advocate of Nigeria Femi Falana has kicked against the verdict of the Lagos Department of Public Prosecution on the case against Dowen College, in connection with the death of 12-year-old Sylvester Oromoni.\nIn a report released on Wednesday, the Department of Public Prosecution, stated that the police investigation and the two autopsies conducted on the body of the deceased 12-year-old student, failed to establish a prima facie case against the suspects in the alleged murder case.\nFemi Falana said the report was loaded with medical jargon that failed to address the allegation that the deceased was forced to drink a concoction and tortured for refusing to join an unlawful society.\nMeanwhile Southwest governors On Wednesday, condemned the alleged role played by the Minister of Justice and attorney general of the federation Abubakar Malami in the deployment of police officers to Magodo estate in a bid to enforce a supreme court verdict.\nThe governors’ comments came on the heels of a face-off between the Governor of Lagos State, Babajide Sanwo-Olu, and a chief superintendent of police, Abimbola Oyewole."
  },
  {
    "headline": "UK to Scrap Pre-Departure Covid Tests for Fully Vaccinated from Friday",
    "summarized_story": "They then have to take another test – which this time must be a PCR test – within the first two days after their arrival in the UK.\n‘I’ll feel unsafe on flights’John Wyndham, who is currently planning a third trip to the US for February, said that scrapping pre-departure tests will make him feel unsafe on flights.\nHe went to the US in December along with three colleagues, who paid £212 each for PCR testing.\nHowever, he said that the eliminating pre-departure testing will only save him around £30 per person and wasn’t worth the added worry about new variants.\n£800 savingHowever, holidaymaker David Hughes welcomed the scrapping of PCR tests before returning to the UK."
  },
  {
    "headline": "Kazakhstan Asks Russia for Help after Dozens Killed in Unrest",
    "summarized_story": "Dozens of protesters were killed in Kazakhstan in attacks on government buildings and at least a dozen officers died, including one who was found beheaded, authorities said Thursday.\nThere were attempts to storm buildings in Almaty overnight and “dozens of attackers were liquidated,” police spokeswoman Saltanat Azirbek said Thursday.\nThe reported attempts to storm the buildings came after widespread unrest in the city on Wednesday, including seizure of the mayor’s building, which was set on fire.\nKazakhstan is experiencing the worst street protests the country has seen since gaining independence three decades ago.\nKazakhstan has been rocked by intensifying protests that began on Sunday over a sharp rise in prices for liquefied petroleum gas fuel."
  },
  {
    "headline": "Grammys Postpone Ceremony, Citing Omicron Variant Risks",
    "summarized_story": "The Recording Academy said it made the decision to postpone the ceremony “after careful consideration and analysis with city and state officials, health and safety experts, the artist community and our many partners.\n“Given the uncertainty surrounding the omicron variant, holding the show on January 31st simply contains too many risks,” the academy said in a statement.\nLast year, like most major awards shows in early 2021, the Grammys were postponed due to coronavirus concerns.\nThe Recording Academy made no mention of a possible venue change in its statement.\nThe Grammys’ move could be the beginning of another round of award-show rescheduling after another winter coronavirus surge, with the Screen Actors Guild Awards planned for February and the Academy Awards for March."
  }
]