[
  {
    "headline": "FG targets N1.2tn from telecom operators, approves revenue collection solution",
    "summarized_story": "The Federal Executive Council has given approval for the Revenue Assurance Solution project through the Design, Finance, Build, Operate and Transfer public-private partnership model.\nThe approval was contained in a statement released on Thursday by the Acting Head Media & Publicity of Infrastructure Concession Regulatory Commission, Manji Yarling.\nThe statement was titled, “FG approves Revenue Assurance Solution Project: To generate N1.2trn in 10 years”It stated that the RAS project will span a 10-year period and is expected to increase the revenue accruals from AOL to the tune of N1.2tn within the period.\n“The deployment of the RAS platform will significantly improve the NCC’s current AOL revenue computation and collection system, amongst other benefits’’, the statement read.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Sylvester had enlarged liver, not taken to hospital —Witness",
    "summarized_story": "Ltd., a company in Warri, Delta State owned by the father of late Sylvester Oromoni, has testified at the coroner’s inquest investigating the controversial death of the Dowen College student.\nWhile answering questions from the lawyer to the Lagos State Government, Seun Akande, the witness testified that the deceased had an enlarged liver but was not immediately taken to a hospital, according to Channels Television.\nThe witness also testified that the boy and his mother had first gone to church for prayers before the medical tests were carried out.\nOromoni, a 12-year-old student of Dowen College, Lekki, was later taken by road to Warri in Delta State where he eventually died on Nov 30th.\nThe coroner says the application will be considered at the next sitting of the court on Friday, Jan. the 28th."
  },
  {
    "headline": "Strive Masiyiwa, Baroness Nemat Shafik , others join Bill &Melinda Gates Foundation’s board",
    "summarized_story": "•Melinda and husband, Bill GatesBy Jimoh BabatundeStrive Masiyiwa, Baroness Nemat (Minouche) Shafik, Thomas J. Tierney, and Gates Foundation CEO Mark Suzman have been appointed as members of the board of trustees of the Bill & Melinda Gates Foundation.\nThey will be joining co-chairs Bill Gates and Melinda French Gates as members.\nAnnouncing the appointment in the the foundation’s inaugural annual letter, Gates Foundation CEO Mark Suzman , said the board members will work alongside Gates and French Gates, bringing independent and diverse perspectives to help strengthen the foundation’s governance.\nREAD ALSOOhanaeze reacts to Rep rejection of state Police“We are honored that these three deeply knowledgeable and respected individuals have agreed to join the foundation board,” writes Suzman.\n“As we look ahead, I’m excited to welcome our new board members."
  },
  {
    "headline": "We’ve not endorsed anyone as Oba of Oshodi – Lagos family",
    "summarized_story": "…MC Oluomo has not declared interest – AideBy Evelyn UsmanChairman of the Oshodi Tapa Chieftaincy family in Lagos State, Chief Moroof-Deen Babatunde, today, said the family has not endorsed anyone as the traditional ruler of Oshodi.\nThere were speculations that the Chairman of the National Union of Road Transport Workers, NURTW, in Lagos State, Mr Musiliu Akinsanya, popularly called MC Oluomo, was to be installed as the Oba of Oshodi.\nAddressing journalists on the family’s position, Chief Babatunde said: “The record we are trying to put straight is that this family house: Oshodi Tapa chieftaincy family , is the absolute owner and controller of Oshodi town in Oshodi/Isolo Local Government Area .\nWe therefore, take report of Musiliu Akinsanya alias MC Oluomo’s moves to be Oba of Oshodi as a rumor because he is not a member of the Oshopdi Tappa chieftaincy family and has no right to the stool of Oshodi town.\nAside from the suspected move by Oluomo to be installed as the Oba of Oshodi, he disclosed that “there is an outstanding issue which is the upgrading of the baleship to Oba in Oshodi."
  },
  {
    "headline": "Nigeria’s economy now diversified – Onu",
    "summarized_story": "By Emmanuel ElebekeThe Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu says that Nigeria’s economy has been diversified due to policies of the Federal Government.\nOur economy is now diversified and we are all working hard to deepen the diversification.\nAccording to Dr. Onu, the STI policy gives direction to every area of national life which includes; Human capital development, agriculture, Industrial growth, Women and Youth empowerment, job creation, national security etc.\nIn his own remarks, the Minister of State for Science, Technology and Innovation, Barrister Mohammed Abdullahi, said that the 2022 Draft Revised STI policy is designed to engender and diversified sustainable economy.\nShe added that Nigeria needs to have a robust STI policy that will drive economic diversification and development."
  },
  {
    "headline": "Ekiti 2022: Oyebanji wins APC primary election, emerges Party’s flag bearer",
    "summarized_story": "The chairman of the APC primary election committee and governor of Jigawa state, Abubakar Badaru said the exercise which took place across the 177 wards in the state was peaceful , transparent and credible.\nBoycottThe other Seven aspirants had withdrawn from the primary election and called for its immediate cancellation over alleged cases of fraud and malpractices.\nThey also alleged that the Governor Mohammed Abubakar Badaru-led APC governorship Primary Committee has given the result sheets to Oyebanji’s supporters to write the results even before the election.\nOyebanji who wandered why the 7 aspirants boycotted the primary election, when there is a body empowered by the constitution of the party to handle grievances and other related issues arising from primary election.\nAccording to the former Secretary to the State Government, the APC appeal panel will handle all controversial issues surrounding the conduct of the election ."
  },
  {
    "headline": "Soot: Stakeholders call for review of Petroleum Refining laws to accommodate artisanal refineries",
    "summarized_story": "—Urge FG to implement Artisanal/Modular Refinery reportBy Johnbosco AgbakwuruABUJA—STAKEHOLDERS in the management of oil and gas have stressed the need for a review of the Petroleum Refining Regulations of 1974 and other relevant laws to accommodate the establishment of artisanal refineries.\nThe emergency meeting was called to address the soot and other environmental pollution caused by artisanal refining activities in Rivers State and other Niger Delta States.\n“That there is the need for the review of the Petroleum Refining Regulations of 1974 and other relevant laws to accommodate the establishment of artisanal refineries.\nThe stakeholders commended the Ministers of EnvironmentPetroleum Resources (State), Finance, Budget and National Planning and Niger Delta Affairs.\nThey also appreciated theDirector General/Chief Executive: National Oil Spill Detection and Response Agency (NOSDRA), the Commission Chief Executive, Nigerian Upstream Petroleum Regulatory Commission (NUPRC), and the Chief Executive, Nigerian Midstream and Downstream Petroleum Regulatory Authority."
  },
  {
    "headline": "Recruitment: Police to screen 135,027 applicants from Feb 1-20",
    "summarized_story": "The Nigeria Police Force on Thursday said it has invited candidates who successfully completed their online recruitment registration in the ongoing 2021 recruitment exercise into the force for physical and credential screening.\nIt also stated that it has received 135,027 online registration of applicants.\nThis was contained in a statement by Force Public Relations Officer, Frank Mba.\nIt warned that any candidate who fails to present the above, will not be considered for screening.\nHe commended the satisfactory increase in the number and geographic spread of the applications, particularly in the southeast and south-south regions of the country following the extension of the registration exercise, adding that a total of 135,027 valid applications were received in the online registration exercise."
  },
  {
    "headline": "Why we need CBN’s N2.5bn COVID-19 support fund – Rivers govt",
    "summarized_story": "The Rivers State Government has explained why it intends to access the Central Bank of Nigeria (CBN) COVID-19 support fund for states across the federation.\nThe state Commissioner for Finance, Issac Kamalu, gave the explanation at the end of the state executive council meeting presided over by Governor Nyesom Wike at the Government House on Thursday.\nThe commissioner added that the CBN created the fund to cushion the effects of coronavirus on the federal and state governments.\nN2 billion will be for healthcare infrastructure support and N500 million as revolving credit for medical consumables.\n“As you are aware, the facility has been utilised by virtually all the States and Rivers State is among the few that are yet to utilise the facility."
  },
  {
    "headline": "Fayemi, Fayose, Badaru, Emmanuel meet in Ekiti",
    "summarized_story": "Ekiti Governor, Kayode Fayemi and his predecessor, Ayo Fayose met at the state capital, Ado Ekiti, on Thursday.\nOthers were Governors of Jigawa, Mohammed Abubakar; and Akwa Ibom, Emmanuel Udom.\nFayose and Emmanuel are Peoples Democratic Party (PDP) members; Fayemi and Abubakar are of the All Progressives Congress (APC).\nIn a Facebook post, Fayose explained that he was at the Government House to see off Emmanuel, who superintended over the PDP primary election.\nHe said Fayemi and Badaru, APC Electoral Panel Chairman for Ekiti primary election, “saw us to the Helipad where Gov Emmanuel’s helicopter departed.”“These clarifications become necessary before the “political analysts” start their commentations.”The PDP exercise produced Bisi Kolawole as the party’s governorship candidate for the June 18 poll."
  },
  {
    "headline": "Gov Abdulrazaq seeks Kwara Assembly’s nod to sack auditor-general for misconduct",
    "summarized_story": "There were strong indications on Thursday that Governor Abdulrahman Abdulrazaq of Kwara State will sack the state Auditor-General, Adeyemi.O.\nAdeyeye for alleged misconduct.\nIn the letter titled “Removal of Mr Adeyeye.O.\nSamuel as Auditor-General of Kwara State,” Abdulrasaq noted that Adeyeye claimed that he had not been able to cashback the allocation due to his office, before later confirming that he had accessed 30 per cent of the allocation as at June 2021.\nFindings by DAILY POST revealed that the Auditor-General got into trouble following controversies triggered by the 2021 Kwara State audit report in which he queried several unreceipted financial transactions of the state government which drew the attention of the leading CSO, in the state, Elite Network for Sustainable Development, ENetSuD."
  },
  {
    "headline": "Hope dims on LG polls in Anambra as Assembly renews tenure of chairmen",
    "summarized_story": "Hope for the conduct of local government elections by Governor Willie Obiano-led administration has finally dimmed as the Anambra State House of Assembly has renewed the tenure of the 21 council chairmen in the state.\nThere had been hopes in some quarters that Obiano would toe the path of his predecessor, Peter Obi, and conduct local government elections before leaving office.\nHowever, the state house of assembly on Obiano’s orders on Thursday renewed the tenure of the Local Government Transition Committee chairmen for another three months.\nThe speaker of the assembly, Rt Hon Uchenna Okafor, who presided over the plenary said: “The extension of their tenure in line with Section 208 of the local government law as requested by Governor Willie Obiano.”Addressing the local government chairmen after the extension of their tenure, the speaker charged them to continue to work with the House and Governor Obiano to attract dividends of democracy to their various local government areas."
  },
  {
    "headline": "US Embassy extends visa fee validity to 2023",
    "summarized_story": "The United States (US) Mission in Nigeria has extended visa fee validity to September 2023 to accommodate applicants facing difficulty in booking appointment for non-immigrant visa.\nVisa fee is only valid for one year from the date of payment.\nBut the mission said on its website that it has extended validity to September 2023 to enable all applicants get appointment date.\nThe statement reads: “The United States Embassy and Consulate in Nigeria understand that many visa applicants have paid the visa application processing fee and are still waiting to schedule a visa appointment.\n“We are working diligently to restore all routine visa operations as quickly and safely as possible."
  },
  {
    "headline": "Buhari has achieved more than US govt in infrastructure- Fashola",
    "summarized_story": "Buhari has achieved more than US govt in infrastructure- FasholaMinister of Works and Housing, Babatunde Fashola, on Thursday said President Muhammadu Buhari’s All Progressives Congress (APC)-led administration has made more achievements than the United States government in terms of infrastructural development.\nHe assured Nigerians that all ongoing road projects would be completed before Buhari leaves office.\nFashola, who also inspected the Kano-Katsina highway, said: “I can assure you that the present APC administration of President Buhari has achieved what even the US government is trying to do, in terms of infrastructure.\nFashola said: “In Kano state here for instance, there are 21 road projects in or around the neighbouring communities.\n“Presently, there are 850 ongoing projects under the ministry of Works, including road/bridge constructions as well as houses in 34 states of the federation."
  },
  {
    "headline": "BREAKING: Oyebanji leads in Ekiti APC primary",
    "summarized_story": "Former Chief of Staff to Governor Kayode Fayemi, Biodun Oyebanji, is taking the lead in the governorship primary of the All Progressives Congress(APC) in Ekiti State.\nResults released so far by Returning Officers from 13 local government areas showed Oyebanji has garnered over 70,000 votes.\nDetails Shortly…"
  },
  {
    "headline": "I’ll crush terrorists before my tenure expires, Buhari assures Sultan",
    "summarized_story": "President Muhammadu Buhari has reassured Nigerians his administration will solve the banditry and insecurity challenges before the end of his tenure.\nBuhari spoke at the Sultan’s palace Sokoto on Thursday when he paid a courtesy visit to Sultan Muhammad Sa’ad Abubakar.\nHe regretted the current happening in the North West was disturbing, saying that he was having sleepless nights.\nResponding, Sultan Muhammad Sa’ad Abubakar said as religious leaders, they would continue to pray for peaceful coexistence in the country.\nHe thanked the President for taking time to visit the palace."
  },
  {
    "headline": "UPDATED: Buhari apologises to Zamfara over cancelled visit",
    "summarized_story": "President Muhammadu Buhari has apologised to Zamfara residents over his inability to meet up with his scheduled visit to the State.\nThe President was expected to fly into Zamfara from Sokoto State where he commissioned BUA’s new cement plant.\nHe was expected in Zamfara on a condolence visit.\n“In his broadcast message, President Buhari said “my dear people of Zamfara State.\n“God bless the people of Zamfara State,” the statement reads."
  },
  {
    "headline": "JUST IN: Police helicopter crashes in Bauchi",
    "summarized_story": "From Molly kilete, AbujaIndications have emerged that a police helicopter has crashed in Bauchi state.\nAlthough news of the crash is still sketchy at the time of filing this report, it was gathered that the helicopter a Bell 429, with registration number 5N, actually took off on Wednesday from Abuja and crashed between 7:30, in the evening.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nThe police force headquarters when contacted promised to issue a statement shortly over the crash.\nThe police while responding to reporters questions on its crime reporters WhatsApp handle by Benjamin Hundeyi said “press releases on the way please”Details soon…"
  },
  {
    "headline": "COVID-19: UAE to lift flight restriction on Nigeria, 11 other African countries Jan 29",
    "summarized_story": "By Chinelo Obogo, LagosThe United Arab Emirates has said the restriction on flights arriving from Nigeria and 11 other African nations will be lifted on Saturday, January 29.\n‘The excluded categories should present a negative COVID-19 test obtained within 48 hours of departure and a Rapid-PCR test at the airport within six hours of departure whenever possible and another PCR test at the airport upon arrival to UAE,’ NCEMA said.\nOn Wednesday, January 26, NCEMA also announced that entry procedures have been updated for flights originating from Ghana, Rwanda and Uganda.\nPassengers are required to take a PCR test 48 hours before departure, test where possible at the departure airport, test on arrival and adhere to all precautionary measures when visiting the UAE.\nThe UAE’s NCEMA and GCAA announced last December that travellers from Nigeria, Tanzania, Kenya and Ethiopia were restricted from entering the country from Saturday, December 25 citing a surge in the Omicron variant."
  },
  {
    "headline": "Niger: Early morning inferno razes 57 shops, properties",
    "summarized_story": "From John Adams and Umar Yunusa, MinnaAn early morning fire on Thursday razed no fewer than 57 shops, leaving goods worth millions of naira destroyed at the Mokwa main market in Mokwa Local Government Area of Niger State.\nA source close to the market, Abubakar Umar, disclosed that the inferno razed many shops and destroyed properties worth millions of naira with no help coming from anywhereAccording to him, the ‘fire incident destroyed many shops in the market.\nA trader and spokesman of Mokwa market, Abdulmalik Jibrin, said that the fire incident which occurred around 3 am to 4 pm had destroyed millions of naira worth of properties.\n‘My goods which were worth about 150 million have been destroyed by the early morning inferno.\nAlso speaking, Adamu Usman, revenue officer of Mokwa LGA, confirmed the incident, saying that about 57 shops were destroyed by the early morning inferno."
  },
  {
    "headline": "Delta: Two dead, 22 houses razed in tankers accident fire",
    "summarized_story": "From Ben Dunno, WarriReckless driving by four tanker drivers loaded with gas, diesel, petrol and another truck conveying granites along the East-West road end of Ohoror Community in Ughelli North Council area of Delta State had claimed the lives of two persons and burnt down 22 houses in the area.\nThe two persons that died have been identified as a conductor to one of the tankers and another co-driver to the granite truck.\n‘The two persons burnt beyond recognition were a conductor and a co-driver.\nThe community did not lose anybody but 22 houses built along the Expressway by our people were completely razed down, making many of our people homeless and distressed,’ he stated.\nMeanwhile, at the time of this report, firefighters had mobilised additional water to the scene and were able to put out the smoke coming from the petrol tankers completely to ensure that all the dangers are averted."
  },
  {
    "headline": "US stands with Nigeria in fight against trafficking – Envoy",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United States Government has renewed its support for the fight against trafficking in persons in the country.\nFor that reason, the United States stands with Nigeria in its fight against trafficking,’ FitzGibbon said.\n‘This built upon a program hosted in Lagos last March, where we worked to bring Nigerian judicial officers, prosecutors, and law enforcement officials together to focus on improving the investigation and prosecution of human trafficking cases and discussed the admissibility of electronic evidence in human trafficking cases under Nigerian law.\nSCALE also works with local authorities and Nigeria’s nongovernmental coalition working towards tackling human trafficking, the Network Against Child Trafficking.\n‘The victims of human trafficking and smuggling deserve no less."
  },
  {
    "headline": "Police Helicopter Crash-lands in Bauchi",
    "summarized_story": "Segun Awofadeji in BauchiThe Accident Investigation Bureau (AIB) has reported a crash involving a Bell 429 helicopter with registration marks 5N-MDA owned and operated by the Nigeria Police Force (NPF).\nAccording to a press statement by Tunji Oketunbi, the General Manager, Public Affairs of AIB, titled ‘Nigeria Police Helicopter Occurrence’ which was made available to newsmen Thursday, “On 26th January, 2022, Accident Investigation Bureau, Nigeria was notified by Nigerian Airspace Management Agency (NAMA) about an accident involving a Bell 429 helicopter with Registration Marks 5N-MDA owned and operated by Nigeria Police Force (NPF).\n“The accident occurred on 26th January, 2022 around 7.30pm (local time)at Bauchi Airport.”The statement further said: “The NPF helicopter had departed Abuja at 16:54UTC for Bauchi with six persons on board maintaining 5,500ft.\n“The investigating agency, AIB-N, needs and hereby solicits for your assistance.\n“The Bureau will appreciate that the general public and press respect the privacy of the people involved and NOT assume the cause of the accident until formal report is released.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Again, Rivers Floors FG, As Court Declares Deductions from Fed Account to Fund its Agencies Unconstitutional",
    "summarized_story": "Mohammed barred the federal government from further deductions from the federation account to fund agencies not listed in the 1999 Constitution for direct allocation.\nReacting to the ruling, Rivers State Governor, Mr. Nyesom Wike, stated that the judgement was a resounding victory for democracy.\nThe suit challenging the continued deductions from the federation account to fund agencies belonging to the federal government was filed by the Rivers State Government.\nMohammed, while upholding the suit by Rivers State against the deductions, ordered that the fund belonging to Rivers State but used to fund the Nigeria Police Trust fund by the federal government should be refunded to the state.\nBut not the federal government arbitrarily deducting our money from the federation account and putting it to Police Trust Fund."
  },
  {
    "headline": "Cash-strapped FG Approves N3trn, 17.5% of 2022 Budget to Sustain Subsidy",
    "summarized_story": "The N3 trillion now budgeted to sustain the payment of subsidy in 2022 alone, amounts to 17.5 per cent of the total of N17.126 trillion 2022 budget that was signed into law on the last day of 2021.\nAlready, the approved 2022 budget has a deficit of N6.39 trillion, which is 37 per cent of the N17.126 trillion.\nFayemi said this at a joint meeting between the state governors, NLC, and TUC over the fuel subsidy withdrawal.\nFEC yesterday mandated the Finance, Budget and National Planning Ministry to reconcile the fuel subsidy budget with the Nigerian National Petroleum Company (NNPC) Limited, which prepared the estimate.\nAhmed said a memo in respect of the additional funding provisions to enable government meet the incremental fuel subsidy request in the 2022 budget was presented for the council’s consideration."
  },
  {
    "headline": "Soludo: As Gov, I’ll Drive Innoson Vehicle as Official Car",
    "summarized_story": "I have said it even during campaigns, and I meant it, that if I win, the official car of the governor of Anambra State will be Innoson Vehicle.\nHe said the day was simply to mark his first day at work, saying even though it is a weekend, he would spend eight hours of the day working.\nI just want to show up for work, like every first work day.\nThough it is going to be a Friday, which is weekend, but I’m going to work for over eight hours that day.\nIt is going to be work, work, work, and that is what we epitomise.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "At Last, Senate, House Pass Amended Electoral Bill",
    "summarized_story": "The harmonised version accommodated the direct, indirect, and consensus modes of primary election.\nThe Senate had earlier passed the three modes of primaries, but the version of the House of Representatives did not include the consensus arrangement.\n“(b) The procedure in paragraph (a) above of this subsection shall be adopted for direct primaries in respect of gubernatorial, senatorial, federal and state constituencies.\nHe explained, “You will recall that this House last week, as soon as we returned, looked into the complaints and added the provision of indirect primaries to our law.\nUnfortunately, the Senate added both indirect and consensus, which necessitated the possible need for a conference committee of both chambers."
  },
  {
    "headline": "BREAKING: Police Helicopter Crashes In Bauchi, Officers Injured",
    "summarized_story": "A police helicopter which took off from Abuja has crashed at the Bauchi Airport, the Accident Investigation Bureau said on Thursday.\nHowever, AIB recorded that no life was lost but occupants who were on board sustained injuries in the said crash.\n“On 26th January, 2022, Accident Investigation Bureau, Nigeria was notified by Nigerian Airspace Management Agency (NAMA) about an accident involving a Bell 429 helicopter with Registration Marks 5N-MDA owned and operated by Nigerian Police Force (NPF),” the statement said.\n“The accident occurred on 26th January, 2022 around 7:30pm (Local Time) at Bauchi Airport.\n“The NPF helicopter had departed Abuja at 16:54 UTC for Bauchi with Six persons on board maintaining 5,500ft."
  },
  {
    "headline": "BREAKING: Police Helicopter Crashes In Bauchi, Officers Injured",
    "summarized_story": "A police helicopter which took off from Abuja has crashed at the Bauchi Airport, the Accident Investigation Bureau said on Thursday.\nHowever, AIB recorded that no life was lost but occupants who were on board sustained injuries in the said crash.\n“On 26th January, 2022, Accident Investigation Bureau, Nigeria was notified by Nigerian Airspace Management Agency (NAMA) about an accident involving a Bell 429 helicopter with Registration Marks 5N-MDA owned and operated by Nigerian Police Force (NPF),” the statement said.\n“The accident occurred on 26th January, 2022 around 7:30pm (Local Time) at Bauchi Airport.\n“The NPF helicopter had departed Abuja at 16:54 UTC for Bauchi with Six persons on board maintaining 5,500ft."
  },
  {
    "headline": "EXCLUSIVE: Oyo Government, Transport Union Make Moves To Nigerian Army, Ondo Police To Release 150 Political Thugs, Ask Members To Contribute Money",
    "summarized_story": "The thugs had been reported to be heading for the primary elections of the Peoples Democratic Party (PDP) in Ekiti State on Wednesday when they were rounded up.\nSaharaReporters had on Wednesday reported that the personnel of the Nigerian Army intercepted the government-sponsored hoodlums around 3am.\nThe Ondo State Police Public Relations Officer, Funmilayo Odunlami, confirmed to Fresh FM during an interview that the Ondo command was trying to get the arrested thugs from soldiers for prosecution.\nAuxiliary was seen in a video that went viral, boasting that he would kill a former governor of Ekiti State, Ayodele Fayose.\nSee Also CRIME Nigerian Army Moves 105 Ibadan Hoodlums Heading For Ekiti PDP Primaries To Ondo BarracksA source told SaharaReporters that transport union members were asked to contribute money to bribe the security agencies for the release of the hoodlums."
  },
  {
    "headline": "EXCLUSIVE: Oyo Government, Transport Union Make Moves To Nigerian Army, Ondo Police To Release 150 Political Thugs, Ask Members To Contribute Money",
    "summarized_story": "The thugs had been reported to be heading for the primary elections of the Peoples Democratic Party (PDP) in Ekiti State on Wednesday when they were rounded up.\nSaharaReporters had on Wednesday reported that the personnel of the Nigerian Army intercepted the government-sponsored hoodlums around 3am.\nThe Ondo State Police Public Relations Officer, Funmilayo Odunlami, confirmed to Fresh FM during an interview that the Ondo command was trying to get the arrested thugs from soldiers for prosecution.\nAuxiliary was seen in a video that went viral, boasting that he would kill a former governor of Ekiti State, Ayodele Fayose.\nSee Also CRIME Nigerian Army Moves 105 Ibadan Hoodlums Heading For Ekiti PDP Primaries To Ondo BarracksA source told SaharaReporters that transport union members were asked to contribute money to bribe the security agencies for the release of the hoodlums."
  },
  {
    "headline": "BREAKING: Governor Fayemi's ‘Anointed’ Candidate Named Winner Of Ekiti APC Primary Election",
    "summarized_story": "The Ekiti State All Progressives Congress Primary Election Committee has announced Governor Kayode Fayemi’s ‘anointed’ candidate, Biodun Oyebanji, as winner of the exercise.\nChairman of the committee and governor of Jigawa State, Badaru Abubakar, announced this on Thursday night at the state party secretariat in Ado-Ekiti.\nThey alleged that the primary election committee was made up of loyalists of Governor Kayode Fayemi of Ekiti State, claiming that the governor was attempting to impose Oyebanji on them.\n“The seven candidates herein are loyal, faithful and committed party members who are sincerely concerned about the chances of the party in the forthcoming 2022 governorship election where an imposition is allowed to override a democratic primary election for determining its flag bearer.\n“We request that both the local government election committee and ward election committee that were constituted on the list already in circulation be disbanded and replaced with names that would reinforce internal democracy and uphold the aims and objectives of the party.”"
  },
  {
    "headline": "Biodun Oyebanji wins Ekiti APC governorship primary election",
    "summarized_story": "Biodun Oyebanji has won the All Progressives Congress (APC) governorship primary election in Ekiti state.\nOyebanji, a former secretary to the state government (SSG), defeated other aspirants to emerge winner of the primary election on Thursday.\nThe result was announced by Mohammed Badaru, Jigawa state governor and chairman of the primary election committee.\nAdvertisementOyebanji will be the APC’s standard-bearer in the governorship election to be conducted on June 18 by the Independent National Electoral Commission (INEC).\nTHE CONTROVERSY Opeyemi Bamidele, senator representing Ekiti central, had earlier asked the APC to cancel the primary election."
  },
  {
    "headline": "Biodun Oyebanji wins Ekiti APC governorship primary election",
    "summarized_story": "Biodun Oyebanji has won the All Progressives Congress (APC) governorship primary election in Ekiti state.\nOyebanji, a former secretary to the state government (SSG), defeated other aspirants to emerge winner of the primary election on Thursday.\nThe result was announced by Mohammed Badaru, Jigawa state governor and chairman of the primary election committee.\nAdvertisementOyebanji will be the APC’s standard-bearer in the governorship election to be conducted on June 18 by the Independent National Electoral Commission (INEC).\nTHE CONTROVERSY Opeyemi Bamidele, senator representing Ekiti central, had earlier asked the APC to cancel the primary election."
  },
  {
    "headline": "How Biodun Oyebanji secured Ekiti APC governorship ticket with over 100k votes",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "How Biodun Oyebanji secured Ekiti APC governorship ticket with over 100k votes",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "LASEMA: Victims of Ikoyi building collapse died before rescue operations began",
    "summarized_story": "Oluwafemi Oke-Osayintolu, director-general of the Lagos State Emergency Management Agency (LASEMA), says the victims of the building collapse in Ikoyi, Lagos state, died before rescue operations began.\nThe director-general said following a primary assessment, LASEMA deployed “heavy life-saving equipment”, but it was too late to rescue those who died.\nHe added that the rescue was done in sections, with the use of equipment — including a drone — to detect possible survivors.\nIt would compress the victims, and the way our response was operated, we divided the place into quadrums.\nThere was nobody that died in the course of our intervention, to the best of my knowledge.”"
  },
  {
    "headline": "Zimbabwean James Manyika, becomes Google’s first Senior Vice President of Technology and Society",
    "summarized_story": "Google has appointed Zimbabwean James Manyika as the company’s first Senior Vice President of Technology and Society.\nManyika will report directly to Alphabet’s (Google’s parent company) CEO Sundar Pichai and will be working on the impact of technology on society and the environment.\n“I’m thrilled that James Manyika will be joining Google’s leadership team,” Pichai said in a statement.\n“He’s spent decades working at the intersection of technology and society and has advised a number of businesses, academic institutions and governments along the way.\nManyika has advised the chief executives and founders of many of the world’s leading tech companies on strategy and growth, product, and business innovation."
  },
  {
    "headline": "He built TikTok's strategy in Africa, now he's building Kippa",
    "summarized_story": "Kennedy Ekezie-Joseph who helped lead TikTok’s entry into Africa, was no longer with the company for that moment of triumph.\nEkezie-Joseph’s startup, Kippa, is a bookkeeping and finance app that he founded with Duke Ekezie (his brother) and Jephthah Uche in February 2021.\n“My dad had a small business around when I was born, which he lost.\nWhen he launched Kippa, Ekezie-Joseph knew from personal experience that he was addressing an existential threat to businesses.\nBeyond the early conversion of bookkeepers and small business owners, Ekezie-Joseph is the first to admit that there are plenty of hurdles ahead."
  },
  {
    "headline": "Facebook parent company Meta is building the world’s fastest AI supercomputer",
    "summarized_story": "American tech conglomerate Meta (formerly Facebook) on Monday joined the list of tech companies like Microsoft and Nvidia who have built an AI supercomputer, with the recent announcement of its new Artificial Intelligence (AI) Research SuperCluster (RSC).\nMeta claims RSC is already among the fastest supercomputers and, when completed in mid-2022, will be the world’s fastest.\nAI supercomputers are an improved version of supercomputers that can carry out more calculations per second than regular supercomputers, using the same hardware.\nRealising the need to accelerate progress, work on the RSC began in early 2020, with Meta engineers designing and building a new AI supercomputer system from ground up.\nMeta’s researchers can safely train models using encrypted user-generated data that is not decrypted until right before training."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "After 23 years, Nigeria’s space ambitions still look like a pipe dream",
    "summarized_story": "Table of ContentsA history of Nigeria’s space programmeNASA’s space station in Kano — one of 18 Project Mercury space stations strategically placed along the Earth’s orbital track.\nIn 1976, at an ECOWAS meeting held in Addis Ababa, Nigeria first declared its space ambition, and it took 23 years to set up a space agency.\nBack to Table of Contents ↑What Nigeria’s National Space Policy looks likeAs we found out in 2018, as with most countries, Nigeria’s space programme is shrouded in secrecy.\nIt also provides Nigeria’s space economic model, a public-private partnership that involves short, medium, and long-term plans.\nSource: Space in AfricaBut, due to the hushed nature of Nigeria’s space programme, we only know a previous milestone altitude of 10km before 2019."
  },
  {
    "headline": "Nigeria’s space dream, OZÉ’s $3m raise, Husk’s renewable energy commitment￼",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Nigeria’s space dreamOZÉ’s $3m raiseHusk’s renewable energy commitmentNigeria’s space dreamsWhen’s the last time you remembered Nigeria’s space programme?\nIn May 2022, Nigeria’s space agency, the National Space Research and Development Agency (NASRDA), will be 23 years old.\nOZÉ’s $3m pre-Series AOZÉ team source: TechCrunchGhanian fintech startup, OZÉ, has raised a $3m pre-Series A led by Speedinvest.\nHow much power can solar mini-grids provide?\nAccording to the World Bank, mini-grids can provide electricity to about 500 million people, but it will cost $225 billion."
  },
  {
    "headline": "Norebase’s solution for African expansion, InstaDeep’s $100M Series B",
    "summarized_story": "Share this article:Hi there,Today we’re discussingNorebase’s solution for African expansionInstaDeep’s $100M Series BOne-click expansion for African startupsTola Onayemi speaking at the SOAS Khartoum conference in 2019.\nEager to free the continent from colonial rule, leaders from several African colonies pushed for a united front, but that never happened.\nThe African Continental Free Trade Area (AfCFTA) Agreement — has come very close to doing this, inspiring Tola Onayemi to build Norebase in the process.\nYou can read more here: What borderless expansion looks like for African startups with NorebaseInstaDeep’s $100M Series BInstaDeep team.\nSource: TechCrunchIt’s only January, but we already have the first $100M round for an African startup in 2022 as Tunisian startup, InstaDeep has announced its $100M Series B round."
  },
  {
    "headline": "Cashew output seen rising 20% on good weather",
    "summarized_story": "Nigeria’s cashew output is expected to rise 20 percent on favourable weather conditions, which have helped boost output for the 2021/22 season to an estimated 192,000 tons, the national president of the National Cashew Association of Nigeria, has said.\nMost of the trees we have seen across key growing states are fruiting well,” Ojo Ajanaku, national president, National Cashew Association of Nigeria (NCAN), said.\nDespite the COVID-19 omicron variant uncertainty, accelerating inflation, increasing shipping and logistic cost, demand for Nigeria’s cashew crop has remained strong on the back of cashew being an immunity-boosting food.\nLast year, Nigeria’s cashew industry suffered a major setback as the COVID-19 restriction forced Vietnam, the largest exporter and buyer of African cashew, to cut demand.\nWith the fruiting I saw on cashew trees, I am very sure our output will increase,” he said."
  },
  {
    "headline": "FDI: UNCTAD’s data contradict NBS",
    "summarized_story": "United Nations Conferences on Trade and Development (UNCTAD) data on Nigeria’s Foreign Direct Investment (FDI) inflows vary from the data reported by the National Bureau of Statistics (NBS).\nAccording to BusinessDay analysis, UNCTAD reported an increase of 100 percent in FDI to $4.8 billion in 2021, the highest in eight years, while NBS reported a […]United Nations Conferences on Trade and Development (UNCTAD) data on Nigeria’s Foreign Direct Investment (FDI) inflows vary from the data reported by the National Bureau of Statistics (NBS).\nThe difference in UNCTAD and NBS’ FDI reports could be that the former accounts for investments in the technology sector.\nAccording to data compiled by BusinessDay, Nigerian fintechs raised record amounts of money in 2021, raising $799.1 million by 19 fintech companies.\nDeveloped economies saw the biggest rise by far, with FDI reaching an estimated $777 billion in 2021 – three times the exceptionally low level in 2020."
  },
  {
    "headline": "Hospitals struggle to retain staff amid migration tsunami",
    "summarized_story": "The effect of mass migration of healthcare workers is biting harder and nudging towards an emergency situation even as top private hospitals that have pooled huge investment into operations struggle to retain skilled staff, according to BusinessDay finding.\nVast and short experienced health workers are constantly migrating out of Nigeria even if it means little or no raise in their income.\nHer hospital, for instance, lost close to 30 skilled workers between December and January, all leaving for destinations such as the UK, Canada, and the US, among others.\n“Unfortunately, in the hospital now, we are losing very skilled people and those that are available are applying to leave.\nRather, health workers are owed several months of salary and due allowances unpaid."
  },
  {
    "headline": "LAND TUSSLE: Appeal Court Dismisses Case, Awards N15m Against Edo Community – Nigerian Observer",
    "summarized_story": "The Appeal Court also allowed the cross appeal filed by the cross appealants (Ulegun) against the cross respondents (Ukhiri Village) and awarded the sum of Fifteen Million Naira ( N15, 000,000.00) as damages against Ukhiri.\nIn a unanimous decision read by Justice Biobele Abraham Georgewill, in the main and cross appeal with suit No.\n45 hectares lying and situated at Ulegun Village in the Benin-Abraka Road, Ikpoba-Okha Local Government Area of Edo State.\nRecall that Ukhiri had on 1976 dragged Ulegun to court alleging encroachment of a portion of its land by Ulegun.\nThe case was again struck out at the Appeal Court for lack of merit along with cost awarded against the appellants over damages and trespass."
  },
  {
    "headline": "FG N4.1 Billion Customs Revenue Target: Undue Pressure On The Agency – ANLCA Boss Faults – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Association of Nigeria Licensed Customs Agents (ANLCA) has described the recent revenue target of N4.1 billion by the Federal Government on the Nigeria Customs Service (NCS) for 2022, as a high target that will put undue pressure on the agency.\nFaulting the Federal Government decision on the exorbrant target, ANLCA posited that the target would also undermine its core responsibility of facilitating trade between Nigeria and other countries.\nTony Iju Nwabunike stated this in Lagos recently during a press briefing to celebrate the four years of his executives on the leadership of the foremost freight forwarding association in Nigeria.\nNwabunike said: “We want to also advise the Federal Government to be careful before signing into the $3.1 billion Customs Modernisation Project which we heard, will run for 20 years.\n“For us, this shows more commitment by the Buhari administration to maritime matters."
  },
  {
    "headline": "CP Alabi Takes Over Leadership Of Lagos Command, Charges Officers And Men For Success – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The new Commissioner of Police, Lagos State, CP Abiodun Alabi has charged Area Commanders, DPOs/HODs and tactical commanders to translate their long-time relationship with him to success in the state.\nCP Alabi charged the officers during his maiden meeting with them shortly after taking over the mantle of leadership as Commissioner of Police in the state at a brief ceremony held on 24th January, 2022 at the Command Headquarters, Ikeja.\nThe CP also directed the Area Commanders and Divisional Police Officers to constantly engage and partner with critical stakeholders in their areas of responsibilities for effective policing.\nSpeaking further, the Commissioner of Police warned officers against corruption and infringement on fundamental human rights of Nigerians.\nHe, however, assured that he would always provide good leadership that would help them succeed in the discharge of their duties."
  },
  {
    "headline": "Obaseki visits, commiserates with family of late Edo NLC Chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commiserated with the family of the late chairman of the state chapter of the Nigerian Labour Congress, Comrade Sunny Osayande.\nObaseki, who led other top government functionaries on a condolence visit to the home of the deceased, pledged to support the family in giving the late labour leader a befitting burial.\nSunny was a good labour leader.\nHe was never tired as a labour leader.\nSpeaking on behalf of the family, Mr. Festus Egharevba, noted that the deceased labour leader enjoyed cordial rapport with the state government in his short stay in office."
  },
  {
    "headline": "UAE To Lift Restrictions On Nigerian Passengers, Others Saturday",
    "summarized_story": "The United Arab Emirates (UAE) authorities have said that restriction on flights arriving from Nigeria and 11 other African countries will be lifted on Saturday, January 29, 2022.\nUAE National Emergency Crisis and Disaster Management Authority (NCEMA) said it was lifting the ban initially imposed as part of measures to prevent the spread of the Omicron variant of COVID-19.\nOthers are South Africa, Tanzania and Zimbabwe, the authorities said in a post on Twitter Wednesday.\nADVERTISEMENTRecall that the UAE had last December issued a travel restriction on passenger flights from Nigeria, Kenya, Tanzania, and Ethiopia.\nADVERTISEMENTIt noted that passengers are required to take a PCR test 48 hours before departure, test where possible at the departure airport, test on arrival and adhere to all precautionary measures when visiting the UAE."
  },
  {
    "headline": "Buhari Inaugurates 3m Metric Tone BUA Cement Factory In Sokoto",
    "summarized_story": "President Muhammadu Buhari on Thursday in Sokoto inaugurated a new three million metric tonnes per annum BUA Cement Sokoto Line 4 Factory, expressing delight that the Federal Government’s policies on economic diversification, job creation and creating an enabling environment for businesses to thrive, were working.\n”In the past few weeks, I visited Ogun and Kaduna States where I observed many private sector investments in action.\nThe President thanked the Founder of BUA Cement, Abdul Samad Rabiu and the entire team for the great work they are doing in supporting the government’s economic diversification and job creation agenda.\nCommending BUA and other entrepreneurs for making Nigeria self-sufficient in cement and a net exporter of the strategic product, the President said: ”I am pleased that through these investments, BUA Cement has created employment opportunities for our citizens.\nRabiu added that he looked forward to President Buhari commissioning the plants next year which will bring total production capacity to 17.5million metric tonnes."
  },
  {
    "headline": "JUST-IN: Deposed Deji Of Akure Is Dead",
    "summarized_story": "The deposed Deji of Akure, Oba Oluwadare Adepoju Adesina, Osupa Ill, has passed on.\nConfirming his death, spokesman for the Adesina Royal Family of the Osupa Ruling House, Dapo Adesina, said the deposed monarch prayed for the peace of Akure Kingdom before his transition.\n“The late deposed Deji of Akure Kingdom said God made it possible for him as a son of the Osupa Ruling House to ascend the throne as the Deji of Akure Kingdom 100 years after the reign of the Ojijigogun Ruling House.\nHe also recovered and took possession of Ilula Recreation Centre from a powerful cabal back to Akure Kingdom.\n“Finally he urged the good people of Akure Kingdom to always live in oneness and peace,” he stated."
  },
  {
    "headline": "JUST-IN: Deposed Deji Of Akure Is Dead",
    "summarized_story": "The deposed Deji of Akure, Oba Oluwadare Adepoju Adesina, Osupa Ill, has passed on.\nConfirming his death, spokesman for the Adesina Royal Family of the Osupa Ruling House, Dapo Adesina, said the deposed monarch prayed for the peace of Akure Kingdom before his transition.\n“The late deposed Deji of Akure Kingdom said God made it possible for him as a son of the Osupa Ruling House to ascend the throne as the Deji of Akure Kingdom 100 years after the reign of the Ojijigogun Ruling House.\nHe also recovered and took possession of Ilula Recreation Centre from a powerful cabal back to Akure Kingdom.\n“Finally he urged the good people of Akure Kingdom to always live in oneness and peace,” he stated."
  },
  {
    "headline": "4 Borno NUJ Officials Resign Over N12m Land Scandal",
    "summarized_story": "Four state executives of the Nigeria Union of Journalists (NUJ) Borno State chapter have tendered a joint resignation letter to their respective chapels over a case of corruption.\n“That proceeds from sale of the land should be remitted to the NUJ Borno Council account in UBA and transaction alert should be received by chairman, secretary and treasurer against the chairman only.\nBY FRANCIS OKOYE, MaiduguriFour state executives of the Nigeria Union of Journalists (NUJ) Borno State chapter have tendered a joint resignation letter to their respective chapels over a case of corruption.\n“That proceeds from sale of the land should be remitted to the NUJ Borno Council account in UBA and transaction alert should be received by chairman, secretary and treasurer against the chairman only.\n“ SEC appealed to four officers: vice chairman, treasurer, financial secretary and assistant secretary who tendered resignation letter the previous day not to abandon the union and continue in office."
  },
  {
    "headline": "Reps summon Emefiele, orders CBN port policy’s suspension",
    "summarized_story": "The House of Representatives, on Thursday, asked the Central Bank of Nigeria to suspend the electronic evaluation and invoicing policy recently introduced in the import and export chain, warning that it may negatively affect revenue collection by the Nigeria Customs Service.\nGovernor of the CBN, Godwin Emefiele, is also to appear before the House Committee on Customs and Excise to explain the implication of the policy to Customs’ revenue target in 2022.\nThe lawmaker said “sudden monetary/fiscal circular hurriedly or half-hazard implemented” often leads to policy summersault.\nFor major policy change such as this, a grace period of 90 days is usually expected for transactions to run their full course to avoid distortion in the economy and price distortions of trade.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Reps summon Emefiele, orders CBN port policy’s suspension",
    "summarized_story": "The House of Representatives, on Thursday, asked the Central Bank of Nigeria to suspend the electronic evaluation and invoicing policy recently introduced in the import and export chain, warning that it may negatively affect revenue collection by the Nigeria Customs Service.\nGovernor of the CBN, Godwin Emefiele, is also to appear before the House Committee on Customs and Excise to explain the implication of the policy to Customs’ revenue target in 2022.\nThe lawmaker said “sudden monetary/fiscal circular hurriedly or half-hazard implemented” often leads to policy summersault.\nFor major policy change such as this, a grace period of 90 days is usually expected for transactions to run their full course to avoid distortion in the economy and price distortions of trade.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Two killed, Many Houses Destroyed As Gas Tanker Explodes In Delta",
    "summarized_story": "Two persons have been burnt beyond recognition and over 30 houses and properties worth millions of naira were destroyed in a gas explosion in Ohoror community, Ughelli North Local Government Area of Delta State on Thursday.\n“The tanker drivers double-parked along the roadside and the granite truck rammed into one of them which fell on the parked ones and the products loaded automatically discharged.\nThe tanker with diesel fell and emptied all its content on the ground and from there, the fire destroyed everything,” he narrated.\nMeanwhile, Governor Ifeanyi Okowa of Delta, on Thursday, called for immediate assessment of the cause of the explosion.\nHe appealed for more concerted efforts in evacuating all abandoned tankers laden with gas in the area to avert further destruction."
  },
  {
    "headline": "Two killed, Many Houses Destroyed As Gas Tanker Explodes In Delta",
    "summarized_story": "Two persons have been burnt beyond recognition and over 30 houses and properties worth millions of naira were destroyed in a gas explosion in Ohoror community, Ughelli North Local Government Area of Delta State on Thursday.\n“The tanker drivers double-parked along the roadside and the granite truck rammed into one of them which fell on the parked ones and the products loaded automatically discharged.\nThe tanker with diesel fell and emptied all its content on the ground and from there, the fire destroyed everything,” he narrated.\nMeanwhile, Governor Ifeanyi Okowa of Delta, on Thursday, called for immediate assessment of the cause of the explosion.\nHe appealed for more concerted efforts in evacuating all abandoned tankers laden with gas in the area to avert further destruction."
  },
  {
    "headline": "Nigeria Shall Win Battle Over Evil ―Buhari",
    "summarized_story": "On Thursday, President Muhammadu Buhari stated that Nigeria will triumph over evil in the country.\nHe commiserated with them over the recent loss of lives and property as a result of outrageous attacks by bandits and other criminal gangs.\n“My condolences to the Sultanate, the government, and people of Sokoto State over the recent mindless killings by bandits and terrorists.\n“Nigeria shall win the battle over evil,” Buhari wrote in the visitors’ register.\nGovernor of Sokoto State, Aminu Tambuwal, and the Sultan expressed their gratitude to the President for the show of sympathy, assuring him of continued support towards peace and stability in the country."
  },
  {
    "headline": "Fourteen Kidnapped Students Of FGC Birnin Yauri Still In Captivity After 210 Days",
    "summarized_story": "Fourteen students and their teachers taken from the Federal Government College in Birnin Yauri, Kebbi State, on June 17, 2021, have still to be released by their kidnappers.\nMinister of State for Education, Chukwuemeka Nwajiuba, revealed the youngsters’ prolonged detention during his keynote address at the national campaign on out-of-school children in Birnin Kebbi, Kebbi State, on Thursday.\nHe did say, though, that the federal government was committed to releasing all of the youngsters held captive by terrorists.\nRemember that gunmen had kidnapped approximately 100 children and eight teachers from the school at the time.\nDuring the abduction, some of the students managed to flee the gunman, while others were rescued by security personnel."
  },
  {
    "headline": "Family Calls For Release Of Abducted Ex-President Jonathan’s Cousin",
    "summarized_story": "The family of Jephthah Robert, a cousin of Nigeria’s former President Goodluck Jonathan, has pleaded with his kidnappers to free him immediately.\nRobert was abducted from his home in Yenagoa, Bayelsa State, at 9:30 p.m. on Monday and taken to an unknown location.\nAccording to a statement signed by Austin Ekeinde, Azibaola’s media aide, the family demanded the man’s release on Thursday.\n“In particular, we express our appreciation to the Commissioner of Police, Bayelsa State, and the State Director of the Department of State Services for their determined assistance.\nThe abduction came a day after the Bayelsa State Commissioner for Industry, Trade and Investment, Federal Otokito, was released by his abductors."
  },
  {
    "headline": "Onajite Okoloko’s Midwestern Oil, lkpea Leemon, Jide Omokore, Sahara Energy – List Of Individuals, Firms Linked To Diezani’s Corruption Saga",
    "summarized_story": "The arrest warrant was needed, according to Abdullah, the EFCC’s lawyer, to provide the International Police (INTERPOL) the motivation to bring the defendant to Nigeria to face the allegations against her.\nHe stated that because the summons had failed to produce the anticipated effect, the need for an arrest warrant could not be overstated.\nThe EFCC had accused the former minister of fleeing the country for the United Kingdom, among other things, to avoid justice.\n10, Chiluba Close, off Jose Marti Street, Asokoro, Abuja, as well as some identified properties in Nigeria, the United Kingdom, the United States, the United Arab Emirate, and South Africa.\nThe EFCC chairman, Abdulrasheed Bawa, revealed that the anti-corruption commission seized 153 million dollars from Alison-Madueke in the April 2021 edition of the agency’s in-house magazine."
  },
  {
    "headline": "2023: Okorocha, Saraki join presidential race as APC rurbishes ‘circulating document’ on zoning",
    "summarized_story": "The ruling All Progressives Congress (APC) Wednesday denied zoning its 2023 presidential ticket to any part of southern Nigeria as being speculated in viral reports making the rounds in the media space.\n“The attention of His Excellency, the Executive Governor of Yobe State and Chairman APC Caretaker Extraordinary Convention Planning Committee, Hon.\nMai Mala Buni, has been drawn to media publications with purported zoning of offices allegedly announced by him,” the statement reads.\n“The publication is just a figment of the author’s imagination that has nothing to do with the Chairman and the party.\nSaraki tooSimilarly, former Senate President Bukola Saraki has indicated interest to contest the 2023 presidency."
  },
  {
    "headline": "El-Rufai on Kauru, Zangon Kataf crises: We lost 387 lives in 2 years to needless bloodshed",
    "summarized_story": "Not less than 387 lives were lost to communal clashes in Kauru and Zangon Kataf local government areas of Kaduna state in 2020 and 2021, Governor Nasir El-Rufai has said.\nGovernor El-Rufai stated this Wednesday at an emergency security meeting with traditional rulers, religious and community leaders from the areas.\n“We are here on behalf of the governor following the renewed killings in Kauru and Zangon Kataf local government areas.\nGiving the figure, Aruwan said: “For instance in 2020, 114 citizens were killed in Zangon Kataf and 28 in Kauru, and in 2021, 186 were killed in Zangon Kataf and 59 in Kauru, and if you put the figures, we lost 387 people in these two councils.\nIn 2021, 100 citizens ‘incurred’ gunshot injuries in the two councils, 77 in Zangon Kataf and 23 in Kauru."
  },
  {
    "headline": "FCT UBE blames council areas for teachers’ strike as NUT shuts down primary schools in Abuja",
    "summarized_story": "The Federal Capital Territory Universal Basic Education (FCT UBE) has said they are not owing FCT teachers’ salaries to warrant them to embark on indefinite strike.\nAccording to the education board, the area council chairmen should be blamed for the primary schools’ teachers strike.\nHe said in December, all teachers that are under the payroll of the FCT administration were paid.\nFCT NUT chairman, Comrade Stephen Knabayi, while speaking during the briefing, also explained that as far as NUT was concerned, the payment of teachers’ salaries in LEA schools, FCT has been prompt and regular.\n“But presently, we have directed that schools should be shut down in the six area councils with effect from today Wednesday."
  },
  {
    "headline": "UAE Relaxes Entry Ban On Nigerian Travellers From Saturday",
    "summarized_story": "The United Arab Emirates (UAE) will resume passenger flights from Nigeria and 11 other African countries on Saturday, January 29.\nREAD ALSO: FIRS Generates Record N6.4trn Revenue In 2021The country’s agency said entry procedures have been updated for flights originating from Ghana, Rwanda, and Uganda.\nAccording to the statement, passengers arriving from these three countries to the UAE must have a negative COVID-19 test obtained within 48 hours of departure from the approved labs in their respective countries.\nOn arrival in the UAE, they will be subjected to another PCR test, asking residents of African countries to refrain from travelling to the country if they have COVID-19 symptoms.\nSimilarly, Emirates Airline, the flag carrier of the UAE, also suspended flights to several African nations due to the directive."
  },
  {
    "headline": "FIRS Generates Record N6.4trn Revenue In 2021",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) has generated a record N6.4 trillion as revenue in 2021, the highest in its history.\nThis year’s revenue collection exceeded that of 2019 when the agency raked in N5.3 trillion under the administration of Babatunde Fowler.\n“Companies Income Tax amounted to N1.896 trillion; Petroleum Profits Tax amounted to N2 trillion; Value Added Tax amounted to N2.07 trillion; Electronic Money Transfer Levy amounted to N114 billion; Earmarked Taxes amounted to N208.8 billion; among others.\n“Non-oil sector contributed 69 percent of the total collection in the year, while oil sector’s contribution was 31 percent of the total collection.\n007 of 2019.”Wojuola stated that in line with the law, 2021 income tax revenue was a function of the outcome of business activities in 2020."
  },
  {
    "headline": "Edwin Clark Faults Buhari’s Claim Of Restoring Peace To Niger Delta",
    "summarized_story": "Former Information Minister, Edwin Clark, has faulted a claim by President Muhammadu Buhari’s administration on restoring peace to the Niger Delta region, describing it as untrue.\nPresident Buhari has spoken about his administration’s efforts in sustaining peace in the South-South geo-political zone, pledging a fair deal to the region.\nBut in an open letter to Buhari on Thursday, Clark said the significant peace being enjoyed in the region cannot be attributed to the current administration.\n“No doubt, a good amount of peace has come to the Niger Delta in the past few years.\n“The period saw the emergence of a new group, the Niger Delta Avengers, which virtually held your government hostage, oil production went down to as low as about 800,000 barrels per day."
  },
  {
    "headline": "Ikoyi Building: No One Died During Rescue Operations, LASEMA Tells Coroners Inquest",
    "summarized_story": "None of the victims of the collapsed Ikoyi building died during rescue operations as evidence showed that they were all dead before the rescue operations commenced.\nThat’s the testimony of the Director-General/Chief Executive Officer of the Lagos State Emergency Management Agency (LASEMA), Dr. Oluwafemi Oke-Osayintolu before the coroner’s inquest on Thursday.\nThe inquest continued at the Lagos court Ikeja premises before the coroner, Magistrate Oyetade Komolafe.\nWhile being led in evidence-in-chief by Adeolu Odugbemi, the counsel to the Lagos State Building Control Agency (LASBCA), Dr. Oke-Osayintolu, gave a vivid account of how the rescue operations were carried out by responders.\nREAD ALSO: Ikoyi Building Collapse: Provisional Approval Not Given Before Construction Started – LASBCAHe admitted that rescue operations were carried out by both professionals and non-professionals alike assisting with their equipment."
  },
  {
    "headline": "Kano Approves Multi-Million Naira Gogori, Kabo Roads, Placement Of Granite Projects",
    "summarized_story": "Kano State Executive Council (KSEC) has given approval for the execution of various infrastructure development projects in both urban and rural areas in the state.\nThe state Commissioner for Information, Malam Muhammad Garba, announced this while briefing newsmen on the outcome of the council’s weekly meeting held at the Africa House, Government House, Kano.\nHe said the council approvals for the projects include that of a contract for the supply and placement of polished Nigerian granite at Tijjani Hashim (Galadiman Kano) Underpass at the cost of N525, 435, 750.00 million.\nThe project is aimed at controlling the high level of dampness, modernizing, and further beautifying the existing structure.\nThe project, when completed, he said, would boost agricultural-cum-commercial activities and ease the transportation of both dry and rainy season’s farm produce, poultry, and animal husbandry."
  },
  {
    "headline": "BREAKING: Biodun Oyebanji wins Ekiti APC governorship ticket -",
    "summarized_story": "A former Secretary to the Ekiti State Government, Biodun Oyebanji, has emerged the candidate of the All Progressives Congress in Ekiti State.\nMr Oyebanji emerged victorious with 101,703 votes, defeating seven other contestants.\nAdvertisementBreakdown of the votes shows that Bamidele Faparusi polled a total of 376 votes, Ojo Kayode had 767 votes, Opeyemi Bamidele, a serving Senator had 760 votes, Dayo Adeyeye, a former lawmaker polled 691 votes, Femi Bamisile polled 400 votes,.\nOthers are Toyin Afolabi who polled 47 votes and Demola Popoola who scored 239 votes.\nAdvertisementEarlier, seven aspirants announced their withdrawal from the contest, citing irregularities as reason for their exit."
  },
  {
    "headline": "Deposed Deji of Akure, Oba Oluwadare Adepoju, is dead",
    "summarized_story": "The deposed Deji of Akure, Oba Oluwadare Adepoju, has passed on in the early hours of Thursday after a brief illness.\nAdvertisementThe deceased, who ruled for five years, was deposed by the former Governor of Ondo State, Olusegun Mimiko, following a crisis between him (Adepoju) and his wife, Late Bolanle Adepoju that led to a free-for-all between the couple.\nAccording to the statement, “Oba Oluwadare Adepoju has passed on to the eternal glory this morning, January 27, 2022 during a brief illness.\n“The late Oba Adepoju was deposed by former Governor of Ondo State, Dr. Olusegun Mimiko on grounds of misunderstanding between the monarch and his wife.\nAdvertisement“Before his transition to the eternal glory, the deposed monarch prayed for the peace of Akure Kingdom”“He said he did his best in defending his people while on the throne”AdvertisementHe was the first monarch to be deposed in the history of Akure"
  },
  {
    "headline": "Protest rocks Ekiti APC Secretariat few hours to primary election",
    "summarized_story": "Few hours before the start of the Direct Primary in Ekiti State, several disgruntled party members have approached the Secretariat armed with various placards, protesting what they call “Midnight Robbery.”Protesters claim that election materials were sent overnight to government appointees, implying that the Governor is attempting to force his favored candidate on the party.\nAdvertisementThree of the aspirants, Michael Opeyemi Bamidele, Kayode Ojo, and Bamidele Faparusi, also joined the protest requesting for the primary election to be postponed."
  },
  {
    "headline": "Bisi Kolawole emerges Ekiti PDP Governorship candidate with 671 votes -",
    "summarized_story": "The just-concluded People’s Democratic Party primaries in Ekiti state have produced Bisi Kolawole as the party’s governorship candidate.\nMr kolawole emerges the winner with a total vote of 671 beating his closest challenger Segun oni who garnered 330 votes.\nAdvertisement"
  },
  {
    "headline": "UK Criminalize Virginity Repair Surgery – What’s Trending",
    "summarized_story": "Nigerians plead with the government to intervene as the UAE denies work permits for over 500 Nigerians, who remain without jobs, resulting in homelessness amongst other issues.\nThe United Kingdom makes it illegal to undergo hymen repair surgeries and virginity tests, with the intention to safeguard vulnerable women and girls across the country.\nThe procedure has been labelled as “honour-based abuse” and the move to criminalise it is supported by the World Health Organization."
  },
  {
    "headline": "ECOWAS to Hold Extraordinary Meeting on Friday Over Burkina Faso Coup",
    "summarized_story": "The West African bloc ECOWAS will meet virtually on Friday to discuss the crisis in Burkina Faso, where army officers have deposed President Roch Marc Christian Kabore, the group said.\nThe extraordinary summit on Burkina will start at 10:00 GMT on Friday and be held virtually, ECOWAS said in a note on Wednesday.\nIn August 2020, army officers deposed Mali’s elected president, Ibrahim Boubacar Keita, who had likewise been facing protests for his handling of the country’s violence.\nGuinea underwent a coup in September last year, when officers toppled President Alpha Conde, 83, who had been president since 2010.\nBoth Guinea and Mali have been suspended from ECOWAS, and the bloc has imposed an array of sanctions against those countries."
  },
  {
    "headline": "Elon Musk Space Rocket on Collision Course with the Moon",
    "summarized_story": "A chunk of a SpaceX rocket that blasted off seven years ago and was abandoned in space after completing its mission will crash into the Moon in March, experts say.\nThe rocket was deployed in 2015 to put into orbit a NASA satellite called the Deep Space Climate Observatory (DSCOVR).\nIt was Gray who calculated the space junk’s new collision course with the Moon.\nIn 2009, NASA sent a rocket stage hurling into the Moon near its south pole to look for water.\n“It’s actually no one’s job to keep track of the junk that we leave out in deep earth orbit,” he said."
  },
  {
    "headline": "Prince Andrew Denies Close Friendship with Ghislaine Maxwell in US Court Files",
    "summarized_story": "Elsewhere, the document “denies” Ms Guiffre’s claim that Prince Andrew was a close friend of Maxwell.\nPrince Andrew has shown he’s ready to fight this out in court, firmly rejecting all the claims against him.\nBut if that doesn’t happen, Prince Andrew has shown he’s ready to put his case to a New York jury.\nThey also refer to a 2009 settlement agreement between Ms Giuffre and Jeffrey Epstein, a longtime associate of Prince Andrew.\nThe new court documents describe the Queen’s second son as “Prince Andrew, Duke of York aka Andrew Albert Christian Edward, in his personal capacity”."
  },
  {
    "headline": "AFCON: Egypt Beat Ivory Coast on Penalties to Reach Quarter-Finals",
    "summarized_story": "Egypt beat Ivory Coast 5-4 on penalties to reach the quarter-finals at the Africa Cup of Nations in Cameroon following a 0-0 draw.\nAnd Pharaohs captain Mohamed Salah netted the decisive penalty to send the record seven-time champions through.\nEgypt will face Morocco in the last eight in Yaounde on Sunday (16:00 GMT).\nTwo-time champions Ivory Coast had knocked out holders Algeria en route to topping their group, but Egypt had finished second in theirs after losing their opening game against Nigeria.\nThe North Africans had the better of the first half, with Omar Marmoush rattling the Ivory Coast crossbar and Salah having two attempts tipped over by Badra Ali Sangare."
  }
]