[
  {
    "headline": "Surrender: It’s difficult to accept one’s parents’ killers, says Zulum",
    "summarized_story": "The governor spoke on Saturday in Bama and Gwoza, while addressing military officers and community leaders.\nZulum, according to his spokesman, Mallam Isa Gusau, was in Gwoza and Bama local government areas for humanitarian and developmental activities.\nHe said, “Accepting Boko Haram has the risk of seriously offending the feelings of victims with the potential of civil rebellion.\n“No one would find it easy to accept killers of his or her parents, children and other loved ones.\nIn the last 12 years, we have been in this war, and we have lost thousands of fellow citizens.”Copyright PUNCH."
  },
  {
    "headline": "‘Security agencies extort herders negotiating farm destruction’",
    "summarized_story": "THE Nigeria Police, Immigration and Customs have been accused of contributing to the worsening insecurity and the incessant herders/farmers crisis in the country.\nHe said some unscrupulous policemen and officers were fond of extorting herders in the name of negotiating between them and farmers whose crops were destroyed.\nElegbede specifically blamed the Customs and Immigration for allowing foreign herders to troop into the country unchecked, saying many of the atrocities being committed were done by foreign herders grazing in the country.\nThe ex-AFAN chairman said, “The Immigration allows foreigners to come in and this is causing a serious crisis between herders and farmers.\nThis will make the herders angry and the farmers will also be angry.”Copyright PUNCH."
  },
  {
    "headline": "Gateway Hotel Ota: Multimillion investment rots, houses rodents as Daniel, Amosun’s cold war ruins Ogun legacy project",
    "summarized_story": "The Gateway Hotel, Ota, is located less than 100 metres away from the old Sango tollgate, a location that serves as the boundary between Lagos and Ogun states.\nFindings show that the Gateway Hotel, Ota, is the biggest of the three with 350 rooms and suites.\n“Gateway Hotel, Ota, is strategically located on the hilly side of the Ota-Lagos boundary close to the popular Ilo-Awela River,” he explained.\nIsiaka explained, “What happened to Gateway Hotel, Ota, is exactly the same thing that happened to Gateway Hotel, Abeokuta, and Gateway Hotel, Ijebu-Ode.\n“It may interest you to know that the Gateway Hotel, Ota, was one of the places we visited."
  },
  {
    "headline": "Gov Ishaku Mourns as Taraba Rep Member Loses Father",
    "summarized_story": "Darius-IshakuBy Femi Bolaji Jalingo-Taraba State Governor, Darius Ishaku has commisirated with member representing Karim-Lamido/ArdoKola /Lau Federal Constituency in the House of Representatives, Danladi Tijo, over the loss of his Father, Rev.\nBaido Joseph Tijo.\nIshaku in a statement by his Special Adviser on Media and Publicity, Bala Dan-Abu, described the deceased as a great servant of God who played a key role in the spread of Christianity to the hinterlands of Taraba State and the entire North East region of Nigeria.\nREAD ALSO:Prof. Sulyman AbdulKareem, Bowen University, Riverbank School, Salem University, others awarded in the 2021 National Education Summit and AwardsAccording to him, “the late clergyman earned for himself alot of respect and recognition from which the younger members of the Baido Tijo family would continue to profit for a long time to come.\n“I urge members of the family of the late Baido Tijo to take solace in the fact that their patriarch had, through his good deeds here on earth, earned for himself a place of honour in the Kingdom of God.“He also prayed for the repose of the soul of the late clergy."
  },
  {
    "headline": "Ataga: Family hires Ozekhome, seek Justice in their son’s brutal murder",
    "summarized_story": "Only a few days ago, the family of late Ataga had accused the Lagos State Police Commissioner, Hakeem Odumosu, of being complicit in an alleged attempt to protect the killers of Ataga.\nThe family had also accused the Lagos State Police Commissioner, Mr. Odumosu, of being complicit in bungling the case of Ataga’s murder through his lack of depth, thoroughness, and professionalism in his investigation of Ataga’s brutal murder.\nThe Usifo family had also decried the alleged comfortable movement to prison from court and from court back to the prison, of Chidinma in an Uber ride.\nThe family said it could understand these over-liberal bail terms in such a heinous crime of hideous and horrific murder.\nThe family views these acts by the Police as a slap on their face, the face of justice, and a deliberate cover-up by the Police."
  },
  {
    "headline": "Obasanjo commends sponsor of OBJ Golf Tourney",
    "summarized_story": "Former President, Chief Olusegun Obasanjo, on Sunday, commended First Bank of Nigeria Ltd for being consistent toward organising the annual OBJ Golf Tournament.\nThe statement said Obasanjo spoke at the closing ceremony of the fifth edition of the tournament in Abeokuta on Saturday.\nObasanjo expressed optimism that the tournament would remain a regular and consistent tournament on the nation’s golf calendar.\n“Golf is more relaxing, gentler, more entertaining and friendlier and I believe there is no sport like it,” Obasanjo said.\nThe OBJ Golf Tournament debuted in 2015 and has been played consistently ever since."
  },
  {
    "headline": "Five killed in Kaduna community, Acting Governor condemns violence, appeals for calm",
    "summarized_story": "By Ibrahim Wuyo, KadunaActing Governor of Kaduna State, Dr. Hadiza Balarabe has described as shocking and inhuman, an attack that left five residents dead in Kaura LGA.\nSamuel Aruwan, Commissioner, Ministry of Internal Security and Home Affairs, Kaduna State, said on Sunday that troops of Operation Safe Haven reported to the Kaduna State Government that Madamai village in Kagoro Chiefdom, Kaura LGA, was attacked by unidentified assailants.\nREAD ALSO:11 hostages escape from bandits’ camps in Kaduna – CommissionerFive people were killed, and nine houses, as well as three vehicles, were burnt, while one vehicle was vandalized.\nThe deceased have been identified as follows:Janet YakubuGambo YakubuJonathan AdamuMrs MondayHumphrey BarnabasHe said the Acting Governor received the report with sadness, and condemned the resurgence of gruesome violence in the area.\nThe Acting Governor also appealed to residents to remain calm, and directed security agencies to conduct thorough investigations into the incident."
  },
  {
    "headline": "Brain drain: Sanwo-Olu approves recruitment of clinical staff for health sector",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos StateBy Olasunkanmi AkoniGovernor, Mr. Babajide Sanwo-Olu has approved the recruitment of clinical staff to fill the existing vacancies in the 27 secondary healthcare facilities in the state aimed at reducing brain drain ensuring residents get optimal care.\nIn a statement by the Permanent Secretary, Lagos State Health Service Commission, Dr. Ademuyiwa Eniayewun, the move was in line with the THEMES’s agenda of the present administration and fulfilling the promise of qualitative healthcare delivery to the residents of the state.\n“Application for existing vacancies is strictly online.\nInterested candidates should visit the health service commission job portal to apply at HTTP/www.ISHSC-Recruitment.com.ng“Application opens from Monday, August 16, 2021, to Saturday, September 4, 2021.\nNote that only shortlisted candidates will be contacted for the computer-based test and interview.”"
  },
  {
    "headline": "How 21 Army recruitment applicants died in Jigawa accident – Police",
    "summarized_story": "The Police in Jigawa has said the 21 persons who lost their lives in the state died after a bridge collapsed in Gwaram Local Government Area.\nHe, however, said only one person identified as Simon Chinapi survived the accident with a leg fracture.\nAn eyewitness who is also the Chairman State Civil Society forum, Musbahu Basirka, said the bridge collapsed following a heavy downpour that flooded and covered the area.\nHe said all the 21 passengers died on the spot.\nThey include 11 disqualified military recruitment applicants and nine other passengers."
  },
  {
    "headline": "Atiku condemns killings in Plateau",
    "summarized_story": "Former Vice President Atiku Abubakar has condemned the attack on innocent travellers on a major highway in Plateau and the killings in other parts of the country.\nAbubakar in a statement issued by his Media Adviser, Mr Paul Ibe, on Sunday in Abuja commiserated with the families of the deceased.\nHe acknowledged that security outfits were doing their best in the current circumstances to make all Nigerians safe.\nHe, however, said skirmishes such as the killings and the pain accompanying it make citizens feel as though enough is not being done.\nHe prayed that the Almighty Allah would heal Nigeria and accept all the souls that had been lost to those cruel acts of killings."
  },
  {
    "headline": "Ngige explains why FG placed embargo on employment",
    "summarized_story": "Senator Chris Ngige, Minister of Labour and Employment, has explained that the Federal Government placed an embargo on employment into the Federal Civil Service because the economy was not in good shape.\nNgige explained that the Buhari led federal government created small jobs and empowerment programmes to fortify social safety nets and establish a social protection system.\nSpeaking at his Abuja residence while receiving the traditional ruler of Nnewi town, Igwe Kenneth Orizu (III), Ngige said, “The Federal Government placed an embargo on employment because the economy is not in good shape.\n”He, however, stated that the federal government has Home Support Programmes like Conditional Cash Transfer and others to cushion the hard economy.\nNgige, pledged to ensure that all Nigerians, including Nnewi indigenes, were given jobs when the Federal Government lifts the embargo on employment."
  },
  {
    "headline": "‘You’ll be my father now’ – Gov Abiodun tells Obasanjo after losing dad",
    "summarized_story": "After the death of his biological father, Ogun State Governor, Dapo Abiodun, has adopted former President Olusegun Obasanjo as his father.\nAbiodun said this Sunday when Obasanjo paid him a condolence visit in his Iperu country home, over the death of his father, who reportedly died in London.\nDAILY POST reports that Gov Abiodun’s dad, Pa Emmanuel, died on August 2.\nIn his words, Abiodun described Obasanjo as an asset that should be exploited to the fullest, saying he would not go now.\nYou have been my ‘father’ over the years, but now that my biological father has gone to meet with the Saints, you have to step up now to be my father,” Abiodun said."
  },
  {
    "headline": "Rukuba attack: Plateau group tackles police over alleged ‘incitive’ statement",
    "summarized_story": "A local group in Jos, ‘The Plateau Initiative for Development and Advancement of Natives’, (PIDAN) has described a statement issued by the Plateau State Police Command in the wake of skirmishes that led to the killing of some passengers along Rukuba Road Jos on Saturday as incitive.\nThe statement which was signed by its President and Secretary-General, Prof. Madaki JKA and Comrade Nanle Gujor, expressed disappointment that the Police never reacted so swiftly through a statement when Irigwe people were being killed on daily basis.\nThe group said the statement was insensitive and capable of generating hatred amongst the diverse ethnic nationalities in the state in particular and Nigeria at large.\nAccording to the statement, the Rukuba skirmish was shrouded in confusion which the police ought to have done a thorough investigation before arriving at those who were responsible.\nWhile commiserating with those who lost their loved ones, the group urged security agents to be proactive to stop the recurrence of crisis in Plateau State."
  },
  {
    "headline": "Nigeria’ll rise above security, socioeconomic challenges — Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo on Sunday said Nigeria will rise above the current security and socio-economic challenges facing it.\nThe Vice President stated this during a send forth service for Revd (Dr) Israel Akanji, who served as Senior Pastor and Minister- In- Charge of the First Baptist Church, Garki, Abuja, for 22 years.\nQuoting from Genesis 1, the Vice President related events surrounding the creation of heaven and earth to the nation’s present challenges and the lives of great individuals.\nOsinbajo said: “In the beginning when God created the heavens and the earth, the earth was without form, and void; and darkness was on the face of the deep.\nIn the next verse, scripture says, God saw the light that it was good….so it shall be for you and our nation."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Arin, Princess evicted",
    "summarized_story": "Princess and Arin have been evicted from the BBNaija Shine Ya Eyes House after polling the lowest votes from viewers and voters.\nThe housemates will join ex-housemates, Yerins, Niyi and Beatrice evicted in the second week of the BBNaija Shine Ya Eye.\nTheir eviction was announced by the show host, Ebuka Obi Uchendu during the third BBNaija Shine Ya Eye Sunday Live eviction show on Sunday, August 15, 2021.\nThe evicted housemates have successfully lived a total of 21 days in the BBNaija Shine Ya House and participated in three Head Of House games, six diary sessions and three Saturday night parties.\nThe housemates up for possible eviction as nominated are Arin, Nini, Tega, Princess and Emmanuel."
  },
  {
    "headline": "BREAKING: Barcelona win first post-Messi match",
    "summarized_story": "Barcelona won their first La Liga match of the post-Lionel Messi era with a 4-2 victory that saw Real Sociedad mount a late rally on Sunday night.\nTheir season-opening match at Camp Nou comes after a drama-filled week that saw club legend Messi join Paris Saint-Germain on a free transfer.\nGerard Pique scored Barca’s first goal on the night with a close-range header from Memphis Depay’s free kick delivery in the 19th minute.\nADVERTISEMENTMartin Braithwaite doubled Barca’s lead just seconds before half-time with a back-post header off a delivery from Frenkie de Jong.\nLa Real pulled one back in the 82nd minute when Julen Lobete scored, with Mikel Oyarzabal scoring three minutes later to cut Barca’s lead to one."
  },
  {
    "headline": "Atiku condemns killings in Plateau, others",
    "summarized_story": "Former Vice President Atiku Abubakar has condemned the attack on innocent travellers on a major highway in Plateau and the killings in other parts of the country.\nAbubakar in a statement by his Media Adviser, Mr Paul Ibe, on Sunday in Abuja commiserated with the families of the deceased.\nHe acknowledged that security outfits were doing their best in the current circumstances to make all Nigerians safe.\nHe however said skirmishes such as the killings and the pain accompanying it make citizens feel as though enough is not being done.\nHe prayed that the Almighty Allah would heal Nigeria and accept all the souls that had been lost to those cruel acts of killings."
  },
  {
    "headline": "Kaduna: Bandits kill 5, burn 9 houses, vehicles in fresh attacks",
    "summarized_story": "From Noah Ebije, KadunaBandits at the weekend went on rampage, killing no fewer than five persons, burning houses and vehicles in Madamai village, Kagoro Chiefdom in Kaura local government area of Kaduna State.\nSecurity report said the community was attacked by unidentified assailants.\nThe Acting Governor of the State, Dr. Hadiza Balarabe has condemned the attacks and appealed for calm, adding that the attacks was shocking and inhuman.\n“The Acting Governor received the report with sadness, and condemned the resurgence of gruesome violence in the area.\n“The Acting Governor also appealed to residents to remain calm, and directed security agencies to conduct thorough investigations into the incident."
  },
  {
    "headline": "Plateau attack: Military rescue 36 victims, arrest 20 suspects",
    "summarized_story": "From Gyang Bere, JosThe Commander of Operation Safe Haven, Major General Ibrahim Ali said troops have rescued 36 victims of fresh attack along Rukuba road in Jos, North Local Government Area of Plateau State.\nGen. Ali in a statement signed by Military Information Officer, Ishaku Takwa said the Command has intensify patrol and dominated Jos Metropolis.\n“Troops of Operation SAFE HAVEN has continued with patrols to search for the few remaining victims of Rukuba road attack on commuters in Jos.\n“As at today 15 August 2021, troops of Operation SAFE HAVEN have rescued a total of 36 victims of the attack.\nSecurity checkpoints have also been beefed up to enforce the curfew imposed on Jos North, Jos South and Bassa local government areas."
  },
  {
    "headline": "Insecurity: UNIJOS suspends exams over security threats",
    "summarized_story": "From Gyang Bere, JosThe University of Jos has suspended its ongoing second semester examination following the fresh attacks and security threats in Jos metropolis.\nDeputy Registrar, Information and Publications, Abdullahi Abdullahi in a press statement on Sunday said the suspension became necessary due to the fresh security threats.\n” Consequently, all Examinations earlier scheduled between Monday 16th and Saturday 21st , August, 2021 have been suspended until further notice.\nStaff of the University are also enjoined to remain at home while the 24-hour curfew remains in effect.\n“Members of the University Community especially Staff and Students are hereby advised to exercise caution and comply with all security directives during this period.”"
  },
  {
    "headline": "Agitations: CAN urges FG to dialogue with Kanu, Igboho",
    "summarized_story": "This was contained in a communiqué of the association after its state executive meeting held yesterday at Emmanuel Anglican Church, Onitsha, Anambra State.\nThe body insisted that dialogue was the best approach towards unity and justice.\nCAN frowned at the activities of the security agents, who it said, always mount roadblocks, extorting money through intimidation of the populace.\nAbraham Nwali of Ebonyi State branch on his emergence as the new SoutheEast zonal chairman of the CAN.\nCAN urged the youths not to allow themselves to be used as political thugs during the campaigns and called on eligible voters to ensure that they obtained their voters cards."
  },
  {
    "headline": "UN September protest: Yoruba nation, Biafra agitators flee Nigeria",
    "summarized_story": "So, their next plan is to embark on massive crackdown of other known figures within the groups.\n“It has now dawned on them that the proponents of Oodua Nation and Biafra really mean business because of the way these groups have carried on with their demand for freedom despite the clampdown on the leaders of the groups,” the source said.\nRather, it stated that NINAS was currently perfecting plan to stage a ‘One Million March’ during the 76th Session of the United Nations General Assembly billed for 14 to 21 September 14 to 21.\n“The planned march shall be historic and epoch-making.\nWe want the whole world to see the level of injustice, oppression and intimidation currently going on in Nigeria."
  },
  {
    "headline": "BREAKING: Ex-President Jonathan's Former Aide, Kingsley Kuku Arrested In Amsterdam Over Child Pornography",
    "summarized_story": "Kingsley Kuku, who was Special Adviser to former President Goodluck Jonathan on Niger Delta Affairs has been arrested in Amsterdam, The Netherlands over child pornography complaints.\nAccording to information available to SaharaReporters, Kuku reportedly circulated child pornography materials in 2018.\n\"Kingsley Kuku was arrested in Amsterdam,\" a top government source privy to the incident told SaharaReporters.\n\"His warrant was executed over child pornography complaints.\nIn January 2011, he was appointed Special Adviser to former President Jonathan on the Niger Delta and Chairman, Niger Delta Presidential Amnesty Programme."
  },
  {
    "headline": "BREAKING: Ex-President Jonathan's Former Aide, Kingsley Kuku Arrested In Amsterdam Over Child Pornography",
    "summarized_story": "Kingsley Kuku, who was Special Adviser to former President Goodluck Jonathan on Niger Delta Affairs has been arrested in Amsterdam, The Netherlands over child pornography complaints.\nAccording to information available to SaharaReporters, Kuku reportedly circulated child pornography materials in 2018.\n\"Kingsley Kuku was arrested in Amsterdam,\" a top government source privy to the incident told SaharaReporters.\n\"His warrant was executed over child pornography complaints.\nIn January 2011, he was appointed Special Adviser to former President Jonathan on the Niger Delta and Chairman, Niger Delta Presidential Amnesty Programme."
  },
  {
    "headline": "REVEALED: How National Youth Service Doctors Attended To Late Northern Statesman, Ahmed Joda Due To Resident Doctors’ Strike",
    "summarized_story": "SaharaReporters learnt that Joda, who died at a time the National Association of Resident Doctors is on an industrial action, was attended to by doctors from the National Youth Service Corps and a few consultants who were the only ones on duty.\nIn the same week, President Muhammadu Buhari and Bola Tinubu, both leaders of the ruling All Progressives Congress (APC), were in the United Kingdom seeking medical services.\nHowever, Dodo told SaharaReporters that the hospital did not shut down despite the doctors’ strike, but many services were affected.\n\"The scenario is summarily the experience with the current industrial action embarked upon by the National Association of Resident Doctors.\nNote that NARD is only a category of medical doctors."
  },
  {
    "headline": "REVEALED: How National Youth Service Doctors Attended To Late Northern Statesman, Ahmed Joda Due To Resident Doctors’ Strike",
    "summarized_story": "SaharaReporters learnt that Joda, who died at a time the National Association of Resident Doctors is on an industrial action, was attended to by doctors from the National Youth Service Corps and a few consultants who were the only ones on duty.\nIn the same week, President Muhammadu Buhari and Bola Tinubu, both leaders of the ruling All Progressives Congress (APC), were in the United Kingdom seeking medical services.\nHowever, Dodo told SaharaReporters that the hospital did not shut down despite the doctors’ strike, but many services were affected.\n\"The scenario is summarily the experience with the current industrial action embarked upon by the National Association of Resident Doctors.\nNote that NARD is only a category of medical doctors."
  },
  {
    "headline": "Why I Abandoned Afghanistan For The Deadly Taliban—President Ghani After Fleeing Country",
    "summarized_story": "Afghanistan’s embattled president, Ashraf Ghani, who fled the country on Sunday, has addressed the people of the Asian nation, stating the reasons why he left.\nHe said, “The former president of Afghanistan left Afghanistan, leaving the country in this difficult situation.\nGod should hold him accountable.”Associated Press news agency reports that Ghani flew out of the country.\nBut in his statement addressed to the people of Afghanistan, Ghani said, \"In the name of Allah, the Most Gracious, the Most Merciful.\nIt was learnt that the country would now be the Islamic Emirate of Afghanistan, according to Press Association reports citing a Taliban official."
  },
  {
    "headline": "Haiti earthquake: Death toll hits 1,297 as rescue efforts continue",
    "summarized_story": "The death toll from the magnitude 7.2 earthquake that rocked Haiti, on Saturday, has risen to 1,297.\nAdvertisementThe ministry of communications in Haiti, confirmed the figure at a briefing on Sunday evening.\nRescue efforts are ongoing, but there are concerns that health facilities may be overwhelmed as a result of the number of injured persons seeking medical attention.\nWhile commending the efforts of persons assisting with the rescue efforts — including volunteer health workers — Ariel Henry, prime minister of Haiti, while speaking on the latest development on Sunday evening, appealed for assistance.\nIn 2010, an earthquake in the Caribbean country led to the death of at least 200,000 people."
  },
  {
    "headline": "Haiti earthquake: Death toll hits 1,297 as rescue efforts continue",
    "summarized_story": "The death toll from the magnitude 7.2 earthquake that rocked Haiti, on Saturday, has risen to 1,297.\nAdvertisementThe ministry of communications in Haiti, confirmed the figure at a briefing on Sunday evening.\nRescue efforts are ongoing, but there are concerns that health facilities may be overwhelmed as a result of the number of injured persons seeking medical attention.\nWhile commending the efforts of persons assisting with the rescue efforts — including volunteer health workers — Ariel Henry, prime minister of Haiti, while speaking on the latest development on Sunday evening, appealed for assistance.\nIn 2010, an earthquake in the Caribbean country led to the death of at least 200,000 people."
  },
  {
    "headline": "Auto crash victims trapped in Ebonyi mining pit as rescue efforts enter day two",
    "summarized_story": "More than 24 hours after a bus plunged into a mining pit in Enyigba community, along the Abakaliki-Ikwo road in Ebonyi state, no passenger has been rescued.\nRescue efforts began on Saturday evening, and as of Sunday evening, no victim had been rescued.\nAdvertisementAccording to NAN, scores of people watched the rescue efforts and shouted whenever the crane tried to retrieve the bus.\nSpeaking on the development, Loveth Odah, Ebonyi police spokesperson, said rescue efforts will continue on Monday.\nAdvertisementStephen Orogwu, chairman of Ikwo LGA, described the incident as unfortunate, noting that the marshy terrain of the area made rescue efforts difficult."
  },
  {
    "headline": "Auto crash victims trapped in Ebonyi mining pit as rescue efforts enter day two",
    "summarized_story": "More than 24 hours after a bus plunged into a mining pit in Enyigba community, along the Abakaliki-Ikwo road in Ebonyi state, no passenger has been rescued.\nRescue efforts began on Saturday evening, and as of Sunday evening, no victim had been rescued.\nAdvertisementAccording to NAN, scores of people watched the rescue efforts and shouted whenever the crane tried to retrieve the bus.\nSpeaking on the development, Loveth Odah, Ebonyi police spokesperson, said rescue efforts will continue on Monday.\nAdvertisementStephen Orogwu, chairman of Ikwo LGA, described the incident as unfortunate, noting that the marshy terrain of the area made rescue efforts difficult."
  },
  {
    "headline": "Mailafia: Elites fanning embers of war -- ordinary people have no problem with each other",
    "summarized_story": "Obadiah Mailafia, a former deputy governor of the Central Bank of Nigeria (CBN), has accused elites of promoting civil strife in Nigeria.\nI like to listen to people in the rural areas — the ordinary people — and they have no problem with each other.\n“It is elites who are fanning, firing these embers of war and civil strife.\nAdvertisement“We have a peculiar disease in northern Nigeria perpetuated by elites.\nBut when you open your mouth small, they say ‘who told you to say that?"
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "Beyond funding, MAGIC Fund’s value-add helps early-stage founders scale",
    "summarized_story": "A fund by founders for foundersMAGIC Fund, launched in 2017, is an early-stage venture capital fund built by founders turned investors.\n“MAGIC is like a fund of micro funds built by founders,” Greenleaf told TechCabal in an interview.\nHelping founders on their journeyTwo, MAGIC believes that smaller funds run by founders perform best in early-stage investing.\nThis way, they help early-stage founders find product-market fit, fine-tune business models, and fundraising strategies for successful seed rounds.\nAccording to Greenleaf, the Fund’s partners offer mentoring, advice, and network connectivity to support investee-founders as they scale their businesses."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, What we’re discussing today: Yemi Keri and more women becoming angel investorsFundraising in Africa so..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "Gold suffers worst week in 2 monthsGold had its worst week in 7 weeks as the market closed bearish on Friday by 2.73%, crumbling below the $1,800 trading zone.\nIn the coming week, oil prices are expected to hold steady as concerns about the spread of the Delta coronavirus variant is set to weigh on prices.\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold in the NAFEX window.\nTreasury Bills MarketThe bills market continued its bullish trend across the board last week, as we saw some buying on all tenors through the week.\nMarket breadth for the week closed flat with 29 gainers led by HONYFLOUR and NNFM as against 29 losers led by JULI and REGALINS."
  },
  {
    "headline": "2023: Who will rebuild Nigeria?",
    "summarized_story": "Nigeria today has become a laughing stock in the comity of nations, even on the African continent where it claims to be the giant.\nEven an unborn baby can sense that all is not well with Nigeria.\nIn the last few months, some leading politicians have declared their interest in the presidential race in Nigeria.\nPerhaps, the first was former, Zamfara State governor, Sanni Yerima, Kingsley Moghalu, a former deputy governor of the Central Bank of Nigeria (CBN) and Sam Ohuabunwa, president of the Pharmaceutical Society of Nigeria (PSN).\nIn the last one week there have been mixed reactions across Nigeria on the former military ruler’s comments and what should form the yardstick for anyone to emerge Nigeria’s president in 2023."
  },
  {
    "headline": "Love, money, celebs and sports top Nigerians Google search in 15years",
    "summarized_story": "These were the two most searched questions in Nigeria over the last 15 years as Google Trends turned 15.\nGoogle trends, the search tool providing insights into what netizens are searching for at any given moment, which turned 15 this week, has offered insights into search patterns over the years.\nFrom entertainment to sports and culinary concerns including dieting, Nigerians have turned to the search engine to meet their information needs.\nGoogle Search trends information is gleaned from data based on what Nigerians have been searching for.\nFrom the international scene, the likes of Cardi B and Kanye West also commanded a lot of interest from Nigerians."
  },
  {
    "headline": "Obaseki assures of sustained investment in state’s security architecture …pledges improved security across Edo communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has reassured residents that his government will sustain investment in the state’s security architecture to ensure the protection of lives and property of citizens.\nObaseki gave the assurance when he received executive members of Esan Okpa Initiative, who were on a courtesy visit at the Government House, Benin City.\nAccording to him, “We are working to ensure that we improve the security situation in the State.\nWe will follow the world’s best practices in ensuring the school becomes world-class.\nMathew Egbodon said the group, an umbrella body for Esan people worldwide, is ready to collaborate with the government on issues concerning the Esan people."
  },
  {
    "headline": "Obaseki tasks youths on innovative use of tech to address food challenges – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged young people to join the global effort in exploiting technological innovations to build enduring systems to tackle food challenges so as to feed the world’s growing population in the wake of the coronavirus (COVID-19) pandemic.\nThe governor said this in commemoration of the International Youth Day marked by the United Nations and its sister organisations.\n“Through the Edo State Skills Development Agency (EdoJobs), we organise trainings for Edo youths on in-demand technology-oriented skills especially to encourage them to provide solutions to the global demand for healthy foods,” Obaseki said.\nHe noted that the state government will sustain the execution of other youth-focused training, as Edo State transits to become the technology hub of South-south Nigeria.\nIt also aims to promote ways to engage them in becoming more actively involved in making positive contributions to their communities.”..."
  },
  {
    "headline": "NNL Rescheduled week 24: Insurance Thrash Crown FC 4-0,Shaibu hails team’s home win record – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBendel Insurance Football Club of Benin, weekend thrashed Crown FC of Ogbomosho 4-0 in the Nigeria National League (NNL) week 24 rescheduled match to maintain hundred percent home win record.\nOn resumption, Insurance looked unsatisfied with the 2-0 lead,as they continued to fight for more until Bright Osah tried a long range shot that Crown FC Goalkeeper could not stop to increase the tally.\nThe Benin Arsenal have two away games remaining,J.Atete FC and Joy Cometh of Lagos.\nWe have shown good example of sportsmanship; how football game should be.\nIt is on record that each time we finished playing in Benin, players of both teams hug each other and excange pleasantries."
  },
  {
    "headline": "Group hails Obaseki for infrastructural devt in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A group of professionals under the aegis of Obaseki/Shaibu Support Group, Rivers State, has applauded Governor Godwin Obaseki of Edo State for prioritising investment in infrastructural development.\nUsen listed some of the projects to include the Gelegele River Port Construction, Edo Production Centre, Ossiomo Power Plant, Reactivation of the Rubber Plant in Urhoghide and the Edo Industrial Park, among others.\n“We see the work of his Excellency as building a great foundation for industrial and economic growth of Edo State.\nThis is excellent and much of the benefits may not be seen within the lifetime of this administration.”On his part, Governor Obaseki, who was represented by the Chief of Staff to the Governor, Hon.\nOsaigbovo Iyoha, hailed the group for the support, noting, “We thank your group for the support and showing leadership when it was needed; we will continue to support the group."
  },
  {
    "headline": "Unlawful Detention: Nigerian Army disobeys court, refuses to release Enugu gov’s aide",
    "summarized_story": "Mr Okeke’s lawyer, Chinedum Agwaramgbo, had filed a fundamental rights enforcement suit for the release of his client imprisoned by the 82 Division, Nigerian Army, Enugu.\nThe Nigerian Army, the Chief of Army Staff, Farouk Yahaya, and the General Officer Commanding ( GOC) 82 Mechanised Division Enugu, Taoreek Lagbaja, are the 1st and the 3rd respondents in the suit.\nThe court had on July 29, 2021, ordered the Army to produce Mr Okeke and show cause why the detainee should not be released on bail.\nThe court had on July 29, 2021, ordered the Army to produce Mr Okeke and show cause why the detainee should not be released on bail.\nMr Okeke has been detained without charge since July 5 making Sunday his 41st day of his incarceration."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "UniJos suspends academic activities over insecurity",
    "summarized_story": "The Management of the University of Jos (UniJos), has suspended the ongoing second semester examination for the 2019/2020 academic session due to insecurity.\n“All students of the university residing in the various hostels are hereby strongly advised to remain within their hostels of residence and avoid unnecessary movements.\n“Similarly, students that are resident outside the campus, and members of staff, are also advised to remain at home while the 24-hour curfew remains in effect,” he said.\nAbdullahi thanked the state government and security agencies for ensuring the safety of students and staff of the university at all times.\nThe situation made the state government to impose a 24-hour curfew in Jos North and dusk-to-dawn in Bassa and Jos South local government areas."
  },
  {
    "headline": "Afghan president Ashraf Ghani flees as Taliban takes Kabul",
    "summarized_story": "Afghanistan’s president, Ashraf Ghani, has reportedly fled the country as the Taliban takes the country’s capital, Kabul.\nThe senior official told Reuters the Taliban were coming in “from all sides” but gave no further details.\nA Taliban official told Reuters the group did not want any casualties as it took charge but had not declared a ceasefire.\n“There are no clashes taking place right now in Jalalabad because the governor has surrendered to the Taliban,” a Jalalabad-based Afghan official told Reuters.\nBiden said it is up to the Afghan military to hold its own territory."
  },
  {
    "headline": "Plateau gov orders 24-hour curfew as tension mounts over killing of 23 travellers",
    "summarized_story": "Few hours after announcing a dusk-to-dawn curfew in three local government areas of Jos North, Jos South and Bassa, Plateau State governor, Simon Bako Lalong has directed the imposition of a 24-hour curfew in Jos North to contain further security threats.\nThis comes after travellers were yesterday ambushed and about 23 killed by suspected Irigwe youth in apparent retaliatory attack.\nThe state governor, Rotimi Akeredolu, had yesterday, condemned the attack in a statement.\nThe killing follows months of repeated clashes between rigwe youth and Fulani herders who had reportedly sustained attacks in the area for periods.\nThis is as the Inspector-General of Police (IGP) Usman Baba, on Sunday ordered the immediate deployment of Police Intervention Team to Plateau State to carry out an on-the-spot assessment."
  },
  {
    "headline": "Eight more die from Covid-19 as Nigeria records 665 new cases",
    "summarized_story": "Eight more Nigerians died on Saturday from Covid-19, as the country recorded recorded 665 fresh cases of the virus across 12 states and the Federal Capital Territory (FCT).\nThe update by the NCDC indicated that more than half of the new cases reported on Saturday in Nigeria were recorded in Lagos State.\nWith 369 cases out of the 665 infections, Lagos State has remained Nigeria’s coronavirus pandemic epicentre.\nEdo and Delta states also reported 21 and seven new Infections respectively while Ekiti State registered 15 and its nearby Ondo State reported 13.\nMeanwhile, the NCDC said about 166,826 of the over 181,000 total infections in Nigeria have recovered after treatment"
  },
  {
    "headline": "21 Die In Jigawa Road Mishap",
    "summarized_story": "The police command in Jigawa State has confirmed the death of 21 people in yesterday’s road accident which occurred in Gwaram local government area.\nThe command’s police public relations officer, ASP Lawan Shiisu, confirmed the incident to newsmen in Dutse.\nShiisu said the incident occurred after a Hummer Bus, conveying 18 passengers from Kano to Adamawa, and an unregistered lorry with three passengers fell into a broken culvert covered with flood water.\nHe said, “Today, at about 6 a.m., we received a distress call from Radabi village that an accident occurred on the Gwaram-Basirka Road.\n“The accident occurred after one Hummer bus with Reg."
  },
  {
    "headline": "21 Die In Jigawa Road Mishap",
    "summarized_story": "The police command in Jigawa State has confirmed the death of 21 people in yesterday’s road accident which occurred in Gwaram local government area.\nThe command’s police public relations officer, ASP Lawan Shiisu, confirmed the incident to newsmen in Dutse.\nShiisu said the incident occurred after a Hummer Bus, conveying 18 passengers from Kano to Adamawa, and an unregistered lorry with three passengers fell into a broken culvert covered with flood water.\nHe said, “Today, at about 6 a.m., we received a distress call from Radabi village that an accident occurred on the Gwaram-Basirka Road.\n“The accident occurred after one Hummer bus with Reg."
  },
  {
    "headline": "Afghan President Flees As Taliban Surrounds Kabul",
    "summarized_story": "The head of the Afghan National Reconciliation Council, Abdullah Abdullah, confirmed in an online video that President Ashraf Ghani had left, yesterday.\nLocal media reported that Ghani left for Tajikistan.\nAbdullah said he wants security forces to continue providing security for Kabul and asked the Taliban to wait for talks before entering the city.\nInstead, the Taliban swiftly defeated, co-opted or sent Afghan security forces fleeing from wide swaths of the country, even though they had some air support from the US military.\nLater, Afghan forces at Bagram airbase, home to a prison housing 5,000 inmates, surrendered to the Taliban, according to Bagram district chief Darwaish Raufi."
  },
  {
    "headline": "Afghan President Flees As Taliban Surrounds Kabul",
    "summarized_story": "The head of the Afghan National Reconciliation Council, Abdullah Abdullah, confirmed in an online video that President Ashraf Ghani had left, yesterday.\nLocal media reported that Ghani left for Tajikistan.\nAbdullah said he wants security forces to continue providing security for Kabul and asked the Taliban to wait for talks before entering the city.\nInstead, the Taliban swiftly defeated, co-opted or sent Afghan security forces fleeing from wide swaths of the country, even though they had some air support from the US military.\nLater, Afghan forces at Bagram airbase, home to a prison housing 5,000 inmates, surrendered to the Taliban, according to Bagram district chief Darwaish Raufi."
  },
  {
    "headline": "Again, bandits kill five, burn nine houses in fresh Kaduna attack",
    "summarized_story": "Again, bandits kill five, burn nine houses in fresh Kaduna attackAgain, bandits kill five, burn nine houses in fresh Kaduna attackSome bandits have reportedly invaded Madamai village in Kagoro Chiefdom, Kaura Local Government Area of Kaduna State, killing five persons.\nHe said the Acting Governor of the state, Dr. Hadiza Balarabe has condemned attack and appealed for calm.\nThe Commissioner said, “Acting Governor Dr Hadiza Balarabe has condemned as shocking and inhuman, an attack which left five residents dead in Kaura LGA.\n“This came after troops of Operation Safe Haven reported to the Kaduna State Government that Madamai village in Kagoro Chiefdom, Kaura LGA, was attacked by unidentified assailants.\n“The Acting Governor also appealed to residents to remain calm, and directed security agencies to conduct thorough investigations into the incident."
  },
  {
    "headline": "Again, bandits kill five, burn nine houses in fresh Kaduna attack",
    "summarized_story": "Again, bandits kill five, burn nine houses in fresh Kaduna attackAgain, bandits kill five, burn nine houses in fresh Kaduna attackSome bandits have reportedly invaded Madamai village in Kagoro Chiefdom, Kaura Local Government Area of Kaduna State, killing five persons.\nHe said the Acting Governor of the state, Dr. Hadiza Balarabe has condemned attack and appealed for calm.\nThe Commissioner said, “Acting Governor Dr Hadiza Balarabe has condemned as shocking and inhuman, an attack which left five residents dead in Kaura LGA.\n“This came after troops of Operation Safe Haven reported to the Kaduna State Government that Madamai village in Kagoro Chiefdom, Kaura LGA, was attacked by unidentified assailants.\n“The Acting Governor also appealed to residents to remain calm, and directed security agencies to conduct thorough investigations into the incident."
  },
  {
    "headline": "Narrow escape: Mr Raw survives auto crash in Abuja",
    "summarized_story": "Veteran Igbo rapper, Okechukwu Edwards Ukeje, aka Mr Raw, has reportedly survived a ghastly motor accident in Abuja.\nDisclosing this on his Instagram page @talk2raw, the rapper asked Nigerians to thank God for his life, noting that a driver rammed into his vehicle in Abuja.\nI was involved in a ghastly motor accident early this morning at abuja (before Bannex junction)….I was unconscious when I was pulled out of the red car after a another driver rammed into our car.\nI passed out twice but i am stable now and responding to treatment.\nThe driver is receiving treatment as well."
  },
  {
    "headline": "Presidency strongly condemns hoodlum attacks on travellers",
    "summarized_story": "By TANKO ALIThe Presidency condemns the attack earlier Saturday on travellers from a religious event in Bauchi, passing through Jos, the Plateau State Capital and regrets the reported deaths of at least twenty-two persons with several others injured in that ambush on their travelling party.\nIt is widely known that Plateau State has been one of the states affected by herder-farmer clashes, which have, in a significant way, been curtailed following the intense peace-building efforts of the administration of Governor Simon Lalong.\nWith the evident preparedness of their attackers, it is clear this was a well-conceived and prearranged assault on a known target, location and religious persuasion of the travellers not an opportunist ambush.\nThe Presidency offers condolences to the families of the victims and continues to liaise closely with the local authorities – including security, the police, and governmental agencies.\nThese kinds of attacks on our country’s citizens are unacceptable, heinous, and stand in complete contradiction to the teachings of the great religions of our nation."
  },
  {
    "headline": "What IBB told me to tell Jonathan when Yar'Adua was sick",
    "summarized_story": "Nigerian billionaire, Femi Otedola has let out a deep secret of what former Military President, Ibrahim Badamosi Babangida (IBB) asked him to tell ex-President Goodluck Jonathan when his former boss, Umaru Yar’Ardua was sick.\nAccording to Otedola, IBB asked him to tell Jonathan to sit on the empty seat of Yar’Adua in the next Federal Executive Council (FEC) meeting, as a result of the logjam caused by the former president’s absence when he was sick.\nHe said he asked Babangida how the country could get out of the political logjam, emphasising that the political heat at the time was “too much”.\nAccording to Otedola, Jonathan nodded and asked him what he thought about IBB’s suggestion.\n“A week later, on Tuesday, February 9, the National Assembly adopted the famous ‘Doctrine of Necessity’ to make Dr Jonathan the Acting President pending the return of President Yar’Adua from his medical leave."
  },
  {
    "headline": "Nigeria Governors: Massacre of 23 travellers in Jos barbaric, senseless",
    "summarized_story": "By Emmanuel OloniruhaThe Nigeria Governors’ Forum (NGF) has condemned the tragic incident that led to the loss of 23 travellers at Rukuba Road in Jos North Local Government Area of Plateau.\nThe forum flayed the attacks in a statement issued by its Head, Media and Public Affairs, Mr Abdulrazaque Bello-Barkindo, in Abuja on Sunday.\n“They also cause all kinds of reprisal killings and injurious interactions that does nobody any good.\nThe governors’ forum hope that Nigerians would desist from taking the law into their own hands so that the country could once again become a safe place for all.\nThe forum called on all aggrieved ethnic nationalities and their militia to avoid needless killings by always seeking law enforcement assistance and legal redress."
  },
  {
    "headline": "Unknown Gunmen Kidnap Three Herdsmen, Injure One In Abuja",
    "summarized_story": "On Sunday, kidnappers broke into a Fulani community in the Dogon-Ruwa community of Kwali Area Council, Abuja, abducting three herders and injuring one.\nAccording to him, the kidnappers broke into two Fulani communities in the community, and one of the herders was injured with a machete by one of the gunmen while attempting to flee.\n“It was when one of the herders was attempting to escape that he was attacked with a machete by one of the kidnappers,” he said.\nThe event was confirmed by Ardo of Fulani, the spokesman for Gwomani chiefdom, Malam Haruna Gambo.\nHe claimed the kidnappers took four herders at first, but eventually let the injured one go."
  },
  {
    "headline": "21 Army Recruits Die In Car Accident In Jigawa",
    "summarized_story": "In Jigawa State, about 21 military recruits were killed in an accident.\nTheir vehicle became drowned in flood at the Gwaram/basirka route in Jigawa State, resulting in their death.\nASP Lawan Shiisu Adam, a police spokesman, reported the incident to DAILY POST.\nThe military recruits, he added, were on their way to Gombe State."
  },
  {
    "headline": "Zuma Undergoes Surgery, To Remain In Hospital",
    "summarized_story": "South Africa’s imprisoned ex-president Jacob Zuma has undergone surgery and will remain in hospital for further procedures, according to the government.\nZuma was moved from prison to a health facility earlier this month.\n“Mr Zuma underwent a surgical surgery on Saturday, August 14, 2021, with other surgeries expected in the coming days,” the correctional services department said in a statement, adding that it couldn’t foresee a release date at this time.\nOn August 6, the 79-year-old was admitted to the hospital for observation for an unexplained illness, and he has stayed there ever since.\nZuma began serving a 15-month prison sentence in a different case last month for ignoring a committee investigating state crimes during his presidency from 2009 to 2018."
  },
  {
    "headline": "Popular Broadcaster Dayo Adeneye Locked Inside Faulty Air Peace Lavatory",
    "summarized_story": "Dayo Adeneye, a popular Nigerian broadcaster, has regretted his ordeal aboard an Airpeace trip, claiming he was stuck in the plane’s restroom the whole voyage.\n“I really hate to be one of those complaining about this our great country, but I have just spent an entire domestic flight on Air Peace trapped in the lavatory,” he wrote.\nD1, as he is fondly called, did not disclose the route he was flying to but said it was a domestic flight.\nThe former Ogun Information commissioner said the airline attendants barely apologised to him after breaking the lavatory door open to later free him.\nMr Adeneye’s complaints comes weeks after another Air Peace customer, Yinka Kotoye, demanded a public apology from the airline after his flight was delayed for hours, disrupting his itinerary."
  },
  {
    "headline": "2023: I didn’t rule out Atiku, Tinubu – IBB",
    "summarized_story": "Former Military President General Ibrahim Badamasi Babaginda (retd) has said he didn’t rule out National Leader All Progressives Congress (APC) Ahmed Tinubu and former Vice President Atiku Abubakar from the 2023 presidential race.\nBoth Atiku and Tinubu are in their late seventies and sixties respectively, and the duo are believed to be eyeing the nation’s number one seat in 2023.\nBabangida said: “You the media misquoted me to say that I said Atiku and Tinubu should not contest in 2023.\nI travelled back to Abuja by road in the evening and went straight to have dinner with Dr Jonathan.\nAs Dr Jonathan entered the Council Chamber, he made to sit on the chair of the Vice President—his usual seat."
  },
  {
    "headline": "Breaking: Arin evicted from BBNaija season 6 ‘Shine Ya Eye’ show",
    "summarized_story": "Arinola Olowoporoku popularly known as Arin has been evicted from the ongoing big brother season 6 Shine Ya Eye edition.\nShe was among the six housemates nominated last Monday for possible eviction during live eviction show.\nDetails loading…"
  },
  {
    "headline": "Breaking: Team Nigeria arrive Kisarazu ahead Tokyo paralympic games, sure of medal haul (Pictures)",
    "summarized_story": "Team Nigeria just touched down Kisarazu, the site of their training camp on Sunday before departing for Tokyo for the 2020 paralympic games.\nWith less than a week to the commencement of the 2020 Paralympics, Team Nigeria athletes have assured of an impressive outing in Tokyo.\nAccording to Team Nigeria Paralympics Captain, Lucy Ejike, “We have been training seriously to make sure we meet up with the standard we set at previous games.\nThe Tokyo 2020 Paralympics games will be Nigeria’s 8th consecutive appearance since its maiden appearance at Barcelona 1992.\nNigeria will participate in four events at the Tokyo 2020 Paralympics including powerlifting, para-athletics, para-table tennis and para-rowing."
  },
  {
    "headline": "Crumbling terrorists’ dynasty and role of air power -NigPilot",
    "summarized_story": "It was a Russian-American aviation pioneer, inventor, and influential advocate of strategic airpower, Alexander Nikolaievich Prokofiev de Seversky who posited that “Only air power can defeat airpower.\nThe actual elimination or even stalemating of an attacking Air Force can be achieved only by a superior Air Force”.\nHere, NAF aircraft prevented the troop’s location from being overrun and inflicted heavy casualties on the ISWAP forces leading to their eventual withdraw.\nThe air operations destroyed three (3) gun trucks, neutralized many terrorists, and prevented our troop’s location from being overrun.\nThe successes recorded by NAF’s air component also extended to Operation HADARIN DAJI (OPHD) in the Northwest as well."
  },
  {
    "headline": "Akpabio commissions Corps Members’ lodge in Rivers -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio, has commissioned and handed over the newly completed Corps’ Members’ Lodge and Viewing Centre constructed by the ministry in Koroma Tai Community, Tai Local Government Area of Rivers State.\nIn a statement made available by Mrs. Deworitshe Patricia, Director of Press and Public Relations in the ministry, Akpabio while handing over the project, urged the Koroma Tai Community to be dedicated to the protection and maintenance of the property to complement government efforts.\nHe informed that the Niger Delta region should expect more intervention projects as soon as the 2022 appropriation bill is passed.\nWe have noted and learned many lessons from the development of this project and will factor this into future projects”.\nChairman of Tai LGA, Friday Mbakpone reacting, noted that corps members play important roles in the community, school and offices, just as he commended the Niger Delta ministry for providing comfort to the youth."
  },
  {
    "headline": "Aggrieved APC Members Join YPP in Kwara -NigPilot",
    "summarized_story": "Group of People who had initially denounced their membership from the All Progressives Congress (APC) Kwara state chapter has officially joined the Young Progressives Party (YPP) in the state.\nThe group disclosed this while addressing Journalists at the YPP party secretariat in Ilorin, Kwara state capital said the group picked YPP ahead of other parties due to outstanding attributes the party posses.\nAddressing Journalists, the coordinator of the group, Hon.\nStating the reason why the group settled for YPP, AbdulFatah said “we have reached out to the existing registered political parties in Nigeria.\nIt is evident that they have seen the light ahead and have decided to join the true progressives party to fix Nigeria and Kwara State in particular” he said"
  },
  {
    "headline": "Lack of resources, bane of energy efficiency in West Africa – Hon. Tunis – NigPilot",
    "summarized_story": "The Community Parliament of the Economic Community of West African States (ECOWAS) has said that lack of resources and ignorance is the bane of energy efficiency in West Africa.\nThe Speaker of ECOWAS Parliament Rt.\n“Even more important was the disclosure of the opportunities that energy efficiency provides and how investments in energy provide relatively quick returns with a high degree of certainty”.\nWhile noting that improving energy efficiency is about dollars and cents, the Speaker said that its impact on society is far-reaching.\nHe explained that the Parliament is inclined to emphasize that private sector engagement is fundamental to the community goal of achieving energy efficiency."
  },
  {
    "headline": "COVID-19: Buhari, Others Isolate After UK Trip",
    "summarized_story": "President Muhammadu Buhari as well as members of his delegation have gone into isolation after a two-week trip to London, UK.\nPresident Buhari had on July 26 travelled to London, United Kingdom to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025 and see his doctors.\nDuring the visit, the Nigerian leader also met and played host to various dignitaries including the UK Prime Minister, Boris Johnson.\nThe Prime Minister during the meeting assured Buhari that the UK is available to assist Nigeria in its war against terrorism.\nAfter 19 days abroad, President Buhari returned to the country."
  },
  {
    "headline": "Plateau Attack: Gov Lalong Imposes Curfew On Three LGAs",
    "summarized_story": "Plateau State Governor Simon Lalong has imposed a curfew on Jos North, Bassa and Jos South Local Government Areas following Saturday’s attack on Rukuba Road in Jos North Local Government Area of the state.\nTwenty-three people – who were travelling from Bauchi en-route Jos to Ikare in Ondo State – were killed in the incident.\nThe governor, in a statement he signed on Saturday, said the curfew became necessary to avoid an escalation of tension in the affected areas.\nHe explained that the curfew shall remain in place subject to further review by the State Security Council.\nGovernor Rotimi Akeredolu on his part appealed to residents of the state not to take laws into their hands following the attack on indigenes of the state."
  },
  {
    "headline": "Afghan President Flees Country As Taliban Captures Kabul",
    "summarized_story": "President Ashraf Ghani fled Afghanistan on Sunday, a top official said, effectively ceding power to the Taliban as they reached the capital Kabul to seal a nationwide military victory in just 10 days.\n“The former Afghan President has left the nation, leaving the people to this situation,” Abdullah Abdullah, who heads the peace process, said in a video on his Facebook page.\nIn just over a week, the Taliban have carried out a lightning sweep of the country, with troops incapable of holding onto territory without US military support.\nREAD ALSO: UK PM Holds Afghanistan Crisis Talks, Recalls ParliamentBut later, a spokesman tweeted that Taliban forces should enter areas deserted by Afghan forces in order to maintain law and order.\nThat decision has come under increased scrutiny given the collapse of the Afghan armed forces, but he insisted Saturday there was no choice."
  },
  {
    "headline": "Nine Killed As Bandits Attack Sokoto Villages",
    "summarized_story": "Bandits have killed nine persons in an attack on Bejingo, Dantudu, and Tulutu villages in Birjin ward, Goronyo Local Government Area of Sokoto State.\nAn anonymous source in the local government told Channels Television that the assailants attacked the villages on Saturday, raiding houses.\nSokoto, a state in Nigeria’s north-western region, has had its fair share of banditry and kidnapping for ransom.\nLate last month, bandits killed two people and abducted over 60 travellers along the Sokoto-Gusau highway.\nIn May, gunmen also killed 12 people in Illella Amarawa, Illela Local Government Area of the state."
  },
  {
    "headline": "Team Nigeria Paralympians Assure Of Medal Haul In Tokyo",
    "summarized_story": "With less than a week to the commencement of the Tokyo 2020 Paralympics, Team Nigeria athletes have assured supporters of an impressive outing in Tokyo.\nWe have world records, so we hope to maintain the records and create new ones”.\nWe have many world records and our target is to go there and make Nigeria proud,” he said.\nThe Tokyo 2020 Paralympics games will be Nigeria’s 8th consecutive appearance since her maiden appearance at Barcelona 1992.\nNigeria will participate in four events at the Tokyo 2020 Paralympics viz; Powerlifting, Para-Athletics, Para-Table Tennis and Para-Rowing."
  },
  {
    "headline": "At least 20 dead, 79 injured in Lebanon fuel tanker explosion",
    "summarized_story": "A petrol tanker exploded in Lebanon Sunday morning, killing at least 20 people and injuring 79 others, as individuals were allegedly attempting to siphon gas from a nearby warehouse amid a fuel shortage, the Lebanese Red Cross said.\nThe Red Cross said that 20 persons were killed and 79 were injured in the Akkar area incident, with 24 ambulances and 75 EMTs responding at the scene, and a search for missing people was also underway.\nThe source of the explosion was still being investigated, however several of those injured indicated they were attempting to siphon gas from a neighboring warehouse, according to Lebanon’s National News Agency.\nThe Lebanese Army had been present at the site earlier in the day after men discovered the stored fuel.\nPeople rushed to the area to fill the remaining gas in the tank after the army left."
  },
  {
    "headline": "Death toll from Haiti earthquake now 724 as tropical storm looms",
    "summarized_story": "The dead toll from a devastating earthquake in Haiti increased to 724 on Sunday, as rescue teams battled to discover survivors buried beneath buildings a day after the 7.2 magnitude quake and as a tropical cyclone pressed down on the Caribbean country.\nSouthwestern Haiti took the brunt of the damage, particularly in and around the city of Les Cayes.\nHaitian officials reported at a press conference on Sunday that the death toll from the disaster had risen to 724 while rescue efforts continued.\nChurches, hotels, hospitals, and schools were severely damaged or destroyed, and the tremendous shudders that shook Haiti ripped open the walls of a prison.\nThe approach of tropical storm Grace, which is expected to hit Haiti with heavy rain on Monday, is expected to hamper the rescue attempts."
  },
  {
    "headline": "Plateau attacks: 21 suspects arrested, 36 victims rescued",
    "summarized_story": "The search for the few surviving casualties of the Rukuba road attack on commuters in Jos has resumed with patrols by Operation SAFE HAVEN troops.\nTo preserve peace and order, troops have dominated Jos metropolis with strong patrols and surveillance.\nOperation SAFE HAVEN personnel have rescued a total of 36 victims of the attack as of today, August 15, 2021.\nIn connection with the horrible conduct, more arrests have been made, bringing the total number of suspects in custody to 21.\nThe security checkpoints in Jos North, Jos South, and Bassa local government areas have also been tightened up to enforce the curfew."
  },
  {
    "headline": "Muhammadu Buhari: Africa Needs More Than US Military Aid to Defeat Terror",
    "summarized_story": "Despite rising attacks across Africa in the past decade, international assistance has not followed in step.\nBut what Africa needs most from the US is a comprehensive partnership to close the disparity between our economic and demographic growth.\nThe US already has schemes such as Power Africa, which invests in the continent’s essential energy infrastructure.\nUltimately, Africans need not swords but ploughshares to defeat terror.\nThe author, Muhammadu Buhari is President of the Federal Republic of Nigeria"
  },
  {
    "headline": "Taliban Fighters Enter Kabul from ‘All Sides’ But Have No Plans to Take City ‘By Force’",
    "summarized_story": "The Taliban has entered the Afghan capital Kabul from all sides, the Afghan interior ministry said on Sunday.\nThe Taliban said it has no plans to take the Afghan capital “by force”.\nThe armed group issued the statement as its fighters moved to the outskirts of Kabul.\n“The Islamic Emirate instructs all its forces to stand at the gates of Kabul, not to try to enter the city,” a spokesman for the Taliban tweeted, although some residents reported fighters peacefully entered some outer suburbs.\nThe speed of the Taliban offensive has shocked many and raised questions about why Afghan forces crumbled despite years of US training and billions of dollars spent."
  },
  {
    "headline": "Taliban Control All Key Afghan Cities Except Kabul",
    "summarized_story": "The Taliban have moved closer to retaking full control of Afghanistan, with the capital Kabul now the only major city left in government hands.\nOn Sunday the militants took control of Jalalabad, a key eastern city, without a fight.\nReports on Sunday morning said the Taliban overran the city, the capital of Nangarhar province, without a shot being fired.\n“Allowing passage to the Taliban was the only way to save civilian lives.”Journalist Tariq Ghazniwal tweeted images purportedly showing the provincial governor handing over control to the Taliban.\n“God forbid we will see war in Kabul,” city resident Sayed Akbar, 53, told the New York Times."
  },
  {
    "headline": "Ivory Coast Records First Case of Ebola in 25 years",
    "summarized_story": "Ivory Coast has recorded its first case of the Ebola hemorrhagic virus in 25 years, according to the country’s health minister.\nIn a separate statement, the World Health Organization (WHO) said the case was Ivory Coast’s first Ebola infection since 1994.\nGuinea – site of the 2014-2016 Ebola outbreak, the deadliest on record – experienced a four-month Ebola outbreak earlier this year that was declared over on June 19.\nThe WHO said there was no indication the current case in Ivory Coast is linked to the outbreak in Guinea earlier this year.\nThe WHO said it was helping to coordinate a cross-border response, which included transferring 5,000 doses of the Ebola vaccine from Guinea to Ivory Coast."
  },
  {
    "headline": "Over 300 Dead After Haiti Struck by Deadly 7.2-Magnitude Earthquake",
    "summarized_story": "A powerful earthquake has struck the Caribbean nation of Haiti, killing at least 304 people and injuring more than 1,800.\nHaiti is still recovering from a devastating 2010 earthquake.\nArchdeacon Abiade Lozama, head of an Episcopal church in Les Cayes, told the New York Times: “The streets are filled with screaming.\nWe lived [through] the 2010 earthquake and all I could do was run.\nThe 2010 earthquake in Haiti killed more than 200,000 people and caused extensive damage to infrastructure and the economy."
  }
]