[
  {
    "headline": "Amotekun commandant urges vigilance in Ekiti",
    "summarized_story": "The State Commandant, Ekiti Amotekun Corps, Brig.\n), said on Friday that security agencies in Ekiti State had taken proactive steps to prevent terror attacks on public places in the state and were on the alert.\nKomolafe also called on residents in the state to be vigilant and be willing to volunteer information to assist security agencies to checkmate crimes.\nThe Amotekun Commandant, who spoke with Saturday PUNCH, said, “Not only Amotekun, all the security agencies have put our heads together and we have taken steps to prevent such a thing.\nAll the security agencies in the state are on the alert.”Copyright PUNCH."
  },
  {
    "headline": "Rivers APC tackles Wike as gov threatens to prosecute Amaechi, Cole",
    "summarized_story": "He said Amaechi would be probed and prosecuted alongside Mr Tonye Cole, Sahara Energy and others.\nBut in a swift reaction, the spokesman for the All Progressives Congress in Rivers State, Chris Finebone, said Amaechi and Cole had no fear of appearing in court because they did no wrong.\nThe new commissioners are Prof. Zacchaeus Adangor, sworn in as Attorney General; Isaac Kamalu, Commissioner for Finance, Budget and Economic Planning; and Dr George-Kelly Alabo, as Commissioner for Works and Special Projects.\nWe know that and even the state government, that is Wike and his people, know that,” Finebone added.\nHe said, “The Rivers State Government has a judgment against the EFCC since 2007."
  },
  {
    "headline": "I remain committed to new Nigeria project — Osinbajo",
    "summarized_story": "Vice- President Yemi Osinbajo says he remains committed to the dream of a new Nigeria despite the outcome of the just-concluded All Progressives Congress (APC) Special Convention .\nThe vice president also said that he would support Sen. Bola Tinubu, winner and flagbearer of the APC for the 2023 presidential election.\nOsinbajo described the clamour for a new Nigeria as a movement.\nSome leaders of Osinbajo Support groups lauded the vice president for being a true leader and inspiration to millions of Nigerians.\nHajiya Rabbi Dauda, leader of the Coalition of Women for Osinbajo, , declared the vice president as a winner forever."
  },
  {
    "headline": "Sacrifices of dead Rivers’ APC stalwarts won’t be in vain — Peterside",
    "summarized_story": "Former governorship candidate of the All Progressives Congress, APC, in Rivers State, Dr Dakuku Peterside, has expressed shock over the tragic traffic event along the Gwagwalada Road, close to Abuja, that claimed the lives of two officials of the party in the state.\nThe victims were returning to Port Harcourt after the party’s Special National Convention which held last Monday.\nThey have planted, completed their parts and left though leaving us in tears, but their democratic credentials should always spur us to greater service”, the party stalwart added.\nHe also sent his condolences to the leadership of the party in the state, urging them to bear the pains with fortitude.\nPeterside tasked APC faithful in Rivers State to rally round the bereaved families as they left young wives and children, even as he noted that if there was any time APC in Rivers State must show love to them, it was now."
  },
  {
    "headline": "Owo massacre, a message to us-Soyinka",
    "summarized_story": "File: Professor Wole SoyinkaBy Olasunkanmi AkoniNobel laureate and renowned playwright, Prof. Wole Soyinka, has described the terror attack in Owo, last Sunday, as a message to the South West.\nSoyinka made the remark when he visited Ondo State Governor, Arakunrin Oluwarotimi Akeredolu,SAN, on Friday, at his office, Alagbaka, Akure on a condolence visit over the terror attack in Owo.\nI want the Governor to know that we have received the message.\n“We understand it and we came to sympathize with him that he was selected as a medium of that message.\n“So, the answer we must give to the message we all received is that we are not slaves."
  },
  {
    "headline": "CBN to introduce USSD code to improve eNaira",
    "summarized_story": "The Central Bank of Nigeria (CBN), says it is set to introduce the Unstructured Supplementary (USSD) code as part of steps to improve the Central Bank Digital Currency (CBDC).\nThe Deputy Governor of the CBN, Kingsley Obiora, said this at the IMF African Department Speakers Series held virtually on Friday.\nObiora said the introduction of the USSD code became necessary to improve financial inclusion in the country and to ensure people without smartphones could still transact on the eNaira platform.\nObiora said the value of the country’s digital payments grew from 324 billion dollars in 2008 to about 2.4 trillion dollars presently, adding that Nigerians were now used to digital payments.\nHe said that the CBDC had significant benefits for Nigeria, which was why the CBN decided to introduce it."
  },
  {
    "headline": "Housewife docked for alleged visa fraud",
    "summarized_story": "Sharia lawA Kano Sharia Court on Friday ordered that a 32-year-old housewife, Ummi Hussain, be remanded in a correctional centre for alleged visa scam.\nThe police charged Hussain, who lives in Kofar yamma in Wudil local government area with alleged criminal breach of trust, cheating, conspiracy and misappropriation.\nThe Judge, Malam smai’l Muhammed-Ahmed ordered that Hussain be remanded pending legal advice from the Department of Public Prosecution.\nHe directed security agencies to intensify efforts at ensuring that the Hussain’s alleged accomplice be apprehended before the next hearing.\nHe noted that the complainant later discovered that the defendants had converted the money to their personal use."
  },
  {
    "headline": "Wike orders prosecution of Ameachi, Cole, others over sales of state assets",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has ordered the Attorney General and Commissioner for Justice to commence “diligent prosecution” of the illegal financial dealings of the former Rivers State governor, Chibuike Rotimi Amaechi, governorship candidate of the All Progressives Congress in the state Tonye Cole, Sahara Energy and others over the sale of state assets.\nWike gave the directive on Friday during the swearing-in of three commissioners who were reappointed last week.\nHe said people want to find out what the state will do about the judicial panel of Inquiry set up by his administration to probe the sales of state assets to Sahara Energy.\nHe said “Attorney General, you’re at a critical period where people want to know what the State is going to do with the Judiciary Panel of Inquiry after the Supreme Court judgement on it.\n“Let the people see what happened to our money."
  },
  {
    "headline": "Baraza: EFCC declares Christ Embassy Pastor Miebi Bribena, wife wanted for ‘N2bn fraud’",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has declared a couple, Onyinmiebi (Miebi Baraza) and Beatrice Bribena, wanted.\nAn alert by the anti-graft agency urged persons with information about them to contact any of its offices across Nigeria.\nThe agency is searching for the duo over alleged fraud to the tune N2billion.\n“We are dedicated to improving members’ lives via financial empowerment, business financing, thrift & credit, housing, scholarship, etc”, its profile reads.\nBribena, a Peoples Democratic Party (PDP) chieftain in Bayelsa State, is pastor at Christ Embassy Church."
  },
  {
    "headline": "Death of traffic warden: Police vow to arrest culpable Oyo commercial drivers",
    "summarized_story": "The Police in Oyo State have condemned the gruesome murder of a traffic personnel on duty at New Garage Area in Challenge, Ibadan, the state capital.\nThe Public Relations Officer, SP Adewale Osifeso, in a statement Friday, said the incident occurred on Thursday at about 2030hrs.\nThe spokesman noted that he was attacked by commercial vehicle (Micra) operators after one of them committed a traffic offence.\nThe Deputy Commissioner of Police, Criminal Investigation Department (CID) has vowed to arrest “those responsible for the cold-blooded murder”.\nOsifeso assured that tactical and other crime prevention teams have been deployed to the area to forestall a breach of peace."
  },
  {
    "headline": "Afenifere reacts as court sentences killers of Olufunke Fasoranti to death",
    "summarized_story": "The apex pan-Yoruba socio-political organization, Afenifere, has commended the Nigerian judiciary for bringing the killers of a daughter of its leader, Mrs. Olufunke Olakunrin, to justice.\nFour suspects were arrested six months later and charged first to a magistrate court before the then Attorney General of the State, Mr. Kola Olawoye, got the case to be transferred to a High Court.\nIn a judgement delivered Friday, June 10, 2022, Mr. Justice William Olamide, sentenced three of the four suspects to death by hanging but discharged and acquitted the fourth defendant, Mr Abubakar, who was charged with aiding and abetting the crime.\nIn a statement he signed, Ajayi commended the Nigeria Police Force for diligently investigating and prosecuting the case.\nHe also commended the Ondo State government and the judiciary for their diligence in handling the case."
  },
  {
    "headline": "Ortom offers automatic employments to children of late AIG Awunah",
    "summarized_story": "Two children of the late Assistant Inspector-General of Police, AIG, Don Awunah, have been offered automatic employment into the Benue State Civil Service with immediate effect.\nBenue State Governor, Samuel Ortom made the announcement Friday, in his funeral oration at the burial ceremony of the deceased AIG held at his country home, Tse Awunah Chiba, Mbachohon, Gwer West Local Government Area.\nHe eulogized the late Police officer for his passion in supporting the less-privileged and providing a ladder for them to climb.\nEarlier in a funeral sermon, Reverend Father Jude Ortese who said the desire of God was for the people to live by helping to alleviate the suffering of others said the late AIG Awunah fulfilled that by helping the needy and contributing to the development of his community.\nBenjamin Mzondu and other members of the State Executive and Security Council among others."
  },
  {
    "headline": "Moghalu: Abrupt end of a dream",
    "summarized_story": "For Kingsley Moghalu, a former Deputy Governor of Central Bank of Nigeria (CBN) and presidential aspirant on the platform of the African Democratic Congress (ADC), it was an abrupt end to his dream of contesting and winning the next presidential election.\nMoghalu was declared loser of the contest after he was beaten to the party’s ticket by Dumebi Kachiku during the week.\nSentry gathered from close allies of the disappointed politician that he had high hopes of clinching the ADC ticket.\nMoghalu, however, said as a person of faith, he believes that God knows his plans for him, and will lead him to a perfect end that he may not know as a mere mortal.\nFriends and foes alike are now eagerly waiting to see what that end would be."
  },
  {
    "headline": "APC sticks to Otu as governorship candidate in Cross River",
    "summarized_story": "All wrangling and doubts surrounding the certificate of the All Progressives Congress (APC) governorship candidate in Cross River State have been rested following a final clearance from National Working Committee (NWC) of the party.\nProviding clarifications on the certificate matter, the Media Aide to Senator Otu, Barr.\nThe National Organizing Secretary, Mr. Sulaiman Mohammad Argungu in a letter to the Chairman, 2022 Governorship Primary Election Committee, said, “please be informed that Mr. Bassey Edet Otu has been cleared to participate in the governorship primary election.\nHis name as we speak is going to be forwarded to INEC as the candidate of the party in Cross River State.\nIf Prince Otu was not duly screened and cleared, the party would not forward such name to INEC."
  },
  {
    "headline": "Ngige seeks foreign support for Nigeria to achieve SDGs",
    "summarized_story": "Minister of Labour and Employment, Dr Chris Ngige has called for foreign support for Nigeria to achieve the Sustainable Development Goals SDGs) by 2030.\nThe minister noted that with the current state of growing inequality gap, the achievement of the SDGs by 2030 was at a great risk.\nThe conference has: “Social justice, decent work” as its theme.\nThis ultimately, is a bit to move the country on the path of sustainable development and economic growth.\nWe advocate a review of this practice especially as it relates to the LDCs economic performance and development,” he added."
  },
  {
    "headline": "Tinubu visits Amaechi, Bello, Umahi, Akpabio in reconciliation move",
    "summarized_story": "Tinubu visited former Transportation Minister Rotimi Amaechi, Kogi State Governor Yahaya Bello, Ebonyi State Governor Dave Umahi and former Niger Delta Affairs Minister Godswill Akpabio, 24 hours after a similar visit to Vice President Yemi Osinbajo.\nHe asked the Kogi State governor to support his campaign to improve the lives of Nigerians.\nThe former Lagos State governor described Umahi as a rallying point for Igbo integration in the mainstream national politics.\nChief Ogbeh, ascribed Tinubu’s victory to his wealth of experience which will help in strengthening the APC ahead of the forthcoming general elections in 2023.\nAbiodun visits himOgun State Governor Dapo Abiodun yesterday visited Tinubu and pledged his support to ensure victory in the presidential election."
  },
  {
    "headline": "JUST IN: Workers trapped as youths ground FCTA Secretariat",
    "summarized_story": "Some staff of the Federal Capital Territory Administration (FCTA) have been trapped as protesting FCT indigenes invaded the Secretariat premises to ground all activities.\nThe youths vowed to occupy the Minister’s office until he swears in Chairmen- elect of the Six Area Council in line with Thursday’s FCT High Court Order.\nRead Also: FCTA insists Abuja Okada operators must get permitAll gates leading to the secretariat have been shut with the angry protesters controllinh the entry and exit points including that of the FCT Ministers.\nConfused staff trapped in their various offices have been asked by the protesters to forget about returning home to their family members.\nThe FCT Ministers and the Permanent Secretary were all not on seat at the time of the invasion."
  },
  {
    "headline": "Owo massacre: FG claim on ISWAP too hasty-Akeredolu",
    "summarized_story": "He, however, assured that the state would do everything possible to avoid a repeat of the terrorist attack.\nGovernor Akeredolu noted that he took the conclusion with a pinch of salt, adding that ISWAP is known for claiming responsibility for its attacks.\nThe governor commended the international community for their prompt reactions on the killings in Owo, saying it was unprecedented.\nGovernor Akeredolu disclosed that government was determined to help the victims of the attack, particularly those who lost their loved ones and those on admission in the hospital.\nAdeleye who is also the chairman of Amotekun Commanders in the South West said efforts were on to secure all the states of the South West region from terrorist attack."
  },
  {
    "headline": "Bandits dare Kaduna govt, security agents, kidnap fresh 14 persons in Kajuru",
    "summarized_story": "Between last Saturday, June 4 and this Friday, June 10, 32 persons were killed and score abducted by the marauding bandits within the same Kajuru local government.\nAccording to this source, “bandits came again just a few hours after the military repelled them from causing more havoc in our communities and kidnapped 14 persons.\nBy the time they left, we discovered that 14 persons have been abducted.\n“As we speak, we are yet to ascertain the details of the missing persons.”, the source added.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Bloodbath as Boko Haram kills over 20 youths in Borno town",
    "summarized_story": "From Timothy Olanrewaju, MaiduguriOver 20 youths scavenging for disused metal and twisted iron have been killed by Boko Haram in a town in Borno.\nDozens of young men went into a remote liberated community in Dikwa Local Government in the central part of Borno in search of disused metal.\n“They were ambushed on the way and all metal collected from them by Boko Haram men.\nThe official said the Shehu of Dikwa, Alhaji Ibrahim El-Kanemi has warned the people of the area against going to the bush in search of disused metal.\nOn May 22, Boko Haram killed 35 youths from Kala Balge Local Government who went to scavenge for metal according to the state governor, Babagana Zulum in a statement."
  },
  {
    "headline": "BREAKING: Ugwuanyi imposes curfew on 2 LGAs in Enugu",
    "summarized_story": "Ifeanyi Ugwuanyi has imposed a dusk-to-dawn curfew on two local governments in Enugu North Senatorial District off the state.\nThe affected local governments are Igbo-Eze North and Igbo-Eze South.\nAccording to the statement, the curfew is “Pursuant to Executive Order No.\n3, 2022 and consequent upon security challenges in Igbo-Eze North and Igbo-Eze South Local Government Areas of Enugu State.”Gov.\nAlso the Enugu State Commissioner of Police was to take all lawful measures to enforce the order, “including arrest and prosecution of defaulters.”Partner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Peter Obi is authentic LP’s presidential candidate – Party’s scribe reiterates",
    "summarized_story": "The party’s scribe who spoke while featuring on a Kaduna-based FM radio station described Okafor and his co-travellers as “tools in the hands of those who do not wish Nigeria well”.\n“Those who think money can be used to buy everyone, but realised that the Labour Party is accepted by the majority of Nigerians who crave credible political leadership and see it as the only credible alternative to give Nigerians the President they desperate need to salvage the country”.\nIbrahim called on Nigerians, especially the citizens in the South-East not to be distracted by Okafor and his sponsors, urging them to mobilize support for Peter Obi, and utilise the Labour Party in his quest to liberate Nigeria from the shackles of money bags and godfatherism.\nAccording to Ibrahim, “the leadership and members of the Nigerian Labor Congress (NLC) recognized and endorsed the candidacy of Obi”.\nHe however reiterated that no faction exists in Labour Party, but in the “imagination of those who are foot soldiers of enemies of Nigeria and Nigerians”."
  },
  {
    "headline": "Breaking: Killers of Olufunke Olakunri, Daughter of Afenifere Leader, Sentenced to Death by Hanging",
    "summarized_story": "Fidelis David in AkureAn Ondo State High Court sitting in Akure, the state capital on Friday sentenced killers of Olufunke Olakunri, daughter of Afenifere leader to death by hanging.\nThey include: Lawal Mazaje from Kogi Sate; Adamu Adamu from Adamawa State; Mohammed Usman from Sokoto State.\nThe defendants were arraigned on counts of armed robbery, conspiracy, conspiracy to commit felony, conspiracy to commit armed robbery, kidnapping, murder, aiding and abetting.\n1 Laws of Ondo State of Nigeria, 2006.\n“You could see that one of the defendants was discharged by the judgement of the court court."
  },
  {
    "headline": "Buhari: Tinubu Has Track Record to Lead Our Party to Victory in 2023",
    "summarized_story": "Buhari stated this in a letter to the returning officer of the APC presidential primary convention and governor of Kebbi State, Atiku Bagudu, commending the success of the exercise.\n“Your commitment in pursuit of equity and fairness speaks volumes in the cooperation displayed by APC governors.\n“The party primaries were peacefully conducted and the delegates have selected the candidate to carry the APC flag in the 2023 presidential election.\n“I look forward to working closely with APC governors to support Senator Bola Ahmed Tinubu and all our APC candidates to success in 2023.\nTinubu was at the villa to thank the president for his support and successful hosting of the APC presidential primary."
  },
  {
    "headline": "FG: We’ve Traced Owo Killings to ISWAP",
    "summarized_story": "Unfortunately, gunmen, again struck in Sabo area of Ondo town, in Ondo West Local Government Area of the state and have killed six men.\n“The council is quite concerned about the violent attack in Owo, Ondo State, and has been able to locate the perpetrators of that horrendous attack.\n“It is not an ethnoreligious thing, the animals in ISWAP wanting attention, recognition, are suspected to have launched that attack.\nHe said, “They came to our area (Sabo) on motorbikes and each was carrying three gunmen.\nIt was against these developments that Afenifere, yesterday, paid a condolence visit to Ondo State Governor, Mr Oluwarotimi Akeredolu (SAN), in Akure, the state capital."
  },
  {
    "headline": "How Rivers PDP Guber Candidate Escaped EFCC Arrest",
    "summarized_story": "Blessing Ibunge in Port HarcourtIt was a narrow escape for the governorship candidate of the Peoples Democratic Party (PDP), Mr Siminialayi Fubara, Tuesday as operatives of the Economic and Financial Crime Commission (EFCC) attempted to arrest him at the Port Harcourt Airport.\nIt was further gathered that some of his supporters who were on ground to welcome him resisted the arrest by the EFCC and subsequently took him away from the area.\nMeanwhile, the EFCC has condemned the alleged attack on their operatives on official assignment to arrest the PDP governorship candidate.\nSee statement below:“EFCC condemns attack on operatives in Port Harcourt.\n“The armed thugs assaulted operatives of the Commission who demonstrated commendable restraint under extreme provocation."
  },
  {
    "headline": "News in Photographs: Tinubu Visits Osinbajo",
    "summarized_story": "Presidential candidate of the ruling All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, Thursday night paid a visit to Vice President Yemi Osinbajo at his Aguda residence at the State House, Abuja.\nOsinbajo was one of the aspirants that vied for the party’s presidential flag ar the special national convention held at Eagle Square Abuja.Tinubu was accompanied on the visit to Osinbajo by Lagos State Governor, Babajide Sanwo-Olu, and Chairman/ Chief Executive Officer of Oando Oil Plc, Wale Tinubu.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "PHOTOS: Yahaya Bello donates presidential campaign office to Tinubu",
    "summarized_story": "Yahaya Bello, governor of Kogi, has donated his presidential campaign office to Bola Tinubu, candidate of the All Progressives Congress (APC).\nTinubu was declared winner of the APC presidential primary on Wednesday, after polling 1,271 votes, while Bello — one of the 13 other aspirants — secured 47 votes.\nBello announced his decision to donate the campaign office in a letter of congratulations addressed to the APC presidential candidate, and dated June 9, 2022.\nI say thank you very much for donating a befitting office for us to continue to struggle,” Tinubu said.\nAdvertisement“We will use our intellectual inquisitiveness, build a nation of sound minds, sound people, elevate our people, extract them from poverty.”See photos below."
  },
  {
    "headline": "PHOTOS: Yahaya Bello donates presidential campaign office to Tinubu",
    "summarized_story": "Yahaya Bello, governor of Kogi, has donated his presidential campaign office to Bola Tinubu, candidate of the All Progressives Congress (APC).\nTinubu was declared winner of the APC presidential primary on Wednesday, after polling 1,271 votes, while Bello — one of the 13 other aspirants — secured 47 votes.\nBello announced his decision to donate the campaign office in a letter of congratulations addressed to the APC presidential candidate, and dated June 9, 2022.\nI say thank you very much for donating a befitting office for us to continue to struggle,” Tinubu said.\nAdvertisement“We will use our intellectual inquisitiveness, build a nation of sound minds, sound people, elevate our people, extract them from poverty.”See photos below."
  },
  {
    "headline": "Edo, Rivers, Lagos... NCDC confirms 10 new monkeypox cases in six states",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says 10 new cases of monkeypox have been confirmed in six states.\nThe NCDC had reported 21 cases and one death as of May 28.\nThe agency, in its recent monkeypox update, said 44 new suspected cases of monkeypox were reported from May 30 to June 5 from 14 states, of which 10 were confirmed positive from six states.\nAdvertisementThe states with new confirmed cases are Edo (2), Rivers (2), Plateau (2), Lagos (2), Ondo (1) and Imo (1).\nAdvertisement“In addition, from September 2017 to June 5th, 2022, a total of nine (9) deaths have been recorded (CFR= 3.5%) in six states – Lagos (3), Edo (2), Imo (1), Cross River (1), FCT (1) and Rivers (1).”"
  },
  {
    "headline": "Edo, Rivers, Lagos... NCDC confirms 10 new monkeypox cases in six states",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says 10 new cases of monkeypox have been confirmed in six states.\nThe NCDC had reported 21 cases and one death as of May 28.\nThe agency, in its recent monkeypox update, said 44 new suspected cases of monkeypox were reported from May 30 to June 5 from 14 states, of which 10 were confirmed positive from six states.\nAdvertisementThe states with new confirmed cases are Edo (2), Rivers (2), Plateau (2), Lagos (2), Ondo (1) and Imo (1).\nAdvertisement“In addition, from September 2017 to June 5th, 2022, a total of nine (9) deaths have been recorded (CFR= 3.5%) in six states – Lagos (3), Edo (2), Imo (1), Cross River (1), FCT (1) and Rivers (1).”"
  },
  {
    "headline": "Femi Adesina: Why Buhari didn't impose his preferred presidential candidate on APC",
    "summarized_story": "Femi Adesina, presidential spokesman, says President Muhammadu Buhari didn’t impose his preferred candidate for the All Progressives Congress (APC) presidential ticket because he wanted to be fair to all aspirants.\nAdesina spoke on the development in an article published on Thursday, titled ‘Knock Knock, Who’s There?’.\nKnock, Knock!\nKnock, Knock!\nKnock, Knock!"
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Moroccan Chari acquires Ivorian B2B e-commerce startup Diago",
    "summarized_story": "Chari, a Moroccan B2B e-commerce and fintech startup, today announced that it has acquired a 100% stake in Diago, an Ivorian app that connects neighborhood shops to FMCG producers and importers.\nThe all-stock transaction was facilitated by AF Legal and RBB International firms, representing Chari, and Houda Law Firm, representing the Ivorian upstart.\nThis acquisition is coming only 3 months after Chari acquired Axa Credit, the credit arm of Axa Assurance Maroc, for $22 million.\nJust last month, a Nigerian autotech startup Autochek travelled up north to acquire Moroccan KIFAL Auto.\nNow, Chari is acquiring a West African startup."
  },
  {
    "headline": "Boomplay launches in Côte d'Ivoire",
    "summarized_story": "Boomplay, a Chinese-owned music streaming platform for African artists and songs, has launched in Côte d’Ivoire.\nToday, the platform opened the doors of its Ivorian offices in Abidjan to enhance music streaming, and help Ivorian artists reach a broader audience within and outside the continent.\nCote D’Ivoire marks the 6th African country with Boomplay’s presence after Nigeria, Tanzania, Kenya, Tanzania, Ghana and Cameroon.\nSpeaking about the launch, Boomplay Côte d’Ivoire General Manager, Paola Audrey Ndengue, said, “We’re particularly proud to establish a presence in Abidjan, a creative and cultural hub in the region.\nGuy-Constant Neza, an Ivorian label manager at Believe Digital told Lemonde that 80% of Ivorian artists’ income comes from live performances."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigeria’s Agric export hits highest in Q1, here are the top products",
    "summarized_story": "Nigeria’s Agric export hits highest in Q1, here are the top productsNigeria exported agro-food items worth N201.6 billion in the first quarter of 2022, representing a 58percent increase compared to N127.3 billion recorded in the corresponding period of 2021.\nNBS data also showed Nigeria’s agricultural sector accounted for 4.96 percent of Nigeria’s total foreign trade in Q1 2022.\nThe agricultural product contributed 11.26 percent to total agricultural products traded and accounted for 36 percent of agricultural exports during the quarter.\nIn the same vein, the agricultural product accounted for 2.05 percent of the total agricultural products traded during the quarter.\nThe total value represents a 0.13 percent share of total exports during the period."
  },
  {
    "headline": "Urea replaces Sesamum seeds as Nigeria’s biggest non-oil export in Q1",
    "summarized_story": "Urea has replaced Sesamum seeds as Nigeria’s biggest non-oil export product in the first quarter of 2022, data sourced from the National Bureau of Statistics (NBS) has shown.\nAccording to the statistical agency, Urea ranked the third-highest of Nigeria’s export with a total of 2.93 percent share of total exports for the first quarter of 2022, a sharp contrast compared to the corresponding period last year when Sesame seeds accounted for the highest chunk of Nigeria’s non-oil export.\nThe cost of Nigeria’s exportation of Urea stood at N208.39 billion in the first three months of 2022 compared to N16.77 billion in the first three months of 2021.\nDuring the quarter, ‘Urea whether or not in aqueous solution’ was exported to Brazil at a value of N63.11 billion.\n“Our goal is to make fertilizer available in sufficient quantity and quality for our teeming farmers, assuring greater agricultural output,” Dangote said of operations in the fertilizer plant."
  },
  {
    "headline": "After humour of primaries, Nigerians focus on fragile economy, poverty and its misery",
    "summarized_story": "Nigeria’s economy, the continent’s biggest is continuing to struggle with the outgoing president and his cabinet unable or unwilling to take painful but needed decisions to reverse the economic collapse.\nThe foreign reserve position of Africa’s top oil producer fell the most in near 20 months in May according to data from the Central Bank.\nNigeria’s external position remains fragile despite the favourable increase in oil prices.\nData show that it is not just on the economic front that Nigeria is losing pace.\nOutgoing president Muhammadu Buhari has maintained a strangulating hold on the economy, leading to gasps and rising poverty which may see Nigerians turning away from the ruling party in the upcoming elections."
  },
  {
    "headline": "Edo takes ‘Operation Plan Edo’ to Ohoghobi community, as residents laud govt’s masterplan initiative – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commenced the Operation Plan Edo exercise in Ohoghobi Community, in Ikpoba-Okha Local Government Area of the state, as part of its ongoing efforts to generate a database to ensure development adheres to the state’s urban and regional development plans.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, while flagging off the exercise, said that the initiative would provide data to ensure equitable distribution of government projects across the state.\nThis is to help the Edo State Government in planning for the community’s needs.\nThis includes the number of schools, roads, access to potable water, electricity, and medical services, among others.\n“The data collected will be collated for the planning of Edo."
  },
  {
    "headline": "Obaseki, German govt move to bridge technical skill gap with exchange programmes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…plans job placements for Edo trainees in GermanyBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is concluding plans to establish technical and vocational centres in the state with one year of study in Nigeria and job placement opportunities with companies in Germany.\nThe governor, who disclosed this to journalists in Benin City, said the partnership is part of efforts to bridge the technical skill gap of youths in the state.\n“Already, we are in conversation with the German Confederation of Skilled Crafts to establish technical and vocational centres in Edo with one year of study in Nigeria.\nWe are also exploring opportunities of the training in Germany with the possibilities of returning or staying in Germany.”He added, “In our recent visit to the European country, we explored several opportunities for skill transfer, partnership and investments.\nWe met with leaders of the German government and those of the GIZ Migration and Diaspora Programme to deepen investment in Edo in pursuit of the drive to make the state the most competitive subnational in Africa."
  },
  {
    "headline": "Tinubu pays surprise visit to Osinbajo – Nigerian Observer",
    "summarized_story": "At the time Tinubu arrived, the VP was meeting with Senator Kabiru Gaya; former Defence Minister, Major General Dan Ali (retd), and other associates.\nThe VP received Tinubu alongside his other guests and they exchanged pleasantries.\nEarlier, The NIGERIAN OBSERVER reported that the Vice president, Prof. Yemi Osinbajo, has finally sent a congratulatory message to Asiwaju Bola Tinubu.\nRecall that at the APC presidential primary, which started on Tuesday and was rounded off on Wednesday, Tinubu got 1,271 votes to clinch the party’s presidential ticket.\nOther results were former Minister of Transportation, Rotimi Amaechi, got 316 votes; Osinbajo, 235 votes; a former Minister of State for Education, Chukwuemeka Nwajiuba, one vote; Senator Rochas Okorocha and Pastor Tunde Bakare got zero vote each."
  },
  {
    "headline": "2023 Presidency: Full list of all presidential candidates – Nigerian Observer",
    "summarized_story": "In the All Progressive Party, APC, the former Governor of Lagos State and National leader of the APC, Asiwaju Bola Tinubu emerged winner of the presidential primaries held at Eagles Square, Abuja.\nTinubu defeated his closest opponents and former Governor of Rivers State, Chibuike Amaechi and Vice President Yemi Osinbajo and was handed the party’s flag by President Muhammadu Buhari.\nEarlier, the Peoples Democratic Party, PDP, elected former Vice President, Alhaji Atiku Abubakar as its presidential candidate.\nThe Labour Party, LP, also has former Anambra State Governor, Dr. Peter Obi, as its candidate.\nThe list of all the presidential candidates so far conducted in the country include:Asiwaju Bola Tinubu (APC)Atiku Abubakar (PDP)Prince Malik Ado-Ibrahim (YPP)Rabiu Musa Kwankwaso (NNPP)Omoyele Sowore (AAC)Peter Obi (LP)Prince Adewole Adebayo (SDP)Kola Abiola (PRP)Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Nigerian govt confirms 31 new monkeypox cases",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) confirmed 31 new cases of monkeypox in the country.\nThe NCDC disclosed this in its latest monkeypox situation report released on Friday.\nAccording to the agency, between January 1 and June 5, 2022, the disease has been confirmed in 12 states, including the FCT.\nThe NCDC also said that no fewer than 110 suspected cases of the disease have been reported in the country, up from the previous 66 suspected cases.\n“There were 10 new positive cases in Epi week 22, 2022, from six states – Edo (2), Rivers (2), Plateau (2), Lagos (2), Ondo (1) and Imo (1).”"
  },
  {
    "headline": "Perpetrators of Owo Church massacre not arrested – Police",
    "summarized_story": "The Ondo State Police Command, has denied the alleged arrest of terrorists who attacked St. Francis Catholic Church, Owo, Ondo State on Sunday.\nThe command’s spokesperson, Funmi Odunlami, who made the denial of Friday, said no arrest was made in respect of the horrendous attack.\nOdunlami said that members of the public will be duly informed if any arrest was made by the security agencies in respect of the Owo attack.\nRecall that the palace of the traditional ruler of Owo, the Olowo, Oba Ajibade Ogunoye, was besieged by youths of the town demanding for the perpetrators of attack on Thursday.\nThe youths in their hundreds trooped to the Palace following alleged reports that the suspected terrorists have been arrested by the combined team of the Nigerian Army, Amotekun Corps, and other security forces and taken to the palace."
  },
  {
    "headline": "Owo Church Massacre: FG’s conclusion on ISWAP too hasty – Akeredolu",
    "summarized_story": "Governor of Ondo State, Rotimi Akeredolu of Ondo State has described the federal government pronouncement of the Islamic State of West African Province (ISWAP) as the terrorists responsible for the attack of worshippers at St Francis Catholic Church, Owo, Ondo state as too hasty.\nThe federal government, through the Minister of Interior, Rauf Aregbesola had on Thursday, blamed ISWAP for the attack.\nBut Akeredolu noted that he took the federal government’s conclusion with a pinch of salt, adding that ISWAP is known to take responsibility for their attacks.\nWe must have state police now.Amotekun suffers a lot of limitations in getting all the equipment we need to fight these criminals.\nThe governor commended the international community for their reaction to the killing in Owo, saying their reaction was unprecedented."
  },
  {
    "headline": "Umahi wins Ebonyi South APC senatorial ticket",
    "summarized_story": "Governor of Ebonyi State, David Umahi, has clinched the All Progressives Congress (APC) senatorial ticket for Ebonyi South.\nThe Ebonyi governor who inished sixth in the APC presidential primary with 38 votes took the ticket from his younger brother, Austin Umahi on Friday.\nThe younger Umahi had twoweeks ago, emerged senatorial candidate for Ebonyi South.\nHowever, after Umahi’s loss, the APC cancelled the earlier primary election and rescheduled it for Thursday night.\nUmahi clinched the APC’s ticket in the rescheduled primary election, held at the Afikpo North Local Government Council"
  },
  {
    "headline": "EFCC Forensic investigations indict Naira Marley of cyber fraud",
    "summarized_story": "The Cybercrime Section of the Economic and Financial Crimes Commission (EFCC) has indicted Naira Marley, a musician, of cyber fraud in the report of its forensic probe of the singer.\nThe singer is facing charges of redit card fraud before the Ikoyi Federal High Court.\nDein, the Chief Detective Officer of the Section told the court that his team’s investigations revealed that the defendant was involved in credit card fraud.\nThe artiste faced 11 charges bordering on alleged credit card fraud contrary to Money Laundering (Prohibition) Act and the Cyber Crimes Act.\nWe then repeated the same process a second time which was now valid.”Dein also explained that the singer used a multi-lingual browser to access illegal networks."
  },
  {
    "headline": "APC Targets North’s Bloc Votes, PDP Rules Out South West",
    "summarized_story": "Recall that shortly after Tinubu won the APC presidential ticket, Atiku had held an emergency meeting with PDP governors in Abuja.\nSources in PDP told LEADERSHIP Friday that the South West was being considered by Atiku alongside the South South region for the VP Slot because the South West had the second largest bulk votes in the country.\nBut after Tinubu picked the APC ticket, the former vice president’s camp settled for the South South zone with Rivers State governor Nyesom Wike as a top contender.\nThis is our project and by God’s grace we will succeed,’’ the APC national chairman stated.\nHe commended all the aspirants and the APC National Working Committee for the smooth conduct of a fair presidential primary election."
  },
  {
    "headline": "US Expresses Concern As FG Names ISWAP In Owo Church Attack",
    "summarized_story": "Governor Akeredolu disclosed that before the horrific attack on Owo, he had already directed the recruitment of 300 fresh personnel into the state security network codenamed Amotekun corps.\nThe governor spoke while receiving members of the Ondo State House Of Assembly on a condolence visit over the Owo terror attack.\nBamidele Oloyelogu were received by Governor Akeredolu at his residence in Owo, his home town.\nMeanwhile, the federal government has disclosed that last Sunday’s attack on St. Francis Catholic Church, Owo, Ondo State, by gunmen leading to the death of worshippers has been linked to the Islamic State of West African Province (ISWAP).\n“The council is quite concerned about the violent attack in Owo, Ondo State, and have been able to locate the perpetrators of that horrendous attack."
  },
  {
    "headline": "Democracy Day: FG Declares Monday Holiday, Says Abiola Duly Honoured",
    "summarized_story": "Federal government has declared Monday, June 13, as public holiday to mark this year’s Democracy Day celebration.\nHe said President Buhari will address the nation through a live broadcast on Sunday, June 12, 2022 by 7:00 am to mark Democracy Day.\nThere will also be a Democracy Day parade at the Eagle Square in Abuja on Monday morning.\nHe, therefore, said whatever the federal government is doing today to celebrate that day in memory of MKO Abiola is worth it.\nWe have in our small way been courageous enough to declare this day a public holiday, I think it is the best gift to any Nigerian,” he said."
  },
  {
    "headline": "2023: Competence, Capacity Should Be Placed Ahead Of Religion – el-Rufai",
    "summarized_story": "The Kaduna State governor, Malam Nasir El-Rufai, on Friday, said competence, capacity and capability in terms of delivering good governance to Nigerians should be placed ahead of religion, in voting office-holders in 2023 general elections.\nADVERTISEMENTEl-Rufai advised the nation to rather look for the best person for the job instead of placing religious sentiment ahead of competence.\nThis fixation of Nigerians with religion instead of competence, capacity and capability is quite sad and pathetic,” he added.\n“The global issues are affecting us and all that people are concerned with as far as who will be president and vice president is religion.\nHe added that the nation should look for the best person for the job, the person that will get the job done."
  },
  {
    "headline": "RTEAN Procures 2,322 Gas-powered Locally Made Vehicles",
    "summarized_story": "The Road Transport Employers Association of Nigeria (RTEAN), has procured 2,322 gas-powered Nigeria-built buses for its fleets in the 774 local government areas in the country.\nInaugurating the buses on Friday in Abuja, the Director-General, National Automotive Design and Development Council (NADDC), Jelani Aliyu, commended RTEAN for patronising indigenous auto manufacturers for its vehicles.\nADVERTISEMENTThe NADDC DG said: “It’s very exciting to see that all the vehicles were built in Nigeria by an indigenous company.\nAliyu said: “What was witnessed was a testimony to the fact that the implementation of the National Automotive Industry Development Plan, NAIDP, by the NADDC is yielding results.\n“The CNG powered vehicles produced locally by OMAA Motors, will make transportation cheaper for the commuters and also save lives and protect the environment because it is a cleaner fuel compared to petrol and diesel."
  },
  {
    "headline": "El-Rufai's verdict: Tinubu is an old war horse, he'll win 2023 presidency",
    "summarized_story": "Kaduna State Governor, Nasir El-Rufai has described the APC Presidential candidate, Asiwaju Bola Tinubu as an old war horse who would win the 2023 presidency.\nHe also wrote off the presidential ambition of Dr. Peter Obi, saying the 2023 presidency is a two-horse race between Atiku Abubakar and Tinubu.\nEl-Rufai, in an interview on Channels TV’s Politics Today, said he was confident that the APC would win the 2023 presidency.\n“As regard to other parties, I think this is likely going to be a two-horse race.\nNNPP, Kwankwaso is likely to canibalise some of our votes in Kano and maybe Jigawa and some part of Katsina and Peter Obi is going to canibalise PDP votes in the Southeast."
  },
  {
    "headline": "CBN to introduce USSD code to improve eNaira",
    "summarized_story": "By Okeoghene AkubuikeThe Central Bank of Nigeria (CBN) is set to introduce the Unstructured Supplementary (USSD) code as part of steps to improve the Central Bank Digital Currency (CBDC).\nKingsley Obiora, the CBN Deputy Governor said this at the IMF African Department Speakers Series held virtually on Friday.\nObiora said the introduction of the USSD code became necessary to improve financial inclusion in the country and to ensure people without smartphones could still transact on the eNaira platform.\n“So at the time, we were at 48 per cent of our population within the financial system and given several policies that he conceived and implemented, we are almost at 70 per cent.\nHe said that the CBDC had significant benefits for Nigeria, which was why the CBN decided to introduce it."
  },
  {
    "headline": "BREAKING: Tinubu, Yahaha Bello in closed-door meeting",
    "summarized_story": "The presidential candidate of the All Progressives Congress and former Governor of Lagos State, Asiwaju Bola Tinubu, is currently in a closed-door meeting with Governor Yahaya Bello of Kogi State, in what political observers said was part of reconciliatory moves to pacify aggrieved aspirants of the APC presidential ticket.\nTinubu was accompanied to the meeting on Friday by Governors Babajide Sanwo-Olu (Lagos); Bello Matawalle (Zamfara); and Abdullahi Ganduje (Kano).\nA former governor of Edo State and former national chairman of the APC, Adams Oshiomhole, is also in the entourage.\nIt was, however, not clear if the issue of Tinubu’s running mate would be part of the agenda.\nNews Direct learnt that they would brief the press on the outcome of the meeting."
  },
  {
    "headline": "Atiku’s running mate: PDP raises panel as Wike, Okowa lobby for VP slot",
    "summarized_story": "On his part, the APC presidential candidate, Asiwaju Bola Tinubu, on Thursday, began the search for his running mate with a meeting with northern governors.\nA close source to Wike told The PUNCH that the governor was in Abuja lobbying to be named Atiku’s running mate.\nIt is not out of place if he is pushing to become the running mate of the PDP presidential candidate, Atiku Abubakar.\n“Don’t forget that he came second in the PDP presidential primary in Abuja, so that tells you his pedigree,” he stated.\nKelvin Ebiri, the Special Assistant on Media to Wike kept mum over the choice of running mate for Atiku."
  },
  {
    "headline": "BREAKING: Killers of Fasoranti’s daughter sentenced to death",
    "summarized_story": "BREAKING: Killers of Fasoranti’s daughter sentenced to deathThree persons involved in the killing of Olufunke Olakuri, daughter of Afenifere Leader, Pa Reuben Fasoranti, have been sentenced to death by hanging.\nThey were sentenced by an Ondo State High Court sitting in Akure.\nPresiding Judge, Justice William Olamide, however, discharged and acquitted the fourth suspect, Auwàla Abubakar, who is the spokesman of Miyetti Allah.\nOlufunke was shot dead in June, 2019 by gunmen in Ore, Odigbo Local Government Area of Ondo State.\nHer alleged killers were later arrested and arraigned six months after her death."
  },
  {
    "headline": "How Northern Governors Dumped Amaechi For Tinubu",
    "summarized_story": "The ruling All Progressives Congress (APC) chose Bola Tinubu, a former Lagos State governor, as its presidential candidate after weeks of intrigue and uncertainty.\nTinubu, Osinbajo, and Rotimi Amaechi, the former Minister of Transportation, were neck and neck a few weeks before the national convention, despite the odds favoring Tinubu.\nGovernors Simon Lalong of Plateau State, Nasir El-rufai of Kaduna, and Abubakar Badaru of Jigawa State were among those who publicly backed Amaechi.\nThe governors, however, had closed ranks and allied with the former Lagos State governor three days before the poll.\nAccording to an insider, after President Muhammadu Buhari declared that governors should support him in choosing a candidate, the governors met multiple times, but it became evident that more governors preferred Tinubu."
  },
  {
    "headline": "Forgery’: AGF takes over trial of Anambra university professor, 4 others",
    "summarized_story": "The Attorney-General of the Federation (AGF), Abubakar Malami, on Friday, took over the suit filed against Prof. Obiajulu Obikeze and four others over allegations bordering on forgery of chieftaincy documents.\nCounsel for the AGF, Joe Agi, SAN, told Justice Inyang Ekwo shortly after the matter was called for trial commencement.\nUpon resumed hearing, Agi informed that he had been authorised by the AGF to take over the matter.\nThe News Agency of Nigeria (NAN) reports that the trial commencement, on May 23, suffered a setback.\nObikeze, who works with the Chukwuemeka Odumegwu Ojukwu University, formerly known as Anambra State University Igbariam in Anambra, was arraigned on Feb. 22 alongside others on 11 counts."
  },
  {
    "headline": "Breaking: William Troost-Ekong ruled out of Super Eagles vs Sao Tome & Principe AFCON 2023 qualifier",
    "summarized_story": "Watford FC player William Troost-Ekong has been ruled out of Sao Tome & Principe African Cup of Nations qualifier versus Super Eagles clash due to groin injury.\nTroost-Ekong was injured while featuring for Super Eagles against Sierra Leone in Abuja.\nBlueprint has now gathered that the Super Eagles Vice Captain has left camp to London to start treatment in preparation for the upcoming season.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Outcome of APC presidential primary: I’m still committed to new Nigeria project – Osinbajo",
    "summarized_story": "The vice-president, according to the statement, also said he would support Sen. Bola Tinubu, winner and flag-bearer of the party for the 2023 presidential election.\nOsinbajo recalled the personal letter he wrote to Tinubu on Thursday congratulating him on his victory at the party primary.\nWe will support our party; we will support the flag-bearer of our party because we know that the other side is not even worth considering.\nSome leaders of Osinbajo Support groups lauded the vice-president for being a true leader and inspiration to millions of Nigerians.\nHajiya Rabbi Dauda, leader of the Coalition of Women for Osinbajo, said the vice-president was a winner forever."
  },
  {
    "headline": "NBC Celebrates DG Ilelah as he marks one year in office",
    "summarized_story": "By Friday ObandeAs he marks one year in office, the Management and Staff of National Broadcasting Commission, have felicitated with Director General of the commission, Mallam Balarabe Shehu Ilelah.\nIn a congratulatory message by the commission’s management, it said Ilelah, has on assumption in office, brought his wealth of experience into the running of the NBC.\nAlso, in the course of carrying out the commission’s regulatory functions, the management noted that the DG has continued to stress on professionalism on the part of broadcasters.\nThe Director General implored Broadcasters to engender the unity, peace and progress of our dear country,” they added.\nIlelah, a veteran international broadcaster, was appointed DG of the commission on June 7, 2021 by President Muhamadu Buhari."
  },
  {
    "headline": "Jos Disco urges BIRS to unseal office",
    "summarized_story": "By Sunday Ogli, MakurdiManagement of Jos Electricity Distribution, JED, Plc, has called on the Management of BIRS to swap its tax liability by deducting it from the state government’s indebtedness to the company.\nBenue State Government is indebted to Jos Disco as at 31st December, 2021 to the tune of ₦157,943,414.14 million while Jos Disco owes state’s tax agency; BIRS ₦156,515,414.47 million.\nHowever, BIRS, as a result of the debt, sealed off the operational office of Jos Disco in Gboko and Makurdi on Wednesday.\n“This could be gleaned from several correspondences and meetings to this effect”, the press release stated.\nDr Elijah further disclosed that to resolve the impasse, the two bodies had mandated their tax consultants to ascertain the true situation of things."
  },
  {
    "headline": "NACC urges Nigerian exporters to take advantage of AGOA",
    "summarized_story": "Nigerian American Chamber of Commerce (NACC) Abuja Chapter has called on all Shippers to take advantage of the window provided by the African Growth and Opportunity Act (AGOA) Programme to boost trade between Nigeria and the United States of AmericaThe Executive Secretary of NACC Abuja Chapter, Mr. Ayo Salaam disclosed that Nigerian companies have not taken advantage of the AGOA because they export mainly oil to the United States.\nThe AGOA forum is one of the key components of U.S African strategy that focuses on increasing the United States Trade and Investment in Africa as a mechanism for job creation within the continent.\n“The AGOA project initiated by the United States of America in 2000 was to help develop trade and facilitate exporting over 6000 goods into America with no tariff.\nSpeaking at the event, a diplomat, Ambassador Bayo Idowu, encouraged all shippers to leverage on the AGOA partnership.\n“We are readily available to provide assistance and advice on how Nigerian products can be accepted in the American market."
  },
  {
    "headline": "NDE uplifts 630 Anambra youths on vocational skills",
    "summarized_story": "Tony Oraeki, AwkaThe National Directorate of Employment, NDE, has commenced the training of 630 unemployed youths in Anambra state on various vocational skills.\nThe training would be on two categories which are Basic National Open Apprenticeship Scheme, B-NOAS, and Advanced National Open Apprenticeship Scheme, A-NOAS, with 420 and 210 beneficiaries respectively.\nAddressing the beneficiaries at the orientation ceremony in Awka yesterday, the NDE State Coordinator, Mrs. Chika Ufelle said that B-NOAS is a scheme through which the unemployed youths both male and female are recruited to acquire marketable vocational skills for decent job opportunities.\nShe also said the trainees under A-NOAS are designed for artisans who graduated from B-NOAS with an aim to upgrade their skills to higher levels of competence.\n” I very much appreciate the effort of NDE to avail me this opportunity to be trained in Computer Appreciation.” She said."
  },
  {
    "headline": "Buhari appoints Ogbobe as PRODA DG",
    "summarized_story": "Eunice OrikePresident Muhammadu Buhari has approved the appointment of Dr. Peter Okwudilichukwu Ogbobe as the substantive director-general of the Projects Development Institute PRODA,Enugu, with effect from 20th May 2020.\nAccording to the statement, the appointment of Ogbobe takes effect immediately and is a non-renewable five-year tenure.\nUntil his appointment, Ogbobe was the director, information communication technology ICT, National Board for Technology Incubation NBTI.\nOgbobe is a member of the Council for the Regulation of Engineering in Nigeria COREN,Nigeria Society of Engineers NSE,American Society of Mechanical Engineers ASME, among others.\nAfter the civil war, it was renamed PRODA and enlisted as one of the agencies under the Federal Ministry of Science, Technology and Innovation FMSTI."
  },
  {
    "headline": "INEC Records ‘Unprecedented Surge’ In PVC Registration, To Deploy More Machines",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Friday said it has recorded an unprecedented surge in the number of citizens seeking to registers as voters ahead of the 2023 elections.\n“The Independent National Electoral Commission (INEC) has received reports from our States indicating an unprecedented surge in the number of citizens that wish to register as voters and the challenges they face across the country.\nThe necessity to urgently deploy more voter enrolment machines to ease the congestion at the registration centres was identified as a priority.\n“Every step will be taken and all options will be explored to ensure that eligible Nigerians are given the opportunity to register as voters.\n“The sudden surge is an affirmation of the increasing confidence Nigerians have in our electoral process."
  },
  {
    "headline": "2023: Ex-PDP Governors Pledge Support To Atiku",
    "summarized_story": "﻿Ex-Governors of the Peoples Democratic Party have pledged their support to the party’s 2023 presidential flagbearer, Mr Atiku Abubakar.\nThe ex-Governors made the pledge during a meeting with Atiku in Abuja.\nThe Governors also asked Mr Atiku to clear the air on where he intends to pick his running mate from.\n:But he didn’t say former Governors or current Governors.\n“Because there is no single political party that has got the kind of resource persons that we have got today."
  },
  {
    "headline": "‘We Lost The Battle, Not The War’: Osinbajo Says ‘New Nigeria’ Remains Possible",
    "summarized_story": "﻿Vice President Yemi Osinbajo on Friday said he remains committed to the dream of a new Nigeria, despite losing the All Progressives Congress’ presidential ticket to Bola Ahmed Tinubu.\nIn his address to the crowd of supporters, the Vice President described the clamour for a new Nigeria as a movement.\n“What is new is that we have a firm belief that a new Nigeria is possible and it is possible through us who are here.\n“In that letter, I said to him that the dream of this country, the dream of a new country remains alive and well.\nDr Ahmed Badanga described the Vice President as “a role model to all of us."
  },
  {
    "headline": "Court Sentences Three To Death By Hanging For Killing Funke Olakunrin",
    "summarized_story": "An Ondo State High Court sitting in Akure, the state capital, has sentenced three persons to death by hanging for killing Olufunke Olakunrin, the daughter of Afenifere leader, Pa Reuben Fasoranti.\nOn his part, the Attorney General and Commissioner for Justice in Ondo State, Charles Titiloye, commended the judgment.\nThe Ondo State Government had in April 2020 arraigned them at a Chief Magistrate Court sitting in Akure.\nAccording to him, the survivor gave a clear description of the roles each of them played in the killing.\n“At this point, they capitulated and voluntarily offered a no-holds-barred confession on how Mrs Funke Olakunrin was killed,” he said as of then."
  },
  {
    "headline": "CSOs Call On INEC To Extend Deadline For Voter Registration",
    "summarized_story": "The Nigeria Civil Society Situation Room (Situation Room), a coalition of Civil Society Organisations, has called on the Independent National Electoral Commission (INEC), to extend the Continuous Voter Registration (CVR) exercise.\n“There have also been several appeals by Nigerians to INEC to extend the registration exercise to enable them register to obtain a PVC.\nIn Nnewi North Local Government, another report states that the sum of 1,000 Naira is being collected for voter registration.\n“Situation Room calls on INEC to check conduct of their staff nationwide, properly coordinate the ongoing voter registration exercise and restrain the chaotic situation in many registration centres nationwide.\nS 9(6) of the Electoral Act 2022 which allows for voter registration to go on till ninety days to the general elections means that INEC still has room to extend the CVR exercise."
  },
  {
    "headline": "Politics is not about force, you must work hard, be diplomatic-Gov Sule",
    "summarized_story": "Politics is not about force; you cannot say, “I must have it, I must do that.” Instead, you must talk to people diplomatically, lobby for it, and work hard for it.\nThese were the words of Governor Abdullahi Sule of Nasarawa State while speaking on TVC’s News morning show, TVC Breakfast on Thursday.\nGovernor Sule noted that Bola Ahmed Tinubu, the APC Presidential Flagbearer, had worked extremely hard for this position and that people should credit him for it.\nGovernor Sule urged everyone to come together to rebuild the party adding that everyone will have their turn.\n“Who knows what will happen next, maybe the Southeast will win it, so that’s how politics works,” he said.https://www.tvcnews.tv/2022/06/father-alia-wins-benue-apc-governorship-re-run-primary-election/"
  },
  {
    "headline": "INEC declares end to nomination of candidates for 2023 Elections in Oyo -",
    "summarized_story": "The Independent National Electoral Commission has declared that all primaries into the nomination of candidates by political parties in Oyo state for the 2023 General Elections has ended.\nThe Oyo state Resident Electoral Commissioner Mutiu Agboke who disclosed this through a press release stated that as from Friday 10th June 2022 all political parties are required to submit their candidates list for National Elections on or before 17th of June.\nThe Resident Electoral Commissioner added that the list of candidates of the state election shall be uploaded between first and fifteenth of July.\nHe added that all political parties are also required to upload the details of their candidates for each constituency to the INEC Nomination Portal as it would be shut down on the 17th of June.\nOther parties like the African Democratic Congress, the New Nigerian Peoples Party, Africa Action Congress and Others have also taken advantage of the extension top conduct Presidential Primaries."
  },
  {
    "headline": "Father Alia Wins Benue Apc Governorship Re-run Primary Election -",
    "summarized_story": "Fr Hyacinth Iormem Alia, has won the Governorship primary election rerun conducted by the All Progressives Congress, APC, in 12 Local Government Areas and 3 council wards in Buruku Local Government in Benue State.\nThe rerun was conducted in Ogbadibo, Ushongo, Konshisha, Oju, Apa, Kwande, Agatu, Ohimini, Ado, Obi, Okpokwu and Apa Local Government Areas.\nSecretary of the Committee, Emma Maji, described the Rerun election as free, fair and credible.\nShortly after the declaration of results, State Deputy Chairman of the party, Stephen Tsav on behalf of the State Chairman, Comrade Austin Agada, presided over the congress that affirmed the outcome of the rerun gubernatorial primary election.\nThe Benue APC had conducted its Governorship primary election on the 27th of May, 2022 with Alia as the winner."
  },
  {
    "headline": "Governor Ortom denies conspiring with aspirants against APC -",
    "summarized_story": "Benue State Governor Samuel Ortom has dismissed allegation of the All Progressives Congress (APC) in accusing him of conspiring with some aspirants of the party to stop it from fielding a governorship candidate for the 2023 elections.\nHe added that it was Governor Ortom’s fault that APC could not conduct a transparent and credible governorship election in Benue https://www.tvcnews.tv/purplegold/post.php?post=199307&action=edit#State.\n“Was the Governor responsible for the petitions that aggrieved aspirants of the party filed before the appeal panel against the governorship primary election?\nWas APC expecting PDP to fold its arms and watch the party conduct a flawed election and produce a candidate through fraudulent means?\n“Governor Samuel Ortom and the entire PDP family in Benue place premium on internal democracy and due process of the law; hence will not be distracted by the baseless accusations from APC."
  },
  {
    "headline": "US Inflation Hit 40-Year High of 8.6% in May",
    "summarized_story": "Much higher gas prices were to blame for most of that increase.\nSurveys show that Americans see high inflation as the nation’s top problem, and most disapprove of President Biden’s handling of the economy.\nInflation has remained high even as the sources of rising prices have shifted.\nEven so, rising gas prices are eroding the finances of millions of Americans.\nEconomists have pointed to that shift in spending from goods to services as a trend that should help lower inflation by year’s end."
  },
  {
    "headline": "Capitol Riot Hearings: Trump Accused of Coup Attempt",
    "summarized_story": "The congressional committee investigating the U.S. Capitol riots kicked off public hearings on Thursday with graphic video and chilling testimony from witnesses, laying out a case against former Republican President Donald Trump.\nThe Democratic-led committee presented videotaped testimony showing that close Trump allies, including his own daughter Ivanka, rejected his false 2020 election fraud claims.\nThe congressional committee investigating the U.S. Capitol riots kicked off public hearings on Thursday with graphic video and chilling testimony from witnesses, laying out a case against former Republican President Donald Trump.\nThe Democratic-led committee presented videotaped testimony showing that close Trump allies, including his own daughter Ivanka, rejected his false 2020 election fraud claims.\nShe described hours of grueling hand-to-hand combat with Trump supporters who barged into the Capitol that day."
  },
  {
    "headline": "‘I Have The Political Will to Lead The Country’ Says ADC Presidential Candidate Dumebi Kachikwu",
    "summarized_story": "ADC presidential candidate Dumebi Kachikwu speaks on his emergence as the flagbearer of the African democratic congress."
  },
  {
    "headline": "Nigeria: Al-Mustapha Emerges Action Alliance Presidential Candidate – Arise News",
    "summarized_story": "Hamza Al -Mustapha, former Chief Security Officer to the late military ruler Sani Abacha has emerged the presidential flag bearer of the Action Alliance for the 2023 presidential elections.\nArise Correspondent, Mary Chinda, monitored the party’s primary and reports."
  },
  {
    "headline": "Yunusu Tanko: Peter Obi Remains The Legitimate Presidential Candidate of the Labour Party",
    "summarized_story": "Yunusu Tanko, Spokesperson National Consultative Forum, Labour Party, denies any faction in the Labour Party, establishing that any person claiming to be a factional chairman is being fraudulent."
  }
]