[
  {
    "headline": "Foundation encourages youths participation in electoral process",
    "summarized_story": "A non-profit organisation, Anap Foundation, has stated that in line with its objective of driving Nigerian youths to actively participate in the nation’s electoral processes, it would inaugurate the GoNigeria Hausa rap challenge.\nThe foundation disclosed this in a statement in Lagos on Thursday, adding that the contest which was organised for young Nigerians between the ages of 18 and 34, would serve as an incentive-driven platform that would boost political participation by Nigerian youths.\n“The Hausa Rap Challenge will be anchored by Buba Barnabas Luka (Classiq) and the contest will run from Friday, June 10, 2022 to Thursday, June 30, 2022.\nOnly Nigerian youths between the ages of 18 and 34 years and who have Permanent Voter Cards are eligible to participate.\n“While the thrust of the rap challenge is aimed at engaging Nigerian youths with a strong inclination towards rap to showcase their talents, the real objective is aimed at encouraging Nigerian youths, within the eligibility demographics of the challenge.”Copyright PUNCH."
  },
  {
    "headline": "Kogi: Reps candidate promises good representation",
    "summarized_story": "The Peoples Democratic Party candidate for Dekina/Bassa Federal Constituency in the 2023 general election, Usman Austin, has vowed to offer good representation and good legislation if given the mandate in the forthcoming elections.\nAustin made the plea on Thursday in Lokoja during an interaction with mediaHe said, “Voting for PDP in Bassa/Dekina federal constituency will certainly bring tremendous change and development to the people, we will empower the teeming unemployed youths, attract support to the farmers, secure infrastructural development though there are limitations to the number of projects to be nominated by a legislator but I will ensure the most relevant are given topmost attention among others““As a lawmaker, I will look at where there is a lacuna in the system and also see that I speak the minds of the people and this is what I have been doing over the years even without the people mandate, I have been an advocate of the people and speak for the people irrespective of the political party, putting the facts on the table will address the issue my antecedent are there for anyone to verify, I will do much more better if given the mandate.”"
  },
  {
    "headline": "World Environment Day: Let’s join hands to protect, maintain, restore the planet, Ogun govt tells residents",
    "summarized_story": "By James Ogunnaike, AbeokutaOgun State government has called for the collaboration of all residents in the state in protecting, maintaining, and restoring the planet for a more conducive environment.\nHe noted that his administration had put in place the Ogun State Waste Management Agency, to curb indiscriminate waste disposal, urging residents to cooperate with the government at ensuring a cleaner environment, saying ‘’clean environment is the key to the existence and survival of life on planet’’.\n“In advent of this administration, the Ogun State Waste Management Authority, OGWAMA was created to immense waste management particularly community waste.\n“The state government has spent about #2bn on waste management and ensuring that the environment is safe for all its citizens”.\nSpeaking earlier, the Permanent Secretary, Ministry of Environment, Engr."
  },
  {
    "headline": "Saliu Atawodi emerges Chairman, OMNI First Network Services",
    "summarized_story": "Saliu Atawodi, OFR, a retired Air Vice Marshal of the Nigerian Air Force has now emerged as the Chairman of the Company.\nThereafter, he attended the fast jet instructor’s course with the Parkistan Air Force Risalpur.\nOthers are Mig 15, Mig 17, Mig 21 and Alpha jet.\nAlso, in 1988 he designed and built the Air Force Air to Ground Firing Range in Kwenev Makurdi.\nBetween the ranks of Pilot Officer and Air Vice Marshal, Saliu Atawodi has held several appointments."
  },
  {
    "headline": "Buhari is a dependable leader – Tinubu",
    "summarized_story": "…As President receives ‘APC presidential flagbearer on thank you’ visitBy Johnbosco AgbakwuruABUJA–PRESIDENTMuhammadu Buhari, last night, received the presidential candidate of the ruling All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, at the Presidential Villa, Abuja.\nThe APC presidential candidate, and former governor of Lagos state was accompanied on the ‘thank you’ visit to President Buhari by the Lagos State governor, Mr Babajide Sanwo-Olu, and Mr Wale Tinubu.\nSpeaking to the media after the meeting, Asiwaju Tinubu vowed to sustain Buhari’s legacies when he wins the election and is sworn in as his successor.\n“He promised the whole country and the world that he will build a legacy of transparency and consistency.\nAsked also of the choice of his running mate he said “I won’t tell you that."
  },
  {
    "headline": "Breaking: Tinubu visits Osinbajo",
    "summarized_story": "Bola Tinubu (L) and Professor Yemi OsinbajBy Jeremiah UrowayinoThe presidential candidate of All Progressives Congress APC, Ahmed Bola Tinubu, has paid a surprise visit to Vice President Yemi Osinbajo at his Abuja residence on Thursday night.\nA source in the presidency said Tinubu had earlier visited the President at his residence in the Presidential Villa and afterward decided to make a surprise call on Osinbajo alongside Lagos State Governor Sanwo-Olu.\nAccording to the source, Osinbajo was in a meeting with Senator Kabiru Gaya, former Defense Minister Rtd Major General Dan Ali, and other associates."
  },
  {
    "headline": "PDP constitutes 80 member Ekiti Governorship Election National Campaign Council",
    "summarized_story": "John Alechenu, AbujaThe National Working Committee (NWC), of the Peoples Democratic Party (PDP), has constituted the National Campaign Council for the June 18, 2022 Ekiti State Governorship election.\nAminu Waziri Tambuwal Member, Chief Barr.\nOther members include: Sen. Samuel N. Anyanwu , Arch.\nSetonji Kosheodo, Olasoji Adagunodo, Chief Dr. Ali Obasi Odefa, Chief Dan Osi Orbih , Hon.\nAdekoya Adesegun Abdul-Majeed, Chief Jimi Agbaje, Sen. Ayo Akinyelure, Sen. Nicholas Tofowomo Member, Sen. Adenigba Fadahunsi and Mazi Samuel Ifeanyi Ohuabunwa among others."
  },
  {
    "headline": "Owo massacre: US reacts, sends message to Akeredolu",
    "summarized_story": "Oluwarotimi Akeredolu of Ondo State over the last Sunday terrorist attack at St. Francis Catholic Church, Owaluwa Street, Owo.\nHe explained that the condolence was contained in a letter to Akeredolu, dated June 7, 2022 and signed by the U.S.\nOlatunde said that the U.S. extended its heartfelt condolences to the people of the state and the Owo community.\n“We remain steadfast in our efforts to support Nigeria in enhancing civilian security throughout the country.\n“Once again, please accept our deepest condolences,” the letter read."
  },
  {
    "headline": "Owo church massacre: Suspects reportedly arrested in Ondo [Video]",
    "summarized_story": "Suspected attackers of the St. Francis Catholic Church in Owo, Ondo State, have been reportedly arrested.\nA trending video shows a crowd protesting within the palace of the Olowo of Owo, Oba Ajibade Ogunoye.\nOne of them could be heard saying: “They want to take them (suspects) to Akure.\nThe youths are angry.”Gunmen, last Sunday, invaded the church and murdered several worshippers, including women and children in Ondo.\nThe security agency also announced that three unexploded Improvised Explosive Device at the scene (IEDs) were recovered."
  },
  {
    "headline": "Democracy Day: FG declares Monday public holiday",
    "summarized_story": "The Nigerian government has announced Monday June 13 as a public holiday to mark the 2022 Democracy Day.\nMinister of Interior, Rauf Aregbesola, congratulated Nigerians on the occasion which commemorates the annulled June 12, 1993 presidential election.\nAregbesola urged citizens to support the President Muhammadu Buhari administration in its efforts at ensuring a united and prosperous nation.\nThe minister told them to reflect on the journey Nigeria has made for the enthronement of a democratic order and the sacrifices of patriots.\nHe urged Nigerians to work toward remaining an indivisible entity as no development can take place in an acrimonious environment."
  },
  {
    "headline": "Gov. Ugwuanyi offers bursary to 165 Enugu law students",
    "summarized_story": "The administration of Governor Ifeanyi Ugwuanyi of Enugu State has offered bursary to 165 Enugu students in different campuses of the Nigeria Law School across the country.\nThe I65 beneficiaries of the bursary were identified and listed by Enugu law students themselves when they interacted with Gov.\nConfirming the disbursement of the bursary to the law students, the Executive Secretary, Enugu State Scholarship Board, Barr.\nReacting on their behalf, the leader of the law students, Michael Kenechukwu Onah expressed immense gratitude to Gov.\nOnah reiterated the commitment of the law students towards making Enugu State proud, promising Gov."
  },
  {
    "headline": "EFCC arrest 140 suspected Yahoo boys in Lagos",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission, EFCC, have arrested 140 suspected Yahoo boys.\nThe suspects were nabbed in separate sting operations at popular hotels, Lakers Lounge Hotel and Bar and De Butlers, in Ikorodu, Lagos State, following credible intelligence on their involvement in internet-related fraud.\nThe commission in a statement issued by its Spokesman, Wilson Uwujaren, said four of the suspects were released as no incriminating item was found on them.\nItems recovered from the suspects include exotic cars, electronic devices, laptop computers and mobile phones.\nThe anti-graft agency added that the suspects will be charged to court as soon as the investigations are concluded."
  },
  {
    "headline": "Buhari rallies governors for Tinubu ahead 2023 election",
    "summarized_story": "In another letter to Tinubu, the President hailed the emergence of the candidate at the primary.\n“Your commitment in pursuit of equity and fairness speaks volumes in the cooperation displayed by APC governors.\n“So, now is the time for all of us to come together and march forward, as we did in 2015, to a convincing APC victory.\nPresident Buhari also commended Tinubu for what he described as his impressive acceptance speech, which stressed the importance of unity in the party.\nThis is our project and by God’s grace, we will succeed.”APC governors from the northern states also paid a visit to Tinubu."
  },
  {
    "headline": "Osinbajo, Ayade, Amaechi, Umahi pledge support for Tinubu",
    "summarized_story": "By Bolaji Ogundele, Abuja; Ogochukwu Anioke, Abakaliki and Samuel OamenVice-President Yemi Osinbajo, Ebonyi State Governor Dave Umahi, his Cross River counterpart Ben Ayade and former Minister of Transportation Rotimi Amaechi yesterday congratulated the presidential candidate of the ruling All Progressives Congress (APC), Asiwaju Bola Tinubu, on securing the party’s ticket.\nOsinbajo said in a statement that Tinubu’s vast experience would come in handy.\nUmahi, in a statement by his media aide, Nwaze Francis, promised to support the APC presidential candidate to ensure that he emerged victorious in the 2023 general elections.\n“I encourage the leaders and members of our party to come together to support the party for a victorious journey in the 2023 elections,” Umahi said.\nThe entire management of this organisation in all countries are happy to be part of this victory,” it said."
  },
  {
    "headline": "Friday deadline for parties to submit candidates’ lists",
    "summarized_story": "Parties have June 17 deadline to submit names of their presidential candidates and running mates.\nThe Independent National Electoral Commission (INEC) announced this yesterday and warned that the dedicated portal would automatically shut down at 6.00 pm that day.\nFor the next one week from tomorrow (today), all political parties are required to submit their list of candidates for national elections (presidential/vice presidential, senatorial and House of Representatives) latest by Friday 17th June 2022.\n“All political parties are required to upload the details of their candidates for each constituency to the INEC Candidate Nomination Portal (ICNP).\n“For emphasis, the Commission wishes to remind political parties that only the names of candidates that emerged from democratic primaries as provided by Section 84 of the Electoral Act 2022 shall be submitted."
  },
  {
    "headline": "Buhari is dependable, trustworthy, says Tinubu",
    "summarized_story": "President Muhammadu Buhari was last night commended for living up to his promise of providing level playing ground for all the aspirants at the All Progressives Congress (APC) special convention/presidential primary.\nThe commendation was given by the ruling party’s presidential flag bearer Asiwaju Bola Tinubu during a ‘Thank You’ visit to the president at the State House, Abuja.\nTinubu was accompanied by Lagos State Governor Babajide Sanwo-Olu and Mr. Wale Tinubu.\nThe APC candidate also visited Vice President Yemi Osinbajo at his Akinola Aguda residence, Presidential Villa.\nRecalling Buhari’s ealier promise to support the democratic process of selecting the party’s presidential candidate, Tinubu commended the President for providing the atmosphere for a rancour-free shadow poll."
  },
  {
    "headline": "NUC hailed on reforms, new curriculum for varsities",
    "summarized_story": "The Higher Education Observatory for Africa (HEOFA) has praised the efforts of the National Universities Commission (NUC) in the ongoing reforms in the Nigerian university system which was aimed at producing quality graduates that will be globally competitive.\nThe organisation said the Executive Secretary of NUC, Prof. Abubakar Rasheed has led a process that has produced a new curriculum for the Nigerian university system that will be a model for other African countries.\n“The American Council for Higher Education Accreditation (CHEA) and the CHEA International Quality Group are impressed with the reports of progress being made in implementing the blueprint.\nWe have had some really impressive results from these universities with Covenant University and Afe Babalola University placing within the top 400 universities worldwide.\nClearly, all the forces are getting aligned to assure a glorious future for the Nigerian university system.”"
  },
  {
    "headline": "INEC issues APC, PDP, others 1 week deadline to submit names of presidential candidates, running mates",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC) has issued a deadline of Friday next week to the political parties to submit the names of their presidential candidates and running mates to the Commission.\nAccording to him; “turning to the nomination of candidates by political parties for the 2023 general elections, all primaries end today Thursday June 9, 2022.\n“All political parties are required to upload the details of their candidates for each constituency to the INEC ICNP.\n“For emphasis, the Commission wishes to remind political parties that only the names of candidates that emerged from democratic primaries as provided by Sec.\nSimilarly, the list of all Presidential and Governorship candidates must be accompanied by the names of their running mates (i.e."
  },
  {
    "headline": "BREAKING: Soludo announces 11 new appointments",
    "summarized_story": "From Izunna Okafor, AwkaAnambra State Governor, Prof. Chukwuma Soludo has approved the appointments of eleven more individuals into various key positions in the state.\nThe appointments, which came barely 70 days after the swearing-in of the Governor, was announced in a statement signed by the state’s Commissioner for Information, Sir Paul Nwosu and made available to newsmen on Friday.\nHon Anayo Nebe —Special Adviser, Legislative/State Assembly Matters; Dr. Alex Obiogbolu —Special Adviser, Political Matters; Dr. Godwin Nnadozie —Special Adviser,Medicals and Pharmaceuticals; Dr. Emma Ezenwaji — Chairman of Governing Board, ASWAMA; and Mr. Mike Ozoemena —MD/CEO, Anambra State Waste Management Authority (ASWAMA).\nOthers include: Dr. Simeon Onyemaechi —MD/CEO, Anambra State Health Insurance Agency; Mr. Tony Ujubuonu — MD/CEO, Anambra State Signage and Advertising Agency; Barr.\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "UPDATED: ISWAP linked to Owo Church attack – FG",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government has disclosed that last Sunday attack on St. Francis Catholic Church, Owo, Ondo State, by gunmen leading to the death of worshippers have been linked to Islamic State of West African Province (ISWAP).\nThe Minister of Interior, Rauf Aregbesola who briefed State House Correspondents at the end of National Security Council Meeting presided over by President Muhammadu Buhari.\nAccording to him, the imprint of ISWAP has been found at the scene of the attack, vowing that they will be brought to Justice.\nHe said: “The Council is quite concerned about the violent attack in Owo, Ondo State.\nOthers were Chief of Defence Staff, General Lucky Irabor, Service Chiefs and heads of other security agencies."
  },
  {
    "headline": "Outcome of ADC Presidential Primary disappointing – Moghalu",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaFormer Deputy Governor of Central Bank of Nigeria and Presidential Aspirant of the African Democratic Congress (ADC), for 2023 General Election, Kingsley Moghalu, has described the outcome of the party’s presidential primary as disappointing.\nThe statement read thus: “The presidential primary of the African Democratic Congress for the 2023 general election concluded in the early hours of today, 09 June 2022, and had a disappointing outcome.\nI would also like to congratulate some of the other aspirants who embraced a different kind of politics and leadership for our country.\n“For me, the process and outcome of the presidential primary require deep reflection, and I will be doing so.\nI remain available to serve our country.”Partner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Petrol tanker explodes in Jos, killed driver, destroys UNIJOS veterinary hospital",
    "summarized_story": "From Gyang Bere, JosA Petrol Tanker carrying Premium Motor Spirit lost control on Thursday night and crashed into the premises of University of Jos veterinary Teaching Hospital Jos which led into the death of the driver.\nThe tanker which crashed around the Polo round about Jos, burnt several properties including a filling station located around the area.\nThe fire also razed down part of the University of Jos Veterinary Teaching Hospital, located around Polo, in Jos North Local Government Area of Plateau State.\nIt was observed that a filling station, shops, and other structures located close to the hospital were equally affected by the incident.\n”We have one of the best veterinary teaching hospitals in the country, and this is a huge lost to the university and the nation in general."
  },
  {
    "headline": "Super Eagles Labour to 2-1 Victory over Sierra Leone in Abuja",
    "summarized_story": "AFCON 2023 QUALIFIERS:* G’Bissau hammer São Tomé 5-1 to lead Group ADuro IkhazuagbeNigeria’s Super Eagles returned to winning ways on Thursday evening as the three-time African champions laboured to a 2-1 victory over Leone Stars of Sierra Leone in an AFCON 2023 Group A qualifier at the MKO Abiola Stadium in Abuja.\nIn the other half of the field,Leone Stars put up more zeal to curtail the attacking forays of the Super Eagles.\nTo say the least, the playing turf of the MKO Abiola Stadium did not help Super Eagles play as it appears a poor job.\nMeanwhile, while Eagles laboured to the 2-1 victory, Guinea Bissau hammered São Tomé and Principe 5-1 to lead the Group A.\nThe Super Eagles will on Monday face Sao Tome and Principe in Agadir, Morocco in Nigeria’s Match-day 2 fixture of the AFCON 2023 qualifiers."
  },
  {
    "headline": "Osinbajo Congratulates Tinubu, Says ‘His Sterling Contributions to Democracy Stand Him out’",
    "summarized_story": "* Calls on members to unite behind party’s candidateVice President Yemi Osinbajo has congratulated presidential flagbearer of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu, on his victory at the party’s Presidential Primaries.\nIn a message signed by Osinbajo, the Vice President said Tinubu’s “sterling contributions to our democracy and its progress stand him out”.\nHe called on all party members, regardless of who they voted for at the primaries, to unite behind the party’s candidate to ensure victory in the 2023 elections.\nHis sterling contributions to our democracy and its progress stand him out.\nProfessor Yemi Osinbajo, SANVice President of the Federal Republic of Nigeria.9th June 2022Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Abacha’s ex-CSO, Al-Mustapha, Emerges Action Alliance Presidential Candidate",
    "summarized_story": "Sunday Aborisade in AbujaThe Chief Security Officer (CSO) to the late Gen. Sani Abacha when he was military Head of State, Major Hamza Al-Mustapha (rtd.\n), has emerged as the presidential candidate of the Action Alliance (AA) for the 2023 general election.\nThe aide of the late military leader contested the presidential primary with another aspirant Samson Odupitan, following the withdrawal of two others, Messrs Felix Osakwe and Tunde Kelani, who pledged their support for Al-Mustapha.\nBut Odupitan insisted that he was contesting the presidential primary to take care of the interest of the masses of the country.\nAl-Mustapha said: “I’m a humble person and I have what it takes to contain the insecurity ravaging the country."
  },
  {
    "headline": "FG Fingers ISWAP in Owo Killings, Orders Probe of Alleged Blasphemy Killings",
    "summarized_story": "Deji Elumoye in AbujaThe federal government Thursday disclosed that the recent killing of over 30 worshippers in Owo, Ondo State was carried out by the militant group, the Islamic State of West African Province (ISWAP).\nHe said government has directed security forces to go after ISWAP over the dastardly act with a view to bringing them to face the wrath of the law.\nThe minister also said government has ordered a proper investigation of the alleged blasphemous killings in Sokoto and the Federal Capital Territory (FCT).\nAccording to him, the Inspector-General of Police and other security agencies are expected to thoroughly look into the killings and report back to government.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Just In: Gunmen Kill Six in Ondo",
    "summarized_story": "*Not a reprisal, say PoliceFidelis David in AkureGunmen have killed six men at Sabo area of Ondo town, in Ondo West Local Government Area of the state.\nThe latest incident is coming three days after the murder of over 40 worshippers on Sunday, at St Francis Catholic Church, Owa-luwa Street, in Owo LGA of Ondo State.\nEyewitness said the gunmen stormed the area on motorbikes around 12:30am and opened fire on innocent roadside petty traders.\nHe said: “They came to our area (Sabo) on motorbikes and each was carrying three gunmen.\n“The Commissioner of Police, Ondo State Command, Oyeyemi Oyediran, urged the people of the state to remain calm and disregard the fake news, as the rumour mongers are out to stir unnecessary chaos and disrupt the peace of the State."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "Al-Mustapha, former aide to Abacha, wins AA presidential ticket",
    "summarized_story": "Hamza Al-Mustapha, a former aide to the late Sani Abacha, has secured the presidential ticket of the Action Alliance (AA) to participate in the 2023 general election.\nAl-Mustapha won the election with a total of 506 votes, defeating Samson Odupitan, his only opponent.\nHe was declared the party’s flagbearer at the AA presidential primary held on Thursday in Abuja.\nAccording to NAN, two aspirants — Tunde Anifowose and Felix Osakwe — withdrew from the presidential race for Al-Mustapha.\n“I appreciate all party delegates, supporters, and officials of the Independent National Electoral Commission (INEC) who have all defied the rain to witness this event."
  },
  {
    "headline": "Al-Mustapha, former aide to Abacha, wins AA presidential ticket",
    "summarized_story": "Hamza Al-Mustapha, a former aide to the late Sani Abacha, has secured the presidential ticket of the Action Alliance (AA) to participate in the 2023 general election.\nAl-Mustapha won the election with a total of 506 votes, defeating Samson Odupitan, his only opponent.\nHe was declared the party’s flagbearer at the AA presidential primary held on Thursday in Abuja.\nAccording to NAN, two aspirants — Tunde Anifowose and Felix Osakwe — withdrew from the presidential race for Al-Mustapha.\n“I appreciate all party delegates, supporters, and officials of the Independent National Electoral Commission (INEC) who have all defied the rain to witness this event."
  },
  {
    "headline": "PHOTOS: After winning APC ticket, Tinubu visits Osinbajo in Abuja",
    "summarized_story": "Bola Tinubu, presidential candidate of the All Progressives Congress (APC), has visited Vice-President Yemi Osinbajo, at the latter’s residence in Abuja.\nOsinbajo, who had contested against Tinubu, came third in the election with 235 votes.\nHowever, the former Lagos governor, who won the ticket, got 1,271 votes, while his closest challenger, Rotimi Amaechi, former transportation minister, secured 316 votes.\nPrior to the primary, which was concluded on Wednesday, there were speculations over the relationship between Tinubu and Osinbajo — the vice-president had served as attorney-general of Lagos, while Tinubu was governor.\nAdvertisementMeanwile, Osinbajo, earlier on Thursday, had congratulated Tinubu and praised him for his performance in the exercise."
  },
  {
    "headline": "PHOTOS: After winning APC ticket, Tinubu visits Osinbajo in Abuja",
    "summarized_story": "Bola Tinubu, presidential candidate of the All Progressives Congress (APC), has visited Vice-President Yemi Osinbajo, at the latter’s residence in Abuja.\nOsinbajo, who had contested against Tinubu, came third in the election with 235 votes.\nHowever, the former Lagos governor, who won the ticket, got 1,271 votes, while his closest challenger, Rotimi Amaechi, former transportation minister, secured 316 votes.\nPrior to the primary, which was concluded on Wednesday, there were speculations over the relationship between Tinubu and Osinbajo — the vice-president had served as attorney-general of Lagos, while Tinubu was governor.\nAdvertisementMeanwile, Osinbajo, earlier on Thursday, had congratulated Tinubu and praised him for his performance in the exercise."
  },
  {
    "headline": "Buhari to Tinubu: Your victory at APC primary a source of hope for Nigeria's future",
    "summarized_story": "President Muhammadu Buhari has congratulated Bola Tinubu for winning the presidential ticket of the All Progressives Congress (APC).\nTinubu, a former governor of Lagos, at the conclusion of the APC presidential primary on Wednesday, polled 1,271 votes to defeat 13 other contenders for the ticket.\nIn a letter addressed to Tinubu on Thursday, Buhari expressed satisfaction with the conduct of the exercise, and said he was impressed with the former Lagos governor’s performance.\n“Thus, your victory at the APC primaries represent for Nigerians, a source of hope for a future characterised by peace, prosperity and freedom for all.\n“I look forward to working closely with Your Excellency, your campaign team and the wider APC family to ensure victory for the APC."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Hostel.ng wants to connect Nigerian students to quality and affordable hostels",
    "summarized_story": "Okafor started building Hostel.ng in 2019, with help from his co-founders, Olujobi and Tobi Otomewo, a frontend developer.\nThe short-stay leasing feature allows students to rent out their hostels to other students who are on a short visit.\nLater this year, Okafor said, Hostel.ng will launch a rent financing feature that would allow students to pay for hostel accommodation in instalments, spread over 6 months.\nLast year, Hostel.ng introduced its short-stay lease on WhatsApp by manually pairing students who wanted to lease their hostels with those in need of accommodation.\nHe believes the launch of the short-stay lease and rent financing features will make Hostel.ng profitable."
  },
  {
    "headline": "Kenya wants to introduce a 20% tax for digital lenders",
    "summarized_story": "The Kenyan government has announced plans to introduce a 20% excise tax on all fees charged by all digital lenders.\nLike many other countries on and off the continent, Kenya’s digital lending space is rapidly growing.\nAt least 13% of Kenya’s population of 53.7 million people have taken digital loans from more than 120 digital lenders operating in the country.\nThe approval also subjected digital lenders to the Data Protection Act, which prevents them from violating users’ privacy through debt-shaming.\nThe proposed 20% tax could have unintended effects on the millions of Kenyans who use digital loan apps."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Atiku releases private-sector led economic agenda",
    "summarized_story": "Atiku Abubakar, the presidential candidate of the People’s Democratic Party (PDP) for the 2023 presidential election has released his economic guiding principle, promising to give the private sector a greater role in the economy.\nThe former vice president stated this in his agenda released on his Twitter page on Thursday titled, ‘The three guiding principles of my economic agenda’.\nAtiku noted that his administration would break government monopoly in all sectors of the economy including infrastructure.\nThe presidential candidate vowed to allow the market a greater leverage in determining the prices, which would aid in eliminating the frequent price distortions in the country.\nAtiku, who was also PDP’s presidential candidate in the 2019 general elections, again won the party’s presidential ticket during a special national convention held in Abuja on May 28 and 29."
  },
  {
    "headline": "Atiku releases private-sector led economic agenda",
    "summarized_story": "Atiku Abubakar, the presidential candidate of the People’s Democratic Party (PDP) for the 2023 presidential election has released his economic guiding principle, promising to give the private sector a greater role in the economy.\nThe former vice president stated this in his agenda released on his Twitter page on Thursday titled, ‘The three guiding principles of my economic agenda’.\nAtiku noted that his administration would break government monopoly in all sectors of the economy including infrastructure.\nThe presidential candidate vowed to allow the market a greater leverage in determining the prices, which would aid in eliminating the frequent price distortions in the country.\nAtiku, who was also PDP’s presidential candidate in the 2019 general elections, again won the party’s presidential ticket during a special national convention held in Abuja on May 28 and 29."
  },
  {
    "headline": "Voters meet challenges in move to beat PVC deadline",
    "summarized_story": "The closure of the Alaba market in Lagos is part of the effort to increase registered participants.\nSome claimed that INEC officials were not present at the registration centres, while others claimed that thugs disrupted the process.\nComments from TwitterThe ever-busy Alaba international Market closed its gates for traders to go and obtain their PVC.\nHowever the ever busy Alaba international Market traders has reported that there are injustice & tribalism going on at the INEC office.\nIt’s unfortunate that @inecnigeria is frustrating the zeal of citizens to register and get the PVC registration extension date is a must!"
  },
  {
    "headline": "NBM Holds 43rd National Convention In Benin, Expresses Readiness To Partner FG On Cyber Crime, Others – Nigerian Observer",
    "summarized_story": "He said the theme for the convention was “The fight against cybercrime, fraud, and insecurity: The pivotal role of NBM of Africa.\n“Every member of the NBM of Africa should act and preach peace.\nThree million apostles of peace and a crime-free society is indeed the best and better way to fight cybercrime and insecurity in our society.\n“I strongly believe our society will be a better place with less crime if NBM of Africa pursues vigorously its set programs to check the menace of cybercrime and insecurity.\nIn doing this, NBM of Africa will partner with various security agencies namely, the Nigerian Police Force, EFCC, ICPC, and Civil Defence in the fight against crimes and insecurity”."
  },
  {
    "headline": "Woman Drags Mopol to CP Over Alleged Threat To Life – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – An Auchi-based woman in Etsako West local government area of Edo State Mrs Queen Okojie has dragged a Mobile Police Officer Inspector Monday Aidomoh to the Edo State Commissioner of Police, alleging threat to her life, assault and illegal seizure of personal property by the officer.\n“The relationship between Netty Abu and our client has been so strained because of constant quarrels between them always caused by Netty Abu.\nHe expressed his disappointment when he referred the Commissioner of Police to his client’s initial petition on the same case.\nHowever, copies of the said initial petition were sent to the Squadron Commander, Mopol 60, Iyamoh, Edo State, the Managing Director, Hartland Nig.\nLtd, Imeke-Uzairue, Edo State, and the Coordinator, Edo State Civil Society Organisation of Nigeria, Auchi Branch, Edo State."
  },
  {
    "headline": "Edo Govt orders AAU to resume – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…suspends ASUU, othersBENIN CITY – The Edo State Government at its State Executive Council meeting, Wednesday, has suspended all union activities across all state-owned institutions of higher learning following the protest by students of Ambrose Alli University, Ekpoma, over the lingering strike by the Academic Staff Union of Universities.\nIn a statement made available to journalists by Crusoe Osagie, the Special Adviser on Media Projects to the Edo State Governor, Godwin Obaseki, it was gathered that the Secretary to the State Government, Osarodion Ogie, said the affected unions include ASUU, Non-Academic Staff of Universities, Senior Staff Association of Nigeria Universities, Academic Staff Union of Polytechnics, Non-Academic Staff Union of Polytechnics, and all allied unions operating across all state-owned tertiary institutions.\nOgie stated, “By this notice, academic activities are to resume in all state-owned institutions and all cadre of staff are directed to report to their duty posts immediately.\n“Students across all state-owned tertiary institutions are expected to resume for lectures as necessary measures have been taken to ensure resumption of academic and non-academic activities.”He added, “Management of the affected institutions have been mandated to pay all outstanding salaries immediately.\n“The management of Ambrose Alli University, Ekpoma, is hereby directed to implement a no-work-no-pay policy, declare vacant and advertise the position of any staff that refuses to resume work in line with this directive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki inaugurates 13-man c’ttee to drive productivity, industrial growth – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, Thursday, inaugurated a 13-man Edo State Productivity Committee to sustain the government’s efforts at stimulating productivity and driving the state’s industrial growth.\nThe governor said his government will continue to deliver value as well as quality services to the people, ensuring a better livelihood for residents of the state.\nWe must utilise our resources and ensure people deliver value to the society and state.\n“We have started in Edo State to reposition our public service to deliver quality services to the people.\nWe train people, create the enabling environment and ensure they deliver services."
  },
  {
    "headline": "JUST IN: Tinubu visits Osinbajo in Abuja, as VP congratulates ex-Lagos gov",
    "summarized_story": "Bola Tinubu, presidential candidate of the All Progressives Congress (APC), on Thursday night, paid a surprise visit to Vice President Yemi Osinbajo at his Abuja residence.\nThere’s been some sort of bad blood between Tinubu and Osibanjo since the former decided to run against him for the ruling party’s presidential ticket.\nOn Wednesday, Tinubu trounced the vice president and other aspirants to emerge candidate.\n“I congratulate Asiwaju Bola Ahmed Tinubu on his victory at our party primaries and his emergence as the Presidential Candidate and Flagbearer of our great party, the APC for the forthcoming 2023 Presidential Elections,” Osinbajo said.\nHis wealth of experience will certainly be critical in our party’s continued efforts to attain a more secure and prosperous Nigeria,” Osinbajo said."
  },
  {
    "headline": "Victory against Sierra Leone deserved – Peseiro, Super Eagles coach",
    "summarized_story": "Jose Peseiro, Nigerian Super Eagles head coach has said his players deserved their victory against Sierra Leone in Abuja on Thursday.\nThe Super Eagles beat Leone Stars 2-0 with goals from Everton midfielder, Alex Iwobi and Napoli forward, Victor Osimhen overturning an early lead by the visiting team which scored in the 11th minute when Jonathan Morsay nodded home Musa Kamara’s pinpoint cross.\nSpeaking after the match, Peseiro who commended his players after his first win as coach, noted that they played much better than their opponents.\n“We were better than Sierra Leone in this game, we deserve to win.\nWe changed the setup in the second half, I think it was only the last 10 minutes our opponent had some good moments,” Peseiro told reporters after the game."
  },
  {
    "headline": "UNICEF sends 300,000 girls back to schools in Katsina",
    "summarized_story": "Adebayo ObajemuAs part of its mandate of increasing education opportunities among girl child,the United Nation Children Education Fund, UNICEF,has enrolled more than 300,000 girls of school age in schools in Katsina State the we instrumentality of the Girls Education Project (GEP3) intervention project of the United Nations Children’s Fund (UNICEF) .\nRecall that the GEP3 was implemented by UNICEF in Katsina, Sokoto, Zamfara, Bauchi, Kano and Niger states with the support of the Foreign, Commonwealth and Development Office (FCDO) of the UK.\nMr Mukhtar, revealed this in Katsina during a three-day training on girls’ education with journalists, adding that the project, through community campaign, peer support to girls and family negotiation, has improved the attitude of residents towards girls’ enrolment and completion of schooling.\n“Since 2012, 210 head teachers have acquired knowledge and skills on school management, hold professional development meetings with staff and provide pedagogical leadership.\nMr Mukhtar added that 180 Girls for Girls groups were created in 60 junior secondary schools across six participating local government areas in the state."
  },
  {
    "headline": "Osun 2022: Group condemns destruction of Adeleke’s billboard, calls for IGP’s intervention",
    "summarized_story": "Oladiti Aluko, Akinleye Sola, and Alhaji Lukman Afolabi respectively alleged a commissioner under the APC government to be the sponsor of the alleged billboard destroyers.\nThey said, “Osun is a peace-loving state, nobody should hide under the guise of election to truncate the existing peace the state is known for.\nWe at the PDP have been law-abiding people, we have been campaigning without any violence.\nDestroying the billboard of our candidate by the ruling APC government would not be tolerated at all.\n“Let each political parties embark on a campaign based on what they have for the people of Osun."
  },
  {
    "headline": "Labour Party factional presidential candidate, Ezenwafor withdraws",
    "summarized_story": "Factional presidential candidate of the Labour Party, Jude Ezenwafor, has withdrawn from the 2023 presidential race.\nEzenwafor, had on Wednesday, emerged factional candidate of the party, produced by a faction contesting the legitimacy of the party leadership that produced Peter Obi as presidential candidate.\nThe Okafor faction then opted to elect Ezenwafor candidate, a development that attracted criticisms from those who accused him of trying to undermine Mr Brown Obi.\nOn Thursday, he wrote to the party’s factional leadership announcing his decision to discontinue the presidential quest.\nI thank the leadership of our great Party for giving me the opportunity to serve Nigeria.”"
  },
  {
    "headline": "African Bar Association Rejects ICC’s Probe Of Nigerian Military",
    "summarized_story": "President, African Bar Association (AfBA), Hannibal Uwaifo, has said the association will mount opposition to the ongoing probe of the Nigerian military by the International Criminal Court (ICC).\n“The AFBA will discuss this line of support with the Defence Headquarters of Nigeria and the leadership of other armed forces in Africa who need support,” he said.\nThe AFBA president said the conference was organised in collaboration with Defence Headquarters to address the many complex security challenges facing the African Continent.\nHence, he said it was vital to employ law reform for capacity building of personnel to meet global standards of engagement particularly in asymmetric operations which the armed forces were currently engaged in.\nAccording to him, the role of the military lawyer in the armed forces and other security agencies are very fundamental."
  },
  {
    "headline": "African Bar Association Rejects ICC’s Probe Of Nigerian Military",
    "summarized_story": "President, African Bar Association (AfBA), Hannibal Uwaifo, has said the association will mount opposition to the ongoing probe of the Nigerian military by the International Criminal Court (ICC).\n“The AFBA will discuss this line of support with the Defence Headquarters of Nigeria and the leadership of other armed forces in Africa who need support,” he said.\nThe AFBA president said the conference was organised in collaboration with Defence Headquarters to address the many complex security challenges facing the African Continent.\nHence, he said it was vital to employ law reform for capacity building of personnel to meet global standards of engagement particularly in asymmetric operations which the armed forces were currently engaged in.\nAccording to him, the role of the military lawyer in the armed forces and other security agencies are very fundamental."
  },
  {
    "headline": "Social Inequality, Threat To Nigeria’s Existence – Gov Fayemi",
    "summarized_story": "The governor also linked social inequality, poverty, and unemployment to a major menace bedevilling the country.\nFayemi who was represented by the convener of the Nigerian Agenda, Ahmed Sajoh, said: “We have not constructed shared values as members of the elite class.\nIn the process, we have left our people also to grope in the dark with shared values.\nHe said because the nation has eroded those values, it has led to a high level of poverty and social inequality.\n“Poverty and social inequality are the key components of things we need to restructure our country."
  },
  {
    "headline": "Social Inequality, Threat To Nigeria’s Existence – Gov Fayemi",
    "summarized_story": "The governor also linked social inequality, poverty, and unemployment to a major menace bedevilling the country.\nFayemi who was represented by the convener of the Nigerian Agenda, Ahmed Sajoh, said: “We have not constructed shared values as members of the elite class.\nIn the process, we have left our people also to grope in the dark with shared values.\nHe said because the nation has eroded those values, it has led to a high level of poverty and social inequality.\n“Poverty and social inequality are the key components of things we need to restructure our country."
  },
  {
    "headline": "Police Intercept 40-feet Container Truck With Crude Oil",
    "summarized_story": "Operatives of the police Special Task Force on Petroleum and Illegal Bunkering (STFPIB) have intercepted a 40-feet container truck conveying a large quantity of crude products suspected to be illegally refined Automotive Gas Oil (AGO) stuffed in sacks.\nThe truck with registration number JRV 322 XV was driven by one Chukwudi Okafor aged 54, who had been arrested in connection with the offence.\nADVERTISEMENTHe stressed that the actions of these economic saboteurs had become worrisome due to the huge losses being recorded as a result of their criminal activities.\nThe inspector-general of police also warned police operatives attached to the task force to be focused, committed, and patriotic.\nThe IGP further warned all economic saboteurs to cease their unwholesome activities henceforth else they would be made to face the full wrath of the law."
  },
  {
    "headline": "BREAKING: ISWAP Responsible For Owo Church Attack – National Security Council",
    "summarized_story": "The National Security Council, on Thursday, revealed that the Islamic State, West African Province masterminded the deadly attack on St. Francis Catholic Church, Owo, Ondo State that left over 25 people dead on Sunday, June 5, 2022.\nThe Minister of Interior, Rauf Aregbesola, disclosed this to State House correspondents, shortly after the over three-hour council meeting presided over by the President, Major General Muhammadu Buhari (retd.\nAregbesola said the council has made adequate security preparations for the June 18 governorship election in Ekiti State.\nThose who attended the security meeting were Vice President Yemi Osinbajo, Secretary to the Government of the Federation, Boss Mustapha; the Chief of Staff to the President, Professor Ibrahim Gambari and the National Security Adviser, Major General Babagana Monguno (retd.).\nThe Chief of Defense Staff, General Lucky Irabor; Chief of Army Staff, Lt. Gen Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Amao were also in attendance."
  },
  {
    "headline": "Just in: Gunmen kill another six persons in Ondo",
    "summarized_story": "Just in: Gunmen kill another six persons in OndoSix persons were reportedly shot dead by suspected bandits in Ondo town, Ondo state on Wednesday night.\nThis is coming three days after 40 worshippers at St Francis Catholic Church in Owo, were killed by suspected terrorists during morning mass.\nReports had it that the victims were road side traders in the town.\nThe bandits reportedly robbed residents of the area before they took off.\nAnother source said that the gunmen were armed robbers who attempted to rob residence and traders in the areaContacted, the state Police image maker, Funmi Odunlami confirmed the killings."
  },
  {
    "headline": "Police Arrest Beedel Construction Owner Over Alleged N816m Fraud",
    "summarized_story": "An Ibadan-based businessman, Bukola Odeleye has been arrested by the Police Special Fraud Unit (PSFU) Ikoyi, Lagos State, for an alleged N816 million fraud.\nAccording to the Police Spokesperson, SP Eyitayo Johnson Odeleye, the suspect is the MD/CEO of BEEDEL Strategic Investment Company.\nHe was nabbed for alleged forgery of 11 Local Purchase Orders (LPOs) of five multinational companies and one federal agency.\n“The suspect was able to fraudulently obtain the sum of N816 million from two finance companies,” the police said.\nOdeleye put up construction adverts across Ibadan, the Oyo State capital, but no major development on the sites yet."
  },
  {
    "headline": "Senator Aliero dumps APC for PDP in Kebbi",
    "summarized_story": "Declaring his defection in Birnin Kebbi, the Kebbi State capital, Aliero said his decision was informed by his effort to fulfil the desire of his teeming supporters spread across the state.\nAliero is a two-term Governor of Kebbi State, Minister of the Federal Capital Territory and a serving member of the red chamber.\nThe lawmaker said, “I, Muhammadu Adamu Aliero, people of my constituency, that is Kebbi Central and my teeming supporters from across Kebbi State have resolved to defect from APC to PDP due to the injustices we endured in our former party.\n“Those in support of my political ideology were deceived and treated unjustly, hence the need for us to leave the party for another political party where we feel we shall be accommodated and treated justly.”According to him, before arriving at a conclusion of leaving the party, he made several efforts to resolve the issue including complain to the national headquarters of the party but in spite of the intervention of party officials, nothing positive came out of it.\nHe, therefore, appealed to all his supporters in Kebbi Central Senatorial District as well as other loyalists across the state to vote PDP to ensure its victory at all levels."
  },
  {
    "headline": "Breaking: In Zamfara, longest serving monarch dies at 93",
    "summarized_story": "The death has occurred of the longest-serving traditional ruler in Zamfara state, the emir of Kwatarkwashi, Alhaji Ahmad Umar.\nAccording to the statement signed by the Secretary to the state government, Balarabe Danisa, and made available to Blueprint, the emir died after protracted illness, aged 93.\nAlhaji Ahmad Umar has been a longest and eldest traditional ruler on the throne not only in Zamfara but across the country as he spent 61 years as emir of Kwatarkwashi.\nThe 93-year-old Emir, was first appointed a village head in Samawa by his elder brother, who was then a district head.\nThe Late emir was also turbaned as the 28th traditional ruler of Kwatarkwashi by late Sultan of Sokoto, Sir Abubakar III, on March 17, 1961."
  },
  {
    "headline": "Breaking: Iwobi, Osimhen score, Peseiro gets first victory as Nigeria’s Super Eagles subdue Sierra Leone in AFCON clash",
    "summarized_story": "Alex Iwobi and Victor Osimhen scored two goals which enabled Super Eagles to defeat Sierra Leone in the first African Cup of Nations decided on Thursday night inside Moshood Abiola National stadium Abuja.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Happening now: Osimhen, Umar lead Super Eagles attack vs Sierra Leone in AFCON qualifier, match kicks off 5pm *See full lineup",
    "summarized_story": "Two Super Eagles Victor Osimhen and Sadiq Umar will lead attack for Nigeria against the lone stars of Sierra Leone in the first Nations Cup qualifying match on Thursday evening.\nThe match kicks off 5pm.\nShare this: TwitterFacebook"
  },
  {
    "headline": "Asaba Airport calibrates Instrument Landing System, targets international operations",
    "summarized_story": "By Anastacia Eluwa, AsabaAsaba Airport company has announced that it was targeting improved services and international flight operations with the successful verification of the Instrument Landing System (ILS) at the airport.\nManaging Director of the Asaba Airport Company, Christophe Penninck disclosed this in Asaba while addressing journalists during the verification of the ILS at the airport.\nHe said NAMA would formally carry out the calibration and certification following the successful verification of the ILS.\n“I am happy that a whole lot of changes have happened in this airport which justifies the government’s decision to concession the airport.\n“Starting from the number of traffic you have increased and bringing the airport to profitability and to the calibration of the instrument landing system ILS."
  },
  {
    "headline": "Stallion Group seeks to partner Bayelsa govt on Youth Empowerment, others",
    "summarized_story": "By Eunice Nnachi, YenagoaStallion Group, a business conglomerate which deals in automobiles, agricultural products and other sub-sectors of the economy has indicated interest in partnering the Bayelsa State Government on youth empowerment, sports and agricultural development.\nResponding, Senator Lawrence Ewhrudjakpo, expressed excitement over the offers made by the Stallion Group, saying the Senator Douye Diri-led administration would do everything within its reach to ensure a mutually beneficial partnership.\nHe said both Bayelsa United FC and Bayelsa Queens were open to sponsorship in kitting, transport and other logistics, especially now that Bayelsa Queens are going continental.\nSenator Ewhrudjakpo stressed that the State Government was ready to provide land and do everything necessary to enable the Stallion Group to site one of its regional assembly plants and workshops in Bayelsa.\nThe Bayelsa number two man, who pointed out that the state, was endowed with immense agricultural potential called on the Stallion Group to also venture into agricultural business to create jobs and wealth."
  },
  {
    "headline": "NMGS carries out investigations into gas emission, flare at Emene Enugu",
    "summarized_story": "By Palma IleyeNigerian Mining and Geosciences Society, NMGS, has said that its team of professionals have carried out an investigation into the gas emission and flare encountered during the drilling of a water borehole at Caritas University Amorji Nike, Emene Enugu, Enugu State.\nHe pointed out that the initial speculation that the flare was methane gas from fracking of the mature and fractured Nkporo/Enugu Formation is discountenanced due to the sustained flare that has maintained its intensity for over 7 days.\n“Drilling a relief well to kill the pressure and kill the flare may not be feasible because the subsurface geology and structure of the area are not understood.\n“Professional bodies like the NMGS with highly experienced and well-trained geoscientists should be involved in efforts by agencies of government and other organizations to find solutions to this hazard and further investigate the gas resources of the area.\n“If the gas resource in the area is found to be substantial, the federal government and Enugu State Government should develop a framework to harness the gas resources to enhance industrialization and job creation for the benefit of the state and the nation,” he continued."
  },
  {
    "headline": "Nigeria spent $13m on bitumen importation in 2020- NMCO",
    "summarized_story": "By Palma IleyeDirector General Nigeria Mining Cadastral Office, NMCO, Engr Simon Obadiah Nkom has said that Nigeria spent $13 million on bitumen importaton in 2020.\n“This shows that there will be rise in the value of bitumen market by 2027 which is why Nigeria should look into bitumen exploration that will bring development to the country.\nNkom stressed that Nigeria was ranked 6th in global bitumen deposit as demand for the mineral in Nigeria is high due to high road construction.\nMeanwhile, the total value of capital importation into Nigeria in Q1 2022 stood at US$1,573.14 million from US$2,187.63 million in the preceding quarter, the National Bureau of Statistics has said.\nWhen compared to the corresponding quarter of 2021, capital importation decreased by 17.46 per cent from US$1,905.89 million."
  },
  {
    "headline": "Quality geoscience data brought more investors into the mining sector- Garba",
    "summarized_story": "By Palma IleyeDirector General, Nigerian Geological Survey Agency, NGSA, Dr Abdulrazaq Garba, has said that there has been an influx of investors because of the quality of geoscience data the agency had generated.\n“Another advantage of Nigeria lithium is hard rock lithium found and that is what investors are looking out for worldwide.\nNIMEP is a hallmark project that provides reliable geo-sciences information needed by investors to make the right mining investment decisions in Nigeria.\nGarba said that many companies both local and international investors are interested in the data set generated.\nGarba said that the government had invested funds in generating Geoscience data for those minerals to enable investors have adequate knowledge about them."
  },
  {
    "headline": "ISWAP Behind Owo Church Attack – National Security Council",
    "summarized_story": "﻿The National security Council has blamed the Islamic State West Africa Province (ISWAP) for the attack on St. Francis Catholic Church, Owo, that led to the death of about 38 persons on June 5.\nThe Minister of Interior, Rauf Aregbesola, said this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nHe disclosed that security agencies, particularly the police, have been directed to apprehend the perpetrators.\nThe former governor said the attack has no ethnic-religious connection, affirming that the group’s activity has nothing to do with religion.\n“The figure I have now shows that 127 persons were involved and that the number of death now is 40."
  },
  {
    "headline": "Bandits Kill 32, Destroy Houses In Fresh Kaduna Attack",
    "summarized_story": "No fewer than 32 people have been reportedly killed by bandits in separate attacks on four communities within Kajuru Local Government Area of Kaduna State.\nThe affected communities are Ungwan Gamu, Dogon Noma, Ungwan Sarki and Maikori.\nHe added that the bandits in their large numbers first attacked Dogon Noma in the early hours of Sunday morning, and killed several people mostly men , before proceeding to Ungwan Gamu and Maikori villages where they also killed people and burnt down houses.\nA resident of one of the communities, also claimed that a helicopter was seen shooting at the residents from the air, while the remaining bandits were on the ground to attack any fleeing residents.\nHowever, a top security source countered the claim, saying that the military engaged the bandits both by ground and air, adding that this eventually forced the bandits to retreat."
  },
  {
    "headline": "Osinbajo Congratulates Tinubu On His Victory At APC Presidential Primary",
    "summarized_story": "Vice President Yemi Osinbajo, SAN, has congratulated Asiwaju Bola Ahmed Tinubu on his victory yesterday at the ruling All Progressives Congress Presidential Primaries.\nBelow is the full statement signed personally by the Vice President:“I congratulate Asiwaju Bola Ahmed Tinubu on his victory at our party primaries and his emergence as the Presidential Candidate and Flagbearer of our great party, the APC for the forthcoming 2023 Presidential Elections.\nI also congratulate President Muhammadu Buhari and all leaders of the APC for a successful Special Convention and Presidential Primary.\n“This is to certify that Asiwaju Bola Ahmed Tinubu, having scored the highest number of votes cast, is hereby declared the winner,” said Governor Atiku Bagudu of Kebbi State who returned Tinubu as the elected candidate.\nMore than 2,300 delegates voted in the contest that produced Tinubu as the presidential flagbearer of the ruling party."
  },
  {
    "headline": "2023 Elections: Amaechi Congratulates Tinubu, Pledges Full Support",
    "summarized_story": "Former Transportation Minister, Rotimi Amaechi, has congratulated Bola Tinubu on his emergence as the presidential candidate of the ruling All Progressives Congress (APC).\nTinubu won the election by a landslide, beating Ameachi, Vice President Yemi Osinbajo, Senate President, Ahmad Lawan and 10 others.\nHe polled a total of 1,271 votes – more than four times the votes scored by his closet rival, Amaechi who had 316 votes.\nREAD ALSO: Tinubu Beats Osinbajo, Amaechi, 11 Others To Win APC Presidential PrimaryIn a statement, he personally signed on Wednesday, Amaechi, who came a distant second, pledged to support Tinubu in ensuring that the APC maintains its grip on power next year.\n“Congratulations on your well-deserved victory at the APC Presidential Convention held on 07 – 08 June 2022 and extend my best wishes as you prepare for the 2023 Presidential Elections,” the statement partly read."
  },
  {
    "headline": "AFCON 2023: Super Eagles Labour To Beat Sierra Leone In Abuja",
    "summarized_story": "Nigeria’s Super Eagles on Thursday achieved a 2-1 victory over Sierra Leone in a Day 1 encounter of the 2023 Africa Cup of Nations qualification series at the MKO Abiola Stadium on Thursday.\nTwo minutes later, a good pass by Aribo was followed by a teasing cross from Calvin Bassey but Victor Osimhen’s header failed to find the target.\nIn the 10th minute, a brilliant pass from Sadiq Umar found Osimhen, whose shot drifted away.\nREAD ALSO: Lewandowski And Mane Headline Transfer Window Movers To WatchFour minutes later, the advantage could have been stretched for the visitors when they hit the upright on another counter-attack.\nThree minutes later, Kamara saved a strong Moses Simon header, and in the 35th minute, Musa Kamara came close with a stinging grounder as the visitors swarmed forward once more."
  },
  {
    "headline": "Ohanaeze Denies Describing Tinubu’s Emergence As ‘Calamity’",
    "summarized_story": "The Ohanaeze Ndigbo, has disclaimed a report circulating in some sections of the media, claiming that it described the election of Asiwaju Ahmed Bola Tinubu as the presidential candidate of the APC as a ‘national calamity.\nThe apex igbo socio cultural organization dissociated itself from the publication, said it did not emanate from the group.\nOhanaeze, in a statement by its national publicity secretary, Dr Alex Ogbonnia, said the group have no hands in the contents, context, comprehension and delivery of the unfounded statement.\nIt described the statement as unfortunate, saddened with its contents, especially the attacks on the person and health status of Asiwaju Bola Ahmed Tinubu.\nDr Ogbonnia said, “The secretary general of Ohanaeze Ndigbo Worldwide is H.E Amb."
  },
  {
    "headline": "VP Osinbajo congratulates Asiwaju on victory at APC Presidential primary",
    "summarized_story": "Vice President Yemi Osinbajo, SAN, congratulated Asiwaju Bola Ahmed Tinubu on his victory in the ruling All Progressives Congress Presidential Primaries held on Wednesday.\nIn a statement he personally signed, the VP said;“I congratulate Asiwaju Bola Ahmed Tinubu on his victory at our party primaries and his emergence as the Presidential Candidate and Flagbearer of our great party, the APC for the forthcoming 2023 Presidential Elections.\n“I also congratulate President Muhammadu Buhari and all leaders of the APC for a successful Special Convention and Presidential Primary.\nHis wealth of experience will certainly be critical in our party’s continued efforts to attain a more secure and prosperous Nigeria.\nOsinbajo added that all members of the APC, regardless of who voted who, everyone must now unite behind the Presidential Candidate and Flagbearer to ensure victory in the 2023 elections."
  },
  {
    "headline": "PDP Protests reschduling of APC Guber, Assembly Primary in Benue -",
    "summarized_story": "The Benue State chapter Peoples Democratic Party, PDP, has protested against the rescheduling of Governorship and State Assembly primaries by the All Progressives Congress, APC, in the State to the Independent National Electoral Commission, INEC.\nThe primary elections which have been slated for Wednesday and Thursday, 08-09 of June, 2022 are to be conducted in 12 out of 23 local government areas of Benue State.\nThe ruling party in Benue stated authoritatively that there is no correspondence from the INEC National headquarters in Abuja mandating the State office of the Commission to cover the rescheduled guber and State Assembly primaries in Benue State.\nThe PDP prayed the commission not to monitor the rescheduled APC primaries in Benue State, describing the election as illegal.\nThe Benue State Chapter of the All Progressives Congress had originally held its Gubernatorial Primary with the emergence of a suspended priest of the Catholic Church, Hyacinth Alia."
  },
  {
    "headline": "Zamfara APC Congratulates Tinubu on Presidential Primary Victory -",
    "summarized_story": "The National Leader of the All Progressives Congress and Former Governor of Lagos State, Asiwaju Bola Ahmed Tinubu, emerged the Presidential Candidate of the partyy after the Special National Convention and Presidential Primary of the Party held at the Eagle Square in Abuja.\nHe defeated all comers to emerge as the candidate polling 1271 votes to defeat former Rivers State Governor and Transport Minister, Rotimi Amaechi, who polled 316 votes and Vice President Yemi Osinbajo who polled 235 Votes.\nOthers who particiapted in the election were Chief Ikeobasi Mokelu 0 Votes, Former Imo State Governor, Senator Rochas Okorocha, 0 Votes, Clergyman, Pastor Tunde Bakare, 0 Votes, Former Minister of State For Education, Chukwuemeka Nwajiuba, 1 Vote, Kogi State Governor, Yahaya Bello, 47 Votes, President of the Senate, Ahmad Lawan, 152 Votes, Tein Jack Rich, 0 Votes.\nEkiti State Governor, Kayode Fayemi, Former Ogun State Governor, Ibikunle Amosun, Jigawa State Governor, Mohammed Badaru, Former Akwa Ibom State Governor, Obong Godswill Akpabio, Former Speaker of the House of Representatives, Honourable Dimeji Bankole, Senator Robert Ajayi Borrofice, Uju Ohanenye all stepped down for Asiwaju Bola Ahmed Tinubu as the Primary was about to commence.\nDr Felix Nicholas stepped down for Vice President Yemi Osinbajo."
  },
  {
    "headline": "Super Eagles Come From Behind to Beat Sierra Leone 2-1 in AFCON Qualifier",
    "summarized_story": "Two minutes later, a good pass by Aribo was followed by a teasing cross from Calvin Bassey but Victor Osimhen’s header failed to find target.\nIn the 10th minute, a brilliant pass from Sadiq Umar found Osimhen, whose shot drifted away.\nFour minutes later, the advantage could have been stretched for the visitors when they hit the upright on another counter-attack.\nHowever, in the 16th minute, Nigeria were level when an exchange of passes between Alex Iwobi and Moses Simon ended with the former emphatically finding the far corner of goalkeeper Mohamed Kamara’s post.\nThree minutes later, Kamara saved a strong Moses Simon header, and in the 35th minute, Musa Kamara came close with a stinging grounder as the visitors swarmed forward once more."
  },
  {
    "headline": "Nigeria: Kaduna Government Debunks Reports Terrorists Attacked with Helicopter, But Confirms 32 Killed",
    "summarized_story": "The Kaduna state government in Nigeria’s northwest has debunked reports that terrorists used a helicopter to kill 32 people in an attack on four communities in Kajuru Local Government Area of the state.\nAruwan said the Kaduna State Government had initially received reports from security agencies, that bandits attacked the villages of Dogon Noma, Ungwan Sarki and Ungwan Maikori in Kajuru LGA on Sunday.\nHe said the security report indicated that, the bandits stormed the area in large numbers on motorcycles and proceeded to raze several houses, as they attacked and killed locals.\n“The Kaduna State Government wishes to make a clarification based on reports received since Sunday.\n“The bandits attacked the first two locations and killed 31 citizens."
  },
  {
    "headline": "Nigeria Accuses ISWAP Terrorists of Owo Massacre, Orders Probe Of Alleged Blasphemy Killings",
    "summarized_story": "Nigeria’s Federal Government on Thursday disclosed that the recent killing of at least 40 worshippers in Owo, Ondo State, was carried out by the militant group, the Islamic State of West African Province (ISWAP).\nHe said government has directed security forces to go after ISWAP over the dastardly act, with a view to bringing them to face the wrath of the law.\nThe Minister also said government has ordered a proper investigation of the alleged blasphemous killings in Sokoto and Federal Capital Territory (FCT).\nDeji Elumoye in AbujaAccording to him, the Inspector-General of Police and other security agencies are expected to thoroughly look into the killings and report back to government.\nDetails Later…"
  },
  {
    "headline": "Tinubu Snubs Osinbajo + Igboho Says Owo Massacre Vindicates Him – Trending With Ojy Okpe",
    "summarized_story": "Presidential Candidate of the All progressives Congress Asiwaju Bola Ahmed Tinubu’s Victory at the APC National Convention on Wednesday, has been met with various reactions from a cross section of Nigerians.\nThe Former lagos state Governor while exchanging pleasantries with President Muhammadu Buhari and his wife, Aisha Buhari seemed to ignore Vice President Yemi Osinbajo who was sitting right next to the president at the VVIP boot.\nIn the wake of the tragic shooting that claimed at least 40 lives in Owo Ondo state, Yoruba Nation activist, Sunday Adeyemo popularly known as Sunday Igboho reacted in a viral audio stating that the incident has vindicated him, because he envisaged the tragedy.\nIn another development, an urgent debate was held at the House of Commons on Tuesday to ask the Secretary of State for Foreign, Commonwealth and Development Affairs Vicky Ford if she will make a statement on the killing of church worshippers in Ondo state, and on wider issues of violence against religious groups in Nigeria.\nFinally, a Nigerian lady identified as Deborah Yusuf is reported to be fighting for her life after she was allegedly pushed off the 3rd floor of a storey building in Benghazi, Libya by a suspected female human trafficker identified simply as Princess Jameu."
  },
  {
    "headline": "US: Uvalde Attack Survivor, 11, Covered Herself in Friend’s Blood",
    "summarized_story": "A student who survived the Uvalde school shooting by covering herself in a classmate’s blood has told the US Congress of the moment her teacher was killed during the massacre.\nThe Texas primary school shooting claimed the lives of 21 people, including 19 young children, and has renewed the US debate over gun laws.\nThe 11-year-old recalled her experience, which for her began when a teacher told students to hide after seeing the gunman.\nThe 18-year-old attacker shot her teacher as children took cover behind her desk and their book bags.\nSomething really needs to change.”Lawmakers also heard from the parents of Lexi Rubio, one of the students killed in the Uvalde shooting."
  }
]