[
  {
    "headline": "Olowu stool: Obasanjo, kingmakers screen seven princes, forward list to Abiodun",
    "summarized_story": "Former President Olusegun Obasanjo and Kingmakers of the Owu kingdom in Ogun State have screened seven princes jostling for the Olowu of Owu stool in Abeokuta North Local Government Area of Ogun State.\nThey have however forwarded the list of the elected candidates to the state Governor, Dapo Abiodun, for approval and announcement of the new Olowu.\nAccording to the results sheet, Prince Adegbemi Adewale, a PhD holder, came first with 1,027 points; Prince Adelani Oladimeji, scored 909 points, and Matemilola Adelola scored 886 points, while Prince Olatidoye Olaniyi scored 863 points.\nOur correspondent gathered following the nomination, the kingmakers led by Obasanjo last Wednesday conducted seven hours of screening on all the princes.\nImpeccable sources from the palace hinted that Obasanjo had addressed the seven candidates before and after the rounds of interviews which was witnessed by both the Abeokuta North Local Government Secretary and other officials."
  },
  {
    "headline": "2023: Think well before you resign, Shehu Sani advises political appointees",
    "summarized_story": "A former federal lawmaker, Shehu Sani, Sunday, urged political appointees and others planning to resign from their position in line with the Electoral Act 2022 and contest for elective offices to think well before handing over their resignation letters.\nThose affected by section 84(12) of the Electoral Act 2022 are ministers, commissioners, and aides to governors among other political appointees.\nBut reacting to the recent provision of the Electoral Act in a tweet on his Twitter handle on Sunday, Sani who represented Kaduna Central in the 8th Senate, warned appointees seeking political offices to rethink their position.\nHe tweeted, “Before you resign from your appointment or position to jump into the murky, treacherous & shark-infested waters of politics & contest elections, think twice & look left, right & deeper.\n— Senator Shehu Sani (@ShehuSani) April 3, 2022Copyright PUNCH."
  },
  {
    "headline": "Train attack: NRC confirms safety of 172 passengers, whereabouts of 21 others still unknown",
    "summarized_story": "The ill-fated train…80m of affected portion fixedBy Dirisu YakubuThe Nigerian Railway Corporation, NRC, has again confirmed the safety of two additional passengers aboard the ill-fated AK-9 train bombed by terrorists, penultimate Monday on the Abuja-Kaduna standard gauge rail line.\nWith the two recent additions, the total number of passengers confirmed safe is 172 as at the time of filing this report.\n“The corporation confirms updates that a total of 172 (additional 2 persons answered their call today) passengers on board the AK9 are safe and okay while 21 Passengers are still reported missing.\nA total of 80 metres of the affected section has been fixed including replacement of affected sleepers and twisted rails.\nWe equally sincerely sympathize and empathize with our injured passengers and indeed everyone on board the AK9 train of Monday 28th March, 2022 for the trauma this unfortunate incident has caused you,” he said."
  },
  {
    "headline": "Police arrest man, 27, for allegedly killing his father with a machete in Ogun",
    "summarized_story": "The Police Command in Ogun on Sunday said it had arrested a 27-year-old man, Ibrahim Sikiru, for allegedly killing his father with a machete at Onipanu area of the state.\nThe Police Spokesman in Ogun, DSP Abimbola Oyeyemi, disclosed this in a statement issued to newsmen in Ota, saying that the suspect was arrested on March 30.\nOyeyemi explained that the suspect was arrested following a complaint lodged at the Onipanu Divisional Headquarters,by one Abiodun Sunday.\n“The suspect, who is strongly suspected to be a cultist, has no reasonable explanation for his action when interrogated.\n“On March 31, the victim died while receiving treatment at the general hospital, and the family insisted on burying him according to the dictate of his religion,” he said."
  },
  {
    "headline": "How Nigeria can overcome insecurity through mechanised agriculture ― Ibekwe",
    "summarized_story": "By Steve OkoA Green House expert, Dr. Nnamdi Ibekwe, has said that conscious and heavy investment in mechanised agriculture remains the panacea to the rising insecurity in parts of the country.\nThe owner of the first green house in Abia, who regretted that government had only been paying lip service to mechanised farming, urged the youths to embrace agriculture.\nHe said his target was to make Bende rice belt a leading rice producer in the South East, adding that he will introduce the same technology being used by Taiwan and USA rice farmers.\nIbekwe who is aspiring to represent Bende North State constituency in the Abia State House of Assembly in 2023, said that if given the opportunity, he would sponsor bills that would re-invent the late Michael Okpara agric revolution in the state.\nIbekwe , who is seeking the ticket of the Peoples Democratic Party, PDP, said he would lay a foundation for grassroots development."
  },
  {
    "headline": "Niger Emir rescues two girls from forced marriage",
    "summarized_story": "The Emir of Agaie in Niger state, Alhaji Yusuf Nuhu, has rescued two girls from their parents who wanted to force them into early marriage.\nNuhu disclosed this to newsmen shortly after a sensitisation campaign on Gender-Based Violence (GBV) on Saturday in Agaie Local Government Area of Niger state.\n“Here in my emirate, I preach against early and forced marriage, currently, I have two girls under my custody whose parents wanted to force into marrying men they didn’t love.\n“Until their parents agree to allow them marry the men they love, I will not release the girls.\nHe described the sensitisation campaign as “key and timely” as it would complement the efforts of the council in sensitising members of the area against child abuse, early marriage and domestic violence."
  },
  {
    "headline": "I dread acting as a sex worker —Joy Igboanugo",
    "summarized_story": "That is the norm and it is a fact Nollywood actress Joy Igboanugo Eze a.k.a Dubbymama is well conversant with and in fact has never been found wanting of.\n“I love to interprete a lady or a mother character and I dread acting as a sex worker or anything related to it.\nShe said she’s not a judge over anybody and what they do on social media or in their private lives.\nWhatever they do on social media and we can’t decide their actions but I am not in support of it and do not encourage women and ladies,” she offered on the rising immorality on social media.\nIn fact I don’t believe that ‘runs girls’ are taking over the Nollywood industry."
  },
  {
    "headline": "N1.3bn disbursed to poor Nigerians in Katsina – FG",
    "summarized_story": "The Federal Government has disbursed N1.3 billion to 100,043 less privileged and poor households under the Conditional Cash Transfer (CCT) programme in Katsina State.\nAlhaji Abdulkadir Mamman-Nasir, Special Assistant on Empowerment and Special Intervention to Gov.\nAminu Masari of Katsina State, stated this at a rally organised by the NSIP’s beneficiaries, on Sunday in Katsina, NAN reportsMamman-Nasir, who is also the NSIP’s Focal Person in the State, said that each of the beneficiaries recieved N10,000 under the programme in the past two months.\nWhile 58,000 youth and women had been enrolled under the Government Enterprises Empowerment Programme (GEEP), adding that over 70 per cent of the beneficiaries were women.\nHe lauded President Muhammadu Buhari for the initiative, adding that the administration had adopted practical steps to fast track successful implementation of the programme."
  },
  {
    "headline": "Kaduna: Omokri renews calls for action against Sheikh Gumi after Imam Khalid’s suspension",
    "summarized_story": "A former aide to ex-President Goodluck Jonathan, Reno Omokri has called for action to be taken against controversial Sheikh Abubakar Gumi following the suspension of the Chief Imam of Apo Jumat Mosque, Abuja, Sheikh Nuru Khalid.\nSheikh Gumi is an influential Islamic cleric who had consistently defended the bandits in Northern Nigeria.\nOmokri tweeted on Sunday, “The chief Imam of Apo Jumat Mosque, Abuja, Sheikh Nuru Khalid, has been suspended for criticizing Buhari over the Abuja-Kaduna train bombing.\n“Yet, nothing has been done to the terrorists or Sheikh Gumi, their Public Relations Officer!\nThey punish critics and victims.”"
  },
  {
    "headline": "Why I have never voted – Pastor Adeboye",
    "summarized_story": "General Overseer of the Redeemed Christian Church of God, RCCG, Pastor Enoch Adeboye, on Sunday, said he has never voted because RCCG is mainly represented in every party.\nAdeboye, who spoke at the Church’s thanksgiving service in Lagos State, said voting for one will be unjust to the rest of his children.\nPolitics is not my calling but to be a pastor.\n”I have never told you this is the fellow you should vote for or the Party you should vote for.\n”The only reason I have never voted is that if I vote for one I will be unjust to the rest of my children."
  },
  {
    "headline": "Pray for Nigeria – Ekiti NUJ urges Muslim journalists",
    "summarized_story": "The Nigeria Union of Journalists, NUJ, Ekiti State Council has called on Muslims, particularly journalists to use the holy month of Ramadan to seek the face of Allah over the various challenges facing the country.\nIn a statement in Ado Ekiti, Chairman of NUJ, Comrade Rotimi Ojomoyela said it had become so obvious that Nigeria needed divine intervention going by the incredible happenings such as wanton killings and kidnapping of innocent persons, as well as economic downturn.\nOjomoyela said, “I believe in the power of prayer, especially in the holy month of Ramadan, let us lay bare the challenges of Nigeria before Allah and I have confidence that our prayers shall be accepted.”He congratulated Muslim journalists for the grace of Allah that sustained their lives to witness the season and prayed Allah to grant them the blessings of the holy month."
  },
  {
    "headline": "NCC’s Grace Ojougboh tasks PR, Media professionals on gender balancing",
    "summarized_story": "Public Relations and media professionals and other important institutions/agents of change in Nigeria have been urged to join advocacy for gender balancing, inclusion and fairness for the promotion of socio-economic development in the country.\n“Only recently, bills seeking gender equality were rejected by the National Assembly.\nIf we want economic growth, we must include women, women are transformational agents.\nShe said the findings of the study is a wake-up call that media and Public Relations practitioners have a whole lot to do in the fight for gender balancing in Nigeria.\n“As Public Relations practitioners, we must help to create gender-sensitive and gender-transformative content that will change perceptions and break gender stereotypes."
  },
  {
    "headline": "Niger Emir rescues two girls from forced marriage",
    "summarized_story": "The Emir of Agaie in Niger state, Alhaji Yusuf Nuhu, has rescued two girls from their parents who wanted to force them into early marriage.\nNuhu disclosed this to newsmen shortly after a sensitisation campaign on Gender-Based Violence (GBV) on Saturday in Agaie Local Government Area of Niger state.\n“Here in my emirate, I preach against early and forced marriage, currently, I have two girls under my custody whose parents wanted to force into marrying men they didn’t love.\n“Until their parents agree to allow them marry the men they love, I will not release the girls.\nHe described the sensitisation campaign as “key and timely” as it would complement the efforts of the council in sensitising members of the area against child abuse, early marriage and domestic violence."
  },
  {
    "headline": "CBN warns banks against ‘composed’ banknotes in their deposits",
    "summarized_story": "The Central Bank of Nigeria (CBN), has warned Deposit Money Banks (DMBs) to stop bringing “composed banknotes ” as part of their deposits with the apex bank.\nThe News Agency of Nigeria (NAN) reports that composed banknotes are mutilated currency notes comprising several parts of different banknotes of the same denomination.\nHe said that henceforth, composed banknotes discovered in the deposit of DMBs shall attract a penalty of 400 per cent of the value.\n“The management of the CBN observed with concern the increase number of composed banknotes deposited by DMBs and request for replacement of such banknotes by members of the public.\n“The existence of composed banknotes in the economy falsify the true value of currency in circulation, and can also be avenue for fraudulent activities."
  },
  {
    "headline": "Benue: Old foes back in the ring",
    "summarized_story": "Benue State is one of the states where a change of leadership must happen in 2023.\nChief Mike AondoakaaChief Mike Aondoakaa, former Attorney General of the Federation and Minister of Justice, is another APC governorship aspirant.\nChief Steven LawaniChief Steven Lawani is the only governorship aspirant on the platform of APC from Benue south senatorial zone.\nTitus Uba is the current Speaker of the Benue State House of Assembly.\nHe is the member representing Vandeikya/Konshisha Federal Constituency of Benue State at the National Assembly."
  },
  {
    "headline": "Akwa-Ibom: Crises rock PDP, APC over alleged imposition plots, zoning",
    "summarized_story": "He made the announcement at a PDP stakeholders’ meeting at Government House Lodge, Uyo.\nThe governor’s anointed candidate was thereafter presented to the PDP stakeholders by former Governor Victor Attah, according to reports of the parley.\nAt the PDP stakeholders’ meeting, His Excellency announced Mr. Umo Eno as the preferred candidate to succeed him.\nAnd he was thereafter presented to the PDP stakeholders by former Gov.\nIde Owodiong-Idemeko, who was 2019 PDP Akwa Ibom North-East senatorial aspirant, is also said to be preparing to join the race."
  },
  {
    "headline": "Buhari got it wrong on Omisore’s emergence as APC Secretary, says Soyinka",
    "summarized_story": "Nobel Laureate, Prof. Wole Soyinka yesterday questioned the propriety of last weekend’s emergence of Otunba Iyiola Omisore as National Secretary of the All Progressives Congress (APC).\nOmisore, he said, is a prime suspect in the Ige murder.\nThat the prime suspect was privileged in a number of improper ways went beyond mere allegation.\n“With the emergence of the said prime suspect as National Secretary of the Ruling Party, is the Inspector-General of Police equipped to confront political obstacles in a resumption of investigation?\nPrior incumbency of the position of National Secretary of a ruling party has demonstrated the potent interventionist clout that can be wielded from that office."
  },
  {
    "headline": "Abia: Gunmen abduct ABSU students, demand N2 million ransom per victim",
    "summarized_story": "From Okey Sampson, UmuahiaBandits suspected to be Fulani herdsmen have abducted an unspecified number of students of Abia State University Uturu (ABSU).\nThe abductors were reported to have contacted the families of the students and demanded N2m on each of their victims.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nA release by the Public Relations Officer (PRO) of the university, said the incident took place around 8:00 pm on Thursday.\nThe release while assuring that efforts were being intensified to secure the release of the affected students, advised students to avoid night travels."
  },
  {
    "headline": "Nigeria moving steadily into bankruptcy—-Pastor Adeboye",
    "summarized_story": "He said: “ I am not a politician and I am not hoping to become a politician in future.\nHe may decide to speak tomorrow but as of now he has not told me anything about 2023.\n“It is in the news that 80 percent of crude oil produced in the country is stolen.\nHow are the countries buying the stolen oil?\nAdeboye also lamented the security situation in the country, citing the isolation of Kaduna state by bandits for attack."
  },
  {
    "headline": "Herdsmen kill 11, injure 19 in Plateau community",
    "summarized_story": "From Gyang Bere, JosAbout eleven people were brutally murdered with 19 others sustaining gunshots injuries when gunmen suspected to be Fulani herdsmen attacked the Irigwe people during their annual festival ‘Zerreci’ in Bassa Local Government Area of Plateau State.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nZerreci is an annual festival to usher in the rainy season and prepare locals for the farming season.\nHe explained that troops of Operation SAFE HAVEN have been deployed to the area and would make public any information.\nNational Publicity Secretary Irigwe Youth Movement (IYM) Lawrence Zongo confirmed that the victims were attacked and killed by gunshots while others were hacked with machetes."
  },
  {
    "headline": "BREAKING! Election may not hold in 2023-Adeboye",
    "summarized_story": "By Adewale SanyaoluThe General Overseer of the Redeemed Christian Church of God(RCCG), Pastor Enoch Adejare Adeboye, has said selections may not hold next year.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nAdeboye said this Sunday morning during the Church’s mostly Thanksgiving Service which holds every first Sunday of the month.\nAdeboye in a live telecast service streamed live and monitored by Daily said the high level of insecurity in the country was worrisome.\nHe explained that those causing mayhem across the country were not even sure that they will live to witness 2023 because rapture may take place before then."
  },
  {
    "headline": "2023: Presenting Northern candidate against South will be war -Frank Kokori",
    "summarized_story": "By Omoniyi SalaudeenChief Frank Kokori is a chieftain of the ruling All Progressives Congress (APC).\nHow would you react to the escalating security situation in Nigeria especially the recent attacks by bandits on Kaduna-bound trains?\nThe PDP too can spring up a good candidate that will work for the good of the country.\nThere are many good people from the North in the PDP just as there are good people in the South.\nPresenting a Northern candidate against the South will be like a war."
  },
  {
    "headline": "Train Attack: NRC Confirms Safety of 170 Passengers",
    "summarized_story": "• As 21 are reported missing by relativesKasim Sumaina in AbujaThe Nigerian Railway Corporation (NRC), Saturday confirmed the safety of 170 passengers, even as it said that 21 passengers were still reported missing by the relatives who made calls to the corporation.\n“This update has become absolutely necessary so as to prevent the circulation of falsehood or misleading information to the general public.\n“Thus, the total seat capacity of the train is 840 seats.\nYou may also recall that the train manifest contained 362 validated passengers aboard the train.”The NRC boss hinted that the corporation, in continuation of its concerted effort through repeated calls, has been able to confirm the safety of “170 passengers, while 21 passengers are reported missing by the relatives who made calls to us,” Okhiria said.\n“In practical terms, a high powered restoration team, led by directors have been working round the clock to re-rail the coaches affected by the bomb blast."
  },
  {
    "headline": "Amaechi Joins Presidential Race",
    "summarized_story": "Minister of Transport, Mr Rotimi Amaechi, has joined the 2023 presidential race, THISDAY can reveal.\nWhile Amaechi has yet to make a formal declaration of his presidential bid, THISDAY at the weekend sighted a brochure prepared to sell his candidacy to Nigerians.\nIn line with the power zoning arrangement, agreed among political leaders since 1999, which rotates power between North and South, the presidential ticket of the ruling APC will move to South, as President Buhari who is serving his second term hails from the North.\nThe whole of Page Three of the brochure has the name of the minister boldly printed and translated into English as follows: Chibuike – God is Strength; Rotimi – Stand by Me; and Amaechi – Who Knows Tomorrow.\nThe brochure also has infographics of his achievements as Rivers governor and as transport minister ."
  },
  {
    "headline": "Buhari Meets El-Rufa’i over Kaduna Train Attack",
    "summarized_story": "Nasir El-Rufai of Kaduna State on Friday in Abuja updated President Muhammadu Buhari on security developments in his state following the Monday night’s terror attack on Abuja-Kaduna bound train.\nAccording to him, security agencies have been making frantic efforts to rescue victims of Monday night’s attack on a Kaduna bound train, from the hands of their abductors.\nEl-Rufa’i, who spoke in Hausa language, disclosed that the attack on the train was carried out by Boko Haram iinsurgents in collaboration with some bandits operating in Kaduna, Zamfara, Niger, Sokoto and Kebbi States.\nNAN recalls that the Kaduna-bound train, which left Abuja at 6 p.m. on Monday, was attacked by suspected terrorists at about 7.45 p.m., just about 15 minutes’ drive before Kaduna.\nEight persons had been officially confirmed dead, 46 hospitalised and several others kidnapped following the attack."
  },
  {
    "headline": "Challenged by Train Attack, Doubted by a Nervous Nation, Military Launches Offensive against Terrorists",
    "summarized_story": "The lawmakers demanded the sack of the National Security Adviser, Major General Babagana Monguno (rtd).\nThe Army, Navy, Police, DSS all of these agencies are accountable to the National Security Adviser.\nI’m calling for the resignation of National Security Adviser, he must be removed.\nThe lawmakers, therefore, urged the federal government to implement recommendations contained in the House security summit, held last year.\nThat bill was referred to the national security committee, but up till now, there is no report."
  },
  {
    "headline": "Stock Market Shrugs Off Insecurity Worries, Gained N3.02trn in Q1",
    "summarized_story": "Kayode TokedeThe market capitalisation of the Nigerian Exchange Limited (NGX) gained N3.02 trillion in the first quarter (Q1) of 2022, notwithstanding the growing insecurity concerns in the country.\nThe market performance was buoyed by impressive corporate earnings by major listed companies that saw some of them delivering robust dividend payout to shareholders.\nPrecisely, the market capitalisation gained N3.02 trillion to close on March 31, 2022, at N25.312 trillion, higher than the N22.297 trillion it opened for trading activities on January 4, 2021.\nOthers were the NGX Pension, NGX Industrial Goods, NGX 30, and NGX Lotus II that went up by 6.34 per cent, 5.63 per cent, 5.39 per cent, 4.37 per cent, and 1.18 per cent, respectively.\nHe added, “To invest profitably in this changing environment, you need investment education, trading plans and trading tools/software."
  },
  {
    "headline": "DOCUMENT: How Sokoto Governor Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years",
    "summarized_story": "A document from the Economic and Financial Crimes Commission (EFCC) and the Central Bank of Nigeria has exposed how the Sokoto State Government led by Governor Aminu Waziri Tambuwa stole, diverted about N189 billion from the state-owned accounts to private individuals.\nAccording to Abubakar, the accounts received a total cumulative inflow of N567,160,024,619.93 within the said period out of which N189,155,043,825.09 was illegally diverted.\n“The Department recently carried out financial profiling of the Sokoto State Government.\nThis profiling was aimed at identifying the state government’s accounts that may have been exposed to Diversion, misappropriation of public funds and money laundering by government officials,” part of the documents obtained by SaharaReporters read.\nDOCUMENT: How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Ye... by Sahara Reporters on ScribdSee Also Corruption EXCLUSIVE: Document Exposes How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years"
  },
  {
    "headline": "DOCUMENT: How Sokoto Governor Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years",
    "summarized_story": "A document from the Economic and Financial Crimes Commission (EFCC) and the Central Bank of Nigeria has exposed how the Sokoto State Government led by Governor Aminu Waziri Tambuwa stole, diverted about N189 billion from the state-owned accounts to private individuals.\nAccording to Abubakar, the accounts received a total cumulative inflow of N567,160,024,619.93 within the said period out of which N189,155,043,825.09 was illegally diverted.\n“The Department recently carried out financial profiling of the Sokoto State Government.\nThis profiling was aimed at identifying the state government’s accounts that may have been exposed to Diversion, misappropriation of public funds and money laundering by government officials,” part of the documents obtained by SaharaReporters read.\nDOCUMENT: How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Ye... by Sahara Reporters on ScribdSee Also Corruption EXCLUSIVE: Document Exposes How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years"
  },
  {
    "headline": "UK Court Jails Adeyinka Grandson, ‘Yoruba Supremacist’, Over Attacks On Igbo, Fulani",
    "summarized_story": "Grandson, also known as Adeyinka Shoyemi, a UK-based Nigerian of Yoruba descent, is known for his social media attacks on people of Igbo extraction as well as criticism of the Hausa-Fulani.\nHe was first arrested by the Scotland Yard Counter Terrorism Command, and the Metropolitan Police under the approval of the Westminster Magistrates’ Court in London in August 2019.\nScotland Yard Counter Terrorism Command had nabbed him for allegedly “stirring racial discrimination” against the Igbo and Fulani ethnic groups and also “encouraging terrorism”.\nOn several counts he had issued ‘quit notices’ to Igbo living in Yoruba land else they would face dire consequences.\nGrandson was found guilty on 30 November 2021 of eight counts of inciting racial hatred after a trial at Southwark Crown Court."
  },
  {
    "headline": "UK Court Jails Adeyinka Grandson, ‘Yoruba Supremacist’, Over Attacks On Igbo, Fulani",
    "summarized_story": "Grandson, also known as Adeyinka Shoyemi, a UK-based Nigerian of Yoruba descent, is known for his social media attacks on people of Igbo extraction as well as criticism of the Hausa-Fulani.\nHe was first arrested by the Scotland Yard Counter Terrorism Command, and the Metropolitan Police under the approval of the Westminster Magistrates’ Court in London in August 2019.\nScotland Yard Counter Terrorism Command had nabbed him for allegedly “stirring racial discrimination” against the Igbo and Fulani ethnic groups and also “encouraging terrorism”.\nOn several counts he had issued ‘quit notices’ to Igbo living in Yoruba land else they would face dire consequences.\nGrandson was found guilty on 30 November 2021 of eight counts of inciting racial hatred after a trial at Southwark Crown Court."
  },
  {
    "headline": "UK Court Jails Adeyinka Grandson, ‘Yoruba Supremacist’, Over Attacks On Igbo, Fulani",
    "summarized_story": "Grandson, also known as Adeyinka Shoyemi, a UK-based Nigerian of Yoruba descent, is known for his social media attacks on people of Igbo extraction as well as criticism of the Hausa-Fulani.\nHe was first arrested by the Scotland Yard Counter Terrorism Command, and the Metropolitan Police under the approval of the Westminster Magistrates’ Court in London in August 2019.\nScotland Yard Counter Terrorism Command had nabbed him for allegedly “stirring racial discrimination” against the Igbo and Fulani ethnic groups and also “encouraging terrorism”.\nOn several counts he had issued ‘quit notices’ to Igbo living in Yoruba land else they would face dire consequences.\nGrandson was found guilty on 30 November 2021 of eight counts of inciting racial hatred after a trial at Southwark Crown Court."
  },
  {
    "headline": "Kaduna train attack: Obi of Onitsha was never meant to be on board, says palace",
    "summarized_story": "Nnaemeka Achebe, Obi of Onitsha, has denied reports that a phone call saved him from boarding the Kaduna-bound train attacked by gunmen on Monday night.\nAccording to the Kaduna state government, about 362 passengers boarded the train.\nThe palace said the monarch, scheduled to deliver a lecture on Tuesday, March 29, at the Armed Forces Command and Staff College, Jaji, Kaduna, opted for road transportation with adequate security.\nThis has been His Majesty’s only public reference to the tragic train attack of 28 March.\n“The entire country is in dire straits on internal security, and anyone could be a victim in the situation that we currently face, for instance, the unfortunate victims of the train attack."
  },
  {
    "headline": "Kaduna train attack: Obi of Onitsha was never meant to be on board, says palace",
    "summarized_story": "Nnaemeka Achebe, Obi of Onitsha, has denied reports that a phone call saved him from boarding the Kaduna-bound train attacked by gunmen on Monday night.\nAccording to the Kaduna state government, about 362 passengers boarded the train.\nThe palace said the monarch, scheduled to deliver a lecture on Tuesday, March 29, at the Armed Forces Command and Staff College, Jaji, Kaduna, opted for road transportation with adequate security.\nThis has been His Majesty’s only public reference to the tragic train attack of 28 March.\n“The entire country is in dire straits on internal security, and anyone could be a victim in the situation that we currently face, for instance, the unfortunate victims of the train attack."
  },
  {
    "headline": "Adeboye: I don’t know if there'll be elections in 2023 -- God hasn't spoken to me yet",
    "summarized_story": "Enoch Adeboye, general overseer of the Redeemed Christian Church of God (RCCG), says he doesn’t yet know if there will be elections in 2023.\nSpeaking during a sermon on Sunday, the general overseer said God is yet to speak to him about the election.\n“As I am standing before you, I still don’t know whether there will be an election next year,” he said.\nI’m saying I don’t know yet.\nI don’t know because my father hasn’t talked to me about it at all."
  },
  {
    "headline": "Adeboye: I don’t know if there'll be elections in 2023 -- God hasn't spoken to me yet",
    "summarized_story": "Enoch Adeboye, general overseer of the Redeemed Christian Church of God (RCCG), says he doesn’t yet know if there will be elections in 2023.\nSpeaking during a sermon on Sunday, the general overseer said God is yet to speak to him about the election.\n“As I am standing before you, I still don’t know whether there will be an election next year,” he said.\nI’m saying I don’t know yet.\nI don’t know because my father hasn’t talked to me about it at all."
  },
  {
    "headline": "Soludo to FG: Speed up Kanu's trial or release him from indefinite detention",
    "summarized_story": "Chukwuma Soludo, governor of Anambra, has asked the federal government to handle the trial of Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), with speed so that he can be convicted or freed instead of being kept “in indefinite detention”.\nSoludo spoke at the peacebuilding and security dialogue held with stakeholders in Awka on Saturday over the deteriorating security challenges in the region.\nThe governor said an expeditious release of Kanu would cushion the insecurity impasse in the zone.\n“We will engage with the good, the bad and the ugly, we will not discriminate against anybody,” Soludo said.\n“We join our voices to the call for the unconditional release of Mazi Nnamdi Kanu by the Federal Government to douse the current tensions across the Southeast."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Peace Itimi: From Nigeria to the UK in search of peace",
    "summarized_story": "Peace Itimi has spent 9 months away from Nigeria but doesn’t miss the country.\nShe said university had been one of the most definitive phases of her life because it was where she found God, found herself, and digital marketing.\nFresh from school, she launched a digital marketing agency with a friend in 2016.\nIn 2018, she joined Wild Fusion, another digital marketing agency, where she trained people on digital marketing, branding, Google Ads, and SEO.\nDuring one of her travels for digital marketing training in Accra, she realised that even though she loved travelling, her physical reach was limited."
  },
  {
    "headline": "Two years on, what has #YouTubeBlack Voices done for African creators?",
    "summarized_story": "While YouTube aims to provide a platform for creators globally to explore their creativity, in 2020, it shined a special focus on Africa when it launched the #YouTubeBlack Voices Fund.\nAdetula’s biggest takeaway from the Fund is the opportunity to network with and form relationships with over 135 other top creators around the world.\nThe Fund’s inaugural cohort last year featured a Creator Class of 20 content creators, from Nigeria, South Africa, and Kenya.\nStill, in South Africa, 25 channels have over 1 million subscribers, an increase of over 30%, year over year.\nOver 65% of watch time on content produced by channels in South Africa comes from outside of South Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "NowNow reaffirms commitment to driving financial inclusion in Nigeria",
    "summarized_story": "The company has built an ecosystem that digitises payments and creates access to financial services for Agents, Consumers and Businesses.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos.\nLekan Akinjide, the Partnership Director of NowNow Digital Services, said, “We are a leading fintech and financial services enabler.\nNowNow offers more than financial inclusion; we want to educate Nigerians about Financial services by teaching them how to manage their money to help them achieve financial independence.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis; Head of Marketing & Communications, NowNow, Tasyana Bouran; and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos."
  },
  {
    "headline": "Fantasy sports in Africa: Can $3m funding make it popular?",
    "summarized_story": "The love for the game is now shared with the passion for fantasy football or football betting.\nWhile fantasy sports in Africa might be a fantasy (pun intended), compared to sports betting, it is big in other regions.\nAdvertisementInstead of betting on real-life football teams, fantasy football involves gambling on virtual teams created by the player-manager.\nSome other European leagues have a fantasy version of their leagues, with the Fantasy Liga and Fantasy Bundesliga owned by the Spanish and German leagues, respectively.\nAccording to football magazine FourFourTwo, FPL has eight million players globally who compete to be the Jose Mourinho of fantasy football."
  },
  {
    "headline": "Grocery shopping with the community",
    "summarized_story": "AdvertisementThere were appearances from countries like Sudan, Namibia, and Uganda, and we discussed all that on the Techpoint Africa podcast.\nHowever, Kenyan startup, Tushop, uses community group buying to help Kenyans save on food.\nSomeone — usually called a community leader — aggregates orders from individuals who live close to each other.\nIt is then relayed to the vendor, farmer, or distributor, after which it is delivered to the community leader.\nLast week on the Techpoint Africa Podcast, we spoke about white founders in Kenya, so it’s interesting to see a black female founder from Kenya today."
  },
  {
    "headline": "Nigeria’s unending lamentation over insecurity",
    "summarized_story": "Sadly, the lamentation seems endless for the citizens as the Nigerian government has proven incompetent at handling the situation.\nTrailing a more serious path, Ifewodor Ogala, a retired Navy officer, questioned the efforts of his former colleagues at fighting insecurity.\nFor Sam Onikoyi, a Nigerian researcher based in Belgium, the answer to the insecurity challenge in Nigeria lies with the government.\n“The insecurity challenge facing the country can never let Nigeria reach a greater height.\n“It is obvious that the Buhari administration needs to wake up and act fast in mitigating the insecurity of lives and property in this country."
  },
  {
    "headline": "2023: What Adamu’s emergence means for Tinubu’s ambition",
    "summarized_story": "I am the only one in the race that is most competent, most qualified to be your president come year 2023.\nThere have been agitations for a Southern Christian President in 2023 as the incumbent, a Northern Moslem bows out on May 29 next year.\n“I don’t think APC presidential ticket is all about religion.\nAdamu emerged the APC chairman despite having seemingly unending cases with the nation’s number one anti-corruption agency, the Economic and Financial Crimes Commission (EFCC).\nThe party had allocated the position of national chairman to the North-central geopolitical zone, based on a general framework that North and South would swap the national party offices they currently hold."
  },
  {
    "headline": "Edo extends internship, apprenticeship programme to youths in Edo North, Central – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the state’s skills development agency, EdoJobs has extended its internship and apprenticeship programme to youths in Edo North and Central Senatorial Districts, deploying the youths to different organizations to acquire firsthand knowledge of how organizations operate.\nThe programme is being organised in partnership with the German development agency, the Deutsche Gesellschaft Fur Internationale Zusammenarbeit (GIZ) and the Swiss Agency for Development Cooperation (SDC).\nThe Managing Director, EdoJobs, Ukinebo Dare, who disclosed this to journalists in Benin City, said the extension followed the success of the programme in Edo South.\nShe said the project is an arm of the Rural Youth Employment (RYE) to tackle unemployment in rural areas.\nThe scheme, which began in January and ends in April, is for the youths in Edo North and Edo Central."
  },
  {
    "headline": "Edo begins assessment of workers for promotion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the evaluation and assessment exercise for the promotion of workers in the state’s civil and public service.\nThe Edo State Head of Service, Anthony Okungbowa Esq., who disclosed this to journalists, in Benin City, during training/evaluation exercise for the workers, said the government is committed to sustaining reforms in the civil and public service to enhance optimal service delivery.\nOkungbowa said the Governor Godwin Obaseki-led administration will sustain efforts at retooling workers with the right skills and knowledge to provide quality service to Edo people.\nHe further disclosed that Governor Obaseki had earlier granted approval for the 2020 and 2021 promotions in order to ensure that all outstanding promotions are cleared, thereby guaranteeing that promotion in the civil and public service is done as and when due.\nOkungbowa stated that “the Government will always place the welfare of workers as a top priority as every Edo worker is valuable and essential for the programme and policies of Government to effectively strive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo partners GIZ, Swiss agency on 3 job centre projects – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has entered into partnership with the Deutsche Gesellschaft Für Internationale Zusammenarbeit (GIZ) and Swiss Agency for Development Corporation (SDC) on the establishment of three jobcentres across the state.\nThe new job centres are to be established across the three senatorial districts of the state, including Uromi, Esan North West Local Government Area (LGA); Auchi in Etsako West LGA, and Usen in Ovia South East LGA.\n“We launched the existing centres in September 2021, at the Edo Innovation Hub, at Wire Road and Edo Production Centre at Sapele Road.\nDare noted: “Solving the issue of unskilled graduates, unemployment and under-employment in one swoop, since 2017, EdoJobs has recruited workers for over 200 firms within and outside the state.\n“With a mission to provide a highly skilled workforce in Edo State, EdoJobs has also birthed other initiatives."
  },
  {
    "headline": "Obaseki recommits to free, credible LG polls, harps on responsibility, accountability in politics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has pledged to work with the electoral body and all other relevant stakeholders to ensure that the forthcoming local government election in the state is free, fair and credible.\nObaseki gave the assurance when he received the executive members of the Edo State chapter of the Inter-Party Advisory Council of Nigeria (IPAC) who were on a courtesy visit at the Government House, Benin City.\nOsaigbovo Iyoha said the country is in tough and perilous times, charging government officials on the need to be responsible and accountable to the people.\nHe noted, “With the local government elections soon approaching, we need to sit and brainstorm on how to ensure that the election is free, fair and credible.\nWe thank you for your courage as we assure you of this administration’s open-door policy.”Earlier, the Chairman of Edo IPAC, Hon."
  },
  {
    "headline": "Lai Mohammed’s loyalists quit APC in Kwara, as minister’s rift with Gov AbdulRazaq worsens",
    "summarized_story": "Loyalists of Alhaji Lai Mohammed, the minister of information and culture, in Kwara state chapter of All Progressives Congress (APC), have defected to the Social Democratic Party (SDP).\nThe faction, which styled itself as ‘APC Loyal’, announced its defection at a news conference in Ilorin on Saturday.\nA rift between Muhammed and AbdulRahman AbdulRazaq, Kwara governor, had torn the state’s chapter of APC into two factions.\nHe then accused the governor of trampling “on democratic principles which the party represents”.\n“Consequent upon the wishes of our numerous supporters and the majority of Kwarans, we announce to you today the official defection and mass movement of supporters and party members from the APC to the Social Democratic Party (SDP),” he said."
  },
  {
    "headline": "Kafayat Oyetola @62: Finance Comm. Oyebamiji, Obokun East LCDA chair, Bamidele, hail Osun 1st lady",
    "summarized_story": "By Sunday Oguntuyi, OsogboMr Bola Oyebamiji, Osun State Commissioner for Finance, and Hon.\nBello Saliu Bamidele, caretaker chairman for Obokun East Local Council Development Area, Ilare Ijesha, have congratulated the First Lady of the State, Mrs Kafayat Oyetola on the occasion of her 62nd birthday celebration, describing her as a virtous woman who has positively impacted lives.\nWhile praying for many more years of celebration for Mrs Oyetola who he said has impacted his life personally, Oyebamiji stated that the firstlady has been very supportive to him and has hugely helped in cementing the bond that exist between him and Governor Oyetola.\nShe has continued to be supportive to me in all things and I am eternally grateful,” he said.\nHe therefore, on behalf of the entire people of Obokun East LCDA, wishes “the most lovely First Lady” happy birthday with blessings and prays she witness many more in good health and wealth."
  },
  {
    "headline": "FY2021: AFC grows profit 26.6%, assets 16.3%",
    "summarized_story": "BY EMEKA EJEREAfrica Finance Corporation (AFC), has defied harsh operating environment occasioned by Covid and commodity-driven headwinds to deliver record performance in its latest full-year earnings.\nTotal assets rose by 16.3% to a record US$8.56 billion.\nThe Corporation continued to diversify funding, with a 21.5% boost to borrowing year-on-year at US$6.19 billion (2020: US$5.09 billion).\nAFC successfully accessed the global debt markets by issuing US$1.8 billion in new loans and bonds during the year.\nThis included:Established in 2007 to catalyse private sector-led infrastructure investment across Africa, AFC is the second highest investment grade rated multilateral financial institution in Africa."
  },
  {
    "headline": "MTN Nigeria paid N757bn as tax in 2021",
    "summarized_story": "Telecom giant, MTN Nigeria Communications, paid a total of N757bn direct and indirect tax to government agencies in 2021.\nThis was disclosed during the National Tax Dialogue Event organised by the Federal Inland Revenue Service.\nA statement titled, ‘MTN Named Best Tax Compliant Organisation in Nigeria: … recognised as one of the top 20 taxpayers by FIRS,’ signed by the company’s secretary, Uto Ukpanah, revealed that the company’s total tax contribution to all government agencies reached N757.6bn in 2021.\n“In 2021, MTN Nigeria’s total tax contribution to all government agencies including the FIRS amounted to N757.6bn while FIRS collected a total of N6.4trn tax revenue in the year,” the statement said.\nThe Chief Financial Officer, MTN, Modupe Kadri, who received the awards on behalf of the company, said, “I am delighted at our performance and recognition at this year’s National Tax Dialogue event."
  },
  {
    "headline": "Again, IED Kills 3 Soldiers In Kaduna",
    "summarized_story": "Atleast three soldiers have been killed when terrorists suspected to be bandits planted an Improvised Explossive Device (IED) off the Abuja-Kaduna Expressway on Saturday.\nThe troops deployed at Gwagwa village were going for an operation when their vehicle stepped on IED planted by the terrorists.\nThis comes barely a week after terrorists ambushed troops along Abuja-Kaduna Expressway and killed seven soldiers.\nAs at press time, the Director, Defence Information, Major General Jimmy Akpor, did not respond to enquiries by our correspondent.\nADVERTISEMENTAlso, the Director, Defence Media Operations, Major General Benard Onyeuko, did not respond to messages to confirm or refute the story."
  },
  {
    "headline": "Insecurity: IGP Leads Patrol On Abuja-Kaduna Expressway",
    "summarized_story": "The inspector-general of Police, IGP Usman Baba, on Saturday, led policemen on patrol on the entire 163km-stretch of the Abuja-Kaduna expressway for hands-on assessment of the security challenges and to personally supervise the operational deployment of officers drawn from the Police tactical squads to ensure the safety of travellers along the route.\nForce PRO, CSP Olumuyiwa Adejobi, said in the course of the patrol, the IGP mapped out some salient and strategic points along the expressway, which were immediately fortified with the deployment of operatives drawn from the Police Mobile Force (PMF), Counter Terrorism Unit (CTU), Special Forces (SF), Intelligence Response Team (IRT), the Special Tactical Squad (STS), as well as airwing operatives in charge of unmanned aerial vehicles of the Nigeria Police Force.\nThe IGP, during the patrol, equally visited personnel of the Armed Forces and Police deployed at Rijana to secure technical crew of the Nigeria Railway Corporation (NRC) undertaking repair works at the damaged train coaches and rail line in the axis, to boost their morale and assess the state of their post.\nADVERTISEMENTThe Police spokesperson also said the inspector-general of Police assured that with the strategic and operational deployment of officers along the route, normalcy would once again be restored while he tasked members of the public on active intelligence sharing with law enforcement agencies for effective policing of all spaces.\nADVERTISEMENT"
  },
  {
    "headline": "Insecurity: IGP Leads Patrol On Abuja-Kaduna Expressway",
    "summarized_story": "The inspector-general of Police, IGP Usman Baba, on Saturday, led policemen on patrol on the entire 163km-stretch of the Abuja-Kaduna expressway for hands-on assessment of the security challenges and to personally supervise the operational deployment of officers drawn from the Police tactical squads to ensure the safety of travellers along the route.\nForce PRO, CSP Olumuyiwa Adejobi, said in the course of the patrol, the IGP mapped out some salient and strategic points along the expressway, which were immediately fortified with the deployment of operatives drawn from the Police Mobile Force (PMF), Counter Terrorism Unit (CTU), Special Forces (SF), Intelligence Response Team (IRT), the Special Tactical Squad (STS), as well as airwing operatives in charge of unmanned aerial vehicles of the Nigeria Police Force.\nThe IGP, during the patrol, equally visited personnel of the Armed Forces and Police deployed at Rijana to secure technical crew of the Nigeria Railway Corporation (NRC) undertaking repair works at the damaged train coaches and rail line in the axis, to boost their morale and assess the state of their post.\nADVERTISEMENTThe Police spokesperson also said the inspector-general of Police assured that with the strategic and operational deployment of officers along the route, normalcy would once again be restored while he tasked members of the public on active intelligence sharing with law enforcement agencies for effective policing of all spaces.\nADVERTISEMENT"
  },
  {
    "headline": "Dankwambo Returns To Gombe 3 Years After",
    "summarized_story": "The immediate-past governor of Gombe State, Ibrahim Hassan Dankwambo, on Saturday, returned to the state after three years he had stayed away.\nDankwambo, who arrived at Gombe, the state capital around 2pm, was received by his teeming supporters, chieftains and members of the Peoples Democratic Party (PDP) in the state, who accompanied him from airport to the party’s state secretariat.\nThe former governor while appreciating the party faithful, who trooped out to receive him, donated a cash sum of N6million to party officials in the 11 local government areas of the state.\nLater in an interview with journalists, Dankwambo said he would spend some days in the state to interact with his people, assess the performance of the state government in the areas of security, projects and human development and thereafter express his views.\nADVERTISEMENTOur correspondent reports that there were speculations across the state that the former governor is going to vie for the Senatorial seat of Gombe North in 2023, the position he contested and lost to the incumbent Senator Sa’idu Alkali in the last 2019 polls."
  },
  {
    "headline": "Dankwambo Returns To Gombe 3 Years After",
    "summarized_story": "The immediate-past governor of Gombe State, Ibrahim Hassan Dankwambo, on Saturday, returned to the state after three years he had stayed away.\nDankwambo, who arrived at Gombe, the state capital around 2pm, was received by his teeming supporters, chieftains and members of the Peoples Democratic Party (PDP) in the state, who accompanied him from airport to the party’s state secretariat.\nThe former governor while appreciating the party faithful, who trooped out to receive him, donated a cash sum of N6million to party officials in the 11 local government areas of the state.\nLater in an interview with journalists, Dankwambo said he would spend some days in the state to interact with his people, assess the performance of the state government in the areas of security, projects and human development and thereafter express his views.\nADVERTISEMENTOur correspondent reports that there were speculations across the state that the former governor is going to vie for the Senatorial seat of Gombe North in 2023, the position he contested and lost to the incumbent Senator Sa’idu Alkali in the last 2019 polls."
  },
  {
    "headline": "EFCC arrests Cubana Chief Priest",
    "summarized_story": "Nigerian club owner, Pascal Okechukwu aka Cubana Chief Priest, has been arrested by the EFCC on charges of money laundering and tax fraud.\nNews of his arrest, credited to Peoples Gazette, spread after he didn’t respond to celebratory messages on his social media accounts.\nChief Priest is known to throw flamboyant parties every April 2nd to celebrate his birthday.\nHis arrest comes weeks after he urged the anti-graft agency to free his former boss, Obinna Iyiegbu aka Obi Cubana.\nAccording to reports, Cubana Chief Priest was arrested on Thursday at Murtala Muhammad International Airport, Lagos."
  },
  {
    "headline": "Journalist Maksim Levin killed in Ukraine",
    "summarized_story": "Maksim Levin, a photographer and videographer who was working for a Ukrainian news website and was a long-time contributor to Reuters, was killed while covering Russia’s invasion of Ukraine.\nLevin, born in 1981, was a documentary film maker who had contributed to Reuters’ coverage of the country since 2013.\nThe prosecutor general’s office in Ukraine said Levin was “killed by servicemen of the Russian Armed Forces with two shots from small arms”.\nJohn Pullman, Reuters’ global managing editor for visuals, said: “We are deeply saddened to hear of the death of Maksim Levin, a long-time contributor to Reuters, in Ukraine.”“Maks has provided compelling photos and video from Ukraine to Reuters since 2013.\nSix have been Russian, four Ukrainian, one Italian, one American, and one Irish."
  },
  {
    "headline": "BREAKING: IPOB cancels ‘sit at home’ in Southeast",
    "summarized_story": "Indigenous Peoples of Biafra (IPOB) has abrogated its sit-at-home directive in southeast Nigeria, saying the development is to embrace peace negotiations organised by the Anambra government.\nNAN reports that the decision was disclosed by the Chairman, Anambra Traditional Rulers Council, Igwe Nnaemeka Achebe, during a one-day peacebuilding and security meeting held in Awka on Saturday.\nHe said that the state government has set April 4 for prayers aimed at seeking God’s face to restore lasting peace in Anambra and South East as a whole.\n“Igboland has lost so much in the economic and social development of the zone and we are tired of the situation and want peace,” the traditional ruler said.\nThe speakers include Mr Uche Okafor, Anambra Speaker, who assured that the legislators would partner with the state government to enthrone lasting peace and economic development of the state and the zone."
  },
  {
    "headline": "BREAKING: 2023: Yahaya Bello Officially Declares To Run For President",
    "summarized_story": "Governor Yahaya Bello of Kogi State has officially joined the 2023 Presidential race.\nBello officially declared his decision to run for the Presidency on Saturday in Abuja.\nHis declaration lays to rest speculations surrounding him running for the Presidency in 2023.\nSpeaking, Zwingina described the Presidential aspirant as a detribalized Nigerian, who governs Kogi with appointees from other states.\nStressing that Nigeria needs Bello as a President, Zwingina noted that the “governor uprooted insecurity from Kogi, the state would have been a breeding ground for kidnapping and banditry, but for his leadership skills.”"
  },
  {
    "headline": "BREAKING: 2023: Yahaya Bello Officially Declares To Run For President",
    "summarized_story": "Governor Yahaya Bello of Kogi State has declared his candidacy for President in 2023.\nOn Saturday in Abuja, Bello formally announced his intention to run for President.\nHis announcement puts an end to rumors about him running for President in 2023.\nZwingina branded the Presidential candidate as a detribalized Nigerian who leads Kogi with appointees from other states, according to him.\nZwingina emphasized the importance of Bello as President, noting that the “governor removed instability from Kogi, the state would have been a breeding ground for kidnapping and banditry if it hadn’t been for his leadership qualities.”"
  },
  {
    "headline": "Ilesa COE Upgrade: PDP Has Lost Touch With Reality – Oyetola’s Spokesman",
    "summarized_story": "Spokesman to Governor Adegboyega Oyetola of Osun, Ismail Omipidan, has said the PDP has lost touch with reality, forgetting that the Governor has, in the last three years, always thought through his administration’s programmes and policies.\nHe was reacting to the claim by a faction of the Peoples Democratic Party, PDP, in Osun, that the Ilesa College of Education upgrade to a full-fledged University by the State Government was a deceit.\n“It is unfortunate that the PDP has decided to play politics with important issues.\n“Governor Oyetola has in the last three years plus fulfilled every promise he made.\nIjesa people know Oyetola; they know he is a man of impeccable character, whose word you can always take to the bank and you will return smiling,” Omipidan added."
  },
  {
    "headline": "Wizkid, Burna Boy, others top stars on parade as Grammy awards takes centre stage",
    "summarized_story": "Top Nigerian artists Femi Kuti, Wizkid and Burna Boy will be up for big thing when the world’s biggest music awards hold on Sunday.\nThe venue is the MGM Grand Arena in Las VegasFemi Kuti and Wizkid were nominated in the Best Global Music Performance and Best Global Music Album categories.\nFemi Kuti’s Pà Pá Pà was nominated in the Best Global Music Performance category while Wizkid Featuring Tems Essence was nominated in the same category.\nWizkid’s Made in Lagos was nominated in the Best Global Music Album category and Femi Kuti and Made Kuti’s Legacy +made the same category.\nGrammy winner, Burna Boy has been nominated for his part in Angélique Kidjo’s song Do Yourself"
  },
  {
    "headline": "[Breaking] Premier League: Benched by Eguavoen, Iheanacho scores as Leicester City cage Manchester United, Red Devils’ top 4 hope dims",
    "summarized_story": "Manchester United’s hopes of making next year’s Champions League were dented in a draw with Leicester.\nKelechi Iheanacho’s opener for Leicester ignited a slow game with Fred immediately equalising.\nJames Maddison appeared to have restored Leicester’s lead at Old Trafford but his strike was ruled out by the video assistant referee.\nWithout Cristiano Ronaldo, United barely threatened and the result leaves them three points off the top four.\nArsenal, in fourth, have two games in hand on United."
  },
  {
    "headline": "How I escaped Abuja-Kaduna train attack by whiskers, Obi of Onitsha opens up",
    "summarized_story": "One of the most prominent traditional rulers in Nigeria, Obi of Onitsha, Igwe Nnaemeka Alfred Achebe, has revealed how a last minute telephone call prompted him to escape attack by terrorists on Abuja-Kaduna train.\nThe attack left about eight passengers dead, scores of others wounded, 21 confirmed missing and 171 others “unaccounted for,” according to the figures confirmed by the Nigerian Railway Corporation (NRC) on Saturday.\nHe said at the meeting under the umbrella of Ahamefuna Socio-cultural organisation held in Enugu, the South East capital: “I was among the passengers meant to be on the train last Monday because I had a meeting I was supposed to be attending.\nThe gathering of the Igbo stakeholders and leaders of thought called on politicians from the area to stand firm in demanding right to the presidency, and particularly impress it on their political parties to zone tickets for the office to the region.\nThe event,had in attendance, top Igbo personalities, including, renowned businessman, Emmanuel Iwuanyanwu, former National Chairman of the Peoples Democratic Party (PDP) and former Governor of Enugu State, Okwesilieze Nwodo, and former Governor of Imo State, Achike Udenwa, alongside former ministers, senators, clerics, traditional rulers, women leaders and youth leaders."
  },
  {
    "headline": "You Owe Your Country A Duty To Register And Vote, Pastor Adeboye Tells RCCG Members",
    "summarized_story": "General Overseer of the Redeemed Christian Church of God, Pastor Enoch Adebayo, has urged Nigerians to register and vote in the forthcoming 2023 elections.\nThe 80-years-old said this while addressing his congregation on Sunday during the thanksgiving service.\n“As a Nigerian, you have a duty to register, to vote and make sure your vote will count.\nYou have a duty to belong to any party of your choice; you can’t refuse to vote and then complain about the government,” he said.\nMore to follow…"
  },
  {
    "headline": "FG’s Revised Covid Travel Protocol To Take Effect From Monday",
    "summarized_story": "The Federal Government’s revised COVID-19 travel protocol for travellers arriving in Nigeria is scheduled to take effect from Monday.\nThe new protocol stipulates that in-bound passengers to Nigeria who are fully vaccinated against COVID-19 are no longer required to carry out COVID-19 PCR test before boarding Nigeria-bound flights.\nAlso, fully vaccinated passengers arriving Nigeria will not be required to carry out Post-arrival PCR test or a Rapid Antigen Test upon arriving Nigeria.\nREAD ALSO: Ghana Ends Mandatory Face Mask-Wearing, Reopens Borders After Two Years“Children below the age of 18 years will be accorded the same privileges as persons who are fully vaccinated,” the new protocol document said.\nMeanwhile, all-inbound passengers, regardless of vaccination status, are expected to register via the online Nigeria International Travel Portal (NITP– https://nitp.ncdc.gov.ng)."
  },
  {
    "headline": "At Least 13 Killed In Fresh Bandit Attack On Zamfara Villages",
    "summarized_story": "At least 13 persons have been killed by armed bandits in attacks on different communities in Anka Local Government Area of Zamfara State.\nThe affected communities are Kadaddaba, Rafin Gero, and Babban Baye, all in Anka Local Government Area of Zamfara State.\nREAD ALSO: One Killed, Six Injured, Many Abducted As Terrorists Attack Katsina MarketAn indigene of Anka community, Yusuf Anka, told Channels Television that no less than fifteen persons were killed in three villages of Anka Local Government.\nOne of the villages is less than five kilometres away from Anka Local Government Headquarters,” he said.\nShehu said, “there was no any incident in Daki Takwas, the village is under Gummi Local Government and there was no attack in the village.”"
  },
  {
    "headline": "Yahaya Bello Declares For 2023 Presidency, Promises To Make 20m Nigerians Millionaires By 2030",
    "summarized_story": "﻿Kogi State Governor Yahaya Bello on Saturday formally declared to run for President in 2023.\nIn his speech, Governor Bello said he will build on the legacy of President Muhammadu Buhari by creating 20 million naira millionaires in the country by 2030.\n“It is therefore clear that our path to national prosperity lies in pulling millions of Nigeria out of poverty.\n“The Buhari administration has a target of lifting 100 million Nigerians out of poverty by the year 2030.\nDaughter of the presumed winner of the June 1993 presidential election, late Moshood Abiola, Hafsat Abiola-Costello, was named the Director-General of the Yahaya Bello presidential campaign."
  },
  {
    "headline": "Nearly 4.2 Million Ukrainian Refugees Flee War",
    "summarized_story": "Nearly 4.2 million Ukrainians have fled their country since Russia’s invasion began on February 24, with almost 40,000 pouring into neighbouring countries in the past 24 hours, UN numbers show.\nThe UN’s International Organization for Migration (IOM) said that in addition to Ukrainian refugees, nearly 205,500 non-Ukrainians living, studying or working in the country have also left.\nNearly 6.48 million people were meanwhile estimated to be internally displaced within Ukraine as of mid-March, according IOM.\nThe UN children’s agency UNICEF said in late March that more than half of the country’s estimated 7.5 million children had been displaced — 2.5 million internally and two million abroad.\nHere is a breakdown of how many Ukrainian refugees have fled to neighbouring countries, according to UNHCR:– Poland –Nearly six out of 10 Ukrainian refugees — 2,429,265 so far — have crossed into Poland, according to the UN tally."
  },
  {
    "headline": "APC Leadership has not been fair to Zamfara",
    "summarized_story": "Senator Kabiru Marafa says the All Progressives Congress has not been fair and just to the people of Zamfara StateHe says he and other party chieftains in the state are among the founding fathers of the APC but the party under the Mai Mala Buni led administration was not fair to them.\nSenator Kabiru Marafa stated this while speaking to Newsmen in Gusau, the Zamfara State CapitalThe former two term red Chamber lawmaker adds that he and former Abdul’azeez Yari remain in the APC to prove that they are card carrying and duly registered members of the party as against the stories making the round that they are notSenator Marafa further says if the people of Zamfara State decided not to continue to support the ruling APC is vase in the fact that they were not treated fairlyOver Seven hundred and fifty thousand APC Members according to him were registered before the registration was cancelled"
  },
  {
    "headline": "Gunmen attack Ondo lawmaker, Olugbenga Omole",
    "summarized_story": "Unknown gunmen have attacked the chairman, Ondo State House of assembly Committee on Information, Olugbenga Omole on Thursday.\nOmole who is representing Akoko Southwest Constituency 1, narrowly escaped assassination attempt on his life .\nHe escaped multiple gunshots were fired at his car by unknown gunmen in the heart of Akure, the state capital.\nThe lawmaker confirmed the incident to journalists."
  },
  {
    "headline": "Babangida pledges support for PDP consensus arrangement",
    "summarized_story": "Former Military President, Ibrahim Badamasi Babangida has met with some aspirants contesting for the office of the president on the platform of the Peoples’ Democratic Party (PDP) for the forthcoming general.\nWhile briefing Journalists on Thursday after a closed door meeting with the three PDP Presidential aspirants for 2023 elections, former Senate President, Dr. Abubakar Bukola Saraki, Governor Aminu Waziri Tambuwal of Sokoto State and Bauchi State Governor, Senator Bala Mohammed.\nSpeaking on behalf of other Aspirants, Senator Abubakar Bukola Saraki said the visit to the former General Babangida was to seek his advice and guidance on the way to go and to achieve the planned consensus in the PDP."
  },
  {
    "headline": "Why Kwara House declared lawmaker’s seat vacant",
    "summarized_story": "Kwara State House of Assembly has declared the seat of Hon.\nSaheed Popoola vacant after he officially announced his defection from the All Progressive Congress (APC).\nIn a letter addressed to the INEC and dated March 28, 2022, Speaker of the Kwara State House of Assembly Rt.\nYakubu Danladi Salihu said the decision to declare the seat vacant is in line with the provisions of Section 109 (1) (g) of the Constitution.\nThe declaration of the seat as vacant joins several of such developments across the country, including recent court judgments on the issue."
  },
  {
    "headline": "Shanghai Orders Covid Tests for All 26 Million Residents",
    "summarized_story": "Shanghai on Sunday ordered its 26 million residents to undergo two more rounds of tests for COVID-19 as public anger grows over how authorities in China’s most populous city are tackling a record coronavirus surge.\nResidents should self-test on Sunday using antigen kits and report any positive results, Shanghai government officials told a news conference, while a nucleic acid test would be conducted citywide on Monday.\nShanghai on Sunday reported 7,788 daily locally transmitted asymptomatic cases, up from 6,501 the day before, while symptomatic cases rose to 438 from 260.\nThe city accounted for the bulk of mainland China’s 11,781 daily locally transmitted asymptomatic cases and nearly one-third of its 1,506 symptomatic cases.\nread moreSome have also demanded clarity over the testing regime, after a recorded phone call, reportedly between a Shanghai health official and a resident, was widely shared on Chinese social media."
  },
  {
    "headline": "Russian Missiles Hit Ukraine’s Strategic Port Odessa",
    "summarized_story": "Air strikes rocked Ukraine’s strategic Black Sea – Air strikes rocked Ukraine’s strategic Black Sea port of Odessa early Sunday, AFP reporters said, but there were no casualties, according to the army.\nAt least three huge columns of black smoke and flames rose into the sky over an industrial zone.\nThe rocket attacks came as Russian forces and appeared to be withdrawing from the country’s north after Kyiv warned that Moscow was trying to consolidate troops in the south.\nOn Friday, Ukraine’s President Volodymyr Zelensky warned Russia was consolidating and preparing “powerful strikes” in the south, joining a chorus of Western assessments that Moscow’s troops were regrouping.\nOdessa, a historic city of around one million people, is Ukraine’s largest Black Sea port and has escaped the worst of the fighting."
  },
  {
    "headline": "Nigeria will Continue to Explore Fossil Fuels, Deputy Oli Minister Sylva Says",
    "summarized_story": "Nigeria’s Minister of State, Petroleum Resources, Mr Timipre Sylva, has said that despite the global opposition to the exploitation of hydrocarbons, the country will not jettison her God-given resources.\nThe minister warned that the risk of limited international financing could even jeopardise Nigeria’s energy transition and roadmap to attaining net-zero as government and corporate bodies continue to discourage investment in fossil fuels.\nRelatedStories No Content AvailableThe minister stated that adequate financial resources and effective policies designed to encourage investments in the oil and gas industry in Nigeria were required to enable the country to meet the increasing energy demand.\n“Oil will also continue to be much needed, especially for the development of our lagging petrochemical industry.\n“That notwithstanding, Nigeria still aims at reducing greenhouse gas emissions by 20 per cent by 2030 through anti-gas flaring regulations and working closely with oil and gas companies,” the minister said."
  },
  {
    "headline": "Nigeria Scraps Post-Arrival PCR Covid Test for Fully Vaccinated Travellers",
    "summarized_story": "Nigeria’s federal government has scrapped post-arrival PCR COVID tests for fully vaccinated travellers entering Nigeria.\nIn-bound passengers to Nigeria who are fully vaccinated against COVID-19 are no longer required to carry out COVID-19 PCR test before boarding Nigeria-bound flights.”“Fully vaccinated passengers arriving Nigeria will not also be required to carry out post-arrival PCR test or a rapid antigen test upon arriving Nigeria.\n“Travellers must bring along an electronic or hard copy of their negative COVID-19 PCR test for presentation at the departure airport and upon arrival in Nigeria.\n“On arrival in Nigeria, unvaccinated or partially vaccinated travellers are to show up at the laboratory/sample collection centres chosen by them while filling the NITP on the 2nd and 7th day of arrival.\n“Samples will be taken, and a COVID-19 PCR test done."
  },
  {
    "headline": "Soyinka: Omisore’s Election as APC National Secretary Has Crippled Probe of Bola Ige’s Murder",
    "summarized_story": "After his impeachment, Omisore was arrested and detained over Ige’s murder but he repeatedly denied any involvement.\nOmisore, a former senator, was adopted as the APC National Secretary at the party’s last national convention in Abuja.\n“That the prime suspect was privileged in some improper ways went beyond mere allegation.\nHe lamented that barely three months had passed since the 20th anniversary of Ige’s murder – an occasion, which according to him, was used to remind the president of a subsisting election pledge.\nEventually,” Soyinka said in his statement doubting the president’s pledge to resolve Ige’s murder."
  }
]