[
  {
    "headline": "Igangan killings: Don’t attack Northerners, CNG warns Gani Adams",
    "summarized_story": "Pan-Arewa Socio-cultural organization under the aegis of Coalition of Northern Groups on Tuesday has cautioned the Aare Onakakanfo of Yorubaland, Otunba Gani Adams, against the killing of Northerners in the South-WestThe organization said the warning became necessary following the comments credited to Adams that the killing of residents of Igangan town, Ibarapa in Oke-Ogun Area of Oyo State was a declaration of war on the South West by the North.\nThe CNG issued the warning in a statement by its Spokesperson, Abdul-Azeez Suleiman.\nHe said, “Any attack against Northerners in any part of the South for the only reason that they are Northerners living as minorities in other communities would not be acceptable.”Suleiman said the CNG found it ridiculous that Gani Adams who holds a high position in Yoruba land “would still be unable to overcome his former militant tendencies and conform to the rules of decency required by his title.”“We find it outrageous for Adams to so readily attribute the attacks to the North whereas the actual attackers have not yet been officially identified.\n“For Adams to just jump to such a conclusion that the attacks were carried out by the North and even call it a declaration of war speaks volumes of the mindset of the typical Southerner against the entire Northern region”, the CNG stated.\nSuleiman described as contradictory that Adams who was quick to beat drums of war against the North was the same leader of the Oodua Peoples Congress that allegedly cheered recent attacks and killings of non-Yoruba residents of the same Igangan by Yoruba gangs under Sunday Ighoho which, the CNG claimed, was downplayed by the southern media."
  },
  {
    "headline": "VIDEO: Nigerians react to FG's Twitter ban",
    "summarized_story": "The federal government on Friday suspended the operations of social networking service, Twitter, in Nigeria.\nThis has generated a lot of reactions from Nigerians.\nWatch how some Nigerians react to the ban."
  },
  {
    "headline": "Reps probe legality of FG’s Twitter ban, summon Lai Mohammed",
    "summarized_story": "The House of Representatives has said it will, within 10 days, investigate the factors responsible for the Federal Government’s decision to ban Twitter in Nigeria and the laws upon which the action was based.\nGbajabiamila also noted that the lawmakers had been inundated with protests and demands for intervention by the parliament.\nThe Speaker, however, noted that the House also needs to hear from the government, especially the Minister of Information and Culture, Lai Mohammed, who issued the directive suspending the social media app in the country.\nGbajabiamila, therefore, mandated the relevant committees of the House to invite Mohammed to explain the decision by the government and the reasons and bases for it.\nThe committees, which he ordered to start work immediately, are to report back within 10 days."
  },
  {
    "headline": "Eucharia Anunobi: For Gospel & Screen",
    "summarized_story": "Eucharia Anunobi is a veteran Nollywood actress who came into limelight after featuring in multiple, award-winning movie, Glamour Girls 2 (1996).\nIn this interview, Dr. Eucharia Anunobi, Filmmaker, actress and Minister of God, takes us through her world, touching on challenging moments as a Minister of God.\nSo, while others may be worldly in whatever they are doing, as Ministers of the gospel, let’s distinguish ourselves and be different.\nWhat have been some of your challenging moments as a Minister of God, actress and filmmaker?\nI want to say to the glory of God, I’m bringing a change in the narrative."
  },
  {
    "headline": "Eucharia Anunobi: For Gospel & Screen",
    "summarized_story": "Eucharia Anunobi is a veteran Nollywood actress who came into limelight after featuring in multiple, award-winning movie, Glamour Girls 2 (1996).\nIn this interview, Dr. Eucharia Anunobi, Filmmaker, actress and Minister of God, takes us through her world, touching on challenging moments as a Minister of God.\nSo, while others may be worldly in whatever they are doing, as Ministers of the gospel, let’s distinguish ourselves and be different.\nWhat have been some of your challenging moments as a Minister of God, actress and filmmaker?\nI want to say to the glory of God, I’m bringing a change in the narrative."
  },
  {
    "headline": "REPLACE, ROLAC deliberate on accessing justice for women, PWDs",
    "summarized_story": "They also noted that in the case of arrest, detention and trial, these vulnerable groups suffer human rights infringement.\nThe meeting focused on the importance of the Police Duty Solicitor Scheme (PDSS) and how to ensure the scheme become effective and implemented across the country to ensure access to justice for women and people with disability.\nAdding that there is need to change the narrative on how the police treat women and PWDs arrested.\n“Police duty is to cooperate and ensure the scheme works.\nIn broadening the discourse, participants were divided into groups to formulate a communique on guidelines for the police on women, PWDs in detention as well as legal service providers."
  },
  {
    "headline": "REPLACE, ROLAC deliberate on accessing justice for women, PWDs",
    "summarized_story": "They also noted that in the case of arrest, detention and trial, these vulnerable groups suffer human rights infringement.\nThe meeting focused on the importance of the Police Duty Solicitor Scheme (PDSS) and how to ensure the scheme become effective and implemented across the country to ensure access to justice for women and people with disability.\nAdding that there is need to change the narrative on how the police treat women and PWDs arrested.\n“Police duty is to cooperate and ensure the scheme works.\nIn broadening the discourse, participants were divided into groups to formulate a communique on guidelines for the police on women, PWDs in detention as well as legal service providers."
  },
  {
    "headline": "TEACH THAT CHILD WAYS TO PREVENT SEXUAL ABUSE",
    "summarized_story": "No one particular race, culture, religion or socio-economic group is spared when it has to do with child sexual abuse.\nTalk about body parts early, name body parts as it’s never too soon to talk about them while they are still very young.\nLet them know that some body parts are private – Tell him/her that their private parts are called private because they are not for everyone to see.\nTeach your child body boundaries – That under no circumstance should any one touch their private parts, and also no one should ask them to touch somebody else’s private parts.\nThis second part is very important because sexual abuse often begins with the molester asking the child to touch them or someone else."
  },
  {
    "headline": "NIS begins acceptance of new passport applications",
    "summarized_story": "The Oyo State Command of the Nigeria Immigration Service (NIS) says it has started accepting applications for new passports in the state.\nMohammed said the command has started receiving new applications, in line with a directive by the NIS’ Comptroller-General, Muhammad Babandede.\nNigeria Immigration postpones application for new passports again“The agency had suspended new applications for passports to clear the backlog of passport applications that were received.\nNew applications started at 12 midnight on Tuesday,” she said.\nRecall that the NIS had suspended fresh passport applications to clear a backlog of applications received before May 17."
  },
  {
    "headline": "Buhari presides over emergency national security meeting",
    "summarized_story": "President Muhammadu Buhari is currently presiding over an emergency National Security Council meeting at the State House in Abuja.\nThe President is presiding over the meeting holding at the First Lady’s Conference Room and is expected to review the current security situation in the country.\nThose in attendance include; Vice President, Prof. Yemi Osinbajo, the Secretary to the Government of the Federation, Boss Mustapha; Chief of Staff to the President, Professor Ibrahim Gambari; Ministers of Defence, Major-General Bashir Magashi (rtd); Foreign Affairs, Geoffery Onyema and the National Security Adviser, Major General Babagana Monguno (rtd).\nThe council is expected to also look at the security implication of the Twitter ban in the country.\nDetails later…Buhari presides over meeting of Police Council"
  },
  {
    "headline": "Nnamdi Kanu mocks Nigerians over Buhari, Osinbajo’s refusal to deactivate Twitter accounts",
    "summarized_story": "According to NBC, it will be unpatriotic for any broadcaster in Nigeria to continue to patronise the suspended Twitter.\nThe Buhari administration had recently suspended the social media platform indefinitely in the country after the President’s tweet was deleted.\n“Are you sure it’s the same God that created other races that made we black Africans, especially Nigerians?\n“How can NBC direct all stations in Nigeria to deactivate their Twitter profiles, yet @MBuhari, @ProfOsinbajo & @NGRPresident are all active?\nWhat is wrong with our brain?”NBC orders broadcasting stations to stop using Twitter"
  },
  {
    "headline": "I want to sit, talk with Nnamdi Kanu",
    "summarized_story": "The Abia State Governor, Okezie Ikpeazu has declared that he has no grudges against Mazi Nnamdi Kanu, leader of the outlawed Indigenous People of Biafra, IPOB.\nI’m going to speak to Nnamdi on the basis of the fact that I am the governor of Abia State and he is a citizen of Abia State.\nI don’t have anything personal against Nnamdi and I don’t think he has anything personal against me.\nI don’t think we have exhausted the capacity of our intelligence to resolve the matter.\nI sacrificed my parents for Biafra, I will sacrifice everything – Nnamdi Kanu vows"
  },
  {
    "headline": "60th anniversary: OAU has contributed to national, international development – VC, Prof Ogunbodede",
    "summarized_story": "As Obafemi Awolowo University (OAU) Ile-Ife, Osun State, celebrates her 60th anniversary, the institution says it has contributed immensely to quality education, advancement of research and overall national and international development in the nation.\nThe institution also said it will continue to harness and adopt modern technologies in the implementation of its objectives by keeping pace with modern technological development.\nThe Vice-Chancellor of the institution, Prof. Eyitope Ogunbodede, disclosed these on Tuesday during a press conference to celebrate the 60th anniversary of the institution in Ile-Ife.\nNigerians react as OAU student commits suicide“The University has achieved rapid growth and development, particularly in the areas of Academic programmes, Research, Infra-structural Development and human resources development,” he said.\n“The aim is to reduce the economic burden of high tariffs and ensure regular electricity supply to enhance its various academic activities."
  },
  {
    "headline": "Police officer pleads guilty to raping woman",
    "summarized_story": "Agency ReporterA police officer on Tuesday pleaded guilty to kidnapping and raping 33-year-old Sarah Everard.\nEverard, who disappeared while walking home in South London in early March, sparked a nationwide debate about crime against women.\nADVERTISEMENTEverard’s body was found more than a week later in woodland in Kent, some 80 kilometres from where the Londoner was last seen.\nA 48-year-old London police officer pleaded guilty to her kidnap and rape, Britain’s Press Association (PA) reported.\nREAD ALSO: UNILORIN student allegedly raped to deathMembers of Everard’s family were present at the Old Bailey criminal court as the officer admitted his guilt."
  },
  {
    "headline": "Buhari writes Reps, seeks confirmation of Yahaya as COAS",
    "summarized_story": "By Tony Akowe, AbujaPresident Muhammadu Buhari has asked the House of Representatives to confirm the appointment of Major General Farouk Yahaya as the new Chief of Army Staff (COAS).\nThe President also ask the House to pass a law to increase the retirement age of teachers from the present 60 years to 65 years while also increasing the mandatory years of service from 35 to 40 years.\nADVERTISEMENTYahaya was appointed to replace Lt. General Ibrahim Attahiru who died in a plane crash in Kaduna along with ten other officers."
  },
  {
    "headline": "JUST IN: Senate honours T.B. Joshua with a minute silence",
    "summarized_story": "By Sanni Onogu, AbujaThe Senate on Tuesday observed a minute silence in honour of the founder of the Synagogue Church of All Nations (SCOAN), late Pastor Temitope Balogun Joshua.\nBoroffice, while citing order 43 of the Senate Standing Rules, lamented the death of Pastor Joshua.\n“Pastor T.B.\nJoshua was an illustrious son of Ondo State who contributed his quota to the development of the state.\n“He contributed to the advancement of sports, education, health and other social amenities in the state,” Boroffice said."
  },
  {
    "headline": "Reaction as Regina Daniel sprays driver on motion",
    "summarized_story": "By Ekaete BasseySocial media users have reacted grossly to a viral video of actress Regina Daniel spraying her driver money while on motion.\nThe viral video of the young billionaire’s wife recently surfaced on the internet and did not sit well with most social media users.\nIf anything goes wrong poor driver will be blamed.”giddybragado wrote: “You want him to loose concentration?\nMtcheww.”iceydee6 said: “Make money no go let driver lose control o.”mshufoma wrote: “Reckless behaviour….\nNonsense.”igd_carplug stated: “If driver lose focus now , get accident ."
  },
  {
    "headline": "BREAKING: Federal Secretariat, Asaba on fire",
    "summarized_story": "From Paul Osuyi, AsabaA mysterious fire has engulfed the Federal Secretariat complex along Okpanam Road in Asaba, Delta State capital.\nAt the moment, the raging inferno seems to have overwhelmed the fire fighting machinery stationed at the complex.\nEven the state fire service is not up to the task of putting out the fire.\nBut our correspondent learnt that a reinforcement is being mobilised from the fire service at Asaba Airport to help contain the situation.\nThe secretariat complex houses most annex offices of Federal ministries, departments and agencies in the state."
  },
  {
    "headline": "Kalu cautions masterminds of insecurity in South East, warns against repetition of 1967 genocide",
    "summarized_story": "Instead of destructions before coming to the table, is it not wiser to come to table and avoid destruction?\nOn the killing of innocent young people, kalu charged the security agencies to desist from harassment , molestation and killing of innocent young people in the region.\nHe said he is worried that some security agents have been reported to be killing innocent souls .\n“ It is better to thoroughly conduct your investigations and avoid the indiscriminate killings of young innocent Igbo men .\nOur people have raised alarm and we are very worried at the rate of disappearance and deaths of innocent young men ."
  },
  {
    "headline": "Kalu bags award on constituency devt",
    "summarized_story": "From Kenneth Udeh, AbujaIn recognition of his responsive representation and execution of numerous constituency projects as a first time senator, former governor of Abia State and Senate Chief Whip, Dr. Orji Uzor Kalu, has been honoured with the constituency development award at the Senate Press Corps 2021 award ceremony.\nThe media body which comprises the nation’s print and online media houses, presented the award to Dr. Kalu at a ceremony in Abuja which had in attendance the Senate President, Ahmed Lawan, his deputy, Ovie Omo Agege, Ajibola Bashiru, principal officers of the Senate and other members.\nThe Senate Press Corps Chairman, James Itodo, said the body unanimously decided to bestow the award on Kalu in recognition of his commitment and capacity despite being a first time legislator to bring so much transformation to his Abia North constituency.\nItodo said Kalu’s execution of projects in all the local government areas in Abia North -Arochukwu, Bende, Isuikwuato, Ohafia and Umenneochi, are worthy of emulation and deserves commendation.\nOthers who received awards included Lawan, Governors Yahaya Bello (Kogi), Hope Uzodimma (Imo), Douye Diri (Bayelsa) and Ifeanyi Okowa (Delta)."
  },
  {
    "headline": "El-Rufai, Akeredolu, Fayose, Adeboye, Kumuyi, Sani shun Twitter ban",
    "summarized_story": "From Magnus Eze, Enugu and Aidoghie Paulinus, AbujaFour days after the Federal Government slammed indefinite ban on use of Twitter, prominent Nigerians have continued to flout the order.\nExplaining why Deeper Life Church would remain active on Twitter, Kumuyi said his tweets were targetted at over 100 nations where the church has branches.\nHe said the church made use of Twitter to share contents from any of the locations across the five continents.\nIt, however, remains unclear if the order from the office of the AGF would be effected on, Adeboye, El-Rufai, Akeredolu and other “offenders”.\nHe also said the meeting was in their usual friendly way, to discuss and share opinions with respect to the Twitter ban and clarify certain things."
  },
  {
    "headline": "Imo police boss probes killing of German-based businessman",
    "summarized_story": "The CP, in a statement issued by the command’s Spokesperson, Bala Elkana, assured that his office would ensure that justice prevailed.\n“The deceased person is alleged to have been shot by personnel suspected to be staff of 211 Regiment of the Nigerian Air Force, responsible for the security of the International Airport.\nA survivor stated that one of the Air Force operatives shot the car of Oguchi when he failed to stop at the Air Force checkpoint after they had flagged him down.\n“According to the Air Force, being suspicious of the mission of the occupants of the said vehicle at the International Airport, they made an effort to demobilise the vehicle.\nHe was, however, rushed to the hospital by the Air Force team for medical attention, where the doctors on duty made frantic efforts to stabilise him."
  },
  {
    "headline": "Twitter Loses Billions, Nigerians Lose Instant Communication Tools",
    "summarized_story": "For Twitter the saga has cost it billions of cash, while Nigerians, in both private and public sectors have lost their means of instant communication.\nMany Nigerians, have, however, circumvented the federal government’s blockage of the micro-blogging facility, resorting to the virtual private network (VPN) to connect Twitter.\nHowever, the federal government’s directive suspending Twitter’s operations in Nigeria was silent on whether or not Nigerians should deactivate their accounts.\nChecks by THISDAY yesterday showed that Twitter accounts belonging to government Ministries, Departments and Agencies (MDAs) are also being retained.\nNBC Orders Broadcast Stations to Suspend Twitter PatronageThe National Broadcasting Commission (NBC) has ordered all broadcast stations to suspend the patronage of Twitter with immediate effect."
  },
  {
    "headline": "Uneasy Calm over Buni’s Alleged Plans for APC Chairmanship",
    "summarized_story": "The sources said a self-succession motive by Buni to become the substantive national chairman is currently stalling moves to hold a national convention.\nBut after 12 months in office, no date has been announced for the election of the executive committee members.\nBefore winning the election to become the governor, he was the national secretary of APC when Oshiomhole was the national chairman.\nSome of the APC members who did not want to be quoted said they had concluded plans to seek legal action against any plans by the committee members to self-perpetuate themselves in office.\nHe stated: “The president has not agreed with what the caretaker committee is trying to do as regards another elongation."
  },
  {
    "headline": "Sanwo-Olu Preaches National Unity, Says Nigeria Stronger as One",
    "summarized_story": "By Adedayo AkinwaleLagos State Governor, Mr. Babajide Sanwo-Olu, yesterday rejected the secession agitation by some groups in the South-west and ruled out the break-up of Nigeria.\nSpeaking on ARISE NEWS Channel, the broadcast arm of THISDAY Newspapers, the Lagos State governor said there is strength in number.\nSanwo-Olu said he remained committed to one united and prosperous Nigeria where fairness and equal distribution of resources are the order of the day.\nWe are here, we cannot continue to gloss over it and talk about what we want to break away from.\n“There is strength in number, let us utilise that strength and be able to work for all of us."
  },
  {
    "headline": "Nigeria in Talks with Twitter, Gives Condition to Lift Ban",
    "summarized_story": "By Michael OlugbodeThe Federal Government has said it is in talks with Twitter over the suspension of the micro-blogging site in Nigeria.\nThe Minister of Foreign Affairs, Geoffrey Onyeama disclosed this Monday at press conference after his meeting with representatives of five foreign missions in Nigeria over their comments on the Twitter ban.\nThe Minister however said that Twitter remains suspended and there was still no date for the lifting of the suspension.\nThe Twitter ban was announced by the Information Minister, Lai Mohammed, Friday, two days after Twitter deleted President Muhammadu Buhari’s tweet posted wherein he threatened to deal with secessionists “in the language they understand”.\nNigerian telecoms operators complied with the government directive on the ban Friday but Nigerians are navigating around the ban using VPNThe U.S. and the European Union had on Saturday expressed concern over Nigeria’s decision to ban Twitter."
  },
  {
    "headline": "Adeboye Speaks on Twitter Ban, Says Tweeting is Human Right",
    "summarized_story": "By Onyebuchi EzeigboThe General Overseer of the Redeemed Christian Church of God, Pastor Enoch Adeboye, has said tweeting is in accordance with Article 19 of the United Nations Universal Declaration of Human Rights.\nThe tweets here are in accordance with Article 19 of the United Nations universal declaration of human rights,” Adeboye tweeted on Monday.\nTwitter ban was announced by the Information Minister, Lai Mohammed, two days after Twitter deleted President Muhammadu Buhari’s tweet posted wherein he threatened to deal with secessionists “in the language they understand”.\nNigerian telecoms operators complied with the government directive on the ban Friday but Nigerians are navigating around the ban using VPN.\nThe U.S. and the European Union had on Saturday expressed concern over Nigeria’s decision to ban Twitter."
  },
  {
    "headline": "Buhari’s Social Media Aides, Ahmad, Onochie, Others Risk Sacking After Twitter Ban—Presidency Source",
    "summarized_story": "Some of President Muhammadu Buhari’s social media aides may be sacked as Presidency sources said they are now jobless after last Friday’s ban on social microblogging giant, Twitter, in the country.\nSaharaReporters learnt that some of the top shots in the Presidency, who have an axe to grind with the overzealous social media aides, have been silently pushing for their sacking since Twitter was banned and the aides deemed to be idle.\nSaharaReporters gathered that the aides that may go include Bashir Ahmad, who tweets through @bashirahmaad, and is the Personal Assistant to the President on Digital and New Media, and Lauretta Onochie, Personal Assistant to the President on Social Media.\n“Since last Friday, some of the social media aides have been trying to change their portfolios and add new responsibilities, so that they can remain relevant.\nThe Minister said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria."
  },
  {
    "headline": "Buhari’s Social Media Aides, Ahmad, Onochie, Others Risk Sacking After Twitter Ban—Presidency Source",
    "summarized_story": "Some of President Muhammadu Buhari’s social media aides may be sacked as Presidency sources said they are now jobless after last Friday’s ban on social microblogging giant, Twitter, in the country.\nSaharaReporters learnt that some of the top shots in the Presidency, who have an axe to grind with the overzealous social media aides, have been silently pushing for their sacking since Twitter was banned and the aides deemed to be idle.\nSaharaReporters gathered that the aides that may go include Bashir Ahmad, who tweets through @bashirahmaad, and is the Personal Assistant to the President on Digital and New Media, and Lauretta Onochie, Personal Assistant to the President on Social Media.\n“Since last Friday, some of the social media aides have been trying to change their portfolios and add new responsibilities, so that they can remain relevant.\nThe Minister said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria."
  },
  {
    "headline": "Buhari’s Social Media Aides, Ahmad, Onochie, Others Risk Sacking After Twitter Ban—Presidency Source",
    "summarized_story": "Some of President Muhammadu Buhari’s social media aides may be sacked as Presidency sources said they are now jobless after last Friday’s ban on social microblogging giant, Twitter, in the country.\nSaharaReporters learnt that some of the top shots in the Presidency, who have an axe to grind with the overzealous social media aides, have been silently pushing for their sacking since Twitter was banned and the aides deemed to be idle.\nSaharaReporters gathered that the aides that may go include Bashir Ahmad, who tweets through @bashirahmaad, and is the Personal Assistant to the President on Digital and New Media, and Lauretta Onochie, Personal Assistant to the President on Social Media.\n“Since last Friday, some of the social media aides have been trying to change their portfolios and add new responsibilities, so that they can remain relevant.\nThe Minister said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria."
  },
  {
    "headline": "BREAKING: Pastor Adeboye Defies Twitter Ban, Says Action Covered By UN Charter On Human Rights",
    "summarized_story": "Pastor Enoch Adeboye, General Overseer of the Redeemed Christian Church of God (RCCG), has tweeted despite the ban on microblogging site, Twitter by the Nigerian government.\nAdeboye, who defied the ban on Monday described tweeting as being in accordance with Article 19 of the UN universal declaration of human rights.\nHe tweeted, \"The Redeemed Christian Church of God is domiciled in more than 170 Nations & Territories.\nThe tweets here are in accordance to Article 19 of the UN universal declaration of Human Rights.\"\nThe tweets here are in accordance to Article 19 of the UN universal declaration of Human Rights."
  },
  {
    "headline": "BREAKING: Pastor Adeboye Defies Twitter Ban, Says Action Covered By UN Charter On Human Rights",
    "summarized_story": "Pastor Enoch Adeboye, General Overseer of the Redeemed Christian Church of God (RCCG), has tweeted despite the ban on microblogging site, Twitter by the Nigerian government.\nAdeboye, who defied the ban on Monday described tweeting as being in accordance with Article 19 of the UN universal declaration of human rights.\nHe tweeted, \"The Redeemed Christian Church of God is domiciled in more than 170 Nations & Territories.\nThe tweets here are in accordance to Article 19 of the UN universal declaration of Human Rights.\"\nThe tweets here are in accordance to Article 19 of the UN universal declaration of Human Rights."
  },
  {
    "headline": "Major internet outage hits top websites across the world",
    "summarized_story": "A number of major websites have gone down around the world, including the UK government web pages in what has been described as a global internet outage.\nAdvertisementOn Tuesday, internet users who had earlier logged into the UK government’s website gov.uk, were faced with a message saying “503 Service Unavailable”.\nAccording to reports, the outage was sparked by an issue with a content delivery network (CDN), a system used to host websites and their content on the internet.\nAdvertisementFastly, one of the world’s major CDNs, reported a major outage across its global network, which is believed to have caused the outage.\n— GOV.UK (@GOVUK) June 8, 2021 AdvertisementThe FT is currently being affected by a global internet outage."
  },
  {
    "headline": "Major internet outage hits top websites across the world",
    "summarized_story": "A number of major websites have gone down around the world, including the UK government web pages in what has been described as a global internet outage.\nAdvertisementOn Tuesday, internet users who had earlier logged into the UK government’s website gov.uk, were faced with a message saying “503 Service Unavailable”.\nAccording to reports, the outage was sparked by an issue with a content delivery network (CDN), a system used to host websites and their content on the internet.\nAdvertisementFastly, one of the world’s major CDNs, reported a major outage across its global network, which is believed to have caused the outage.\n— GOV.UK (@GOVUK) June 8, 2021 AdvertisementThe FT is currently being affected by a global internet outage."
  },
  {
    "headline": "Reps summon Lai over Twitter suspension",
    "summarized_story": "The house of representatives has summoned Lai Mohammed, minister of information and culture, over the suspension of Twitter in Nigeria.\nAdvertisementAt its sitting on Tuesday, the house mandated its committees on communication, justice, information and culture, and national security and intelligence to immediately commence an investigation into the suspension of the microblogging site.\nDuring the plenary session, Femi Gbajabiamila, speaker of the house, said the green chamber has been “inundated with comments about the decision, requests for intervention and criticism”.\n“The House of Representatives recognises that Twitter, like other social media networks, is an important tool for communication and commerce in Nigeria, particularly amongst the younger generation who have used these networks for enterprise and innovation with great success,” he said.\nAdvertisement“Therefore, I urge the committees to act with speed and sound judgment to address this issue that has animated our national conversations over the last few days,” he said."
  },
  {
    "headline": "Reps summon Lai over Twitter suspension",
    "summarized_story": "The house of representatives has summoned Lai Mohammed, minister of information and culture, over the suspension of Twitter in Nigeria.\nAdvertisementAt its sitting on Tuesday, the house mandated its committees on communication, justice, information and culture, and national security and intelligence to immediately commence an investigation into the suspension of the microblogging site.\nDuring the plenary session, Femi Gbajabiamila, speaker of the house, said the green chamber has been “inundated with comments about the decision, requests for intervention and criticism”.\n“The House of Representatives recognises that Twitter, like other social media networks, is an important tool for communication and commerce in Nigeria, particularly amongst the younger generation who have used these networks for enterprise and innovation with great success,” he said.\nAdvertisement“Therefore, I urge the committees to act with speed and sound judgment to address this issue that has animated our national conversations over the last few days,” he said."
  },
  {
    "headline": "Barkindo: $1trn oil revenue lost by OPEC members in two years",
    "summarized_story": "The Organisation of the Petroleum Exporting Countries (OPEC) says Nigeria and oil-producing members lost about $1 trillion in revenue within two years.\nBarkindo said the loss was as a result of the plunge in oil prices between 2015 and 2016.\nHe said the fall in oil revenue affected government spendings and investments during the period.\n“No member country of OPEC was insulated from such a contraction in oil revenues during this cycle.\nThis had a severe impact on the resources available to the government to pursue its development programmes.”AdvertisementOn the dip in oil revenue in 2020, Barkindo said the situation was aggravated by the coronavirus pandemic which impacted global oil demand."
  },
  {
    "headline": "The best communications managers are empathetic storytellers.",
    "summarized_story": "Moyosola Kara is the director of marketing and communications at Eze Wholesale – a YC-backed startup on a mission to simplify the wholesale electronics trade market.\nI’m bringing Moyosola to Centre Stage because she’s had an unconventional but rewarding career as a marketing and communications specialist.\nHow are you able to marry your introverted personality with your role as a communications executive?\nI did not study marketing or communications (surprise surprise).\nThen I worked in digital marketing, media, marketing, before finally settling down in a communications role at 54gene."
  },
  {
    "headline": "WhatsApp won’t restrict users who don’t agree to its privacy policy",
    "summarized_story": "WhatsApp recently announced that it will not be limiting access to the features of the app for those who reject the new privacy policy and disagree to let it share its data with Facebook and other third-party companies.\nThe initial deadline for the acceptance of its privacy policies was set to February 8, 2021, but after receiving backlash from its global users and dealing with media scrutiny, Facebook decided to extend the deadline to May 15, 2021.\nUsers will be “able to receive calls and notifications” but they “won’t be able to read or send messages” anymore.\nDuring this period, Whatsapp’s policy related to inactive users will apply.\nWhat’s nextAlthough users will no longer lose access to the app if they don’t agree to the new terms of service agreement, users will still get reminded about the new policy if they haven’t accepted it."
  },
  {
    "headline": "South African mobility startup WhereIsMyTransport raises $14.5million for expansion",
    "summarized_story": "South African Mobility startup WhereIsMyTransport has raised a $14.5 million Series A extension round to continue its expansion across emerging markets.\nFormed in 2016, WhereIsMyTransport is a big data platform that provides sustainable mobility solutions in emerging markets.\nWith this new investment, WhereIsMyTransport plans to continue its expansion across emerging markets, with a launch in Peru planned for later this year.\nMobility in emerging markets via public transportation is often a hassle – it’s inefficient and time-consuming.\nThe successful expansion of WhereIsMyTransport would reduce friction in the movement of people and goods across Africa and other emerging markets."
  },
  {
    "headline": "Viva Technology is back in action!",
    "summarized_story": "Four inspiring days, packed withopportunities for business and with flashes of innovation, to contribute to this long-awaitedmoment of recovery and reconnection.\nInspiring top-level speakersOnce again, major players in technology and business will take the floor this year at VivaTech.\nNew highlights and new initiativesViva Technology has completely redesigned its program in order to respond to the variouschallenges in our societies.\nFinally, the winners of the many other challenges organized by various Viva Technology partnerswill also be announced.\nStarting in 2021, VivaTech will be enriched with a digital platform that will bring together an evenlarger community of innovators."
  },
  {
    "headline": "Club Swan Creates Services To Address Challenges Faced By Nigerian Entrepreneurs",
    "summarized_story": "Abiodun Ajayi – Blockchain and Cryptocurrency StrategistClub Swan, a global lifestyle club designed for cryptocurrency enthusiasts, has launched new services to address challenges faced by Nigerian cryptocurrency entrepreneurs.\nClub Swan provides a reliable bridgeAs mentioned earlier, Club Swan is a global lifestyle concierge membership club designed for cryptocurrency enthusiasts.\nClub Swan created the platform to address the obstacles many legitimate entrepreneurs face when using digital and legacy currencies.\nFor entrepreneurs that travel extensively, Club Swan provides dedicated concierge, travel and lifestyle services for its members.\nTo become a member of Club Swan, go to https://clubswan.com and select the membership tier that suits your needs."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Learn how to sustain your business with technology at SME Clinic 2021",
    "summarized_story": "Are you a small business owner?\nDo you want to learn how to sustain your business with technology?\nThis is why the upcoming edition of SME Clinic 2021 themed “Sustaining your business with technology” is a must-attend if you want to give your business a boost.\nWho can attend SME Clinic 2021?\nSME Clinic is for anyone who owns, manages or plans to start any kind of small business."
  },
  {
    "headline": "UberX Hourly launches in Nigeria, MoneyHash pre-seed raise, more on #TwitterBan",
    "summarized_story": "Good day,Today, I’m discussing:UberX Hourly launches in NigeriaMoneyHash pre-seed investment roundUpdates on the Twitter ban in NigeriaUber Launches UberX Hourly in NigeriaOn Monday, June 7, 2021, US-based ride-hailing platform, Uber, announced the official launch of UberX Hourly in Nigeria.\nBefore now, UberX Hourly was only available in Africa in Tanzania’s largest city, Dar Es Salaam.\nTime will tell how affordable UberX Hourly will be.\nMoneyHash raises undisclosed pre-seed roundL-R MoneyHash co-founders Nader Abdelrazik, Anisha Sekar and Mustafa Eid.\nSource:The Capital QuestEgypt-based fintech startup, MoneyHash, raised an undisclosed pre-seed investment on Monday, June 7,2021."
  },
  {
    "headline": "#TwitterBan: Nigerian TV, radio stations, others can no longer tweet or patronise Twitter",
    "summarized_story": "Nigeria’s broadcast regulator, National Broadcasting Commission (NBC), has ordered all broadcasting stations to deactivate their Twitter handles.\nIn addition, the body further prohibits media platforms from using User Generated Content (UGC) as sources in their reportage.\nThe latest order resulting from the ongoing Twitter suspension in the country since Friday, June 4, 2021, is a way of disincentivising individuals and corporate bodies from patronising Twitter.\nWhile the statement does not clearly state what media platforms are affected by the directive, the NBC Act defines broadcasting stations as entities — like radio, sound, television, cable, or satellite stations — that have received a broadcasting licence after satisfying the regulator’s requirements.\nAdvertisementIf anything, Nigeria has finally joined the list of countries losing millions of dollars to government-led Internet crackdowns annually."
  },
  {
    "headline": "Major global Internet outage keeps websites offline",
    "summarized_story": "The online services of many companies around the world are being affected due to a major Internet outage.\nFastly, a cloud computing services provider is reportedly the cause of the problem.\nThe US-based company has confirmed it has found the issue and working to repair it, and by around 11.50 am BST, a number of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "How TB Joshua’s exit may dent hospitality business in Lagos",
    "summarized_story": "Tourism and hospitality businesses in and around Ikotun, a Lagos suburb, may be in for harsher days ahead following the death, Saturday, of Prophet TB Joshua.\nIkotun is home to the Synagogue Church Of All Nations (SCOAN), where the late prophet was founder and senior pastor.\nTB Joshua’s SCOAN has over the years continued to…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Energy transition reality rouses FG from inertia on sector reforms",
    "summarized_story": "The threat of a world marching inexorably away from fossil fuels is rousing the Nigerian government from inertia precipitating long-awaited reforms in the oil and sector.\nAfter 20 years of stalling, the country is set to proceed with the Petroleum Industry Bill (PIB).\nAhmed Lawal, Senate president, at the fourth edition of the Nigerian International…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki insists on restructuring of Ambrose Alli varsity to meet global standards, attract foreign partners – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reassured that his government will ensure the restructuring of the state-owned Ambrose Alli University (AAU) to meet global standards and attract foreign partnership.\nAccording to him, “this is one institution that we are very proud of as Edo people.\nThe institution has an amazing manpower; if you talk about the Law School, at one time, all the prize winners were from AAU.\nAAU is Edo State university; it is not a local university.\nIn his remarks, former Minister of Works, Mr. Mike Onolememen, assured the governor that the entire Esan people are fully in his support."
  },
  {
    "headline": "Obaseki plans new airport in Edo North – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki is in talks with investors, development partners and other stakeholders on the construction of an airport in Edo North Senatorial District to open up the area and rev up economic activities in the state.\nThe governor said: “There are some key projects that we want to implement in Edo North.\nThere are major investors talking to us now and want to come into the state.\n“One of the major things that I want to do is to build an airport.\n“Don’t forget that there are two cement plants in the state, major universities and several other economic opportunities that are involved, and to get people there, we need an airport to make access easy."
  },
  {
    "headline": "Edo begins audit of local govt councils, probes N10bn debt burden – Nigerian Observer",
    "summarized_story": "Obaseki said this during an enlarged meeting with leaders of Edo Central Senatorial District held at Irrua, the administrative headquarters of Esan Central Local Government Area of Edo State.\nHe said: “I am doing an audit of all the local governments.\nWe don’t take money or touch the local government’s money.\nWe are transparent and open as we don’t interfere in the local government’s finances.\n“70 to 80 percent of finance for local governments comes from Abuja and there will be problems if the money stops coming."
  },
  {
    "headline": "EIRS Commends Guinness For Being Tax Compliant – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Internal Revenue Service (EIRS), has commended Guinness Nigeria Brewery Factory, Benin, for it’s tax compliance during a routine tax verification exercise.\nThe EIRS Director, Formal Sector and representative of the Executive Director, Income Taxes, Mrs. Grace Ainabe while interfacing with management of Guinness during the EIRS “Operation Know Your Tax Payers,” tax drive to the brewery stated that the EIRS was out to maintain a robust relationship with its tax payers.\nShe noted that this visitation was not to witch hunt but a routine visitation to build trust and harmony, bring taxpayers/company up to speed with EIRS tax routine as well as engender a good relationship between both establishments.\nAfter an inclusive zoom meeting with it’s partner and head of office to bring it up to speed with EIRS tax routine, Site Manager, Guinness, Mr. Tony Aloze, affirmed that they were bound by the business tenets of transparency, accountability and timeliness which has allowed the company to operate above board to become good corporate citizens."
  },
  {
    "headline": "JUST IN: Twitter Ban: Reps summon Lai Mohammed",
    "summarized_story": "ADVERTISEMENTThe House of Representatives has summoned the Minister of Information and Culture, Lai Mohammed, to appear before over the controversial suspension of Twitter.\nMr Mohammed is to appear before a joint committee on Justice, Commerce and Information.\nHe said the joint committee will investigate the process that led to the suspension of the platform.\nMr Gbajabiamila said the House will have to listen to the government before taking any action.\nThe joint committee has 10 days to conduct the investigation and report back to the House."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "FG threatens to prosecute Adeboye, others over Twitter usage",
    "summarized_story": "Nigeria’s Federal Government says the country’s Attorney General, Abubakar Malami would ensure that Nigerians who accessed Twitter after its ban on the platform, including Pastor Enoch Adeboye, General Overseer of the Redeemed Christian Church of God, are prosecuted.\n“The attorney-general has made it clear that if anyone violates the regulation, that such person will be prosecuted.\nI think it is the right of the attorney-general to decide who to prosecute,” he said.\nThe general overseer of the Redeemed Christian Church of God (RCCG) on Monday insisted on using his Twitter account despite the ban on the social media platform by the Nigerian government.\n“The Redeemed Christian Church of God is domiciled in more than 170 Nations & Territories,” Mr Adeboye tweeted on Monday."
  },
  {
    "headline": "CBN gas policy holds out promise for domestic market",
    "summarized_story": "We are major resource holders, major exporter of gas, at the same time we struggle on the domestic front with de-industrialization, with unmet domestic gas demand and insufficiency in gas supply to the power sector for power generation,” President of the Nigerian Gas Association (NGA), Mrs Audrey Joe-Ezigbo, once said.\nUnder the NGEP, the CBN is providing N250 billion loan to help stimulate investment in the gas value chain as part of its efforts to stimulate finance to critical sectors of the economy.\nHe urged operators in the gas industry to take advantage of the fund to further expand the sector and increase the penetration of gas consumption.\nMr. Lambert Ojo, a gas processing and evaporative cooling specialist, believes the intervention for local investors in the gas sector would stimulate the economy.\n“We have enough to do in the domestic gas space."
  },
  {
    "headline": "Two shot as protesters block Kebbi governor’s convoy",
    "summarized_story": "Two persons were reportedly shot and injured on Saturday after residents of a community, recently attacked by bandits, blocked the convoy of Governor Atiku Bagudu of Kebbi State while protesting against insecurity in the state.\nThe protest followed the killing of 88 persons by bandits in Danko-Wasagu Local Government Area of the state on Thursday.\nResidents said a vehicle attached to the governor’s convoy was burnt by the protesters after shots fired by security agents to disperse the crowd hit two persons.\nThe governor, following the incidents, urged residents to be optimistic about the security situation in their area.\nWhat is required (is) mutual trust and respect for all,” the governor’s spokesperson, Yahaya Sarki, said in a statement."
  },
  {
    "headline": "Nigerian govt summons US, EU, UK, Canada, Sweden envoys over comments on Twitter ban",
    "summarized_story": "Nigeria’s Federal Government has summoned the ambassadors of the United States, United Kingdom, Canada and the European Union in Nigeria over their comments on the suspension of microblogging site Twitter in Nigeria.\nThe envoys had criticised the government’s decision to ban the social media platform, calling it an abuse of right to freedom of speech.\nThis was disclosed in an invite to journalists by Kimiebi Ebienfa of the Crisis Monitoring and Public Communications Division of the Nigerian Ministry of Foreign Affairs, on Monday.\n“The venue is Minister’s Conference Room, 8th Floor.\nYou are here invited to cover the Meeting."
  },
  {
    "headline": "BREAKING: Reps to investigate Twitter suspension, summons Lai Mohammed",
    "summarized_story": "The House of Representatives has called Lai Mohammed, the Minister of Information and Culture, to testify about Twitter’s suspension.\nThe summons was delivered by House Speaker Femi Gbajabiamila during plenary on Tuesday.\nA combined committee of the House of Representatives, Commerce, Information and National Ethics, and Justice was charged with conducting an investigation within ten days."
  },
  {
    "headline": "Nnamdi Kanu using Twitter as a platform to destabilise Nigeria –Lai Mohammed",
    "summarized_story": "Lai Mohammed, the Minister of Information and Culture, claims that Nnamdi Kanu, the leader of the outlawed Indigenous People of Biafra, uses Twitter to “destabilize Nigeria.”Mohammed stated this on Monday evening during an interview with BBC News Africa, which our reporters were able to observe.\nWhile justifying the Federal Government’s Twitter ban, the minister stated that no separatist will be allowed to set the country on fire.\n“The main reason for this is because of the persistent use of Twitter in particular for activities that are inimical to the corporate existence of Nigeria.”“IPOB, Nnamdi Kanu in particular, uses Twitter as his forum of choice to destabilize the country,” Mohammed continued.\nIt has been previously reported that the Federal Government blocked Twitter last week after the microblogging platform removed a contentious civil war post by President Muhammadu Buhari (retd.).\nMohammed had accused Twitter of using double standards by allowing Kanu’s posts to remain uncensored while cracking down on his principal."
  },
  {
    "headline": "BREAKING: UK government website, other social pages down —",
    "summarized_story": "On Tuesday morning, the UK government’s main website was down, as were major foreign media sites, including The Guardian and the Financial Times publications.\nThe government portal gov.uk, as well as the media websites, all displayed error messages.\nThe BBC was also temporarily unavailable, although it was restored later.\nReason for this is not yet known, however, experts are suspecting a cyber attack from hackers.\nMore details shortly…"
  },
  {
    "headline": "‘Nigeria must go down,’ chanted late Imo ESN commander ‘The Dragon’ in his final moments",
    "summarized_story": "On June 6, 2021, Nigerian Army (NA) troops stationed in Owerri, the capital of Imo State, repelled an early morning attack on the Imo State Police Command.\nREAD ALSO: Bandits Now Want Peace, They Were Pushed Into Crime —.\nHe has been at the centre of several heinous attacks since the death of Ikonso who gave up the ghost during an encounter with security forces on 24 April 2021 at Awomama Village of Orlu East LGA of Imo State.\nThe last moment of the warlord have surfaced.\nIn the video which has gone viral, King of Dragon was seen dancing and gyrating with his fellow comrades in their local dialect which translates ‘Nigeria Must Go down’"
  },
  {
    "headline": "Amputee woman accuses LASUTH of negligence, demands compensation",
    "summarized_story": "A 35-year-old woman, Oluwadamilare Aremu, has accused the Lagos State University Teaching Hospital of negligence leading to the amputation of her right leg.\nAremu told PUNCH Metro that she was admitted to LASUTH in December 2018 when an 18-passenger vehicle she boarded was involved in a crash on the Third Mainland Bridge, leading to her suffering a broken thighbone.\nLASUTH doctors told me that I would walk again.\nOak Hospital couldn’t remove the iron that LASUTH inserted in my leg, so they called a consultant to come.\nI want justice and proper compensation.”When PUNCH Metro contacted the Chief Medical Director of LASUTH, Prof Tokunbo Fabanwo, he said investigation into the case had begun."
  },
  {
    "headline": "Amputee woman accuses LASUTH of negligence, demands compensation",
    "summarized_story": "A 35-year-old woman, Oluwadamilare Aremu, has accused the Lagos State University Teaching Hospital of negligence leading to the amputation of her right leg.\nAremu told PUNCH Metro that she was admitted to LASUTH in December 2018 when an 18-passenger vehicle she boarded was involved in a crash on the Third Mainland Bridge, leading to her suffering a broken thighbone.\nLASUTH doctors told me that I would walk again.\nOak Hospital couldn’t remove the iron that LASUTH inserted in my leg, so they called a consultant to come.\nI want justice and proper compensation.”When PUNCH Metro contacted the Chief Medical Director of LASUTH, Prof Tokunbo Fabanwo, he said investigation into the case had begun."
  },
  {
    "headline": "On your own: Ayade’s aides refuse to defect, resign",
    "summarized_story": "TWO aides of the Cross River State Governor, Ben Ayade, on Monday resigned their appointments.\nThe two aides are the Special Adviser on Sustainable Development Goals, Mark Obi and the Director General, Urban Renewal Commission (South), Cecil Ita.\nIn two separate letters made public on Monday, the duo made reference to recent political happenings in the state for their decision.\n“Consequently, being a founding and subsisting member of the Peoples Democratic Party in Cross River State, I cannot in good conscience remain in my current appointment as Special Adviser.\nHe added, “The President has been to Cross River a couple of times."
  },
  {
    "headline": "On your own: Ayade’s aides refuse to defect, resign",
    "summarized_story": "TWO aides of the Cross River State Governor, Ben Ayade, on Monday resigned their appointments.\nThe two aides are the Special Adviser on Sustainable Development Goals, Mark Obi and the Director General, Urban Renewal Commission (South), Cecil Ita.\nIn two separate letters made public on Monday, the duo made reference to recent political happenings in the state for their decision.\n“Consequently, being a founding and subsisting member of the Peoples Democratic Party in Cross River State, I cannot in good conscience remain in my current appointment as Special Adviser.\nHe added, “The President has been to Cross River a couple of times."
  },
  {
    "headline": "House of Representatives summons Lai Mohammed",
    "summarized_story": "Minister of Information, Alhaji Lai Mohammed has been invited by The House of Representatives for briefing on the suspension of Twitter.\nSpeaker Femi Gbajabiamila disclosed these while addressing his colleagues on the resumption of plenary after a two week-break.\nGbajabiamila added that the House Committees of Communication, Justice and Legal Matters as well as Information are to submit a report within 10 days to enable the House take an informed decision on the ban."
  },
  {
    "headline": "View from Abroad: Buhari the dictator is back",
    "summarized_story": "President Muhammadu Buhari, formerly the military dictator of the country from 1984-85, used threatening language on Twitter last week in response to agitations in the southeastern part of the country.\nBut social media in Nigeria, especially for the young people who populate it, isn’t just about political expression.\nIn response, the attorney general of the federation instructed law enforcement officers to begin prosecuting people who “violate” the Twitter ban.\nSo far, only one state governor has objected to the Twitter ban.\nYet, in spite of Trump’s interest in muzzling social media after initial warnings, the American system thrived."
  },
  {
    "headline": "I can’t be intimidated: Fr. Mbaka tells Buhari",
    "summarized_story": "Ejike Mbaka, the Spiritual Director of Adoration Ministry, has told the Buhari-led administration that he cannot be intimidated.\nAlthough details of why the intelligence unit summoned the priest were not stated, Mbaka questioned why he was invited for speaking the truth to power.\nMbaka said, “I got a call on Thursday that the DSS people from Abuja came here (Enugu) with a letter of invitation to Abuja; over what?\nI spoke to Obasanjo face to face; I perform under the anointing of the Holy Spirit.\nI ministered to the late President Yar’Adua; I am being used by a supernatural spirit called the Holy Spirit."
  },
  {
    "headline": "Buhari Presides Over Emergency National Security Meeting",
    "summarized_story": "At the State House in Abuja, President Muhammadu Buhari is presiding over an emergency National Security Council meeting.\nThe President is expected to examine the current security situation in the country during the meeting, which is taking place in the First Lady’s Conference Room.\nVice President Yemi Osinbajo, Secretary to the Government of the Federation Boss Mustapha, Chief of Staff to the President Professor Ibrahim Gambari, Ministers of Defense, Major-General Bashir Magashi (rtd), Foreign Affairs, Geoffery Onyema, and National Security Adviser, Major General Babagana Monguno are among those in attendance (rtd).\nOthers include General Lucky Irabor, the Chief of Defence Staff; Major General Farouk Yahaya, the Chief of Army Staff; Vice Admiral Awwal Zubairu, the Chief of Naval Staff; Air Marshal Isiaka Amoo, the Inspector General of Police, Usman Baba, Ahmed Rufai, the Director-General of the National Intelligence Agency, Yusuf Bichi, and other presidents.\nThe council is also likely to consider the security implications of the country’s Twitter ban."
  },
  {
    "headline": "Twitter Ban: House of Representatives Summon Lai Mohammed",
    "summarized_story": "The minister of information and culture, Lai Mohammed, has been summoned by the house of representatives for the suspension of Twitter in Nigeria.\nThe house required that its committees on communication, justice, information and culture, and national security and intelligence begin a probe into the suspension of the microblogging service at its Tuesday meeting.\nDuring the plenary session, Femi Gbajabiamila, speaker of the house, said the green chamber has been “inundated with comments about the decision, requests for intervention and criticism”.\n“The House of Representatives recognises that Twitter, like other social media networks, is an important tool for communication and commerce in Nigeria, particularly amongst the younger generation who have used these networks for enterprise and innovation with great success,” he said.\n“Therefore, I urge the committees to act with speed and sound judgment to address this issue that has animated our national conversations over the last few days,” he said."
  },
  {
    "headline": "Insecurity: Bandits Are Tired, Want Peace — Sheikh Gumi",
    "summarized_story": "Sheikh Ahmad Gumi, a popular Kaduna-based Islamic cleric, claimed on Tuesday that bandits seek peace.\nBandits desire peace because they are tired, Gumi remarked in an interview with DAILY POST.\nBandits are willing to lay down their arms if the government offers them a true partnership, according to the Kaduna-based Islamic cleric.\nGumi said when asked if the bandits were tired:“Yes, it’s very true because bandits are saying they werere pushed into banditry by circumstances.\n“If they have a genuine partner, they are ready to stop it; they are tired and want peace."
  },
  {
    "headline": "There Will Be War If You Harm Father Mbaka, Ohanaeze Youths Warn DSS",
    "summarized_story": "The statement stated, “I condemn the invitation because it is a plan by the Federal Government to silence Fr.\n“But we warn that any plot against Mbaka must be resisted by Igbo youths, let nothing happen to him.\n“The Enugu Catholic Bishop should cease from trying to silence Mbaka.\nWe are in the know that the FG is on the neck of Onaga to silence Mbaka.\n“Mbaka should continue to prophesy to the world, those who don’t have such a gift are just envious of him.”"
  },
  {
    "headline": "Breaking: Again, Buhari meets service chiefs, IGP, others as insecurity worsens",
    "summarized_story": "President Muhammadu Buhari is currently presiding over an emergency security meeting inside presidential Villa, Abuja.\nThe meeting has in attendance Vice President Yemi Osinbajo and other executive principal officers.\nThe Chief of Defence Staff, General Lucky Irabor; Chief of Naval Staff, Vice Admiral Awwal Zubairu; Chief of Air Staff, Air Marshal Isiaka Amoo; and the new Chief of Army Staff, Major General Farouk Yahaya, Inspector-General of Police, Usman Alkali Baba; the Director-General, National Intelligence Agency (NIA), Ahmed Rufa’i; the Director-General of the Department of State Services (DSS), Yusuf Bichi, and other presidential aides are also attending.\nDetails loading…"
  },
  {
    "headline": "Twitter ban: Adeboye, Kumuyi, others remain resolute as FG gives conditions for truce",
    "summarized_story": "The federal government has said the operations of Twitter in Nigeria will be restored only when “responsible communication” can be assured on the platform.\nTwitter had deleted a controversial civil war tweet by President Muhammadu Buhari saying it went against their rules.\nHe added that this decision was key to maintaining security in the country, because “without security, everything else fails.\nThe government claimed that the suspension of Twitter was to protect the sovereignty of the country, but digital rights advocates said it was censorship.\nAdeboye was reacting to allegations that he was flouting the order of the federal government suspending the use of the microblogging platform, Twitter."
  },
  {
    "headline": "IPOB, ESN insurgency: Looming civil war must be averted at all cost, NEF tells FG",
    "summarized_story": "Political leaders in the South East appear to have submitted to violence and terror of IPOB and ESN.\nUmahi resignsMeanwhile, the Chairman of the South East Security Committee, codenamed, Ebubeagu, Major-General Obi Abel Umahi (rtd) has resigned his position.\n“Additionally, I chaired a 21-man Committee set up to draft a legal framework for the SE Security outfit.\nThe committee was composed of members of SE Security committee, the Attorney generals of the five Southeast states and some prominent Igbo sons and daughters.\nFrom inception to date, SE Security Committee was never funded at all in any capacity and not even an office space was provided."
  },
  {
    "headline": "Anambra gubernatorial: I’ll return peace to Anambra if elected governor – Chidozie -NigPilot",
    "summarized_story": "Anambra governorship election hopeful under the platform of All Progressives Congress, APC, Dr. Chidozie Nwankwo, has promised to restore peace and tranquility to Anambra and the troubled Southeast region if elected governor.\nAddressing newsmen, Chidozie Nwankwo urged the people of Anambra to consider those with pedigree in position of leadership.\nThe legacy I left when I was the leader of the main market supersede any influence APGA has in Anambra state.\nI have always brought change to whatever I do.\nThere have been absolute peace in Anambra state."
  },
  {
    "headline": "Buhari, Osinbajo to attend book launch of ‘APC’s Litmus Tests’ -NigPilot",
    "summarized_story": "President Muhammadu Buhari and Vice President Yemi Osinbajo would be special guests at the Public Presentation of the book, APC’s Litmus Tests written by Mallam Salihu Moh.\nHe said, “There is no better time to put this book together as APC grapples with the nitty-gritty of formative challenges.\nIts main agenda is to assist APC leaders and, indeed, all stakeholders in negotiating the next bend.\n“His Excellency President Muhammadu Buhari GCFR will be the Special Guest of Honour.\nThe book will be reviewed by His Excellency, Hope Uzodinma, Governor of Imo State and His Excellency, Nasir El-Rufai, Governor of Kaduna State.”"
  },
  {
    "headline": "Buhari to commission 156km Lagos-Ibadan Standard Gauge Rail this week – APC group",
    "summarized_story": "President Muhammadu Buhari is expected to commission the 156km Lagos-Ibadan Standard Gauge Rail later this week, an APC support group has stated.\nAccording to the group, the rail line is the first double-track Standard Gauge Rail project in West Africa, and the first Standard Gauge Rail project in Nigeria to be started and completed by the same administration.\nThe group emphasized that President Buhari remained committed to building the infrastructure that will drive Nigeria’s growth and prosperity.\nThey also boasted that President Buhari has fulfilled his promised on delivery of good infrastructure for the opening up of the nation’s economy.\n“From the start, President Buhari promised to complete as many abandoned projects as possible, and he has worked hard to fulfil this promise."
  },
  {
    "headline": "Anyanacho beats African champion in Taekwondo championship -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Reps To Invite Lai Mohammed, Investigate Legality Of Twitter Ban",
    "summarized_story": "Members of the House Representatives have resolved to invite the Minister of Culture and Information, Lai Mohammed in a bid to investigate the legality of the Twitter ban by the Federal Government.\nThe Speaker said the House recognizes that Twitter is a very important means of communication.\nHe said relevant committees of the house are to constitute a single committee and commence an investigation into the circumstances surrounding the ban, and its legality.\nThe committee is to invite the Minister of Information on the matter.\nThe Federal Government of Nigeria last week announced the indefinite suspension of Twitter in the country."
  },
  {
    "headline": "#TwitterBan: US, UK, EU Envoys Insist Nigeria Must Protect Freedom Of Expression",
    "summarized_story": "﻿The envoys of the United States, United Kingdom and the European Union in Nigeria among others, have insisted that the Federal Government’s suspension of Twitter, is a violation of the fundamental human right of freedom of expression.\nThe envoys who met with the Minister of Foreign Affairs, Geoffrey Onyeama, in Abuja on Monday, urged the government to protect freedom of expression.\nUS ambassador to Nigeria, Mary-Beth Leonards, who spoke on behalf of others said they were delighted to see Nigeria succeed, and that all challenges have solutions.\n“We are here as partners who want to see Nigeria succeed.\n“We re-affirm our position that free access to the ability to express oneself is actually very important and perhaps more important in troubled times."
  },
  {
    "headline": "Buhari Meets With New Chief Of Army Staff, Calls For More Synergy Between Security Agencies",
    "summarized_story": "President Muhammadu Buhari on Monday met with the new Chief of Army Staff, Major General Farouk Yahaya and the Chief of Defense Staff, General Lucky Irabor at the State House.\nDuring the meeting, President Muhammadu Buhari said that there is a lot of pressure on security in the country and therefore stressed the need for synergy among security agencies.\nThe Minister of Defense, Major General Bashir Magashi (rtd), who was also present at the meeting, told journalists afterwards that the President proffered advice and direction to the new Chief of Army staff, while undoubtedly expressing confidence in the new set of security chiefs.\nOn the issue of securing the Northwestern part of the country, the defense minister affirmed that issues of banditry, kidnapping and criminality have remained a pivotal concern.\nThe meeting is taking place days after the President appointed Major-General Yahaya as the new Chief of Army Staff following the death of Lieutenant-General Ibrahim Attahiru."
  },
  {
    "headline": "IGP Announces Immediate Suspension Of Tinted Vehicle Windscreens",
    "summarized_story": "The Inspector-General of Police Usman Alkali Baba has announced the immediate suspension of tinted vehicle windscreens in Nigeria.\nThe IGP announced this on Monday during a meeting with senior police officers including commissioners and DIGs from across the states.\nREAD ALSO: Twitter Ban: FG Meets Envoys Of Top Diplomatic MissionsThe IGP also spoke concerning the arrest of high-profile criminals.\nTinted Glass LawGeneral Ibrahim Babangida in February 1991 promulgated a decree prohibiting the tinting and use of cars with tinted glasses.\nThe decree is now known as the Motor Vehicles (Prohibition of Tinted Glass) Act, 1991; made up of only six (6) sections."
  },
  {
    "headline": "Hundreds Arrested In ‘Staggering’ Global Crime Sting",
    "summarized_story": "Police arrested more than 800 people worldwide in a huge global sting involving encrypted phones that were secretly planted by the FBI, law enforcement agencies said Tuesday.\nCops in 16 countries were able to read the messages of global underworld figures as they plotted drug deals, arms transfers and gangland hits on the compromised ANOM devices.\nMafia groups, Asian crime syndicates, motorcycle gangs and other organised crime syndicates around the world were all monitored using the spiked phones as part of Operation “Trojan Shield”.\nEuropol hailed the “exceptional” operation, which saw around 12,000 of the ANOM devices distributed worldwide to criminals who thought they were chatting in secret.\nShowing the massive global scale of the sting, Australia said more than 200 people had been charged already."
  },
  {
    "headline": "National Assembly Staff protest non absorption into service",
    "summarized_story": "About two hundred national assembly staff employed by the National Assembly service commission have Stormed the National Assembly to protest against the delay in their absorption into the service.\nThe group carried out a peaceful protest carrying placards with several inscriptions lamenting that, they were yet to resume despite completing 75 percent of the necessary documentation required since 2018A member of the group, Iyanuoluwa Babatunde, said they have waited 3 years to no avail, and are asking why some of them were absorbed while others are still at home.\nAdvertisementThe group is seeking justice from the National Assembly management, and have appealed to resume duty within seven (7) working days.\nThey are also demanding that all Medical Doctors / workers be documented immediately.\nThe National Assembly service commissioner, North West, Bilami Shinkafi, while responding to their agitations says the commission is looking into the situation, while assuring that things will be resolved before the end of the second quarter of this year."
  },
  {
    "headline": "Federal Secretariat, Asaba, Delta state gutted by fire",
    "summarized_story": "The federal secretariat complex, Asaba, Delta State Capital, has been gutted by fire.\nDetails soon"
  },
  {
    "headline": "Automobile Technicians protest alleged encroachment of mechanic villages in Lagos",
    "summarized_story": "Members of the Lagos State chapter of the Nigerian Automobile Technicians Association have staged a protest against alleged encroachment of the mechanic villages in the state.\nAccording to findings, the mechanic villages were allotted to them by the late Governor of the State, Lateef Jakande, to curb the menace of roadside mechanics, littering Lagos neighbourhoods.\nThe informal workers say their work clusters are now taken over by developers.\nThousands of mechanics, including newly trained young ones from technical colleges and polytechnics, cannot find spaces to work, worsening the unemployment and security situation in the state."
  },
  {
    "headline": "Rotimi Amaechi Proposes Death Penalty For Vandals -Trending With Ojy Okpe",
    "summarized_story": "The Minister of Foreign Affairs, Geoffery Onyeama, on Monday after meeting with foreign envoys over the governments decision to suspend Twitter in Nigeria, indicated that Twitter’s operations will be restored only if the platform could be used responsibly.\nThe federal government says it may consider the death penalty for vandals of critical railway equipment in the country.\nThe minister of Information, and Culture Lai Mohammed during the Town Hall Meeting described the destruction of public infrastructure in the country as a form of terrorism.\nThe Director-General of the National Space Research and Development Agency Halilu Shaba on Monday, announced that Nigeria’s satellite is outdated but still functioning by grace.\nIn Anambra State, over the weekend, a truck conveying cows was burnt down by an angry mob after the truck driver allegedly killed eight child street hawkers accidentally."
  },
  {
    "headline": "RISE.TV HEADLINES 08-06-21",
    "summarized_story": ""
  },
  {
    "headline": "FDA Approves Much-debated Alzheimer’s Drug Panned by Experts",
    "summarized_story": "Government health officials on Monday approved the first new drug for Alzheimer’s disease in nearly 20 years, disregarding warnings from independent advisers that the much-debated treatment hasn’t been shown to help slow the brain-destroying disease.\nThe Food and Drug Administration approved the drug from Biogen based on study results showing it seemed “reasonably likely” to benefit Alzheimer’s patients.\nOther experimental drugs have done that but they made no difference in patients’ ability to think, care for themselves or live independently.\nOn one side, groups representing Alzheimer’s patients and their families say any new therapy — even one of small benefit — warrants approval.\nInsurers could try to manage the drug’s costs by requiring strict conditions, including brain scans to confirm plaque, before agreeing to cover it."
  },
  {
    "headline": "Nigeria: Again, 30 Feared Killed By Herdsmen in North-Central Benue State",
    "summarized_story": "Over 30 people were on Sunday killed by suspected Fulani herdsmen in an attack on Odugbeho village in Agatu Local Government Area of Benue State.\nHe stated that the herdsmen invaded their village around 5:45 pm and started shooting sporadically.\nHe added that when most of them who escaped the attack came back, they discovered 11 bodies at the village centre.\nOche, who spoke to THISDAY late Sunday night, said they believed more bodies would be recovered on Monday.\nThe Benue State Police Command confirmed the killing, saying the death toll is yet to be determined."
  },
  {
    "headline": "Nigeria Seeks Lower Oil Production Costs, Targets 40bn Barrels Reserve",
    "summarized_story": "According to him, his administration’s drive for the discovery of more reserves and ramping up oil production is irrevocable.\nBuhari said he had continued to receive updates on the Petroleum Industry Bill (PIB) and expressed the hope that the National Assembly would pass it into law soon.\nWhile calling for stringent measures to reduce production cost, Buhari stated that if strategies are not quickly put in place, the country may witness a situation in which expected oil revenues will be wiped out by costs.\nHe expressed the hope that the hydrocarbon industry will still remain a multi-trillion dollar industry in the coming decades, especially for a country with a vast hydrocarbon potential like Nigeria.\nHe added: “After the unprecedented turmoil of last year, in recent months we have seen relative stability in the oil market."
  }
]