[
  {
    "headline": "Twitter: Five other social media platforms in Nigeria",
    "summarized_story": "According to Statista reports, social media users in Nigeria averaged 28 million in 2020, with more than 61% of the number active on Twitter.\nWith the newly announced ban of Twitter by the Nigerian Federal Government, citizens may have to turn to other social media platforms for access to trends and connection over the world.\nHere are other popular social media sites available in the country;*Facebook: This a popular global social media platform that allows users to network with others around the world.\n*YouTube: Owned by Google, YouTube is a video sharing social media service that boasts of millions of users across the world.\n*TikTok: The Chinese-owned app is one of the most popular new-age social media platforms."
  },
  {
    "headline": "Nigeria, Egypt, China, other countries that have suspended, banned Twitter",
    "summarized_story": "In this piece, The PUNCH has teased together a list of countries in which Twitter has either been suspended or banned.\n• ChinaTwitter is officially blocked in China, however, many Chinese people find ways around the embargo in order to use the platform.\nAs of January 26, Twitter was still confirming that the service was blocked in Egypt.\n• UgandaUganda, under President Yoweri Museveni, blocked access to social media platforms, including Twitter, just two days before its January 14 presidential and parliamentary elections.\n• IranDuring the 2009 Iranian presidential election, the Iranian government blocked Twitter due to fear of protests being organised through the platform."
  },
  {
    "headline": "Plot to silence Mbaka imminent —Ohaneze Youths cry out",
    "summarized_story": "By Levinus Nwabughiogu-AbujaOhanaeze Ndigbo Youth Council, OYC, has hinted of a fresh plot to silence Rev.\nEjike Mbaka of the Adoration Ministry, Enugu.\nHe alleged that there was a sinister plot to silence Mbaka over his recent outspokenness against the powers that be.\nThe group also accused the Catholic Bishop of Enugu Diocese, Bishop Calistus Onaga of allowing himself to be used against his own priest.\n“Why is it difficult for Bishop Onaga to hands-off Mbaka and stop playing the card of the federal government and Princess who want to destroy the church and cause a crisis in Enugu,” the said."
  },
  {
    "headline": "NEITI, NNPC, DPR working to make petroleum contract terms open – Orji",
    "summarized_story": "Nigeria on January 1, 2021 came under obligation as an EITI implementing country to disclose terms of contracts entered into in the petroleum industry and in the solid minerals sector.\nBut Dr. Orji explained that there need to be an understanding on what needs to be disclosed to ensure the sanctity of those contracts.\nHe said: “Yesterday I had a one-hour session with the GMD of NNPC on how NNPC and NEITI can develop a framework of engagement beginning with NNPC’s disclosure on certain contracts that they are currently pursuing.\nDr. Orji who has just been elected chair of EITI global network on contract transparency noted that his election was in recognition of the work Nigeria has done in the area of contract transparency.\nHe explained that the workshop for NEITI staff was for him to sell his ideas for NEITI in the next five years and to develop a five-year strategic plan for the agency."
  },
  {
    "headline": "2023: Arewa group tips Tinubu, Ndoma Egba, Umahi, Amechi, others for Buhari’s job",
    "summarized_story": "By Chris OchayiA political pressure group, Arewa Mandate Initiative, AMI, has penciled down names of some prominent politicians from the Southern part of the country with credentials needed to succeed incumbent President Muhammadu Buhari in 2023 presidential election.\n“The prevailing mood among the APC northern family is that for Nigeria to survive and prosper in peace and harmony, the principle of power rotation must be respected and adhered to by all stakeholders in the Nigerian project.\n“While the North looks forward to the south to put forward the best and most acceptable material for the office of the President, the Arewa Mandate Initiative, had conducted a survey of the likely personally that could be said to possess the credentials needed to occupy the exhalaled office of the country.\n“While the Arewa Mandate Initiative, already has a clue on who might be that personality among the names already mentioned, and gets the North’s endorsement, sources at the presidency have hinted at the Strategy of settling for a former president from the south, as a compromise, in the event that things get to a head.\n“But, we are also aware, and assured that everything is being done by the leaders of the party, towards ensuring a seamless nomination process that will be credible and accepted by majority of the party members and Nigerians in general.”"
  },
  {
    "headline": "Rescind suspension of Twitter in Nigeria or face legal action, SERAP tells Buhari",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has condemned the “illegal and unconstitutional suspension of Twitter’s Operations in Nigeria,” and called on “the government of President Muhammadu Buhari to immediately rescind the suspension within 48 hours or face legal action.”The Federal Government today announced that it has suspended, indefinitely, the operations of microblogging and social networking service, Twitter, in Nigeria.\nThis was announced by the Minister of Information and Culture, Lai Mohammed, according to a statement by his Special Assistant on Media, Segun Adeyemi.\nBut SERAP in a statement by its deputy director Kolawole Oluwadare said: “The suspension of Twitter in Nigeria is a blatant violation of Nigerians’ rights to freedom of expression and access to information.\nPresident Buhari must immediately rescind this unconstitutional suspension.\nDeletion of President Buhari’s tweets should never be used as a pretext to suppress the civic space and undermine Nigerians’ fundamental human rights.”"
  },
  {
    "headline": "Okowa expresses concern over irregular migration, human trafficking",
    "summarized_story": "Ifeanyi OkowaBy Festus Ahon, AsabaDelta State Governor, Dr. Ifeanyi Okowa, Friday, expressed worry over irregular and human trafficking and restated the resolve of his administration to partner with the Lutheran Church of Christ and other faith-based organisations in the fight against it.\n“The voices of our elders and leaders in the church has a lot to do in trying to calm nerves that have been challenged.\n“Sometimes it is not just enough to preach the gospel but in impacting lives in several other ways will continue to attract people to the church of God.\nWe are glad that you are giving hope to our young ones by your effort in addressing the scourge of illegal migration and human trafficking in this country.\nOn the state of the country, Okowa said there was a lot of bitternes, hate and anger in the land because there is hunger, unemployment, uncertainty and a lot of insecurity."
  },
  {
    "headline": "Twitter ban in Nigeria: Whoever advised Buhari is his biggest enemy",
    "summarized_story": "A former Minister of Aviation, Femi Fani-Kaydoe, has said whoever advised President Muhammadu Buhari to ban Twitter in Nigeria, is “his biggest enemy”.\nIn a tweet, hours after the news broke out, Fani-Kayode said the decision “is the most absurd and counterproductive thing” the federal government could make.\nHe wrote: “Suspending @Twitter from Nigeria simply because they removed a dangerous, irresponsible & insensitive tweet by @MBuhari is the most absurd and counterproductive move that the FG could have made.\nImo, Uzodinma under attack by enemies – APC“Whoever advised Mr. President to make this indefensible move is his biggest enemy.”On Friday, the Minister of Information, Lai Mohammed, announced the ban on the micro-blogging website.\nAdamu Garba compares IPOB with Boko Haram, says they are biggest enemy of South East"
  },
  {
    "headline": "Twitter suspension: Learn from Trump",
    "summarized_story": "Senator Dino Melaye, who represented the Kogi Central during the 8th National Assembly, has slammed the Federal Government for ordering the suspension of Twitter in Nigeria.\nDAILY POST had reported that the Minister of Information, Lai Mohammed, on Friday announced the suspension of the social medium.\nThe suspension is not unconnected to the deletion of President Buhari’s controversial tweet by the management of Twitter on Wednesday.\n“Buhari should learn from Trump.\nInsecurity: We didn’t vote Garba Shehu, Buhari should address Nigerians – Dino Melaye"
  },
  {
    "headline": "Buhari told to lift ban on Twitter immediately",
    "summarized_story": "Deji Adeyanju, Nigerian activist, has condemned the decision of the Muhammadu Buhari government to suspend Twitter indefinitely in Nigeria.\nThe Federal Government, on Friday, placed a ban on Twitter in Nigeria.\nDeji Adeyanju questions Shekau, Chief of Army Staff, Attahiru’s death within 24 hoursReacting, Adeyanju, who is the co-convener of Concerned Nigerians, urged the President Buhari-led Federal Government to immediately lift the ban on Twitter.\nHe said, “We condemn in strong terms, the suspension of Twitter operations by the Federal Government of Nigeria,” he said.\n“Freedom of Information Act allows openness and transparency in public governance, therefore, we urge President Buhari’s Federal Government of Nigeria to lift the ban on Twitter.”Reactions as Deji Adeyanju questions existence of Ogun governor"
  },
  {
    "headline": "Atiku reacts to suspension of Twitter by FG",
    "summarized_story": "Former Vice President Atiku Abubakar has reacted to the suspension of Twitter by the Nigerian government.\nDAILY POST reports that the Federal Government on Friday announced the suspension of Twitter in Nigeria.\nThis is coming after Twitter had on Wednesday deleted the tweet for violating its rules.\nReacting, Atiku in a tweet via his Twitter account, said his tweet on Friday, hopefully won’t be his last.\nBuhari’s tweet: Adamu Garba asks FG to block Twitter from Nigerian internet space"
  },
  {
    "headline": "Twitter ban: ‘Buhari govt has lost it’",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has mocked the President Muhammadu Buhari-led administration for suspending Twitter in Nigeria.\nRecall that after Twitter deleted a controversial tweet by the president against the southeast region, Information Minister Lai Mohammed announced that the microblogging site would no longer be accessed in Nigeria.\nHe had said the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence was the reason for the suspensionReacting, Nnamdi Kanu in a tweet on Friday, said the Buhari government has lost it and they have exposed their intolerance.\nHe tweeted, “They have finally lost it.\nFulani Terror Caliphate have exposed their venomous underbelly Intolerance, Hubris…“@UKinNigeria, @USinNigeria, @EUinNigeria & others; imagine what these terrorists & Jihadists ruling #Nigeria are doing with all the deadly weapons you supplied them with?”Nigerians mock Buhari govt for announcing suspension of Twitter via Twitter"
  },
  {
    "headline": "Omawumi: I chose to be baby mama for four years",
    "summarized_story": "2007 West African Idols runner-up, Omawumi Megbele aka Omawonder, has disclosed why she was a baby mama for four years.\nOmawunmi, who was a guest on TVC’s programme, ‘Your View’, stated that she was a baby mama for four years by choice.\nOmawunmi added that she decided to stay away from marriage after the birth of their daughter until she was certain they would both be ready for the commitment.\nI was a baby mama for four years before Papa Kamila decided to marry me.\nI was a baby mama for four years and I decided and said I don’t want to marry until we are good and ready.” she said."
  },
  {
    "headline": "Atiku, Melaye, Omokri react to Twitter Ban",
    "summarized_story": "Reactions have trailed the Federal Government’s indefinite suspension of the operations of one of the world’s biggest social media platform, Twitter, in Nigeria.\nA sarcastic Melaye expressed concerns that the government made its suspension pronouncement through the same medium it suspended.\nUsing Twitter platform to announce Twitter suspension.\n“Does President Buhari and the federal government know how much young Nigerians make on social media platforms like Twitter daily?\nDoes Lai Mohammed know the number of jobs being sustained by Twitter in Nigeria Flag of Nigeria?"
  },
  {
    "headline": "Nigerians slam FG over indefinite suspension of Twitter operations",
    "summarized_story": "The announcement by the Federal Government that it has indefinitely suspended operations of microblogging and social networking service, Twitter has sparked outrage.\nIn a statement on Friday, Minister of Information and Culture, Lai Mohammed, announced suspension of Twitter operations, citing alleged use of the platform for activities capable of undermining Nigeria’s corporate existence.\nWe will resist the attempts to ban Twitter in Nigeria.”Former Vice President Atiku Abubakar in terse post said, “Hopefully, this isn’t my last tweet.\n“This is 2021, but you could have sworn we were back in 1998.”SERAP said: “We’re suing Nigerian authorities over their ILLEGAL indefinite suspension of Twitter in Nigeria.\n@NigeriaGov, we’ll see you in court.”Cleric Apostle Suleiman said: “They are banning Twitter in Nigeria."
  },
  {
    "headline": "BREAKING: EFCC demands asset forms of banks’ MDs, DMDs, EDs",
    "summarized_story": "The Economic and Financial Crimes Commission(EFCC) has asked all Managing Directors of banks, their deputies and Executive Directors to submit their asset declaration forms.\nAccording to a top source, the directive to the Managing Directors, Deputy Managing Directors and Executive Directors are contained in a June 1, 2021 letter to them.\n“The request for the assets declaration forms of the top executives of banks is contained in a letter to the managing directors of the banks dated June 1, 2021.\n“Listed among the officers whose assets declaration forms are expected by the Commission are managing directors, deputy managing directors and executive directors of all the banks.\n(Declaration of Assets) Act, 1986, which mandates bankers to declare assets upon employment and annually thereafter."
  },
  {
    "headline": "BREAKING: FG announces suspension of Twitter in Nigeria",
    "summarized_story": "The Federal Government has suspended micro-blogging platform, Twitter operations in Nigeria indefinitely.\nThis follows the government’s suspicion of Twitter’s role in Nigeria.\nTwitter on Tuesday deleted a post by President Muhammadu Buhari and suspended his account for 12 hours.\nDetails shortly…"
  },
  {
    "headline": "10 feared killed, cattle roasted, vehicles destroyed in Anambra ghastly accident",
    "summarized_story": "From Obinna Odogwu, AwkaTragedy struck in Awka, the Anambra State capital on Friday when a truck loaded with cattle lost its brakes and crashed at Kwata Flyover, killing many people and roasting many cattle.\nAccording to eyewitnesses, the truck lost its brakes while descending the hilly Aroma Junction on the Enugu – Onitsha Expressway.\n“Two male adults lost their lives in a multiple fatal crash at about 1428hrs this afternoon near Kwata Bridge opposite the Ministry of Agriculture, Anambra State.\n“It involves a red Man Diesel truck with registration number JJN 59 YZ, a green Honda CRV without enlistment number, a Red M/Benz 4matic with registration number ABJ 115 DA, a black Toyota Highlander with registration number AWKA 226 HM and an Ash Lexus SUV with registration number KJA 136 FD.\n“Eyewitness report reaching us indicates that the crash which was as a result of brake failure involved a total of 12 people, 11 Male adults and one female adult ."
  },
  {
    "headline": "Uzodinma dissolves expanded Exco of SA, SSAs",
    "summarized_story": "From Stanley Uzoaru, OwerriGovernor Hope Uzodinma of Imo State has dissolved the expanded State Executive Council comprising Senior Special Assistants (SSAs) and Special Advisers(SAs) .\nRecalled that the governor few weeks ago sacked 20 of his commissioners retaining the State Commissioner for Information and Strategy, Declan Emelumba.\nThe sacked aides were directed to return their official vehicles within one week.\nConfirming the report, Emelumba told our correspondent that the governor embarked on the exercise in other to prune down and reduce expenses in running the government ."
  },
  {
    "headline": "BREAKING: FG suspends Twitter operations in Nigeria",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Federal Government, has suspended indefinitely, the operations of Twitter in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, disclosed the suspension in a statement signed by the Special Assistant to the President (Media), Office of the Minister of Information and Culture, Segun Adeyemi.\nThe suspension of the operations of Twitter in Nigeria is coming few days after the microblogging and social networking service deleted President Muhammadu Buhari’s tweet on the civil war.\nMohammed however stated that the persistent use of Twitter for activities that were capable of undermining Nigeria’s corporate existence was responsible for the suspension.\nThe Minister further said the Federal Government has also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria."
  },
  {
    "headline": "Breaking: Police Council confirms Baba as IGP",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Police Council meeting presided over by President Muhammadu Buhari, has confirmed Usman Baba as Inspector General of Police.\nMinister of Police Affairs, Alhaji Maigari Dingyadi, confirmed the development at the end of the one and half hours meeting, said he was unanimously confirmed.\nPresident Buhari had on April 6, Usman Baba as acting the Inspector General of Police.\nThe minister said Buhari directed him to ensure insecurity is brought to the barest minimum.\nBaba was a Deputy Inspector General of Police before his promotion."
  },
  {
    "headline": "Sit up, tackle insecurity –CAN youths tell Buhari",
    "summarized_story": "The Youth Wing of the Christian Association of Nigeria, YOWICAN, has lamented the insecurity in the country.\nBelusochukwu Michael Enwere, in a statement, yesterday, said the situation in Nigeria, especially the South East, calls for urgent action and attention.\nEnwere explained that Nigerians cannot afford to live in a season of anomie with the ongoing bloodshed and the way and manner in which youths, politicians, students and security agencies are being killed without proper justification.\n”The scars of the civil war are still fresh in our minds and psyche, and so, we cannot afford another one.\nThe time to avoid a needless war is now!"
  },
  {
    "headline": "Breaking: FG Suspends Twitter’s Operations in Nigeria",
    "summarized_story": "By Olawale AjimotokanThe Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe suspension was announced on Friday by the Minister of Information and Culture, Alhaji Lai Mohammed, via a statement issued in Abuja.\nThe minister cited the persistent use of the Twitter platform for activities that were capable of undermining Nigeria’s corporate existence.\nMohammed stated that the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nTwitter had Wednesday deleted President Muhammadu Buhari’s tweet posted Tuesday where he threatened to deal with secessionists “in the language they understand”."
  },
  {
    "headline": "Obasanjo: Bad Leadership Has Turned Nigeria to Land of Bitterness, Sadness",
    "summarized_story": "But despite the worsening insecurity, the federal government has said it is preposterous for anyone to declare Nigeria a failed state on the basis of the country’s security challenges.\n“Right now, it is a land flowing with bitterness and sadness; that is not what God wants this country to be.\nInsecurity Does Not Make Nigeria Failed State, Insists FGMeanwhile, the federal government has said it is preposterous for anyone to declare Nigeria a failed state due to the country’s security challenges.\n“Nigeria’s worldwide companions, particularly the USA, should acknowledge that Nigeria is now a failed state.\n“Declaring any nation a failed state is not done at the whims and caprices of one or two persons, no matter their status."
  },
  {
    "headline": "DHQ Allays Fear of Mass Retirement",
    "summarized_story": "By Kingsley NwezehThe Defence Headquarters (DHQ) yesterday allayed concerns about possible mass retirement of top military officers superior to the Chief of Army, Maj. Gen. Farouk Yahaya.\nGen.Bernard Onyeuko, said the military was not contemplating any retirement and had, in fact, not retired any general.\nHe said the operations were the combined efforts of the military and other security agencies involving land, maritime and air operations.\nHe said there were also extensive air operations, which included air patrols, intelligence surveillance and reconnaissance missions, offensive air strikes, air interdictions, search and rescue operations, and close air support for ground troops.\nHe added: “They rescued kidnapped victims, neutralised scores of terrorists, destroyed terrorists’ enclaves, arrested terrorists and intercepted terrorists’ logistics items, including vehicles."
  },
  {
    "headline": "FG Protests Deletion of Tweet, Says Twitter Can’t Gag Buhari",
    "summarized_story": "The accusation followed the decision of Twitter to delete a controversial post by Buhari on the Nigerian civil war.\nThe same Twitter during the ENDSARS protests promoted tweets trying to raise funds for the ENDSARS protesters.\nIf Mr. President, anywhere in the world feels very bad and concerned about a situation, he is free to express such views.\nBy whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\nHe said: “There are so many people who have been spewing hate against Mr. President, against this governments."
  },
  {
    "headline": "Ezeife: South-east Violence, Plot to Undermine Clamour for Igbo Presidency",
    "summarized_story": "Ezeife described the insurrection in the South-east as an attempt to provoke indigenes of the South-east.\n“Now we know that more than 80 per cent of the people caught by the CCTV are not from the South-east.\nHe stated that a South-east governor who had earlier accused IPOB and ESN of executing the attacks had since exonerated the secessionist group.\nDuring the ENDSARS protests, people attributed what was happening in Lagos to some Igbo people and it was later discovered to be untrue.\nThe guild thanked Ganduje and members of the state Executive Council for providing the enabling environment for the national convention to hold."
  },
  {
    "headline": "BREAKING: Buhari Hits Back At Twitter, Suspends Its Operations Indefinitely In Nigeria",
    "summarized_story": "The Nigerian Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe development comes after Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nSee Also Breaking News BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By NigeriansBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nThe platform said the message by the Nigerian President violated its rules."
  },
  {
    "headline": "BREAKING: Buhari Hits Back At Twitter, Suspends Its Operations Indefinitely In Nigeria",
    "summarized_story": "The Nigerian Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe development comes after Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nSee Also Breaking News BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By NigeriansBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nThe platform said the message by the Nigerian President violated its rules."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "How Twitter suspension may affect Nigeria's fragile economic growth",
    "summarized_story": "On Friday, the federal government announced the suspension of Twitter, the microblogging and social network service, in Nigeria.\nThis is not the first time government policies and decisions have impacted negatively on the nation’s economic growth.\nThe knock-on effect of the policy was seen in the Q1 growth for the sector.\nThe information and communication sector — one of the most resilient sectors — recorded a growth rate of 6.47 percent — first single-digit growth since the first quarter (Q1) 2020.\nThe performance in the sector was a result of a 7.69 percent sluggish growth in the telecommunications sub-sector — single-digit growth since Q1 2020 — when it recorded 9.71 percent growth."
  },
  {
    "headline": "How Twitter suspension may affect Nigeria's fragile economic growth",
    "summarized_story": "On Friday, the federal government announced the suspension of Twitter, the microblogging and social network service, in Nigeria.\nThis is not the first time government policies and decisions have impacted negatively on the nation’s economic growth.\nThe knock-on effect of the policy was seen in the Q1 growth for the sector.\nThe information and communication sector — one of the most resilient sectors — recorded a growth rate of 6.47 percent — first single-digit growth since the first quarter (Q1) 2020.\nThe performance in the sector was a result of a 7.69 percent sluggish growth in the telecommunications sub-sector — single-digit growth since Q1 2020 — when it recorded 9.71 percent growth."
  },
  {
    "headline": "BREAKING: Twitter expresses 'deep concern' over suspension in Nigeria",
    "summarized_story": "Twitter has expressed “deep concern” over the federal government’s decision to suspend its operations in Nigeria.\nAdvertisementSarah Hart, Twitter’s senior policy communications manager for Europe, Middle East and Africa, told TheCable the company is investigating the development.\nAdvertisementHowever, as of the time of this report, the platform is still active within Nigeria.\nIn an email response to TheCable’s enquiry, Hart said: “The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\n“We’re investigating and will provide updates when we know more.”AdvertisementMore to follow…"
  },
  {
    "headline": "BREAKING: Twitter expresses 'deep concern' over suspension in Nigeria",
    "summarized_story": "Twitter has expressed “deep concern” over the federal government’s decision to suspend its operations in Nigeria.\nAdvertisementSarah Hart, Twitter’s senior policy communications manager for Europe, Middle East and Africa, told TheCable the company is investigating the development.\nAdvertisementHowever, as of the time of this report, the platform is still active within Nigeria.\nIn an email response to TheCable’s enquiry, Hart said: “The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\n“We’re investigating and will provide updates when we know more.”AdvertisementMore to follow…"
  },
  {
    "headline": "REWIND: Twitter said it chose Ghana as Africa HQ because of free speech, online freedom",
    "summarized_story": "“The mission of Twitter in Nigeria is very very suspect,” the minister had said.\nA few days after the aforementioned development, the federal government suspended the operations of Twitter in Nigeria.\nGhana over NigeriaIn April, the microblogging platform shunned Nigeria and established its African headquarters in Ghana instead, despite Nigerians’ enormous activity on the platform.\nAdvertisementTwitter said the decision was because Ghana is “the champion of democracy” and “a supporter of free speech, online freedom and the open internet”.\n“As a champion for democracy, Ghana is a supporter of free speech, online freedom, and the open Internet, of which Twitter is also an advocate,” the statement had read."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIn the end, he justified his suspension of Twitter on the grounds of “persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.”The suspension brings Twitter squarely into the heat of the debate about the intersection of democracy and internet freedom in Africa.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "Unicorn Group launches Lagos Campus with plans to create more African Unicorns",
    "summarized_story": "The wife of the Lagos state governor, Joke Sanwo-Olu at the eventOn the 2nd of June, 2021 Unicorn Group held an event for the official launch of its Lagos campus.\nTimipre Sylva Minister of State for Petroleum Resources; Lagos state governor Babajide Sanwo-Olu represented by his wife Joke Sanwo-Olu; Engr Simbi Wabote Exec.\nA group picture of the invited dignitariesUnicorn Group’s ecosystem approachAt this event, the Unicorn Group shared its multifaceted approach to creating more unicorns in Africa.\nPonmile Osibo, Chief investor relations officer told TechCabal, that for the Unicorn Group, it’s beyond investing just money.\nThe bigger picture for the Unicorn Group is the impact it’ll have on the economy."
  },
  {
    "headline": "5 Reasons Why You Should Consider A Loan from Page Financials",
    "summarized_story": "If you are still thinking about whether or not to consider a personal loan, we have highlighted 5 reasons why customers usually resort to getting a personal loan.\nDebt ConsolidationOne of the popular reasons to get a personal loan from Page is for debt consolidation.\nWhat To Consider When Considering A Personal LoanApplying for a Page Loan is super easy, everything happens online and you don’t need to visit their office.\nConsider avoiding a personal loan if:You can’t afford it.\nIf you can’t afford monthly payments for your new personal loan, consider skipping it."
  },
  {
    "headline": "2021 Kickstart: International Breweries Calls for Application from Young Entrepreneurs",
    "summarized_story": "The application portal for young entrepreneurs between 18 and 35 years old to apply to the highly anticipated 6th Edition of International Breweries Plc’s Kickstart Initiative is now open.\nAbout International Breweries Plc.\nInternational Breweries Plc (IBPLC), is a proud part of the world’s largest brewer, Anheuser-Busch InBev, (AB InBev), the world’s largest brewer with over 400 beer brands.\nInternational Breweries was established in 1971 and was listed on The Nigerian Stock Exchange in 1995.\nAB InBev consolidated its business stakes in Pabod Breweries Limited, Intafact Beverages Limited into its majority ownership of International Breweries Plc in a merger that was concluded in December 2017."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigerian government suspends access to Twitter indefinitely, Facebook, others could be next",
    "summarized_story": "The Nigerian Federal Government has announced that it will be indefinitely blocking access to microblogging and social media platform, Twitter, in Nigeria.\nOn Friday, June 4, 2021, Nigeria’s Federal Ministry of Information and Culture made this move known on its Twitter and Facebook handles.\nOver the years, Twitter has become an important social media platform for Nigerians.\nNigeria’s latest suspension means that it could order telecom companies to block access to Twitter if this move is not fought against.\nAdvertisementHowever, all signs point to the fact that the Social Media Bill could be very much alive."
  },
  {
    "headline": "Using WhatsApp On Multiple Devices, Building Africa's Tesla, Twitter Activates Subscription Service • Techpoint Africa",
    "summarized_story": "Today, I’m discussing:WhatsApp’s multi-device supportBuilding Africa’s TeslaTwitter launching Twitter BlueOne WhatsApp account, multiple devicesInstant messaging app, WhatsApp, will soon allow users to simultaneously open one account across several devices.\nWhen are these features coming?\nThough there is no launch date for these features, Zuckerberg hints at some time within the next two months.\nAdvertisementTwitter launches premium subscription serviceTwitter launched its premium subscription service, Twitter Blue, on June 3, 2021.\nWhile Twitter didn’t mention a cost, my story about the coming of Twitter Blue might give you an idea."
  },
  {
    "headline": "Kenya-based startup, Kibanda TopUp, raises $460k pre-seed",
    "summarized_story": "Kibanda TopUp, a Kenyan startup which aims at digitising the food supply chain for micro, small, and medium restaurants in Africa has closed a $460k pre-seed round to increase its customer base.\nThe involvement of local investors like Rockson and Agboola continues a growing trend of African investment in early-stage startups.\n“We are increasing restaurants’ contributions to Africa’s GDP by helping reduce cost with the supply chain.\nBased on Blauwhoff’s skills in entrepreneurial digital strategy and project management, and Mutambo’s experience in logistics, Rockson expresses confidence in the founders’ vision.\nKibanda TopUp has a great opportunity to drive a transformation of these businesses into a formal restaurant cooperative to maximise the economic potential."
  },
  {
    "headline": "Nigeria’s twitter ban puts country in uncomfortable company",
    "summarized_story": "The Nigerian government’s planned ban on Twitter for deleting a tweet by President Muhammadu Buhari, which it deemed to have violated the rules guiding the use of the platform, puts Nigeria on the list of nations that are at odds with social media platforms and their citizens’ use of them.\nThe action also has implications…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Green Africa attempts ‘Southwest effect’ on air travel in Nigeria",
    "summarized_story": "Its first flight is days away yet Green Africa, the Lagos-based startup budget airline, is edging closer to disrupting the Nigerian airspace forever.\nDespite the similarity in low fares, differences such as fleet and routes make Green Africa different from Southwest.\nGreen Africa will use ATR72-600S jetliners, a turboprop, while Southwest operates Boeing 737 jet planes.\nFor now, Green Africa will fly to seven domestic destinations from Lagos, including Akure, Ilorin, Abuja, Owerri, Port Harcourt and Enugu.\nAlthough Green Africa only covers seven domestic destinations for now its promise to charge airfare as low as 16,500, makes air travel attractive for more Nigerians."
  },
  {
    "headline": "Will Nigeria learn its lessons asks Bloomberg",
    "summarized_story": "For more than four decades, Nigeria ran its state refineries into the ground, putting the country in the unusual position of being one of the world’s biggest oil exporters and a major gasoline importer.\nNow that private investors, most significantly Aliko Dangote — Africa’s richest man — are rushing to open their own plants, the state has stepped in again.\nThe Nigerian National Petroleum Corp. wants stakes in at least six planned refineries, including Dangote’s monster 650,000 barrels-per-day plant.\nNigeria’s partly private fuel-import system had long been riddled with patronage and corruption.\nWhile the NNPC says it wants to turn Nigeria into a fuel-products exporter, it hasn’t demonstrated the capability to do so."
  },
  {
    "headline": "Constitution Review: Lawan tasks citizens to put national interest first – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Senate President while declaring open the national public hearing on the review of the Nigerian Constitution, has tasked citizens to put the best interest of the country at heart while debating and making their contributions.\n“Public hearings are indeed central to participatory democracy and the law-making process, especially in a Constitution amendment exercise that seeks to put citizens first.\n“It is important to similarly note that agitations are democratic expressions and indications of dissatisfaction with our extant Constitution.\nAccording to him, the National Assembly plays the underlying role of participatory democracy to replace representative democracy, but to supplement it and make it function better.\n“Regardless, the constitution review alone will not engender a successful democracy, without a concomitant shift in attitude and political will."
  },
  {
    "headline": "Edo govt reads riot act against illegal refuse dumping; to arrest, prosecute offenders – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has warned against indiscriminate dumping of wastes at unauthorized locations across the State, noting that the government will, henceforth, arrest and prosecute offenders.\nThe General Manager, Edo State Waste Management Board, Mr. Osadebamen Charles Imariagbe, gave the warning while leading members of Edo State Security Network (EDSN), Health officials, Nigeria Police Force and other stakeholders on a road show across designated areas in Benin City.\nHe noted: “We have embarked on this sensitisation for all residents to know the plans of the Edo State Government in keeping the environment, especially our markets, clean.\nThis road show is to ensure that the people are aware of the steps taken by the government to ensure that the State is clean.\nIt is a civil assignment and please, it should be handled in a civil way.”..."
  },
  {
    "headline": "Senate: Immortalise late Chief of Army Staff & Others – Nigerian Observer",
    "summarized_story": "The call was made in a motion sponsored by Senator Mohammed Ali Ndume, on the floor of the Senate.\nAccording to Senator Ali Ndume, that their death would not be in vain as they died in the line of duty and in the service of the fatherland.\nHe urged the Federal Government to immortalise the chief of Army staff by naming a military structure in his honour.\nSupporting the motion senate unanimously resolved to immortalise the Army chief and ten others.\nThe Senate President said that there can be no justification for the brutal murder of a human beings and fellow citizens."
  },
  {
    "headline": "Obaseki charges pension board to leverage N12trn fund in developing Nigeria’s real economy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has charged the National Pension Commission (PENCOM) to be more participatory and identify the most feasible means to utilize the N12 trillion available to the commission in developing the country’s real economy.\nObaseki noted: “One thing that the commission must now focus on is participation.\nThere is no need to have N12 trillion sitting in banks and not helping to activate the economy.\n“Edo State has a valid group life insurance.\nWith these steps you have shown the people of the State that you are a governor who cares for them.”..."
  },
  {
    "headline": "EXCLUSIVE: EFCC writes banks, demands asset declaration forms of top executives",
    "summarized_story": "ADVERTISEMENTThe Economic and Financial Crimes Commission (EFCC) has written to banks demanding the asset declaration forms of their top executives.\n(Declaration of Assets) Act 1986, enacted to ensure adequate measures in sanitising the nation’s financial system.\n“The request for the assets declaration forms of the top executives of banks is contained in a letter to the managing directors of the banks dated June 1, 2021,” the source said.\nThe source added, “listed among the officers whose assets declaration forms are expected by the Commission are managing directors, deputy managing directors and executive directors of all the banks.\nEFCC spokesperson, Wilson Uwujaren, confirmed to our reporter that the commission had written the letters to the banks."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Oyebamiji, Osun Finance Commissioner decries bank robbery incident",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state Commissioner for Finance, Mr Bola Oyebamiji has condemned an attack by dare devil armed robbers on some banks in Ikire and Apomu towns of the state which left about seven people dead.\nOyebamiji described the incident as very unfortunate and saddening, especially at a time when the state’s helmsman is doing everything possible to ensure the security of lives and properties in the state.\nOyebamiji through a statement he personally signed and made available to newsmen on Thursday, described the actions of the dare devil gunmen as callous and wicked, stressing that the incident is saddening and particularly disturbing for him.\nThe statement reads in part, “I commiserate with the Nigeria Police Force, Osun Command for the loss of their men in the unfortunate incident which occured yesterday evening.\nMy deepest condolences also goes to the families of civilians who were also shot dead in the process."
  },
  {
    "headline": "Ekiti suspends minimum wage, reduces workers, political appointees’ salaries",
    "summarized_story": "Ekiti State government, on Friday, announced the suspension the Consequential Salary Adjustment (minimum wage) and a cut in the salaries of workers and that of the political appointees.\nThe government said the minimum wage hitherto being enjoyed by workers on grade levels 07 to 12 since January, has now been partially suspended for a period of three months.\nWorkers on grade levels 01 and 06 were, however, exempted from the cut, as their N30,000 minimum wage was not affected.\nAccording to the agreement read by the TUC Chairman, Sola Adigun, the suspension of the consequential adjustment for certain categories of workers for a period of three months— May to July.\nIt was agreed that the salaries of political appointees be slashed by 25 percent for a period of three months."
  },
  {
    "headline": "Banks commence N6.98 deduction on USSD transactions",
    "summarized_story": "Deposit Money Banks (DMBs) on Friday commenced the implementation of the new N6.98 charge per transaction for customers using the unstructured supplementary service data (USSD).\n“To promote transparency in its administration, the new USSD charges will be collected on behalf of MNOs directly from customers bank accounts.\nBanks shall not impose additional charges on customers for use of the USSD channel.\n“Effective 3rd June, 2021, each USSD Banking transaction will attract a charge of N6.98 exclusive of VAT for use of the USSD Banking channel.\nThe money will be deducted from your bank, by your bank,” the teleco tweeted in response to an inquiry."
  },
  {
    "headline": "Police council confirms Usman Baba IGP",
    "summarized_story": "The Police Council has confirmed Mr Usman Baba as Nigeria’s substantive Inspector-General of Police (IGP).\nThe decision was taken at the council’s meeting presided over by President Muhammadu Buhari on Friday.\nMinister of Police Affairs, Alhaji Maigari Dingyadi, confirmed the development to State House correspondents at the end of the meeting."
  },
  {
    "headline": "Stop Revealing Election Winners, Losers, Catholic Church Tells Mbaka",
    "summarized_story": "The Catholic Church of Nigeria has banned the spiritual director of the popular Adoration Ministries Enugu Nigeria (AMEN), Rev Fr.\nEjike Mbaka, from commenting on partisan politics by prophesying election winners or lossers.\nMbaka by the Catholic Bishop of Enugu Diocese, Callistus Onaga.\nAlso, the Adoration ministry ground has been converted to chaplaincy thereby taking the Ministry away from Mbaka’s grip.\nThe development is coming as Mbaka is set to resume activities of the ministry which was suspended following his one-month private retreat."
  },
  {
    "headline": "Stop Revealing Election Winners, Losers, Catholic Church Tells Mbaka",
    "summarized_story": "The Catholic Church of Nigeria has banned the spiritual director of the popular Adoration Ministries Enugu Nigeria (AMEN), Rev Fr.\nEjike Mbaka, from commenting on partisan politics by prophesying election winners or lossers.\nMbaka by the Catholic Bishop of Enugu Diocese, Callistus Onaga.\nAlso, the Adoration ministry ground has been converted to chaplaincy thereby taking the Ministry away from Mbaka’s grip.\nThe development is coming as Mbaka is set to resume activities of the ministry which was suspended following his one-month private retreat."
  },
  {
    "headline": "EFCC Begins Probe Of Bank Chiefs",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), is set to commence investigations of managing directors, deputy managing directors and executive directors of banks in Nigeria.\nThis follows the demand for the assets declaration forms filed by bankers beginning from June 1, 2021 by the executive chairman of the Commission, Abdurasheed Bawa.\nThe request for the assets declaration forms of the top bank executives waa contained in a letter to the managing directors of the banks dated June 1, 2021.\nListed among the officers whose assets declaration forms are expected by the Commission are managing directors, deputy managing directors and executive directors of all the banks.\nWe have not been able to take full advantage of asset declaration because of the opacity around it."
  },
  {
    "headline": "EFCC Begins Probe Of Bank Chiefs",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), is set to commence investigations of managing directors, deputy managing directors and executive directors of banks in Nigeria.\nThis follows the demand for the assets declaration forms filed by bankers beginning from June 1, 2021 by the executive chairman of the Commission, Abdurasheed Bawa.\nThe request for the assets declaration forms of the top bank executives waa contained in a letter to the managing directors of the banks dated June 1, 2021.\nListed among the officers whose assets declaration forms are expected by the Commission are managing directors, deputy managing directors and executive directors of all the banks.\nWe have not been able to take full advantage of asset declaration because of the opacity around it."
  },
  {
    "headline": "Anti-piracy: Buhari To Launch NIMASA’s Deep Blue Project",
    "summarized_story": "President Muhammadu Buhari will on Thursday, June 10, perform the official launch of the assets under the Integrated National Security and Waterways Protection Infrastructure, also known as the Deep Blue Project in Lagos.\nThe main objective of the Deep Blue Project is to secure Nigerian waters up to the Gulf of Guinea.\nThe Project has three categories of platforms to tackle maritime security on land, sea, and air.\nThe sea assets include two Special Mission Vessels and 17 Fast Interceptor Boats.\nADVERTISEMENTThe Deep Blue Project is the first integrated maritime security strategy in West and Central Africa with the aim of tackling the incidences of piracy, sea robbery, and other crimes at sea."
  },
  {
    "headline": "Spiritually Nigeria has already broken up – Mailafia",
    "summarized_story": "A former presidential candidate, Obadiah Mailafia, on Friday said Nigeria has already broken up spiritually and if steps are not taken the country will break up physically soon.\nThe former Deputy Governor of the Central Bank of Nigeria stated this during an interview with Punch.\nHe further stated that there is no need to argue that the country has been a failed state for over five years.\nObadiah when asked on Friday of his view on the secessionists’ calls in the country, Mailafia said, “Do you want an honest answer or do you want a political answer?\nThe honest answer is that the country is already broken up spiritually."
  },
  {
    "headline": "Breaking: FG Says It Has Indefinitely Suspended Twitter Operations In Nigeria — Daily Times Nigeria",
    "summarized_story": "The Federal Government on Friday said it has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed,announced the suspension in a statement issued by his office in Abuja.\nREAD ALSO: Police council confirms Usman Baba Alkali as substantive IGPThe statement, signed by Ministry spokesperson, Segun Adeyemi, cited the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nAccording to the statement, the Minister said the Federal Government has also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria."
  },
  {
    "headline": "Democratic constitution made by the people – Elumelu",
    "summarized_story": "By Tom OkpeMinority Leader of the House of Representatives, Ndudi Elumelu has said that for any constitution to have legitimacy and acceptance as democratic, it must be a product of the people’s will, through citizens’ participation.\n“Consequently, any constitution that does not guarantee the fulfilment of such aspirations, is to the extent of such shortcomings, defective, frustrating and cannot deliver benefits to the people.\n“Across the Niger Delta region, there has been demands that the Federal Government should completely relinquish ownership, control, and management of oil and gas resources situated in the various states of the region,” he said.\nHe stressed further that, “as a critical stakeholder in the Niger Delta, I have witnessed firsthand, challenges that lead to various agitations.\n“These and many more are serious issues that require concerted consideration,” Elumelu said."
  },
  {
    "headline": "EKSG suspends implementation of minimum wage, slashes political...",
    "summarized_story": "The Ekiti State Government has suspended implementation of the minimum wage for its senior civil servants following dwindling revenues accruing to the state.\nHowever, workers on grade levels 01 and 06 were not affected in the economic adjustment measure as they would continue to earn their N30,000 minimum wage.\nThe Permanent Secretary, Office of Establishment and Service Matters, Mr Bayo Opeyemi, also witnessed the signing.\nKayode Fayemi had at a recent “State of the State Finance’’ programme, presented the financial report of the state.\nThe SSA to the governor on Labour Matters also commended labour leaders for showing understanding on the matter."
  },
  {
    "headline": "US: Journalists’ lives under threat in Nigeria",
    "summarized_story": "The United States of America has called for the protection of the lives of journalists in Nigeria, saying that threats to journalists have been alarming.\nIbelli said, “I appreciate International Press Centre for partnering with us.\n“Many people look to the media to help tell the story.\nWe will continue to work on the improvement of the training, welfare of journalists and how to combat misinformation.\nWe are particularly concerned about the protection of journalists, and their safety in reporting.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "US: Journalists’ lives under threat in Nigeria",
    "summarized_story": "The United States of America has called for the protection of the lives of journalists in Nigeria, saying that threats to journalists have been alarming.\nIbelli said, “I appreciate International Press Centre for partnering with us.\n“Many people look to the media to help tell the story.\nWe will continue to work on the improvement of the training, welfare of journalists and how to combat misinformation.\nWe are particularly concerned about the protection of journalists, and their safety in reporting.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Lai Mohammed: NBC to license all social media ‘operations’ in Nigeria",
    "summarized_story": "Minister of Information and Culture, Lai Mohammed, says the National Broadcasting Commission, will immediately commence the process of licensing all social media operations in Nigeria.\n), which the social media platform said violated its policies.\nOther social media platforms used by Nigerians include Facebook, Instagram, TikTok, Youtube, amongst others.\nThe statement titled, ‘FG Suspends Twitter’s Operations in Nigeria’, read, “The Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nIt seeks to criminalise the use of the social media in peddling false or malicious information."
  },
  {
    "headline": "Lai Mohammed: NBC to license all social media ‘operations’ in Nigeria",
    "summarized_story": "Minister of Information and Culture, Lai Mohammed, says the National Broadcasting Commission, will immediately commence the process of licensing all social media operations in Nigeria.\n), which the social media platform said violated its policies.\nOther social media platforms used by Nigerians include Facebook, Instagram, TikTok, Youtube, amongst others.\nThe statement titled, ‘FG Suspends Twitter’s Operations in Nigeria’, read, “The Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nIt seeks to criminalise the use of the social media in peddling false or malicious information."
  },
  {
    "headline": "Outrage greets FG’s suspension of Twitter in Nigeria",
    "summarized_story": "By Kazeem UgbodagaThere is outrage and anger in Nigeria following the Federal Government’s suspension of Twitter indefinitely in Nigeria.\nThe Government got angry and went to suspend Twitter in Nigeria and we are already downloading VPNs.\nOur lives mean nothing to him.”Mohnice stated: “Twitter suspended Donald Trump, and USA did not suspend Twitter Small tweet delete, Buhari ban twitter in Nigeria!\nDunno but, Why is Nigeria like this, who is behind this mess fgs.”VIP Vendor added: “When twitter deleted President Trump’s account US didn’t suspend twitter.\nJesus take the wheel.”According to Reno Omokri, “How can you announce your suspension of @Twitter on Twitter and expect to be taken seriously?"
  },
  {
    "headline": "To Shock and Awe!",
    "summarized_story": "The expected language, rationally and legitimately applied to the aggressors, was exactly what we now hear – “I shall shock you.\nIt took months for me to effect a meeting, agreed in principle, with a former National Security Adviser.\nThe records, I am certain, will be found in the National Security files and, in any case, I went accompanied.\nWhile Boko Haram was consolidating, a Nation’s Security Czar was also consolidating his nest egg with funds meant for elimination of a national scourge.\nCivil Society already has a superabundance of the military shock treatment!"
  },
  {
    "headline": "Buhari govt suspends Twitter in Nigeria via Twitter",
    "summarized_story": "By Bayo OnanugaThe Buhari Government has announced the indefinite suspension of Twitter operations in Nigeria.\nTwitter had come into the crosshairs of the Buhari government after its police deleted two tweets and a video, in which President Buhari threatened to invoke civil war treatment to arsonists, separatists and insurrectionists destroying public assets.\nThe Minister of Information felt it was an affront against the President of Nigeria and wondered why Twitter had not deleted the tweets by Nnamdi Kanu, leader of Biafra.\n“The mission of Twitter in Nigeria is very suspicious.\n“And you see when people were burning police stations and killing policemen in Nigeria during ENDSARS, for Twitter, it was about the right to protest."
  },
  {
    "headline": "BREAKING: Father Mbaka Banned From Commenting On Political Matters",
    "summarized_story": "Ejike Mbaka, Spiritual Director of Adoration Ministries Enugu Nigeria (AMEN), has been barred from commenting on party politics by the Catholic Church.\nAccording to the Cable, Callistus Onaga, Catholic Bishop of Enugu Diocese, switched the adoration ministry to chaplaincy in a letter to the priest.\nAs a result of the change, Mbaka will no longer be the sole spiritual director of the ministry, as it has been renamed chaplaincy, which places it under the administration of the Enugu Diocese and provides the bishop the authority to designate a chaplain to oversee its operations.\nThe bishop further noted that he has the authority to designate any ministerial officer “to assist the chaplains in overseeing the ministry’s pastoral activities.”During Mbaka’s return to church activities, which had been suspended following his one-month private retreat, these directions were issued.\nMore details later…"
  },
  {
    "headline": "Like Twitter, Facebook Deletes Buhari’s ‘Genocidal Threat’ Post",
    "summarized_story": "The site banned the post for breaking its terms and conditions, which implied “Genocidal” violence against the Igbos.\nFacebook, on the other hand, removed the same post from their site on Friday.\n“In line with our global policies, we’ve removed a post from President Buhari’s Facebook page for violating our Community Standards against inciting violence.\nWe remove any content, from individuals or organisations that violates our policies on Facebook.”, Facebook Spokesperson stated.\nFacebook has also taken down the tyrant’s genocidal post."
  },
  {
    "headline": "BREAKING: NBC To License All Social Media ‘Operations’ In Nigeria — Lai Mohammed",
    "summarized_story": "The National Broadcasting Commission will immediately begin the process of licensing all social media businesses in Nigeria, according to Minister of Information and Culture Lai Mohammed.\n), which the social media giant claimed violated its regulations, the government took action.\nNigerians also use Facebook, Instagram, TikTok, and Youtube, among other social media platforms.\nThe statement titled, ‘FG Suspends Twitter’s Operations in Nigeria’, read, “The Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nIt aims to make it illegal to use social media to spread incorrect or malicious information."
  },
  {
    "headline": "BREAKING: Facebook Bans Donald Trump For Two Years",
    "summarized_story": "Facebook has banned former US President Donald Trump from its site for two years, claiming he merited the harshest penalty for breaking its rules in the aftermath of a deadly attack on the US Capitol by his supporters.\n“Given the gravity of the circumstances that led to Mr Trump’s suspension, we believe his actions constituted a severe violation of our rules which merit the highest penalty available under the new enforcement protocols,” Facebook vice president of global affairs Nick Clegg said in a post.\nFacebook also announced that politicians will no longer be granted blanket immunity for fraudulent or abusive information on the social media platform since their opinions are newsworthy."
  },
  {
    "headline": "Breaking: FG suspends Twitter indefinitely in Nigeria",
    "summarized_story": "The Federal Government has suspended, indefinitely, the operations ofthe microblogging and social networking service, Twitter, in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed,announced the suspension in a statement issued in Abuja on Friday, citing the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nThe Minister said the Federal Government has also directed theNational Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Arms proliferation: Nigerians alarmed as insecurity heightens",
    "summarized_story": "The Chief of Defence Staff (CDS), Gen. Lucky Irabor, recently decried the proliferation of illegal arms in Nigeria, saying it was a threat to the country’s corporate existence.\nA security expert, Dr. Don Belema, in his view, blamed it on the lack of harmonious relationships among security agencies in arms proliferation and poor border management.\nWe need to look at it and see how to move regulations that could control small arms in the country.\n“There is a committee of federal government bodies that are in charge of small arms proliferation and prevention.\n“They should work and share intelligence not only with relevant national security agencies, but also neighbouring countries and regional organs like ECOWAS."
  },
  {
    "headline": "Breaking: Tuchel strikes fresh Chelsea deal",
    "summarized_story": "Chelsea manager Thomas Tuchel has signed a contract extension until the summer of 2024.\nTuchel, 47, signed an initial 18-month deal when he replaced Frank Lampard as Blues boss in January.\nHe led the club to victory in the Champions League final and a fourth-placed finish in the Premier League.\nChelsea were ninth in the Premier League and without a win in five games when Tuchel was appointed at the start of the year.\nThe London club also reached the FA Cup final, where they were beaten 1-0 by Leicester at Wembley."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "FG Says It Has Indefinitely Suspended Twitter Operations In Nigeria",
    "summarized_story": "The Federal Government on Friday said it has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nIt is not yet clear how the suspension will work but the Twitter website was still accessible from Lagos as of Friday afternoon.\n‘Civil War’ TweetThe suspension comes days after Twitter deleted a tweet from President Muhammadu Buhari’s official account.\n“The mission of Twitter in Nigeria is very suspicious.\n“And you see when people were burning police stations and killing policemen in Nigeria during ENDSARS, for Twitter, it was about the right to protest."
  },
  {
    "headline": "Police Council Confirms Alkali As IGP, Almost Two Months After Appointment",
    "summarized_story": "The Police Council has confirmed Usman Alkali Baba as the Inspector General of Police (IGP), almost two months after President Muhammadu Buhari approved his appointment.\nUsman Alkali was confirmed on Friday during a meeting of the council in Abuja presided over by President Buhari.\nHeightening InsecurityDingyadi had on April 6 announced President Buhari’s confirmation of Alkali as the replacement for Mohammed Adamu.\nBefore his new role, the Yobe-born police chief was the Deputy Inspector General of Police, Force Criminal Investigation Department, Force Headquarters in Abuja.\nHe had before then also met with commanders from the areas to profer solutions to the hike in insecurity in the regions."
  },
  {
    "headline": "Nigerians Start Getting Charged N6.98 For USSD Transactions",
    "summarized_story": "Many users of USSD services in Nigeria on Friday started to see a notice to pay N6.98 for each transaction session.\nUSSD is a critical channel for delivering financial services, especially for those who do not have access to physical banking infrastructure or internet services.\n“Welcome to USSD Banking,” one notice said.\n“Things are really getting harder in this country a whole 6.98 approximately 7.00 to use #USSD,” one Twitter user wrote.\n“Do they realize that people who mostly use #USSD can’t afford internet enabled devices talk more of data."
  },
  {
    "headline": "Uzodinma Accuses Opposition, Aggrieved APC Members Of Fueling Insecurity",
    "summarized_story": "﻿Governor Hope Uzodinma of Imo has accused the opposition and aggrieved members of the All Progressives Congress (APC) of fueling the rising levels of insecurity in the southeast state.\n“The opposition party and some aggrieved members of our party who are hiring boys from neigbouring states to come in here, allow me, I will deal with them.\nA chieftain of the All Progressives Congress (APC), Ahmed Gulak was killed by gunmen on Sunday, becoming the latest high-profile casualty in the insecurity that has enveloped Imo State.\nThe main opposition Peoples Democratic Party (PDP) had in the wake of the worsening security situation, asked Governor Uzodinma to resign, arguing that he (Uzodinma) has failed to secure the lives and property of the Imo people.\nThe PDP leader noted that emerging developments suggest that the governor has no answer to the spate of killings in the state."
  },
  {
    "headline": "12 Farmers, 10 Others Killed As Bandits Attack Zamfara Communities",
    "summarized_story": "Twelve farmers have been reportedly killed and nine others injured by suspected bandits in Magami and Mayaba communities in Gusau local government area of Zamfara State.\nChannels TV gathered that the armed bandits launched the attack when the farmers were in their respective farmlands trying to clear their lands in preparation for this year’s farming activities.\nIt was also said that the twelve persons killed were buried according to Islamic rites while those injured are receiving treatment in an undisclosed hospital.\nREAD ALSO: Rescind Suspension Of Twitter In Nigeria Or Face Legal Action, SERAP Tells BuhariIn another attack, about ten people were killed and many animals rustled as bandits attacked Bardi And Girkau villages of Anka local government.\nAccording to a source in Anka, the bandits invaded the villages about 9pm Thursday evening and started shooting sporadically killing six people in Bardi village and four persons in Girkau village."
  },
  {
    "headline": "Nigeria to produce smartphones for African continent – Pantami",
    "summarized_story": "Nigeria has now registered its name among countries producing Smartphones in the world.\nThis follows announcement by the minister of Communications and Digital Economy, Isa Pantami, that Nigeria now has the capacity to produce SIM cards and smartphones for the continent of Africa.\nHe stressed that Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones,” the minister said."
  },
  {
    "headline": "End SARS Panel: Stray bullet victim, Mariam Shobukola testifies, seeks N10m compensation",
    "summarized_story": "She says, while waiting to collect the receipt after the transaction, she fell down and couldn’t remember what happened afterwards.\nDuring cross examination, she also told police counsel, Joseph Ebhoseremen that she didn’t witness any fighting in the area at the material time.\nThe stray bullet pierced the stomach of the teenager and ruptured her bladder, when she was caught up in an ensuing commotion after scores of commercial motorcyclists began agitating against the high handedness of police officers enforcing the Lagos State Traffic law in Aboru.\nAfter she was hit, Mariam, was rushed to Peak Health Hospital and then taken to the General Hospital, Orile Agege, before she was transferred to LASUTH.\nThe family is seeking a N10 million naira compensation from the panel."
  },
  {
    "headline": "Boat Mishap: Tambuwal directs ministry, SEMA to provide motor boats, Jackets for marine travelers",
    "summarized_story": "Sokoto state governor, Aminu Tambuwal has directed that henceforth, marine travelers in the state will have to wear life jackets and will embark on their journeys in motor boats instead of dug-out canoes.\nThe governor, condole the people of the town over the incident and directed the state ministry for local government, headed by the state Deputy Governor, Manir Muhammad Dan’Iya in collaboration with the state emergency relief agency, to provide motor boats and jackets to the local government areas of the state where passengers have to cross rivers, lakes and ponds.\nHe said the facilities will be distributed to people living in riverine areas in the state since the raining season has started.\nAdvertisementThe governor also charged people to always take precautionary measures while being transported by boats.\nHe prayed Allah to grant the deceased Jannatul firdaus and also to prevent future occurrence."
  },
  {
    "headline": "Nigeria Suspends Twitter Indefinitely",
    "summarized_story": "Nigeria’s federal government has suspended, indefinitely, the operations of social networking service Twitter.\nHe said: “The mission of Twitter in Nigeria is very suspect.\n“And you see, when people were burning police stations and killing policemen in Nigeria during ENDSARS, for Twitter, it was about the right to protest.\n“By whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\n“But I’m saying that you cannot compare anybody with Kanu who boldly say, go and kill policemen."
  },
  {
    "headline": "Thomas Tuchel Signs Chelsea Contract Extension After Champions League Win",
    "summarized_story": "Chelsea has tied Thomas Tuchel to a two-year deal, extending his previously 18-month contract six days after winning the Champions League for the London club.\nThat extension has been granted after the German, who was sacked by Paris-Saint Germain on Christmas Eve, delivered the Champions League trophy courtesy of a 1-0 victory over Premier League champions Manchester City.\nOn the extension of his contract, Tuchel told the club’s official website: “I cannot imagine a better occasion for a contract renewal.\n“Returning us to the top four in the Premier League was crucial, and we could not be happier with our success in the Champions League which crowned a remarkable season at Chelsea.\nLast weekend, he became the first manager to reach back-to-back Champions League finals with two different clubs."
  },
  {
    "headline": "Brazil Players May Walk Out on Copa America as Nation Heads For Third Covid Wave",
    "summarized_story": "The Copa America, awarded to defending champions Brazil after Argentina and Colombia were dropped as co-hosts, has become a contentious issue amid surging Covid cases in the region.\nReports have since followed that Brazilian internationals playing their domestic football in foreign countries will not play in the Copa America due to the crisis.\nBrazil players, executives and coaching staff haven’t spoken to the media since the decision was announced.\n‘Copa America is very important.\nBut Brazil’s stars have yet to speak out publicly about why they are against hosting Copa America, which starts in just nine days time."
  },
  {
    "headline": "Fire in Egyptian Detention Centre Kills 6 Children",
    "summarized_story": "Egyptian authorities say six teenage girls and at least 19 other people have been killed in a fire at a younger offenders’ institute in the country’s capital, Cairo.\nOfficials said the fire followed a fistfight between two children in one ward at the facility, located in the city’s Marj district.\nMore than two dozen other children were injured, they said.\nThe state-run newspaper Akhbar el-Yom reported that the children were not able to flee the fire because the ward was locked.\nIn March, a fire at a garment factory near Cairo killed at least 20 people and injured 24 more."
  },
  {
    "headline": "Uganda National Hospital Reports Increase in Covid Cases",
    "summarized_story": "Uganda’s national hospital, Mulago is reporting an unprecedented number of coronavirus patients as the East African country battles a second wave of the pandemic.\nThe national referral hospital’s deputy executive director, Dr Rosemary Byanyima, says the hospital has received 40 patients in the last 24 hours alone with many of them either severely or critically ill.\nMulago hospital had reserved 200 beds for Covid-19 patients and 190 people are currently admitted with more than three-quarters of them in the high dependency unit.\nMs Byanyima says there are plans to create more bed space by moving non-Covid patients to the old wing of the hospital.\nPresident Yoweri Museveni is expected to address the country this weekend on the government’s response to this second wave of the pandemic."
  }
]