[
  {
    "headline": "Why I issued 30-day ultimatum to criminal herders in Taraba forests -Emir Tafida",
    "summarized_story": "The Emir of Muri in Taraba State, Alhaji Abbas Njida Tafida, has said the 30-day ultimatum he issued to criminal herders to vacate the forests within the state or be forced out became necessary following atrocities linked to them.\nTafida had on Tuesday during Eid prayers to mark this year’s Eid-el-kabir celebration gave a 30 days ultimatum to the herders to leave Taraba forest.\nAccording to him, information available to him indicated that the rising cases of kidnappings, killings, and attacks in the state were linked to the criminal herders occupying the forests.\nSpeaking in Hausa, the Emir charged the leadership of Fulani herders in the State to fish out the bad eggs among them for a peaceful society.\n“Because of this unending trend, every Fulani herdsman in the state, living in the forests have been given 30 days ultimatum to vacate the forests."
  },
  {
    "headline": "[BREAKING] Igboho: Ilana Oodua releases manual for Yoruba nation agitation",
    "summarized_story": "The Umbrella body of Yoruba Self-Determination Groups, Ilana Omo Oodua, has released a manual for any persons willing to join or champion the Yoruba Nation agitation.\nThis is coming barely three days after a Yoruba Nation activist, Sunday Igboho was arrested at the airport in Benin’s capital Cotonou.\nIt explained that the need for collaboration between Yoruba Nation and other self-determination groups across the world.\n“The following is a guide or manual for the use of all Yoruba patriots engaged in the struggle for Yoruba self-determination.\nAltogether, we Yoruba must demonstrate our Yoruba nation’s civilization and maturity, while resolutely and irrepressibly pushing our way forward to the great goal of Yoruba strength, self-determination, self-fulfillment and prosperity.”"
  },
  {
    "headline": "E-transmission of election results: Why I was absent at voting ― Sen Ekwunife",
    "summarized_story": "By Vincent Ujumadu, AwkaThe senator representing Anambra Central in the nation’s upper legislature, Senator Uche Ekwunife has given reasons for her absence during the voting for electronic results transmission.\nThe senator said she is fully in support of electronic transmission of election results, adding that her absence was because she had scheduled programmes in her constituency.\n“I have on many occasions, stated my support and stand for electronic transmission of results.\n“My stand has always been that electronic transmission of results should be mandatory in all polling units and collation centers across Nigeria without exceptions.\n“I stated that if ATM, POS, Internet banking, and other electronic transactions are obtainable nationwide, I do not see why the electronic transfer of election results cannot be equally achieved nationwide."
  },
  {
    "headline": "Wuhan lab leak claim goes against science – Official",
    "summarized_story": "The claim that the SARS-CoV-II leaked from a Wuhan lab goes against science, a senior official of the National Health Commission (NHC) said on Thursday.\nZeng Yixin, vice director of the NHC, said he was surprised to hear that some people had claimed the SARS-CoV-II.\nThe virus that caused COVID-19, escaped from the Wuhan Institute of Virology (WIV).\nThe claim was disrespectful to common sense, and goes against science, Zeng told a news conference on the COVID-19 origin-tracing work, which was held by China’s State Council Information Office.\nYuan Zhiming, director of the National Biosafety Laboratory at the WIV, said that his lab, which studies class four pathogens and boasts highest biosafety rating."
  },
  {
    "headline": "Electronic Transmission of election results: Why I was absent at voting – Ekwunife",
    "summarized_story": "By Vincent UjumaduTHE senator representing Anambra Central in the nation’s upper legislature, Senator Uche Ekwunife has given reasons for her absence during the voting for electronic results transmission.\nThe senator said she is fully in support of electronic transmission of election results, adding that her absence was because she had scheduled programmes in her constituency.\n“I have on many occasions, stated my support and stand for electronic transmission of results.\n“My stand has always been that electronic transmission of results should be mandatory in all polling units and collation centers across Nigeria without exceptions.\n“I stated that if ATM, POS, Internet banking and other electronic transactions are obtainable nationwide, I do not see why electronic transfer of election results cannot be equally achieved nationwide."
  },
  {
    "headline": "Court remands man for allegedly defiling minor",
    "summarized_story": "A Magistrates’ Court in Ikeja, Lagos, on Thursday ordered that a 19-year-old man, Emmanuel Sunday, who allegedly defiled a minor, be remanded in Kirikri Correctional Centre.\nThe police charged Sunday, who resides at Magbon in Badagry, Lagos State, is being tried for defilement.\nKubeinje, however, directed the police to send the case file to the state Director of Public Prosecutions (DPP) for advice.\nThe Prosecution Counsel, ASP Bisi Ogunleye, told the court that Sunday committed the offence on June 11 at his residence.\nThe offence, he said, contravened the provisions of Sections 137 of the Criminal Law of Lagos State, 2015."
  },
  {
    "headline": "Organised public demonstration: objecting to official policy is lawful",
    "summarized_story": "Against these historical antecedents, it is pertinent to review the Nigerian statutory regime on protests and peaceful assembly.\nArticle 21 of the ICCPR provides that: The right of peaceful assembly shall be recognized.\nNotwithstanding these, the Public Order Act, 1979 was promulgated to regulate assemblies in Nigeria.\nFortunately, the provision of the Public Order Act has received judicial interpretation in the case of Inspector General of Police v. All Nigeria Peoples Party & Ors.\nThe Court held, in the following words:The Public Order Act should be promulgated to complement sections 39 and 40 of the Constitution in context and not to stifle or cripple it."
  },
  {
    "headline": "Sunday Igboho: Shame on Igbo leaders – Adeyanju reacts as Ooni of Ife constitutes committee",
    "summarized_story": "Convener of Concerned Nigerian, Deji Adeyanju, has commended the Ooni of Ife, Oba Adeyeye Enita Ogunwusi, for the step taken on the arrest of Yoruba agitator, Sunday Adeyemo, also known as Sunday Igboho.\nThe Ooni of Ife had constituted a 28-man committee to brainstorm on the issues surrounding the arrest of Igboho.\nDAILY POST reported that the group is made up of eminent Yoruba leaders.\nSunday Igboho: Ooni of Ife constitutes committee, rallies Yoruba leadersIn a tweet, the activist maintained that self determination was not a crime.\nAccording to Adeyanju: “BREAKING: Ooni sets up committee on Igboho, rallies south-west leaders."
  },
  {
    "headline": "IPOB replies Reuben Abati on drug dealer allegedly sponsoring Nnamdi Kanu, Biafra",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Thursday declared that its activities are not sponsored by any individual or drug dealers.\nIPOB made the clarification in response to a comment credited to a former aide to President Goodluck Jonathan, Reuben Abati.\nBiafra is a divine mandate which Chukwu Okike Abiama designed and asked Nnamdi Kanu and IPOB members to actualise.\n“Ruben Abati linking IPOB with a drug dealer is a big insult to the great people of Biafra,” the statement added.\nJubrin of Sudan: Reuben Abati opens up on Buhari’s interview on Arise TV"
  },
  {
    "headline": "Ohanaeze demands soft landing for Nnamdi Kanu, urges IPOB followers to shun protests",
    "summarized_story": "Ohanaeze Ndigbo, the pan Igbo socio-cultural organization, has cautioned against the continued detention of the leader of the Indigeneous People of Biafra (IPOB), Nnamdi Kanu.\nOhanaeze Ndigbo further stressed that the deteriorating situation of things in the region and Nigeria at large, does not require blame games but togetherness and cooperation to surmount.\nAccording to the apex Igbo body, “They must forgive and close ranks, this is not the time for blame, accusations and counter-accusations.\n“As for Ohanaeze Ndigbo, we will continue to talk to his teeming supporters to shun any protest and give the South East Governors and other Igbo leaders the opportunity to negotiate his release with President Buhari”.\nIn the same vein, Catholic Bishops of Ibadan Ecclesiastical Province have accused President Muhammadu Buhari-led government of selective administration of justice."
  },
  {
    "headline": "Kano: Sheikh Abduljabbar hale, hearty in custody – NCoS debunks rumoured illness",
    "summarized_story": "The Nigeria Correctional Service, Kano Command, has described as false, malicious, and an attempt to create civil unrest reports in some sections of the media that the Kano-based controversial Sheik, Abduljabar Nasiru Kabara has been poisoned.\nA statement signed by the Spokesperson of the Service, DCP Musbahu K/Nasarawa, called on the general public to debunk and discountenance the falsehood rumors which is a figment of the imagination of the author and also an attempt to create civil disobedience in Kano.\n“Our attention has been drawn to a malicious and false report in public domain that Kano-based Islamic cleric, Sheikh Abduljabbar Nasiru Kabara, who is in our custody, is seriously ill“The service wishes to inform the public that the said Sheikh, as well as other inmates of custodial centres in the state are hale and hearty.\nThe Service prioritizes the medical and health welfare of all inmates,” he said.\nIslamic group reveals why Ganduje arrested Sheikh Kabara, demands his immediate release"
  },
  {
    "headline": "Why Obi Cubana will be placed on watchlist when travelling abroad – Adeyanju",
    "summarized_story": "Abuja-based activist, Deji Adeyanju, has hinted that billionaire businessman, Obinna Iyiegbu, popularly called Obi Cubana, may be placed on watch list whenever he travels abroad.\nAdeyanju disclosed that Obi Cubana would be watched as a “person of interest” whenever he travels abroad.\nHowever, Obi Cubana dismissed such insinuations, stressing that his friends are hard working businessmen.\nHowever, Adeyanju in a series of tweets, wrote: “If Obi Cubana had acted responsibly last week, he wouldn’t need all these explanations now.\nBut guy, I used to know you as a believer when you were broke.”Did your mother ever see bundle of naira notes in her lifetime – Reuben Abati asks Obi Cubana"
  },
  {
    "headline": "Sacked Winners’ Chapel Pastors ‘unfruitful, blatant failure’ – Oyedepo",
    "summarized_story": "By Samuel OamenFounder of The Living Faith Church International aka Winners’ Chapel Bishop David Oyedepo has broken his silence on the recent sack of over 40 pastors by the church.\nHe was reacting to allegation by one of the affected Pastors, Peter Godwin, that they were sacked for not generating enough income.\nSpeaking to the church on the matter, Oyedepo said the sacked pastors were “unfruitful and blatant failure.”ADVERTISEMENTHe said: “People are confused about our Ministry.\nI learnt some fellows said, “you know, they are not bringing income, that is why they asked them to go”.\nUnfruitful!"
  },
  {
    "headline": "Ex-BBNaija Gedoni, Khafi expecting first child",
    "summarized_story": "By Ekaete BasseyFormer housemates of the Big Brother Naija (BBNaija) reality TV show, Gedoni Ekpata and Khafi Ekpata are expecting their first child together.\nSharing beautiful photos via their Instagram pages, the reality TV stars showed and informed the world about their baby who will be arriving soon.\nKhafi noted most people have been anticipating her pregnancy for the past two years adding, she’s excited to intimate them that it has become a reality.\n#BabyKhadoni2021Meanwhile, the ecstatic father-to-be, Gedoni expressed joy while noting he is the happiest man alive seeing God is particularly intentional about all his affairs.\nHe wrote: “Slow Down Bump ahead.. I’m the happiest Man on this planet."
  },
  {
    "headline": "My encounter with EFCC, by actor",
    "summarized_story": "By Adeniyi AdewoyinActor and filmmaker Biodun Stephen has revealed a shocking encounter with the men of the Economic and Financial Crimes Commission (EFCC) recently.\nThe ‘IGE’ director explained how the law enforcement agency broke into her hotel room at 3am while she was deep asleep.\nThe next thing I open my eyes at a little past 3am.\nThey replied: we are EFCC.\n“Then I heard this is the new thing with EFCC."
  },
  {
    "headline": "Senate queries loss of N54b on external loans",
    "summarized_story": "By Sanni Onogu, AbujaThe Senate has called for the sanction of officials in the Office of the Accountant-General of the Federation, who made Nigeria lose $274.2million (N54.1billion) on external loans.\nThe Upper Chamber approved the report of the Senate Committee on Public Accounts before proceeding on annual vacation last week.\n“Also, the criteria for arriving at the exchange loss difference of $274.2 million (N54.1billion) was not disclosed.\nADVERTISEMENT“The Accountant-General of the Federation is (therefore) required to provide the source(s) of the exchange loss difference of $274.2 million (N54.1billion) with documentary evidence.\n“Provide the calculations showing how these figures were arrived at and the reasons for the exchange loss for each of the figures should be explained."
  },
  {
    "headline": "9 die, 16 injured on Lagos-Ibadan expressway accident",
    "summarized_story": "Federal Road Safety Corps (FRSC) in Ogun State has confirmed the death of nine people in an accident involving two vehicles on the Lagos-Ibadan expressway, yesterday.\nFRSC Sector Commander in the state, Ahmed Umar, said 16 other persons sustained varying degrees of injuries.\nThe sector commander further said the accident involved 25 persons, with nine killed and 16 injured.\nUmar said the cause of the accident could be traced to speed violation and overloading on the part of the commercial bus driver.\nHe said the commercial bus lost control due to excessive speeding and rammed into the truck."
  },
  {
    "headline": "Enemies of PDP working against the Ubas –Party scribe",
    "summarized_story": "He maintained that the party, with Sen. Ugochukwu Uba as governorship candidate, would win the election.\nUba has been the leader of PDP in Anambra for a long time, till intruders infiltrated the party and hijacked it.\n“Since Uba held sway as leader of the party, the party had been winning governorship elections.\n“It beats my imagination that people, in their right senses, would say that someone paid Chris Uba and Senator Ugochukwu Uba to destabilise PDP.\n“How much is somebody going to pay Senator Ugochukwu Uba to destroy his party?"
  },
  {
    "headline": "43 feared killed, 50 houses razed in renewed Benue attacks",
    "summarized_story": "From Rose Ejembi, MakurdiNo fewer than 43 people are feared killed, while about 50 houses were burnt in fresh attacks on some communities in Benue State in the last 48 hours.\nOn Tuesday, about 13 people, including a three-month-old baby, were killed in two separate attacks on communities of Guma Local Government Area of Benue State.\nConfirming the attacks on his council, Chairman of Guma LGA, Caleb Abs, said 13 people were killed in two separate attacks on Udei Branch and Torkula.\nIn a related development, several people are feared killed in a renewed communal crisis between Ochoro and Bonta communities of Konshisha Local Government Area of Benue State.\nAlso, our sources who did not want to be named, claimed that 50 houses were also burnt in the crisis."
  },
  {
    "headline": "NDLEA arrests lady for trafficking 296,000 tabs of illicit drugs",
    "summarized_story": "They were arrested for trying to smuggle a total of 296,000 tablets of Diazepam and Exol-5 from Onitsha, Anambra state, to Gombe state.\nThe statement noted that their vehicle coming from Onitsha, Anambra state, was intercepted along Makurdi – Alliade road, while heading to Gombe State via Makurdi.\nCuriously, the two interstate drug traffickers have rebuffed efforts to take pictures with the exhibits without wearing their hijab.\nReacting to the two seizures and arrests, Chairman/Chief Executive of the NDLEA, Brig.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "IPOB sacks Kanu’s successor in Radio Biafra",
    "summarized_story": "From Stanley Uzoaru, OwerriThere appears to be crisis in the management of Indigenous People of Biafra(IPOB)-owned Radio Biafra as the group which recently announced Simon Ekpa as Nnamdi Kanu’s successor in the broadcasting station has sacked him for failing to sign the code of conduct governing operation of the media platform.\n“Our leader Mazi Nnamdi Kanu gave the directive while in detention, but Mazi Simon Ekpa has refused to follow the principles.\nEkpa whom our leader gave an appointment and duty to start broadcasting on Radio Biafra doesn’t want to follow the laid down rules of operation in Radio Biafra.\nEkpa has refused to sign the rules of engagement and code of conduct guiding those broadcasting on Radio Biafra.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "EIU Report: FG May Raise VAT to 15% Before 2025",
    "summarized_story": "The report titled, “Country Report Nigeria,” stated that the anticipated increase in VAT was inevitable given the rising public debt burden and the likelihood that the Petroleum Industry Bill (PIB) might not be able to deliver considerable increase in government’s revenue.\nIt also stated that the predicted VAT increase would be implemented instalmentally in 2022, 2024 and 2025.\nThe report from the research arm of The Economist magazine explained: “We expect three equal VAT rate increases, taking the rate to 15 per cent by 2025.\nIt added that the percentage of public debt to the GDP would stand at 35.4 per cent of the GDP in 2025.\nWe expect public debt to reach only 35.4 per cent of the GDP in 2025,” the report added."
  },
  {
    "headline": "NNPC Records 63% FAAC Remittance Shortfall in Five Months",
    "summarized_story": "The documents obtained from one of the federal ministries showed that N387.982 billion remained unpaid during the period under consideration, representing about 63.21 per cent actual budgetary forecast.\nAccording to the NNPC/ FAAC data, while the corporation was expected to pay a net amount of N122.767 billion monthly into the federation account, it was only able to remit N90.860 billion in January, N64.161 billion in February and N41.184 billion in March.\nBut as it earlier announced, the national oil company was unable to make any payment into the federation account in April, while a paltry N29.647 billion was remitted in May.\nIn March, also, N224.589 billion was distributed, while in April and May, N156.366 billion and N320 billion were disbursed respectively.\nHe said the NNPC could no longer afford to bear the cost, saying Nigerians would have to pay the actual cost sooner or later."
  },
  {
    "headline": "Air Force Chief: Threats by Bandits Require Robust Security Architecture",
    "summarized_story": "*Hints personnel energised by survived pilot’s heroismKingsley NwezehThe Chief of Air Staff, Air Marshal Oladayo Amao, yesterday, said the present security challenges in the country required robust security architecture and a versatile air force capable of rapid air power deployment across the theatres of war.\nHe, however, said air force personnel were energised by the heroism of Flight Lieutenant Abayomi Dairo, who survived the air crash in Zamfara State by ejecting from the aircraft and wading through strongholds of bandits to safety.\nIn a chat with THISDAY, Spokesman of the Air Force, Air Commodore Edward Gabkwet, said the air force was aware of the lethal weapons wielded by bandits and insurgents, insisting that pilots were equipped for such eventualities.\nGabkwet maintained that Dairo’s heroism was a pointer to the determination of the air force chief to fight until the criminal elements were defeated.\nOthers were Chief of Air Intelligence, AVM Ibukun Ojeyemi; Air Officer Commanding Tactical Air Command, AVM Gamsu Lubo and Ag."
  },
  {
    "headline": "Igboho’s Supporters Protest in Ibadan",
    "summarized_story": "*Afenifere condemns arrest of Igboho in Benin Republic, as Yoruba nation agitators throng Cotonou courtBy Kemi OlaitanSupporters of Yoruba activist, Chief Sunday Adeyemo (aka Sunday Igboho) Wednesday took to the streets of Ibadan, the Oyo State capital, to protest his arrest and detention by the Beninise authorities.\nAlso, on Wednesday, Yoruba nation agitators gathered at a court premises in Cotonou, where Igboho was billed to appear for his extradiction hearing, to demand his release.\nThe protesters gathered in front of his house in the Sooka area of Ibadan from where they took to the streets, singing the Yourba Nation anthem and chanting “Igboho Oosa”, “Free Igboho now now”.\nThe protesters also displayed placards such as: “I stand with Chief Sunday Igboho”; “Sunday Igboho is not a criminal”; “Yoruba wake up” and “Sunday Igboho is fighting for our freedom”.\n“It is hoped that government will direct more attention to addressing issues that gave birth to ethnic agitations."
  },
  {
    "headline": "Gunmen Kill 13 in Benue Communities",
    "summarized_story": "By George OkohGunmen on Tuesday attacked Torkula and Udei villages in Guma Local Government Area of Benue State killing 13 persons.\nThe attacks came days after two aid workers were killed by suspected herdsmen in Guma village.\nConfirming the attacks, the Chairman of Guma Local Government Area, Caleb Aba, said 13 persons were killed in the two separate attacks on Udei and Torkula communities.\n“It is true that there was an attack yesterday.\n“At about 10 pm yesterday, there was another attack at Branch Ude where about eight people were killed, totalling about 13 people."
  },
  {
    "headline": "Kaduna University Prepares Letter For Students To Waive Rights To Protest Against School Fees Hike",
    "summarized_story": "Kaduna State University has released a letter of undertaking to compel students from protesting against any increment of school fees.\nHowever, the letter also makes the parents pledge that their \"son/daughter/ward should be expelled without warning if he/she engages in any demonstration/protest against the increment in tuition fees or any contrary activities of the university's rules and regulation\".\nStudents of Kaduna State University on Tuesday, June 1st took to the streets to protest the hike in tuition by the state government.\nAlso for social sciences, indigenes will pay N170,000, non-indigenes will pay N200,000.\nIndigenes admitted to study medicine will pay N300,000 while non-indigenes will pay N400,000."
  },
  {
    "headline": "Kaduna University Prepares Letter For Students To Waive Rights To Protest Against School Fees Hike",
    "summarized_story": "Kaduna State University has released a letter of undertaking to compel students from protesting against any increment of school fees.\nHowever, the letter also makes the parents pledge that their \"son/daughter/ward should be expelled without warning if he/she engages in any demonstration/protest against the increment in tuition fees or any contrary activities of the university's rules and regulation\".\nStudents of Kaduna State University on Tuesday, June 1st took to the streets to protest the hike in tuition by the state government.\nAlso for social sciences, indigenes will pay N170,000, non-indigenes will pay N200,000.\nIndigenes admitted to study medicine will pay N300,000 while non-indigenes will pay N400,000."
  },
  {
    "headline": "Ondo Varsity Lecturers Sell Students Expensive Handouts For Marks To Survive Nonpayment Of Salaries",
    "summarized_story": "Some students of the Adekunle Ajasin University, Akungba-Akoko, Ondo State, have cried out over the unending expensive handouts they are forced to buy from lecturers every semester.\nSaharaReporters learnt that buying of handouts attracts good marks in some of the courses so students, therefore, pay through their nose to obtain them.\nOnce you get one, the man promised to give you 15 marks,” the course representative told the students.\nBut things have gone upside down in Ondo State; workers are owed salaries, pensions are not forthcoming.\nThe university is handicapped; it is when salaries are regular that you can maintain standards and give rules to your lecturers."
  },
  {
    "headline": "Ondo Varsity Lecturers Sell Students Expensive Handouts For Marks To Survive Nonpayment Of Salaries",
    "summarized_story": "Some students of the Adekunle Ajasin University, Akungba-Akoko, Ondo State, have cried out over the unending expensive handouts they are forced to buy from lecturers every semester.\nSaharaReporters learnt that buying of handouts attracts good marks in some of the courses so students, therefore, pay through their nose to obtain them.\nOnce you get one, the man promised to give you 15 marks,” the course representative told the students.\nBut things have gone upside down in Ondo State; workers are owed salaries, pensions are not forthcoming.\nThe university is handicapped; it is when salaries are regular that you can maintain standards and give rules to your lecturers."
  },
  {
    "headline": "Graduate Under Probe For Exam Malpractice Not Yet Ordered To Rewrite Exams – UNIBEN",
    "summarized_story": "The spokesperson for the University of Benin, Benedicta Adeola Ehanire, has said there is no report yet from the panel set up to investigate a 400-level student, Peace Ufuoma, who is under probe for alleged exam malpractice.\nThe spotlight had been on Ufuoma after she wore a controversial shirt with the inscription “aggressive malpractice brought me this far” during her signing out parade.\nSpeaking with SaharaReporters, Ehanire debunked reports circulating online claiming the institution had asked Ufuoma, to rewrite her exams from 200 Level.\nThere had been reports on Wednesday that the student was asked to rewrite all her papers from her level two till the end of level four.\nShe said, “The current report online is fake."
  },
  {
    "headline": "Gunmen kill two police officers in Enugu",
    "summarized_story": "Two police officers have been reportedly killed by gunmen in Enugu state.\nAdvertisementNAN reports that two police checkpoints in Enugu south LGA and Amagunze in Nkanu east LGA were attacked on Wednesday evening.\nDaniel Ndukwe, spokesman of the Enugu police command, while confirming the incident, said details about the attacks were “sketchy”.\nChimezie Okoh, another witness, said a civilian was hit by a stray bullet.\n“However, I saw a policeman whose head had been shattered with bullets and another policeman lying lifeless."
  },
  {
    "headline": "Gunmen kill two police officers in Enugu",
    "summarized_story": "Two police officers have been reportedly killed by gunmen in Enugu state.\nAdvertisementNAN reports that two police checkpoints in Enugu south LGA and Amagunze in Nkanu east LGA were attacked on Wednesday evening.\nDaniel Ndukwe, spokesman of the Enugu police command, while confirming the incident, said details about the attacks were “sketchy”.\nChimezie Okoh, another witness, said a civilian was hit by a stray bullet.\n“However, I saw a policeman whose head had been shattered with bullets and another policeman lying lifeless."
  },
  {
    "headline": "Makinde: Security agencies must inform Oyo before any operation in the state",
    "summarized_story": "AdvertisementThe raid led to the death of the commandant of the Oyo State Security Network Agency, codenamed Amotekun, in the area and two other persons.\nLocal security forces repelled the night invasion, claiming that they thought the assailants were herdsmen.\nAdvertisementMakinde said federal security operatives must henceforth inform states before carrying out any covert operation to forestall deaths, and injuries to residents of the state.\nHe said if the state was informed of the NCS operation, it would have made necessary effort to ensure a smooth operation for the federal forces.\n“In the Constitution of Nigeria, Oyo State is a federating unit."
  },
  {
    "headline": "Makinde: Security agencies must inform Oyo before any operation in the state",
    "summarized_story": "AdvertisementThe raid led to the death of the commandant of the Oyo State Security Network Agency, codenamed Amotekun, in the area and two other persons.\nLocal security forces repelled the night invasion, claiming that they thought the assailants were herdsmen.\nAdvertisementMakinde said federal security operatives must henceforth inform states before carrying out any covert operation to forestall deaths, and injuries to residents of the state.\nHe said if the state was informed of the NCS operation, it would have made necessary effort to ensure a smooth operation for the federal forces.\n“In the Constitution of Nigeria, Oyo State is a federating unit."
  },
  {
    "headline": "'Scores killed', properties destroyed as gunmen attack Benue communities",
    "summarized_story": "Multiples attacks by gunmen in Benue communities have reportedly claimed several lives, and property destroyed.\nAdvertisementOn Tuesday, about 13 people were said to have been killed when gunmen attacked some communities in Guma LGA.\nThe same day, the Udei Branch community was reportedly attacked in the night by gunmen and about eight people killed.\n“At about 10pm, yesterday, there was another attack at Branch Ude where about eight people were killed, totalling about 13 people, only yesterday.\nSeveral other residents too were reportedly killed, while about 13 children were recorded missing."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "The Next Wave: What’s happening in francophone Africa?",
    "summarized_story": "Unique and untappedFrancophone Africa is home to an island country where many African startups register their headquarters.\nBetween 2015 and 2019, startups and SMEs in francophone Africa received $417.9 million, according to Briter Bridges, a research firm.\nGozem, a ride-hailing company which also offers ecommerce services, launched in Gabon, its third francophone country, this year with eyes on Cameroon and Dr Congo.\nFrancophone Africa is dogged by lack of clarity around regulations, language barriers and limited networking opportunities, per Briter Bridges report.\nThese concerns will take some time to quell, so maybe unicorn bells won’t ring in francophone Africa anytime soon."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "After its seed round of $350,000 and $150,000 cheque from Y Combinator as part of the accelerator’s Summer 2020 batch,..."
  },
  {
    "headline": "Google x Maliyo Games, Instagram and YouTube’s new features, and Clubhouse leaves beta",
    "summarized_story": "Mobile gaming: Per Business Wire, the mobile gaming market was worth $98 billion globally in 2020 and is expected to grow to $272 billion by 2030.\nAccording to Kevuru games, 59.9% of games were played on mobile in 2020, while 28.70% and 16.11% were played on PC and console, respectively.\nOn July 20, 2021, the company announced in a blog post that it was launching Sensitive Content Control.\nAccording to Instagram, sensitive content isn’t content that breaks the rules but could upset some users.\nOn July 20, 2021, YouTube announced it is rolling out a beta version of its new feature, Super Thanks."
  },
  {
    "headline": "Google partners Maliyo Games to train 500 African mobile game developers",
    "summarized_story": "Share this article:As Google’s interest in Africa’s tech talent pool deepens, the tech giant has partnered with Nigerian-founded game development studio, Maliyo Games, to open applications for a mobile game developer training program.\nAccording to the founder, this is one of the qualities that attracted Google to the project, aside from the fact that Maliyo Games has published some Africa-themed games on the Google Play Store.\nIn addition to that, Google will also provide support for app store success, which includes successful publishing of content on Google Play Store.\nMaliyo Games’ fitAs is typical of content from many indigenous companies, Maliyo Games studio ensures that its content reflects the African scene.\nIn his opinion, in the past 9 years of running Maliyo Games, opportunities that exist now are thinning out the effects of these challenges."
  },
  {
    "headline": "Nigeria’s Startup Bill, Kenya’s Zoom tax, Zimbabwe’s securities law",
    "summarized_story": "Share this article:Good day,What’s on the menu:Updates on Nigeria’s Startup BillKenya’s Zoom taxZimbabwe’s securities lawThe latest on Nigeria’s Startup BillIn May, we brought you news about a Startup Bill for Nigeria.\nSince the 90s, when the first tech companies were founded, Nigeria’s tech ecosystem has progressed.\nEvents like this have made it important for founders to interact with the government, hence, the Startup Bill.\nShould plans for the bill go as planned, it could unlock a lot of value for Nigeria’s tech ecosystem.\nKenyans to pay VAT for using Zoom<em>Photo Credit: <a href=”https://www.linkedin.com/in/morgan-mbabazi-001a331a/” target=”_blank” rel=”noopener”>Morgan Mbabazi</a> (National Media Group).</em>Starting August 2021, Kenyans will begin paying Value Added Tax (VAT) for using video conferencing platform, Zoom."
  },
  {
    "headline": "Why Serena Williams picked interest in Esusu",
    "summarized_story": "In pre-Independent Nigeria, esusu was a system that allowed groups of people within a society, particularly in Yorubaland, to contribute to informal savings and credit associations for their mutual benefit.\nEsusu has since evolved to incorporate different forms and it’s now propelled by digitalisation.\nIt has also crossed borders to gain acceptability across other parts…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Residential real estate in Ghana offers investors more opportunities, here’s why",
    "summarized_story": "Like Nigeria, the residential real estate submarket in Ghana is upbeat, commanding significant demand, especially for well-built low-rise buildings.\nIt offers investors more opportunities with sustained tenancies and rents than other segments.\nLike Nigeria too, the submarket has continued on its growth path evidenced in the continuous supply of new residential units and moderation in…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Promises won’t help Nigeria meet global science speed",
    "summarized_story": "While giving a speech at the 2021 Technology and Innovation EXPO in March 2021, Yemi Osinbajo, vice president of Nigeria, promised that the government would allocate 0.5 percent of the country’s GDP to science research and innovation.\nShould that happen, Nigeria would be a little halfway to meeting the global average spends on research and…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Shaibu hails Edo Beads as state’s basketball team qualifies for national league after 23 years – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Deputy Governor, Rt.\nPhilip Shaibu, has congratulated the state’s basketball team, the Edo Beads, for the team’s qualification for the National Premier League after 23 years.\nShaibu, who received the team led by its coach, Victor Umoru, at the Government House in Benin City, saluted the Edo Beads for making the state proud.\nThe Deputy Governor further reassured the commitment of the state government towards the development of sports, noting that the state is determined to reclaim its lost glory in sports in the country.\nNarrating the team’s success story, the coach noted that for the past 23 years the basketball team has not been in any of the national leagues."
  },
  {
    "headline": "Eid-El-Kabir: Edo govt hails residents on peaceful celebration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commended residents, especially Muslims, on the peaceful Eid-El-Kabir celebration across the state.\nChief of Staff to Edo State Governor, Hon.\nOsaigbovo Iyoha, said the peaceful celebration of Eid-El-Kabir across the state reaffirms the peaceful disposition of Edo people, noting that Governor Godwin Obaseki-led administration will continue to implement policies that foster religious harmony among members of different religious groups.\nHe noted that Muslims in Edo State constitute major stakeholders for sustainable peace and progress in their different endeavours, adding, “Muslims in Edo State have always upheld the import of the Prophet’s teachings.\nIyoha expressed appreciation to Muslims for supporting the Obaseki-led administration MEGA agenda, adding, “The spirit of the Eid-El-Kabir celebration should guide us to live in peace and accommodate one another in building strong coalitions that will entrench development and progress in our state.”..."
  },
  {
    "headline": "Mischief makers pass off 2015 A’Ibom PDP Pry election video as Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe desperation of detractors of Edo State Governor, Mr. Godwin Obaseki, is manifest, yet again, with the circulation of an old video of a primary election in Akwa Ibom State and mischievously captioning and passing it off as an altercation involving the governor.\nIt must be stated that the intent of the purveyors of the video is patently malicious as it is obvious that the man who is wrongly identified as Governor Obaseki in the said video bears no resemblance with the governor.\nFindings have revealed that the video captured two prominent members of the Peoples Democratic Party (PDP) in a hot exchange at the Godswill Akpabio Stadium during the PDP Primary Election in 2015.\nThis development once again points to the grave consequences of fake news and alternative facts, which mischief makers exploit to cause misinformation and public apathy.\nOsaigbovo IyohaChief of Staff to Edo State Governor..."
  },
  {
    "headline": "2023: APC to pick consensus presidential candidate – Scribe – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The All Progressives Congress (APC) has said that at the appropriate time it will come up with a consensus and agreeable presidential candidate that will fly its flag in 2023.\nSen. John Akpanudoehede, National Secretary, APC Caretaker and Extra-ordinary Convention Planning Committee (CECPC), stated this in a statement issued on Tuesday in Abuja.\nThe statement was in reaction to the Peoples Democratic Party (PDP) recent allegation that President Muhammadu Buhari had a self-succession plan.\nThe APC scribe, however, stressed that the party would not allow individual ambitions to derail the Buhari administration, ahead of the 2023 presidential poll.\nHe said unlike the opposition PDP, the APC was a disciplined party, noting that the former was just been haunted by its past."
  },
  {
    "headline": "Terrorism: Nigerian editors decry govt’s attempt to gag media",
    "summarized_story": "The Nigerian Guild of Editors (NGE) has rejected insinuations by the National Broadcasting Commission (NBC) that journalists by their reporting encourage terrorism.\n‘’We hope it is not a ploy by the NBC to ban newspaper review in broadcasting stations.\nNigerian Guild of Editors (NGE) said that Nigerian journalists, especially its members, are not terrorists and bandits’ best friends, against the terrific insinuation by the National Broadcasting Commission (NBC), and so, will never be disposed to giving the bloodthirsty criminals any exposure.\n‘’Its single purpose is to protect the capability of institutions, including the media, to guarantee citizens the free exercise of their fundamental human rights, without discrimination.\nSigned:For: Nigerian Guild of EditorsMustapha IsahPresidentIyobosa UwugiarenGeneral Secretary"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Going hard on Kanu, Igboho will provoke their followers to carry bombs – Akinterinwa warns",
    "summarized_story": "Akinterinwa who spoke in an interview with PUNCH, emphasized that violence is not the solution to their agitations, but dialogue.\nI think it is Shakespeare that said in Macbeth that there is no art of finding the human construction from the face.\nThe terrorists fighting on the battlefield are different from the terrorists that are funding them or that are outside.\n“Arrest all of them, extradite all of them but that won’t stop the agitation for Yoruba Republic and it won’t stop agitation for Biafra Republic.\nBiafra Republic came into being as far back as 1962; it was discussed in their palace."
  },
  {
    "headline": "Zamfara, Kebbi, Niger worst hit as gunmen kill 1,031 abduct 390 in one month – Report",
    "summarized_story": "According to report, Zamfara, Kebbi, and Niger were worst hit as a total of 275 persons were killed in Zamfara State, 93 in Kebbi State, and 91 in Niger State during the month under review.\nThe report titled: “Nigeria Security Report” obtained recorded various cases of insecurity in June; from armed attacks, armed clashes, mob violence, social disruptions, to other violent crimes.\nKaduna State recorded 26 deaths with 157 abductions, while Katsina State recorded six deaths with three abductions.\nSokoto State had 15 fatalities with zero abduction, Kano and Jigawa states recorded one death each with no abductions.\nKwara State recorded 11 deaths with no abduction, while Kogi and the Federal Capital Territory (FCT) recorded three deaths and 10 abductions respectively."
  },
  {
    "headline": "Nigerian editors reject media bills seeking to gag media",
    "summarized_story": "Nigerian Guild of Editors (NGE), the umbrella union of all editors in Nigeria, has has kicked against what it called “draconian” attempts to gag the media, noting that the media industry is not a political opponent or enemy of the Federal Government.\n“While we are not opposed to an Act that will promote media stakeholders-driven regulatory council, the many draconian provisions in the Odebunmi Olusegun-sponsored Bills are actually aimed at criminalising media practice in Nigeria.\nWhile the intention of the sponsor of the bills is suspicious, the Bills negate all known features of media regulatory bodies in the world,” the NGE said.\nThe guild alluded to the NPC Act, CAP N128, Laws of the Federation of Nigeria 1992, created by the military dictatorship.\nThe NGE added that the two Bills, if passed, would compound the nation’s negative image in the global community."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "APC Group Commends Buahri’s Feat In Aviation Sector",
    "summarized_story": "The ongoing plans by the federal government to concession the four major international airports in the country is a major step by the President Muhammadu Buhari-led administration to enhance the development of the country’s aviation sector.\nA think-tank of the All Progressives Congress (APC) under the aegies of APC Legacy Awareness and Campaign made the remark in its assessment of the aviation sector under the present administration.\nBrand new Runways have been constructed at the Abuja and Enugu International Airports, in 2017 and 2020, respectively.\nAnother 3 Nigerian Airports have been scheduled to benefit this year.\n“A significant portion of the investment into the Aviation Sector has been focused on resolving issues and bridging gaps inherited from previous Administrations."
  },
  {
    "headline": "APC Group Commends Buahri’s Feat In Aviation Sector",
    "summarized_story": "The ongoing plans by the federal government to concession the four major international airports in the country is a major step by the President Muhammadu Buhari-led administration to enhance the development of the country’s aviation sector.\nA think-tank of the All Progressives Congress (APC) under the aegies of APC Legacy Awareness and Campaign made the remark in its assessment of the aviation sector under the present administration.\nBrand new Runways have been constructed at the Abuja and Enugu International Airports, in 2017 and 2020, respectively.\nAnother 3 Nigerian Airports have been scheduled to benefit this year.\n“A significant portion of the investment into the Aviation Sector has been focused on resolving issues and bridging gaps inherited from previous Administrations."
  },
  {
    "headline": "EbubeAgu Arrests, Hands Over 11 Suspected Criminals To Police",
    "summarized_story": "The Ebonyi State chapter of the EbubeAgu security outfit yesterday handed over 11 suspected criminals arrested by the outfit at different locations of the state to the state police command.\nHe said the 11 suspects who were handed over to the police in two batches were in compliance with the provisions of the law backing the EbubeAgu security outfit in the state.\nAccording to him, “The suspects were arrested at different locations in the state for stealing, burglary and other crimes.\nADVERTISEMENT“The EbubeAgu Security Outfit since it was set up has helped in complementing the efforts of other security agencies in ridding the state of criminals.\nHe warned criminal elements in the state to turn from their criminal activities adding that the EbubeAgu security outfit would fish out all criminals in the state."
  },
  {
    "headline": "EbubeAgu Arrests, Hands Over 11 Suspected Criminals To Police",
    "summarized_story": "The Ebonyi State chapter of the EbubeAgu security outfit yesterday handed over 11 suspected criminals arrested by the outfit at different locations of the state to the state police command.\nHe said the 11 suspects who were handed over to the police in two batches were in compliance with the provisions of the law backing the EbubeAgu security outfit in the state.\nAccording to him, “The suspects were arrested at different locations in the state for stealing, burglary and other crimes.\nADVERTISEMENT“The EbubeAgu Security Outfit since it was set up has helped in complementing the efforts of other security agencies in ridding the state of criminals.\nHe warned criminal elements in the state to turn from their criminal activities adding that the EbubeAgu security outfit would fish out all criminals in the state."
  },
  {
    "headline": "Police Arrest Motorcycle Thieves In Delta",
    "summarized_story": "Delta State Police Command has apprehended two persons who specialised in snatching motorcycles from their owners.\n“He (Boytie Samnuel) later led police operatives to Koko Junction, where two unregistered motorcycles, one big Elema Generator, Nissan Primera with Reg.\nBEN 564 LT, all suspected stolen, were recovered and another suspect, one Vero Amughoro ‘female’ 47yrs of Koko Junction was also arrested”, he said.\nMeanwhile, a yet to be identified vulcaniser has lost his life while pumping a trailer tyre in his workshop in Warri, Delta State.\nADVERTISEMENTAccording to the report, the vulcaniser was pumping a trailer tyre when an iron from the rim of the tyre pulled off and hit him on the head which immediately killed him."
  },
  {
    "headline": "Passengers Protest As Air Peace Delays Flight For Over 12-hour",
    "summarized_story": "Scores of Nigerians on Thursday night protested the delay of their flight by Air Peace at the Murtala Muhammad Local Airport in Lagos.\nThe passengers lamented that their flight was postponed without prior notice by the airline from 8am till 8pm.\n“Delay for two hours and beyond, the carrier shall reimburse passengers the full volume of their tickets.\nFor delays between 10pm and 4am, the carrier shall provide hotel accommodation, refreshment, meal, two free calls, SMS, email, and transport to-and-fro airport,” the Minister of Aviation, Hadi Sirika had said.\nAlso, 562 flights were delayed out of the 1,871 international flights operated out of the country."
  },
  {
    "headline": "Passengers Protest As Air Peace Delays Flight For Over 12-hour",
    "summarized_story": "Scores of Nigerians on Thursday night protested the delay of their flight by Air Peace at the Murtala Muhammad Local Airport in Lagos.\nThe passengers lamented that their flight was postponed without prior notice by the airline from 8am till 8pm.\n“Delay for two hours and beyond, the carrier shall reimburse passengers the full volume of their tickets.\nFor delays between 10pm and 4am, the carrier shall provide hotel accommodation, refreshment, meal, two free calls, SMS, email, and transport to-and-fro airport,” the Minister of Aviation, Hadi Sirika had said.\nAlso, 562 flights were delayed out of the 1,871 international flights operated out of the country."
  },
  {
    "headline": "Senate to Accountant General: Sanction officers involved in $274.2m external loan losses",
    "summarized_story": "The Senate has asked the Accountant General of the Federation, Ahmed Idris, to identify and sanction his officers who were allegedly responsible for the $274.2m (N54.1bn) which Nigeria lost on external loans transaction.\nThe red chamber took the decision while considering the report of the Senate Public Accounts Committee presented by the panel’s chairman, Senator Mathew Urhoghide.\n“Also, the criteria for arriving at the exchange loss difference of $274.2m was not disclosed.\n“The Accountant-General of the Federation is by this, required to provide the source (s) of the exchange loss difference of $274.2m (N54.1bn) with documentary evidence.\n“He should disclose the source of exchange difference in a note.”The Senate in its resolution upheld the recommendation of the SPAC by insisting that officials involved must be sanctioned."
  },
  {
    "headline": "Senate to Accountant General: Sanction officers involved in $274.2m external loan losses",
    "summarized_story": "The Senate has asked the Accountant General of the Federation, Ahmed Idris, to identify and sanction his officers who were allegedly responsible for the $274.2m (N54.1bn) which Nigeria lost on external loans transaction.\nThe red chamber took the decision while considering the report of the Senate Public Accounts Committee presented by the panel’s chairman, Senator Mathew Urhoghide.\n“Also, the criteria for arriving at the exchange loss difference of $274.2m was not disclosed.\n“The Accountant-General of the Federation is by this, required to provide the source (s) of the exchange loss difference of $274.2m (N54.1bn) with documentary evidence.\n“He should disclose the source of exchange difference in a note.”The Senate in its resolution upheld the recommendation of the SPAC by insisting that officials involved must be sanctioned."
  },
  {
    "headline": "Bishop Oyedepo: Why I sacked 40 pastors",
    "summarized_story": "By Muhaimin OlowoporokuFounder of Living Faith Church Worldwide, Bishop David Oyedepo has explained and justified the sacking of 40 pastors by his church.\nThe cleric on Wednesday while addressing his congregation rubbished reports that he sacked the pastors because they did not generate enough income into their branches.\nHe said the pastors were sacked because they were unfruitful.\nBishop Oyedepo faulted why social media was quiet when the church employed 7000 pastors at once.\nBishop Oyedepo said the church has never lacked money and yet the church has never prayed for it."
  },
  {
    "headline": "Tottenham unveil new Nike away kit for next season",
    "summarized_story": "Tottenham Hotspur have unveiled their all-new Nike away kit which will be worn for the 2021/22 season.\nThe London club revealed that the new kit was designed to celebrate the centenary of the inclusion of the famous cockerel on the Spurs shirt.\nTottenham shirt has a dark base with the shirt looking like an artist’s canvas.\nThe club crest, Nike Swoosh and all sponsor logos are ‘venom green’, while both the shorts and the socks are a simple black.\nThat’s an important part of this kit for Spurs, who were named as the Premier League’s greenest club this year for their ongoing work to protect the environment."
  },
  {
    "headline": "COVID-19 cases in Lagos jump again",
    "summarized_story": "COVID-19 cases in Lagos have jumped again, the Nigeria Centre for Disease Control (NCDC) said as it announced 238 new infections.\nThe figure was an escalation of some sort as 203 cases were announced a day earlier.\nFive states accounted for the 238 cases, with Lagos logging the lion share of 181.\nWednesday’s report included zero cases from Rivers, Osun, Ondo, Sokoto, Kaduna, Kano, and Nasarawa States.\nNigeria’s confirmed COVID-19 cases stood at 170,122 as of July 21."
  },
  {
    "headline": "Nigeria’s Attorney-General, Malami Accuses Nnamdi Kanu Of Killing Fulani Herders",
    "summarized_story": "The Nigerian government has reduced the number of charges filed against Nnamdi Kanu, the leader of the secessionist group Indigenous People of Biafra, IPOB, with the legal supervision of Attorney General of the Federation Abubakar Malami (SAN).\nAs the ongoing trial has taken a different path, Malami remarked that the court would be hearing instances including murder, terrorism, banditry, and criminality.\nThe Attorney General in a statement on Wednesday, accused Kanu of committing heinous crimes including the alleged killing of Fulani cattle rearers, Force personnel, amongst others.\nHe described the Fulani herdsmen as innocent and only catering for their cattle.\nAlso, no branded IPOB T-shirt or caps will be allowed within the court area."
  },
  {
    "headline": "Nnamdi Kanu, Bandits: El-Rufai Has Failed, Should Be Forced To Resign – HURIWA Boss",
    "summarized_story": "Governor Nasir El-Rufai of Kaduna State should have been compelled to retire, according to Comrade Emmanuel Onwubiko, National Coordinator, Human Rights Writers Association of Nigeria, HURIWA.\nIn an interview with DAILY POST, the HURIWA head questioned how El-Rufai can explain the atrocious crimes of terrorist groups in the North, such as the bandits, by claiming that they are not the same as the Indigenous People of Biafra, IPOB.\nEl-Rufai had, while giving his opinion on how Boko Haram insurgents and bandits are different from IPOB and their leader, Nnamdi Kanu, said that Boko Haram and bandits do not have a recognised and centralised leadership.\nHe said Kanu is a visible and central leader who has called for the dissolution of Nigeria.\nAnd Onwubiko noted that these bandits and other terrorist organisations in the North are threatening the territorial integrity; threatening the country’s peace and undermining national security."
  },
  {
    "headline": "President Buhari To ‘Secretly’ Visit United Kingdom",
    "summarized_story": "President Muhammadu Buhari is expected to leave Nigeria on Friday or Saturday for a four-day visit to the United Kingdom, according to NEWS DIRECT.\nAccording to a presidential source, the trip is being kept under wraps to avert a riot or any “embarrassing protest” in London against Nigerian President Muhammadu Buhari."
  },
  {
    "headline": "We Have No Patience With Failure – Bishop Oyedepo Justfies Sack Of Pastors",
    "summarized_story": "According to NEWS DIRECT, a Winners Pastor named Peter Godwin said that he and 40 other pastors were fired for underperformance.\nReacting, on Wednesday, Oyedepo said the only criteria for their sack was how many souls had been won in the church..Oyedepo maintained that the pastors were sacked because they were unfruitful.\n”We have built more than 1,000 Churches in rural areas where in the next 30 years, they can never generate such fund, with each costing more than 14 Million Naira.\n”Well, you don’t need so much Mathematics to know a thousand buildings; that is not 1000 Naira each, that is not 10 Million (Naira) each, that is not 12 Million (Naira) each, that is not 14 Million (Naira) each.\nSome are 35 Million (Naira)."
  },
  {
    "headline": "Revealed! Face of angry Nigerian who lashed FG, threatened Super Falcons in Austria (VIDEO)",
    "summarized_story": "The face of a Nigerian who boarded same train with Super Falcons in Vienna, Austria has been revealed.\nThough his name is yet to be ascertained, this young man who claimed to have played for a privately-owned club Julius Berger in Nigeria rained all manner of abuses on Muhammadu Buhari-led federal government and the country’s senior national women team Super Falcons.\nPlease listen to this video clip."
  },
  {
    "headline": "Igboho’s arrest: Don’t grant extradition order to FG, counsel tells Benin Republic",
    "summarized_story": "There are concerns over the arrest of popular Yoruba activist, Mr. Sunday Igboho at an airport in Cotonou, Benin Republic Monday night while attempting to flee to Germany.\nThe Cotonou arrestBut with his arrest, prominent Yoruba leaders and Afenifere, the Yoruba socio-cultural group, have cautioned the federal government on the handling of the situation.\nIgboho, Blueprint gathered from multiple sources, Tuesday, was in possession of a Benin Republic passport at the time of his arrest.\n“The Extradition Treaty of 1984 between Togo Nigeria, Ghana and Republic of Benin excluded political fugitives.\n“This made Chief Sunday Adeyemo a POLITICAL OFFENDER who cannot be deported and/or extradited by the good people of the Republic of Benin for any reason."
  },
  {
    "headline": "I feel strongly about NYSC, Gowon’s policy – Buhari",
    "summarized_story": "He spoke when he received in audience corps members serving in his Daura country home in Katsina state, who paid him Sallah homage.\nPresident Buhari urged the youth corps members to make the most of the opportunity of travelling around the country, especially in understanding different climates, cultures, languages and views on life.\nPresident Buhari said the NYSC scheme was well thought-out to unite the country through understanding.\n“I feel very strongly about the NYSC and I am wishing you all the very best.\nPresident Buhari gave the corps members two cows from his farm, 20 bags of rice and N1, 000,000 (one million naira)."
  },
  {
    "headline": "Action Alliance urges FG to improve on security, economy, power -NigPilot",
    "summarized_story": "Action Alliance, AA, has urged the federal government to tackle insecurity, improve the economy and power so as to move the country forward.\n“Inflation has done beyond an acceptable level, the current administration should direct efforts towards ensuring a vibrant economy.\nWe urge the current government to find solutions to Nigeria’s power supply challenges,” he said.\nOn the Independent National Electoral Commission INEC, Omo-Aje commended its Chairman, Prof. Mahmood Yakubu for the electoral reforms initiated.\nBy doing so, they give the electorate more reasons to have confidence in the electoral system,” Omo-Aje said."
  },
  {
    "headline": "Lawyers lament non-payment of judgment debts by FG -NigPilot",
    "summarized_story": "Attorneys involved in several litigations won against the federal government agencies over the years have cried out for payment of judgment debts incurred by the government.\nIn a statement issued by the Director of Legal Services, Centre for Civic Education , Barrister Agomuo Chimaobi on behalf of the lawyers, said the unpaid judgment debts are affecting them economically having used their personal resources to prosecute some of the cases on behalf of their clients.\nThe debts, according to them, are incurred by the federal government from judicial pronouncements to that effect from the High Courts to Appeal and Supreme Courts.\n“The debts are judgments which emanated from the Federal High court of Nigeria.\nThe Court of Appeal of Nigeria and the Supreme Court of Nigeria“These judgment debts are compiled at the office of the Honourable Attorney General of the Federation and the Minister of Justice."
  },
  {
    "headline": "Farouq Preaches peace at Eid-Elkabir -NigPilot",
    "summarized_story": "A statement, signed by the Special Adviser on Media to the minister, Nneka lkem Anibeze, Farouq called for prayers to unite the country and reduce humanitarian crises including internal displacement, refugees, hunger, killings, and terrorism.\nWhile felicitating with the Muslim faithful, she preached love for one another, sacrifice for the nation, peace, love, and kindness as advocated by the Prophet Muhammed“Let us continue to pray for the unity of the country especially the vulnerable among us.\nMay Allah grants us peace as we celebrate Eid and may we witness more celebrations as a united nation”, Umar Farouq said.\nThe Minister said a peaceful Nigeria will reduce the number of displaced and vulnerable people in the country.\n“If we spend less on IDPs and victims of communal clashes, cattle rustlings or banditry, the government can channel such funds to other capital projects.”She promised that the government will continue to do everything within its power to ensure a country that all Nigerians will be proud of."
  },
  {
    "headline": "FG flags off construction of Kaduna Kano segment of Lagos-Kano Railway -NigPilot",
    "summarized_story": "Federal Government has flagged off the construction of the Kaduna-Kano segment of the Lagos-Kano railway modernization project.\nHe said, “This project is crucial to the establishment of a supply chain in railway transport within its corridor, Kano – Kaduna – Abuja, as it links the major commercial cities of Kano and Kaduna to the Federal Capital Territory, Abuja”.\nHe said “The scope of the railway project involves a 203km double track standard gauge railway from Kano to Kaduna.\nThis railway line will present an opportunity for Nigerians to traverse between Abuja and Kano via Kaduna with relative ease”.\nThe Kaduna – Kano railway project is to link the Lagos – Ibadan Railway project via Abuja, Minna, Ilorin, Oshogbo, Ibadan to Lagos on one end, and Maradi, Niger Republic on the other."
  },
  {
    "headline": "Cholera Kills Three In Yobe, 30 Others In Jigawa",
    "summarized_story": "The outbreak of Cholera has claimed no fewer than three persons and two others hospitalised at Girgir Community in Jakusko Local Government Area of Yobe State.\nThis comes days after 30 persons were reported killed in Jigawa State following the outbreak of Cholera across nine local government areas of the state.\nThe Executive Secretary, Yobe State Primary Health Care Management Agency, Babagana Kundi Machina told Channels Television on Thursday that the index case in Yobe came from neighbouring state Jigawa.\nJakusko local government area in Yobe shares border with Jigawa and Bauchi states which have recently witnessed the outbreak.\nEarlier in May, at least 20 persons died in a cholera outbreak in Bauchi."
  },
  {
    "headline": "Nigeria Records Spike In COVID-19 Infections With Two Deaths, 238 New Cases",
    "summarized_story": "Nigeria has recorded a fresh spike of COVID-19 cases.\nThe Nigeria Centre for Disease Control (NCDC) in its report on Wednesday night disclosed that the country has recorded two deaths and 238 new cases.\nLagos State, which still remains the epicenter of the virus in Nigeria, recorded 181 new cases, while Akwa Ibom recorded 45, Oyo 8, and Ogun 2.\nThis now brings the total number of confirmed cases in the country to 170,122.\nThe day’s report includes 0 cases from Rivers, Osun, Ondo, Sokoto, Kaduna, Kano, and the Nasarawa StatesThe report also disclosed that the multi-sectoral national emergency operations center (EOC), activated at Level 2 and has continued to coordinate the national response activities."
  },
  {
    "headline": "Those Representing Nigerians Are Saboteurs – Catholic Bishops",
    "summarized_story": "Catholic Bishops in Nigeria of the Ibadan Ecclesiastical province have said that those representing Nigerians at the National Assembly are saboteurs.\nAccording to the bishops, the lawmakers have “perfected the art of sabotaging the progress” of the people they represent.\nThe Catholic clerics urged Federal Lawmakers to prioritise the interest of Nigerians above those of their political and selfish ambitions.\nThe clerics condemned the passage of the amended Electoral Act and the Petroleum Industry Bill (PIB) and urged Nigerians to challenge the Senate and the House of Representatives’ decisions.\nThey further urged Nigerians to register and obtain their voters’ cards, noting that this grants them the power to exercise their rights to determine who governs them from time to time."
  },
  {
    "headline": "Police Rescue Two Abducted Bethel Baptist School Students",
    "summarized_story": "Two of the abducted students of Bethel Baptist Secondary school in Chikun Local Government Area of Kaduna State have been rescued by police operatives.\nWhen contacted, the spokesman of the Kaduna state police command, Mohammed Jalige, told Channels Television that the two abducted students were have been taken to a police medical facility where they are currently undergoing medical examination.\n121 students of Bethel Baptist secondary school in Chikun local government area of Kaduna state were abducted from their hotels by bandits on July 8.\nLast week, the police rescued one of the students inside a forest, while two were rescued today, thereby bringing the number of those rescued to three.\nMeanwhile, the bandits are demanding the sum of N60m as a ransom for the release of the kidnapped students."
  },
  {
    "headline": "BOAZ Rebrands To Deliver Apex Of Service And Technology-Enabled Solutions",
    "summarized_story": "Boaz Integrated Energy (BOAZ) has rebranded and unveiled its new logo to re-position to offer cutting-edge services in the oil and gas industry.\nThe Company has completed its rebranding program in response to the new opportunities for technology-enabled solutions in the energy sector”, said Adeola Adebari, the Chief Executive Officer for BOAZ.\nBOAZ provides revolutionary solutions to production and reservoir management challenges for the oil and gas industry in partnership with technology companies such as Roke, Blue Spark, Jorin, and Data Science Nigeria.\nThese two elements symbolize our drive to offer the apex of service and technology within the energy industry which is in alignment with our corporate strategic intent.\nhttps://www.boazintegrated.com/technologiesAt the heart of the rebranding program is a renewal of the Company’s corporate vision and mission statements to emphasize its expanded focus on the energy industry."
  },
  {
    "headline": "Emir of Ilorin pays Sallah Homage to Kwara Governor",
    "summarized_story": "The Emir of Ilorin and Chairman, Kwara State Council of Chiefs, Ibrahim Sulugambari has paid traditional Sallah homage to the Governor, AbdulRahman AbdulRazaq at the government house, Ilorin.\nHe was accompanied by top officials of the emirate council."
  },
  {
    "headline": "Monkeypox: More than 200 contacts tracked in US for rare disease",
    "summarized_story": "More than 200 people in 27 different states in the United States are being monitored for possible cases of the rare monkeypox, according to health officials,Experts fear that people may have come into contact with a Texas man who brought the disease in from Nigeria earlier this month.\nThe man, who is believed to be the country’s first monkeypox case since 2003, was taken to the hospital but is in stable condition.\nPassengers on two of the man-made planes may have been exposed to the sickness, according to the Centers for Disease Control and Prevention (CDC).\nIt said it was working with the airlines to assess “potential risks to those who may have had close contact with the traveller”.\nBut the chances of the disease spreading on the plane were low because passengers had to wear face masks, it added."
  },
  {
    "headline": "Court to deliver judgment on dismissed pregnant Police officer October 5",
    "summarized_story": "The Federal High Court sitting in Ado-Ekiti has adjourned sitting till the 5th of October on the case brought by the Ekiti State Attorney-General, Against the Inspector-General of Police, and the Nigeria Police Force on thedismissed Pregnant Police Officer.\nAfter Series of Adjournments, the Federal Hight Court in Ado Ekiti is hearing the Matter ProperThe Defendant in a 4 Paragraph affidavit is asking the Court to Dismiss the Civil Suit because the Plaintiff Lacks the Jurisdiction on the matter, citing the Judgement in the Case of the Attorney-General of Cross River State versus the Federal Government on the case of Walter OnoghenHe also argued Further that the dismissed Police Constable has instituted a Legal Suit against the Force at the Industrial Court Akure, and hence this case will go against oath of non-multiplicity of actionThe Plaintiff, in a 7 Paragraph Counter Affidavit Supported by written address asks the Court to Discountenance the Defendants Position, Stating that the reference cited has no correlation with the case in courtAdvertisementThe Attorney-General Says it is Untrue that he Lacks the Constitutional right to defend the Dismissed Police Constable, addressing the misconception about the duties of the Attorney General.\nHe further stated that beyond the need for Justice is also the need to understand that this case Points to the Many Faults in the Nigerian Constitution and the Police Act which is being relied onThe Judge, Babs Kuewumi after hearing both Arguments, Adjourns Sitting till the 5th of October for Judgement"
  },
  {
    "headline": "Two Pfizer, AstraZeneca Doses Work Against Delta Variant: Study",
    "summarized_story": "Two doses of Pfizer or AstraZeneca’s COVID-19 vaccine are nearly as effective against the highly transmissible Delta coronavirus variant as they are against the previously dominant Alpha variant, according to a new study.\nWednesday’s study found that Pfizer was 88 percent effective at preventing symptomatic disease from the Delta variant with both doses, compared with 93.7 percent against the Alpha variant, broadly the same as previously reported.\n“Only modest differences in vaccine effectiveness were noted with the Delta variant as compared with the Alpha variant after the receipt of two vaccine doses,” Public Health England researchers wrote.\nIn June, makers of Russia’s Sputnik vaccine also said that it was about 90 percent effective against the highly contagious Delta variant.\nThe Sputnik vaccine, however, has raised some controversy as it was introduced to the public even before a full trial was completed."
  },
  {
    "headline": "Death Rates Soar in Southeast Asia as Virus Wave Spreads",
    "summarized_story": "Indonesia has converted nearly its entire oxygen production to medical use just to meet the demand from COVID-19 patients struggling to breathe.\nBut he lost his father and brother-in-law to the virus, and another brother remains on a ventilator in the ICU.\nWith India’s massive population of nearly 1.4 billion people, its total number of COVID-19 fatalities remains higher than the countries in Southeast Asia.\nBut India’s 7-day rolling average of COVID-19 deaths per million peaked at 3.04 in May, according to the online scientific publication Our World in Data, and continues to decline.\nOnly in recent weeks, as testing and reporting of COVID-19 cases has started recovering, has it become clear that a new wave of the virus beginning in mid-May is pushing cases and deaths rapidly higher."
  },
  {
    "headline": "South Africa Lets Jailed Former President Zuma Attend Brother’s Funeral",
    "summarized_story": "South Africa’s jailed former President Jacob Zuma has been granted compassionate leave for one day to attend the funeral of his younger brother, prison authorities said.\nHe has been jailed at Estcourt prison since handing himself over to authorities in the early hours of July 8.\nThe prison is close to his rural home at Nkandla in the Kwa-Zulu Natal province, where funeral proceedings for Zuma’s brother, Michael, are expected to be held on Thursday.\nZuma’s brother died aged 77 after a long illness, according to local media.\nThe unrest swept across Kwa-Zulu Natal and the country’s economic heartland province of Gauteng, killing 276 people and destroying hundreds of businesses."
  },
  {
    "headline": "Covid-19 Origins: China Rejects WHO Proposal to Return to Wuhan",
    "summarized_story": "In a closed-door meeting last week, WHO chief Tedros Adhanom Ghebreyesus proposed the second stage of the agency’s investigation into the origins of coronavirus should include further studies in China as well as laboratory “audits”.\n“Finding the origins of this virus is a scientific exercise that must be kept free from politics,” Ghebreyesus said.\nIn May, US President Joe Biden ordered a review of the virus origins saying that intelligence agencies were divided over whether it had come from animals or from a lab.\nThe hypothesis was also included in the WHO’s phase-two proposal although the theory had been downplayed in the team’s initial report.\nHe stressed the need to focus on animal-to-human transmission and look not only at bats but other species including pangolins, mink and ferrets."
  },
  {
    "headline": "Nigeria Dispute Jeopardises Return of Benin Bronzes: BBC Report",
    "summarized_story": "In April the German government said it wanted to give back hundreds of Benin Bronzes, and several museums in the UK have made similar announcements.\nThe return of the Benin Bronzes to Nigeria would mark an extraordinary moment in Africa’s post-colonial history, and is a prospect that seems more likely now than at any time since 1897.\n“The right and only legitimate destination” for the Bronzes would be a “Benin Royal Museum”, he said, sited within his palace grounds.\nHe suggests a compromise, whereby Benin Bronzes return to various museums within Benin City, including one within the palace grounds as well as the more ambitious EMOWAA outside its walls.\nI’m still 95% certain we can work this out.”Victor Ehikhamenor is an acclaimed artist from Edo State and an outspoken advocate for the return of the Benin Bronzes."
  }
]