[
  {
    "headline": "Yoruba scholars, monarchs caution Igboho, demand decentralised govt",
    "summarized_story": "A conference of Yoruba has called for decentralisation of government to allow the six geopolitical zones in the country to have autonomy to function.\nThe conference, which had in attendance Yoruba scholars and traditional rulers, was led by Professor of History, University of Texas, Austin, Toyin Falola, who submitted that decentralisation of power would solve most of the problems, including the insecurity facing the country.\nThe Yoruba leaders and scholars met at Babcock University, Ilishan-Remo, Ogun State, on Monday, for the sixth Atanda lectures and conference on Yoruba culture and society.\nSpeaking on the essence of the conference, held in remembrance of a late professor of history, Joseph Atanda, Falola said the late scholar contributed immensely to the teaching of Yoruba history and culture while alive.\n“You have to do this thing very clinically; you must get your parameters right; is it going to be peaceful?"
  },
  {
    "headline": "Bello meets abducted students’ parents, unveils anti-banditry battle plan",
    "summarized_story": "Security agencies, comprising the military, police, the Nigeria Security and Civil Defence Corps, and Vigilante Corps are to comb the forests to rescue the abducted Tegina Islamiyyah schoolchildren.\nGovernor Abubakar Sani Bello revealed this when he visited the team to boost their morale in Kagara in the Rafi Local Government Area.\nBello said was time for government to take a decisive action towards ending the bandits’ activities in the rural areas.\n“We have to try our possible best not to make them succeed in forcing us to change our normal lives.\nThey started by displacing farmers from their farmlands, moved to burning farms, then moved to kidnappings and forcing us to close our schools."
  },
  {
    "headline": "T.B. JOSHUA: There was a man I knew — Femi Fani-Kayode",
    "summarized_story": "There was a man I knew who footed the bills of many cancer patients and those that suffered from other terminal illnesses.\nThere was a man I knew who was gifted in the prophetic, who worked many miracles in the name the Lord and who always gave God the glory.\nThere was a man I knew whose Church attracted 6 out of every 10 foreigners that come to Nigeria.\nThere was a man I knew who prayed into power and counselled many world leaders and Presidents than any other.\nThere was a man I knew who suffered more persecution and tragedy than any other man of God in Nigeria without ever complaining."
  },
  {
    "headline": "No amount of threat’ll stop Ndigbo from demanding equitable treatment — Abaribe",
    "summarized_story": "By Anayo Okoli & Dennis Agbo, ENUGUSENATE Minority leader, Senator Enyinnaya Abaribe has vowed that no amount of threat will stop Ndigbo from demanding equitable treatment in Nigeria, insisting that the marginalization has become unbearable.\nHe said the present government is manifesting sectional leadership and unequal treatment, which he said has been the problem of Nigeria.\n“Our country Nigeria today is supposed to be the inclusion of everybody because we are equal partners.\n“No amount of threat will deter up from demanding for equitable treatment in Nigeria.\n“If the dominant position in Nigeria today is restructuring then the minimal demand of Ndigbo in Nigeria cannot be anything less than that of restructuring."
  },
  {
    "headline": "My faith in young generation is unshakable — Aisha Buhari",
    "summarized_story": "The First Lady, Mrs Aisha Buhari, on Monday said that her faith in the younger generation of Nigerian women and youths remained unshakable.\nMrs Buhari said this at the maiden edition of All Progressives Congress (APC) Youths Conference in Abuja.\nRepresented by her Senior Special Assistant on Women Affairs and Administration, Dr Rukayyatu Gurin, the first lady expressed her unalloyed support and commitment to the party.\n” My faith in young people remain unshaken, I thank you all for your continued support to the Buhari administration.\n” I assure you that you have my support,” she saidVanguard News Nigeria"
  },
  {
    "headline": "DELTA 2023: Gbagi, Nwaoboshi disagree on Okowa’s scorecard",
    "summarized_story": "“What has the Anioma governor done for Asaba people to show that he loves Asaba more than the Delta Central people?\nIt is the turn of Delta Central to produce the next Governor of Delta State,” Nwaoboshi stated.\n“If we really want to look at it, let us look at the money that accrued to the first governor, what happened, the second governor, what happened, the third governor, what happened?\nPlease, I ask of you, Delta State must go forward.\nWe must develop the state, the state must wear its look as one of the greatest states in Nigeria financially."
  },
  {
    "headline": "Strange spirit directed me to rape 80-year-old grandmother — 65-year-old man claims",
    "summarized_story": "Dayo Johnson AkureA 65-year-old man, Emmanuel Joseph has claimed that he was directed by a spirit to rape an Octogenarian woman, in Ondo town, Ondo state.\nThe suspect now in police custody at the Yaba Division of Ondo town told newsmen during interview.\nOwolabi said it took the intervention of the people to rescue the woman, else the suspect might have ended up killing her.\nA source in the neighbourhood said that the children of the victim have relocated the victim from the area.\nThey alleged that the suspect had confessed to the crime while different phones, charms and dagger were also recovered from his house."
  },
  {
    "headline": "Insecurity: Gov Bello identifies bandits kidnapping, killing Nigerians",
    "summarized_story": "The Niger State Governor, Abubakar Sani Bello has identified those behind banditry in Nigeria.\nBello disclosed that bandits are foreigners hired to cause problems in the country.\nThe Governor disclosed this yesterday while addressing the 1000 combined security operatives deployed to rescue 136 abducted students from Salihu Tanko Islamiya School in Tegina, Rafi Local Government Area of the State.\n“They are hired to cause problems for us.\n“These bandits are well organised and coordinated.”FG declares 63 Nigerians, 27 foreigners wanted"
  },
  {
    "headline": "Prophet Jeremiah challenges billionaire pastors",
    "summarized_story": "Founder and Senior prophet of Christ Mercyland Deliverance Ministry, Warri, Delta State, Jeremiah Fufeyin, has called on wealthy pastors in the country to give back to Nigerians in this difficult period of time.\nThe cleric said that the Federal Government needs the support of well-meaning Nigerians, especially wealthy clergymen to mitigate challenges faced by poor citizens.\nAccording to him, Nigerians have given so much to the church and it was only fair that wealthy pastors help them survive the hunger and starvation in the country.\nDeath: Prophet Jeremiah Omoto weeps, says TB Joshua was a good manThe Pastor stated this at the weekend while giving out the sum of N1.5 million to an upcoming gospel singer and dancer, Sammy Parker.\nProphet Jeremiah also gave two other families N1 million each to mark the Fathers’ Day celebration while an aged widow got N900, 000 from the cleric."
  },
  {
    "headline": "We will react when we know about Sunday Igboho Lagos rally",
    "summarized_story": "The Lagos State Police Command has said it is not aware that the acclaimed Yoruba freedom fighter, Sunday Adeyemo Igboho is planning to storm Lagos for a Yoruba nation rally.\nDAILY POST learnt that Sunday Igboho had made known his intention to shut down Lagos for a mass rally to sensitize residents about his secession agenda.\nIgboho said he would storm the Centre of Excellence on July 3 for the next Yoruba nation rally.\nAdejobi said the command would react appropriately when it is informed of the planned mass rally in Lagos.\nSpeaking on phone, Adejobi said: “I am not aware of that (Sunday Igboho’s planned Lagos rally)."
  },
  {
    "headline": "Again, suspected gunmen kill businessman in Ibadan",
    "summarized_story": "Unknown gunmen whose whereabouts has not been ascertain have killed another businessman in Ibadan, the Oyo State capital.\nDAILY POST gathered that the man whose identity has not been revealed was killed Monday morning.\nHe was killed by the gunmen immediately after he allegedly withdrew some amount of money at a new generation bank.\nThe incident happened along the Ojoo-UI Road, DAILY POST gathered.\nThe latest killing is coming less than 24 hours after suspected gunmen killed a journalist in Ibadan."
  },
  {
    "headline": "Ogun: Four abducted Chinese workers regain freedom after payment of ransom",
    "summarized_story": "Four Chinese workers who were kidnapped last Wednesday in Ogun State have regained their freedom.\nOur correspondent learnt that the incident occurred at Adeaga/Alaagba village in Odeda Local Government Area of Ogun state.\nPublic Relations Officer of the Ogun State Police Command, Mr Abimbola Oyeyemi confirmed the release of the victims on Monday.\nOyeyemi noted that the abducted Chinese workers were released by their captors after a manhunt was launched by the police.\nHe, however, did not give details on how the four Chinese workers were released by the gunmen."
  },
  {
    "headline": "Delisted CBT centres: JAMB directs affected candidates to reprint exam slips",
    "summarized_story": "By Frank Ikpefan, AbujaThe Joint Admissions and Matriculation Board (JAMB) has directed candidates affected by the de-listing of 24 Computer-Based Test (CBT) centres to reprint their examination notification slips for the Unified Tertiary Matriculation Examination (UTME) and Direct Entry (DE) examinations.\nThe statement reads: “Candidates who were scheduled to take examination in delisted cantres can proceed to print their examination notification slips from Sunday, June 20, 2021 for their new schedule date and time.\nADVERTISEMENT“This applies only to centres delisted.\n“You will recall that 24 centres were delisted for performing below the tolerable limit of the board while over 40 others were put on the watch list.”JAMB, on Saturday, de-listed 24 centres.\nThe board said their performance fell below the tolerable limit during the conduct of the ongoing 2021 UTME"
  },
  {
    "headline": "NPC Bill: ‘National Assembly won’t gag media’",
    "summarized_story": "By Sanni Onogu, AbujaThe Chairman of the Senate Committee on Media and Public Affairs, Surajudeen Ajibola Basiru, has assured Nigerians that the National Assembly will not tamper with freedom of the media in the country.\nThe senator was reacting to the controversy trailing the proposed amendment to the Nigeria Press Council (NPC) Act.\nBasiru spoke after declaring open a two-day capacity building workshop for media aides to Principal Officers and Information Personnel of the National Assembly in Abuja.\n“We have one of the most liberalised media industry in Nigeria: private radio stations, private television stations and news online.\n“So, regulating (the media) in order to take away unsavoury attitude would not mean the media is being gagged."
  },
  {
    "headline": "Ogunbiyi would not make a governor, says Osun federal lawmaker",
    "summarized_story": "He said Ogunbiyi who is one of the high contenders with Senator Ademola Adeleke for the party’s ticket would not be a good governor if given the chance.\nOgunbiyi had contested for the PDP ticket in the last governorship election in the state but narrowly lost to Adeleke.\nHe said Ogunbiyi can be useful in other political offices, except that of the governor.\nADVERTISEMENTHis words: “The party is not divided along (those backing) Dr Akin Ogunbiyi and Senator Ademola Adeleke; it is just a mere aspiration which is normal in politics.\n“I know Dr Akin Ogunbiyi very well; he is a brother that I respect so much, but you know that when we talk about politics, we talk about the name, influence, networking, Ogunbiyi is nowhere near the Adelekes."
  },
  {
    "headline": "Quest for better representation for Ndokwa/Ukwuani Federal Constituency",
    "summarized_story": "Former Speaker, Delta State House Assembly, Olise Enebeli Imegwu, who writes from Aboh, Ndokwa East Local Government, is concerned about the quality of representation Ndokwa/Ukwuani Federal Constituency is currently receiving.\nThe larger Ndoshimili people of Ndokwa East Local Government suffered the same fate.\nIn 1991, Ndokwa East had two state constituencies and Ndokwa West had also two.\nToday, while the state constituencies for Ndokwa East are reduced to one Ndokwa West remains two.\nIn conclusion, the elders of Ndokwa/Ukwuani Federal Constituency should encourage and the election of candidates that would be consensus builders."
  },
  {
    "headline": "Pope to collaborate with Nigeria to end insecurity",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Catholic Pontiff, Pope Francis, has expressed readiness to collaborate with the Federal Government to end insecurity in the country and in the sub-Saharan Africa.\nHE gave the assurance when he received letter of credence from Nigerian Ambassador to the Holy See, Vatican City, Paul Oga Adikwu.\nA statement by the Embassy of Nigeria in the Holy See said Pope Francis commended the effort of President Muhammadu Buhari-led administration in combating security challenges in the country.\nIt also said during a private chat with the Holy Father, Ambassador Adikwu conveyed the greetings of President Buhari to the Pope.\nPope Francis prayed for the new ambassador who was in the company of his family and senior officials of the embassy, committing the envoy to the hands of God to succeed during his tour of duty in the Holy See."
  },
  {
    "headline": "Buhari, Afenifere, Ohanaeze, MBF clash over appointments",
    "summarized_story": "By Sunday Ani, Chukwudi Nweje and Romanus OkoyePresident Muhammadu Buhari has defended his appointments and policies, saying they are fair and inclusive.\n“So far, all the policies initiatives, projects and even appointments by this administration has been guided by equity and inclusiveness.\nNational Publicity Secretary of Afenifere, Jare Ajayi, said the administration has been most unfair in terms of appointments and policies.\n“There has never been an administration in this country that is as unfair and alienates certain parts of the country as that of President Buhari.\nIt seems certain English words connote a different meaning to president Buhari,” he said."
  },
  {
    "headline": "#RevolutionNow protesters block Abuja airport road",
    "summarized_story": "From Molly Kilete, AbujaThere was pandemonium in Abuja, yesterday morning as protesters under the aegis of #RevolutionNow blocked the popular Umaru Musa Yar’Adua Way leading to the Nnamdi Azikiwe International Airport.\nThe protesters, mostly youths, carried various placards and set up bonfires with used motor tyre leaving motorists and commuters stranded.\nThe protesters chanted: “Se democracy be this, se democracy be this, people dey die like flies, se democracy be this (Is this a democracy?\nWe did not make any arrest, we just restored calm and allow free flow of traffic,” he said.\nThe protesters were on June 12, violently dispersed by a combined armed security operatives at Gudu junction with teargas."
  },
  {
    "headline": "INEC targets 100m voters for 2023 polls",
    "summarized_story": "“The expansion of voters’ access to polling units prepares the ground for the discharge of another important responsibility of the Commission.\nThe registration of eligible Nigerians as voters is one of the immediate tasks before the Commission.\nMonday June 28, 2021, the Commission will resume the Continuous Voter Registration (CVR) nationwide.\n“The Commission will demonstrate the procedure for the proposed online registration and also present the new INEC Voter Enrollment Device (IVED) to you shortly.\n“We intend to undertake the CVR exercise over a period of at least one year."
  },
  {
    "headline": "Alleged sexual assault: Baba Ijesha to be arraigned Thursday",
    "summarized_story": "Nollywood actor, Olanrewaju Omiyinka (Baba Ijesha) will appear before an Ikeja Special Offences Court, on Thursday, over allegations of sexual assault of a minor.\nBaba Ijesha, who has been in custody since his arrest on April 22, is expected to stand trial before Justice Oluwatoyin Taiwo.\nThe actor was arraigned on June 16 in a Yaba Magistrates’ Court, on charges of indecent treatment of a child, defilement of a child, sexual assault by penetration, attempted sexual assault by penetration and sexual assault.\nNwaka due to indications that the matter was before the High Court.\n“The defendant must be accorded full medical attention by the authorities pending his arraignment at the High Court.”"
  },
  {
    "headline": "Nigerian Navy Personnel Sack Ogun Community To Take Over Land, Expel Traditional Ruler",
    "summarized_story": "SaharaReporters gathered that the military men have also sent packing the local chief, Baale, Chief Waheed Muraino, as the people continued to desert their homes due to the invading military men.\n“The navy personnel are being used by warring families and parties laying claim to lands in the community.\nThe Ogun State Police Command has also invited Sufi Taiwo several times, but he never honoured the invitation once.\n“We hereby call on the Ogun State Government, human rights lawyers, and other well-meaning Nigerians to come to our aid.\nDOCUMENTS: Nigerian Navy Personnel Sack Ogun Community to Take Over Land, Expel Traditional Ruler by Sahara Reporters on Scribd"
  },
  {
    "headline": "Nigerian Navy Personnel Sack Ogun Community To Take Over Land, Expel Traditional Ruler",
    "summarized_story": "SaharaReporters gathered that the military men have also sent packing the local chief, Baale, Chief Waheed Muraino, as the people continued to desert their homes due to the invading military men.\n“The navy personnel are being used by warring families and parties laying claim to lands in the community.\nThe Ogun State Police Command has also invited Sufi Taiwo several times, but he never honoured the invitation once.\n“We hereby call on the Ogun State Government, human rights lawyers, and other well-meaning Nigerians to come to our aid.\nDOCUMENTS: Nigerian Navy Personnel Sack Ogun Community to Take Over Land, Expel Traditional Ruler by Sahara Reporters on Scribd"
  },
  {
    "headline": "BUSTED: Foreign Affairs Ministry Mismanages N28billion Released By Buhari For Distressed Missions",
    "summarized_story": "The Ministry of Foreign Affairs allegedly mismanaged $68 million (about N28 billion) released by the President Muhammadu Buhari administration in 2018 for disbursement to some of the country’s foreign missions, SaharaReporters learnt.\nSaharaReporters learnt from a government’s audit report that the Ministry’s Permanent Secretary has now been asked to explain how the funds, allegedly misused, were disbursed to the missions.\nThe Auditor-General’s report stated that when queries were sent to the ministry to explain the issues around how $68 million was disbursed, no responses were received.\nThe report reads, “Issue 1 – Lack of accountability in the Disbursement of intervention fund for distressed missions - $68,875,902.\nThe Ministry however approved the release of the excess to the Consulate-General of Nigeria in Dubai, which was originally not among the missions in need of intervention funds."
  },
  {
    "headline": "BUSTED: Foreign Affairs Ministry Mismanages N28billion Released By Buhari For Distressed Missions",
    "summarized_story": "The Ministry of Foreign Affairs allegedly mismanaged $68 million (about N28 billion) released by the President Muhammadu Buhari administration in 2018 for disbursement to some of the country’s foreign missions, SaharaReporters learnt.\nSaharaReporters learnt from a government’s audit report that the Ministry’s Permanent Secretary has now been asked to explain how the funds, allegedly misused, were disbursed to the missions.\nThe Auditor-General’s report stated that when queries were sent to the ministry to explain the issues around how $68 million was disbursed, no responses were received.\nThe report reads, “Issue 1 – Lack of accountability in the Disbursement of intervention fund for distressed missions - $68,875,902.\nThe Ministry however approved the release of the excess to the Consulate-General of Nigeria in Dubai, which was originally not among the missions in need of intervention funds."
  },
  {
    "headline": "Gunmen Kill Physically Challenged Man, Wife, Daughter In Ibadan",
    "summarized_story": "Gunmen on a motorcycle reportedly invaded Iyana Court, Ile Titun area in the Ibadan South-East Local Government Area of Ibadan and killed a family of three.\nOur correspondent gathered that a physically challenged man identified as Sodiq, but also known as Chicken, was the target of the attack by the hoodlums.\nSodiq, who was said to have kyphosis (also known as round back or hunchback), was shot dead, alongside his wife and daughter.\nIt was gathered that the gunmen made sure that Sodiq was dead before they escaped through Olomi area.\nThe Police Public Relations Officer in Oyo State, Adewale Osifeso, when contacted said he would find out and get back to our correspondent."
  },
  {
    "headline": "Osinbajo to youths: Your ideas will retire those ahead of you -- not age",
    "summarized_story": "Vice-President Yemi Osinbajo says youths will have a better chance of making a significant impact in politics through productive ideas, rather than relying on their age.\nThe vice-president said big ideas, great solutions and creative plans must come from the youths.\n“It is the strength of your ideas and the depth of organisation that will retire those ahead of you, not your age,” he said.\nThe big ideas, the great solutions, the creative plans must come from you.\nAnd this is your moment.”Osinbajo said although ideas and numbers are important, politics is about service to the people."
  },
  {
    "headline": "Osinbajo to youths: Your ideas will retire those ahead of you -- not age",
    "summarized_story": "Vice-President Yemi Osinbajo says youths will have a better chance of making a significant impact in politics through productive ideas, rather than relying on their age.\nThe vice-president said big ideas, great solutions and creative plans must come from the youths.\n“It is the strength of your ideas and the depth of organisation that will retire those ahead of you, not your age,” he said.\nThe big ideas, the great solutions, the creative plans must come from you.\nAnd this is your moment.”Osinbajo said although ideas and numbers are important, politics is about service to the people."
  },
  {
    "headline": "Top US bank to investigate Nigerian ‘staff’ accused of body-shaming lady",
    "summarized_story": "Wells Fargo, a prominent American multinational financial services company, has promised to investigate allegations of racial discrimination against Oluwaseun Adeoye, who is believed to be its staff.\nAdvertisementThe company’s response followed a post by Joyce Agbanobi, a US-based Nigerian lady, wherein she called out Adeoye for allegedly body-shaming her during this year’s Father’s Day celebration.\nIn the post, the Nigerian man appeared to have asked Agbanobi why “her skin is so black” and advised her to bleach her skin.\n@oluwaseun Adeoye a Wells Fargo employee has to be called to order, we need to protect other women from people like him!!\n!”In its reaction, Wells Fargo commended Agbanobi for bringing the matter to its attention while asking her to forward details of the conversation to the company’s email for proper review."
  },
  {
    "headline": "Top US bank to investigate Nigerian ‘staff’ accused of body-shaming lady",
    "summarized_story": "Wells Fargo, a prominent American multinational financial services company, has promised to investigate allegations of racial discrimination against Oluwaseun Adeoye, who is believed to be its staff.\nAdvertisementThe company’s response followed a post by Joyce Agbanobi, a US-based Nigerian lady, wherein she called out Adeoye for allegedly body-shaming her during this year’s Father’s Day celebration.\nIn the post, the Nigerian man appeared to have asked Agbanobi why “her skin is so black” and advised her to bleach her skin.\n@oluwaseun Adeoye a Wells Fargo employee has to be called to order, we need to protect other women from people like him!!\n!”In its reaction, Wells Fargo commended Agbanobi for bringing the matter to its attention while asking her to forward details of the conversation to the company’s email for proper review."
  },
  {
    "headline": "Buhari finally constitutes EFCC board -- first since 2015",
    "summarized_story": "President Muhammadu Buhari has constituted the board of the Economic and Financial Crimes Commission (EFCC).\nAdvertisementThe anti-graft agency has been without a board since 2015 when Buhari came into power.\nAdvertisement“President Buhari has appointed George Abang Ekpungu as the Secretary of the Economic and Financial Crimes Commission (EFCC), for a tenure of five years,” Gwandu said.\n“Also appointed as board members of the Economic and Financial Crimes Commission are Luqman Muhammad (South South), Anumba Adaeze (South East), Alhaji Kola Raheem Adesina (North Central) and Alhaji Yahya Muhammad (North East).\nAdvertisement“These appointments are in line with Section 2 (1) and Section 4 of the Economic and Financial Crimes Commission Act, 2004."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "How to avoid investment scams in Nigeria",
    "summarized_story": "Over the past few weeks, two different scams have been uncovered in Nigeria.\nIt’s safe to say that many more investment scams will continue to spring up.\nOfficial website: https://t.co/HMfsRY9aCspic.twitter.com/i0gqGXYzjJ — Instablog9ja (@instablog9ja) May 28, 2021In it, the actor claimed that the company, Millionaires Club Investment, would give you 50% ROI (Return on Investment) in 3 days.\nLegitimate investment platforms are usually keen to inform you of the risks involved when you’re putting your money with them.\n“And you are licensed by…?”This is probably one of the most essential checks you must perform before you hand over funds to an investment company."
  },
  {
    "headline": "The Next Wave: $1.3 billion is not healthy enough",
    "summarized_story": "Between 2015 and 2020, 97 private equity and venture capital fund investments worth $1.3bn were made in health care in Africa.\nBetween 2015 and 2020, AVCA estimates that healthtech accounted for 35% of health care investments in Africa.\nIn 2020 alone, healthtech was the bright star too – gulping 45% of health care investments.\nBoluwatife Sanwo/TC InsightsAs with mPharma, new innovative health startups are relying on VC funding to rise to popular consciousness.\nCOVID-19, while an unfortunate pandemic, has spurred a welcome boost in visibility for healthcare startups."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "3 Steps To Register Your Small Business With CAC Online • Techpoint Africa",
    "summarized_story": "This post is a delayed version of SME Clinic newsletter, a weekly newsletter that provides tips and recommendations to help you position your small business for success.\nDid you know that the Corporate Affairs Commission (CAC) has made it possible for you to register your company and business name online?\nSo let’s get into how to register your business name or company online.\nSo there you have it, online business name and company registration in just three steps.\nAdvertisementIf you want to learn how to reach more customers, grow, and manage your business online, SME Clinic is for you."
  },
  {
    "headline": "Google plans to support African founders and entrepreneurs with new $6m funding options",
    "summarized_story": "Google has announced opening up three new programmes targeted at supporting African entrepreneurs — the 6th cohort of Google for Startups Accelerator (GFSA) Africa, $3 million Black Founders Fund (BFF) Africa, and Google.org-backed $3 million grants for female entrepreneurs.\nNotably, the first virtual class of Google for Startups Accelerator Africa was launched last year due to the COVID-19 pandemic.\nAdvertisementBlack Founders Fund (BFF) AfricaSimultaneously, applications will be opened for the $3 million Black Founders Fund for African startups in their early stage.\nThe programme will have 50 African startups, led by Black founders, receive cheques between $50k and $100k.\nThis will also include seed capital in the form of cash grants and Google product support for 500 aspiring female entrepreneurs."
  },
  {
    "headline": "Nigeria’s intellectual property policy, sexual violence and tech, 5G deployment in Nigeria",
    "summarized_story": "Today, I’m discussing:A possible policy on intellectual property in NigeriaSexual violence and techThe latest news on 5G deployment in NigeriaNigeria’s intellectual property policyNigeria may get an intellectual property (IP) policy soon.\nThe COVID-19 pandemic, sexual violence, and techIn recent times, sexual violence cases seem to be on the rise.\nAccording to the United Nations, COVID-19-induced lockdowns exposed vulnerable people to more risk of sexual violence in 2020.\nAdvertisementOluwanifemi did a deep dive into the issue, highlighting the various ways tech and social media have helped combat sexual violence in Nigeria.\nRead: How tech tools create a safe space for sexual violence survivors in NigeriaMore on 5G deployment in NigeriaPhoto Credit: <a href=”https://www.flickr.com/photos/[email protected]/49713123696/”>Ivan Radic</a> Flickr via <a href=”http://compfight.com”>Compfight</a> <a href=”https://creativecommons.org/licenses/by/2.0/”>cc</a>It appears 5G deployment in Nigeria is gaining even more traction."
  },
  {
    "headline": "In Nigeria, Ghost of Kingsway, Leventis stalks second-generation retailers",
    "summarized_story": "Nigeria’s second-generation formal retailers may soon find themselves travelling down the ill-fated path of first generation retailers from Leventis to Kingsway, who took off in the face of weak consumer purchasing power and supply chain disruptions.\nEstablished between 1932 and 1948, UTC, Leventis and Kingsway Stores all vied for the wallets of Nigerian consumers with…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Shoprite’s exit and lessons about Nigerian consumers",
    "summarized_story": "Nigerian consumers come in different shades and shapes, promising retailers acres of diamond to mine from, Shoprite counted on this.\nNine years ago, Shoprite, Africa’s retail giant saw scope in Nigeria for nearly a thousand outlets because of the massive population and how this would translate into consumption.\nWell, the target was 700 shops, Reuters…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Lagos overtakes Nairobi as home to most start-ups",
    "summarized_story": "Lagos, Nigeria’s busiest city with a massive consumer market has overtaken Nairobi, Kenya’s capital as home and a top destination for the greatest number of start-ups in Africa.\nOver 500 active start-ups operate out of Lagos.\nThe large population of Lagos, Nigeria’s commercial hub is one of the reasons for the rise in start-ups in the city.\nKnown for its traffic gridlock and entrepreneurial dynamism, Lagos alone is responsible for about 30 percent of Nigeria’s gross domestic product.\nIt is the highest-ranking country in Western Africa and the 3rd highest-ranking country in Africa,” research analysts at StartupBlink, said."
  },
  {
    "headline": "Court adjourns hearing on illegal acquisition of lands By Chinese companies until September 2021 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITTY- The hearing and resolution on the case of the 15 hectares of land own by a London-based business man, and illegally encroached and acquired by a Chinese company in Utesi Community in lkpoba Okha Local Government Area of Edo State has been fixed for September 21, 2021.\nIn her ruling, during the court proceedings, the presiding judge in Benin City high court, haven listened to the pleas of the counsel to the Chinese companies to give them time to explore avenues to settle with the claimant, Mr lbosa Osodin, adjourn hearing on the case, with suit number B/2452020, to 21st of September 2021.\nThe barrister, while frowning at the illegality perpetuated by the Chinese companies said, “We are not happy that our client, Mr Ibosa who is an investor will be treated in this manner” by foreigners whose companies have deliberately disregarded their corporate social responsibilities to the Utesi community by constant pollution and environmental degradation to the inhabitants of the community.\nBarrister Osula said further that, the case in point is a novel one, and certain that justice will not only be done, but will be seen to be done.\nHe said further that the Chinese companies cannot get away with their illegality, because “We are a firm believer of the legal philosophy that the court is the last hope of the common man”."
  },
  {
    "headline": "Edo begins use of revenue scratch cards in move to expand tax net – Nigerian Observer",
    "summarized_story": "Edo begins use of revenue scratch cards in move to expand tax netShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Internal Revenue Service, (EIRS) has introduced the use of Revenue Scratch Cards to simplify tax payment for businesses owners, particularly those in the informal sector.\nIn a statement, Head, Corporate Communications, EIRS, Courage Eboigbe, said: “The Revenue Scratch Card is part of the Edo Revenue Administration System (ERAS) mobile payment solution, which caters for individual businesses and ensures financial inclusion of the informal sector by recognizing each taxpayer who cannot obtain a tax clearance documentation.\n“With the use of the revenue scratch cards, taxpayers get instant notifications and receipts on transactions made.\nIt further enables taxpayers make payments from the comfort of their business premises, which eliminates waste of time and unnecessary bank queues.”He added that “Individual taxpayers are expected to purchase the face value of the Revenue Scratch Cards from EIRS licensed and approved dealers and their vendors.”The statement further enjoined taxpayers to always ensure purchased cards are processed and receipted by approved and designated Revenue Collectors (RCs) with a unique Point of Sale (PoS) device."
  },
  {
    "headline": "Omega Ministry church pastor beat wife to death in Akwa Ibom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA 49-year old Pastor, Ukachukwu Christopher, the General Overseer of Omega World Global Ministry (Fellowship Church) beat wife, Patience, 40, to death and secretly buried her corpse in a shallow grave in his compound.\nThe incident was learnt to have happened at Ikot Abia village in Eket Local Government area, Akwa Ibom State, where his Church is located.\nThe Police Public Relation Officer, Akwa Ibom command, SP Odiko Macdon who confirmed the incident disclosed that Police operatives from the State have arrested Christopher, detained him and he is undergoing interrogation over the alleged murder.\nIn other to cover his tracks, he dug a shallow grave in his compound and buried her.\nThe Commissioner of Police Akwa Ibom State, Andrew Amiengheme, has ordered the Deputy Commissioner of Police in-charge of the State Investigation and Intelligence Department to take over the matter for discreet investigation and assured that the suspect will be charge."
  },
  {
    "headline": "Obaseki reforms: Air Peace expands operations to Benin-Port Harcourt route – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWith the upgrade of facilities at the Benin Airport, supported by the Governor Godwin Obaseki-led administration, Nigeria’s biggest domestic carrier, Air Peace, has commenced operations on the Benin-Port Harcourt route.\nThe development is sequel to the expansion of airline operations at the airport, with Azman Air and Max Air commencing operations, in addition to the presence of Air Peace, Aero Contractors and Arik Air.\nAn official at the Benin Airport, who requested anonymity because he was not authorized to speak to the press, said the new route is strategic as it would provide a lifeline to people who would have been stuck on the deplorable East-West Road to Benin.\n“The new route is strategic and a welcome development.\nThe Governor Obaseki-led administration was instrumental to the upgrade of the airport, with support to install instrument landing and night landing equipment at the facility."
  },
  {
    "headline": "Why Buhari, APC failed in first four years — Senate President Lawan",
    "summarized_story": "The President of the Senate, Ahmad Lawan, has provided insight into why President Muhammadu Buhari and his party, the All Progressives Congress (APC), were unable to deliver on their electoral promises during their first four-year tenure.\nMr Lawan lamented that the plan of the APC to deliver on most of its promises to Nigerians was stalled in the first tenure of the President Buhari administration as a result of the feud between the National Assembly and the Executive arm of government.\nMr Lawan said, “Whether we like it or not, the truth is, President Muhammadu Buhari remains the person with the bulk of the support we get across this country in APC.\n“Yes, we have to know our value then, and the value of APC presently is APC minus President Muhammadu Buhari.\n“That means we have to see our selves as brothers and sisters regardless of where we come from.”The Senate President added that, “our tribe or even ethnic group, our religious persuasion should not matter when it comes to uniting this country."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Government Plays Critical Role In Supporting Food Industry – Jaiyeola",
    "summarized_story": "More than ever, Government’s support is needed in developing the local wheat industry.\nThe food and milling industry in Nigeria is a promising sector with opportunities to expand into other markets beyond Nigeria.\nOur government has a critical role to support the food industry so we can honour our responsibilities to supply food to all parts of the nation.\nThe food industry has built considerable expertise and capability to serve the nation with consistent supplies and reliable quality foods.\nWe are determined to be at the forefront of the carbohydrate food industry providing affordable foods to a fast-growing population in Nigeria, and the African continent at large."
  },
  {
    "headline": "Oil Spillage: Court Orders Mobil, NNPC To Pay N82bn Damages To Akwa Ibom Communities",
    "summarized_story": "The Federal High Court, Abuja, has ordered Mobil Producing Nigeria Unlimited and the Nigerian National Petroleum Corporation (NNPC) to pay the oil communities in Ibeno Local Government Area of Akwa Ibom cumulative damages of 81.9 billion over oil spillage.\nAdvertisementsJustice Taiwo Taiwo, in a judgment debt, ordered that the payment must be paid within 14 days, and failure of which 8 per cent interest would be accruable on the principal sum annually.\nThe Ibeno communities led by Obong Effiong Archianga and 9 others had through their lawyers, Chief Lucius Nwosu, SAN, brought the action against NNPC, Mobil Producing Nigeria Unlimited and ExxonMobil Corporation.\nThey had sought about N100 billion compensation for economic losses suffered from oil spillages caused by the defendants during exploration.\nThe 3rd defendant was however deleted from the court action when the court established that there was no cause of action against it."
  },
  {
    "headline": "Group Writes ICPC, Demands Salary Of Former FIIRO Boss",
    "summarized_story": "AdvertisementsThe former FIIRO acting director was caught in a web of alleged dirty scam after submitting a Ph.D certificate that was later discovered to be false.\nThe ICPC investigation had indicted him but many Nigerians are shocked to note that Igwe still remains a key staff of the institute.\nUnder the fake claim, he had worked for 18 years at the country’s foremost research institute rising through the ladder with the same forged document.\nThe petition titled ‘Prosecution of Mr Chima Igwe for attaining the Position of Acting Director General of the Federal Institute of Industrial Research (FIIRO), Without Possessing the Pre-Requisite Qualification” was signed by HEDA’s Chairman, Mr Olanrewaju Suraju.\nIt was upon this finding that Igwe was removed, after several public pressure, as the acting director-general of FIIRO but still retained as a staff of the Institute in the capacity of a chief research officer."
  },
  {
    "headline": "Dangote Sugar Commits To Nigeria Backward Integration Project Goal",
    "summarized_story": "Achieving Nigeria Backward Integration Project in the sugar industry has remained a key priority to Dangote Sugar Refinery (DSR) Plc.\nHe described the backward integration policy as commendable which will not only reduce imports of raw sugar but save the nations enormous foreign exchange used for importation.\nHe stated that the backward integration policy of Dangote Sugar Refinery is recording appreciable progress even as he declared the company’s irrevocable commitment to the policy.\nTo achieve this, Dangote Sugar Refinery Plc acquired Savannah Sugar Company Limited, located in Numan, Adamawa State in December 2012, and embarked on the ongoing rehabilitation of its facilities and expansion of its 32,000 hectares’ sugarcane estate.\nThe Nasarawa Sugar Company Limited, is the registered subsidiary of Dangote Sugar Refinery Plc."
  },
  {
    "headline": "Mbula Chieftaincy: Open Letter To Gov Fintiri",
    "summarized_story": "It is with greatest respect and deepest sense of responsibility that I write this open letter to you on the current inconsistencies and illogical presentations on the chieftaincy tussle in Mbula land.\nSome might ask; what is Ibrahim’s interest in the chieftaincy affairs of Mbula land and why should he write an open letter on an issue that has little or affinity to his pedigree?\nIn Mbula land or better still Mbula federation, the line of succession falls within the brackets of two Royal clans of a bigger family of royalty.\nAs an exceptionally great strategic thinker whose love for humanity found its deepest and most profound expression in his commitment to social justice, we appeal to Governor Fintiri to stand his grounds against rapacious and destructive cleavages, spiraling indiscipline and deceptive impurity in Mbula chieftaincy tussle.\nIt is against this background that we appeal to the Governor that chieftaincy stool is not a “bazaar” where any hawk can hijack the process."
  },
  {
    "headline": "Customs to seize unverified private jets — Daily Times Nigeria",
    "summarized_story": "By Chukwuemeke John OkohNigeria Customs Service (NCS) has threatened to impound private jets in the country by July 6, 2021 if their owners fail to present relevant import clearance documents for verification within the stipulated 30-day period.\nHe stressed that such individuals or representatives could come with the documents for verification.\nSo far, he said, a few owners of private aircraft had responded to the verification invitation, thus prompting the ultimatum.\nWe also know that some brought their private jets under a temporary import certificate, which has expired and not renewed.\n“For the avoidance of doubt, private aircraft owners or their representatives are to report to Room 305, Tariff and Trade Departments, Nigeria Customs Service headquarters, Abuja, from 10 am to 5 pm between Monday, June 7 and Tuesday, July 6, 2021,” Attah added."
  },
  {
    "headline": "Millions of Nigerians abuse drugs, says Marwa — Daily Times Nigeria",
    "summarized_story": "IDRIS AHMED, LOKOJANational Chairman and Chief Executive Officer of the National Drugs law Enforcement Agency (NDLEA), Brigadier-General Muhammed Buba Marwa (Rtd), has disclosed that no fewer than 14.3 million young and adult Nigerians from the ages of 16 to 64 years abuse hard substances.\nBroadly speaking, the agency has been able to seize drugs and cash worth over N90 billion within the first four months of this year”.\nHe therefore appealed to parents, elders and community leaders to awaken to the urgent and solemn task of saving the children and loved ones from the calamity of drug abuse by joining the war against drug abuse and drug trafficking.\n“This way, we hope to convince Nigerians to see themselves as stakeholders in the effort to rid our country of this scourge of drug abuse.” The Chairman said.\n“These sons of the land died while on duty to protect our country and keep our society clean of drugs."
  },
  {
    "headline": "Five killed, four injured as police Inspector opens fire on youths in Enugu",
    "summarized_story": "Five persons have been killed and four others injured after a police Inspector went into a shooting frenzy in Enugu State.\nThe officer who reportedly attacked a neighborhood in Golf Estate, GRA, Enugu, is said to be attached to a lottery company within the area.\nConfirming the incident in a statement, the state police command said it was unclear what led to the sporadic shooting.\nHe further disclosed that the four others who sustained injuries are currently receiving treatment at the Enugu State University Teaching Hospital.\nThe police commissioner while sympathising with the family and friends of the deceased persons, urged them to remain calm while the police conclude their investigation."
  },
  {
    "headline": "FG approves N18bn for take-off of 4 specialised varsities —",
    "summarized_story": "Doosuur Iwambe, AbujaThe Federal Government has approved a take-off grant of N18billion for the establishment of new universities of technology and health sciences in 2021.\nSonny Ochono, said the new Universities of Technology will be established in 2021 while the upgrade of the existing four Universities of Technology and the National Institute of Technology will come on stream next year.\n“Similarly, a National Institute of Technology (NIT) shall be established in Abuja.\n“I am pleased to inform you that President Muhammadu Buhari has approved the phased development programme, compelled by our lean resources.\nAccordingly the two new Universities of Technology will be established in 2021 while the upgrade of the existing 4 Universities of Technology and the National Institute of Technology will come on stream next year."
  },
  {
    "headline": "At last, Gbagbo files for divorce, to end 30-year marriage",
    "summarized_story": "At last, Gbagbo files for divorce, to end 30-year marriageAt last, Gbagbo files for divorce, to end 30-year marriageIvory Coast’s former president Laurent Gbagbo filed for divorce on Monday from his wife of three decades, his lawyer said, days after his highly anticipated return to the country.\nSimone Gbagbo wielded significant political influence as first lady, and was arrested alongside her husband in April 2011 after he refused to concede defeat, sparking a conflict that left some 3,000 people dead.\nGbagbo was sent to the International Criminal Court in The Hague, where he was definitively acquitted in March after a lengthy trial.\nSimone Gbagbo was sentenced to 20 years’ imprisonment in Ivory Coast for “violating state security”, but was released in 2018 after seven years of detention as part of an amnesty.\nLaurent and Simone Gbagbo, who have two daughters, married in 1989 and campaigned alongside each other for the introduction of multi-party elections in the 1990s."
  },
  {
    "headline": "At last, Gbagbo files for divorce, to end 30-year marriage",
    "summarized_story": "At last, Gbagbo files for divorce, to end 30-year marriageAt last, Gbagbo files for divorce, to end 30-year marriageIvory Coast’s former president Laurent Gbagbo filed for divorce on Monday from his wife of three decades, his lawyer said, days after his highly anticipated return to the country.\nSimone Gbagbo wielded significant political influence as first lady, and was arrested alongside her husband in April 2011 after he refused to concede defeat, sparking a conflict that left some 3,000 people dead.\nGbagbo was sent to the International Criminal Court in The Hague, where he was definitively acquitted in March after a lengthy trial.\nSimone Gbagbo was sentenced to 20 years’ imprisonment in Ivory Coast for “violating state security”, but was released in 2018 after seven years of detention as part of an amnesty.\nLaurent and Simone Gbagbo, who have two daughters, married in 1989 and campaigned alongside each other for the introduction of multi-party elections in the 1990s."
  },
  {
    "headline": "NDSF2021: Nigeria must target 8bn market to remain relevant in digital economy – Nnenna Nwakanma",
    "summarized_story": "By BETTY ADIMThe Chief Web Advocate at the World Wide Web Foundation, Nnenna Nwakanma, has counselled Nigerians to stop ethnic fighting and target the 8 billion market space in the digital economy.\n“If we are saying that Africa is the future of digital cooperation, it means that Nigeria is No.\n1 in Africa, it means that Nigeria is number 1 of the future of digital cooperation,” she declared.\nNwakanma told participants at NDSF2021 via an live-broadcast, that as Nigerians, the citizens in the digital ecosystem “we need to go beyond a wailing republic.\nShe stressed that they must show accountability “the same way EU citizens are being treated, I think should be the way, Nigerians have a right to be treated."
  },
  {
    "headline": "NDSF2021: Nigeria must target 8bn market to remain relevant in digital economy – Nnenna Nwakanma",
    "summarized_story": "By BETTY ADIMThe Chief Web Advocate at the World Wide Web Foundation, Nnenna Nwakanma, has counselled Nigerians to stop ethnic fighting and target the 8 billion market space in the digital economy.\n“If we are saying that Africa is the future of digital cooperation, it means that Nigeria is No.\n1 in Africa, it means that Nigeria is number 1 of the future of digital cooperation,” she declared.\nNwakanma told participants at NDSF2021 via an live-broadcast, that as Nigerians, the citizens in the digital ecosystem “we need to go beyond a wailing republic.\nShe stressed that they must show accountability “the same way EU citizens are being treated, I think should be the way, Nigerians have a right to be treated."
  },
  {
    "headline": "Cuba’s Abdala COVID-19 vaccine 92.28 percent effective",
    "summarized_story": "By Agency ReportersCuba said on Monday its three-shot homemade Abdala vaccine against COVID-19 had proved 92.28 percent effective in last-stage clinical trials.\nThe announcement came just days after the government said another homegrown vaccine, Soberana II, had proved 62% effective, with two of its three doses.\nCuba, whose biotech sector has exported vaccines for decades, has five coronavirus vaccine candidates.\n“Hit by the pandemic, our scientists at the Finlay Institute and Center for Genetic Engineering and Biotechnology have risen above all the obstacles and given us two very effective vaccines,” President Miguel Diaz-Canel tweeted.\nDaily cases have halved in the capital, Havana, since the start of the vaccination campaign a month ago, using Abdala, according to official data."
  },
  {
    "headline": "Amina Mohammed hails UN Secretary-General Guterres",
    "summarized_story": "Ms. Amina Mohammed, the UN Deputy Secretary-General, said the re-appointment of Antonio Guterres as Secretary-General by the 193 members of the global body was a vote of confidence in his leadership.\nHowever, while speaking with journalists after taking the oath of office for a second term on Friday, Guterres said he had extended an offer to Mohammed to continue in office.\n“After being elected, I have the pleasure to invite the deputy secretary-general to remain in my second mandate and I hope she will accept,” he said.\nThe deputy secretary-general had also served as Senior Special Assistant to former Nigerian presidents on the Millennium Development Goals.\nShe was appointed in 2012 by former UN Secretary-General, Ban Ki-moon, on Post-2015 Development Planning that paved the way for the Sustainable Development Goals."
  },
  {
    "headline": "Nigeria uncertain as vaccine hub, Rwanda, Senegal, South Africa picked",
    "summarized_story": "Nigeria is still under consideration to be chosen as one of the vaccine production hubs, World Trade Organisation Director-General Ngozi Okonjo-Iweala said on Monday.\nShe said Africa is working with the European Union and other partners to help create regional vaccine manufacturing hubs in South Africa, Senegal and Rwanda.\n“We have now seen that over-centralisation of vaccine production capacity is incompatible with equitable access in a crisis situation,” Okonjo-Iweala said on Monday during a virtual meeting.\n“We could even expect to see within 9 to 12 months vaccines being produced in Africa, in South Africa,” Swaminathan said.\nSouth Africa was also still pushing separately for a waiver to intellectual property rules governing COVID-19 vaccines."
  },
  {
    "headline": "There’s No Place In Nigeria We Have Not Impacted By The Positively – Buhari",
    "summarized_story": "President Muhammadu Buhari said on Monday that his administration has had a beneficial influence on infrastructure in all sections of the country.\nOn Monday, Buhari addressed at the inaugural APC Progressive Youth Conference, which was hosted at the International Conference Centre in Abuja.\nHe urged the youths to work for the betterment of the country as well as for themselves.\n“There is actually no part of the country that has not been impacted positively in the areas of infrastructure, agriculture and economic support initiative based on peculiarities of the regions.\nIt is the responsibility of every one of us to work towards the development and advancement of this country,” he said."
  },
  {
    "headline": "BREAKING: Buhari Names Ekpungu EFCC Secretary, Appoints Board Members After 6 Years",
    "summarized_story": "George Abang Ekpungu has been named Secretary of the Economic and Financial Crimes Commission by President Muhammadu Buhari (EFCC).\nBuhari also named members of the anti-graft agency’s board of directors, which is chaired by Abdulrasheed Bawa.\nLuqman Muhammad (South South), Anumba Adaeze (South East), Kole Raheem Adesina (North Central), and Yahya Muhammad (North Central) are the candidates (North East).\nSections 2 (1) and 4 of the Economic and Financial Crimes Commission Act, 2004 govern the appointment.\nGwandu recalled that the “EFCC has been operating without board members since 2015”."
  },
  {
    "headline": "Kemisola Ogunniyi: Release Of End SARS Protester Who Delivered Baby In Prison Stalled",
    "summarized_story": "The effort to free the 18-year-old End SARS protester who gave birth while in prison custody has stalled.\nThe bail application of Kemisola Ogunniyi, who was held for allegedly being involved in the arson committed in Akure during the demonstration, was denied by Justice Omolara Adejumo, who stated she was uninformed of the bail application by the defendant’s counsel.\nDuring the curfew imposed in Ondo State in the aftermath of the End SARS demonstration, Kemisola was arrested alongside three other accused.\nAccording to the Defendant’s Counsel, Tope Temokun, due to court process, his client’s bail will be considered on Tuesday.\n“There are procedures for all court matters, it was a court order that put the person in the custody and the court order has to be followed in securing her bail ."
  },
  {
    "headline": "How Buhari’s Promises Of Restructuring Gained Him Votes In 2015",
    "summarized_story": "The Minister told journalists in Awka, Anambra State, said the Buhari administration has already begun the restructuring process, beginning with the economy.\nA former presidential aide, Reno Omokri described Buhari’s promise as an election scam stating that it was the promise that gave him the victory in 2015.\n“Yet, Buhari made false promises to restructure Nigeria and obtained votes from Nigerians based on that.\nNow, he says he will NEVER restructure Nigeria.\nA respondent, Promise Emeka who spoke to DAILY POST in Abuja, said the president used restructuring to market himself during the election."
  },
  {
    "headline": "Sani-Bello’s order to special squad: Comb the forest and free 136 kid-abductees",
    "summarized_story": "Niger state Governor Abubakar Sani Bello has ordered a combined security squad to comb the forest and battle the bandits to rescue the 136 children abducted over two weeks ago.\nBello’s past outcryGovernor Sani Bello had at various times cried out to the federal government to come to his people’s aid who had remained under bandits’ siege.\n“Well, some of these people are saying insecurity is the major challenge in Oyo state.\nThey have nothing to offer the people of Oyo state apart from wanting to ride on the perception of insecurity to gain prominence.\n“In the days ahead, we will also let the people of Oyo State know the things we are doing as far as security is concerned."
  },
  {
    "headline": "Breaking: CAS reduces Siasia’s life ban",
    "summarized_story": "The Court of Arbitration for Sport (CAS) on Monday announced that it has reduced the life ban imposed on former Head Coach of Nigeria’s Super Eagles, Samson Siasia to five years.\nWorld football governing body, FIFA, had slammed Siasia with life ban over alleged match fixing scandal.\n“In 2010, a match fixer tried to involve Mr Siasia as a coach of a club under his strict instructions.\nWith the promise of employment benefits, Mr Siasia would have had to always field several players under the control of the match fixer.\n“The imposed fine of CHF 50,000 (fifty thousand Swiss Francs) on Mr Siasia is set aside."
  },
  {
    "headline": "Pictures: Flood takes over Ijebu Ode in Ogun",
    "summarized_story": "PreviousAPC needs Al-Makura to win in 2023"
  },
  {
    "headline": "FG to establish new Universities of Technology, upgrades existing ones -NigPilot",
    "summarized_story": "To stimulate rapid technological transformation of the country, the Federal Government has resolved to establish two additional Universities of Technology in Jigawa and Akwa Ibom States.\nAdamu said that the federal government would upgrade the four existing Universities of Technology located in Yola (North East), Akure (South West), Owerri (South East) and Minna (North Central).\nSonny Echono, the Minister revealed that plans are underway to establish a National Institute of Technology,NIT, in Abuja.\nAccordingly the 2nos new Universities of Technology will be established in 2021 while the upgrade of the existing 4nos Universities of Technology and the National Institute of Technology will come on stream next year.\nAdamu said president Buhari has approved a take-off grant of N4 Billion each for the Universities of Technology and N5Billion each for the Universities of Health Science from the funding Resources of Tetfund for early take-off."
  },
  {
    "headline": "Agba felicitates Ize-Iyamu on 59th birthday -NigPilot",
    "summarized_story": "Agba’s felicitations were contained in a personal letter to Ize-Iyamu, dated June 21, 2021, entitled “Birthday wishes to an exemplary leader”.\nThe minister said “there is no better time to appreciate and congratulate you than on the occasion of your very special birthday celebration, which also coincides with that of your priceless jewel, Prof. Mrs Idia Ize-Iyamu , an accomplished academic and humanitarian advocate.”He added that “As politician, I can say without equivocation that you have exhibited uncommon wisdom, remarkable vision, and exemplary leadership in the pursuit of your political goals.\n“I wish you and your heart-throb peace, good health, and happiness to stay with us and continue to contribute to building a legacy of focused and visionary leadership.\n“Once, again, I wish you and your very significant better half a wonderful anniversary.”"
  },
  {
    "headline": "Defend yourselves against bandits – Katsina Gov instructs residents -NigPilot",
    "summarized_story": "Governor Masari sounded that enough of residents running away from kidnappers, saying same banditry causing unrest in the State were created by them hence, they must stand firmly and fight to win over together.\nThe Governor urged COREN and other professional bodies to look inward toward checkmating standard professionalism.\nEarlier, COREN President, Egnr Ali RAbi’u said the Katsina office of COREN would in no small measures absorbing young professionals and build the professional standard among them.\nHe appreciated Katsina State government for providing edifice to operate and thanked Governor Aminu Bello Masari for supporting them in all areas of need.\n“Change the face of engineering practice in Katsina and in the country in general.”"
  },
  {
    "headline": "CVR: Success of exercise lies on citizens’ awareness – INEC Chairman -NigPilot",
    "summarized_story": "Independent National Electoral Commission, INEC, has stated that the success of the Continous Voter Registration, CVR exercise, slated to kick-start on Monday 28th June, lies largely with citizen’s awareness.\nChairman of the Commission, Prof. Mahmood Yakubu, made this known today, during the second quarterly meeting with media organisations at the INEC’s headquarters in Abuja.\n“We intend to undertake the CVR exercise over a period of at least one year.\nThe success of the exercise depends to a considerable extent on citizens’ awareness through voter education.\nFurthermore, with the relocation of voting points to underserved areas as autonomous polling units, there is need for massive publicity so that citizens are familiar with their voting locations well ahead of all forthcoming elections."
  },
  {
    "headline": "Those Waiting For Nigeria To Break Will Be Sorely Disappointed – Osinbajo",
    "summarized_story": "The Vice President, Professor Yemi Osinbajo, is confident that Nigeria will remain united as a strong nation to the frustration of those waiting to see the country broken into pieces.\nHe made the remark on Monday in Abuja at the maiden edition of the All Progressives Congress (APC) Progressives Youth Conference.\n“Even if that was true at some point, today, that notion stands on very weak legs indeed,” he said.\nThe event had in attendance APC youth leaders and older party leaders from various parts of the country, as well as top government officials.\nConversations at the conference centred on more youth inclusiveness in party politics and the positioning of young people for the 2023 general elections."
  },
  {
    "headline": "Suspected IPOB Members, Others Arrested Over Attacks On Police, INEC Facilities In Ebonyi",
    "summarized_story": "Dozens of suspected members of the Indigenous People of Biafra (IPOB)/ Eastern Security Network (ESN) have been arrested in connection with the attacks on police stations and offices of the Independent National Electoral Commission (INEC) in Ebonyi State.\nRead the full text of the police commissioner’s briefing below:PRESS BRIEFING/PARADING OF 60 SUSPECTS ARRESTED FOR DIFFERENT OFFENCES BY THE COMMISSIONER OF POLICE EBONYI STATE CP.\nThe gang are also responsible for the attacks on some government facilities and the killing of security agents in the area.\nThe said gang members were alleged to have fled the scene on sighting Police on the day he was arrested.\nI wish to thank immensely His Excellency, the Executive Governor of Ebonyi State, Chief Engr."
  },
  {
    "headline": "‘Night Operation, Chinese Connection’: How A Rail Vandalism Operation Thrived In Nasarawa",
    "summarized_story": "But they couldn’t make the arrest because the youths refused.”Another railway staff suggested that the youths were motivated by a sense of entitlement.\nChinese connectionThe youths, according to the police, were in cahoots with several top politicians, corrupt police officers and NSCDC staff, and Chinese nationals.\nThis month, the police announced that it had cracked down on a criminal syndicate engaged in vandalising rail tracks across the North-West and North-Central.\nInside the warehouse, the police discovered different vandalised rail equipment, stolen rail installation racks, weld-shear, rail puller, other rail accessories and consumables.\n“Removal of rail tracks can cause train derailment, with deadly consequences,” he said at a town hall meeting recently."
  },
  {
    "headline": "Five Killed, Four Injured As Police Inspector Opens Fire On Youths In Enugu",
    "summarized_story": "Five persons have been killed and four others injured after a Police Inspector went into a shooting frenzy in Enugu State on Sunday.\nThe police officer who reportedly attacked a neighborhood in Golf Estate, GRA, Enugu, is said to be attached to a lottery company within the area.\nConfirming the incident in a statement, the state police command said it was unclear what led to the sporadic shooting.\nHe further disclosed that the four others who sustained injuries are currently receiving treatment at the Enugu State University Teaching Hospital.\nThe police commissioner while sympathising with the family and friends of the deceased persons, urged them to remain calm while the police conclude their investigation."
  },
  {
    "headline": "Italy Says Face Masks Won’t Be Mandatory From June 28",
    "summarized_story": "Face masks will no longer be compulsory in Italy, one of the countries in Europe worst hit by the coronavirus, from June 28, the health ministry said Monday.\nThe lifting of the mask requirement would come into effect in regions labelled “white” under Italy’s classification system for how rapidly the virus is spreading, Health Minister Roberto Speranza wrote on Facebook.\nThe country has recorded 127,291 deaths since the pandemic reached it in early 2020, with 4.25 million infections.\nSo far 30 percent of people over 12 have been vaccinated, or around 16 million out of a population of 60 million.\nMore than 46 million vaccine doses have been administered in Italy."
  },
  {
    "headline": "Fulani leaders Pay Solidarity Visit To Kebbi State Governor",
    "summarized_story": "Leaders of Fulani communities in the twenty one local government areas of Kebbi state have paid a solidarity visit to the state governor Atiku Bagudu over the abduction of students of the Federal Government College Birnin Yauri.\nDuring the visit, the leader of the fulani groups in the state, Bello Aliyu Gotomoassured President Muhammadu Buhariof their resolve to compliment the effort of security agencies to eradicate banditry in the country.\nHe says they are also at the government house to show their willingness to join the ongoing fight to rescue the abducted students.\nGovernor Atiku Bagudu described the visit as a morale booster as the state is making effort to ensure bandits have no hiding place in all the twenty one local government areas of the state.\nThe governor was represented by his adviser on security matters, Major Garba Rabiu Kamba (rtd), also thanked other groups who visited and showed support and commitment to help the state government in tackling the new wave of crime in the state."
  },
  {
    "headline": "We will continue to improve business climate – FG",
    "summarized_story": "The Federal Government says it will continue to interact and engage with the Organised Private Sector (OPS) in the country, while improving the country’s business climate, in the full knowledge that the sector is the real engine room of growth and development, according to Vice President Yemi Osinbajo, SAN.\nResponding, the Vice President while welcoming the presentation, noted that “the private sector is the engine of growth, there is no way the Federal Government can do anything in the economy without the private sector.\nGod will continue to empower you.”The virtual interaction was also attended the Minister of Industry, Trade and Investment, Otunba Niyi Adebayo, among other senior government officials.\nResponding, the Vice President while welcoming the presentation, noted that “the private sector is the engine of growth, there is no way the Federal Government can do anything in the economy without the private sector.\nGod will continue to empower you.”The virtual interaction was also attended the Minister of Industry, Trade and Investment, Otunba Niyi Adebayo, among other senior government officials."
  },
  {
    "headline": "Ondo PDP formally requests for copies of Appellate Court Judgment",
    "summarized_story": "The People’s Democratic Party, PDP in Ondo State has formally requested the certified copies of the judgment of the appeal filed by the party and Mr Eyitayo Jegede over the October 10, 2020 Governorship election in the state from the Appellate Court.\nThe request addressed to the Deputy Chief Registrar of the Appeal Court, Akure Judicial Division and signed by the State party Chairman, Alhaji Fatai Adams was submitted by the State Legal Adviser, Mr Wole Awofade at the court in Akure.\nThe letter requesting for Appellate Court judgement, the State Legal Adviser, Mr Awofade said the request for the copies became necessary in view of the need to study it and aid the appeal of the judgment at the Supreme Court.\nMeanwhile, members of the PDP had gathered at the Party’s secretariat in Akure to stage a peaceful protest to the Appeal court over alleged plan to undermine the party’s decision to approach the Supreme Court."
  },
  {
    "headline": "Belgium Complete Perfect Euro 2020 Group Campaign With Win Over Finland",
    "summarized_story": "Belgium completed a perfect group campaign with a 2-0 victory over Finland at the European Championship on Monday.\nAn own goal and a Romelu Lukaku strike made the difference as the Belgians finished Group B play with nine points from three games as the head to the knockout stage.\nFinland, who finish the group in third, must await other results to learn if they will move on to the round of 16.\nBut a VAR review judged the Inter Milan striker was fractionally offside before the pass and overturned the goal.\nLukaku, then, got his goal soon after with a tidy turn and finish after receiving a De Bruyne pass with his back to goal — the powerful striker beating Hradecky to the near post with a well-struck right-footed shot."
  },
  {
    "headline": "Euro 2020: Denmark Thrash Russia to Honour Eriksen and Qualify For Round of 16",
    "summarized_story": "Denmark pulled off an emphatic 4-1 win over Russia at the Parken Stadium to qualify for the knockout stages of Euro 2020 as Group B rivals Finland lost to Belgium.\nThe Belgians swept to victory in the group, winning all three games, with Denmark taking second place on three points and Finland behind them on goal difference.\nMikkel Damsgaard fired the Danes in front with a stunning curling shot in the 38th minute, and Yussuf Poulsen pounced on a poor back pass from Roman Zobnin to score the second in the 59th.\nArtyom Dzyuba pulled one back from the penalty spot for Russia in the 70th minute but a thunderous strike from Andreas Christensen and a fourth from Joakim Maehle completed the rout.\nDenmark will meet Wales in the last 16 in Amsterdam on June 26."
  },
  {
    "headline": "Man City Make £100m Bid For Tottenham Striker Kane",
    "summarized_story": "Manchester City have made a £100m bid for Tottenham striker Harry Kane.\nCity are open to including players in addition to the cash offer, but Tottenham are expected to reject the bid.\nUK media reported last month that Kane had told Spurs he wanted to leave this summer with Man City, Manchester United and Chelsea the interested clubs.\nThe Premier League champions’ priority is to replace Sergio Aguero, with Kane being considered along with Erling Haaland, Romelu Lukaku and Lautaro Martinez.\nMan City begin their Premier League title defence by travelling to Tottenham on August 15."
  },
  {
    "headline": "Nigerian Court Awards $199m Damages Against ExxonMobil, NNPC Over Oil Spillage",
    "summarized_story": "A Nigerian Court has ordered the Mobil Producing Nigeria Unlimited and the Nigerian National Petroleum Corporation (NNPC) to pay oil communities in Ibeno Local Government Area of Akwa Ibom a cumulative damages of 81.9 billion over oil spillage.\nJustice Taiwo Taiwo of the Federal High Court, Abuja, in a judgement debt, ordered that the payment must be paid within 14 days, and failure of which eight per cent interest would be accruable on the principal sum annually.\nDelivering judgement on Monday in a joint suit instituted against the two defendants by the aggrieved oil producing communities, Justice Taiwo held that the American oil company and NNPC were negligent in the way they handled oil spills that caused environmental degradation in the communities.\nHowever, the judge held that the instant suit had to do with fundamental rights that cannot be rendered impotent by the statute of limitations.\nJustice Taiwo consequently awarded the sum of N42.8 billion as damages for intangible losses, N21.9 billion for special damages as annotated and N10 billion as general damages."
  },
  {
    "headline": "Nigeria Court Orders FG to Pay Bayelsa State $951 Million Derivative Arrears",
    "summarized_story": "A Federal High Court in the Nigerian capital, Abuja, on Monday, ordered the Federal Government to pay $951 million to the Bayelsa State Government.\nThe amount is the 13 per cent derivative sum due as arrears of revenue and payable to the Bayelsa government.\nJustice Ekwo ruled that the development made the court to declare the plaintiff’s case “unchanged.”The News Agency of Nigeria reports that Ken Njemanze filed the suit on behalf of the Bayelsa government.\nHe said the defendant (AGF) had admitted the claims of the Bayelsa government in the process the former filed in reaction to the suit.\nAccording to the Bayelsa government, the money had accrued from 2003 to 2017."
  }
]