[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Buhari appoints Nasiru Ila as SSA, National Assembly Matters",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Nasiru Ila as the Senior Special Assistant to the President on National Assembly Matters (House of Representatives).\nMalam Garba Shehu, the President’s media aide confirmed this development in a statement on Sunday in Abuja.\nIla, a product of Victory College, Alexandria and West London College, United Kingdom, was a successful businessman with interests in haulage, ginnery and tannery before his foray into politics.\nIn 2011 and 2015, he was voted into the lower chamber of the National Assembly as a member representing Tarauni Federal Constituency in Kano.\nAccording to the presidential aide, the Chartered member of the Association of National Accountants of Nigeria, (ANAN), replaces Umar El-Yakub who has been appointed Minister by the president."
  },
  {
    "headline": "Kogi: Bread to cost more as bakers call-off strike, resume production July 25",
    "summarized_story": "Kogi Master Bakers say they would call off their strike Sunday midnight and resume work Monday, July 25 with hike in prices of bread.\nThe Association had on Wednesday, July 20 joined the nationwide strike declared by its national body to press home some demands from the Federal Government regarding prices of materials used in Bread production.\n“By God’s grace by tomorrow, Monday July 25, we shall resume production of bread again after ending our strike midnight of Sunday, July 24.\n“Unfortunately, as we resume production, July 25, prices of bread will definitely increase by 20 per cent.\nBamidele-Adeniyi appealed to the government to ensure that the Sugar company in Bashuta commenced production and equally open opportunity for members to obtain the licence to import and obtain loans for better bread production."
  },
  {
    "headline": "No casualty on shooting at checkpoint in Enugu – Police",
    "summarized_story": "The Police Command in Enugu State says no life was lost at the incident involving a man and his girlfriend at a police checkpoint in the state capital.\nThis is contained in a statement issued by the Command’s Public Relations Officer, DSP Daniel Ndukwe, on Sunday in Enugu titled: “Police Setting Record Straight on Misleading Alleged Shooting of Man and Girlfriend Dead in Enugu”.\nNdukwe said that the incident took place on July 21 at about 2p.m at the EFCC Roundabout, Independence Layout, Enugu.\n“The attention of the Command has been drawn to a viral video alleging that the Police shot a young man and his girlfriend dead, at Monkey Roundabout, close to EFCC Office, Enugu’.\nThe police spokesman said that the commissioner had urged residents, particularly motorists, to always cooperate with police officers performing road duties, to avoid such occurrences."
  },
  {
    "headline": "PDP warns aspirant to stop legal action against Adeleke",
    "summarized_story": "The Peoples Democratic Party (PDP) has warned Prince Dotun Babayemi to stop further legal action against the Governor-elect, Sen. Ademola Adeleke, in the overall interest of the party.\nThe News Agency of Nigeria (NAN) recalls that Babayemi contested in the PDP primary in Osun that produced Adeleke as its candidate for the July 16 election.\nIt described as worrisome Babayemi’s refusal to listen to calls by elders of his group who urged him to discontinue legal challenge of the PDP primary in Osun.\nNAN reports that the PDP in Osun had on March 8 held two parallel governorship primary elections in the state.\nIn a list of candidates later released by the Independent National Electoral Commission (INEC), Adeleke emerged as the flag bearer of the PDP."
  },
  {
    "headline": "Terrorists kill farmer, driver in Katsina",
    "summarized_story": "By Ogalah IbrahimA gang of suspected terrorists, in two separate attacks killed a farmer and bus driver in Jibia and Batagarawa Local Government Area of Katsina State.\nThey shot him and took away his Hajoue motorcycle.”Barely an hour after they killed Ibrahim on his farm at Kore village, the terrorists attacked a commercial coastal bus belonging to Katsina State Transport Authority (KSTA) and killed it’s driver identified as Nasir Yushau.\nThe KSTA Coastal Bus with full load of passengers was heading to Katsina from Jibia when the hoodlums attacked it and killed the driver.\n“The vehicle was heading to Katsina from Jibia to Katsina, at about 11a.m when he ran into the bandits.\n“Since then, we have not heard any report that one of the passengers in the car is missing during the attack,” he said."
  },
  {
    "headline": "Royal family confirms passage of Oyo monarch, Aseyin",
    "summarized_story": "The royal family in Iseyin, Oyo State, has confirmed the passage of the Aseyin of Iseyin, Oba Abdulganiy Salawudeen Adekunle.\nDAILY POST had earlier reported that the monarch has joined his ancestors.\nThe family in a statement signed by Prince Femi Olalere, Secretary, Aseyin Royal Family, said that the monarch joined his ancestors at the age of 62.\nThe family maintained that the monarch died in the early hours of Sunday.\nThe statement said, “The entire Aseyin Royal Family regrets to announce the transition of our father and Aseyin of Iseyin, Oba Dr. Abdulganiy Salawudeen Adekunle Oloogunebi Ajinese 1, which happened on the wee hours of Sunday, the 24th July, 2022 after a protracted illness."
  },
  {
    "headline": "GMO foods safe for human consumption in Nigeria- NBMA assures",
    "summarized_story": "The Director General of the National Biosafety Management Agency(NBMA), Dr. Rufus Ebegba, has restated that all approved Genetically Modified Organisms(GMOs) or food crops in Nigeria are safe for human consumption.\nIn her remarks, Dr. Rose Gidado, Country Coordinator, Open Forum on Agricultural Biotechnology(OFAB) in Africa, Nigeria Chapter, expressed joy at the giant strides made in the application of agricultural biotechnology in Nigeria.\nGidado noted that a delegation from Ghana was recently in Nigeria to understudy the milestones recorded in the country’s efforts to use agricultural technology to feed her teeming populace.\nAbeikwen pointed out that agricultural biotechnology appears to have provided answers to a myriad of challenges confronting the agricultural sector.\n“With this action, Nigeria joined other countries like South Africa that have approved genetically modified food crops in Africa,” he explained."
  },
  {
    "headline": "Ogun declares Tuesday work-free for PVC registration",
    "summarized_story": "As the deadline for registration of voters for 2023 General Elections comes to a close on Sunday, 31st of July, the Ogun State Governor, Prince Dapo Abiodun, MFR has declared Tuesday, 26th July, 2022 as a work-free day in the State.\nIn a Statement issued in Abeokuta on Sunday by his Chief Press Secretary, Kunle Somorin, the Governor said the “one-day public holiday is to provide a window for all workers in the state, who have either lost their cards, not registered or who might need to travel to their wards, local government areas and constituencies to perfect their Permanent Voters Registration or transfer their cards, where necessary, to enable them participate in the next general elections”.\n“As an inclusive, participatory and accountable government, the role of PVCs to the citizens cannot be overemphasised,” the statement added.\nThe Governor, therefore, urged all eligible adults to seize the opportunity of the holiday to go home to their different wards and constituencies to search for their Registered Voter Cards (PVCs), fill the claims and objections forms and transfer the PVCs where necessary, the statement concluded."
  },
  {
    "headline": "Gov. Buni condoles Senator Ndume over father’s death",
    "summarized_story": "Governor of Yobe State, Mai Mala Buni was in Maiduguri to condole with Senator Mohammed Ali Ndume, the Borno State APC Chairman, Bukar Ali Dalorima and the family of late Umar Kareto.\nGovernor Buni through his Spokesperson, Mamman Mohammed commiserated with Ndume over the loss of his father, Ali Ndume, the APC Chairman who lost his elder sister and the family of his political associate, Umar Kareto, who died two weeks ago.\nBuni described the death of the deceased persons as a painful loss to the families and the community.\nThe Governor while praying for the repose of the souls of the deceased persons also prayed to Allah to grant their families the fortitude to bear the irreparable loss of their loved ones."
  },
  {
    "headline": "ASUU strike, fuel crisis, insecurity: Pastor Enenche fires fresh shots, tackles Buhari’s govt",
    "summarized_story": "Senior Pastor of Dunamis International Gospel Center, Dr Paul Enenche has again, berated President Muhammadu Buhari’s government over the current state of the nation.\nHe said the security crisis bedevilling the nation currently was lesser prior to the emergence of the current government.\nHe said, “It looks like there are some people in collaboration with the powers of hell to finish this country totally.\n“The promise we had was that security would be tackled, corruption, poverty and others would be tackled.\nSecurity is worst than at any time in the history of our nation."
  },
  {
    "headline": "Terrorists threaten to abduct Buhari, El-Rufai The Nation Newspaper",
    "summarized_story": "Terrorists have threatened to abduct President Muhammadu Buhari and Kaduna Governor Nasir el-Rufai.\nIn the now-viral video seen by The Nation, captives were subject to inhumane treatment.\n“Just like the Chibok girls that were sold off, we will equally sell these ones as slaves.\nIf you don’t adhere to our demands, we will kill the ones we need to kill and sell the remaining.\n“By God’s grace, el-Rufai, Buhari, we will bring them here.”"
  },
  {
    "headline": "DHQ mum on abducted Kaduna train passengers' video The Nation Newspaper",
    "summarized_story": "The Defence Headquarters has declined comments on the viral video of bandits manhandling abducted victims of the Kaduna train attack.\nThe bandits in the video threatened to sell off the victims after killing others in the video that has elicited public anger.\nEfforts to get the Military hierarchy to comment on the video were abortive.\nThe Director of Defence Information Major General Jimmy Akpor, didn’t take his calls or respond to messages from The Nation.\nHowever a senior Military officer, who spoke on anonymity, said they were not aware of the viral video"
  },
  {
    "headline": "#BBNaija S7: Meet last 12 housemates The Nation Newspaper",
    "summarized_story": "Day two of the Big Brother Naija Season Seven saw 12 new housemates join the already unveiled twelve making a total of twenty four housemates.\nThe new twelve housemates were however separated from the first set from day one opening.\nHere are the first 12 Housemates for the current edition.\nBellaBelieves people would want to watch the season seven edition because of her while assuring that she is the life of the party.\nHermesHe is certain that he would win fans because he’s brining every aspect of who he is into the house."
  },
  {
    "headline": "RASHEEDAT AJIBADE: How I got my second degree during lockdown The Nation Newspaper",
    "summarized_story": "From Mushin to Spain, Taiwo Alimi reports the phenomenal grass to grace rise of Nigeria’s newest goal-queen, Super Falcons’ star Rasheedat Ajibade.\nNigeria and Atletico Madrid forward Rasheedat Ajibade has been talking about her phenomenon rise from Mushin-Lagos-based local team Robo FC to Spanish giant club-side Atletico Madrid.\nShe was named in the WAFU team that finished third in 2018 and was named in the title-winning Nations Cup team later that year.\nAjibade was named in Nigeria’s team that got to the second round of the FIFA Women’s World Cup in 2019.\nRelishing the triumph and qualification for the 2023 Women’s World Cup, to be co-hosted by New Zealand and Australia, she wrote on her Twitter handle: “Every time I call, he answers me."
  },
  {
    "headline": "I've told Service Chiefs to tackle terrorism",
    "summarized_story": "President Muhammadu Buhari has disclosed that he is putting Service Chiefs on their toes to come up with decisive solution to the nagging insecurity crisis facing the country.\nThe President disclosed this while reacting to the killing of the brother and abduction of a sister of former National Chairman of the People’s Democratic Party (PDP) Adamu Muazu.\nThis double tragedy is particularly moving.\nI know it’s hard to cope with the weight of this tragedy in your family.\nHe prayed to God “to forgive the soul of the deceased and grant the family fortitude to overcome this double tragedy.”"
  },
  {
    "headline": "Taraba, South West states should brace for heavy flooding -NiMet – The Sun Nigeria",
    "summarized_story": "By Chinelo ObogoNigerian Meteorological Agency (NiMet) has advised Nigerians in states inluding Taraba and some parts of the South West areas to prepare for impending flooding.\nDirector General of NiMet, Prof. Mansur Matazu, who spoke said Nigerians should prepare for flooding in some parts of the country adding that the climate change has affected the activities across the world.\nHe expressed displeasure that most states and local governments are not connected to the national level in adherence to early warnings by not aligning to their activities.\nHe also stressed the need for MDAs to take all the advice from NiMet to mitigate the impact of flooding and called for adequate compliance.\nMatazu, urged Nigerians to desist from pouring refuse into the water channels and to stop building on water ways to mitigate flooding."
  },
  {
    "headline": "Outrage over video of terrorists brutalising Abuja-Kaduna kidnap victims",
    "summarized_story": "An aggrieved All Progressive Congress (APC) chieftain in Niger state, Mr. Jonathan Vatsa, also lambasted President Buhari, saying the APC government has failed Nigerians in all ramifications.\nFormer president of Aka Ikenga, Chief Goddy Uwazurike, equally agreed that indeed, President Buhari has failed in his primary responsibility under the constitution.\nPresident Buhari has failed to guarantee that.\nThat is why terrorists in this video called the committee set up by the government as ‘Tea drinking committee’.\n“When terrorists post video clips of the torture of their victims, they are waging a psychological war to bring attention to their demands."
  },
  {
    "headline": "NDLEA arrests 8 over Lagos, Abuja, Enugu airports cocaine busts",
    "summarized_story": "He has since completed excreting all the 76 wraps of the drug he swallowed while under observation at the agency’s facility in Abuja,” Babafemi disclosed in the statement.\nThe statement further read: “In the same vein, another father of three, Lawrence Chijioke, 42, was arrested at the Abuja airport the same day, in an operational synergy between NDLEA and Nigeria Customs Service at the NAIA.\n“NDLEA operatives, also, on Saturday, arrested 29-year-old Ms. Onuorah Caritas Onyinye at the Enugu airport, upon arrival on Ethiopian airline flight from Addis Ababa.\nA search of her luggage led to the discovery of 2.192 kilograms of cocaine concealed in two designer’s women handbags with false linings.\nIn Kaduna, a driver Jamilu Lawal, was arrested penultimate Sunday, along Abuja-Kaduna expressway, with 157,000 tablets of diazepam weighing 37.5kg."
  },
  {
    "headline": "Vote buying: INEC tasks NASS on speedy passage of electoral offences commission bill",
    "summarized_story": "The Independent National Electoral Commission (INEC) has said the speedy passage of the National Electoral Offences Commission and Tribunal Bill by the National Assembly would checkmate vote buying.\nAgbaje, however, said the battle against vote buying, in whatever shapes or forms, must be fought to a standstill by all stakeholders in Nigeria.\n“That is why the commission has been asking the National Assembly regularly to finish its work on the electoral offences commission and tribunal bill to become law.\nHe said security, judiciary, INEC, National Assembly, political parties, NGOs and other critical stakeholders had roles to play in fighting vote buying and vote selling.\nHe also decried the delay in prosecuting electoral offences in Nigeria, describing it as frustrating."
  },
  {
    "headline": "FGCs shut abruptly over rising insecurity in Abuja",
    "summarized_story": "From Fred Ezeh, AbujaFederal Ministry of Education has directed closure of Federal Government Colleges (FGCs) located in FCT and ordered immediate evacuation of students.\nIt was gathered that the decision was as a result of rising insecurity and threat to the lives, security and wellbeing of the students therein.\nA senior staff at FGGC, Bwari, said the directive they received from the Federal Ministry of Education was that students should vacate the school before Wednesday.\nI also learnt that Federal Government Technical College, Orozo, Abuja, sent children packing since Friday last week, immediately they rushed them to finish the examination as against the calendar.\nHowever, a senior staff of the Ministry admitted that the situation was not normal and it could be because of the rising insecurity at the fringes of Abuja where the schools are located, and the need to secure the lives of the students that prompted the decision to shut the schools abruptly."
  },
  {
    "headline": "Muslim-Muslim Ticket: Atiku Fires Another Shot, Says Tinubu Suffering from Memory Loss – THISDAYLIVE",
    "summarized_story": "Peoples Democratic Party presidential candidate, Atiku Abubakar, has reacted to the claim by presidential candidate of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu, that it was Atiku that offered him vice presidential ticket in 2007, saying the APC candidate may be suffering from memory loss.\nTinubu Campaign had swiftly reacted to the interview, claiming it was indeed Atiku that offered Tinubu to be his running mate in the 2007 presidential election.\nReacting Sunday night, Atiku Campaign, in a statement said: “We would not say that Bola Tinubu has lied.\nWhich is exactly the same false allegation he has made against Atiku Abubakar.\nSigned:Paul Ibe,Media Adviser to Atiku Abubakar, Presidential candidate of the Peoples Democratic Party and Vice President of Nigeria, 1999-2007."
  },
  {
    "headline": "Breaking 30-year-old African 4x100m Record, A Big Deal, Says Ofili – THISDAYLIVE",
    "summarized_story": "The previous African record of 42.39secs was set by the Christy Opara-Thompson, Beatrice Otondu, Faith Idehen and Mary Onyali-Omagbemi at Barcelona Olympic Games in 1992.\n“Breaking the African record is a big deal for us, because we didn’t practice until two weeks ago,” gushed Ofili who last April send Blessing Okagbare’s four-old national 200m record to archive reporters early hours of yesterday.\n“I really wasn’t expecting that (the African record),”.\nThe 25-year-old Amusan started with Alozie’s 12.74 seconds African Games record set in Johannesburg, South Africa in 1999.\nShe broke the Games record twice in 2019 in Rabat, Morocco."
  },
  {
    "headline": "Ajibade is Joint Top Scorer in S’Africa Dominated WAFCON 2022 Award List – THISDAYLIVE",
    "summarized_story": "Super Falcons’ Rasheedat Ajibade was listed as joint top scorer of the just concluded 2022 Women’s Africa Cup of Nations in Morocco.\nAjibade, South Africa’s Hilda Magaia and Moroccan Captain, Ghizlane Chebbak, emerged top scorers of the 12th WAFCON in Morocco.\nAt the heart of this success was goalkeeper Andile Dlamini who kept three clean sheets in the six games that Banyana Banyana played at this tournament.\nSouth Africa, who were named the National Team of the Year, also won the Fair Play Team award.\nThe Moroccan Captain Chebbak whose performance consistently wowed everyone during the tournament was named as the Player of the Tournament."
  },
  {
    "headline": "…NFF Salute Ajibade, Mimi Calvin-Onwuka – THISDAYLIVE",
    "summarized_story": "The Nigeria Football Federation (NFF), yesterday congratulated Super Falcons’ forward, Rasheedat Ajibade, for emerging as joint top-scorer of the just-ended 12th Women Africa Cup of Nations finals in Morocco, where the Super Falcons earned a ticket to the FIFA World Cup finals even as the team failed to realise its ambition of a 10th triumph.\nNFF General Secretary, Dr Mohammed Sanusi said: “We rejoice with Rasheedat Ajibade for her emergence as joint top-scorer of the tournament and we implore her to continue to show even more prolificity and commitment in the jerseys of club and country.\n“Her three goals surely helped the Super Falcons to win a World Cup ticket.\nOur team would certainly have been in the Final if not for the incident that led to her expulsion in the semi-final match against the host nation.\nHe urged her to continue to develop herself with available top-level courses and programmes in order to continue her rise to global reckoning."
  },
  {
    "headline": "SNEPCo Junior Tennis Masters to Kick off Tuesday – THISDAYLIVE",
    "summarized_story": "The SNEPCo National Junior Championship will this year hold as the SNEPCoo Junior Tennis Masters featuring the best four players in the Boys and Girls’ 12s and 16s.\nThe tournament will take place at the Luik Tennis Recreation Centre – a country club in the heart of Lekki Phase One in Lagos.\nAccording to the International Tennis Academy (ITA), organisers of the championship, the players are selected based on their performance in the recently concluded MTN Junior Tennis League Championship with wild cards for the No.1s in the 10s and 14s.\n“The aim is to isolate the top players in the age categories and motivate them to aspire for excellence at the senior level at the shortest possible time.\nThe tournament is planned to end on Saturday July 30with a grand finale."
  },
  {
    "headline": "Alleged N109Billion Fraud: High Court Remands Suspended Nigerian Accountant-General, Idris In Kuje Prison",
    "summarized_story": "A Federal Capital Territory High Court, Abuja has ordered that the suspended Accountant General of the Federation, Ahmed Idris, be remanded in Kuje Correctional Centre pending the hearing and determination of his bail application.\nThe Economic and Financial Crimes Commission had arraigned Idris alongside three others on 14 counts of stealing and criminal breach of trust to the tune of N109, 485,572,691.9.\nOthers arraigned with him are Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nThe EFCC had accused Idris and his co-defendants of stealing and criminal breach of trust to the tune of N109.5 billion.\nMinister of Finance, Zainab Ahmed thereafter suspended Idris indefinitely without pay."
  },
  {
    "headline": "Alleged N109Billion Fraud: High Court Remands Suspended Nigerian Accountant-General, Idris In Kuje Prison",
    "summarized_story": "A Federal Capital Territory High Court, Abuja has ordered that the suspended Accountant General of the Federation, Ahmed Idris, be remanded in Kuje Correctional Centre pending the hearing and determination of his bail application.\nThe Economic and Financial Crimes Commission had arraigned Idris alongside three others on 14 counts of stealing and criminal breach of trust to the tune of N109, 485,572,691.9.\nOthers arraigned with him are Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nThe EFCC had accused Idris and his co-defendants of stealing and criminal breach of trust to the tune of N109.5 billion.\nMinister of Finance, Zainab Ahmed thereafter suspended Idris indefinitely without pay."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Amaechi: Delegates who sold votes at APC presidential primary are regretting",
    "summarized_story": "Rotimi Amaechi, a former minister of transportation, says delegates who sold their votes at the All Progressives Congress (APC) presidential primary are regretting their actions.\nAmaechi, a former governor of Rivers state, polled 316 votes and was second in the exercise.\nBola Tinubu, a former governor of Lagos, clinched the ticket after securing over 1,000 votes.\nAdvertisementThe former minister said the prayer should be for Nigerians to vote for the right person to govern the country.\nThose who voted at the APC primary, who are they?"
  },
  {
    "headline": "Amaechi: Delegates who sold votes at APC presidential primary are regretting",
    "summarized_story": "Rotimi Amaechi, a former minister of transportation, says delegates who sold their votes at the All Progressives Congress (APC) presidential primary are regretting their actions.\nAmaechi, a former governor of Rivers state, polled 316 votes and was second in the exercise.\nBola Tinubu, a former governor of Lagos, clinched the ticket after securing over 1,000 votes.\nAdvertisementThe former minister said the prayer should be for Nigerians to vote for the right person to govern the country.\nThose who voted at the APC primary, who are they?"
  },
  {
    "headline": "Fashola: Right-thinking Nigerians will vote for APC in 2023 -- we have served efficiently",
    "summarized_story": "Babatunde Fashola, minister of works and housing, says right-thinking Nigerians will vote for the All Progressives Congress (APC) in the 2023 general election.\nThe minister was asked about Nigerians’ perception of the APC and if the party will be re-elected for the presidency in 2023.\nResponding, Fashola said the party will be re-elected based on what it has done for Nigerians, compared to previous governments.\n“On a very deep reflection, right-thinking and well-meaning Nigerians will re-elect our party into governance, I am optimistic about that.\n“I think we have served this country as efficiently as we can — in the most difficult of times."
  },
  {
    "headline": "Fashola: Right-thinking Nigerians will vote for APC in 2023 -- we have served efficiently",
    "summarized_story": "Babatunde Fashola, minister of works and housing, says right-thinking Nigerians will vote for the All Progressives Congress (APC) in the 2023 general election.\nThe minister was asked about Nigerians’ perception of the APC and if the party will be re-elected for the presidency in 2023.\nResponding, Fashola said the party will be re-elected based on what it has done for Nigerians, compared to previous governments.\n“On a very deep reflection, right-thinking and well-meaning Nigerians will re-elect our party into governance, I am optimistic about that.\n“I think we have served this country as efficiently as we can — in the most difficult of times."
  },
  {
    "headline": "FG: Lagos-Ibadan road, Second Niger Bridge to be ready by December",
    "summarized_story": "Babatunde Fashola, minister of works and housing, says the Lagos-Ibadan expressway and the Second Niger Bridge will be completed by Decemeber 2022.\nThat road has no less than 40,000 vehicles every day that’s the traffic road count that we did, so you can’t close it down.\nMeanwhile, speaking on the completion date for the Second Niger Bridge, the minister assured Nigerians that the road would be opened for use by December 20222.\nAdvertisement“We’re planning also before Christmas to open that (Second Niger Bridge) to public for use, because that’s when there’s a large movement.\nThere are challenges of course, as you might know, but the main bridge deck is finished,” Fashola said."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "From Nigeria to the UK with the Global Talent Visa",
    "summarized_story": "When writers Ope Adedeji and Chika Jones decided to apply for the UK Global Talent Visa, both thought the process would be like all other visa applications—grueling and 3 months long, filled with insurmountable documentation, and lingering interviews.\nMany more are looking to take advantage of this opportunity, and if you’re one of them, here’s how 2 exceptionally talented individuals japa-ed with the UK Global Talent Visa.\nExceptional Talent v Exceptional PromiseThe first stage of applying for the UK Global Talent Visa is getting endorsed by any of 6 relevant endorsing bodies.\nUnlike other visa applications where you have to book interviews at consulates, the Global Talent Visa has 6 governing bodies that review applications from applicants who can bid for the visa under 2 circumstances: Exceptional Talent or Exceptional Promise.\nThe best part about the Global Talent Visa, according to Koroye, is that awardees don’t have to be in the UK all year round."
  },
  {
    "headline": "Netflix loses 970,000 subscribers in Q2",
    "summarized_story": "Yesterday, global streaming service Netflix announced via its Q2 2022 financial results that it lost 970,000 subscribers in the second quarter of the year.\nAccording to Netflix, over 100 million of its 222 million paying subscribers are sharing their passwords with people outside of their households.\nNetflix, however, still has the biggest share of the streaming service market with 220 million subscribers while Amazon’s Prime Video holds 200 million, while Disney+ and HBO Max hold 87.6 million and 74 million subscribers respectively.\n1 million subscribers in Q3The service also plans to keep its top spot and add 1 million subscribers to its tally by Q3.\nWhile its total number of subscribers might have declined by 970,000, its year-on-year revenue, however, increased by 9% in Q2 2022."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How to navigate delivery apps and traditional logistics companies in Lagos and Kaduna",
    "summarized_story": "This time, we’ll be talking to three business owners about their experiences with delivery and logistics in the bustling city of Lagos and the ancient Kaduna town.\nKachiThey eventually did the delivery, but that was it for me; I just went back to my individual rider companies.\nBut…I think logistics companies that focus on other forms of logistics have no business with the food business because, first off, the margins are very low.\nAt first, I was using all these normal bike logistics companies for deliveries within Kaduna.\nDelivery within Kaduna used to cost ₦500 ($1), but the people using cars were charging ₦1,000 ($2) or ₦1,500 ($3)."
  },
  {
    "headline": "Co-tenant kills policewoman in Benin – Nigerian Observer",
    "summarized_story": "Our reporter learnt that the suspect, Collins Anthony is a commercial pepper grinding machine operator inside Uselu market, Benin City.\nThe room where she was attacked is said to be rented by her lover, one Patrick Ishiaka, a security personnel in a commercial bank.\nContacted, Mr Patrick Ishiaka expressed sadness over the Killing, saying “ I cannot denied her, we were in a relationship, I know her children, brothers….’’.\nThis led to the arrest of the suspect Collins Anthony.\nAttempt to obtain comments from the suspect Collins Anthony failed."
  },
  {
    "headline": "Edo harps on community hygiene to check spread of diseases – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Primary Health Care Development Agency (EDSPHCDA), has urged members of the public to practice good community hygiene as part of preventive measures against monkeypox, measles, Lassa fever, coronavirus and other communicable diseases.\nShe urged healthcare providers in primary healthcare centres to be more careful and avoid direct contact with blood and other body fluids while caring for sick persons, to avoid being infected with Lassa fever and other communicable diseases.\nThe Health Educator for Egor LGA, Mr. Eghosa Omoregie said Lassa fever which is from the Lassa virus is transmitted to humans through contact with food or household items contaminated with rodent urine or faeces.\nAccording to him, the prevention of Lassa fever relies on promoting good community hygiene to discourage rodents from entering homes.\nHe added that storing grains and other foodstuffs in rodent-proof containers and disposing of garbage far from the home could reduce the risk of contracting Lassa fever."
  },
  {
    "headline": "Edo takes census of public, private schools, reviews impact of EdoBEST – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Government has said the ongoing census of public and private schools in the state will help in improving the standard of education in the state.\nAccording to her, “A census was carried out in October 2017 before the launch of Edo Basic Education Sector Transformation (EdoBEST) Programme.\nFor the private schools, we need to have a conversation with all private school proprietors and basically remind them what the standards are.\nSo for us, the purpose of the school census is not punitive at all.\nWe want to get a clear picture of what the situation is for both public and private schools then we’ll now sit down together with all stakeholders and come up with the way forward.”Share this: TweetWhatsAppEmailPrint..."
  },
  {
    "headline": "Edo assures completion of ongoing road projects, urges residents support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Government has assured residents that ongoing road construction projects by the Governor Godwin Obaseki-led administration in different communities across the state will be completed in good time.\nThe Chairman of the Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC), Pastor Kennedy Osifo gave the assurance while briefing journalists in Benin City.\nOsifo said Governor Obaseki is investing in road construction as part of the plans to make Edo great again, ensuring more communities are opened to boost economic activities and guarantee improved livelihoods for Edo people.\nIn Ekosodin, road projects have been completed; while work has intensified on Ekiadolor road, from the Lagos-Benin Express Road down to Akure.\nThere is massive road construction work on the Federal College of Education Road; we have just a few kilometers left to finish that project."
  },
  {
    "headline": "Vince McMahon retires as WWE boss amid sexual misconduct allegations",
    "summarized_story": "Vince McMahon, World Wrestling Entertainment (WWE) boss, who turned the firm from a regional player to global giant, says he will retire amid a flurry of misconduct claims.\nHe stepped down from his roles in WWE last month following reports he paid millions to suppress allegations of sexual misconduct and infidelity.\nMr McMahon remains WWE’s majority shareholder.\nThe women – all former employees of WWE – signed agreements with Mr McMahon that barred them from discussing their relationships with him in exchange for the payments.\nAs the sport grew, Mr McMahon leveraged his abrasive and bombastic personality to become one of its most recognisable faces."
  },
  {
    "headline": "Deji Adeleke to brother: I ‘ll criticize you if you derail as governor",
    "summarized_story": "Deji Adeleke, Pro Chancellor of Adeleke University, has told his brother and Osun State governor-elect, Senator Ademola Adeleke, that he won’t hesitate to criticize him if he derails from the development agenda promised the people.\nDeji, father of Davido, popular musician, while speaking at the 8th undergraduate and 4th postgraduate convocation of the University, said the governor-elect has no reason to fail the people that trusted him with the mandate.\n“Untill a Director started calling to make sure that those people reported to where they are supposed to, otherwise my brother wouldn’t have been the governor-elect today.\nBecause if you cannot hold a government accountable then we don’t have any future in this country.\nHe added that the University graduated 28 Ph.D students, 55 with Master’s degrees, one with MPhil Ph.D and three students of Post Graduate Diploma (PGD)."
  },
  {
    "headline": "IPOB lauds UN for requesting release, compensation of Nnamdi Kanu",
    "summarized_story": "The Indigenous People of Biafra (IPOB), has praised the United Nations (UN) over its opinion that the Nigerian Government should release its detained Leader, Mazi Nnamdi Kanu.\nThe separatist group in a statement by its Media and Publicity Secretary, Emma Powerful, commended the UN Working Group for the position, saying it has vindicated Kanu who is being persecuted for demanding the freedom of Biafrans.\nIPOB also commended Kanu’s lawyer, Bruce Fein for his professional work that led to the breakthrough with UN.\nIt is indeed a great milestone for our Leader Mazi Nnamdi Kanu, the IPOB and Biafrans worldwide.\n“It is our hope that Nigeria, as a member of the United Nations, will take heed and promptly obey and implement the UN directives to the letter."
  },
  {
    "headline": "Zenith Bank keeps spot as Nigeria’s leading Tier-1 bank for 13th consecutive year",
    "summarized_story": "OBINNA EZUGWUNigeria’s leading lender, Zenith Bank Plc, has for the 13th consecutive year, been ranked as the Number One Bank in Nigeria by Tier-1 Capital in the 2022 Top 1000 World Banks Ranking published by The Banker Magazine.\nFor nearly a decade and a half, has retained its position as the number one Tier-1 bank in Nigeria with a Tier-1 Capital of $2.75 billion, emerging as the 460th Bank globally.\nThe ranking, which was published in the July 2022 edition of The Banker Magazine of the Financial Times Group, United Kingdom, was based on the 2021 year-end Tier-1 capital of banks globally.\nTier 1 Capital describes capital adequacy, which is the core measure of a bank’s financial strength from a regulator’s point of view.\nAccording to the ranking, Tier 1 Capital, as deﬁned by the latest Bank for International Settlements (BIS) guidelines, includes loss-absorbing capital, i.e."
  },
  {
    "headline": "SEC Implementing Initiatives to Boost More Listings – Yuguda",
    "summarized_story": "The Securities and Exchange Commission (SEC) has said that it has been implementing measures aimed at encouraging more listings by creating new Rules and amending existing ones, improving general review processes, continuing engagements with issuers, advisers and other critical stakeholders.\n“You may be aware that the Commission is in the implementation phase of a comprehensive market and institutional reform program – the Capital Market Masterplan that is intended to reposition the Nigerian Capital Market to be globally competitive.\nThe reviewed plan is expected to guide further development of the capital market so as to attract more funds for economic growth and development” he stated.\nThis is to align the law with current realities and global trends in capital market regulation, including growing changes in market practices, processes and products.\n“We have consistently focussed on the creation of an ecosystem in which governments, entrepreneurs and other issuers can efficiently access capital."
  },
  {
    "headline": "Tsokaci A Kan Mazan Da Ba Su Barin Matansu Su Fita Aiki",
    "summarized_story": "Tsokacin mu na yau zai yi duba ne game da irin mazan da ba sa barin matansu su fita su yi aiki ko da kuwa sun kammala karatunsu, shin kishi ke janyo hakan ko sabanin haka.\nDa yawan mazaje na hana matayensu fita zuwa aiki ko da kuwa sun samu aikin da suke bukatar yi, amma mazan sai su ki barin matan nasu.\nHaka kuma duk macen da ta so ta lalace za ta lalace, duk macen da ba ta so ta lallace, ba za ta lalace ba ko da kuwa kullum za ta fito titi tana yawo, sai dai kaddara wadda ta riga fata in ji masu iya magana.\nTabbas ko da ace mata ta ba ta da ra’ayin aiki sai na tilasta ma ta yin aikin ko kuma ta sa mi sana’ar hannu me karfi.\nShawara don fahimtar da mazan shi ne a saka su fahimci addini da abun da ya hana da abun da bai hana ba , sannan su karanci al’ada."
  },
  {
    "headline": "Ban Nemi Kowa Don A Ba Ni Sarauta Ba – Aleiro",
    "summarized_story": ""
  },
  {
    "headline": "Da Dumi-Dumi: ‘Yan Bindiga Sun Kashe Mutane 3, Sun Sace Matafiya Da Dama A Katsina",
    "summarized_story": ""
  },
  {
    "headline": "Kasar Sin Ta Harba Muhimmin Bangare Na Dakin Bincike Na Farko Na Tashar Sararin Samaniyarta",
    "summarized_story": ""
  },
  {
    "headline": "Jami’an Tsaro Sun Kashe Mahara 2 A Anambra, Sun Kwato Makamai",
    "summarized_story": ""
  },
  {
    "headline": "Why I am shocked, outraged again",
    "summarized_story": "President Muhammadu Buhari on Sunday said he is shocked and outraged by the killing of the brother and abduction of the sister of former PDP National Chairman, Alhaji Adamu Muazu.\nThe president, in a condolence message, sympathised with Muazu, over the killing of his brother and abduction of his sister by bandits.\nBuhari, in a statement by his spokesman, Garba Shehu, said: “I am shocked and outraged by the story of the killing of your brother and the abduction of your sister by bandits.\nThis double tragedy is particularly moving.\nI know it’s hard to cope with the weight of this tragedy in your family."
  },
  {
    "headline": "How Lagos businessman Osundiya was killed in Kwara",
    "summarized_story": "By Afusat Agunbiade-OladipoThe Police Command in Kwara has confirmed the killing of a Lagos based businessman, Biola Osundiya, 40, who came to Kwara to spend time with his family in a yet to be unraveled circumstance.\nOKasanmi Ajayi, made this known on Sunday in Ilorin, saying that the police were still on the trail of the killers.\n“We can’t say for now whether the killing was cultist or business related, but an AK-47 ammunition was recovered from the scene beside Kwara State Center for Art and Culture, ilorin.\n“He was initially based in Ilorin, Kwara State where his two wives and children still reside but recently relocated to Lagos to start cement business,” the source added.\nThe deceased younger brother, Segun, who confirmed the incident, said the development had left his family and friends devastated."
  },
  {
    "headline": "BBNaija S7: Biggie Introduces New Twist, Unveils 13 New Housemates",
    "summarized_story": "The producers of Big Brother Naija have, for the first time in the reality series’ history, included a fresh twist that will keep viewers riveted to their TVs.\nDuring the second premiere of the “level up” edition, the show’s host, Ebuka Obi Uchendu, revealed a second house.\nIt is unclear, though, whether residents of the two residences will be pitted against one another.\nRecall that during the first unveiling on Saturday, 13 housemates were revealed.\nEbuka welcomed 12 new housemates to the new home on Sunday."
  },
  {
    "headline": "JUST IN: VP Osinbajo Speaks On Surgical Operation",
    "summarized_story": "JUST IN: VP Osinbajo Speaks On Surgical OperationVice President Yemi Osinbajo, SAN, has expressed his deep gratitude to Nigerians and everyone following his recent successful surgery.\nProf. Osinbajo underwent a surgical operation on Saturday, July 16, at the Duchess International Hospital, Ikeja, Lagos.\n“My deep gratitude to everyone for your get-well wishes and prayers following my surgery.\n“And special appreciation to the amazing team of surgeons, doctors, nurses, physiotherapists, and the management of the Duchess International Hospital, Lagos, for providing such excellent care.\n“God bless you all.”Signed:Prof. Yemi Osinbajo, SANVice President of the Federal Republic of Nigeria24th July, 2022"
  },
  {
    "headline": "Firefight Breaks Out Between Taliban, Unknown Gunmen In Afghanistan",
    "summarized_story": "Firefight Breaks Out Between Taliban, Unknown Gunmen In AfghanistanOn Saturday, intense gunbattle broke out in the provincial capital of Afghanistan’s northern Baghlan province between Taliban fighters and unidentified gunmen.\nThe provincial police headquarters were reportedly the scene of fights, according to local media in Pul-e-Khumeri city.\nThe Taliban uses the term to describe their adversaries, primarily Islamic State fighters and the anti-Taliban National Resistance Front.\nA local elder from the area claimed that over a dozen wounded people were taken to the provincial hospital as fighting spread to several locations.\nThe Taliban retook power in August amid the chaotic withdrawal of international forces from the country."
  },
  {
    "headline": "A Stitch In Time Saves Nine? By Bassey Udosen",
    "summarized_story": "Are the sponsors of Umo Eno not bewitching Akwa Ibom people while singing and dancing during Government house prayer gatherings ?\nWhat a time to be alive in Akwa Ibom State !\nThese are the three ‘wise’ henchmen who have brought this roof down on Akwa Ibom State and pressed the entire state to it’s knees.\nA stitch in time, they say, saves nine , Governor Udom Emmanuel should pull back and back off from this wretched path now to save this State from eternal shame.\nBassey Udosen writes from Mkpok, ONNA in Akwa Ibom State."
  },
  {
    "headline": "Again, doctors give update on Yemi Osinbajo’ s recovery",
    "summarized_story": "Vice President Yemi Osinbajo is now “making good progress,” doctors overseeing his condition at the Duchess International Hospital, Ikeja, Lagos, have revealed.\n“The aim of this stage of treatment is to reduce weight-bearing on his right leg while promoting healing and rehabilitation towards his usual active state.\n“All aspects of the Vice President’s post-operative care have proceeded satisfactorily so far.\n“His multi-disciplinary team of doctors, nurses, physiotherapists and allied health practitioners are extremely pleased with his progress.\n“We will continue to update the public on the progress of his treatment.”Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "ASUU issues fresh warning to FG, students",
    "summarized_story": "The Academic Staff Union of Universities has issued a fresh warning to the federal government and the Nigerian students who are affected by the over five months old strike embarked upon by its members.\nThe union said only the signing and implementation of a renegotiated 2009 agreement will end the strike.\nHe said Nigerian universities would not stop witnessing strikes until responsible and responsive people were in government.\n“The Federal Government led by Buhari is largely uncoordinated, the President gives order and his media aide denies he gives such order.\n“Nigerians should join the struggle to get money from government to revitalise public universities, to give children of Nigerian masses hope of governing their country."
  },
  {
    "headline": "Students leaders issue ultimatum, set to protest in Abuja over ASUU strike",
    "summarized_story": "The body which comprises all Students Union Presidents across Federal Universities in Nigeria, had in a letter to the Minister of Education, Adamu Adamu, dated July 19, 2022, gave the Federal Government seven days ultimatum to resolve the disagreement with ASUU.\nIn an interview with Journalist, the CSUP Convener, Shuaib Yahaya, said all the students leaders have resolved not to compromise on the decision to embark on the planned protest.\nAccording to him, the ongoing strike action has adversely affected students in the country, stressing that some now engage in illegal activities.\nBut here I am, I am still waiting on ASUU to call off strike before we can go back.\n“What we are after as students is that the federal government and ASUU should just reach a resolution."
  },
  {
    "headline": "Orange Telecom vows to play in Nigeria’s big market",
    "summarized_story": "By Our CorrespondentAfter a closer analysis of the huge potentials of the Nigerian telecom market, international telecom investor-operator, Orange Group, has vowed to play a big part in Africa’s biggest service space, in diversified areas including mobile, data, and fixed and financial technology support services.\n“We are here to ensure steady investment for a long term.\nWe also want to support the vision of the Commission in driving broadband penetration for a robust digital economy and leverage on local content development initiatives,” she said.\nAdefala said Nigeria is missing in Orange Group’s portfolio of combined networks of over 140 million subscribers across 18 countries of its operations.\n“The large market potentials buoyed by the huge population, impressive Gross Domestic product (GDP) figure, proximity to our operations in the neighbouring African countries, as well as the appreciable friendly operating environment are great motivators for our expansion plan into the Nigerian telecom market”."
  },
  {
    "headline": "Mininig: Ministry allays fears of registered miners over proposed ban to curb insecurity",
    "summarized_story": "By Palma IleyeMinistry of Mines and Steel Development, MMSD has stated that it has been drawn to media reports on the Federal government’s proposed ban on motorcycles and mining activities in various Mining sites as part of its effort towards curbing terrorism and ensuring stability and security in the country.\nThis the ministry said as it allayed fears of registered miners across the country over proposed ban on mining activities by the Federal Government to curb insecurity.\n“To this end, the Ministry wishes to inform the public that for the safety and security of the country, efforts are being intensified against illegal mining activities across the country as this has been established to have connections with banditry and kidnapping.\n“The additional measures that may be taken is therefore targeted at the activities of illegal miners and not legitimate operators in the Sector.\n“The Ministry therefore advises duly registered Miners to continue with their operations, while adhering to safe mining protocols and ensuring that security is given priority in their various sites.”"
  },
  {
    "headline": "Obodofei, GPS collaborate to build, operate gas processing plant in Bayelsa State",
    "summarized_story": "By Ere-ebi AgedahWith the desire to complement government effort in the power and energy sector, indigenous oil and gas firm, Obodofei has collaborated with international Construction engineering company, Global Process Systems, GPS to build a gas processing plant in Bayelsa state.\nThis, Obodofei insisted that this project will bring power into the local community and equally provide job opportunities to the teaming youths in the state.\nSpeaking in Abuja, on Thursday during the signing of a Non-Disclosure Agreement between Obodofei and GPS, Executive Director Obodofei, Dr. Steven Bassey remarked that it has become eminent for indigenous firms to contribute to the national crude oil basket and this can only be achieved through collaborations between indigenous oil and gas producers and their international counterparts in the service sector.\nA delegation from Global Process Systems, GPS led by Managing Director Mr Martin Brownhill and Vice President Business Development Rajesh Shah noted that they were impressed by efforts made by the Obodofei to begin such massive project to the state.\nMartin noted that GPS was keen about doing its due diligence to ensure that the project meets international best standard adding that it will provide all necessary support, training and advice needed to build and operate the proposed gas processing plant and distribution gas turbine in Bayelsa State."
  },
  {
    "headline": "Nigachem builds capacity of over 50 mining companies on use, management of explosives",
    "summarized_story": "By Palma IleyeManufacturing giant of mining explosives, Nigachem Nigeria Limited, yesterday, organized a capacity building training of over 50 mining companies on use of explosives at their sites this is following issues on safe- mining in the solid minerals sector.\nAlso Executive Director, Sales, Nigachem Nigeria Limited, Engr Bayo Yusuf, described the capacity building workshop as reawakening training for customers.\n“These trucks carrying mining explosives are not monitored while moving on the roads.\n“I need to improve more on safe-mining because we basically focus on blasting because blasting is the most technical aspect of mining.\nAdebayo stated this when he played host to the leadership of National Association of Nigerian Students, NANS in Abuja."
  },
  {
    "headline": "Debt servicing surpasses revenue by N310bn as FG releases 4-month fiscal report",
    "summarized_story": "Cost of servicing debt surpassed the federal government’s retained revenue by N310 billion in the first four months of 2022.\nThe federal government said this in its 2022 fiscal performance report for four months released on Thursday.\nAccording to the report, the federal government’s total revenue for the period was N1.63 trillion, while debt service gulped N1.94 trillion.\n“The aggregate expenditure for 2022 is estimated at N17.32 trillion, with a prorata spending target of N5.77 at end of April,” the report reads.\nOf this amount, N1.94 trillion was for debt service, and N1.26 trillion was for personnel costs, including pensions."
  },
  {
    "headline": "Lagos-Ibadan Expressway To Be Completed This Year – Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has reiterated the Federal Government’s commitment to delivering infrastructural projects to Nigerians, saying the Lagos-Ibadan Expressway project will be delivered before December 25, 2022.\nWhen asked when the project will be completed, the Minister said the Federal Government plans to deliver the project before Christmas.\nSecond Niger BridgeThe Minister also unveiled the government’s plan toward ending the Second Niger Bridge project in the South-Eastern part of the country.\nFashola said the current administration also plans to open the bridge before Christmas, despite the challenges facing the project.\nAccording to Fashola, he has directed the contractor to see that the project is delivered before the deadline, adding that the main bridge deck has been completed."
  },
  {
    "headline": "I Will Leave No Stone Unturned To Ensure Bandits, Terrorists Are Finally Crushed – Buhari",
    "summarized_story": "President Muhammadu Buhari has once again reaffirmed his administration’s commitment to tackling the nation’s security challenges, saying he will leave no stone unturned in crushing bandits and terrorists wreaking havoc in several parts of the country.\nHe also sympathized with former National Chairman of the Peoples Democratic Party (PDP), Adamu Muazu, over the killing of his brother and abduction of his sister by bandits.\n“I am shocked and outraged by the story of the killing of your brother and the abduction of your sister by bandits.\nThe terrorists were also seen threatening to kill the victims if the Federal Government failed to meet up with their demands.\nThey also claimed that one of the escapees of the Nigerian Correctional Centre, Kuje, Abuja had rejoined them in the forest."
  },
  {
    "headline": "Kaduna Train Attack: Terrorists Threaten To Kill, Sell Hostages, Kidnap Buhari And El-Rufai",
    "summarized_story": "Terrorists responsible for the March 28 attack on a Kaduna-bound train have released yet another video of them whipping their victims and threatening to abduct President Muhammadu Buhari as well as Kaduna State Governor, Malam Nasir El- Rufai.\nThe terrorists were also seen threatening to kill the victims if the Federal Government failed to meet up with their demands.\nJust like the Chibok girls that were sold off, we will equally sell these ones as slaves.” one of the terrorists added.\nIn a video released in April, the terrorists were seen putting on military camouflage and uniforms.\nOne of the victims is a young lady who identified herself as a student of Kaduna State University."
  },
  {
    "headline": "Surgical Operation: VP Osinbajo Thanks Everyone",
    "summarized_story": "Vice President Yemi Osinbajo, SAN, has expressed his deep gratitude to Nigerians and everyone following his recent successful surgery.\nProf. Osinbajo underwent a surgical operation on Saturday, July 16, at the Duchess International Hospital, Ikeja, Lagos.\nOsinbajo Hospitalised, To Undergo Surgical ProcedureOsinbajo Undergoes Successful Surgery For FractureBelow is the full statement of the Vice President.\n“And special appreciation to the amazing team of surgeons, doctors, nurses, physiotherapists, and the management of the Duchess International Hospital, Lagos, for providing such excellent care.\nHe also commended the medical team at the Duchess International Hospital in Ikeja, Lagos for “their competence and a job well done”."
  },
  {
    "headline": "Bandits Attack Katsina Transport Authority Bus, Kill Driver, Abduct Passengers",
    "summarized_story": "Bandits on Sunday killed a driver with the Katsina State Transport Authority (KTSTA), Nasiru Yusha’u, after the victim’s vehicle ran into the gunmen along the Katsina-Jibia road.\nMeanwhile, the General Manager (GM) of the Katsina State Transport Authority, Haruna Musa Rugoji has confirmed the incident.\nRugoji noted that the deceased conveyed the passengers he took from Katsina to Jibia.\nThen, from Jibia also, he took passengers to Katsina and it was on the return trip that the incident took place at Farun Bala.\n“The driver was trying to turn the vehicle with the passengers when he saw the four bandits crossing the road at that particular community."
  },
  {
    "headline": "Ekiti election: SERAP sues INEC for failing to prosecute vote-buyers",
    "summarized_story": "The Socio-Economic Rights and Accountability Project, SERAP has filed a suit against the Independent National Electoral Commission, INEC for “failing to prosecute those suspected to have participated in vote-buying and electoral bribery” in the June 18 governorship election in Ekiti State.\nAdvertisementSERAP In a statement on Sunday, cited reports that suggested there was a brazen pattern of vote-buying and electoral bribery at several polling units in the state, including bargaining prices for votes and payments made in uncompleted buildings.\nThe group in the suit seeks “an order to compel INEC to obtain detailed information about reports of vote-buying by the three leading political parties in the Ekiti election.”AdvertisementAdvertisementSERAP is also seeking to compel INEC to promptly and effectively prosecute those arrested, and bring to justice anyone who sponsored, aided and abetted act.”SERAP is arguing that, “Vote buying is a threat to fair and representative elections.\nVote buying amounts to undue influence and improper electoral influence.”AdvertisementAccording to SERAP, “Wealthy candidates and their sponsors ought not to be allowed to profit from their crimes.\nA corruption-free electoral process is essential for building public confidence in the electoral process, and the credibility and legitimacy of the 2023 elections.”“One of the people’s most sacred rights is the right to vote."
  },
  {
    "headline": "2023: Clerics defend support for Kashim Shettima",
    "summarized_story": "AdvertisementOne group whose attendance came under the spotlight is an association of the clergy known as THE MUSLIM and CHRISTIAN LOVE FOUNDATION.\nAdvertisementAdvertisementThe group of clergy who were criticised for attending the unveiling of Senator Kashim Shettima as the vice presidential candidate of the APC have come out to publicly respond to what they say is fake news being spread by a section of the media.\nThe association at a press briefing insisted that their decision to attend the event was based on personal conviction and support for Senator Kashim Shettima who has shown similar support for the christian faith when he was governor of Borno state.\nAdvertisementThey claimed that the intentional distortion of facts on social media is intended to create the false impression that Christians do not support the APC.\nBut, the group warned Nigerians against supporting politicians and political parties who seek to divide people through religion."
  },
  {
    "headline": "Ogun: Akinlade parleys fellow Ipokia indigenes ahead of 2023 polls -",
    "summarized_story": "The Deputy Governorship candidate of the People’s Democratic Party (PDP) in Ogun State, Adekunle Akinlade, on Saturday met with the people of Ipokia Local Government.\nThe meeting, held at his Agosasa residence, was to brief Ipokia indigenes and residents about his defection to the PDP, while rallying support for Ladi Adebutu and other candidates of the party in the 2023 general election."
  },
  {
    "headline": "Benue APC candidates protest against 'substitution' of names -",
    "summarized_story": "Some members of the All Progressives Congress, Benue state House of Assembly, have petitioned the party National secretariat against substituting the names of members who won the primaries.The submission was made by the members affected, through a peaceful protest to the national secretariat of the APC.\nTVC News Correspondent, Habidah Lawal reports that reported cases of removal and illegal substitution of candidates names, have become rife in political parties ahead of the forthcoming general elections.\nOne of the recent cases is that four members of the APC, who contested and won their primaries for the Benue state House of Assembly.\nAdvertisementAdvertisementThey held a peaceful protest to the party’s headquarters is to appeal to the party to correct the alleged name substitution.\nAdvertisementThe aggrieved members have declared the subsequent submission of other names to INEC as illegal, null, void and of no legal consequence or significance."
  },
  {
    "headline": "Wakanda Forever: Nigeria’s Tems Stars on Black Panther Sequel Soundtrack with ‘No Woman, No Cry’",
    "summarized_story": "Nigerian pop star, Temilade Openiyi, popularly known as Tems, features on the soundtrack for one of 2022’s most anticipated movies, ‘Black Panther: Wakanda Forever’ with a rendition of the Bob Marley classic ‘No Woman, No Cry’.\nThe teaser begins with Tems’ version of ‘No Woman, No Cry’ before it seamlessly transitions to Kendrick Lamar’s ‘Alright’.\nTems feature on the ‘Wakanda Forever’ soundtrack is sure to excite potentially millions on the mother continent, because it corrects an earlier oversight.\nConsidering that the ‘Black Panther’ franchise is based on a fictional African country, Wakanda, the soundtrack album for the first installment curated by Kendrick Lamar featured no Afrobeats artiste.\nWatch the “Black Panther: Wakanda Forever” trailer belowDemola Ojo"
  },
  {
    "headline": "Nigeria Women’s Team Breaks 30-Year-Old 4x100m African Record",
    "summarized_story": "The team ran a time of 42.22s to break the long-standing 42.39s African Record set by their compatriots, Christy Opara-Thompson, Faith Idehen, Beatrice Utondu and Mary Onyali, at the Barcelona 92 Olympics where Nigeria ended with a bronze medal.\nUdo-Gabriel ran a well-executed first leg before handing over to Ofili who sustained the momentum.\nNigeria had initially been kicked out of the women’s relay events in Oregon because of doping infractions established against Blessing Okagbare.\nHowever France pulled out to make a way for Nigeria to not just come on board but to set a new African record.\nDespite the disappoiment of not winning a medal, the relatively young Nigerian women’s relay team have the Commonwealth Games starting this week in Birmingham to look forward to for possible medals."
  },
  {
    "headline": "Biden’s Health Improving, No Close Contacts Tested Positive for Covid, White House Says",
    "summarized_story": "US President Joe Biden, who tested positive for COVID-19 on Thursday, is improving in health and none of his 17 identified close contacts have so far tested positive for the coronavirus, White House COVID coordinator Ashish Jha said on Sunday.\nJha told ABC News Biden “had a great day yesterday, was feeling well,” and that Biden’s close contacts were continuing to follow the protocols of the U.S. Centers for Disease Control and Prevention.\nBiden, 79, had experienced mild symptoms, according to the White House.\nThe White House has sought to underscore Biden’s ability to work through his illness.\nOn Thursday it released a video of him reassuring Americans he was doing fine, and on Friday he participated in virtual meetings with White House staff."
  },
  {
    "headline": "Terrorists Torture Abducted Kaduna Train Passengers, Threaten Buhari, El-Rufai, Governors, Senators",
    "summarized_story": "A new video released by terrorists shows abducted passengers of an Abuja-Kaduna train service being tortured by their captors.\nAfter a series of releases for ransom, 43 Nigerians are still held by the terrorists somewhere within the Birnin Gwari forest in Kaduna.\nIn the viral video recorded in Hausa, the terrorists threatened to kidnap Nigeria President Muhammadu Buhari and Kaduna State Governor Nasir El-Rufai, as well as other government officials.\nThe terrorists told him to come get them both, as long as he comes with food and water.\nHowever, Tukur Mamu who negotiated their release – as well as previous negotiations with the terrorists – insisted that no ransom was paid."
  },
  {
    "headline": "‘Explosive’ Wildfire Tears Through Homes as Thousands Forced to Flee in California",
    "summarized_story": "A state of emergency has been declared in a part of California as the largest active wildfire in the US rapidly spreads near Yosemite National Park.\nThe Oak Fire has quickly grown since starting on Friday, and firefighters have struggled to get the blaze under control.\nThe state of emergency, which has been declared in Mariposa County, will allow the state to access some federal assistance to tackle the fires.\nThe redwoods were threatened by another blaze earlier this month, but firefighters managed to save them.\nSeveral European governments have struggled to contain dozens of separate wildfires which have ripped across the continent in recent weeks."
  }
]