[
  {
    "headline": "Constitution review: Senate to hold national public hearing Thursday",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said that a national public hearing to alter the provisions of the 1999 constitution will hold on Thursday through Friday this week.\n“Lawan appealed to Nigerians to seize the opportunity provided by the national public hearing commencing on Thursday to state their position on issues that would improve the quality of governance.”The Senate President was quoted as saying, “Let me also congratulate the members of the Constitution Review Committee of the Senate, who had conducted the public hearings across the countries.\n“[And] in fact, the report we received has shown that in all the centres, the public hearings were quite successful.\n“I want to also appeal to Nigerians to take the opportunity of the national public hearing that will take place from Thursday.\n“This is an effort that the National Assembly – particularly the Senate is attached to."
  },
  {
    "headline": "NECO Registrar died in Abuja —Police",
    "summarized_story": "Friday Olokor, ABUJAThe Niger State Police Command has described as untrue claims that the Registrar of the National Examination Council, Prof. Godswill Obioma was assassinated by unknown gunmen in Minna.\nThe organization said his family had formally announced that he passed on after a brief illness at the National Hospital in Abuja.\nThe Spokesperson of the Niger State Police Command, Wasiu Abiodun, a Deputy Superintendent of Police, made the clarification in a statement with Ref.\nHe said, “The attention of Niger State Police Command has been drawn to a publication circulating in some section of social media and national dailies that NECO Registrar, Prof. Godswill Obioma was murdered by unknown gunmen in Minna.\n“It is important to state categorically that on 31st May, 2021 the family of the Registrar/CEO National Examinations Council (NECO), Prof Godswill Obioma formally announced that he passed to eternal glory after a brief illness at National Hospital Abuja."
  },
  {
    "headline": "Foreign portfolio investors pressure external reserves",
    "summarized_story": "Thus while the reserves recorded a marginal increase of 0.2 per cent, MoM, in April, it declined in May by 1.7 per cent MoM to $34.27 billion.\nThe reserves, however, fell in February by $1.2 billion or 3.3 per cent, MoM, to $35.09 billion following increased dollar sales by the CBN.\nThis follows Senate approval in April of another $2.6 billion external loan request from President Muhammadu Buhari.\nAnalysts’ viewsWhile these moves for new foreign loans and hence additional forex injection are expected to boost external reserves, analysts, however, cited the backlog of forex demand by FPIs as a major determining factor for stability in the reserves.\n“ Our view is that a $4billion to $5bn disbursement to the market by the CBN will reduce external reserves by $2 billion to $3 billion”."
  },
  {
    "headline": "Ban on open grazing: Don’t be terrified by presidency — PFN tells Southern Governors",
    "summarized_story": "Kindly Share This Story:By Chinedu AdonuThe Pentecostal Fellowship of Nigeria, PFN, Christian Association of Nigeria, CAN, Enugu State chapter, has thrown it’s weight behind the Southern governors over the recent ban on open grazing in the region.\nThe Southern Governors had drawn the ire of the Presidency after they prohibited open grazing of cattle in the 17 States of Southern Nigeria.\nHe said “We totally support the Asaba declaration; the governors must stop at nothing to ensure the safety and well-being of the people of Southern Nigeria.\nWe have had enough of bloodletting.”PFN equally backed the governors on state police and restructuring.\n“The ongoing constitution amendment is an opportunity to provide for State police and total restructuring of power,” Madu stated."
  },
  {
    "headline": "Lawmaker breaks jinx, builds secondary school in Edo community",
    "summarized_story": "Kindly Share This Story:…Evbuonogbon villagers rejoice, say our children attend secondary school in OndoBy Ozioruva AliuMEMBER representing Ovia Federal Constituency, Edo State, in the House of Representatives, Hon.\nDennis Idahosa, has built a secondary school at Evbuonogbon community, Ovia South-West Local Government Area, breaking the age-long practice of indigenes going to neighbouring Ondo State for secondary education on completion of primary school.\nNo secondary school in Evbuonogbon until …NDV learned there was no secondary school in the community, the nearest is in Ondo State, so the distance, cost and inconvenience deprived primary school leavers from the community of getting secondary education in Edo State.\nJoy unlimited — Mrs. Alufa, headmistressHead Mistress of Okoro Primary School, Mrs.\nSome of the buildings handed over were that of Obanosa Primary School, Iyekeze, Ovia North-East Local Government and Okoro Primary School, Okoro II, Ovia South- West Local Government."
  },
  {
    "headline": "JUSUN strike: Nnamdi Kanu reacts, says democracy can’t work without judiciary",
    "summarized_story": "Mazi Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB) has reacted to the prolonged ongoing industrial action by the Judiciary Staff Union of Nigeria (JUSUN).\nDAILY POST recalls that JUSUN embarked on an indefinite strike on April 3 to demand financial independence for the nation’s judiciary.\nThe action has crippled the judicial system in the country for over three months as all courts across the nation remain shut.\nNnamdi Kanu declares position on restructuringReacting to the closure of courts, the Biafra freedom fighter said there can’t be democracy in a nation where the judiciary is shut down.\n“A democracy functions only when the three arms are functioning."
  },
  {
    "headline": "Biafra Day: Buhari govt cut-off network in Bakassi Peninsula",
    "summarized_story": "Biafra Nations League (BNL) has claimed that the President Muhammadu Buhari-led Federal Government completely shut down the network in the Bakassi Peninsula on the 30th of May to stop them from carrying out their threats.\nThe group had threatened to hijack any foreign vessels entering through the Peninsula from May 30, the Biafra remembrance day.\nThe group said the network went off from 7pm on 29th May to 8pm the next day, throwing residents of the region into panic.\nBNL also said it is in support of the sit-at-home declared by the Movement for the Actualization of the Sovereign State of Biafra (MASSOB) and the indigenous People of Biafra (IPOB).\nWe’ll throw Bakassi Peninsula into chaos – Group threatens govt"
  },
  {
    "headline": "PDP praises Ikpeazu for developing Abia, promoting party’s ideology",
    "summarized_story": "The Peoples Democratic Party (PDP) has praised Governor Okezie Ikpeazu of Abia State for remaining steadfast and promoting the ideology of the party which has attracted thousands of members of the opposition parties, especially the All Progressive Grand Alliance (APGA) and the All Progressive Congress (APC) into the ruling party in the state.\nIn a statement signed by its Chairman in Abia State, Hon Allwell Asiforo Okere, and made available to newsmen in Umuahia, on Tuesday, the PDP leadership commended Ikpeazu for fulfilling his election campaign promises in line with the PDP manifesto by embarking and completing projects that have direct benefit to residents of the state.\nAccording to the statement, “The party is proud of the Governor for constructing numerous quality roads, making improved security, provision of quality education; healthcare services; agriculture, sports, social development and empowerment of women, youths and the less privileged persons through the Vicar Hope Foundation established by the office of the Wife of the Governor, Deaconess Nkechi Ikpeazu”.\nThe party reiterated its total loyalty and passed a vote of confidence on the leadership prowess of the governor, urging opposition parties in the state to join hands with the latter in transforming the state to another level.\nThe PDP also reaffirme"
  },
  {
    "headline": "Kano Speaker, Chidari among 132 wanted for violating COVID-19 protocols [Full list]",
    "summarized_story": "The Speaker, Kano State House of Assembly, Hamisu Chidari, has been named among those wanted by the Federal Government for violating COVID-19 protocols.\nIn December 2020, Chidari, ex-Kano Deputy Speaker, emerged as the new Speaker after the resignation of his predecessor AbdulAziz Garba Gafasa.\nBello, Aisha Barau31.\nAdamu, Adamu Usman56.\nIbrahim Yusuf Buratai121."
  },
  {
    "headline": "Controversy as NECO boss’ wife, son disagree on cause of Obioma’s death",
    "summarized_story": "There is an ongoing controversy over the death of the Chief Executive of the National Examination Council, Prof. Godswill Obioma following the conflicting reports about the cause of his death.\nAccording to Mrs Obioma, “The assassins came in and killed him and left without taking anything,” She told Peoples Gazette.\nObioma disclosed thag her husband returned to Minna from a trip to Abuja when the assassins pounced on him.\nGunmen murder NECO Registrar, Godswill ObiomaBut his son, Prince Godswill Obioma the second said his father passed away after a brief sickness.\nNECO Registrar, Obioma was not murdered – Police"
  },
  {
    "headline": "China records world’s first case of human infection with H10N3 bird flu",
    "summarized_story": "Our ReporterChina has reported the world’s first case of a human infected with the H10N3 bird flu, which is usually found in poultry.\nThe man was originally hospitalized on April 28 after having fever and other symptoms.\nThe patient’s condition is stable, and he is ready to be discharged from the hospital, the health agency said.\nH10N3 is a subtype of the avian influenza virus, which is lethal to wild birds and poultry and can spread by air among animals through breathing just like the normal flu.\nADVERTISEMENTThere are several strains of the bird flu of varying contagiousness that lead to sporadic outbreaks and usually affects poultry workers."
  },
  {
    "headline": "Defection: Gov. Ayade was not appreciated in PDP, says Speaker",
    "summarized_story": "Agency ReporterSpeaker of Cross River House of Assembly Eteng Jonah-Williams has said that Gov.\nBen Ayade was not respected and honoured by the hierarchy of the People’s Democratic Party (PDP) before his defection to the All Progressives Congress (APC).\nThe Speaker, who represents Yakurr II State Constituency in the Assembly, told NAN that out of the 25 House of Assembly members in the state, APC has 18, while the PDP has seven.\n“While in PDP, the governor was not respected and given the honour he deserved by the hierarchy of the PDP as the leader of the party in the state.\nADVERTISEMENTAccording to the Speaker, the remaining two years period of Ayade will attract the needed development from the centre into the state."
  },
  {
    "headline": "Sit at home: Spirit of Biafra can never be quenched – MASSOB",
    "summarized_story": "“The sacrifices, dehumanization, subjective and inhumane sufferings our parents underwent during Nigeria Biafra war shall never be forgotten.\nThe deep hatred and conspiracy of the British government in collaboration with Northern Arewa people exhibited against the people of Biafra during the Nigeria Biafra war are still very fresh in our memories.\n“The people of Biafra have once again demonstrated their unshakable and undeniable love and quest for Biafra.\nThe person of General Chukwuemeka Odumegwu Ojukwu and ideology of Biafra are interwoven.\n“MASSOB extends our gratitude to the people of Biafra in diaspora and Biafra residents in Oduduwa, Arewa and Middle Beltan lands for honoring Biafra in compliance of observing the sit at home exercise."
  },
  {
    "headline": "NECO Registrar passed away after brief Illness – Police, NECO",
    "summarized_story": "By Justina Asishana, MinnaNiger Police Command has debunked reports Registrar of National Examination Council(NECO) Professor Godswill Obioma was assassinated by gunmen in Minna.\nBut The Nation reported he died after a brief illness, which the police confirmed.\nThe Circular titled: “Death of NECO Registrar/Chief Executive” explained the Registrar died on Monday after a brief illness.\nIn a message to Director, Human Resource Management in NECO, Mustapha Abdul by son of the late Registrar, Prince Godswill Obioma the 2nd, the family confirmed that the Registrar died after a brief illness.\nThe message reads: “Dear Sir, this is to formally inform you that my father Prof. Godswill Obioma, the Registrar/Chief Executive of NECO passed to eternal glory yesterday 31/5/2021 after a brief illness."
  },
  {
    "headline": "BREAKING: NECO Registrar, Godswill Obioma is dead",
    "summarized_story": "From Fred Ezeh, AbujaRegistrar, National Examinations Council (NECO), Prof. Godswill Obioma, has been reportedly killed by unknown assailant.\nProf. Obioma was said to have been killed on Monday night when the assailant invaded his house, strangle him and left with nothing.\nNECO spokesman, Sani Azeez, could neither pick nor return calls placed on his phone.\nAlthough details surrounding his death were sketchy at the time of filing this report, a source close to the deceased said he was not slain; rather, that he slumped in his house and died, in front of his wife and aides.\nMore details later…"
  },
  {
    "headline": "Kalu laments murder of Ex-Presidential adviser, Gulak",
    "summarized_story": "Lamenting the gruesome murder of the former Presidential aide, Kalu condemned the perpetrators of the act, describing their action as totally unacceptable and evil.\n“The evil act is totally unacceptable and highly condemnable.\nThe sponsor (s) of the ugly act must face the wrath of the law.\n“Appropriate security agencies must begin a full scale investigation into the murder of the politician.\n“It is important for security agencies to work closely with local communities in fishing out criminals from the society."
  },
  {
    "headline": "Ganduje, Garba tasks media on professionalism",
    "summarized_story": "Abdullahi Ganduje of Kano State has tasked journalists on the need to demonstrate professionalism in their reportage as they serve as a link between the government and the people.\nGanduje made the appeal on Monday in Kano while declaring open the 2021 Nigerian Guild of Editors (NGE) Biennial Conventions.\nI believe that absence of influential press council that should regulate the media has affected the media practice.\nGanduje also called on journalists to promote peace, harmony and unity at this crucial time in the country.\nGanduje also observed that crossing of redlines by some media organisations in recent times had impacted on the nation’s unity, harmony and integration."
  },
  {
    "headline": "Insecurity: Customs goes after private jet owners",
    "summarized_story": "This is to ensure strict compliance with all relevant regulations governing importation of such aircraft.\nWhile clarifying that private jets do not pay Customs duties, Attah said such airplanes are expected to pay the mandatory Comprehensive Imports Supervision Scheme (CISS) charges.\nThe move is not punitive but to ensure compliance.\nWe believe private jet owners are highly-placed individuals that will do the right thing.\nThey’ll will do what the law says.”In another development, Attah disclosed Customs generated N799,024,705,961 between January 1 and May 30 this year."
  },
  {
    "headline": "Benue killings: Ebonyi on red alert to avoid spill over",
    "summarized_story": "From Magnus Eze, EnuguThe Ebonyi State Government saID it has taken security measures to forestall spillover of the attack that took place in the early hours of Sunday at Nwori Ndi-Obasi village in Ado Local Government Area of Benue State, to neighboring villages of Okwofuruike, Odoke and Ohabuleodo in Izzi and Ebonyi LGAs of the state.\nCommissioner for Internal Security, Border Peace and Conflict Resolution, Stanley Okoro-Emegha, said government has mobilised and dispatched a combined team of security agencies and members of the Ebubeagu security to ensure peace and normalcy in the troubled area.\nThe government had expressed dismay over the invasion of the Benue communities which are predominantly of Izzi stock.\nSuspected herders had attacked inhabitants of the village killing, maiming and razing several houses.\nAnd because the victims are of Izzi origin though in Benue State, many had taken them to belong to Ebonyi State."
  },
  {
    "headline": "NECO Registrar, Godswill Obioma, is Dead",
    "summarized_story": "By Laleye DipoThe Registrar and Chief Executive Officer of the National Examination Council NECO Professor Godswill Obioma is dead.\nA reliable source close to the family told THISDAY in Minna, Niger state that Obioma died in the early hours of Tuesday.\nAccording to the source, the NECO registrar returned to his Minna residence late on Monday and some minutes after checking into his house along Okada road, his cousin found him on the floor in his bedroom.\nIt was gathered that he was immediately rushed to Abuja for treatment.\nHowever THISDAY learnt that it was at the National Hospital that the NECO boss was confirmed dead."
  },
  {
    "headline": "South-east Grounded as Residents Comply with Sit-at-home Order",
    "summarized_story": "However, a gun duel between the police and IPOB fighters within Ebebe junction in Abakaliki, the Ebonyi State capital, reportedly claimed five lives.\nA student of Ebonyi State University also told THISDAY that the sit-at-home order disrupted academic activities.\nResidents of the two major Abia cities fully complied with the sit-at-home order.\nThe ever-busy Wetheral Road, Douglas Road, Royce Road, Okigwe Road, Orlu Road, Onitsha Road, Port Harcourt Road and Aba Road were all empty.\nShedding light on why there was total compliance with the sit-at-home order, spokesman of the pan-Igbo sociopolitical organisation, Ohanaeze Ndigbo, Hon."
  },
  {
    "headline": "Afenifere, Ohanaeze, Middle Belt Seek National Conference to Birth New Constitution",
    "summarized_story": "The groups adopted a common position urging for an emergency national conference to birth a new constitution and pave the way for the restructuring of Nigeria.\n“There would be a national constitution binding all the regions in the country together.\n“From such collation of terms would emerge regional constitutions out of which National Constitution would be forged.\n“A national referendum can be conducted on the adoption of the final Constitution for the Restructured Nigeria around the middle of 2022.\nAlso, another group, the Interfaith Dialogue Forum for Peace (IDPF), met yesterday in Abuja and canvassed a national dialogue to address the challenges facing Nigeria."
  },
  {
    "headline": "Nigeria Concludes Marginal Field Bid Round, 18 Years After",
    "summarized_story": "However, during the bid round, the DPR stated that 161 successful companies were shortlisted to advance to the final stage.\nMarginal fields are smaller oil blocks typically developed by indigenous companies and have remained unproduced for a period of over 10 years.\nOthers are: North Oils and Gas, Pierport, Metropole, Pioneer Global, Shepherd Hill, Akata, NIPCO, Aida, YY Connect, Accord Oil, Pathway Oil, Tempo Oil and Virgin Forest, among others.\nHe pledged to support the bid winners to operate within the country’s oil and gas space, urging them to take advantage of the oil and gas centre recently inaugurated by President Muhammadu Buhari.\nAuwalu stated that the DPR has now provided opportunities through the marginal field bid round to indigenous operators for wealth creation and economic growth consistent with government’s drive for increased GDP, employment generation and improved revenue."
  },
  {
    "headline": "NNPC Eyes Stakes in Five More Private Refineries",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) yesterday unfolded plans to acquire shares in five more private refineries in Nigeria, bringing to six its interests in refineries it is targeting.\n“These roles enable it to achieve the twin objectives of providing energy security for the country and stimulating the nation’s economic development and growth,” NNPC stated.\n“The new vision is to grow domestic refining capacity, improve petroleum products supply from our local refineries and become a net exporter of petroleum product,” it stated.\nNNPC assured all stakeholders that the move to seek equity participation in the private refineries will not undercut its commitment to the rehabilitation of its refineries and strengthening the domestic refining sector.\nIt stated that the overall goal is to boost the nation’s refining capacity with a view to becoming a net exporter of petroleum products soon and to grow the nation’s economy."
  },
  {
    "headline": "How Suspended NPA boss, Usman Lied, Deceived Vice-President Osinbajo, Others Over Plans To Selfishly Give Calabar Port Project To Cronies",
    "summarized_story": "The project is under Calabar Channel Management, a joint venture operation between a consortium led by Niger Global Engineering and Technical Company Limited and the Nigerian Ports Authority.\nHer lies have cost the country so much money because dredging the Calabar Port would have decongested Lagos ports.\nThis company is being appointed by the NPA to regularly audit the three channel management namely; Lagos Channel Management (LCM), Bonny Channel Management (BCM) and Calabar Channel Management (CCM).\nThe letter was titled ‘Re: Execution Summary of the Entire Argument Surrounding the Calabar Channel Management Contract at the Truth Verifiably Documentary Evidence’.\nShe is the reason why Calabar Port has not been dredged and Lagos ports decongested,” added one of the sources."
  },
  {
    "headline": "How Suspended NPA boss, Usman Lied, Deceived Vice-President Osinbajo, Others Over Plans To Selfishly Give Calabar Port Project To Cronies",
    "summarized_story": "The project is under Calabar Channel Management, a joint venture operation between a consortium led by Niger Global Engineering and Technical Company Limited and the Nigerian Ports Authority.\nHer lies have cost the country so much money because dredging the Calabar Port would have decongested Lagos ports.\nThis company is being appointed by the NPA to regularly audit the three channel management namely; Lagos Channel Management (LCM), Bonny Channel Management (BCM) and Calabar Channel Management (CCM).\nThe letter was titled ‘Re: Execution Summary of the Entire Argument Surrounding the Calabar Channel Management Contract at the Truth Verifiably Documentary Evidence’.\nShe is the reason why Calabar Port has not been dredged and Lagos ports decongested,” added one of the sources."
  },
  {
    "headline": "Registrar Of Nigeria's Top Examination Body, NECO, Godswill Obioma Assassinated In Minna",
    "summarized_story": "Some unknown gunmen on Monday night stormed the residence of the registrar of the National Examination Council, Godswill Obioma, strangling him to death.\nAccording to a report by Peoples Gazette, the wife of the deceased, Elizabeth Obioma said the assailants killed her husband and did not take any valuable from the house.\nIt was gathered that Obioma had been facing attempts to remove him from office as the head of NECO, a prominent examination body run by the Nigerian government.\nObioma, 67, was appointed head of NECO barely a year ago on May 14, 2020.\nThe incident came barely a day after Ahmed Gulak, a top politician of the ruling All Progressive Congress, was gunned down in Owerri, raising widespread fears of insecurity."
  },
  {
    "headline": "Registrar Of Nigeria's Top Examination Body, NECO, Godswill Obioma Assassinated In Minna",
    "summarized_story": "Some unknown gunmen on Monday night stormed the residence of the registrar of the National Examination Council, Godswill Obioma, strangling him to death.\nAccording to a report by Peoples Gazette, the wife of the deceased, Elizabeth Obioma said the assailants killed her husband and did not take any valuable from the house.\nIt was gathered that Obioma had been facing attempts to remove him from office as the head of NECO, a prominent examination body run by the Nigerian government.\nObioma, 67, was appointed head of NECO barely a year ago on May 14, 2020.\nThe incident came barely a day after Ahmed Gulak, a top politician of the ruling All Progressive Congress, was gunned down in Owerri, raising widespread fears of insecurity."
  },
  {
    "headline": "Woman Killed, 50 Houses Razed In Gombe Communal Conflict",
    "summarized_story": "About 50 houses were reportedly burnt, while a woman was feared killed in a land dispute involving Filiya and Shongom districts in the Shongom Local Government Area of Gombe State.\nThe state’s Commissioner of Information and Culture, Julius Ishaya stated this at a briefing after a Security Council meeting in Gombe.\n“The council reiterated that the banning of militias or hunters’ groups still stands, and all security agencies have been alerted in that regard,” he said.\nAdamu Dishi, the Commissioner of Internal Security and Ethical Orientation, said security operatives in the state had been directed to fish out those responsible for the clashes.\nAccording to the police commissioner in Gombe, Ishola Babaita, police officers have restored peace to the affected areas."
  },
  {
    "headline": "EXCLUSIVE: Gulak was warned against going to Owerri but he said 'we are all Nigerians'",
    "summarized_story": "Ahmed Gulak, the murdered chieftain of the All Progressives Congress (APC), was advised against going to Owerri, Imo state capital, for the public hearing on constitution review, TheCable can report.\nAdvertisementTheCable understands that despite being warned against the trip, Gulak insisted, noting that “we are all Nigerians”.\nGulak was the lead consultant on the public hearing in Owerri, the host city for Imo and Abia states.\nAdvertisementBala Elkana, Imo state police spokesperson, had said the perpetrators are members of Indigenous People of Biafra (IPOB) and Eastern Security Network (ESN) — an IPOB security outfit.\nWe all know what is going on in Imo state,” Wike said."
  },
  {
    "headline": "EXCLUSIVE: Gulak was warned against going to Owerri but he said 'we are all Nigerians'",
    "summarized_story": "Ahmed Gulak, the murdered chieftain of the All Progressives Congress (APC), was advised against going to Owerri, Imo state capital, for the public hearing on constitution review, TheCable can report.\nAdvertisementTheCable understands that despite being warned against the trip, Gulak insisted, noting that “we are all Nigerians”.\nGulak was the lead consultant on the public hearing in Owerri, the host city for Imo and Abia states.\nAdvertisementBala Elkana, Imo state police spokesperson, had said the perpetrators are members of Indigenous People of Biafra (IPOB) and Eastern Security Network (ESN) — an IPOB security outfit.\nWe all know what is going on in Imo state,” Wike said."
  },
  {
    "headline": "Benue deputy governor: If Buhari, Sultan speak against violence by herders, attacks will stop",
    "summarized_story": "Benson Abounu, Benue deputy governor, has called on Fulani leaders to speak against the attacks by herders on communities.\nAdvertisementHe said a word from President Muhammadu Buhari, Muhammadu Abubakar, Sultan of Sokoto, and Muhammadu Aliyu, Lamido of Adamawa will serve as an “effective response” that may put a stop to the deadly activities of herders.\n“Fulani need to hear from them, their own leaders condemning what they are doing and asking them to put a stop to it.\nAdvertisementAbounu also said the body language of Fulani leaders has contributed to the atrocities committed by herders in Nigeria.\n“The body language of the leaders of Fulani in our society today is a very serious issue to be addressed,” he said."
  },
  {
    "headline": "Benue deputy governor: If Buhari, Sultan speak against violence by herders, attacks will stop",
    "summarized_story": "Benson Abounu, Benue deputy governor, has called on Fulani leaders to speak against the attacks by herders on communities.\nAdvertisementHe said a word from President Muhammadu Buhari, Muhammadu Abubakar, Sultan of Sokoto, and Muhammadu Aliyu, Lamido of Adamawa will serve as an “effective response” that may put a stop to the deadly activities of herders.\n“Fulani need to hear from them, their own leaders condemning what they are doing and asking them to put a stop to it.\nAdvertisementAbounu also said the body language of Fulani leaders has contributed to the atrocities committed by herders in Nigeria.\n“The body language of the leaders of Fulani in our society today is a very serious issue to be addressed,” he said."
  },
  {
    "headline": "Arewa forum asks northerners to avoid travelling to south-east",
    "summarized_story": "The Arewa Consultative Forum (ACF) has asked northerners to suspend plans of travelling to the south-east.\nGulak, who is from the north, was shot dead by gunmen on Sunday while returning to Abuja from Owerri, Imo state capital.\nOgbe said where any travel should be made, it must be “absolutely necessary” otherwise such a trip to the south-east should be suspended.\n“The Arewa Consultative Forum (ACF) hereby issues a very strong advisory to all northerners who may wish to travel to the South East.\n“The Arewa Consultative Forum (ACF) also wishes to call, with the strongest voice, on the Security Agencies to do everything possible to apprehend those who assassinated Alh."
  },
  {
    "headline": "How Uche Ogboi became CEO of Lori Systems and her billion-dollar mission for African logistics",
    "summarized_story": "As CEO of Lori Systems, Uche Ogboi will bear some of the weight of African logistics on her shoulders.\nJosh Sandler, Lori’s founding CEO, first met Ogboi in 2017.\nHer due diligence process impressed Sandler who was looking out for someone to bring structure and help scale the logistics startup’s operations.\nLast November, they received an undisclosed investment and signed a partnership agreement with Imperial Logistics, a global logistics company.\nNow she’ll probably sleep even less with the weight of African logistics on her shoulders."
  },
  {
    "headline": "Almentor’s online learning platform for Africa and the Middle East gets $6.5m backing from Partech, Sawari and Sango Capital",
    "summarized_story": "Almentor, a video-based online learning platform for the Middle East and North Africa, has raised $6.5m in a Series B round led by Partech from its Africa Fund.\nHow Almentor worksFrom gamified mobile apps to websites that enable streaming, online learning comes in different varieties across the world.\nAlmentor can be accessed in multiple countries across Africa but the content is focused on North Africa and the Middle East.\nIn 2019, Almentor’s $4.5 million Series A was led by Sawari Ventures, an Egyptian firm that closed a $71 million fund in April.\nSawari also invested in this Series B round as Sango Capital, a firm based in South Africa."
  },
  {
    "headline": "Bezos Expeditions invests again as Chipper Cash raises $100 million in Series C round",
    "summarized_story": "Barely seven months after a $30 million funding round in which Jeff Bezos participated, Chipper Cash has raised $100 million in a Series C round.\nExisting Chipper Cash investors like Deciens Capital, Ribbit Capital, Bezos Expeditions and 500 Startups participated.\nChipper Cash enables individuals to transfer money at zero fees between African countries.\nSegunjogi’s comment suggests that Chipper Cash may also now be worth over $1bn, even if they have raised $80m less than the Nigerian fintech.\nLike Flutterwave, Chipper Cash is headquartered in San Francisco but has over 200 employees working out of Africa and serving African customers."
  },
  {
    "headline": "Binance To Offer $30,000+ in Prizes To Hackathon Participants in Africa",
    "summarized_story": "The 20-day hackathon will empower blockchain engineers to rapidly build blockchain solutions on the Binance Smart Chain in order to solve real problems identified in the African systems in place today.\nIn line with the company’s commitment to Africa and the growth of the blockchain ecosystem, Binance continues to empower blockchain engineers.\nParticipants will also have the opportunity to win limited edition NFTs and Binance Swags during the Hackathon period.\nRegister for the opening ceremony of the Binance Hackathon HEREWho can participate: All developers, builders, and creators from Africa (hackathon is open to both beginners and non-beginners)How to participate in the hackathon: Join the Telegram group here and sign up through the Hackerlink special landing page where all hackathon projects will be submitted.\nWhat to expect: All DeFi and NFT projects will be built on the Binance Smart Chain and made completely open source."
  },
  {
    "headline": "2021 Oxford Africa Conference Innovation Fair Pitch competition: Winners announced!",
    "summarized_story": "The Oxford Africa Conference Innovation Fair took place on the 28th and 29th of May 2021 with a cohort of 11 highly innovative companies, based across five African countries.\nIn addition, each company received one-on-one mentorship from an industry leader in their field, which was enabled by the support of the TechCabal team.\nThe Fair ended with a highly competitive pitch competition judged by: Dr. Watu Wamae (PhD) – Research Engagement Manager at the Africa Oxford Initiative; Dr. Amy Kao (PhD) – Oxford Sciences Innovation Associate and Dr. Tinashe Chandauka – Oxford Sciences Innovation Associate.\nEmerging from the 11 finalists, the overall cash prize winners were: Maxi Mobility winning 5,000 GBP for first place, Hustlenomics winning 2,500 GBP for second place and Sanaa space winning third prize of 1,000 GBP.\nThe 11 finalist companies in the Oxford Africa Conference Innovation Fair were:EcoboraEcovonHustlenomicsMazi MobilityNatal CaresNuna Premium ResourcesAkoo AudiobooksPledreRecon Health MediaSanaa SpaceThe icreate ProjectFollow the Oxford Africa Conference social media pages or look at our website to learn more about the companies and conference:Or contact:Shaan Pattni, Daniel KandieCo-Managers of the Oxford Africa Conference Innovation Fair"
  },
  {
    "headline": "AA Rano, Petrogas, MRS, others get Nigeria’s first marginal fields in 18yrs",
    "summarized_story": "AA Rano, Petrogas, MRS, others get Nigeria’s first marginal fields in 18yrsLocal indigenous oil firms including AA Rano, Petrogas, MRS, Duport Midstream, among others have received award certificates of Nigeria’s first marginal oilfield bid round since 2003 when 24 assets were put on offer.\nThe process, which culminated in the presentation of letters to the bid winners in Abuja by the industry regulator, started in June…"
  },
  {
    "headline": "Nigeria continues to snub its human capital in chase of shadows",
    "summarized_story": "Nigeria continues to snub its human capital in chase of shadowsNigeria has a demographic advantage that some other countries would wish for, just ask China.\nChina will allow all couples to have a third child, local media reported Monday, a move aimed at slowing the nation’s declining birth rate as risks to the economy’s long-term prospects mount because of a rapidly aging population."
  },
  {
    "headline": "Is Nigeria on a self-destruct mission?",
    "summarized_story": "Every reasonable and responsible citizen or organisation in Nigeria should be concerned about the goings-on in the country these days.\nIt would seem to us that the country is on a self-consuming mission.\nThe raging fire of insecurity and hate is sweeping across the country, and no nation survives this way.\nIn the…Don’t miss another story Become a BusinessDay Subscriber today.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "World No Tobacco Day: Edo govt urges urgent measures to save over 16,000 lives lost annually to tobaccoC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has expressed concern over 16,100 Nigerians killed annually by tobacco, calling for urgent measures and partnerships among relevant stakeholders to check its consumption and reduce the health and other risks associated with tobacco use.\nPermanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa said this while briefing journalists in Benin City in commemoration of the World No Tobacco Day, marked by the World Health Organisation (WHO) and other organs to raise awareness and check the consumption of tobacco.\n“The Tobacco Atlas 2018 report for Nigeria, estimates more than 16,100 annual deaths from tobacco-related diseases.\n“Today as we observe World No Tobacco Day, I call on people of all ages, especially the young, to join the fight against the tobacco epidemic.\nI encourage youth groups to build a movement for a tobacco free generation."
  },
  {
    "headline": "Ize Iyamu Congratulates Gov Obaseki, pledges loyalty – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Candidate of the All Progressives Congress (APC) in the last Governorship election in Edo State, Mr. Osagie Ize-Iyamu on Monday congratulated the governor of Edo state, Mr. Godwin Obaseki over his victory at the Supreme Court which upheld his re-election.\nThis was contained in a letter addressed to the state governor and signed by Osagie Ize-Iyamu in Benin City, Edo state.\nIze-Iyamu said the judgement of the Supreme Court last Friday however put an end to the series of litigations over last year’s governorship elections in the state.\nOn our part, our party, the APC had only one case against Your Excellency and your party.\nOur appeal is that you consider paying them their entitlements since it is now late for them to return to their offices."
  },
  {
    "headline": "Obaseki, Shaibu, others to receive second jab of COVID-19 vaccine tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…as Edo flags off second dose vaccinationBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, his deputy, Rt.\nComrade Philip Shaibu and other political, religious and traditional leaders in the state will tomorrow, Tuesday, June 01, 2021, receive the second jab of the Oxford-Astrazeneca COVID-19 vaccine, as the state begins second dose vaccination in its efforts to contain the pandemic and protect citizens.\nThe Permanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa, who disclosed this to journalists in Benin City, urged eligible citizens to present themselves for the second dose vaccination to get full protection against the virus.\nAccording to him, “Obaseki and other dignitaries will be vaccinated with the second dose of the vaccine at the official flag-off ceremony coming up on Tuesday, June 01, 2021.\nIrowa further noted that the COVID-19 vaccines in the state are safe, effective and administered free of charge."
  },
  {
    "headline": "Edo market women hail Supreme Court verdict, say confidence in Obaseki was never misplaced – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Traders in Edo State have hailed the Supreme Court verdict dismissing the alleged certificate forgery suit against Governor Godwin Obaseki and affirming the governor’s victory at the September 19 governorship poll, adding that Edo people’s confidence in the governor was never misplaced.\nAnother trader, Mrs. Vivian Obi, while commending the verdict of the Supreme Court, said, “I never had any doubt about Governor Obaseki’s qualification for the number one seat in the state.\n“Obaseki has never disappointed the Edo people.\nI am happy with the verdict of the Supreme Court.\nThe Supreme Court’s five-man panel of justices on May 28, 2021 upheld the ruling of the Appeal Court, which dismissed the alleged certificate forgery suit filed by the APC against the Governor, during the 2020 governorship election."
  },
  {
    "headline": "Senate receives Buhari’s request to confirm Farouk Yahaya as COAS",
    "summarized_story": "ADVERTISEMENTThe Senate has received a formal request from President Muhammadu Buhari to confirm the appointment of Farouk Yahaya, as Nigeria’s Chief of Army Staff.\nThe request was contained in a letter read out by the Senate President at the start of plenary on Tuesday.\nIn the letter, the president said Mr Yahaya’s appointment was in compliance with the provisions of Section 18(1) of the Armed Forces Act 2004.\nThe president’s request will be referred to the appropriate Senate committee for screening and possible confirmation.\nUntil his appointment, the new army chief was the Theatre Commander of Operation Hadin Kai, the counter-insurgency operation in the North-east."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NECO Registrar, Obioma died after brief illness – Police",
    "summarized_story": "OBINNA EZUGWUThe Niger State Police Command has dismissed as untrue, reports that the Registrar of the National Examination Council (NECO), Professor Godswill Obioma, was murdered by gunmen in his home in Minna, the state capital.\nThe police command in a statement on Tuesday in Minna by its Public Relations Officer, Mr. Wasiu Abiodun, said the story is totally false, untrue and a pure element of fake news.\nThe statement said “it is important to state categorically that on 31st May, 2021, the Registrar/CEO, National Examinations Council (NECO), Prof. Godswill Obioma, was rushed to National Hospital, Abuja, by his family members where he was later confirmed dead after a brief illness.”The statement added that the family of the deceased has also confirmed the incident and formally notified the management and staff of NECO of the demise of the Registrar.\nThe police thereby urged members of the public to disregard the fake news, while advising news reporters to always verify their reports before publication to avoid creating unnecessary panic and fear in public domain."
  },
  {
    "headline": "Zamfara gov, Matawalle sacks entire state executive council",
    "summarized_story": "OBINNA EZUGWUGovernor of Zamfara State, Dr. Bello Matawalle, has dissolved the state executive council and ordered commissioners, secretary to the state government, among other appointees to have over to permanent secretaries with immediate effect.\n“The State Executive council is hereby dissolved with immediate effect.\nThe Secretary to the State Government, Chief of staff and Deputy chief of staff are relieved of their duties.\nAll chairmen, members of the state commission and boards of various agencies are hereby dissolved,” Matawalle announced in a statement via his twitter handle, @Bellomatawalle1 on Tuesday.\nAll Commisioners are directed to hand over affairs of their ministries to their respective permanent secretaries."
  },
  {
    "headline": "Controversy over death of NECO Registrar, Godswill Obioma",
    "summarized_story": "OBINNA EZUGWUControversy has surrounded the death of Professor Godswill Obioma, Registrar of National Examination Council (NECO), who died on Monday.\nInitial report had indicated that gunmen invaded his residence and strangled him to death, a account attributed to his wife, Elizabeth Obioma.\nA report by the medium said Obioma, 67, had been facing attempts to remove him from office as the head of NECO.\nPrince Godswill Obioma, the son of the deceased in a text message to the Director of Human Resources on behalf of the family, said: “Dear Sir, this is to formally inform you that my father Prof. Godswill Obioma the Registrar/Chief Executive of NECO passed to eternal glory yesterday 31/5/2021 after a brief illness.\n“This is soft-spoken NECO Registrar, Prof. Godswill Obioma."
  },
  {
    "headline": "2023: Why I will run again, by Kingsley Moghalu",
    "summarized_story": "Soon after we found a private clinic and moved him there, he went into a coma and passed on shortly afterwards.\nWith life in it increasingly nasty, brutish and short, the very idea of Nigeria is now almost meaningless to many Nigerians.\nIf elected, I will run a government with a dream team of highly competent Nigerians from all parts of our country.\nI seek the support of all compatriots—of everyone who is tired of our present national situation.\nWe also need the energy and support of the youth, the middle class, entrepreneurs, and our compatriots in the diaspora."
  },
  {
    "headline": "Miss Idoma To Empower 100 Girls In Benue South",
    "summarized_story": "As part of her pet project, the current Miss Idoma, Queen Maria Ajeni, is set to empower over 100 Idoma girls in Benue South senatorial zone of Benue State.\nThe project themed, ‘Give Her Something To Do’ would be done in collaboration with an House of Assembly aspirant for Ado State Constituency, Hon.\nAccording to the beauty queen, over 100 Idoma girls would be trained in various skills such as fashion design, baking, make-up and deco, fish and snail farming, among others.\nShe said, “We are giving the Idoma girl-child something to do.\n“We are calling on our people who have the youth at heart to support this project in on way or the other.”"
  },
  {
    "headline": "Miss Idoma To Empower 100 Girls In Benue South",
    "summarized_story": "As part of her pet project, the current Miss Idoma, Queen Maria Ajeni, is set to empower over 100 Idoma girls in Benue South senatorial zone of Benue State.\nThe project themed, ‘Give Her Something To Do’ would be done in collaboration with an House of Assembly aspirant for Ado State Constituency, Hon.\nAccording to the beauty queen, over 100 Idoma girls would be trained in various skills such as fashion design, baking, make-up and deco, fish and snail farming, among others.\nShe said, “We are giving the Idoma girl-child something to do.\n“We are calling on our people who have the youth at heart to support this project in on way or the other.”"
  },
  {
    "headline": "Farm4Me CEO Bags Royal Award For Creating Jobs In Agric Sector",
    "summarized_story": "The chief executive officer of Farm4Me, ViableX and Ceepass, Mr Adama Adama, has been honoured with the Royal African Young Leadership Award for creating jobs in the agricultural sector.\nThe award was in recognition of his ingenuity at creating social impact businesses that provide employment for the masses.\nThe event, which was held at Oduduwa Hall, Obafemi Awolowo University, Ile-Ife, Osun State, was organised by the Ooni of Ife’s Royal African Young Leadership Forum (RAYLF), a youth development and capacity initiative.\nThe 2021 award ceremony was declared open by Oba Adeyeye Enitan Ogunwusi Ojaja II, the Ooni of Ife.\nA month earlier, It also added to its kitty the international award of West Africa’s Best World-Class Digital Agricultural Investment Platform Brand."
  },
  {
    "headline": "Farm4Me CEO Bags Royal Award For Creating Jobs In Agric Sector",
    "summarized_story": "The chief executive officer of Farm4Me, ViableX and Ceepass, Mr Adama Adama, has been honoured with the Royal African Young Leadership Award for creating jobs in the agricultural sector.\nThe award was in recognition of his ingenuity at creating social impact businesses that provide employment for the masses.\nThe event, which was held at Oduduwa Hall, Obafemi Awolowo University, Ile-Ife, Osun State, was organised by the Ooni of Ife’s Royal African Young Leadership Forum (RAYLF), a youth development and capacity initiative.\nThe 2021 award ceremony was declared open by Oba Adeyeye Enitan Ogunwusi Ojaja II, the Ooni of Ife.\nA month earlier, It also added to its kitty the international award of West Africa’s Best World-Class Digital Agricultural Investment Platform Brand."
  },
  {
    "headline": "Tension Heightens In Abuja Community Over Demolition Threat",
    "summarized_story": "Residents of Ushafa community in Bwari Area Council of Federal Capital Territory (FCT) Abuja, have raised the alarm over the FCT Water Board and some estate developers’ alleged connivance and effort to convince the FCT Minister to demolish the community.\nNarrating the beginning of the threat, Danladi said, “The demolition threat first came up in 2018 when the management of the Usman Dam situated in the community showed up, approaching the community to set aside about 200 meters away from the Dam but was resisted by the indigenes.\n“The most shocking move came up in March this year (2021) when the Water Board authority stormed the community with virtually representatives of all departments and agencies under FCTA.\nThis time around, the officials stated that they had gotten ministerial approval to implement 500 meters away from the Dam which is almost half of Ushafa community.\nThe FCT Water Board acting general manager, Dame Joy Okoro, had earlier said in a publication that, “as far as I know, I do not know about any attempt to grab land."
  },
  {
    "headline": "Kwara people have enjoyed 2 years of freedom under Gov. Abdulrazaq’s leadership – APC chieftain",
    "summarized_story": "By Tunde OpalanaA chieftain of the All Progressives Congress (APC) in Kwara State, Asiwaju Tajudeen Abioye has congratulated the people of Kwara State for having a new lease of life under the administration of governor Abdulrahaman Abdulrasaq in the past 730 days.\nHe said with huge dividends of democracy and human development policies and programmes of the Abdulrazaq’s government, Kwarans are reaping the benefits of Otoge revolution through which they ensure a change of government in Kwara State.\n“The Abdulrahaman led administration handles security situation with high sense of responsibility and professionalism.\n“Before the assumption of the new administration, Kwara State had been blacklisted by many federal government agencies for her inabilities to fulfill her obligations to various organs of government that would in turn bring more dividends of democracy to our people.\n“But, Governor Abdulrahaman was able to cut cost of governance which gave him good opportunities to paid up all the outstanding debts and balances to various organs of Federal Government."
  },
  {
    "headline": "Southeast Governors call for probe into Gulak’s death —",
    "summarized_story": "The South East Governors’ forum has urged security agencies to immediately arrest those responsible for the murder of Alhaji Ahmed Gulak, an APC Chieftain.\nThe forum described the murder of Gulak, in Owerri, Imo, as a national catastrophe.\nThe governors condoled the Gulak’s family, the Adamawa Government and Nigerians in general.\n“We assure our fellow northern governors of our commitment to unravel all masterminds of the act.\n“The forum urges the public to exercise restraint and allow security agencies continue with their investigations while assuring that all those involved in the act will be brought to justice,” the forum said."
  },
  {
    "headline": "Ebonyi massacre: Change security tactics, indigenes charge Umahi",
    "summarized_story": "By Tunde OpalanaConcerned Ebonyi indigenes under the aegis of the Association of Ebonyi State Indigenes in Diaspora (AESID) has blamed the continued massacre of people in the state on ineffective handling of security tactics by the state governor, Dave Umahi.\nDisturbed by the report of recent attacks by suspected Fulani herdsmen on Odoke, Ndiobasi and Obakotara communities in Izhi, Ebonyi Local Government Area, the AESID) said the governor’s handling of security situation has been responsible for the continued killings in the state.\n“As we speak, medical and health-care workers in various parts of the State are offering treatments to scores of victims who sustained varying degrees of injuries during the attack.\n“Our anxiety over this sadly depressing attacks is made worse by the fact that the State’s Chief Security Officer, Engr.\n“This group consequently condemn the claim that the attack took place in Benue State and the attempt by the State government to further downplay or trivialize not only the latest attack on Izhi communities but the entire security affairs in our dear State."
  },
  {
    "headline": "PRP slams APC, says ruling party survives by divisive conflicts, corruption",
    "summarized_story": "Idibia Gabriel, KadunaPeoples Redemption Party (PRP) has said that the deplorable state of the nation was the consequence of bad governance and misrule of the ruling All Progressives Congress (APC).\nPRP accused APC of surviving by encouraging divisive conflicts, endemic corruption, looting of state resources and other vices.\nThe party made the assertions in a communique issued Monday at the end of its 2nd national delegates conference held in Zaria, Kaduna State between 29th and 31st May, 2021.\n“In other words, APC is not fundamentally different from PDP in the self-serving manner they dominate the nation’s political system.\n“The PRP is thus a viable alternative to the Ideologically barren politicians occupying state power in Nigeria."
  },
  {
    "headline": "Wife, son disagree on how NECO Registrar, Godswill Obioma, died",
    "summarized_story": "The Registrar of the National Examinations Council, Professor Godswill Obioma, is dead.\nObioma died on Monday night at his Minna residence in the Niger State capital.\nThe deceased’s wife, Mrs Elizabeth Obioma, told newsmen that her husband was killed by assassins.\nHowever, the son of the deceased in a letter addressed to the Director Human Resource Management, NECO, Mustapha Abdul, attributed the death of his father to a “brief illness”.\n“We request that you kindly notify the Board, Management and the entire staff of the Council of this development."
  },
  {
    "headline": "Wife, son disagree on how NECO Registrar, Godswill Obioma, died",
    "summarized_story": "The Registrar of the National Examinations Council, Professor Godswill Obioma, is dead.\nObioma died on Monday night at his Minna residence in the Niger State capital.\nThe deceased’s wife, Mrs Elizabeth Obioma, told newsmen that her husband was killed by assassins.\nHowever, the son of the deceased in a letter addressed to the Director Human Resource Management, NECO, Mustapha Abdul, attributed the death of his father to a “brief illness”.\n“We request that you kindly notify the Board, Management and the entire staff of the Council of this development."
  },
  {
    "headline": "Biafra: A byword for freedom and justice – VALENTINE OBIENYEM",
    "summarized_story": "During the war, Igbos looked on him as a messiah.\nThroughout his painful but joyous romance with Biafra, he manifested a freedom far superior to corruption, and base consideration of money.\nOne of the Biafran soldiers who held on till the surrender explains the reason thus:But the strength of a ruler is often the weakness of his government.\nWith the capture of Biafra, even friends turned against Ojukwu; he became the sole father of Biafra.\nCulled from my biography of Ojukwu entitled “Ojukwu: The Last Patriot”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ebonyi massacre: Fulani herdsmen attacked seven Igbo villages, 3000 persons displaced",
    "summarized_story": "“The communities worst hit by the attack are; Ndigwe village, Ataloga village, Odokem, Ekile village, Nduobasi village, Ekpufu and Obakota villages.\n“We further appreciate and pledge our loyalty to the government of Benue State.\nHe however commended the Ebonyi State governor for his quick response and immediate dispatch of relief materials to the affected community.\nOther well-meaning Ebonyi stakeholders such as the Speaker of Ebonyi State House of Assembly, Rt.\nFrancis Nwifuru and the Chairman of Ebonyi Local Government Area of Ebonyi State, Mrs. Chinyere Nwoagbaga have reached out to the victims of the Sunday attack."
  },
  {
    "headline": "JUST IN: Godswill Obioma NECO registrar in sudden death",
    "summarized_story": "By AbankulaProfessor Godswill Obioma, the registrar of the National Examinations Council (NECO) has died.\nAccording to reports, Obioma died in home in Dutse Kura quarters in Minna on Monday.\nObioma, 67, was appointed as the Registrar of NECO on the 22 May 2020 by President Buhari.\nPolice and NECO sources said the testimony by the wife that he was assassinated was also untrue.\n*This reports has been updated to give the latest information."
  },
  {
    "headline": "Ayade was not appreciated in PDP: Speaker",
    "summarized_story": "Speaker of Cross River House of Assembly, Eteng Jonah-Williams has said that Gov.\nBen Ayade was not respected and honoured by the hierarchy of the People’s Democratic Party (PDP) before his defection to the All Progressives Congress (APC).\nThe Speaker, who represent Yakurr II State Constiturncy in the Assembly, said that out of the 25 House of Assembly members in the state, APC has 18, while the PDP has seven.\n“While in PDP, the governor was not respected and given the honour he deserved by the hierarchy of the PDP as the leader of the party in the state.\nAccording to the Speaker, the remaining two years period of Ayade will attract the needed development from the centre into the state."
  },
  {
    "headline": "Updated: It’s sudden death, Godswill Obioma not assassinated",
    "summarized_story": "By Abankula with agency reportReports that Professor Godswill Obioma, registrar of the National Examination Council(NECO) was assassinated have been debunked by competent sources in Minna.\nBoth the police and officials of NECO said Obioma died a natural death and also reconstructed the timeline of his death.\nAccording to senior NECO officials who spoke with our correspondent, Obioma arrived from Abuja on Monday morning, not Monday night.\nNECO officials who visited him at about 9 a.m at his Dutse Kura quarters in Minna, were told by Obioma that he would soon report in the office.\nBoth the police and NECO officials debunked the assassination story as fake news and the testimony of the wife, Elizabeth as cock and bull stuff."
  },
  {
    "headline": "‘Tribal Killings Have Begun In Nigeria’ – Fani-Kayode Reacts To Death Of NECO Registrar",
    "summarized_story": "Nigerian Activist and former Minister of Aviation, Chief Femi Fani-Kayode, has indirectly said that “Tribal killings and genocides” have officially began in Nigeria.\nHe made this statement after Ahmed Gulak was killed in Imo state (Igbo land) and NECO Registrar, Godswill Obioma, was killed in Minna, Niger state – (Fulani/Hausa land).\nHe said after Ahmed was killed, threats were made by the Fulanis.\nAfter the threats, NECO Registrar, Godswill Obioma, an Igbo got killed.\nOn Tuesday, Godswill Obioma, a prominent Igbo and Registrar of NECO,was killed in Minna."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Kill NECO Registrar",
    "summarized_story": "Godswill Obioma, the NECO Registrar, was assassinated.\nA police spokesman did not immediately return a request seeking comments about the development, a report by Peoples Gazette said.\nRecall that NECO Registrar Godswill Obioma has been facing threats to remove him from office as the head of NECO, a prominent examination body run by the Nigerian government.\nThe 67-year-old Obioma, was appointed NECO Registrar barely a year ago on May 14, 2020.\nMeanwhile, the murder of NECO Registrar Godswill Obioma came barely a day after Ahmed Gulak, a top politician of the ruling APC, was gunned down in Owerri, raising widespread fears of insecurity."
  },
  {
    "headline": "BREAKING: Buhari Has Failed Nigeria, I’ll Run For President In 2023 To Tackle APC – Moghalu",
    "summarized_story": "The former Deputy Governor of the Central Bank of Nigeria, Kingsley Moghalu, has declared his intention to run for president in 2023.\nHe said President Muhammadu Buhari led government has failed Nigerians, hence there is need for him to save the nation from collapsing.\nSee his full statement below:2023: I WILL RUN BECAUSE WE THE PEOPLE MATTERWhat is the value of a Nigerian life?\nWith life in it increasingly nasty, brutish and short, the very idea of Nigeria is now almost meaningless to many Nigerians.\nIf elected, I will run a government with a dream team of highly competent Nigerians from all parts of our country."
  },
  {
    "headline": "BREAKING: Fire Guts Mokland Hotel In Lagos",
    "summarized_story": "The Mokland Hotel, located at 3/9 Olakoleosho Street in Ikeja, Lagos, was gutted by fire on Monday evening, demolishing other buildings in the process.\nAccording to an eyewitness, the fire started around 7 p.m. on the topmost Penthouse floor of the building.\nLagos State Services fire crews are now struggling to put out the roaring flame.\nThe cause of the fire could not be determined as of press time.\nMr Amodu Shakiru, a spokesman for the state fire department, verified the occurrence, stating that the Lagos rescue team is preventing the fire from spreading to further levels and neighboring structures."
  },
  {
    "headline": "Pictures: Ex- aviation Minister, Osika Chidoka, visits, condoles with Ahmed Gulak’s family",
    "summarized_story": "NextWhen a governor identifies with his colleagues: Gov Bala’s example"
  },
  {
    "headline": "How my father died, NECO registrar’s son opens up",
    "summarized_story": "Contrary to media reports that Professor Godswill Obioma, the late registrar of National Examinations Council (NECO) was murdered in his home in Minna, Niger state, the deceased’s son said that his father died as a result of brief illness.\nPrince Godswill Obioma II, son of the late Professor said in a statement on Tuesday morning on behalf of the family that his father died after a brief illness.\n“Dear Sir, this is to formally inform you that my father, Prof. Godswill Obioma, the Registrar/Chief Executive of NECO passed to eternal glory yesterday 31/5/2021 after a brief illness,” he wrote.\nPrince Obioma also notified the management of NECO and the Board as well as the staff members of the passing of his father due to a brief illness.\nThere had been reports suggesting that the late NECO registrar might have been strangled in his room on Monday evening in his apartment in Minna."
  },
  {
    "headline": "Pictures: Unknown gunmen attack Isu police station in Imo",
    "summarized_story": "NextGulak: South-east governors take stand, tell security agents what to do"
  },
  {
    "headline": "Gulak: Senate President cautions against revenge -NigPilot",
    "summarized_story": "Following the gruesome murder of a former Speaker of the Adamawa State House of Assembly and chieftain of the All Progressives Congress, APC, Hon.\nAhmed Gulak by unknown gunmen on Sunday in Oweri, Imo State, the Senate President, Dr. Ahmad Lawan has appealed for restraint on the part of those calling for revenge.\nThe Senate President, while condemning the killing, maintained that there can be no justification for the brutal murder of a human being and fellow citizen.\nThe Imo State Police Command, however, announced on Sunday night that the it has neutralised the killers of the foremost politician and lawyer as well as recovered ammunition and vehicles from them.\nThe group, however, withdrew the threat yesterday following the elimination of the suspected killers of the late politician by the state Police Command."
  },
  {
    "headline": "Farouq advocates use of floodwater for electricity generation -NigPilot",
    "summarized_story": "Farouq, said this at the technical stakeholders’ meeting and streamed live on Zoom, to review the draft National Multi-Sectoral Flood Emergency Preparedness and Response Plan.\nthe Minister stated that flood waters can be harnessed for beneficial purposes such as agriculture, electricity and other uses.\n“This will enhance Nigeria’s ability to manage all flood-related disasters using a comprehensive disaster management cycle approach.\nThere are several plans and policy documents that cover Disaster Management and risk reduction in general, with little attention to flooding in particular.\nHowever, this Plan provides a unique in-depth analysis of flood preparedness, mitigation and response at all levels and clarifies agency-specific mandates, roles and responsibilities."
  },
  {
    "headline": "Lagos-lbadan rail: FG Promises succour for affected communities minister -NigPilot",
    "summarized_story": "Federal Government has assured host communities adversely affected environmentally or otherwise by the construction of the Lagos-Ibadan rail modernization project of assistance.\nA statement issued by the Director, Press and Public Relations of the Ministry of Transportation, Eric Orjiekwe in Abuja.\nThe Minister who made this known yesterday barely one week after the previous inspection, in preparation for the commissioning in June, further assured that issues of erosion or flooding occasioned by the construction will be addressed.\nIn furtherance to that, he directed the Permanent Secretary of the Ministry, Dr. Magdalene Ahani to ensure that the communities are visited to ascertain the level of impact and possible interventions.\nThe Permanent Secretary, Ministry of Transportation, Dr. Magdalene Ajani, some Directors of the Ministry Chairman, Governing Board, NRC, Ibrahim Alhassan Musa, Managing Director, NRC, Fidet Okhiria , the new Managing Director, CCECC, Zhang Zhichen, and the Consultants, TEAM were among dignitaries present at the inspection."
  },
  {
    "headline": "No NAF aircraft crash landed in Akure -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF), yesterday denied a trending online report that it is laboring hard to cover up its ATR 42 aircraft that crash-landed in Akure the Ondo State capital.\nThe Director of Public Relations and Information, Nigerian Air Force, Air Commodore Edward Gabkwet in a statement, claimed that the trending report is completely false.\nHe said that the story was concueted to tarnish the good image of the Nigerian Air Force (NAF).\nThe fake report has again proven that some people are working overtime and hell-bent in tarnishing the good image of the Nigerian Air Force (NAF) at all cost.\nRecall that the Nigerian Air Force (NAF), last week, ordered the investigation of its operational, and engineering units to ascertain the factors responsible for the incessant crashes of its aircraft."
  },
  {
    "headline": "Kaduna: Four Killed As Bandits Attack Jemaa LGA",
    "summarized_story": "No fewer than four people have been killed and one person injured as bandits attacked Goska community in Jemaa Local Government Area of Kaduna State.\nAccording to the Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, the armed bandits invaded the community and killed four residents including two males and two females.\nThe two males according to security reports were attacked and killed on their farms by the assailants.\nThis attack comes days after ten people were killed during an attack and counter-attacks at two villages in Giwa Local Government Area of Kaduna State.\nAruwan explained that in a reaction to the killings, youths of Na’ikko village attacked a nearby Fulani settlement, Rugan Abdulmuminu, and killed two persons whom they alleged to be involved in the initial attack."
  },
  {
    "headline": "South East Governors Meet Over Attacks In Region, Vow To Tackle Insecurity",
    "summarized_story": "Members of the South East Governors’ Forum met on Monday as part of efforts to tackle the rising security challenges in the region.\nAt the virtual meeting of the governors, the leaders discussed ways to tackle the security threats in the region and secure the lives of the people.\nThe governors also sympathised with the families of all those who have lost their lives during the moment of violent hostilities in the region.\nThey, however, appealed to the people to exercise restraint and allow the security agencies to continue with their investigations.\nThey resolved to stand with the Imo State Governor, Hope Uzodima, and the security agencies in their efforts to unravel the masterminds of the killing."
  },
  {
    "headline": "NECO Registrar, Godswill Obioma, Is Dead",
    "summarized_story": "The Registrar and Chief Executive of the National Examination Council (NECO), Professor Godswill Obioma, is dead.\nObioma’s death was announced in a statement on Tuesday by his son, Prince Godswill Obioma II, on behalf of the family.\nThe younger Obioma revealed that the NECO registrar died on Monday after a brief illness, contrary to the claims that he was killed.\nProfessor Obioma, a 67-year-old indigene of Abia State, assumed office as NECO Registrar on May 22, 2020.\nProfessor Obioma served as the President of the UNESCO International Bureau of Education (IBE) Council from 2014 to 2016, having previously served as its Vice President representing the Africa region."
  },
  {
    "headline": "Rescue 200 Abducted Islamic Students, Buhari Urges Security Agencies",
    "summarized_story": "President Muhammadu Buhari has ordered security and intelligence agencies to hasten their moves to rescue the 200 children kidnapped from an Islamic school in Niger State.\nHe added that President Buhari urged all the agencies involved in the rescue operation to do their utmost in securing their immediate release.\nThe President also directed the concerned government agencies to extend possible support to the families of the kidnapped children.\nKetso said that though the numbers of the kidnapped school children is not fully ascertained, efforts by security agencies to secure their release have been intensified.\nHe said that the government has made contact with some of the identified parents of the kidnapped children, assuring them of their safe return."
  },
  {
    "headline": "Ex-German Goalkeeper Kahn Replaces Rummenigge As Bayern Munich Chairman",
    "summarized_story": "Bayern Munich said on Tuesday Karl-Heinz Rummenigge will step down after 30 years in the club’s hierarchy at the end of this month with former Germany captain Oliver Kahn taking over as chairman.\nRummenigge joined the club’s management in 1991 as vice-president and then became chairman in 2002, overseeing an incredible period of success.\nWith Rummenigge on board, Bayern won the Bundesliga 19 times and lifted the Champions League trophy in 2001, 2013 and 2020.\nA former striker who made 95 appearances for West Germany, Rummenigge played for Bayern from 1974 to 1984.\n“As chairman, Karl-Heinz Rummenigge has done great work for Bayern for over 20 years,” said Kahn, who has been tipped as their next chairman since joining the club’s board in January 2020."
  },
  {
    "headline": "Police arrest 15 suspects in connection with Kaura Namoda protest, recover ammunition",
    "summarized_story": "Police in Zamfara have arrested fifteen Hoodlums in connection to Monday’s protest by youths in Kaura Namoda local government area of the state.\nAmong the suspects are two adults who were arrested during the protest that almost turned bloody as vehicles and other properties were destroyed by the protestersThe protest has also grounded economic activities in the area as Monday’s is usually the Kaura Namoda market dayItems recovered from the suspects include six motorcycles, four Locally Made Guns using motorcycle plug as bullet, one machetes, sticks and assorted charmsThe Commissioner of Police Zamfara state Command Hussaini Rabiu warn against unlawful gathering and any move capable of destabilising the peace enjoyed in the stateAdvertisementHe adds that the police under his watch will continue to be professional in the discharge of its constitutional roles in ensuring Zamfara becomes a more safer place for allThe Zamfara State Police Command also denied stories making the round that two police officers were killed by the youths during the protest.\nNormalcy has since been restored in the affected towns and no casualty was recorded in the part of the police and the protesters."
  },
  {
    "headline": "Police parade 15 hoodlums arrested in connection with Kaura Namoda protest in Zamfara",
    "summarized_story": "Police in Zamfara has arrested fifteen Hoodlums’ in connection to Monday’s protest by youths in Kaura Namoda local government area of the stateAmong the suspects are two adults who were arrested during the protest that almost turned bloody as vehicles and other properties were destroyed by the protestersThe protest has also grounded economic activities in the area as Monday’s is usually the Kaura Namoda market dayAdvertisementItems recovered from the suspects include six motorcycles, four Locally Made Guns using motorcycle plug as bullet, one machete, sticks and assorted charmsThe Commissioner of Police Zamfara state Command Hussaini Rabiu warn against unlawful gathering and any move capable of destabilising the peace enjoyed in the stateHe adds that the police under his watch will continue to be professional in the discharge of its constitutional roles in ensuring Zamfara becomes a more safer place for allThe Zamfara State Police Command also denied stories making the round that two police officers were killed by the youths during the protest.\nNormalcy has since been restored in the affected towns and no casualty was recorded in the part of the police and the protesters."
  },
  {
    "headline": "Bus Fares In Nigeria Jumped By 72%, ‘Okada’ By 86% In April 2021",
    "summarized_story": "Tajudeen Ibrahim, SVP and Head of Research at Chapel Hill Denham, spoke to the Global Business Report about the Bureau of Statistics latest Transport fare report for April 2021.\nHe also spoke about the possibility of rising rent in Nigeria and the factors contributing to it.\nWatch this informative video for more…"
  },
  {
    "headline": "Fellow Athletes Rally Around Osaka after French Open Withdrawal",
    "summarized_story": "Leading figures in tennis and sport have rallied to support Naomi Osaka after the women’s world number two withdrew from the French Open in a row about post-match media duties, saying she had been suffering from “depression” and “anxiety”.\nThe four-times Grand Slam champion had signalled her intentions to skip her media duties to protect her mental well-being on social media and returned to Twitter on Monday to announce her withdrawal.\nBillie Jean King echoed comments from fellow women’s tennis trailblazer Martina Navratilova about the importance of mental health.\n“It’s incredibly brave that Naomi Osaka has revealed her truth about her struggle with depression,” King wrote on social media.\n“So the FFT handled the Ms Osaka mental health concerns without empathy or sensitivity."
  },
  {
    "headline": "Indigenous Groups Call for Canada to Identify Graves after Remains of 215 Children Found",
    "summarized_story": "Indigenous groups in Canada are calling for a nationwide search for mass graves at residential school sites after the discovery of the remains of 215 children at one former school last week shocked the country.\nPrime Minister Justin Trudeau said on Monday that searching for more mass graves was “an important part of discovering the truth” but did not make specific commitments.\nTk’emlúps te Secwépemc First Nation announced last week they had found the remains of 215 children, some as young as three years old, buried at the site of the Kamloops Indian Residential School, once Canada’s largest such school.\nThere have long been rumors within indigenous communities, also discussed by the commission, of children buried at these schools.\n“It’s absolutely essential that there be a national program to thoroughly investigate all residential school sites in regard to unmarked mass graves,” he said."
  },
  {
    "headline": "Tesla’s Vehicle Price Increases Due to Supply Chain Pressure, Musk Says",
    "summarized_story": "The price of Tesla (TSLA.O) vehicles is increasing due to supply chain pressures across the auto industry, particularly for raw materials, Elon Musk said on Monday in response to a tweet.\n“Prices increasing due to major supply chain price pressure industry-wide.\nDuring an an earnings conference call in April, Musk said Tesla had experienced “some of the most difficult supply chain challenges,” citing a chip shortage.\nIn response to the removal of lumbar support on the passenger side in Tesla’s Model Y, Musk said, “Moving lumbar was removed only in front passenger seat of 3/Y (obv not there in rear seats).\nNot worth cost/mass for everyone when almost never used.”Earlier on Monday, the Electrek reported that new Tesla Model Y owners are reporting that their electric SUVs are being delivered without lumbar support on the passenger side."
  },
  {
    "headline": "Alpha to Delta: WHO Renames Covid-19 Variants with Greek Letters to Avoid Stigma",
    "summarized_story": "Coronavirus variants are to be known by letters of the Greek alphabet to avoid misreporting and stigmatising nations where they were first detected, the World Health Organization (WHO) has announced.\nThe new system applies to variants of concern – the most troubling of which four are in circulation – and the second-level variants of interest being tracked.\n“While they have their advantages, these scientific names can be difficult to say and recall, and are prone to misreporting,” the WHO said in a statement.\n“The labels don’t replace existing scientific names, which convey important scientific information and will continue to be used in research,” WHO’s technical lead Maria Van Kerkhove tweeted.\nAnother idea to refer to variants of concern as VOC1, VOC2 etc was scrapped after he pointed out it resembled an English swear word."
  }
]