[
  {
    "headline": "Pictorial: Buratai meets Benin Republic President",
    "summarized_story": "Nigeria’s Ambassador to Benin Republic, Lt. Gen. Tukur Buratai (retd.\nBuratai met with the Beninese President on Tuesday during the official presentation of his letter of credence.\nAlso, the Ambassador of Germany to Benin Republic, Michael Derus; as well as those of Ghana, Gabon, and Norway also presented their letters of credence to Talon.\nBuratai, Nigeria’s Chief of Army Staff between July 2015 and January 2021, was deployed as Nigeria’s envoy in the Benin Republic in June 2021.\nSome of the other offences said to have been committed by the activist include entering Benin Republic illegally as well as alleged planned intent to cause social unrest in Benin Republic."
  },
  {
    "headline": "Malami, Buratai behind Sunday Igboho’s detention in Cotonou -Yoruba Nation agitators",
    "summarized_story": "Yoruba Nation agitators under the aegis of Yoruba Koya Liberation Movement have blamed the Minister of Justice and Antoney General of the Federation, Abubakar Malami; and a former Chief of Army Staff and Nigerian Ambassador to Benin Republic, Tukur Buratai, for the detention of Sunday Adeyemo, popularly known as Sunday Igboho in Cotonou.\nSunday Igboho, a Yoruba rights activist, was on Monday, returned to prison with fresh charges levelled against him.\nThe Yoruba Self-Determination Group also told the president, President Major General Muhammad Buhari (retd), and other officers of the Nigerian Government to “desist from oppressing humanity or face a disastrous end”.\nWe remember how individuals who stood for the truth and the declaration of June 12 election were hounded by state-sponsored hitmen.\n“We, as a Yoruba self-determination group, sees it’s time that this government and its actors of impunity are reminded that nothing lasts forever."
  },
  {
    "headline": "Pictures: Benin Republic President ‘Patrice Talon’ receives Buratai",
    "summarized_story": "Lt. Gen. Tukur Buratai (retd.\n), Nigeria’s Ambassador to the Benin Republic, has on Wednesday met with the President of Benin Republic, Patrice Talon.\nSee pictures below:"
  },
  {
    "headline": "APC chairmanship: Fixing a dysfunctional party system",
    "summarized_story": "By Wale BakareAs the APC Congress draws near, political patronage is central to what ails the political party administration viz-a-viz system of governance.\nOur dysfunctional democracy gets its root from failed party system and administration is one that can best be described as a failure of an electoral system to excise the virus of the politics of patronage that has infected our so-called elections.\nThere must be an agenda with patriotism as the hallmark for all those seeking party and public offices.\nAs the public expect more drama to unfold, the bunch of aspirants seeking the Chairmanship of the party is a welcome development for a party in governance.\nThe APC vision of the future and the nationA Chairmanship candidate must bring before the APC members, by extension the people, a vision of the future and the nation, which he will strive to realise if he is fortunate enough to get elected."
  },
  {
    "headline": "COVID-19: Nigeria facing multiple concurrent disease outbreaks — FG",
    "summarized_story": "Ehanire who blamed the outbreak of diseases in Nigeria on the tropical climate in Nigeria, population density, high number of international travels and local movements among others added that, all these factors put Nigeria at of infectious disease outbreaks.\nHe said the country is not only faced with a pandemic in Nigeria, but multiple concurrent disease outbreaks.\nThat is our reality – our tropical climate, population density, poor socio-economic factors leave us at risk of annual, multiple, concurrent disease outbreaks in Nigeria.\n“Globally, there is a rise in antimicrobial resistance, and this will affect the prevention and management of infectious disease cases.\nWe recognise that this is a difficult period where several colleagues are working extremely hard in response to an increasing number of COVID-19 cases."
  },
  {
    "headline": "England to open borders to vaccinated U.S., EU citizens soon – Reports",
    "summarized_story": "England is expected to open its borders to allow U.S. and European Union (EU) travellers who are fully vaccinated against the Coronavirus (COVID-19) to enter without the need to quarantine, according to reports.\nIt comes after aviation firms claimed a trial has demonstrated the UK can safely exempt fully vaccinated U.S. and EU visitors from self-isolation.\nAround 250 fully vaccinated passengers on selected flights from New York, Los Angeles, Jamaica and Athens earlier this month presented their credentials using paper or digital formats before boarding the plane.\nBA chief executive Sean Doyle said the trial provides “the evidence the Government needs’’ to allow fully vaccinated visitors from low-risk countries to enter the UK without self-isolating.\nHeathrow boss John Holland-Kaye said: “The vaccine has been a miracle of science, and these trials have shown that we can allow fully vaccinated passengers from the EU and U.S. to visit the UK without quarantine."
  },
  {
    "headline": "Nigerian Consulate in New York to enrol nationals for NIN",
    "summarized_story": "Lot Egopija, stated at a hybrid Town Hall meeting held at Nigeria House in New York for Nigerian nationals within the jurisdiction.\nEgopija said the Consulate had received a directive from the headquarters (Federal Ministry of Foreign Affairs) to enrol its nationals.\nThe Nigerian envoy said the Consulate would soon conclude arrangements with the National Identity Management Commission (NIMC).\nHe said that the Consulate had improved services in the areas of passport delivery, passport issuance and also in the processing of passport and visa documents.\nEgopija said the Consulate was working with Nigeria Immigration Services (NIS) to get sufficient passport booklets to meet the need of Nigerians within New York jurisdiction."
  },
  {
    "headline": "Zamfara: Suspected bandit informant sets self ablaze to protect suspended Emir",
    "summarized_story": "A bandit informant, who was recently arrested with two other informants by security operatives in Zamfara State over the insecurity in Dansadau Emirate of the state, has reportedly set himself ablaze.\nThis was revealed to newsmen in Gusau, the state capital, by a lawmaker representing Maru South, Hon.\nHe said that the Dansadau area is still not accessible because of the unending terror attacks by the armed bandits.\n“The bandits had already sent messages that unless the Emir is released from the security agencies, there would be no peace in Dansadau emirate,” he added.\nAccording to him, Governor Bello Mohammed Matawalle is making concerted effort to make sure that peace is restored in Dansadau area and its environs."
  },
  {
    "headline": "Nnamdi Kanu: Adeyanju makes clarification on claims DSS killed IPOB leader",
    "summarized_story": "Nigerian activist, Deji Adeyanju, has assured that the Department of State Services, DSS, has not killed Nnamdi Kanu, pro-Biafra agitator.\nAdeyanju said though DSS has not killed Kanu, it has subjected him to inhumane treatment.\nIn a tweet, the convener of Concerned Nigerian, urged lawyers of the agitator to insist on Kanu’s transfer to the correctional facility in Kuje.\nHe wrote: “Nnamdi Kanu is not dead or killed by DSS but they are subjecting him to inhumane & degrading treatment.\nThis led to speculations that Kanu may have been killed by the secret police."
  },
  {
    "headline": "Insecurity: Nigerians at bandits, terrorists’ mercy under Buhari’s watch – UK Parliament",
    "summarized_story": "The UK Parliament has said that Nigerians under President Muhammadu Buhari administration are at the mercy of non-state actors who unleash attacks on individuals and communities at will.\nCiting the shooting down of the Nigerian Air Force fighter jet by bandits, they expressed worry that the country was now under the control of non-state actors unleashing terror at will, particularly in the North-East and North-West.\n“An intense gunfire from bandits caused an aircraft returning to base from a mission on the Zamfara-Kaduna border to crash.\n“We fear that Nigerian citizens are now at the mercy of non-state actors who have been allowed to evolve and now have the capacity to shoot down a fighter jet, as has recently occurred in Kaduna.\n“These non-state actors are currently unleashing terror at will, particularly in the North-East and North-West,” the letter said."
  },
  {
    "headline": "Bayelsa: NULGE commends Gov Diri on LG autonomy, minimum wage",
    "summarized_story": "The Bayelsa State chapter of the National Union of Local Government Employees (NULGE) has commended Governor Douye Diri for ensuring that the local government workers in the state now enjoy the national minimum wage and his practice of local government autonomy.\nThe NULGE State President, Comrade Akpos Ekiegha, gave the commendation on Tuesday when the leadership of the union visited the governor at Government House, Yenagoa.\n“Since the prosperity government came on board, local government workers salaries have been paid promptly without borrowing from other sources.\nWhile applauding Governor Diri for the numerous ongoing projects across the state, he appealed for official vehicles for his office and the union secretariat.\nResponding, Diri thanked the state NULGE leadership for putting the records straight on the misconception that state governments were misappropriating local government funds."
  },
  {
    "headline": "Buhari, S/East Govs destroyed ESN to allow herdsmen kill Igbos – HURIWA alleges",
    "summarized_story": "The Sunday night’s attack reportedly saw the gruesome deaths of many Igbo farmers in Uzo-Uwani Local Government Council of the state.\nSadly, in most cases, these killer herdsmen even violently attack and kill the farmers if they have the gut to question them,” HURIWA noted.\n“In the early hours of April 6, 2019, the herdsmen attacked farmers’ settlement in Anambra West Council of Anambra State.\nWhat about the dastardly attack on Umuawa-Ibu community in Okigwe council area of Imo State.\nIn Imo State, armed Fulani herders reportedly unleashed terror in Oguta, Ohaji-Egbema and Orlu as well as other parts of Igbo land."
  },
  {
    "headline": "BBNaija 2021: Fani-Kayode reveals female housemate he’ll support",
    "summarized_story": "Femi Fani-Kayode, a former minister of aviation, has revealed the Big Brother Naija ‘Shine Ya Eye’ housemate he will support this year.\nRecall that on Sunday, host Ebuka Obi-Uchendu welcomed female housemates into the ‘Shine Ya Eye’ house.\nThey are: Angel, Peace, Beatrice, Jackie B, Nini, Liquorose, Sasskay, Maria and Princess.\nFani-Kayode on his Twitter page endorsed Jackie B, declaring support for her.\nHis tweet read: “I fully endorse Jackie B who is the daughter of my dearest sister and friend Senator Grace Bent!"
  },
  {
    "headline": "Igboho to Benin court: I fled Nigeria to avoid being killed",
    "summarized_story": "Sunday Adeyemo (Igboho), standing trial in the Benin Republic has told the court that he fled Nigeria to avoid being killed.\nIgboho’s lawyer, David Ibrahim Salami, told The Nation in Cotonou what transpired at the Benin Court of Appeal on Monday where the agitator appeared before three judges.\nHe said Benin Republic law allows Igboho to be admitted to bail pending the outcome of the investigation.\nAs a result, Igboho was allowed to sit throughout Monday’s court sessions instead of standing before the judges.\nIt is a case between the Benin Republic and Sunday Igboho – nothing more,” he explained."
  },
  {
    "headline": "Doctor divorces beauty queen wife after discovering she's a secret call girl",
    "summarized_story": "One of the world's top spinal surgeons has divorced his former beauty queen wife after claiming he discovered she had been moonlighting as a high-end call girl, court papers allege.\nThe divorce papers, filed in Manhattan Supreme Court, reportedly allege that Ms Turner earned around £500,000 ($700,000) in cash from her clients.\nDr Kim asked Ms Turner how she was supporting herself while the app was being developed, and she allegedly said her great-grandmother gave her a $500,000 (around £360,000) inheritance.\nBut Dr Kim filed for divorce in December 2020 after finding a text message from another man on a computer in the couple’s Upper East Side home in New York, US, court documents state.\nBut court documents claim \"[Ms Turner's] savings and access to funds derived from her receipt of money in exchange for provision of sexual service.\""
  },
  {
    "headline": "Putin: Abramovich, three Russian billionaires in court to challenge British writer’s controversial book",
    "summarized_story": "England’s High Court will begin hearing arguments on Wednesday from lawyers for four Russian billionaires including Chelsea FC owner Roman Abramovich and state-owned oil firm Rosneft about a book on President Vladimir Putin which they say defames them.\nAbramovich is suing both HarperCollins and Belton, according to case details filed with the courts and tribunals service.\nHarperCollins said it would “robustly defend this acclaimed and ground-breaking book and the right to report on matters of considerable public interest”.\nLaw firm Wiggin, which is representing HarperCollins and Belton, did not respond to a request for comment.\nBusinessman Mikhail Fridman is suing HarperCollins for defamation and on data protection grounds."
  },
  {
    "headline": "Why I ended beef with Vector – MI Abaga",
    "summarized_story": "Popular rapper, MI Abaga has opened up on why he ended rift with Vector, a colleague in the music industry.\nMI had released ‘The Viper’, a beef song aimed at Vector, a move which provoked the latter to put out ‘Judas the Rat’, a diss track for the Jos-born artiste.\nSpeaking in a chat with Chude Jideonwo, MI said at some point, he got tired of Vector’s harmful comments about him.\nType MI Vector and see what I’ve said about him,” MI said.\nEvery egbon (senior) in music business called me and told me to say nothing,” MI said."
  },
  {
    "headline": "5 naval college students in held captive in Edo",
    "summarized_story": "From Tony Osauzo, BeninA number of students of the Naval School of Engineering in Sapele, Delta State, were reportedly abducted by gunmen at Iruekpen, along the Benin-Ekpoma Road in Edo State on Monday.\nThe students were said to be travelling in two commercial vehicles from Kaduna to Sapele when they were seized by the gunmen suspected to be kidnappers.\nIt was learnt that the police were undergoing a “bush combing” exercise to rescue the remaining Naval students.\nSpokesman of the Edo State Police Command SP Kotongs Bello, who confirmed the incident yesterday, said contrary to the information in the social media platforms that seven Naval officers were kidnapped along Warri-Sapele Road, students of the Naval College of Engineering, Sapele, were the ones abducted.\n‘The closest thing that happened to what he is assuming is the students of Naval College of Engineering Sapele travelling from Kaduna to Sapele in a commercial bus and Sienna bus on 26/7/2021 was intercepted by hoodlums at Irukpen."
  },
  {
    "headline": "2023: Abia Charter of Equity should be respected – Eze Kalu Ogbu, Abiriba monarch",
    "summarized_story": "By Vincent KaluThe Enachioken of Abiriba Kingdom, Eze Kalu Kalu Ogbu, has called on Abia State politicians to respect the Abia Charter of Equity, signed by the founding fathers of the state on power rotation.\nI have already been admitted to pursue my master’s degree in law (LLM) in Abia State University, Uturu.\nIn awe, for seeing such in a place like Abiriba at the time, he openly called Abiriba ‘Small London’.\nAbia State is built on a strong and sustainable foundation of equity.\nSince the inception of the current democratic dispensation, Abia State has been peaceful."
  },
  {
    "headline": "Benin Republic presses fresh charges against Igboho",
    "summarized_story": "“First, the judge ruled that Sunday Igboho entered into Benin Republic through an illegal means.\nThey also want to investigate how Sunday Igboho conspired with others to enter Benin Republic through wrong means.\nThey also want to know how long he has been in Benin Republic and his plans in the country.\nThe judge at the third stage, according to Salami, was the one that ruled that Igboho should be remanded in prison custody pending the conclusion of investigation into the fresh charges brought against him by Benin Republic.\nSalami said the fresh allegations against Igboho are serious crimes in Benin Republic."
  },
  {
    "headline": "CBN stops $110m weekly forex sale to BDCs",
    "summarized_story": "“On the positive side, it is consistent with the move by the CBN to unify Exchange rates and bring more transparency to the forex market.\nThe move is likely to check round tripping of forex and reduce supply of forex in the parallel market.\nHe noted that the BDCs are a major player in the foreign exchange market and any decision of CBN will definitely impact themGovernor Emefiele noted that the CBN is the only central bank in the world that sells foreign exchange to BDCs.\nThe move is coming in late July when demand for foreign exchange for personal travel and school fees is typically high.\nHe noted that the BDCs are a major player in the foreign exchange market and any decision of CBN will definitely impact them."
  },
  {
    "headline": "For unity, Nigeria needs new constitution, parliamentary system before 2023 –Afe Babalola",
    "summarized_story": "By Chukwudi NwejeFounder and Chancellor of Afe Babalola University, Ado-Ekiti (ABUAD), Aare Afe Babalola, has said the way forward for Nigeria to remain an indivisible country is to adopt a brand new constitution founded on the principles of true federalism, with a parliamentary system of government and one chamber legislature before the 2023 general election.\nThe proposed constitution will spell out the number of political parties and percentage of women representation, among others.\nIt will also enable knowledgeable, selfless, patriotic and non-tribalistic Nigerians to emerge as leaders and make governance less expensive.\nParticular attention must be paid to the issue of poverty, reduction of population by limiting the number of children per couple.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Court Orders Nigeria's Secret Police To Immediately Release 5 Activists Illegally Arrested, Detained For Wearing #BuhariMustGo T-Shirts To Dunamis Church",
    "summarized_story": "A Federal High Court in Abuja has ordered the Department of State Services (DSS) to release five activists, including a blind Saxophonist, all of whom were arrested at the Dunamis International Gospel Centre in Abuja for wearing #BuhariMustGo T-shirt with immediate effect.\nIwatonaiye and four others had sued the Director-General of the DSS, Yusuf Magaji Bichi, Attorney General of the Federation, Abubakar Malami, and pastor of the church, Paul Enenche over their illegal arrest, detention and violation of their rights.\nThe youths have been in detention of the secret police since July 4 for wearing #BuhariMustGo T-shirts to the church.\nA9), Laws of the Federation of Nigeria, 2004.\nThe applicants urged the court to order their immediate and unconditional release from the DSS custody."
  },
  {
    "headline": "BREAKING: Court Orders Nigeria's Secret Police To Immediately Release 5 Activists Illegally Arrested, Detained For Wearing #BuhariMustGo T-Shirts To Dunamis Church",
    "summarized_story": "A Federal High Court in Abuja has ordered the Department of State Services (DSS) to release five activists, including a blind Saxophonist, all of whom were arrested at the Dunamis International Gospel Centre in Abuja for wearing #BuhariMustGo T-shirt with immediate effect.\nIwatonaiye and four others had sued the Director-General of the DSS, Yusuf Magaji Bichi, Attorney General of the Federation, Abubakar Malami, and pastor of the church, Paul Enenche over their illegal arrest, detention and violation of their rights.\nThe youths have been in detention of the secret police since July 4 for wearing #BuhariMustGo T-shirts to the church.\nA9), Laws of the Federation of Nigeria, 2004.\nThe applicants urged the court to order their immediate and unconditional release from the DSS custody."
  },
  {
    "headline": "UPDATE: How I Was Illegally Arrested, Brutalised By Policemen In Abuja— Sowore",
    "summarized_story": "The Muhammadu Buhari-led government of Nigeria has displayed its disdain for human rights as security forces on Monday arrested human rights activist, Omoyele Sowore, at the Federal High Court, Abuja.\nOmoyele SoworeSpeaking to SaharaReporters, Sowore said he was brutalised by the police during his arrest and taken to the Federal Secretariat police station.\n“I have just been arrested by the Nigerian Police at the Federal High Court.\nSee Also Breaking News BREAKING: Again, Nigerian Security Operatives Arrest Human Rights Activist, Omoyele SoworeAnother photographer, Yusuf Bromley, who was with Sowore at the time had his camera seized but was able to escape.\nThe government through the DSS did not give reasons for picking the 10 media houses while barring others from covering the trial."
  },
  {
    "headline": "UPDATE: How I Was Illegally Arrested, Brutalised By Policemen In Abuja— Sowore",
    "summarized_story": "The Muhammadu Buhari-led government of Nigeria has displayed its disdain for human rights as security forces on Monday arrested human rights activist, Omoyele Sowore, at the Federal High Court, Abuja.\nOmoyele SoworeSpeaking to SaharaReporters, Sowore said he was brutalised by the police during his arrest and taken to the Federal Secretariat police station.\n“I have just been arrested by the Nigerian Police at the Federal High Court.\nSee Also Breaking News BREAKING: Again, Nigerian Security Operatives Arrest Human Rights Activist, Omoyele SoworeAnother photographer, Yusuf Bromley, who was with Sowore at the time had his camera seized but was able to escape.\nThe government through the DSS did not give reasons for picking the 10 media houses while barring others from covering the trial."
  },
  {
    "headline": "UPDATE: How I Was Illegally Arrested, Brutalised By Policemen In Abuja— Sowore",
    "summarized_story": "The Muhammadu Buhari-led government of Nigeria has displayed its disdain for human rights as security forces on Monday arrested human rights activist, Omoyele Sowore, at the Federal High Court, Abuja.\nOmoyele SoworeSpeaking to SaharaReporters, Sowore said he was brutalised by the police during his arrest and taken to the Federal Secretariat police station.\n“I have just been arrested by the Nigerian Police at the Federal High Court.\nSee Also Breaking News BREAKING: Again, Nigerian Security Operatives Arrest Human Rights Activist, Omoyele SoworeAnother photographer, Yusuf Bromley, who was with Sowore at the time had his camera seized but was able to escape.\nThe government through the DSS did not give reasons for picking the 10 media houses while barring others from covering the trial."
  },
  {
    "headline": "British government are not doing much about this case, says Nnamdi Kanu's lawyer",
    "summarized_story": "Ifeanyi Ejiofor, counsel to Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), has accused the British government of “not doing much” in the case of his client.\nFollowing his apprehension, Dean Hurlock, a spokesperson of the British High Commission, told TheCable that the UK Foreign, Commonwealth and Development Office “stands ready to provide consular assistance” regarding the matter.\n“The British High Commission in Abuja is currently in the process of seeking clarification from the Nigerian government about the circumstances of the arrest,” he had said.\nAdvertisement“I can confirm, British high commission and government are not doing much about this case.\n“In 2015, Nnamdi Kanu, a British national, was arrested in Lagos, and I know what happened and the effort they made."
  },
  {
    "headline": "British government are not doing much about this case, says Nnamdi Kanu's lawyer",
    "summarized_story": "Ifeanyi Ejiofor, counsel to Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), has accused the British government of “not doing much” in the case of his client.\nFollowing his apprehension, Dean Hurlock, a spokesperson of the British High Commission, told TheCable that the UK Foreign, Commonwealth and Development Office “stands ready to provide consular assistance” regarding the matter.\n“The British High Commission in Abuja is currently in the process of seeking clarification from the Nigerian government about the circumstances of the arrest,” he had said.\nAdvertisement“I can confirm, British high commission and government are not doing much about this case.\n“In 2015, Nnamdi Kanu, a British national, was arrested in Lagos, and I know what happened and the effort they made."
  },
  {
    "headline": "JUST IN: Five #BuhariMustGo protesters arraigned, granted bail",
    "summarized_story": "A magistrate court in Abuja has granted bail to the five #BuhariMustGo protesters who were arrested at Dunamis Church on July 4.\nAdvertisementThe Department of State Services had arrested Ben Manasseh, Anene Udoka, Henry Nwodo, Samuel Larry and Samuel Gabriel at the church premises in Abuja for allegedly wearing #BuhariMustGo branded shirts.\nThe federal high court sitting in Abuja had in a ruling, ordered the DSS to release the five men.\nAdvertisementBut Despite the court order, the DSS arraigned the protesters on Wednesday before a magistrate court in Mpape, Abuja on charges bordering on disturbance of public peace.\nThe accused were granted bail in the sum of N500,000 and a surety in like sum."
  },
  {
    "headline": "JUST IN: Five #BuhariMustGo protesters arraigned, granted bail",
    "summarized_story": "A magistrate court in Abuja has granted bail to the five #BuhariMustGo protesters who were arrested at Dunamis Church on July 4.\nAdvertisementThe Department of State Services had arrested Ben Manasseh, Anene Udoka, Henry Nwodo, Samuel Larry and Samuel Gabriel at the church premises in Abuja for allegedly wearing #BuhariMustGo branded shirts.\nThe federal high court sitting in Abuja had in a ruling, ordered the DSS to release the five men.\nAdvertisementBut Despite the court order, the DSS arraigned the protesters on Wednesday before a magistrate court in Mpape, Abuja on charges bordering on disturbance of public peace.\nThe accused were granted bail in the sum of N500,000 and a surety in like sum."
  },
  {
    "headline": "JUST IN: Naira falls to N522/$1 at parallel market as CBN stops forex sale to BDCs",
    "summarized_story": "The naira has dropped to N522 to a dollar at the parallel market as the Central Bank of Nigeria (CBN) discontinued the sale of foreign exchange (FX) to Bureaux De Change (BDCs) operators in the country.\nOn Tuesday, Godwin Emefiele, governor of CBN, announced the discontinuation of forex sales to BDCs.\nBut a top insider at CBN told TheCable that the apex bank may be unable to meet requests of banks to serve all customers as mandated.\nAdvertisementThe source added that the apex bank allocates about $20,000 weekly to each BDC operator in the country – amounting to $5.72 billion yearly to the parallel market.\n“Commercial banks come with bids of $1.3 billion fortnightly, and CBN cannot provide more than $250 million,” the source had said."
  },
  {
    "headline": "Here’s why PiggyVest acquired VFD-owned Savi",
    "summarized_story": "The Nigeria-based wealth management app giant announced in a Medium post that it has acquired a smaller competitor Savi.ng.\nUnder the deal, all existing Savi.ng users will be automatically migrated to Piggyvest.\n“It’s more of a team acquisition,” PiggyVest co-founder, Joshua Chibueze, explained to TechCabal over a call.\nThe team behind Savi are reputed to have solid expertise in finance and are savvy with financial tools.\nPiggyVest did let TechCabal know that there are more acquisition announcements to come in the year."
  },
  {
    "headline": "South Africa’s Yoco raises $83m to extend digital payments to 1 million SMEs",
    "summarized_story": "It also plans to expand beyond South Africa as the demand for digital payments among African small businesses grows.\nToday, the company offers a wide array of financial services including online and in-store payments, business software, and capital to small business merchants.\n“Our expertise and efforts centre around driving financial inclusion and lowering the barriers of entry for our customers (small businesses),” Maphai said.\nThis, he explained, is because there are over 6 million small businesses in South Africa and well over 100 million across the MENA region that still transact only in cash.\nTo seize the opportunity, Yoco plans to deepen its operations in South Africa in addition to a pan-African expansion goal."
  },
  {
    "headline": "This US-based fund wants to invest $5m in African startups",
    "summarized_story": "In the first half of this year, investments in African startups have risen back to pre-covid levels.\nOne of such players is Expert DOJO, a US-based early-stage fund that has decided to commit up to $5m to invest in African startups this year.\nSetting itself apart from other global accelerators, Expert DOJO has assembled an entire Africa-dedicated team plus cross-functional experts and Entrepreneurs in Residence (EIRs).\nStarNews Mobile, a mobile video network for Africa, is one of the first African startups Expert DOJO invested in.\nVictoria Mehran, an Investment associate at Expert Dojo explained this saying, “We’re committed to supporting them for life."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "SME Clinic 2021: Meet the speakers",
    "summarized_story": "Share this article:In 23 days, we will host small business owners and some of the brightest minds in the SME space at SME Clinic 2021, themed, “Sustaining your business with technology”.\nSME Clinic 2021 will be a hybrid event — with physical and online attendees — and will take place at Zone Tech Park, Gbagada, Lagos, on August 21, 2021.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business online.\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "It’s raining fundssss!!!",
    "summarized_story": "Investors in the round include Breyer Capital, HOF Capital, 4DX Ventures, Partech, Orange Ventures, Velocity Capital Fintech Ventures, Quona Capital, and first time investors, Dragoneer Investment Group.\nYoco’s Series C round is one of the largest by an African fintech startup and puts it behind only Flutterwave and Chipper Cash — for now.\nJulaya, a fintech startup based in Ivory Coast and France, has announced a $2m pre-series A to expand its operations in West Africa.\nJulaya was founded in 2018 by Mathias Léopoldie and Charles Talbot, who had previously worked at French fintech startup, LemonWay.\nThe startup provides African businesses and public institutions with an online platform to disburse payments to mobile money and mobile banking wallets."
  },
  {
    "headline": "Ivory Coast-based fintech startup, Julaya raises $2 million pre-series A for its West African expansion",
    "summarized_story": "Share this article:Julaya, a fintech startup based in France and Ivory Coast is today announcing the raise of its $2 million pre-series A round.\nInvestors that participated in this round include Orange Ventures, MFS Africa Frontiers, Saviu Ventures, Launch Africa Ventures, 50 Partners Capital and angel investors from Africa and Europe.\nJulaya was founded in 2018 by Mathias Léopoldie and Charles Talbot who had both worked at French payment fintech startup, LemonWay.\nWith this fresh injection of capital, the startup plans to expand across West Africa beginning with Senegal.\nAcross the world, fintech startups are courted by investors and Africa has not been left out with fintech startups responsible for a huge chunk of the funding that comes to the continent."
  },
  {
    "headline": "Naira hits N522 as currency traders hoard dollars",
    "summarized_story": "Nigeria’s currency on Wednesday hit N522 per dollar as traders in the parallel market, popularly known as the black market, were seen hoarding dollars for fear of losing money.\nThis followed the decision by the Central Bank of Nigeria (CBN) to discontinue dollar sales to the Bureau De Change (BDCs).\nWith the latest rate, Naira…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Naira opens steady after CBN hammer on BDCs",
    "summarized_story": "The Naira is holding steady to the dollar in FX markets Wednesday after the Central bank of Nigeria halted the sale of foreign exchange to the over five thousand Bureau De changes across the country, citing wholesale abuse by the BDCs.\nWednesday’s action by the apex bank means BDCs will no longer get the about…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Shareholders mount pressure on Big Oil firms to cut upstream emission",
    "summarized_story": "There is growing pressure from shareholders in some of the world’s biggest oil-producing companies to reduce emissions from operations, reflecting the waning patience of investors pushing for much faster action to tackle climate emergencies.\nOil-dependent economies like Nigeria are facing enormous existential risk due to the swelling internal burden on multinational oil companies to refocus…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Perm Sec lauds Frame work draft for the first Export Strategy in Edo State – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Permanent Secretary, Ministry of Wealth Creation, Cooperatives and Employment, Mr. J.U Edionwe has commended the Technical sub-committee to develop the Export Strategy document for their hard work and commitment to draft a frame work for the first general document on Export Strategy in Edo state.\nSpeaking during the presentation of the frame work draft to the Edo State Committee on Export Promotion in Benin City, the Permanent Secretary, who is the chairman of the state committee on Export Promotion, said this is the first general acknowledged work on Export strategy.\n“This is the beginning of our collective commitment to drive the Export subsector of our state economy.\nThe Chairman of the Technical Sub-committee, Prof. Smart Nwokoro made a power point presentation of the draft report which included a number of recommendations on behalf of the committee for consideration in the final document.\nThe committee was also mandated to put finishing touches to the document and make necessary inputs In line with the goals, objectives, specified export initiatives, stakeholder’s engagement, funding of export activities and monitoring and evaluation."
  },
  {
    "headline": "IPC Decries DSS Accreditation Of Ten (10) Media Organisations To Cover Nnamdi Kanu’s Trial – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The International Press Centre (IPC), Lagos – Nigeria has condemned the decision of the Department of State Services to accredit ten media organisations to cover the trial of the leader of the Indigenous People of Biafra (IPOB) today, Monday July 26th, 2021.\nAccording to Department of State Services (DSS), the newspapers accredited include Daily Post, Premium Times, Thisday, The Nation, The Herald, and Daily Independent while the Nigerian Television Authority (NTA), Channels Television, Africa Independent Television and Television Continental (TVC) were picked from the broadcast media sector.\nIn a statement signed by IPC’s Program Officer/Safety Desk Officer, Melody Lawal, IPC is of the firm opinion that the Department of State Service (DSS) has no constitutional right to accredit journalists to cover the trial of Nnamdi Kanu or any other suspect for that matter based on the provisions of the National Security Agencies Act.\nIPC is amazed and concerned about this development which has no precedent anywhere in the worldThe trial of Nnamdi Kanu is a matter of public interest and accrediting some media outlets to cover it violates press freedom and the right of the public to know."
  },
  {
    "headline": "Politics Is Now Business Venture, Says 2023 APC Presidential Aspirant – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Politicking in Nigeria presently has become business venture, according to the All Progressives Congress (APC) 2023 Presidential Aspirant, Professor Godspower Osaretin Ikuobase.\n“Politicking presently in Nigeria is unfortunate, it is seeing as business venture as against service to the nation.\n“For us to get its right politically, we must elect people of integrity, intelligence and energy.\nWe need proper planning, core nationalist, a detribalised Nigerians to take the country into political eldorado.\n“I am coming to implement the true spirit of the APC which is politics for the grassroots, from the grassroots and by the grassroots."
  },
  {
    "headline": "Edo residents laud Obaseki for ongoing construction of Textile Mill Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENNIN CITY – Edo residents have hailed Governor Godwin Obaseki for the ongoing reconstruction of Textile Mill Road in Egor Local Government Area of the state, noting that the project, on completion, will further open up the area to more economic activities.\nA transporter who plies the route, Mr. Philip Asekevwe, while hailing the governor, charged him on the completion of other sections of the road.\nAccording to him, “We appreciate the governor for the reconstruction of the road.\nOn his part, a landlord in the area, Mr. James Ekuase, also commended the governor for remembering the people in his administration’s massive infrastructural development.\nWe thank God for this present administration of Governor Godwin Obaseki that has come to help us out.”..."
  },
  {
    "headline": "EXCLUSIVE: Inside details of how Glencore employees bribed Nigerian officials over NNPC oil contracts",
    "summarized_story": "The former trader pleaded guilty over what prosecutors in the United States described as his role in a scheme to bribe.\nThis other intermediary company is said to have an affiliated company incorporated in the British Virgin Islands which used the same name as the Cypriot company.\nThe seventh co-conspirator, however, was an Israeli citizen and resident, and was employed by the second intermediary company of Glencore.\nGlencore speaks, NNPC silentThere hasn’t been any reaction from the Nigerian government or the NNPC since the allegations became public Monday.\nThe spokesperson of Nigeria’s state-owned oil company, NNPC, Kennie Obateru, did not return a phone call as of press time Wednesday morning."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Stock market sheds N25bn as NGXASI dips by 0.12%",
    "summarized_story": "Adebayo ObajemuThe Nigerian stock market on Tuesday closed on a bearish note, occasioned by 1.15 per cent loss in the share price of MTN.\nThe All Share Index declined by 0.47% to close at 38,802.15 points from the previous close of 38,849.08 points.\nThe Market Capitalisation declined by 0.12% to close at N20.216 trillion from the previous close of N20.241 trillion, thereby shedding N25 billion.\nPercentage GainersOando led other gainers with 9.86% growth, closing at N4.79 from the previous close of N4.36.\nWema Bank traded about 21.3 million units of its shares in 89 deals valued at N17.86 million."
  },
  {
    "headline": "Vitafoam reports N3.4bn as profit in nine months",
    "summarized_story": "Adebayo ObajemuVitafoam Plc on Tuesday published its financial statement for the Third Quarter ended 30 June 2021.\nThe report shows significant growth in the company’s top line and bottom line figures for the nine months period.\nA turnover of N26.833 billion was reported by the company, up by 62.92% from N16.47 billion reported the previous year.\nProfit after tax grew by 59.15% to N3.408 billion from N2.142 billion reported the previous year.\nEarnings per share of the company grew significantly by 59.15% to N2.72 from the EPS of N1.71At the share price of N15.95, the P.E ratio of Vitafoam stands at 5.85x with earnings yield of"
  },
  {
    "headline": "Families of Oyo residents ‘killed’ by Custom officers demand compensation",
    "summarized_story": "Families of residents of Iseyin community, Oyo State reportedly killed by officers of the Nigerian Customs Service (NCS), have demanded compensation for the victims.\nSpeaking at the investigative hearing of the house of representatives committee investigating the incident on Tuesday, Tijani Razak, a representative of families of the victims, demanded compensation for the bereaved families.\nBefore the arrival of the army, the mob disposes one of the injured officers of his riffle.\n“When the soldiers arrived, they work with the officers on the ground, recovered the rifle and restored calm in the area.\nNot satisfied by Lawal’s explanation, the committee accused the officers of negligence."
  },
  {
    "headline": "Nigerian police boss deploys 24 newly promoted AIGs",
    "summarized_story": "Nigeria’s Inspector-General of Police (IGP), Usman Baba, has directed all the newly promoted Assistant Inspectors-General of Police (AIGs) to assume their new respective postings to zonal commands and formations immediately.\nRecall that 24 AIGs were decorated on Monday in Abuja where they were charged to upscale their game regarding security challenges in the country.\nThe IGP, while decorating the newly promoted CPs at Force headquarters in Abuja, on Tuesday, said the AIGs should resume with immediate effect and tame current security challenges in their zones.\nIn the same vein, AIG Zaki M. Ahmed will be in charge of SPU FHQ Abuja; AIG Mustapha Dandaura, Zone 4 Makurdi; AIG Dansuki D. Galadanchi, CTU FHQ Abuja; AIG Okon Etim Ene, Zone 17 Akure; AIG Usman D. Nagogo, Border Patrol FHQ Abuja and AIG Muri Umar Musa, Zone 13 Ukpo-Dunukofia Awka.\nBaba also said AIG Lawal Jimeta Tanko is now the Commandant POLAC Wudil, Kano; AIG Adebola Emmanuel Longe, DOPS FHQ Abuja; AIG Musa Adze, Investment FHQ Abuja; Philip Sule Maku, DICT FHQ Abuja among others."
  },
  {
    "headline": "APC Not In Denial Of Challenges Facing Nigerians – Chieftain",
    "summarized_story": "All Progressives Congress (APC) is not unaware of the challenges facing Nigerians, a chieftain of the party has said.\nThe fundamental issue is the question of the extent to which APC leaders and members are responding to challenges.\nThe good thing is that, in APC, leaders are not in denial of the challenges.\n“It is not enough for government to initiate programmes and projects as responses to challenges facing the country.\n“Once the focus and scope of initiatives is limited to operations of government institutions, and non-governmental institutions continue with business-as-usual practices, most of the challenges facing the country will linger."
  },
  {
    "headline": "APC Not In Denial Of Challenges Facing Nigerians – Chieftain",
    "summarized_story": "All Progressives Congress (APC) is not unaware of the challenges facing Nigerians, a chieftain of the party has said.\nThe fundamental issue is the question of the extent to which APC leaders and members are responding to challenges.\nThe good thing is that, in APC, leaders are not in denial of the challenges.\n“It is not enough for government to initiate programmes and projects as responses to challenges facing the country.\n“Once the focus and scope of initiatives is limited to operations of government institutions, and non-governmental institutions continue with business-as-usual practices, most of the challenges facing the country will linger."
  },
  {
    "headline": "Fashola Commends Private Sector Role In Housing Sector",
    "summarized_story": "Minister of works and housing, Babatunde Fashola, has commended the private sector for playing a major role in addressing Nigeria’s housing needs.\nRepresented on Monday by the minister of state for works and housing, Mr Abubakar Aliyu, at the 15th Abuja International Housing show, with the theme “Sustainable and Resilient Housing Solutions for a Post Pandemic World,” Fashola identified affordable housing as part of the agenda of the current administration.\nHe said, “As part of President Muhammadu Buhari’s developmental agenda of addressing housing needs in Nigeria, the federal government inaugurated a pragmatic National Housing Programme (NHP) for the construction of acceptable and affordable houses nationwide.\nAlso, Ghana’s minister of state for works and housing, Mrs Freda Prempeh, said investing in the construction of decent and affordable housing should be a top priority of every government.\nEarlier, the convener of the show, Mr Festus Adebayo, had called for the involvement of youths in the future of affordable housing for the citizenry."
  },
  {
    "headline": "Fashola Commends Private Sector Role In Housing Sector",
    "summarized_story": "Minister of works and housing, Babatunde Fashola, has commended the private sector for playing a major role in addressing Nigeria’s housing needs.\nRepresented on Monday by the minister of state for works and housing, Mr Abubakar Aliyu, at the 15th Abuja International Housing show, with the theme “Sustainable and Resilient Housing Solutions for a Post Pandemic World,” Fashola identified affordable housing as part of the agenda of the current administration.\nHe said, “As part of President Muhammadu Buhari’s developmental agenda of addressing housing needs in Nigeria, the federal government inaugurated a pragmatic National Housing Programme (NHP) for the construction of acceptable and affordable houses nationwide.\nAlso, Ghana’s minister of state for works and housing, Mrs Freda Prempeh, said investing in the construction of decent and affordable housing should be a top priority of every government.\nEarlier, the convener of the show, Mr Festus Adebayo, had called for the involvement of youths in the future of affordable housing for the citizenry."
  },
  {
    "headline": "24 AIGs Redeployed In Police Shake-up",
    "summarized_story": "Inspector-general of police (IGP) Usman Alkali Baba has ordered the immediate posting and redeployment of 24 of the newly promoted assistant inspector-generals of police to zonal commands and formations.\nForce public relations officer, Frank Mba, said the posting and redeployment is in line with the new manpower development policy of the Force.\nFollowing the redeployment, AIG SPU FHQ Abuja is to be headed by AIG Zaki Ahmed, while AIG Zone 4 Makurdi will be headed by AIG Mustapha Dandaura.\nADVERTISEMENTOthers are AIG CTU FHQ Abuja to be headed by AIG Dansuki D. Galadanchi, AIG Zone 17 Akure, will be led by AIG Okon Etim Ene, AIG Border Patrol FHQ Abuja will be headed by AIG Usman Nagogo, AIG Bala Ciroma, former CP FCT is now in charge of AIG Zone 7 Abuja.\nFinally, the IGP redeployed AIG John Ogbonnaya Amadi to AIG Maritime Lagos, AIG Zone 8 Lokoja now led by AIG Ede Ayuba Ekpeji, AIG Mohammed Bagega now in charge of AIG Armament FHQ Abuja, AIG Zone 15 Maiduguri to be led by AIG Bello Makwashi and AIG Balarabe Abubakare, now AIG Works FHQ Abuja."
  },
  {
    "headline": "Man kills lover, rapes her corpse in Edo",
    "summarized_story": "He was earlier accused of hitting the head of her 13 years old boy and then pounced on the woman, thinking the son was dead.\nConfirming the incident on Tuesday, Police Public Relations Officer, Edo State Command, Kontongs Bello, said the suspect would be charged to court once investigations are concluded.\nThe incident happened in Darlington Ogbeifun Street, off Ogbekan Village Road, Ugbor in Oredo Local Government Area.\n“She had a lover, who is a bricklayer, that was coming to see her and people around here know them.\nI did not hit anybody with log and I did not sleep with the woman.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Man kills lover, rapes her corpse in Edo",
    "summarized_story": "He was earlier accused of hitting the head of her 13 years old boy and then pounced on the woman, thinking the son was dead.\nConfirming the incident on Tuesday, Police Public Relations Officer, Edo State Command, Kontongs Bello, said the suspect would be charged to court once investigations are concluded.\nThe incident happened in Darlington Ogbeifun Street, off Ogbekan Village Road, Ugbor in Oredo Local Government Area.\n“She had a lover, who is a bricklayer, that was coming to see her and people around here know them.\nI did not hit anybody with log and I did not sleep with the woman.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "JAMB releases 14,620 results, withdraws 14, withholds 93",
    "summarized_story": "The Joint Admissions and Matriculation Board has cleared and released the UTME results of 14,620 candidates that were hitherto under investigation, while withholding the results of 93 others.\n“You will recall that the board, in its earlier release, stated that it will still review the results of the 2021 UTME exercise and any candidate found wanting will have his/her result withheld.\n“Out of the withheld results, 13 were discovered to have been involved in examination infractions after they were released and the one earlier withdrawn bringing the total of the results that have been withdrawn to 14.\n“Results of 332 visually-impaired candidates, whose examination was conducted this month, have also been released,” he said.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "JAMB releases 14,620 results, withdraws 14, withholds 93",
    "summarized_story": "The Joint Admissions and Matriculation Board has cleared and released the UTME results of 14,620 candidates that were hitherto under investigation, while withholding the results of 93 others.\n“You will recall that the board, in its earlier release, stated that it will still review the results of the 2021 UTME exercise and any candidate found wanting will have his/her result withheld.\n“Out of the withheld results, 13 were discovered to have been involved in examination infractions after they were released and the one earlier withdrawn bringing the total of the results that have been withdrawn to 14.\n“Results of 332 visually-impaired candidates, whose examination was conducted this month, have also been released,” he said.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "What Igboho told Benin court in camera",
    "summarized_story": "Ibrahim Salami, the lawyer to Sunday Igboho has revealed what the Yoruba Nation agitator told the Benin appeal court in a session that lasted up til midnight on Monday.\nIgboho told the court that he fled Nigeria to avoid being killed, his lawyer revealed to a correspondent of The Nation.\n“When the judge asked him how and when he entered the Benin Republic, who housed him and who took him to the airport, Igboho told the court that his coming to the Benin Republic was to flee from his traducers who wanted to kill him in Nigeria.\nHe said Benin Republic law allows Igboho to be admitted to bail pending the outcome of the investigation.\nIt is a case between the Benin Republic and Sunday Igboho – nothing more,” he explained."
  },
  {
    "headline": "Brazil, Ivory Coast in Olympics football quarter-finals, Germany crash",
    "summarized_story": "By Kazeem UgbodagaThe Brazilian Olympics football team have qualified for the quarter-finals of the ongoing Tokyo 2020 along with Ivory Coast.\nLast Olympics finalist, Germany failed to qualify after playing 1-1 with Ivory Coast in their final match on Wednesday.\nBrazil beat Saudi Arabia 3-1 to top Group D, on seven points while Ivory Coast came second with five points and Germany, third with four points.\nBrazil took the lead against Saudi Arabia on 14 minutes through Matheus Cunha.\nSaudi Arabia shockingly equalised on 27 minutes."
  },
  {
    "headline": "{ICYMI) ‘It is sacrilegious for Afenifere to compare Igboho to Prophet Muhammad’",
    "summarized_story": "The Muslim Rights Concern (MURIC), has demanded unreserved apology from Afenifere, the Yoruba socio-cultural group, for comparing Sunday Adeyemo, a.k.a Igboho, to Prophet Muhammad.\nAfenifere had compared Igboho’s current travail in Benin Republic to that of Prophet Muhammad in Madinah.\nMURIC advised Afenifere to compare Igboho to any of the Yoruba heroes if they must idolise him.\nIgboho, to Prophet Muhammad.\n“The circumstances surrounding the migration of Prophet Muhammad in 622 C.E."
  },
  {
    "headline": "Buratai Meets Beninese President As Nigerian Envoy Amid Sunday Igboho’s Trial",
    "summarized_story": "), Nigeria’s former Chief of Army Staff, met with Patrice Talon, President of the Benin Republic, as the Nigerian ambassador and presented him with his letter of credence.\nBuratai met with Talon on Tuesday, according to SaharaReporters, during the continuing trial of Yoruba Nation activist Sunday Adeyemo (Igboho) in the West African country.\nBuratai, who was appointed Nigerian envoy to Benin in June 2021, was also involved in the arrest of Sunday Igboho, according to SaharaReporters.\nBuratai had secretly written a letter to Beninese security agencies ordering them to arrest Igboho wherever they located him, according to a top security source in the Benin Republic.\n“Buratai since the declaration by the Department of State Services sent a secret letter to the Beninese government to be on the lookout for Igboho."
  },
  {
    "headline": "Tension In Kaduna As IMN leader, Ibraheem El-Zakzaky’s Trial Resumes Today",
    "summarized_story": "The trial of Alhaji Ibraheem El-Zakzaky, the leader of the Islamic Movement in Nigeria (IMN), and his wife resumed in Kaduna and its environs on Wednesday.\nThe hearing will be presided over by Justice Gideon Kurada of the Kaduna High Court, who will investigate claims against El-Zakzaky such as disruption of public peace and unlawful assembly.\nTo prevent a breakdown of law and order, security operatives, including police and the Nigeria Security and Civil Defense Corps (NSCDC), were on high alert.\nAccording to the trial before the state capital’s court, police trucks blocked all roads going to Kaduna central market, Kawo, and Angwan Rimi, and fierce-looking security officers were stationed in crucial locations.\nShops and offices were locked up, and store owners who made it in were observed in groups discussing the insecurity plaguing the state and country."
  },
  {
    "headline": "Why Buhari Can’t Do Without UK Hospital, Foreign Doctors – Presidency",
    "summarized_story": "Speaking on a Channels Television interview, Adesina stated that why Buhari visited the UK each time for his medical needs.\n“President Buhari has been with the same doctors and medical team for upward of 40 years.\nHe explained that the Constitution empowers Vice President Yemi Osinbajo to act as President if President Buhari is not back to the country within 21 days.\n“The nation is running, there is a vice president who will attend to critical issues.\nAs earlier reported that Buhari travelled to London to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025."
  },
  {
    "headline": "How Tinubu Made Many Igbos Billionaire – Joe Igbokwe",
    "summarized_story": "Joe Igbokwe, a senior member of the All Progressives Congress (APC), has revealed how the party’s National Leader, Bola Tinubu, turned a number of Igbo individuals became billionaires in Lagos State.\nIgbokwe said that Tinubu persuaded his Igbo friends to invest in Lekki Corridor, some years ago.\nAccording to Igbokwe, Igbo people who followed Tinubu’s persuasion are now billionaires.\nHe stated this in a Facebook post titled: “How Asiwaju BAT created many Igbo billionaires in Lekki Corridor Lagos.”The post reads: “In those days LEKKI Corridor was begging for attention.\n“ASIWAJU spoke to some of his Igbo friends in Lagos and told them that LEKKI will be the new Lagos anytime soon."
  },
  {
    "headline": "NOUN makes history, names 3 deputy vice-chancellors",
    "summarized_story": "For the first time, the National Open University of Nigeria (NOUN) now has three deputy vice-chancellors as opposed to the two it used to have.\nThe move would be seen as unprecedented in the Nigerian university system where the practice used to be mostly two deputy vice-chancellors in a university.\nHe said the innovation at NOUN came with the recent appointment of two new deputy vice-chancellors by the Governing Council of the institution based on the recommendation of the University Senate.\nProfessor Monioluwa Omolara Olaniyi was appointed pioneer Deputy Vice-Chancellor (DVC) Technology, Innovation and Research of the university.\nAccording to the Registrar, Butswat is also to assist the Vice-Chancellor, Professor Olufemi Peters, in the day to day administration of the university."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigers surrender to Germany, lose second basketball match at Tokyo Olympics",
    "summarized_story": "Nigeria’s senior men’s basketball team, D’Tigers, suffered another disappointing defeat against Germany in their second Group B match at the ongoing delayed Tokyo 2020 Olympic Games in Japan in the early hours of Wednesday.\nSpeaking after the match, Coach Mike Brown blamed his side’s poor defence for the defeat.\nWe did not do a good job defending, 47 percent from the three-point line, on top of that you have 23 free throws… It’s tough to overcome.\n“We talked about defending the three-point line against these guys, talked about not sending them to the free throw line, and we talked about taking care of the ball.\nAnd 18 turnovers weren’t bad, but because a handful of those were offensive fouls, we have to be smarter in that area."
  },
  {
    "headline": "El-Rufai parleys Nasarawa gov as bandits place N100m ransom on monarch",
    "summarized_story": "El-Rufai parleys SuleMeanwhile, Governor Nasir El-Rufai has said the state government was collaborating with the Nasarawa state government and security agencies from the two states to rescue the paramount ruler.\nHe further said tactical teams of the command had been mobilised to comb the communities in the area to arrest the fleeing bandits.\n“According to the Area Commander, ACP Benjamin Abang of Omuma Area Command, the bandits were sighted moving in convoy into Omuma town.\n“The area commander immediately alerted the tactical teams of the command who swung into action.\nYaro warned bandits with penchant for sporadic incursion from neighbouring states to keep off the state or face dire consequences."
  },
  {
    "headline": "ECOWAS Parliament decries multiple challenges in West Africa -NigPilot",
    "summarized_story": "The Community Parliament of the Economic Community of West African States has decried the multiple economic and socio-political challenges bedeviling the sub-region.\nSpeaker of Ghanaian Parliament, Rt Hon Alban Bagbin expressed this misgiving at the official opening of the delocalized meeting of ECOWAS Joint Committee on Political Affairs, Peace, Security and Africa Peer Review Mechanism (APRM), Legal Affairs and Human Rights, and Telecommunications and Information Technology.\nHe said: “As you may all be aware, the Sub-region is confronted with various challenges such as drug trafficking, child trafficking, proliferation of and trafficking in small arms, organised crime, money laundering and terrorism.\nCybercrime and the insecurity in the maritime space in the Gulf of Guinea, are issues that require immediate attention.\nHe added that ICT does offer new opportunities to better manage conflicts and build peace especially at the local levels of our societies."
  },
  {
    "headline": "Nigeria Pilgrimage to Jordan‘ll strengthen bilateral relations-Pam",
    "summarized_story": "Executive Secretary of the Nigeria Christian Pilgrim Commission, Rev Yakubu Pam has said the recently introduced Pilgrimage to Jordan would help to strengthen bilateral relations between the two countries.\nPam disclosed this in Amman, Jordan, recently while addressing the first batch of Pilgrims who arrived in the Kingdom of Jordan today to begin their Pilgrimage exercise.\nHe urged Nigerian Pilgrims to demonstrate the virtues of our Lord Jesus Christ while in the Holy Land.\nHe enjoined the Pilgrims to see their Pilgrimage to Jordan as a revival that would turn their spiritual life around.\nHe urged them to cooperate with the Pilgrimage leaders to ensure a hitch free Pilgrimage exercise."
  },
  {
    "headline": "Wushishi solicits support of staff to reposition NECO -NigPilot",
    "summarized_story": "Registrar/Chief Executive, National Examinations Council, NECO, Prof. Ibrahim Dantani Wushishi has promised to reposition NECO to become a credible and internationally acclaimed examination body, urging staff to give their best in order to actualize his mission.\nWushishi made the promise on Monday while officially taking over the affairs of the Council from the Former Acting Registrar, Mr. Ebikibina John Ogborodi.\nHe solicited for the support of the management and staff to enable him actualise his vision for the Council.\nThe Registrar who thanked President Muhammadu Buhari for deeming him fit to be appointed as NECO Registrar, pledged to work closely with the Federal Ministry of Education and NECO Governing Board.\nIt could be recalled that Prof. Wushishi was on 12th July, 2021 appointed as the substantive Registrar of NECO by President Muhammadu Buhari."
  },
  {
    "headline": "Nigerian Varsities to get N900m, Poly N800m support fund- TETFUND -NigPilot",
    "summarized_story": "Tertiary Education Trust Fund, TETFUND, on Tuesday revealed intervention funds set aside to aid Nigerian higher institutions to improve infrastructure and meet up with global standards.\nAnnouncing this in Abuja at the Federal University of Petroleum Resources, FUPRE, Effurun Roundtable Meeting, Chairman Board of Trustees, TETFUND, Kashim Ibrahim, disclosed that Universities, Polytechnic and Colleges of Education will receive N900m, N800m, and N700m respectively.\nHe also disclosed that FUPRE will receive an N3bn intervention fund to support “Infrastructure, Scholarships, Research” and other pressing needs.\nIn the past this would be considered a luxury, but with the advent of Covid-19, it is now a necessity,” he added.\n“The Nigerian experience has largely been a case of exclusive funding of public universities by the federal government which in the light of contemporary reality, is no longer sustainable."
  },
  {
    "headline": "COVID-19: Nigeria Records Highest Daily Cases In Four Months",
    "summarized_story": "On Tuesday, Nigeria recorded its highest daily count of COVID-19 infections in the last four months.\nThe Nigeria Centre for Disease Control (NCDC) disclosed this in its latest update on the outbreak with a total of 404 new cases recorded.\nThis makes it the biggest daily increase in the country since March 4 when 708 cases were confirmed, raising the total count to 171,728.\nAccording to the NCDC, 164837 cases have been discharged in 36 states and the Federal Capital Territory as of Tuesday.\nSee a breakdown of cases according to states below:"
  },
  {
    "headline": "Tight Security As El-Zakzaky’s Trial Continues In Kaduna",
    "summarized_story": "﻿There’s heavy security presence at the Kaduna State High Court on Wednesday as the court prepares to deliver judgement on the no-case submission filed by the embattled leader of the Islamic Movement in Nigeria (IMN), Ibraheem El-Zakzaky.\nAhead of the court ruling, security is beefed up within Kaduna metropolis and environs, while all roads leading to the High Court complex have been barricaded by security operatives.\nAmong them are two army officers, a retired director of State Security service, police officers and a medical doctor.\nEl-Zakzaky and his wife have been in detention since December 2015 following a bloody clash between his followers and soldiers in Zaria, Kaduna State.\nAhead of the court ruling, security has been beefed up within Kaduna metropolis and environs, while all roads leading to the high court complex have been barricaded by Security operatives."
  },
  {
    "headline": "CBN Bans Sale Of Foreign Exchange To BDC Operators",
    "summarized_story": "The Central Bank of Nigeria (CBN) has announced an end to the weekly allocation and sale of foreign exchange to Bureau De Change (BDC) operators in the country.\nEmefiele added, “In particular, we have noted with disappointment and great concerns that our Bureau De Change operators have abandoned the original objective of their establishment which was to serve retail end users who need $5,000 or less.\n“Instead, they have become (illegal) wholesale dealers in foreign exchange to the tune of millions of dollars per transaction.”﻿He accused the BDC operators of facilitating grafts, illicit financial flows, and money laundering in the country.\nAccording to the CBN chief, the nation’s financial regulator will not hesitate to sanction any bank operating in the country found to be collaborating with BDC operators to facilitate illegal forex dealings.\nHe also accused international organisations, development finance organisations, and embassies of patronising BDC operators to fund local operations contravening Nigeria’s foreign exchange regulations."
  },
  {
    "headline": "Why President Buhari Travels To The UK For Medicals – Femi Adesina",
    "summarized_story": "Femi Adesina, the Special Adviser to President Muhammadu Buhari on Media and Publicity, has defended his Principal over his frequent medical tour to the United Kingdom.\nPresident Buhari had on Monday departed Nigeria for the UK to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025.\nHe explained that the Constitution empowers Vice President Yemi Osinbajo to act as President if President Buhari is not back to the country within 21 days.\nOn the out-of-school children, Adesina who noted that there is a reduction of the situation said President Buhari would brief participants of the development in the country.\nOn the five-year commitment to the funding of education, Adesina stressed that his principal would make pronouncements on that."
  },
  {
    "headline": "Tunisia In Political Turmoil As president Dismisses More Officials",
    "summarized_story": "Tunisia lurched further into political uncertainty Wednesday, as President Kais Saied sacked more officials, days after he suspended parliament and assumed executive powers in what opponents labelled a “coup”.\nAfter suspending parliament and sacking Hichem Mechichi as prime minister on Sunday, dismissing the defense and justice ministers on Monday, Saied then issued orders dismissing a series of top officials.\nOn top of the political turmoil, the North African nation is struggling with a crippling economic crisis including soaring inflation and high unemployment, as well as surging Covid-19 infections.\nAfter violent clashes outside the army-blockaded parliament on Monday, the Ennahdha party said “organised thugs” were being used to “provoke bloodshed and chaos”.\nIn the 10 years since Tunisia’s popular revolution toppled dictator Zine El Abidine Ben Ali, Tunisia has had nine governments."
  },
  {
    "headline": "Supreme Court affirms Rotimi Akeredolu as governor of Ondo State.",
    "summarized_story": "The appeal was based on the ground that Mai Mala Buni was holding position as the acting chairman of APC while a governor.\nGovernor Buni was not made a party as he was the center of the issue.\nAdvertisementThe court affirms the decision of the lower court that the petition was incompetent.\nIn a dissenting judgment Justice Mary Odili held that the APC submitted the name of Rotimi Akeredolu to INEC through its nomination form signed governor Buni who is a sitting governor.\nShe held that as a governor the constitution barred governor Buni from acting in dual capacities as a governor and party executive."
  },
  {
    "headline": "Supreme court rules on Eyitayo Jegede’s appeal 12 noon",
    "summarized_story": "The Supreme Court has adjourned till 12 noon to deliver its judgment in the appeal filed by the PDP and its candidate against the election of Rotimi Akeredolu as governor of Ondo State.\nThe candidate of the main opposition party, the People’s Democratic Party, Eyitayo Jegede is challenging Governor Akeredolu declaration by the Independent National Electoral Commission as the winner of the October 10, 2020, Ondo State governorship election.\nThe Court of Appeal sitting in Akure, Ondo State had dismissed the appeal filed by the PDP Governorship candidate against the pronouncements of the Election Petition Tribunal.\nThe seven-member panel of justices of the apex court led by Justice Mary Peter-Odili fixed 12 noon to deliver judgment after taking final submissions by counsel to the parties in the appeal."
  },
  {
    "headline": "Emir of Kotangora pleads with bandits to cease activities",
    "summarized_story": "The Emir of Kontagora, Alhaji Sa’idu Namaska has pleaded with bandits to cease their activities to allow farmers to go to their farms as the 2021 farming season has begun to help prevent food scarcity and hunger.\nThe Emir, who was represented by the Niger State Chairman of the All Farmers’ Association of Nigeria (AFAN), Alhaji Shehu Galadima stated this during the Third Niger Wet Season Agricultural Inputs and Equipment Fair in Minna, the state capital.\nThe Emir further called on the government to recruit more agro-rangers to safeguard the farmers when they go to the farm.\nThe Niger State Commissioner for Agriculture Zakari Haliru Jikantoro assured farmers that the state government is doing its best to ensure the safety of every citizen in the state.\nAdvertisementAccording to him, the tempo of banditry in the state has reduced because of the security strategies the government has deployed in recent times."
  },
  {
    "headline": "Disbelief, Support in Japan after Naomi Osaka’s Elimination",
    "summarized_story": "“Masaka” — or, in English, “No way.” That’s how an incredulous Japan reacted Tuesday to the unexpectedly early loss of Naomi Osaka at the Tokyo Olympics, erasing her chances for gold.\nWatching you play is enough for all your fans,” said Yuji Taida, a novelist.\nJapanese media relayed urgent reports on her loss, with “masaka” in the headlines.\nSome Japanese said it broke their hearts to imagine how much Osaka had wanted to win the gold for her country.\n“Compared to her courage, it is so sad some people are still at a very low level,” Nishiyama said."
  },
  {
    "headline": "Olympic Gymnastics Champ Simone Biles Withdraws from All-around Competition to Focus on Mental Health",
    "summarized_story": "Simone Biles will not defend her Olympic title.\nThe American gymnastics superstar withdrew from Thursday’s all-around competition to focus on her mental well-being.\nThe decision comes a day after Biles removed herself from the team final following one rotation because she felt she wasn’t mentally ready.\nCarey initially did not qualify because she was the third-ranking American behind Biles and Sunisa Lee.\nThe organization said Biles will be evaluated before deciding if she will participate in next week’s individual events."
  },
  {
    "headline": "White House Considering Vaccine Mandate for Federal Workers",
    "summarized_story": "The White House is expected to announce its final decision after completing a policy review this week.\nPresident Joe Biden suggested Tuesday that expanding that mandate to the entire federal workforce was “under consideration,” but offered no further details.\nAnd just like that, masks were back at the White House.\nBy Tuesday afternoon, when the latest CDC data found that Washington, D.C., is facing substantial rates of transmission, White House staff were asked to begin wearing masks indoors starting Wednesday.\nPress were asked to follow suit, and those staff and reporters remaining in the White House were already masking up."
  },
  {
    "headline": "IMF Raises Nigeria’s Growth Forecast for 2022, Retains Growth Projections for 2021",
    "summarized_story": "The International Monetary Fund (IMF) has revised upward its growth forecast for the Nigerian economy in 2022 by 0.3 per cent to 2.6 per cent compared to its earlier projection in its April edition while it retained its growth forecast for 2021.\nDivision Chief, Research Department, IMF, Malhar Nabar, revealed the growth projections while responding to a THISDAY question, during a virtual media briefing on the World Economic Outlook (WEO) on Tuesday.\nAccording to Nabar, “In terms of our forecast for Nigeria this year, we have maintained an unchanged forecast of 2.5 per cent and we have upgraded slightly for 2022 to 2.6 per cent.\nThe reason for the unchanged forecast for this year is because it is a product of opposing developments.\n“In terms of our upgrade in 2022, it is related to the improvements in terms of trade, the oil production we expect to increase going forward would lift growth for 2022."
  },
  {
    "headline": "Private Sector Aids 60% Illicit Financial Flows from Africa: Nigerian Anti-graft Commission",
    "summarized_story": "The ICPC boss was quoted in a statement to have said perpetrators of illicit financial flows (IFFs) channel such funds through commercial activities enabled by the private sector.\n“A bulk of corruption going on in the country is caused or perpetuated by the private sector.\nAbout 60 per cent of funds taken or stolen away from Africa through illicit financial flows are being done by the private sector, basically through commercial transactions, seemingly harmless transactions that are put together by accountants, auditors and bankers,” he said.\nNoting that corruption was debilitating in the country, Owasanoye explained that the ICPC was focusing on public sector corruption because of its impact on the country and the private sector.\nI hope the commission will continue to perform its duties as constitutionally required,” the AFBA president said."
  }
]