[
  {
    "headline": "CSOs, SANs fault Buhari’s warning against court summons after office",
    "summarized_story": "Falana also made reference to several court judgments secured by an anti-corruption group, Socio-Economic Rights and Accountability Project, against the Buhari regime.\nHe said, “Right now, he (Buhari) is already being called upon to give account not to talk of after he leaves office.\nHe added, “President Muhammadu Buhari loses his immunity enshrined in section 308 of the 1999 Constitution by May 29, 2023.\nHe becomes an ordinary citizen liable to be subpoenaed to ‘answer any questions’ from any court of law.\nAjanaku said this should be Buhari’s primary focus and not avoiding accountability after office."
  },
  {
    "headline": "APC govs meet Sunday, to insist on convention before presidential primary",
    "summarized_story": "…says Buhari’s warning instrumental in averting party splitThe ruling All Progressives Congress will meet on Sunday, January 9, to decide a substantive date for the party’s national convention.\nHe said the APC governors would insist that the national convention holds before the presidential primary.\nThe governor said, “Some people like OUK (Orji Uzor Kalu) are pushing for the conduct of the presidential primary before the convention.\nLalong said the APC governors had assured Buhari that the convention would hold in February.\nThe chairman of PGF and Kebbi State Governor, Atiku Bagudu, said top on the agenda of the meeting was the national convention."
  },
  {
    "headline": "LAMATA debunks report on plans to employ 50 drivers Warns public",
    "summarized_story": "By Olasunkanmi AkoniThe management of Lagos Metropolitan Area Transport Authority, LAMATA, has described as false the report making the rounds that it has commenced the process to employ 50 drivers.\nThe Deputy Director, Corporate Communications, LAMATA, Mr. Kola Ojelabi, who debunked tgevreort Inna statement, cautioned members of the public not to fall prey to scammers.\n“The public is hereby notified that LAMATA is not a transport operating company and therefore does not need to recruit drivers for transport operations.\nAs an agency of Lagos State Government, our role is to plan transport projects as detailed in the State’s Strategic Transport Master Plan (STMP), implement, regulate and franchise public transport operations.\n“Members of the public are therefore cautioned not to fall prey to scammers.”"
  },
  {
    "headline": "Singer, Ayra Starr in trouble",
    "summarized_story": "AyraOwners of Bayelsa nightclub, Voltage, are set to drag Mavin Records singer , Ayra Starr to court over N3M breach of contract.\n“This is due to the persistent disappointment and complete breach of contract for the second time from Ayra Starr and Marvin Record.\nWe do not understand why Ayra Starr and Marvin Record, after agreeing on a fee which we paid in full, have consistently disregarded her fans here in Bayelsa.\nWe have consulted our legal team and we are taking all legal actions against her and Marvin Records”.\nHowever, the nightclub presented to Potpourri a video of the singer apologising to the management of the club for her default."
  },
  {
    "headline": "‘APC leaders are working for PDP in Abia’",
    "summarized_story": "By Ugochukwu Alaribe, UMUAHIAThe All Progressive Congress, APC, Abia State chapter, has alleged that some leaders of the party are working for the ruling Peoples Democratic Party, PDP, government in the state.\nPublicity Secretary of the APC in Abia State, Chief Okey Ezeala, made the allegation in Umuahia, while reacting to attacks on the state leader of the party, Chief Ikechi Emenike.\nThe party said: “The truth is that some former officers and even elders of the APC in Abia State were working for the PDP Government in the State as if the APC in Abia State is a parastatal of the Abia State Government.\nThe APC both at national and Abia State levels organised the party Congresses last year and elected offices at the Wards, LGAs and State levels, who are known non-members and non-supporters of the PDP Government of Abia State.\n“These ruffling of feathers engendering anonymous write ups against Chief Ikechi Emenike are direct consequences of dislodging PDP stranglehold of APC in Abia State during 2021 Congresses."
  },
  {
    "headline": "Poor Working Condition: 496 of Lagos’ 2,350 nurses have left — UNION",
    "summarized_story": "By Sola Ogundip, LAGOSThe National Association of Nigeria Nurses and Midwives, NANNM, Lagos State chapter, has said more than 496 of 2,350 nurses in the employ of Lagos State have left, with less than 15 per cent due to statutory retirement.\nThis is just as the nurses vowed to embark on a three-day warning strike from Monday, January 10, to press home demands for better working conditions from the Lagos State government.\nChairman of the State chapter, Julius Awojide, made the points at an emergency Congress in Lagos on Friday.\nBrain drainAccording to Awojide, “More than 496 out of 2,350 nurses in the employ of Lagos State Health Service Commission left between 2019 and 2021 and with less than 15 per cent due to statutory retirement.\n“Over 200 nurses left the services of the Lagos State University Teaching Hospital within the same period."
  },
  {
    "headline": "Lagos nurses begin 3-day warning strike from Monday over govt’s insensitivity",
    "summarized_story": "By Sola Ogundip, LAGOSNurses, on the platform of National Association of Nigeria Nurses and Midwives, NANNM, Lagos State chapter, have vowed to embark on a three-day warning strike from Monday, January 10, to press home demands for better working conditions from the Lagos State government.\nMaking the declaration at an emergency Congress in Lagos on Friday, Chairman of the State chapter, Julius Awojide, decried what he described as “government’s insensitivity to the plight of nurses in the State”.\nIn a statement, Awojide said the warning strike was necessary to let the government know that nurses would no longer be overworked, undervalued and underpaid without consequence.\n“The Council decided to embark on the warning strike after careful consideration to call attention of government to the severity of the situation and to get them to address the issues promptly.\n“Over 200 nurses left the services of the Lagos State University Teaching Hospital within the same period."
  },
  {
    "headline": "Buhari has lost control of his government – Ijaw youths",
    "summarized_story": "The Ijaw Youth Council has queried if President Muhammadu Buhari is still in charge of Nigeria as Commander-in-Chief.\nThe group said from all indications, president has lost control of his government.\nThe council also called for the completion of east west road especially the Bayelsa and Eleme Road axis adding that despite the 20billion and 7billion naira released to Niger Delta Ministry, the road remained uncompleted.\nThe council stated that as the conscience of Nigeria’s economy, it shall take drastic but united steps to advocate freedom from their collective challenge of marginalization, constant degradation of environment, prevalent oppressions, blackmailing and undue suffering of the Niger Delta.\nWhile urging the youths to remain calm, the president of the council said he was committed to providing more opportunities and empowerment for them in the region."
  },
  {
    "headline": "Insecurity: Legionnaires express readiness to help secure Bauchi",
    "summarized_story": "Members of the Nigerian Legion in Bauchi State on Friday declared their readiness to help the state government secure lives and property of all citizens of the state.\nChairman of the state chapter of the Nigerian Legion, Brigadier-General Idris Danjuma Ningi (rtd), made the declaration at the launch of the 2022 Armed Forces Remembrance Day and Emblem appeal fund at the Government House, Bauchi.\nHe, however, commended both the Federal and the Bauchi State Governments for their efforts in keeping the state safe despite being the gateway to the North-East, which is the theatre of operations of insurgent group, Book Haram/ISWAP.\nIn his remarks on the occasion, Governor Mohammed said that considering Nigeria’s historical antecedents, the ex-servicemen deserved more than they were actually getting at the moment from both government and private individuals.\nThe governor declared that there was the urgent need for more support for the legionnaires in order to uplift and improve their living conditions."
  },
  {
    "headline": "Igbo-Eze North stakeholders, business class, clergy, monarchs, others declare support for Gov. Ugwuanyi",
    "summarized_story": "Speaking on behalf of the Diaspora, an illustrious son of Igbo-Eze North LGA and a renowned philanthropist, Don Chris, thanked Gov.\nUgwuanyi for the numerous road projects, health facilities, boreholes, among others, his administration has executed in Igbo-Eze North LGA.\nMathias Omeh, who spoke as an indigene of Igbo-Eze North LGA, recounted the remarkable achievements of Gov.\nThank you for the roads; thank you for appointing our son as the Chairman of Enugu State Civil Service Commission”.\nIn their separate speeches, the political office holders from Igbo Eze North LGA, namely the member representing Igbo-Eze North/ Udenu Federal Constituency, Hon."
  },
  {
    "headline": "Biafra: Show Nnamdi Kanu mercy, grant him amnesty – Ohanaeze President, Obiozor begs Buhari",
    "summarized_story": "President-General of Ohanaeze Ndigbo Worldwide, Prof George Obiozor, has appealed to President Muhammadu Buhari to show Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, mercy.\nObiozor said Buhari should consider Kanu as his son and show him mercy.\nFeaturing on Arise TV, Obiozor urged the president to grant the IPOB leader amnesty.\n“If he is taking the judiciary route then he is taking the right route logically, but then away from what we are talking.\nThe IPOB leader is currently locked up by the Department of State Services, DSS, after he was apprehended in Kenya in 2021."
  },
  {
    "headline": "Yoruba Oba, Olofin of Ado-Odo dies, buried according to Islamic rites",
    "summarized_story": "A Yoruba traditional ruler, the Olofin of Ado-Odo, Oba Lateef Adeniran, has died.\nThe Ogun State first-class monarch joined his ancestors on Friday and he was buried same day.\nDefying the usual rituals that do follow the death of a typical Yoruba traditional ruler, Oba Adeniran was buried according to his Islamic rites.\nIslamic clerics had gathered at Ado-Odo to observe Salat al-janazah (a funeral prayer) at an open space, with the remains of the monarch laid before them.\nOba Adeniran who clocked 63 in December, relocated from Ado-Odo to Abeokuta, the Ogun State capital in April 2013, after he was attacked and stripped naked by some angry youths."
  },
  {
    "headline": "Cross River communities where girls are used as collateral, turned into sex slaves",
    "summarized_story": "Unfortunately, the innocent girls are often turned into sex slaves in addition to performing other chores for which they are not paid.\nHe had three wives before he got me as collateral for my parents’ debt.\nThey gave me to one old man in Amana.\n“I later met David and we started to live together, but he did not have money to pay off my parents’ debt.\nHowever, she remains in bondage because the creditor family will not release her until her parents’ debt might have been paid."
  },
  {
    "headline": "2023: PDP has settled for northern presidential candidate – Babangida Aliyu",
    "summarized_story": "A former governor of Niger State, Dr. Babangida Aliyu, has said that the opposition Peoples Democratic Party (PDP) has agreed to pick its candidate for the 2023 presidential race from one of the zones in the northern region of the country despite its agreement that any candidate can contest the election.\n- Advertisement -The PDP had recently zoned the position of its national chairman to the north-central, leading to the emergence of former President of the Senate, Dr. Iyorchia Ayu, as the party’s National Chairman last October.\nBut the party has remained mum on which of the zones will produce its presidential candidate for the 2023 general elections.\nAfter his election as national chairman, Ayu hinted of the likelihood of thPDP choosing its 2023 presidential candidate by consensus.\nHe was however silent on whether the party will zone the presidential ticket to a particular part region or zone."
  },
  {
    "headline": "Capital importation hits $1.7bn, says NBS",
    "summarized_story": "The National Bureau of Statistics (NBS) yesterday said the total value of capital importation into Nigeria in third quarter of 2021 (Q3 2021) was $1.7 billion.\nThe foregoing was contained in the bureau’s document titled Nigerian Capital Importation Q3 2021.\nAccording to NBS, the total value of capital importation into Nigeria in the third quarter of 2021 stood at $1.731 billion from $875.62 million in the preceding quarter of 2021.\nThe bureau noted that the largest amount of capital importation by type was received through portfolio investment, which accounted for 70.30 per cent $1.217.21 billion of total capital importation.\n“Foreign Direct Investment (FDI) amounted to 6.23 per cent ($107.81 million) of total capital imported in Q3 2021.”"
  },
  {
    "headline": "I spent N1.2bn borrowed funds on charity in 2021 — Mbaka",
    "summarized_story": "Ejike Mbaka, has said that he borrowed a total sum of N1.253 billion for charity purposes in the year that just ended.\n“So, when people talk about Mbaka this, Mbaka that, I don’t understand that.\nFather Mbaka and other clergymen and women praying for the protection of its detained leader, Mazi Nnamdi Kanu.\n“People of God Almighty should rise up and talk in unison otherwise Fulani-controlled DSS will pick them one after the other to weaken them.\n“People of God Almighty Chukwu Okike Abiama would come out and defend their sheep because God Almighty Chukwu Okike Abiama handed them over to them as shepherd.”"
  },
  {
    "headline": "Restructuring not threat to Nigeria’s unity – Ohanaeze",
    "summarized_story": "President-General of Ohanaeze Ndigbo Worldwide, Prof George Obiozor, has said restructuring is not a threat to the unity of Nigeria.\nProf. Obiozor who spoke on Friday on Arise TV morning show, said that restructuring is a national blessing.\n“Restructuring is not a threat to the national unity, it is a very dynamic thing in a dynamic institution of a nation state where as you grow, new things are developed and new ideology evolves.\nIn fact every country that is wise and progressive takes restructuring into account as they grow.\nOn state police, Ebebuagu, he said the state police or formation of Ebubeagu or Amotekun is imperative in a federation like Nigeria."
  },
  {
    "headline": "Sylvester Oromoni died natural death – Police",
    "summarized_story": "By Christopher OjiThe Lagos State Command has insisted that the deceased 12-year-old student of Dowen College Lekki, Lagos, Slyvester Oromoni, died a natural death.\nHe also stated that the toxicology tests from Delta State and the one in Lagos State also did not point out any sign of murder on the body of the late Oromoni.\n“While waiting for the result of the toxicology, another autopsy was ordered by the Corona Magistrate in Lagos State because of the status of jurisdiction.\n“At the end of diligent Investigations carried out so far ,there is no evidence to establish a case of torture, bullying and forceful application of poisonous substance against the suspects.\n“Final result of the post mortem and toxicology examination conducted both in Wari and Lagos agreed that the deceased died of natural death,” the Lagos police boss said."
  },
  {
    "headline": "Stop using military uniforms for your campaign posters, DHQ warns govs, others",
    "summarized_story": "From Molly Kilete, AbujaThe Defence Headquarters(DHQ), has frowned against the use of military uniforms and accoutrements by some state governors, politicians and unauthorized persons to produce their campaign posters.\nThe DHQ, warned that that the military allowed governors and other Very Important Personalities (VIP) to wear military uniforms during military training exercises, does not make them military officers overnight to use the uniforms whenever they want to.\nIt has therefore warned those who have used their pictures in military uniforms to produce their campaign posters to remove them or have themselves to blame.\nActing Director Defence Information, Air Commodore Maigida, who gave the warning in a statement entitled “Wearing of military uniforms by unauthorised persons and politicians for electioneering campaign posters is illegal” said: “The Defence Headquarters (DHQ) has noticed with dismay that some politicians have formed the habit of wearing military uniforms and accoutrements for electioneering campaign posters.\nThis is manifestly illegal and an abuse of the privilege of allowing civilians wear military uniforms during military training exercises."
  },
  {
    "headline": "Kanu: Political solution inevitable, Ohanaeze tells Buhari",
    "summarized_story": "From Magnus Eze and Geoffrey Anyanwu, EnuguOhanaeze Ndigbo, yesterday, said political solution was inevitable in the matter between the Federal Government and leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nOgbonnia reasoned that an ordinary pronouncement by the President Buhari could end the whole agitation in the region.\nThat is what we mean by political solution.\nThat is what we call political solution.\nAs every revolutionary struggle has its own methodology, the current Biafran struggle for actualisation and restoration will continue to unfold confusing methods to President Buhari."
  },
  {
    "headline": "Convention: APC stakeholders seek sack of Lukman, PGF DG, threaten protest",
    "summarized_story": "Stakeholders of the All Progressives Congress (APC) have called on governors elected on the platform of the party to sack the Director General of the Progressive Governors’ Forum (PDF), Salihu Moh Lukman, with immediate effect.\nThe stakeholders, under the aegis of the All Progressives Congress Youth Development and Solidarity Forum (APC-YDSF), said they were ready to stage a nationwide protest if he continued as DG, PGF.\nThe claimed Lukman has proved he is an agent of a few selfish interests in the party and that of the Peoples Democratic Party (PDP).\nThey spoke just as the party said it was set to deal with erring members found to be working against its interest.\nNational Coordinator of the Group, Donatus Okereke, told newsmen in Abuja that the party was not ready for a national convention with the crises engulfing some state chapters, urging the national leaders to ensure “proper and thorough reconciliation” before any national convention is staged."
  },
  {
    "headline": "2023: South East PDP, leaders back Anyim for president",
    "summarized_story": "Former PDP national vice chairman, South East, Ozichukwu Chukwu, praised Anyim for his courage, noting that he is immensely qualified for the job.\n“This is the turn of the South East, we are not visitors, we are equal stakeholders in Nigeria.\nSo, this issue of South East having the presidential slot is not negotiable,” Ogba said.\nOn his part, PDP National Vice Chairman, South East, Ali Odefa, said Anyim has set the pace and urged others from the zone to follow suit.\n“Let me also, at this point, state clearly that I am aware that I am not the only aspirant from the South East seeking to run for the office of president."
  },
  {
    "headline": "Buhari Names Ayo Gbeleyi as FMBN Board Chairman",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has approved the appointment of Mr Ayodeji Ariyo Gbeleyi as the Chairman of the Board of Directors of the Federal Mortgage of Bank of Nigeria (FMBN).\nAccording to a statement issued on Friday by Media Adviser to the President, Femi Adesina, Gbeleyi replaced Chief Adewale Adesoji Adeeyo, who passed on recently.\nA Chartered Accountant and an Associate of the Chartered Institute of Taxation, Gbeleyi is a well-known financial expert who was once a Commissioner for Finance in Lagos State as well as a player in the aviation sector.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "APC to Meet Sunday to Fix Date for National Convention, Says Lalong",
    "summarized_story": "Deji Elumoye in AbujaThe ruling All Progressives Congress (APC) is expected to meet on Sunday to choose a definite date in February 2022 for the conduct of its national convention.\nThis was disclosed to newsmen on Friday by the Chairman of the Northern Governors Forum and Plateau State Governor, Simon Lalong, after a closed-door meeting with President Muhammadu Buhari at the State House, Abuja.\nAccording to him, the Sunday meeting to be attended by APC governors in Abuja, will centre on the proposed date for the convention, adding that President Buhari’s admonition to the party that it risks losing power to the Peoples Democratic Party (PDP) is a signal for the party to have a seamless convention so that it will not disintegrate.\nHe said the governors have now given the president the assurance that the APC convention will still hold in February.\nDetails Later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Aggrieved APC Members Move to Stop February Convention",
    "summarized_story": "Sue Buni over non completion of states’ congressesAlex Enumah in AbujaSome aggrieved members of the All Progresive Congress ( APC) have commenced legal action to stop the planned February National Convention of the APC by dragging the Caretaker- and Extraordinary Convention Planning Committee under Yobe State Governor, Mr Mai Mala Buni before a Federal High Court in Abuja.\nSpecifically, the aggrieved members have already applied to the court for an order to restrain the Buni-led CECPC from going ahead with the convention.\nRecall that some members of the APC have been clamouring for a change in date of the scheduled national convention.\nMeanwhile, sued alongside Buni include the All Progressives Congress (APC), the Chairman, All Progressives Congress’ Caretaker/Extraordinary Convention Planning Committee and the Independent National Electoral Commission.\nAn order directing the 1st and 2nd defendant to first conduct state congresses of the 1st defendant in Anambra and Zamfara States before the national convention of the APC can be scheduled and conducted."
  },
  {
    "headline": "Buhari Warns APC of Consequences of Disunity",
    "summarized_story": "Buhari said without unity of purpose among the leaders and other party members, APC might lose to the opposition.\nBuhari also assured that those defecting from the opposition parties to APC, with corruption charges hanging over their heads, would have their day in the court of law.\nHe foreclosed the possibility of anyone in the party foisting leadership on members.\nBuhari stated, “We have timeframe we have to work, because the four-year tenure is constitutional.\nSo, the party, because I’m concerned about my party, the party, in all constituencies they will know their positions."
  },
  {
    "headline": "PDP to President: Just Go, Nigerians Don’t Want a Successor from You",
    "summarized_story": "Chuks Okocha in Abuja and George Okoh in MakurdiThe Peoples Democratic Party (PDP), yesterday, told President Muhammadu Buhari to perish the thought of pushing forward a successor, saying Nigerians would firmly reject anyone from him and his All Progressives Congress (APC) in the 2023 presidential election.\nPDP said the president should have used the interview to show remorse and apologise to Nigerians for his serial misgovernance.\nPDP said, “While we understand that lying is the standard gauge of performance of the APC, it is rather unfortunate that the president is also in that frame.\nThe governor was reacting to the Buhari interview on Channels TV.\nOr is it possible that Mr. President is not aware that Nigerians are dying from his misrule?”The governor dismissed the president’s classification of PDP as a failure, insisting, “As a critical stakeholder of the PDP, this is completely false."
  },
  {
    "headline": "National Assembly Earmarks N5billion To Build Library, N1billion For Constitution Review Despite Nigeria’s Dwindling Revenue",
    "summarized_story": "In the figures released, N100billion was earmarked for zonal interventions, while National Assembly liabilities to gulp N10billion.\nIn the data, the National Assembly library building will consume N5billion and the lawmakers are billed to spend N1billion on Constitution Review.\nOther projected expenses are National Assembly e-library with N300 million and National Assembly dashboard with N139 million.\nRecall that SaharaReporters had published last week how President Muhammadu Buhari lamented some worrisome changes made by the National Assembly on 2022 Budget he signed into law.\nThe President had said, \"It is in this regard that I must express my reservations about many of the changes that the national assembly has made to the 2022 executive budget proposal."
  },
  {
    "headline": "National Assembly Earmarks N5billion To Build Library, N1billion For Constitution Review Despite Nigeria’s Dwindling Revenue",
    "summarized_story": "In the figures released, N100billion was earmarked for zonal interventions, while National Assembly liabilities to gulp N10billion.\nIn the data, the National Assembly library building will consume N5billion and the lawmakers are billed to spend N1billion on Constitution Review.\nOther projected expenses are National Assembly e-library with N300 million and National Assembly dashboard with N139 million.\nRecall that SaharaReporters had published last week how President Muhammadu Buhari lamented some worrisome changes made by the National Assembly on 2022 Budget he signed into law.\nThe President had said, \"It is in this regard that I must express my reservations about many of the changes that the national assembly has made to the 2022 executive budget proposal."
  },
  {
    "headline": "I'll Clean Up El-Rufai’s Mess, Shehu Sani Says After Joining Kaduna Governorship Race",
    "summarized_story": "A former lawmaker representing Kaduna Central Senatorial District at the National Assembly, Shehu Sani, has indicated interest to join the governorship race in 2023.\nThe lawmaker disclosed this while speaking during a radio interview in Kaduna on Saturday.\nSani said he was joining the race to rescue the state from the mess that had been created by Governor Nasir el-Rufai.\nThis is what my supporters wanted and I trust them.\nTherefore, I call on the people of Kaduna to support and collaborate with me."
  },
  {
    "headline": "I'll Clean Up El-Rufai’s Mess, Shehu Sani Says After Joining Kaduna Governorship Race",
    "summarized_story": "A former lawmaker representing Kaduna Central Senatorial District at the National Assembly, Shehu Sani, has indicated interest to join the governorship race in 2023.\nThe lawmaker disclosed this while speaking during a radio interview in Kaduna on Saturday.\nSani said he was joining the race to rescue the state from the mess that had been created by Governor Nasir el-Rufai.\nThis is what my supporters wanted and I trust them.\nTherefore, I call on the people of Kaduna to support and collaborate with me."
  },
  {
    "headline": "I'll Clean Up El-Rufai’s Mess, Shehu Sani Says After Joining Kaduna Governorship Race",
    "summarized_story": "A former lawmaker representing Kaduna Central Senatorial District at the National Assembly, Shehu Sani, has indicated interest to join the governorship race in 2023.\nThe lawmaker disclosed this while speaking during a radio interview in Kaduna on Saturday.\nSani said he was joining the race to rescue the state from the mess that had been created by Governor Nasir el-Rufai.\nThis is what my supporters wanted and I trust them.\nTherefore, I call on the people of Kaduna to support and collaborate with me."
  },
  {
    "headline": "Miyettti Allah to FG: Ignore Ortom's unpatriotic call -- we will never be a terrorist organisation",
    "summarized_story": "The Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) has asked the federal government to ignore the request of Samuel Ortom, governor of Benue, to declare the association as a terrorist organisation.\nBut reacting, Baba Ngelzarma, national secretary of MACBAN, described Ortom’s request as “unpatriotic”.\nNgelzarma alleged that Ortom’s hatred for the Fulani “was not in doubt”, adding that “he has proved beyond reasonable doubt that he is an unreliable leader”.\n“We, therefore, call on the federal government to ignore this unpatriotic call by a wayward governor who is hell-bent on putting this country into unnecessary crisis.\nAdvertisement“MACBAN is not and will never be a terrorist organisation."
  },
  {
    "headline": "Miyettti Allah to FG: Ignore Ortom's unpatriotic call -- we will never be a terrorist organisation",
    "summarized_story": "The Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) has asked the federal government to ignore the request of Samuel Ortom, governor of Benue, to declare the association as a terrorist organisation.\nBut reacting, Baba Ngelzarma, national secretary of MACBAN, described Ortom’s request as “unpatriotic”.\nNgelzarma alleged that Ortom’s hatred for the Fulani “was not in doubt”, adding that “he has proved beyond reasonable doubt that he is an unreliable leader”.\n“We, therefore, call on the federal government to ignore this unpatriotic call by a wayward governor who is hell-bent on putting this country into unnecessary crisis.\nAdvertisement“MACBAN is not and will never be a terrorist organisation."
  },
  {
    "headline": "Obasanjo: Nigeria needs political will to manage army of unemployed youths",
    "summarized_story": "Former President Olusegun Obasanjo says political will and action are key to transforming the country’s population into an asset.\nAdvertisementWhile speaking on Friday at the Oyewusi Ibidapo-Obe symposium in Lagos, Obasanjo expressed worry over the country’s growing population, especially the unemployed youths.\nThe former president said owing to unemployment and the inability to manage the country’s population, many youths have enlisted in violent groups and kidnap gangs.\nAdvertisement“The second cluster of questions are: How do we keep this large keg of a large army of unemployed youths from exploding?\nPolitical will and political action can make the population an asset."
  },
  {
    "headline": "Obasanjo: Nigeria needs political will to manage army of unemployed youths",
    "summarized_story": "Former President Olusegun Obasanjo says political will and action are key to transforming the country’s population into an asset.\nAdvertisementWhile speaking on Friday at the Oyewusi Ibidapo-Obe symposium in Lagos, Obasanjo expressed worry over the country’s growing population, especially the unemployed youths.\nThe former president said owing to unemployment and the inability to manage the country’s population, many youths have enlisted in violent groups and kidnap gangs.\nAdvertisement“The second cluster of questions are: How do we keep this large keg of a large army of unemployed youths from exploding?\nPolitical will and political action can make the population an asset."
  },
  {
    "headline": "'Focus on profitability, be mindful of our net zero commitments' -- Buhari tells NNPC board",
    "summarized_story": "President Muhammadu Buhari has urged the new board of Nigerian National Petroleum Company (NNPC) Limited to ensure strict compliance with corporate governance principles.\nEarlier on Wednesday, Buhari had appointed Okadigbo as board chairman of the board of NNPC limited, alongside eight other board members.\n”I expect the NNPC Limited to be mindful of our commitments to our net carbon zero aspirations and to ensure total alignment with the global energy transition realities,” he said.\nAdvertisement“The Nigerian National Petroleum Company Limited is mandated to focus on profitability and continuous value creation beyond the simple fulfilment of legal and regulatory requirements.\nIn his remarks, Timipre Sylva, minister of state for petroleum resources, said a great deal of the petroleum industry goals had been achieved under Buhari."
  },
  {
    "headline": "On the making of King of Boys, Netflix’s first original Nigerian series",
    "summarized_story": "KOB 2 was well received by movie lovers as it topped Netflix’s top-ten movie charts for many weeks.\nMA: Interestingly, as at the time we started shooting KOB 2, I don’t think it was confirmed as a Netflix original.\nDA: Considering that this was Netflix’s first Nigerian original series, how much technical support did Netflix bring in?\nDA: What was the difference between shooting a regular movie and a 7-part series?\nMA: Another thing that’s noteworthy is that, when we finished shooting King of Boys, nobody knew we had shot a series."
  },
  {
    "headline": "Cameroon risks stunting mobile money growth with new transaction levy",
    "summarized_story": "Among Cameroonians, new year celebrations have so far coincided with pushback against a new tax on mobile money transactions introduced by the Paul Biya administration.\n#WeSayNo.”The new mobile money tax will especially hit the poorest, unbanked segments of Cameroon society.\nA later study also points out that many mobile money users belong to “marginalised societal groups” hence the negative impact on financial inclusion and broader development goals of mobile money taxes is significant.\nSimilarly, a 1% tax on mobile money transactions in Uganda was cut in half after protests.\nUnlike Ghana’s case, however, citizens were barely informed of the details before Cameroon’s government implemented the new mobile money tax in November, according to local media reports."
  },
  {
    "headline": "How mobile phones and digital tools have helped Togo tackle COVID-19",
    "summarized_story": "Globally, the COVID-19 disease has infected more than 290 million people, claimed well over 5 million lives, and plunged millions into extreme poverty.\nMore than 1.6 million Togolese registered for the monetary support through their mobile phones, according to data on the Novissi website.\n“People should not have to choose between death by COVID-19 or by hunger,” President Faure Gnassingbe said on the Novissi programme.\nIn a month, more than 50,000 people registered for COVID-19 vaccination through Togo’s digital platforms.\nAuthorities launched a mobile and web-based service that allows Togolese to register for vaccination using their phones."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "African startups raised $1 million every 2 hours in 2021 — Africa: The Big Deal",
    "summarized_story": "Odunayo Eweniyi, Co-founder, FirstCheck AfricaThe Big Deal reports that only 0.95% of the funding raised by African startups went to startups founded or led by a woman.\nAccording to Briter Bridges, 62% (~$2.9 billion) of total funding in African startups went to fintech startups, double the 31% recorded in 2020.\nMax AB, an Egyptian eCommerce startup raised a $55 million Series A across two rounds in 2021.\nSource: SuppliedSome startups that raised at least $100 million include Andela, $200 million Series E; Flutterwave, $170 million Series C; Chipper Cash, $250 million Series C across two separate rounds; OPay, $400 million Series C; Trade Depot, $110 million Series B; and Jumo, $400 million led by Fidelity Management & Research Company.\nWith the heights reached by African startups in 2021, it is logical to expect them to be matched and hopefully eclipsed in 2022."
  },
  {
    "headline": "Fintech predictions in 2022, LinkedIn’s Clubhouse-like platform, JABU’s $3.2m seed",
    "summarized_story": "Today, I’m discussing:2022 predictions for the fintech industryLinkedIn’s Clubhouse-like platformJABU’s $3.2m fundWhat does 2022 hold for the fintech industry?\nHere’s Emmanuel Paul’s take on that: Nigerian fintech predictions for 2022: Dollar exchanges go the way of Bitcoin.\nThe new events platform will begin with an audio-only product — clubhouse-style audio events — released in beta this January.\nAdvertisementIn March 2021, LinkedIn confirmed that it has been working on a Clubhouse rival to cultivate a larger and more active Creator community.\nAfore Capital, Y Combinator, FJ Labs, Quiet Capital, Kli Capital, Pareto Capital, among other unnamed investors, participated in the round."
  },
  {
    "headline": "Nigerian fintech predictions for 2022: Dollar exchanges go the way of Bitcoin",
    "summarized_story": "That’s how significant the exponential growth in the fintech space has been in recent years, and it creates room for bullishness in the space.\nFor instance, Nigerian fintech funding in 2021, $800 million, was 120% higher than funding in the last three years combined.\nPhoto by Kglavin via Wikipedia CommonsIn 2021, Africa minted five unicorns, two of which were Nigerian fintech companies.\nIt’s unlikely that WhatsApp’s payment play would be good news to existing banks and fintech players.\nWhat do you think about predictions for the fintech space?"
  },
  {
    "headline": "Kids Club Charity Donates Educational Materials To Schools In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In its resolved to helping humanity particularly the downtrodden and vulnerable in the society, one of the leading Non Governmental Organisations (NGO) in the country, Kids Club Charity, recently distributed “back to school materials” to schools across Edo state.\nSome of the ‘back to school items’ distributed by the NGO include School Uniforms; Sandals; books, biros and other educational materials.\nThe Kids Club Charity which is the brainchild of Dr. Awele Eucharia Ilobah, according to her is an NGO that is committed to catering for the less privileged and vulnerable children in the society.\nIn their separate remarks, the beneficiary schools and children expressed appreciations and commended the humanitarian gesture of Kids Club Charity for reaching out to them.\nAt the end of the NGO 2021 annual humanitarian services, about 20 schools were reached."
  },
  {
    "headline": "DOCUMENTING EDO STATE GOVERNMENTS – Nigerian Observer",
    "summarized_story": "As a journalist, writer and social scientist I have interacted with hundreds of politicians, public office seekers, academics, civil servants, clerics, critics and scores of other individuals in Edo State.\nFollowing this development, I resolved to start documenting all Edo State Governments in power since 2007 for public consumption beginning with Comrade Adams Aliu Oshiomhole whose administration oversaw the affairs of Edo State from 2007-2016.\nMaterials used for government documentation are from on/offline sources, most especially reports carried in the state-owned Nigerian Observer published by Bendel Newspapers Company Limited with headquarters in Benin City, capital of Edo State.\nGovernor Godwin Nogheghase Obaseki assumed office as Edo State Governor on November 12, 2016.\nRather, the works were put together by a team of researchers who believe passionately in providing resources material with which Edo citizens and other interested persons can get relevant facts about Edo State Government."
  },
  {
    "headline": "With 40MW power plant operational, investors scramble for space in Benin Industrial Park – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… as Edo govt earmarks 100ha for first phase, assures incentives for investors… Ossiomo Power generation capacity now 95MWBENIN CITY – With the coming on stream of the 40MW Independent Power Plant (IPP) built by Ossiomo Power and dedicated to provide power to the Benin Industrial and Enterprise Park, investors are trooping in to harness the benefit of the 24-hour electricity and other benefits available at the mixed-purpose park.\nOssiomo Power had announced that its new 40MW plant became operational in December 29 and had already connected and powering Ologbo and Obayantor communities in Ikpoba Okha Local Government Area of the State.\nThe new plant increases the generation capacity of Ossiomo Power to 95MW, as a 55MW plant had been operational since 2020.\nManaging Director, Edo State Investment Promotion Office (ESIPO), Kelvin Uwaibi, in a chat with journalists, said the state government has earmarked 100 hectares for the first phase of the mixed-purpose Benin Industrial and Enterprise Park, which measures about 997-hectares.\nAccording to him, “We are being inundated by enquiries from investors and are ready for those who want to set up shop as quick as possible."
  },
  {
    "headline": "Obaseki advances on digital economy, to provide optic fibre connectivity across 18 LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured residents that his government will sustain ongoing reforms and programmes aimed at achieving digital economy in the state, promising to provide fibre optic connectivity to all Edo communities to enhance access to the internet and expand the state’s digital economy.\nObaseki, who spoke to journalists in Benin City, said his administration is committed to building physical and digital infrastructure, leveraging technology to drive sustainable growth and development in the state.\nHe stated, “Our operation Light Up Edo is in full gear with the street-lighting project being rolled out in Benin City, Ekpoma and Auchi.\n“As a government, we are recommitting ourselves to deepen growth across all sectors of the state and provide more opportunities for our people to realise their full potential.\nThese we will do by leveraging the innate abilities of our people and providing them with the tools and enablement to dominate and conquer their world.”..."
  },
  {
    "headline": "Nigerian govt spends $1.68bn on food imports in nine months",
    "summarized_story": "According to the report, $184.69m, 188.88m and 271.59m were spent in July, August and September, respectively.\n“We have to do everything possible to reduce the rate of unemployment in the country.\nEmefiele said the CBN recently unveiled the ‘100 for 100’ policy on production and productivity to engender growth and employment.\nAccording to him, under the programme, targeted credit of up to N5bn will be provided to 100 firms every 100 days, provided the firms are investing in greenfield projects.\nThe CBN governor said the bank remained committed to supporting eligible firms with foreign exchange to import machinery and equipment."
  },
  {
    "headline": "Renewed crisis in APC over convention as aggrieved members drag Buni to court",
    "summarized_story": "The crisis in the ruling All Progressives Congress (APC) over its proposed February convention has shown little signs of abating as some members have dragged the Mai Mala Buni-led Caretaker and Extraordinary Convention Planning Committee (CECPC) before a Federal High Court in Abuja.\nThe applicants were seeking an order of the Court to restrain the Caretaker Committee from going ahead with the convention.\nThe APC, Chairman of APC Caretaker/Extraordinary Convention Planning Committee and the Independent National Electoral Commission were listed as 1-3 defendants in the Court processes obtained by journalists in Abuja on Friday.\nThe Chairman of PGF and Kebbi State Governor, Atiku Bagudu, said top on the agenda of the meeting was the national convention of the party fixed for February 2022.\nThere had been a clamour for a change in date of the scheduled national convention."
  },
  {
    "headline": "Carbonated drinks tax will be harmful to economy – MAN warns",
    "summarized_story": "Director-General, MAN, Segun Ajayi-Kadir, said this in Lagos, while reacting to the introduction of N10 excise duty on carbonated drinks as announced by the Federal Government on Wednesday, NAN reported.\nAs seen from previous impact analysis, excise affects production outputs, revenues and profits.\nAccording to him, introducing excise will easily reduce production capacity causing manufacturers to struggle to meet investor commitments as well as cause investors to take investments to other countries.\nIntroducing excise will easily reduce production capacity causing manufacturers to struggle to meet investor commitments as well as cause investors to take investments to other countries.\n“This will grossly impact the small and emerging business owners in the non-alcoholic beverage sector.”Facebook Notice for EU!"
  },
  {
    "headline": "Mayhem: Terrorists kill 200 in Zamfara, two in Taraba, scores missing",
    "summarized_story": "Terrorists have killed at least 200 persons in Anka and Bukkuyum local government areas of Zamfara State between Wednesday and Thursday.\nOn Wednesday, the armed men attacked about five communities of Kurfa Danya, Kurfa Magaji Rafin Gero, Tungar Isa and Barayar Zaki in Bukkuyum and Anka LGAs.\nAn eyewitness, who spoke to the BBC Hausa Service, said three villages, Rafin Danya, Kurfa and Rafin Gero, were completely burnt down by the bandits.\nMeanwhile, terrorists on Wednesday evening killed two passengers and abducted 40 people along Gembu-Bali road in Taraba State.\nThe terrorists, it was gathered, were part of the bandits that relocated to the state from Zamfara and Katsina States in recent weeks."
  },
  {
    "headline": "Amotekun Deploys Operatives To Prisons In Ondo",
    "summarized_story": "Following the withdrawal of men of the Nigerian Army from the Correctional Centers across the State, the Ondo State Security Network Agency, also known as Amotekun Corps, has deployed its officers to correctional centres in the state.\nApart from Amotekun, other security agencies in the state, including the Nigeria Police Force and the Nigeria Security and Civil Defence Corps, (NSCDC), have also deployed their men to complement the efforts of the officers of the custodial centres.\nLEADERSHIP investigation revealed that the deployment was initiated by the state governor, Oluwarotimi Akeredolu, to prevent any breach of security, particularly jailbreaks in the state.\nSpeaking with journalists in Akure, the state capital, Amotekun Commander, Chief Adetunji Adeleye, said the correctional centres which are the Federal Government’s responsibilities ought to be the responsibility of the federal security agencies to provide adequate protection for the facilities.\nADVERTISEMENTAccording to Adeleye, “As soon as that incident (soldiers withdrawal) happened, the police and the NSCDC immediately deployed their men to all the correctional centres."
  },
  {
    "headline": "APC Govs To Choose Convention Date Sunday – Lalong",
    "summarized_story": "Plateau State governor, Simon Lalong, has disclosed that the Progressive Governors’ Forum (PGF) will give a date for the All Progressives Congress (APC) national convention after its meeting on Sunday.\nADVERTISEMENTThe caretaker chairman of the APC, Governor Mai Mala Buni of Yobe State also met with the President on Thursday.\nHowever, Lalong said the governors were working assiduously to hold the party’s convention next month.\nI think our first date before Christmas we said we’re going to do a convention in February and we are still working for convention, as far as I’m concerned, except things change from another angle.\nADVERTISEMENT“People will come with different interests and so when you are preparing like this, you have different interests and those different interests will be aired in different ways."
  },
  {
    "headline": "Bauchi Govt Drags Dogara, Others To Court Over Bogoro Violence",
    "summarized_story": "The Bauchi State government has dragged a former Speaker of the House of Representatives, Barr.\nYakubu Dogara, and 28 others before a State High Court for 11-count criminal charges.\nThe eleven count suit reads in part: “Pursuant to Sections 98 (1) & (2), 100 (b) and 103 (b) of the Administration of Criminal Justice Law of Bauchi State, 2018.\nYakubu Dogara, male of Maitama, Abuja-FCT, Air Commodore Ishaku Komo (Rtd), male of Kaduna-Abuja Road, Kaduna, Kaduna State, Rev.\nNo date has been fixed for the commencement of the case but court processes were being served as indicated by the charge sheet."
  },
  {
    "headline": "Bauchi Govt Drags Dogara, Others To Court Over Bogoro Violence",
    "summarized_story": "The Bauchi State government has dragged a former Speaker of the House of Representatives, Barr.\nYakubu Dogara, and 28 others before a State High Court for 11-count criminal charges.\nThe eleven count suit reads in part: “Pursuant to Sections 98 (1) & (2), 100 (b) and 103 (b) of the Administration of Criminal Justice Law of Bauchi State, 2018.\nYakubu Dogara, male of Maitama, Abuja-FCT, Air Commodore Ishaku Komo (Rtd), male of Kaduna-Abuja Road, Kaduna, Kaduna State, Rev.\nNo date has been fixed for the commencement of the case but court processes were being served as indicated by the charge sheet."
  },
  {
    "headline": "Station Attack: Imo Police Begin Manhunt For Suspects",
    "summarized_story": "The Imo State Commissioner of Police, Rabiu Hussaini, has announced a manhunt of suspects with bullet wounds in connection with the attack on the Ideato South Police station.\nHe explained that the manhunt was for suspects who sustained gunshot wounds during the shoot-out with policemen on Thursday.\nAbattam appealed to residents especially in the Ideato South local government area with any information to immediately inform the police.\nADVERTISEMENTHe said the gunmen invaded the station after they threw in improvised explosive device, after which they engaged the police in a gun duel.\nHowever, no life was lost while the suspected hoodlums sustained gunshot wounds and ran into the surrounding bush."
  },
  {
    "headline": "Miyetti Allah to Gov. Ortom: You are wayward",
    "summarized_story": "The Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) has labeled Samuel Ortom a wayward governor and an unreliable leader.\nMACBAN made the remark after Ortom, the governor of Benue state, urged the Federal Government to declare the association a terrorist organization.\nThe National Secretary of MACBAN, Alhaji Baba Ngelzarma, in a statement on Friday, however, urged the Federal Government to ignore Ortom.\nSamuel Ortom of Benue State for the proscription of our association (MACBAN) going by his antecedents.”He added that Ortom’s hatred for the Fulani was not in doubt.\n“We, therefore, call on the Federal Government to ignore this unpatriotic call by a wayward Governor who is hell bend on putting this country into unnecessary crisis,” Ngelzarma said."
  },
  {
    "headline": "The amazing life of Sidney Poitier, the first black Hollywood star",
    "summarized_story": "By Nehru OdehSidney Poitier, Hollywood’s first black movie star and the first black man to win an Oscar has died.\nThere was almost no frame of reference for us except as stereotypical, one-dimensional characters,” Poitier told Winfrey.\n“He said, ‘take care of yourself, son.’ And he turned me around to face the boat,” Poitier told NPR in 2009.\n“That man, every night, the place is closed, everyone’s gone, and he sat there with me week after week after week,” Poitier told CBS News.\n“And of course it is one of those great, great moments in all of film, when you slap him back,” CBS News’ Lesley Stahl told Poitier in 2013."
  },
  {
    "headline": "JUST IN: Olofin Of Ado-Odo, Oba Lateef Adeniran Passes Away, Buried",
    "summarized_story": "JUST IN: Olofin Of Ado-Odo, Oba Lateef Adeniran Passes Away, BuriedA Yoruba traditional ruler, the Olofin of Ado-Odo, Oba Lateef Adeniran, has passed away.\nThe Ogun State first-class monarch joined his ancestors on Friday and he was buried same day.\nDefying the usual rituals that do follow the death of a typical Yoruba traditional ruler, Oba Adeniran was buried according to his Islamic rites.\nIslamic clerics had gathered at Ado-Odo to observe Salat al-janazah (a funeral prayer) at an open space, with the remains of the monarch laid before them.\nThe body was later interred into the grave as many gathered to bid the monarch farewell."
  },
  {
    "headline": "2023: Abuja Erupts In Jubilation As Nigerians Ask Gov Emmanuel To Run For President",
    "summarized_story": "…Urge FG to declare emergency on food security…MRO, Coconut refinery, Ibom Deep Seaport, huge foreign exchange for A’Ibom- Gov.\nSoon we’ll lead a massive protest if you refuse to heed the plea of Nigerians.\nWe need someone like you to use the knowledge of what you have done in Akwa Ibom to salvage the country, Isah declared.\nListing his achievements in office as Governor of Akwa Ibom State, Governor Emmanuel said the time has come for leaders to think outside the box on how to run the economy, a factor he said inspired him to conceive the idea of developing the three gateway of land, air and sea in Akwa Ibom.\n“If the power Ibom Power generates is adequately distributed, Engineers in the power sector have assured me that my people would by now be enjoying up to 21 hours of power per day”, he said."
  },
  {
    "headline": "Fresh Crisis Hits APC As Aggrieved Members Drag Governor To Court",
    "summarized_story": "The applicants were seeking an order of the Court to restrain the Buni-led CECPC from going ahead with the convention.\nThe Chairman of PGF and Kebbi State Governor, Atiku Bagudu, said top on the agenda of the meeting was the national convention of the party fixed for February 2022.\nThere had been a clamour for a change in date of the scheduled national convention.\nThe APC, Chairman of APC Caretaker/Extraordinary Convention Planning Committee and the Independent National Electoral Commission were listed as 1-3 defendants in the Court processes obtained by journalists in Abuja on Friday.\nI sacrificed ambition to help resolve APC crisis, Ojudu claimsThe plaintiffs raised five questions for the Court to determine and also sought eight declarative reliefs."
  },
  {
    "headline": "Crisis Looms As Speaker Resigns After Feud With President",
    "summarized_story": "The speaker of Tanzania’s parliament quit after a very public falling out with President Samia Suluhu Hassan, exacerbating divisions within the ruling party.\nJob Ndugai, who is no stranger to controversy, had infuriated Hassan last week when he criticized her over what he called Tanzania’s “excessive” foreign borrowing.\n“This is my personal and voluntary decision for the interest of my country, government, and my party CCM,” he said.\n“Is there any pride in taking around a begging bowl?” Ndugai asked at a public meeting last week.\n“His forced resignation, though, confirms that Tanzania has only one omnipotent & untouchable arm of the State: the President."
  },
  {
    "headline": "More jitters as Lassa fever ‘returns’ amidst rising Covid-19 Omicron cases",
    "summarized_story": "This was disclosed in the agency’s latest Lassa fever situation report for week 49 spanning from December 6-20.\nSimilarly, two senior consultant gynecologists have reportedly died of Lassa fever at the Dalhatu Arafat Specialist Hospital (DASH) in Lafia, Nasarawa state.\nNMA’s warningsMeanwhile, the Nigerian Medical Association (NMA) has advised the country to prepare for possibly fresh and deadlier Lassa fever outbreaks.\nHe said, “Lassa fever is a severe and often-fatal hemorrhagic illness caused by Lassa virus.\nInstead of witnessing a decline in yearly infection rates, Lassa fever cases appear to have become more widespread in the country."
  },
  {
    "headline": "Joining APC won’t save corrupt politicians from trial – Buhari",
    "summarized_story": "﻿President Muhammadu Buhari has said joining the ruling All Progressives Congress (APC) by corrupt politicians would not save them against prosecution by anti-graft agencies.\nThe president said this in an interview with the Nigeria Television Authority (NTA) monitored in Abuja.\nHe said: “I don’t like to accept that joining our party will check our insistence on accountability.\nSo, the party, because I’m concerned about my party, the party, in all constituents, they will know their positions, coming up.\n“The age is telling on me, working now for 6,7,8 hours a day flight in the office is no joke."
  },
  {
    "headline": "FG plans agencies’ merger, says workers won’t be disengage",
    "summarized_story": "The federal government Thursday said it has no plan to disengage civil servants because of the nation’s economic downturn.\nShe, however, said the government would reduce overheads by ensuring merger of its agencies.\nThe minister’s position came against the backdrop of media reports (not in Blueprint) that government was planning to sack workers over cash crunch.\n“And also we will be able to come up with incentive packages to retrain people and redeploy them in some areas where they are useful.\nFor example, we still have a very high need for teachers so we can retrain people and send them to teach but also incentive packages to exit."
  },
  {
    "headline": "VIDEO: Sylvester Oromoni’s Death Not Caused By Poison, Torture – Police",
    "summarized_story": "Police authorities in Lagos State on Friday said the 12-year-old student of Dowen College in Lekki, Sylvester Oromoni, died a natural death.\nThe briefing held two days after the Lagos State government cleared the students and employees of the school accused of complicity in the death of Sylvester.\nThe corpse was, therefore, moved with armed police escorts from Delta State to Lagos State by TOS Funeral and the autopsy conducted at the expense of the Lagos State Government.\nCSP Rasak Oseni, Homicide Section, represented the Nigeria Police Force, Lagos State Command.\nDSP Olusegun Bamidele, Homicide Section, also represented the Nigeria Police Force, Lagos State CommandXiv."
  },
  {
    "headline": "APC Convention: Aggrieved Members Take Buni-Led Committee To Court",
    "summarized_story": "Some aggrieved members of the All Progressive Congress (APC) have taken the Gov.\nBuni led Caretaker- and Extraordinary Convention Planning Committee before a Federal High Court in Abuja, over plans to hold a national convention in February.\nJoined as defendants in the suit are the APC, the Chairman, All Progressives Congress’ Caretaker/Extraordinary Convention Planning Committee and the Independent National Electoral Commission (INEC).\nThey raised five questions for the court to determine and also sought eight declarative reliefs.\nAlso included in reliefs asked for, is an order of the court directing the 1st and 2nd defendant to first conduct state congresses in Anambra state and Zamfara state before national convention of the 1st defendant (APC) can be scheduled and conducted."
  },
  {
    "headline": "Omicron Is Not ‘Mild’, Kills People Like Other Variants – WHO",
    "summarized_story": "The Omicron variant of Covid-19 is killing people across the globe and should not be dismissed as mild, the World Health Organization insisted Thursday.\n“While Omicron does appear to be less severe compared to Delta, especially in those vaccinated, it does not mean it should be categorised as mild,” Tedros told a press conference.\n“Just like previous variants, Omicron is hospitalising people and it is killing people,” he explained.\nIn facing the more transmissible Omicron variant, Van Kerkhove urged people to step up the measures they were already taking to protect themselves against the virus.\n[READ ALSO] COVID-19: Election Rallies Cancelled As India Sees Omicron Surge“Do everything that we have been advising better, more comprehensively, more purposefully,” she said."
  },
  {
    "headline": "PDP Agrees To Re-Zone Presidency To The North, Says Fmr Niger Gov",
    "summarized_story": "Former Governor of Niger State, Dr Babangida Aliyu has said that the People’s Democratic Party (PDP) has agreed to re-zone the presidency to the northern region despite its agreement that any candidate can contest the election.\nDr Babangida Aliyu disclosed this on Friday when the Atiku Support Organisation visited him in Minna, adding that he is confident of the success of the group.\nHe also assured them of his support.\nHe added that the group has done wonderfully well by going round nooks and crannies of the country to ensure that former Vice President Atiku Abubakar emerges as the party flag bearer and is elected President of Nigeria come 2023.\nThe National Coordinator of the group, Dr Victor Moses, thanked the former governor for his continued support for Atiku Abubakar even as 2023 approaches."
  },
  {
    "headline": "NLC Rejects FG’s Plan To Increase Tax On Carbonated Drinks",
    "summarized_story": "The Nigeria Labour Congress (NLC) is rejecting plans by the Federal Government to increase taxes on non-alcoholic and carbonated drinks.\nThe NLC, therefore, asked the National Assembly to urgently amend the sections of the Finance Act which re-introduced excise duties on non-alcoholic and carbonated drinks.\nSome of the provisions of the Finance Act includes the imposition of excise duties on locally produced non-alcoholic, carbonated, and sugary drinks.\nA similar situation is playing out with the soft drinks manufacturing sub-sector.\nThe truth of the matter is that an additional increase in the retail price of carbonated drinks would put more Nigerians at risk of serious health challenges as many people would resort to consuming sub-standard and unhygienic drinks as substitutes for carbonated drinks."
  },
  {
    "headline": "Gov Bello commends local contractor 'Alhaji Friday' for excellent work -",
    "summarized_story": "Kogi State governor, Yahaya Bello, has commended a local contractor, popularly known as Alhaji Friday, for his outstanding performance in the handling of a project in the state.\nThe governor who gave the commendation after inspecting the multibillion naira Civic centre project, said he is impressed by his performance.\nIn his words, ” I have heard enough about this project, so I decided to come and see for myself, I couldn’t believe what I am seeing.\n“This is a definition of “follow who know road make you no enter portor-portor.\n“This is Alhaji Friday, Alhaji Friday the man that is making things happen, he is a Kogiet, he did this job, look around, this is not Julius Berger’s work, it is the hand work of this young man,” Gov Bello’s remarked."
  },
  {
    "headline": "We are not involved in war of words over insecurity",
    "summarized_story": "The All Progressive Congress APC loyal to Senator Kabiru Marafa in Zamfara state has distance self from the recent allegation by the Matawalle’s led Faction of the party that some members of the PDP owns over seventy percent of all mining sites in the state“We seek to be counted out of this madness” The Marafa’s Faction saidA press statement signed by the spokesperson of Senator Marafas-led faction Bello Bakyasuwa Maradun under the Chairmanship of Sirajo Garba Maikatako condemns the allegation and consider it baseless, careless and irresponsible“Our understanding of the formation and character of the three factions of APC in the state vis-a-vis the contents of the briefing from which the reports were developed point to the action as a product of the crafty government faction that depends on blackmail, propaganda and witch-hunt to survive” he added“We are obliged by statements like this to call on the media to do well by indicating clearly the faction of APC from where they sourced the content of their publications”Zamfara State now has three factions of APC namely Former Governor Yari-led faction, Senator Marafa-led faction and that of Governor Bello Matawalle-led factionThis is due to the internal Crisis rocking the party since the build up of the 2919 General Elections“Unless the dispute is settled by competent court of law or acceptable consensus, we want to appeal to the professional standing of the media to properly label reports with their relevant factions to avoid misguided attributions” Bakyasuwa urges the mediaThe Marafa’s Faction also appeal to Governor Bello Matawalle, to minimize his local and international trips and avail self in the state to focus on supervising the various operations of the Nigerian Military against the bandits.\n“We are particularly worried that while these operations were going on, the Governor was outside the country attending the traditional wrestling events in Niger Republic.\nThese and the abysmal absence of developmental projects in the state are not in tendem with the principles and ideals of APC that we know as founding members”"
  },
  {
    "headline": "Buhari receives briefing from ex-President Jonathan over Mali crisis -",
    "summarized_story": "Former President Goodluck Jonathan has disclosed that a special meeting of ECOWAS will hold in Ghana, this Sunday, to deliberate on the political situation in Mali.\nHe made this known at a parley at State House, Abuja, Thursday when he met President Muhammadu as the Head of the ECOWAS Mediation Team.\nPresident Buhari repeated his earlier avowal that whatever Nigeria would do on the Mali situation would be done within the ambit of ECOWAS."
  },
  {
    "headline": "Ladoja breaks silence, says Lekan Balogun is next in line to Olubadan -",
    "summarized_story": "The Osi Olubadan of Ibadanland and former governor of Oyo State, Rashidi Ladoja, has described the controversy trailing succession to the throne of Olubadan is needless.\nEgbon Lekan Balogun is the most senior in our line and so he is the next in line to the throne.\n“For those asking, my ‘body and mouth language’ is that Egbon Lekan is my senior and he is next in line to the Olubadan stool.\nTwo weeks after we started the case, Egbon Balogun said he was no longer interested in the case.\nLadoja is the second most senior chief in the Civil Line that is to produce the next Olubadan of Ibadan, following the death of Oba Saliu Adetunji."
  },
  {
    "headline": "Citi to Terminate Unvaccinated Employees from January 14",
    "summarized_story": "Citigroup Inc on Friday told its staff that it would terminate employees who are unvaccinated as of Jan. 14, enforcing a policy previously announced last year, according to a source familiar with the matter.\nCitigroup said in October it would require U.S. employees to be vaccinated against COVID-19 as a condition of their employment.\nThe bank said at the time it was complying with the Biden administration policy requiring all workers supporting government contracts to be fully vaccinated, as the government remains a “large and important” client of Citi, said Sara Wechter, head of human resources, in a LinkedIn post.\nBloomberg first reported the bank’s Jan. 14 deadline on Friday."
  },
  {
    "headline": "Iconic Black Actor Sidney Poitier Dies Aged 94",
    "summarized_story": "Sidney Poitier, who has died aged 94, once turned down the role of Othello because he did not want to be typecast as a black actor.\nAs the first black winner of the Academy Awards’ Best Actor statuette, he was always aware of being the standard-bearer for greater racial integration.\nFive years later he was awarded an Oscar for Lilies of the Field, the first black winner of the Best Actor trophy.\n“I was a pretty good actor and I believed in brotherhood.\nPoitier became the first black actor to receive a life achievement award from the American Film Institute in 1992."
  },
  {
    "headline": "Kazakh President Gives Shoot-to-Kill Order to Quell Protests",
    "summarized_story": "Dozens have died and public buildings across Kazakhstan have been ransacked and torched in the worst violence in its 30 years ofindependence.\nPresident Kassym-Jomart Tokayev said foreign-trained terrorists were responsible for the unrest.\nDemonstrations that began as a response to a fuel price hike have swelled into a broad movement against the government and ex-leader Nursultan Nazarbayev, 81, the longest-serving ruler of any former Soviet state.\nOn Friday, fresh gunfire could be heard near the main square in Almaty, where troops had fought protesters throughout Thursday.\nState television said President Xi Jinping had told him Beijing opposed any use of force to destabilise Kazakhstan."
  },
  {
    "headline": "Buhari Says He Has Done His Best For Nigeria And Not Expecting Appreciation – Trending With Ojy Okpe",
    "summarized_story": "The President also stated that he is not expecting any appreciation from Nigerians; but hopes that when his administration ends in 2023, Nigerians will recognise that he has served to the best of his abilities.\nSamuel Ortom, governor of Benue State, on Thursday; asked President Muhammadu Buhari to declare the Miyetti Allah Cattle Breeders Association; otherwise known as MACBAN, a terrorist organisation.\nThe Governor’s call is coming after the federal government gazetted an order designating bandits as terrorists.\nOrtorm stated, that the security challenges in the nation will only be adequately addressed, if a similar position is taken on the Miyetti Allah Kautal Hore…MACBAN, and the Fulani Nationality Movement otherwise known as FUNAM.\nThe Governor claims, that these groups have vowed; and have continued to cause mayhem in Benue State and other parts of the country because of the anti-grazing laws."
  },
  {
    "headline": "George Obiozor: IPOB Doesn’t Speak for Igbos",
    "summarized_story": "Professor George Obiozor discussed the president’s unyielding opposition to restructuring and how Nigerians can remedy this by choosing a successor in 2023 that is more in tune with the yearnings of the people.\nHe also spoke on the chances of an igbo presidency"
  }
]