[
  {
    "headline": "Port Harcourt stampede: King, Queen of Spain condole with Buhari",
    "summarized_story": "Following the tragic stampede in Port Harcourt, Rivers State, on Saturday, where many people died, King Felipe and Queen Letizia of Spain, sent their condolences to the President, Major General Muhammadu Buhari (retd.\nSaturday PUNCH reported that the Rivers State Police Command confirmed 31 persons dead during a stampede at the venue of an outreach programme put together by a church in Port Harcourt on Saturday morning.\nThough located in the GRA of Port Harcourt, the Church held the event at the Port Harcourt Polo Club, a bigger facility to accommodate the anticipated crowd.\n‘‘The Queen joins me in sending, through you, all our support and solidarity to the families of the deceased and best wishes for a speedy recovery for the injured.\n‘‘Receive, Mr President, the testimony of my highest consideration and esteem together with an affectionate greeting for the beloved people of Nigeria.’’Copyright PUNCH."
  },
  {
    "headline": "JUST IN: Buhari meets APC govs ahead of presidential primary",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.)\nis currently meeting with Governors of the All Progressive Congress governors in the Presidential Villa, Abuja.\nAll members of the Progressive Governors Forum are in attendance except Nasir El-Rufai of Kaduna who is being represented by his deputy, Hadiza Balarabe.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "2023: Inaugurate NDDC Board, save APC in Niger Delta — Party members tell Buhari",
    "summarized_story": "“This, Mr. President, is the minimum your government and the APC can do to win back the trust of the Niger Delta people.\n“As Niger Deltans and committed members of the APC we write to express our disappointment with how the Niger Delta has been treated by our APC government since 2019 when Senator Godswill Akpabio was appointed as Minister of Niger Delta Affairs.\nChief Akpabio’s actions have indeed imperilled our party in the Niger Delta States.\n“All the members of the Board listed above are on part time basis as clearly stated in Section 2(3) of the NDDC Act.\nThis has given rise to tension in the Niger Delta region."
  },
  {
    "headline": "2023: Clerics advocate election of credible, experienced leaders",
    "summarized_story": "By Musa Na Annabi SokotoSome clerics in Sokoto State have called on Nigerians to consider credibility and experience in the forthcoming 2023 general elections.\nA cross section of them told our correspondent on Sunday, in Sokoto that it was necessary for the nation to have credible, pious and committed leaders.\n”Nigeria needs a very good leader with experience, good political will, someone that means well for the country, not someone that will steal public funds.\n“Nigerians need to chose a credible candidate, if political parties fail to chose credible candidates from the primaries, for the masses to make their choices during the general elections in 2023.\nBello-Gado, a Deputy Imam of Gagi community, urged Nigerians to vote with their conscience and steer clear from money politics."
  },
  {
    "headline": "152 dead Ukrainian fighters discovered at Azovstal — Moscow",
    "summarized_story": "Russian military on Tuesday said it has found the bodies of 152 Ukrainian fighters in the underground bunkers of the Azovstal steelworks in Mariupol it captured earlier this month after a protracted siege.\nRussian Defence Ministry spokesman Igor Konashenkov in Moscow said “152 bodies of fallen fighters and soldiers of the Ukrainian armed forces were stored in a container with no longer functioning refrigeration.’’He added that Russian authorities had yet to receive any request to transfer the dead from the Ukrainian leadership.\nKonashenkov said that mines had been discovered underneath the bodies, claiming that the Ukrainian side had probably intended to blow up the container in order to frame Russia for the deaths.\n(dpa/NAN)Vanguard News"
  },
  {
    "headline": "NHGSFP: How FG encourages school enrollment with feeding of 10m children",
    "summarized_story": "The National Home Grown School Feeding Programme (NHGSFP) is one of the National Social Investment Programmes (NSIP) initiated by the President Muhammadu Buhari administration in 2016.\nShe said: “We were feeding school children with N70 per child, per meal.\nSpeaking with our reporter, a primary three pupil of the LEA Primary School, Utako, Abuja, Musa Bello, said the school feeding programme has encouraged him to come to school on a daily basis.\nSo, with the school feeding taking place, the farmers produce more food, traders sell more, women also benefit from it.\n“We at the WFP are here to help the government of Nigeria to achieve its objectives for the school feeding programme."
  },
  {
    "headline": "Interpol arrests 3 Nigerians for online scam",
    "summarized_story": "Soni Daniel, AbujaAn INTERPOL-led operation targeting malware cyber fraud across Southeast Asia has resulted in the arrest of three Nigerians suspected of engaging in global scamming.\nThe Nigerian sting operation comes as part of a global operation codenamed “Killer Bee” involving INTERPOL National Central Bureaus (NCBs) and law enforcement in 11 countries across Southeast Asia.\nOne of the scammers, Hendrix Omorume has been charged with three counts of serious financial fraud and has been convicted and sentenced to one year imprisonment.\n“Further arrests and prosecutions are foreseen across the world as intelligence continues to come in and investigations unfold,” added Mr Jones.\nOperation Killer Bee is led by the ASEAN Cybercrime Operations Desk, which is funded by the Japan-ASEAN Integration Fund (JAIF) 2.0 and supported by the Singapore Government."
  },
  {
    "headline": "Buhari to leave for Spain on state visit",
    "summarized_story": "Despite preparations for the All Progressives Congress (APC) convention slated for June 6, President Muhammadu Buhari is set to travel to Madrid, Spain on a state visit.\nAlthough his meeting with governors from the APC just ended at the State House, with a majority of the governors refusing to speak to reporters on the outcome of the meeting, Buhari is said to be going to Spain to honour an invitation from the Spanish President, Pedro Sanchez.\nDuring the state visit, Buhari will discuss issues of mutual interest to both countries, which will also culminate in the signing of Agreements and Memoranda of Understanding on a wide range of topics geared toward further enhancing the bilateral relations between both countries.\nThe meeting would also exploit cooperation on Energy, Trade and Investment, Transportation, Public Health and Sports Development.\nOther members of the delegation are the National Security Adviser, Maj-Gen Babagana Monguno (rtd); Director-General, National Intelligence Agency (NIA), Amb."
  },
  {
    "headline": "War: Russia reveals bodies of 152 Ukrainian fighters discovered at Azovstal",
    "summarized_story": "The Russian military on Tuesday said it has found the bodies of 152 Ukrainian fighters in the underground bunkers of the Azovstal steelworks it captured in Mariupol earlier this month after a protracted siege.\nKonashenkov said that mines had been discovered underneath the bodies, claiming that the Ukrainian side had probably intended to blow up the container in order to frame Russia for the deaths.\nRussia and Ukraine have been fighting for close to three months.\nRussian President, Vladimir Putin, had ordered the invasion of Ukraine due to some political differences between both nations.\nAs of today, many casualties have been recorded as a result of the war."
  },
  {
    "headline": "War: Russia speaks on using nuclear weapons in Ukraine",
    "summarized_story": "Russia has assured that tactical nuclear weapons won’t be used in the ongoing war against Ukraine.\nKelin said Russia has a strict code, adding that its military doesn’t use such weapons in conflicts such as the ongoing war with Ukraine.\nHe said Russia would only use nuclear weapons when “the state’s existence is threatened.”“It has nothing to do with the current operation,” Kelin said.\nHe also described allegations of war crimes in the Ukrainian town of Bucha as “a fabrication” while calling UK Foreign Secretary Liz Truss “very belligerent” and inexperienced.\nBut since then nuclear weapons haven’t been used against Ukraine even as Putin tries to gain total control of the Donbas region of Ukraine."
  },
  {
    "headline": "Court grants Okorocha N500m bail",
    "summarized_story": "Justice Inyang Ekwo of the Federal High Court had imposed stringent bail conditions on Okorocha who is standing trial in an alleged N2.9 billion corruption charge.\nIn the case of Nyerere, the court ordered that he should continue on the administrative bail granted him by EFCC, for exhibiting good conduct while on bail.\nThe judge however said that the circumstances and conduct of Okorocha would not make the court extend the same customary bail condition to him.\nJustice Ekwo held that although bail is at the discretion of the court, the “circumstances and conduct of the first defendant (Okorocha) will not make the court to admit him to customary bail conditions”.\nJustice Ekwo finally ordered that Okorocha should remain in the custody of the EFCC until the bail conditions are met."
  },
  {
    "headline": "Don’t accept Wike’s satanic, deceptive financial bribe – IPOB warns Imo communities against ceding",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has warned the people of Ohaji Local Government Area of Imo State against ceding their land to Governor Nyesom Wike of Rivers State.\nIPOB cautioned the people of Ohaji against accepting Wike’s alleged satanic and deceptive financial inducement.\nEmma Powerful, the spokesman of IPOB, issued the warning in reaction to an alleged illegal and undocumented ceding of communities in Ohaji Local Government Area to Wike.\nPowerful warned that ceding their communities to Wike would affect their children’s future; hence such a deceptive move should be rejected.\nWike’s deceptive offer would harm them and their children in the future as such may not be sustainable by successive governments."
  },
  {
    "headline": "INTERPOL, EFCC arrest three ‘global scammers’ in Lagos, Benin",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested three suspected global scammers in an INTERPOL-led operation targeting malware cyber fraud across Southeast Asia.\nThe trio was nabbed in a sting operation conducted simultaneously in Ajegunle, Lagos State and Benin City, Edo State.\nThe operation was part of a global operation codenamed “Killer Bee” involving INTERPOL National Central Bureaus (NCBs) and law enforcement in 11 countries across Southeast Asia.\nOperation Killer Bee is led by the ASEAN Cybercrime Operations Desk, which is funded by the Japan-ASEAN Integration Fund (JAIF) 2.0 and supported by the Singapore Government.\nOne of the scammers, Hendrix Omorume was charged with three counts of serious financial fraud and has been convicted and sentenced to one year imprisonment."
  },
  {
    "headline": "UPDATED: Court grants Okorocha N500m bail",
    "summarized_story": "A Federal High Court in Abuja has granted bail at N500million to ex-Imo Governor Senator Rochas Okorocha.\nJustice Inyang Ekwo, in a ruling on Tuesday, rejected the objection of the Economic and Financial Crimes Commission (EFCC) to Okorocha’s bail application.\nThe judge also granted bail to Okorocha’s co-defendant, Anyim Nyerere Chinenye on the conditions attached to the administrative bail earlier granted him by the EFCC.\nWhile arguing his client’s bail application, Okorocha’s lawyer, Solomon Umoh, (SAN) urges the court to grant bail to the ex-governor on liberal terms.\nUgwu said: “On two consecutive occasions, the 1st defendant (Okorocha) frustrated his arraignment by refusing to appear in court."
  },
  {
    "headline": "NMA urges NCDC to step up fight against Monkeypox",
    "summarized_story": "The Nigerian Medical Association (NMA) has urged the Nigeria Centre for Disease Control (NCDC) to step-up its efforts in educating and protecting Nigerians from the increasing cases of the ravaging Monkeypox disease.\nRecall that yesterday the NCDC announced that the country has recorded 21 confirmed cases of the Monkeypox disease in the last five (5) months, with one death.\n“They need to start giving us data on this Monkeypox as it happens across the country.\nWe need to start directing our calls to the appropriate institution, which is the NCDC.\n“The Nigeria Centre for Disease Control needs to understand that it is not only COVID-19; it is important."
  },
  {
    "headline": "BREAKING: Buhari meets APC Governors, Chair over presidential primary",
    "summarized_story": "President Muhammadu Buhari is meeting with members of the Progressive Governors Forum (PGF) at the Presidential Villa, Abuja.\nThe meeting, slated for noon, has all members of the PGF represented.\nThe Governors, who were elected under the platform of the ruling All Progressives Congress (APC), are considered to be critical to the presidential primary slated for June 6.\nChairman of the PGF and Governor of Kebbi, Atiku Bagudu Abubakar, is leading the APC Governors to the meeting.\nThe Nation gathered Buhari will use the opportunity of the meeting to discuss the forthcoming presidential primary of the party and the need to have a united position with the Governors."
  },
  {
    "headline": "National Convention: Buhari meets APC governors, Party Chair in Villa",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Road to 2023: Atiku’s emergence unsettles APC",
    "summarized_story": "“The question is who in the APC South can match Atiku considering the voting demographics of North and South.\nLet the Atiku and another APC candidate from the North battle for votes in that region.”Premature Ejaculation & \"Small Joystick\" Resolved in 7Days... Click Here For Details .\nOne of the issues that have dominated the permutation over how the APC presidential candidate will emerge is that President Buhari would anoint one of the aspirants as a consensus candidate.\nFormer APC National Publicity Secretary (NPS), Yekini Nabena, who claimed that with Atiku, the ruling party is at a vantage position to retain power at the centre beyond 2023 boasted APC has the former vice president’s password.\nAPC has the password on how to defeat Atiku and the 2023 presidential election will not be an exception."
  },
  {
    "headline": "APC screens Tinubu, Amaechi, Umahi, 9 others",
    "summarized_story": "Others are Pastor Tunde Bakare, Cross River State Governor, Prof. Ben Ayade; Ebonyi State Governor, Gov.\nDave Umahi; Ekiti State Governor, Dr. Kayode Fayemi; Minister of State for Education, Hon.\nEmeka Nwajiuba; former Senate President, Sen. Ken Nnamani; Kogi State Governor, Yahaya Bello; Jigawa governor, Mohammed Badaru Abubakar; and former Zamfara State governor, Sen. Ahmed Yerima.\nAsiwaju Tinubu who arrived the venue of the screening exercise by 5.45pm was given a rousing heroic welcome by his supporters led by James Faleke.\nOn his readiness to step down, Pastor Bakare, said: “The party supremacy is the utmost essence."
  },
  {
    "headline": "Abducted Prelate of Methodist Church, others regain freedom",
    "summarized_story": "Although there were claims that they were freed by their abductors after payment of ransom, it was not clear whether the church paid the N100 million ransom demanded by the kidnappers or part of the ransom to secure their release.\nThe Methodist Prelate was reportedly abducted on Sunday, in Umunneochi Local Government Area of Abia State, along with Rt.\nThe Secretary, Methodist Church of Nigeria Conference, the Rt.\n(Dr.) Michael Akinwale, who confirmed the demand for ransom in a statement, yesterday, appealed to all parishioners to contribute their quota to raise the N100 million ransom.\nThe Christian Association of Nigeria (CAN) had, yesterday, raised the alarm over the increasing number of clerics being kidnapped across the country."
  },
  {
    "headline": "N2.9bn fraud: I’m not guilty –Okorocha",
    "summarized_story": "He was, however, arrested by operatives of the agency, few hours before the ruling APC screened its presidential candidates.\nOkorocha, who was Imo state governor from 2011 to 2019, was accused of diverting funds belonging to the state, to the tune of about N2.9 billion.\nHowever, when the charge was read to Okorocha, he said: “I understand the charge against me, but I am not guilty my lord”.\nIn addition, Amaechi drew attention of the court to the fact that his client was roughly arrested before APC’s screening.\nHowever, EFCC, through its lawyer, Mr. Gbolahan Latona, told the court that Okorocha raised some issues in his bail application that would require its response."
  },
  {
    "headline": "Monkeypox kills one as NCDC activates emergency operations centre",
    "summarized_story": "From Fred Ezeh, Abuja and Chinelo ObogoNigeria Centre for Disease Control and Prevention (NCDC) has activated Emergency Operations Centre (EOC) in response to the spread of Monkeypox.\n“Nigeria’s national surveillance system, the Surveillance Outbreak Response Management and Analysis System was first deployed in response to the 2017 Monkeypox outbreak to improve the timeliness and completeness of case reporting, as well as facilitate the overall response,” he said.\nHowever, airlines and airports are yet to receive any health guidelines or protocols from NCDC over the outbreak of monkeypox.\nYou would require a COVID test before you can come in and you would still need to require a day one and day two test.\nWe are hoping that the Federal Government does something about the COVID protocol."
  },
  {
    "headline": "Fuel Subsidy May Hit N6trn in 2022, IMF Warns Nigeria",
    "summarized_story": "IMF’s Resident Representative for Nigeria, Mr. Ari Aisen made these disclosures while presenting the latest Sub-Saharan Africa Regional Economic Outlook, in Abuja.\nHe also revealed that Nigeria received a total of $6.8 billion facilities from the IMF following the outbreak of the COVID-19 pandemic in 2020.\nWith N500 billion monthly fuel subsidy payouts, he noted that the country might end up with a record N6 trillion subsidy at by year-end.\nHowever, he raised optimism that the Dangote Refinery would reduce fuel importation when completed, thereby cutting down the subsidy burden.\n“The war in Europe is hunger in Sub-Saharan Africa and Africa."
  },
  {
    "headline": "Southern PDP Governors Ganged Up against Me, Wike Alleges",
    "summarized_story": "Wike spoke in Port Harcourt, in his first public comments on the PDP presidential convention at the weekend in Abuja, where he lost the presidential ticket to former Vice President Atiku Abubakar.\nHe said he told the PDP presidential candidate, Atiku, that many of the people around him had no electoral value to deliver their states, but vowed to deliver PDP in 2023.\nHe added that it was the agreement by the southern governors that the presidency should come to the south that motivated his presidential aspiration.\n“Some of them, their in-laws are governors in the ruling party, but they want to interfere in what happens in PDP.\nNwoko, in a press statement, said the former vice president earned the victory."
  },
  {
    "headline": "APC Screens Tinubu, Amosun, Amaechi, Badaru, Nwajuiba, Six Others",
    "summarized_story": "The inauguration of the seven-man screening committee, chaired by former National Chairman of APC, Chief John Oyegun, took place at Transcorp Hilton, Abuja, with journalists barred from covering the event and the screening.\nThose screened yesterday included former Lagos State governor, Bola Tinubu; former governor of Ogun State, Ibikunle Amosun; former Minister of Transportation, Chibuike Amaechi; Jigawa State Governor Abubakar Badaru; and former Minister of State for Education, Chukwuemeka Nwajiuba.\nOthers also screened were Ebonyi State Governor Dave Umahi, Felix Nicholas, Senator Ajayi Borroffice, former Senate President Ken Nnamani, Mrs. Uju Ken-Ohaneye, and former Governor of Zamfara State, Sani Yerima.\nHe was screened at 8:20 pm, while Sanwo-Olu left at the time the committee was about to screen Tinubu.\nTinubu left Transcorp at 8:56pm but refused to grant interview to journalists, who had laid siege to him."
  },
  {
    "headline": "Breaking: Methodist Prelate, Others Regain Freedom",
    "summarized_story": "Emmanuel Ugwu-NwogoThe Prelate of the Methodist Church Nigeria, His Eminence Samuel Kanu Uche, has been set free along with two other clerics and his driver who were abducted on Sunday.\nNews of their release filtered in Monday night just as the Church leadership was already mobilising members to raise N100 million ransom demanded by the kidnappers.\nIt is also not clear if the ransom was eventually raised and paid.\n“All I can confirm to you now is that they have all been released,” he said.\nAaron Akabuokwu, also confirmed the release of the head of the Methodist Church in Nigeria."
  },
  {
    "headline": "Breaking: Kidnappers of Methodist Prelate Demand N100m Ransom, Church Seeks Donations from Members",
    "summarized_story": "Emmanuel Ugwu-Nwogo in UmuahiaBarely 24 hours after abducting the Prelate of Methodist Church, His Eminence, Samuel Kanu-Uche, and two other clerics, the gunmen have demanded a sum N100 million as ransom.\nMichael Akinwale confirmed the demand in a statement issued to newsmen on Monday.\nHe appealed to all parishioners to rise up and help in raising the N100million ransom.\n“This is a period of trial in which the Church must cry out that ‘The Lord that answereth by Fire’ must be our God to destroy all the manipulations of the adversary.\n“As we engage in Prayer Warfare, this serves to notify you that the abductors have demanded a ransom of N100m."
  },
  {
    "headline": "BREAKING: APC Member Petitions Presidential Screening Committee, Seeks Disqualification Of Tinubu Over Alleged Age Falsification, Chicago University Certificate Scandal",
    "summarized_story": "A member of the ruling All Progressives Congress (APC), Sagir Mai Iyali has asked the party’s presidential screening committee to disqualify one of the aspirants, Bola Ahmed Tinubu over alleged certificate forgery.\nHe had indicated he graduated from the University of Chicago in his INEC form 001 filled when he contested the Lagos State governorship poll in 1999.\nThe former governor also claimed in the affidavit he attached to the INEC form that he lost his university degree certificate while he was in exile between 1994 and 1998.\nIn a petition sent to John Odigie Oyegun, chairman of the presidential screening committee of the APC, Iyali said Tinubu never graduated from the University of Chicago.\nThe APC member further asked that the former Lagos governor shouldn’t be allowed to participate in the June 7 primary of the party."
  },
  {
    "headline": "BREAKING: APC Member Petitions Presidential Screening Committee, Seeks Disqualification Of Tinubu Over Alleged Age Falsification, Chicago University Certificate Scandal",
    "summarized_story": "A member of the ruling All Progressives Congress (APC), Sagir Mai Iyali has asked the party’s presidential screening committee to disqualify one of the aspirants, Bola Ahmed Tinubu over alleged certificate forgery.\nHe had indicated he graduated from the University of Chicago in his INEC form 001 filled when he contested the Lagos State governorship poll in 1999.\nThe former governor also claimed in the affidavit he attached to the INEC form that he lost his university degree certificate while he was in exile between 1994 and 1998.\nIn a petition sent to John Odigie Oyegun, chairman of the presidential screening committee of the APC, Iyali said Tinubu never graduated from the University of Chicago.\nThe APC member further asked that the former Lagos governor shouldn’t be allowed to participate in the June 7 primary of the party."
  },
  {
    "headline": "BREAKING: Peter Obi Emerges Labour Party Presidential Candidate After Pat Utomi’s Endorsement",
    "summarized_story": "A former Anambra governor, Peter Obi, has picked the presidential ticket of the Labour Party.\nSaharaReporters however learnt that Utomi was instrumental in Obi joining the Labour Party from the PDP.\n“Prof Utomi brought Peter Obi to Labour Party in the first place and he has now endorsed him,” a source had told SaharaReporters on Monday.\nObi left the Peoples Democratic Party (PDP) last week, blaming recent developments in the party for his defection.\nConsequently, I am by this letter informing you of my withdrawal for (sic) the PDP Presidential Primaries."
  },
  {
    "headline": "BREAKING: Peter Obi Emerges Labour Party Presidential Candidate After Pat Utomi’s Endorsement",
    "summarized_story": "A former Anambra governor, Peter Obi, has picked the presidential ticket of the Labour Party.\nSaharaReporters however learnt that Utomi was instrumental in Obi joining the Labour Party from the PDP.\n“Prof Utomi brought Peter Obi to Labour Party in the first place and he has now endorsed him,” a source had told SaharaReporters on Monday.\nObi left the Peoples Democratic Party (PDP) last week, blaming recent developments in the party for his defection.\nConsequently, I am by this letter informing you of my withdrawal for (sic) the PDP Presidential Primaries."
  },
  {
    "headline": "BREAKING: Peter Obi Emerges Labour Party Presidential Candidate After Pat Utomi’s Endorsement",
    "summarized_story": "A former Anambra governor, Peter Obi, has picked the presidential ticket of the Labour Party.\nSaharaReporters however learnt that Utomi was instrumental in Obi joining the Labour Party from the PDP.\n“Prof Utomi brought Peter Obi to Labour Party in the first place and he has now endorsed him,” a source had told SaharaReporters on Monday.\nObi left the Peoples Democratic Party (PDP) last week, blaming recent developments in the party for his defection.\nConsequently, I am by this letter informing you of my withdrawal for (sic) the PDP Presidential Primaries."
  },
  {
    "headline": "BREAKING: Buhari meets APC governors ahead of presidential primary poll",
    "summarized_story": "President Muhammadu Buhari is currently meeting with all the governors elected on the platform of the All Progressives Congress (APC).\nThe meeting is being held at the council chambers in the presidential villa.\nThe meeting comes less than a week to the special convention to elect a standard-bearer of the ruling party ahead of the 2023 polls.\nThe convention will be held between June 6 and 8.\nAdvertisementAbdullahi Adamu, APC national chairman; Boss Mustapha, secretary to the government of the federation (SGF); and Ibrahim Gambari, chief of staff to the president, are present at the meeting."
  },
  {
    "headline": "BREAKING: Buhari meets APC governors ahead of presidential primary poll",
    "summarized_story": "President Muhammadu Buhari is currently meeting with all the governors elected on the platform of the All Progressives Congress (APC).\nThe meeting is being held at the council chambers in the presidential villa.\nThe meeting comes less than a week to the special convention to elect a standard-bearer of the ruling party ahead of the 2023 polls.\nThe convention will be held between June 6 and 8.\nAdvertisementAbdullahi Adamu, APC national chairman; Boss Mustapha, secretary to the government of the federation (SGF); and Ibrahim Gambari, chief of staff to the president, are present at the meeting."
  },
  {
    "headline": "Zulum, Fintiri, Gbaja -- APC, PDP candidates who got 2023 tickets unchallenged",
    "summarized_story": "ZULUM CLINCHES BORNO APC TICKETBabagana Zulum of Borno also won unopposed at the APC governorship primary in the state.\nIBRAHIM KASSIM SECURES BAUCHI PDP TICKETIbrahim Kassim, former secretary to the Bauchi state government, secured the PDP governorship ticket unopposed.\nAHMADU FINTIRI FOR ADAMAWA PDPAhmadu Fintiri, governor of Adamawa, secured the state’s PDP ticket unopposed for the 2023 elections.\nFEMI GBAJABIAMILA WINS APC TICKET AGAINGbajabiamila, speaker of the house of representatives, won the APC ticket for the sixth term.\nAHMAD KAITA PICKS KATSINA PDP TICKETAhmad Kaita, senator representing Katsina north, picked the PDP ticket unchallenged."
  },
  {
    "headline": "Zulum, Fintiri, Gbaja -- APC, PDP candidates who got 2023 tickets unchallenged",
    "summarized_story": "ZULUM CLINCHES BORNO APC TICKETBabagana Zulum of Borno also won unopposed at the APC governorship primary in the state.\nIBRAHIM KASSIM SECURES BAUCHI PDP TICKETIbrahim Kassim, former secretary to the Bauchi state government, secured the PDP governorship ticket unopposed.\nAHMADU FINTIRI FOR ADAMAWA PDPAhmadu Fintiri, governor of Adamawa, secured the state’s PDP ticket unopposed for the 2023 elections.\nFEMI GBAJABIAMILA WINS APC TICKET AGAINGbajabiamila, speaker of the house of representatives, won the APC ticket for the sixth term.\nAHMAD KAITA PICKS KATSINA PDP TICKETAhmad Kaita, senator representing Katsina north, picked the PDP ticket unchallenged."
  },
  {
    "headline": "'N2.9bn fraud': Court grants Okorocha N500m bail",
    "summarized_story": "A federal high court in Abuja has granted bail to Rochas Okorocha, former Imo state governor.\nOkorocha was arraigned alongside Anyim Chinenye, a chieftain of the All Progressives (APC) and five companies — Naphtali International Limited, Perfect Finish Multi Projects Limited, Consolid Projects Consulting Limited, Pramif International Limited, and Legend World Concepts Limited.\nAdvertisementAt the court session on Tuesday, Solomon Umoh, who moved Okorocha’s bail application, prayed the court to grant his client bail on liberal terms.\nEkwo ordered that Okorocha’s surety must be a responsible citizen with a landed property in the like sum of the bail granted.\nAdvertisementSimilarly, he ordered the court registry to inform the Nigerian Immigration Service that Okorocha’s international passport was in its custody."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Stax is making progress with solving USSD's user experience problem",
    "summarized_story": "Stax claimed to possess a deep understanding of USSD’s continued importance in African markets and users’ needs for a smooth and simple mobile banking experience.\nIn a Worldwide Mobile Data Pricing 2021 report from Cable.co.uk, sub-Saharan Africa ranked as the most expensive region, with the average price for 1GB of mobile data coming in at $6.44, followed by Oceania at $5.51 and South America at $5.25.\nThe directory also has a built-in searchable index of USSD services globally to reduce the friction between USSD and users across Africa.\nStax, Lyon said, has been eyeing the success of True Balance and taking notes.\nStax currently supports more than 100 bank and mobile money services across 9 markets."
  },
  {
    "headline": "Elon Musk’s Starlink receives approval to provide internet service in Nigeria and Mozambique",
    "summarized_story": "On Friday, Tesla CEO Elon Musk announced on Twitter that Starlink, the satellite internet service launched by SpaceX, his space exploration company, has been approved in Nigeria and Mozambique.\nThis licensing follows a visit to Nigeria by the company’s team in May last year to discuss the possibility of obtaining a licence.\n“The company received two licenses, which include the International Gateway license and Internet Service Provider (ISP) license, and will be trading as Starlink Internet Services Nigeria Ltd.\nStarlink approved by Nigeria 🇳🇬 & Mozambique 🇲🇿https://t.co/Q1VvqVmJ2i — Elon Musk (@elonmusk) May 27, 2022Starlink is a low latency broadband internet system created to meet the needs of consumers in rural areas with low internet penetration across the globe.\nStarlink enters a Nigerian Internet service provider space that is dominated by telcos like MTN and Airtel, as well as individual ISPs such as Spectranet, SMILE and others."
  },
  {
    "headline": "How Joram Mwinamo has helped Kenyans make sense of their businesses since 2007",
    "summarized_story": "Interestingly, this article is about Joram Mwinamo, someone who is actively participating in the evolution of tech businesses in Kenya and has been part of the entrepreneurship ecosystem since 2007.\nAnd in 2020, Joram co-founded SNDBX, an entrepreneur support hub — an upgrade from WYLDE.\nBeing ambitious, he needed to create something that would help similarly ambitious entrepreneurs avoid mistakes while building and scaling their businesses.\nA quick reminder that even before SNDBX, Joram was always all about entrepreneurship and innovation.\nUnsurprisingly, stories about how he has helped different businesses steer themselves towards success are at the top of Joram’s success list."
  },
  {
    "headline": "Double the funding?",
    "summarized_story": "Share this article:Assalam u Alaikum,Last weekend, the African National Congress (ANC) — South Africa’s ruling political party — said it was pushing for changes to South African television regulations, including the free broadcast of key sports.\nThe party believes that matches involving national teams like the Springboks — South Africa’s Rugby squad — should be made free or at a reduced cost to the South African Broadcasting Corporation (SABC).\nWell, I’ve got two funding news to discuss today:Betastore’s $2.5 million pre-Series AAyoken’s $1.4 million pre-seedBetastore’s $2.5 million pre-Series ABetasore, a Nigerian B2B retail marketplace for informal retailers, announced $2.5 million in pre-Series A funding yesterday, May 30, 2022.\nAyoken’s $1.4 million pre-seedAyoken, an NFT marketplace, announced that it had raised $1.4 million in pre-seed funding to help users grow their revenue streams via digital collectibles.\nAlso, NFT holders will receive additional benefits like access to previously unreleased music and exclusive live events hosted by the creatives."
  },
  {
    "headline": "[PODCAST] Elon Musk’s Starlink in Nigeria",
    "summarized_story": "Share this article:From Starlink’s approval in Nigeria to ANC’s proposed ban on DStv’s exclusive sports broadcasting rights, today’s episode of Techpoint Africa Podcast had us talking about money, the people that have it and those that don’t.\nThe Nigerian Communication Commission (NCC) has licensed Starlink, a satellite Internet constellation service owned by SpaceX, Elon Musk’s space exploration company.\nStarlink is perhaps the fastest satellite Internet provider on the planet, offering Internet speeds of up to 104 megabytes per second because of its over 1,900 satellites orbiting Earth at about 200 to 400 miles away.\nThe African National Congress (ANC), South Africa’s ruling political party, wants to ban the satellite TV service from having exclusive rights to broadcast national sporting events.\nTune in to the Techpoint Africa Podcast to find out."
  },
  {
    "headline": "Vault Hill debuts its NFT marketplace with the public sale of metaverse land",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain-based company, Vault Hill, has launched its NFT marketplace with the public sale of land in its human-centric metaverse, Vault Hill City (VHC).\nAs part of the land sale, a free HTC VIVE Flow VR glasses will be given per parcel of land bought.\nThe VHC land parcels are Non-Fungible Tokens (NFTs) built on the Ethereum blockchain (ERC-721) which are unique and distinct.\nIt is also the first virtual world with urban planning and development benefits to ensure users build on their virtual land respectfully.\nFurther information regarding the land sale can be found here and the metaverse development timeline can be viewed in the whitepaper."
  },
  {
    "headline": "Adaverse Backs Cassava Network With A Seed Investment To Empower African Content Creators",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\n“EMURGO Africa is excited to support the development of Cassava Network’s innovative content rewards ecosystem.\nTo apply for funding at Adaverse, visit www.adaverse.coBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "CRICKET: Edo Boys High School Emerges Champions of Templars Schools Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo Boys High School Cricket team, Benin City on Friday shown class and style in this year’s male final of the Templars Secondary Schools Boys Competition as they defeated the stubbornly Ohonre Grammar School, Benin by 6 wickets.\nThe second innings didn’t take much time as Edo boys high school only had a target of 31 runs to win.\nIt took them just 6.5 overs to surpass the target and emerge champions.\nHowever, the third place match that took place earlier wasn’t short of the thrill and fun as Government Science and Technical College (GSTC) Benin edged out Christlike Secondary School (IDP Camp).\nAs regards the team’s victory, the coach of Edo boys High School, Mr Theophilus Ibodeme Adophus expressed joy over his team’s victory."
  },
  {
    "headline": "Obaseki seeks doctors’ support to rejig Edo health system, tackle brain drain – Nigerian Observer",
    "summarized_story": "He said, “We need more doctors, particularly with the way the doctors are traveling out for greener pastures.\nWhat we need is to strengthen the institutions that produce doctors.\nThe lesson is that we must fix our healthcare system.\n“We have insisted on healthcare reforms.\n“My focus is on how to produce more doctors by strengthening the basic education system and giving quality education to produce more doctors for the state."
  },
  {
    "headline": "Amstel Malta Ultra Refreshes Okpekpe Race Participants – Nigerian Observer",
    "summarized_story": "The premium beverage brand’s sponsorship of the thrilling road race is part of its commitment to initiating quality interactions and inspiring healthier communities through sporting activities in Nigeria.\nDuring the event, Amstel Malta Ultra, presented as the official malt drink of the race, provided much-needed vitality and motivation for scores of athletes from across the Africa continent who competed to earn a share in the N60million cash reward for top performers.\nSince its launch in 2020, Amstel Malta Ultra has achieved acclaimed recognition among consumers as a drink for health-conscious individuals and fitness enthusiasts.\nThe beverage brand’s ‘no added sugar’ feature makes it the choice drink for athletes and people in the sports industry.\nWith its sponsorship of the 8thOkpekpe International 10km Road Race and its previous editions, Amstel Malta Ultra reiterates its commitment to reviving healthy lifestyle activities, uniting Nigerians through sports, and empowering athletes with premium vitality."
  },
  {
    "headline": "UNIBEN Don laments eroding social value … as NAS organises FOB – Nigerian Observer",
    "summarized_story": "lecturer in Mass Communication deptartment, University of Benin (UNIBEN), Dr. Daniel Ekhereafo has said that the social value in Nigeria has completely broken down within the last 12 years.\n“More worrisome is the monetisation of the political system and the use of youths as thugs and agents of distabilisation.\nAnti-Social behaviour, he added creates a life of affluence that I’d unsubtainable.\nWith anti-social behaviour, he said that the society loses the ingredients for repositioning the society for the better.\nTo remedy the situation, he expressed the need to return to the family value system, while value reorientation must form part of the national and sub-national engagement with the youths."
  },
  {
    "headline": "Karim Benzema named UEFA Champions League Player of the Season",
    "summarized_story": "Real Madrid striker, Karim Benzema, has been named the Champions League Player of the 2021/22 Season by UEFA’s Technical Observer panel.\nBenzema not only hit double figures for Champions League goals in a single season for the first time in his career, his final tally of 15 earned him top spot in the competition scoring charts.\nAlthough Benzema did not add to his haul in the final, he now stands joint third with Robert Lewandowski in the all-time European Cup goals table.\n“He gets better every day, like wine,” his coach Carlo Ancelotti explained last month.\n“Every day he becomes an even better leader, and feels more how important he is for the team and for the club."
  },
  {
    "headline": "Buhari meets APC governors ahead of party presidential primary",
    "summarized_story": "President Muhammadu Buhari is currently meeting with governors elected on the platform of the ruling All Progressives Congress (APC).\nThe meeting comes ahead of the party’s presidential primary scheduled for Tuesday and Wednesday next week.\nThe meeting which is being held at the Council Chambers of the State House has in attendance, National Chairman of the Party, Abdullahi Adamu, Secretary to the Government of the Federation, Boss Mustapha and Chief of Staff of the President, Ibrahim Gambari.\nAll members of the Progressive Governors Forum are in attendance except Nasir El-Rufai of Kaduna who is being represented by his deputy, Hadiza Balarabe."
  },
  {
    "headline": "Oil price hits $123.7 per barrel amid EU ban on 90% Russian oil imports",
    "summarized_story": "Oil prices on Tuesday rose significantly after the European Commission (EU) countries agreed to ban 90 percent of Russian oil imports by end of 2022.\nOn Monday, the EU announced its agreement to ban 90 percent of Russian oil imports by the end of the year as part of sanctions against Moscow for invading Ukraine.\nHowever, on Monday, Charles Michel, president of the European Council, said the move would immediately halt 75 percent of Russian oil imports.\n“The sanctions will immediately impact 75 percent of Russian oil imports.\n“We have covered overall 90 percent of Russian oil being winded down during this time frame."
  },
  {
    "headline": "Honeywell Flour Mills records N983m loss in Q1 2022",
    "summarized_story": "Analysts said that the result is influenced by inflation which caused the cost of sales to rise significantly, thereby reflecting on the gross profit.\nIn the period under review, the cost of sales was up by 32% to reach N124 billion from N94 billion the previous year.\nThe spike was due to a hike in raw and packaging materials consumed from N83 billion to N111 billion.\nOperating profit stood at N4.6 billion from N7.6 billion, and finance cost was N5.5 billion from N6 billion, while the operating loss before tax was valued at N172 million from N1.6 million.\nThe company last traded at N3.5 as of Friday the 27th, 2022, and its market cap stood at N27 billion."
  },
  {
    "headline": "Banks’ non-performing loans ratio rises to 5.3% in April 2022",
    "summarized_story": "Nigerian banks’s non-performing loans (NPL) ratio rose to 5.3% in April 2022 from 4.84% held in February 2022, according to data from the Central Bank of Nigeria (CBN).\nThis is even as capital adequacy ratio (CAR) increased to 14.6% in April 2022 from 14.5% in December 2021, showing that it is above its prudential limit.\n“In the Banking System, the Capital Adequacy Ratio (CAR) and the Liquidity Ratio (LR) remained above their prudential limits at 14.6 and 43.7 per cent, respectively,” the CBN said.\nAccording to the apex bank, the banking system is stable but there is a need to address the increase in Non-performing loans.\n“The Non-Performing Loan (NPL) ratio stood at 5.3 per cent in April 2022, compared with its prudential limit of 5.0 per cent, reflecting sustained stability in the banking system, though there remains a need to bring this down to the prudential limit,” it said."
  },
  {
    "headline": "BREAKING: Buhari Meets APC Govs Over Presidential Primary Election",
    "summarized_story": "President Muhammadu Buhari is currently meeting with governors elected on the platform of the ruling All Progressives Congress (APC).\nThe meeting, it was gathered, was on the forthcoming presidential primary election of the party scheduled for Tuesday and Wednesday next week .\nAll the APC governors are present in the meeting.\nDetails Later…"
  },
  {
    "headline": "BREAKING: Buhari Meets APC Govs Over Presidential Primary Election",
    "summarized_story": "President Muhammadu Buhari is currently meeting with governors elected on the platform of the ruling All Progressives Congress (APC).\nThe meeting, it was gathered, was on the forthcoming presidential primary election of the party scheduled for Tuesday and Wednesday next week .\nAll the APC governors are present in the meeting.\nDetails Later…"
  },
  {
    "headline": "Alleged N2.9bn Fraud: Court Grants Okorocha N500m Bail",
    "summarized_story": "Justice Inyang Ekwo of a Federal High Court in Abuja, has granted bail to a presidential aspirant and former governor of Imo State, Senator Rochas Okorocha.\nHe was granted bail in the sum of N500 million and a surety in like sum.\nThe court gave the order while ruling on the bail application filed by Okorocha, through his lawyer, Mr Okey Amaechi, SAN.\nThe judge also directed Okorocha to deposit his International Passport with the registry of the court and should not travel outside the jurisdiction of the court without the court’s permission.\nSimilarly, he ordered the court registry to inform the Nigeria Immigration Service (NIS) that Okorocha’s international passport is in its custody."
  },
  {
    "headline": "Alleged N2.9bn Fraud: Court Grants Okorocha N500m Bail",
    "summarized_story": "Justice Inyang Ekwo of a Federal High Court in Abuja, has granted bail to a presidential aspirant and former governor of Imo State, Senator Rochas Okorocha.\nHe was granted bail in the sum of N500 million and a surety in like sum.\nThe court gave the order while ruling on the bail application filed by Okorocha, through his lawyer, Mr Okey Amaechi, SAN.\nThe judge also directed Okorocha to deposit his International Passport with the registry of the court and should not travel outside the jurisdiction of the court without the court’s permission.\nSimilarly, he ordered the court registry to inform the Nigeria Immigration Service (NIS) that Okorocha’s international passport is in its custody."
  },
  {
    "headline": "Senator Regains Freedom From Kidnappers 1 Month After",
    "summarized_story": "Cameroonian soldiers have freed a kidnapped senator of the ruling party, plus several other hostages, in an operation in the country’s English-speaking North-West region, the army says.\nSenator Elizabeth Regina Mundi was kidnapped along with her driver last month in Bamenda.\nThe separatist group, Ambazonian Defence Forces (ADF), said it carried out the abduction.\nThe rebel group is one of several fighting for independence in the two main Anglophone regions, the North-West and South-West.\nIn a statement, army spokesman Cyrille Atonfack Guemo said a dozen separatist fighters were killed, many left injured, while others fled during the Monday night raid."
  },
  {
    "headline": "Rochas Okorocha gets N500m bail, may attend APC screening",
    "summarized_story": "Senator Rochas Okorocha, former Governor of Imo State, has been granted bail at N500million by the Federal High Court in Abuja.\nJustice Inyang Ekwo, in a ruling on Tuesday, rejected EFCC’s objection, saying granting bail was a discretionary power of the court.\nThe judge, then, ordered Okorocha to provide a surety, who will sign and of the same amount.\nHe ordered the registry of the court to inform the Nigeria Immigration Service (NIS) about the state of Okorocha’s travel documents.\nWith this development, Okorocha now has less than 24 hours to perfect the bail in order to be able to attend the presidential screening of the All Progressives Congress."
  },
  {
    "headline": "Italy legend Chiellini bids farewell at Wembley",
    "summarized_story": "Giorgio Chiellini ends an “unbelievable” international career on Wednesday when European champions Italy take on Copa America winners Argentina in the Finalissima match at Wembley.\nChiellini came to Juve via Livorno and Fiorentina and won nine Serie A titles and five Italian Cups with the Turin club.\nBut he also two lost UEFA Champions League finals, and Italy did also not shine at the 2010 and 2014 FIFA World Cups.\n“Of course, I would have liked to rewrite my story with world championships but unfortunately that didn’t happen,” he said.\nThat will be for the last time on Wednesday as he said “I always wanted to quit at the top level."
  },
  {
    "headline": "Laide Bakare, Faithia Williams, Other Nollywood Stars Mourn The Death Of Actor Osmond Gbadebo",
    "summarized_story": "The Yoruba movie industry is mourning the death of actor and filmmaker, Osmond Gbadebo.\nBimbo Success, “So sad osmond gbadebo, may your gentle soul continue to rest in perfect peace!!!\nIle aiye, Ile aisan vanity upon vanity”Bakare Zainab : Osmond Osmond Osmond why???\nYour birth month, your child’s birth month, now your death month, ahhh may God be pleased with your soul.\nThe struggle was real, the hustle was real, it’s time to rest my friend, Osmond Gbadebo, Rip”."
  },
  {
    "headline": "2023: ‘Tinubu demonstrated vast knowledge during APC screening’",
    "summarized_story": "The ruling party’s screening committee, chaired by John Oyegun, former chairman of the party, concluded the first phase of the exercise on Monday night, with Tinubu alongside 12 aspirants screened.\nThe remaining 11 aspirants would be screened today, Tuesday, ahead of the party’s presidential primary next week.\nHe confidently told the panel why he is qualified to fly the flag of APC as its presidential candidate.\n“Tinubu in his answers demonstrated vast knowledge in economic management and perfect understanding of Nigeria’s political economy.\n“The screening committee expressed satisfaction with Tinubu’s knowledge of the economy and sociopolitical issues that are affecting the country.”"
  },
  {
    "headline": "Alleged Fraud: Okorocha Engages Five SANS, Seeks N1bn Damages",
    "summarized_story": "Former governor of Imo State, Rochas Okorocha, on Monday, asked a Federal High Court in Abuja to declare the invasion of his residence by officers of the Economic and Financial Crimes Commission illegal and unconstitutional.\nOkorocha representing Imo West Senatorial District in the National Assembly also demanded N1 billion damages from the Federal Government for the May 24 2022 invasion of his residence.\nEarlier, Okorocha was in the 17-count accused of diverting N2.9 billion from Imo State government House Accounts and that of Imo State Local Government Joint accounts to private companies.\nThe alleged offense was said to have been perpetrated by Okorocha and one Anyim Inyerere with the use of their private companies between 2014 and 2016 when he held sway as the governor of Imo State.\nJustice Inyang Ekwo subsequently ordered Okorocha’s further detention till May 31 when his bail application would be argued."
  },
  {
    "headline": "BREAKING: Osmond Gbadebo, Popular Nollywood Actor Is Dead",
    "summarized_story": "Nollywood Actor from the Yoruba movie genre, Osmond Gbadebo, is dead.\nAccording to media reports, Osmond Gbadebo, a Nigerian filmmaker, Movie Producer, Production Manager, Entrepreneur and the Chief Executive Officer of Osmond Communication died late last night.\nVeteran actress Madam Saje took to social media to announce the sad news.\nThough, we are yet to get full details about his departure but information has it that he died after a brief illness.\nDetails shortly…"
  },
  {
    "headline": "New Materials Nigeria Company to save $100m forex for Nigeria annually",
    "summarized_story": "By our correspondentNew Materials Nigeria Company, a building material company recently commissioned in the Kuje area of Abuja will save Nigeria a whopping sum of $100m in foreign exchange annually when fully operational, its Managing Director, Mr. Jackie Dai Hui has said.\nSpeaking further, the Managing Director said that so far, over $50 million has been invested in the New Materials Nigeria Company explaining that in no distant time, it will grow its investment in Nigeria by establishing a branch in Lagos.\nAccording to him, the establishment of the New Materials Nigeria Company has gone a long way to provide employment to 150 Nigerians both at senior and junior levels who he said are also being trained in various skills.\nWe train Nigerians to run the company; we are transferring technology to those who are brilliant.\n“We can increase our company’s presence in Nigeria because we can source all our raw materials in Nigeria."
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "FBNInsurance Shareholders Approve 74 Kobo Dividend",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSSHAREHOLDERS of FBNInsurance Limited has approved a full year dividend of 74 kobo per ordinary share for the year end 2021.\nSpeaking at the Annual General Meeting, Mr. Val Ojumah, the Managing Director/Chief Executive Officer of FBNInsurance Limited, stated that FBNInsurance financial performance in 2021 demonstrates the company’s strong footing despite the challenging operating environment in 2021.\nThe dividend declared for year 2021 is a 6% increase from 70k that was declared in 2020.\nIt is worthy to note that FBNInsurance Limited has consistently paid dividend to its shareholders in the last eight years.\nFBNInsurance is also a member of the Sanlam Group, a leading diversified, pan-African financial services group."
  },
  {
    "headline": "FCMB Offers Up to N30m Auto Loan to Make Vehicle Ownership Easy",
    "summarized_story": "The FCMB auto loan supports acquiring brand new and pre-owned vehicles (popularly known as “Tokunbo”), with N500,000 as the minimum loan amount that a customer can access for a repayment duration of up to 5 years.\nNigerians can now finance their dream vehicle with an auto loan from FCMB at a low-interest rate with monthly or yearly payment options depending on their income.\nWe, therefore, urge the populace, including, but not limited to salaried individuals, to take advantage of this opportunity to fulfil their vehicle ownership dream”.\nFCMB Auto Loan empowers qualified Nigerians to part-finance the purchase of brand-new and pre-owned vehicles while spreading the repayment between one and five years.\nHowever, vehicle ownership in the country has been declining because of increased prices."
  },
  {
    "headline": "Buhari, APC Governors Meet Ahead Of Party’s Presidential Primary",
    "summarized_story": "President Muhammadu Buhari on Tuesday met with governors of the All Progressives Congress (APC) ahead of the ruling party’s national convention to produce its presidential candidate for the 2023 general elections.\nThe meeting which is ongoing at the Presidential Villa in Abuja has all members of the Progressives Governors’ Forum represented.\nREAD ALSO: APC Presidential Panel To Screen Osinbajo, Lawan, Fayemi, Bello, Others TodayEarlier, governors elected on the APC platform had expressed a desire to go along with the choice of the President on the emergence of the party’s presidential candidate.\nChannels Television had reported that 28 aspirants picked the APC presidential nomination and expression of interest forms sold at N100 million.\nAs a result, the committee screened 12 presidential aspirants as parts of activities lined up for the party’s primary scheduled to take place between June 6 and 8."
  },
  {
    "headline": "Alleged N2.9bn Fraud: Court Grants Rochas Okorocha N500m Bail",
    "summarized_story": "The Federal High Court in Abuja has granted bail to a presidential aspirant and former governor of Imo State, Rochas Okorocha.\nHe was granted bail on Tuesday by Justice Inyang Ekwo in the sum of N500 million and a surety in like sum.\nREAD ALSO: Court Remands Okorocha In EFCC CustodyThereafter, counsel to Okorocha, Mr Okey Amaechi, prayed the court to release his client on bail, pending the determination of the case against him.\nIn his response, counsel to Okorocha, Okey Amaechi, informed the court that his client was ready to meet the bail conditions.\nFor Anyim, the court ruled that he should continue to enjoy the administrative bail earlier granted to him."
  },
  {
    "headline": "APC Presidential Panel To Screen Osinbajo, Lawan, Fayemi, Bello, Others Today",
    "summarized_story": "The All Progressives Congress (APC) will continue the screening of its presidential aspirants today ahead of the party’s primary scheduled to take place between June 6 and 8.\nA total of 11 presidential hopefuls are expected to appear on Tuesday before the APC Presidential Screening Committee led by a former Edo State governor and former APC national chairman, John Oyegun.\nThe APC panel had screened 12 presidential hopefuls in the course of the exercise expected to last two days at Transcorp Hilton Hotel in Abuja.\nChannels Television had reported that 28 aspirants picked the APC presidential nomination and expression of interest forms sold at N100 million.\nAmong those who have publicly rejected the APC nomination and expression of interest forms purchased for them included the former President Goodluck Jonathan and the President of the African Development Bank (AfDB), Dr Akinwumi Adesina."
  },
  {
    "headline": "All 22 Bodies Retrieved From Nepal Plane Crash",
    "summarized_story": "Nepali rescuers have retrieved the bodies of all 22 people from a plane that crashed in the Himalayas, authorities said Tuesday as they began identifying the victims.\nBut it has been plagued by poor safety due to insufficient training and maintenance.\nThe European Union has banned all Nepali airlines from its airspace over safety concerns.\nIn March 2018, a US-Bangla Airlines plane crash-landed near Kathmandu’s notoriously difficult international airport, killing 51 people and seriously injuring 20.\nThat accident was Nepal’s deadliest since 1992, when all 167 people aboard a Pakistan International Airlines plane died when it crashed on approach to Kathmandu airport."
  },
  {
    "headline": "Israel Signs UAE Free Trade Deal, Its First In Arab World",
    "summarized_story": "Israel signed a free trade deal with the United Arab Emirates on Tuesday, its first with an Arab country, building on their US-brokered normalisation of diplomatic relations in 2020.\nTwo-way trade between Israel and the UAE last year totalled some $900 million dollars, according to Israeli figures.\nTalks for a free trade agreement began in November and concluded after four rounds of negotiations.\nIsrael has already struck free trade agreements with other countries and blocs, including the United States, European Union, Canada and Mexico.\nIn February, Israel signed a trade deal with Rabat to designate special industrial zones in Morocco."
  },
  {
    "headline": "Late governor Lawal's son emerges Kwara SDP guber candidate -",
    "summarized_story": "Mr Hakeem Lawal, son of a late former governor of Kwara state, Mohammed Lawal, has emerged as the Kwara state governorship candidate of the Social Democratic Party.\nHe defeated two other aspirants to emerge the winner of the primary election for the second time in less than one week.\nHe had earlier emerged as the candidate of the party but the primary election was canceled due to a petition written against his victory.\nMr Lawal was one of the APC governorship aspirants in Kwara state in 2019.\nThe Chairman of the Kwara SDP gubernatorial primary election, Mr Olatunji Agbaminoja announced the result of the election."
  },
  {
    "headline": "Allegation of dollarisation of PDP primary, a mere rumour",
    "summarized_story": "Former Spokesman of the Atiku Abubakar Campaign Organisation and PDP governorship candidate in Ogun state, Segun Sowunmi, has described as mere rumour and exaggeration, the alleged dollarization of the just concluded presidential primary of the party.\n“I think that we must be careful that we do not allow rumour to become fact.\nIf you are looking for Political parties that dollarises and criminalises the process, it’s APC.\nThe governorship candidate, however cautioned cultural groups like PANDEF, Arewa Consultative Forum, Afenifere and others to steer clear of political matters and allow political parties manage its affairs.\n” I have advised that PANDEF, Arewa, Afenifere and others need to be told not to jump into political matters as if they are political parties."
  },
  {
    "headline": "Atiku will win 2023 Presidential election with a landslide",
    "summarized_story": "Mr Melaye equally expressed his confidence in the party’s ability to wrestle power from the APC government in 2023.\nHe said governor Tambuwal did not betray Mr Wike as there was no written agreement between the two of them.\nSpeaking on the alleged supremacy battle between North and South at the presidential primary, Mr Melaye accused APC of spreading such fake news.\nHe touted Mr Kolade-Otitoju to swear with Bible that PDP did not win the 2019 presidential election.\nSo we decided to throw it open to acquire power before sharing power,” Mr Melaye said while reacting to the choice of a northern candidate."
  },
  {
    "headline": "Benue State APC Gubernatorial Aspirants React to outcome -",
    "summarized_story": "Four Benue State gubernatorial aspirants on the APC platform including Senator Barnabas Gemade, Mike Aondoakaa (SAN), Mathias Ibuan and Terhemba Shija have registered their petitions to the Governorship Appeal Panel Committee.\nThe aspirants who took turns to state their cases rejected the outcome and called for fresh primaries to be conducted in the State.\nMeanwhile, a section of Benue APC today staged a protest in Makurdi.\nThe Governorship Primary of the All Progressives Congress had ended with a suspended Catholic Priest, Reverend Father Hyacinth Iormen Alia emerging as the winner.\nHis ambition had been causing ripples within the All Progressives Congress in the State."
  },
  {
    "headline": "Oil Prices Jump after EU Leaders Agree to Ban Russian Crude Imports By 90%",
    "summarized_story": "Oil prices jumped after EU leaders reached an agreement late Monday to ban 90% of Russian crude by the end of the year.\nAt one point, U.S. crude rose to $119.42 per barrel — a 12-week high, according to Refinitiv data.\nContracts for August also traded higher: WTI crude rose 3.21% to $115.83, and Brent was up 1.63% to $119.53 per barrel.\nCharles Michel, president of the European Council, said the move would immediately hit 75% of Russian oil imports.\nAnd by the end of the year, 90% of the Russian oil imported in Europe will be banned."
  },
  {
    "headline": "Nigeria: INEC Reacts to Election Guidelines Adjustment, Says It’s Not Unilateral, Explains PDP is First Beneficiary",
    "summarized_story": "At the meeting, the political parties requested for an adjustment of the Timetable and Schedule of Activities for the conduct of the 2023 general election.\n“Of course, the period for the primaries had started as at the time the political parties unanimously made the request.\nNone of the Political Parties accused the Commission of shifting the goal post at the middle of the game.\nNone of the political parties accused IPAC of acting unilaterally or not representing them.\nWe remind all Political Parties of what happened in some States (Rivers and Zamfara) in 2019,” Okoye said."
  },
  {
    "headline": "Okonjo-Iweala Calls for Global Solidarity in Crises Response",
    "summarized_story": "The Director-General of the World Trade Organisation (WTO), Dr. Ngozi Okonjo-Iweala, has called for global solidarity in responding to crises facing the world, especially the ongoing war between Russia and Ukraine.\n“You cannot have resilience unless you have global solidarity,” she told participants.\nOkonjo-Iweala also underlined the urgent need to address global warming and its impacts during a Forum discussion on climate change.\n“The consequences of inaction are in front of us every day, on every continent, in so many countries,” she added.\n“It’s true that we’re in a world of simultaneous crises, climate change, food, the pandemic, international security, but I don’t think we can prioritize one over the other because they’re all linked, they’re all crises of the global commons.”"
  },
  {
    "headline": "Dangote Calls for Single-Digit Tax Regime to Encourage Investments in Nigeria’s Petroleum Sector",
    "summarized_story": "Africa’s richest man and President of the Dangote Group, Alhaji Aliko Dangote has advised Nigeria’s federal government to introduce a single-digit tax regime to encourage investments in the downstream and midstream sectors of the Nigerian oil and gas industry.\n“Government should ensure a single digit tax regime to encourage investment in the downstream sector,” Dangote said.\nHe, however, stated that the coming on stream of his refinery would expose Nigeria’s midstream and downstream sectors to the international markets.\n“Dangote Petroleum Refinery will guarantee adequate fuels production for domestic consumption and availability of excess products for export which will help to stabilise our domestic currency.\n“It will lead to upgrading and expansion of Nigerian National Petroleum Company Limited’s refineries and promotion of prospects of Nigeria’s transformation to a regional refining hub,” Dangote stated."
  },
  {
    "headline": "Why International Oil Companies Are Leaving Nigeria: Deputy Oil Minister Sylva",
    "summarized_story": "Nigeria’s Minister of State for Petroleum Resources Timipre Sylva has said IOCs were leaving Nigeria because the environment was becoming too volatile for their operations.\nIn an interview with The Energy Year, a market intelligence organisation, Sylva stated that Nigeria’s situation had become, “precarious” because of the multitude of challenges besetting the oil sector.\nThe minister noted that while Nigeria was tackling the challenges, the damage being done by vandals was eroding investors’ confidence in the oil and gas industry.\n“During the pandemic, OPEC asked us to bring down production because oil prices were at a historical low.\nHe added that as a country, Nigeria was not taking full advantage of the high oil prices because production is not meeting expectations."
  }
]