[
  {
    "headline": "Defend allegations against you, group tells Ogun gov",
    "summarized_story": "…allegations baseless, says state govtA political pressure group, Ogun Bibire Unity Forum, has called on the Governor of Ogun State, Dapo Abiodun, to address the allegation that he committed criminal offences in the United States in the 80s and other possible constitutional infractions.\nIn the petition, Abiodun was accused of concealing criminal offences he allegedly committed in the US.\nReacting, Sofela stated that the chance of the APC retaining the governorship seat in the state would be in jeopardy if the governor refused to defend the allegations.\n“If action is not taken, the chances of our great party, the APC, retaining the governorship seat in Ogun State shall be in jeopardy as previously seen in Bayelsa and Zamfara States,” Sofela said.\nMeanwhile, Afe Babalola & Co., the legal counsel to the Ogun State Governor, in a letter to the National Chairman of the APC, addressed allegations of discrepancies in the Governor’s educational background."
  },
  {
    "headline": "NDLEA marks Kyari’s Maiduguri houses, shopping plaza for investigation",
    "summarized_story": "The National Drug Law Enforcement Agency on Monday marked six residential houses and one plaza belonging to the embattled former Intelligence Response Team leader, Abba Kyari, in Maiduguri as being under investigation.\nThe two-storey shopping plaza, Assurance Plaza, located along the Giwa Barracks Road in Maiduguri, has about 100 stores.\nSix other residential houses within the Maiduguri New Government Residential Area allegedly belonging to the suspended Deputy Commissioner of Police had also been marked by the NDLEA.\nThis is coming barely 48 hours after a suspected drug dealer linked to the N3 billion worth of tramadol intercepted by the then Kyari-led IRT team was arrested by operatives of the NDLEA in Lagos.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Bayelsa West: Purported Zoning arrangement has not been respected, says Group",
    "summarized_story": "By Henry Umoru, ABUJAA group under the aegis of Bayelsa West Youth Congress has raised the alarm that a group of politicians and their cronies are deliberately twisting history in an attempt to confuse and create needless tension among the good people of the Senatorial District on a purported zoning arrangement in the area.\nHe stressed that under a respected government the APC wouldn’t have fielded a candidate against a Sagbama Senatorial candidate since Hon Fred Agbedi, an Ekeremor man was already in the House of Representatives.\nEbebi Brown wondered what would have happened to the purported zoning arrangement if Ebebi had defeated Senator Dickson in the heavily contested election where Ebebi polled over 20000 votes.\nHe urged Bayelsans and well-meaning Nigerians to ignore the mischief designed to hand over the Senatorial District to the APC, even as he said that serious minded politicians with the right credentials go for campaign and not blackmail.\nEbide Brown recalled that Ekeremor political leaders agreed unanimously to contribute the money for the expression of interest and nomination forms for Senator Dickson because of his record of perform, the merit of his brand of representation and proven love for the people over the years."
  },
  {
    "headline": "Lagoon threats: Lagos allays fears over idumagbo flood, sues for calm",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos State.\nBy Olasunkanmi AkoniLagos State Government has allayed the fear by Idumagbo residents and environs over incessant flooding of the area, calling for patience.\nBello added that the embarkment was necessary to prevent water from coming in from the lagoon.\nLagos Island is a low lying area which explains the convergence of water.\nSome of the affected areas include: Ojo Giwa, Jankara, Idu Garan, Okoya among others while, some affected schools include: King Ado High School and St. Patrick Primary school."
  },
  {
    "headline": "PHOTOS: Tinubu heads for Kaabah to perform Umrah rites",
    "summarized_story": "All Progressives Congress National Leader, Asíwájú Bola Tinubu, heading for Kaabah to perform Umrah rites on arrival in Mecca, Saudi Arabia…Tuesday.\nAll Progressives Congress National Leader, Asíwájú Bola Tinubu (m), Lagos State Commissioner for Home Affairs, Mr. Anofi Elegushi (l) and Head of Service, Lagos, Mr. Hakeem Muri Okunola heading for Kaabah to perform Umrah rites in Mecca, Saudi Arabia…Tuesday.\n(l-r) Mr. Femi Oyetola, Mr. Tunde Rahman, Asíwájú Bola Tinubu and his son Yinka Tinubu on Tuesday in Mecca, Saudi Arabia…PHOTO: Tinubu Media OfficeVanguard News Nigeria"
  },
  {
    "headline": "Date within your means --- TOOLZ",
    "summarized_story": "BY DAMILOLA OGUNSAKINNigerian on-air personality, Tolulope Afusat Oniru, popularly known as TOOLZ, turned a dating coach on her Instagram page.\nThe talk show host adviced her followers to date within their status.\nThe media personality is best known for hosting The midday show on the beat 99.9 FM."
  },
  {
    "headline": "US Vice president, Kamala Harris tests positive for Covid-19",
    "summarized_story": "Kamala HarrisVice President Kamala Harris tested positive for Covid-19 on Tuesday after returning from a weeklong trip to California but is asymptomatic.\n“Today I tested positive for COVID-19.\nALSO READ:Kirsten Allen, the vice president’s press secretary, said in an earlier statement that Harris tested positive for Covid-19 on rapid and PCR tests.\nThe Vice President will return to the White House when she tests negative,” she added.\nShe did not participate in any events or meetings at the White House on Tuesday, according to a White House official."
  },
  {
    "headline": "Nigerian youths are ingenious, creative – US",
    "summarized_story": "The U.S. made the remark while restating its commitment to promoting the protection and enforcement of intellectual property rights (IPR).\nThe Mission and the American Business Council hosted the second edition of Intellectual Property (IP) Symposium.\nThe theme for World IP Day 2022 is “Intellectual Property and Youth: Innovating for a Better Future”.\nLeonard noted that strong IPR would create jobs and open new markets for goods and services.\n“A strong system of intellectual property rights assures inventors, industrial designers, musicians, and artists alike that their creative content will be protected and valued."
  },
  {
    "headline": "2023 presidency: Why no one can predict Buhari’s preferred candidate – Okorocha",
    "summarized_story": "A former Governor of Imo State, Rochas Okorocha, has said nobody can predict President Muhammadu Buhari’s preferred candidate.\nOkorocha, who was a guest on Channels TV said Buhari is unpredictable and is yet to endorse anyone to succeed him.\nAccording to the presidential aspirant, Buhari has not revealed his preferred candidate or given his support to any aspirant yet and anyone saying otherwise is lying.\n“If you know President Muhammadu Buhari, he is a general and you can’t predict.\nHe is so unpredictable, you can’t predict what he will do."
  },
  {
    "headline": "Gov Ortom seeks FG intervention for victims of herdsmen attacks",
    "summarized_story": "Benue State Governor, Samuel Ortom, has called on the Federal Ministry of Humanitarian Affairs and Disaster Management to offer more interventions to victims of herdsmen attacks in the State as it is being done to other States across the country.\nGovernor Ortom stated this on Tuesday, April 26th 2022 during the flagoff of the Victims Support Fund intervention programme in the State initiated by the TY Danjuma Foundation.\nHe expressed appreciation to General Theophilus Danjuma for his humanitarian works, saying through the Victims Support Fund, he has been able to assist the State to offer succour to victims of terrorism any time the State called on him.\nMrs Akerele-Ogunsiji further stated that the Victims Support Fund would also roll out a psycho-social and wellness programme for the victims to take care of their mental health, saying educational support would also be offered through registering the students for WAEC as well as JAMB examinations.\nShe bemoaned the level of destruction that has been caused to Benue communities by the herdsmen attacks over the years and enjoined other local and international organisations to assist in alleviating the plight of the victims."
  },
  {
    "headline": "Nse Ekpenyong was a bridge builder, effective voice – Gov Emmanuel mourns lawmaker",
    "summarized_story": "Governor Udom Emmanuel of Akwa Ibom State has joined many Nigerians in mourning the demise and paying tribute to the member that represented Oron/Udung Uko/Okobo/Urueffong Oruko/Mbo Federal Constituency, Rt.\nHonourable Nse Ekpenyongat the National Assembly.\nExpressing shock and sadness over the death of the Lawmaker, the governor in a statement signed by his Chief Press Secretary and Senior Special Assistant, Media, Ekerete Udoh, and obtained by our correspondent on Tuesday described the deceased as a loyal party man, a bridge builder and effective voice for his people.\nAccording to the statement, “Ekpenyong was a loyal party man, a consummate politician, bridge- builder and an effective voice who stood for what was proper, necessary and good for both the Oron Federal Constituency, the Oro Nation, the State and indeed the Nation.\n“On behalf of the Government and the good people of Akwa Ibom State, I extend our condolences to his family, the people of Oron Federal Constituency and indeed the Oro Nation in general“May God grant his soul perfect peace.”"
  },
  {
    "headline": "Abiodun to Osinbajo: Ogun will support your presidential ambition",
    "summarized_story": "Ogun State governor, Dapo Abiodun, has declared that the state would support the presidential ambition of the Vice President, Professor Yemi Osinbajo to enable him continue with some of the laudable projects of the President Muhammadu Buhari-led administration.\n“The Vice President present here is home coming.\nYou are serving this country and the president meritoriously for the last seven years as the vice president.\n“The Vice President position is an opportunity to serve and I have served with utmost loyalty.\nSpeaking on the ambition of the Vice President, the Alake of Egbaland, Oba Adedotun Gbadebo, attested to the competence of Osinbajo, saying: “the vice president has paid his dues and is eminently qualified to succeed as President."
  },
  {
    "headline": "Plateau commissioners pay for Lalong’s Senate form",
    "summarized_story": "Commissioners in the Plateau State state executive council have raised more than N60 million to purchase form for Governor Simon Bako Lalong to contest the Senate seat of the Plateau State Southern Zone Senatorial District.\nThis was stated by Yakubu Datti, the Chairman of the Commissioners’ Forum of Plateau State.\nAccording to the statement, the commissioners said Governor Lalong has restored Plateau to its place of reckoning by promoting peaceful co-existence and developmental projects for the benefit of the common citizens irrespective of tribe, religion and creed.\nThe commissioners further enumerated the leadership qualities of Governor Lalong who, as the Chairman of the Northern Governors’ Forum has promoted unity and accommodation among different spheres.\nAccording to Yakubu Datti, the Senate position will enable the entire country to benefit from his demonstrated leadership potential."
  },
  {
    "headline": "Malaria prevalence in Yobe drops to 27 per cent",
    "summarized_story": "The Yobe State Government said it has reduced the rate of malaria prevalence in the state from 42 per cent to 27 per cent since 2013.\nThe Executive Secretary of the State Primary Health Management Board, Dr Kundi Machina stated this during a chat with reporters in Damaturu on Monday to mark this year’s Malaria Day.\n“The Yobe State Government has made huge progress in the fight against malaria since 2013; resulting in a significant reduction in malaria burden.\n“The 2013 NDHS shows that malaria is now responsible for two out of 10 deaths in children less than five years, as against 30 per cent in previous years…the NMIS 2015 shows a remarkable fall in the malaria prevalence from 42 per cent to 27 per cent which is a commendable stride in the government’s effort to stem malaria,” Dr Machina said.\nThe highlight of the event was the presentation of goodwill messages from the World Health Organisation (WHO), AHNi and the malaria consortium."
  },
  {
    "headline": "Youths protest alleged plan to remove lawmaker over defection",
    "summarized_story": "Adamawa youths have staged a protest in the state capital, Yola, yesterday over an alleged plan by the State House of Assembly to remove a member who defected from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nPro-Ayuba youths had responded by gathering in front of the House of Assembly Complex in Yola as early as 9:00 a.m., protesting the alleged plan to remove Ayuba.\nNot long ago, Musa Bororo (who represents Mubi South in the House of Assembly) left the APC for the PDP.\nNot a word was uttered by either the Speaker or any member until the House adjourned sitting to today.\nThe silence of the House on the Ayuba issue gave rise to the fresh speculation that the House is resting its alleged plan for another day."
  },
  {
    "headline": "Ameh Ebute emerges as national leader of federal legislators’ forum",
    "summarized_story": "Former Senate President Ameh Ebute has been nominated as the National Leader of the National Assembly Senators and Members’ Forum.\nIn a statement by Chief Tony Mike Akpan, the National Coordinator of the Forum said Senator Ebute was nominated to replace the late Senator Joseph Wayas.\nEbute is currently the most senior Senate President in Nigeria.\nSenator Ebute noted that the Forum will have its next national meeting soon in Abuja.\nHe, therefore, called on former and serving federal legislators of the National Assembly to support the Forum, particularly in its mission and vision to ensure that one of them emerges Nigeria’s President and Commander-in-Chief of the Armed Forces of Nigeria in 2023."
  },
  {
    "headline": "Residents hail Fed Govt over Jibia Border reopening",
    "summarized_story": "A report by our correspondent, who visited the border town yesterday indicates that commercial activities had resumed in earnest following the announcement of the opening of the border last week after about three years of closure.\nThe Nation recalls that the Federal Government had, on Friday last week, approved the re-opening of Idiroko, Jibia, Kamba and Ikom borders.\nThe reopening of the Jibia Border was, however, delayed due to a low level of compliance by residents with the government’s directive.\nDr Suleiman Bello, a Jibia resident, told The Nation that the people of the border town are ready to reciprocate the Federal Government’s gesture.\nJibia Border is just like a refinery built for us."
  },
  {
    "headline": "DSS alleges plan to bomb worship centres, public places",
    "summarized_story": "By Christopher OjiThe Department of State Services (DSS) has raised the alarm over planned bomb attacks in parts of the country by criminal elements.\nThe service said the target areas are critical infrastructure and other frequented public places like worship and relaxation centres, especially during and after the holidays.\nThe objective is to achieve some self- serving interests as well as cause fear among the citizenry.\nThe Service, however, recalls its earlier warning that some groups and individuals were plotting to stoke violence in the country.\n“Following these, patrons, owners and managers of aforementioned public places are advised to be wary of this development and implement basic security measures to deter the threats."
  },
  {
    "headline": "The Sun award’ll give me more impetus to work for Nigeria –Gov Bala Mohammed",
    "summarized_story": "Governor of Bauchi State, Bala Moh-ammed, has hailed the professionalism of The Sun, describing awards by the newspaper as always driven by integrity.\nThe Bauchi State governor said though he seldom accepts awards, he was happy to be considered for the honour and dedicated it to God and the people of Bauchi State.\nGovernor Mohammed said: “Far away from your office in Lagos, you came to Bauchi and picked me as Governor of the Year.\nIt is going to give me and my team more impetus to work hard, to prove that we deserve the award we have been given.\nHe said Mohammed’s performance and achievements within the period he has been governor of Bauchi State have been outstanding."
  },
  {
    "headline": "Uproar as FG stops striking varsity workers’ salary",
    "summarized_story": "It was learnt that government might have implemented the policy following the collapse of negotiations and failure of workers to call off the strike.\nBut stakeholders in the sector have knocked the government for not exhausting the option of dialogue to resolve the contending issues with the university workers so that schools can resumed for normal academic work.\nAffected by the policy are members of the Academic Staff Union of Universities (ASUU), Non-Academic Staff Union of Allied and Educational Institution (NASU, Senior Staff Association of Nigerian Universities (SSANU) and National Association of Academic Technologists (NAAT).\nReacting yesterday, General Secretary of NASU, Prince Peters Adeyemi, said government cannot flagrantly stop salaries of university workers as the strike followed due process.\nDr. Kassim Umaru, who confirmed the withholding of salaries, said it was part of government’s plot to intimate the striking workers."
  },
  {
    "headline": "Intensify efforts in tackling insecurity, economic challenges, Anglican church urges FG",
    "summarized_story": "The Anglican Church of Nigeria, Bida Diocese, Niger State, has called on the Federal Government to redouble its efforts in tackling insecurity and economic challenges.\nIt made the call in a communique issued, yesterday, at the end of its eighth Synod held at St. Matthew’s Anglican Church, GRA Bida and signed by the Bishop of the Diocese and president of the Synod, Rt.\nIt specifically lamented that incessant attacks by terrorists in some parts of the Niger State which had crippled economic activities forcing communities to abandon their ancestral homes.\nIt also condemned in strong terms the dilapidated road infrastructure in Niger State, and called on the federal and the state governments to hasten the completion of Bida-Minna road.\nyou shall overcome.”Those that attended the four-day synod include the Bishop of Kafanchan Diocese, Rt."
  },
  {
    "headline": "36 governors pray court to stop $418m Paris Club debt deductions",
    "summarized_story": "The Attorneys-General of the 36 states made this prayer known in a motion on notice marked: FHC/ABJ/CS/1313/2021 dated and filed on March 28 before Justice Inyang Ekwo.\nThey prayed the court to restrain the respondents from proceeding with its judgment delivered on March 25 pending the hearing and determination of the appeal at the appellant court.\nThey prayed the court for an order of interim injunction, restraining the Federal Government from deducting monies accruing to the 36 states from federation account.\nThe deductions are to settle 418 million dollars judgment debt in relation to Paris Club Refund pending the determination of the substantive suit.\nHe held that the 36 states’ AGs, who were plaintiffs, lacked the legal right to institute the matter without their governors’ consent."
  },
  {
    "headline": "Elon Musk Reaches Agreement to Acquire Twitter for $44bn",
    "summarized_story": "•Over 40 million Nigerians on microblogging platformWorld’s richest man, billionaire Elon Musk has reached an agreement to acquire Twitter for approximately $44 billion, the company said.\n“Twitter has a purpose and relevance that impacts the entire world,” its CEO Parag Agrawal said in a tweet.\nMusk, a prolific Twitter user, has said it needs to be taken private to grow and become a genuine platform for free speech.\nMusk unveiled his intention to buy Twitter on April 14, and take it private via a financing package comprised of equity and debt.\nMusk did not provide any financing details when he first disclosed his offer for Twitter, making the market skeptical about its prospects."
  },
  {
    "headline": "Afenifere, Others Want Tinubu, Osinbajo, Southwest Aspirants to Withdraw from Presidential Race, Say It’s Turn of S’East",
    "summarized_story": "The call by the prominent socio-political groups reflects the sentiment in the country which increasingly favours the emergence of a president of Igbo extraction.\nAfenifere, PANDEF and Middle Belt Forum insisted the South East should produce the president of Nigeria in 2023 for equity, justice and fairness.\nAfenifere leader, Pa Ayo Adebanjo, while addressing the conference, said there was need for aspirants from the south, especially, the Igbo, to be united.\nAdebanjo said the decisions of presidential aspirants, like Minister of Transportation, Rt.\n“I told Bola (Tinubu) himself, not in the papers, face-to-face, ‘You believe this man (Buhari) will make you president?’ He said yes."
  },
  {
    "headline": "WHO: Malaria Killed over 602,000 People in Nigeria, Others in 2021",
    "summarized_story": "Moeti said the past year saw significant breakthroughs in malaria prevention and control, in spite of the COVID-19 pandemic.\nA statement yesterday, by US Embassy in Nigeria, stated that the US President’s Malaria Initiative (PMI) had partnered with Nigeria to fight malaria since 2011, contributing $768 million to date and $74 million in full year 2021.\nMarking its 20th year of malaria fight in Nigeria and in continuation of this legacy, the oil major has, however, announced its 2022 grant recipients.\n“This World Malaria Day, we mark ExxonMobil’s contributions over the past two decades that have helped equip and strengthen resilience within our communities to fight against malaria.\nThe governor made the call in commemoration of World Malaria Day, yesterday, to highlight the need for continued investment and sustained political commitment to malaria prevention and control."
  },
  {
    "headline": "Oil Theft: Navy Seizes 6 Million Litres of Stolen Crude from Illegal Refiners",
    "summarized_story": "The site also had five large pits holding approximately 700,000 litres of stolen crude oil.\nDuring the operation, 19 ovens, 26 metal storage tanks and two dugout pits laden with about 250,000 litres of suspected stolen crude oil and 50,000 litres of illegally refined AGO were destroyed.\nDuring the operation, 16 ovens, 31 metal storage tanks and seven large pits all filled with about 850,000 litres of stolen crude oil were equally deactivated.\n“The wooden boat was laden with 60,000Litres of illegally refined AGO together with over 100 sacks of same product.\nThe authorities have been struggling to curb the proliferation of illegal plants where stolen crude oil is refined."
  },
  {
    "headline": "NEF: We’re Not Involved in PDP Consensus Arrangement",
    "summarized_story": "“So, based on this, I didn’t go to Minna, and the decision that the two people are the Northern consensus candidate doesn’t in anyway reflect my wish, and should therefore not worry my supporters.\nWe met on Wednesday and we agreed to bury the issue of consensus candidate.\nYes, one consensus candidate has not emerged but they have initiated a process, which can help the party later on.\nRather, it was the group of presidential aspirants made up of Senator Bala Mohammed, RT Hon Aminu Tambuwal.\nSenator Bukola Saraki and Alhaji Mohammed Hayatu-Deen that collectively, freely and willingly approached Gen Babangida to help select from amongst themselves a Consensus Presidential Aspirant."
  },
  {
    "headline": "Terrorists Release Another Photograph Of Abducted Kaduna-Abuja Train Passengers",
    "summarized_story": "Terrorists who attacked an Abuja-Kaduna train about a month ago have released another picture showing some of their victims.\nThe gunmen had on March 28 ambushed the train heading for Kaduna from the nation’s capital city after bombing its rail track.\nAt least eight passengers were killed in the incident, while 168 others were kidnapped or declared missing.\nHassan, who was seen in a video released by the bandits, said he was freed on compassionate grounds.\nMeanwhile, the families of 22 of the passengers have declared them missing."
  },
  {
    "headline": "Terrorists Release Another Photograph Of Abducted Kaduna-Abuja Train Passengers",
    "summarized_story": "Terrorists who attacked an Abuja-Kaduna train about a month ago have released another picture showing some of their victims.\nThe gunmen had on March 28 ambushed the train heading for Kaduna from the nation’s capital city after bombing its rail track.\nAt least eight passengers were killed in the incident, while 168 others were kidnapped or declared missing.\nHassan, who was seen in a video released by the bandits, said he was freed on compassionate grounds.\nMeanwhile, the families of 22 of the passengers have declared them missing."
  },
  {
    "headline": "2023: Buhari Asked Tinubu, Osinbajo, Fayemi, Others To Contest In Order To Divide South-West – Afenifere Leader, Adebanjo",
    "summarized_story": "Ayo Adebanjo, Afenifere leader, says he warned the National Leader of the All Progressives Congress, Bola Tinubu, not to put his trust in President Buhari as the latter would never support his 2023 presidency ambition.\nAccording to Adebanjo, it is the turn of the South-East to produce the next president in the interest of fairness and equity.\nIt is not because they don’t know what is right.\nI said ‘he wants to make you President and yet he asked (Yemi) Osinbajo to contest?\nHe asked (Kayode) Fayemi to contest, he asked Amosun (Ibikunle) to contest?’ All in the West, why?"
  },
  {
    "headline": "2023: Buhari Asked Tinubu, Osinbajo, Fayemi, Others To Contest In Order To Divide South-West – Afenifere Leader, Adebanjo",
    "summarized_story": "Ayo Adebanjo, Afenifere leader, says he warned the National Leader of the All Progressives Congress, Bola Tinubu, not to put his trust in President Buhari as the latter would never support his 2023 presidency ambition.\nAccording to Adebanjo, it is the turn of the South-East to produce the next president in the interest of fairness and equity.\nIt is not because they don’t know what is right.\nI said ‘he wants to make you President and yet he asked (Yemi) Osinbajo to contest?\nHe asked (Kayode) Fayemi to contest, he asked Amosun (Ibikunle) to contest?’ All in the West, why?"
  },
  {
    "headline": "2023: Buhari Asked Tinubu, Osinbajo, Fayemi, Others To Contest In Order To Divide South-West – Afenifere Leader, Adebanjo",
    "summarized_story": "Ayo Adebanjo, Afenifere leader, says he warned the National Leader of the All Progressives Congress, Bola Tinubu, not to put his trust in President Buhari as the latter would never support his 2023 presidency ambition.\nAccording to Adebanjo, it is the turn of the South-East to produce the next president in the interest of fairness and equity.\nIt is not because they don’t know what is right.\nI said ‘he wants to make you President and yet he asked (Yemi) Osinbajo to contest?\nHe asked (Kayode) Fayemi to contest, he asked Amosun (Ibikunle) to contest?’ All in the West, why?"
  },
  {
    "headline": "Supreme court affirms nullification of Uba's candidacy in Anambra guber poll",
    "summarized_story": "The supreme court has affirmed the nullification of the participation of the All Progressives Congress (APC) and its candidate, Andy Uba, in the November 2021 Anambra governorship election.\nIn the judgment delivered on Tuesday, the apex court, in a unanimous decision by a five-member panel of justices, held that Uba did not emerge through a valid primary.\nThe court held that the primary which produced Uba was conducted in breach of the party’s guidelines.\nGeorge Moghalu, an aspirant in the APC primary election, had approached the court challenging the process and the outcome of the primary.\nThe appeal court, on February 23, said it found no reason to set aside the high court judgment that disqualified Uba and the APC."
  },
  {
    "headline": "Supreme court affirms nullification of Uba's candidacy in Anambra guber poll",
    "summarized_story": "The supreme court has affirmed the nullification of the participation of the All Progressives Congress (APC) and its candidate, Andy Uba, in the November 2021 Anambra governorship election.\nIn the judgment delivered on Tuesday, the apex court, in a unanimous decision by a five-member panel of justices, held that Uba did not emerge through a valid primary.\nThe court held that the primary which produced Uba was conducted in breach of the party’s guidelines.\nGeorge Moghalu, an aspirant in the APC primary election, had approached the court challenging the process and the outcome of the primary.\nThe appeal court, on February 23, said it found no reason to set aside the high court judgment that disqualified Uba and the APC."
  },
  {
    "headline": "Presidency: I won’t spend two years trying to decide what to do, says Osinbajo",
    "summarized_story": "Vice-President Yemi Osinbajo says if elected into office as president, he will “hit the ground running from day one”.\n“After I was appointed as vice-president, I had the unique opportunity of serving under President Muhammadu Buhari, who exposed me to practically every aspect of governance.\nHe exposed me to various things in government, and I had the opportunity to serve as acting president on several occasions,” he said.\nHe provided those opportunities such that one day, I will be called upon to serve in a higher capacity — to serve as president.\nThe truth of the matter is that everywhere where I have served, I’ve served with utmost loyalty, commitment."
  },
  {
    "headline": "Presidency: I won’t spend two years trying to decide what to do, says Osinbajo",
    "summarized_story": "Vice-President Yemi Osinbajo says if elected into office as president, he will “hit the ground running from day one”.\n“After I was appointed as vice-president, I had the unique opportunity of serving under President Muhammadu Buhari, who exposed me to practically every aspect of governance.\nHe exposed me to various things in government, and I had the opportunity to serve as acting president on several occasions,” he said.\nHe provided those opportunities such that one day, I will be called upon to serve in a higher capacity — to serve as president.\nThe truth of the matter is that everywhere where I have served, I’ve served with utmost loyalty, commitment."
  },
  {
    "headline": "EXTRA: Collect money if offered but make informed decision, Peter Obi tells PDP delegates",
    "summarized_story": "Peter Obi, a former governor of Anambra, has asked delegates of the Peoples Democratic Party (PDP) to “collect money if it is offered”, but they should make informed decisions while voting to elect the party’s presidential candidate.\nObi is one of the presidential hopefuls gunning for the ticket of the PDP.\nThe former Anambra governor spoke on Tuesday at a meeting with PDP stakeholder at the party’s secretariat in Ibadan, the Oyo capital.\nThe former Anambra governor said Nigerians need to make informed decisions about electing a president who will have the capacity to resolve the country’s problems.\nAdvertisementHe promised to replicate his achievements as governor of Anambra if elected as the president of Nigeria in 2023."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Twitter accepts Elon Musk’s $44 billion offer to buy the company. Users are bracing for changes",
    "summarized_story": "Twitter has accepted Elon Musk’s offer to purchase the company for roughly $44 billion.\nThe social media platform disclosed in a press release today that Musk purchased the company at $54.20 a share, the same price named in his initial offer on April 14, 2022.\nIn the initial SEC filing, Musk expressed his plan to take the company private.\nParag Agrawal, Twitter’s CEO, appeared to support the move, saying in the press release that “Twitter has a purpose and relevance that impacts the entire world.\nLet’s see how the new owner of Twitter deal with fake accounts, spam bots and authenticating all human beings of this platform."
  },
  {
    "headline": "How a search for infinite learning led Justin Irabor to the world of computer science",
    "summarized_story": "Full-stack engineer, TradeCoreHowever, despite the challenges and doubts about new ventures, he finds that he is fulfilled at the end of the day.\nFull-stack engineer, TradeCoreSoftware engineering called out to him when he was editor-in-chief at a startup, and every downtime had to be escalated to the technical team.\nI’m a full-stack engineer there.\nFull-stack engineer, TradeCoreAlthough Justin was sure about transitioning into software engineering, he didn’t escape the frustration that came with the move.\nBut Justin says his choice of Mogwai is to remind him to always take responsibility if he wants the best results."
  },
  {
    "headline": "Twitter may never be the same again",
    "summarized_story": "Nonetheless, I’m curious why he, a frequent Twitter user, would wake up one morning and say to himself, “I want to acquire Twitter.”I was kidding.\nAlso, he stated that he wants to combat trolls on Twitter and proposed changes to the Twitter Blue premium subscription service, such as lowering the price and banning advertising and adding Dogecoin as a payment option on Twitter.\nInterestingly, it appears he began considering the idea in 2017 when he declared his love for Twitter in a tweet.\nElon Musk takes over TwitterThe Twitter-Musk drama, which began with Tesla CEO, Elon Musk purchasing a 9.2 percent stake in Twitter, has seemingly ended.\nRecall that Twitter initially implemented a poison pill strategy that could thwart a takeover attempt by making it too expensive."
  },
  {
    "headline": "Why is Elon Musk buying Twitter?",
    "summarized_story": "Top on our list — surprise, surprise — is the Twitter sale.\nYesterday, April 25, 2022, Twitter’s board of directors announced that it had agreed to be acquired by an entity owned by Elon Musk, Tesla CEO, at approximately $44 billion.\nNot a bad return, considering the price hovered around $50 to $52 until trading on Twitter stock was stopped due to the impending sale.\nThis nicely segues into the upcoming Techpoint Africa Blockchain Summit holding on May 21, 2022, at Four Points by Sheraton.\nWhile you’re doing that, don’t forget to listen to all we discussed on Apple Podcasts, Google Podcasts, Spotify, or wherever you get your podcasts."
  },
  {
    "headline": "Bekonta Raises Awareness For More Blockchain User Education In Nigeria",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:As blockchain technology gains more popularity across Africa, Bekonta is raising awareness for more crypto user education in Nigeria.\nThe Need for Blockchain User EducationBekonta hopes that raising awareness about educating users on blockchain technology will accelerate crypto adoption as African entrepreneurs keep developing solutions and creating more use cases for cryptocurrencies.\nUser education will play a crucial role in helping mainstream crypto adoption in Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Bitnob Launches its APIs and Bitcoin Infrastructure to Enable Businesses to Scale",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nAccording to the CEO, Bernard Parah, “we want to enable developers to build global products on top of Bitcoin, Lightning, and Stablecoins leveraging our infrastructure.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "2023: I don’t owe anybody allegiance outside my oath of office – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo says he does not owe allegiance to anybody outside his oath of office and therefore does not see any reason why he should not run for the office of president of Nigeria in the 2023 elections.\nI owe nobody else any allegiance outside the oath.”Osinbajo said he was not in the state to campaign, but to inform his people of his intention to run for the office of the president.\n“The vice-president position is an opportunity to serve and I have served with utmost loyalty.\nWe have no doubt that you will do well as the president and we will support you”, Abiodun told Osinbajo.\n“I want to pray that you will come back to this Palace as a president and Nigeria will gain tremendously under your watch.”"
  },
  {
    "headline": "We have disbursed N482bn to MSMEs – DBN",
    "summarized_story": "Development Bank of Nigeria (DBN) has disclosed that it disbursed a total of N482 billion to Micro, Small, and Medium Scale Enterprises (MSMEs) since its inception, 65 percent of which were to women and youth-owned businesses.\nThe MD attributed the bank’s financial performance to “its robust corporate governance framework, business model as well as its top-notch enterprise risk management coupled with highly committed board of directors, management and staff.\nWe are a wholesale institution, so our direct customers are the financial institutions.\nFinancial institutions also do their credit appraisal, they take the credit risk and lend to MSMEs that they are sure will be able to repay,” he said.\nSo by and large, the lending to these MSMEs has not been negatively impacted in terms of NPL,” he added."
  },
  {
    "headline": "DSS warns of Boko Haram’s plans to bomb public places",
    "summarized_story": "The Agency, in a statement signed by public relations officer, Department of State Services!\nThe criminals, according to the Security agency are targeting crowded public places, especially during and after the holidays and festive celebrations.\nRead also: Six dead in Taraba market bomb blast“The objective is to achieve some self-serving interests as well as cause fear among the citizenry.\nThe Service, however, recalls its earlier warning that some groups and individuals were plotting to stoke violence in the country.\nThe Agency, therefore, advised patrons, owners and managers of the aforementioned public places “to be wary of this development and implement basic security measures to deter the threats."
  },
  {
    "headline": "Edo residents hail Obaseki for free medical outreach – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – Edo residents who are beneficiaries of the ongoing free medical outreach by the state government have commended Governor Godwin Obaseki for prioritizing the health and welfare of the people.\nThe five-day medical mission for over 4, 000 residents, is being organized in collaboration with the Association of Nigeria Physicians in the Americas (ANPA).\nThe outreach programme includes surgical interventions and treatments for heart, kidney, eye and other ailments.\nShe further stated, “I was examined and given medicated eyeglasses and some medications.”Irene applauded the state government for the access to effective and quality medical care.\nAnother beneficiary, Mr. Kasimi Godswork, who narrated his experience at the free medical outreach, noted, “My experience here today is wonderful and encouraging."
  },
  {
    "headline": "Police storm Edo forests to dislodge kidnappers, killer herdsmen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Police Command has changed its crime bursting-strategies as it has taken the ongoing renewed battle against criminals to the forests in order to dislodge major kidnappers and killer herders’ den in the state.\nChecks further revealed that the new order was in full compliance with the directive of the Commissioner of police, CP Abutu Yaro, deployed to Edo State few weeks ago.\nA drive round Benin City and some others in the state revealed that the police command has also increased police visibility and patrols for swift response to any untoward occurrence.\nA source at Odighi community in Ovia North East local government area of Edo State stated that police presence has pushed killer herdsmen away from their forest as inhabitants now go to their farms without fear of being attacked or killed by suspected herdsmen or kidnappers.\nInvestigation further revealed that the security arrangements at the divisional police headquarters have also been modified to ensure watertight security as the CP Abutu has zero-tolerance for lapses."
  },
  {
    "headline": "2023 Election: I can only contest if I am endorsed by the President-Jonathan – Nigerian Observer",
    "summarized_story": "The NIGERIAN OBSERVER gathered that Jonathan had informed some APC leaders that he would only join the presidential race if he was directly endorsed by the President, Major General Muhammadu Buhari (retd.).\nThe party chieftain stated, “I can tell you they are facing a tough task as far as Jonathan is concerned.\n“Another tough task the party may face is how it will convince other aspirants like Tinubu, Osinbajo, Amaechi, Umahi and Bello to step down.\nAnd for him to contest, he must have spent a year in the party and our primary will hold in the one month’s time.\nUntil he now proves to the whole world that he is a card-carrying member of the APC, it can’t be."
  },
  {
    "headline": "Falana condemns APC N100m nomination forms, As Party begins sale of forms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHuman rights Lawyer, Femi Falana, SAN, Sunday, condemned the APC for fixing the fees of its presidential nomination and expression of interest forms at N100m.\nHe, therefore, suggested that the APC and PDP should remove the “outrageous fees” and charge administrative fees of not more than N10,000 per aspirant.\nIn a statement he signed titled, ‘Illegality of outrageous nomination fees,’ he noted that the apparent endorsement of the controversial nomination fees by Buhari reeks of hypocrisy because, in 2014, he had told Nigerians that he had to borrow N27.5m to purchase his nomination form.\n“In this circumstance, political parties may only be permitted by law to charge administrative fees,” he said.\nConsequently, nomination forms for aspirants vying for the House of Assembly would be sold at the various state secretariats of the party nationwide while forms for other positions such as the House of Representatives, Senate, governorship and Presidency would be sold at the national secretariat, Abuja."
  },
  {
    "headline": "Carnival in Abia as top lawyer, Monday Ubani, buries father",
    "summarized_story": "It was a gathering of who is who in Nigeria at Awomukwu, Ikwuano local government of Abia State, weekend, on the occasion of the burial ceremony of late Pa Ubani Egbedubi Nwokocha, father of prominent human rights lawyer, Dr. Monday Onyekachi Ubani.\nSam Onuigbo, a member of the house of representatives, who said the late Pa Ubani lived a worthy life, eulogized Dr Ubani for being a true son of his father.\nC Maikyau SAN; Afam Osigwe, SAN; Chuka Ikwuazom, SAN; Emeka Ozoani, SAN; Okey Amaechi, SAN; S. Long Williams, former Governor of EBF; Uba Anene, current Governor of EBF, Ebitu Akpadiaha and Afam Ofomata.\nOther notable personalities at the event include, Justice Inyang Okoro of the Supreme Court of Nigeria; Chief Jugde of Abia State, Justice Onuoha Ogwe; Speaker Abia State House of Assembly.\nChinedum Orji; AG and Commissioner for Justice, Abia state, Mr Uche Ihediwa; Former Minister of State for Defence, Col. Austin Akobundu Rtd; Rear Admiral Ralph Osondu Rtd; Member representing Ikwuano State Constituency at the Abia House of Assembly, Hon."
  },
  {
    "headline": "Zenith Bank emerges Nigeria’s best bank, for third consecutive year",
    "summarized_story": "Zenith Bank Plc has emerged as the Best Bank in Nigeria in the Global Finance Magazine’s Best Banks Awards 2022, retaining the award for a third consecutive year.\nThe Nigerian lender was among other banks from 36 countries in Africa recognised as the prestigious Global Finance announced its 29th Annual Best Bank Awards Winners.\nThe editors of Global Finance made the selections after extensive consultations with corporate financial executives, bankers and banking consultants, and analysts worldwide.\nGlobal Finance considered factors that ranged from the quantitative objective to the informed subjective in selecting the top banks.\nFounded in 1987, Global Finance regularly selects the top performers among banks and other financial services providers, and the awards have become a trusted standard of excellence for the global financial community."
  },
  {
    "headline": "GTCO reports N43bn profit for Q1 2022",
    "summarized_story": "Further breakdown of the numbers showed that interest income grew by 9.09% from N52.43 billion to N57.20 billion in the current period.\nHowever, net trading income declined y-o-y by 5.03%, subduing bottom-line profit, as well as other expenses.\nThe bank earned N70.64 billion, from its lending business as Interest income grew by 17.14% from N60.31 billion.\nLoan losses during the period depreciated by 35.03%, but net interest income after impairments appreciated by 10.72% to stand at N55.99 billion.\nAlso, the group generated a total of N15.30 billion in net trading income on financial instruments representing a 5.03% decline year on year."
  },
  {
    "headline": "Border closure helped Nigeria improve food production capacity – Buhari",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, on Tuesday, said the decision to close the country’s land borders achieved results in terms improving food production.\nThe AfDB president had briefed him on steps being taken by the bank to avert food crisis in Africa, in the foreseeable future.\nAfrica will lose $11 billion worth of food, and coming shortly after COVID-19, that would be rather serious,” the AfDB President disclosed.\nHe added: “We were not ready for COVID-19, but we are now planning to avert food crisis on the continent.\nWe are behind you strongly, and we want to ensure Nigeria won’t feel the impact of the food crisis.”"
  },
  {
    "headline": "Abiodun To Osinbajo: Ogun Will Support Your Presidential Ambition",
    "summarized_story": "Ogun State governor, Dapo Abiodun, has declared that the state would support the presidential ambition of the Vice President, Professor Yemi Osinbajo, to enable him continue with some of the laudable projects of the President Muhammadu Buhari-led administration.\n“The Vice President present here is home coming.\nYou are serving this country and the president meritoriously for the last seven years as the vice president.\n“The Vice President position is an opportunity to serve and I have served with utmost loyalty.\nSpeaking on the ambition of the Vice President, the Alake of Egbaland, Oba Adedotun Gbadebo, attested to the competence of Osinbajo, saying: “the vice president has paid his dues and is eminently qualified to succeed as President."
  },
  {
    "headline": "BREAKING: At Last, Buhari Appoints Abdulganiyu As Fire Service Boss",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Jaji Olola Abdulganiyu as new Controller-general of the Federal Fire Service (FFS).\nLEADERSHIP learnt that until his appointment, Engr Abdulganiyu was the deputy comptroller general in charge of administration and supplies in the Federal Fire Service.\nThe new Fire boss, Abdulganiyu, commenced his career at the Federal Ministry of Works and Housing as Higher Technical Officer (HTO) in 1991.\nHe held several positions in the Ministry before his redeployment to the Federal Fire Service in 1999.\nJaji Olola Abdulganiyu was born on the August 13, 1965 , to the family of Alhaji Umar Olola Jaji in Ilorin, Kwara State."
  },
  {
    "headline": "C’River APC Group Berates Ayade Over Alleged Marginalisation",
    "summarized_story": "At an extraordinary meeting convened by the group held in Calabar on Tuesday, a chieftain of the party, Barr.\nEkpo Nsa, lamented how old party members, who toiled to keep APC together until Governor Ayade defected to the party, have been marginalised, calling on the state governor to correct the anomaly.\n“Our party the APC performed poorly in the just-concluded Akpabuyo, Ogoja/Yala federal constituency by-elections.\n“From the existing party register, those who recently defected to APC constitute about 10% of registered APC members in Cross River State.\nAmong other issues agitated for by the group were awarding of atleast 50% of elective offices available in the state to legacy and foundational members in the 2023 general elections."
  },
  {
    "headline": "C’River APC Group Berates Ayade Over Alleged Marginalisation",
    "summarized_story": "At an extraordinary meeting convened by the group held in Calabar on Tuesday, a chieftain of the party, Barr.\nEkpo Nsa, lamented how old party members, who toiled to keep APC together until Governor Ayade defected to the party, have been marginalised, calling on the state governor to correct the anomaly.\n“Our party the APC performed poorly in the just-concluded Akpabuyo, Ogoja/Yala federal constituency by-elections.\n“From the existing party register, those who recently defected to APC constitute about 10% of registered APC members in Cross River State.\nAmong other issues agitated for by the group were awarding of atleast 50% of elective offices available in the state to legacy and foundational members in the 2023 general elections."
  },
  {
    "headline": "Met Police Officer In Trouble For Participating In Nigeria’s Reality TV Show",
    "summarized_story": "The Met said: “In June 2019 PC Kareem left the UK and without permission took her work laptop with her.\nIn July 2019 PC Kareem began participation on the TV show and surrendered her work laptop to the show’s organisers.\n“After returning to the UK, PC Kareem failed to declare a business interest in relation to publicity and promotion of the TV show.\nShe lasted 77 days before being evicted from the Big Brother house.\n“Over the years a number of people who come out of the Big Brother house are reported in the media to have suffered mental health issues."
  },
  {
    "headline": "Orji Kalu drops out of prezy race, canvasses fairness to South East",
    "summarized_story": "Senator Orji Uzor Kalu has dropped out of the presidential race, saying he is disadvantaged as a south easterner.\nIn a long post on Facebook, the chief whip of the senate and former governor of Abia pricked the conscience of the two major political parties for excluding the South East from the presidency.\nI am committed to this pursuit, but I can’t make an official declaration to this regard without the full support of other regions.\n“The situation in Nigeria is that without the support of other regions, it would amount to a shadow chase for a South Easterner to be President”.\nHe said in the absence of zoning the presidency to either the South East or the North east, he will seek re-election to the senate and stay away from the presidential race."
  },
  {
    "headline": "Osun ritualists kill middle-aged woman, cut off her head, hands, legs",
    "summarized_story": "Three suspected ritualists have been arrested in Osun State for allegedly murdering a 53-year-old woman for ritual purposes.\nA statement issued by the Osun Police Command’s spokesperson, SP Yemisi Opalola said the tragic incident occurred at Ile-Ogbo area of the state.\nOpalola said that the three male suspects allegedly killed a 53-year-old woman, cut off her head, hands and legs, and removed her heart for money-making ritual.\nSimilarly, the police spokesperson said that the command also arrested a 27-year-old man, who was allegedly sending telephone messages to a lawmaker in Osun and a judge, threatening to kidnap them and their children.\nThe police spokesperson appealed to residents to support the police by providing the timely information needed to rid the state of crime and criminal elements."
  },
  {
    "headline": "BREAKING: Tinubu In Saudi For 2023 Spiritual Consultation",
    "summarized_story": "Bola Tinubu, a major presidential candidate and national leader of the All Progressives Congress (APC), has left the country for the Kingdom of Saudi Arabia to perform Umrah, the lesser hajj, and to pray for the peaceful conduct of the 2023 general elections and the continuation of Nigeria’s development.\nThere’ll be more…"
  },
  {
    "headline": "BREAKING: Governor Ben Ayade Joins Presidential Race",
    "summarized_story": "Ben Ayade, the governor of Cross River, says he has informed President Muhammadu Buhari of his desire to run for the presidency on the APC platform (APC).\nHe mentioned this during a meeting with Buhari on Tuesday while addressing with state house correspondents.\nAccording to him, the president instructed him to communicate with others about his plans.\nAyade stated that if the APC zones the presidential ticket to the south, he will reproduce what he has done in Cross River, and that he has what it takes to continue from where Buhari will stop.\nMore to follow.."
  },
  {
    "headline": "BREAKING: Tinubu Snubs President Buhari’s Invitation to Villa, Jets to S",
    "summarized_story": "Asiwaju Bola Tinubu, a presidential hopeful of the All Progressives Congress, has declined President Muhammadu Buhari’s invitation to Aso palace and flew to Saudi Arabia for a smaller hajj.\nTinubu arrived in Medina early Tuesday morning and is likely to arrive in Mecca by evening, according to reports.\nFormer Lagos State Governor and Presidential contender Bola Tinubu, former APC National Chairmen Dr John Oyegun and Adams Oshiomhole, and former Adamawa State Governor Murtala Nyako are among those invited to the meeting, according to an invitation letter seen by our correspondent.\nTinubu is expected to travel to Nigeria this weekend, according to sources close to him, to resume his nationwide consultations for his presidential bid.\nTinubu has been meeting with various National and APC stakeholders to inform them of his plans to become Nigeria’s next President and to share his vision for a better country that he is prepared to lead."
  },
  {
    "headline": "BREAKING: Orji Kalu Pulls Out Of Presidential Race",
    "summarized_story": "Senate Chief Whip and former Governor of Abia State, Sen. Orji Uzor Kalu, has thrown in the towel in his presidental bid, The Network gathered.\nAccording to Kalu, he is stepping down because without the support of other regions, it would be impossible for a South Easterner to be President of Nigeria.\n“The situation in Nigeria is that without the support of other regions, it would amount to a shadow chase for a South Easterner to be President.\n” In the absence of this zoning, I shall return to the Senate and stay away from the presidential contest.\n“The reality is that the North is more advantageous to win elections in this democratic setting.”"
  },
  {
    "headline": "Eid-el-Fitr: DSS uncovers plot to bomb worship, relaxation centres",
    "summarized_story": "The Department of State Services (DSS) has raised the alarm over alleged plot by some criminal elements to bomb worship and recreational centres as well as return the country to pre-2015 general elections during and after Eid-el-Fitr.\n“The objective is to achieve some self- serving interests as well as cause fear among the citizenry.\nThe bandits also shot to death a farmer simply called Tanko in Kuchi village and injured another person, while they made away with eight motorcycles and several cattle after attacking various communities in Kagarko local government area of Kaduna state.\n“One other person by name Tanko was killed in another village called Kuchi and another person sustained injury and in critical condition in the hospital.\n“We also call on all Nigerian governors to also replicate same in their respective states because the unemployed/unengaged youth is a ready tool for all vices and crime.”Share this: TwitterFacebook"
  },
  {
    "headline": "[Breaking] UEFA Champions League: Manchester City overcome Real Madrid in 7-goal semi-final thriller",
    "summarized_story": "Manchester City remain on course to reach a second successive Champions League final after beating Real Madrid in a thrilling semi-final first leg.\nKevin de Bruyne’s diving header and Gabriel Jesus’ calm finish gave City a 2-0 lead inside the opening 11 minutes.\nKarim Benzema volleyed home for Real, but Phil Foden’s header made it 3-1.\nCity have never won the European Cup or Champions League and lost 1-0 to Chelsea in last season’s final, but produced a superb performance to take an advantage to Spain.\nLiverpool face Spanish side Villarreal in this year’s other semi-final, with the first leg at Anfield on Wednesday."
  },
  {
    "headline": "[Breaking] Misconduct: CCT Chairman’s bid to stop Senate probe crumbles as court takes stand",
    "summarized_story": "Justice Inyang Eden Ekwo, in a judgment in the suit, ordered the CCT boss to go and appear before the Senate and answer questions on a public petition brought against him by an aggrieved citizen.\nThe judge held that his case seeking to stop the probe by the Senate lacked merit and was dismissed.AdvertismentThe alleged incident happened at the Banex Plaza in Abuja on March 29, 2021.\nThe court dismissed Umar’s suit on the grounds that it lacked merit as Umar had no cogent reason to stop the Senate from carrying out its constitutional functions.\nThe judge said that as a public officer administering a law relating to the conduct of public officers, Umar had no reason to institute the suit to stop the senate from probing a public petition seeking justice.\nThe judge further said that Section 2 of the Code of Conduct Bureau Act exposed Umar to an investigation by the National Assembly more than any other Nigerian."
  },
  {
    "headline": "A’Ibom govt. to use review of land administration law to tackle crime",
    "summarized_story": "By Emeka Samuel,UyoAkwa Ibom state government has said it would review its law of land administration to ensure speedy utilization of land allocations following the menace of hoodlums on abandoned government lands.\nEkong expressed regret that the necessary government implementation authorities and security agencies have not done enough to arrest the situation, hence the need for a review of the land administration law.\n“The power of land administration is with the government, if they have decided to allocate land for which ever purposes, that becomes law and it then becomes enforceable and whoever tries to play with the law will face judgement.\nThose are mainly the cases here, and encroachment on government owned land, selling of scraps and illegal motor parks by the Hausa people.\n“We have received reports about certain criminal acts going on around Nasarawa area."
  },
  {
    "headline": "Wema Bank debunks money laundering, bribery allegations",
    "summarized_story": "By Kehinde Ibrah9im, LagosWEMA Bank says its attention has been drawn to recent reports in the media regarding money laundering and bribery allegations on a customer’s transaction.\nIt said in a statement that the publication went ahead to mention the names of certain Wema Bank management staff who were allegedly involved in the said transaction.\nThe statement said, “The bank wishes to state categorically that there is no merit in the article, and it is a malicious publication against members of our staff and the bank’s customer.\nMIK/B/6/2022–Commissioner of Police vs. Adewole Isaac & Kingsley Ananwude, for alleged stealing and money laundering involving N1.7bn was struck out by Magistrate A.O.\nThe bank has already engaged its solicitors to institute appropriate legal action.”"
  },
  {
    "headline": "Works ministry concludes evaluation for the first phase of the VAC’s RFP Submissions",
    "summarized_story": "By Chioma NnodimFederal Ministry of Works and Housing has concluded evaluating proposals submitted for phase one of the Value-Added Concession, VAC, under the Highway Development and Management Initiative, HDMI.\nThe ﬁrst phase of the VAC under the HDMI seeks to concession 12 economically viable road corridors to technically and ﬁnancially capable private sector firms/consortia.\nThe 12 highways represent 1,963km or 5.6% of Nigeria’s 35,000km Federal Highway as follows:Benin-Asaba, Abuja-Lokoja, Kano-Katsina, Onitsha-Owerri-Aba, Sagamu-Benin and Abuja-Keffi-Akwanga Highways; the others are Kano-Maiduguri, Kano-Shuarin, Kano-Maiduguri, Potiskum-Damaturu, Lokoja-Benin, Enugu-Port Harcourt, Ilorin-Jebba, Lagos-Otta-Abeokuta and Lagos-Badagry-Seme Border.\nSpeaking, the Head, PPP Unit, FMWH, Abimbola Asein, disclosed that the Project Delivery Team, PDT, had concluded the evaluation of the Bidders’ technical and Financial proposals and proposed Preferred/Reserved Bidders had been identified.\nThe RFP documents were then issued out to the 18 prequalified bidders on October 29, 2021, through the HDMI portal."
  },
  {
    "headline": "PenCom approves Norrenberger’s acquisition of IEI-Anchor Pension",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE National Pension Commission on Tuesday approved Norrenberger’s acquisition of IEI-Anchor Pension.\nA statement from the firm on Sunday said by this move, Norrenberger through its acquisition of IEI Insurance, had become the largest shareholder of the Pension Fund Administrator.\nIt stated, “Norrenberger has obtained all necessary approvals from the Federal Competition and Consumer Protection Commission, the Securities and Exchange Commission, and the National Insurance Commission for the acquisition.\nIt would aggressively create and develop new opportunities for its stakeholders by utilising technology and other digital assets to revolutionise the pension and insurance markets.\n“We are looking forward to the exciting opportunities which this acquisition would provide.” Norrenberger is a leading, independent financial services group, the statement said."
  },
  {
    "headline": "Earnings: Unilever swings back to profitability",
    "summarized_story": "However, despite the challenges, Unilever Nigeria Plc, which has for considerable period seen losses in earnings, has, during the half year 2020 swung back to profitability.\nUnilever reported a loss after tax of N1.54 billion for the nine months ended September 30, 2020, against loss of N3 billion in 2019.\nUnilever Nigeria posted N714.780 million profit after tax for the half year ended June 30, 2021, against a loss after tax of N519.112 reported in 2020.\nUnilever Nigeria recorded a turnover of N58.7 billion in the third quarter of 2021, compared to N44.7 billion recorded in the corresponding period in 2020.\nThe firm saw a profit of N3.409 billion for the year against a loss of N3.965 billion recorded in 2020."
  },
  {
    "headline": "Buhari Receives Adesina In Abuja, Harps On Food Security",
    "summarized_story": "﻿President Muhammadu Buhari on Tuesday received the President of the African Development Bank, Dr Akinwumi Adesina at the State House in Abuja.\nTheir talks centred on food security for Nigeria.\nPresident Buhari applauded the $1.5 billion African Emergency Food plan developed by the AfDB, which is awaiting ratification by its board.\nIn a chat with State House correspondents, Governor Ayade revealed his presidential aspiration.\nShould he become President in 2023, the Governor hinges his focus on the tripartite areas of security, economy and power."
  },
  {
    "headline": "2023: Osinbajo Seeks Support In Ogun, Receives Royal Blessings",
    "summarized_story": "﻿Vice President Yemi Osinbajo on Tuesday met with critical stakeholders in Ogun state as part of his ongoing consultations towards the realisation of his 2023 presidential ambitionsAddressing the Remo traditional rulers, the traditional council and members of the All Progressives Congress in Remo, the Vice President said he was the best man for the job with a track-record of experience, patriotism and the fear of God.\nHe also met behind closed doors with party officials and delegate members to the presidential primary expected to take place in Abuja next monthREAD ALSO: Buhari Has Given Me Nod To Join Presidential Race – AyadeThe Vice-President was accompanied by Ogun State Governor, Dapo Abiodun.\nThe Governor commended Osinbajo’s purposeful leadership and expressed support for his aspiration.\nThe Akarigbo and Paramount ruler of Remo-land, Babatunde Ajayi, also gave his royal blessings and prayed for the success of the Vice President’s ambition."
  },
  {
    "headline": "Imo Govt Holds Mass Burial For Victims Of Illegal Refinery Explosion",
    "summarized_story": "The Imo State government on Tuesday conducted a mass burial for the victims of the explosion that occurred at the site of an illegal refinery in the state.\nREAD ALSO: Death Toll In Imo Illegal Refinery Explosion Rises To 110 – NEMA OfficialGovernor Hope Uzodimma was represented at the burial of the victims by the Chairman of Ohaji/Egbema LGA, Marcellinus Amadioha.\nHe explained that the relatives of the victims had come to claim the remains of those they could identify while scores of others were given a mass burial.\n“We are here today to do justice as a responsible government,” he told reporters at the scene of the incident.\nPresent at the burial included officials of the state ministry of health, Red Cross, NEMA, other government officials, and villagers."
  },
  {
    "headline": "DSS Alerts Nigerians Of Bomb Attacks On Worship, Relaxation Centres",
    "summarized_story": "Some criminal elements plan to return the country to the pre-2015 era reminiscent of Improvised Explosive Device (IED) attacks on soft and hard targets in parts of the country, the Department of State Services (DSS) has said.\nThe Public Relations Officer of the security agency, Dr Peter Afunanya, raised the alarm in a statement on Tuesday in Abuja.\nHe stated that while the DSS has received reports on cases of such incidents in some areas, it has uncovered a plot by suspected criminal gangs to forge an alliance.\nREAD ALSO: Lack Of Accountability Responsible For Nigeria’s Security Challenges, Says SarakiTheir objective, Afunanya explained, was to launch further attacks on critical infrastructure and other public places frequently visited, such as worship and relaxation centres, especially during and after the holidays and festive celebrations.\nThe DSS said it would continue to disrupt the trend and pattern of violent attacks and asked the people to go about their lawful businessesRead the full statement below:"
  },
  {
    "headline": "Gbajabiamila Seeks UK Parliament’s Collaboration On Insecurity, Others",
    "summarized_story": "The Speaker of the House of Representatives, Femi Gbajabiamila, has sought the support of the United Kingdom’s Parliament in the area of insecurity, parliamentary diplomacy, as well as political and economic prosperity in Nigeria.\nHe believes Nigeria remains a key player in global affairs and that its Parliament plays an important role in addressing issues through legislation.\nGbajabiamila spoke during a visit to the Speaker of the UK’s House of Commons, Lindsay Hoyle, in Westminster on Tuesday, saying the Nigerian House had used parliamentary diplomacy at different times and it worked.\n“We intend to work in close collaboration with your Parliament,” Gbajabiamila was quoted as saying in a statement by his media aide, Lanre Lasisi.\nHoyle, in his remarks, lauded the idea of legislative diplomacy, saying he was also disposed to soft diplomacy which he said parliaments across the world should consider as a different approach."
  },
  {
    "headline": "2023 Presidency: Gov Yahaya Bello pays N100m APC nomination fee, to pick forms Wednesday",
    "summarized_story": "One of the leading presidential aspirant on the ruling All Progressives Congress, Governor Yahaya Bello of Kogi State, will tomorrow, Wednesday, April 27, 2022, pick his expression of interest and nomination forms.\n“With the payment for the forms, Governor Bello’s teeming supporters should rest assured that he will be on the ballot in the 2023 presidential race.\nHe is always very loyal to his own and his priorities have always been Nigeria, Nigeria and Nigeria.\n“Though the race officially begins now, it is on record that Governor Bello has consistently been at the forefront of the contest.\nWith Senator Jonathan Zwingina as the Chairman of the Hope ’23 Yahaya Bello Presidential Campaign Organisation, and Hafsat Abiola-Costello as the Director-General, the tone is set for Hope to be actualized for Nigerians in 2023, the campaign organization said."
  },
  {
    "headline": "I will not give money to delegates",
    "summarized_story": "Former governor of Anambra State, Peter Obi has advised the People’s Democratic Party’s (PDP’s) delegates to collect the money offered by aspirants, but should think about their children’s future when voting for their preferred candidate.\nObi, a presidential aspirant in the PDP, who said he was on a mission to stop monetisation of the political process, noted that he would not give money to delegates.\nHe spoke in Akure when he addressed Ondo State delegates as part of his nationwide tour to woo delegates ahead of the primary election.\nHe said: “Collect the money, but when you go to vote, think about the future of your children.\nYou are delegates today, you cannot be delegates forever."
  },
  {
    "headline": "I am still consulting, Not an aspirant yet- Fayemi",
    "summarized_story": "Ekiti state governor and the chairman of the Nigeria governors forum, Kayode Fayemi says he is not a presidential aspirant as being reported in some media organisationsGovernor Fayemi stated this during a consultation visit to the governor of Ondo state, Mr Oluwarotimi Akeredolu at his office in Akure.\nHe said he is still consulting after which he will make his position known after moving round the country.\nHe added that Nigeria needs an experienced leader who is capable of improving on the developmental structure of president Muhammadu Buhari in next year’s election.\nFayemi said he is presently consulting monarchs other governors before declaring his intention officially for the number one seat of the country.\nThe Ekiti helmsman said he remains a bridge builder who has what it takes to develop Nigeria."
  },
  {
    "headline": "Supreme Court voids Andy Uba’s participation in Anambra gov poll -",
    "summarized_story": "The Supreme Court has voided the participation of Andy Uba in the last governorship election in Anambra State as the candidate of the All Progressives Congress (APC).\nA five-member panel of the court, held in a judgment on Tuesday, that the APC breached its guidelines for the conduct of primaries and thus, failed to conduct valid primary from which Uba emerged as the party’s candidate in the Anambra governorship election.\nThe Supreme Court affirmed the February 23, 2022 judgment of the Court of Appeal, which upheld the December 20,2021 judgment by Justice Inyang Ekwo of the Federal High Court, Abuja.\nThe apex court proceeded to dismiss the appeals filed by Andy Uba and the APC – marked: SC/CV/240/2022 and SC/CV/241/2022.\nIn the December 20, 2021 judgment, Justice Ekwo held among others that Uba was never a candidate in the election held on November 6, 2021 having emerged from an illegally conducted primary election held by the APC."
  },
  {
    "headline": "Wike Donates N200m To Kaduna IDPs As Rivers State Decries Delinquent Salaries – Trending With Ojy Okpe",
    "summarized_story": "Former U.S President Donald Trump branded Britain’s TV host Piers Morgan a ‘fool’ for believing the 2020 presidential election was ‘free and fair’ in a controversial interview on Morgan’s new Television show; Piers Morgan Uncensored.\nIn another development, the Governor of Rivers State Nyesom Wike during a consultation visit to Kaduna State over his presidential ambition on Monday donated N200 million Naira to victims of banditry in the state.\nFinally, a yet-to-be-identified policeman serving at the state police command headquarters in lagos has gone into hiding after allegedly shooting two businessmen and killing them on the spot during a birthday celebration."
  },
  {
    "headline": "Omoyele Sowore: A Good President Should Be Competent",
    "summarized_story": "Human Rights Activist, Omoyele Sowore declares bid to run for the presidential seat under the banner of the African Action Congress.\nSowore speaks with ARISE News on #TheMorningShow to discuss why he has decided to run for the highest official seat in the nation, and what he intends to do to help rebuild Nigeria."
  },
  {
    "headline": "Trump Held in Contempt, Fined $10,000 a Day Until He Complies with Probe",
    "summarized_story": "A New York judge on Monday held former President Donald Trump in contempt of court for not producing documents subpoenaed in the state attorney general’s civil probe of his business practices, and ordered Trump to be fined $10,000 per day until he complies.\nI hereby hold you in civil contempt,” the judge said, although Trump himself was not in the courtroom.\nTrump intends to appeal the contempt ruling, said his attorney Alina Habba.\nHabba told the judge that Trump did indeed comply with the subpoena, but that he did not have any documents responsive to James’ request.\nManhattan District Attorney Alvin Bragg said this month that probe is ongoing despite the departure of its two top lawyers."
  },
  {
    "headline": "In Escalation of Rhetoric, Russia Cites ‘Real’ Risk of Nuclear War",
    "summarized_story": "Moscow accused NATO of engaging in a proxy battle against Russia by arming Ukraine, saying this had created a serious and real risk of nuclear war.\n“NATO, in essence, is engaged in a war with Russia through a proxy and is arming that proxy.\n“Lavrov’s trademark over the course of 15 years or so that he has been the Russian foreign secretary has been that sort of bravado.\nIts defence ministry said it had destroyed six facilities powering railways used to deliver foreign weapons to Ukrainian forces.\nUkrainian forces have repelled five Russian attacks and killed just over 200 Russian servicemen, said the Ukrainian military command in the southern and eastern sectors."
  },
  {
    "headline": "UN Chief Embarks on Moscow Trip Amid Criticism",
    "summarized_story": "UN Secretary-General Antonio Guterres will start a difficult three-day trip to Russia and Ukraine on Tuesday amid criticism for the limited role played by the United Nations in the management of the crisis.\nBut the Secretary-General’s decision to kick off the first leg of his trip at the Kremlin has caused upset in Ukraine.\nlined diplomatically in the peace talks led by Turkey.\n“Mr Guterres is in a difficult position, because neither country is willing to hold peace talks,” said Rickli.\nAlthough China has called for peace talks, it has not condemned Russia’s actions in Ukraine."
  }
]