[
  {
    "headline": "ASUU: Ex-minister, lecturers disagree over varsities’ financial autonomy",
    "summarized_story": "A former Minister of State for Education, Chukwuemeka Nwajiuba, and some education experts have disagreed over financial autonomy for the nation’s universities.\nWhile Nwajiuba, in an interview with The PUNCH, stressed the need to grant public universities financial autonomy, the two experts, in separate interviews, said the government cannot absolve itself of its duty of funding education.\nExperts fault call for financial autonomy for varsitiesWhen our correspondent reached out to Osodeke on the issue of financial autonomy for the universities, he said, “You know our position on the matter.\nIt is the duty of the government to fund universities.\nWe are not at the point where you can say that the government should not fund universities."
  },
  {
    "headline": "INEC boss, others decry money politics during primaries",
    "summarized_story": "At the event, Jega warned INEC against altering the timetable for the 2023 elections, including shifting the deadline for primaries.\nYakubu said politicians using money to sway delegates to their sides during their primaries, the increasing insecurity across the country, and the menace of fake news had become matters of concern to INEC.\nHe, however, assured stakeholders that INEC would work with anti-graft agencies to reverse the trend.\nWhat political parties do is critical to what INEC does.\nIbrahim maintained that the open partisanship of Central Bank Governor, Godwin Emefiele, was sufficient enough to mar the credibility of the 2023 elections."
  },
  {
    "headline": "CIAN’s book prepares Nigerians ahead of 2023 election",
    "summarized_story": "One of the resource materials is a National Civic Project, titled, ‘Nigeria’s Next President’, a book recently presented to the general public in Abuja.\nSaid he, “For too long, we have yearned for a better tomorrow, better country and mourned a better yesterday, hoping that one day things will change and get better.\nBut rather, we are being confronted with new woes that demand Nigerians in their collective effort to rise up and do something.\n“Nigerians must believe in themselves, believe in their sovereign voting power, and trust the electoral process.\nAccording to him, “The problem we have is that God loves Nigeria greatly but man is messing up the country."
  },
  {
    "headline": "Firms organise maiden tennis tournament for pest control practitioners",
    "summarized_story": "In commemoration of World Pest day and to further create awareness on pest services in Nigeria and to create unity amongst pest control practitioners, Managing Director of Rotimax Integrated Services in conjunction with Pest Masters Limited is organizing a tennis tournament amongst practitioners.\nDisclosing this development in a press release made available to our reporter on Wednesday and jointly signed by Abbey Dollar of Pest Masters Pest Master International and Tolulope Caleb of Rotimax Integrated service, the tournament will hold on June 6 at Eko Club.\nAccording to the statement, both pest control companies are organisong the maiden editon of Tennis Tournament for Pest Controllers to create harmonious relationship amongst practitioners.\n“Pest Controllers will gather in a relaxing atmosphere not to discuss chemical formulation process or different ways to kill rodents but to compete healthily using table tennis as a means,” the statement states.\nJune 6 of every year is set aside to commemorate World Pest Day – sometimes called World Pest Awareness Day."
  },
  {
    "headline": "It’s time to rebuild Nigeria, together!",
    "summarized_story": "Having travelled all the 360 constituencies of Nigeria as a former Speaker of House of Representatives, Rt.\nThe federal government also applauded the governor’s leadership style on ease of doing business in Nigeria, being the second best performing state across the country.\nI plead with us to vote with nobility remembering that we have no other country than Nigeria and we are all in this ship together.\nNigeria is at a crossroads and needs to take effective decisions on its next political and governance steps and we believe that the Mutawallen Sokoto is capable to deliver!\nTogether We Shall Rebuild Nigeria!"
  },
  {
    "headline": "SDP Presidential Primaries: Prince Adewole Adebayo submits nomination form",
    "summarized_story": "Prince Adebayo, in white; with Dr Olu Agunloye, party secretary (first right), Solomon Lalung, beside Agunloye and Gabam, chair, behind the table, while receiving Adebayo’s form.\nAs the primaries, particularly the presidential of most parties draw near, the social democratic party SDP presidential hopeful, Prince Adewole Adebayo, at the weekend, submitted his nomination form to his party secretariat where he met mammoth crowd waiting to receive him.\nThe path we are about to begin formally is a path that leads to justice for all Nigerians and the choice of SDP is not random.\n“I will say that without the SDP I will not run for president.\nThe SDP Chairman Alhaji Shehu Gabam, in his remark, congratulated Adebayo and wished him luck even as he encouraged him to continue working hard, and that the party will keep doing its best."
  },
  {
    "headline": "Babies begin to die as hunger spreads in Somalia",
    "summarized_story": "Hacked-off thorn branches encircle two mounds of earth heaped over the tiny bodies of Halima Hassan Abdullahi’s twin granddaughters.\n“She is malnourished and her two babies died of hunger,” Abdullahi said at the Kaxareey camp which sprang up in January and now houses 13,000 people.\nMore than a quarter of a million people died then, mostly children under five.\nIn the camp, people make homes from orange tarpaulins and scraps of cloth and plastic stretched over domes of sticks.\nNow she cradles her youngest, a baby, as she waits to secure the girl a vaccination in Dollow."
  },
  {
    "headline": "Find killers of pregnant woman, children in Anambra – Adegboruwa to Soludo",
    "summarized_story": "Ebun-Olu Adegboruwa has joined the condemnation of the murder of pregnant Harira Jibril (Fatima) and her children.\nThe Senior Advocate of Nigeria (SAN) in a statement on Wednesday told Anambra Governor Charles Soludo to find the killers.\nThe deceased, from Adamawa, were gunned down on Sunday by the “unknown gunmen” at Isulo, Orumba North Local Government Area.\n“The life of the unborn baby that Mrs Jibril carried in her womb at the time of this dastardly act was also cruelly terminated”, he fumed.\nAdegboruwa consoled the victim’s family, Adamawa and Anambra States, expressing hope that the perpetrators would be caught and prosecuted."
  },
  {
    "headline": "Killings: Soludo declares curfew in eight LGAs of Anambra, bans okada, tricycle on Mondays",
    "summarized_story": "Anambra State Governor, Prof Chukwuma Soludo, has declared curfew in eight local government areas of the state as a result of insecurity, occasioned by gunmen attacks.\nReferring to criminal gangs in the broadcast, Soludo said: “The tiny but vicious gangs that have invaded our state and terrorising us are mostly in eight local governments in Anambra and three neighboring local governments in Imo State.\n“Until further notice also, motorcycles, keke and shuttle buses are banned from operating in these local governments on Mondays until the Sit-at-Home completely stops.\nThe youths of every community in the zone are hereby enjoined to assist the security agencies in the implementation of this policy and are mandated to seize any such motorcycle or tricycle on the spot.\nThe Okada, Keke, and shuttle bus union leaders must take responsibility to report their members who are involved in criminal activities."
  },
  {
    "headline": "Anambra: Osinbajo reacts to killing of Harira Jubril, her children",
    "summarized_story": "Vice President Yemi Osinbajo, has reacted to the killing of a pregnant woman, Mrs. Harira Jubril and her children in Anambra State, describing the crime as not only callous, but brutal and demeaning.\nHe expressed fears that the incident was capable of creating ethnic conflict across the country and hence must be condemned by all and sundry.\n“What took place in Anambra with the killing of a woman and her children demeans us all.\n“And I think we must all be careful and condemn it in the strongest possible terms, there is no excuse for it whatsoever.\n“How does anyone kill a woman and her children?"
  },
  {
    "headline": "2023: Nigerians react as Peter Obi dumps PDP, presidential ambition",
    "summarized_story": "Reactions have trailed the resignation of Peter Obi as member of the Peoples Democratic Party (PDP) presidential.\nDAILY POST had reported that Obi had on Wednesday announced his resignation from the opposition party.\nHere are some comments DAILY POST curated;@firstladyship, “Peter Obi will defeat the PDP and the APC in any party.\nNigeria must be great again.”@Yumilicious, “What Peter Obi just did today has just placed him on another level of political recognition and trust.\nAll hands must certainly be on deck.”@aplha_kingdom, “I told y’all Peter Obi stands no chance."
  },
  {
    "headline": "Fatima, kids’ murder: Stop IPOB killings – Christian leadership to Igbo leaders",
    "summarized_story": "The Christian Association of Nigeria (CAN) has condemned the killing of Lady Fatima and her children.\nCAN told South-East leaders to stop further elimination of innocent people by the Indigenous People of Biafra (IPOB).\nThe lives of Fatima and four kids were terminated at Isulo under Orumba North Local Government Area.\nTwo others were killed at Abatete in Idemili North Local Government Area and another at Nanka, Orumba North Local Government Area.\nThe body charged Igbo elites, political, religious leaders and traditional rulers to stop the bloodshed and tension in the region."
  },
  {
    "headline": "APC’s 28 presidential aspirants undergoing screening, says Adamu",
    "summarized_story": "While 25 contenders submitted forms, sources said 28 were undergoing screening.\nThe APC fixed screening of its aspirants for Monday, but put it off indefinitely on Sunday night.\nAdamu said: “The party has laid down its rules and regulations for the aspirants.\n“We have 28 aspirants for the presidential ticket and everybody knows that all of them cannot get the ticket.\nBut we pray we do the right thing.”On zoning, the chairman said the party would decide this after screening the aspirants."
  },
  {
    "headline": "Obi’s exit dims hope for Southeast PDP candidate",
    "summarized_story": "His exit may have dimmed hope for PDP presidential aspirants from the Southeast.\nHaving been frustrated in PDP, Obi is said to be weighing options between the SDP and the LP for his presidential aspiration, the source said.\nAn insider in Obi’s camp, who spoke with our correspondent, said Obi’s resignation from PDP did not amount to withdrawal from the presidential race.\nObi’s resignation letter was submitted to the National Chairman of the PDP, Dr. Iyorchia Ayu.\n“Consequently, am by this letter informing you of my withdrawal for the PDP presidential primaries."
  },
  {
    "headline": "Presidency to gunmen: tough military actions coming",
    "summarized_story": "By Bolaji Ogundele, Gbenga Omokhunu, Abuja and Nwanosike Onu, AwkaThe Presidency yesterday warned that it would deploy tougher military actions against persons responsible for the killing of Nigerians resident outside their states of origin.\nPresident Muhammadu Buhari warns the perpetrators of these acts to expect a tough response from the security forces,” the Presidency said in a statement.\nThe Presidency blamed the Indigenous People of Biafra(IPOB) and its security outfit, the Eastern Security Network(ESN), for the killings and other violent crimes in the Southeast.\nAlso yesterday, Anambra State Governor Charles Soludo condemned the Isulo killings and explained that they were not targeted at any tribe or religion.\nLeader of Miyetti Allah Cattle Breeders Association of Nigeria MACBAN in the Southeast Gidado Sidikki described the incident as horrible."
  },
  {
    "headline": "EFCC yet to quiz Okorocha 24hrs after arrest",
    "summarized_story": "More than 24 hours after its operatives whisked away former Imo State Governor Rochas Okorocha from his Abuja home, the Economic and Financial Crimes Commission (EFCC) has yet to interrogate him.\nHis daughter Uloma Nwosu, who stated this last night, said: “Since his(Okorocha) arrest, no official of the EFCC has spoken to him; he has not been interrogated, despite the desperation to arrest him.”Mrs Nwosu said after visiting the Senator representing Imo West Senatorial Zone, that the arrest of her father was more political than what the anti-graft agency wanted Nigerians to believe.\nShe said: “Everyone saw how they invaded his home shooting as if they were arresting a terrorist.\n“It is obvious now that the EFCC’s intention is to keep him until after the APC primaries, but we are relying on the judiciary to proffer justice as the last hope of the common man.”Mrs Nwosu appreciated Nigerians for their solidarity, saying that the Senator was in high spirits.\nThe EFCC operatives besieged Okorocha’s Maitama home for hours on Tuesday morning accused the former governor of jumping administrative bail earlier granted him."
  },
  {
    "headline": "Buhari urges Nigerians to unite against terrorists",
    "summarized_story": "President Muhammadu Buhari has charged Nigerians to unite in defiance against terrorists.\nIn a statement issued by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu, Buhari pointed out that the terrorists’ recent murderous attacks indicated that they were losing ground and strength.\nAccording to the statement, Buhari who has been mourning the victims of the killings said this was the time to put up a resistance.\n“President Muhammadu Buhari holds the victims in his thoughts and his prayers.\n“Fifty-six thousand (56,000) Boko Haram and ISWAP terrorists have surrendered to the authorities in a year and still counting."
  },
  {
    "headline": "Rivers PDP: Accountant General, Fubara, clinches governorship ticket",
    "summarized_story": "From TONY JOHN, Port HarcourtFormer Director of Finance and Accounts, Government House, Port Harcourt, Siminialayi Fubara, has emerged the governorship candidate of the People’s Democratic Party (PDP) for the forthcoming election in 2023.\nHe won the race at the primary with a total of 721 votes against other 15 aspirants that contested in the election.\nThe total number of delegates expected to vote was 980; 898 delegates accredited voted in the election.\nProfessor Walter Mboto, who led the Electoral Committee that conducted the election, had promised a transparent and peaceful exercise.\nEarlier in his opening remarks, the state PDP chairman, Desmond Akawor, had assured of a free, fair and most peaceful congress."
  },
  {
    "headline": "2023: Jandor emerges Lagos PDP governorship candidate",
    "summarized_story": "By Sunday AniConvener of Lagos4Lagos, Olajide Adediran, aka Jandor, has won the Peoples Democratic Party (PDP) gubernatorial primary election held yesterday in Lagos to emerge the party’s candidate for the 2023 governorship election in Lagos.\nAddressing delegates before voting started, thanked the aspirants that stepped down, saying that all of them were qualified to govern Lagos.\nAfter voting, Jandor polled 679 votes to beat his rival, Dakova, who got 20 votes.\nAccepting defeat, Dakova congratulated Jandor and promised to support him and take Lagos from the APC.\nAddressing the crowd after he was declared the winner, Jandor promised to use the ticket to unite Lagos PDP so that it could win Lagos governorship in 2023."
  },
  {
    "headline": "Insecurity: Soludo declares curfew in 8 Anambra LGAs",
    "summarized_story": "From Obinna Odogwu, AwkaAnambra State Governor, Prof. Chukwuma Soludo, on Wednesday, declared curfew in eight Local Government Areas of the state.\nThis is following the increasing level of insecurity in the state which has left many dead and property destroyed.\n“Until further notice also, motorcycles, keke and shuttle buses are banned from operating in these local governments on Mondays until the sit-at-home completely stops.\n“Local vigilantes should report such motorcycles or tricycles (keke) immediately, and they will be confiscated by government and the owner prosecuted.\n“The Okada, Keke, and shuttle bus union leaders must take responsibility to report their members who are involved in criminal activities."
  },
  {
    "headline": "Buhari mourns Borno, Katsina terror victims, vows perpetrators will face justice",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has described as senseless the loss of lives seen in Borno State and Katsina State over the last 48 hours.\nHe explained that 56,000 Boko Haram and ISWAP terrorists have surrendered to the authorities in a year and still counting.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nPremature Ejaculation & \"Small Joystick\" Resolved in 7Days... Click Here For Details .\n“Let us show them that Nigerians will not be swayed by terror."
  },
  {
    "headline": "Taraba delegates hurl stones at Gov. Ishaku, Deputy; boycott Primaries",
    "summarized_story": "From Sylvanus Viashima, JalingoDelegates of the People’s Democratic Party PDP in Taraba state on Wednesday stoned the convoy of the state Governor Darius Ishaku and his deputy Alhaji Haruna Manu at the Catholic Pastoral Centre Jalingo.\nDo not miss the Vital Information, it goes off in 2 days!\nOur correspondent reports that the deputy Governor had driven to the venue where the delegates, supposed to vote at the party’s Congress to elect a Gubernatorial candidate today are hosted, but the delegates in defiance drove the deputy Governor away with stones.\nMeanwhile, three aspirants have shunned the party Primaries over alleged irregularities and manipulations.\nThe aspirants, Professor Joseph Albasu Kunini, Mr Victor Bala Kona and Alhaji Ayuba Aminu Kotolo, were absent at the venue of the Primaries and their agents were also absent."
  },
  {
    "headline": "Breaking: Obi Dumps PDP, to Pursue Presidential Ambition in Another Party",
    "summarized_story": "*Okupe: Certainly, he will be on presidential ballotChuks Okocha in AbujaFormer governor of Anambra State, Peter Obi, Wednesday resigned his membership of the Peoples Democratic Party (PDP) as well as his presidential bid on the platform of the partyHis letter of resignation from PDP was submitted to the National Chairman.\nDr. Iyorrchia Ayu, by the Director General of the Peter Obi Campaign Organisation, Dr. Doyin Okupe.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Citing Inflationary Concerns, CBN Raises MPR to 13%, First Increase in 30 Months",
    "summarized_story": "Emefiele noted that CBN’s action was aimed at curbing inflation, on the one hand, and supporting growth of the economy, on the other.\nEmefiele said, “The concerns about the global rise in inflation and price levels; you all would have seen that the price of crude quite unexpectedly has been above $100 per barrel.\n“This has increasingly fragmented the global economy, imposing huge strains on the tepid post-pandemic recovery.\nAs a result, lead to a higher cost of production and a higher inflation rate.\n“Globally, inflation rate is also increasing and in Nigeria, while there are other factors that contribute to rising inflation, one of the ways of combating that is to also raise rates."
  },
  {
    "headline": "Hayatu-Deen: 2023 Presidential Election is PDP’s to Lose",
    "summarized_story": "Speaking exclusively to THISDAY in a presidential interview series, Hayatu-Deen, punctured arguments in favour of zoning or power shift.\nBut PDP had already deferred to wisdom by throwing its presidential ticket open, he stated.\n“Secondly, the election of 2023 is PDP’s to lose and if caution is not exercised, APC may actually snatch victory from the jaws of defeat if we have an acrimonious convention.\n“Thirdly was that the consensus arrangement was actually going to happen in stages.\nSecondly, it’s now almost a generation and after 23 years, we are still bogged down with power shift."
  },
  {
    "headline": "Sporadic Gunshots as EFCC Forcibly Arrests Okorocha for Jumping Bail",
    "summarized_story": "The police also fired teargas to disperse the supporters of the presidential aspirant of the All Progressives Congress (APC).\nTeargas was also used inside Okorocha’s residence by the operatives before whisking him off at 6:41pm, THISDAY gathered.\nOperatives of the commission had earlier yesterday stormed the Maitama, Abuja residence of Okorocha to effect his arrest.\nPolicemen and EFCC operatives are currently in my compound and possibly to whisk me away and my gate is blocked.\nThe agency also stated, “in the circumstances, the commission is left with no option than to effect the arrest of Senator Okorocha and bring him to trial.”The EFCC team was able to arrest Okorocha at 6:41pm in an operation that started around 10am."
  },
  {
    "headline": "Breaking: CBN Raises Interest Rate to 13%",
    "summarized_story": "James EmejoThe Central Bank of Nigeria (CBN) Tuesday resolved to raise the Monetary Policy Rate (MPR), otherwise known as the interest rate by 150 basis points to 13 per cent from 11.5 per cent.\nThis is the first time the apex bank has raised MPR in two and a half years.\nCBN Governor, Mr. Godwin Emefiele, at the end of the two-day meeting of the Monetary Policy Committee (MPC), said the move was in response to the global inflationary pressures.\nDetails later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Presidential Aspirant, Peter Obi Dumps Opposition Party, PDP, For Labour Party",
    "summarized_story": "Peter Obi, former Anambra governor and one of the top Peoples Democratic Party (PDP) presidential aspirants, has dumped the party for Labour Party.\nSaharaReporters had earlier in the day reported that Obi was planning to dump the opposition party.\nA source close to Obi said the former governor was leaving the PDP for the Labour Party.\n“He is leaving for the Labour Party,” the source told SaharaReporters.\nSee Also Politics Ex-Governor, Peter Obi May Dump Opposition Party, PDP After Presidential Primaries – Source“So, he (Obi) is under pressure to leave the PDP for the moneybags, we are currently looking to find another party to accept him."
  },
  {
    "headline": "BREAKING: Presidential Aspirant, Peter Obi Dumps Opposition Party, PDP, For Labour Party",
    "summarized_story": "Peter Obi, former Anambra governor and one of the top Peoples Democratic Party (PDP) presidential aspirants, has dumped the party for Labour Party.\nSaharaReporters had earlier in the day reported that Obi was planning to dump the opposition party.\nA source close to Obi said the former governor was leaving the PDP for the Labour Party.\n“He is leaving for the Labour Party,” the source told SaharaReporters.\nSee Also Politics Ex-Governor, Peter Obi May Dump Opposition Party, PDP After Presidential Primaries – Source“So, he (Obi) is under pressure to leave the PDP for the moneybags, we are currently looking to find another party to accept him."
  },
  {
    "headline": "How Ex-Aviation Minister, Stella Oduah Absconded From National Youth Service Corps, NYSC Scheme, Lied That She Completed Programme",
    "summarized_story": "The National Youth Service Corps has disclosed that the senator representing Anambra North, Stella Oduah, did not complete the mandatory one-year NYSC programme.\nThe group had written to the NYSC, alleging that some officials of the agency colluded with Oduah to bury the truth.\n\"After the orientation course, she absconded and never completed the national service.\nThe consequence of this is that she is not qualified for the issuance of the certificate of national service.\nMrs. Oduah was sacked by Mr. Jonathan following a series of reports done by SaharaReporters connecting her to a massive BMW vehicle scandal."
  },
  {
    "headline": "How Ex-Aviation Minister, Stella Oduah Absconded From National Youth Service Corps, NYSC Scheme, Lied That She Completed Programme",
    "summarized_story": "The National Youth Service Corps has disclosed that the senator representing Anambra North, Stella Oduah, did not complete the mandatory one-year NYSC programme.\nThe group had written to the NYSC, alleging that some officials of the agency colluded with Oduah to bury the truth.\n\"After the orientation course, she absconded and never completed the national service.\nThe consequence of this is that she is not qualified for the issuance of the certificate of national service.\nMrs. Oduah was sacked by Mr. Jonathan following a series of reports done by SaharaReporters connecting her to a massive BMW vehicle scandal."
  },
  {
    "headline": "44-year-old Jandor Wins Lagos PDP Governorship Ticket, To Challenge Tinubu’s Political Dynasty",
    "summarized_story": "Jandor defeated Dakova Kolawole after having 679 votes out of 709 available votes.\nJandor, in his speech, promised to unite members of the PDP in the state.\nMeanwhile, four aspirants had withdrawn from the race, leaving only Jandor and Kolawole.\nGovernor Babajide Sanwo-Olu of the APC is expected to win the ticket of the APC for the 2023 elections.\nHe was born in the Mushin area of Lagos to a Christian mother and a Muslim father."
  },
  {
    "headline": "EXTRA: Author of 'How To Murder Your Husband' found guilty of killing her husband",
    "summarized_story": "This might sound like a movie script, but a US court has found Nancy Brophy — a novelist who wrote the article, ‘How To Murder Your Husband’ — guilty of killing her husband.\nAdvertisementFollowing investigations, the police charged the novelist with second-degree murder — an offence that carries a life imprisonment sentence.\nThe prosecutors said Nancy moved to collect lucrative life insurance policies in the days that preceded the murder of her husband.\nAdvertisementShawn Overstreet, a deputy district attorney, said Nancy was the only person who had the motive to kill her husband.\nA Multnomah county jury, on Wednesday, found Nancy guilty of second-degree murder."
  },
  {
    "headline": "EXTRA: Author of 'How To Murder Your Husband' found guilty of killing her husband",
    "summarized_story": "This might sound like a movie script, but a US court has found Nancy Brophy — a novelist who wrote the article, ‘How To Murder Your Husband’ — guilty of killing her husband.\nAdvertisementFollowing investigations, the police charged the novelist with second-degree murder — an offence that carries a life imprisonment sentence.\nThe prosecutors said Nancy moved to collect lucrative life insurance policies in the days that preceded the murder of her husband.\nAdvertisementShawn Overstreet, a deputy district attorney, said Nancy was the only person who had the motive to kill her husband.\nA Multnomah county jury, on Wednesday, found Nancy guilty of second-degree murder."
  },
  {
    "headline": "'Recent developments make constructive contributions impossible' -- Peter Obi dumps PDP",
    "summarized_story": "Peter Obi, former governor of Anambra and presidential hopeful, has resigned his membership of the Peoples Democratic Party (PDP).\nThe former governor’s decision to leave the PDP comes days before the party’s presidential primary is scheduled to hold.\nIn the letter dated May 24, 2022, and addressed to the PDP national chairman, Obi said recent developments in the party do not support “constructive contributions”.\n“Consequently, I am by this letter informing you of my withdrawal for the PDP Presidential Primaries.\nUnfortunately, recent developments within our party make it practically impossible to continue participating and making such constructive contributions."
  },
  {
    "headline": "'Recent developments make constructive contributions impossible' -- Peter Obi dumps PDP",
    "summarized_story": "Peter Obi, former governor of Anambra and presidential hopeful, has resigned his membership of the Peoples Democratic Party (PDP).\nThe former governor’s decision to leave the PDP comes days before the party’s presidential primary is scheduled to hold.\nIn the letter dated May 24, 2022, and addressed to the PDP national chairman, Obi said recent developments in the party do not support “constructive contributions”.\n“Consequently, I am by this letter informing you of my withdrawal for the PDP Presidential Primaries.\nUnfortunately, recent developments within our party make it practically impossible to continue participating and making such constructive contributions."
  },
  {
    "headline": "Dele Momodu: I can’t compete financially with Wike or Atiku -- but I have my strategy",
    "summarized_story": "Dele Momodu, publisher of Ovation magazine, says he lacks the financial capacity to compete with Nyesom Wike, Rivers governor, and former President Atiku Abubakar ahead of the presidential primary of the Peoples Democratic Party (PDP).\nMomodu is one of the presidential hopefuls of the opposition party, and he will lock horns with Atiku and Wike, among others, at the primary of the party slated for May 28 and 29.\nSpeaking in an interview on Arise TV on Tuesday night, Momodu said he cannot match the duo “cash for cash”.\nThe seasoned journalist said he is relying on his strategy of interfacing with people and his interactions on social media.\nAdvertisementMomodu said: “I cannot compete money for money, cash for cash with Wike, or with Atiku."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Uber crosses 1 billion rides in Africa",
    "summarized_story": "American ride-hailing giant Uber recently announced that it has completed 1 billion rides and over 10 billion kilometres in terms of distance covered across all its markets in Africa.\nThe company first launched in Africa in 2013, establishing a presence in Johannesburg, South Africa.\nWithin the past year, Uber expanded to over 30 cities across its major markets: 21 in South Africa, 4 cities each in Kenya and Nigeria, and 2 in Ghana.\nUberEats, which launched in 2016 in South Africa with just 1,000 restaurants, now serves over 8,000 merchants across 36 cities in South Africa and Kenya.\nDespite the success Uber has recorded in Africa, the ride-hailing company has also had to weather a few hurdles."
  },
  {
    "headline": "Traction is building an ecosystem for Nigerian small businesses, starting with stopping fake credit alerts",
    "summarized_story": "Stories about fake credit alerts are the order of the day for many merchants.\nAnother angle to the problem is their inability to confirm whether these alerts are fake at first glance.\nIt also enables the merchant’s employee’s to confirm payments without having to call their employer.\nHowever, beyond this, Traction has a unique feature which helps merchants confirm that every alert is real.\nThough they would not found Traction until 2018, they had been having conversations regarding building something related for small businesses."
  },
  {
    "headline": "Canza Finance is a neobank enabling decentralised cross-border payments for Africans",
    "summarized_story": "L-R, Pascal Ntsama, Canza Finance CEO and Co-Founder and Oyedeji Oluwole, Canza Finance CTO and Co-Founder.\nFascinated by their operations, they decided to build their new startup, Canza Finance, around this group.\nUsually, these operators have networks that extend beyond the country, so they also help businesses make payments to their foreign partners.\nCross-border payments are not all the company does, as it also enables payments and peer-to-peer (P2P) transactions within the country.\nAccording to Ntsama, Canza has served 39 businesses and has a network of 203 FX agents across Nigeria."
  },
  {
    "headline": "$2 million to drive learning via WhatsApp",
    "summarized_story": "They changed the name of Africa Freedom Day to “African Liberation Day” and moved the date to May 25.\nWell, here’s today’s outline:Shaping the African mobility narrativeFoondaMate’s $2 million fundingTwitter CreateAMP’s $5.6 million seedShaping the African mobility narrative2019 will always be known as the calm before the storm that was the early stages of the COVID-19 pandemic.\nSo, yesterday, Tuesday, May 24, 2022, the startup announced that it had raised $2 million in seed funding to accelerate the global adoption of its Whatsapp and Facebook-based learning chatbot.\nAMP’s $5.6 million seedAMP Global Technologies, an African blockchain-based video entertainment platform, has raised a $5.6 million seed round.\nOne interesting tidbit is that the startup received $3 million in funding from friends, family, and angel investors."
  },
  {
    "headline": "Where and How to Buy and Sell cars, Spare parts on Carmart.ng",
    "summarized_story": "Nevertheless, its easy for anyone to know how to buy or sell cars on Carmart Nigeria.\nClick on the Sell ButtonThis is one of the final steps to buy and sell a car on Carmart Nigeria.\nWhy Choose Carmart Nigeria to Buy and Sell a CarThis car shop is recognized as a reliable place to buy and sell used vehicles.\nThis is the reason why you need to carefully study the tips on how to buy and sell a car on Carmart Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "MarkHack 1.0: LiveBIc Clinches First Prize, as Eko Innovation Centre and GDM Group call for Technological Innovation to Disrupt Marketing Landscape",
    "summarized_story": "The winners and runners-up will also get working space at Eko Innovation Centre, while all ten (10) finalists will have access to join the EIC accelerator program and GITEX Global pitch event in Dubai.\nUsing creativity, technology, and mentoring, resulting in prototypes, fresh new concepts, and innovative usages of tech for Marketing and Media.\nThe organizers of the event, Eko Innovation Centre and GDM Group revealed that over 500 individuals registered to participate in the hackathon from 72 locations, 5 countries (which includes Nigeria, California- USA, Kenya, Pakistan, and London), and 3 continents (Africa, Europe, and North America).\nL-R: Country Director Eko Innovation Centre, Edwin Ajogun; Founder of Eko Innovation Centre and curator of MarkHack 1.0, Victor Afolabi; Country representative of the Dubai World Trade Centre, Akande Ojo; Marketing Director & Executive Director on the company board, Anheuser-Busch InBev, Tolulope Tomori Adedeji; Zone AOA Asst.\nThey were also sub-grouped into 8 focus areas which include consumer experience, media consumption, consumer recruitment & interaction, trade & retail engagement, analytics and metrics, events marketing, media monetization, and content creation."
  },
  {
    "headline": "Businesses face higher loan costs on CBN’s rate hike",
    "summarized_story": "Nigeria’s first interest rate hike in six years will increase the borrowing costs of businesses in the short-term and may fail to address surging inflation in isolation.\nNigeria’s inflation rate jumped to 16.82 percent in April, the highest in eight months amid rising food and diesel prices.\nOn his part, Tope Fasua, CEO of Global Analytics, said the rate hike would slow down economic growth.\nAs a result, it would lead to higher cost of production and higher inflation rate,” he said.\n“However, the rising inflation rate needs some policy attention now so that it is not growth retarding,” he added."
  },
  {
    "headline": "Edo steps up efforts to contain Lassa fever in communities, to relocate civil service recreation centre – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government is ramping up efforts to contain the spread of Lassa fever across communities in the state, with a charge to environmental health officers in various local government areas to ensure zero incidence in their localities.\nThe Edo State Commissioner for Information, Andrew Emwanta, disclosed this while briefing journalists after the weekly Edo State Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, in Benin City.\nEmwanta said Governor Obaseki has also approved the relocation of the Edo State Civil Service Recreation Centre at Osadebe Avenue in the GRA axis of the state to a more suitable location.\nHe said, “According to the Edo State Commissioner for Health, Prof. Akoria Obehi, who is also a member of the State Taskforce on Lassa fever, the state has not had any new case or incident of the disease.\n“The Council has resolved that the environmental health officers of the various local government areas especially those in the affected area of Lassa fever will be held responsible for any new outbreak of Lassa fever."
  },
  {
    "headline": "Obaseki’s reforms: CBN rallies investors for devt of 1,590 hectares plantation – Nigerian Observer",
    "summarized_story": "With the global demand for oil palm on the increase amid supply disruptions, investors are taking advantage of the Edo State Oil Palm Programme (ESOPP), to deepen imprints in the country’s oil palm sector.\nAlready, Edo has about 120,000 hectares of oil palm plantation under development.\nAgenmonmen said work is in top gear to supply crude palm oil (CPO) and palm kernel oil (PKO) to the market through the current expansion programme of its palm plantation and mill.\nHe stated that there was no better time to invest in palm oil cultivation and production in Nigeria other than now, particularly against the backdrop of the recent ban on the exportation of palm oil and oil palm produced by the Indonesian government.\n“In recent times, people that normally import can no longer import palm oil and other products from Indonesia."
  },
  {
    "headline": "Obaseki parleys Christian bodies on Benin Master Plan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, met with the Christian community in the state, including the Pentecost Fellowship of Nigeria (PFN) and the Christian Association of Nigeria (CAN), to seek the collaboration of Christians and churches toward the realization of the Benin Master Plan and the Edo Regional Development Plan.\nObaseki, at an interactive session/stakeholders’ meeting with the organizations, at the Government House, Benin City, said his government will sustain reforms to improve the livelihoods of the people.\nThe governor said his administration has declared war on land grabbers in the state.\nMrs. Margaret Agbonifo assured the governor that churches in the State will key into the Benin Master Plan and Edo Regional Development Plan to ensure development in the state.\nWe are here to intimate you on what is going on and get your input because the impact of the master plan will benefit all.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki, U.S govt partner to sustain investment in agric, health, education, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki and the United States are exploring areas of investment to sustain the gains recorded by the Obaseki-led government in agriculture, economy, healthcare and education, among others.\nObaseki disclosed this when he received the United States Ambassador to Nigeria, Mary Leonard, who was on a courtesy visit at the Government House, Benin City.\nThe governor said his government is sustaining efforts at engendering sustainable growth and development and ensuring economic prosperity for Edo people.\nWhile reassuring the support of the United States, she further hailed the Obaseki-led government for its various programmes to positively engage Edo youths.\nLeonard further revealed that museums in the United States of America are intensifying efforts to repatriate Benin artifacts in their possession."
  },
  {
    "headline": "2023: Ibrahim Kashim wins Bauchi PDP governorship primary",
    "summarized_story": "Mr Ibrahim Kashim, has emerged candidate of the Peoples Democratic Party (PDP) in Bauchi State.\nThe News Agency of Nigeria (NAN) reports that Kashim, the immediate past Secretary to the State Government was only governorship aspirant in the party’s primary election.\nMr Hassan Grema, Chairman, PDP Governorship Primary Election Committee, announced this at the end of the exercise on Wednesday in Bauchi.\nKashim pledged to build on the existing structures and consolidate on the feat achieved by Mohammed’s administration in the state.\nNAN also reports that Mohammed has joined the presidential race on the platform of the PDP."
  },
  {
    "headline": "CBN addresses rumour of Emefiele’s sack",
    "summarized_story": "Head of corporate communications at the Central Bank of Nigeria (CBN), Osita Nwanisiobi, dismissed rumours Godwin Emefiele, governor of the bank, was sacked by President Muhammadu Buhari.\nReports had emerged in some online platforms on Wednesday to the effect that Emefiele was sacked by President Muhammadu Buhari over his alleged presidential bid.\nHowever, Nwanisobi who spoke to Nairametrics, denied the rumours, stating that “he is not aware of any sack of the CBN Governor”."
  },
  {
    "headline": "Sheriff Oborevwori wins Delta PDP governorship ticket",
    "summarized_story": "Sheriff Oborevwori, speaker of the Delta State House of Assembly, has won the Peoples Democratic Party (PDP) governorship primary in the state.\nOborevwori, said to be the anointed candidate of Ifeanyi Okowa, governor of the state, defeated other aspirants, including David Edevbie, who has the backing of Chief James Ibori.\nOborevwori who is representing Okpe constituency secured the party’s ticket to contest in 2023 after polling 615 votes.\nEdevbie came second with 113 votes, followed by James Manager, senator representing Delta South senatorial district whol polled 83.\nThe state deputy governor, Kingsley Otuaro scored 9; while former Attorney-General and commissioner for justice, Peter Mrakpo polled 9 andf Fred Majemite"
  },
  {
    "headline": "Osun 2022: APC Chieftain, Ilori canvases support for Oyetola’s re-election",
    "summarized_story": "By Sunday Oguntuyi, OsogboA chieftain of the APC, Honourable Dele Ilori, has stressed the need to for the people of Osun State to support Governor Adegboyega Oyetola and ensure his re-election in the upcoming July 16th 2022 Gubernatorial election.\nHe therefore, urged APC members in the constituency to stay committed and remain faithful to the party.\nHe urged the people of the state to continue to support Governor Oyetola and ensure they start mobilising votes for his re-election bid.\n“I want to appreciate the people of Ijesaland for their unalloyed support for the governor and the APC government in the state,” he added.\nHe urged the people of the town and Osun as a whole to come out en masses and cast their votes for Governor Gboyega Oyetola come July 16th 2022 for sustained development."
  },
  {
    "headline": "Osun 2022: I’m unapologetically committed to Oyetola’s re-election – Fayemi",
    "summarized_story": "By Sunday Oguntuyi, OsogboEkiti State governor and the chairman of Nigeria Governors Forum (NGF), Dr. Kayode Fayemi, has expressed support for the second term bid of Gboyega Oyetola, governor of Osun State.\nWhatever little it appears I have contributed in Osun does not come anywhere close to what Governor Oyetola has done for me.\n“It is only right that I come to Osun because those who know me know that it’s one Fayemi, one Oyetola.\nIn his remarks, Governor Adegboyega Oyetola lauded Governor Fayemi for his support over the years, adding “I am elated to welcome my dear brother to our State.\n“I pray that God will grant your heart desires and by God’s grace, southwest will produce the presidential candidate of our party”, Oyetola said."
  },
  {
    "headline": "JUST-IN: Gunmen Kill Soldier, Kidnap Expatriate In Ondo",
    "summarized_story": "Unknown gunmen have killed a Soldier and kidnapped an expatriate in Owo town, Owo local government Aparea of Ondo State.\nThe expatriate, according to a security source, was said to be a contractor in the ancient town, working on some of the state projects.\nThe source, who confirmed the attack, said the incident occurred around the Federal Medical Centre (FMC) area on Wednesday evening.\nDetails Later…"
  },
  {
    "headline": "Ex-NIMASA DG, Dosunmu, Withdraws From Lagos PDP Guber Race",
    "summarized_story": "A former director-general, Nigerian Maritime Administration and Safety Agency (NIMASA), Dr. Ade Dosunmu, has withdrawn from the ongoing Peoples Democratic Party (PDP) governorship primary election in Lagos State.\nDosunmu in a statement on Wednesday said his withdrawal was due to the anomaly in the delegates list brought for the purpose of conducting the exercise in Lagos.\nPhilip Olabode Aivoji in conjunction with five (5) gubernatorial aspirants complained about the delegates list brought for the purpose of conducting primaries in Lagos State.\n“He was emphatic that the list did not reflect the 3 Ad-Hoc delegates that emerged from the 245 wards of the state.\n“All efforts to get the National headquarters through the various committee, to correct the anomaly has yielded no result."
  },
  {
    "headline": "JUST-IN: Gov Soludo Declares Curfew In Anambra",
    "summarized_story": "Anambra State governor, Prof. Chukwuma Soludo, has declared a dusk to dawn curfew in eight local government areas of the State.\nSoludo made the declaration in a state broadcast on Wednesday evening in Awka, the state capital.\nThe curfew, according to the governor, will commence on Thursday, May 26, 2022 from 6:00pm to 6:00am.\n“No part of Anambra State (house, bush or forest) shall be used as camps for these criminals.\n“The state government expects the report of any progress made in this regard and shall support and reward you accordingly,” Soludo said."
  },
  {
    "headline": "JUST-IN: Gov Soludo Declares Curfew In Anambra",
    "summarized_story": "Anambra State governor, Prof. Chukwuma Soludo, has declared a dusk to dawn curfew in eight local government areas of the State.\nSoludo made the declaration in a state broadcast on Wednesday evening in Awka, the state capital.\nThe curfew, according to the governor, will commence on Thursday, May 26, 2022 from 6:00pm to 6:00am.\n“No part of Anambra State (house, bush or forest) shall be used as camps for these criminals.\n“The state government expects the report of any progress made in this regard and shall support and reward you accordingly,” Soludo said."
  },
  {
    "headline": "2023: Barde Wins Gombe PDP Gov’ship Primary Election",
    "summarized_story": "Gombe State chapter of the People’s Democratic Party (PDP) on Wednesday, picked Mohammed Jibrin Barde, from Gombe local government area, as its governorship candidate for the 2023 elections.\nBarde defeated his closest rival, Jamilu Isiyaku Gwamna, with 160 votes against 119.\nOther contestants were Dr Ali Gombe, Ya’u Gimba Kumo, Air Vice Marshall Shehu Adamu Fura (rtd), and Babayo Ardo.\nA total of 328 delegates cast votes during the election while two others were barred for turning up at the venue late after the completion of delegates’ accreditation.\nAn aspirant, AVM Adamu Shehu Fura (rtd), who came third, polled 18 votes, a former managing director of Federal Mortgage Bank, Ya’u Kumo, scored one vote while the remaining contestants scored no vote."
  },
  {
    "headline": "Peter Obi may have crossed to NNPP",
    "summarized_story": "Former Anambra governor Peter Obi, who resigned from the PDP on Wednesday, may be pursuing his presidential ambition in the New Nigerian Peoples Party (NNPP).\nHours after Obi’s resignation from PDP became public knowledge, he was seen hobnobbing with NNPP leader, Rabiu Kwankwaso in Abuja.\nA poster has even emerged of Obi and Kwankwaso being paired as president and running mate.\nThe NNPP has not given an official reaction to the political romance between it and Obi.\nObi, in his resignation letter, hinted that he was not leaving PDP to go on a terminal political vacation."
  },
  {
    "headline": "Tinubu, Atiku, Fayemi, Wike and other presidential probables",
    "summarized_story": "We can divine the future possibilities and challenges of our country from the outcome of these presidential primaries.\nCleaving substance from blanks in the APC, Bola Tinubu, former governor of Lagos; Kayode Fayemi, governor of Ekiti; Rotimi Amaechi, former minister of transportation, and Vice-President Yemi Osinbajo are the presidential probables.\nYou have done a lot for our people.’’Muhammad Badaru, governor of Jigawa, also endorsed Amaechi for the APC presidential ticket.\nWhile Amaechi will win some states in the presidential primaries, he may need more than that to become victorious.\nThe presidential probables in the party are Tinubu, Fayemi, Amaechi and Osinbajo."
  },
  {
    "headline": "Customers Accuse Wema Bank Of Using Their Data To Open Illegal Accounts Via ALAT App",
    "summarized_story": "They claimed they discovered the bank and its agents had been establishing unauthorised accounts for customers using information or data held by the bank.\nWhile the actual number of unauthorised accounts opened on behalf of unsuspecting Nigerians is unknown, Wema Bank was aiming to achieve “a million account in one day”.\nIf you look at that screenshot, the account was opened with my wife’s name and a new account number.\nHe stressed that the unauthorized accounts opened is “definitely an inside job.”, stating , “Customer’s details are compromised and they are being used to open new accounts.\nWema Bank also did not immediately respond to our enquiry on the matter."
  },
  {
    "headline": "Osun 2022: I’m unapologetically committed to Oyetola’s re-election — NGF Chair, Fayemi",
    "summarized_story": "Fayemi stated this in Osogbo during his consultation with the party faithful in Osun.\nWhatever little it appears I have contributed in Osun does not come anywhere close to what Governor Oyetola has done for me.\n“It is only right that I come to Osun because those who know me know that it’s one Fayemi, one Oyetola.\nIn his remarks, Governor Adegboyega Oyetola lauded Governor Fayemi for his support over the years, adding “I am elated to welcome my dear brother to our State.\n“I pray that God will grant your heart desires and by God’s grace, southwest will produce the presidential candidate of our party”, Oyetola said."
  },
  {
    "headline": "BREAKING: Peter Mbah emerges Enugu PDP guber candidate",
    "summarized_story": "A lawyer and financial analyst, Mr. Peter Mbah has emerged the Peoples Democratic Party, PDP, governorship candidate for the 2023 general election in Enugu State.\nThe PDP Enugu Guber Primary Election Panel from the National Working Committee of the Party was led by Senator Ambuno Zik Sunday.\nShortly before voting commenced, nine other aspirants pulled out from the race, saying they were now supporting Peter Mbah, who is the choice of the power brokers in the State.\nNews Direct reports that the aspirants made the announcement individually at the Nnamdi Azikwe Stadium, venue of the primary election.\nThis has now been confirmed with the turnout of events at the primary election."
  },
  {
    "headline": "EFCC Arrests Scott Tommey, Alleged Bribe Collector For Godswill Akpabio Over N200 Million Bribe",
    "summarized_story": "We learned that the arrest implicates Godswill Akpabio, who may soon be visiting the commission as the principal suspect to explain his role in the N200 Million bribe after the contractor petitioned him to the EFCC, who swung into action by arresting Mr Scott.\nAccording to credible sources, Akpabio, during his days as the Minister of Niger Delta Affairs, assured a contractor of payment by the Niger Delta Development Commission (NDDC) but could not fulfil his promise before he resigned.\nThe amount worth over N4 billion saw the contractor paying the sum of N200M in dollars equivalent to the former Minister of Niger Delta Affairs through Scott Tommey, a proxy allegedly used by the former governor in receiving kickbacks from contractors.\nIdentified as one of Nigeria’s silent billionaires, Scott Tommey, an Akwa Ibom State business tycoon, has been on the radar of the EFCC.\nHis company Osmoserve Global LTD was in the news in 2020 over its involvement in the questionable N4.9Billion Covid-19 intervention fund handled by the Niger Delta Development Commission (NDDC)."
  },
  {
    "headline": "Presidential ticket: APC national chairman, Adamu, breaks silence on consensus arrangement",
    "summarized_story": "Ahead of the All Progressive Congress (APC) presidential primaries scheduled for Sunday, the party’s leadership Wednesday said consensus arrangement on its choice candidate is not on the table for now.\nAPC National Chairman Senator Abdullah Adamu revealed this while speaking to some select journalists in Abuja.\nParty’s standBut speaking in an interview Wednesday at the party’s national secretariat, the APC national chairman, Senator Adamu, said “the party has its own rules and strategies, which I will not expose now.\nLawan had already scheduled some engagements for Wednesday one of which was to meet with the APC leaders and delegates in Borno state.\n“We are therefore here to condole with you, the government and people of Borno state for this loss."
  },
  {
    "headline": "2023: Bala Mohammed in top contention, Atiku, Saraki sure of victory",
    "summarized_story": "With former Anambra state Governor Peter Obi pulling out of the party, fourteen party chieftains are now left in the race for the PDP presidential ticket.\n“Loyalty to the party is also said to be another factor going for the Bauchi State governor.\nTambuwalMeanwhile, Governor Tambuwal has continued his consultation with an appeal to the 811 delegates to vote right and ensure their votes count.\nSpokesperson of the Tambuwal Presidential Campaign Organisation, Prince Daniel made the appeal Wednesday in Abuja.\nEkweremadu withdraws from primariesIn a related development, former Deputy Senate President Ike Ekweremadu, has withdrawn from the PDP governorship primaries."
  },
  {
    "headline": "Breaking: Roma beat Feyenoord, win inaugural Europa Conference League as Mourinho strikes new European record",
    "summarized_story": "Roma won their first major European trophy by beating Feyenoord in the inaugural Europa Conference League final.\nMourinho, who has won the Champions League, Europa League and the Uefa Cup, is the first manager to win all of Uefa’s major European trophies.\nThe Portuguese was criticised after Roma were embarrassed 6-1 in Norway by Bodo/Glimt in the group stage last October.\nBut this win continued the former Chelsea and Manchester United manager’s perfect record in European finals, having now overseen five wins in five finals.\nThis was Mourinho’s first trophy since winning the Europa League with Manchester United in 2017."
  },
  {
    "headline": "CIBN appoints Fidelity Bank’s Ken Opara as 22nd President",
    "summarized_story": "Fidelity Bank Plc Executive Director, South West and Lagos, Dr Ken Onyewuchi Opara will tomorrow take over the mantle of leadership of the Chartered Institute of Bankers of Nigeria, CIBN.\nDr Opara, who was elected a month ago, will be sworn in as the 22nd President and Chairman in Council of the highly revered Institute.\nA graduate of Finance from the University Of Nigeria, Dr opara has had a distinguished career in banking spanning over 30years.\nHis Bank, Fidelity Bank Plc is one of the leading financial institutions leveraging in this area .\nDr Ken Opara is married with four Children."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Gbemi Saraki Takes Charge As Amaechi Bows Out As Transport Minister",
    "summarized_story": "By Naomi DouglasMinister of State for Transport, Senator Gbemi Saraki, has now taken full charge of the Ministry of Transport, follwoing the formal resignation of Frontline presidential aspirant on the platform of All Progressives Congress APC, Chibuike Rotimi Amaechi, yesterday.\nIn a statement issued by Amaechi Presidential Media Committee, APMC, in Abuja yesterday, Amaechi in his resignation letter, expressed profound gratitude to the President for considering him fit to serve in his administration.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\n“Your Excellency, whilst humbly seeking your kind consideration of my request please accept the assurances of my highest esteem.”"
  },
  {
    "headline": "Delta-2 Progrmme: Nigeria , Czech Republic Flags off $16.2 million Bilateral Co-funding",
    "summarized_story": "By Eunice OrikeAs part of economic diversification priority of the present administration, the Federal Government and Czech Republic has launched a Call for Public Proposals on Delta-2 Programme worth $16.2 million Co-funding Research and Development R&D,project.\nThe Delta-2 Programme is the cooperation model of the Technology Agency of Czech Republic TA CR, running for the period from 2020-2025, through which TA CR sponsors applied research and innovation of manufacturing companies and innovative institutions.\nProf. Mohammed Sani Haruna said the Call for Public Proposal for the Delta-2 programme is one of the projects to be implemented under the Agreement between the two countries.\n“The PICTT would be sourcing technologies from the Czech Republic’s manufacturing companies; tertiary; research; and development institutions.\nThe Delta-2 Programme is uniquely designed to catalyze technology transfer and mobilize positive interventions and investments among private sectors and relevant stakeholders in Nigeria and Czech Republic for technology advancement."
  },
  {
    "headline": "Naira in free fall, now N600 to $1",
    "summarized_story": "By Our CorrespondentThe free fall of our national currency the Naira against major currencies continued yesterday as it weakened against the United States of America dollar to trade at N600 at the parallel market.\nThis non-stop depreciation of the Naira, which incidentally has been officially devalued thrice under this administration, is a pointer that the fiscal policies are not responding to market trends.\nAbubakar, a BDC operator in Ikorodu, told an online medium that buying and selling prices stood at N595 and N600 per dollar.\nA parallel market (street/black market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira."
  },
  {
    "headline": "UPDATED: Peter Obi Dumps PDP, Withdraws From Party’s Presidential Primary",
    "summarized_story": "Former governor of Anambra State, Peter Obi, has announced his resignation from the Peoples Democratic Party (PDP).\nHe announced his resignation from the party in a letter dated May 24 and addressed to the National Chairman of the main opposition party, Senator Iyorchia Ayu.\nBesides dumping the PDP, the presidential aspirant also said he was pulling out of the contest for the party’s ticket – barely three days to the exercise.\nHe explained that he took the decision to leave the party because of his firm commitment to rescuing Nigeria, even if the route differs.\nThe presidential aspirant informed the PDP chairman that he has since conveyed his resignation and withdrawal from the primary to the Chairman of Agulu Ward 2, his ward in Anaocha Local Government Area of Anambra State."
  },
  {
    "headline": "Fintiri, Makinde, Uba, Ikonne, Others Win PDP Governorship Primaries",
    "summarized_story": "Winners have emerged as the Peoples Democratic Party (PDP) conducts its governorship primaries across various states ahead of the general elections in 2023.\nEnugu PrimaryA former Commissioner for Finance in Enugu State, Peter Mbah, was also declared the winner of the PDP governorship primary in the state.\nAbia PrimaryElsewhere, the committee which presided over the governorship primary in Abia returned Professor Eleazar Ikonne as the winner of the contest.\nYobe PrimaryA former senatorial candidate, Sheriff Abdullahi, also joined the league of winners after clinching the PDP governorship ticket in Yobe State.\nKwara PrimaryIn Kwara, Abdullah Yahman emerged as the winner of the PDP primary."
  },
  {
    "headline": "Insurgents Killed 32 Youths In Kala-Balge – Borno Govt",
    "summarized_story": "At least 32 locals were killed over the weekend by Boko Haram/ Islamic State in West Africa Province (ISWAP) insurgents in Borno State, authorities have said.\n“Governor Babagana Umara Zulum is very disturbed by the unfortunate killing of fellow citizens at the weekend,” he said.\nAmid the controversy over the identities of the victims, Gusau clarified that they were not farmers but young men who engaged in gathering metals.\n“From the lawmaker’s briefing, a total of 32 youths are believed to have been killed by the insurgents,” the governor’s aide recounted.\nGovernor Zulum shares deeply the pains of bereaved families and the good people of Kala-Balge and is awaiting a full report by the end of today (Wednesday) before necessary measures,” Gusau briefed."
  },
  {
    "headline": "Channels TV Wins Brand Africa Award",
    "summarized_story": "Multiple award-winning station Channels Television has won the Brand Africa award as Nigeria’s Most Admired Media Brand.\nBrand Africa is a non-profit intergenerational organisation that inspires a brand-led African renaissance to transform the continent’s image.\nREAD ALSO: Channels Television Wins TV Station Of The Year For The 14th Time﻿Just last year, Channels Television won the Nigeria Media Merit Award (NMMA) for Best Television Station of the Year for the 14th time – the highest in the history of the award.\nThe award for Best TV Station, which recognises media excellence in the country, is one of the numerous recognitions Channels Television has received in Nigeria and globally for its programming, with an audience of over 20 million people within and outside the country.\nPrior to the award bagged in October last year, Channels Television last won the Best Station of the Year for 2018."
  },
  {
    "headline": "Two Women, Five Girls Abducted By Bandits Regain Freedom In Kaduna",
    "summarized_story": "Two women and five girls earlier kidnapped by bandits in Kaduna State have regained freedom, police authorities said on Wednesday.\nThe victims were rescued by operatives of the Kaduna State Police Command in the Kachia Local Government Area of the state.\nPolice Public Relations Officer in the state, Mohammed Jalige, confirmed the release to Channels Television via a statement.\nHe said the victims were abducted by the bandits in Mai Goro Village in Kachia on Sunday and taken to an unknown destination.\n“The victims are identified as Godiya James, 30yrs; Beauty Mandela, 23yrs; Elizabeth Markus, 13yrs; Alheri Maichibi, 13yrs; Lydia Iliya, 6yrs; Bridget Obadiah, 4yrs; and Amama Hassan, 3yrs; all of Mai Goro Village, Kachia LGA,” he said."
  },
  {
    "headline": "Owo Progressives Union Backs Samuel Ilesanmi Alade's aspiration",
    "summarized_story": "An Owo based youth socio-political group, Owo Progressive Union, has declared their unflinching loyalty and support for the Retired Military General, Rear Admiral Samuel Ilesanmi Alade (SIA)Already, the entire sons and daughters of Akoko extraction are backing the aspiration of Alade to represent Ondo North at the Red Chamber in the coming general election.\nAccording to a communique issued and signed by the group Publicity Secretary, Comrade Adekunle Fatai after the group meeting in Akure Ondo state capital, the group said the Oyin-Akoko born retired but not tired General has what it takes to transform the Senatorial district and beyond.\nIt’s time we invite personalty with exposure to restructure the district as several people has tried but failed us.\nHowever, the group also called on all Ondo North stakeholders beyond party affiliation and all dwellers that meant well for the district to support Alade’s aspiration for Ondo North can be great again.\nHe has what it takes to bring rapid development to the district like he has been doing even without political office.” he added."
  },
  {
    "headline": "Oyo NUJ demands justice for Reporter beaten by Police at PDP primary -",
    "summarized_story": "The Nigeria Union of Journalists Oyo State Council has demanded for justice from the State Police Command over the assault meted to a Reporter of the The Nation Newspaper, Yinka Adeniran at the Peoples Democratic Party gubernatorial primary in Ibadan.\nAdeniran is a reporter attached to the Oyo state Governor’s Office.\nThe incident took place at the primary election of the PDP between the State Governor Seyi Makinde and Mogaji Hazeem Gbolarumi.\nNoticing that The Nation reporter had gained entrance, the visibly enraged officer pounced on Adeniran, ordering other officers to ‘throw’ him out.\nThe quick intervention of other colleagues including the Oyo NUJ Chairman; chairman of the State Correspondents’ Chapel, Oluseye Ojo, leadership and members of the Oyo State Government House Press Crew saved the situation from becoming a full blown crisis."
  },
  {
    "headline": "Kwara PDP Set to start Governorship Primary -",
    "summarized_story": "597 delegates from the 16 local government areas of Kwara state are currently being accredited ahead of the Peoples Democratic Party governorship primary election.\nThey are Mr Ahman Pategi, Mr Yahman Abdullahi and Professor Yisa Gana.\nThe party had zoned its governorship ticket to Kwara north where the three aspirants hail from.\nHe is also the Proprietor of the Ahman Pategi University in Pategi in the Kwara North Senatorial district of the State.\nHe was also a former Gubernatorial aspirant on the platform of the All Progressives Congress in Kwara State and is based in Kaduna."
  },
  {
    "headline": "Makinde declared winner of PDP gubernatorial primary in Oyo",
    "summarized_story": "Governor of Oyo state Seyi Makinde has emerged the flag-bearer of the Peoples’ Democratic Party for the 2023 gubernatorial election in Oyo state.\nGovernor Makinde was declared winner by the Chairman of the Electoral panel Senator Ben Obi, who was represented by Abdullahi Maibasira.\nThe governor polled a total of 1040 votes out of the 1048 accredited delegates across the 33 local governments of the state.\nIn his acceptance speech, Governor Makinde expressed gratitude to members and delegates of the party across the state, thanking them for believing in him and the leaders of the party.\nSeyi Makinde vowed to keep all the promises he had made to the party and the people of the state."
  },
  {
    "headline": "Peter Obi Resigns from PDP, Withdraws From Party’s Presidential Primary",
    "summarized_story": "Former governor of Anambra State and presidential aspirant Peter Obi has resigned from the Peoples Democratic Party (PDP).\nObi, a former Anambra Governor, was until his resignation one of the 15 aspirants vying for the presidential ticket of the PDP.\nThe letter conveying his resignation from the party was submitted to the National Chairman of the PDP, Dr. Iyorchia Ayu.\nIn the letter, Obi gave reasons for his withdrawal from the presidential race.\nDirector General of the Peter Obi Presidential Campaign Organisation, Dr. Doyin Okupe noted that Obi took the decision following recent happenings within the party."
  },
  {
    "headline": "Obi Berates Politicians Spending Dollars+Pastor Gifts Flats To Deborah’s Parents- Trending With Ojy Okpe",
    "summarized_story": "Presidential aspirant on the platform of the Peoples Democratic Party, Peter Obi has berated politicians spending Dollars for their campaign stating that if elected president his administration will make sure that any government official caught spending dollars will be sent to jail.\nIn another development, the General Overseer of Omega Power Ministry, Pastor Chibuzor Chinyere has fulfilled his promise of assisting the parents of Deborah Samuelthe 22 year old student of Shehu Shagari College in Sokoto state who was set ablaze over alleged blasphemous comments by gifting them a 14 unit mini estate and a car."
  },
  {
    "headline": "It’s Absurd That In A Civilized Country Like Nigeria The EFCC Will Break Into Our Home – Uloma Nwosu",
    "summarized_story": "Uloma Nwosu, Daughter of Presidential Aspirant of The All Progressives Congress, Sen. Rochas Okorocha & Prince Ebunola Martins Spokeperson, Rochas Okorocha Campaign narrate their ordeal during the forceful entry and arrest of her father, hours to his party’s screening for the 2023 elections"
  },
  {
    "headline": "Lift Sanctions and We’ll Allow Food-Laden Ships Leave Blockaded Ports, Russia Says",
    "summarized_story": "Russia and Ukraine account for nearly a third of global wheat supplies, and the lack of significant grain exports from Ukraine ports is contributing to a growing global food crisis.\nWestern powers have been discussing the idea of setting up “safe corridors” for grain exports from Ukraine’s ports, adding that any such corridor would need Russian consent.\n“And it also requires the demining by the Ukrainian side of all ports where ships are anchored.\nEuropean Commission President Ursula von der Leyen said on Tuesday that Russia was using food supplies as a weapon with global repercussions.\nHe said that Russia would discuss the possibility exchanging prisoners with Ukraine once those who surrendered had been convicted."
  },
  {
    "headline": "The Concern of Politicians Shouldn’t Be About Buying Up Delegates – Dele Momodu",
    "summarized_story": "Share on TwitterShare on FacebookPDP Presidential Aspirant Dele Momodu speaks on expectations for the 2023 presidential election."
  }
]