[
  {
    "headline": "Oluwo: Traditionalists warn MURIC against interference, insist on march",
    "summarized_story": "The leadership of the Traditional Religion Worshippers Association in Osun State has told the Islamic group, Muslim Rights Concern, to stay off its matters with Oluwo of Iwo, Oba Abdulrosheed Akanbi.\nA statement by the TRWASO President, Dr Oluseyi Atanda, on Thursday explained that the grouse that the traditionalists had against Oluwo was because the royal father always hurl abuse on deities, monarchs and ancestors.\n“We are not fighting Islam or Oba Oluwo because he is a Muslim king.\nLet Oluwo bear his cross alone.\nTo all onisese across the world, as the President of TRWASO, I call on you today to be involved!"
  },
  {
    "headline": "Uncertainty over alleged abduction of five travellers in Niger",
    "summarized_story": "Armed men suspected to be bandits on Thursday abducted five people along Beji-Manta road in Shiroro Local Government Area of Niger State.\nIt was gathered that the people were waylaid and abducted on their way from the weekly Beji market by the bandits and whisked them away to an unknown destination.\nAn eye witness called in a radio phone-in programme to brief the Secretary to the Niger State Government, Ahmed Matane, of the abduction.\nUntil now that I am hearing this, we never knew of these people who were kidnapped along Beji-Manta road.\nWhen contacted, the Police Public Relations Officer of the Niger State Command, Wasiu Abiodun, said he was going to get back to our reporter but as of the time of filing this report, he has yet to take his calls."
  },
  {
    "headline": "NUPENG extends 14-day strike notice by 7 days",
    "summarized_story": "Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) has extended the 14-day ultimatum earlier given to the Federal Government by seven days.\nThis is contained in a statement issued by the union’s General Secretary, Mr Afolabi Olawale, on Thursday in Lagos.\nThe News Agency of Nigeria (NAN) reports that NUPENG had, on Nov. 15, issued the 14-day ultimatum to embark on a nationwide strike due to what it called non-implementation of an agreement earlier reached with government.\nNAN also reports that the issues at stake include non-payment of workers’ salaries and title benefits, among others.\nThe NUPENG general secretary urged the government and all other concerned entities to take advantage of the extension to do the needful."
  },
  {
    "headline": "Aisha Buhari wants strategic partnership to end GBV",
    "summarized_story": "The First Lady, Mrs Aisha Buhari, has called for more determination among stakeholders on strategic partnership to end female genital mutilation and gender based violence (GBV) in Nigeria.\nShe said her pet project, the Aisha Buhari Foundation under the Future Assured Initiative had continued to play a key role in supporting women and vulnerable children through the strategic partnership with the UNFPA.\nShe, however, noted that more needed to be done to advance the girl- child education and stop gender based violence as well as female genital mutilation.\nResponding, Kanem expressed delight with the first lady’s efforts through Future Assured Initiative in tackling gender based violence, girl child education.\nShe also commended the first Lady’s efforts at deepening advocacy to states to create awareness to end violence against women and girls."
  },
  {
    "headline": "I don’t like celebrating birthdays – Atiku Abubakar",
    "summarized_story": "Former vice president, Alhaji Atiku Abubakar, on Thursday said he does not like celebrating birthdays, as he clocked 75 years.\nAbubakar disclosed this in Bauchi while commissioning a 4.2 kilometres Gombe Road- Maiduguri Bypass, named after him by the state governor, Mr Bala Mohammed.\nI don’t normally like celebrating birthdays but here you are today, making me celebrate birthday with a birthday cake and birthday bull.\n“I want to appeal to the good people of Bauchi state to support their governor.\nIn other words, the development of the state is far more important to them than the differences in political beliefs."
  },
  {
    "headline": "28 ships discharge petroleum products, other items at Lagos ports",
    "summarized_story": "The Nigerian Ports Authority (NPA) said 28 ships at the Lagos ports were discharging bulk wheat, general cargo, container, bulk sugar, frozen fish, bulk gypsum, petrol, base oil and bulk urea.\nThe authority also said it was expecting 20 others laden with petroleum products, food items and other goods from Nov. 25 to Dec. 5.\nAccording to NPA, the ships are expected to arrive at the Lagos Port Complex.\nIt indicated that the ships contain general cargo, bulk sugar, container, base oil, bulk wheat, bulk urea, petrol, jet fuel, automobile gasoline, soda ash and ethanol.\nMeanwhile, another six ships that had arrived the ports were waiting to berth with petrol, bulk wheat, bulk sugar and bulk fertilizer."
  },
  {
    "headline": "EFCC vs JANG: Court declines application to reassign case to new judge",
    "summarized_story": "By Marie-Therese NanlongA Plateau State High Court sitting in Jos has refused to grant an application seeking to return the case file of a former Governor of Plateau state, Jonah Jang, to the State Chief Judge for a reassignment to a new judge.\nThe Court, presided over by Justice Christine Dabup turned down the request by the Lead Counsel to the Economic and Financial Crimes Commission, EFCC, Rotimi Jacobs, SAN.\nBut Justice Longji retired from service in December, 2019 , after which, the State Chief Judge, Justice Yakubu Dakwak reassigned the case to Justice Dabup who started a fresh hearing on the matter.\nOn Thursday, when the Lead Prosecution Counsel, Rotimi Jacobs,SAN sought the order of the court for a new Judge to take over the case.\nThe time is not so much on the side of the trial judge."
  },
  {
    "headline": "Amotekun rescues herdsmen abducted by suspected herders in Ondo [PHOTOS]",
    "summarized_story": "Operatives of the Ondo State Security Network Agency, otherwise known as Amotekun Corps rescued two herdsmen who were abducted by suspected Fulani herders in the state.\nThe two herdsmen, who were kidnapped in Supare Akoko in Akoko South West Local Government Area of the state by some herders numbering about seven, were rescued after spending some days in captivity.\n“This is a case of herdsmen being kidnapped by fellow Fulani men.\nThe two victims rescued by Amotekun are Musa Ibrahim and Amidu Ibrahim, they are siblings and they are herdsmen.\nWhile confessing to the crime, the arrested kidnapper said the gang which was made up of seven herders moved into the state from Edo State after passing through Okenne in Kogi State."
  },
  {
    "headline": "FCT Minister, Bello appeals to teachers’ union to call off strike",
    "summarized_story": "Malam Muhammad Musa Bello, the FCT Minister, has appealed to the FCT wing of the Nigerian Union of Teachers (NUT) to call off its ongoing strike, which currently affects primary schools managed by the Local Education Authorities (LEA) in the area councils.\nThe Minister made this appeal following the FCT Security Committee meeting for the month of November on Thursday.\nBello said that members of the FCT Security Committee also made similar appeals to the NUT to call off the strike, saying that the continuous industrial action was playing into the hands of elements determined to cripple the country.\nBello expressed optimism that interventions by the FCT Administration will give the desired security results going into the New Year.\nKnabayi said the demands of the teachers are in two folds, adding that teachers under the FCT Administration and those under the area councils are affected."
  },
  {
    "headline": "Igbo-Etiti Traditional Rulers pay solidarity visit to Gov. Ugwuanyi, hail him on peace, security, development",
    "summarized_story": "The Royal Fathers expressed delight that the peace, security and good governance entrenched in Enugu State by Gov.\nLed by the Chairman, Igbo-Etiti Traditional Rulers Council, HRH Igwe Michael C. Odo, the Traditional Rulers, said: “Your Excellency, we visit you today with pride and satisfaction.\n“We cannot thank you enough for the love you have shown to our people of Igbo-Etiti Local Government Area.\nUgwuanyi of “our loyalty and uncompromising support”, saying: “As Traditional Rulers we are irrevocably committed to the declaration of our people at the ‘Odinma Nsukka Rally at Nsukka High School”.\nMrs. Nkechi Ugwu-Oju, and Special Adviser to the Governor on Rural Development, Hon."
  },
  {
    "headline": "I don’t like celebrating birthdays – Atiku",
    "summarized_story": "Former Vice President, Atiku Abubakar, on Thursday said he doesn’t like celebrating birthdays, as he clocked 75 years.\nAbubakar disclosed this in Bauchi State while commissioning a 4.2 kilometres Gombe Road-Maiduguri Bypass, named after him by the state governor, Bala Mohammed.\nI don’t normally like celebrating birthdays, but here you are today, making me celebrate my birthday with a birthday cake and birthday bull.\n“I want to appeal to the good people of Bauchi state to support their governor.\n“It is a working opposition party."
  },
  {
    "headline": "Nigeria Police AIG, Garba Umar elected Interpol VP for Africa",
    "summarized_story": "Assistant Inspector General of Police, Garba Baba Umar, Head of INTERPOL National Central Bureau (NCB) in Nigeria, has been elected Vice President (Africa).\nUmar is now an Executive Committee Member of the International Criminal Police Organization (ICPO).\nThe AIG was elected on Thursday at the 89th INTERPOL General Assembly in Istanbul, capital of Turkey.\nGarba is criminal investigator and police manager with over thirty years of experience at national and international levels.\nThe top cop will be in office as VP for Africa till 2024, coordinating INPERPOL operations targeted at ensuring a safe continent."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Be wary of politicians, Anambra govt cautions EFCC",
    "summarized_story": "The Anambra State government has cautioned the Economic and Financial Crimes Commission (EFCC) not to dance to the tune of some politicians who are after Governor Willie Obiano for no just cause.\nIt berated the anti-graft agency for placing the governor on its watch list for what it called politically motivated reasons.\nThe EFCC has not given any reason for placing the governor on its watch list except that he is under investigation.\n“Governor Obiano is out of the country currently.\n“Governor Obiano has a whole four months to remain in office as the Anambra State Chief Executive."
  },
  {
    "headline": "Lagos CP assures Lagosians of crime-free Yuletide",
    "summarized_story": "The Commissioner of Police in Lagos State, Hakeem Odumosu, on Thursday assured residents of the state of a crime-free Yuletide celebration.\nThe CP also commended the people of the state, the media and sister security agencies for their cooperation with the police in combating crime.\n“The police will not relent in making the state safe as patrols will be intensified to check the activities of hoodlums.\n“Lagos is the safest state in Nigeria now.\n“Everyone comes to Lagos to do business and the police will make sure lives and properties of law-abiding citizens are safe,” he said."
  },
  {
    "headline": "10 die of cholera in Ebonyi, Taraba",
    "summarized_story": "Ten persons have reportedly died of cholera in Ebonyi and Taraba states.\nNine of the casualties were reported in Ndiegu Amagu Ikwo council of Ebonyi, while one was recorded in Taraba with 13 others hospitalised in the Jen-Ardido community of Karim Lamido council.\nThe State Ministry of Health, WHO, State Primary Heath Development Agency and Ikwo Local Government Council were informed.\n- Advertisement -“These bodies dispatched health officials to the area and samples were obtained and sent to the laboratory.\nAll the tests were negative of cholera.”"
  },
  {
    "headline": "Three-year-old, five others abducted in Ondo, Niger",
    "summarized_story": "By Justina Asishana, Minna, and Friday Otabor, AkureSix persons have been abducted by gunmen in Niger and Ondo states.\nWhile five were whisked away by bandits in Niger, a three-year-old was kidnapped in Ondo.\nThose abducted in Niger were returning from the weekly Beji market when the gunmen attacked them in Shiroro council of the state.\nSecretary to the Niger State Government, Alhaji Ahmed Ibrahim Matane, learnt of the incident on a radio programme when a listener called in to report it.\nRead Also; Body of abducted man found in Kwara forestThe three-year-old girl was abducted in front of an army barracks gate on Ondo Road, Akure, the state capital."
  },
  {
    "headline": "Danish frigate kills four pirates in Gulf of Guinea",
    "summarized_story": "COPENHAGEN, Nov 25 (Reuters) – A Danish frigate has killed four pirates in waters south of Nigeria in an operation to protect shipping in the Gulf of Guinea, the Danish military said on Thursday.\nThe Esbern Snare, deployed last month to the Gulf of Guinea amid heightened security risks from pirates, on Wednesday spotted a fast-moving vessel carrying eight suspected pirates near a number of commercial ships, the Danish military said.\nAfter the frigate fired warning shots, the pirates opened fire on Danish navy special forces, who in turn shot and killed four pirates and wounded one, the Danish military said in a statement.\nThe remaining four pirates were taken on board the frigate, and no Danish personnel were hurt in the incident, the military said.\nIt was the first time the frigate had opened fire during its current mission to the Gulf of Guinea, the spokesman said."
  },
  {
    "headline": "IPOB activities reducing in South East – DHQ",
    "summarized_story": "In the course of these operations, troops amicably resolved farmers/herders clashes and averted bloody clash between 2 families over land disputes.\nIn Delta State, some feats were recorded at different locations in; Warri South, Warri South West, Ovwie, Warri North and Isoko North LGAs.\nOther locations include; Ohaji LGA of Imo, Bakassi LGA of Cross River State and Ukwa West LGA of Abia State.\nAlso, troops recovered a total of 27 assorted arms and 586 rounds of assorted ammunition in the course of the operations.\nSECESSIONISTS’ ACTIVITIESThe IPOB/ESN elements activities in the South East drastically reduced in recent times."
  },
  {
    "headline": "Bandits rape 30 Niger women in one day",
    "summarized_story": "No reason was given by the bandits for their action as source close told Daily Sun that their mission was just to rape women in the communities, including young girls.\nThe affected communities where the bandits carried out their heinous crime include Dnasa, Iburo, Pelele, Gofa and Nakogbe, all in Shiroro local government area.\nEvery woman or girl sighted by the bandits was dragged to her room and raped in broad daylight.\nIt was gathered that about 30 women and girls were raped, with two to three bandits raping one woman during the sex extravaganza as they moved from one community to another in their motorcycles.\nThere has not been any statement from the security agents on the latest incident which has left many of the affected women and girls traumatised."
  },
  {
    "headline": "Most bank frauds perpetrated by insiders – EFCC",
    "summarized_story": "By Ginika OkoyeThe Economic Financial Crimes Commission (EFCC) declared in Abuja, yesterday, that most frauds in the banking sector were perpetrated by insider Information, Communication Technology (ICT) employees.\nHead, Cybercrime Section of the EFCC, Mr Abbah Sambo, made the declaration at a national seminar on Banking and Allied Matters for judges.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe said that most banking sector fraud handled by the commission showed that bank employees aided the acts.\nHe also expressed regret at the increasing rate of cybercrime in spite of efforts by the commission to tackle it."
  },
  {
    "headline": "Economic affairs gets lion’s share as Sanwo-Olu presents N1.38trn budget estimate for 2022",
    "summarized_story": "By Sunday Ani and Lukman OlabiyiThe Lagos State Governor, Babajide sanwo-Olu, yesterday, presented a budget estimate of N1.38 trillion to the House of Assembly with economic affairs sector getting the lion’s share of N325,014,165,395 or 23.41 percent and the social protection sector the least with N6,109,828,1603 or 0.71 percent.\nThe general public services got N235,400,815,610 (16.96 percent), Public order and safety, N61,710,691,428 (4.45 percent) and environment, N49,846,704,975 (3.59 percent) in the appropriation bill tagged Budget of Consolidation.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe noted that the challenging environment required that government focused its interventions in areas of greatest social impact to achieve the greatest good for the greatest number in the shortest possible time.\nAccording to the governor, the budget comprises total revenue of N1.135 trillion and a deficit financing of N203.126 billion."
  },
  {
    "headline": "Buhari Presides over Security Meeting, Decorates ADC With New Rank",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Thursday presided over the National Security Council (NSC) meeting at the State House, Abuja.\nThe meeting is being attended among others by the Vice President Yemi Osinbajo, Chief of Staff to the President, Prof Ibrahim Gambari; National Security Adviser (NSA), Major General Babagana Monguno (rtd) and the Chief of Defence Staff (CDS), General Leo Irabor.\nThe three service chiefs of Army, Navy and Air Force as well as the Inspector General of Police, Usman Alkali Baba, are also attending the meeting.\nThe President is expected to be briefed about latest security developments across the country.\nBefore the commencement of the meeting, President Buhari with the assistance of Vice President Osinbajo decorated his Aide De Camp (ADC), Lt Col Yusuf Mukhtar Dodo, with his new red neck rank of Collonel."
  },
  {
    "headline": "Nigeria Will Survive Its Challenges, Despite Escalating Grievances, Says Fitch",
    "summarized_story": "The UK-based organisation stated this in a report titled, “Nigeria Country Risk Report – Q1- 2022,” which also included a 10-year forecast to 2030, obtained yesterday.\n“Our core view is that the Nigerian state will survive these interlocking challenges, although they will weigh on growth by deterring investment and impeding private consumption.\nThere is a downside risk, however, that ethno-religious divides will eventually lead to the break-up of the state.\nThe Fitch report said this position by the northern governors would likely exacerbate rifts with southern political leaders from both parties who believe that it would be their turn to control the presidency.\n“The latter generally are poorer and would potentially see a fall in their VAT revenue, which under the current system effectively leads to southern states cross-subsidising northern ones."
  },
  {
    "headline": "Ayiri Arraigned for Allegedly Stealing Olu of Warri’s Crowns worth N2bn",
    "summarized_story": "Sylvester Idowu in WarriThe deposed Ologbotsere of Warri Kingdom, Ayirimi Emami, was yesterday arraigned at a Warri Chief Magistrates’ Court over alleged stealing of two royal crowns worth N2 billion belonging to Warri Kingdom.\nAccording to the charge sheet with No: MW/178 C/ 2021, Emami, along with others now at large, allegedly committed the offence about 11.30 pm on March 30 this year in the house of the Olu of Warri.\nSimilarly, police prosecuting counsel, SP Sunday Irabor, said the discretion of granting bail lied within the court.\nHe, however, called for a stringent bail condition, stressing that the sureties must be reliable.\nMr. Fabius Jemide Atie held watching brief on behalf of Olu of Warri Palace."
  },
  {
    "headline": "Infrastructure, Education Top Sanwo-Olu’s N1.39trn 2022 Budget for Lagos",
    "summarized_story": "The budget proposal, christened, “Budget of Consolidation,” would be the last full-year fiscal plan of the state before the next general election.\nAbout N823.4 billion, representing 59 per cent of the 2022 budget, was earmarked for capital expenditure.\nHe said, “Year 2022 budget is the next step on our journey to true and sustainable greatness in Lagos.\n“It is in this light that we are presenting the Year 2022 Budget of Consolidation with a size of N1,388,285,459,990.51.\nObasa promised a speedy and meticulous vetting of the 2022 budget proposal."
  },
  {
    "headline": "National Carrier, Nigeria Air, to Commence Operations April 2022",
    "summarized_story": "•FG, Nigerians own 51 equity shares, to generate 70,000 jobsDeji Elumoye in AbujaThe national carrier, Nigeria Air, is set to begin flight operations by April 2022.\nSirika explained that in the new national carrier, the federal government will have five percent equity shares, Nigerian entrepreneurs 46 per cent equity shares, while the expected international strategic partners would have 49 equity shares.\nSirika stressed that FEC had given approval for the new national carrier.\nAccording to him, “Today (Wednesday) in Council, civil aviation presented two memoranda.\nOne of the memos is approval of the outline business case for the establishment of the national carrier and this is the sixth time the memorandum appeared before Council."
  },
  {
    "headline": "Shame Of A Nation: How Nigerian Military Paid Bandits N20Million To Protect Buhari — Report",
    "summarized_story": "A report by the Wall Street Journal has revealed how the Nigerian Air Force coordinated ransom payments to armed bandits in exchange for an anti-aircraft gun seized from the Nigerian Army.\nAccording to the report, a Nigerian Air Force official paid N20 million to bandits in Rugu Forest in a bid to secure President Muhammadu Buhari from being the victim of insecurity that has escalated since the beginning of his regime.\nHowever, the report had not stated the period the deal was made nor when the presidential trip was planned.\nIt is not clear why the Nigerian military opted to settle the bandits with the said amount.\nHowever, it may not be unconnected to the bandits' strikes against the military."
  },
  {
    "headline": "Shame Of A Nation: How Nigerian Military Paid Bandits N20Million To Protect Buhari — Report",
    "summarized_story": "A report by the Wall Street Journal has revealed how the Nigerian Air Force coordinated ransom payments to armed bandits in exchange for an anti-aircraft gun seized from the Nigerian Army.\nAccording to the report, a Nigerian Air Force official paid N20 million to bandits in Rugu Forest in a bid to secure President Muhammadu Buhari from being the victim of insecurity that has escalated since the beginning of his regime.\nHowever, the report had not stated the period the deal was made nor when the presidential trip was planned.\nIt is not clear why the Nigerian military opted to settle the bandits with the said amount.\nHowever, it may not be unconnected to the bandits' strikes against the military."
  },
  {
    "headline": "Shame Of A Nation: How Nigerian Military Paid Bandits N20Million To Protect Buhari — Report",
    "summarized_story": "A report by the Wall Street Journal has revealed how the Nigerian Air Force coordinated ransom payments to armed bandits in exchange for an anti-aircraft gun seized from the Nigerian Army.\nAccording to the report, a Nigerian Air Force official paid N20 million to bandits in Rugu Forest in a bid to secure President Muhammadu Buhari from being the victim of insecurity that has escalated since the beginning of his regime.\nHowever, the report had not stated the period the deal was made nor when the presidential trip was planned.\nIt is not clear why the Nigerian military opted to settle the bandits with the said amount.\nHowever, it may not be unconnected to the bandits' strikes against the military."
  },
  {
    "headline": "How Bandits Carried Out Attack On Catholic Seminary In Kaduna, Kidnapped Students—Official",
    "summarized_story": "SaharaReporters had reported that bandits raided and abducted a yet-to-be-ascertained number of students from the school, which is a Catholic-run major seminary in the local government area.\nHowever, the Secretary of the local government area, Salleh Banda confirmed the kidnap on Tuesday, adding that armed bandits invaded the school chapel around 8.45pm on Monday.\nHe said the bandits met seven students in the school Chapel and that four were able to escape, Daily Post reports.\nSee Also Breaking News BREAKING: Bandits Attack Catholic Seminary In Kaduna, Kidnap StudentsHe said, “The bandits gained entrance to the school chapel around 8.45pm on Monday night.\n\"As they forced the seven students to go along with them, the police guarding the school heard the conversation and started shooting sporadically."
  },
  {
    "headline": "How Bandits Carried Out Attack On Catholic Seminary In Kaduna, Kidnapped Students—Official",
    "summarized_story": "SaharaReporters had reported that bandits raided and abducted a yet-to-be-ascertained number of students from the school, which is a Catholic-run major seminary in the local government area.\nHowever, the Secretary of the local government area, Salleh Banda confirmed the kidnap on Tuesday, adding that armed bandits invaded the school chapel around 8.45pm on Monday.\nHe said the bandits met seven students in the school Chapel and that four were able to escape, Daily Post reports.\nSee Also Breaking News BREAKING: Bandits Attack Catholic Seminary In Kaduna, Kidnap StudentsHe said, “The bandits gained entrance to the school chapel around 8.45pm on Monday night.\n\"As they forced the seven students to go along with them, the police guarding the school heard the conversation and started shooting sporadically."
  },
  {
    "headline": "Malami kicks as Anambra says he's behind EFCC's action against Obiano",
    "summarized_story": "Abubakar Malami, the attorney-general of federation (AGF), has kicked against the accusation of the Anambra government on the recent action of the Economic and Financial Crimes Commission (EFCC) against Wille Obiano, governor of the state.\nIt is not yet clear why the anti-graft agency placed Obiano on a watchlist but sources said the Anambra governor is being investigated by the commission.\nAdvertisement‘MALAMI IS THE MASTERMIND’Speaking in an interview on Channels Television on Thursday evening, Adinuba said the EFCC is supervised by the minister of justice, and alleged that Malami is behind the EFCC’s action against Obiano.\n“This is the first time in Nigeria’s history that we’ve seen the attorney-general of the federation being a member of a political campaign.\nGwandu said it amounts to “shadow chasing, flimsy excuses and concoctions of jittery minds” to suggest that Malami influences certain operations."
  },
  {
    "headline": "Malami kicks as Anambra says he's behind EFCC's action against Obiano",
    "summarized_story": "Abubakar Malami, the attorney-general of federation (AGF), has kicked against the accusation of the Anambra government on the recent action of the Economic and Financial Crimes Commission (EFCC) against Wille Obiano, governor of the state.\nIt is not yet clear why the anti-graft agency placed Obiano on a watchlist but sources said the Anambra governor is being investigated by the commission.\nAdvertisement‘MALAMI IS THE MASTERMIND’Speaking in an interview on Channels Television on Thursday evening, Adinuba said the EFCC is supervised by the minister of justice, and alleged that Malami is behind the EFCC’s action against Obiano.\n“This is the first time in Nigeria’s history that we’ve seen the attorney-general of the federation being a member of a political campaign.\nGwandu said it amounts to “shadow chasing, flimsy excuses and concoctions of jittery minds” to suggest that Malami influences certain operations."
  },
  {
    "headline": "'It was like Hiroshima site' -- Ikeazor seeks stiff penalties for oil companies after Nembe spillage",
    "summarized_story": "Sharon Ikeazor, minister of environment, says oil spillage in the Niger Delta region caused “massive” devastation to the communities, describing it as a Hiroshima site.\nThree weeks ago, a pipeline explosion in Nembe, Bayelsa state, led to oil spillage across 45 communities — spewing oil into the water bodies for many days.\nThe minister said clean-up has started but small compared to the level of devastation the oil spill caused the communities.\nSo, now, work has to start on the proper clean-up.”According to her, the ministry is engaging other relevant government agencies to institute stiffer punishments for companies involved in oil spillage in the country.\nIkeazor explained that there is a bill amending the law establishing the National Oil Spillage Detection and Response Agency (NOSDRA) to build its capacity and give it “the needed teeth to bite.”"
  },
  {
    "headline": "'It was like Hiroshima site' -- Ikeazor seeks stiff penalties for oil companies after Nembe spillage",
    "summarized_story": "Sharon Ikeazor, minister of environment, says oil spillage in the Niger Delta region caused “massive” devastation to the communities, describing it as a Hiroshima site.\nThree weeks ago, a pipeline explosion in Nembe, Bayelsa state, led to oil spillage across 45 communities — spewing oil into the water bodies for many days.\nThe minister said clean-up has started but small compared to the level of devastation the oil spill caused the communities.\nSo, now, work has to start on the proper clean-up.”According to her, the ministry is engaging other relevant government agencies to institute stiffer punishments for companies involved in oil spillage in the country.\nIkeazor explained that there is a bill amending the law establishing the National Oil Spillage Detection and Response Agency (NOSDRA) to build its capacity and give it “the needed teeth to bite.”"
  },
  {
    "headline": "Nigeria's Garba Umar elected INTERPOL vice-president for Africa",
    "summarized_story": "Garba Umar, an assistant inspector-general of police, has been elected as the vice-president of the International Criminal Police Organisation (INTERPOL) for Africa.\nAdvertisementUmar was elected on Thursday at the 89th INTERPOL general assembly which was held in Istanbul, Turkey.\nUmar is the head of INTERPOL National Central Bureau (NCB), Nigeria.\nFrank Mba, police spokesperon, in a statement on Thursday, described the AIG as one of Nigeria’s “finest criminal investigators and professional strategic police managers”.\nMba said Umar would use his wealth of experience in coordinating INTERPOL operations in Africa."
  },
  {
    "headline": "African female founders need access to high-impact mentors",
    "summarized_story": "Beyond funding, African female entrepreneurs need access to high-impact mentors and who are willing to open up their network and teach what they know.\nWhile FirstCheck argues that African women in tech are “over-mentored” and “under-funded”, early-stage female founders need some handholding.\nSo Ouffata founded The African Tech Vision (ATV) to create and open up entrepreneurial pathways for ambitious African female founders and executive leaders.\nEmpowering African female entrepreneurs at scaleThe African Tech Vision is a free entrepreneurial programme designed to support early-stage African female founders and help them achieve their goals.\nFor Ouffata, betting on African female founders is a personal decision that fits into the larger vision of The African Tech Vision program."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "Nembe oil leak: Local incapacity worsens spills",
    "summarized_story": "The oil spill at the Santa Barbara oil field, OML 29, located in Nembe Local Government Area of Bayelsa State, has gone uncontained after three weeks because Nigeria lacks the capacity, the head of the government agency combating oil leaks has said.\nThe Bonga oil spill in 2011 reportedly sent over 40,000 barrels of oil into 20 riverine communities across Akwa Ibom, Bayelsa and Delta states in Nigeria.\nIt was only contained with the invitation of Oil Spill Response Limited (OSRL), the largest international industry-funded cooperative that exists to respond to oil spills wherever in the world.\nRead also: President Buhari laments oil spill in BayelsaHowever, the task of containing the spill is a bit complicated.\nOver the course of three weeks, it is conceivable that thousands of oil barrels may have leaked from the facility."
  },
  {
    "headline": "Oil firms ignore Nigeria, pump fresh dollars into Libya",
    "summarized_story": "“I want to contribute to Libya’s comeback,” Patrick Pouyanne, TotalEnergies’ CEO, said at this week Libya’s Energy & Economic Summit 2021, the country’s first prominent energy forum in over 10 years.\nGlobal oil producer, Shell, is among the big producers that recently kick-started a disinvestment drive from its oil assets in the Niger Delta.\nTotal operated under a joint venture partnership with Shell and Italian firm Agip Oil Company in the OML 17 — both of which are also disinvesting from the project.\nBeyond lack of investments, a new wave of security threats in Nigeria has emerged that could further dent Nigeria’s production.\n“Lately, there have been groups in communities in the Niger Delta, who while seeking for cash and attention, have been vandalising oil pipelines,” a Nigeria-based official at a Western oil company said."
  },
  {
    "headline": "Retail rising but no jobs to show",
    "summarized_story": "New jobs created in the small-scale retail and trade sectors following COVID-19 pandemic have not been as productive with only a few yielding secure earnings, a recent World Bank report notes.\nIt also notes that the general shift towards retail and trade is unlikely to represent an acceleration of structural transformation or a true shift towards more productive work outside of agriculture.\nStructural transformation is the transition of an economy from low productivity and labour-intensive economic activities to higher productivity and skill-intensive activities.\nDeveloped economies like Hong Kong, Singapore, South Korea and Taiwan, also known as Asian Tigers, are fuelled by exports and rapid industrialisation, thanks to structural transformation.\nSo, it is highly unlikely for structural transformation to take place,” he said."
  },
  {
    "headline": "SEC laments resurgence of Ponzi schemes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Securities and Exchange Commission (SEC) has frowned at the resurgence of Ponzi schemes and illegal fund managers in the country’s financial sector.\nHe regretted that the upsurge of the schemes had undermined the reputation of the financial markets and dampened investors’ confidence, among other things.\n“SEC firmly believes that the country’s capital market can attain its potential if market operators and participants contribute their respective quotas to the growth.\n“The demography of investors in the country’s capital market shows that our young population do not participate in the capital market, and only few Nigerians invest in the capital market.\nAhmed said the workshop was in line with the commission’s Capital Market Master Plan (CMMP)."
  },
  {
    "headline": "NDLEA dismisses budget padding allegation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The National Drug Law Enforcement Agency, (NDLEA) has dismissed insinuations in some reports that its proposed 2022 budget was padded with N4.5 billion.\nThe Director, Media and Advocacy, NDLEA, Mr Femi Babafemi, said this in a statement on Wednesday in Abuja.\nBabafemi said the agency had been inundated with calls and messages since Tuesday, seeking clarification on an alleged insertion of N4.5 billion into the NDLEA’s proposed budget being considered by the Senate.\n“It is public knowledge that President Muhammadu Buhari magnanimously approved the construction of barracks for NDLEA over a period of four years, starting from 2022 fiscal year.\n“The typo error has since been corrected and the budget cleared on Tuesday by the Senate Committee,” he said."
  },
  {
    "headline": "Land Grabbing Allegation: Secretary, Benin Traditional Council, Frank Irabor debunks media reports – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Secretary , Benin Traditional Council, Mr Frank Irabor has debunked the malicious, defamatory and misleading information in the social media that he (Secretary) have been arrested and taking to the Edo State criminal investigative department in Benin city over alleged land grabbing for interrogation.\nIn a statement personally signed and made available to the NIGERIAN OBSERVER yesterday, Mr Frank Irabor said he was never arrested talkless of being detained at the criminal investigative department of the state police command over the afore-mentioned issue.\nAccording to the Secretary, normally, I would not have bothered to utter a single word, but for reasons of clarification and putting the record in its proper perspective, I have decided to respond accordingly.\nContinuing, he stated that he had never been involved in any land grabbingsaga, adding that the real land grabbers have never been comfortable with his (secretary) stand against land grabbing in the Benin kingdom.\n“Those that concocted this false publication are social media miscreants and should be ignored in its entirety, as I remained committed to the services of the great Oba of the great Benin kingdom, Omo N’ Oba N’ Edo Ukpu Akpolokpolo, Oba Ewuare II.” he asserted."
  },
  {
    "headline": "Rough days ahead for land grabbers as Obaseki sets to reconstitute c’ttee for protection of private property – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is set to reconstitute the Private Property Protection (PPP) Committee to deal with cases of encroachment and land grabbing in the state.\nObaseki, who spoke to journalists in Benin City, the Edo State capital, said the state has amended Private Property Protection Law 2017 and set up a special court to prosecute offenders, as part of efforts to curb the criminal activities of land grabbers and property speculators.\nAccording to the governor, “We are committed to ending land grabbing in Edo State and will next week inaugurate the Committee for the Protection of Private Property (PPP).”Recall that the governor had, on July 27, 2021, assented to the bill repealing the Edo State Private Property Protection Law 2017 and re-enacting the Edo State Private Property Protection Law 2021.\nWhile assenting to the bill, Obaseki stated that the law “affects law and order in the State.\n“We are setting up a special court to swiftly try offenders and if guilty, they will certainly face the consequences.”..."
  },
  {
    "headline": "3rd Anniversary: Obokun East LCDA Chair, Bamidele Congratulates Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe caretaker chairman of Obokun East Local Council Development Area, LCDA, Ilare Ijesha, in Osun state, Hon.\nBello Saliu Bamidele has congratulated the governor of the state, Mr. Adegboyega Oyetola on the occasion of his third anniversary in office, describing him as an epitome of good governance.\n“Governor Oyetola could be best described as God sent angel to Osun people looking at the style of his governance,” he said.\nGovernor in the last three years will earn him another term in office.\nI am appealing to the people of the state to still rally support for this performing governor, for more development to come to our dear state."
  },
  {
    "headline": "AFCTA will enhance employment, poverty alleviation in Nigeria – Abiodun",
    "summarized_story": "Idowu Olakunle, AbeokutaOgun State governor, Dapo Abiodun has said Nigeria and other members of the Africa Continental Free Trade Area Agreement (AfCTA) stand to gain immensely from the agreement in the area of employment, wealth generation, food security and poverty alleviation.\nAbiodun stated this at the 36th Annual General Meeting of the Manufacturers Association of Nigeria (MAN), Ogun State branch, held in Abeokuta, on Thursday.\n“There is no gainsaying the fact that the Federal Government has upped the ante on economic diversification and re-tooling the manufacturing sector for economic sustainability.\nAbiodun, therefore, called on investors to take advantage of various economy policies available and invest in the state.\nWhile appreciating the Ogun State government for its efforts at improving security and infrastructure for businesses to strive, he called for the establishment of more industrial parks and skill acquisition centres for training of the teeming youths."
  },
  {
    "headline": "Sanwo-Olu presents N1.388trn 2022 budget to Lagos Assembly",
    "summarized_story": "Mr. Babajide Sanwo-Olu, governor of Lagos State, has presented a 2022 budget of N1.388 trillion to the state house of assembly.\nPresenting the budget titled “Budget of Consolidation,” Sanwo-Olu said the State would be spending N325 billion to deliver vital infrastructure projects in key sectors to energise and expand the growth of the state’s economy.\nAbout N823.4 billion, representing 59% of the 2022 budget, is earmarked for capital expenditure.\n“Year 2022 Budget is the next step on our journey to true and sustainable greatness in Lagos.\n“It is in this light that we are presenting the Year 2022 Budget of Consolidation with a size of N1,388,285,459,990.51."
  },
  {
    "headline": "Energy Transition: PUTTRU’s Discussion Paper posits proper financing for Africa",
    "summarized_story": "Authored and reviewed by a team of energy experts, the paper is divided into four sections.\nSection Two, defines and discusses the inherent constraints of energy systems, namely technical feasibility and stability of the grid, environmental concerns, security of energy supply, and energy costs.\nThis mindset must be addressed robustly by African countries.\nWhile I agree that Africa should not ignore renewables, the continent must not pursue development of alternative energy sources to the detriment of its fossil fuel assets.\nIn any case, immediate cessation of fossil fuel usage is not possible for Africa at this point, as countries’ needs differ in many ways."
  },
  {
    "headline": "Customs Introduces Mobile App For Validation Of Payment, Documents",
    "summarized_story": "Nigeria Customs Service is set to introduce Webb Tracker mobile application and a simplified standard operating procedure for the use of scanners at the various ports in the country.\nThe mobile app enables any person that has access to the NICIS II to remotely validate any declaration/payment and more importantly the status of a particular consignment/vehicle.\nThe service said the initiative will boost the federal government’s policy on ease of doing business.\n”The simplified standard operating procedure provide clear guidelines on the usage of scanners at all entry and exit points in Nigeria,” he stated while highlighting the steps to validation of Customs documents.\nHe calls on stakeholders to support the Service in its drive to deliver Customs best practices to the nation."
  },
  {
    "headline": "Customs Introduces Mobile App For Validation Of Payment, Documents",
    "summarized_story": "Nigeria Customs Service is set to introduce Webb Tracker mobile application and a simplified standard operating procedure for the use of scanners at the various ports in the country.\nThe mobile app enables any person that has access to the NICIS II to remotely validate any declaration/payment and more importantly the status of a particular consignment/vehicle.\nThe service said the initiative will boost the federal government’s policy on ease of doing business.\n”The simplified standard operating procedure provide clear guidelines on the usage of scanners at all entry and exit points in Nigeria,” he stated while highlighting the steps to validation of Customs documents.\nHe calls on stakeholders to support the Service in its drive to deliver Customs best practices to the nation."
  },
  {
    "headline": "Insecurity: Despite Military Onslaught, Bandits Kill 454, Kidnap 1,239 In 5 Months",
    "summarized_story": "LEADERSHIP investigations show that between the months of July and November, about 935 victims were abducted in Kaduna State alone while other states across the country recorded pockets of kidnappings, too.\nThe chairman of the Christian Association of Nigeria in Kaduna State, Rev.\nSome of the major kidnap incidents within the period include about 150 students who went missing after armed men in July raided their school in Kaduna State in July.\nTimeline of /AbductionsJuly 3, 2021: Bandits abduct 7 women, 4 children along Birnin Gwari RoadJuly 5, 2021: Boko Haram abducts Rev.\nOctober 18, 2021: Security forces Kill 10 bandits in Kaduna, while bandits kidnap three persons, kill oneOctober 31, 2021: 66 worshippers were kidnapped when the bandits who came in large numbers invaded the church during service."
  },
  {
    "headline": "Insecurity: Despite Military Onslaught, Bandits Kill 454, Kidnap 1,239 In 5 Months",
    "summarized_story": "LEADERSHIP investigations show that between the months of July and November, about 935 victims were abducted in Kaduna State alone while other states across the country recorded pockets of kidnappings, too.\nThe chairman of the Christian Association of Nigeria in Kaduna State, Rev.\nSome of the major kidnap incidents within the period include about 150 students who went missing after armed men in July raided their school in Kaduna State in July.\nTimeline of /AbductionsJuly 3, 2021: Bandits abduct 7 women, 4 children along Birnin Gwari RoadJuly 5, 2021: Boko Haram abducts Rev.\nOctober 18, 2021: Security forces Kill 10 bandits in Kaduna, while bandits kidnap three persons, kill oneOctober 31, 2021: 66 worshippers were kidnapped when the bandits who came in large numbers invaded the church during service."
  },
  {
    "headline": "Nigeria Must Bring Down Trade Barriers For AfCFTA Success – NGF",
    "summarized_story": "The NGF chairman said regulatory agencies of government like the Nigeria Customs Service (NCS) and the Nigeria Immigration Service (NIS) must change their revenue sharing mindset and adopt trade facilitation.\nHe noted: “We have Customs, I don’t want to go into the details of the mentality of our Customs which focuses more on revenue generation than trade facilitation, and trade facilitation is what will make AfCFTA work better in our environment.\nHe said with AfCFTA, Nigeria is well on its way to becoming a multi-sector giant as a benefactor from benefits such as regional supply chain and job creation.\n“Nigeria is already utilising regional trade opportunities, contributing approximately 76 per cent of total trading volume in the ECOWAS region.\nAfCFTA will only further enhance this trade, creating new economic opportunities and spurring economic and trade growth."
  },
  {
    "headline": "Sanwo-Olu delivers Ibeshe LagosHoms project, adds 480 homes to housing stock",
    "summarized_story": "Sanwo-Olu reiterated his administration’s commitment to prioritising development of housing projects that would enhance comfort and strengthen the aesthetic of the environment.\nIt is in acknowledgment of this fact that this administration considers housing development to be a priority on its agenda.”Sanwo-Olu, while reiterating his administration commitment to affordable housing for Lagosians, said private sector involvement in housing development is vital to robust housing delivery.\nBy involving the private sector, the State is widening the home provision net and opening the door wider for more homeownership opportunities.\n“The private sector involvement in housing development is vital to a robust housing delivery policy.\n“It is worthy of mention that housing development comes under the pillar of making Lagos a 21st Century economy in line with the T.H.E.M.E.S."
  },
  {
    "headline": "Sanwo-Olu delivers Ibeshe LagosHoms project, adds 480 homes to housing stock",
    "summarized_story": "Sanwo-Olu reiterated his administration’s commitment to prioritising development of housing projects that would enhance comfort and strengthen the aesthetic of the environment.\nIt is in acknowledgment of this fact that this administration considers housing development to be a priority on its agenda.”Sanwo-Olu, while reiterating his administration commitment to affordable housing for Lagosians, said private sector involvement in housing development is vital to robust housing delivery.\nBy involving the private sector, the State is widening the home provision net and opening the door wider for more homeownership opportunities.\n“The private sector involvement in housing development is vital to a robust housing delivery policy.\n“It is worthy of mention that housing development comes under the pillar of making Lagos a 21st Century economy in line with the T.H.E.M.E.S."
  },
  {
    "headline": "Mkpuru-Mmiri: Reps raise the alarm, say dangerous drug destroying youths",
    "summarized_story": "The House of Representatives on Thursday raise the alarm over the rising widespread abuse of dangerous drugs by youths and families.\nThis is as it lamented that Crystal meth, popularly known as Mkpuru mmiri in the South-East, is destroying youths.\n“Crystal meth, though an old drug, has been nicknamed ‘Mkpuru Mmiri’ in the South-East and is abused by a lot of youths.\nHe stated, “What we should be concerned about is who are the manufacturers of this drug (Crystal meth) in Nigeria; who are the marketers?\nNamdas observed that the war against drug abuse, trafficking or manufacturing was beyond the capacity of NDLEA alone to wage."
  },
  {
    "headline": "Mkpuru-Mmiri: Reps raise the alarm, say dangerous drug destroying youths",
    "summarized_story": "The House of Representatives on Thursday raise the alarm over the rising widespread abuse of dangerous drugs by youths and families.\nThis is as it lamented that Crystal meth, popularly known as Mkpuru mmiri in the South-East, is destroying youths.\n“Crystal meth, though an old drug, has been nicknamed ‘Mkpuru Mmiri’ in the South-East and is abused by a lot of youths.\nHe stated, “What we should be concerned about is who are the manufacturers of this drug (Crystal meth) in Nigeria; who are the marketers?\nNamdas observed that the war against drug abuse, trafficking or manufacturing was beyond the capacity of NDLEA alone to wage."
  },
  {
    "headline": "Ayika married Kano nightclub owner found dead in car with side chick",
    "summarized_story": "A nightclub owner in Kano, Steve Ayika has been found dead with his girlfriend in a tinted car.\nPolice reportedly found the married man and father of two kids, in a compromising position, with the side chick, identified as Chiamaka Emmanuel.\nThe two were discovered early on 23 November, according to the Kano Police Command, with the car locked and phones switched off.\nOn receipt of the report, the Commissioner of Police, Kano State Command, CP Sama’ila Shu’aibu Dikko, fsi raised and instructed a team of detectives to proceed to the scene.\nDSP ABDULLAHI HARUNA KIYAWA, ANIPR,POLICE PUBLIC RELATIONS OFFICER,FOR:- COMMISSIONER OF POLICE, KANO STATE COMMAND"
  },
  {
    "headline": "Akeredolu appoints 7 board members",
    "summarized_story": "Oluwarotimi Akeredolu of Ondo State has appointed seven people to represent the state on the board of some companies.\nMr Donald Ojogo, State Commissioner for Information and Orientation made this known in a statement made available to newsmen in Akure on Thursday.\nStephen Olemija for Alpha 3D Company Ltd, ” he said.\nThe governor congratulated the new appointees and urged them to protect the interest of the state in their respective companies.\nHe also reiterated his administration’s commitment to facilitate, promote, manage and support domestic and foreign direct investments for social and economic development of the state."
  },
  {
    "headline": "BREAKING: Notorious Kidnapper Evans Sentenced To Death By The High Court",
    "summarized_story": "Evans, dubbed “Nigeria’s most notorious kidnapper” by the police, was apprehended in 2017 and condemned to death four years later.\nThe Intelligence Response Team of the Inspector General of Police, directed by Abba Kyari, captured him.\nIn 2013, Evans was declared wanted after he allegedly masterminded the attempted kidnap of Mr Vincent Obianudo, a businessman who owns the popular ‘Young Shall Grow Motors’.\nThe suspect was said to have carried out kidnapping operations for more than five years before he met his waterloo."
  },
  {
    "headline": "Deal With Highway Criminals Mercilessly, Buhari Orders Security Agencies",
    "summarized_story": "Aregbesola, who addressed State House correspondents at the end of the meeting, said the police and other security agencies had been mobilised to intensify surveillance and patrols in pursuing of the criminals.\nHe said President Buhari particularly ordered the armed forces and other security agencies and intelligence organisations, not to rest on their oars.\nAnd until we achieve that, we will not rest.’’The minister assured that Nigerians would soon witness serious security improvement as specific orders had been given to all security agencies to tackle security challenges across the country.\nHe said: “specific orders have been given to all security agencies.\nIn attendance at Thursday’s National Security Council meeting were Vice-President Yemi Osinbajo, Chief of Staff to the President, Prof Ibrahim Gambari, and the National Security Adviser, retired Maj.-Gen. Babagana Monguno."
  },
  {
    "headline": "Fuel Scarcity: NUPENG Extends 14-day Strike Notice",
    "summarized_story": "The Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) has extended the Federal Government’s 14-day ultimatum by seven days, boosting the risk of gasoline shortages in the coming weeks across the country.\nThis was said by the union’s General Secretary, Afolabi Olawale, in a statement released in Lagos on Thursday.\nRecall that NUPENG had, on November 15, issued the 14-day ultimatum to embark on a nationwide strike due to what it called non-implementation of an agreement earlier reached with the government.\n“The decision of the union to give another seven-day ultimatum should not be misconstrued as a sign of capitulation or weakness.\nThe NUPENG general secretary urged the government and all other concerned entities to take advantage of the extension to do the needful."
  },
  {
    "headline": "BREAKING: INTERPOL Elects Nigeria’s Assistant Police Inspector General, Baba Umar Its Vice President For Africa",
    "summarized_story": "The International Criminal Police Organization (ICPO) – INTERPOL has chosen Nigeria’s Assistant Inspector General of Police, AIG GARBA Baba Umar, as Vice President (Africa) and Executive Committee Member.\nUmar was the Director of the Nigerian INTERPOL National Central Bureau (NCB).\n“AIG Garba, one of Nigeria’s finest criminal investigators and professional strategic police manager, with over thirty (30) years policing experience both at national and international levels, polled the highest number of votes in the elections.\n“This is in addition to drawing international policing support and cooperation towards advancing public safety and security, protecting the cyberspace and generally addressing challenges faced by law enforcement officers and policing managers in the continent.\n“The Nigeria’s delegation to the 89th INTERPOL General Assembly was led by the Honourable Minister of Police Affairs, Muhammad Maigari Dingyadi, ably supported by the Inspector General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc."
  },
  {
    "headline": "Insecurity: Buhari gives service chiefs marching orders",
    "summarized_story": "For the umpteenth time, President Muhammadu Buhari has given marching orders to the security chiefs to go after insurgents, bandits and terrorists, saying they must not rest until all Nigerians are at rest.\nAregbesola said President Buhari appreciated the successes and gains recorded by all security chiefs, the security agencies and intelligence organisations on security situation nationwide after he received briefs from them at the meeting.\n“The President was particularly happy with the fact that a free and fair election was made possible by the INEC and our security agencies.\nThe police and other security agencies had been mobilised to intensify surveillance, patrol in pursuit of the criminals.\nDirector Defence Media Operations (DMO) Brigadier-General Bernard Onyeuko stated this while briefing journalists on update of military operations across the country from 11 to 25."
  },
  {
    "headline": "Pictures: Late veteran Baba Suwe’s burial rites begins",
    "summarized_story": "NextPius Awodi, passage of a man of honour and intergity"
  },
  {
    "headline": "Air Nigeria returns April 2022, to create 70,000 jobs – Sirika",
    "summarized_story": "Minister of Aviation Hadi Sirika has said the country’s national air carrier, Air Nigeria, is expected to take off April 2022.\nSitrika said, when it becomes operational, the national carrier would create about 70,000 jobs for Nigerians.\n“Today in Council, civil aviation presented two memoranda.\nThe first one is approval for the award of contract for the provision of Automated Civil Aviation Regulatory Equipment, including software support and training, which will be located in Nnamdi Azikiwe International Airport.\nThese 70,000 jobs are higher than the total number of civil servants that we have in the country."
  },
  {
    "headline": "2022: Minister reveals full fuel deregulation plans as FG removes subsidy provision from budget",
    "summarized_story": "Minister of Finance, Budget and National Planning Hajiya Zainab Ahmed has said the federal government cannot sustain the current N250 billion monthly petroleum subsidy.\nAnd in the 2020 budget, we made a provision to assume that at the maximum by the end of June, we must exit subsidy.\nGrowth in the service sector was largely driven by better performance in the rail transport sector, pipeline sector, air transport, financial institutions, road transport sector, water transport as well as crude.\n“It includes the improvement that we’ve witnessed in the rail transport sector, pipelines, air transport, road transport, as well as water transport.\nWe don’t have anywhere in the budget where 40 million Nigerians will collect N5000 monthly as transportation allowance totalling N2.4 trillion."
  },
  {
    "headline": "At last, FG reveals when Air Nigeria ‘ll commence operations",
    "summarized_story": "The Minister of Aviation, Mr Hadi Sirika, said the country’s national air carrier, Air Nigeria, is expected to take off by April 2022.\nThe minister said this while briefing State House correspondents at the end of the weekly Federal Executive Council (FEC) meeting presided over by President Muhammadu Buhari.\nHe said the national airliner would be run by a company in which the Nigerian government would hold a five percent stake, Nigerian entrepreneurs 46 percent and the remaining 49 percent for yet to be assigned strategic equity partners, including foreign investors.\nHe said, when it becomes operational, the national carrier would create about 70,000 jobs for Nigerians."
  },
  {
    "headline": "We are only mandated to relate with political parties",
    "summarized_story": "The Independent National Electoral Commission says it has been mandated to only relate with all political parties and not factional group or groups in the country.\nThe Oyo state Resident Electoral Commissioner of Australia INEC Mutiu Agboke disclosed this at a meeting held with parties stakeholders held in Ibadan.\nAgboke said this is in a bid avoid the commission been accused of serving the interest of other individuals or factions of a political party.\nAccording to him, However, let it also be on record that INEC has a mandate relate with all political parties and not factional group or groups as recently experienced with a particular political party.\nAgboke said the commission would also supports the Electoral Amendment bill that allows political parties to choose their candidates through direct primaries if assented toAgboke disclosed that over four hundred thousand registered voters are still yet to receive their Permanent Voters Cards out of the over two million registered voters in the state."
  },
  {
    "headline": "Breaking: Akeredolu imposes curfew on Ikare",
    "summarized_story": "The Ondo State Government has ordered the imposition of a twenty-four hour curfew on Ikare town, headquarters of Akoko North East Local Government Area of the State with immediate effect.\nThis is coming on the heels of security reports and credible intelligence arising from the situation in Ikare.\nSpecifically, some deaths have been recorded as a result of sporadic gunshots that have pervaded the ancient town in the last 12 hours.\nSecurity agencies, especially the Police and Amotekun have already been directed to ensure full compliance and enforcement of the curfew imposed.\nAll Traditional Rulers, Opinion and Religious Leaders are enjoined to give maximum support to this order just as they are to rein in their subjects and wards."
  },
  {
    "headline": "Akeredolu, Security heads celebrate retiring Commissioner of Police, Bolaji Salami",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has described the retiring Commissioner of Police in the state, Bolaji Salami, as a gentleman who is dedicated to duty.\nGovernor Akeredolu saluted him for being a reliable officer, describing him as a team player.\nAt a brief valedictory session held in his honor during the State Security Council Meeting on Monday, Governor Akeredolu commended the manner the Commissioner of Police handled the #Endsars crisis in the state, describing it as impressive.\nGovernor Akeredolu also applauded the retiring officer for his collaboration with other security agencies in the state, saying he is a bold man.\nI cherish coming here to work with you and I will say that I enjoyed everything in this state,” the retiring CP added."
  },
  {
    "headline": "President Buhari, APC Governors agree February 2022 for National Convention -",
    "summarized_story": "The ruling All Progressives Congress (APC) has tentatively scheduled its national convention to sometime in February, 2022.\nThis was disclosed to State House Correspondents on Monday by Chairman of the Progressive Governors Forum (PGF) Governor Atiku Bagudu after a closed-door meeting with President Muhammadu Buhari.\nBagudu met the President with the Caretaker Committee Chairman of the APC Governor Mai Mala Buni and his Jigawa counterpart, Mohammed Badaru.\nThe meeting with APC Governors was preceded by another meeting, also behind closed-door, with Senate President Ahmad Lawan at the Presidential Villa, Abuja."
  },
  {
    "headline": "The Nembe Oil Spill Needs an Independent Panel of Inquiry – Prof. Richard Steiner",
    "summarized_story": "The Minister of State for Petroleum Resources Timipre Sylva, Wednesday paid his first visit to the site of the Nembe oil spill in Bayelsa State, more than three weeks after a blowout occurred at a wellhead in the Santa Barbara oilfield.\nThe minister assured residents of the area that the authorities were working round the clock to contain the spill and restore the environment.\nProf Richard Steiner enlightens us on why blowouts of this nature occur, preventative measures to stop them from recurring, and the remedial measures needed to restore the environment.\nProf. Steiner is a marine conservationist and has extensive experience working around the world, including in Ogoni land, on oil spill containment and environmental conservation.\nLast week, he was appointed as the Technical Adviser to the Ijaw Diaspora Council to assess and advise Nembe communities on the oil spill."
  },
  {
    "headline": "Reactions To Proposed Nigeria Air + Terrorists Set Up Camps In Niger – Trending With Ojy Okpe",
    "summarized_story": "The Consulate-General of Nigeria in New York on Wednesday took possession of three Benin and Ife artefacts from the Metropolitan Museum of Art.\nThe artefacts are two 16th-century Benin brass plaques and one 14th-century Ife brass head.\nThe artefacts are the latest to be returned from a collection of artworks looted from Nigeria in 1897Some Nigerians have reacted to the Minister of Aviation’s announcement indicating that the country’s proposed national carrier, “NigeriaAir,” will take off by April 2022.\nThe Niger State Government, on Tuesday, raised the alarm that the Islamic State of West Africa Province and Boko Haram terrorists are establishing camps in the state."
  },
  {
    "headline": "Nigeria Receives Stolen Benin and Ife Artefacts from US Museum",
    "summarized_story": "The consulate-general of Nigeria in New York has taken possession of three Benin and Ife artefacts from the Metropolitan Museum of Art (MET) in the United States.\nAccording to NAN, Abba Tijjani, director-general of national commission for museums and monuments (NCMM), received the artefacts from the museum in the company of Lot Egopija, consul-general of Nigeria in New York.\nThe artefacts are two 16th-century Benin brass plaques and one 14th-century Ife brass head.\nTijjani, who signed a Memorandum of Understanding (MoU) with MET, commended the museum for returning the artefacts to Nigeria.\nHe asked other museums in possession of Nigerian artefacts to follow MET’s exemplary gesture."
  },
  {
    "headline": "National Carrier, Nigeria Air, to Commence Operations April 2022",
    "summarized_story": "Nigeria’s proposed national carrier, Nigeria Air, is set to begin flight operations by April 2022.\nSirika explained that in the new national carrier, the federal government will have five percent equity shares, Nigerian entrepreneurs 46 per cent equity shares, while the expected international strategic partners would have 49 equity shares.\nSirika stressed that FEC had given approval for the new national carrier.\nAccording to him, “Today (Wednesday) in Council, civil aviation presented two memoranda.\nOne of the memos is approval of the outline business case for the establishment of the national carrier and this is the sixth time the memorandum appeared before Council."
  },
  {
    "headline": "Nigeria: Labour Rejects Proposed Fuel Price Hike",
    "summarized_story": "Wabba said the union would maintain its rejection of deregulation so long as it was based on an import-driven model.\n“The response of the Nigeria Labour Congress is that what we are hearing is the conversation of the federal government with neo-liberal international monetary institutions.\nWabba also said that any attempt to compare the price of petrol in Nigeria to other countries would be set on a faulty premise as it would be akin to comparing apples to mangoes.\n“The total amount involved in this queer initiative is far more than the money government claims to spend currently on fuel subsidy.\n“Clearly, government thoughts on the so-called removal of fuel subsidy is cloudy and appears to be a “penny wise-pound foolish” gamble."
  }
]