[
  {
    "headline": "Healthy vagina possible without probiotic supplements, says gynaecologist",
    "summarized_story": "Amarachi OkehA Professor of Obstetrics and Gynaecology, Adetunji Adeniji, has cautioned women against taking probiotic supplements without prescription, noting that they are not always necessary or beneficial for vaginal health as widely assumed.\n“It is just to grow beneficial bacteria to overcome the non-beneficial bacteria.\nThe professor, however, warned that like other medications, caution should be exercised when taking probiotics because they can be taken in excess.\nAlso, according to a paper published online by mycleveland.com, probiotic supplements should be taken with caution because there is a risk of infection.\nIt also warned that taking probiotics come with certain risks which include developing infections and resistance to antibiotics as well as harmful byproducts from probiotic supplements."
  },
  {
    "headline": "Healthy vagina possible without probiotic supplements, says gynaecologist",
    "summarized_story": "Amarachi OkehA Professor of Obstetrics and Gynaecology, Adetunji Adeniji, has cautioned women against taking probiotic supplements without prescription, noting that they are not always necessary or beneficial for vaginal health as widely assumed.\n“It is just to grow beneficial bacteria to overcome the non-beneficial bacteria.\nThe professor, however, warned that like other medications, caution should be exercised when taking probiotics because they can be taken in excess.\nAlso, according to a paper published online by mycleveland.com, probiotic supplements should be taken with caution because there is a risk of infection.\nIt also warned that taking probiotics come with certain risks which include developing infections and resistance to antibiotics as well as harmful byproducts from probiotic supplements."
  },
  {
    "headline": "10 feared dead from suspected cholera outbreak in Ogun community",
    "summarized_story": "Anxiety is mounting in Magboro Community of Ogun over a suspected Cholera outbreak, from which about 10 people are feared dead.\nThe News Agency of Nigeria reports that the suspected Cholera outbreak was first reported on Friday when a resident of the community living in an uncompleted building died.\n“We received the report of suspected cholera outbreak when the deed had already been done.\n“The Ministry of Health brought in medical and laboratory testing equipment to enable us to diagnose properly if it is a cholera outbreak or not.\nHe was too weak, he was transferred to a community health centre, where he is currently receiving treatment,” she said."
  },
  {
    "headline": "10 feared dead from suspected cholera outbreak in Ogun community",
    "summarized_story": "Anxiety is mounting in Magboro Community of Ogun over a suspected Cholera outbreak, from which about 10 people are feared dead.\nThe News Agency of Nigeria reports that the suspected Cholera outbreak was first reported on Friday when a resident of the community living in an uncompleted building died.\n“We received the report of suspected cholera outbreak when the deed had already been done.\n“The Ministry of Health brought in medical and laboratory testing equipment to enable us to diagnose properly if it is a cholera outbreak or not.\nHe was too weak, he was transferred to a community health centre, where he is currently receiving treatment,” she said."
  },
  {
    "headline": "Hundreds protest in Kabul against Pakistan involvement in Afghanistan",
    "summarized_story": "Taliban fighters take control of Afghan presidential palace after the Afghan President Ashraf Ghani fled the country, in Kabul, Afghanistan, Sunday, Aug. 15, 2021.\n(AP Photo/Zabi Karimi)Hundreds of Afghans took to the streets of Kabul on Tuesday, demanding that Pakistan stops interfering in Afghanistan’s affairs.\nPakistan has started a direct invasion in Afghanistan and we are asking why its chief intelligence is here?\nThe popular news channel ToloNews reported on Twitter that the Taliban detained a ToloNews camera operator and confiscated his camera.\nA former member of parliament in northern Balkh province said a similar protest also took place against Pakistan late on Monday in Mazar-e Sharif"
  },
  {
    "headline": "Conflicting orders making our job difficult —INEC",
    "summarized_story": "Again worries over conflicting court ordersBy Omeiza AjayiAbuja—THE Independent National Electoral Commission, INEC, said yesterday that conflicting orders by courts were making its job difficult difficult.\nIt also lamented the growing number of conflicting court orders and judgments which were usually procured by politicians seeking to outmaneuver one another.\nConflicting ordersProf. Yakubu also denounced the usual resort of politicians to obtaining conflicting court orders which he said rubbishes the legal concept of “stare decisis” as what was supposedly settled in law had now become unsettled.\nHe said: “I cannot conclude my remarks without touching on the issue of litigation, particularly the conflicting orders emanating from courts of coordinate jurisdiction.\nHe said: “I cannot conclude my remarks without touching on the issue of litigation, particularly the conflicting orders emanating from courts of coordinate jurisdiction."
  },
  {
    "headline": "Senator blames insecurity on inadequate funding for police",
    "summarized_story": "Sen. Nicholas Tofowomo (PDP-Ondo), has blamed the current security challenge on inadequate funding by successive government for the Nigeria Police Force.\nTofowomo urged the Federal Government to strive towards ensuring adequate funding and equipping the police who played vital role of ensuring security of lives and property in the country.\n“Policing in a large and diverse country like Nigeria needs enormous funding and sophisticated weapons, but the poor funding in yearly budgets of the police by past government is responsible for the current situation.\nDSP Funmilayo Odunlami, spokesperson for the police command in Ondo, lauded the senator for taking such a bold step to ensure safety of residents.\n“We thank the senator for his display of kindness and ensuring safety of lives and property of residents, I appeal to our youths to stop the destruction of government property to press home their demands,” she said."
  },
  {
    "headline": "Nigeria records N1.8trn trade deficit in Q2’21",
    "summarized_story": "As foreign trade rises 23% to N12trnBy Elizabeth AdegbesanNigeria has recorded a trade deficit of N1.8 trillion in the second quarter of the year (Q2’21) even as the volume of its foreign trade rose by 23 per cent to N12 trillion from N9.8 trillion in Q1’21.\nDisclosing these in its “Foreign Trade in Goods Statistics Report for Q2’21”, the National Bureau of Statistics, NBS, said the increase in trade volume resulted from a sharp increase in export value during the quarter under review.\nThe report stated: “The crude oil which is the major component of export trade stood at N4.07 trillion or 80.3 per cent of total export.\nThis further shows a sharp increase of 111 per cent in crude oil value in Q2’21 compared to N1.9 trillion recorded in Q1’21 while the Non-crude oil export recorded N1 trillion or 20 per cent of total export trade during Q2’21.\n“Export by section revealed that mineral products accounted for N4.6 trillion or 91 per cent of total export trade."
  },
  {
    "headline": "Just In: Buhari, security heads meet in Aso Rock",
    "summarized_story": "By Johnbosco Agbakwuru, ABUJAPRESIDENT Muhammadu Buhari is currently meeting with Security Chiefs at the Presidential Villa, Abuja.\nThough the agenda of the meeting was not made public as at the time of sending this report, Vanguard gathered that the meeting was to review the security situation in the country.\nAlready information has it that the service chiefs and other heads of security agenciesare briefing the President on security situations, the successes recorded and the areas of they are having challenges.\nIn attendance are the Minister of Defence, General Bashir Magashi (retd), the Attorney General of the Federation (AGF) and the Minister of Justice, Abubakar Malami, and the service chiefs led by the Chief of Defence Staff (CDS), General Lucky Irabor among others.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "Nnamdi Kanu’s US lawyer threatens to drag Buhari, FG to ICC",
    "summarized_story": "Bruce Fein, an American lawyer of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has threatened to drag President Muhammadu Buhari and the Nigerian government to the International Criminal Court, ICC.\nFein said he would drag the Nigerian government before the ICC to ensure they comply with international laws.\n“An example of the concerns that have been raised in the proceedings so far is the gross violation of international laws.\nFirst Nnamdi Kanu’s kidnapping is a violation of international law.\nThe IPOB leader is said to have been rearrested in Kenya, a claim the Nigerian government is yet to confirm."
  },
  {
    "headline": "BREAKING: Again, gunmen attack Kaduna community, abduct 18 residents",
    "summarized_story": "Gunmen suspected to be bandits have attacked the Keke community in Chikun Local Government Area of Kaduna State and abducted at least 18 residents.\nDAILY POST learnt that the incident occurred early hours of Tuesday when the assailants invaded the area.\nAccording to reports, the gunmen numbering about 20, stormed the area at about 12am with sophisticated weapons, shooting sporadically before whisking the victims away.\nWhen contacted by DAILY POST correspondent, the state Police Public Relations Officer, ASP Mohammed Jalige said he would inquire and revert.\nKaduna has been one of the worst-hit states in the north in terms of the kidnapping of students and other residents."
  },
  {
    "headline": "Banditry: Sen Musa decries killing of 20 villagers in Niger",
    "summarized_story": "Senator representing Niger East Senatorial District of Niger State in the National Assembly, Alhaji Sani Musa has decried the killing of 20 villagers in Shiroro Local Government Area last Thursday by armed bandits.\nIt would be recalled that a total of 20 persons were purportedly slaughtered in the incident that occurred about six days ago in the area.\nMusa, who stated this in Minna, described the act as not only wicked and callous, but a gross act of man’s inhumanity.\nHe said the deceased were slaughtered in cold blood by the bandits in an incident which took place in broad daylight.\nZamfara Police kill 30 bandits after slaughter of 10 villagers"
  },
  {
    "headline": "Banditry: Shutdown of telecoms, schools yet to have impact – Shehu Sani",
    "summarized_story": "Former Kaduna lawmaker, Shehu Sani has said the closure of markets, schools and shutdown of telecoms services is yet to have an impact on insecurity in the state.\nSani said this on Tuesday while raising the alarm of an attack on Monday night in the state.\nAccording to him, shutting down markets, schools, telecoms and cattle movements is yet to have an impact.\nBut many residents who spoke to DAILY POST kicked against the ban describing it as a plan by the government to starve residents as they relied on weekly markets to survive.\nThey noted that the ban would not stop bandits who move from house to house, room to room in the night, killing and kidnapping people."
  },
  {
    "headline": "Lagos: Striking doctors resume as Sanwo-Olu approves recruitment, accommodation",
    "summarized_story": "The Nigerian Association of Resident Doctors (NARD) in Lagos are back to work after weeks of strike.\nGovernor approved the recruitment of over 150 new resident doctors and medical officers to reduce the human resource deficit in the public service.\n“On the discrepancy between the remuneration packages of the state and federal doctors in the public service, Mr.\nGovernor approved the final tranche of 25 per cent difference to complete the harmonisation”, Omotoso noted.\nChief Medical Director LASUTH, Prof, O. Fabanwo; Health Service Commission (HSC) Chairman, Dr. Atinuke Onaiga; Dr Sodipo Oluwajimi, Chairman Medical Guild; Dr Ajibowo Ismail, Secretary Medical Guild, among others attended."
  },
  {
    "headline": "Comic Actor Okele recovers from illness",
    "summarized_story": "After days of battle with ill-health, popular comic actor Babatunde Usman aka Okele has made a rebound from illness.\nThe Nation reports a viral video shared by Okele’s colleague Saliu Gbolagade aka Ogbuleke, had captured Okele being hospitalised over an unknown ailmentSharing the video, Ogbuleke wrote: “thank God, olorun koni je ki aye suku nitori e @okele_2”But Okele in an appreciation message shared on his Instagram page on Sunday, thanked his numerous fans and colleagues for their support.\nHe said, “There have been so many speculations on social media over my health, I want to thank everybody, here I am, I’m stronger.\n“I thank my senior colleagues, my fans, my family and God most importantly.\nThis is me, I’m fine, I have gone, and now I’m back”The 42-year-old actor who hails from Kwara state, has over 20 years experience in the movie industry."
  },
  {
    "headline": "Kaduna LG polls: PDP wins Jaba LG",
    "summarized_story": "Kaduna State Independent Electoral Commission has declared Mr Phillip Gwada (PDP) as winner of Saturday’s chairmanship election in Jaba Local Government Area of the state.\nThe Returning Officer, Prof. Peter Omale, made the declaration on Monday at the State Independent Electoral Commission (SIEC) office in Kwoi.\nOmale said Gwada polled 9,012 votes to defeat APC’s candidate, Mr Benjamin Jock, who polled 5,640 votes.\nADVERTISEMENTHe said that the candidate of Action Democratic Party, Mr Alhamdu Gyet, placed third with 2,732 votes.\n“Mr Phillip Gwada of the PDP, having satisfied the requirements of the law and having scored the highest number of votes is hereby declared winner of the election and returned elected,’’ Omale said."
  },
  {
    "headline": "Conflicting orders: Summoned CJs to appear before CJN Monday",
    "summarized_story": "The seven Chief Judges (CJs) summoned last month by the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad, for allegedly issuing conflicting court orders, are to appear before him today in Abuja.\nA source at the Supreme Court told The Nation that the affected judges are to first meet with the CJN in preparation for their eventual appearance before the National Judicial Council (NJC).\nIt was also learnt that the CJN plans to meet with the leadership of the Nigerian Bar Association (NBA) during the week.\nRead Also: Babel of exparte orders“You recall the CJN issued the summons on August 30 to halt what has become an embarrassment to the Judiciary in the past few weeks.\nThe summons reads: “My attention has been drawn to media reports to the effect that some courts of coordinate jurisdiction were granting conflicting ex parte orders on the same subject matter."
  },
  {
    "headline": "Germany’s envoy to China dies 2 weeks into job",
    "summarized_story": "Germany’s new ambassador to China, Jan Hecker, has died shortly after taking up his post, the Foreign Office confirmed Monday.\n“It is with deep sadness and consternation that we heard of the sudden death of the German ambassador to China, Prof., Dr Jan Hecker.\n“At this moment, our thoughts are with his family and the people who were close to him,’’ the Foreign Office said in a statement.\nA native of the northern port city of Kiel, Hecker trained as a lawyer and had worked as an attorney and a judge.\nHecker was a university lecturer before becoming a foreign policy advisor to Chancellor Angela Merkel ahead of his appointment as ambassador."
  },
  {
    "headline": "BREAKING: Former Niger Tornadoes Chairman, Suleiman David dies",
    "summarized_story": "From John Adams, MinnaFormer Chairman of Niger Tornadoes and Board member of the Nigeria Football Federation (NFF), Mallam Suleiman.\nDavid has diedLate Suleiman David died at a private hospital in Lagos on Tuesday Morning after he lost battle with a heart related illness.\nUntil his death on Tuesday, the late former NFF board member was a staff of the world bank assisted Youth Empowerment Support Programme (YES-UP) in Niger state.\nSympathizers, friends, football family in the state have continued to troop to the house of the late David located at the low cost estate, Tunga Minna, the Niger state as the body is being awaited from Lagos.\nThe late Suleiman David is married with children and grand children."
  },
  {
    "headline": "Open grazing ban: Lagos proposes 21-year jail term for armed herders",
    "summarized_story": "By Sunday AniThe bill before the Lagos State House of Assembly seeking to ban open grazing of cattle in the state has also prescribed a 21-year-prison term for any herder found bearing arms.\nThis was contained in an executive bill titled: “Prohibition of Open Cattle Grazing Bill, 202,” currently before the House.\nThe lawmakers agreed that grazing cattle openly has led to food shortage as the herdsmen most often move their cattle into people’s thereby destroying their crops and ultimately leading to food shortage.\nHe later committed the bill to the House Committee on Agriculture and Cooperative and directed it to report back on Thursday.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "CJN refers 3 justices to NJC for disciplinary actions",
    "summarized_story": "From: Godwin Tsa, AbujaThe Chief Justice of Nigeria(CJN), Justice Ibrahim Mohammad has referred three judges involved in dishing out conflict court orders to the National Judicial Council (NJC) for necessary disciplinary action.\nThe CJN took the decision after a marathon meeting with the seven state chief judges who were summoned over the issue.\nThey are the chief judges of the Federal Capital Territory (FCT), Abuja, Rivers, Kebbi, Cross River, Jigawa State, Anambra and Imo states.\nIn addition, Justice Mohammad warned state chief judges to henceforth avoid unnecessary assumption of jurisdiction in matters with similar subject and parties already before another court.\nA visibly angry CJN was reported to have stated that “a damage to one jurisdiction is a damage to all."
  },
  {
    "headline": "Rights abuse: Kanu’s lawyer slams N50m suit on DSS",
    "summarized_story": "From Godwin Tsa, AbujaCounsel to Nnamdi Kanu, detained leader of the Indigenous People of Biafra (IPOB), Maxwell Opara, has filed a N50 million suit against the Director General of the Department of State Services (DSS) and the DSS, over alleged violation of his fundamental human rights.\nIn his suit marked FHC/ABJ/CS/1018/2021, the Abuja-based lawyer is demanding the sum as compensation for the infringement of his fundamental rights to dignity and human person.\nOpara is further seeking a written apology by the respondents to be published in two national daily newspapers, for the unwarranted infringement of his fundamental rights.\nHe further prayed for an order directing the Respondents to jointly and severally pay for the cause of the action.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Why IPOB’s sit-at-home is succeeding in South East –Umahi",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaEbonyi Governor, Dave Umahi, has said those observing sit-at-home directive of the Indigenous People of Biafra (IPOB) in the South East despite its suspension were doing so out of fear.\nAnd that’s why some people in South East are afraid of coming out.\nSecurity agencies must know that they owe South East people the duty to protect their lives.\nAnd I think it is the same thing with other governors of South East and by extension, governors of APC.\nAnd if you read through the newspapers, you see a lot of exploits that are being done in the South East."
  },
  {
    "headline": "Gunmen Abduct LG Chairman’s Father, Kill Police, NSCDC Officers in Bayelsa",
    "summarized_story": "By Olusegun SamuelSuspected gunmen last Sunday night killed two security operatives at the nipping point at Okarki junction in Bayelsa State after the security agents came under unexpected heavy gun fire from the bandits.\nThe attack left a police officer and an operative of the Nigeria Security and Civil Defence Corps ((NSCDC) dead.\nThough the operatives, who are from the Joint Task Force codenamed ‘Operation Doo Akpor’, repelled the attack and prevented the gunmen from attacking the nipping point, the gunmen, however, escaped into the creeks.\nAccording to him, “On September 5, 2021, at about 2030 hours, operatives of Operation Doo Akpor at Okarki junction came under heavy fire by unknown gunmen.\nThe gallant operatives engaged the hoodlums in a shoot-out and repelled them from attacking the nipping point."
  },
  {
    "headline": "PIA and Future of PEF(M)B, DPR and PPPRA",
    "summarized_story": "By Eniola OlakunriIt is no longer news that President Muhammadu Buhari has signed the Petroleum Industry Bill into law, bringing to a close, the nearly 2-decade old clamour for a sound legal, fiscal, and regulatory framework to govern the business activities of the Nigerian petroleum industry.\nOnly the NNPC was specifically indicated, would transmute into a new enterprise, to be named ” Nigerian National Petroleum Company Ltd”.\nFacts and real-time adequate data on the daily consumption of petrol should be a sine qua non of petrol supply and distribution processes, nationwide.\nOf the 3 Agencies identified earlier (PEF (M)B), DPR and PPPRA, the ones with the most robust automation processes that cover every gamut of petrol supply and distribution are PEF(M)B, according to industry watchers.\nThis is where The Authority should lean on for on the spot information on petrol movements all across the country."
  },
  {
    "headline": "MRA Condemns NCC’s Directive to Telecoms’ Operators to Shut down Services in Zamfara",
    "summarized_story": "By Wale IgbintadeA group, Media Rights Agenda (MRA), has condemned the directive by the Nigerian Communications Commission (NCC) to telecommunications’ companies to immediately shutdown all telecommunications services in Zamfara State as a result of the “encompassing security situation” in the state.\nIt described the measure as an unwarranted and unjustifiable interference with the rights to freedom of expression and access to information.\nThe statement added: “Such purported exercise of power without regard to deny communications services not only to the residents of Zamfara State, but also to other people elsewhere who have family members, friends, loved one as well as other social or business relations in the state.\nThey denial of the right to communicate with others without judicial or any other form of independent oversight cannot be justified under any circumstance.\n“There is no evidence anywhere in the world that shutting down communication services, including access to the internet and telephone communication, helps improve security, prevent terrorist attacks, or stop them."
  },
  {
    "headline": "Ayade Mourns Ukpo, Says His Death a Monumental Loss",
    "summarized_story": "The Cross River State Governor, Mr. Ben Ayade, has lamented the death of one – time Military Administrator of Rivers State, Brigadier-General Anthony Ukpo (rtd).\nGeneral Ukp,o who was also a former Minister of Information, died on Monday.\nAyade commiserated with Ukpo’s family and the military, saying, “an illustrious son, a fine and gallant officer has left us.\n“As a state, we are pained by the loss of this thorough bred officer, an illustrious son of Cross River.\n“As a military officer, General Ukpo had a distinguished career, as a Military Administrator he excelled beyond expectations and as a Minister he showed passion and professionalism."
  },
  {
    "headline": "Okowa: Performance of Delta Indigenes Globally Impressive",
    "summarized_story": "By Omon-Julius OnabuThe Delta State Governor, Dr. Ifeanyi Okowa, has expressed happiness that sons and daughters of the state were making positive exploits in the country and across the world.\nJustice Gbagi is the wife of the PDP governorship hopeful and former Minister of Education, Mr. Kenneth Gbagi.\nHe said: “On behalf of the government and people of Delta State, I congratulate our dear sister, Justice Sybil Gbagi, on her elevation to this higher office.\n“If you have nothing to thank God, thank God for Christ, thank God for live, thank God for hope and for forgiveness,” he said.\nHe congratulated Justice Gbagi on her elevation and prayed for God’s continuous guidance and protection for her."
  },
  {
    "headline": "BREAKING: Gunmen Abduct 18 Residents In Kaduna Community",
    "summarized_story": "About 18 people have been kidnapped in Keke, a community in Chikun Local Government Area of Kaduna State.\nAccording to Daily Trust, the gunmen were said to have invaded the community around 12midnight.\nEyewitnesses said the gunmen came in large number and after causing confusion in the area, they kidnapped 18 people.\nBandits have been ravaging Kaduna also in a string of attacks on the North-West states particularly.\nAruwan had identified some of the victims killed by bandits as Joseph Maza, Timvan Cibi Ciwo, Monday Titus, Asabe Magani, Laraba Danladi, and Yosi Danladi."
  },
  {
    "headline": "BREAKING: Gunmen Abduct 18 Residents In Kaduna Community",
    "summarized_story": "About 18 people have been kidnapped in Keke, a community in Chikun Local Government Area of Kaduna State.\nAccording to Daily Trust, the gunmen were said to have invaded the community around 12midnight.\nEyewitnesses said the gunmen came in large number and after causing confusion in the area, they kidnapped 18 people.\nBandits have been ravaging Kaduna also in a string of attacks on the North-West states particularly.\nAruwan had identified some of the victims killed by bandits as Joseph Maza, Timvan Cibi Ciwo, Monday Titus, Asabe Magani, Laraba Danladi, and Yosi Danladi."
  },
  {
    "headline": "Sunday Igboho Blows Hot From Beninese Prison In Leaked Audio, Lambasts His Lawyer For 'Disrespecting Him'",
    "summarized_story": "In a leaked audio obtained by SaharaReporters, Ighoho claimed the lawyer abandoned him and kept him waiting for over 15 minutes while speaking to someone else.\nSunday IgbohoHe said, “I told him (lawyer) I was hungry and had to eat, and he told me to go.\nI didn’t know him before now; I wasn’t expecting him at all.\nI didn’t know it was Salami that lawyer, Falola, would be sending.\nI’m not afraid of anyone of them.”When told the lawyer claimed he had information for him, Igboho said, “I don’t need any information from them."
  },
  {
    "headline": "Sunday Igboho Blows Hot From Beninese Prison In Leaked Audio, Lambasts His Lawyer For 'Disrespecting Him'",
    "summarized_story": "In a leaked audio obtained by SaharaReporters, Ighoho claimed the lawyer abandoned him and kept him waiting for over 15 minutes while speaking to someone else.\nSunday IgbohoHe said, “I told him (lawyer) I was hungry and had to eat, and he told me to go.\nI didn’t know him before now; I wasn’t expecting him at all.\nI didn’t know it was Salami that lawyer, Falola, would be sending.\nI’m not afraid of anyone of them.”When told the lawyer claimed he had information for him, Igboho said, “I don’t need any information from them."
  },
  {
    "headline": "Family Announces Virtual Attendance Option For Burial Of Olajide Sowore",
    "summarized_story": "Human rights’ activist, Omoyele Sowore has shared the link to the virtual attendance option of the burial ceremony of his younger brother, Olajide Sowore, who was killed by herdsmen on Saturday.\n“#Justice4JideSowore ZOOM Burial.\nTime: Sep 9, 2021 10:00 AM Africa/Lagos Join Zoom Meeting.\nThe inclusion of a virtual meeting in the burial arrangement comes as the activist himself has not been granted the opportunity to attend the burial.\nSee Also Politics Buhari Regime To Make Activist, Sowore Miss Slain Brother's Funeral As Family Announces Burial DateOlajide was recently murdered in cold blood on the Lagos-Benin expressway."
  },
  {
    "headline": "JAMB's preferential cut-off marks have made northern students lazy, says El-Rufai",
    "summarized_story": "Nasir El-Rufai, governor of Kaduna state, says the “differential scores” that the Joint Admissions and Matriculation Board (JAMB) allot to northern students have “made our people lazy”.\nEl-Rufai said the preferential scores “have not helped” the region out of the educational disadvantage it has been battling since independence.\nHe then asked that JAMB abolish the low cut-off marks to encourage students from the region “to work hard and compete”.\nWe’ve continuously been the disadvantaged region right from independence even though we’re given preferences, JAMB scores and all that.\nWe are confident that from the next two weeks, we would start the gradual reopening of schools,” the governor said."
  },
  {
    "headline": "JAMB's preferential cut-off marks have made northern students lazy, says El-Rufai",
    "summarized_story": "Nasir El-Rufai, governor of Kaduna state, says the “differential scores” that the Joint Admissions and Matriculation Board (JAMB) allot to northern students have “made our people lazy”.\nEl-Rufai said the preferential scores “have not helped” the region out of the educational disadvantage it has been battling since independence.\nHe then asked that JAMB abolish the low cut-off marks to encourage students from the region “to work hard and compete”.\nWe’ve continuously been the disadvantaged region right from independence even though we’re given preferences, JAMB scores and all that.\nWe are confident that from the next two weeks, we would start the gradual reopening of schools,” the governor said."
  },
  {
    "headline": "NNPC to consider initial public offering in 2024, says Kyari",
    "summarized_story": "Mele Kyari, group managing director of the Nigerian National Petroleum Corporation (NNPC), says the corporation may issue an initial public offering (IPO) to investors in the next three years.\nAdvertisementAn initial public offering (IPO) is the first time a company issues shares to the public.\nIn 2019, Saudi Aramco, the state-owned oil firm of the Kingdom of Saudi Arabia, went public with record international initial public offering.\n“We will be in the position to consider any IPO in three years; that is the provision of the law,” Kyari said.\nAccording to him, the IPO will put NNPC in an even better position in the oil and gas space."
  },
  {
    "headline": "NNPC to consider initial public offering in 2024, says Kyari",
    "summarized_story": "Mele Kyari, group managing director of the Nigerian National Petroleum Corporation (NNPC), says the corporation may issue an initial public offering (IPO) to investors in the next three years.\nAdvertisementAn initial public offering (IPO) is the first time a company issues shares to the public.\nIn 2019, Saudi Aramco, the state-owned oil firm of the Kingdom of Saudi Arabia, went public with record international initial public offering.\n“We will be in the position to consider any IPO in three years; that is the provision of the law,” Kyari said.\nAccording to him, the IPO will put NNPC in an even better position in the oil and gas space."
  },
  {
    "headline": "CLOSE-UP: Meet Ifedayo Adetifa, the new NCDC DG 'who cracked a tuberculosis riddle'",
    "summarized_story": "Ifedayo Adetifa, an epidemiologist and paediatrician, was on Tuesday appointed as the director-general of the Nigeria Centre for Disease Control (NCDC).\nHe has, indeed, distinguished himself in the medical profession with over 16 years of research on infectious diseases.\nRENOWNED SCHOLARAdetifa has conducted several medical research in Africa and Europe.\nA MAN OF MANY ‘PORTFOLIOS’Adetifa is an associate professor of infectious disease epidemiology at London School of Hygiene and Tropical Medicine.\nAdvertisementPrior to joining the institution, he worked as a clinical epidemiologist at the medical research council unit, The Gambia at the LSHTM with research interests in tuberculosis epidemiology."
  },
  {
    "headline": "Arise B.V invests $75m in Ecobank in “landmark” transaction",
    "summarized_story": "Arise B.V, a leading equity investor in Africa, has made an Additional Tier 1 (AT1) investment of about $75 million in Ecobank Transnational Incorporated (ETI), the Togo-based parent company of Ecobank Group.\nA statement from ETI reveals that the AT1 instrument is the first to be issued by Ecobank, adding that Arise’s investment is Basel III-compliant.\nBasel III is an international regulatory accord rolled out by the Basel Committee, which introduced a set of reforms intended to minimise risk and promote stability in the international financial system.\nThe investment, described as a “landmark transaction” in sub-Saharan Africa (SSA), will help Ecobank optimise and improve its Tier-1 capital by $75 million, the company said.\nThe investment firm has indirect banking exposure to over 33 countries in the region with ETI its primary banking investment in Francophone and Anglophone West Africa."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Nigeria’ll overcome security challenges – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has expressed optimism that the country will overcome its present security challenges, but called on Nigerians to join hands with the government in the fight against insecurity.\nAccording to him, “The foundation you laid as Chief of Army Staff is what we are building on today.\nIt was deliberate because at no time in our history were we faced with the kind of security challenges that you faced as Chief of Army Staff.\nFor us as a state, the relationship that we have with the military today was laid during your tenure.\nEarlier, Buratai said he was in Benin to inaugurate the Buratai Centre for Contemporary Security Affairs, a centre which was named after him by Igbinedion University, Okada."
  },
  {
    "headline": "Edo PDP commences e-registration, targets one million members – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State chapter of the Peoples Democratic Party (PDP), on Monday, commenced its e-registration exercise for membership drive, with a target to register one million members for the party in the state.\nSpeaking at the flag-off of the nationwide exercise, at the state party secretariat in Benin City, Chairman of the Edo State e-registration committee, Rt.\nKabiru Adjoto, expressed optimism that with the cooperation of party members, stakeholders and leaders, the exercise would be successful.\nAccording to him, “the committee’s target is to register one million members for the PDP in the state.\nWe are also setting up e-registration Technical Academy in each Senatorial District, where agents will be receiving adequate training throughout the period of this exercise."
  },
  {
    "headline": "5 Communities Cut Off As 29-yr old Bridge Collapses In Delta, Motorcyclist Hospitalized – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Twenty-nine year old Eru Bridge along Uzere/Asaba Ase Expressway in Isoko South Council Area of Delta state has collapse leaving not less than five communities cut off from the rest of the state.\nSome of the highly flood prone communities which have been cut off include Uzere, Ekregbesi, Asaba-Ase, as well as riverine communities such as Ikpe-Irri, Abare among others.\nResidents of oil bearing Uzere community have cried out to the Federal Government to intervene immediately, in order to prevent the situation from worsening.\nPresident-general of Uzere community, Rotn.\nHe further disclosed that , prior to the construction of the bridge in 1992, the alternative access road was one constructed by Shell, “but as of now, that road is washed off”."
  },
  {
    "headline": "COVID-19 3rd wave: Edo urges vaccination as infection rises, fatality climbs to 22 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…unvaccinated persons account for 100 percent of deathsThe Edo State Government has intensified the vaccination of citizens across the state’s 18 local government areas, urging those who have been inoculated to come out and get vaccinated in order to remain healthy and protected against the deadly virus.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nObi, who decried the rise in the number of infections and deaths in the state, noted that it is imperative for all residents to be vaccinated to stay alive and healthy, as more unvaccinated persons continue to die from the virus.\nHe said Edo has recorded 22 deaths since the outbreak of the third wave of the pandemic in the state, adding that all deaths in the state are persons who were never inoculated with the COVID-19 vaccines.\nAccording to him, “Edo State, in the last 72 hours, recorded the death of four more persons who were unvaccinated with the COVID-19 vaccines, bringing the total number of fatalities recorded in the state to 22."
  },
  {
    "headline": "Police officer, civil defence official shot dead in Bayelsa",
    "summarized_story": "ADVERTISEMENTThe police in Bayelsa State have confirmed that a police sergeant, including an officer with Nigeria Security and Civil Defence Corps, have been shot dead by gunmen in Yenagoa.\nMr Butswat, a superintendent of police, said the task force repelled the gunmen and prevented them from attacking their target.\nThe police spokesperson confirmed the abduction of Gbalipre Turner, the father of the Chairman of the Ogbia Local Government Area of Bayelsa State, Ebinyon Turner.\nThe Commissioner of Police in Bayelsa State, Echeng Echeng, has ordered for a manhunt to rescue the kidnapped victim and arrest the fleeing gunmen, he said.\nSome bandits last month killed two officers and abducted a senior officer during a daring attack on the Nigerian Defence Academy in Kaduna."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Ifedayo Adetifa takes over from Ihekweazu as NCDC DG",
    "summarized_story": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari on Monday announced the confirmation of the appointment of Ifedayo Adetifa as the director-general of Nigeria Centre for Disease Control (NCDC).\nThis is following the resignation of Chikwe Ihekweazu after his appointment as assistant director-general of Health Emergency Intelligence at the World Health Organisation (WHO)According to a statement by Garba Shehu, presidential spokesman, “President Buhari has also approved the appointment of Dr Ifedayo Morayo Adetifa as the new Director General of Nigeria Centre for Disease Control (NCDC)”.\nAdetifa is an associate professor/clinical epidemiologist who received his undergraduate training at the University of Ilorin, Kwara, Nigeria"
  },
  {
    "headline": "Insecurity: Buhari meets security chiefs, others",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari is presently receiving briefings from the Chief of Defence Staff, Service Chiefs, the Inspector General of Police, and other heads of security agencies at the Presidential Villa, Abuja.\nAlso attending the meeting are the Ministers of Defence, Bashir Magashi; Justice, Abubakar Malami; Police Affairs, Maigari Dingyadi; Interior, Rauf Aregbesola; and Foreign Affairs, Geoffrey Onyeama.\nAttendees at the meeting are expected to brief the President on the current security situation across the country as well as proffer solutions.\n“President Buhari receives Security Briefing in State House on 7th Sep 2021,” Buhari’s media aide, Femi Adesina, posted on Facebook."
  },
  {
    "headline": "Chidoka to Buhari: Publish review on sacked ministers, security sector, others",
    "summarized_story": "OBINNA EZUGWUFormer Aviation minister, Mr. Osita Chidoka has charged President Muhammadu Buhari to publish an independent performance review he claimed informed his decision to sack minsters of Agriculture and Rural Development, Mohammed Sabo Nanono and Power, Engr.\nRecall that President Buhari had last week, in an uncharacteristic move, announced the sack of Nanono and Mamman.\nPresident Buhari, in a widely reported speech at the Federal Executive Meeting, predicated his decision on a claimed “independent and critical self-review” of sectorial performance and evaluation.\n“Mr President, prove us wrong.\nIn the interest of transparency and your avowed commitment to change Nigeria, publish the result of this review."
  },
  {
    "headline": "El Salvador officially becomes first country to make Bitcoin legal tender",
    "summarized_story": "Three months after its legislature passed Bitcoin law that said “every economic agent must accept the use of Bitcoin as a legal form of payment under the law,” El Salvador has officially made the cryptocurrency a legal tender.\nIn June of this year, the El Salvadoran Legislature voted to pass Bitcoin as a legal tender.\nBukele had argued that the need to adopt Bitcoin as a legal tender came about as a result of the financial inclusion gap that exist in the country.\nEl Salvador is home to approximately 6.5 million people in which 70% of them do not have access to financial services.\nEl Salvador has the right to move toward the first world.”"
  },
  {
    "headline": "Niger Closes 8 Banks Over N456m Tax Debt",
    "summarized_story": "Niger State Internal Revenue Service has closed the branches of eight banks and three other organisations over N456.7m unpaid tax liability.\nThe chairman of the service, Mohammed Madami Etsu, disclosed this yesterday in Minna, Niger State.\nHe said the exercise was carried out in line with the provisions of the relevant tax laws and as a deliberate policy to block leakages.\nADVERTISEMENTThe chairman explained that all efforts by the service to enable the defaulting organisations pay their respective tax liability yielded no positive result.\nEtsu further called on other debtors to pay their outstanding tax liability to avoid sealing of their offices by the Service as the tax drive exercise is a continuous one."
  },
  {
    "headline": "Niger Closes 8 Banks Over N456m Tax Debt",
    "summarized_story": "Niger State Internal Revenue Service has closed the branches of eight banks and three other organisations over N456.7m unpaid tax liability.\nThe chairman of the service, Mohammed Madami Etsu, disclosed this yesterday in Minna, Niger State.\nHe said the exercise was carried out in line with the provisions of the relevant tax laws and as a deliberate policy to block leakages.\nADVERTISEMENTThe chairman explained that all efforts by the service to enable the defaulting organisations pay their respective tax liability yielded no positive result.\nEtsu further called on other debtors to pay their outstanding tax liability to avoid sealing of their offices by the Service as the tax drive exercise is a continuous one."
  },
  {
    "headline": "MAAUN Congratulates Pantami On Professorial Elevation",
    "summarized_story": "The Management of Maryam Abacha American University of Nigeria (MAAUN), has congratulated the Minister of Communication and Digital Economy, Dr. Isa Ali Ibrahim Pantami on his promotion to the rank of Professor of Cybersecurity.\nPantami is among seven Readers (Associate Professors) promoted to Professor by the Governing Council of Federal University of Technology, Owerri (FUTO) at its 186th meeting held on Friday, August 20, 2021.\nADVERTISEMENTHe said the elevation of Dr. Pantami by FUTO to professorial position was timely in view of the fact that he is an internationally recognised researcher, academic, policymaker, regulatory expert and a teacher who has over 160 publications to his credit.\n“Pantami has received over 130 awards and recognitions both within and outside Nigeria.He equally received awards as the best minister in Nigeria”, Gwarzo said.\nThe MAAUN President described Prof. Pantami as a committed youth and scholar who contributed to the growth and development of Nigeria through NITDA and the currently as Minister of Communication and Digital Economy."
  },
  {
    "headline": "MAAUN Congratulates Pantami On Professorial Elevation",
    "summarized_story": "The Management of Maryam Abacha American University of Nigeria (MAAUN), has congratulated the Minister of Communication and Digital Economy, Dr. Isa Ali Ibrahim Pantami on his promotion to the rank of Professor of Cybersecurity.\nPantami is among seven Readers (Associate Professors) promoted to Professor by the Governing Council of Federal University of Technology, Owerri (FUTO) at its 186th meeting held on Friday, August 20, 2021.\nADVERTISEMENTHe said the elevation of Dr. Pantami by FUTO to professorial position was timely in view of the fact that he is an internationally recognised researcher, academic, policymaker, regulatory expert and a teacher who has over 160 publications to his credit.\n“Pantami has received over 130 awards and recognitions both within and outside Nigeria.He equally received awards as the best minister in Nigeria”, Gwarzo said.\nThe MAAUN President described Prof. Pantami as a committed youth and scholar who contributed to the growth and development of Nigeria through NITDA and the currently as Minister of Communication and Digital Economy."
  },
  {
    "headline": "Federal Govt Begins Digitisation Of Conditional Cash Transfer In Gombe",
    "summarized_story": "In its ongoing efforts of uplifting the poor and the vulnerable in the society and to ease the task of its operations in the emancipation of needy, the federal government has commenced the digitisation of its Conditional Cash Transfer (CCT) to beneficiaries in Gombe State.\nIn Gombe State, the exercise was piloted in seven wards, targeting more than 1044 beneficiaries in Gombe local government area out of the 26,518 beneficiaries who are enjoying the programme.\nThe exercise took place last Thursday at Jekadafari ward with beneficiaries who comprised of the poor and the vulnerable in the society.\nADVERTISEMENTSpeaking at the event, the head of unit (Gombe SCTU), Comrade Jatau Abubakar said the digitisation of household uplifting programme (HUP) of the federal government was implemented to minimize the risk of carrying cash about, even as the modern world today, is fast transforming into cashless economy.\nMeanwhile, the national monitoring and evaluation officer (NCTO, Abuja), Madam Joyce Dida, was at the venue of the exercise at Jekadafari ward to monitor the digitisation processes of the payment and expressed her satisfaction of what she observed."
  },
  {
    "headline": "Cholera: 23 states, FCT record 65,145 suspected cases, 2,141 deaths",
    "summarized_story": "The Nigeria Centre for Disease Control has announced a total 65,145 suspected cases of cholera, including 2,141 deaths, representing a Case Fatality Rate of 3.3 percent reported from 23 states and the FCT, as of September 2, 2021.\nAll the suspected cases, comprised 51 percent males and 49 percent females.\n“23 states and the FCT have reported suspected cholera cases in 2021.\n“In the reporting week, 16 states plus the FCT reported 2,127 suspected cases – the NCDC said.\nThese lead to the spread of water-borne diseases such as cholera and without proper WASH, Nigeria remains at risk of cholera cases and deaths."
  },
  {
    "headline": "Cholera: 23 states, FCT record 65,145 suspected cases, 2,141 deaths",
    "summarized_story": "The Nigeria Centre for Disease Control has announced a total 65,145 suspected cases of cholera, including 2,141 deaths, representing a Case Fatality Rate of 3.3 percent reported from 23 states and the FCT, as of September 2, 2021.\nAll the suspected cases, comprised 51 percent males and 49 percent females.\n“23 states and the FCT have reported suspected cholera cases in 2021.\n“In the reporting week, 16 states plus the FCT reported 2,127 suspected cases – the NCDC said.\nThese lead to the spread of water-borne diseases such as cholera and without proper WASH, Nigeria remains at risk of cholera cases and deaths."
  },
  {
    "headline": "Former Akwa Ibom senator abducted from own bar",
    "summarized_story": "Armed men on Sunday kidnapped the former Senator representing Akwa Ibom South Senatorial district in the 8th National Assembly, Senator Nelson Effiong.\nEffiong, a former Speaker of the Akwa Ibom State House of Assembly, who hailed from the Oron Local Government Area, was abducted by three armed men who stormed his lounge, a popular sit-out along Oron Road, Uyo, the state capital, around 9pm on Sunday.\nIt was gathered that the hoodlums drove into the scene in a Toyota Camry car and shot into the air to scare away people from the sceneAccording to our sources no fewer than eight persons were reportedly injured in a stampede during the kidnap operation which lasted for some minutes.\nOne of the sources said, “The incident occurred aroumd 9pm on Sunday.\nThe armed men came in a Toyota Camry and started shooting, sending the customers and other guests to away before they made for the former Senator."
  },
  {
    "headline": "Former Akwa Ibom senator abducted from own bar",
    "summarized_story": "Armed men on Sunday kidnapped the former Senator representing Akwa Ibom South Senatorial district in the 8th National Assembly, Senator Nelson Effiong.\nEffiong, a former Speaker of the Akwa Ibom State House of Assembly, who hailed from the Oron Local Government Area, was abducted by three armed men who stormed his lounge, a popular sit-out along Oron Road, Uyo, the state capital, around 9pm on Sunday.\nIt was gathered that the hoodlums drove into the scene in a Toyota Camry car and shot into the air to scare away people from the sceneAccording to our sources no fewer than eight persons were reportedly injured in a stampede during the kidnap operation which lasted for some minutes.\nOne of the sources said, “The incident occurred aroumd 9pm on Sunday.\nThe armed men came in a Toyota Camry and started shooting, sending the customers and other guests to away before they made for the former Senator."
  },
  {
    "headline": "Cholera spreads to Ogun community, 10 feared dead",
    "summarized_story": "By Olanrewaju Akojede/LagosAnxiety is mounting in Magboro Community of Ogun over a suspected Cholera outbreak, with about 10 people already feared dead.\nThe suspected outbreak was first reported on Friday, when a resident of the community living in an uncompleted building died.\nThe Secretary of Magboro Community Development Council, Mr David Ajayi, said that the deaths could have been averted if those affected reported on time.\n“We received the report of suspected cholera outbreak when the deed had already been done.\nHe was too weak, he was transferred to a community health centre, where he is currently receiving treatment,” she said."
  },
  {
    "headline": "My husband paid N5 as my bride price, Insp. Odeligbo tells court",
    "summarized_story": "She explained that she was married in 2005 under the Idoma Native Laws and she has two children.\nThe petitioner said on March 8, 2014, Gabriel sent her out of their home because she requested to attend a marriage ceremony.\n“He paid N5 as bride price.\nShe prayed to the court to order her husband to cater for his kids and also pay their school fees and other things.\nAfter listening to the petitioner, the President of the Court, Rose Ioryshe adjourned the case until Sept. 10 for defense."
  },
  {
    "headline": "BREAKING: Buhari Meets With Security Chiefs, Others",
    "summarized_story": "At the Presidential Villa in Abuja, the president, Major General Muhammadu Buhari (retd.\n), is receiving briefings from the Chief of Defence Staff, Service Chiefs, Inspector General of Police, and other heads of security agencies.\nBashir Magashi, Minister of Defense; Abubakar Malami, Minister of Justice; Maigari Dingyadi, Minister of Police Affairs; Rauf Aregbesola, Minister of Interior; and Geoffrey Onyeama, Minister of Foreign Affairs, are also in attendance.\nAttendees at the conference are scheduled to brief the President on the current security situation around the country as well as provide solutions, according to the PUNCH.\n“President Buhari receives Security Briefing in State House on 7th Sep 2021,” Buhari’s media aide, Femi Adesina, posted on Facebook."
  },
  {
    "headline": "Nigeria’s Monarch, Ooni Tells Buhari To Listen To Secession Agitators",
    "summarized_story": "The Ooni of Ile Ife, Oba Ogunwusi Adeyeye, has called on Nigerian leaders to address the concerns of youths agitating for a breakup of the country.\nThe monarch believes the young Nigerians are uncertain of what the future holds for them considering the present realities in the nation.\nSpeaking when he featured as guest on Channels Television’s News Night on Monday, the traditional ruler stressed the need to fix Nigeria.\nFor me, it is a sensitive matter because they (the agitators) are youths; because they are very afraid of the future.\nThe strength of us together is better but when agitations like this are coming us, listen to them,” the monarch said."
  },
  {
    "headline": "BREAKING: Gunmen Kidnap 18 Residents In Kaduna Community",
    "summarized_story": "Around 18 people have been kidnapped in Keke, a community in Kaduna State’s Chikun Local Government Area.\nThe gunmen are alleged to have entered the community at 12 a.m., according to the Daily Trust.\nAccording to eyewitnesses, the gunmen arrived in huge numbers and grabbed 18 people after causing panic in the area.\nIn a series of raids on the North-West states in particular, bandits have ravaged Kaduna.\nJoseph Maza, Timvan Cibi Ciwo, Monday Titus, Asabe Magani, Laraba Danladi, and Yosi Danladi were among the victims killed by bandits, according to Aruwan."
  },
  {
    "headline": "Fulani Herdsmen Should Stay In One Place – Governor Masari",
    "summarized_story": "Governor Bello Masari of Katsina State has said herdsmen ought to stay in a place to graze their cattle.\nThe governor, who faulted the movement of herders from one part of the country to another, said government ought to make provision for where animals would stay before banning grazing.\nI don’t think it is right.”He added that the Federal Government has disbursed N6.2 billion for the project as part of the efforts to kick start the ranching programme.\n“We already have started, the Federal Government has given us N6.2 billion and as a state government, we are also investing N6.2 billion.\nWhile a few of them signed the law banning open grazing before the September 1, 2021 deadline, others failed to do so."
  },
  {
    "headline": "Happening now: President Muhammadu Buhari meets Service Chiefs amidst persistent insecurity (Pictures)",
    "summarized_story": "NextHow bandits killed over 300, displaced 3000 villagers within months in Shiroro – Senator Musa"
  },
  {
    "headline": "4 killed, 1 beheaded in fresh Plateau attack",
    "summarized_story": "Police have confirmed the killing of four persons in renewed isolated attacks in Bassa local government area of Plateau state.\nThe latest of killings occurred Sunday evening at Kpachudu community where a herder was killed and beheaded.\nHe said more personnel had been deployed to the areas to restore peace.\n“Investigation has since commenced to fish out the perpetrators of the dastardly act,” he added.\nThe Miyyeti Allah Cattle Breeders Association of Nigeria (MACBAN) accused “members of the Irigwe community as being behind the killing 13-year old herder, whose corpse was beheaded."
  },
  {
    "headline": "Conflicting court orders making INEC work difficult – Yakubu",
    "summarized_story": "INEC Chairman Professor Mahmood Yakubu stated this at the third quarterly meeting with political parties Monday in Abuja.\n“This situation is compounded by cases on the leadership of political parties, thereby making the exercise of our regulatory responsibilities difficult.\nBy the same token, as Chairmen and leaders of political parties, you have a role to play.\nWe are convinced that the new machine is robust enough to further guarantee the credibility of voter authentication and transparent management of results during elections.\nThere will be a presentation of the new device and a practical demonstration of its functions to Chairmen and leaders of political parties at this meeting,” Yakubu told the meeting."
  },
  {
    "headline": "JAMB withdraws 2021 UTME result of 19year-old candidate over forgery – NigPilot",
    "summarized_story": "The 19 year old candidate who claimed that JAMB has been altering his results since 2019 was also handed over to Nigeria Police for investigation.\nOloyede accused the candidate of result tempering, adding that he will be handed over to the police for investigation and subsequently prosecuted.\nBecause this boy has accused JAMB, we are going to withhold his result until the investigation is concluded.\nEarlier, John had said: The result I have been receiving is not the result I am entitled to.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Abuja Police arrest 2 adolescent kidnappers – Nigpilot",
    "summarized_story": "Federal Capital Territory FCT Police Command Abuja has arrested two adolescent kidnappers operating along Kwali area Council of the City.\nPublic Relations Officer of the Command in a statement on Thursday in Abuja, said the Command arrested one Musa Mukailu 18 years and one Damina Wali 17 years all male suspected to be kidnappers along Kwali axis of the FCT.\nAdding that they met their waterloo while trying to kidnap two women along kwali axis of the FCT.\nEffort is in place to arrest other members of the syndicate.”Stressing that the Command pledges its undeterred resolve to ensure lives and properties of residents within the FCT are protected.\nAnd urged the FCT residents to report all suspicious movements,"
  },
  {
    "headline": "Buhari has recovered about N1trn stolen funds, assets since 2015 – APC group – NigPilot",
    "summarized_story": "As part of its anti-corruption drive, the administration of President Muhammadu Buhari has recovered about a trillion Naira worth of stolen funds and assets since assuming office in 2015, Nigerian Pilot has gathered.\nThis is according to APC Legacy Awareness and Campaign, a voluntary think-tank group of the governing All Progressives Congress, APC.\nThe group noted that under President Buhari’s watch the Federal Government has prioritized the recovery and return of stolen assets belonging to the Nigerian people.\nLukman, APC-LAC said all final forfeitures are being deployed for use in the Government’s special Infrastructure and Social Investment Programmes, or put into the annual Budget.\nIt added that the most recent Abacha and Ibori Loots were transferred to the Nigeria Sovereign Investment Authority (NSIA), for transparent management under the Presidential Infrastructure Development Fund (PIDF)."
  },
  {
    "headline": "President replaced, not sacked Minister -Adesina. ~ Says national service is to God and humanity – NigPilot",
    "summarized_story": "Special Adviser to the President on Media and Publicity, Femi Adesina has said President Muhammad Buhari did not sack, but replaced ministers of Agriculture and Rural Development, Alhaji Mohammed Nanono and his Power counterpart, Saleh Mamman, saying national service is to God and humanity.\nSpeaking in an interview with Channels TV on Sunrise Daily yesterday, Adesina said contrary to media and public views, the president only called to thank the replaced ministers for their services but never sacked them.\n“The president never said their performances were weak but said he had called them personally to thank them for their services to the country and needed to move on to replace them.\n“The president must have had reasons for dropping the two ministers but he never said their performances were weak,” he emphasised.\nHe reassured Nigerians of President Muhammadu Buhari’s commitment towards the yearnings of the current challenges, saying that the president is resolute on tackling all issues headlong to secure the future of the country."
  },
  {
    "headline": "With Benefit Of Hindsight, I Wouldn’t Have Granted Bandits Amnesty – Masari",
    "summarized_story": "Katsina State Governor Aminu Masari says with the recent activities of bandits and information now at his disposal, he wouldn’t have granted amnesty to bandits as he did years back.\n“I don’t regret it, the only thing I say is with the benefits of hindsight, I wouldn’t have done it.\n“The latest instruction that we gave out is the closure of all commercial charging points in the most affected local government areas.\nCommercial charging, we believe, is also an area which is helping the bandits to acquire means of communication,” he said.\nOver the weekend, the younger sister of the Deputy Speaker of the Katsina State House of Assembly, Dalhatu Tafoki was kidnapped."
  },
  {
    "headline": "Ex Parte Orders: CJN Reads Riot Act As NJC Queries Three Judges",
    "summarized_story": "The Chief Justice of Nigeria (CJN) and Chairman of the National Judicial Council (NJC), Justice Tanko Muhammed, on Monday held a marathon meeting with the six chief judges invited over the conflicting ex parte orders emanating from different judges across the country.\n“We must, therefore, put an end to indiscriminate granting of ex parte orders, conflicting judgements or rulings occasioned by forum-shopping.\nWe shall make an example with three judges and never shall we condone such act.”Three of the judges who granted conflicting ex parte orders have been invited to appear before the NJC to show cause why disciplinary action should not be taken against them for granting such orders.\nThe CJN warned the CJs to desist from the practice of designating newly appointed judicial officers as vacation judges and assigning complex cases to inexperienced judges.\nThe NJC is to invite all heads of courts to a meeting to re-emphasise the need for the judiciary to be circumspect on the issue of granting ex parte orders."
  },
  {
    "headline": "Anti-Open Grazing, VAT Bills Scale Second Reading At Lagos Assembly",
    "summarized_story": "Members of the Lagos State House of Assembly on Monday committed an anti-open grazing bill to the Committee on Agriculture after it scaled second reading.\nThe House also read for the first and second time, the state’s Value-Added Tax bill and asked the Committee on Finance handling it to report back on Thursday.\nHe suggested that the bill should make provision for the registration of herders and prepare them for ranching.\nSpeaking about the bill on VAT, he expressed hopes that it would lead to an “increase in revenue and increase in infrastructural development.\nWhile the lawmaker advocated stiffer penalties for herders caught carrying firearms, his position was supported by Joseph who said open grazing in the 21st century was an aberration."
  },
  {
    "headline": "Four Killed In Fresh Plateau Attack",
    "summarized_story": "Four persons have been killed in a fresh attack in Plateau State.\nThe victims, who are all male, were killed by suspected herdsmen on Monday at Renwienku village of Miango District in Bassa Local Government Area of the North-Central State.\nThe Miyetti Allah leader in the state, Nura Mohammad described the incident as unfortunate in spite of the ongoing peace efforts in the state.\nREAD ALSO: Politics Hinders Security Agencies From Doing Their Jobs, Says Ex-DSS DirectorPlateau Crisis: Sanwo-Olu Evacuates Three-Week Old Baby, Lagos Students From JosThe recent incidents are the latest in renewed clashes in Plateau State.\nLast month, there was tension in the state after some travellers were killed, a development which prompted the Plateau government to impose a curfew on the state."
  },
  {
    "headline": "Bolsonaro Issues Decree Limiting Social Media Moderation",
    "summarized_story": "Brazilian President Jair Bolsonaro issued a decree Monday that changes the rules of content moderation on social media, a move that critics argue could hinder the fight against disinformation.\nThe decree goes into effect immediately but must be ratified by Congress in order to become law.\nIt aims to combat “the arbitrary and unjust deletion of accounts, profiles and content by providers,” the federal communications secretariat said.\n“This provisional measure significantly hinders our ability to limit abuse on our platforms,” a Facebook spokesperson told AFP.\n“We agree with legal experts and specialists who view the measure as a violation of constitutional rights.”Alessandro Molon, an opposition politician and rapporteur of Brazil’s bill of rights for the internet (MCI), said he was preparing legal action to overturn the presidential decree."
  },
  {
    "headline": "At least four persons killed in fresh attack in Bassa LGA",
    "summarized_story": "No fewer than four persons have been reportedly killed in separate attacks on two communities in Bassa LGA of Plateau state.\nTVC News reliably gathered that the attacks were said to have taken place in Kwachudu and Irigwe on Sunday evening and Monday morning respectively.\nThe police spokesperson, Ubah Ogaba, who confirmed this development to our Correspondent, did not provide details of the attacks, said security operatives have been deployed to maintain calm in the areas, adding that the perpetrators would be made to face justice."
  },
  {
    "headline": "BREAKING: Buhari meets security chiefs, others",
    "summarized_story": "President Muhammadu Buhari is currently meeting with the Chief of Defence Staff, Service Chiefs, the Inspector General of Police, and other heads of security agencies at the Presidential Villa, Abuja.\nAlso attending the meeting are the Ministers of Defence, Bashir Magashi; Justice, Abubakar Malami; Police Affairs, Maigari Dingyadi; Interior, Rauf Aregbesola; and Foreign Affairs, Geoffrey Onyeama.\nTVC News reliably gathered that attendees at the meeting are expected to brief the President on the current security situation in the country as well as propose solutions.\n“President Buhari receives Security Briefing in State House on 7th Sep 2021,” Buhari’s media aide, Femi Adesina, posted on Facebook.\nThe emergence of criminal gangs, often with hundreds of members, who raid communities, steal cattle, and kidnap residents for ransom after looting and burning homes exacerbated the country’s insecurity."
  },
  {
    "headline": "Miyetti Allah urges NASS to stop enactment of laws by Southern Govs",
    "summarized_story": "Miyetti Allah urges NASS to stop enact ...\nThe post Miyetti Allah urges NASS to stop enactment of laws by Souther [...]CLO calls for extension of Continuous ...\nThe Civil Liberties Organisation (CLO) has urged the Independent Natio [...]Court hears Sunday Igboho’s N500m suit ... A federal high court in Ibadan, Oyo state capital has commenced hearin [...]CJN comes down hard on invited judges ...\nThe Chief Justice of Nigeria today had a one -on -one meeting with the [...]President Buhari seeks Rotary Club’s s ... President Muhammadu Buhari Monday in Abuja said the Federal Government [...]President Buhari sets up Health Sector ... President Muhammadu Buhari has approved the setting up of a Health Sec [...]Updated: Lagos DPP to charge Chidinma ...\nThe Directorate of Public Prosecution of Lagos State will now prosecut [...]"
  },
  {
    "headline": "CLO calls for extension of Continuous Voter Registration in Anambra -",
    "summarized_story": "The Civil Liberties Organisation (CLO) has urged the Independent National Electoral Commission (INEC) to extend its Continuous Voters Registration (CVR) in Anambra to accommodate more registrants.\nThe Chairman of CLO in Anambra, Mr Vincent Ezekwueme, said that the commission should consider extending the exercise, which is the bedrock of participatory democracy, till the end of September.\nAccording to Ezekwueme, this is due to the inability of prospective registrants to register owing to one or two unforeseen circumstances and delay.\n“The voter card remains a veritable and legitimate weapon to enthrone good governance as well as vote out selfish and corrupt leaders,” he said.\nThe CLO boss also pleaded with contestants, political parties, and politicians to give peace a chance by putting the interest of the state and citizens above their parties and personal interest."
  },
  {
    "headline": "Libyans Questions Release of Saadi Gaddafi From Prison – Arise News",
    "summarized_story": "Libyans are questioning the timing of the release of Saadi Kadhafi, a son of Libya’s late dictator Muammar Gaddafi, who was overthrown and killed in a 2011 uprising.\nSome residents of the capital Tripoli however praised the Libyan judiciary for basing its decision on “justice and integrity”.\nSaadi – the strongman’s third son, now aged 47 — was known for his playboy lifestyle and briefly played as a professional footballer in Italy.\n“Why were Saadi and (intelligence chief) Ahmad Ramadan released now?,” asked Abdellatif Dakdak, a fuel engineer.\nThis shows the justice and integrity of the judiciary,” said Mohammed Ali Jawaylak, a Tripoli resident."
  },
  {
    "headline": "South Africa: Ramaphosa Welcomes Zuma’s Release as Critics Kick",
    "summarized_story": "South African President Cyril Ramaphosa says he welcomes the decision to release his predecessor Jacob Zuma on medical parole, a decision taken just days before the resumption of the corruption trial of the former head of state that has provoked the anger of the opposition.\nHe was convicted of repeatedly refusing to appear before a commission investigating state corruption during his presidency (2009-2018).\nCyril Ramaphosa has made the fight against corruption a key issue, especially within the ANC.\nOpposition parties and groups are demanding that the authorities publicly disclose the steps in the process that led to his release on parole.\nZuma’s corruption trial is due to resume on Thursday."
  },
  {
    "headline": "Guinea Opposition Leader Diallo Endorses Coup Against Conde",
    "summarized_story": "Guinea’s opposition leader Cellou Diallo has welcomed the coup that ousted Alpha Conde from power expressing his willingness to work with the junta.\nIn a press conference on Monday, opposition leader Diallo said he was willing to work with the junta, a major endorsement from the political class for coup leader Mamady Doumbouya.\nAlpha Conde had only been re-elected for a third presidential term last November.\nSome fear that the coup will mark the return of military rule to Guinea, a country that’s no stranger to volatility.\nMamady Doumbouya, a former French army officer cited poverty and corruption as justification for his coup."
  },
  {
    "headline": "Jaiz Bank Plc Receives $25m Financing From Islamic Development Bank",
    "summarized_story": "Jaiz Bank Plc, Nigeria’s foremost non-interest bank, has received a $25 million shariah-compliant Line of Financing (LOF) from the Islamic Development Bank (IsDB) to support small and medium scale enterprises (SMEs) in Nigeria.\nThe LOF was signed by Ayman Sejiny, Chief Executive of the Islamic Corporation for the Development of the Private Sector (ICD), the private sector arm of IsDB Group, and Mr Hassan Usman, the Managing Director and Chief Executive of Jaiz Bank.\nAccording to the LOF agreement, this will be done to support the SMEs in Nigeria, including those adversely affected by the COVID-19 outbreak.\nThe contract details indicate that out of the sum of $25 million funds provided, $10 million is allocated under the ICD’s $250 million COVID-19 support package to help the private sector affected by the pandemic by leveraging on the expertise of the banking system of its member countries.\nICD’s line of financing facility will help to expand Jaiz Bank’s customer base by the provision of Shariah-compliant financing in response to a growing demand for Islamic finance to support, among others, COVID-19 affected projects and industries, the statement reads."
  },
  {
    "headline": "Guinea Coup Leader Bars Foreign Travel for Government Officials",
    "summarized_story": "“There will be no witch-hunt,” he said a day after the coup which drew international condemnation and threats of sanctions.\nDoumbouya said on state television on Sunday that “poverty and endemic corruption” had driven his forces to remove Conde from office.\nThe demographics of Guinea and the Sahel and West African states are such that people are losing patience.\nThe United Nations quickly denounced the takeover, and both the African Union and West Africa’s regional bloc have threatened sanctions.\n“These actions could limit the ability of the United States and Guinea’s other international partners to support the country,” the statement said."
  }
]