[
  {
    "headline": "Sokoto govt denies alleged diversion of N189bn",
    "summarized_story": "The Sokoto State Government has denied diverting N189bn following reports published by some online news media.\nThe reports cited a so-called EFCC interim report on Sokoto State.\nThe Government of Sokoto State has established deserved reputation as the champion of budget transparency, fiscal responsibility, and open governance.\nFor this commitment, Sokoto State has received up to $34.1million as special grant from the World Bank.\nThe statement further stated that it invited anyone who wished to investigate the financial of the state to feel free to request the report of the Sokoto State Bureau of Public Procurement and Private Partnership on all public expenditures in Sokoto State."
  },
  {
    "headline": "Gombe launches app to aid universal health coverage",
    "summarized_story": "Gombe State Governor, Muhammadu Yahaya has launched a mobile application to encourage Universal Health Coverage across all strata.\nAccording to him, since the takeoff of the initiative about 60,000 state civil servants, with their dependants have been enrolled and more than 25,000 poor and vulnerable accessing health care services in the state.\nHe said GoHealth ICT framework and blueprint would enable the state to leverage current and future ICT investments toward building an integrated health information infrastructure and greatly contribute to universal healthcare coverage.\nYahaya said, “In order to accelerate our drive towards achieving Universal Health Coverage in the state, our administration adopted innovative use of ICT for health in order to improve service delivery, ensure responsiveness, increase access, expand coverage and offer financial risk protection to our people.\n“From the demonstration of the GoHealth mobile App we just witnessed, it is clear that the App is user-friendly, safe, and secure."
  },
  {
    "headline": "Jubilant supporters receive Onoh back to Enugu",
    "summarized_story": "Jubilating supporters of Denge Josef-Ken Onoh, on Thursday, thronged the Akanu Ibiam International Airport, Enugu, where they welcomed him back after he purchased the Peoples Democratic Party, PDP governorship nomination form in Abuja.\nAddressing the supporters, at the airport, Onoh told them, it was for the security, welfare and greater good of the people of Enugu state that makes him aspire to lead the state from 2023, stating that he has much at stake coming from a background that sacrificed for Enugu state, which he said was a covenant than selfish gains.\nHe also said he would redevelop community primary and secondary schools, and neighbourhood information centres in all layouts including fitness centres and libraries.\nAccording to him: “Enugu state deserves a continuity of the Ugwuanyi inclusive administration.\nFrom the airport, Onoh’s train moved to see Governor Ugwuanyi at the state government house, after which they move to his country home, Enugu-Ngwo."
  },
  {
    "headline": "Breaking: Appeal Court dismisses suit against Umahi, Deputy",
    "summarized_story": "By Peter Okutu, AbakalikiThe Appeal Court sitting in Enugu, Friday dismissed the suit filed by the candidate of the All Progressives Congress, APC, Ebonyi State, in the 2019 Governorship election, Senator Sonni Ogbuoji and his Deputy, Chief Justin Ogbodo Mbam, which demanded the Court to declare the seats of Governor David Nweze Umahi and his Deputy, Dr Kelechi Igwe vacant on account of their defection from the Peoples Democratic Party, PDP to the APC.\nRecall that on Tuesday, February 28, 2022, the Ebonyi State High Court sitting in Abakaliki, struck out the same suit and awarded N500, 000 as damages against the plaintiff.\nIn a 37 minutes ruling, the Judge, Justice A.O Belgore dismissed the suit for being inconsistent with the constitution and extant laws of the country.\nDetails later:"
  },
  {
    "headline": "2023: I’ll consolidate on Okowa’s achievements — Oborevwori",
    "summarized_story": "…visits Ogwashi-Uku, Agbor, Owa-OyibuBy Festus Ahon, ASABAA frontline governorship aspirant and Speaker of the Delta State House of Assembly, Rt.\nHon Sheriff Oborevwori, Thursday, promised to consolidate on the achievements of Governor Ifeanyi Okowa when elected as Governor in 2023.\nHear him: “My vision if elected the Governor of Delta State next year is to keep our dear state ahead of other states.\nIf I don’t develop Delta State as a governor, where will I go to?\nAt Owa- Oyibo, Oborevwori said; “I have the intention to serve this state in 2023 as the Governor."
  },
  {
    "headline": "Our leadership recruitment process is faulty — Jega, Ahmad",
    "summarized_story": "We must contribute to the development of a criteria to be used to mobilize citizens for good leadership recruitment for the 2023 general elections and beyond.\nIt is clear that for as long as the current pattern of leadership recruitment continues, our troubles will continue.\nFormer Minister of Education Dr Oby Ezekwesili who was one of the eminent speakers said Nigeria lacked right leadership.\nThere should be mechanism for assessment, accountability — Shayjh AhmadChief Missioner of Ansar-Ud-Deen Society Worldwide, Shaykh Ahmad AbdurRahman said the leadership recruitment process in the country is faulty.\nPetroleum Economist/lecturer at the Department of Economic, Umar Musa Yar’Adua University, Katsina, Dr. Ahmed Adamu, noted that to have a good governance, leadership recruitment systems require an evolutionary change."
  },
  {
    "headline": "Lekki-Ikoyi Link Bridge: Give people Justice, jettison toll collection, DJ Switch, Savvy Rinu, others speak",
    "summarized_story": "By Nwafor SundayAs the Lekki Concession Company, LCC, plans to resume toll collection on the Lekki-Ikoyi link bridge, Nigerians have on Friday advised the Lagos state government to jettison the plan, noting that people must get justice before the resumption of toll collection.\n@akintollgateWe don’t want protests, We don’t want more protests, No one needs any more protests !\nYou denied this open crime until you were exposed by a panel you put together to cover your trails.\nWe, therefore, do not understand why Lekki people must be the people to pay construction debts through tolling.\nWe are also calling for an enlarged stakeholders’ meeting to provide opportunity for a proper re-evaluation of this matter,” LERSA said."
  },
  {
    "headline": "UTAS saga: ASUU under fire over threat to withdraw Kashifu Inuwa’s degree",
    "summarized_story": "The union’s preferred payment platform has generated controversy and pitched ASUU against the Federal Government of Nigeria.\nResponding, the National Information Technology Development Agency (NITDA) explained why UTAS was yet to be approved.\nOn Friday, NADIR accused ASUU of taking the matter personal through its colleagues at the Abubakar Tafawa Balewa University (ATBU).\nThe body said the chapter had commenced a process to get the degree certificate of NITDA Director-General, Kashifu Inuwa, withdrawn.\n“Has the union now usurped the mandate of University Senate in awarding degree certificates?"
  },
  {
    "headline": "2023: What IBB told Saraki, Tambuwal, Bala Mohammed about Nigeria’s next President",
    "summarized_story": "Former military Head of State, General Ibrahim Babangida has told former Senate President Bukola Saraki and Governor of Sokoto State, Aminu Tambuwal that those aspiring for the presidency must put the country above other interests in everything they do.\nBabangida gave the counsel when Saraki, Tambuwal and Governor Bala Mohammed of Bauchi State, paid him a courtesy visit at his Hilltop residence in Minna, Niger State on Thursday.\nWhat you talked about is Nigeria, Nigeria, Nigeria,” he said.\nTambuwal, Saraki and Bala Mohammed are among the top members of the Peoples Democratic Party, PDP, queuing up for the sole presidential ticket of the main opposition party.\nTop figures such as former Vice President, Alhaji Atiku Abubakar, and Rivers State Governor, Nyesom Wike have also declared their separate interests to run for the presidency under the PDP."
  },
  {
    "headline": "Ortom lauds Buhari over appointment of Mary Ada Ogbe as permanent secretary",
    "summarized_story": "The Benue State Governor, Dr Samuel Ortom, has commended President Muhammadu Buhari for the appointment of Mrs Mary Ada Ogbe as Permanent Secretary in the Federal Civil Service.\nMrs Mary Ada Ogbe hails from Benue State.\nThe Governor, in a congratulatory message to Mrs Ogbe, appreciated her steadfastness, diligence and hard work which earned her the elevation.\nGovernor Ortom expressed confidence that Mrs Ogbe will be a good ambassador of Benue State and a distinguished citizen of Nigeria.\nHe wished Mrs Ogbe good health, wisdom and courage in the discharge of her duties."
  },
  {
    "headline": "NCC has raised $563.1m for FG through 3.5GHz auction; 80m Nigerians have broadband access – Danbatta",
    "summarized_story": "The retreat took place at the Nigerian Army Officers Wives Association (NAOWA) Centre at Mambilla Barracks, Abuja.\nPantami then urged all the agencies and their staff to challenge themselves to do more rather than think of themselves as competitors.\nOn Solid Infrastructure, the third pillar of NDEPS, Danbatta stated that broadband penetration as at December 2021 was 40.88 percent, thus enabling 80 million Nigerians to have access to broadband services.\nAdditionally, he commended NCC for driving the necessary infrastructure purposely and strategically, and for its effectiveness in regulating the telecom sector.\nAll the agencies and the Ministry were well represented at the retreat by at least 6 officers in the directorate cadre."
  },
  {
    "headline": "Terrorism: ‘Nigeria’s security corrupt, DSS, Service Chiefs, IGP, not in charge – Primate Ayodele",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, on Friday, accused Nigeria’s security network of corruption, stressing that the Department of State Services, DSS; Inspector General of Police, Alkali Baba; and Service Chiefs are not in charge.\nCiting the Abuja-Kaduna train attack incident, the clergyman said security operatives need to be queried because they are yet to make any arrest more than 72 hours after the attack.\nThe DSS and Army need to be queried on the airport and train attack; something is wrong, which they need to report.\n“The IGP, Service chiefs are not in charge at all; we are running an empty country.\nAyodele said the crisis would start extending to other parts of the country, and when it does, Nigeria will be a total mess."
  },
  {
    "headline": "Buhari approves re-appointment of Bello-led NEXIM Bank’s Management",
    "summarized_story": "President Muhammadu Buhari has approved the re-appointment of the entire Abba Bello-led Executive Management of the Nigeria Export-Import (NEXIM) Bank.\nThe statement, dated March 31, 2022, said “the re-appointment of the entire executive management of Nigeria Export-Import (NEXIM) Bank has been approved by President Muhammadu Buhari.\n“Those involved in the re-appointment comprise Abba Bello, Managing Director and Chief Executive Officer, Bala Bello, Executive Director (Corporate Services), and Stella Erhuvwu Okotete, Executive Director (Business Development).\n“The outcome of the appraisal revealed that the current management team with the support of the board has performed as well as exemplified by key achievements.\n“The NEXIM bank has been ranked among the best three Development Finance Institutions (DFIs) and best five public institutions surveyed based on the Independent Corrupt Practices and Other Related Offences Commission (ICPC) Anti-corruption Assessment Criteria."
  },
  {
    "headline": "Police foils attack on police division in Imo",
    "summarized_story": "Police command in Imo on Friday successfully repelled a deadly attack by suspected members of the proscribed Eastern Security Network (ESN) who attacked Mbieri Police Division.\nThe police said the incident happened at the early hours of Friday, where a group of gunmen attacked the station with explosive devices.\nActing Police Commissioner in Imo, Mr Maman Giwa, disclosed this in a press statement signed by the command’s spokesman, CSP Mike Abattam.\nGiwa said ever ready officers repelled the bandits and forced them to retreat.\nHe also appealed to the public for their continuous support and collaboration by giving security agencies, especially the Police credible and timely information."
  },
  {
    "headline": "Active telephone users hit 197.5 million, internet 143.7 million – NCC",
    "summarized_story": "Active telephone users hit 197.5 million, internet 143.7 million – NCC Prof. Umar Garba Danbatta, who disclosed this at the ongoing 33rd Enugu International Trade Fair in Enugu, also noted that subscribers to Internet are exceeding 143.7 million.\nHe restated the commission’s commitment to protecting and empowering consumers from unfair practices by service providers irrespective of their class.\nHe disclosed that NCC was on the verge of deployment of Fift Generation (5G) network in Nigeria.\nThe NCC boss said already, spectrum licenses for the companies that will roll out services have been issued.\nHe noted that NCC has been a long standing partner of ECCIMA, adding that the commission has continually held it’s special day program at the fair."
  },
  {
    "headline": "Marijuana: GO pleads “not guilty”, gets N2m bail",
    "summarized_story": "The defendant’s counsel, Benson Ndakara, did not oppose the application for trial but contended that a remand order was unnecessary.\nMr. Ndakara notified the judge that he had filed an application for Ugochukwu’s bail and same had been served on the prosecution.\nHe admitted the Ugochukwu to bail in the sum of N2 million with one surety.\nThe surety, the judge ruled, must be a Director in a Federal or Lagos State government establishment.\nHe remanded the defendant in NCoS custody till the perfection of his bail terms and adjourned till June 26, for trial."
  },
  {
    "headline": "FG to add 800,000bpd to crude oil production",
    "summarized_story": "The Federal Government is set to gain additional 800,000 barrels per day of crude oil from the implementation of some important upstream projects that have been stalled due to financing.\nNow empowered by the Petroleum Industry Act (PIA) the government can now embark on the projects.\nThe Nigerian Upstream Petroleum Regulatory Commission (NUPRC), Chief Executive Officer (CEO) Engr.\nThe Federal Government is also ready to drill into new targets and employ technological advances to increase production outputs for appropriate energy mix.\nThe ministry’s Permanent Secretary, Dr. Sanu Gwarzo that represented him said: “We have seen decisions by some IOCs to reduce or outrightly stop long-term investments in upstream projects and development of newtechnologies for exploration, production and processing of crude oil, or servicingthe existing technologies."
  },
  {
    "headline": "Gas explosion kills 1, injure 3 in Lagos",
    "summarized_story": "By Christopher OjiOne person died, three others injured while property worth millions of Naira were destroyed Friday night when an explosion occurred at Archers Gas limited, Amuwo Odofin Industrial Estate, Lagos .\nThere was pandemonium in the community as people scampered for safety as they didn’t know the cause of the explosion.\nWe saw fire engulfed Archers gas company.\nIf it had happened in the day time, especially when customers were buying gas, it would have been more disastrous”.\nA senior police officer who spoke on the condition of anonymity at the Area E Command, Festac, as he was not supposed to speak with the press, said,” yes ,there was gas explosion at Archers Gas limited."
  },
  {
    "headline": "UK warns against travels to 7 northern states",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom (UK) has advised against travel to seven northern states.\nThe states listed by the United Kingdom included Borno, Yobe, Adamawa, Gombe, Kaduna, Katsina and Zamfara.\nForeign, Commonwealth and Development Office (FCDO) gave the warning in its travel advisory on northern Nigeria posted on its website.\n“FCDO advise against travel to Borno, Yobe, Adamawa, Gombe, Kaduna, Katsina, and Zamfara states.\nThere has been an increase in insurgent attacks in Borno State."
  },
  {
    "headline": "2023: Igbo leaders insist on producing Buhari’s successor",
    "summarized_story": "From Geoffrey Anyanwu, Jude Chinedu and Abasianam Philip, EnuguIgbo leaders, yesterday, restated their demand for the South East to produce the president of Nigeria in 2023.\n“The South East has suffered monumental marginalisation of the zone since after the civil war.\n“The South East leaders noted that Nigeria has a zoning and rotational culture for the presidency of Nigeria.\nThey charged citizens of the zone across all parties to work in unity to achieve the objective of a South East presidency in 2023.\nSenator Ben Obi said the main aim of presenting the South East case, was to passionately appeal to Nigerian citizens, to support their quest to produce the next Nigerian President in 2023."
  },
  {
    "headline": "2023: INEC to shutdown online pre-registration portal April",
    "summarized_story": "Independent National Electoral Commission (INEC), yesterday, it will shutdown the ongoing nationwide continuous voters’ registration (CVR) pre-registration online portal in April in preparation for the 2023 general election.\nINEC National Commissioner in charge of Information and Voter Education, Festus Okoye, disclosed this in an interview with newsmen in Lagos.\nOkoye said: “We are going to shutdown the online portal latest by April but the physical registration will be going on until June.\n“People have to collect PVCs and we have to give every registered political party the voters’ register that will be used for the 2023 general election.\nThe INEC commissioner said the commission had seven services on the online registration portal for eligible voters as against six in previous registrations.He added that the seventh allowed people to locate where their PVCs were domiciled."
  },
  {
    "headline": "Reps direct CAC, JAMB, others to remit N195bn to govt coffers",
    "summarized_story": "From Ndubuisi Orji, AbujaHouse of Representatives has directed the Corporate Affairs Commission (CAC), the Joint Admission Matriculation Board (JAMB), Stanbic IBTC and First Bank to N195.9 billion hanging funds to the government coffers.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe panel, on Wednesday, had said it has so far uncovered over N300 billion unclaimed fund lodged in different commercial banks in the country.\nWe have the balances that need to be transferred to the Federal Government, starting with CAC, they have N25 billion not remitted allowances.\nHouse spokesman, Benjamin Kalu, while briefing newsmen on the activities of the panel, said the committee will resume sitting on Tuesday."
  },
  {
    "headline": "Challenged by Train Attack, Doubted by a Nervous Nation, Military Launches Offensive against Terrorists",
    "summarized_story": "The lawmakers demanded the sack of the National Security Adviser, Major General Babagana Monguno (rtd).\nThe Army, Navy, Police, DSS all of these agencies are accountable to the National Security Adviser.\nI’m calling for the resignation of National Security Adviser, he must be removed.\nThe lawmakers, therefore, urged the federal government to implement recommendations contained in the House security summit, held last year.\nThat bill was referred to the national security committee, but up till now, there is no report."
  },
  {
    "headline": "Stock Market Shrugs Off Insecurity Worries, Gained N3.02trn in Q1",
    "summarized_story": "Kayode TokedeThe market capitalisation of the Nigerian Exchange Limited (NGX) gained N3.02 trillion in the first quarter (Q1) of 2022, notwithstanding the growing insecurity concerns in the country.\nThe market performance was buoyed by impressive corporate earnings by major listed companies that saw some of them delivering robust dividend payout to shareholders.\nPrecisely, the market capitalisation gained N3.02 trillion to close on March 31, 2022, at N25.312 trillion, higher than the N22.297 trillion it opened for trading activities on January 4, 2021.\nOthers were the NGX Pension, NGX Industrial Goods, NGX 30, and NGX Lotus II that went up by 6.34 per cent, 5.63 per cent, 5.39 per cent, 4.37 per cent, and 1.18 per cent, respectively.\nHe added, “To invest profitably in this changing environment, you need investment education, trading plans and trading tools/software."
  },
  {
    "headline": "BoI Eyes $10bn from Foreign Investors, Disbursed N1.2trn in Seven Years",
    "summarized_story": "The bank revealed that it was also working to increase the figure to about $10 billion within the next few years.\nBuhari pointed out that the development finance institution had disbursed over N1.4 trillion to micro, small and medium sized enterprises (MSMEs) at single-digit interest rate.\nHe said, “I am particularly impressed that this world-class building will finance internally generated revenue of the bank.\nThe BoI has continued to successfully execute its mandate as a policy institution of the federal government.\nThe BoI MD added that these funds had significantly improved the bank’s capacity to continually support Nigeria’s real sector."
  },
  {
    "headline": "News in Photographs: Buhari Receives Nigerien President in State House",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Court Convicts 73-year-old Man for Falsification of Vehicle Documents in Kwara",
    "summarized_story": "Hammed Shittu in IlorinA Magistrate Court in Ilorin, the Kwara State capital, has convicted a 73-year-old trader, Bashir Alabi, for falsification of vehicle documents.\nAlabi was handed over to the police for investigation having confirmed by the Kwara State Internal Revenue Service (KW-IRS) Motor Licencing Authority (MLA) office at Pake, Ilorin, that vehicle documents presented for processing by him were fake.\nThe additional three suspects were nabbed by the Monitoring Unit of the state Police Command for having incriminating documents in their possession and for their involvement in the trade of printing and selling fake Kwara State vehicle documents.\nA further investigation by the police also established the recovery of forged state vehicle documents from the shop of one Jamiu, who is now at large.\nHaving established a case of forgery and conspiracy by the police, all suspects were arraigned before Chief Magistrate A.M Ibrahim."
  },
  {
    "headline": "BREAKING: Lawless Nigeria Police Re-arrest Enslaved 21-year-old Woman, Glory Okolie Weeks After Release From Suleja Prison",
    "summarized_story": "The Nigerian police have arrested a 21-year-old woman, Glory Okolie who only got out of the Suleja correctional centre in Niger State last week after more than eight months of incarceration.\nSaharaReporters learnt that Okolie was arrested by the Imo State Police Command acting through the Divisional Police Officer of Shell Police Station.\nSaharaReporters on November 23, 2021, reported that a Federal High Court sitting in Abuja granted bail to Gloria Okolie in the sum of N150 million with two sureties.\nShe was later transferred to Abuja, despite efforts by her family members to secure her release.\nOkolie was later released on bail."
  },
  {
    "headline": "BREAKING: Lawless Nigeria Police Re-arrest Enslaved 21-year-old Woman, Glory Okolie Weeks After Release From Suleja Prison",
    "summarized_story": "The Nigerian police have arrested a 21-year-old woman, Glory Okolie who only got out of the Suleja correctional centre in Niger State last week after more than eight months of incarceration.\nSaharaReporters learnt that Okolie was arrested by the Imo State Police Command acting through the Divisional Police Officer of Shell Police Station.\nSaharaReporters on November 23, 2021, reported that a Federal High Court sitting in Abuja granted bail to Gloria Okolie in the sum of N150 million with two sureties.\nShe was later transferred to Abuja, despite efforts by her family members to secure her release.\nOkolie was later released on bail."
  },
  {
    "headline": "BREAKING: Two Confirmed Killed As Gunmen Unleash Horror In Ongoing Attack On Kaduna Community",
    "summarized_story": "At least two persons have been confirmed killed in an ongoing attack by gunmen in Ankwa Ward in the Kachia Local Government Area of Kaduna State.\nSaharaReporters gathered that the gunmen in large numbers are moving from house to house, killing and kidnapping residents without any hindrance.\nChairman of the council area, who confirmed the ongoing attack, Mr Peter Agite, called on residents to remain calm despite the onslaught.\n\"I am appealing to citizens and residents of Kachia Local Government Area, especially Ankwa Ward, to remain calm and law-abiding.\nThe latest attack comes three days after terrorists bombed a Kaduna-Abuja bound train, killing several passengers and kidnapping scores more."
  },
  {
    "headline": "BREAKING: Two Confirmed Killed As Gunmen Unleash Horror In Ongoing Attack On Kaduna Community",
    "summarized_story": "At least two persons have been confirmed killed in an ongoing attack by gunmen in Ankwa Ward in the Kachia Local Government Area of Kaduna State.\nSaharaReporters gathered that the gunmen in large numbers are moving from house to house, killing and kidnapping residents without any hindrance.\nChairman of the council area, who confirmed the ongoing attack, Mr Peter Agite, called on residents to remain calm despite the onslaught.\n\"I am appealing to citizens and residents of Kachia Local Government Area, especially Ankwa Ward, to remain calm and law-abiding.\nThe latest attack comes three days after terrorists bombed a Kaduna-Abuja bound train, killing several passengers and kidnapping scores more."
  },
  {
    "headline": "Niger Republic Pledges To Help Nigeria Fight Banditry, Other Security Threats",
    "summarized_story": "President Mohammed Bazoum of the Niger Republic has pledged his country’s support to help Nigeria tackle banditry and other security threats.\nBazoum said this on Thursday when he visited President Muhammadu Buhari at the Presidential Villa in Abuja.\nAccording to him, Nigeria’s support towards the multinational joint task force (MNJTF) operation is successful due to Nigeria’s financial intervention.\nHe said Nigeria and his country must modify their strategies to the emerging security threats in the area.\nThis comes a few weeks after a Nigerian governor, Bello Matawalle, donated five high-tech and fully-equipped security vehicles to the Niger Republic."
  },
  {
    "headline": "'We may increase tariffs' -- telcos union laments insecurity, high energy costs",
    "summarized_story": "Telcos under the aegis of the Association of Licensed Telecommunications Operators of Nigeria (ALTON) say they are considering an upward review of tariffs.\nAccording to the telcos, the development is due to the rising cost of diesel and its implications for the cost of doing business.\nSpeaking with TheCable on Thursday night, Gbenga Adebayo, ALTON chairman, called for government intervention in the telecommunications sector.\n“We will continue to provide services but we are concerned about the high costs.\nAdvertisement“The industry is planning to begin a study on varying tariffs to some of the unfriendly telecommunications states in other to accommodate their demand."
  },
  {
    "headline": "'We may increase tariffs' -- telcos union laments insecurity, high energy costs",
    "summarized_story": "Telcos under the aegis of the Association of Licensed Telecommunications Operators of Nigeria (ALTON) say they are considering an upward review of tariffs.\nAccording to the telcos, the development is due to the rising cost of diesel and its implications for the cost of doing business.\nSpeaking with TheCable on Thursday night, Gbenga Adebayo, ALTON chairman, called for government intervention in the telecommunications sector.\n“We will continue to provide services but we are concerned about the high costs.\nAdvertisement“The industry is planning to begin a study on varying tariffs to some of the unfriendly telecommunications states in other to accommodate their demand."
  },
  {
    "headline": "Ozekhome: N’assembly tried to amend constitution illegally with section 84(12) of Electoral Act",
    "summarized_story": "Mike Ozekhome, human rights lawyer, says the national assembly acted beyond its powers in its amendment of section 84(12) of the Electoral Act.\nIn a statement on Thursday, Ozekhome said the judge “scored the bull’s eye in striking down the offensive subsection 12 of section 84 of the new Electoral Act in Suit No.\nShe actually extended it to “any political appointee, political or public office holder”, as envisaged (according to these critics) in sections 84 and 318 of the 1999 Constitution.\n“Why would the attorney-general seek to delete the offensive section 84 (12) as ordered by the Judge?\nIn a different twist, Ozekhome drew attention to section 84 (15) of the Electoral Act which he described as “more worrisome and dangerous”."
  },
  {
    "headline": "Ozekhome: N’assembly tried to amend constitution illegally with section 84(12) of Electoral Act",
    "summarized_story": "Mike Ozekhome, human rights lawyer, says the national assembly acted beyond its powers in its amendment of section 84(12) of the Electoral Act.\nIn a statement on Thursday, Ozekhome said the judge “scored the bull’s eye in striking down the offensive subsection 12 of section 84 of the new Electoral Act in Suit No.\nShe actually extended it to “any political appointee, political or public office holder”, as envisaged (according to these critics) in sections 84 and 318 of the 1999 Constitution.\n“Why would the attorney-general seek to delete the offensive section 84 (12) as ordered by the Judge?\nIn a different twist, Ozekhome drew attention to section 84 (15) of the Electoral Act which he described as “more worrisome and dangerous”."
  },
  {
    "headline": "Lekki-Ikoyi tollgate: Lagos CP warns against protest as LCC resumes tolling",
    "summarized_story": "Abiodun Akabi, Lagos state commissioner of police, has warned against protests at the Lekki-Ikoyi bridge link.\nHis statement comes as the Lekki Concession Company (LCC) commenced tolling operations at the Lekki-Ikoyi link bridge on Friday.\nThe company had suspended its operations at the Lekki tollgate after the shooting of protesters during the #EndSARS protest on October 20, 2020.\nPursuant to this development, brows have been raised over the commencement of tolling operations, with dissidents claiming it is a show of impunity by the state government.\n“CP Alabi therefore warns all intending protesters that anyone found infringing on the rights of other Nigerians will be dealt with in accordance with the law."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "How Ire Aderinokun is helping to shape Helicarrier's culture",
    "summarized_story": "The search for remote work has increased by 490% since the beginning of the pandemic.\nIn 2021, there were a number of product/market expansions on the continent that were fueled by raises and eased by remote work options.\nFounded in 2017 by Timi Ajiboye, Tomiwa Lasebikan and Ire Aderinokun, Helicarrier was originally Bitkoin Africa, a website for peer-to-peer (P2P) Bitcoin trading.\nOn building and maintaining company culture, Aderinokun states that most of the team members have direct relationships with 2 of the 3 co-founders.\nAs more team members get hired, though, Aderinokun believes that the team will have to find a sustainable method."
  },
  {
    "headline": "Andela expands its tech talent pool beyond software engineers",
    "summarized_story": "But on Wednesday, the global talent company said it is expanding its offering beyond engineering talent to include matching in new practice areas: specifically design, data, and product management.\n“Having worked across the continent and beyond, we know that the tech ecosystem does not just need only engineering talent,” Agnes Muthoni, Director of the Andela Learning Community, said on the move.\n“The Andela platform is constantly learning, helping to refine its personalised recommendations.\nThis is why we’ve built our new platform—to help talent find jobs that match their technical skills and careers that match their lives,” he said.\nLaunched in Nigeria in 2014, Andela started as an African-focused software developer training and outsourcing company."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Fantasy sports in Africa: Can $3m funding make it popular?",
    "summarized_story": "The love for the game is now shared with the passion for fantasy football or football betting.\nWhile fantasy sports in Africa might be a fantasy (pun intended), compared to sports betting, it is big in other regions.\nAdvertisementInstead of betting on real-life football teams, fantasy football involves gambling on virtual teams created by the player-manager.\nSome other European leagues have a fantasy version of their leagues, with the Fantasy Liga and Fantasy Bundesliga owned by the Spanish and German leagues, respectively.\nAccording to football magazine FourFourTwo, FPL has eight million players globally who compete to be the Jose Mourinho of fantasy football."
  },
  {
    "headline": "Grocery shopping with the community",
    "summarized_story": "AdvertisementThere were appearances from countries like Sudan, Namibia, and Uganda, and we discussed all that on the Techpoint Africa podcast.\nHowever, Kenyan startup, Tushop, uses community group buying to help Kenyans save on food.\nSomeone — usually called a community leader — aggregates orders from individuals who live close to each other.\nIt is then relayed to the vendor, farmer, or distributor, after which it is delivered to the community leader.\nLast week on the Techpoint Africa Podcast, we spoke about white founders in Kenya, so it’s interesting to see a black female founder from Kenya today."
  },
  {
    "headline": "Meet two Nigerian companies using technology to change how we reuse waste",
    "summarized_story": "Early last week, very late on Tuesday night, I talked to Victor Boyle-Komolafe, GIVO Founder, after several scheduling mishaps.\nUsing a community-based model, GIVO uses technology to collect recyclable material from individuals, families, and businesses, which it turns into valuable goods.\nHere’s the kicker: as the population grows, waste grows, and global waste is expected to grow by 70% by 2050.\nUsers are urged to only receive items from people with a profile picture and report a giver who insists on collecting money from them.\nThe idea is to prevent people from throwing out perfectly good items with good reusable value, thereby reducing generated waste."
  },
  {
    "headline": "Land Grabbing: Community calls for Oba Ewuare II Intervention – Nigerian Observer",
    "summarized_story": "According to Idemudia and Ekhaguere, the duo have continually constituted themselves as a threat to peace in the community.\n“These persons have sold off all the land in the village belonging to indigenes; as a result of this act, there is no longer free land for indigenes to farm.\n“That these persons who are non-indigenes of the village have capitalised on this and had forcefully taken over, even the land belonging to the mother of your Royal Majesty,” they said.\nThey added that “It is on record that from time immemorial, Iguomo community was founded and belongs to the mother of the Oba of Benin Kingdom, but it is unfortunate that non-natives have taken over all the land and sold them, with the aid of Pa Godwin Usiomoifo.\n“These persons have formed and become the overlords of the entire village as innocent indigenes of the village can no longer move freely in their own village."
  },
  {
    "headline": "Edo plans cultural hubs in senatorial districts to preserve, promote heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has disclosed plans to establish cultural hubs in the three senatorial districts of the state to preserve and promote Edo’s rich cultural heritage.\nThe Edo State Commissioner for Arts, Culture, Tourism and Diaspora Affairs, Hon.\nPrince Bamidele Obaitan, disclosed this to journalists in Benin City during a programme organized by the Ministry to mark the 2022 World Theatre Day.\nObaitan said the cultural hubs will leverage technology and the innovative potential of Edo youths to advance the preservation of the state’s cultural assets.\nObaitan announced that the Ministry of Arts, Culture and Tourism is currently doing a collation of all local festivals across the state in a bid to develop it into a calendar to boost the development of culture."
  },
  {
    "headline": "Obaseki seeks investments in Benin River Port, Enterprise Park, others at Dubai summit …showcases Edo’s business potential – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki at this year’s Annual Investment Meeting (AIM) in Dubai, thrilled investors with his pitch for investments in the Benin River Port, the Enterprise Park, and the Benin Inland Container Depot/Dry Port, among other big-ticket projects, in a drive to deepen development and open up the state’s economy for productivity and industrialization.\nThe governor is among members of the Nigeria Governors’ Forum (NGF) participating in the annual summit and seeking foreign direct investments from businesses and organisations in the United Arab Emirates (UAE).\nOthers on the delegation include Governors of Abia, Akwa Ibom, Bauchi, Bayelsa, Cross River, Ekiti, Enugu, Kwara, Niger, Ondo, Plateau, Sokoto and Yobe States.\nNoting the economic benefits of the Benin River Port and Edo Enterprise Park projects, the governor said his government will continue to push for more of such projects to ensure the requisite infrastructure to attract and keep investment and engender inclusive growth.\nThe Annual Investment Meeting (AIM) is an initiative of the UAE Ministry of Economy designed to provide a framework for global exchange on the key principles underpinning international investment policies, strategies and practices for sustainable development to achieve smart and inclusive global growth."
  },
  {
    "headline": "Financial crises rock Edo cooperative societies over non remittance of deductions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestCooperative societies in the eighteen local government councils and the Ambrose Ali University, Ekpoma are struggling under serious financial crises following the non remittance of due deductions by the respective Managementsof the councils and the university.\nAddressing newsmen shortly after a meeting with officials of the Edo State Ministry of Trade, Investment and Cooperatives led by the Commissioner Aishetu Braimah where the nagging issues were tabled, President of the Federation of Edo Cooperative societies Mr Filani Ojo said the non remittance of the said deductions has crippled activities of the aforementioned cooperative societies in the state.\nHe disclosed that the management of Ambrose Alli University was yet to remit deductions in Union dues and workers financial commitments to the AAU’s Cooperative Society in the tune of over N800 million.\nOredo Local Council he said had withheld over N120 million in deduction of monies belonging to the workers’ Cooperative Society.\nHe said the unhealthy development has crippled the activities of the cooperative societies and make them inable to meet their financial obligations to contributors of the funds."
  },
  {
    "headline": "Oyetola upgrades Osun College of Education Ilesa to full-fledged university",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Mr. Adegboyega Oyetola, on Thursday announced the upgrade of the state College of Education, Ilesa, to a full-fledged university.\nThis is even as the Governor inaugurated the Ijesa community funded Geriatric Centre.\nThe newly-inaugurated Geriatric Centre was funded and built by prominent Ijasa sons and daughters.\n“In other words, the Ijesa Geriatric Centre is a welcome development as it brings closer to our people a specialised geriatric care.\n“We appreciate you for heeding our age-old prayers of upgrading the 44-year-old College of Education, Ilesa, to a full fledged University."
  },
  {
    "headline": "Polytechnics’ lecturers threaten to resume strike over govt’s failure to honour agreement",
    "summarized_story": "The Academic Staff Union of Polytechnics (ASUP), has said it is planning to resume a strike action it suspended after 61 days in June 2021, upon reaching an agreement with the government.\nThe union on Thursday issued a one-month ultimatum to government for the strike action, in Yola at the end of its 102nd National Executive Council meeting.\nAnderson Uzeibe, ASUP national president who issued the ultimatum while speaking with newsmen after the meeting, noted that the decision became necessary after the government failed to implement important aspects of the memorandum of action signed with the union nine months ago.\n“The government is yet to release the sum of N15billion as the first tranche of the N800billion revitalisation fund nine months after the approval by President Muhammadu Buhari,” he said.\n“Following exhaustive deliberation, the union’s National Executive Council has resolved to give the government a further one month as an ultimatum to address the outstanding issues as listed or face a review of the suspended industrial action by our union.”"
  },
  {
    "headline": "Hacey Health Initiative educates students on FGM in Osun",
    "summarized_story": "By Sunday Oguntuyi, OsogboHacey Health Initiative has noted that over 125 million girls and women in almost 29 countries in Africa and the Middle East are victims of Female Genital Mutilation and Cutting (FGM/C).\nMr. Ayo Alabi, the representative of the Hacey, made this assertion while presenting prizes to the winners of an essay competition on end Female Genital Mutilation in Osogbo, Osun state.\nHe appreciated the efforts of the students for their participation in the essay competition saying that two boys were among the winners.\nHe noted that there are laws and policies to prohibit FGM/C in Osun state but the awareness of these laws are very low.\nAccording to the Initiative, only 29.4 percent ,18.5 percent and 4.5 percent of the women in Osun, Ekiti and Oyo respectively were aware of the existence of the laws and policies."
  },
  {
    "headline": "NURTW stakeholders, TOOAN call for calm, say loyalty to Tinubu, Sanwo-Olu not negotiable",
    "summarized_story": "The leaders who gathered to offer their solidarity for Asiwaju for 2023 include, Alhaji Rafiu Akanni Olohunwa, former Chairman NURTW, Lagos Council, Comrd.\nSeyi Bankole, Secretary NURTW, Lagos State , Alh.\nAbiola Azeez, Istijabah as the TOOAN Lagos State Chairman.\nMany who spoke at the press conference said the appointment of the new state chairman of TOAN was the problem.\nHe said, “We have the state chairman of NURTW, and also there’s the state chairman of TOOAN."
  },
  {
    "headline": "2023 PRESIDENCY: Northern PDP Aspirants Intensify Plan To Produce Next President",
    "summarized_story": "Out of the 14 PDP presidential aspirants that have picked nomination forms, five are from the North; Tambuwal (North West); Saraki (North Central); Atiku, Bal Mohammed and Hayatu-Deen (North East).\nADVERTISEMENTNorthern presidential aspirants on the platform of the opposition Peoples Democratic Party (PDP) have continued with their quest to ensure that the next president of Nigeria comes from their region.\nAtiku was the PDP presidential candidate in the last general election and this is his sixth declaration for president.\nIn an earlier comment, the presidential aspirants said when they arrive at a consensus candidate, they would communicate their position to Atiku.\nAnd You have made my day, that all you talked about was Nigeria, Nigeria, Nigeria,” he declared."
  },
  {
    "headline": "We Can’t Complete Ajaokuta Plant Before Leaving In 2023 – Federal Govt",
    "summarized_story": "The federal government has made a policy volte face on the Ajaokuta steel rolling mill, saying the Buhari administration can no longer complete the project in 2022 as earlier promised.\nYes, I went to the public and said ‘look, we will deliver Ajaokuta before the end of this tenure’.\nHe disclosed that the $2 million is safe in the federal government account, adding that “the money has not even been given to anybody.\n“So, the $2 million is still with the federal government; it’s just that the president has given the money for that purpose.\nNobody thought of the COVID, because the plan was to deliver Ajaokuta this year 2022,” he added."
  },
  {
    "headline": "Buhari Bags Africa Road Builders Award For Infrastructure",
    "summarized_story": "President Muhammadu Buhari has been honoured with the “Africa Road Builders Award” f his efforts in infrastructural development in Nigeria.\nIn his acceptance speech at the 7th edition of the African Road Builders Conference (2021 Trophee Babacar Ndiaye) in Abuja with the theme: “Building Roads, Building Economies”, Buhari who was represented by the minister of works and housing Babatunde Fashola said by building roads, Nigeria is building economies.\n“I am able to report that apart from Trans African Highway No.\n2, Algiers to Lagos and Trans African Highway No.\nHe described it as a major investment by Nigeria on the Lagos-Mombasa Trans African Highway, as is the Enugu – Abakaliki to Mfum Highway,” he said."
  },
  {
    "headline": "Buhari Bags Africa Road Builders Award For Infrastructure",
    "summarized_story": "President Muhammadu Buhari has been honoured with the “Africa Road Builders Award” f his efforts in infrastructural development in Nigeria.\nIn his acceptance speech at the 7th edition of the African Road Builders Conference (2021 Trophee Babacar Ndiaye) in Abuja with the theme: “Building Roads, Building Economies”, Buhari who was represented by the minister of works and housing Babatunde Fashola said by building roads, Nigeria is building economies.\n“I am able to report that apart from Trans African Highway No.\n2, Algiers to Lagos and Trans African Highway No.\nHe described it as a major investment by Nigeria on the Lagos-Mombasa Trans African Highway, as is the Enugu – Abakaliki to Mfum Highway,” he said."
  },
  {
    "headline": "Reps Adjourn Plenary To Protest Incessant Killings",
    "summarized_story": "House of Representatives yesterday abruptly adjourned plenary and suspended all legislative activities till next week to register displeasure over the recent killings in Kaduna State.\nMr Speaker, when things like this continue on daily basis those of us who are representatives of the government become speechless.\nThis is an elected government, under a popular democracy but day in, day out, there are killings, massacre, armed robbery all over.\nIf it is about funding, each of us here knows we have never had any cause to contemplate not funding our security agencies.\nHe lamented the institutional and regimental failures, saying that the security agencies have no excuse for their failures."
  },
  {
    "headline": "2023 Presidency: Don’t vote for Atiku, Saraki, Tambuwa, others – Obasanjo to Nigerians",
    "summarized_story": "Former President, Olusegun Obasanjo has asked Nigerians not to support or vote for some presidential aspirants who claimed their nomination forms were purchased for them by groups.\nObasanjo made the comment in Lagos during a colloquium to mark the 61st birthday of Pastor Itua Ighodalo.\nPresidential forms have been bought for some Peoples Democratic Party (PDP) presidential aspirants in the last few weeks including Obasanjo’s former deputy, Atiku Abubakar, and immediate past Senate President, Abubakar Bukola Saraki.\nSome of them (aspirants) even said it is some youths who bought it for them.\n“In fact, anybody who would come out to tell you such a lie, you shouldn’t vote for him."
  },
  {
    "headline": "Terrorists attacks: ‘Water don pass garri, now I’m vindicated’ – Fayose mocks Nigerians",
    "summarized_story": "A former Governor of Ekiti State, Ayodele Fayose, has again mocked Nigerians over the insecurity that has spread around the country, especially the North-West region.\nWithin the last 72 hours, there have been several attacks in Kaduna and its neighbouring states.\nThe terrorists shot many passengers dead as unascertained number of the passengers also sustained various degrees of injury as a result of gun shots.\nJust yesterday night, armed men stormed Kofar Gayan low-cost, Zaria, Kaduna, Kidnapped a customs officer, Muawiyya Gambo Turaki, and nine others.\nAll this put together, Fayose, said he has been vindicated, reminding Nigerians how he warned them against a Muhammadu Buhari presidency in 2015."
  },
  {
    "headline": "Muslim Leaders, Islamic Organizations Meet Osinbajo In Abuja",
    "summarized_story": "Osinbajo gave the position at the Presidential Villa, Abuja, when he received a delegation of Imams, Islamic scholars and Muslim leaders.\nThe delegation of more than 25 Islamic clerics, intellectuals and leaders of different groups was drawn from the influential National Council of Ulamas, Qadiriyya Movement, Fitiyanul Islam of Nigeria, Dariya Sect, and National Council of Muslim Youths.\nOthers include the Muslim Students Society of Nigeria, Jammat Tajdidul Islamy, Salafiyya Youth Movement, Imams from the National Mosque and Legislative Quarters in Apo, Abuja among others.\n“We are here in recognition of your love for all Nigerians and your belief in the harmonious existence of our country.\n“I am enriched from what I have heard today and I have noted all the issues."
  },
  {
    "headline": "Again, Fire Razes Popular Abuja Market",
    "summarized_story": "The Karimo market in Abuja, the Federal Capital Territory, has been engulfed in flames since early this morning.\nMany shops were alleged to have been damaged by the fire, with products worth millions of Naira being lost as a result of the blaze.\nAlthough the cause of the fire is unknown, our correspondent learned that firefighters had arrived on the scene to put it out.\nThe market also caught fire in July of last year, destroying around 200 stalls.\nDetails later…"
  },
  {
    "headline": "Russia’s sanctions threatens U.S. dollar, IMF raises alarm",
    "summarized_story": "Financial sanctions imposed on Russia threaten to gradually dilute the dominance of the U.S. dollar and could result in a more fragmented international monetary system, Gita Gopinath, IMF’s First Deputy Managing Director, told The Financial Times.\nRussia has been hit with a plethora of sanctions from the United States and its allies for its late-February invasion of Ukraine.\nRussia has called the invasion a ‘special operation’ to disarm its neighbour.\nShe said that the war will also spur the adoption of digital finance, from cryptocurrencies to stablecoins and central bank digital currencies.\nShe had earlier said the sanctions against Russia do not foreshadow the demise of the dollar as the reserve currency and that the war in Ukraine will slow global economic growth but will not cause a global recession."
  },
  {
    "headline": "Aftermath of World Cup playoff: FG inaugurates committee to investigate vandalism on Abuja stadium, vows punitive measures (PICTURES)",
    "summarized_story": "The federal government on Thursday inaugurated an investigative committee to unravel the circumstances leading to the vandalisation of the Moshood Abiola Stadium and recommend measures to forestall recurrence.\n“The federal government will not sit by and allow individuals, no matter their ages to just wilfully damage and destroy federal government Infrastructure especially a public infrastructure like the Moshood Abiola National Stadium.\n“It is an investigative committee and they will be given necessary access to the stadium, they will be provided with the CCTV footage, they will have access to every relevant person connected with the football match and also the Ministry, Nigeria Football Federation(NFF)and other relevant agencies,” the Minister added.\nOther members of the investigative committee are Dr Henry Nzekwu (vice chairman), Commodore Omatseye Nesiama (Retd), Alhaji Abba Yola, Dr Simon Ebhojiaye, Mrs Tayo Oreweme, Mr Mitchell Obi, a representative of the Director General of the Department of State Security(DSS) and Mr Olumide Bamiduro, who will be the secretary.\nThe committee has two weeks to turn in their report."
  },
  {
    "headline": "Breaking: Popular Nollywood actor is dead",
    "summarized_story": "A popular Nollywood actor, Kunle Adetokunbo, popularly known as “Dejo Tunfulu” has been announced dead on Friday.\nOne of the colleagues of the deceased, Kunle Afod, announced the death of the prominent Yoruba comic actor via his verified Instagram page.\nAccording to Kunle: “You posted this few days ago Dejo Haaaaaaaaa this is so sad PressyTunfuluDaddy Junior.\nStill can’t believe this.”The prominent actor was born in Idumota, Lagos Island area of Lagos State but hails from the Ikija area of Abeokuta, capital of Ogun State."
  },
  {
    "headline": "Put Nigeria Above Other Interests, IBB Tells Presidential Aspirants",
    "summarized_story": "Former Military President General Ibrahim Babangida has told those aspiring for the presidency to put Nigeria above other interests in everything they do.\n“Your belief in having a better Nigeria featured very prominently.\nWhat you talked about is Nigeria, Nigeria, Nigeria.\nWe are trying to provide a solution to the political process because we want to ensure that it is smooth, it is not rancorous and it leads to a better Nigeria at the end of the day,” he said.\nAccording to him, they could not achieve the objective without the wise counsel of General Babangida and other leaders."
  },
  {
    "headline": "Insecurity: UK Warns Against Travel To Seven Northern States",
    "summarized_story": "The United Kingdom (UK) has warned against travels to seven states in the north following the rising spate of insecurity in Nigeria.\nAccording to a travel advisory on the Foreign, Commonwealth, and Development Office (FCDO) website, the affected states are Borno, Yobe, Adamawa, Gombe, Kaduna, Katsina, and Zamfara.\n“The FCDO advise against all travel to Borno State, Yobe State, Adamawa State, Gombe State, Kaduna State, Katsina State, and Zamfara State.\n“The threat level in North-East Nigeria, including around Maiduguri is increasing, particularly around transport hubs, religious areas, and large gatherings.\nIf you are working in the North East of Nigeria you should be fully confident in your employer’s ability to extract you from the North East in the event of any emergency,” it said."
  },
  {
    "headline": "Why We Can’t Deliver Ajaokuta During Buhari’s Tenure – Minister",
    "summarized_story": "﻿The Minister of Mines and Steel Development, Mr Olamilekan Adegbite on Thursday admitted that the Federal Government will not be able to deliver on its promise to revive the Ajaokuta steel rolling mill before the end of the current administration in 2023.\nHe made the admission while fielding question from State House correspondents during the 34th session of the State House briefing held at the State House in Abuja.\nWhen we came back from Russia, yes, I went to the public and said, ‘look we will deliver Ajaokuta before the end of this tenure’.\nSo, it is a force majeure.”In 2020, the Minister had said the Ajaokuta Steel Mill was 90 percent complete and may be functional by early 2023.\nIn Sochi, President Buhari invited the Russians to help complete the steel mill on a Build-Operate-Transfer model, Adegbite said."
  },
  {
    "headline": "Bandits Invade Housing Estate In Kaduna, Kidnap Customs Officer, Five Others",
    "summarized_story": "Gunmen suspected to be bandits have attacked a low-cost housing estate at Kofar Gayan in Zaria Local Government Area of Kaduna State and kidnapped six people including a Customs officer and his son.\nThey moved straight to the Customs officer’s residence and thereafter took him away along with his son.\nAccording to the source, the bandits trailed him from his family house in Zaria city down to the estate.\nFour others within the estate were later abducted by the gunmen.\nKaduna State and several others in the northwest and north-central regions have suffered from banditry in recent years."
  },
  {
    "headline": "Imo Attack: Operatives Foil Attempted Assault On Mbieri Police Station",
    "summarized_story": "The Imo State Police has said that its operatives foiled an attempted attack on the Mbieri police division in Mbaitoli Local Government Area by gunmen suspected to be members of the Eastern Security Network, a militia arm of the Indigenous People of Biafra (IPOB), in the early hours of Friday.\nConfirming this in a press statement, the Public Relations Officer of the Imo State Police Command, Mike Abattam, said the hoodlums, who came in their numbers, threw Improvised Explosive Devices (IEDs) into the station and shot sporadically.\nRELATEDAbuja-Kaduna Train Attack: ‘I Warned That Lives Will Be Lost’ – AmaechiKaduna Train Attack Questions Our Collective Ability To Govern – Nigerian GovernorsKaduna Train Attack: FG To Begin Repair Works, Recruit Locals For SecurityAbattam explained that police operatives attached to the division also engaged the hoodlums, forcing them to retreat in panic, escaping in their vehicles.\nThe police spokesman further stated that investigations are ongoing and efforts are being made to arrest the fleeing hoodlums.\nThis attack on Mbieri Police Division is the fifth station to have been attacked by gunmen within the last month."
  },
  {
    "headline": "Gunmen attack Ondo lawmaker, Olugbenga Omole",
    "summarized_story": "Unknown gunmen have attacked the chairman, Ondo State House of assembly Committee on Information, Olugbenga Omole on Thursday.\nOmole who is representing Akoko Southwest Constituency 1, narrowly escaped assassination attempt on his life .\nHe escaped multiple gunshots were fired at his car by unknown gunmen in the heart of Akure, the state capital.\nThe lawmaker confirmed the incident to journalists."
  },
  {
    "headline": "Babangida pledges support for PDP consensus arrangement",
    "summarized_story": "Former Military President, Ibrahim Badamasi Babangida has met with some aspirants contesting for the office of the president on the platform of the Peoples’ Democratic Party (PDP) for the forthcoming general.\nWhile briefing Journalists on Thursday after a closed door meeting with the three PDP Presidential aspirants for 2023 elections, former Senate President, Dr. Abubakar Bukola Saraki, Governor Aminu Waziri Tambuwal of Sokoto State and Bauchi State Governor, Senator Bala Mohammed.\nSpeaking on behalf of other Aspirants, Senator Abubakar Bukola Saraki said the visit to the former General Babangida was to seek his advice and guidance on the way to go and to achieve the planned consensus in the PDP."
  },
  {
    "headline": "Why Kwara House declared lawmaker’s seat vacant",
    "summarized_story": "Kwara State House of Assembly has declared the seat of Hon.\nSaheed Popoola vacant after he officially announced his defection from the All Progressive Congress (APC).\nIn a letter addressed to the INEC and dated March 28, 2022, Speaker of the Kwara State House of Assembly Rt.\nYakubu Danladi Salihu said the decision to declare the seat vacant is in line with the provisions of Section 109 (1) (g) of the Constitution.\nThe declaration of the seat as vacant joins several of such developments across the country, including recent court judgments on the issue."
  },
  {
    "headline": "Ondo assembly declares former deputy speaker, Iroju Ogundeji's seat vacant -",
    "summarized_story": "The Ondo State House of Assembly has declared the seat of the former Deputy Speaker, Iroju Ogundeji, vacant.\nIroju Ogundeji before he was fired was the lawmaker representing Odigbo constituency 1 in Ondo State House of Assembly.\nThe Speaker also asked the Commissioner of Police to arrest Ogundeji for parading himself as the Deputy Speaker of the Assembly.\nBut the embattled former Deputy Speaker of Ondo State House of Assembly, kicked against the declaration of his seat vacant by the Speaker of the Assembly.\nBanjo Aiyenakin sought the order of the court to restrain the Assembly from declaring his seat vacant."
  },
  {
    "headline": "Eguavoen, Others Sacked as Super Eagles’ Technical Crew Disbanded",
    "summarized_story": "Following the failure of the Super Eagles of Nigeria to qualify for the 2022 FIFA World Cup, the erstwhile Technical Adviser, Augustine Eguavoen has stepped down from that position with immediate effect.\nThe Nigeria Football Federation (NFF) confirmed the disengagement of Eguavoen and his assistants yesterday.\nA new crew will be announced after a proper review to lead the new charge of reinvigorating the Super Eagles to face future challenges appropriately.\nEguavoen, 56, was placed in interim charge of the side in December following the sacking of long-serving coach Gernot Rohr.\nHe led the team to the last 16 at the Africa Cup of Nations this year, and was then tasked with reaching the World Cup finals in Qatar."
  },
  {
    "headline": "Nigeria: BoI Eyes $10bn from Foreign Investors, Disbursed N1.2trn in Seven Years",
    "summarized_story": "President Muhammadu Buhari, on Thursday commended the board and management of the Bank of Industry (BoI) for contributing to the growth and industrialisation of Nigeria.\nThe bank revealed that it was also working to increase the figure to about $10 billion within the next few years.\nBuhari pointed out that the development finance institution had disbursed over N1.4 trillion to micro, small and medium sized enterprises (MSMEs) at single-digit interest rate.\nRelatedStories No Content AvailableHe said, “I am particularly impressed that this world-class building will finance internally generated revenue of the bank.\nThe BoI has continued to successfully execute its mandate as a policy institution of the federal government."
  },
  {
    "headline": "Nigeria’s Stock Market Shrugs Off Insecurity Worries, Gains N3.02trn in Q1",
    "summarized_story": "The market capitalisation of the Nigerian Exchange Limited (NGX) gained N3.02 trillion in the first quarter (Q1) of 2022, notwithstanding the growing insecurity concerns in the country.\nThe market performance was buoyed by impressive corporate earnings by major listed companies that saw some of them delivering robust dividend payout to shareholders.\nOthers were the NGX Pension, NGX Industrial Goods, NGX 30, and NGX Lotus II that went up by 6.34 per cent, 5.63 per cent, 5.39 per cent, 4.37 per cent, and 1.18 per cent, respectively.\nHe added, “To invest profitably in this changing environment, you need investment education, trading plans and trading tools/software.\nAdeyeye said, “Investors have already priced in the dividend in January and February and that is why the market maintained positive growth during the period."
  },
  {
    "headline": "Nigeria: Challenged By Train Attack, Doubted by a Nervous Nation, Military Launches Offensive against Terrorists",
    "summarized_story": "The lawmakers demanded the sack of the National Security Adviser, Major General Babagana Monguno (rtd).\nThe Army, Navy, Police, DSS all of these agencies are accountable to the National Security Adviser.\nI’m calling for the resignation of National Security Adviser, he must be removed.\nHe said, “I don’t know one report that has been turned in by Committee on National Security and Intelligence.\nThat bill was referred to the national security committee, but up till now, there is no report."
  },
  {
    "headline": "African Refugees See Racial Bias as US Welcomes Ukrainians",
    "summarized_story": "Wilfred Tebah doesn’t begrudge the U.S. for swiftly granting humanitarian protections to Ukrainians escaping Russia’s devastating invasion of their homeland.\nTebah, who is a leading member of the Cameroon American Council, an advocacy group organizing protests this month, said that’s a fate he hopes to avoid.\n“The U.S. has responded without hesitation by extending humanitarian protections to predominately white and European refugees,” he said.\nAnd they complain Ukrainian asylum seekers are being exempted from asylum limits meant to prevent the spread of COVID-19 whilethose from other nations are being turned away.\n“Black pain and Black suffering do not get the same attention,” says Sylvie Bello, founder of the D.C.-based Cameroon American Council."
  }
]