[
  {
    "headline": "Regional Security: Zulum, seven other Lake Chad governors meet in Cameroon",
    "summarized_story": "The Borno State Governor, Babagana Zulum, alongside seven other governors from Lake Chad Basin, on Monday, met in Younde, Cameroon, to discuss regional security cooperation and a path to improve stability.\nGovernor Zulum in his contributions, tabled Borno’s position, calling on the need to drastically raise the level of trans border cooperation on security before strategic and territorial action plans can work.\nEspecially on the shores of Lake Chad.\nIt is necessary to undertake holistic security operations in the shores of Lake Chad in order to clear the insurgents, otherwise, we are not going anywhere”, Zulum noted.\nZulum expressed great concern over the non-utilization of Lake Chad Basin’s shore which he noted, can provide huge economic potentials to benefit the people of the region."
  },
  {
    "headline": "Russian crew blast off to make first movie in space",
    "summarized_story": "A Russian actress and director blasted off to the International Space Station on Tuesday in a historic bid to best the United States to film the first movie in orbit.\nThe Russian crew is set to beat a Hollywood project that was announced last year by “Mission Impossible” star Tom Cruise together with NASA and Elon Musk’s SpaceX.\n“Launch as planned,” the head of the Roscosmos space agency, Dmitry Rogozin, said on Twitter.\nLed by veteran cosmonaut Anton Shkaplerov, the film crew will travel in a Soyuz MS-19 spaceship for a 12-day mission at the ISS to film scenes for “The Challenge”.\nThe ISS crew, which also includes a French, a Japanese and three NASA astronauts, will welcome the newcomers when the hatch opens at around 1410 GMT."
  },
  {
    "headline": "Yoruba group kicks against zoning PDP Chairmanship to North",
    "summarized_story": "…Warns political parties to be sensitive to Nigeria’s multi-zonal natureBy Johnbosco AgbakwuruA group of young professionals from the southwest geopolitical zone, the Oduduwa Young Professionals, has condemned what it described as hatred for the Yorubas by the Peoples Democratic Party, PDP.\nArising from its meeting, Sunday evening, the group’s Publicity Secretary, Joshua Alade said the party should have been sensitive enough to know there is equity in its constitution.\nAccording to the group, “This matter is not only about PDP but all the political parties.\nBut we must say that we are shocked and embarrassed that despite the obvious fact that it is only South West that is yet to produce its chairmanship.\nReacting to the rumor that zoning the party chairmanship was in preparation for its zoning the presidential ticket to the South in 2023, the group said the chairmanship position is first a sure bet than a presidential ticket which will be thrown open to all southern zones and possibly might not be picked by someone from the Southwest."
  },
  {
    "headline": "EFCC arrests man for allegedly defrauding a Chinese National of N82.8m",
    "summarized_story": "He was arrested following a petition received by the Commission from one Gao Shu Quin, a Chinese national.\nThe petitioner alleged that she met the suspect sometime in 2017 while doing her legitimate business.\nShe further alleged that the suspect deceived her into supplying him containers of textiles materials, believing he would remit the proceeds upon sale of the textile materials.\nHowever, the suspect allegedly diverted the proceeds for personal use after sale.\nThe suspect will soon be charged to court as soon as the investigation is completed, according to a statement by EFCC Spokesman, Wilson Uwujaren and made available to Vanguard on Monday night."
  },
  {
    "headline": "RETURN TO ANCIENT ORDER: Itsekiri Nation on the road to recovery",
    "summarized_story": "A total of 12 chiefs were readmitted into the council that day, beginning with the Iyatsere, Chief Amatserunleghe.\n“I feel very happy because Warri kingdom has come back to its feet.\n“Today, I have been decorated as the most senior chief in Warri kingdom.\n“Today I join voice with you to pronounce uncommon transformation of Warri kingdom.\nAs governors representing the entire federation, we formally present ourselves here to congratulate you and the entire Warri kingdom for God’s presence in this kingdom."
  },
  {
    "headline": "Ex-international, Oyarekhua, is dead",
    "summarized_story": "ACP Sunny Oyarekhua (rtd)Ex-international footballer, ACP Sunny Oyarekhua (rtd), is dead.\nOyarekhua was a prominent member of the Green Eagles from 1971 to 1975 and top goal scorer at the 1973 All-African Games.\nThe Green Eagles won the gold medal for the football at that event.\nLate Oyarekhua also played club football for Benin Amateur Football Association, BAFA, and Police Machine Team.\nHe also played for the Midwest XI, including the memorable game against Santos FC that had Pele, Edu, Maria and Gilmar at the Ogbe Stadium, Benin, in 1969."
  },
  {
    "headline": "BREAKING: Buhari presents 2022 budget to National Assembly on Thursday",
    "summarized_story": "By Henry Umoru – AbujaThe Senate disclosed on Tuesday that President Muhammadu Buhari will on Thursday present to the Joint session of the National Assembly, the 2022 Appropriation Bill.\nThe Deputy President of the Senate, Ovie Omo-Agege, All Progressives Congress, APC, Delta Central stated this while presiding over the plenary.\nOmo- Agege urged the Senate Committee on Finance to expedite action on the Revised Medium Term Expenditure Framework and Fiscal Strategy Paper which the President forwarded to the Senate on Tuesday, and submit their report for consideration at plenary on Wednesday.\nDetails later…."
  },
  {
    "headline": "Plateau: Gov Lalong appoints 11 special advisers",
    "summarized_story": "Governor Simon Lalong of Plateau State has approved the appointment of 11 special advisers to the state government.\nDirector of Press and Public Affairs to the governor, Dr Makut Macham, made this known in a statement on Tuesday, NAN reports.\nAccording to the statement, the special advisers would be sworn in and assigned portfolios at a date to be announced.\n”The special advisers are, Mr Pam Gyang, Mr.Ezekiel Gomos, Mrs Philomina Lot, Mr Burki Gofwan, Mr Jonathan Mawiyau, Mrs Felicia Yakzum and Mr Diket Plang.\nTalatu Apini, Chief Michael Makwal and Mr Kwamkur Vondip,” the statement said."
  },
  {
    "headline": "Senate confirms EFCC board members",
    "summarized_story": "The Nigerian Senate on Tuesday adopted a report by its Committee on Anti-Corruption and Financial Crimes for the confirmation of nominees as board members of the Economic and Financial Crimes Commission (EFCC).\nSenator Jibrin Barau expressed his view in support of the report, given that there was no controversy trailing any of the nominees.\n“That the Senate do receive and consider the report of the Committee on Anti-Corruption and Financial Crimes on the confirmation of the nominees,” he said.\nAfter contributions on the need for EFCC to have a board in place to strengthen activities of the agency, Deputy Senate President, Ovie Omo-Agege put the report to a voice and it was passed.\nAlhaji Kola Raheem Adesina – Board member5."
  },
  {
    "headline": "More facts needed to prove NASCO boss, others financing terrorism – Shehu Sani",
    "summarized_story": "Senator Shehu Sani, who represented Kaduna Central in the 8th National Assembly, has expressed scepticism over allegations that the late founder of NASCO Group, manufacturers of the popular Nasco corn flakes, Ahmed Idris Nasreddin, was part of those sponsoring terrorism in the north.\nA freelance investigative journalist, David Hundeyin, had published a finding that the late NASCO boss, alongside some other prominent northern figures, was allegedly financing some regional terrorism, including Boko Haram.\nReacting to the allegation, in a post on his official Facebook page, the former lawmaker expressed doubt on the report, stating that more facts are stilled needed to convince the general public.\nThe post reads, “It’s doubtful that a reputable company like NASCO, that has contributed immensely to the industrial and economic development of the North and Nigeria as a whole, provided employment opportunities for thousands, assisted families and for decades, remain steadfast in the face of all our political, security and economic challenges, can now be accused of funding terrorism.\n“More facts are needed otherwise let’s not destroy those who believe and still stand with us while others have left for long”."
  },
  {
    "headline": "BREAKING: Buhari to present 2022 appropriation bill before NASS on Thursday",
    "summarized_story": "President Muhammadu Buhari will on Thursday this week lay the 2022 appropriation budget before the National Assembly.\nDeputy Senate President, Ovie Omo-Agege revealed this during the plenary on Tuesday.\nOmo-Agege presided over the plenary in the absence of the President of the Senate, Dr. Ahmad Ibrahim Lawan.\nThe budget presentation was coming early enough due to the January to December fiscal budgetary policy by the 9th National Assembly.\nIt is recalled that President Buhari presented the 2021 N10.8 trillion budget on 8th October 2020 which enabled the parliament to pass the document into law for its take-off implementation in January 2021."
  },
  {
    "headline": "Niger: Kidnappers demand N60m as ransom for permanent secretary, son",
    "summarized_story": "Abductors of Dr. Ibrahim Musa Garba, Permanent Secretary, Niger State Ministry of Transport, have demanded N60 million as ransom from his family.\nDAILY POST recalls that Garba, alongside his three-year-old son, was kidnapped on Friday at a wedding ceremony at his residence in Zungeru, Wushishi Local Government Area of the state.\nA family source told this medium that the abductors called the family on Sunday evening demanding the amount before releasing him and his three-year-old son.\nAccording to the source, “The call by the kidnappers came on Sunday in the evening demanding N60 million.\nHe, therefore, appealed to the Niger State Government to come to the family’s rescue towards ensuring their release from their abductors."
  },
  {
    "headline": "No going back on Anambra guber election – INEC",
    "summarized_story": "By Okodili Ndidi, Abuja- Advertisement -The November 6 Anambra governorship election will proceed as scheduled despite the deteriorating security situation in the State, the Independent National Electoral Commission (INEC) has vowed.\nINEC Chairman, Professor Mahmood Yakubu, stated this at the emergency meeting of the Inter-Agency Consultative Committee on Election Security (ICCES).\nHe noted that the importance of election security in a governorship election has never been this urgent.\nYakubu however warmed that should INEC again lose vital materials and facilities, the ongoing preparations for the election will be adversely affected.\nThe destroyed buildings have either been completely repaired or are nearing completion and we have fully replaced the materials destroyed."
  },
  {
    "headline": "BREAKING: Buhari presents 2022 budget Thursday",
    "summarized_story": "By Sanni Onogu, Abuja- Advertisement -President Muhammadu Buhari will on Thursday lay the 2022 Appropriations Bill before a joint session of the National Assembly.\nDeputy Senate President, Ovie Omo-Agege, disclosed this on Tuesday while presiding over plenary.\nDetails shortly…"
  },
  {
    "headline": "How to use WhatsApp on computer without data",
    "summarized_story": "By Samuel Oamen- Advertisement -You can now use WhatsApp on a desktop or laptop computer without your internet data on.\nWhatsapp Web syncs with the mobile app to let you send and receive WhatsApp messages from your computer.\nAfter your phone is linked to your computer, you can choose to put off the mobile data on your phone while the WhatsApp on your computer will continue working without data.\nUsing the WhatsApp Web, all you need to do is to open a browser-based application on your Computer (Chrome, Mozilla or Explorer)2.\nThen open Whatsapp on your phone, with your data ON."
  },
  {
    "headline": "Why Facebook, WhatsApp, Instagram collapsed-Facebook tech engineers",
    "summarized_story": "Facebook has explained the cause of the outage it suffered on Monday after, over its social media platforms, noting that its engineers have nipped it in the bud.\nThe outage happened around 4 p.m. in the Nigeria, and it wasn’t restored until 11pm when Mack Zuckerberg pasted and information on the social media.\nFacebook engineers nine hours after the outage and four hours after restoration—explained the reason behind it.\nAccording to facebook, “Our engineering teams have learned that configuration changes on the backbone routers that coordinate network traffic between our data centers caused issues that interrupted this communication.\nServices for all the social mediums got restored by 6 p.m., but not before an estimated $6 billion in revenue was lost for Facebook CEO Mark Zuckerberg."
  },
  {
    "headline": "BREAKING: Two killed, vehicles burnt, many injured as gunmen attack vigilante office in Enugu community",
    "summarized_story": "From Aloysius AttahGunmen invaded security office at Central Body Neighbourhood Watch, Ogrute, Enugu-Ezike, Igbo –Eze North LGA, Enugu State around 1am this morning.\nTwo security personnel including their former Commander were killed, othersinjured.\nPatrol vehicles and office burntDetails later…100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here ."
  },
  {
    "headline": "JUST IN: Al-Makura declares intention to contest APC National Chairmanship position",
    "summarized_story": "From Abel Leonard, LafiaThe Senator representing Nasarawa south senatorial district, Sen. Umaru Tanko Al-Makura, has declared his intention to contest for the national chairman of the ruling All Progressives Congress (APC) in the party’s forth coming national convention.\nAl-Makura made the declaration on Monday during grand finale of the local government chairmanship campaign of candidate of APC in Lafia local government area of the state at Lafia East Primary School.\n“I feel this time is auspicious and the venue of this grand finale is important.\nToday I take the opportunity of this grand finale to make a declaration about my aspiration to contest for the office of APC national chairman in the coming convention.\nThis is where my umbilical cord that gave rise to my political aspiration is”“I, Umaru Tanko Al-Makura, wish to contest for the position of APC chairman."
  },
  {
    "headline": "Nigerians to face test, isolation as UK rejects COVID-19 vaccine certificate",
    "summarized_story": "From Aidoghie Paulinus with agency reportThe United Kingdom has relaxed COVID-19 restriction for 50 countries excluding Nigeria and other African countries.\nNigerians entering the UK will be subjected to COVID-19 test and isolation in spite of their COVID-19 vaccine certificate obtained in Nigeria.\nThe UK is committed to opening up international travel and we are using our COVID-19 vaccine certification process to enable all those wishing to enter the UK to do so safely.\nNigerians were forced to undergo test and isolation even though they had certificate to show for the vaccine that took before traveling.\nRecall that in September, the head of Africa’s health agency had warned that the UK’s policy of not accepting COVID-19 vaccine certificates from the continent could increase vaccine hesitancy."
  },
  {
    "headline": "The Sun award well respected –Marwa, Ibrahim",
    "summarized_story": "Hailing the staff of NDLEA who he said made it possible for him to win the award, Marwa dedicated the honour to the officers and men of the agency.\nEarlier, Mr. Onuoha commended Ibrahim and Marwa for distinguishing themselves in their national assignments.\nHe explained that they were chosen as winners of The Sun Public Service Award 2020 because of excelling in their various worksHe said The Sun Board of Editors sit together to talk about Nigerians who have exceptionally done well in the area of public service.\nHe noted that after rigorous debate, the Board of Editors unanimously agreed to nominate Marwa and Ibrahim as the winner of Public Service award for the year 2020.\nHe maintained that the Public Service award is given to that man or woman who has made tremendous contribution in public service and shown excellence of governance."
  },
  {
    "headline": "Fiscal Federalism: Lagos Demands 1% in Revenue Allocation Formula",
    "summarized_story": "This is against the current revenue allocation formula, which gives the federal government 52.68 per cent, the 36 state governments 26.72 per cent, and the 774 local governments 20.60 per cent.\nThe Lagos State government’s demands were made by Governor Babajide Sanwo-Olu at the opening of a two-day South-west zonal public hearing on review of the revenue allocation formula, organised in Lagos by the Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC).\n“Lagos State is, no doubt, the nation’s commercial capital, and population centre.\nIt is, therefore, necessary to give due consideration to all the variables that support our advocacy for a special status.\nIt will be totally unfair for Lagos State to be left alone to bear these huge expenses without assistance from the centre."
  },
  {
    "headline": "Buhari Presents 2022 Budget Thursday, Lays It at FEC Tomorrow",
    "summarized_story": "Blessing IbungeAll things being equal, President Muhammadu Buhari, has been scheduled to present the 2022 budget proposal before the National Assembly this Thursday.\nThis, however, would be after he would have presented same to the Federal Executive Council (FEC) tomorrow, a source in the presidency told THISDAY last night.\nAccording to the source, finishing touches were being put to the budget ahead of the Thursday presentation at the federal legislature.\nA 2022 budget call circular published by the Budget Office and signed by the Minister of Finance, Budget and National Planning, Zainab Ahmed, set out the requirements and instructions that must be satisfied and followed in the preparation of the 2022 budget proposal.\nThese, however, were followed by agriculture and rural development (N83.82 billion); aviation (N69.3 billion); trade and investment (N51.08 billion); science and technology (N48.33 billion); national security adviser (N43.14 billion); power (N40.24 billion); interior (N39.64 billion); police affairs (N32.34 billion); presidency (N25.82 billion), among others."
  },
  {
    "headline": "South-south Governors Resolve to Join VAT Collection Suit",
    "summarized_story": "The governors’ decision to join the suit currently before the Supreme Court was contained in a communiqué presented to newsmen by Delta State Governor Ifeanyi Okowa.\nIn a related development, governors and leaders of the five South-east states scheduled an emergency meeting today to address rising insecurity in the zone.\n“Unequivocally supports the decision for states to collect Value Added Tax (VAT) and resolved to join the suit before the Supreme Court.\nUmahi appealed to the governors and other leaders from the zone to endeavour to be present and not in a representative capacity.\n“We must all be vigilant, circumspect in our utterances and place our hands on the deck for solutions,” he said."
  },
  {
    "headline": "Facebook, WhatsApp, Instagram Experience Global Outage",
    "summarized_story": "Emma OkonjiThe links to all three apps of WhatsApp, Instagram and Facebook, Monday evening, went down globally, making it difficult for its global users, Nigerians inclusive, to access the apps.\nAll three apps, which are owned by Facebook and run on shared infrastructure, stopped working completely Monday before 5pm Nigerian time.\nThe situation has made it extremely difficult for global users of Facebook, WhatsApp and Instagram to access their social media platforms.\nWhen contacted, spokesperson for Facebook Nigeria, said Facebook was aware of the challenge and had issued a statement, while trying to identify and fix what must have triggered the outage.\nPart of the statement issued by Facebook Spokesperson, Andy Stone, reads: “We are aware that some people are having trouble accessing our apps and products."
  },
  {
    "headline": "Army Launches Operation Still Waters, Charges Troops to be Ruthless with Criminals",
    "summarized_story": "At the launch in Lagos, troops deployed for the exercise were charged to be ruthless with criminals disturbing the peace and security of both states.\nHowever, they were mandated to respect the rights of law abiding citizens and adhere to the rules of engagement guiding the field exercise.\nHe said during Operation Still Waters, formerly codenamed Exercise Crocodile Smile, troops were expected to practice what they had learnt in the classrooms to better prepare them on how to tackle criminal elements.\n“If we also have the security agencies on the street conducting exercises it would go a long way at deterring criminal activities in our society.\n“Test unit and sub unit commanders aspect of counter terrorism and counter insurgency operation, and test unit and sub unit commanders on inter service core operation and cooperation with other sister agencies in military operations other than war…” he said."
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigating Financial Scandal In NIRSAL",
    "summarized_story": "SaharaReporters has done series of exclusive stories on how MD of NIRSAL, Aliyu Abduhalmeed, has been siphoning the agency's money.\nAGF MalamiHowever, it has now been discovered that the AGF is frustrating the probe of the fraud and has ordered security agencies to stop the investigation.\nThe Economic and Financial Crimes Commission, Independent Corrupt Practices and other related offences Commission, the State Security Service and Nigeria Intelligence Financial Unit are all to stop investigating the fraud within NIRSAL, the AGF instructed.\n\"All other agencies investigating the matter are to stay further action to allow your office total control of the investigation.\"\nSee Also Corruption EXPOSED: How Managing Director Of NIRSAL, Aliyu Abdulhameed, Diverted Almost N1bn To Bank Account Of Agency's Head Of FinanceDOCUMENT: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigati... by Sahara Reporters on ScribdSee Also Corruption Top Controversial Cases Taken Over By Nigeria’s Attorney General, Malami, And How They Ended"
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigating Financial Scandal In NIRSAL",
    "summarized_story": "SaharaReporters has done series of exclusive stories on how MD of NIRSAL, Aliyu Abduhalmeed, has been siphoning the agency's money.\nAGF MalamiHowever, it has now been discovered that the AGF is frustrating the probe of the fraud and has ordered security agencies to stop the investigation.\nThe Economic and Financial Crimes Commission, Independent Corrupt Practices and other related offences Commission, the State Security Service and Nigeria Intelligence Financial Unit are all to stop investigating the fraud within NIRSAL, the AGF instructed.\n\"All other agencies investigating the matter are to stay further action to allow your office total control of the investigation.\"\nSee Also Corruption EXPOSED: How Managing Director Of NIRSAL, Aliyu Abdulhameed, Diverted Almost N1bn To Bank Account Of Agency's Head Of FinanceDOCUMENT: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigati... by Sahara Reporters on ScribdSee Also Corruption Top Controversial Cases Taken Over By Nigeria’s Attorney General, Malami, And How They Ended"
  },
  {
    "headline": "JUST IN: Buhari to present 2022 budget to n'assembly Thursday",
    "summarized_story": "President Muhammadu Buhari is expected to present the 2022 budget to a joint session of the national assembly on Thursday.\nAdvertisementOvie Omo-Agege, deputy senate president, announced this on the floor of the upper legislative chamber on Tuesday.\n“The committee should have the report by tomorrow before budget presentation on Thursday,” he said.\nFemi Gbajabiamila, speaker of the house of representatives, also announced the budget presentation in the green chamber.\nThe initial total sum of the 2022 budget was N13.98 trillion, but the figure may change after work is done on the revised MTEF by the national assembly."
  },
  {
    "headline": "JUST IN: Buhari to present 2022 budget to n'assembly Thursday",
    "summarized_story": "President Muhammadu Buhari is expected to present the 2022 budget to a joint session of the national assembly on Thursday.\nAdvertisementOvie Omo-Agege, deputy senate president, announced this on the floor of the upper legislative chamber on Tuesday.\n“The committee should have the report by tomorrow before budget presentation on Thursday,” he said.\nFemi Gbajabiamila, speaker of the house of representatives, also announced the budget presentation in the green chamber.\nThe initial total sum of the 2022 budget was N13.98 trillion, but the figure may change after work is done on the revised MTEF by the national assembly."
  },
  {
    "headline": "Sit-at-home: Seal off any shop in solidarity with IPOB, Arewa forum tells northern governors",
    "summarized_story": "The Arewa Youth Consultative Forum has asked governors of the northern region to deal with any northerner who shows solidarity for the proscribed Indigenous People of Biafra (IPOB).\nAYCF also called on the northern governors not to allow IPOB to infiltrate the region and asked them to seal off the shops of northerners who sympathise with the secessionist group.\n“We hope they will continue with the sit-at-home for another 10 years and we wish them the very best of luck.\n“We call on Northern Governors to step up action in order to ensure this outlawed terror gang called IPOB does not infiltrate the region.\nWe also expect the governors to ensure that any northerner who shuts down his shop in solidarity with IPOB, that shop should be sealed forever."
  },
  {
    "headline": "Sit-at-home: Seal off any shop in solidarity with IPOB, Arewa forum tells northern governors",
    "summarized_story": "The Arewa Youth Consultative Forum has asked governors of the northern region to deal with any northerner who shows solidarity for the proscribed Indigenous People of Biafra (IPOB).\nAYCF also called on the northern governors not to allow IPOB to infiltrate the region and asked them to seal off the shops of northerners who sympathise with the secessionist group.\n“We hope they will continue with the sit-at-home for another 10 years and we wish them the very best of luck.\n“We call on Northern Governors to step up action in order to ensure this outlawed terror gang called IPOB does not infiltrate the region.\nWe also expect the governors to ensure that any northerner who shuts down his shop in solidarity with IPOB, that shop should be sealed forever."
  },
  {
    "headline": "EFCC arrests Ganduje’s wife over 'fraud'",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has reportedly arrested Hafsat, wife of Abdullahi Ganduje, Kano governor, over allegations of bribery and fraud.\nAdvertisementThe EFCC had acted based on a petition by her son, Abdulazeez, a report by Premium Times said.\nHafsat was arrested after failing to show up at the EFCC Abuja headquarters on September 13 upon invitation.\nShe was said to have travelled to the UK at the time to attend the graduation ceremony of her son.\nAdvertisementShe was arrested on Monday evening and was still at EFCC headquarters as of 6am on Tuesday."
  },
  {
    "headline": "Pandora Papers: Kenya’s first family implicated in biggest-ever offshore data leak",
    "summarized_story": "Seven members of the Kenyatta family, including the president, are revealed, through the Pandora Papers, as being variously connected to more than 10 offshore companies and foundations.\nThe Kenyattas’ offshore investments include a company with stocks and bonds worth $30 million.\nLargest-ever leakThe Pandora Papers represent the latest and largest, by data volume, in a series of major leaks of financial data about the offshore world over the last five years.\nIn 2016, the Panama Papers, which consisted of 2.6 terabytes of data, leaked from the law firm, Mossack Fonseca.\nMore than 100 billionaires feature in the leaked data, as well as celebrities, rock stars, and business leaders."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "Kola Aina appointed chair of new board at Lagos Angel Network",
    "summarized_story": "The Lagos Angel Network (LAN) has appointed a new Board of Governors (BoG) to oversee its affairs, effective from today October 1, 2021.\nLAN has also birthed several Angel groups such as Rising Tide Africa (RTA), South South-East Angels Network (SSEAN), Abuja Angels Network (AAN), and the Diaspora Angels Network (DAN).\n“We’ve seen the Lagos startup ecosystem grow significantly bigger than when we started LAN 10 years ago and need to do more.\nWe’ve seen what’s possible, and now it’s time to take Angel investing in Nigeria to the next level,” Sulaiman adds.\n“I want to thank the founding LAN Board whose achievements cannot be overstated, and their legacy is visible for all to see,” Aina says."
  },
  {
    "headline": "iOS 15 review: new features make iPhone a more powerful device",
    "summarized_story": "Apple released the iOS 15 on September 20, 2021, and it’s a super-smart operating system.\nUnlike the flashy update that happened from iOS 6 to iOS 7, iOS 15 debuts with subtle updates that form a more significant upgrade of iOS 14. iOS 15 is the perfect example of being loud without screaming: the new operating system improves your overall experience without altering your phone visually.\niOS 15 Focus mode lets you filter notifications based on your current engagement.\nBut iOS 15 gives you control by gathering your notifications in one place where you can view them at your own convenience.\nWith iOS 15, there’s a tool that lets you have different font sizes for different apps on your phone."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "From ‘urgent’ ₦30k to $50m: How Hanu Fejiro Abodje built Patricia from scratch",
    "summarized_story": "Hanu Fejiro Agbodje of Patricia (HFA): I have a journal where I write all my ideas in, no matter how stupid or dumb they seem.\nI was just trying to surviveMM: But what gave you the conviction that Patricia was the right idea to build on?\nAdvertisementHFA: When I had the idea for Patricia is 2015, I was in my grandad’s house.\nI didn’t even know there was a tech community for the first two years of running Patricia.\nI didn’t know what to do with it."
  },
  {
    "headline": "Nigerian telemedicine startup, iWello, is making healthcare available to people living on less than $1 per day",
    "summarized_story": "This, too, could have been taken care of if there had been surgery funding available instead of the embarrassment of begging,” Adejonwo explains.\nThe idea became iWello, a telemedicine startup, and was launched in July 2021 as a Minimum Viable Product (MVP) where users can easily consult with doctors.\nAdvertisementHealthcare for those who live below $1When it comes to healthcare, iWello claims it provides a sense of belonging to low-income people — those who live paycheck to paycheck, have difficulty living above $1 per day and live in slums and rural areas.\nThere are two types of surgery funding: paid and free.\nAnd offers surgery funding, a service Reliance Health Maintenance Organisation (HMO), a telemedicine insurance company, also provides."
  },
  {
    "headline": "Connecting learners to tutors, Bitmama’s pre-seed, changes at Airtel Africa, Zuckerville down",
    "summarized_story": "Source: SuppliedSome of the biggest businesses we know today started with the founder(s) trying to solve a problem that they faced.\nThe same rings true for Godwin Benson and Abiola Oyeniyi, Co-founders of edtech startup, Tuteria.\nAdvertisementThe desire to solve that problem stayed with him from 2005 to 2014 when Tuteria was launched.\nHow Nigerian edtech startup, Tuteria, is connecting learners to tutors in NigeriaBitmama’s pre-seed raiseL-R Akin Asalu, COO, Bitmama_ Ruth Iselema, CEO, Bitmama.\nBlockchain payments startup, Bitmama has announced its $350,000 pre-seed raise."
  },
  {
    "headline": "Nigeria PMI hits 3 month-high despite supply constraints",
    "summarized_story": "The index had dropped continuously from 51 points in May to 48 points in July before it picked up in August with 49.6 points.\nAnalysts at FBN Quest note that one of the impacts of the global headwinds was the cut in supply of imported inputs and materials used for production by manufacturers in Nigeria.\nDisruption at the global supply chain have propelled manufacturers to look inwards for local sourcing of raw materials and inputs.\n“ The regional value chain can be utilized for creation, design, raw material supply, processing, transportation, storage, marketing and sales,” he said.\nNigeria’s manufacturing sector recorded 3.49 percent growth in the second quarter of 2021 which was also the highest Q2 figure across six years."
  },
  {
    "headline": "Nigerian Exchange Group eyes N32.62bn from listing 1.9bn shares by introduction",
    "summarized_story": "The NGX Regulation Limited has approved the listing of Nigerian Exchange Group (NGX Group) Plc by introduction.\nSince shares were admitted for trade on the NASD Plc, the Nigerian Exchange Group Plc trades with a Symbol “SDNGXGROUP”.\nIf successful, the listing by the introduction of the said shares of Nigerian Exchange Group Plc will translate to an issued share capital of about N32.62 billion.\nFollowing the demutualization of the Nigerian Stock Exchange (NSE) earlier this year, a new non-operating holding company known as The Nigerian Exchange Group Plc (NGX Group) was formed.\nNGX Group has three operating subsidiaries, namely: Nigerian Exchange Limited (NGX Limited), NGX Regulation Limited (NGX REGCO), and NGX Real Estate Limited (NGX RELCO) which are duly registered at the Corporate Affairs Commission (CAC)."
  },
  {
    "headline": "Morison, Honeywell, LASACO, others give investors over 100% return in 2021",
    "summarized_story": "Top among the outperformers is healthcare manufacturing company, Morison Plc, which traded at N2.10 per share on September 30, representing a 311.8 percent gain this year.\nInvestors in Honeywell Flour Mills Plc which stood at N3.76 as at September 30 have booked a 213.3 percent capital appreciation since the beginning of this year.\n“Stock prices typically reflect investors’ expectations about future corporate performances”, Meristem analysts said in their equity commentary for September.\nNigeria’s stock market increased by 2.55 percent in the month of September, thanks to last minute bargain hunting activities two days to the month’s end.\nAt 44kobo per share Regency Alliance Plc traded on September 30, it has increased by 100 percent this year."
  },
  {
    "headline": "PUWOV apprehends personnel for extortion, urges residents’ support to flush out corrupt officials – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Public Works Volunteers (PUWOV) in Edo State has apprehended one Fidelis Ugbenna, an officer of the scheme for allegedly extorting money from a motorist.\nThe State Coordinator, PUWOV, Mukhtar Yusuf-Osagie, who disclosed this to journalists in Benin City, said the personnel has been handed over to the police for further investigation and prosecution.\nReassuring the scheme’s commitment to curb criminality and ensure peace and orderliness, in partnership with other security agencies in the state, Yusuf-Osagie solicited for residents’ support to maintain discipline and flush out corrupt officers from the schemeAccording to him, “The Edo PUWOV has apprehended one Mr. Fidelis Ugbenna, a PUWOV personnel, who connived with a dismissed PUWOV personnel (Emmanuel Oviawe) to extort a private motorist at Nepa junction on Akpakpava axis of Ring Road in Benin City.”He said the corrupt PUWOV official extorted the sum of N10, 000 from Mr. Chibuzor Nenchi, a road user on the Ring Road axis, adding, “the PUWOV official, Ugbenna Fidelis has been taken to Oba Market Police Division for further investigation and prosecution.\nAlso, an immediate dismissal awaits him after prosecution.”The PUWOV coordinator further stated: “We are reassuring members of the public that the scheme will not relent in upholding its mandate on discipline as such all bad eggs will be flushed out from the scheme.\n“We want to charge members of the public to always use the PUWOV complaints lines on 09150322999 and 08132030846 to report any PUWOV official culpable of the illegal act of extortion.”“Also, members of the public should be observant and mindful of some miscreant on black outfits posing as PUWOV taskforce to extort money from innocent citizens; members of the public should report anyone involved in such illegality,” Yusuf-Osagie added."
  },
  {
    "headline": "Edo govt hails Liquorose for her comportment, performance in BBNaija – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has congratulated Roseline Afije, better known as Liquorose on her emergence as the first runner-up in the sixth season of the reality television show, Big Brother Nigeria (BBNaija).\nAfije is a native of Edo State.\nAccording to him, “On behalf of the Edo State Government, I congratulate Roseline Afije, also known as Liquorose, on her emergence as the first runner-up in the Big Brother Nigeria (BBNaija) reality show.\nShe put up a good showing with a dignified poise and character that earned her fans across the country.\n“As an indigene of our dear state, we are proud of her and her achievement and wish her success in future endeavors.”..."
  },
  {
    "headline": "Betsy Obaseki assures of better opportunities for girl-child as Bayelsa Queens wins maiden BOWFT – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State First Lady, Mrs. Betsy Obaseki has said the just-concluded Betsy Obaseki Women Football Tournament (BOWFT) will guarantee better opportunities for the girl-child, reassuring the government’s commitment to ensuring that every female child in the state realizes her fullest potentials.\nDignitaries at the closing ceremony include Edo State Deputy Governor, Rt.\nPhilip Shaibu; Minister of Youth and Sports Development, Sunday Dare; former Governor of Edo State, Chief Lucky Igbinedion; wife of Osun State Governor and Chairman Southern Governor’s Wives Forum, Mrs. Kafayat Oyetola and wife of Bayelsa State Governor, Mrs. Gloria Diri, amongst others.\nAccording to Mrs. Obaseki, “What we have seen and experienced in the last one week of this tournament is the highest form of professionalism in Nigerian football.\n“It’s also to create a platform and an opportunity for young girls all over Nigeria and Edo State in particular."
  },
  {
    "headline": "COVID-19: Edo vaccinates over 136,000 persons, records five new deaths, 84 more cases – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has ramped up the vaccination of more residents with the coronavirus (COVID-19) vaccines, noting that at least 136,082 persons across the 18 local councils of the state have been inoculated with one dose of the vaccine since the launch of the vaccination exercise in the state.\nHead of Edo COVID-19 Case Management, Dr. Ebomwonyi Osagie said this on Monday during the daily COVID-19 press briefing at the Government House in Benin City.\nHe noted that the state also recorded 84 more cases and five more COVID-19 related deaths in the last five days, urging residents to get vaccinated in order to be fully protected against the virus.\nAccording to him, “As of yesterday, a total of 136,082 persons have had at least one dose of the COVID-19 vaccine.\nSo, we encourage people who have taken their first dose to take the second and those who are not yet vaccinated should please avail themselves of the opportunity of the ongoing vaccination to get protection against the deadly virus,” he charged."
  },
  {
    "headline": "Why public schools in Katsina skipped third term – Education Commissioner",
    "summarized_story": "ADVERTISEMENTThe Katsina State Government has said it is cancelled the third term of the last academic session in public schools in the state, so as to ensure that the students did not miss their external examinations.\nThe state’s Ministry of Education gave the reason following an outcry from members of the public and civil society organisations in the state.\nGovernor Aminu Masari shut down the public schools but reopened the day schools a few weeks later.\nIn February, boarding school students and staff were asked to resume in day schools near them.\nWhen we finished the assessment on the reopening of boarding schools, we decided to skip third term for the whole secondary schools, (boarding and day), in the state."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "JUST IN: Buhari to present 2022 Budget to NASS Thursday",
    "summarized_story": "BY EMEKA EJEREPresident Muhammadu Buhari will present the 2022 Appropriation Bill to a joint session of the Senate and House of Representatives on Thursday, Deputy Senate President, Ovie Omo-Agege, has disclosed.\nOmo-Agege made the disclosure on Tuesday, while presiding over the plenary as the Senate President, Ahmad Lawan, was absent.\nEarlier, Senator Omo-Agege had informed the lawmakers that President Buhari has submitted the revised 2022-2024 Medium Term Expenditure Framework MTEF and Fiscal Strategy Paper (FSP).\nThe revision, according to President Buhari, will reflect funds for the Independent National Electoral Commission (INEC) to prepare for the 2023 general elections.\nHe explained that it also has provisions for hazard allowance for health workers, wage adjustment for workers, and funds for the population and housing census in 2022."
  },
  {
    "headline": "Nigeria’s Army Chief flags off military operations in Southeast amid rising insecurity",
    "summarized_story": "OBINNA EZUGWUIn effort to curb rising spate insecurity in Nigeria, the country’s Chief of Army Staff (COAS), Lieutenant General Faruk Yahaya has flagged off three Nigerian Army Field Training Exercises in Emene, Enugu state, on Monday 4 October 2021.\nIn his remark during the ceremony, Lt Gen Yahaya identified the exercises as Exercise STILL WATER, ENDURING PEACE and Exercise GOLDEN DAWN, which he pointed out, will be conducted simultaneously in South South, South East, South West and North Central Nigeria respectively.\nThese exercises, he added would seek to confront the multifaceted and contemporary security challenges prevalent in different parts of the country.\nHe however enjoined the citizenry to be law abiding and cooperate with security agencies in order to restore of law and order in the country.\nThe flag off was witnessed by Commanders, heads and representatives of sister security agencies domiciled in Enugu state."
  },
  {
    "headline": "Nigeria spent N1.47 trillion on debt servicing in first half 2021 – DMO",
    "summarized_story": "Data from Nigeria’s Debt Management Office (DMO), have shown that the country spent N1.47 trillion on debt servicing payments in the first half of 2021.\nIn the first quarter of the year, the country spent N1.02 trillion on both domestic and external debt servicing, while a total of N445.45bn was spent in the second quarter of 2021.\nFrom January to March 2021, Nigeria spent N612.71bn on domestic debt servicing, while it spent $1bn (N410.33bn) on external debt servicing, PUNCH reported.\nFrom April to June 2021, Nigeria spent N322.7bn on domestic debt servicing and $299m (N122.7bn) on external debt servicing.\nFor domestic debt, Nigeria spent N219.29bn in January, N125.09bn in February, N270.33bn in March, N258bn in April, N42.4bn in May, and N22.3bn in June."
  },
  {
    "headline": "Amnesty condemns violent implementation of IPOB sit-at-home order in Southeast Nigeria",
    "summarized_story": "Global human rights body, Amnesty International, has condemned the violent implementation of a sit-at-home order issued by separatist group, the Indigenous People of Biafra (IPOB) in Nigeria’s Southeast region.\nHoodlums enforcing the sit-at-home order of the group, have continued to burn vehicles and other properties of residents who disobey the order.\nCondemning the incidents in a statement posted via its twitter handle on Monday, Amnesty said the attacks must stop.\n“Violent implementation of the sit-at-home imposed by #IPOB must stop,” the statement said.\n“Attacking people or their places of business in the name of imposing sit-a-home order is a gross human rights abuse and those behind it must be brought to justice through fair trial.”"
  },
  {
    "headline": "Osinbajo Seeks Focus On Developing Agric Value Chain",
    "summarized_story": "There is a need to focus on developing the nation’s agricultural value chain, particularly the business of guaranteeing the creation of a proper commodity market with the right logistics that would be mutually beneficial to farmers and consumers, says Vice President Yemi Osinbajo (SAN).\nHe made the assertion on Monday while receiving a delegation from Gezawa Commodity Market and Exchange, a Kano State based private company that provides a specialised organised market, operating efficient transaction and delivery of agricultural, solid minerals, and energy-based commodities.\nThe delegation was led by the Managing Director of the company, Mr. Muhammad Rabi’I Elyakub.\n“It is in adding value, ensuring the value chain works effectively, ensuring that we can process, store and trade, that’s really where the missing link is.”Elaborating on the importance of the agricultural value chain, Prof Osinbajo reiterated that, “I don’t know of any society that has been able to develop the whole value chain from farm to table without a very vibrant commodity exchange.”He lauded the idea of a private commodity exchange, noting that “a private commodity exchange is very important.\nI am a strong believer in the private sector’s involvement.”Prof Osinbajo then commended the commodity company for having made “very quick progress in a very short time,” adding that the company has covered substantial ground."
  },
  {
    "headline": "Osinbajo Seeks Focus On Developing Agric Value Chain",
    "summarized_story": "There is a need to focus on developing the nation’s agricultural value chain, particularly the business of guaranteeing the creation of a proper commodity market with the right logistics that would be mutually beneficial to farmers and consumers, says Vice President Yemi Osinbajo (SAN).\nHe made the assertion on Monday while receiving a delegation from Gezawa Commodity Market and Exchange, a Kano State based private company that provides a specialised organised market, operating efficient transaction and delivery of agricultural, solid minerals, and energy-based commodities.\nThe delegation was led by the Managing Director of the company, Mr. Muhammad Rabi’I Elyakub.\n“It is in adding value, ensuring the value chain works effectively, ensuring that we can process, store and trade, that’s really where the missing link is.”Elaborating on the importance of the agricultural value chain, Prof Osinbajo reiterated that, “I don’t know of any society that has been able to develop the whole value chain from farm to table without a very vibrant commodity exchange.”He lauded the idea of a private commodity exchange, noting that “a private commodity exchange is very important.\nI am a strong believer in the private sector’s involvement.”Prof Osinbajo then commended the commodity company for having made “very quick progress in a very short time,” adding that the company has covered substantial ground."
  },
  {
    "headline": "Zulum, 7 Other Lake Chad Govs Meet Over Regional Insecurity",
    "summarized_story": "Borno State governor, Babagana Umara Zulum, alongside seven other state governors within the Lake Chad region, on Monday, met in Younde, Cameroon, to discuss regional security cooperation and path to improve stability.\nOrganized by the Lake Chad Basin Commission, with technical support from the African Union, United Nations Development Programme and Crisis Management Initiative, the meeting was hosted by the Cameroonian Government in collaboration with the Lake Chad Governors’ Forum.\nEspecially in the shores of Lake Chad.\nIt is necessary to undertake holistic security operations in the shores of Lake Chad in order to clear the insurgents, otherwise, we are not going anywhere,” Zulum noted.\nZulum expressed great concern over the non-utilisation of Lake Chad Basin’s shore which he noted, can provide huge economic potentials to benefit the people of the region."
  },
  {
    "headline": "Zulum, 7 Other Lake Chad Govs Meet Over Regional Insecurity",
    "summarized_story": "Borno State governor, Babagana Umara Zulum, alongside seven other state governors within the Lake Chad region, on Monday, met in Younde, Cameroon, to discuss regional security cooperation and path to improve stability.\nOrganized by the Lake Chad Basin Commission, with technical support from the African Union, United Nations Development Programme and Crisis Management Initiative, the meeting was hosted by the Cameroonian Government in collaboration with the Lake Chad Governors’ Forum.\nEspecially in the shores of Lake Chad.\nIt is necessary to undertake holistic security operations in the shores of Lake Chad in order to clear the insurgents, otherwise, we are not going anywhere,” Zulum noted.\nZulum expressed great concern over the non-utilisation of Lake Chad Basin’s shore which he noted, can provide huge economic potentials to benefit the people of the region."
  },
  {
    "headline": "BBNaija 6: I Didn’t Expect To Win – White Money",
    "summarized_story": "Winner of Big Brother Naija season 6 reality TV show, Hazel Oyeze Onou, popularly known as White Money, has said that he didn’t expect to emerge as the winner of the ‘Shine Ya Eye’ edition.\nSpeaking at an event held in his honour in Lagos on Monday, White Money disclosed that being the least uneducated in the house put him at a disadvantaged position to win the grand prize.\nWhite Money“I was surprised everyone was learned and I’m the only illiterate.\nI saw Liquorrose as my strongest competitor in the house, she had her ‘A’ game and was never distracted,”he said.\nHe acknowledged that the high point for him while in the BB Naija House, was winning the EvolutionPlus Task and becoming the Lipton influencer."
  },
  {
    "headline": "FirstBank hosts FinTech summit 5.0, highlights impact of open banking on financial inclusion",
    "summarized_story": "By KEN EMORDIFirst Bank of Nigeria Limited, Nigeria’s leading financial inclusion services provider, has announced that the 2021 edition of its annual FINTECH Summit is scheduled to hold on Thursday, 7 October 2021 by 10:00 am.\nThe need for Open Banking in Nigeria cannot be overemphasized as the importance goes beyond just convenience to its game-changing impact in transforming value creation, product conceptualization and closing the financially excluded gap.\nThis is the focus of this year’s theme; exploring the depth and range of these derivative opportunities set to be triggered by the application of an Open Banking regime in the country.\nAbout FirstBankFirst Bank of Nigeria Limited (FirstBank) is the premier Bank in West Africa and the leading financial inclusion services provider in Nigeria for over 127 years.\nThis commitment is anchored on our inherent values of passion, partnership and people, to position You First in every respect."
  },
  {
    "headline": "FirstBank hosts FinTech summit 5.0, highlights impact of open banking on financial inclusion",
    "summarized_story": "By KEN EMORDIFirst Bank of Nigeria Limited, Nigeria’s leading financial inclusion services provider, has announced that the 2021 edition of its annual FINTECH Summit is scheduled to hold on Thursday, 7 October 2021 by 10:00 am.\nThe need for Open Banking in Nigeria cannot be overemphasized as the importance goes beyond just convenience to its game-changing impact in transforming value creation, product conceptualization and closing the financially excluded gap.\nThis is the focus of this year’s theme; exploring the depth and range of these derivative opportunities set to be triggered by the application of an Open Banking regime in the country.\nAbout FirstBankFirst Bank of Nigeria Limited (FirstBank) is the premier Bank in West Africa and the leading financial inclusion services provider in Nigeria for over 127 years.\nThis commitment is anchored on our inherent values of passion, partnership and people, to position You First in every respect."
  },
  {
    "headline": "Facebook shuts out 2.9 billion subscribers, loses billions of dollars",
    "summarized_story": "The global economy lost billions of dollars as Facebook, WhatsApp, and Instagram went down at about 4.42pm on Monday.\nThe Chief Executive Officer of Facebook, Mark Zuckerberg, also lost nearly $7bn since the outage began.\nFacebook and its affiliates have 2.9 billion monthly active users.\nThe shutdown is reminiscent of 2019, when Facebook shut down in its biggest outage till date (a 24-hour shut down).\nFor hours when navigating to Facebook, Instagram, and WhatsApp websites, a server error appeared, which indicated there was an issue with Facebook’s servers."
  },
  {
    "headline": "2023: Northern group warns against zoning presidency",
    "summarized_story": "THE opposition against the zoning of the 2023 Presidency continued on Monday with a coalition of over 60 Northern groups, describing it as undemocratic.\nThe CNG warned that any political party which takes any step to block the window for the possible emergence of a northern presidential candidate will be rejected.\nHe said, “We have seen a new statement by IPOB directing all Igbos living anywhere in Nigeria which includes the North to participate in the sit-at-home order for one month.\n“What we are saying is that the Igbo in the North are not threatened.\n“But if they comply with that order, it means they are also with the people that are actually challenging the state."
  },
  {
    "headline": "Police Arrest Suspected Killers Of Chike Akunyili, Hunt Arsonists In Anambra",
    "summarized_story": "Police Arrest Suspected Killers Of Chike Akunyili, Hunt Arsonists In AnambraThe Anambra State Police Command has arrested two suspects in connection with the murder of Chike Akunyili, husband to late former Minister of Information, Prof Dora Akunyili.\nOn Sunday, gunmen reportedly attacked Igbokwe and Okongwu’s residence in the Nnewi area of the state.\nHe added that CCTV cameras captured the arsonists arriving in a vehicle at his residence in the town.\nDuring the Nnewi attack, two persons were killed including a student of the College of Sciences student at Nnamdi Azikiwe University identified as Chioma.\nOlofu and some senior officers have visited the scene of recent attacks in the state including the DSS Office in Nnewi and the residences of Igbokwe and Okongwu."
  },
  {
    "headline": "Nnamdi Kanu: Sit-At-Home For 10 Years, Don’t Bring It To North — Arewa Youths Warn IPOB",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has been warned by the Arewa Youth Consultative Forum, AYCF, over its demand for the Middle Belt to join in shutting down Nigeria.\nIPOB and the Southeast can sit-at-home for ten years, but they should remain away from the North, according to AYCF National President Yerima Shettima.\nThe AYCF National President bemoaned the fact that Southeast governors appear to be unconcerned about the region’s pro-Biafra agitators’ activities.\nHe added: “We call on northern governors to step up action in order to ensure this outlawed terror gang called IPOB does not infiltrate the region.\nWe also expect the governors to ensure that any northerner who shuts down his shop in solidarity with IPOB, that shop should be sealed forever."
  },
  {
    "headline": "JUST IN: EFCC Arrests Governor Ganduje’s Wife",
    "summarized_story": "Hafsat Ganduje, the wife of Governor Abdullahi Ganduje of Kano, has been arrested by the EFCC over a bribery and land fraud case reported by her son, PREMIUM TIMES has learnt.\nMrs Ganduje had earlier been invited to report to the EFCC’s Abuja headquarters on September 13 but she did not appear and the EFCC then threatened to arrest her.\nSources close to her later said she travelled to the UK at the time to attend the graduation ceremony of her son.\nInvestigators are questioning Mrs Ganduje over allegations relating to land fraud in a petition by her own son, Abdualzeez Ganduje.\nA person, who has the knowledge of the arrest but asked not to be identified, said “she was arrested this (Monday) evening.”Mrs Ganduje was still at EFCC headquarters as of 6 a.m. on Monday, this newspaper learnt."
  },
  {
    "headline": "Sit-at-home: Seal any shop closed in solidarity with IPOB, Arewa Group tells Northern Governors",
    "summarized_story": "The AYCF further noted that it appears that the governors of the South-East are satisfied with the activities of IPOB.\nThe group stated, “We hope they will continue with the sit-at-home for another ten years and we wish them the very best of luck.\nWe also expect the governors to ensure that any northerner who shuts down his shop in solidarity with IPOB, that shop should be sealed forever.\nAYCF, in the statement, took a swipe at what it described as the use of killings and arson to press home a demand that the democratic process in existence would have taken care of.\n“We call on northerners of good conscience to avoid any undemocratic means, including the burning of government-owned structures, where fellow Nigerians legitimately work to feed their families,” the statement added."
  },
  {
    "headline": "Breaking: Hoodlums invade Enugu community, kill 2, injure others, burn security patrol vehicles, office (PICTURES)",
    "summarized_story": "Gunmen on Tuesday morning invaded a vigilante office of a central security outfit in Ogrute, Enugu-Ezike, Igbo–Eze North local government area of Enugu State and two security operatives.\nThe gunmen whose identities were yet to be ascertained also injured others just as they burnt security patrol vehicles and office.\nPolice authorities are yet to confirm the incident as at the time of filling this report."
  },
  {
    "headline": "2023: Coalition backs northern govs, knocks Akeredolu, others",
    "summarized_story": "The Coalition of Northern Groups (CNG) Monday hit the southern governors on zoning of the presidency, insisting the contest should be thrown open in the 2023 general elections.\nThe position was however countered by their northern counterparts and the Northern Elders Forum.\nColonel Amadu Ali, a northerner from Kogi State, was national chairman between 2005 and 2008 when Yar’Adua, another Northerner, was allowed to aspire and secure the PDP presidential ticket.\n“To warn any political party that takes any step to block the window for the possible emergence of a northern presidential candidate shall be roundly rejected by the North.\nAny obscure group that is allegedly championing the northern interest and advocating for zoning should be disregarded."
  },
  {
    "headline": "Breaking: Facebook, Instagram, WhatsApp bounce back",
    "summarized_story": "Three giant social media platforms – Facebook, Instagram and WhatsApp are back after hours of extinction.\nDetails loading…"
  },
  {
    "headline": "NCR launches “Project Zero Hunger” for refugees, IDPs, others -NigPilot",
    "summarized_story": "National Commission for Refugees, Migrants and Internally Displaced Persons NCFRMI, in collaboration with Defence and Police Officers’ Wives Association DEPOWA, has launched the “Project Zero Hunger” programme aimed at catering for refugees, IDPs and other vulnerable groups in states across the federation.\nThe Project Zero Hunger Initiative will fight food insecurity and stem the threat of famine in our land.\nThe Project will additionally assuage the growing burden of hunger amongst persons of concern.\nI see that much has been done through partnerships with critical stakeholders for appropriate support to mobilize and deploy resources to provide a pedestal of success for the Project Zero Hunger Initiative.\n“On behalf of our persons of concern, I hereby launch Project Zero Hunger and pray that it positively impacts on the lives of the intended beneficiaries.”"
  },
  {
    "headline": "Access Bank, Xploits Consulting donate food, school items to orphanages in FCT -NigPilot",
    "summarized_story": "In continued efforts to bring succor to orphans across the FCT, Access Bank Plc and Xploits Consulting Ltd , have donated food and school items to some orphanages as part of their projects to ensure that they have a better life.\nSome of the orphanages captured in the project and visited include Daughters of Charity Orphanage, Bwari, Destined Children’s Orphanage, Kado Estate, Abuja, Best Life Orphanage, Gwagwalada, Al’ansar Orphanage, Kuje in the FCT.\nSpeaking at the handing over of the items, Director, Communications, Xploits Consulting Ltd, Mrs, Grace Taiwo said that the presentation of the items were part of Access Bank Plc’s Corporate Social Responsibility, CSR adding that the bank’s commitment was largely focused around the United Nations Sustainable Develop Goals.\nTaiwo assured that her organisation with support from Access Bank Plc will continue to invest in the lives of Nigerians especially in areas of education, health, gender equality, arts.\nShe listed some of the items donated to include food items, toiletries and stationeries."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "BREAKING: President Buhari To Present 2022 Budget To NASS On Thursday",
    "summarized_story": "President Muhammadu Buhari will present the 2022 Appropriation Bill to a joint session of the Senate and House of Representatives on Thursday.\nHe made the announcement while presiding over the plenary as the Senate President, Ahmad Lawan, was absent.\nBefore the announcement, Senator Omo-Agege informed the lawmakers that President Buhari has submitted the revised 2022-2024 Medium Term Expenditure Framework MTEF and Fiscal Strategy Paper (FSP).\nThe revision, according to President Buhari, will reflect funds for the Independent National Electoral Commission (INEC) to prepare for the 2023 general elections.\nPresident Buhari had presented a proposed 2021 Budget of N13.08 trillion, to the National Assembly on October 8, 2021."
  },
  {
    "headline": "Insecurity: Army Launches Exercises In South-East, Three Other Regions",
    "summarized_story": "The Nigerian Army has launched three field training exercises to tackle the security challenges in four geopolitical zones of the country.\nThese exercises – Still Water, Enduring Peace and Golden Dawn – are to be conducted simultaneously in South-East, South-South, South-West and North-Central regions.\nThe army chief explained that the aim of the exercises was to restore law and order in the affected regions, as well as create enabling environment for socio-economic activities to thrive.\nMeanwhile, Yahaya presented a patrol vehicle to the 82 Division, saying the gesture was to empower Regimental Sergeant Majors (RSMs) of the army.\nThe flag-off was witnessed by various commanders, heads, and representatives of other security agencies in Enugu state."
  },
  {
    "headline": "Ikeja DisCo Announces Eight-Week Blackout In Ogba, Magodo, Other Areas",
    "summarized_story": "Ikeja Electric Plc on Monday said some communities under its franchise network in Lagos State will experience an eight-week power outage.\nIn a briefing, the Chief Technical Officer of the company, Jide Kumapayi, said the development was to enable the Transmission Company of Nigeria (TCN) to re-conduct its 132KV lines.\nAccording to him, the upgrade is coming at a time when the capacity of most of the 132KV lines has become limited largely due to time and usage, leading to under-utilization.\n“The TCN is currently embarking on the upgrade of 132 KV lines from Ikeja West to Ota and this activity is phased into four stages.\nSo we want to appeal to our customers to bear with us as this exercise will be beneficial toward the improvement of power supply in our network.”"
  },
  {
    "headline": "VAT Dispute: South-South States To Join Suit At Appeal Court, Say Governors",
    "summarized_story": "Governors of the South-South have resolved that states in the region should join the suit filed by the Federal Inland Revenue Service (FIRS) challenging the collection of Value Added Tax (VAT) by states.\nThis formed part of the resolutions reached at the meeting of the South-South Governors’ Forum held on Monday at the Government House in Port Harcourt, the Rivers State capital.\nDelta State Governor and Chairman of the forum, Ifeanyi Okowa, disclosed this while briefing reporters at the end of the closed-door meeting.\nThose who attended the meeting include the host, Governor Nyesom Wike, Governor Godwin Obaseki of Edo State, Governor Udom Emmanuel of Akwa Ibom State, and Governor Douye Diri of Bayelsa State.\nHowever, Cross River State Governor, Ben Ayade, was absent at the meeting."
  },
  {
    "headline": "Kenya Confirms Bid For 2025 World Athletics Championships",
    "summarized_story": "Kenya on Tuesday confirmed its bid to host the 2025 athletics world championships, which if accepted, would bring the event to Africa for the first time.\nNairobi has hosted both the world under-18 and under-20 world championships in the last four years but faces a string of high-profile rivals including Tokyo, which staged the Olympic Games in July.\n“We formally confirmed our bid to host the global championships on Friday, October 1 which was the deadline set by World Athletics,” Athletics Kenya chief Jackson Tuwei told AFP.\n“We organised two very successful world junior championships at the Kasarani stadium in 2017 and in August 2021, where a number of world records and personal bests were realised,” he said.\nKenyan sports minister Amina Mohammed first announced the country’s bid for the 2025 world championships in Doha in September 2019, after WA said the global event would be held on a rotational basis across continents."
  },
  {
    "headline": "Supreme Court Reserves Judgment in case between States, FG -",
    "summarized_story": "The Supreme Court has reserved judgment in the suit filed against the Federal Government by the 36 State Governments over the funding of superior courts created by Section 6 of the Constitution.\nA seven-member panel of the Supreme Court, led by Justice Musa Dattijo Muhammad, after listening to arguments from lawyers to parties, said they would be informed when the judgment was ready.\nBeside lawyers to parties, the Supreme Court also took presentations from five amici curiae, who were invited by the court to assist with their legal opinions in the issues in contention.\nThey are Adegboyega Awomola (SAN); former President of the Nigeria Bar Association (NBA), Olisa Agbakoba (SAN); Sebastine Hon (SAN); Mahmud Magaji (SAN) and Musibau Adetunbi (SAN).\nAn amicus curiae is someone who assists the court by furnishing information or advice regarding questions of law or fact."
  },
  {
    "headline": "COAS launches three military operations in Enugu",
    "summarized_story": "The Chief of Army staff, Lt. General Faruk Yahaya has flagged off Exercise Golden Dawn military operation for the South East region of Nigeria.\nThe COAS also launched operation ‘Still Water for states within the coastal areas of the South South and South West regions as well as exercise Enduring Peace for North Central and FCT.\nThe military exercises aimed at curbing the rising cases of insecurity across the Southern regions, North Central and FCT.\nThe Chief of Army Staff said the operations were specifically designed to, among other things, curb Insurgency, Kidnapping, armed robbery, anti-cult clashes and recent banditry in the south East that has resulted to killings and burning of government facilitates in the zone."
  },
  {
    "headline": "FOMWAN Tells Nigerian Women to stand up to their responsibilities -",
    "summarized_story": "The National Amirah of FOMWAN, Hajia Rafiah Idowu Sanni stated this in a statement issued in Abuja to mark Nigeria’s 61st Independence anniversary.\nHajia Sanni said the society is experiencing moral, spiritual and intellectual bankruptcy because most women have failed in their divine duty as the first school for their children.\n” Unfortunately, women have abandoned their celestial and domestic duties.\n” We should avoid divisive tendencies and practices capable of throwing us into any form of war.\nOur leaders should see the need for more dialogue on how to move Nigeria forward."
  },
  {
    "headline": "Electricity consumers to experience blackout as Ikeja Electric upgrades equipment -",
    "summarized_story": "Electricity consumers in some parts of Lagos State will have no choice but to endure power outage over the next eight weeks.\nThe power outage, which will run from 8am to 6 pm daily, will begin on October 11.\nThe Chief Technical Officer, Ikeja Electric (IE), Jide Kumapayi, who made this known in Lagos, explained that the reason is to enable the IE carry out an upgrade to the 132KVA conductors from Ogba to Ikeja.\nHe listed areas to be affected to include Oregun axis; Police Training College axis; Anifowoshe; Ojodu; Oba Akran; Magodo; Omole Phase 1 and Oke-Ira, among others."
  },
  {
    "headline": "Nigeria Army Launches New Military Operations in South-East",
    "summarized_story": "Nigeria’s Chief of Army staff Lt. General Faruk Yahaya has flagged off a New military operation in the country’s southeastern region which he says will curb rising cases of insecurity.\nGeneral Yahaya on Monday in Enugu state launched the military operation codename Exercise Golden Dawn.\nHe says the operation will tackle insurgency, kidnapping and rising banditry in the South-East leading to wanton killings and burning of government facilities.\nThe Army Chief also launched operation Still Water for states in the South South and Southwest region as well as exercise Enduring Peace for the North Central and the Federal Capital Territory."
  },
  {
    "headline": "Justin Bieber Announces Limited-Edition ‘Peaches’ Cannabis Line",
    "summarized_story": "Justin Bieber officially enters the cannabis industry with Peaches, a limited-run weed product that comes in a sleek, stylized preroll joint pack.\nBieber’s viral mention of cannabis in the song “Peaches” off of his latest album Justice is the namesake inspiration for this preroll pack.\nTo work with Justin is really consistent with our mission.”Bieber has used his celebrity status to be candid about his mental health journey.\nThe musician offered an intimate portrait of his struggles with mental health on his YouTube Original docuseries Seasons.\n“With Justin’s help shining the spotlight on these important topics, we hope to inspire others to talk more freely about both mental health and cannabis consumption.”"
  },
  {
    "headline": "Zuckerberg Loses $7bn in Hours as Facebook Plunges",
    "summarized_story": "Mark Zuckerberg’s personal wealth has fallen by nearly $7 billion in a few hours, knocking him down a notch on the list of the world’s richest people, after a whistleblower came forward and outages took Facebook’s flagship products offline.\nA selloff sent the social-media giant’s stock plummeting around 5% on Monday, adding to a drop of about 15% since mid-September.\nThe stock slide on Monday sent Zuckerberg’s worth down to $120.9 billion, dropping him below Bill Gates to No.\n5 on the Bloomberg Billionaires Index.\nHe’s lost about $19 billion of wealth since Sept. 13, when he was worth nearly $140 billion, according to the index."
  },
  {
    "headline": "Facebook Blames ‘Faulty Configuration Change’ for Nearly Six-Hour Global Outage",
    "summarized_story": "Facebook Inc blamed a “faulty configuration change” for a nearly six-hour outage on Monday that prevented the company’s 3.5 billion users from accessing its social media and messaging services such as WhatsApp, Instagram and Messenger.\nThe company in a late Monday blog post did not specify who executed the configuration change and whether it was planned.\n“We want to make clear at this time we believe the root cause of this outage was a faulty configuration change,” Facebook said in the blog.\nThe Facebook outage is the largest ever tracked by web monitoring group Downdetector.\nA similar outage at cloud company Akamai Technologies Inc took down multiple websites in July."
  },
  {
    "headline": "Cholera Looms as Refuse Heaps Litter Abuja",
    "summarized_story": "The FCT has one of the nation’s highest cholera incidents for this year due to the poor hygiene in places people dwell.\nVirtually a lane, adjacent the INEC Commissioner’s quarter in the high brow Guzape District has been taken over by pile of refuse.\nIt is also the same situation in the upscale Asokoro, where almost all the streets are littered with refuse dumps.\nAEPB is statutorily in charge of waste management in Asokoro, Maitama and other places that fall within the jurisdiction of Abuja Municipal Area Council (AMAC).\nOne of the waste management contractors, who pleaded anonymity, disclosed that evacuation of refuse has been tardy following delays in payment."
  }
]