[
  {
    "headline": "Over one billion people at risk of hearing loss due to loud music –WHO",
    "summarized_story": "Lara AdejoroOver one billion people aged 12 to 35 years risk losing their hearing due to prolonged and excessive exposure to loud music and other recreational sounds, the World Health Organisation has said.\nThe WHO made the call in a statement issued ahead of the 2022 World Hearing Day, adding that young people are more at risk of hearing loss as a result of loud music because they are more exposed to it.\nShe added: “The risk is intensified as most audio devices, venues and events do not provide safe listening options and contribute to the risk of hearing loss.\nThe UN body noted that while exposure to loud sounds causes temporary hearing loss or tinnitus, prolonged or repeated exposure can lead to permanent hearing damage, resulting in irreversible hearing loss.\nWHO encourages governments to develop and enforce legislation for safe listening and raise awareness of the risks of hearing loss."
  },
  {
    "headline": "Over one billion people at risk of hearing loss due to loud music –WHO",
    "summarized_story": "Lara AdejoroOver one billion people aged 12 to 35 years risk losing their hearing due to prolonged and excessive exposure to loud music and other recreational sounds, the World Health Organisation has said.\nThe WHO made the call in a statement issued ahead of the 2022 World Hearing Day, adding that young people are more at risk of hearing loss as a result of loud music because they are more exposed to it.\nShe added: “The risk is intensified as most audio devices, venues and events do not provide safe listening options and contribute to the risk of hearing loss.\nThe UN body noted that while exposure to loud sounds causes temporary hearing loss or tinnitus, prolonged or repeated exposure can lead to permanent hearing damage, resulting in irreversible hearing loss.\nWHO encourages governments to develop and enforce legislation for safe listening and raise awareness of the risks of hearing loss."
  },
  {
    "headline": "Lassa fever kills two doctors in Oyo, says NMA",
    "summarized_story": "The Nigerian Medical Association, Oyo State branch, says it lost two of its members to Lassa Fever within 72 hours.\nFasunla said: “The NMA announces, with deepest regret and sorrow, the demise of two of her members from Lassa Fever.\n“While we thought that COVID-19 had done its worst, we are now dealing with another onslaught of a Lassa Fever outbreak.\n“Members, especially the frontline doctors and other health workers, must wear appropriate Personal Protective Equipment (PPE) at all times.\n“We appeal to the Oyo State Government to conduct intensive surveillance and sensitisation on Lassa Fever outbreaks in the affected communities as well as across all local government areas in the state."
  },
  {
    "headline": "Lassa fever kills two doctors in Oyo, says NMA",
    "summarized_story": "The Nigerian Medical Association, Oyo State branch, says it lost two of its members to Lassa Fever within 72 hours.\nFasunla said: “The NMA announces, with deepest regret and sorrow, the demise of two of her members from Lassa Fever.\n“While we thought that COVID-19 had done its worst, we are now dealing with another onslaught of a Lassa Fever outbreak.\n“Members, especially the frontline doctors and other health workers, must wear appropriate Personal Protective Equipment (PPE) at all times.\n“We appeal to the Oyo State Government to conduct intensive surveillance and sensitisation on Lassa Fever outbreaks in the affected communities as well as across all local government areas in the state."
  },
  {
    "headline": "Zikel Cosmetics introduces SkinFit collection to the Nigerian market",
    "summarized_story": "By Yemisi SuleimanIndigenous makeup brand, Zikel Cosmetics once again proved its stronghold in the beauty industry, as it introduces its latest collection, named the SkinFit collection.\nBorn out of the need to satisfy the needs of the brand’s high-end consumers, the SkinFit is a collection of 9 revolutionary products in one.\nIt comprises a powder, concealer, foundation, liquid foundation, liquid eyeliner, lip gloss, lip liner, and more.\nTo introduce the new product to the general public, Kelvin Ezike CEO of Zikel Cosmetics .held a launch party, attended by top influencers, brand ambassadors, and Nollywood stars.\nHere are some faces at the event."
  },
  {
    "headline": "Zikel Cosmetics introduces SkinFit collection to the Nigerian market",
    "summarized_story": "By Yemisi SuleimanIndigenous makeup brand, Zikel Cosmetics once again proved its stronghold in the beauty industry, as it introduces its latest collection, named the SkinFit collection.\nBorn out of the need to satisfy the needs of the brand’s high-end consumers, the SkinFit is a collection of 9 revolutionary products in one.\nIt comprises a powder, concealer, foundation, liquid foundation, liquid eyeliner, lip gloss, lip liner, and more.\nTo introduce the new product to the general public, Kelvin Ezike CEO of Zikel Cosmetics .held a launch party, attended by top influencers, brand ambassadors, and Nollywood stars.\nHere are some faces at the event."
  },
  {
    "headline": "Folashade Balogun: Showcasing African Fashion Globally",
    "summarized_story": "Words By – Yemisi SuleimanThe launch of her fashion brand House of SOTA, about six years ago, saw Folashade Balogun boldly stamp her arrival on the Nigerian and international fashion scene.\nLaunched with the aim to promote African clothing globally, House of SOTA designs depicts a rich African cultural heritage, influenced by African and western fashion.\nBefore fashion you were into oil and gas, why did you leave oil and gas for fashion?\nWhat, in your opinion, are some of the ways African fashion designers can be supported so that they can become global businesses?\nAfrican fashion is really out there, and globally people love what we are doing."
  },
  {
    "headline": "Folashade Balogun: Showcasing African Fashion Globally",
    "summarized_story": "Words By – Yemisi SuleimanThe launch of her fashion brand House of SOTA, about six years ago, saw Folashade Balogun boldly stamp her arrival on the Nigerian and international fashion scene.\nLaunched with the aim to promote African clothing globally, House of SOTA designs depicts a rich African cultural heritage, influenced by African and western fashion.\nBefore fashion you were into oil and gas, why did you leave oil and gas for fashion?\nWhat, in your opinion, are some of the ways African fashion designers can be supported so that they can become global businesses?\nAfrican fashion is really out there, and globally people love what we are doing."
  },
  {
    "headline": "Nollywood Celebrities Shipping Steadily",
    "summarized_story": "Still, in the spirit of Valentine, we celebrate some of Nollywood celebrity couples, whose marriages have endured and who, remain an inspiration to the rest of us.\nMercy and Odi OkojieNot many gave Nollywood star actress, Mercy Johnson’s marriage to Prince Odi Okojie a chance, back in 2011.\nOlu and Joke JacobsThis Nollywood power couple has been married for over 30 years, and still going strong.\nYears in the spotlight haven’t come between the Nollywood A-list actress and her pilot husband, with whom she has four children.\nWhile she may be successful in her career, she has equally drawn attention for being one of the celebrities who have proven that a celebrity marriage can last long."
  },
  {
    "headline": "Ukraine war: Why we need to cripple Russian economy – UK’s Truss",
    "summarized_story": "British Foreign Secretary, Liz Truss, has said that the west needs to ensure the Russian economy is crippled so that President Vladimir Putin will not be able to continue his invasion of Ukraine.\n“We need to … degrade the Russian economy,” Truss said.\n“We need to make sure … that the Russian economy is crippled, so it is unable to continue to fund Putin and the war machine.”Meanwhile, the war between Russia and Ukraine began last Thursday.\nThe war enters its eighth day today with huge casualties already recorded.\nPresident Putin had ordered the invasion of Ukraine over disagreement on some political issues."
  },
  {
    "headline": "Akwa Ibom traders, transporters lament excessive taxation",
    "summarized_story": "Market women, business operators as well as transporters in Uyo, the Akwa Ibom State capital, have raised the alarm over what they called ‘persistent and mindless’ taxation by the state government.\nAll tickets in the market are N250 every day apart from the N1500 those people who come for bush market pay.\nEven signage on the building, they will ask you to pay taxation, in my case I said no, you pay when it’s on government open land.\nI’m not afraid of taxation, but let me pay to the right people and to the right source.\nInvestigation revealed that minibus operators pay as much as N500 per day against the usual N200 approved by the Ministry of Transport in Akwa Ibom on all routes."
  },
  {
    "headline": "President Buhari congratulates new Ata Igala on investiture",
    "summarized_story": "President Muhammadu Buhari on Thursday joined the government and people of Kogi State in rejoicing with His Royal Majesty, Matthew Alaji Opaluwa Oguche Akpa, on his investiture as Ata Igala.\nIn a statement by his spokesman, Femi Adesina, the president expressed optimism that the paramount ruler would bring a wealth of experience to the throne of his fathers.\nThe statement reads, “President Buhari felicitates with the Kogi State Traditional Council, kingmakers, sons and daughters of Igala nation on the historic event, which further highlights the rich culture and tradition of the people.\n“As His Royal Majesty ascends the throne, the President urges dedication to the growth and well being of his people, and support for the government in promoting peace, unity and progress, especially in civic responsibilities.\n“President Buhari prays that Almighty God will guide the royal father in the discharge of his duties, particularly in encouraging strong moral values and respect among the youth.”"
  },
  {
    "headline": "Russia gets more support in war against Ukraine",
    "summarized_story": "Russia is now banking on the support of a small group of countries in the West such as Cuba, Nicaragua and Venezuela.\nCuba, Nicaragua, El Salvador and Bolivia joined several dozen other countries in abstaining during a vote to condemn Russia’s invasion of Ukraine.\nThe votes also included the demand for Moscow to withdraw its troops “immediately, completely and unconditionally,” from Ukraine.\nCuba and Nicaragua are long-time allies of Russia, with the bond between Cuba and Russia going back decades.\nFor El Salvador, President Nayib Bukele was extremely vocal in the days leading up to Russia’s invasion, mocking US assertions that an invasion was imminent."
  },
  {
    "headline": "Timothy Adegoke: Heavy security as Rahman Adedoyin, others appear in court",
    "summarized_story": "There was heavy security presence at the entrance to the premises of the Osun State High Court, Oke-Fia, on Thursday morning as Rahman Adedoyin and six others arrested in connection with the death of Timothy Adegoke, a postgraduate student of the Obafemi Awolowo University, Ile-Ife, appeared before the court.\nThe defendants were due to appear at Court 1, where Osun State Chief Judge, Adepele Ojo, would preside over the matter.\nDAILY POST observed that a red-coloured Armoured Personnel Carrier (APC) and several police patrol vans were strategically placed at the entrance to the court premises.\nAlso, armed to the teeth security personnel and some plain-clothed security men, suspected to be operatives of the Department of State Services (DSS) were on the ground to forestall any unforeseen circumstances.\nAdegoke, an MBA student, died under suspicious circumstances in Hilton Hotel, Ile-Ife, Osun State."
  },
  {
    "headline": "#EndSARS panel subpoenas Inspector, four top policemen",
    "summarized_story": "Paul Odey of Intelligence Response Team (IRT), Special Tactical Squad, Abuja, to appear before it to defend himself on allegations against him.\nOther respondents in the matter are: Officer Commanding (OC), IRT, Tactical Squad, Abuja, OC Defunct SARS, Abuja, Commissioner of Police FCT and Inspector-General of police.\n“I want the panel to help me ask the Inspector to produce my brother and pay compensation of N500 million.\nHer counsel, Mr Ifeanyi Agu, then told the panel that he had closed his case.\nThe police counsel, Mr Kenneth Ogbuchuwa, told the panel that they would send a signal to the respondents before the next adjourned date."
  },
  {
    "headline": "Three lessons for Africa from the Ukraine-Russia crisis",
    "summarized_story": "The three lessons for Africa from the Ukraine-Russia crisis are domiciled in the diplomatic, security and strategic competition of the United States and Russia in Ukraine.\nFirst, Africa realises that diplomacy is an inconvenient barrier to the unilateralism of major powers.\nWhat the Ukrainian crisis has shown Africa is that Russia still has designs of re-establishing its colonial-style domination of its former republics like Ukraine.\nIn Ukraine, Africa also sees there is a limit to the expansion of American power.\nLast, in the strategic realm, Russia’s actions in Ukraine illustrate to Africa that major power competition results in weak nations suffering."
  },
  {
    "headline": "Fuel scarcity: NNPC promises to deliver 1.7b litres stock",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Limited said that it would deliver over 1.7 billion litres of PMS on marine and on land as the fuel scarcity persists across the nation.\nIt also said that it had no plans to adjust the current price of PMS in the market.\nThe GMD noted that the current fuel queues at the filling station were down to panic buying.\n“NNPC is further intensifying efforts to resolve distribution hitches being experienced in some parts of the country due to logistics issues.\nWe have engaged depot operators to load product round the clock to accelerate the restoration of normal distribution."
  },
  {
    "headline": "Ukraine: Air Peace deploys plane to evacuate stranded Nigerians",
    "summarized_story": "Air Peace said on Thursday that it has deployed its aircraft to evacuate Nigerians stranded in Europe as a result of the invasion of Ukraine by Russia.\nSpokesman of the carrier, Stanley Olisa, said the deployment of its plane is the first batch of Nigerians to be evacuated since the war broke out.\nThe aircraft, he said departed Nigeria at 2:20 am on Thursday, for Warsaw, Poland.\nThe Federal Government engaged Air Peace and another airline to evacuate over 2,000 Nigerian nationals from neighbouring countries such as Poland, Romania, Hungary and Slovakia fleeing the war in Ukraine following the Russian invasion."
  },
  {
    "headline": "Why Nigerian professionals are better than American counterparts – Don",
    "summarized_story": "Why Nigerian professionals are better than American counterparts – DonA U.S. -based historian and professor of African Studies, Apollos Nwauwa says Nigerian professionals are highly valued because they have been tested to be as good if not better than their American counterparts.\n“There is no single hospital in the U.S. that does not have a Nigerian in its service,’’ he said.\n“There is a saying that there is hardly any major university in the U.S. that does not have a Nigerian professor in its faculty.\n“Indeed, often overlooked are those in the administrative cadre of the educational system in the U.S.’’Nwauwa, who also is the Chairman, Nigerian Diaspora Movement (NDM), told NAN that he strides made by Nigerian professionals were hardly surprising.\nThe Black History Month is an opportunity to showcase the rich cultural heritage, successes and challenges of African Americans."
  },
  {
    "headline": "Russia-Ukraine war: Air Peace has departed Nigeria for Poland",
    "summarized_story": "By Chinelo ObogoAir Peace has said the aircraft deployed to evacuate Nigerians who are stranded in Europe as a result of the invasion of Ukraine departed Nigeria at 2:20am Thursday, March 3, 2022, for Warsaw, Poland.\nRegular individuals can earn as low as $300 daily Find out how it works.\n“We’ve deployed our aircraft to evacuate Nigerians who are stranded in Europe as a result of the invasion of Ukraine by Russia.\nThis is the first batch of Nigerians to be evacuated since the war broke out.\nThe aircraft departed Nigeria at 2:20am today, Thursday, March 3, 2022, for Warsaw, Poland,” the airline said."
  },
  {
    "headline": "JUST IN: FG approves the extradition of Kyari to US",
    "summarized_story": "The Federal Government has approved the request by the United States for the extradition of suspended Deputy Commissioner of Police (DCP) Abba Kyari.\nA grand jury, last April 29, filed an indictment against Kyari with the approval of the U.S. District Court for the Central District of California.\nMalami said he was also satisfied that Kyari has been accused of the offence for which his surrender is sought.\n“Kyari is wanted to stand trial in the United States for conspiracy to commit wire fraud and money laundering, and identity theft.\n“Kyari is the subject of an indictment in case Number 2:21-cr-00203 (also referred to as 2:21-MJ-00760 and 2:21-CR-00203-RGK), filed April 29, 2021, in the United States District Court for the Central District of California.”"
  },
  {
    "headline": "Buhari approves $8.5m to evacuate 5,000 Nigerians from Ukraine",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has approved $8.5 million for immediate evacuation of at least 5,000 Nigerians that fled the Russia-Ukrainian war to Poland, Romania, Hungary and Slovakia.\nThose to be evacuated include 940 from Romania, 150 from Slovakia and 350 from Poland who have registered for evacuation.\nThey know the rules about civilians that are caught up in situations such as this.\nWe want to assume they will respect international laws and ensure that no harm comes to them.\n“Don’t forget that even our missions in Ukraine has had to be evacuated."
  },
  {
    "headline": "ASUU: NANS blocks major roads in Ondo",
    "summarized_story": "Former student union president of the Federal University of Technology, Akure, Esedere Abraham, said the protest would continue until ASUU calls off the strike.\nHe said students should not be made to suffer for any problem between ASUU and the Federal Government.\nNANS Vice Chairman, Ondo State chapter, Shittu Folarin, said the students wanted to ensure this would be the last action by ASUU.\nThe joint committee has ASUU, the National Universities Commission, and the National Information Technology Development Agency as members.\nEarlier, the President of ASUU, Emmanuel Osodeke, said members, students and Nigerian people want to see an action from the government."
  },
  {
    "headline": "Women vow to occupy NASS until gender bills are reconsidered",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaNigerian women have threatened to occupy the National Assembly until all gender bills in the constitution amendment exercise are reconsidered.\nShe said Nigerian women would also use the #NigerianWomenOccupyNASS; #BreakPoliticalBias and #BreakConstitutionBias to push the demands on social media.\nThe proposed gender bills in the 5th Constitution Alteration Bills that were all rejected are Bills targeted at addressing the current gender imbalance across the legislative arm of governments across the country whilst reducing the under-representation of women in political office.\n“Nigerian women therefore demand that all gender bills be reconsidered.\nWe call on the National Assembly to re-present these Bills as a matter of urgency and ensure that they are passed.”"
  },
  {
    "headline": "Breaking: FG Commences Extradition Proceedings against DCP Abba Kyari",
    "summarized_story": "Alex Enumah in AbujaThe federal government has commenced move that would pave the way for the extradition of the suspended Deputy Commissioner of Police (DCP), Abba Kyari, to answer to fraud allegations in the United States of America.\nSpeaking on the extradition application, the Minister said it was “for the surrender of Abba Kyari, who is a subject in a superceding three counts indictment”.\nMalami said he was also satisfied that Kyari had been accused of the offence for which his surrender was sought.\nIn April 2021, a jury filed an indictment against Kyari with the approval of the US District Court and demanded Kyari stand trial for conspiracy to commit wire fraud, money laundering and identity theft.\n“Kyari is wanted to stand trial in the United States for conspiracy to commit wire fraud and money laundering, and identity theft."
  },
  {
    "headline": "Ukraine War: Air Peace Deploys Aircraft to Evacuate Nigerians",
    "summarized_story": "Nigeria’s leading airline, Air Peace, has deployed its aircraft to evacuate Nigerians who are stranded in Europe as a result of the invasion of Ukraine by Russia.\nThis is the first batch of Nigerians to be evacuated since the war broke out.\nThe aircraft departed Nigeria at 2:20am today (Thursday) for Warsaw, Poland.\nIt would be recalled that the Federal Government engaged Air Peace and another airline to evacuate over 2000 Nigerian nationals from neighbouring countries such as Poland, Romania, Hungary and Slovakia.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Oil Price Surges Above $113 as OPEC Keeps Supply Unchanged",
    "summarized_story": "In January 2022 alone, the Nigerian National Petroleum Company (NNPC) Limited claimed that it expended N210.38 billion on petrol subsidy.\nFurthermore, due to the challenge, last month, the oil company failed to remit any money to the federation account, a development that would definitely hamper the ability of sub-nationals to meet their financial obligations.\nPresident Muhammadu Buhari recently asked the National Assembly to approve the N2.557 trillion budget for petrol subsidy in 2022.\nOPEC alone accounts for around 40 per cent of the world’s oil supply.\nHe urged motorists to trust the NNPC that it has adequate supply in-country, stating that the panic buying remains the problem."
  },
  {
    "headline": "Convention: APC Set to Roll, Appoints Abdulrazaq Zoning Committee Chairman",
    "summarized_story": "The latest move was the constitution of an eight-member committee on the zoning of party offices, headed by Kwara State Governor Abdulrahaman AbdulRazaq.\nNational Secretary of the Caretaker/Extraordinary Convention Planning Committee (CECPC), Senator John Akpanudoedehe, disclosed this in a statement, yesterday.\nBenjamin Issa Ezekiel, said one of the chairmanship aspirants from the North-central geopolitical zone, Malam Saliu Mustapha, remained the state’s “unity candidate” for the office of APC chairman.\nI am in the race for the national chairmanship position of our party APC, because of my strength of character, capacity and competence.\nThe 49-year-old Mustapha is said to be the youngest of the aspirants vying for the position of the APC national chairman, with experience as former National Deputy Chairman of the defunct Congress for Progressives Change."
  },
  {
    "headline": "Lawan Asks Buhari to Forward PIA Amendment Bill to National Assembly",
    "summarized_story": "•Panel gets one week to amend 2022 budgetSunday AborisadePresident of the Senate, Dr. Ahmad Lawan, yesterday urged President Muhammadu Buhari to transmit a bill to the National Assembly to amend the Petroleum Industry Act (PIA).\nLawan stated this before he referred the president’s request for the amendment of the 2022 Appropriation Act to the Committee on Appropriation, after the bill scaled Second Reading.\nLawan mandated the relevant Oil and Gas Committees of the National Assembly to engage the executive on a bill to amend the PIA to align with the president’s request.\nBuhari had accused members of the National Assembly of inserting their projects in the 2022 budget at the detriment of those initiated by the executive arm of government.\nHe had, therefore, asked the federal lawmakers to amend the 2022 Appropriation Act passed by the National Assembly in December 2021."
  },
  {
    "headline": "BREAKING: Nigerian Government Agrees To Extradite Disgraced 'Super Cop', Abba Kyari To The US",
    "summarized_story": "Nigeria has approved the request by the United States government for the extradition of the disgraced Deputy Commissioner of Police (DCP), Abba Kyari.\nA grand jury in April 2021 filed an indictment against Kyari with the approval of the U.S. District Court for the Central District of California.\nIt is “for the surrender of Abba Alhaji Kyari, who is a subject in a superseding three counts indictment”.\n“Kyari is wanted to stand trial in the United States for conspiracy to commit wire fraud and money laundering, and identity theft.\nThe court has scheduled a hearing in Kyari’s application for March 8."
  },
  {
    "headline": "BREAKING: Nigerian Government Agrees To Extradite Disgraced 'Super Cop', Abba Kyari To The US",
    "summarized_story": "Nigeria has approved the request by the United States government for the extradition of the disgraced Deputy Commissioner of Police (DCP), Abba Kyari.\nA grand jury in April 2021 filed an indictment against Kyari with the approval of the U.S. District Court for the Central District of California.\nIt is “for the surrender of Abba Alhaji Kyari, who is a subject in a superseding three counts indictment”.\n“Kyari is wanted to stand trial in the United States for conspiracy to commit wire fraud and money laundering, and identity theft.\nThe court has scheduled a hearing in Kyari’s application for March 8."
  },
  {
    "headline": "EXCLUSIVE: Female MTN Nigeria Employees Accuse Chief Sales & Distribution Officer, Adekunle Adebiyi, Of Sexual Harassment, Knock CEO, Toriola",
    "summarized_story": "Some female employees of telecommunications company, MTN Nigeria, have accused the company's Chief Sales and Distribution Officer, Adekunle Adebiyi, of sexual harassment and other gross misconducts.\nMTN Nigeria BuildingThey also accused him of threatening such women with sacking if they fail to give in to his demands.\nWe wish men like Adekunle Adebiyi will not destroy MTN Nigeria.\n“Your sexual harassment policy is not protecting levels 1, 2 or 3 or young girls.\n“On the sexual harassment complaints raised; MTN is committed to providing a safe environment for all its employees free from discrimination on any ground and harassment at work, including sexual harassment."
  },
  {
    "headline": "EXCLUSIVE: Female MTN Nigeria Employees Accuse Chief Sales & Distribution Officer, Adekunle Adebiyi, Of Sexual Harassment, Knock CEO, Toriola",
    "summarized_story": "Some female employees of telecommunications company, MTN Nigeria, have accused the company's Chief Sales and Distribution Officer, Adekunle Adebiyi, of sexual harassment and other gross misconducts.\nMTN Nigeria BuildingThey also accused him of threatening such women with sacking if they fail to give in to his demands.\nWe wish men like Adekunle Adebiyi will not destroy MTN Nigeria.\n“Your sexual harassment policy is not protecting levels 1, 2 or 3 or young girls.\n“On the sexual harassment complaints raised; MTN is committed to providing a safe environment for all its employees free from discrimination on any ground and harassment at work, including sexual harassment."
  },
  {
    "headline": "Boko Haram Terrorists Flee As Nigerian Soldiers Set Camps Ablaze In Borno",
    "summarized_story": "Troops of Operation Desert Sanity have destroyed several camps belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād Gwagwari, in the Damboa Local Government Area of Borno State.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nIn 2021, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 100,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "Lassa fever killed two doctors in Oyo within 72 hours, says NMA",
    "summarized_story": "The Nigerian Medical Association (NMA), Oyo state branch, says it lost two of its members to Lassa fever within 72 hours.\n“The NMA announces, with deepest regret and sorrow, the demise of two of her members from Lassa Fever,” the statement reads.\nAdvertisement“While we thought that COVID-19 had done its worst, we are now dealing with another onslaught of a Lassa fever outbreak.\n“We appeal to the Oyo State Government to conduct intensive surveillance and sensitisation on Lassa Fever outbreaks in the affected communities as well as across all local government areas in the state.\nMay their gentle soul rest in peace.”According to the Nigeria Centre for Disease Control (NCDC), Nigeria recorded 450 cases of Lassa fever and 86 deaths as of February 20."
  },
  {
    "headline": "Lassa fever killed two doctors in Oyo within 72 hours, says NMA",
    "summarized_story": "The Nigerian Medical Association (NMA), Oyo state branch, says it lost two of its members to Lassa fever within 72 hours.\n“The NMA announces, with deepest regret and sorrow, the demise of two of her members from Lassa Fever,” the statement reads.\nAdvertisement“While we thought that COVID-19 had done its worst, we are now dealing with another onslaught of a Lassa fever outbreak.\n“We appeal to the Oyo State Government to conduct intensive surveillance and sensitisation on Lassa Fever outbreaks in the affected communities as well as across all local government areas in the state.\nMay their gentle soul rest in peace.”According to the Nigeria Centre for Disease Control (NCDC), Nigeria recorded 450 cases of Lassa fever and 86 deaths as of February 20."
  },
  {
    "headline": "INSIGHT: Why Ukraine is a popular destination among Nigerians emigrating",
    "summarized_story": "The war has also impacted the lives of over 12,000 Nigerians living in the country.\nOthers played the devil’s advocate and blamed the Nigerians for leaving their father land for such a place.\nBelow are the top reasons why Ukraine is a popular destination among Nigerians emigrating.\nCHEAP BUT QUALITY EDUCATIONAdvertisementNigerians, alongside citizens of other African and Asian countries, emigrate to Ukraine in droves for educational purposes.\nAdvertisementRemuneration is also a vital factor in the decision of Nigerians emigrating to Ukraine."
  },
  {
    "headline": "INSIGHT: Why Ukraine is a popular destination among Nigerians emigrating",
    "summarized_story": "The war has also impacted the lives of over 12,000 Nigerians living in the country.\nOthers played the devil’s advocate and blamed the Nigerians for leaving their father land for such a place.\nBelow are the top reasons why Ukraine is a popular destination among Nigerians emigrating.\nCHEAP BUT QUALITY EDUCATIONAdvertisementNigerians, alongside citizens of other African and Asian countries, emigrate to Ukraine in droves for educational purposes.\nAdvertisementRemuneration is also a vital factor in the decision of Nigerians emigrating to Ukraine."
  },
  {
    "headline": "FG approves US' request for DCP Abba Kyari’s extradition",
    "summarized_story": "The federal government has approved the process for the extradition of Abba Kyari, suspended deputy commissioner of police (DCP), to the United States.\nIn July 2021, the Federal Bureau of Investigation (FBI) indicted Kyari in a $1.1 million fraud involving Hushpuppi, self-confessed international fraudster.\nOn Wednesday, Malami filed an application before the chief judge of the federal high court in Abuja for Kyari’s extradition.\nAdvertisementThe AGF said the application followed a request by the diplomatic representative of the US embassy in Abuja.\n”It is for the surrender of Abba Alhaji Kyari, who is a subject in a superseding three counts indictment,” the AGF stated."
  },
  {
    "headline": "Amid Russian invasion of Ukraine, social media accounts were hacked to share Russian propaganda",
    "summarized_story": "But we are an internet world, so the war has also gone to social media, with each side trying to control the narrative online.\nA huge propaganda war is ongoing and social media has been crucial for sharing updates, and misinformation, about the war.\nOn February 26, social media accounts linked to Buffer, the social media scheduling tool, were hacked to spread support for Russia’s invasion of Ukraine under the hashtag #SupportRussia.\nLike most propaganda and disinformation campaigns, the accounts shared the same tweet, with the same social media asset, and at the same time.\nWith a no-holds-barred propaganda and disinformation campaign spreading on social media, it is imperative that users take digital security measures more seriously and are careful about information they consume on social media, especially at this time."
  },
  {
    "headline": "Even inheritance has a tech solution—so meet Cova",
    "summarized_story": "Do they go to your family or will they become unclaimed assets?\nIn South Africa, unclaimed assets are valued at R45 billion (~$3 billion).\nEvery nation in the world has its own reservoir of unclaimed assets.\nHow Cova worksCova is built to organise users’ assets in one place and transfer ownership to users’ listed beneficiaries in the event of their death.\nCova supports two types of assets: digital assets like bank accounts and crypto wallets; and physical assets like landed property."
  },
  {
    "headline": "Inside HUB2's digital stack for insurance providers in francophone Africa",
    "summarized_story": "A digital backbone for insurance servicesHUB2 is primarily a payments aggregator enabling interoperability between mobile money wallets within the same country.\nThe startup’s main customers come from the insurance sector.\nIn addition, digital financial services, particularly mobile money (MoMo) and agency banking are widely used by the public in francophone African markets.\nThe insurance sector in francophone Africa is a largely traditional one where paper certificates are common and delivered three to four weeks after subscription.\nHe blames this on the fact that the insurance sector is not one where investors can get the most margin."
  },
  {
    "headline": "Why did Mercury restrict tens of African startups’ accounts?",
    "summarized_story": "On Tuesday, many African entrepreneurs and tech startup founders took to twitter to express their displeasure of how Mercury, a San Francisco-based digital bank for startups, blocked their accounts without prior communication.\n— Polysaccharide Patriach (@bigbrutha_) March 1, 2022Bank Mercury blocked a bunch of African tech startups… we have work to do.\nI have a list of over 20+ African startups whose bank accounts were mass-blocked at around the same time by @BankMercury yesterday.\nhttps://t.co/vr21Pd9nq4 — Moe is mourning her crocs (@Mochievous) March 1, 2022Mercury restricted a large number of African startups’ bank accounts enmasse due to “unusual activity”.\nMany African founders and ecosystem players have come out to suggest a boycott and others have suggested a home-built alternative that only either serves African founders or black owned businesses."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, There are two types of people in the world right now: those following the Ukraine-Russian tensions..."
  },
  {
    "headline": "Inside NIPOST’s latest financial inclusion play: Agency banking and fingerprint authentication",
    "summarized_story": "In January 2022, NIPOST unveiled its new agency banking platform at a ceremony in Nigeria’s capital, Abuja.\nAdvertisementAccording to Isa Pantami, Minister of Communications and Digital Economy, the agency banking platform would follow the Universal Postal Union’s (UPU) standards on financial inclusion.\nBy UPU standards, NIPOST’s agency banking platform should provide essential services like savings, payments, money transfers, insurance, and credit.\nVisiting other nationsGlobally, postal services are no strangers to providing financial services.\nBy 2020, the postal agency was to have been unbundled into six subsidiaries: NIPOST Banking and Insurance Company; NIPOST Property and Development Company; NIPOST Transport and Logistics Services Company; NIPOST E-government Services Company; and NIPOST E-commerce Services Company."
  },
  {
    "headline": "Built in response to COVID-19, MyServiceAgent now helps businesses improve customer experience with AI",
    "summarized_story": "Share this article:You’ll be hard-pressed to find anyone who disagrees that most Nigerian companies provide terrible customer service.\nIn some cases, the customer service agents fail to respond accurately.\nMyServiceAgent is a voice-based customer engagement technology platform powered by artificial intelligence that helps businesses solve customer experience challenges.\nProviding convenient and effective customer service solutionsCustomer service is a crucial aspect of a business’ operation, and poor customer service can lead to high churn.\nHe also hopes that MyServiceAgent is a leading provider of cutting-edge customer service solutions globally."
  },
  {
    "headline": "Why is Africa’s largest telco entering the metaverse?",
    "summarized_story": "Share this article:MTN has joined the league of companies such as Google, Microsoft, and Shopify betting big on the metaverse with the purchase of 144 plots of land in South Africa’s first metaverse, Africarare.\nThe land is situated in Ubuntuland, a virtual land modelled after the African landscape in Africarare.\nThe launch featured the works of South African contemporary artist Norman Catherine as non-fungible tokens (NFTs) in the Milla Gallery located in Ubuntuland.\nSouth African entrepreneur Mic Mann who co-founded the metaverse, told Newzroom Afrika — a South African 24-hour digital satellite television news channel — that he and his team had been working on the metaverse for six months before it launched.\nWith virtual meetings and art and fashion shows taking place in Ubuntuland, one wonders why Africa’s largest telecom company is entering the space."
  },
  {
    "headline": "Seplat/ExxonMobil deal puts new oil law to test",
    "summarized_story": "The $1.3bn planned deal between Seplat Energy Plc, a major energy company in Nigeria, and US-based ExxonMobil looks set to put the Petroleum Industry Act, which seeks to attract new oil and gas investments, to the test.\nBusinessDay gathered that Seplat Energy and ExxonMobil had submitted their application for ministerial consent for the deal.\nThe Nigerian National Petroleum Company Limited (NNPC) has listed conditions that must be met before the deal sails through.\nOn the implications of the deal, Wood Mackenzie analysts said if completed, it would be transformational for Seplat Energy.\n“Crucially, the deal diversifies its operations into shallow water, which is largely devoid of the thefts afflicting its onshore operations."
  },
  {
    "headline": "Petrol marketers lament supply shortage as queues worsen (photos)",
    "summarized_story": "As fuel scarcity continued to hit Nigerians and businesses hard on Wednesday, marketers under the aegis of the Independent Petroleum Marketers Association of Nigeria (IPMAN) have lamented the inability to get petrol supply from depot owners.\nThis situation triggered massive fuel queues that are yet to abate after almost a month.\n“We cannot rule out this having an impact,” said Clement Isong, the executive director of the Major Oil Marketers Association of Nigeria, told BusinessDay.\nMarket survey around petrol stations in Lagos revealed that five litres of petrol at the black market was sold for between N2,000 to N3,000 on Wednesday.\nThe company cited increased operating costs incurred by drivers on the app as the reason for the price review, but many have speculated that it was inspired by the fuel scarcity."
  },
  {
    "headline": "Ukraine-Russia crisis: 2,090 Nigerians expected as evacuation begins today",
    "summarized_story": "At least 2,090 Nigerians are expected to arrive in Nigeria as the federal government commenced the evacuation of the first batch of its citizens fleeing Ukraine to neighbouring countries today, following the conflict between the country and Russia.\n“So far, we have the following records of evacuees received by the Nigerian embassies at Hungary: 650 persons, Poland: 350 persons, Romania: 940 persons and Slovakia: 150 persons.\n“The capacity and routes of the airlines are as follows: Max Air to Romania 560 persons, Air Peace to Poland 365 persons and Air Peace to Hungary 360 persons.\nOnce again, we assure Nigerians that we are working round the clock to see that our citizens are brought back home safely.\n“Upon arriving in Nigeria, passengers will be directed by the Port Health Services to designated government laboratories for COVID-19 tests."
  },
  {
    "headline": "Senate Approves Financial Autonomy for state legislatures, judiciary and LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian Senate has approved financial autonomy for state legislatures, judiciary and local governments in the country.\nThe approval came on Tuesday during voting on the report of the Senate Committee on the Review of the 1999 Constitution (Fifth Alteration) Bills, 2022.\nOut of a total number of 88 Senators registered to vote on the bill, 34 voted in support, and 53 against the bill.\nAlso rejected were bills to override Presidential veto in Constitution Alteration; and to override Presidential veto in respect of ordinary money bills.\nThe bill on Procedure for Overriding Presidential Veto in Constitutional Alteration seeks to provide for the procedure for passing a constitution alteration bill where the President withholds assent."
  },
  {
    "headline": "Senate Pass Bill to Summon President and Govenor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Senate, on Tuesday, passed a bill to empower the National Assembly and State Assemblies to summon the President and State Governors to answer questions bothering on security or any other issues on which the National and State Houses of Assembly have powers to make laws.\nThe bill seeks alteration to Section 67 of the Principal Act by inserting after subsection (3), a new subsection (4).\nThe chamber also approved a bill to include Presiding Officers on the membership of the National Security Council.\nThe bill seeks to alter Section 129 of the Principal Act to insert after subsection (2), a new subsection (3).\nThe chamber, however, turned down a bill to provide for more seats for women in the National and State Houses of Assembly."
  },
  {
    "headline": "Obaseki faults sharing formula for FG’s conditional cash transfer programme, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has faulted the sharing formula for the Federal Government’s conditional cash transfer programme and the distribution of other social amenities.\nHe said this when he received the Executive Chairman of the Federal Character Commission, on a courtesy visit to the Government House, in Benin City, Edo State.\nObaseki said: “In terms of fair distribution of social services, the Commission has not done much.\nI urge the commission never to allow what happened during the sharing of conditional cash transfer from the Federal Government to happen again.\n“Nigerians are not happy and are angry with the way the conditional cash transfer and sharing of social and economic amenities were handled."
  },
  {
    "headline": "Obaseki harps on transparency, accountability in public procurement amid dwindling resources – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…to partner UNDP to create more jobs for Edo youthsThe Edo State Governor, Mr. Godwin Obaseki, has called for transparency and accountability in the use of public resources amid the decline in government revenue.\nObaseki gave the charge when he received a delegation of the United Nations Development Programme (UNDP), Accountability Lab and Open Contracting Partnership, at the Government House, in Benin City, the Edo State capital.\n“Transparency and accountability are key and core to our administration.\nIt is important that we show to our people how we have spent the money we got from them.\nWe need to domesticate the Nigeria Jubilee Fellows Programmes (NJFP) and need the help of UNDP."
  },
  {
    "headline": "Buhari ya lula Kenya, zai zarce ganin likitan sa a Landan",
    "summarized_story": ""
  },
  {
    "headline": "ZARGIN ZAMBAR NAIRA BILIYAN 1.2: Kotu ta ba Shamsuddeen ɗan Gwamnan Bauchi damar ceton kan sa",
    "summarized_story": "Babbar Kotun Abuja ta aza ranar 28 Ga Afrilu cewa Shamsuddeen Bala ɗan Gwamnan Bauchi zai fara kare kan sa daga zargin ɗirka zambar kuɗi Naira biliyan 1.2 da EFCC ke yi masa a kotu.\nHukumar EFCC ce ta maka shi kotu inda ta rataya masa carbi zarge-zarge guda 20 na zamba, karkatar da kuɗaɗe, fojare da kuma laifin ƙin bayyana dukiyar sa.\nMai Shari’a ya ce EFCC ta kasa gabatar da ƙwararan hujjojin cewa Shamsuddeen Bala ya yi waɗancan laifuka 11.\nMai Shari’a ya yi watsi da sauran canje-canje 11, waɗanda ke da nasaba da karkatar da kuɗaɗe, saboda EFCC ta kasa gabatar da ƙwararan hujjoji.\nMai Shari’a ya ce hujjojin da EFCC ta gabatar ba su kama mutanen da laifin karkatar da kuɗaɗe ba, a cikin tuhume-tuhume 11 da aka yi masu."
  },
  {
    "headline": "Rundunar Ƴan sandan Kaduna ta tabbatar ta fashewar bam a Kabala West",
    "summarized_story": ""
  },
  {
    "headline": "‘Yan sanda sun ceto mutum 7 da aka yi garkuwa da su a Zamfara",
    "summarized_story": ""
  },
  {
    "headline": "Kotu ta daure mutumin da aka kama yana duldila ruwan sabulu a cikin ruwan da ake kara wa mara lafiya a asibiti",
    "summarized_story": ""
  },
  {
    "headline": "NNPC says it has 1.7 billion litres, insists no need for panic buying",
    "summarized_story": "The Nigeria National Petroleum Corporation Limited (NNPC) says it has enough fuel in stock and that there is no need for panic buying amid persistent queues at filling stations.\n“Currently, we have over 1.7 billion litres of PMS in our hands both in marine and on land.\n“This will ensure that scarcity created by panic buying will now be freed so that normalcy will return to filling stations.\n“Typically in situations like this, people go to the fuel stations and buy in excess of what they need and this is what additional supply will resolve.\nHe, however, apologised for the pains Nigerians were experiencing at fuel stations and appealed to consumers to avoid panic buying and to buy only the quantity they needed at fuel outlets."
  },
  {
    "headline": "PenCom approves merger, acquisition of fund administrators",
    "summarized_story": "The National Pension Commission (PenCom), has approved the request for the merger and acquisition of some operators in the pension industry.\nThe commission said it approved the acquisition of Investment One Pension Managers Limited by Guaranty Trust Holding Company Limited.\nIt also approved the subsequent change of name from Investment One Pension Managers Limited to Guaranty Trust Pension Managers Limited.\nAlso approved is the acquisition of AIICO Pension Managers Limited by FCMB Pensions Limited; and the merger between Tangerine Pensions Limited and APT Pension Funds Managers Limited.\n“The acquisition of AIICO Pension Managers Limited by FCMB Pensions Limited; and the merger between Tangerine Pensions Limited and APT Pension Funds Managers Limited and subsequent change of name of the merged entity to Tangerine APT Pensions Limited.”"
  },
  {
    "headline": "UN General Assembly passes resolution demanding Russia withdrawal from Ukraine",
    "summarized_story": "The UN General Assembly on Wednesday adopted overwhelmingly, a resolution that “demands” Russia “immediately” withdraw from Ukraine, in a powerful rebuke of Moscow’s invasion by a vast majority of the world’s nations.\nThe resolution “deplores” the invasion of Ukraine “in the strongest terms” and condemns President Vladimir Putin’s decision to put his nuclear forces on alert.\n“They have come to deprive Ukraine of the very right to exist,” Ukraine’s ambassador Sergiy Kyslytsya told the Assembly ahead of the vote.\nThe text of the resolution — led by European countries in coordination with Ukraine — has undergone numerous changes in recent days.\nOn the meeting’s sidelines, Washington has taken aim at Russians working at the United Nations, leveling accusations of espionage and demanding expulsions."
  },
  {
    "headline": "Nigerian govt approves Abba Kyari’s extradition to the US",
    "summarized_story": "Nigeria’s federal government has approved a request by the United States to extradite Abba Kyari, the suspended Deputy Commissioner of Police, over his links with international fraudster, Ramon Abbas, alias Hushpuppi.\nMr Kyari was indicted by the FBI last year on allegations of conniving with Abbas to defraud a Qatari businessman of millions of dollars.\nKyari initially denied the charges, but he was subsequently suspended by the police and a police probe panel confirmed his guilt.\nAs the case was underway, Mr Kyari was separately indicted by Nigeria’s anti-narcotics office NDLEA for stealing bags of cocaine.\nMr Malami said Mr Kyari should be extradited to face trial in the U.S. because his case there was solid and not politically or religiously motivated."
  },
  {
    "headline": "Federal Govt Unveils New Approach To Tackle Adult Illiteracy",
    "summarized_story": "The federal government has announced a new strategy in the war to eliminate illiteracy and its accompanying malaise among the more than 90 million adult population and about 13 million out-of-school children in the country.\nThe new system, according to Prof. Akpama, will be in addition to existing strategies, namely the Literacy-by-Radio (LBR), the Rural Facilitators’ Scheme (RFS), Each-One-Teach-One and other initiatives, all aimed at facilitating the attainment of the Commission’s mandate of eradicating illiteracy among Nigerians aged 15 years and above.\nThe Executive Secretary, while commending President Muhammadu Buhari and Education Minister, Adamu Adamu, for funding of the Adult and Non-Formal education sector, stated that LEEDS will form the antidote to poverty as it has been empirically proven that mere acquisition of basic and post-literacy skills devoid of economic empowerment tools aggravates poverty with its accompanying deleterious socio-economic consequences.\nIt can be recalled that the federal government recently unveiled a plan to educate about two million non-literate Nigerians annually to enable them uplift their status and enable them contribute to national development.\nADVERTISEMENTThe National Commission for Mass Literacy, Adult and Non-Formal Education was established by Act 17 of June 25, 1990, with a mandate to, among others things, provide basic education to the country’s non-literate adults and youths aged 15 and above through a non-formal approach."
  },
  {
    "headline": "BREAKING: France Orders Citizens To Leave Russia",
    "summarized_story": "France “strongly” asked its citizens on Thursday to leave Russia if their presence there was “not essential” following Moscow’s invasion of Ukraine and the closure of airspace between Russia and the European Union (EU).\n“In the context of the invasion of Ukraine by Russia and following the imposition of international sanctions, we must increase our vigilance,” the foreign ministry wrote on its website.\nAlready on Sunday, Paris had recommended French citizens passing through Russia to leave the country.\nThe invasion of Ukraine by Russia on Thursday, February 24, 2022 sparked global condemnation and elicited varied sanctions imposed on Russia by especially the US, EU, UK and others.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Agbomhere Declares For South-South APC Zonal Secretary",
    "summarized_story": "Blessing Agbomhere, has declared his intention to run for the office of the South-South zonal secretary of the ruling party.\nAgbomhere’s decision to join the race for the zonal position came as a result of the zonal arrangement of the APC.\nADVERTISEMENT“Following, however, the recently reached decision by the leadership of our great party, I wish to communicate to you my decision to run for the South South Zonal Secretary of our party.\nWhile urging APC members not to stop believing in the party, Agbomhere sais his aim was to ensure the growth, development and progress of the South-south APC.\nADVERTISEMENT“I will abide by the tenets of true leadership and nation building, while ensuring the prioritization of the welfare and well-being of all South-south party men and women,” Agbomhere stated."
  },
  {
    "headline": "Water Rates Rise In Enugu Over Fuel Scarcity",
    "summarized_story": "Residents of Enugu State have raised the alarm over the sudden increment in water rates in the state.\nSome of the water vendors, who spoke to our correspondent attributed the increment to the fuel crisis.\nA resident of Enugu, Mr Fabian Cajetan said before the fuel crisis, they were finding it difficult to get water, adding that the situation has worsened with the fuel crisis.\nWhen you ask them, they will tell you that the Pump Price of fuel and fuel crisis are the cause of the problem” he stated.\nMeanwhile, our investigations revealed that the prices of almost all the commodities in the market have increased because of the fuel crisis."
  },
  {
    "headline": "Wanted Suspect Kills Police Officer In Imo",
    "summarized_story": "A criminal suspect, Chinwe Okwuegbunwa, alias Mano has gunned down a policeman, simply identified as Cyprian in Awarra community of Ohaji-Egbema local government area of Imo State.\nEyewitnesses who pleaded anonymity said a team of policemen had come to effect the arrest of Mano over allegation of being a wanted person by the police.\nMano resisted and started dragging the rifle with Cyprian and in the process cocked the gun and shot him.\nADVERTISEMENTSources said villagers, for fear of reprisal attacks struggled with the suspect, overpowered him and handed him over to the Police team for prosecution.\nAlready, villagers have started fleeing the community for fear of attacks from cult members and the Police."
  },
  {
    "headline": "BREAKING: France Asks Citizens To Leave Russia",
    "summarized_story": "Following Moscow’s invasion of Ukraine and the shutdown of airspace between Russia and the European Union, France “strongly” urged its people to leave Russia if their presence was “not vital.”“We must strengthen our vigilance in light of Russia’s invasion of Ukraine and the application of international sanctions,” the foreign ministry declared on its website.\nParis has already advised French citizens going through Russia to leave the country on Sunday.\nDetails shortly…"
  },
  {
    "headline": "BREAKING: Nigerian Government Agrees To Extradite Disgraced ‘Super Cop’, Abba Kyari To The US",
    "summarized_story": "BREAKING: Nigerian Government Agrees To Extradite Disgraced ‘Super Cop’, Abba Kyari To The USNigeria has authorized the US government’s request for the extradition of Abba Kyari, the sacked Deputy Commissioner of Police (DCP).\nIn April 2021, a grand jury indicted Kyari, with the permission of the United States District Court for the Central District of California.\nMalami said he was also satisfied that Kyari has been accused of the offence for which his surrender is sought.\n“Kyari is wanted to stand trial in the United States for conspiracy to commit wire fraud and money laundering, and identity theft.\nThe court has scheduled a hearing in Kyari’s application for March 8."
  },
  {
    "headline": "Viral Video: I Didn’t Ask Police Orderly To Carry My Food – Ex-Envoy",
    "summarized_story": "Former Nigeria’s ambassador to the Republic of Netherlands, Dr Nimota Nihinlola Akanbi, has clarified that the sumptuously stuffed plate of food her police orderly was seen carrying after her food at a buffet in viral video was not hers but the policeman’s.\nIt is, however, unclear if police regulations allow a policeman on duty to be so free at the buffet while on detail assignment.\nShe said that her police orderly was carrying his own food at a community engagement they both attended in Ilorin, Kwara State.\n“The truth is that I allowed him ( police orderly) to pick his food.\nThe former envoy urged Nigerians to disregard the viral video, saying that it might be the handiwork of her detractors."
  },
  {
    "headline": "Tambuwal: Making Giant Strides In The Seat of The Caliphate",
    "summarized_story": "Last year, the government inaugurated, launched and completed the multi-billion Naira Sokoto State Advanced Medical Diagnostic Centre in Farufaru.\nThe previous year, in late 2020, work commenced on the 1,060 bed space Sokoto State University Teaching Hospital project.\nFiscal transparency, accountability and sustainability has been a cardinal focus of the Tambuwal Administration.\nIn the “States Ease of Doing Business Survey Results” by PEBEC in collaboration with KPMG Nigeria, Sokoto State scored 6.88.\nIt is therefore not surprising that Aminu Waziri Tambuwal’s outstanding strides in the development of Sokoto State have earned him accolades and awards from many quarters."
  },
  {
    "headline": "FirstBank: Championing SMEs’ growth through loan products initiative",
    "summarized_story": "First Bank of Nigeria Limited is at the forefront of developing different loan products that suit the needs and growths of SMEs in the country.\nSome of them are World Bank SME loan scheme, African Development Bank Export Stimulation Loan scheme; CBN Rediscounting and Re-financing Facility, National Economic Reconstruction Fund.\nGovernment’s efforts on SMEs growthIn Nigeria, the current administration and financial institutions are doing everything possible to ensure sustainable growth of the SMEs in the country.\nSome of the funds can be used for commercial mortgage finance, petroleum distributorship finance, operational vehicle finance, contract finance among others.\nIt was put in place to support business growth and expansion by giving beneficiaries the opportunity of purchasing the vehicle with ease."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigress to face France, Australia, 3 others in 2022 FIBA women’s World Cup",
    "summarized_story": "Nigeria’s D’Tigress have been drawn in group B with France, Australia, Canada, Japan and Serbia ahead of 2022 FIBA Women’s World Cup campaign in Sydney, Australia in September.\nThe Nigerian women basketball side defeated France and Mali to qualify for the prestigious global dunking and slamming game.\nDetails loading…"
  },
  {
    "headline": "[Breaking] Abba Kyari: At last, FG begins extradition process",
    "summarized_story": "The federal government has officially kicked off the process of extradition of suspended Deputy Commissioner of Police DCP Abba Kyari to the United States of America.\nThis followed request by US authorities for Kyari to be extradited over $1.1million wire fraud perpetrated by Abass Ramon aka Hushpuppi and four others.\nThe Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), revealed that his extradition process has begun when he filed an application before the Chief Judge of the Federal High Court in Abuja.\nAbba Kyari is currently under the National Drug Law Enforcement Agency (NDLEA) custody.\nDetails loading…"
  },
  {
    "headline": "FG Approves US Request To Extradite Abba Kyari",
    "summarized_story": "Nigeria has approved the request by the United States for the extradition of suspended Deputy Commissioner of Police (DCP) Abba Kyari.\nA grand jury, last April 29, filed an indictment against Kyari with the approval of the U.S. District Court for the Central District of California.\nRELATEDAbba Kyari: PSC Postpones Decision, Insists On New Panel To Conduct Fresh InvestigationHushpuppi: Nigeria Collaborating With US, Extradition Of Abba Kyari Considered – AGFNDLEA Declares Abba Kyari Wanted For Drug TraffickingIt is “for the surrender of Abba Alhaji Kyari, who is a subject in a superseding three counts indictment”.\nMalami said he was also satisfied that Kyari has been accused of the offence for which his surrender is sought.\n“Kyari is wanted to stand trial in the United States for conspiracy to commit wire fraud and money laundering, and identity theft."
  },
  {
    "headline": "Nigeria, 140 Countries Vote Against Russia’s Invasion Of Ukraine, Demand Troops’ Withdrawal",
    "summarized_story": "Nigeria and 140 other nations voted against Russia’s invasion of Ukraine and demanded the immediate withdrawal of troops from the Eastern European country.\nThe decision was reached on Wednesday at the United Nations General Assembly in a powerful rebuke of Moscow’s invasion.\nThe resolution “deplores” the invasion of Ukraine “in the strongest terms” and condemns President Vladimir Putin’s decision to put his nuclear forces on alert.\n“If the United Nations has any purpose, it is to prevent war,” the US ambassador, Linda Thomas-Greenfield, said during her speech on Wednesday.\nOn the meeting’s sidelines, Washington has taken aim at Russians working at the United Nations, leveling accusations of espionage and demanding expulsions."
  },
  {
    "headline": "Over 200 Bandits Killed In Four Days In Niger State – Commissioner",
    "summarized_story": "Niger State Government has said that over 200 armed bandits were killed in a gun battle between members of the Joint Security Taskforce and bandits in the last four days in the state.\nThe state Commissioner for Local Government Chieftaincy Affairs and Internal Security, Mr. Emmanuel Umar, made this known while briefing newsmen in Minna.\nUmar revealed that the leaders of the four groups that the Joint State Security Taskforce engaged in the crossfire include Ali Kawajo, Bello Janbros, Kachalla Halilu, and Bello Turji.\nHe noted that the bandits were killed in the Kundu axis of Rafi and the Babanlaba axis of Mariga local governments and other parts of the state between Sunday and Wednesday.\nThe commissioner hinted that two security personnel lost their lives in the fight against the bandits but appreciated the gallant efforts of the Joint State Security Taskforce."
  },
  {
    "headline": "2023: Afenifere Backs South East Presidency",
    "summarized_story": "﻿ ﻿The pan-Yoruba socio-political group, Afenifere, has backed calls for the South East to produce the country’s next president, questioning those who think the region does not deserve the seat.\nHe said while the South South and South West have tasted power at the centre, the same cannot be said of the Igbo-dominated South East.\nIs the South East not part of the South?\n“Is it not the South West that has served [through] Obasanjo for eight years, Osinbajo for another eight years as vice president?\nIs the South East not part of the South?"
  },
  {
    "headline": "Adegoke’s Murder: Heavy Security At Re-Arraignment Of Adedoyin, Others",
    "summarized_story": "There is heavy security presence at the Osun State High Court premises as the re-arraignment of Dr Rahmon Adedoyin and six others commenced over their alleged involvement in the death of Timothy Adegoke.\nAdedoyin is the owner of the Hilton Hotel and Resort, Ile-Ife where Adegoke, a postgraduate student of the Obafemi Awolowo University (OAU), Osun State, was reportedly killed.\nAdedoyin was charged with an attempted felony, conspiracy, unlawful interference with Adegoke’s corpse, tampering with the hotel’s receipt and CCTV camera with the intent to destroy evidence that would prove that the victim visited the hotel.\nOthers charged alongside him are Adedeji Adesola, Magdalene Chiefuna, Adeniyi Aderogba, Oluwale Lawrence, Oyetunde Kazeem, Adebayo Kunle, and others at large.\nThose still at large are Prince Rahim Adedoyin, Esther Asifo, and Quadiri Moshood."
  },
  {
    "headline": "‘Difficult Decision’: Roman Abramovich Confirms Plans to Sell Chelsea for £3bn after 19 Years in Charge",
    "summarized_story": "Roman Abramovich has confirmed reports that he has decided to sell Chelsea with the proceeds going to a charitable foundation benefiting victims of the war in Ukraine.\n“As I have stated before, I have always taken decisions with the Club’s best interest at heart.\nHowever, I do believe this is in the best interest of the Club.\nAs revealed by MailOnline on Wednesday morning, Abramovich wants a return of at least £3bn for the Stamford Bridge club.\nSources claim Abramovich believes Chelsea is worth north of £3bn – but the likelihood of receiving such offers appears small."
  },
  {
    "headline": "Nigeria’s Consumer Rights Agency Issues Interim Orders Banning Airfare Hike",
    "summarized_story": "By the interim order, the operators are required to normalise prices to their prior state before the recent increment.\nThe commission, in a statement signed by Irukera, further enjoined scheduled domestic airline operators to ensure strict and prompt compliance with the order.\nThe Commission’s understanding from intelligence so far gathered is that there was significant controversy and or an initial lack of consensus with respect to coordinated conduct resulting in setting airfares.\n“Within days, Max Air also increased fares to the same minimum N50,000.\nIbom Air and Dana approximately 48 hours after what appears to be the initial coordinated conduct, also increased fares although not to the purported N50,000 minimum.”"
  },
  {
    "headline": "Nigeria to Save $1.8bn in Forex as Dangote, NNPC, Shell, Others Sign Gas Supply Deal",
    "summarized_story": "Natural gas is a feedstock of the Dangote Fertiliser plant, with the gas supply agreement expected to guarantee the availability of the major raw material needed to run the plant.\nNigeria represents one of Africa’s heavyweights when it comes to hydrocarbon exploration and production, with over 206 trillion cubic feet of natural gas, but has a huge gas supply deficit despite rising demand.\nThe African Energy Chamber (AEC) recently put Nigeria’s annual production capacity of gas at 1.450 billion cubic feet, as the country recovers from 2020 low production levels due to COVID-19.\n“As you are aware, Dangote fertiliser is one of the biggest producers of fertiliser and this deal, which is to offer 70m scuf per day to Dangote fertiliser by the JV, will contribute to the surge of fertaliser production in Nigeria.\nIt added that the organisation was obligated to determine the domestic gas demand requirement which shall be the total amount of marketable natural gas required for all wholesale customers of the strategic sectors."
  },
  {
    "headline": "Nigeria: Aviation Fuel Scarcity Persists, Heightens Flight Delays, Cancellations",
    "summarized_story": "This has been causing flight delays and sometimes cancellations when airlines wait and don’t get supply, a situation that became worse on Wednesday.\nFindings by THISDAY revealed that all the airlines experienced flight delays on Tuesday due to their inability to fuel their aircraft.\nAir Peace, Ibom Air, Azman Air, Arik Air and Dana Air operated their flights behind schedule.\nSpokesman of United Nigeria Airlines, Archiless Uchegbu told THISDAY that with the increase in the prices of aviation fuel and its scarcity, on-time performance of airlines has been impaired.\nThe aviation fuel scarcity has exacerbated flight delays that have encumbered domestic flight operations in Nigeria and driven further the air of hopelessness, as passengers wait for several hours before they board their flights."
  },
  {
    "headline": "Russian Foreign Minister Lavrov Says World War III Would Be ‘Nuclear and Destructive’",
    "summarized_story": "Russian Foreign Minister, Sergey Lavrov, said another World War would be “nuclear and destructive” for all parties and condemned Western sanctions on what he termed Kremlin’s unprovoked war in Ukraine.\nLavrov, in an interview with lAl-Jazeera News, claimed Russia would face “real danger” should Ukraine acquire nuclear weapons.\nUkraine has not attempted to acquire nuclear weapons and Russia has provided no evidence to support its claims to the contrary.\nPutin over the weekend ordered the Kremlin’s nuclear arsenal to be on heightened alert, a provocative step that officials in the Biden administration and NATO allies called reckless.\nMilitary aid to Ukraine and more rounds of sanctions, however, did not waver after the escalation."
  }
]