[
  {
    "headline": "NARD tackles MDCN, says house officers have right to join strike",
    "summarized_story": "Lara AdejoroThe National Association of Resident Doctors on Tuesday said house officers are bonafide members of the association and have the right to join the ongoing strike initiated by the association.\nThe NARD was responding to the threat issued by the Medical and Dental Council of Nigeria on Monday that house officers who embark on strike will suffer a reposting with no remuneration.\nThe Registrar of the MDCN had, however, in a statement titled “Press release on professional ethics for house officers,” noted that house officers who join the ongoing strike should be reported immediately to the Chief Medical Director, Medical Director, or Medical Superintendent of the housemanship of the institution.\nGenerally, it is expected that on employment, house officers should complete their postings within 12 calendar months.\n“As we speak, some of our younger colleagues (house officers) are still being owned salaries ranging from one to three months."
  },
  {
    "headline": "NARD tackles MDCN, says house officers have right to join strike",
    "summarized_story": "Lara AdejoroThe National Association of Resident Doctors on Tuesday said house officers are bonafide members of the association and have the right to join the ongoing strike initiated by the association.\nThe NARD was responding to the threat issued by the Medical and Dental Council of Nigeria on Monday that house officers who embark on strike will suffer a reposting with no remuneration.\nThe Registrar of the MDCN had, however, in a statement titled “Press release on professional ethics for house officers,” noted that house officers who join the ongoing strike should be reported immediately to the Chief Medical Director, Medical Director, or Medical Superintendent of the housemanship of the institution.\nGenerally, it is expected that on employment, house officers should complete their postings within 12 calendar months.\n“As we speak, some of our younger colleagues (house officers) are still being owned salaries ranging from one to three months."
  },
  {
    "headline": "WHO urges COVID-19 vaccine makers to keep prices down",
    "summarized_story": "The World Health Organisation on Wednesday urged COVID-19 vaccine manufacturers to keep their prices low and affordable, after reports that two producers will raise the cost they are charging the EU.\nPfizer-BioNTech and Moderna are upping the prices for their messenger RNA vaccines because they have adapted them to the new virus variants, according to reports.\nThe Pfizer vaccine will jump from 15.5 euros to 19.5 euros ($18.35 to $23) and Moderna from 19 euros to 21.5 euros ($22.5 to $25.45), British newspaper the Financial Times revealed Sunday, citing the contract concluded with the European Union.\n“In a normal market situation, this would lead to a decreased price, not an increasing price.\n“WHO urges companies to keep prices down and affordable prices.”Half of the EU population has now been fully vaccinated, according to an AFP tally from official sources."
  },
  {
    "headline": "WHO urges COVID-19 vaccine makers to keep prices down",
    "summarized_story": "The World Health Organisation on Wednesday urged COVID-19 vaccine manufacturers to keep their prices low and affordable, after reports that two producers will raise the cost they are charging the EU.\nPfizer-BioNTech and Moderna are upping the prices for their messenger RNA vaccines because they have adapted them to the new virus variants, according to reports.\nThe Pfizer vaccine will jump from 15.5 euros to 19.5 euros ($18.35 to $23) and Moderna from 19 euros to 21.5 euros ($22.5 to $25.45), British newspaper the Financial Times revealed Sunday, citing the contract concluded with the European Union.\n“In a normal market situation, this would lead to a decreased price, not an increasing price.\n“WHO urges companies to keep prices down and affordable prices.”Half of the EU population has now been fully vaccinated, according to an AFP tally from official sources."
  },
  {
    "headline": "Ban on Open Grazing: Delta has no land for ranching — Group",
    "summarized_story": "…insists on restructuring of NigeriaBy Festus Ahon, AsabaA group in Delta State, Club Anio 50, has said the State has no land to give to herdsmen for ranching and insisted that the restructuring of Nigeria was not negotiable.\nThe group in a statement after its meeting in Port Harcourt, copy of which was obtained by the Vanguard, expressed surprise at “the comments credited to the herders association rejecting some land for grazing in Delta State on the basis of being too small”.\n“The north that claims to have 70% of the land mass of the country cannot be looking for grazing sites in small Delta State.\nAs far as we know, the southern governors’ position on prohibition of open grazing in the south has not changed and Delta State has not offered the Meyitti Allah any land for grazing”.\n“There’s a lot of catching up to be done in Delta State being one of the youngest states in the country."
  },
  {
    "headline": "BREAKING: Lagos drops charges against Yoruba nation protester Tajudeen Bakare",
    "summarized_story": "Lagos State GovernmentLagos State Government has dropped the charges against detained Yoruba Nation Protester, Tajudeen Bakare (Oba Ogboni)More details to comeVanguard News Nigeria"
  },
  {
    "headline": "Okowa celebrates ex-gov Ibori at 63",
    "summarized_story": "Delta Governor, Senator Dr. Ifeanyi Okowa (right), and former Governor, Chief James Ibori during the burial ceremony of Pa Arthur Okowa, father of Governor Ifeanyi Okowa at Owa-Alero in Ika North East LGA.\nTuesdayDelta State Governor Dr .Ifeanyi Okowa, has congratulated former Governor of the State, Chief James Ibori, as he clocks 63.\nOkowa’s message of felicitation with the former governor was contained in a statement by his Chief Press Secretary, Mr Olisa Ifeajika, in Asaba.\nHe described Ibori as a great and inspirational leader, who had so far left indelible footprints in his service to the state and humanity.\nAccording to him, Chief Ibori is our great and indefatigable leader and pathfinder, who built bridges of unity across the various ethnic groups in the state."
  },
  {
    "headline": "Anti-graft War: EFCC to partner Ahmadu Bello Foundation on youth enlightenment",
    "summarized_story": "A statement by EFCC’s spokesperson, Wilson Uwujaren, said, the EFCC Chairman commended the Foundation for impacting positively on the society and called on Nigerian youths to emulate late Sir Ahmadu Bello.\nThe EFCC boss also promised to work with the Foundation in enlightening the public especially Nigerian youth on the ills of economic and financial crimes.\n“We are here to congratulate the Chairman on his appointment as the Executive Chairman of the EFCC.\nThe enlightenment programme designed to educate Nigerian youth on the ills of corruption is scheduled to commence on August 31, 2021.\nWe feel there is no better person to do that than the EFCC Chairman”, he said."
  },
  {
    "headline": "Why we stopped negotiations with bandits ― FG",
    "summarized_story": "Minister of State for Education, Chief Chukwuemeka NwajiubaBy Johnbosco Agbakwuru, AbujaThe Federal Government, today, said it stopped negotiations with bandits because the kidnappers used the money from ransom to equip and rearm themselves.\nALSO READ: ONDO 2020: We fought a good fight — Jegede“And as bandits appeared that they’ve started striking randomly at some of our schools from Jengave, Kangara.\nAnd that has enabled the bandits to use some of our citizens as human shields.\nWe are constrained to stop negotiations with bandits because we’ve seen that every time they get any payment, it leads to further escalation because they reequip and they rearm and then they go back.\n“We are continuously engaging, there is no such thing as federal government not engaging, almost day and night we are engaging."
  },
  {
    "headline": "Imposition of curfew: One injured as Oro worshippers clash with Muslims in Ogun",
    "summarized_story": "There was pandemonium in Idiroko area of Ipokia Local Government of Osun State on Tuesday as Oro worshippers clashed with Muslims in the border town.\nThe clash, DAILY POST learnt, followed the alleged imposition of a 24-hour curfew on Idiroko and environs to celebrate the annual Oro festival.\nIt was gathered that the festival started on Saturday, with the imposition of daylight curfew.\nIt was alleged that the Oro worshippers had attacked an Islamic cleric, Bola Wasiu, with a matchette on his head.\nOmo-Akin said the Oro worshipers violated a court order that nobody must impose daylight curfew anywhere in Ipokia Local Government."
  },
  {
    "headline": "Gov Abdulrazaq swears in three more commissioners",
    "summarized_story": "Kwara State Governor AbdulRahman AbdulRazaq, on Wednesday, swore in three new commissioners.\nThe Governor tasked the cabinet members on prudence, team work, and sacrifice to achieve a greater Kwara State.\nKwara state is undergoing a rebuilding process.\nPrudence, discipline, team work, and sacrifice have been our watchwords,” he said.\nModibbo Kawu, who spoke on behalf of the new commissioners, said they would join other stakeholders to succeed in the task before them."
  },
  {
    "headline": "NAFDAC vows intensive campaign against substandard products",
    "summarized_story": "The National Agency for Food and Drug Administration and Control (NAFDAC) has said it would begin an intensive campaign against substandard products in the country.\nThe exercise, NAFDAC said, became necessary in view of the highly unregulated products which posed inherent danger to the health of consumers.\nShe insisted that substandard products were prevalent in all the states of the federation, adding that the menace had reached an alarming stage that needed the agency’s prompt action.\nShe added that the first phase will be held in selected states from August to September, 2021.\n“The advent of Covid-19 Pandemic has aggravated the problem with the challenge posed by substandard and falsified Personal Protective Equipment (PPEs)."
  },
  {
    "headline": "Plateau unrest: NCPC boss condemns killings in Riyom, Bassa LGAs",
    "summarized_story": "The Executive Secretary, Nigeria Christian Pilgrim Commission (NCPC), Reverend Dr. Yakubu Pam, on Wednesday, condemned the recent attacks on some communities in Riyom and Bassa Local Government Areas of Plateau State.\n“Plateau needs support from both the federal government and international donor agencies to deal with incessant crises that had persisted in the state without relief.\nWe must shun tribal and religious differences to allow peace a chance.\n“I call on Plateau people to show resilience and not be deterred by a revenge mission but to allow God to contend with all those contending with us at this trying moment.\n“We should support the government to fight these intruders and round them up for the nation to sleep in peace”!"
  },
  {
    "headline": "Sunday Igboho: Afenifere reacts as court stops Buhari govt from arresting agitator",
    "summarized_story": "Justice Oladiran Akintola of the State High Court in Ibadan and Justice Obiora Egwaatu of a Federal High Court, Abuja, had on Wednesday, gave separate rulings in respect of Igboho and his aides respectively.\nJustice Akintola also restrained the agencies of government from freezing the accounts of the activist, and where this had been done, it must be de-frozen according to the ruling.\nIn a statement he signed and forwarded to DAILY POST, Ajayi said: “The verdicts given by Justices Oladiran Akintola and Obiora Egwaatu further reinforce our confidence in the judiciary.\n“Afenifere saluted the courage of Justice Obiora Egwaatu for granting the bails especially given the fact that the suspects have been in the custody of the DSS for 34 days without being charged to court.\n“The verdicts Justices Akintola and Egwaatu confirm the exhortation that the court is the place to go when one’s right is infringed upon.”"
  },
  {
    "headline": "VIDEO: Flood exposes rail track in Osun",
    "summarized_story": "BBNaija Shine Ya Eye housemate Angel has been caught masturbating in a short video that has since gone viral."
  },
  {
    "headline": "Nigeria facing multiple, concurrent disease outbreaks, says NCDC",
    "summarized_story": "The Director-General of the Nigeria Centre for Disease Control (NCDC) Dr Chikwe Ihekweazu has advised States to invest more on health infrastructure to be well-prepared for outbreaks of multiple and concurrent diseases.\nHe stated the advice became necessary because Nigeria faces concurrent and multiple disease outbreaks even in the face of a threatening COVID-19 pandemic.\nADVERTISEMENTHe noted with increasing COVID-19 infections and deaths, the country is yet to see the worst of the pandemic.\nThat is our reality – our tropical climate, population density, and poor socioeconomic factors leave us at risk of annual, multiple, concurrent disease outbreaks in Nigeria.\nMinister of Health, Dr Osagie Ehanire, said: “Despite the pandemic, we have not stopped recording other infectious disease outbreaks."
  },
  {
    "headline": "Security operatives disguising as gunmen to attack Biafra, IPOB alleges",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has decried alleged attacks on Biafrans by security operatives who disguise as unknown gunmen.\nThe group, in a statement by the Media and Publicity Secretary, Emma Powerful, also accused the security operatives of burning their houses and blaming their actions on unknown gunmen.\nADVERTISEMENTIt also called on the Nigerian Police Force to immediately release those they picked and tagged them Eastern Security Network (ESN) operatives or charge them to court.\n“These Efulefus and evil politicians decided to sponsor Nigeria army and police to attack innocent Biafrans in Orlu and other places in Biafra land to implicate IPOB and ESN.\n“It is ridiculous to think that IPOB which has been operating for many years now will suddenly start killing.”"
  },
  {
    "headline": "Traffic diversion on Apapa-Oshodi expressway for bridge repairs",
    "summarized_story": "Traffic will be diverted on Apapa-Oshodi expressway between August 9 and October 3 to allow for repair of the Airport flyover bridge, it has been learnt.\nThe Nation reports fire from a petrol tanker explosion on the Apapa-Oshodi expressway in January caused some damages to the bridge.\nAccording to the commissioner, traffic heading towards the Oshodi-bound lane will be diverted to the service lane at Ladipo while those heading to Mile 2 will be diverted to the Airport Road.\nHe added that two lanes on both Oshodi and Mile 2 roads will be opened to vehicular movement to ease traffic.\nOladeinde assured officials of the Lagos State Traffic Management Authority (LASTMA) will manage the flow of traffic and minimise inconveniences that will arise due to the rehabilitation works."
  },
  {
    "headline": "Traffic diversion on Lagos/Abeokuta expressway",
    "summarized_story": "The Lagos/Abeokuta expressway will be partially closed to traffic from midnight August 13, 2021 to September 2022 to accelerate the ongoing construction of the Ikeja overpass for the Lagos Rail Mass Transit (LRMT) Red Line Rail project.\nThe road will be closed from Airport Bus Stop to the existing level crossing on Balogun Street junction at Ikeja.\nA statement by Commissioner for Transport Frederic Oladeinde said the closed section will enable the contractor handling the overpass bridge begin civil works on the bridge, which will take traffic in and out of Obafemi Awolowo Way, Ikeja.\nADVERTISEMENTOladeinde added LAWMA officials will be deployed in the area to manage traffic flow and minimise inconveniences.\nHe said signs and direction notifications will be placed along the axis to guide motorists on movement."
  },
  {
    "headline": "Breaking: Igboho’s associates get N10M, N5M Bail",
    "summarized_story": "From Godwin Tsa, AbujaA Federal High Court in Abuja on Wednesday granted bail to 12 of Sunday Igboho’s associates held in its custody since July 2, 2021.\nJustice Obiora Egwuatu admitted four of them to bail in the sum of N10m each with two sureties in the like sum, while the remaining eight were granted bail in the sum of N5m with one surety each.\nRuling on their bail applications, the Judge said the sureties must be residents of the Federal Capital Territory(FCT), Abuja.\nThe four applicants whom were granted N10 million bail are; Amudat Babatunde (AKA Lady K), Okoyemi Tajudeen, Abideen Shittu and Jamiu Oyetunji.\nOne of the sureties the court held must be an employee of the federal government on grade level 12 and above."
  },
  {
    "headline": "High Court restrains DSS, AGF from arresting Igboho",
    "summarized_story": "By Chinelo ObogoAn Oyo State High court has granted an ex-parte motion restraining the Department of State Services(DSS) and Attorney General of the Federation (AGF) from arresting, intimidating or freezing any bank account belonging to Sunday Adeyemo, also known as Sunday Igboho.\nJustice Ladiean Akintola gave the order following an ex-parte motion moved by Igboho’s lawyer Yomi Aliu (SAN) at the court on Wednesday.\nAbout three weeks after he was declared wanted by the Department of State Security (DSS), the Benin Republic Police arrested Sunday Adeyemo, also known as Sunday Igboho last month.\nEarlier in June, DSS operatives invaded Igboho’s house, located in Soka, Ibadan, capital of Oyo State around 1:00 a.m. Two of his vehicles and some valuable properties were destroyed in the process.\nThe DSS also admitted that two of Igboho’s men were killed in the process while a security agent was shot on the right hand."
  },
  {
    "headline": "Supreme Court ruling: APC may dissolve Buni’s committee",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaAgainst the backdrop of the July 28, 2021 minority ruling of the Supreme Court on the legitimacy of the Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee (CECPC), the National Caucus of the All Progressives Congress (APC) may soon meet to dissolve the panel.\nThe Supreme Court had dismissed a case brought by the candidate of the Peoples Democratic Party (PDP), Eyitayo Jegede, against Akeredolu’s election.\nRegardless, a party chieftain at the APC national secretariat insisted that Buni’s committee was validly constituted.\nIn the aftermath of the dissenting judgment of the Supreme Court, a presidential committee was set up, with legal experts in government, to assess the implication of the ruling on the ruling party.\n“The Supreme Court judgement has exposed the underbelly of the APC."
  },
  {
    "headline": "Implosion imminent in PDP as crisis gets messier",
    "summarized_story": "They include Diran Odeyemi, deputy national publicity secretary; Ahmed Bello, deputy national legal adviser; Umoru Hadizat, deputy national women leader; Divine Amina Arong, deputy national auditor; Hassan Yakubu, deputy national organizing secretary; and Irona Alphonsus, deputy national financial secretary.\nHe called on PDP governors and other leaders to rise up and rescue the party.\nThere is a sharp division in our NWC right now; not only me, many more NWC members are more aggrieved than myself.\nRight now, I can tell you that not less than eight to ten persons within the NWC members are very aggrieved.\nIt was gathered that the Sokoto Governor, Aminu Tambuwal, who is chairman of the PDP governors is calling for caution."
  },
  {
    "headline": "Gunmen kill pregnant woman, 7 others, destroy farms in Enugu",
    "summarized_story": "From Fred Ezeh, AbujaSuspected armed herdsmen invaded Mgbuji community in Eha-Amufu, Isi-Uzo Local Government Area of Enugu State and killed eight people, injured others and kidnapped many, while farmlands were also destroyed.\nSome villagers told Daily Sun that the armed herdsmen invaded the community, on Sunday afternoon, through the border with Benue community and attacked several farm settlers and other unlucky people caught in the farm.\nThe community members alleged that the police asked them to sign an undertaking before they could release the corpses to the family members for burial.\nHe called on the Enugu government to take action on the armed herdsmen.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Breaking: Court Stops DSS from Arresting Igboho",
    "summarized_story": "By Kemi Olaitan in IbadanAn Ibadan High Court presided over by Justice Ladiran Akintola, Wednesday granted an order of interim injunction restraining the Departmen of State Services (DSS) and other security agencies from arresting, detaining, molesting or killing Yoruba Nation activist, Chief Sunday Adeyemo (aka Sunday Igboho).\nThe suit was filed by his counsel, Chief Yomi Aliyu, SAN.\nJustice Akintola while adjourning the case to August 18 for hearing of the originating motion, said the respondents must be served before the date.\nDetails later …Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ahead of 2023, Nigeria’s Dominant Political Parties Battle Survival, Leadership Crises",
    "summarized_story": "Both parties are not only bogged down by leadership crises, but they are also plagued by seemingly intractable survival battles.\nThe suit marked FCT/HC/CV/1824/2021 and dated August 2, 2021, listed the APC and all members of the caretaker committee as defendants.\nLeading the defection train was the governor of Ebonyi State, Dave Umahi, followed by Cross River State Governor Ben Ayade, and, most recently, Zamfara State Governor Bello Matawalle, whose defection had also raised some constitutional concerns following the manner of his emergence as governor.\nThe party will look into the grievances raised by members of NEC as well as members of the National Working Committee.\nIt called on all members of the party and stakeholders to remain calm in the face of the developments."
  },
  {
    "headline": "Buhari Salutes Emefiele’s Patriotic Services at 60",
    "summarized_story": "Buhari appreciated the economist and banker for his patriotic service to the country at a time of difficult economic challenges.\nBuhari equally wished the CBN governor good health and greater service to fatherland.\n“As Mr. Godwin Emefiele celebrates his Diamond Jubilee, I wish him good health and more fruitful years.\nIt also established a health sector grant to promote research in the development of vaccines, among other policy measures.\nThe health sector facility has provided loans to pharmaceutical companies to expand and open drug-manufacturing plants in the country, and it has helped hospitals and healthcare practitioners to expand and build health facilities."
  },
  {
    "headline": "PDP Confirms Resignation of Seven Officials",
    "summarized_story": "By Chuks OkochaThe National Organising Secretary of the Peoples Democratic Party (PDP), Col. Austin Akobundu has confirmed the resignation of seven members of the National Working Committee (NWC) who resigned from their respective offices.\nAccording to the PDP constitution, THISDAY gathered, the seven deputies that resigned, are not entitled to attend meeting of the NWC.\nThey have been agitating that they should be allowed to attend the main NWC meeting as the information reaching them after NWC is secondary.\nThe seven national officers of PDP in their separate letters addressed to the National Secretary of the party, Senator Unaru Tsauri, on Tuesday, alleged being sidelined and unfairly treated by the National Chairman, Uche Secondus.\nAmong those who have tendered their letters of resignation are the Deputy National Financial Secretary, Deputy National Organising Secretary, Deputy National Legal Adviser, Deputy National Publicity Secretary, Deputy Woman Leader, and Deputy National Auditor."
  },
  {
    "headline": "Buhari Approves Deployment of Nine Permanent Secretaries",
    "summarized_story": "By Olawale AjimotokanPresident Muhammadu Buhari has approved the deployment of nine federal permanent secretaries to different ministries.\nThe new postings were communicated by the Head of Civil Service of the Federation, Dr. Folasade Yemi-Esan via a circular- HCSF/CMO/AOD/012/IX/59 dated August 3, 2021.\nAlso affected in the exercise were the four recently appointed Permanent Secretaries: Dr. Onwudiwe Maryanne Ngozi, Dr. Ogunbiyi Marcus Olaniyi, Yusuf Ibrahim Idris and Adebiyi Olusesan Olufunso.\nThey were deployed to Service Welfare Office, OHCSF; Career Management Office, OHCSF; Common Service Office, OHCSF and Federal Ministry of Women Affairs respectively.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Documents Expose How Ex-Vice President, Atiku Used Wife To Launder $40million To US For Eight Years",
    "summarized_story": "Former President George Bush had in 2004 barred Atiku and other corrupt politically exposed persons from being issued visas to the US.\n“When one bank closed her account due to the offshore wire transfers, her lawyer helped convince other banks to provide a new account.\nAlso in 2003, U.S. Immigration and Customs Enforcement (ICE) formed an investigative group dedicated to combating foreign corruption by PEPs.\nIt is the latest in a series of Subcommittee hearings examining foreign corruption and its U.S. aiders and abettors.\nBut Atiku and his wife, Jennifer did not accept summons and subpoenas to appear before the US court."
  },
  {
    "headline": "Documents Expose How Ex-Vice President, Atiku Used Wife To Launder $40million To US For Eight Years",
    "summarized_story": "Former President George Bush had in 2004 barred Atiku and other corrupt politically exposed persons from being issued visas to the US.\n“When one bank closed her account due to the offshore wire transfers, her lawyer helped convince other banks to provide a new account.\nAlso in 2003, U.S. Immigration and Customs Enforcement (ICE) formed an investigative group dedicated to combating foreign corruption by PEPs.\nIt is the latest in a series of Subcommittee hearings examining foreign corruption and its U.S. aiders and abettors.\nBut Atiku and his wife, Jennifer did not accept summons and subpoenas to appear before the US court."
  },
  {
    "headline": "Nigerians React As Buhari's Daughter-in-law Wears Western-Style Dress In Opulent Bridal Shower",
    "summarized_story": "Zahra's dress, it is understood, was for her bridal shower in preparation for the wedding scheduled to hold on August 20.\nAlso, Zahra's father is a ruler in Bichi, a town in Kano State where the Islamic corps, Hisbah, had banned dressing considered unreligious.\nOfficials of Hisbah in Kano State have over the years forcefully enforced its policies, particularly on dressing, on residents of the state irrespective of their religious affiliation.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets and boutique owners in the state.\nA statement had read, “Hisbah prohibits the use of mannequins at shops, commercial and private residences and other public places."
  },
  {
    "headline": "Nigerians React As Buhari's Daughter-in-law Wears Western-Style Dress In Opulent Bridal Shower",
    "summarized_story": "Zahra's dress, it is understood, was for her bridal shower in preparation for the wedding scheduled to hold on August 20.\nAlso, Zahra's father is a ruler in Bichi, a town in Kano State where the Islamic corps, Hisbah, had banned dressing considered unreligious.\nOfficials of Hisbah in Kano State have over the years forcefully enforced its policies, particularly on dressing, on residents of the state irrespective of their religious affiliation.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets and boutique owners in the state.\nA statement had read, “Hisbah prohibits the use of mannequins at shops, commercial and private residences and other public places."
  },
  {
    "headline": "Flood Wreaks Havoc In Osun As Three Killed, Government House’s Fence Collapses",
    "summarized_story": "Three persons have been reported dead as flood ravaged Osogbo town, the Osun State capital after a heavy downpour on Tuesday night.\nSaharaReporters learnt that the deceased were at Oke-Onitea and Okejetu areas and drowned while attempting to pass through the flood.\nIt was learnt that about 25 meters of the perimeter fence of the Osun Government House also collapsed.\nThe flood also affected several other parts of the Oshogbo which include Ibu-Amon bridge, Jetu stream, Oke-Onitea stream, Rasco area via Old Garage, Oke Baale, Powerline, Testing ground, Obate, and Awesin in Erin-Osun.\nVehicular movements were diverted from Lamco junction and Oke-Fai en route the Government House so a temporary perimeter fence can be constructed."
  },
  {
    "headline": "Puma terminates 4-year contract with AFN after Tokyo Olympics drama",
    "summarized_story": "Puma, the German sportswear manufacturing company, has pulled the plug on the 4-year kits sponsorship contract with the Athletics Federation of Nigeria (AFN).\nAdvertisementThe contract was signed on July 24, 2019, in Doha by the AFN board under Ibrahim Gusau.\nA significant section of the deal stated that Puma will supply kits to all age categories to Nigeria’s athletics team for four years.\nHowever, the contract has led to an ongoing legal battle between the sports ministry and the factional board of AFN.\nAdvertisementConsequently, the ministry failed to allow the Nigerian athletics team to don the Puma branded apparel at the ongoing Tokyo Olympics, arguing that it’s “a subject of a criminal investigation”."
  },
  {
    "headline": "Puma terminates 4-year contract with AFN after Tokyo Olympics drama",
    "summarized_story": "Puma, the German sportswear manufacturing company, has pulled the plug on the 4-year kits sponsorship contract with the Athletics Federation of Nigeria (AFN).\nAdvertisementThe contract was signed on July 24, 2019, in Doha by the AFN board under Ibrahim Gusau.\nA significant section of the deal stated that Puma will supply kits to all age categories to Nigeria’s athletics team for four years.\nHowever, the contract has led to an ongoing legal battle between the sports ministry and the factional board of AFN.\nAdvertisementConsequently, the ministry failed to allow the Nigerian athletics team to don the Puma branded apparel at the ongoing Tokyo Olympics, arguing that it’s “a subject of a criminal investigation”."
  },
  {
    "headline": "PDP crisis: Secondus says 'strong chieftain bent on hijacking party structure'",
    "summarized_story": "Uche Secondus, national chairman of the Peoples Democratic Party (PDP), says a “strong chieftain” is behind the crisis affecting the party’s leadership.\nAdvertisementThe PDP is embroiled in an internal crisis, which has resulted in some major stakeholders dumping the opposition party.\nAdvertisementTheCable also reported on Wednesday that some members of the PDP national working committee (NWC) had threatened to resign if the leadership crisis isn’t resolved soon.\nSpeaking on the recent development in a statement issued on Wednesday by Ike Abonyi, his special adviser on media, Secondus alleged that the “strong chieftain” is bent on hijacking the party structure for “his disproportionately large ambition”.\nAdvertisement“The media office of the National Chairman is privy to intelligence that the strong party chieftain bent on hijacking the party structure for destruction is still on the loose with the main agenda of denting the image of Prince Uche Secondus, the National Chairman,” the statement reads."
  },
  {
    "headline": "PDP crisis: Secondus says 'strong chieftain bent on hijacking party structure'",
    "summarized_story": "Uche Secondus, national chairman of the Peoples Democratic Party (PDP), says a “strong chieftain” is behind the crisis affecting the party’s leadership.\nAdvertisementThe PDP is embroiled in an internal crisis, which has resulted in some major stakeholders dumping the opposition party.\nAdvertisementTheCable also reported on Wednesday that some members of the PDP national working committee (NWC) had threatened to resign if the leadership crisis isn’t resolved soon.\nSpeaking on the recent development in a statement issued on Wednesday by Ike Abonyi, his special adviser on media, Secondus alleged that the “strong chieftain” is bent on hijacking the party structure for “his disproportionately large ambition”.\nAdvertisement“The media office of the National Chairman is privy to intelligence that the strong party chieftain bent on hijacking the party structure for destruction is still on the loose with the main agenda of denting the image of Prince Uche Secondus, the National Chairman,” the statement reads."
  },
  {
    "headline": "RCCG pastor killed by gunmen during church service in Lagos",
    "summarized_story": "Bolanle Ibrahim, an assistant pastor of the King of Kings parish of the Redeemed Christian Church of God (RCCG), Ketu, Lagos state, has been shot dead.\nAdvertisementThe pastor was said to have been killed at the church premises located at Maidan area in Ikosi Ketu, Lagos state.\nIbrahim was said to be praying during a child dedication service on Sunday, when the gunmen attacked the church and shot him dead.\nConfirming the development, Muyiwa Adejobi, police spokesperson, in a statement on Wednesday, said the assailants targeted the pastor when they attacked the church.\n“The commissioner of police Lagos state, CP Hakeem Odumosu has directed the tactical commanders to handle the matter as expected."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, results for the past half-year showed that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "Kuda Bank closes $55 million Series B round led by Paypal backers",
    "summarized_story": "Nigerian fintech startup, Kuda Bank, has raised $55 million in a Series B round at a valuation of $500 million.\nThis comes after a recent Series A of $25 million announced by the company just a little over four months ago.\nKuda plans to use the funds to build on its new services for Nigeria as well as prepare for a continental expansion.\nBeyond just basic financial services, Kuda now offers credit to its users by way of an overdraft allowance, which the company pre-qualifies the most active users for.\nAccording to Ogundeyi, Kuda has seen “minimal” default because of its approach."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Rachael Akalia’s remarkable journey to becoming Patricia Technologies’ brand manager",
    "summarized_story": "She was better suited for relationship-based tasks with such a skillset, so Agbodje asked her to become the startup’s customer service representative and social media manager.\nI want to start a proper customer service team, which you will head.’”Leading a team of ten was a new challenge that came with greater responsibility which prompted her to take customer service courses on Udemy.\nBy June 2019, the growth of the Patricia team necessitated the expansion of the customer service team to 35 people.\n“I had a conversation with Chika, the Chief People Officer, about why I was moved to the marketing team.\nWhile she continues to embody the Patricia brand, Rachael ultimately plans to go back to school, something she has put on hold for a few years."
  },
  {
    "headline": "Inside Alida School’s plans to raise Africa’s next generation of tech talents",
    "summarized_story": "AdvertisementDissatisfied with this situation, Dauda Barry, a London-based Senegalese serial entrepreneur, was propelled to start Alida School in March 2021, an online coding school for Africans.\n“Building up Adama Robotics, being part of the startup ecosystem in London, I began hearing about Lambda School.\n'”Realising the feasibility, Barry began building Alida School upon his return to London in March 2021.\nAlida School provides schooling in mainly front-end web development, Git, and Vue.js, and the first cohort is currently eleven weeks into the programme.\nWith the various challenges that Africa’s burgeoning tech scene faces, startups like Alida School will go a long way in creating and refining talents to bolster the growth of technological innovations on the continent."
  },
  {
    "headline": "Khula’s seed round, Wapipay’s pre-seed, and Printivo CEO steps down",
    "summarized_story": "Share this article:Today I’m discussing:Khula’s $1.3 million raiseWapipay raises $2.2 millionOluyomi Ojo steps down as Printivo CEOKhula raises $1.3 millionKaridas Tshintsholo (CEO), Matthew Piper (CPO) and Jackson DyoraSouth African agri-tech startup, Khula, has closed a $1.3m seed round.\nThe startup will also be able to use AECI’s vast distribution network to ensure its products reach more people.\nWapipay raises $2.2 millionLeft: Paul Ndichu Co-Founder Wapi Pay, Right: Eddie Ndichu Co-Founder & CEO Wapi Pay.\nSource: WapipayKenyan fintech startup, Wapipay has raised $2.2m in pre-seed funding to help African businesses make payments in Asia.\nAll while minimising the cost of transactions; it needs to be as easy as sending M-PESA.”Oluyomi Ojo steps down as Printivo CEOOluyomi OjoCo-founder of print-on-demand startup, Printivo, Oluyomi Ojo, has announced in a Medium post that he has left his position as CEO."
  },
  {
    "headline": "Obaseki to engage, train 10,000 local security personnel to combat crime, boost security in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government plans to recruit and train over 10, 000 local security personnel in the state to complement the efforts of the federal security agents in tackling insecurity across the state.\nObaseki disclosed this during an inspection of the Police Training Facility at Ogida Police Barracks in Benin City, Edo State.\nAccording to him, “We are collaborating with the Nigerian Police Force to improve the training facilities at the Ogida Police Barrack Training School.\n“The purpose of this collaboration is to train members of our vigilante group with modern policing and intelligence gathering skills.\nAlso, the constabulary corps and our Public Work Volunteer (PUWOV) will be trained at the facility."
  },
  {
    "headline": "Edo govt begins electrification of Orhionmwon, Uhunmwonde communities, installs transformers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has commenced Rural Electrification of Abudu and other communities in Orhionmwon Local Government Area, as well as some communities in Uhunmwonde LGA.\nThe government also installed 2.5MV/3311VA transformers in the communities to boost power supply.\nThe benefitting communities include Abudu Oza – Evbuobanosa Oghada, Itu, Ofien, Idudolor, Ugbeze, Evbuohen, Ago-Ogbeide, Uvbe, Isua Evbosawe, Igbogiri Ugomoson, Ugboayon, Ugoneki, among others.\nInspecting the Installation of the transformers, the Chairman of EDSOGPADEC, Pastor Kennedy Osifo, thanked Governor Godwin Obaseki for giving approval for the people.\nwhile appreciating Governor Obaseki said that Abudu has benefitted immensely from the present administration in the State since 2016 till date."
  },
  {
    "headline": "Obaseki grants tax credit to Saro Group, urges more firms, investors to embrace scheme – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, granted tax credit to Saro Group of Companies, as part of efforts by the government to fast-track development across the state.\nObaseki said, “Executive Order number 1 of 2021 is the legal basis and framework on which this scheme was designed.\nWe encourage them to utilize the tax credit in the area they are making money rather than taking it somewhere else.\n“We want to encourage more Investors to invest in Edo State as the government has put all measures on ground to protect investors coming into the state, as we would not allow those that want to discourage investors in the state.\n“Today is historic because the state is doing something that has not been done before except by the federal government."
  },
  {
    "headline": "Alleged High-handedness: NBA Benin Branch Boycott Court – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Arising from her alleged highhandedness, disrespectful and insubordination, members of the Nigerian Bar Association (NBA), Benin Branch, have commenced indefinite boycotting of Edo State High Court 6, Benin City, Presided over by Honourable Justice Helen Adesuwa Courage-Ogbebor.\nThis was contained in a statement signed by the Branch’s chairman, Pius Oiwoh and secretary Andrew Lawani and made available to newsmen in the state capital recently.\nThe statement informed that the decision to boycott Justice Courage Ogbebor’s Court was taken on Monday evening at the monthly meeting of the Benin NBA, held at the Bar House Complex, Benin City.\nThis development brings to the second time the NBA Benin branch is boycotting Court in Benin City.\nIt will be recall that NBA Benin earlier boycotted Honourable Justice Oni-Okpako’s Court over alleged humiliation melted on a counsel."
  },
  {
    "headline": "FEC approves $11.17bn rail project to link all coastal cities",
    "summarized_story": "ADVERTISEMENTThe Federal Executive Council (FEC) has approved $11.17 billion to link all Nigeria’s coastal cities by rail in six years.\nMr Mohammed said the Minister of Transportation, Rotimi Amaechi, presented two memos which had to do with federal government’s commitment to expanding and consolidating on the rail project.\n“The first one actually has to do with the Kano-Jibia rail and the other one has to do with the Port Harcourt-Maiduguri rail.\n“Today, the council has given approval to commence the Lagos-Calabar Coastal rail.\n“This particular route is very important because after the Lagos-Kano route, this Lagos-Calabar Coastal route actually will link all the coastal cities in the country."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Hushpuppi: US wants Abba Kyari detained pending trial",
    "summarized_story": "The United States has requested for pre-trial detention of suspended Deputy Commissioner of Police, Mr Abba Kyari.\nThis is according to papers filed at the United State District Court for the Central District of CaliforniaThe court papers filed on April 29, 2021 were signed by Acting US Attorney, Tracy Wilkinson and two other officials, according to ThisDay.\nIt read: “Plaintiff, United States of America, by and through its court of records hereby requests detention of defendant (Abba Kyari) and gives notice of the following factors:“Pre-trial detention requested (S 3142(e)) because no condition or combination of conditions will reasonably assure:“a.\nThe US District Court of California had indicted Kyari over his involvement in a $1.1million fraud committed by notorious internet fraudster, Ramon Abbas Olarewaju, also known as Hushpuppi.\nKyari is currently facing an investigation panel set up by the IGP and headed by DIG Joseph Egbunike."
  },
  {
    "headline": "Don’t link our struggle for compensation with burning of Dangote’s property – Ibese Regent",
    "summarized_story": "Idowu Olakunle, AbeokutaThe Regent of Ibese Land, in Yewa North local government Area of Ogun State, Alhaji Tajudeen Adewuyi, has explained that Tuesday’s crisis in Dangote Cement Company, Ibese has no link with the alleged non payment of compensation to people on their land.\nAlhaji Adewuyi’s positon came as some people in the town went and destroyed properties at the plant, over alleged lack of compensation.\nIt was gathered that the motorcyclists operating at Dangote Cement Factory junction at Ibese were at loggerheads with the union leaders over a hike in ticket fees from N600 to N800.\nThe regent said that the issue with Ibese and Dangote on compensation, was being handled, expressing optimism that the issue was on the verge of settlement, saying Dangote Cement was cooperating with indigenes of the town.\nBut how it then turned into the Hausa and Yoruba crisis is what I don’t know."
  },
  {
    "headline": "Leadway Health Ltd unveils robust healthcare offerings, promises to change HMO ecosystem in Nigeria",
    "summarized_story": "OBINNA EZUGWULeadway Health Limited, a fast growing health maintenance organization (HMO) – affiliated with Leadway Assurance Company Limited, one of Nigeria’s foremost and largest insurers – has unveiled a range of healthcare service offerings targeted at improving access to quality healthcare and wellbeing solutions for Nigerians.\nHe said the firm aims to make quality healthcare affordable to the over 190 million Nigerians who are still paying for medical services from their pockets, which according to him, is an expensive and unsustainable way of accessing healthcare.\n“According to the National Health Insurance Scheme, more than 190 million Nigerians are still paying out-of-pocket to access medical services, forcing individuals, businesses and households to incur enormous and usually unplanned health expenditures,” he said.\n“This is an unnecessary, unsustainable and costly means to accessing quality healthcare services.\nWith the introduction of Leadway Health Limited, our range of solutions would help bridge the gap in providing quality, accessible, and affordable health services to Nigerians."
  },
  {
    "headline": "Purported query of Osun PDP executives illegal – Adagunodo",
    "summarized_story": "By Sunday Oguntuyi, OsogboFactional chairman of the Peoples Democratic Party (PDP) in Osun State, Hon.\nSunday Bisi and they will take appropriate action if necessary on the purported query issued to them, however, they largely rely on the pronouncements of the Court, because:1.\nEven Court of Appeal Akure, for the fact that it refused to uphold Ground 6 of the Appellant, did not remove Adagunodo as Chairman.\nFor the fact that the purported removal from office by NWC has never been approved by NEC of the party, Hon.\nSoji Adagunodo remains the chairman, whom they reported to in compliance with Section 59 (3) (a) to (x) of the Constitution of the Party.)."
  },
  {
    "headline": "80% Of Structure In Gombe Varsity Constructed By TETFund – Gov Yahaya",
    "summarized_story": "Governor Muhammadu Inuwa Yahaya of Gombe State has commended the Tertiary Education Trust Fund (TETfund) for its relentless intervention in the physical and intellectual development of Nigerian universities.\nHe said his administration will continue to seek partnership with the agency in order to boost the capacity of the state-owned higher institutions.\nGovernor Yahaya stated this when he hosted to the chairman of Board of Trustees of TETFUND, Alhaji Kashim Ibrahim Imam at the Government House.\nADVERTISEMENTThe governor observed that over 80 per cent of structures at the Gombe State University were funded by the TETFund, a development he said is being replicated across universities in the country.\nHe said an innovation centre with broad band will be constructed in Gombe town to enable students of higher institutions in the state carry out research using Information Communications Technology."
  },
  {
    "headline": "80% Of Structure In Gombe Varsity Constructed By TETFund – Gov Yahaya",
    "summarized_story": "Governor Muhammadu Inuwa Yahaya of Gombe State has commended the Tertiary Education Trust Fund (TETfund) for its relentless intervention in the physical and intellectual development of Nigerian universities.\nHe said his administration will continue to seek partnership with the agency in order to boost the capacity of the state-owned higher institutions.\nGovernor Yahaya stated this when he hosted to the chairman of Board of Trustees of TETFUND, Alhaji Kashim Ibrahim Imam at the Government House.\nADVERTISEMENTThe governor observed that over 80 per cent of structures at the Gombe State University were funded by the TETFund, a development he said is being replicated across universities in the country.\nHe said an innovation centre with broad band will be constructed in Gombe town to enable students of higher institutions in the state carry out research using Information Communications Technology."
  },
  {
    "headline": "President Buhari To Lead 11 African Nations To Negotiate $19bn Soft Loan",
    "summarized_story": "The Pan Africa Great Green Wall (PAGGW) countries have appointed President Muhammadu Buhari president of the Heads of States and Government of the PAGGW to facilitate $5bn grant and $14bn soft loans for the agency.\nThe minister of environment, Dr Mohammad Mahmood Abubakar, who disclosed this during the ministerial briefing on recent developments in the environment sector also said the government is gaining speed by pragmatically addressing other recommendations in the UNEP report including provision of potable water to Ogoni communities, training of youths for sustainable alternative livelihood, public health inventory, environmental surveillance and construction of Centre of Excellence for Environmental Studies/Remediation.\nHe said Buhari would assume the presidency of the Heads of States and Government of the PAGGW at the end of the 5th Summit which would be hosted by Nigeria virtually in September 2021."
  },
  {
    "headline": "President Buhari To Lead 11 African Nations To Negotiate $19bn Soft Loan",
    "summarized_story": "The Pan Africa Great Green Wall (PAGGW) countries have appointed President Muhammadu Buhari president of the Heads of States and Government of the PAGGW to facilitate $5bn grant and $14bn soft loans for the agency.\nThe minister of environment, Dr Mohammad Mahmood Abubakar, who disclosed this during the ministerial briefing on recent developments in the environment sector also said the government is gaining speed by pragmatically addressing other recommendations in the UNEP report including provision of potable water to Ogoni communities, training of youths for sustainable alternative livelihood, public health inventory, environmental surveillance and construction of Centre of Excellence for Environmental Studies/Remediation.\nHe said Buhari would assume the presidency of the Heads of States and Government of the PAGGW at the end of the 5th Summit which would be hosted by Nigeria virtually in September 2021."
  },
  {
    "headline": "123 Die Of Cholera In Jigawa, Sokoto",
    "summarized_story": "No fewer than 123 people have died of Cholera in Jigawa and Sokoto states even as the disease rages.\nIn Jigawa State, 100 of the 5,000 persons infected by the disease have died, while 23 lost their lives in Sokoto.\nADVERTISEMENTIn Sokoto, the state’s commissioner for health, Ali Inname, who briefed journalists, noted that the infection had spread to 13 of the state’s 23 local government areas.\nMuazu said it was unfortunate that the disease keeps spreading despite measures taken by the state government to mitigate the scourge of the outbreak.\nEarlier in March, the government was forced to shut down Government Girls College, Mabera, following a similar outbreak."
  },
  {
    "headline": "Unity Bank Unveils New Code on USSD Platform to Combat E-Banking Fraud",
    "summarized_story": "By TIM AYUBAIn a bid to safeguard its e-banking platforms with enhanced safety and security features, Unity Bank Plc has unveiled a new code on its USSD platform that completely puts the customer in control of his Bank Account against any e-Banking fraud.\nAs part of the robust feature of the Bank’s USSD platform, Bank customers can directly initiate the new Code and successfully block the account from a third-party mobile device.\nTo unblock the Bank account, customers can walk into any branch of Unity Bank closest to them and request reactivation.\nThe unveiling of the new USSD code is, therefore, part of Unity Bank’s strategic move to protect their customers by reducing to zero, losses from electronic banking frauds.\nWith the USSD feature, being available to both smartphone and feature phone users, it means even the least digital-savvy customers of Unity Bank can effectively use the new anti-fraud code”."
  },
  {
    "headline": "Alleged sexual harassment: Criminal probes launched against New York Gov Cuomo",
    "summarized_story": "Lauded nationwide last year for his no-nonsense coronavirus briefings, New York Governor Andrew Cuomo was clinging to his political life Wednesday as prosecutors opened criminal inquiries into sexual harassment allegations against the powerful Democrat.\nNew York state assembly Democrats are poised to complete an impeachment inquiry soon, while three district attorneys are pursuing criminal investigations after Tuesday’s bombshell report found Cuomo sexually harassed multiple women.\nI think he should be charged,” New York Mayor Bill de Blasio, a Democrat, told CBS on Wednesday.\nCuomo has politics in his blood — his father Mario Cuomo served three terms as the Democratic governor of New York state between 1983 and 1994 — and is unlikely to go quietly.\nIf the lower house assembly approves impeachment articles, which now seems all but certain, Cuomo would become the first New York governor to be impeached in more than a century."
  },
  {
    "headline": "Alleged sexual harassment: Criminal probes launched against New York Gov Cuomo",
    "summarized_story": "Lauded nationwide last year for his no-nonsense coronavirus briefings, New York Governor Andrew Cuomo was clinging to his political life Wednesday as prosecutors opened criminal inquiries into sexual harassment allegations against the powerful Democrat.\nNew York state assembly Democrats are poised to complete an impeachment inquiry soon, while three district attorneys are pursuing criminal investigations after Tuesday’s bombshell report found Cuomo sexually harassed multiple women.\nI think he should be charged,” New York Mayor Bill de Blasio, a Democrat, told CBS on Wednesday.\nCuomo has politics in his blood — his father Mario Cuomo served three terms as the Democratic governor of New York state between 1983 and 1994 — and is unlikely to go quietly.\nIf the lower house assembly approves impeachment articles, which now seems all but certain, Cuomo would become the first New York governor to be impeached in more than a century."
  },
  {
    "headline": "BBNaija6: Housemates wade in as Liquorose, Emmanuel fight over trust",
    "summarized_story": "The Big Brother Naija Shine Ya Eye house witnessed a clash between Emmanuel and his love interest, Liquorose as the latter claimed that Emmanuel hurt her feelings.\nConcerning the matter, Pere told Emmanuel, “Don’t make people feel like they have a place in your heart, when they really don’t.\nIf you don’t like her, don’t pursue it, don’t give mixed signals.”Maria also blamed Emmanuel for his lukewarn attitude towards Liquorose, especially after claiming that he really likes her.\nAssuring Liquorose of Emmanuel’s feelings, Beatrice said, “He really likes you, but Emmanuel doesn’t speak much.\nEmmanuel and Liquorose later went to discuss the way forward and Liquorose revealed that what she feels for Emmanuel is beyond friendship."
  },
  {
    "headline": "Abducted Chibok girl, terrorist-husband surrender to Nigerian troops",
    "summarized_story": "A former student of Government Secondary School (GSS) Chibok, in Borno State, and her husband, a Boko Haram-ISWAP terrorist, have surrendered to troops of the Nigerian military in the North East.\nSources said the student was among the over 200 abducted by Boko Haram insurgents seven years ago.\nRecall that on April 14, 2014, Boko Haram terrorists invaded the Borno School and whisked away about than 276 students.\nThey surrendered and presented themselves to troops at an unknown location, within the Lake Chad region.\n“The terrorists’ resolve to surrender may not be unconnected with the destruction of their enclaves and camps by the Nigerian military airstrikes and ground bombardment."
  },
  {
    "headline": "How Redeemed Pastor Bolanle Ibrahim was assassinated on pulpit",
    "summarized_story": "By Kazeem UgbodagaFacts have emerged how Pastor Bolanle Ibrahim of the Redeemed Christian Church of God, RCCG, The King of Kings Parish at Maidan village, Mile 12 area, Lagos was assassinated while praying for mothers and their children.\nThe devastated wife of the deceased, Mrs. Kudirat Ibrahim denounced claims that her husband was a cultist, which was why he was killed by the gunmen.\nNarrating how Pastor Ibrahim was killed, his aunt Mrs. Justina Alebiosu, said before the gunmen killed him, they showed him his picture to identify if he was actually the right person they came for.\nAlebiosu stated that his death was an unfortunate one, as he was a gentleman, saying that Ibrahim converted from Islam to Christianity before becoming a pastor.\n*The earlier photo was found not be Pastor Bolanle Ibrahim’s."
  },
  {
    "headline": "Secondus speaks on PDP crisis, blames party’s ‘Father Christmas’",
    "summarized_story": "By Abankula, with Emmanuel OloniruhaPrince Uche Secondus, the national chairman of the Peoples Democratic Party (PDP), has blamed an unidentified ‘Father Christmas’ for the rumpus in the party.\nHe said the ‘Father Christmas’ party chieftain desires to hijack the structure of the party for “for his disproportionately large ambition”.\nPolitical buffs said Secondus may be referring to Governor Nyesom Wike, who has deep financial pocket, and of course has a post 2023 ambition.\nHe urged party stakeholders to respect the party constitution and approach issues dispassionately in their quest to resolve current challenges.\n“The answers will also help the public to know why few months to PDP national convention, somebody is rooting for a caretaker committee to run the affairs of the party,” Secondus said."
  },
  {
    "headline": "JUST IN: Customs busts pangolin scales exporters in Lagos, 3 suspects arrested",
    "summarized_story": "By AbankulaNigeria Customs Service has busted a network of pangolin scales exporters, a prohibited animal product, after a raid of a house in Lagos.\nThe raid on 28 July was aided by the intelligence provided by the Wildlife Justice Commission.\nAll the wildlife products were destined for export, according to a statement released today by the Customs and the Wildlife Justice Commission.\nThis fact demonstrates the continued availability of pangolin scales and ongoing marketplace demand, despite COVID-19 travelling restrictions.\nAs ivory prices fall, traffickers are increasingly turning to pangolin scales; in combined shipments, the proportion of pangolin scales has surpassed the volume of ivory."
  },
  {
    "headline": "FIRS Awarded N5.2bn Non-Security, Souvenir Contracts In 7 Months",
    "summarized_story": "FEDERAL Inland Revenue Service (FIRS) has awarded contracts for the procurement of souvenirs and non-security documents worth N5.5 billion between January and July 2021.\nAccording to documents available to Nigerian Tribune, FIRS management under the leadership of its Executive Chairman, Muhammad Nami awarded N2.211 billion contracts within the period and another N3 billion for non-security documents.\nIncidentally, many of the contracts were split supposedly to beat federal procurement regulations.\nManagement of FIRS and National Civil Service Union (NCSU) are currently battling in the National Industrial Court over issues of staff welfare.\nOn Monday, some staff accused Nami of over bloating the staff of FIRS by increasing it from 9,409 in December 2019 to over 12,000 currently."
  },
  {
    "headline": "BREAKING: PUMA Terminates $2.67m Contract With Athletics Federation After FG’s Rejection",
    "summarized_story": "PUMA, the German sportswear manufacturer, has ended its four-year partnership with the Nigerian Athletics Federation.\nThe AFN, led by Ibrahim Gusau, reportedly entered a controversial $2.76 million contract with Puma on July 24, 2019, in Doha, according to the PUNCH.\nUnder the terms of the agreement, PUMA will provide Nigeria’s Athletics team with free gear for all age groups for the next four years.\nIn a letter dated Wednesday, August 4, 2021, and signed by the company’s director Manuel Edlheimb, PUMA terminated the contract.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "Boko Haram Terrorists, ISWAP Fighters Surrender To Troops In Borno",
    "summarized_story": "Brigadier General Onyema Nwachukwu, Director Army Public Relations in a statement on Wednesday said, “The terrorists who also surrendered several assorted weapons and incendiaries, comprised 19 male fighters, 19 adult females and 49 children from Njimia village and environs.\n“The terrorists lamented that the ground and condition in the forest have become untenable, hence their surrendering.\n“The terrorists and their families are currently undergoing comprehensive security profiling and preliminary investigations, while the children have been administered with oral polio vaccines.\n“The Chief of Army Staff, Lieutenant General Faruk Yahaya has commended the troops for the sustained offensive and clearance operations conducted in the theatre.\nHe charged them to maintain the momentum of the operations,” the statement said."
  },
  {
    "headline": "Parents Of Kidnapped Islamic School Students Reportedly Give Up, Abandon Kids With Bandits",
    "summarized_story": "Parents of abducted Islamic school children in Niger State’s Tegina Rafi Local Government Area have allegedly abandoned their children to their abductors due to their inability to meet bandits’ newest demands.\nThe parents may have abandoned the children because they were unable to raise the N20 million ransom and six Honda motorcycles worth N3 million demanded by the kidnappers.\nIt will be noted that the parents have collectively contributed N55 million in ransoms on two occasions, yet the children remain in the robbers’ nest.\nWe wanted the government to enter the forest then in Niger state, but some of us refused fearing for the lives of the children.\nAll that we gathered the Bandits collected and still refused to give them back to us."
  },
  {
    "headline": "PDP crisis: Atiku opens up on Portharcourt meeting as Secondus begs aggrieved national officers",
    "summarized_story": "Atiku spoke against the backdrop of speculations that Wike and himself met in Port Harcourt on strategies to get the NWC members sacked.\nThe position followed the rumbling within the major opposition party, culminating in the resignation of its national officers Tuesday.\nWhy will a former vice president be behind the plot to sack PDP National Chairman, Prince Uche Secondus?\nBlueprint correspondent gathered that four representatives of those national officers who resigned met with the embattled national chairman at the party’s national headquarters in Abuja Wednesday.\nThe representatives, Blueprint gathered, told the chairman they would convey his message to the aggrieved national officers and revert to him."
  },
  {
    "headline": "Abducted Chibok girl, ISWAP husband, 77 others surrender",
    "summarized_story": "Seven years after, a former student, who was part of the over 200 abducted girls from Government Secondary School, Chibok in Borno state, has reportedly surrendered alongside her Boko Haram-ISWAP terrorist husband to Nigerian troops.\nOver 200 girls were kidnapped from the secondary school in Chibok in April 14, 2014.\nRecently gunmen attacked a Baptist Secondary School in Kaduna and abducted dozens of students from their dormitories.\nLess than a quarter of the kidnapped students have since been freed by security operatives in shootouts with the bandits.\nThe attack occurred just over three weeks after 169 students were abducted by armed bandits from an Islamic school in Niger State."
  },
  {
    "headline": "Breaking: Rihanna now richest female musician – Forbes",
    "summarized_story": "Rihanna is officially a billionaire, and subsequently the wealthiest female musician in the world.\nAccording to Forbes, Rihanna is now worth $1.7 billion (£1.2 billion), primarily thanks to the value of her industry-shaking cosmetics brand Fenty Beauty, which is estimated to be worth $1.4 billion.\nRihanna has also earned the rest of her fortune from her lingerie company, Savage x Fenty, which is reportedly valued at $270m (£193m), and from her earnings as a musician and actor.\nThe mogul’s fortune comes at an interesting time, however, with Rihanna having largely retreated from the industry that made her name.\nIt has been five years since Rihanna released an album, and despite fans endlessly calling on Rihanna to unveil new music, she has been largely focused on her non-music businesses."
  },
  {
    "headline": "77 terrorists surrender to troops in Northeast -NigPilot",
    "summarized_story": "Director Army Public Relations, Brigadier General Onyema Nwachukwu in a statement said the terrorists who also surrendered several assorted weapons and incendiaries, comprised 19 male fighters, 19 adult females, and 49 children from Njimia village and environs.\nHe said that the terrorists lamented that the ground and condition in the forest have become untenable, hence their surrendering.\nHe said that the terrorists and their families are currently undergoing comprehensive security profiling and preliminary investigations, while the children have been administered oral polio vaccines.\nThe Chief of Army Staff, Lieutenant General Faruk Yahaya has commended the troops for the sustained offensive and clearance operations conducted in the theatre.\nHe charged them to maintain the momentum of the operations."
  },
  {
    "headline": "NPF commends NAPAAS for improving welfare of retired Officers -NigPilot",
    "summarized_story": "Nigeria Police Force, NPF, has applauded the National Personal Assert Acquisition Scheme, NAPAAS, for its feat in taking care of the family of those who paid to supreme their price in the protection of the life of the citizenry.\nThe Inspector-General of Police, Usman Baba who was represented by the Commissioner of Police Obe Rudolf stated this during the inspection visit at the Muhammadu Buhari NAPAAS Centre Dawarki Abuja.\nHe admonished them to continue in the fight against poverty and unemployment.\nResponding, the Managing Director NAPAAS Wali Aminu-Bello commended the effort of the Nigeria Police Force in fighting crime and insecurity in the country and asked for their support and collaboration.\nNational Personal Assets Acquisition Scheme, NAPAAS, is an economic empowerment program for an improved standard of living, self-reliance, self-sustenance, the eradication of poverty, crime, and insecurity and create an opportunity for employment, rehabilitation & re-integration, and wealth creation for interested ex-servicemen, ex-paramilitary and organized pension bodies."
  },
  {
    "headline": "Ekiti Assembly Approves Creation Of Additional Local Govts",
    "summarized_story": "Ekiti State House of Assembly has approved the creation of 19 Local Council Development Areas (LCDA) in the State.\nThe approval was consequent on the passage of a bill for a law to provide for the creation of new Local Government Areas in Ekiti State and other Related Matters, 2021.\nThe bill was unanimously passed at Wednesday’s plenary held in Ado-Ekiti and presided over by the Speaker, Rt Hon.\nThe bill was unanimously passed at Wednesday’s plenary held in Ado-Ekiti and presided over by the Speaker, Rt Hon.\nThe Assembly also screened and confirmed members of the Ekiti State Audit Service Commission."
  },
  {
    "headline": "NSSEC to promote Nigeria education standard -NigPilot",
    "summarized_story": "Federal Government has disclosed its resolve to promote the standard of senior secondary education so as to meet global standards.\nThe Executive Secretary, National Senior Secondary Education Commission, NSSEC, Dr. Benjamin Abakpa disclosed this when Youthhub Africa paid a working visit on him in Abuja, recently.\nAbakpa stated that the Senior Secondary Education has been in existence without a supervisory commission and it has affected the education effectiveness to meet the need of the society.\nAccording to him, the creation of NSSEC is to reposition a new senior secondary Education that will meet the societal need and compete with their counterparts anywhere in the world.\nHe further called on Development Partners to collaborate with the commission to restore the good image of the senior secondary education in the nation."
  },
  {
    "headline": "FG Approves $1.4bn For Rehabilitation Of Warri, Kaduna Refineries",
    "summarized_story": "The Federal Executive Council has approved contracts for the rehabilitation of Warri and Kaduna refineries at a cost of $1.4 billion.\nAccording to Mr Sylva, the rehabilitation of the refineries will be carried out in three phases.\nFixing the refineriesNigeria has four refineries – including two in Port Harcourt – but all have struggled to function optimally as the country continues to import petroleum products.\nThe rehabilitation is expected to turn around the refineries and set them up to meet national oil demands.\n“We will be the supplier for West Africa legitimately and also many other parts of the world.”The rehabilitation’s success can also have a positive impact on the street-level price of petroleum products such as petrol."
  },
  {
    "headline": "Tinubu Hale And Hearty, Sanwo-Olu Says After UK Trip",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu on Wednesday said the National Leader of the ruling All Progressives Congress (APC), Bola Tinubu is hale and hearty.\nBut the governor debunked the rumours, adding that he and Tinubu both held talks on happenings in APC and across the country.\nTo buttress his point, the Lagos governor also shared pictures of him explaining something to the party’s national leader.\nREAD ALSO: Tinubu Is Hale And Hearty, Requires No Hospitalisation – AideOn when Tinubu would likely return to Nigeria, the governor didn’t give any specific date.\nRather, he said the APC leader will decide when he will return from his foreign trip."
  },
  {
    "headline": "Court Grants Igboho’s Aides Bail",
    "summarized_story": "A Federal High Court sitting in Abuja has granted bail to the 12 aides of Sunday Adeyemo popularly known as Sunday Igboho.\nDelivering the ruling on the application filed by the 12 applicants before the court, the presiding Judge, Justice Obiora Egwuatu, said it is clear that no charge has been brought against Sunday Igboho’s aides since their arrest.\nThe 12 applicants are however to remain the custody of the DSS until they are able to perfect all conditions for their bail.\nThe court then ordered the security agency to produce all the 12 aides.\nIn obedience to the court order, the DSS on Wednesday produced all 12 detained aides before the Federal High Court in Abuja."
  },
  {
    "headline": "Court Restrains DSS, AGF From Arresting Sunday Igboho, Blocking His Bank Accounts",
    "summarized_story": "The court also restrained the DSS and Mr. Malami from intimidating, harassing, and blocking the bank accounts of Mr. Igboho.\nThe presiding Judge, Justice Akintola gave the order on Wednesday following an ex-parte motion moved by Mr. Igboho’s lawyer Yomi Aliu (SAN) at the court.\nREAD ALSO: DSS Obeys Court Order, Produces All Sunday Igboho’s AidesSpeaking to journalists after the court proceedings, Mr Aliu said “The court has ordered that he must not be arrested, detained, killed in the next 14 days”.\nThe court order comes the same day when the DSS produced all 12 detained aides of Mr Igboho before the Federal High Court in Abuja.\nIgboho and his wife were arrested in Cotonou on July 19, while they tried to catch a flight to Germany."
  },
  {
    "headline": "Alleged Rape: Benue Govt Closes Case Against Lecturer Over Death Of Ochanya",
    "summarized_story": "After calling eight witnesses, the Benue State Government on Wednesday closed its prosecution of a suspended senior lecturer at the Benue State Polytechnic, Ugbokolo, Andrew Ogbuja who was alleged to have raped to death 13-year-old girl, Ochanya Ogbanje.\nMr Ogbuja’s son, Victor, who is now at large, is a second suspect in the case but the police are yet to arrest him or even declare him wanted.\nThe government had on October 10, 2019, arraigned Mr Ogbuja, a 57-year-old, before a Makurdi High Court on a four-count charge bordering on rape and murder of Miss Ogbanje.\nSubsequently, the prosecuting lawyer, Mr Ukande closed the state government’s case against Mr Ogbuja.\nOchanya died on October 17, 2018 from alleged complications said to have resulted from her prolonged rape by the father and his fugitive son."
  },
  {
    "headline": "Troops Avert Attack in Zango Kataf LGA in Kaduna, Arrest One Suspect",
    "summarized_story": "Troops of Operation Safe Haven, on Wednesday averted an attack by gunmen on a village in Zangon Kataf local government area, that’s in Kaduna State.\nThe troops who were on ground responded to a distress call, mobilized to the village and engaged the assailants, successfully repelling them.\nA resident of the village was however hit by a stray bullet during the attempted attack and is receiving treatment.\nOn receiving the report, Governor Nasir El-Rufai thanked the troops and commended their alertness in averting the attack promptly.\nHe also urged security agencies to ensure a thorough investigation into the situation."
  },
  {
    "headline": "FEC approves $11.17 billion coastal rail project",
    "summarized_story": "The Federal Executive Council has approved the sum of $11.17bn for a Coastal rail project that is expected to link all of Nigeria’s coastal cities in six years.\n“The first one has to do with the Kano-Jibia rail and the other one has to do with the Port Harcourt-Maidugiri rail.\n“Today, the council has given approval to commence the Lagos-Calabar Coastal rail.\n“This particular route is very important because after the Lagos-Kano route, this Lagos-Calabar Coastal route actually will link all the coastal cities in the country.\n“This particular route is very important especially for our coastal economy and will cost 11."
  },
  {
    "headline": "Boko Haram/ ISWAP Fighters Surrender To Troops In Borno",
    "summarized_story": "A group of insurgents and their families have surrendered to troops of Foward Operational Base In Bama Local Government Area.\nThis development is contained in a statement signed by Director Army Public Relations Brigadier General Onyema Nwachuku.\nThe terrorists who also surrendered several assorted weapons and incendiaries comprised 19 male fighters, 19 adult females and 49 children from Njimia village and environs.\nThe terrorists lamented that the ground and condition in the forest have become untenable, hence their surrender.\nThe terrorists and their families are currently undergoing comprehensive security profiling and preliminary investigations, while the children have been administered with oral polio vaccines."
  },
  {
    "headline": "Ivory Coast President Ouattara to Self-isolate After Covid-19 Contact – Arise News",
    "summarized_story": "Ivory Coast President Alassane Ouattara says he will self-isolate after coming in contact with someone who later tested positive for COVID-19, his office said in a statement on Tuesday.\nIvory Coast currently has 50 499 COVID-19 cases, with 49 553 recoveries and 332 deaths.\nEarly last month, the West African country began sending mobile clinics to markets and other busy areas in its main city Abidjan in an effort to turbocharge the vaccination campaign against COVID-19.\nLike many African countries, Ivory Coast has seen vaccinations get off to a slow start due to limited supplies as well as wariness or indifference toward the vaccines.\nIvory Coast has received about a million doses of the AstraZeneca, Pfizer and Sinopharm vaccines to date, and the government says it expects to take delivery of 1.2 million more doses by mid-July."
  },
  {
    "headline": "Jacob Zuma to Stand Trial in Person Next Week, Despite Security Concerns",
    "summarized_story": "A court in South Africa says former President, Jacob Zuma will be allowed out of prison on Tuesday next week to appear in person at a corruption trial.\nThis will be the second time Zuma will appear in public since he was taken into custody last month.\nProsecutors had argued in favour of a virtual trial – citing the pandemic, and security concerns.\nBut a judge has now backed Zuma’s request to leave his prison cell and appear in person in Pietermaritzburg.\nThe trial relates to a 1990s arms deal, and allegations that Zuma received bribes."
  },
  {
    "headline": "Chemutai Becomes First Ugandan Woman to Win Olympic Medal – Arise News",
    "summarized_story": "Peruth Chemutai became the first Ugandan woman ever to win an Olympic medal as she claimed gold in the women’s 3000m steeplechase.\nThe 22-year-old Uganda set a new national record as she chased down the USA’s Courtney Frerichs, who won silver at the 2017 World Championships, on the final lap and pulled away to win by 20 metres.\nKenya’s Hyvin Kiyeng had to settle for the bronze medal to go with the silver she won in the same event at the Rio Games in 2016."
  },
  {
    "headline": "Nigeria: PDP Governors Speak on Resignation of Seven National Officers",
    "summarized_story": "The Peoples Democratic Party (PDP) Governors’ Forum has appealed to members and ‘stakeholders’ of the party to remain calm over Tuesday resignation of seven national deputy officers of the party.\n“The Governors hereby call on all members of the party and indeed all stakeholders to remain calm in the face of the developments.\nSeven deputy national officers of the party on Tuesday resigned their positions as members of the National Executive Council.\nThe seven national officers are Deputy National Publicity Secretary, Diran Odeyemi; Deputy National Legal Adviser, Ahmed Bello; Deputy National Women Leader, Umoru Hadizat; Deputy National Auditor Divine Amina Arong; Deputy National Organising Secretary, Hassan Yakubu; and Deputy National Financial Secretary, Irona Alphonsus.\nThe officers cited the incompetence of the party’s National Chairman, Uche Secondus, in managing the affairs of the party."
  },
  {
    "headline": "Court Restrains Nigeria’s Secret Police from Arresting Yoruba Nation Agitator Sunday Igboho",
    "summarized_story": "An Oyo State High Court has admitted an ex-parte motion restricting the Nigerian Department of State Services (DSS) and Attorney-general of the Federation from “arresting, intimidating, harassing, and blocking bank accounts of Sunday Adeyemo better known as Igboho”.\nJustice Ladiean Akintola of the high court in Ibadan, the Oyo state capital gave the order following an ex-parte motion moved by his lawyer, Yomi Aliu on Wednesday.\nThe motion arose from the originating motion seeking N500 billion damages for the invasion of the Yoruba nation leader’s house by officers of the Department of State Services in Ibadan on July 1.\n“The court has ordered that he must not be arrested, intimidated, harassed, detained, or killed.\nThe court also said that his account should not be blocked,” the senior lawyer, Aliu told reporters after the sitting."
  }
]