[
  {
    "headline": "NPO, stakeholders tackle Reps over press regulation bill",
    "summarized_story": "The Nigerian Press Organisation, which comprises the Newspaper Proprietors’ Association of Nigeria, Nigerian Guild of Editors and the Nigerian Union of Journalists, has called on the House of Representatives to step down a bill seeking to amend the Nigerian Press Council Act, saying it is still a subject of litigation at the Supreme Court.\nSeveral media organisations and groups also criticised various clauses in the bill as discouraging freedom of speech and press in the country.\nThe House Committee on Information, National Orientation, Ethics and Values, which organised the hearing on the bill, however, insisted on going ahead with the exercise.\nHe said, “So, I am sorry if there is anybody who thinks we did not invite them.\nThe memo was signed by the Executive Director, IPC, Lanre Arogundade; Executive Director, MRA, Edetaen Ojo; Executive Director, CMLA, Richard Akinnola; and Executive Director, PTCIJ, Dapo Olorunyomi."
  },
  {
    "headline": "NCS isolates Atuche, Anyanwu over COVID-19, convicts plan appeal",
    "summarized_story": "A former Managing Director of the defunct Bank PHB, Francis Atuche, and the bank’s Chief Financial Officer, Ugo Anyanwu, have been put into isolation by the Nigerian Correctional Service, Lagos State Command, pending the outcome of investigations into their COVID-19 status.\nJustice Lateefa Okunnu of the Lagos State High Court, Ikeja, on Wednesday sentenced Atuche to 12 years’ imprisonment for N25.7bn fraud.\nAnyanwu was sentenced to 10 years’ imprisonment for stealing and conspiracy to steal, while Atuche’s wife, Elizabeth, was discharged and acquitted.\nThe EFCC had in 2011 arraigned the defendants before Justice Okunnu over N25.7bn fraud.\nA spokesperson for the Nigerian Correctional Service, Lagos State, Mr Rotimi Oladokun, when contacted on Thursday on if the convicts had been received by the service, said he would call back."
  },
  {
    "headline": "478 candidates, 14 political parties to participate in FCT Council Polls — INEC",
    "summarized_story": "“In the case of the FCT Area Council elections, political parties have concluded their primaries for the 68 constituencies made up of 6 Area Council Chairmen and 62 Councillors.\nA total of 14 out of 18 political parties have nominated 110 candidates for Chairmanship/Deputy Chairmanship positions and 362 candidates for Councillorships.\n“Altogether, 14 political parties have nominated 472 candidates to vie for 68 elective positions in the FCT.\n“However, only seven out of 14 political parties have responded in the case of Edo State and eight out of 17 for Ondo State.\nWe wish to remind political parties of the consequences of the failure to do so as enshrined in the Electoral Act."
  },
  {
    "headline": "Insecurity: Tambuwal urges Buhari not to abdicate constitutional responsibility",
    "summarized_story": "Aminu TambuwalBy Musa Na Annabi – SokotoGovernor Aminu Waziri Tambuwal of Sokoto state has appealed to President Muhammadu Buhari not to shy away from his responsibility as the Commander in Chief of the Federation in the face of the intractable security challenges across the country.\nGovernor Tambuwal took a swipe at a recent statement credited to the Presidency which blamed state Governors for security lapses in their respective states.\nTambuwal explains that as a Governor, if he gives a particular directive to the Garrison Commander, Director SSS, or any commander in the paramilitary forces, they have to clear from Abuja.\nHe added that those bosses they are answerable to must in turn report to the President who is the Commander in Chief as stipulated by the Constitution of the Federal Republic of Nigeria.\nHe, however, observed that agricultural undertakings now are precarious as a result of the challenges of funding and insecurity."
  },
  {
    "headline": "Emir promises to sustain UNICEF programmes in Daura",
    "summarized_story": "Alhaji Farouk Umar-Farouk, Emir of Daura, Katsina State, has promised to continue to sustain UNICEF-sponsored programmes in his domain.\nThe emir made the pledge on Thursday in Daura when Mr Moulid Warfa, Head, UNICEF Kano Field Office, visited him.\nThe traditional ruler commended UNICEF for its Girl-Child Education Project’ (GEP) aimed at enrolling female children in primary schools.\n“It promoted mass enrolment of female children into primary schools, engagement of qualified teachers and capacity building for headteachers.\nThe UNICEF official further said that the programme was used to sensitise parents on the benefits of girl-child education."
  },
  {
    "headline": "Drop press regulation bill, allow free speech, media bodies tell Reps",
    "summarized_story": "Media organisations and groups yesterday asked the House of Representatives to drop all press regulations bills before it, arguing that clauses contained in them discourage freedom of speech and press in the country.\nThe House Committee on Information, National Orientation, Ethics and Values, which organised the hearing on the bill, however, insisted on going ahead with the exercise.\nI urge this House to also consider a similar step.”Odebunmi, however, argued that the House was doing its constitutional job.\nAlso, the International Press Centre, Media Rights Agenda, Centre for Media Law and Advocacy and the Premium Times Centre for Investigative Journalism, in a joint memorandum, titled ”For a Truly Independent and Media Freedom Friendly Nigeria Press Council”, called on the National Assembly to expunge all laws intended to criminalise free speech and press.\n“The power to determine sanctions relating to hefty fines should be vested in the courts and not the council."
  },
  {
    "headline": "2023: Leaders’ll sit at appropriate time to decide next Delta Gov — Clark",
    "summarized_story": "…commends Amori led DC-23 lobby groupBy Festus Ahon, ASABANational leader of the Niger Delta region, Chief Edwin Kiagbodo Clark, has said leaders would seat down at the appropriate time to decide who would be Delta State Governor in 2023.\nAmori said the “DC-23 is a lobby group made up of card carrying members of the PDP in Delta Central Senatorial District with the aim to lobby for the governorship seat to rotate to the Central come 2023”.\nHe appealed to Chief Clark to help prevail on their Ijaw brothers to see reason with Delta Central Senatorial District on the need to strengthen the zoning arrangement on senatorial order for peace and stability.\nOyovbaire said: “The moment we reduce the Nigeria or Delta state zoning arrangement to ethnic line, we will be in trouble.\nSo we are pleading with our leader to prevail on our Ijaw brothers to reason in same line with us”."
  },
  {
    "headline": "Why we suspended payment of local government workers' salaries",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has revealed the reason for the delay in the payment of salaries of local government workers for the month of May.\nThe Governor said security reports he got indicated that outgoing local council chairmen may leave office with the local government allocation for the month of May.\nSpeaking during the swearing in ceremony, governor Wike disclosed that he ordered the suspension of the payment of May salaries to prevent some outgoing chairmen from leaving with the People’s money.\n“So, I decided to suspend the payment of salaries to local government workers.”The governor, however, directed the newly sworn in chairmen to ensure that former council chairmen and their appointees as well as councillors recieve their salaries first before they carry on with their official duties.\nGovernor Wike also charged the new council chairmen to take environmental sanitation seriously, particularly in Eleme, Oyigbo, Obio Akpor and Port Harcourt city local government areas."
  },
  {
    "headline": "UNIBEN lecturer shot dead in Benin",
    "summarized_story": "A member of the Academic Staff Union of Universities, ASUU, University of Benin chapter, Maxwell Eseosa Aimuen has been shot dead by a yet-to-be-identified gunmen.\nDAILY POST gathered that the 33-year-old lecturer was killed on Saturday at his residence in Isihor, Benin City, the Edo State capital.\nGunmen invade, set Abakaliki court ablazeThe Public Relations Officer of the university, Benedicta Ehanire, confirmed the incident to reporters in Benin.\nThe PRO who described the late Maxwell as hard working and dedicated university staff, called on security agencies to bring the perpetrators to book.\nWhen contacted, the Edo State Police Public Relations Officer, PPRO, Kontongs Bello was unable to take calls."
  },
  {
    "headline": "We won't take over Ebubeagu",
    "summarized_story": "Apex Igbo socio-cultural organization, Ohanaeze Ndigbo, on Thursday, said it has rejected calls from well-meaning Igbos to take over the Southeast Security Outfit, Ebubeagu.\n“The Southeast governors should be encouraged to sufficiently provide necessary logistics and reinstate the chairman of the Security Committee who resigned based on logistics’ deficiencies.\nThe scribe added that Ohanaeze Ndigbo was not saddled with the Constitutional rights of protection of lives and properties in the Southeast.\n“We are independently funded through communal support of Ndigbo without any government consent, it will be horrible to heap the responsibility of Ebubeagu on us.\n“Southeast Governors are capable of providing logistics and we are in full support of them,” he noted."
  },
  {
    "headline": "Nigerians love me, that's why I'm paying them back",
    "summarized_story": "President Muhammadu Buhari has said that he is committed to serving Nigerians because of the love the citizens have for him.\nAccording to Buhari, providing adequate security and livelihood is a debt of gratitude he owed Nigerians for giving him the opportunity to serve.\nBuhari loves Nigerian youths, provides opportunities for them – Yahaya Bello“My commitment to serve Nigerians is a payback for the love shown to me.\nI started my political adventure in Maiduguri and I always look forward to coming here,” he added.\nSpeaking further, Buhari commended State Governor for his forthrightness, resilience and drive in bringing development to the state, despite security challenges."
  },
  {
    "headline": "Kenneth Kaunda: Atiku reacts to death of Zambia’s first president",
    "summarized_story": "Former Peoples Democratic Party, PDP, presidential candidate, Atiku Abubakar, has reacted to the death of ex-Zambian President, Kenneth Kaunda.\nAtiku said Kaunda’s death marks the end of an era of liberation.\nThe former Vice President said the late Zambian President was an epitome of African struggle for liberation.\nIn a tweet, Atiku wrote: “Former President Kenneth Kaunda was the last of his generation that epitomised the liberation struggle on the African continent.\nEx-Zambian President, Kenneth Kaunda is dead, Jonathan reacts“His passing away is the end of an era."
  },
  {
    "headline": "Wike warns council chiefs on borrowing",
    "summarized_story": "By Mike Odiegwu, Port HarcourtRivers State Governor, Nyesom Wike, has warned the newly sworn-in chairmen of the 23 local government areas of the state against borrowing money without first notifying the state government.\nWike said the caution was necessary to stem the unguarded desire of some council chairman to access money without any developmental plan.\nHe said: “Don’t go and borrow money without the state government’s approval.\n“You have no authority to go and borrow money.\nEven we as State government, before we go and borrow money we get approval from the Debt Management Office."
  },
  {
    "headline": "Okowa sends 17 commissioners-designate to Assembly",
    "summarized_story": "By Okungbowa Aiwerie, AsabaDelta State Governor Ifeanyi Okowa has sent names of 17 commissioners-designate to the State House of Assembly for screening and confirmation.\nThe Speaker, Sheriff Oborevwori yesterday read the names on the floor of the House during plenary.\nThose nominated for appointment as commissioners are Mr Charles Ehiedu Aniagwu, Dr Barry Gbe, Mr. Ifeanyi Egwuyenga, Mr Arthur Akpowowo, and Mr Festus Ochonogor.\nOthers include Mrs. Flora Alanta, Mr Churchill Amagada, Jonathan Igworiwoh, Mrs Evelyn Oboro, Mr. Noel Omordon, Fidelis Tilije, and Mrs Rose Esenwu.\nAlso nominated are Mr. Lawrence Ejiofor, Mrs Shola Ogbemi-Daibo, Mr Chris Onogba, Kate Oniawan, and Mr John Onyema."
  },
  {
    "headline": "Gas explosion in Delta community injures two, destroys properties",
    "summarized_story": "By Polycarp Orosevwotu, UghelliTwo persons identified as Terry Okagbare and Matthew Idama were reportedly injured and properties worth millions of naira destroyed as gas pipeline belonging to Nigeria Petroleum Development Company, NPDC, exploded at its facility, at Well 38, Okpare-Olomu Community, Ughelli South Local Government Area, Delta State.\nThe incident, which was said to have occurred at 8:45 a.m yesterday, had caused a lot of damage that has affected the community.\nADVERTISEMENTIn a chat with reporters at the community Secretariat, the President of Okpare-Olomu Community, Mr Stephen Asheshe, the Secretary, Comrade Ochuko Omorere, said the explosion threw the community into panic.\nThey said the gas facility which is under the Utorogu Gas Station erupted from the gas head, destroying Vigilante Sienna, Motorcycle, the perimeter fence of the facility, cassava farms, security post, with the security man injured.\nThe community representative, who attributed the explosion to gross negligence and impunity on the part of NPDC has called on the Operational Manager of NPDC, other authorities involved to come to their aid to avoid further explosions since all the pipelines have been abandoned for years."
  },
  {
    "headline": "Police move to rescue abducted Rivers Utd coach Eguma",
    "summarized_story": "By Damian Duruiheoma, EnuguEnugu Police command has begun an operation to rescue the abducted manager of Rivers United Football Club, Stanley Eguma.\nEguma was reported to have been kidnapped by gunmen on Tuesday in Enugu on his way from Gombe State where his team lost to Adamawa United on Sunday.\nEnugu police spokesman ASP Daniel Ndukwe said the Commissioner of Police, Mr Mohammed Aliyu, has ordered the immediate rescue of Eguma.\nThe CP ordered that no stone should be left unturned in the already launched full-scale investigation to rescue the coach.\nHe also ordered the arrest of the yet-to-be identified gunmen, alleged to have abducted him on 15/06/2021 at about 1600hrs, along Enugu/Port-Harcourt Expressway."
  },
  {
    "headline": "UTME 2021: JAMB blacklists 18 CBT centres for infraction",
    "summarized_story": "By Gabriel DikeJoint Admissions and Matriculation Board (JAMB) has delisted 18 Computer Based Text (CBT) centres from among 820 approved centres for use in the 2021 Unified Tertiary Matriculation Examination (UTME).\nThe decision to blacklist the 18 CBT centres was taken after their underperformance during recent 2021 UTME mock examination nationwide.\nAlso, JAMB management placed 14 CBT centres under watch for various offences noticed during the conduct of the 2021 UTME mock examination.\nThe 2021 UTME will hold between Saturday, June 19, and July 3nationwide and in some foreign countries.\n“All examination officials, including the security agents, are to ensure compliance with all guidelines, rules and regulations on the examination,’’ JAMB said."
  },
  {
    "headline": "FG tightens noose on social, online media",
    "summarized_story": "However, stakeholders in the media industry kicked against the proposal which came barely a week after the NBC had asked all social media platforms and online broadcasting service providers to apply for a broadcast licence.\nGovernment moved to license social media companies after Twitter took down a tweet by President Muhammadu Buhari, after stating that the message violated its policy.\nThey argued that inclusion of internet broadcast and online media to the category of broadcast service licenses to be issued by the NBC will be injurious to freedom of expression and press freedom.\nOnly recently, NBC had asked all social media platforms and online broadcasting service providers to apply for broadcast licence.\nIts Director General, Armstrong Idachaba, gave the directive in a newspaper advertorial following Federal Government’s announcement that Twitter and other social media platforms must register as a Nigerian company for them to do business in Nigeria."
  },
  {
    "headline": "Baba Ijesha denied bail, to be tried in high court",
    "summarized_story": "By Romanus Okoye and Lukman OlabiyiYaba Chief Magistrate Court, yesterday, denied Nollywood actor, Omiyinka Olanrewaju, popularly known as Baba Ijesha, bail, on the ground that the same charge was already before a Lagos State High Court.\nThis sets the stage for trail of the actor at the High Court on charges bothering on rape, sexual assault and abuse of a minor.\n“Since there are indications that the matter is before the high court and the defendant will appear before the court, no bail can be given.\nBaba Ijesha was brought into the magistrate court premises around 12 noon, alongside other suspects.\nWhile in the dock, Baba Ijesha showed signs of discomfort as he kept bending intermittently."
  },
  {
    "headline": "Tanker explosion claims 7 lives at Idiroko",
    "summarized_story": "The Federal Road Safety Corps (FRSC) confirmed that seven persons died in an explosion after a commercial bus collided with a petrol tanker at Ajilete on Idiroko Expressway, yesterday.\nFRSC Idiroko Unit Commander, Akinwunmi Olaluwoye, said two other persons sustained injuries in the accident which happened at about 8.45am.\nHe said that the bus rammed into a tanker laden with 33 litres of petroleum product, while it was ascending the sloppy Ajilete road.\nNine persons were involved in the accident which claimed seven lives, leaving two others with various degrees of injury."
  },
  {
    "headline": "Gunmen behead Imo lawmaker’s guard, APC chieftain",
    "summarized_story": "The guard was said to have been overpowered by a large number of hoodlums who invaded the lawmakers house.\nSimilarly, Daily Sun gathered that the gunmen also beheaded an All Progressives Congress (APC) chieftain in the area, Jonathan Ugochukwu.\nWife of the APC chieftain, Mrs Nkechi Ugochukwu, disclosed that the gunmen carried her husband outside and beheaded him before torching their house.\nA community source also revealed that the rampaging gunmen also left with the head of the lawmaker’s guard.\n“They also invaded the house of another APC chieftain here, Jonathan Ugochukwu, burnt his house, beheaded him and left with his head."
  },
  {
    "headline": "Zambia’s First President, Kenneth Kaunda, is Dead",
    "summarized_story": "Kenneth Kaunda, Zambia’s first president and a key figure in its independence struggle, has died at the age of 97, his family has confirmed.\nKaunda was admitted to a hospital in the capital Lusaka on Monday suffering from pneumonia.\nIn the 1950s, Kaunda was a key figure in what was then Northern Rhodesia’s independence movement from Britain.\nAs head of the left-leaning United National Independence Party (UNIP), Kaunda then led the country through decades of one-party rule.\nKaunda – popularly known as KK – was a strong supporter of efforts to end apartheid in South Africa."
  },
  {
    "headline": "Keep CBN Overdrafts within Legal Limits, IMF Tells FG",
    "summarized_story": "Says banking sector remains liquid, well capitalisedBy Ndubuisi FrancisThe International Monetary Fund (IMF) has advised the federal government to keep reliance on overdrafts from the Central Bank Bank of Nigeria ((CBN) within legal limits.\nAccording to the IMF, real gross domestic product (GDP) is recovering but unemployment and inflation remain elevated, noting that recent exchange rate measures were encouraging.\nThe IMF mission recommended stepping up efforts to strengthen tax administration to mobilise additional revenues and help address priority spending pressures.\nIt also described as encouraging the recent removal of the official exchange rate from the CBN website and measures to enhance transparency in the setting of the NAFEX exchange rate.\nThe IMF called for the sustenance of the momentum towards fully unifying all exchange rate windows and establishing a market-clearing exchange rate."
  },
  {
    "headline": "Buhari: With Inter-agencies’ Synergy, Insurgents Now Feeling Ferocity of Our Firepower",
    "summarized_story": "I am therefore pleased to acknowledge that the military and other security agencies including civilian stakeholders are adhering to the true spirit of Operation HADIN KAI which implies jointness, synergy and cooperation,” Buhari added.\n“Concerted efforts are being made to fast-track re-construction and development programmes in the affected communities in the North East,” the President added.\nHe said he would continue to ensure that wounded soldiers received the best medical attention towards their full recovery.\nUnder my watch, the Armed Forces of Nigeria have been provided a firm strategy and clear sense of direction to safeguard the sovereignty and territorial integrity of the country,” the President said.\n“As personnel of our Armed Forces and security agencies, you must understand that these items of equipment must be put to good use against the terrorists and other criminal elements."
  },
  {
    "headline": "Buhari Visits ‘Operation Hadin Kai’ in Borno, Says Counter-insurgency War Must be Brought to Logical Conclusion",
    "summarized_story": "Your collective efforts have resulted in the relative peace being enjoyed in the region today.\nThe defence and security agencies should rest assured of the Federal Government’s unalloyed commitment to winning the battle against terror and criminality.\nSide by side with the efforts of the Armed Forces and security agencies, this Administration is developing a strategy for post-war reconstruction and peace-building.\nAlongside investment in development and reconstruction, we will sustain our investment in the Armed Forces in a manner that balances the “carrot and stick”.\nMuch more equipment will be procured for the Armed Forces to cater for both the short and long-term requirements."
  },
  {
    "headline": "Buhari, on Official Visit, Arrives Borno to Rousing Welcome",
    "summarized_story": "Maiduguri, the Borno State capital, is agog for President Muhammadu Buhari’s official visit to the state.\nThe president is in the state for a day official visit where he is expected to assess the security situation in the North-east, which has been battling with Boko Haram crisis for 12 years now.\nAlso in Maiduguri, the president is expected to commission some projects he sponsored in the state to address the relocation of internally displaced persons (IDPs), and some of the projects built by Governor Babagana Zulum.\nThe president touched down at the Nigeria Air Force Base in Maiduguri at 10.15 am where he was welcomed by the governor and other dignitaries.\nPresident Buhari has already started commissioning projects in the town and he is later expected to visit the palace of the Shehu of Borno and to have a meeting with the service chiefs who arrived the town on Wednesday ahead of the Commander-in-Chief."
  },
  {
    "headline": "BREAKING: Bandits Invade Federal Government College In Kebbi, Abduct Students",
    "summarized_story": "Bandits have abducted some students at Federal Government College, Birnin Yauri in Kebbi State.\nDetails of the incident are still sketchy, according to Daily Trust, but there are reports that a security operative was shot dead during the operation, though the killing of the security operative could not be confirmed.\nThwre have been a series of attacks on schools and abduction of pupils and students in Northern Nigeria.\nThe gunmen abducted two lecturers and eight students, according to Samuel Aruwan, the state's commissioner of internal security.\nAruwan confirmed that two students were shot; one died while the other was being treated in hospital."
  },
  {
    "headline": "BREAKING: Bandits Invade Federal Government College In Kebbi, Abduct Students",
    "summarized_story": "Bandits have abducted some students at Federal Government College, Birnin Yauri in Kebbi State.\nDetails of the incident are still sketchy, according to Daily Trust, but there are reports that a security operative was shot dead during the operation, though the killing of the security operative could not be confirmed.\nThwre have been a series of attacks on schools and abduction of pupils and students in Northern Nigeria.\nThe gunmen abducted two lecturers and eight students, according to Samuel Aruwan, the state's commissioner of internal security.\nAruwan confirmed that two students were shot; one died while the other was being treated in hospital."
  },
  {
    "headline": "EXPOSED: Nigeria's Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently currying the favour of the National Assembly's top echelon by awarding to them Bureau de Change licences.\nSaharaReporters learnt that principal and vocal members of the National Assembly have been awarded the licences by Emefiele so that they could mellow down on the several probes of infractions and misappropriations concerning the CBN.\nThe attempts by the National Assembly to probe into these CBN NIRSAL allegations had reportedly prompted the 'settlement' by the CBN governor.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "EXPOSED: Nigeria's Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently currying the favour of the National Assembly's top echelon by awarding to them Bureau de Change licences.\nSaharaReporters learnt that principal and vocal members of the National Assembly have been awarded the licences by Emefiele so that they could mellow down on the several probes of infractions and misappropriations concerning the CBN.\nThe attempts by the National Assembly to probe into these CBN NIRSAL allegations had reportedly prompted the 'settlement' by the CBN governor.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "Sowore Lambasts UFC Star, Usman, For Posing With Nigerian Leaders He Knocked During EndSARS Killings",
    "summarized_story": "Human rights activist, Omoyele Sowore, has lambasted Ultimate Fighting Championship star, Kamaru Usman, for posing with Nigerian politicians, including Lagos State Governor, Babajide Sanwo-Olu who superintended the October 2020 EndSARS killings at the Lekki Tollgate.\nUsman had been critical of the roles of the Nigerian leaders during the recent EndSARS violence which engulfed several parts of the country.\npic.twitter.com/ADUXvlh9E0 — Omoyele Sowore (@YeleSowore) June 17, 2021In the photographs shared by Sowore, Usman posed with the Lagos State Governor, Sanwo-Olu, and posed with Kogi State Governor, Yahaya Bello in another photograph.\nNigerian elites and corrupt politicians are quick to celebrate a successful Nigerian who made their mark outside Nigeria...What happened to our hidden talents back home?.\nEnjoy it while it lasts with@OfficialGYBKogi the most irresponsible and incompetent Nigerian governor below 50.\""
  },
  {
    "headline": "I don't think gunmen who attacked my school are Nigerians, says Kebbi student",
    "summarized_story": "A female student of Federal Government College, Birnin-Yauri, Kebbi state, who escaped the attack on the school on Thursday, says she doesn’t think the gunmen are Nigerians.\nAdvertisementOn Thursday, gunmen stormed the school in motorcycles and reportedly kidnapped many students.\nDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of a an officer.\nAdvertisementSpeaking after the attack, the female student said two of her schoolmates, who sustained gunshot injuries during the attack, are currently receiving treatment.\nShe noted that some of the students were released by the gunmen, while others were taken away."
  },
  {
    "headline": "I don't think gunmen who attacked my school are Nigerians, says Kebbi student",
    "summarized_story": "A female student of Federal Government College, Birnin-Yauri, Kebbi state, who escaped the attack on the school on Thursday, says she doesn’t think the gunmen are Nigerians.\nAdvertisementOn Thursday, gunmen stormed the school in motorcycles and reportedly kidnapped many students.\nDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of a an officer.\nAdvertisementSpeaking after the attack, the female student said two of her schoolmates, who sustained gunshot injuries during the attack, are currently receiving treatment.\nShe noted that some of the students were released by the gunmen, while others were taken away."
  },
  {
    "headline": "Insecurity: I feel safer in Maiduguri than Abuja, says Ndume",
    "summarized_story": "Ali Ndume, senator representing Borno south, says he feels safer in Maiduguri, the Borno capital, than in the federal capital territory (FCT).\nThe Borno senator also noted that insurgents are not operating within Maiduguri, but outside the state capital.\nOnce I come to Maiduguri, I feel safer than Abuja, because somebody can knock at your door, knock down your door with a gun,” he said.\nAdvertisement“Let me add, the president went round for six hours.\n“For those people who are saying the president is sick and all that, we went through the four corners of Maiduguri."
  },
  {
    "headline": "Insecurity: I feel safer in Maiduguri than Abuja, says Ndume",
    "summarized_story": "Ali Ndume, senator representing Borno south, says he feels safer in Maiduguri, the Borno capital, than in the federal capital territory (FCT).\nThe Borno senator also noted that insurgents are not operating within Maiduguri, but outside the state capital.\nOnce I come to Maiduguri, I feel safer than Abuja, because somebody can knock at your door, knock down your door with a gun,” he said.\nAdvertisement“Let me add, the president went round for six hours.\n“For those people who are saying the president is sick and all that, we went through the four corners of Maiduguri."
  },
  {
    "headline": "WHO: Africa experiencing full-blown third wave of COVID infections",
    "summarized_story": "The World Health Organisation (WHO) says Africa is currently experiencing a third wave of COVID-19 infections.\nThe development comes amid concerns over new variants of COVID-19, said to be responsible for increased infection rates.\nAdvertisementMoeti, who noted that several countries in Africa have experienced a surge in infections, said it is time to step up efforts on vaccination.\n“New cases recorded weekly in Africa have now exceeded half of the second wave peak of more than 224,000 weekly cases in early January 2021.\nThe Delta variant has been reported in 14 African countries and the Alpha and Beta variants have been found in over 25 African countries.”"
  },
  {
    "headline": "TeamApt anticipates unicorn bells on the back of $16bn agent banking blitz",
    "summarized_story": "TeamApt has become a leader in Nigeria’s agent banking business and that could drive it to the envied status of a billion-dollar startup in the coming months.\nHis audacity is based on data from SANEF, the body empowered by the Central Bank of Nigeria to oversee agent banking in Nigeria.\nAccording to this data, TeamApt accounts for 74% of the agent banking industry based on the volume of transactions processed monthly.\nIn March 2021, TeamApt processed over ₦1trillion ($2.4 bn) for the first time, according to the CEO.\n🚀🚀🚀 #JustPagait — Tayo Oviosu (@oviosu) June 7, 2021Not much is known about Firstmonie, also in the agent banking heavyweight category."
  },
  {
    "headline": "Banks and startups need to partner for growth but who can solve the risks involved?",
    "summarized_story": "Five Nigerian banks have signed up as pioneer members of a new initiative that aims to increase partnerships between corporations and startups in emerging markets.\nVFD Group, an investment company that owns VBank, a digital bank, has also signed up.\nBut emerging market narratives of disruption that pit startups and corporates against each other gloss over many avenues of collaboration that currently lie fallow.\nStartups are experiments and could come with reputational risks for corporates when they fail or splinter into some sort of scandal.\nIt is possible that startups and corporates can, on their own, set up the right structures and interfaces to reduce such risks."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Gebeya announces the relaunch of its freelance marketplace, plans to grow its talent pool to 15,000 in 3 years.",
    "summarized_story": "Ethiopia-based startup, Gebeya, has announced the launch of its Pan-African freelance marketplace, which would connect startups and small and medium enterprises with the professional talents needed to grow their businesses.\nFounded in 2016 to train African youth in technology skills, Gebeya is similar to freelance platforms such as Upwork and Fiverr.\nGebeya began as an edtech startup helping Africans gain tech skills before matching them with employers.\nWith the relaunch of the talent platform, the startup can connect more talents with jobs.\nGebeya’s matching algorithm considers location, language, and budget when matching businesses with talents."
  },
  {
    "headline": "Kenya-based foodtech startup, Kune, closes $1 million pre-seed round for official launch",
    "summarized_story": "Kune, a Kenya-based foodtech startup, has announced raising $1 million in pre-seed funding.\nConsonance Investments, Liechtenstein-based investment company, Century Oak Capital GmbH, and Pariti, an ecosystem management firm also invested in this round.\nFounded in December 2020 by France-born Robin Reecht, Kune’s objective is to provide ready-to-eat food services at a moderate price.\nHe took it upon himself to proffer a sustainable solution to bridge the gap between great food and affordable pricing.\nWith Kune anticipating a fast growth rate, we just might have more founders looking into Africa’s foodtech space."
  },
  {
    "headline": "SA-based Triggerfish studio partners Disney to release African-themed animation series in 2022",
    "summarized_story": "South African animation studio, Triggerfish, in collaboration with other reputable studios like Walt Disney, is set to produce a ten-part African-themed sci-fi series, which will be a feature-length animation film.\nTitled Kizazi Moto: Generation Fire, the Disney original movie is set to be released on Disney+ in 2022.\nIn December 2020, the company hinted at a collaboration with a pan-African entertainment entity, Kugali Media, to produce an animation set in Lagos, Nigeria.\nCreators behind the series include Ahmed Teilab (Egypt), Simangaliso ‘Panda’ Sibaya and Malcolm Wope (South Africa), Terence Maluleke and Isaac Mogajane (South Africa), Ng’endo Mukii (Kenya), Shofela Coker (Nigeria), Nthato Mokgata and Terence Neale (South Africa), Pious Nyenyewa and Tafadzwa Hove (Zimbabwe), Tshepo Moche (South Africa), Raymond Malinga (Uganda) and Lesego Vorster (South Africa).\nApparently, the African animation industry has continued to be taken seriously, considering the growing interest from global animation studios like Disney."
  },
  {
    "headline": "Allow freedom of speech, Nigerian press urges Reps",
    "summarized_story": "The Nigerian media industry has called on the House of Representatives to step down a bill seeking to amend the Nigerian Press Council Act, saying it is still a subject of litigation at the Supreme Court.\nIn recent time, several media organisations and groups have criticised various clauses in the bill as possibly discouraging Freedom of Speech in the country.\nOdebunmi said, “So, I am sorry if there is anybody who thinks we did not invite them.\n“A consideration is that the amendment seeks an unabashed focus to restrict freedom of expression while masking the toga of something else.\n“The power to determine sanctions relating to hefty fines should be vested in the courts and not the council."
  },
  {
    "headline": "Airfares may crash in summer as Boeing Max 8 returns, COVID-19 fears hover",
    "summarized_story": "Nigerians travelling to various countries for summer holidays this year may be paying less for airfare as airlines deploy more aircraft to various destinations with the return of Boeing Max 8.\nThis will increase capacity of airlines than it was during the grounding of the aircraft type in 2019.\nThe Boeing Max 8 aircraft was grounded worldwide on March 13, 2019, after two crashes, one in Indonesia in 2018 and the other in Ethiopia in 2019, killing 346 people.\nRead Also: Green Africa disrupts airline business with cheap airfaresIn all, 13 carriers are now flying the 737 Max on commercial services.\nIf there was no COVID-19, the impact of the return of Boeing Max 8 would have been appreciated but a lot of people are still afraid to fly because of COVID-19,” Akporiaye says."
  },
  {
    "headline": "Nigeria’s slowing inflation eludes consumers",
    "summarized_story": "Nigerians are struggling to relate with the month of May’s inflation numbers which show that consumer goods prices rose at a slower pace.\nThe headline inflation number released by the National Bureau of Statistics (NBS) shows that inflation for the month of May 2021 settled at 17.93%, which was 0.19% lower than the 18.12% of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Former MD, Bank PHB, Atuche Received Six Years Imprisonment For N25.7Billion Fraud, Wife Acquitted – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The former Managing Director of the defunct Bank PHB, Francis Atuche has been sent to six years imprisonment for defrauding the financial institution of N25.7billion.\nWith the pronouncement, the ex MD after been on trial for 10 years, is to be in prison for six years.\nIn the judgement, Justice Okunnu held that the Economic and Financial Crimes Commission (EFCC) had proved the case beyond reasonable doubt that Atuche actually committed the crime.\nOkunnu however discharged Atuche’s wife Elizabeth who was facing trial alongside the duo.\nThe trial judge also held that in case of conspiracy and stealing against the 2nd defendant, the prosecution failed to prove any case against her."
  },
  {
    "headline": "NDDC has failed, not living up to its responsibilities, Obaseki insists – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has restated that the Niger Delta Development Commission (NDDC) is not living up to its responsibility of ensuring infrastructural development in the Niger Delta and raising the standard of living of the people.\nObaseki said this on Thursday when he received the Odiowere and elders of Ugha Quarters of Urhonigbe Town in Orhionmwon Local Government Area, who were on a courtesy visit at the Government House, Benin City.\nHe said: “We are aware and know that the road has been awarded by NDDC.\nObaseki continued: “As soon as possible, we would send government agencies to check the immediate state of the road and report back.\nWe will deliver the dividends of democracy to the people of the State, including Ugha Quarters in Urhonigbe."
  },
  {
    "headline": "Edo Poly matriculates 2,200 new students, as Rector lauds Obaseki on support, partnership – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Polytechnic, Usen, has matriculated 2,200 new students into its National Diploma (ND) and Higher National Diploma (HND) programmes, with the intakes charged to be of good character and pursue excellence in their studies.\nRector of the Polytechnic, Professor Abiodun Falodun, made the submission during the school’s 19th matriculation ceremony, held in Usen, Ovia South West Local Government Area (LGA) of Edo State.\nThe Rector noted that the Edo State Governor, Mr. Godwin Obaseki, has provided immense support to drive change and community impact in the school, especially in securing accreditation for new programmes.\nHe added that the governor recently entered into partnership with the school for training of government’s secretarial staff in computer science/data processing.\nOur sincere gratitude to His Excellency, Governor Godwin Obaseki, for the invaluable assistance in the accreditation exercise."
  },
  {
    "headline": "Osinbajo presides over virtual NEC meeting – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Vice President Yemi Osinbajo presided over a virtual meeting of the National Economic Council (NEC) on Thursday at the Presidential Villa, Abuja.\nUnder the Nigerian Constitution, the vice president is the chairman of NEC.\nThe council’s meeting is held monthly to deliberate on the coordination of the economic planning efforts and economic programmes of the various levels of government.\nNEC comprises the 36 state governors, the governor of Central Bank of Nigeria, minister of finance, Secretary to the Government of the Federation and other government officials whose duties hinge on the economy.\nAt the last meeting on May 20, NEC declared its support for Nigeria’s effort at digital switch over."
  },
  {
    "headline": "Kebbi Abduction: Bandits informed Yauri people about attack – Rep",
    "summarized_story": "ADVERTISEMENTTanko Sununu, the lawmaker representing Shanga/ Yauri/ Ngaski federal constituency of Kebbi State, has disclosed that before the latest attack in Yauri, Kebbi State, bandits have been attacking the community uninterrupted.\nAccording to the lawmaker, the bandits had informed the people they would be back to attack the community.\nPREMIUM TIMES had reported the attack by bandits in Yauri, which led to the abduction of some students and teachers at Federal Government School by suspected bandits.\nMr Sununu said, last week, over 300 bandits with AK 47, attacked the communities in Yauri and operated for eight hours uninterrupted.\nThe lawmaker said the people had initially fled the community after the attack because the bandits warned that they would be back."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "A’Court Victory: Tinubu Congratulates Akeredolu, Says Judgement Well Deserved",
    "summarized_story": "The national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, on Thursday, congratulated the governor of Ondo State, Oluwarotimi Akeredolu, and his deputy, Hon.\nLucky Aiyedatiwa, over the Court of Appeal judgement affirming their victory in the governorship election in the state.\nAdvertisementsAccording to him, “By this judgement, the appellate court clearly shows that Governor Akeredolu and Deputy Governor Aiyedatiwa were the candidates whom the people of Ondo choose to pilot their affairs for the next four years.\nADVERTISEMENT“The confidence the people repose in the Akeredolu administration has been well earned and should be wholly respected.\nI urge Governor Akeredolu to continue to strive and do his utmost in the service of his state and for the welfare of all the people therein, politico friend and foe alike."
  },
  {
    "headline": "A’Court Victory: Tinubu Congratulates Akeredolu, Says Judgement Well Deserved",
    "summarized_story": "The national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, on Thursday, congratulated the governor of Ondo State, Oluwarotimi Akeredolu, and his deputy, Hon.\nLucky Aiyedatiwa, over the Court of Appeal judgement affirming their victory in the governorship election in the state.\nAdvertisementsAccording to him, “By this judgement, the appellate court clearly shows that Governor Akeredolu and Deputy Governor Aiyedatiwa were the candidates whom the people of Ondo choose to pilot their affairs for the next four years.\nADVERTISEMENT“The confidence the people repose in the Akeredolu administration has been well earned and should be wholly respected.\nI urge Governor Akeredolu to continue to strive and do his utmost in the service of his state and for the welfare of all the people therein, politico friend and foe alike."
  },
  {
    "headline": "Gunmen Abduct Four Chinese Expatriates, Kill Police Inspector In Ogun",
    "summarized_story": "Unknown gunmen on Wednesday afternoon, abducted four male Chinese expatriates working with the Federal Government’s railway project in Odeda local government area of Ogun State.\nAdvertisementsNumbering about eight and all clad in black kaftan, the gunmen allegedly invaded Adeaga/Alaagba village, site of the railway project in Odeda local government area around 6pm where they shot a Police Inspector dead before succeeding in the abduction of the Chinese expatriates handling the Ibadan-Lagos standard gauge railway project.\nEye witness at Alaagba village told LEADERSHIP that the abductors seized their victims immediately after disarming the security men attached to them and they headed straight to the forest with their captives.\nSpeaking with LEADERSHIP, the community leader and Baale of Alaagba village, Chief Adekunle Olabamiji, said residents of the rustic border community between Ogun and Oyo state had earlier in the afternoon, observed the presence of some fierce-looking gunmen in the village.\nLEADERSHIP further gathered that members of the Oodua People’s Congress (OPC) later in the night launched an unsuccessful hunt for the kidnappers, combing the entire bush in an attempt to possibly apprehend the kidnappers and rescue the victims."
  },
  {
    "headline": "Gunmen Abduct Four Chinese Expatriates, Kill Police Inspector In Ogun",
    "summarized_story": "Unknown gunmen on Wednesday afternoon, abducted four male Chinese expatriates working with the Federal Government’s railway project in Odeda local government area of Ogun State.\nAdvertisementsNumbering about eight and all clad in black kaftan, the gunmen allegedly invaded Adeaga/Alaagba village, site of the railway project in Odeda local government area around 6pm where they shot a Police Inspector dead before succeeding in the abduction of the Chinese expatriates handling the Ibadan-Lagos standard gauge railway project.\nEye witness at Alaagba village told LEADERSHIP that the abductors seized their victims immediately after disarming the security men attached to them and they headed straight to the forest with their captives.\nSpeaking with LEADERSHIP, the community leader and Baale of Alaagba village, Chief Adekunle Olabamiji, said residents of the rustic border community between Ogun and Oyo state had earlier in the afternoon, observed the presence of some fierce-looking gunmen in the village.\nLEADERSHIP further gathered that members of the Oodua People’s Congress (OPC) later in the night launched an unsuccessful hunt for the kidnappers, combing the entire bush in an attempt to possibly apprehend the kidnappers and rescue the victims."
  },
  {
    "headline": "China Builds World-class Smart, Green ports",
    "summarized_story": "The Shandong Port Group Co., Ltd. established two years ago is now serving as a playmaker of the logistics industry.\nCurrently, the Shandong Port Group Co., Ltd. is accelerating the development of emerging businesses, such as shipping finance, to expand its pivotal role.\nEstablishing interaction between port construction and urban development, Shandong Port Group Co., Ltd. is magnifying its influence with port-industry-city integration.\nBesides, Shandong Port Group Co., Ltd. is also advancing overseas port projects such as the Port of Vado in Italy.\nADVERTISEMENTShandong Port Group Co., Ltd. is also working to apply new transport methods, building home ports of offshore wind farm, as well as demonstration ports of green energy and low-carbon development."
  },
  {
    "headline": "Man arrested for stealing bag of rice in Anambra — Daily Times Nigeria",
    "summarized_story": "By Dilibe MichaelA 32 years old man identified as Ndubuesi Ndubuesi on Thursday has been arrested in Ukwulu town, Dunukofia LGA in Anambra State.\nThe suspect, Ndubuesi was caught by Ukwulu youths on Thursday, June 17.\nDuring interrogation, the 32yrs man confessed that he steal people’s rice anytime his in need of money and sell them to his clients.\nThe suspect was prevented from being set ablaze by angry youths in the village by the Ukwulu security men.\nThe Ukwulu security men have arrested the suspected man and have been taken under their custody in Ukwulu."
  },
  {
    "headline": "APC Convention: President Buhari to fix tentative date – PGF",
    "summarized_story": "By Tom OkpeGovernors on the platform of the ruling All Progressives Congress (APC) under the aegis of the Progressive Governors Forum (PGF) stated on Thursday that the tentative date of the party national convention will be fixed by the president Muhammadu Buhari.\nThe Governors indicated that there is a proposal of the convention on Mr President’s table and the moment he signs, the national Caretaker Extraordinary Convention Planning Committee, (CECPC) led by Mallam Mai Mala Buni will announce the date.\nPGF also passed a vote of confidence on the Caretaker Committee Chairman, Governor Buni of Yobe state and his caretaker committee members for their outstanding performance in rebuilding the party.\nThey commended Governor Buni for providing excellent leadership to the party at the most critical period.\n“There is a proposal before Mr. President and once he approves it, the National Caretaker Committee will announce the date,” Bagudu stated."
  },
  {
    "headline": "Navy impounds 251 bags of smuggled rice, siezes boat in A’Ibom — Daily Times Nigeria",
    "summarized_story": "The Nigerian Navy, Forward Operating Base (FOB), Ibaka, Mbo Local Government Area of Akwa Ibom, has impounded 251 bags of smuggled rice and siezed the boat used in smuUggling the rice.\nSuleiman Abdullahi, disclosed this to newsman in Ibaka on Thursday when he handed over the bags of rice to the Nigerian Customs Service(NCS).\nAbdullahi said that the 251 bags of rice were seized from smugglers on June 15, during routine patrol operations by the Forward Operating Base.\n“What you are witnessing here today is the handover of 251 bags of rice suspected to be smuggled into the Nigerian maritime border.\nBy the directive, we have carried out intensive patrol and on June 15, 2021, we seized one wooden boat and 251 bags of smuggled rice."
  },
  {
    "headline": "FG establishes portal for 10m farmers for efficient monitoring of...",
    "summarized_story": "The Federal Government says it has established an online portal to ensure efficient and effective monitoring of its interventions in the Agricultural Sector.\nThe Minister of Agriculture and Rural Development, Alhaji Muhammad Nanono, made the disclosure at the 44th Regular Meeting of the National Council of Agriculture and Rural Development on Thursday in Abuja.\n“Although, we initially set out to capture the data of 2.4million farmers across the country, the results from the exercise have encouraged the Economic Sustainability Plan team to expand the data capture to 10 million farmers.\n“A major hallmark of our agricultural interventions is inclusiveness.\n“This approach is believed to be the right one for achieving our desired economic diversification and national development,” he said."
  },
  {
    "headline": "Buhari mourns as Kenneth Kaunda dies at 97, says he was a great patriot",
    "summarized_story": "Buhari mourns as Kenneth Kaunda dies at 97, says he was a great patriotBuhari mourns as Kenneth Kaunda dies at 97, says he was a great patriotBy GBENGA ADEOLAPresident Muhammadu Buhari has described Zambia’s founding father and independence nationalist Kenneth Kaunda as “one of the greatest African and world leaders of all time who loved his country and people profoundly.”Reacting to Kaunda’s death at the age of 97, the President said “I have received his passing with great shock because I knew his contributions to the development of not only Zambia but also Africa at large.”According to President Buhari, “we can’t forget in a hurry how Kaunda gave shelter to anti-apartheid freedom fighters from South Africa and from former Rhodesia.”The Nigerian leader noted that “the late Kaunda was one of the loudest voices for the liberation of Africa from colonialism and imperialism and he did so with passion and sincerity.\nIt is impossible to reflect on Kaunda’s legacy without acknowledging his selflessness and passion for service.”President Buhari extended his condolences and that of the nation to the family, the government and people of Zambia over Kaunda’s death.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari mourns as Kenneth Kaunda dies at 97, says he was a great patriot",
    "summarized_story": "Buhari mourns as Kenneth Kaunda dies at 97, says he was a great patriotBuhari mourns as Kenneth Kaunda dies at 97, says he was a great patriotBy GBENGA ADEOLAPresident Muhammadu Buhari has described Zambia’s founding father and independence nationalist Kenneth Kaunda as “one of the greatest African and world leaders of all time who loved his country and people profoundly.”Reacting to Kaunda’s death at the age of 97, the President said “I have received his passing with great shock because I knew his contributions to the development of not only Zambia but also Africa at large.”According to President Buhari, “we can’t forget in a hurry how Kaunda gave shelter to anti-apartheid freedom fighters from South Africa and from former Rhodesia.”The Nigerian leader noted that “the late Kaunda was one of the loudest voices for the liberation of Africa from colonialism and imperialism and he did so with passion and sincerity.\nIt is impossible to reflect on Kaunda’s legacy without acknowledging his selflessness and passion for service.”President Buhari extended his condolences and that of the nation to the family, the government and people of Zambia over Kaunda’s death.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "AFN National Trials: Wind stops Okagbare from becoming joint-fastest woman alive",
    "summarized_story": "Wind stopped Blessing Okagbare from becoming the joint-fastest woman alive when she ran a time of 9.63m at the Athletics Federation of Nigeria National Trials held at Yaba College of Technology, Lagos on Thursday.\nThe celebrations soon died down after it was announced that the race was ran at a non-legal wind on 2.7m/s.\nThe wind also ensured that Rosemary Chukwuma, who came second in 11.07s failed to qualify for the Tokyo 2020 Olympics, even though she met the Olympics qualification standards of 11.15m in the women’s 100m.\nSpeaking after the race, President of the Athletics Federation of Nigeria, Tonobok Okowa, said despite the disappointment caused by the wind, it showed Nigerian athletes were in good shape ahead of the Olympics.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "AFN National Trials: Wind stops Okagbare from becoming joint-fastest woman alive",
    "summarized_story": "Wind stopped Blessing Okagbare from becoming the joint-fastest woman alive when she ran a time of 9.63m at the Athletics Federation of Nigeria National Trials held at Yaba College of Technology, Lagos on Thursday.\nThe celebrations soon died down after it was announced that the race was ran at a non-legal wind on 2.7m/s.\nThe wind also ensured that Rosemary Chukwuma, who came second in 11.07s failed to qualify for the Tokyo 2020 Olympics, even though she met the Olympics qualification standards of 11.15m in the women’s 100m.\nSpeaking after the race, President of the Athletics Federation of Nigeria, Tonobok Okowa, said despite the disappointment caused by the wind, it showed Nigerian athletes were in good shape ahead of the Olympics.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Five Nigerians jailed for defrauding Belgian, Italian, Dutch, others",
    "summarized_story": "The fraudsters are: Alfred Stephen, Onyebuchi Joseph Elijah ( a.k.a Svenulrich), Usman Mustapha, Abdullahi Abubakar (a.k.a Shine Eye) and Umar Khalifa.\nThey were convicted on separate charges before Justice Muhammad Muhammad of the Sokoto State High Court, Sokoto.\nJustice Muhammad, thereafter convicted and sentenced the 1st defendant (Alfred Stephen) to Five (5) years imprisonment with option of N150,000.00 fine.\nThe 2nd defendant, Onyebuchi Joseph Elijah (a.k.a Mr. Svenulrich) was setenced to five years imprisonment with an option of N150,000.00 fine.\nHe is to restitute the sum Five Thousand Denmark Krone which is equivalent to Three Hundred and Ten Thousand Naira only (N310,000) to the victim."
  },
  {
    "headline": "My encounter with Kaunda: I am deeply saddened by his death – Jonathan",
    "summarized_story": "By Kazeem UgbodagaFormer President Dr. Goodluck Jonathan has revealed his encounter with late President of Zambia, Kenneth Kaunda, saying he is deeply saddened by his death.\nJonathan paid tribute to Kaunda who died on Thursday at the age of 97.\n“I am deeply saddened by the passing on of former Zambian President and foremost Pan-Africanist Dr. Kenneth Kaunda who died today at the age of 97 years.\n“Not only was he of very great significance to Africa’s struggle for liberation he was also quite significant to me.\nREAD ALSO: Zambia’s first president, Kenneth Kaunda is dead“His life was a pattern of good works, and his post Presidential work in providing relief for HIV/AIDS patients, as well as promoting practices and measures to curb the spread of the virus are remembered."
  },
  {
    "headline": "What Buhari said about Nigerians in Borno",
    "summarized_story": "President Muhammadu Buhari Thursday in Maiduguri, Borno State, said all efforts will be made to improve the livelihood of Nigerians, starting with providing adequate security, reiterating that he owes Nigerians a debt of gratitude for the opportunity to serve.\nSpeaking at the palace of the Shehu of Borno, President Buhari noted that he started his administrative career as a military officer in Borno State as a governor for seven months, under Gen. Murtala Ramat Mohammed, before he was appointed Minister of Petroleum by former President Olusegun Obasanjo, who was then a military Head of State.\n“My commitment to serve Nigerians is a payback for the love shown to me.\nPresident Buhari commended the Governor of Borno State for his forthrightness, resilience and drive in bringing development to the state, despite security challenges.\nThe Governor thanked the President for visiting Borno State to appraise the security situation, and commission some of the completed projects in the last few years."
  },
  {
    "headline": "I’m Paying Nigerians Back Because They Love Me — Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that he is dedicated to helping Nigerians as a result of their love for him.\nBuhari claims he owes Nigerians a debt of gratitude for allowing him to serve by providing adequate security and livelihood.\n“My dedication to assist Nigerians is my way of repaying the affection that has been offered to me.\nMoreover, despite security challenges, Buhari praised the State Governor for his forthrightness, resilience, and drive in bringing prosperity to the state.\nFew leaders, the President noted, would take the risks that Governor Zulum had made over the years to protect his people and promote peace and development, particularly by spending nights with vulnerable people."
  },
  {
    "headline": "Nigeria’s Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "Godwin Emefiele, the Governor of the Central Bank of Nigeria, is currently currying favor with the National Assembly’s upper echelon by granting them Bureau de Change licenses.\nAccording to SaharaReporters, Emefiele granted the licenses to key and vociferous members of the National Assembly so that they could take a break from the numerous investigations into CBN infractions and misappropriations.\nAccording to SaharaReporters, some politicians used third-party firms to secure CBN licenses, while others who lacked the required financial deposits were helped by the CBN governor to obtain government loans.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "Court Orders Akeredolu To Stop Investigating The Chief Judge For Alleged Wrongdoings",
    "summarized_story": "Rotimi Akeredolu, the governor of Ondo, and the state house of assembly have been ordered to cease the investigation into Oluwatoyin Akeredolu, the state’s chief judge, over a viral video created by one Olupelumi Fagboyegun by a federal high court in Abuja.\nIn a video that went viral on social media, Fagboyegun accused the top judge of misusing her position and influencing his lengthy arrest.\nAs a result, the governor ordered an investigation into the accusation by the state attorney general.\nHe held it is only the NJC that is empowered under the constitution to probe allegations of official misconduct against any judge.\nEkwo set aside all steps taken in the investigation and granted an order of perpetual injunction, restraining all the defendants from further taking any steps in relation to the case."
  },
  {
    "headline": "After A Ten-year Exile, Former President Gbabo Returns To Côte d’Ivoire",
    "summarized_story": "Laurent Gbagbo, the former President of Côte d’Ivoire, has boarded an airplane to return home for the first time since being deposed in 2011.\nMr. Gbagbo was extradited to The Hague on charges of war crimes, although he was later acquitted.\nHundreds of people took to the streets in Abidjan’s Yopougon district, which is considered Mr Gbagbo’s political stronghold.\nHe was acquitted in 2019 of war crimes and crimes against humanity charges by the International Criminal Court for his role in the violence.\nMr Gbagbo’s return comes after protracted negotiations between his camp and the government, which delayed granting him a passport until after the 2020 election had passed."
  },
  {
    "headline": "Breaking: Kidnapped NPFL ‘s Rivers United coach, Stanley Eguma, regains freedom",
    "summarized_story": "Rivers United head coach, Stanley Eguma, has been freed by his adoptors.\nCoach Eguma was kidnapped on Tuesday in Enugu.\nRivers United are one of the clubs contending for Nigeria Football Professional League (NPFL) top finish in 2021.\nDetails loading…"
  },
  {
    "headline": "Breaking: Again, armed robbers attack POS operatives in Imo",
    "summarized_story": "Armed robbers numbering about five, Thursday, attacked some POS operatives around Eke Atta market in Ikediru Local Government Area (LGA) of Imo state, taking away monies belonging to both the operatives and customers waiting to transact business.\nThe amount taken away totaled N500,000, according to those that spoke to Blueprint.\nIt was also gathered that this was the second attack on POS operatives in one week along the major Owerri-Okigwe- Enugu road in the LGA.\nLast week, armed robbers suspected to be the same gang stormed the popular Ama Nwozuzu junction in Owerri, and made away with monies, phones and accessories belonging to POS and a phone seller which caused stampede at the nearby Eke Iho market before they left.\nWhen contacted, the Police Public Relations Officer( PPRO) Imo command, Bala Elkana, said he had not heard about the robbery incident, top stories but promised to find out."
  },
  {
    "headline": "Breaking: Blessing Okagbare breaks own record, wins 100m event ahead Tokyo Olympics (PICTURES)",
    "summarized_story": "Serial Champion, Blessing Okagbare, is at it again.\nThe Delta-born Nigerian has just finished a 100 metres race at 10.63secs during the ongoing national trials holding in Lagos ahead of 2020 Tokyo Olympics.\nBefore now in an official note, Okagbare had ran 10.79 secs."
  },
  {
    "headline": "Union Bank pledges better services -NigPilot",
    "summarized_story": "UNION Bank of Nigeria Plc has reaffirmed its commitment to providing simpler, smarter services to its customers.\nProspective customers can open Union Bank accounts at their convenience via the UnionMobile App, or by visiting any of its branches.\nThe bank announced plans to reward its customer base in an Independence promo in the month.\nIn addition, the promo offers Union Bank customers ‘Independence from charges’, in October, as they will enjoy zero fees on bill payments made via the UnionMobile App or the bank’s USSD Code, *826#.\nWhile unveiling the campaign, the bank’s Head of Retail Banking and Digital, Lola Cardoso, said: “Union Bank is excited to give back to her customers through this Independence Promo."
  },
  {
    "headline": "Union Bank pledges better services -NigPilot",
    "summarized_story": "UNION Bank of Nigeria Plc has reaffirmed its commitment to providing simpler, smarter services to its customers.\nProspective customers can open Union Bank accounts at their convenience via the UnionMobile App, or by visiting any of its branches.\nThe bank announced plans to reward its customer base in an Independence promo in the month.\nIn addition, the promo offers Union Bank customers ‘Independence from charges’, in October, as they will enjoy zero fees on bill payments made via the UnionMobile App or the bank’s USSD Code, *826#.\nWhile unveiling the campaign, the bank’s Head of Retail Banking and Digital, Lola Cardoso, said: “Union Bank is excited to give back to her customers through this Independence Promo."
  },
  {
    "headline": "Police operational independence from political control unattainable – Retiring AIG -NigPilot",
    "summarized_story": "The retiring Assistant Inspector-General of Police (AIG) in charge of Zone XI, Osogbo, Mr Babatunde Ajani, has said that police operational independence from political control may not be attainable in view of the constitutional provisions.\nAjani, just retiring after 33 years in police service, stated this during his retirement/farewell speech in Osogbo on Tuesday.\n“With the present constitutional provisions, the idea of operational independence from political control is not attainable.\nIn their joint remarks, the Police Commissioners of Osun and Oyo states, Olawale Olokode and Ngozi Onadeko respectively, extolled the virtues of the retiring AIG, thanking God for his life and service to humanity.\nHe stated further that the retiring police officer had serviced the nation to the best of his ability."
  },
  {
    "headline": "Police operational independence from political control unattainable – Retiring AIG -NigPilot",
    "summarized_story": "The retiring Assistant Inspector-General of Police (AIG) in charge of Zone XI, Osogbo, Mr Babatunde Ajani, has said that police operational independence from political control may not be attainable in view of the constitutional provisions.\nAjani, just retiring after 33 years in police service, stated this during his retirement/farewell speech in Osogbo on Tuesday.\n“With the present constitutional provisions, the idea of operational independence from political control is not attainable.\nIn their joint remarks, the Police Commissioners of Osun and Oyo states, Olawale Olokode and Ngozi Onadeko respectively, extolled the virtues of the retiring AIG, thanking God for his life and service to humanity.\nHe stated further that the retiring police officer had serviced the nation to the best of his ability."
  },
  {
    "headline": "INEC: We are ready for Kaduna by-election -NigPilot",
    "summarized_story": "Independent National Electoral Commission (INEC) has announced its readiness to conduct the by-election for the Sabon Gari constituency seat in the Kaduna State House of Assembly.\nThe Acting Resident Electoral Commissioner (REC) in the state, Mr Awwal Mashi, gave the assurance at a stakeholders meeting on Tuesday, in Kaduna.\nMashi explained that the by-election, slated for June 19, followed the vacancy declared for the seat of Aminu Shagali, the member representing Sabon Gari Constituency in the assembly.\nNo fewer than 128,051 registered voters are expected to participate in the ballot, for which five political parties are fielding candidates, INEC said.\nThe political parties include: the ruling All Progressives Congress (APC), Peoples Democratic Party (PDP), People’s Redemption Party (PRP), African Democratic Congress (ADC) and Action Democratic Party (ADP)."
  },
  {
    "headline": "Insecurity: I Feel Safer In Maiduguri Than Abuja – Ndume",
    "summarized_story": "﻿Solomon Elusoji, LagosChairman of the Senate Committee on Army, Senator Ali Ndume, on Thursday said he is more at ease when visiting Maiduguri than Abuja, the nation’s capital.\n“Once I come to Maiduguri, I feel safer than in Abuja, because somebody can knock down your door with a gun.\nA turning pointSenator Ndume was speaking on the heels of President Buhari’s visit to Borno earlier on Thursday.\nHe came in 10 o’clock and we were going to see various projects until four o’clock this evening before he left,” he said, praising President Buhari’s stamina.\nSenator Ndume also commended President Buhari’s bold welfare plans for the state, including the decision to build 10,000 houses for displaced persons and the provision of financing for a power plant."
  },
  {
    "headline": "Gunmen Abduct Students From Federal Government College In Kebbi",
    "summarized_story": "Gunmen suspected to be bandits have stormed Federal Government College, Birnin-Yauri in Kebbi State and abducted an unspecified number of students and four teachers.\nIn late May, about 200 students of an Islamiyya school in Niger state were abducted by gunmen.\nHe said the Bandits were able to abduct four teachers and an unconfirmed number of students away to an unknown destination.\nAbubakar also disclosed that a policeman lost his life, while one student sustained gun shot injury during an exchange of fire between security operatives and the bandits.\nHe added that security operatives have launched a manhunt for the bandits with a view to rescuing the kidnap victims and arresting the criminals."
  },
  {
    "headline": "‘Give No Breathing Space To Terrorists And Criminals,’ Buhari Charges Security Agents",
    "summarized_story": "﻿President Muhammadu Buhari has urged the military and other security agents not to give breathing space to terrorists and criminals in the country.\nThe President gave the charge on Thursday while addressing personnel of the Armed Forces and security agencies in Operation Hadin Kai at the Maimalari Cantonment during a visit to Borno State.\n“We should not allow our adversaries the opportunity or breathing space to challenge or undermine our national interests and core values.\nThe defence and security agencies should rest assured of the Federal Government’s unalloyed commitment to winning the battle against terror and criminality.\nMuch more equipment will be procured for the Armed Forces to cater for both the short and long-term requirements."
  },
  {
    "headline": "EFCC To Prosecute Orji Kalu All Over Again – Bawa",
    "summarized_story": "﻿Chairman of the Economic and Financial Crimes Commission (EFCC) Abdulrasheed Bawa has said former Abia State governor, Orji Uzor Kalu will be prosecuted by the agency all over again.\nBawa disclosed this on Thursday while addressing journalists during the weekly ministerial chat at the State House in Abuja.\nHe also clarified reports accredited to him concerning the involvement of a Minister in the laundering of about $37 million into real estate.\nBawa said he is confident that when the unit is fully established, corruption will significantly decline in the country.\nAccording to him, most proceeds of crime are laundered through real estate and have become a huge challenge."
  },
  {
    "headline": "Kaunda’s Death Ends Era Of African Leaders Who Fought Colonialism – Obasanjo",
    "summarized_story": "Former Nigerian President, Olusegun Obasanjo says the death of Zambia’s founding father and long-term leader, Kenneth Kaunda, has ended a long list of African leaders who fought colonialism and took over the reins of power at independence.\nPresident Kaunda was visibly pained in his response and at some point he broke down and wept.\n“Let us, African leaders and people, never let the labour of these heroes’ past be in vain,” he said.\nCabinet secretary Simon Miti said in an address on public television that Kaunda “died peacefully” at 2:30 pm (1230 GMT) at a military hospital where he had been admitted on Monday with pneumonia.\n“You have gone at a time we least expected,” he said on Facebook, describing him as a “true African icon.”"
  },
  {
    "headline": "Kenneth Kaunda: One of the greatest African and world leaders of all time – Buhari",
    "summarized_story": "President Muhammadu Buhari has described Zambia’s founding father and independence nationalist Kenneth Kaunda as “one of the greatest African and world leaders of all time who loved his country and people profoundly.”Reacting to Kaunda’s death at the age of 97, the President said “I have received his passing with great shock because I knew his contributions to the development of not only Zambia but also Africa at large.”According to President Buhari, “we can’t forget in a hurry how Kaunda gave shelter to anti-apartheid freedom fighters from South Africa and from former Rhodesia.”The Nigerian leader noted that “the late Kaunda was one of the loudest voices for the liberation of Africa from colonialism and imperialism and he did so with passion and sincerity.\nIt is impossible to reflect on Kaunda’s legacy without acknowledging his selflessness and passion for service.”President Buhari extended his condolences and that of the nation to the family, the government and people of Zambia over Kaunda’s death."
  },
  {
    "headline": "Danish Soccer star Christian Eriksen to get implantable heart defibrillator",
    "summarized_story": "The Danish Football Union (DBU) announced Thursday that Christian Eriksen, who suffered a cardiac arrest during his country’s Euro 2020 opener last weekend, will have a heart defibrillator implanted.\nEriksen is recovering in a Copenhagen hospital after collapsing during Denmark’s European Championship game against Finland.\nAccording to the Danish federation, doctors determined that Eriksen requires an ICD — implantable cardioverter-defibrillator.\n”This device is necessary after a cardiac attack due to rhythm disturbances,” the federation said in a statement.\nThe game will feature a minute’s applause for Eriksen in the 10th minute in honor of his No."
  },
  {
    "headline": "Ibadan Crisis: Gov Makinde visits violence scene, says perpetrators would be brought to book",
    "summarized_story": "Governor of Oyo State, Seyi Makinde has condemned the recent violence in Iwo Road axis of Ibadan which led to the death of two persons.\nThe governor, who toured the affected area, said the government will bring perpetrators of the act to book.\nMakinde described the occurrence as unfortunate, adding that his government has ordered investigations into the violent act.\n“I visited the scene of the Iwo Road incident this morning.\nAdvertisement“I give you my word that we will ensure that everyone involved in the dastardly act is brought to book.,” the governor said."
  },
  {
    "headline": "Zambia’s First President Kenneth Kaunda Dies at 97",
    "summarized_story": "Zambia’s former president, Kenneth Kaunda, the father of Zambia’s independence who led the country for 27 years has died at the age of 97.\nHe had been admitted to the Maina Soko Medical Center, a military hospital in Lusaka, on Monday where authorities disclosed he was being treated for Pneumonia.\nBut a Facebook post by his son Kambarage Kaunda, announced the Zambian founding president’s passage.\nKambarage asked for prayers for his father whom he called Mzee."
  },
  {
    "headline": "30 Schoolgirls Abducted as Terrorists Invade School in Northwest Nigeria’s Kebbi State",
    "summarized_story": "Reports suggest bandits have abducted about 30 students and three teachers of a Federal Government Girls College in northeastern Kebbi State.\nThe heavily armed bandits rode on motorcycles from neighbouring Rijau forest and stormed the school after overpowering the mobile police unit guarding the school.\nThe situation at Birnin Yauri where the school is situated is tensed and people are in the state of confusion.\nThis is definitely not the first attack on schools in northern Nigeria.\nAbductions have become more indiscriminate across northern Nigeria as local criminal gangs view victims as a source of income, and the villagers — who have been ignored by the government — as disposable."
  },
  {
    "headline": "Twitter Suspension Reduced The Spread Of Fake News – Trending With Ojy Okpe",
    "summarized_story": "Garba Shehu, Media Aide to President Mohammadu Buhari has come under fire on social media for saying that the suspension of Twitter has reduced the spread of fake news by governors on the platform of the people’s Democratic Party.\nFollowing the controversial ban of micro blogging platform Twitter, The federal government has asked the house of representatives to enact a law to regulate social and online media in Nigeria.\nU.S. president Joe Biden has apologized to CNN’s chief White House correspondent, Kaitlan Collins, after he lost his temper while speaking during a press conference following the Geneva summit with Russian President Vladimir Putin."
  },
  {
    "headline": "Under My Watch, Nigeria’s Military Has Clear Sense of Direction, Buhari Proclaims in Borno",
    "summarized_story": "Nigeria’s President Muhammadu Buhari says his administration in the past six years has provided the country’s armed forces a firm strategy and clear sense of direction to safeguard the sovereignty and territorial integrity of the West African country.\nPresident Buhari stated this on Thursday in northeastern Borno state when he visited personnel of the country’s security forces of Operation Hadin Kai.\n“Under my watch, the Armed Forces of Nigeria have been provided a firm strategy and clear sense of direction to safeguard the sovereignty and territorial integrity of the country,” Mr Buhari said.\nMuch more equipment will be procured for the Armed Forces to cater for both the short and long-term requirements.\n“I would like, at this point to also commend the hierarchy of our Armed Forces for their strategic foresight in ensuring that some of our critical military equipment are fabricated locally."
  },
  {
    "headline": "Buhari Visits Borno, Says Insurgents and Bandits to Feel Ferocity of Nigeria’s Firepower",
    "summarized_story": "President Muhammadu Buhari has promised to visit on insurgents and bandits the ferocity of the nation’s firepower and the weight of the resolve to allow for peace and security.\nHe said: “Your collective efforts have resulted in the relative peace being enjoyed in the region today.\nThe President said: “Alongside investment in development and reconstruction, we will sustain our investment in the Armed Forces in a manner that balances the “carrot and stick”.\nThe President had touched down at the Nigeria Air Force Base in Maiduguri at 10.15 am where he was welcome by Governor Babagana Zulum and other top dignitaries.\nDriving through the town in a long convoy, he was warming received by an array of students, civil servants and other section of the society who have lined the streets."
  }
]