[
  {
    "headline": "Fuel subsidy: FG’s policy retention disappointing, says energy expert",
    "summarized_story": "An energy expert, Dr Diran Fawibe, has expressed disappointment that the President, Major General Muhammadu Buhari (retd.\nFawibe noted that the issue of fuel shortages and fuel subsidy has lingered in national discourse for four decades without any solution.\nHe noted that the current subsidy was brought to the fore because of the need to import fuel from foreign refineries to sustain the economy.\nUnfortunately, the issue of subsidy removal may not be as serious as we are currently having it.\nIf our refineries were working there will be no issue of subsidy."
  },
  {
    "headline": "FG to apply Twitter operational conditions to Facebook, WhatsApp, others",
    "summarized_story": "The Federal Government says it is set to amend its relevant statutes and code to enforce the operational conditions of Twitter in Nigeria on other social media platforms.\nThe News Agency of Nigeria reports that the meeting was on the sidelines of a bilateral discussion with Africa Export Import Bank (Afreximbank) on how Nigeria can access funding to support its growing creative industry.\nMohammed said the decision was borne out of the recent development on suspension of Twitter operations in the country and the agreement reached before the suspension was lifted.\n“Whatever applies to twitter will apply to all other social media platforms, be it WhatsApp, Facebook or any other.\n“Similarly, the partner support portal provides a direct channel for government to engage twitter staff to manage prohibited contents,” he said."
  },
  {
    "headline": "Buhari Presides over FEC meeting in Aso Rock",
    "summarized_story": "By Johnbosco Agbakwuru – AbujaPresident Muhammadu Buhari is currently presiding over the weekly Federal Executive Council, FEC, meeting at the Council Chambers, Presidential Villa, Abuja.\nPhysically present at the meeting are Vice President Yemi Osinbajo; Secretary to the Government of the Federation, SGF, Boss Mustapha and Chief of Staff to the President, Prof Ibrahim Gambari.\nSome Ministers who are physically attending the meeting include that of Federal Capital Territory (FCT), Mohammed Bello; Communications and Digital Economy,Dr Ibrahim Pantami; Information and Culture, Lai Mohammed; Finance, Budget and National Planning, Zainab Ahmed; Works and Housing, Babatunde Fashola and Minister of State for Petroleum Resources, Timipre Sylva.\nOther Ministers and Head of Civil Service of the Federation, Dr (Mrs) Folasade Yemi-Esan, are participating virtually from their respective offices in Abuja.\nVanguard News Nigeria"
  },
  {
    "headline": "Rivers recovers aircraft in Germany, 10yrs after abandonment",
    "summarized_story": "He said efforts to repair and retrieve the aircraft have cost the State government over Three Million Euros.\nReasons we do not know.”He said there was no documentation indicating that the State-owned aircraft was flown to Germany and abandoned for inexplicable reasons.\nThose on the governor’s entourage included the Speaker Rivers State House of Assembly, Rt.\nIkuinyi-Owaji Ibani; Deputy Speaker, Rivers State House of Assembly, Rt.\nEhie Ogerenye Edison; Rivers State Attorney-General and Commissioner for Justice, Prof. Zacchaeus Adangor; member of House of Representatives, Ken Chikere; Rivers State chairman, Peoples Democratic Party, Ambassador Desmond Akawor; Chairman, Ikwerre LGA, Hon."
  },
  {
    "headline": "Killings in Kaduna must stop — CAN",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Christian Association of Nigeria (CAN) in Kaduna state has expressed sadness over the killing of a herder in Kaduna which has led to a renewed circle of massacres.\nRev John Joseph Hayab, Chairman of CAN in Kaduna State, stated that the development was tragic.\n“Therefore, CAN appeal to citizens and all stakeholders to join hands to bring to a stop this new wave of killings.”“Our dear state has been on the news for the wrong reasons which include banditry, kidnapping, assaults on communities and killings of innocent citizens.\nThis evil must stop now and those keeping quiet need to speak up forthwith.”“We can not pass this type of record to the next generation.\nWhen others are struggling to get out of poverty to become self-reliant we are now famous for killing others at every slight provocation.”“Our faith and culture do not teach us a barbaric manner of settling conflicts."
  },
  {
    "headline": "ACF members ‘ll not disappoint Buhari as Board Chair — Yawe",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Arewa Consultative Forum (ACF ) has expressed appreciation to President Muhammadu Buhari for the appointment of two of its principal officer’s into his government as Board Chairmen.\nEmmanuel Yawe, National Publicity Secretary of the Arewa Consultative Forum, stated this in a statement on Wednesday.\nThe ACF stated that “the officers are Senator Ibrahim Ida who is the current Deputy Chairman of the Forum from Katsina State who was appointed Chairman of the Governing Council of Dan Fodio University Sokoto and Senator Ibrahim Salisru Matori Assistant Chairman of the Forum who is from Bauchi was appointed Chairman of Federal College of Education Odugbo Benue State.”“We of the Forum are proud of these two officers and are sure they will serve the President and the country with distinction in the offices they have been appointed to.”“The two gentlemen had left exemplary records in the public service as Senators and also in various private sector positions before their appointments as Deputy and Assistant Chairman of our Forum.\nWith their inauguration into the Board Chairmanships last week, we of the ACF are sure they will swing into action in a short time and direct the Boards towards prudent service of our fatherland,” the ACF stated.\nVanguard News Nigeria"
  },
  {
    "headline": "105 suspected thugs on transit to Ekiti moved to Ondo Military Barracks",
    "summarized_story": "Dayo Johnson AkureThe 105 suspected political thugs arrested on their way to Ekiti state at lta Ore/ Efon junction have been moved to the 323 Artillery Brigade of the Nigerian Army, Akure, Ondo State.\nVanguard gathered that the suspects were being transported with five 18-passenger buses and were driving along Ijebu- Ijesa-Ita Ore road, when they were intercepted and arrested at about 3 am on Wednesday, by soldiers.\nThey were arrested with dangerous weapons like locally made pistols, cudgels and cutlasses.\nSources at the Owens Barracks told Vanguard that the soldiers took them there for further investigation.\nThe Public Relations Officer of the brigade, Captain Akin Omojokun confirmed the arrest of the suspects."
  },
  {
    "headline": "Nigerian govt to apply Twitter operational conditions to other social media platforms",
    "summarized_story": "The Federal Government says it is set to amend relevant statutes and codes to enforce the operational conditions of Twitter in Nigeria on other social media platforms.\nMohammed said the decision was borne out of the recent development on the suspension of Twitter operations in the country and the agreement reached before the suspension was lifted.\n“Whatever applies to Twitter will apply to all other social media platforms, be it WhatsApp, Facebook or any other.\n“Twitter agreed to immediately work with the Federal Government in the area of code of conduct which is in line with global best practices.\n“Twitter agreed to immediately enrol Nigerians in its Law Enforcement portals and Partners Support Portal."
  },
  {
    "headline": "2023: You should be in jail – Adeyanju blasts Tinubu over presidential ambition",
    "summarized_story": "Deji Adeyanju, popular rights activist, has said Bola Tinubu, National Leader of the All Progressives Congress, APC, should be rotting in jail rather than running for the presidency.\nAdeyanju remarked that Tinubu, who has no known source of income, now has unaccounted billions to his name.\nSpeaking with DAILY POST, the Convener of Concerned Nigerian, maintained that Tinubu’s decision to run for Presidency is an insult to the sensibility of Nigerians.\nSomebody who should be in jail is saying he wants to contest to become the president of Nigeria; what an insult to the sensibility of all Nigerians.\nPeople like him should be rotting in jail for the damage done to this country.”Tinubu recently informed President Muhammadu Buhari of his lifelong aspiration to rule Nigeria."
  },
  {
    "headline": "Ekiti 2022: Security agents arrest 500 armed thugs, recover weapons [PHOTOS]",
    "summarized_story": "Some armed thugs have been arrested by a combined team of security agents in Ekiti State.\nDAILY POST gathered that the joint security forces consisting soldiers and policemen, arrested over 500 armed thugs at Ita Awure/Efon Junction in Ekiti state.\nDAILY POST learnt that the armed thugs were apprehended at about 3 am on Wednesday.\nOur correspondent gathered that the thugs were going to Ekiti in an attempt to disrupt the Peoples Democratic Party (PDP) primary in the state.\nIt was gathered that the thugs were believed to be members of Oyo state Park Management System (PMS)."
  },
  {
    "headline": "Buhari fully committed to our progress – Osinbajo assures Nigerians",
    "summarized_story": "Vice President Yemi Osinbajo has assured Nigerians that President Muhammadu Buhari is fully committed to the country’s progress.\nOsinbajo said Buhari is determined to ensure things are done properly in the country.\nAccording to Osinbajo: “One thing that is certain is that there is a determination on the part of the president to ensure that things are done right.\nHe has spent most of his life in public service at various levels.\nOne evident thing is that if there is anyone committed to the progress of this country, he is.”"
  },
  {
    "headline": "Subsidy: Checkmate fuel smuggling out of Nigeria – Lawan tasks paramilitary agencies",
    "summarized_story": "Senate President, Ahmad Ibrahim Lawan, has tasked the paramilitary agencies to stem the tide of fuel smuggling out of Nigeria, saying that the trend was an economic sabotage against the nation.\nHe said it’s important that the current administration should look for a way forward in the management and administration of fuel subsidies in Nigeria.\nLawan said they were aware of the smuggling of petroleum products, which the government was still paying for the subsidy, while he asked the security operatives to stop the smugglers at all cost.\nAccording to him, he convened the meeting to look for ways to checkmate the smuggling of petroleum products outside Nigeria borders in order to equally reduce the cost of fuel subsidy, insisting that the government cannot continue to pay subsidy for products not consumed locally.\nLawan acknowledged the effort of paramilitary agencies in combating smugglers which he said have been herculean, but said, they were entering into another special moment as the smuggling of petroleum products would have to be minimised at all cost."
  },
  {
    "headline": "Tension in PRODA as workers protest DG suspension",
    "summarized_story": "Workers and staff at the Projects Development Institute (PRODA) Enugu have expressed displeasure over the suspension of Dr. Fabian Okonkwo as its Director General.\nDr. Okonkwo was suspended following a recommendation from the Governing Board of PRODA led by the chairman and chieftain of the All Progress Congress (APC) in Enugu, Hon.\nHe described the embattled DG as a committed leader who has changed the ugly narrative in PRODA for good.\n“In terms of staff welfare, Dr. Fabian has demonstrated an uncommon verve in the area of training and retraining of staff.\nOn behalf of workers of the institute, Ohiemi consequently called on President Muhammadu Buhari to wade into the impasse for the purpose of justice and equity."
  },
  {
    "headline": "BREAKING: Okorocha joins 2023 presidential race",
    "summarized_story": "Senator Rochas Okorocha has declared to run for presidency in 2023 on the platform of the All Progressives Congress (APC).\nOkorocha made this known in a letter to the Senate President which was read by Ahmad Lawan at plenary.\nHe said he will address a world press conference on Monday 31st January 2022 to officially declare his ambition to contest the presidency.\nDetails shortly…"
  },
  {
    "headline": "Sammie Okposo to perform at Tope Alabi’s concert amid adultery scandal",
    "summarized_story": "Gospel artiste Sammie Okposo with other colleagues are billed to grace the annual gospel concert organised by popular gospel singer, Tope Alabi tagged ‘Praise the Almighty’.\nThe Nation observed in the early hours of Wednesday, January 26, the apology post has disappeared from his verified Instagram page @Sammieokposo.\n- Advertisement -Read Also: 10 quick facts to know about Sammie OkposoOther gospel singers, including Nathaniel Bassey, Dunsin Oyekan, Judikay and Enikay are also billed to grace Tope Alabi’s concert.\nThe Nation observed that Alabi has started a countdown on her Instagram page with many of her fans looking forward to attend.\nIn a flier shared on her Instagram page, she said: “Friends, are you ready to be part of ‘Praise the Almighty 2022’?"
  },
  {
    "headline": "Nigerian women highest consumers of skin-whitening creams in Africa — Report",
    "summarized_story": "Nigeria’s women have been ranked as the highest consumers of skin-whitening creams in Africa.\nThe data drawn by CNN ranked Nigeria as the top consumer of the creams.\nThe data explained that 75 per cent of women in Nigeria patronise whitening products.\n- Advertisement -Whitening creams are cosmetic products that reduce the melanin or pigment in the skin to make it appear lighter.\nThe skin-whitening industry predominantly caters to women worldwide and people of colour in every region."
  },
  {
    "headline": "Jaruma remanded after Regina Daniel’s husband petition",
    "summarized_story": "Popular Kayamata merchant, Hauwa Muhammed aka Jaruma, has been remanded in prison custody following a petition by Regina Daniel and her billionaire husband, Ned Nwoko.\nAccording to reports, Jaruma was remanded at the Suleja Correctional Centre by an Abuja Upper Area Court after she was arraigned by the police for alleged false news publication, intimidation and defamation of character.\nIt was further reported that she pleaded not guilty and her lawyer made an oral application for bail.\nHowever, the Area court judge, Ismailia Abdullahi, adjourned the matter until Friday, January 28 for the ruling while remanding the Kayamata merchant in prison.\n- Advertisement -Jaruma was arrested on January 21, 2022 on the orders of Ned Nwoko after she alleged that Regina used her products to ‘grab’ Ned Nwoko, a claim the latter refuted."
  },
  {
    "headline": "Buhari okays suspension of fuel subsidy removal for 18 months",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammedu Buhari has approved the suspension of the removal of fuel subsidy earlier scheduled for June 2022 until further notice.\nMinister of State, Petroleum Resources, Timipre Sylva, made the disclosure after meeting with President Muhammadu Buhari in Abuja.\nPresident Buhari had on August 16, 2021 signed the Petroleum Industry Bill into law.\n“President Muhammadu Buhari has agreed to an extension of the statutory period for the implementation of the removal of subsidy on petrol (Premium Motor Spirit, PMS) in accordance with extant laws.\nThat is why we are making this announcement.”On the possible legal implications after the assent to the PIA by President Buhari, the minister said: “We also see the legal implications."
  },
  {
    "headline": "Corruption: Nigeria drops in TI perception rating",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaNigeria has dropped by five places in the Corruption Perceptions Index (CPI) released by Transparency International (TI), yesterday.\nThe CPI aggregates data from eight different sources that provide perceptions by country experts and business people on the level of corruption in the public sector.\nThe index indicates the perception of corruption in Nigeria even though it does not show specific incidences.\nIn the 2020 index, Nigeria had scored 25 out of 100 points, ranking 149 out of the 180 countries surveyed.\n“The 2021 Corruption Perceptions Index released by Transparency International today shows corruption is on the increase in Nigeria."
  },
  {
    "headline": "2023: Nat’l support group unveils Orji Kalu Mobile App",
    "summarized_story": "From Kenneth Udeh, AbujaOUK Movement, the national support group of the Senate Chief Whip, Dr. Orji Uzor Kalu, has launched a digital mobile application to promote the ideology and leadership strides of the Abia-North senator.\nThe digital platform, an acronym for Orji Uzor Kalu was developed to provide a central platform for interest groups and individuals to converge and communicate to promote the initiatives of the former governor.\nHe disclosed that the online mobile App launched this year would serve various purposes including providing a platform where support groups can interact as well as hold virtual meetings.\n“Our group being the official national support group of Orji Uzor Kalu, our goal is to promote his leadership ideology, political ambition as well as showcase his achievements.\n“Nigeria needs a transformer like Senator Orji Uzor Kalu, a young man who has all the qualities of leadership and capabilities."
  },
  {
    "headline": "Over 17,000 Nigerians killed in 2 years – Report",
    "summarized_story": "By Chinelo ObogoNo fewer than 17, 363 persons were killed across Nigeria in violent incidents between 2020 and 2021.\nData derived from media reports revealed that 7,063 people were killed in 2020, while 10,366 were killed in 2021, making it an average of 28 people killed daily in the country.\nThe breakdown showed that 972 were killed in the first quarter of 2020 (January to March), 2, 732 killed in the second quarter (April to June); 1, 588 people killed in the third quarter (July to September) and 1, 771 people killed in the fourth quarter (October to December).\nIn the first quarter of 2020, the report 574 civilians, 77 soldiers and 26 police officers were killed; while in the second quarter of the same year, 1, 053 civilians, 173 soldiers and 39 police officers were killed.\nIn the third quarter, 683 civilians, 119 soldiers and 10 police officers were killed, while in the last quarter, 1147 civilians, 173 soldiers and 32 police officers were killed."
  },
  {
    "headline": "Govt suspends NURTW in Lagos Island",
    "summarized_story": "By Lukman OlabiyiLagos State government has indefinitely suspended the activities of the National Union of Road Transport Workers (NURTW) at Eyin Eyo, Church Street and Idumota Bridge due to the recent violence in those areas.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nAccording to him, the decision was reached at a stakeholders meeting to tackle crisis often caused by the activities of the union.\nAccording to him, those in attendance were from the NURTW, Central Business District (CBD), and Lagos State Market Women Association (Iya Oloja General and Iya Oloja of Lagos Island),Fayinka said the ban was placed to prevent further acts of violence at Idumota, adding that the Lagos State Parks Monitoring Authority would resume duty at Eyin Eyo.\nHe further stated that Rapid Response Squad (RRS), has been directed to station an Armored Personnel Carrier (APC) on Idumota Bridge to deter motorists from driving against traffic in compliance with traffic rules and regulations."
  },
  {
    "headline": "At Last, Senate, House Pass Amended Electoral Bill",
    "summarized_story": "The harmonised version accommodated the direct, indirect, and consensus modes of primary election.\nThe Senate had earlier passed the three modes of primaries, but the version of the House of Representatives did not include the consensus arrangement.\n“(b) The procedure in paragraph (a) above of this subsection shall be adopted for direct primaries in respect of gubernatorial, senatorial, federal and state constituencies.\nHe explained, “You will recall that this House last week, as soon as we returned, looked into the complaints and added the provision of indirect primaries to our law.\nUnfortunately, the Senate added both indirect and consensus, which necessitated the possible need for a conference committee of both chambers."
  },
  {
    "headline": "Buhari Defers Subsidy Removal to Incoming Govt",
    "summarized_story": "The implementation of the PIA which stipulates the removal of petrol subsidy ought to be in February 2022 and was later shifted to July 2022.\nSo, because all these have to converge before we announce the complete removal of subsidy, because Mr. President, especially wants us to ensure that this doesn’t have too much impact on the people, we are now extending the time for subsidy removal.\nThis decision to move the date and suspend subsidy removal beyond June is therefore not surprising.\n“On one hand is the issue of problem of relieving itself of the onerous burden of a burgeoning petrol subsidy.\nThe decision to temporise on subsidy removal, such as contemplated by government, deserves support and we hope this step will give the required time for extensive and wide consultation.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "President Directs Security Agencies to Use 5G Tech to Tackle Insecurity",
    "summarized_story": "”It will also support security institutions with real time communication.\nThe president explained that the National 5G Policy includes a deployment plan to ensure that major cities across the country benefit from the technologies.\nAll these impressive and significant achievements have justified our efforts to support the growth of our digital economy,” he added.\nDescribing the process of developing the National 5G Policy as painstaking, inclusive and focused, Buhari recalled that 5G trials commenced in some selected locations in November 2019.\n”The National 5G Policy will position Nigeria to harness the potentials of 5G technologies to further develop the economy and improve the indices of well-being in the nation,” he said."
  },
  {
    "headline": "Emefiele Forecloses Monetary Policy Tightening to Boost Recovery, Stimulate Growth",
    "summarized_story": "But, Emefiele, while reacting to the development after the two-day meeting of the Monetary Policy Committee (MPC), the first in 2022, further allayed concerns that the monetary authority might possibly react by raising interest rates as well.\nThis came as the apex bank after its meeting, resolved to leave all monetary policy parameters unchanged in a bid to support the recovery and growth of the economy.\nThe CBN left the Monetary Policy Rate (MPR), otherwise known as the interest rate unchanged at 11.5 per cent with the asymmetric corridor of +100/-700 basis points around the MPR.\nIt observed the continued moderate recovery of the domestic economy but requires further concerted policy effort by both the monetary and fiscal authorities to improve the momentum and strengthen the recovery.\n“You all recall that in the last two years, the MPC adopted a policy of price and monetary stability that is conducive to growth."
  },
  {
    "headline": "CBN Retains MPR at 11.5%",
    "summarized_story": "James EmejoTje Central Bank of Nigeria (CBN) Tuesday resolved to leave all monetary policy parameters unchanged in a bid to support the recovery and growth of the economy.\nThe apex bank, after its two-day meeting of the Monetary Policy Committee (MPC), the first in 2022, resolved to retaining the Monetary Policy Rate (MPR), otherwise known as the interest rate, at 11.5 per cent with the asymmetric corridor of +100/-700 basis points around the MPR.\nThe MPR is the rate at which the CBN lends to commercial banks and often determines the cost of borrowing in the economy.\nThe MPC also voted to maintain the Cash Reserve Ratio (CRR) at 27.5 per cent as well as the Liquidity Ratio at 30 per cent.\nCBN Governor, Mr. Godwin Emefiele, while addressing journalists at the close of the meeting, further announced that the banking industry Non-Performing Loans (NPLs) had further reduced to about 4.85 per cent in December, the lowest in about 10 years."
  },
  {
    "headline": "BREAKING: Nigerian Army Arrests Political Thugs From Ibadan With Guns Heading For Ekiti PDP Primaries",
    "summarized_story": "The Nigerian Army on Wednesday morning intercepted some armed members of the Oyo State Park Management System otherwise known as National Union Workers (NURTW) at Ita Awure/Efon Junction, Osun State.\nThe armed thugs were reportedly heading for Ekiti, to disrupt the Peoples Democratic Party (PDP) Primaries, slated for today.\nSaharaReporters gathered that the thugs were mobilised from Oyo State to prevent emergence of a certain candidate for the 2022 governorship election.\nThe Inspector-General of Police, Usman Baba, had earlier deployed additional policemen from Abuja to Ekiti State to complement personnel on the ground in the state to ensure hitch-free primary elections of the Peoples Democratic Party and the All Progressives Congress.\nMobayo, in a statement by the state Police Public Relations Officer, Sunday Abutu, titled “Governorship primaries – Ekiti State CP deploys adequate security, sues for peace,” reiterated the command’s readiness and deployment of adequate personnel to all voting centres and other relevant places across the state."
  },
  {
    "headline": "BREAKING: Nigerian Army Arrests Political Thugs From Ibadan With Guns Heading For Ekiti PDP Primaries",
    "summarized_story": "The Nigerian Army on Wednesday morning intercepted some armed members of the Oyo State Park Management System otherwise known as National Union Workers (NURTW) at Ita Awure/Efon Junction, Osun State.\nThe armed thugs were reportedly heading for Ekiti, to disrupt the Peoples Democratic Party (PDP) Primaries, slated for today.\nSaharaReporters gathered that the thugs were mobilised from Oyo State to prevent emergence of a certain candidate for the 2022 governorship election.\nThe Inspector-General of Police, Usman Baba, had earlier deployed additional policemen from Abuja to Ekiti State to complement personnel on the ground in the state to ensure hitch-free primary elections of the Peoples Democratic Party and the All Progressives Congress.\nMobayo, in a statement by the state Police Public Relations Officer, Sunday Abutu, titled “Governorship primaries – Ekiti State CP deploys adequate security, sues for peace,” reiterated the command’s readiness and deployment of adequate personnel to all voting centres and other relevant places across the state."
  },
  {
    "headline": "Abdulsalami Culpable In Our Father’s Death, Displays Dishonesty – MKO Abiola’s Family Lambasts Ex-Head Of State",
    "summarized_story": "The family of late Chief MKO Abiola has tackled a former Head of State, General Abdulsalami Abubakar (rtd), over his claims on the death of the acclaimed winner of the 1993 presidential election.\nAbdulsalami AbubakarJamiu, one of the children of Abiola, said the former head of state denied their father proper medical attention, hence his death.\nGen Abdulsalami is much older.\n“Gen Abdulsalami was more interested in getting diplomats to talk to my father and persuade him to relinquish his mandate so that he (Abdulsalami) could enjoy a more legitimate stay in power.\n“This world might be a circus to the former head of state, but let’s see what the hereafter has in store for him.”"
  },
  {
    "headline": "Abdulsalami Culpable In Our Father’s Death, Displays Dishonesty – MKO Abiola’s Family Lambasts Ex-Head Of State",
    "summarized_story": "The family of late Chief MKO Abiola has tackled a former Head of State, General Abdulsalami Abubakar (rtd), over his claims on the death of the acclaimed winner of the 1993 presidential election.\nAbdulsalami AbubakarJamiu, one of the children of Abiola, said the former head of state denied their father proper medical attention, hence his death.\nGen Abdulsalami is much older.\n“Gen Abdulsalami was more interested in getting diplomats to talk to my father and persuade him to relinquish his mandate so that he (Abdulsalami) could enjoy a more legitimate stay in power.\n“This world might be a circus to the former head of state, but let’s see what the hereafter has in store for him.”"
  },
  {
    "headline": "Abdulsalami Culpable In Our Father’s Death, Displays Dishonesty – MKO Abiola’s Family Lambasts Ex-Head Of State",
    "summarized_story": "The family of late Chief MKO Abiola has tackled a former Head of State, General Abdulsalami Abubakar (rtd), over his claims on the death of the acclaimed winner of the 1993 presidential election.\nAbdulsalami AbubakarJamiu, one of the children of Abiola, said the former head of state denied their father proper medical attention, hence his death.\nGen Abdulsalami is much older.\n“Gen Abdulsalami was more interested in getting diplomats to talk to my father and persuade him to relinquish his mandate so that he (Abdulsalami) could enjoy a more legitimate stay in power.\n“This world might be a circus to the former head of state, but let’s see what the hereafter has in store for him.”"
  },
  {
    "headline": "LIVE: PDP delegates vote for flagbearer in Ekiti governorship election",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "LIVE: PDP delegates vote for flagbearer in Ekiti governorship election",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "'Take my advice and stop the mudslinging' -- Ortom tackles presidency",
    "summarized_story": "Samuel Ortom, governor of Benue, has asked the presidency to desist from mudslinging and address issues bothering the country.\nHe said instead of addressing these issues, the Buhari government resorted to mudslinging and tried to paint Ortom in a bad light.\nIs it Governor Ortom that stopped the President from revamping the country’s refineries after such humongous sums were spent on it?\n“It is therefore curious that Garba did not address the issues Governor Ortom raised in the interview with AriseTV.\nWe think the President and his handlers will do well to take Governor Ortom seriously when he speaks than indulging in unnecessary mudslinging."
  },
  {
    "headline": "'Take my advice and stop the mudslinging' -- Ortom tackles presidency",
    "summarized_story": "Samuel Ortom, governor of Benue, has asked the presidency to desist from mudslinging and address issues bothering the country.\nHe said instead of addressing these issues, the Buhari government resorted to mudslinging and tried to paint Ortom in a bad light.\nIs it Governor Ortom that stopped the President from revamping the country’s refineries after such humongous sums were spent on it?\n“It is therefore curious that Garba did not address the issues Governor Ortom raised in the interview with AriseTV.\nWe think the President and his handlers will do well to take Governor Ortom seriously when he speaks than indulging in unnecessary mudslinging."
  },
  {
    "headline": "Abdulsalami: I rehabilitated Obasanjo after his time in prison",
    "summarized_story": "Abdulsalami Abubakar, former head of state, says he rehabilitated ex-President Olusegun Obasanjo after he was released from prison in 1998.\nAbdulsalami took over power after the death of Abacha in 1998 and subsequently released Obasanjo and some other prisoners.\nAdvertisementIn an interview with TRUST TV, the former head of state said after Obasanjo was released from prison he threatened to go to court because his business had crumbled.\n“We released Obasanjo and other prisoners and pardoned them,” he said.\n“So, when Obasanjo was released he came to see me, saying he was going to take the government to court."
  },
  {
    "headline": "Uber's bike-hailing service makes it way to Ibadan as competition heats up",
    "summarized_story": "On Monday, Uber Nigeria announced its two-wheeler service, UberMoto, will commence operations in the city, where it started ride-hailing operations last October.\nUber charges motorcyclists on its platform a service fee of 3% per trip with a minimum fare set at ₦100 ($0.24) for riders.\nUber may be a market leader in the countries it operates but in Ibadan, stiff competition already awaits.\nUganda—SafeBoda’s first market—was the initial African country where Uber and Bolt decided to launch their bike-hailing service, uberBODA and Bolt boda.\nIn addition to a large population and a motorcycle culture, regulatory certainty is another reason bike-hailing startups prefer Ibadan."
  },
  {
    "headline": "Norebase wants to be the node that fuses Africa into a country",
    "summarized_story": "He handled a couple of these as ad-hoc services and then began to see his idea of “Country Africa” unfolding like a morning flower—slow but significant.\nImage credit: Terna IwarThe startup handles everything it takes for a business to launch in a new African country.\nIt’s a 360 degree business launchpad: business registrations, opening of business bank accounts, compliances, license acquisition, and further legal requirements—all from one dashboard.\nEssentially, Norebase wants to be the partner a business would need to operate in a new African market.\nIf AfCFTA wants to create a single African market, think of Norebase as a tool that will power its efficiency."
  },
  {
    "headline": "Tesla’s African expansion is imminent but is it reasonable to drive one in Lagos?",
    "summarized_story": "Granted these remarks hold some merit as many African countries do not have the supporting infrastructure, and very few electric cars are sold in Africa.\nIn November 2020, Hyundai unveiled its first Nigerian electric car named Hyundai Kona.\nThe agreement currently only covers the company selling Tesla charging infrastructure.\nThe use of charging stations gives a sense of the general demand for Tesla cars.\nAnswering the big questionWhile all these moves hint that the expansion of electric car companies to Africa is inevitable, it doesn’t answer the question on many people’s minds: Can electric cars thrive on the African continent?"
  },
  {
    "headline": "Ismael Belkhayat on his way to building Morocco's first unicorn",
    "summarized_story": "For Belkhayat, who has since adopted Ironman as his alias, competing at the sport can be likened to building a business.\nThe next idea came during a trip; Belkhayat had chosen to accompany his wife Sophia Alj, ex-strategy consultant at McKinsey, during a business trip.\nAccording to Belkhayat, Chari currently transacts about $2.5 million monthly.\nBelkhayat the strategistBased on lessons from his previous startups, Belkhayat carved a different operational strategy for Chari, a strategy that rounds up its liability to almost zero.\nEven though Belkhayat is bullish on expanding in many African countries in the coming months, there are countries he won’t go to."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Norebase’s solution for African expansion, InstaDeep’s $100M Series B",
    "summarized_story": "Share this article:Hi there,Today we’re discussingNorebase’s solution for African expansionInstaDeep’s $100M Series BOne-click expansion for African startupsTola Onayemi speaking at the SOAS Khartoum conference in 2019.\nEager to free the continent from colonial rule, leaders from several African colonies pushed for a united front, but that never happened.\nThe African Continental Free Trade Area (AfCFTA) Agreement — has come very close to doing this, inspiring Tola Onayemi to build Norebase in the process.\nYou can read more here: What borderless expansion looks like for African startups with NorebaseInstaDeep’s $100M Series BInstaDeep team.\nSource: TechCrunchIt’s only January, but we already have the first $100M round for an African startup in 2022 as Tunisian startup, InstaDeep has announced its $100M Series B round."
  },
  {
    "headline": "What borderless expansion looks like for African startups with Norebase",
    "summarized_story": "And I worked on that.”On a clear, sunny day on July 7, 2019, Nigeria signed the AfCFTA in Niamey, Niger.\nOne of them was being able to build out a formidable team interested in African prosperity.\nWith most African businesses, you would have to cherry-pick from 54 markets because the disposable income in individual African countries can be low.”According to him, expansion is a survival issue for most African businesses.\nAs of 2020, nine of the ten countries on the world’s poorest countries list were African.\nThere’s also the fact that building for the African market is quite different in the sense of having to sometimes do everything yourself."
  },
  {
    "headline": "Uber’s bet on ‘Okada’",
    "summarized_story": "Uber’s gamble on Nigerian motorbikesThe gist: On Monday, Uber launched UberMoto, its motorbike on-demand service in Ibadan, Nigeria, to join competitors like SafeBoda, MAX.ng, and Gokada.\nHowever, despite its slow but calculated expansion rate, it took Uber this long to bring any other vertical asides car-hailing into the country.\nBut that would also mean partaking in the loss suffered following the Okada ban in February 2021.\nFrom Uber’s country manager, Tope Akinwumi’s comment about the launch, the plan is to provide a cost-effective and quicker transportation option.\nWhile UberMoto would rest on Uber’s image, which by the way, is pretty new to Ibadan, we can’t say it will be Uber’s top priority to make it work."
  },
  {
    "headline": "Nigeria faces higher budget deficit on revived subsidy",
    "summarized_story": "Nigeria’s Federal Government budget deficit in 2022, already tipped to top public estimates, will rise further with the revived petrol subsidy leaving Abuja with no choice but to borrow more.\n“With additional expenditure against the projected revenue, deficit financing will be needed to support the subsidy budget expenditure,” Nigeria’s largest business think tank, the Lagos Chamber of Commerce and Industry (LCCI), said on Tuesday.\nNigeria is already faced with the risk of recording the biggest budget deficit in history this year if actual revenues continue at the run rate of the past five years, BusinessDay’s analysis of budget implementation data shows.\nHigher oil prices have been a double-edged sword for Nigeria, which higher oil revenue had been swallowed up by the actual cost of importing petroleum products.\nIn November and October, petrol subsidy payments stood at N131.4 billion and N163 billion, respectively, according to findings by BusinessDay."
  },
  {
    "headline": "How Nigeria failed to lead vaccine production in Africa",
    "summarized_story": "The EU intends to invest about $1.2 billion to build vaccine manufacturing hubs in Africa.\n“If Nigeria matched its commitment with the desired action, Nigeria could have made appreciable progress even if not in mass vaccine production or sales.\nThose vaccines were produced at the Federal Vaccine Production Laboratory, Yaba in Lagos State – the first vaccine institute established in the country.\nRead also: What to know about billionaire opening vaccine plant in South AfricaIn the same vein, the Nigerian government released N10 billion in 2020 for a vaccine production company.\nThe government is in talks with the World Bank’s private lending arm and other lenders to raise about N12.3 billion ($30m) to help finance a vaccine plant, three decades after the vaccine production facility was shut, he said."
  },
  {
    "headline": "Obaseki swears in 14 new permanent secretaries, as Edo readies for e-governance switchover February 1 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, swore in 14 new permanent secretaries, urging them on the delivery of efficient and quality services to Edo people.\nObaseki, at the swearing-in of the new permanent secretaries, comprising nine males and five females at the Government House, Benin City, said the government will switch over from analogue to e-governance, effective from February 01, 2022.\n“We are working extremely hard to bring back the civil and public service to those days when it was respected.\nThe newly sworn-in permanent secretaries include Mr. Anelu Osemen, Mrs. Felicia Edwards, Mrs. Grace Aihie, Mr. Egwakhide Gilbert, Mr. Iserhienrhien Efe and Mr. Aikhuomobhogbe Uidia.\nOsemen, on behalf of the new permanent secretaries, pledged to reciprocate the confidence reposed on them, contributing effectively to the progress and development of the state."
  },
  {
    "headline": "Obaseki assures speedy completion of police project in Orhionmwon, others to boost security in Edo communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reassured the government’s commitment to ensure the speedy completion of the Police Area Command Office in Urhomehe, Orhionmwon Local Government Area, and other projects across communities in the state to improve security and guarantee the safety of lives and property of residents.\nThe governor noted that his administration’s sustained investment in the state’s security architecture is part of efforts to make Edo a safe haven for investors, ensuring the influx of investors into the state.\nNoting that the project is the first Area Command Office in Orhionmwon LGA, the governor said security remains a topmost priority for the state government.\nDisclosing the government’s plan to build accommodation for officers that would be posted to the Area Command, the governor reassured that the project will enhance formidable security architecture in the locality that meets international best practices.\nAlso, the jubilant residents of Urhomehe hailed Obaseki and EDSOGPADEC board for the project, noting that the building will speed up the development of the area."
  },
  {
    "headline": "Int’l Education Day: Obaseki urges more resilient, equitable systems to tackle learning poverty – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for increased collaboration among global stakeholders to build a more effective, equitable and resilient education system so as to tackle learning poverty and improve access to inclusive and quality education.\nObaseki gave the charge in commemoration of the fourth International Day of Education, marked by the United Nations and its sister agencies, with the theme ‘Changing Course, Transforming Education’.\nThe governor assured that his government will continue to deepen ongoing reforms in the state’s education sector, ensuring to provide the right infrastructure, technology and manpower for improved access to quality education across the state.\nAccording to him, “Today, as we mark the fourth International Day of Education, it is imperative to reiterate the need for a more resilient and equitable education system to tackle learning poverty, improve access to quality education and reduce the global out-of-school population.\n“Like other sectors, education suffered a huge gap during the COVID-19 pandemic due to the closure of schools, universities, and other educational institutions, excluding about 268 million children from school."
  },
  {
    "headline": "Edo retail sector booms, as new entrants disrupt market – Nigerian Observer",
    "summarized_story": "The Edo State Government has in the last few years advanced policies to attract investors, promising favourable policies and infrastructure to make the state an investors’ haven.\nThis resulted in the setting up of the Edo State Investment Promotion Office (ESIPO) and support for the provision of investment-friendly infrastructure.\nAccording to him, “A lot is happening with the retail sector in Edo State.\nThe new entrants are poised to provide jobs, thereby increasing economic activities.\nThey will help in the collection of indirect taxes and also provide jobs for youths."
  },
  {
    "headline": "Ogoni land: Effect of oil spill persists three decades on",
    "summarized_story": "SPDC stopped production in Ogoni land and withdrew from the area as the activities of MOSOP become more violent.\nAlthough Ogoni land continued to serve as a transit route for pipelines transporting both SPDC and third-party oil production from other areas.\nToday, grasses have grown, the locals have cultivated their farms, planting mostly cassava and banana, and at first glance, the effect of oil exploration is hardly visible.\nIndeed, going round Ogoni land it’s easy to see that for the foreseeable future, the cleanup will remain a topic for politics and political settlement for the boys.\nWe had arrived Port Harcourt at exactly 8:14 am for an on-the-spot assessment of the impact of oil exploration in Ogoni, and indeed Rivers State."
  },
  {
    "headline": "LCCI seeks phased withdrawal of fuel subsidy, tasks FG on full implementation of PIA",
    "summarized_story": "By OBINNA EZUGWUThe Lagos Chamber of Commerce & Industry (LCCI) has called for gradual withdrawal of fuel subsidy, noting that it understands the concerns that total withdrawal will inflict more economic hardship on Nigerians.\nIt therefore, asked the government to pursue phased withdrawal while gradually developing critical infrastructure to enhance economic productivity.\nThe chamber also asked the government to ensure that the recently signed Petroleum Industry Act (PIA) is implemented fully.\n“The Chamber had earlier issued a statement commending the Federal Government and made a strong case for best practice in the implementation of the Petroleum Industry Act 2021.\nLess than a year into the signing of the Act, the implementation has suffered a flip-flop as some of the provisions of the Act are being suspended."
  },
  {
    "headline": "CBN Meeting in focus, Spotlight shines on Fed",
    "summarized_story": "Back in November, the central bank decided to leave interest rates unchanged at 11.5%.\nWhile other countries across the globe are experiencing untamed inflation, Nigeria’s inflation continues to slow.\nAlthough the annual inflation rate rose to 15.63% in December, after eight straight months of declines – the trend still points south.\nThis continues to provide the CBN enough breathing room to leave interest rates unchanged in an effort to promote economic growth.\nSpotlight swings on Fed meetingAlthough monetary policy is widely expected to remain unchanged, the FOMC meeting could provide some key insight into how aggressive the Fed intends to tighten policy throughout 2022."
  },
  {
    "headline": "Money supply increased to 13.77% in December 2021 – CBN",
    "summarized_story": "The Central Bank of Nigeria (CBN) has said broad money supply (M3) to Nigerian economy increased further to 13.77% in December 2021, compared to 10.10% in November 2021.\nBroad money (M3) refers to the amount of money in circulation in a given economy.\nThe CBN said, “Reviewing the developments in monetary aggregates, the Committee noted that broad money supply (M3) rose further to 13.77 per cent in December 2021, compared with 10.10 per cent in November 2021.”The CBN linked the surge in money supply to a growth in assets, which is a fundamental component in money supply.\nThe slowdown in growth of Net Foreign Assets (NFA) resulted from a decrease in foreign assets holdings of the banking system in favour of more domestic investments,” the apex bank noted.\nOn the other hand, Net Foreign Assets (NFA) decreased to 6.06% in December 2021, compared to 14.98% in November 2021"
  },
  {
    "headline": "Unilever Sacks 1,500 In Global Overhaul",
    "summarized_story": "Unilever is cutting 1,500 management jobs around the world as the consumer goods giant comes under intense pressure from shareholders to boost growth.\nThe cuts amount to a 15% reduction in the number of senior managers and 5% of junior managers, Unilever said in a statement on Tuesday.\nShareholders have ratcheted up the pressure on Unilever after its stock sank 10% last year.\nThe firm’s shares got hammered last week after the company revealed it had made three failed bids to acquire GlaxoSmithKline’s consumer health care business.\nUnilever said Thursday that it would not raise its rejected £50 billion ($68 billion) offer, and the stock subsequently bounced back."
  },
  {
    "headline": "Mexican Journalist, Lourdes Maldonado López, Killed In Tijuana",
    "summarized_story": "Journalist Lourdes Maldonado López was killed on Sunday in northern Mexico’s border city of Tijuana, marking the third killing of a journalist in the country in two weeks.\nLópez was shot to death inside a car in Tijuana’s Santa Fe neighborhood, according to a Sunday statement from the Baja California Attorney General Office.\nLocal law enforcement first received a report on Sunday at 7 p.m. local time and found López dead upon arrival, it said.\nBonilla was sworn in as governor of Baja California in November 2019 after running a successful campaign as a candidate of López Obrador’s ruling Morena party.\nADVERTISEMENTCNN has reached out to Bonilla and PSN for comment."
  },
  {
    "headline": "Ex-Lagos SSG, Adeniran-Ogunsanya, Is Dead",
    "summarized_story": "A former Secretary to the Lagos State Government, Princess Adenrele Adeniran-Ogunsanya, is dead.\nIt was learnt that the she died early Tuesday, January 25, 2022 after a brief illness.\nAdenrele Adeniran-Ogunsanya, who was in her 60s, was the Lagos SSG during the first term in office of Governor Babatunde Raji Fashola, SAN between 2007 and 2011.\nShe was the daughter of prominent Ikorodu born politician and associate of the late Nnamdi Azikiwe, the late Prince Adeniran Ogunsanya.\nADVERTISEMENTThe deceased was the apex Leader of the Lagos4Lagos Movement which members recently defected to the Peoples Democratic Party (PDP) alongside with their lead visioner, Dr Abdul Azeez Olajide Adediran a.k.a Jandor."
  },
  {
    "headline": "Ex-Lagos SSG, Adeniran-Ogunsanya, Is Dead",
    "summarized_story": "A former Secretary to the Lagos State Government, Princess Adenrele Adeniran-Ogunsanya, is dead.\nIt was learnt that the she died early Tuesday, January 25, 2022 after a brief illness.\nAdenrele Adeniran-Ogunsanya, who was in her 60s, was the Lagos SSG during the first term in office of Governor Babatunde Raji Fashola, SAN between 2007 and 2011.\nShe was the daughter of prominent Ikorodu born politician and associate of the late Nnamdi Azikiwe, the late Prince Adeniran Ogunsanya.\nADVERTISEMENTThe deceased was the apex Leader of the Lagos4Lagos Movement which members recently defected to the Peoples Democratic Party (PDP) alongside with their lead visioner, Dr Abdul Azeez Olajide Adediran a.k.a Jandor."
  },
  {
    "headline": "Subsidy Suspension: Again, Federal Gov’t To Amend PIA",
    "summarized_story": "President Muhammadu Buhari has approved the suspension of the removal of fuel subsidy until further notice.\nSylva, who spoke to State House correspondents after the meeting, said the executive arm of government will propose 18-month extension to National Assembly to be incorporated in the Petroleum Industry Act (PIA) 2021.\n“We are proposing an 18-month extension but what the National Assembly is going to approve is up to them.\nWe would approve an 18-month extension and then it is up to the National Assembly to look at it and pass the amendment as the see it.\nA few months ago, the President already proposed an amendment to the law,” Sylva stated."
  },
  {
    "headline": "Electoral Bill: At last, lawmakers okay consensus with tough conditions",
    "summarized_story": "The Senate and the House of Representatives yesterday harmonised their positions on the 2010 Electoral Act (Amendment) Bill.\nBoth chambers agreed that “consensus” should be a part of the mode of nominating candidates by political parties for elections.\nAccording to the bill, parties must receive written consent from all aspirants.\nSenators had while reworking the bill vetoed by President Muhammadu Buhari approved direct, indirect primary and consensus modes.\n”When this is signed, political parties would have the responsibility of ensuring that they follow the law."
  },
  {
    "headline": "Electoral Bill: At last, lawmakers okay consensus with tough conditions",
    "summarized_story": "The Senate and the House of Representatives yesterday harmonised their positions on the 2010 Electoral Act (Amendment) Bill.\nBoth chambers agreed that “consensus” should be a part of the mode of nominating candidates by political parties for elections.\nAccording to the bill, parties must receive written consent from all aspirants.\nSenators had while reworking the bill vetoed by President Muhammadu Buhari approved direct, indirect primary and consensus modes.\n”When this is signed, political parties would have the responsibility of ensuring that they follow the law."
  },
  {
    "headline": "Drama as Reps Majority Leader gets 28th child, lawmaker pursues 30",
    "summarized_story": "There was a drama at the House of Representatives on Tuesday when it was announced that one of the wives of the Majority Leader, Alhassan Ado-Doguwa, had been delivered of the lawmaker’s 28th child.\nThe drama began at the opening of the day’s plenary when the Speaker, Femi Gbajabiamila, asked the Majority Leader if he had any personal explanation or announcement to make.\nWhile Ado-Doguwa said there was none, the Minority Leader, Ndudi Elumelu, announced that the Majority Leader just had a new child.\nIt was 26, now 28.”Gbajabiamila asked the Majority Leader to defend himself, saying he did not understand what Elumelu was saying.\nPlease, the count still continues.”Ado-Doguwa had stormed the chamber with his four wives for his inauguration as Majority Leader of the House in 2019."
  },
  {
    "headline": "Drama as Reps Majority Leader gets 28th child, lawmaker pursues 30",
    "summarized_story": "There was a drama at the House of Representatives on Tuesday when it was announced that one of the wives of the Majority Leader, Alhassan Ado-Doguwa, had been delivered of the lawmaker’s 28th child.\nThe drama began at the opening of the day’s plenary when the Speaker, Femi Gbajabiamila, asked the Majority Leader if he had any personal explanation or announcement to make.\nWhile Ado-Doguwa said there was none, the Minority Leader, Ndudi Elumelu, announced that the Majority Leader just had a new child.\nIt was 26, now 28.”Gbajabiamila asked the Majority Leader to defend himself, saying he did not understand what Elumelu was saying.\nPlease, the count still continues.”Ado-Doguwa had stormed the chamber with his four wives for his inauguration as Majority Leader of the House in 2019."
  },
  {
    "headline": "Updated: Sammie Okposo blanks out",
    "summarized_story": "Embattled gospel musician Sammie Okposo has set his Instagram account to private following a barrage of criticisms over his affair with a US-based pregnant side chic.\nThe ‘Wellu Wellu’ singer had confessed and publicly apologised for cheating on his wife Ozioma during his trip to the United States.\nIn the video, the lady identified as African Doll revealed that their relationship lasted several months and that they also had unprotected sex.\nShe also revealed that she will be keeping the baby even though Okposo asked her to have an abortion, adding that she is not asking the gospel singer for money.\nOkposo’s verified Instagram account where he apologised to his wife has now been set on private, with the apology inaccessible."
  },
  {
    "headline": "Rashford sends farewell message to Martial",
    "summarized_story": "Manchester United striker, Marcus Rashford, has sent a supportive farewell message to Anthony Martial after he left the Red Devils to join Sevilla.\nMan United on Tuesday confirmed that Martial had completed a loan move to Sevilla.\nReacting, Rashford, in a tweet via his Twitter handle, wished Martial, who he described as his brother, all good luck at Sevilla.\nThe England international wrote: “Good luck my brother,” with a heart emoji.\nMan United said in a statement: “Martial, who will wear Sevilla’s No."
  },
  {
    "headline": "APC: Court Strikes Out Suit Challenging Legality Of Buni-Led CECPC",
    "summarized_story": "A complaint challenging the competence of Governor Mai Mala Buni-led Caretaker Extra-Ordinary Convention Planning Committee (CECPC) of the All Progressives Congress has been dismissed by a Federal High Court in Port Harcourt, Rivers State.\nA Delta State High Court, had on October 15, 2021, struck out an action filed by Elvis Ayomanor and others, challenging the APC Ward, LGA and State Congresses.\nThe Federal High Court ruling has, therefore, put to rest issues surrounding the legality of the Buni-led Caretaker Extra-Ordinary Convention Planning Committee.\nWhat we have is an attrition of interests, which is normal in a ruling party that many believe, will continue to lead Nigeria beyond 2023.\nPDP is saying there is a problem in APC, and their Governors, Senators and other heavyweights are dumping their party for the ruling APC."
  },
  {
    "headline": "Afenifere Plans Political Party, Insists On State Police, Constitution Review",
    "summarized_story": "Afenifere, a pan-Yoruba socio-political organization, has announced that it will launch a new political party in time for the 2023 elections.\nThe organisation said this on Tuesday, at its Annual General Meeting held at the country home of its acting leader, Chief Ayo Adebanjo, in Sanya Ogbo, Ijebu-Ode, Ogun State.\nAfenifere, however did not disclose the name of the party and the time it would be unveiled.\nBut, we are forming a political party.\n“Afenifere is convinced that restructuring of the Nigerian state before the 2023 general elections is achievable."
  },
  {
    "headline": "Labour Suspends National Protest Over Planned Subsidy Removal",
    "summarized_story": "The Nigeria Labour Congress’s leadership has postponed a planned nationwide protest slated for January 27, 2022.\nPresident of the Nigeria Labour Congress, Ayuba Wabba made the announcement on Tuesday, a few hours after the Federal Government indicated that petroleum subsidy would continue for another 18months timeframe.\nWabba said the decision to suspend the protest followed a virtual National Executive Council meeting held at noon on Tuesday.\nFollowing the reversal and reapproach by the government, the National Executive Council of the Nigeria Labour Congress met this morning virtually to consider the new position of the government.\nThe NEC after vigorous debates took a decision to suspend the planned nationwide protest scheduled for 27″ January 2022 and the national protest scheduled for 2″ February 2022."
  },
  {
    "headline": "JUST IN: Lagos State Govt. Suspends NURTW Operations Indefinitely Over Idumota Clashes",
    "summarized_story": "Following a threat by the President of the National Union of Road Transport Workers (NURTW) that the union’s chapter in Lagos could be suspended, the Lagos State Government has indefinitely suspended transport union operations around Lagos Island, particularly on Church Street, Eyin Eyo, and the Idumota Bridge, due to recent clashes that have paralyzed activities in the state’s Idumota axis.\nMore details soon…"
  },
  {
    "headline": "Breaking: Buhari set to visit Zamfara – Matawalle",
    "summarized_story": "Zamfara state governor Bello Mohammed Matawalle has revealed that President Muhammadu Buhari will visit Zamfara state on Thursday.\nGovernor Matawalle disclosed this at an emergency meeting with all political appointees at Government House Council Chamber on Tuesday night.\nAccording to him, the main purpose of the visit is to commiserate and condole with his administration over the recent terrorist attacks in Anka and Bukkuyum local government areas where 58 people were killed in the areas.\nHe said all is set to ensure the president is received successfully.\nGovernor Matawalle Matawalle urged the entire people of the state to remain law abiding citizens during the visit by the President."
  },
  {
    "headline": "Insecurity: Northeast must rise from ashes of destruction – Zulum",
    "summarized_story": "Zulum speaksSpeaking at the meeting held at the Congress Hall of Transcorp Hilton, Governor Zulum said the state government had initiated a 25-year master plan to rebuild the North East.\nIt will be a reflection of our doggedness to rise from the ashes of destruction into the bright and welcoming place of peace and development.\n“Using Borno state as an example, we will make available our 25-year development plan as starting point on our own side.\n“Accordingly, in 2019, His Excellency President Muhammadu Buhari inaugurated the North East Development Commission Board for rebuilding the zones ravaged by Boko Haram insurgency.\nAlso, the Draft NEDC and North-East Region Strategy Documents and proposed Pillars of the ten-year Master Plan are ready."
  },
  {
    "headline": "Revealed! Full list of richest people in Africa *Dangote on top again, two other Nigerians soar",
    "summarized_story": "Forbes Magazine, Monday, reported that Nigerian billionaire Aliko Dangote has topped the 2022 list of Africa’s richest persons for the 11th year in a row.\nAccording to the report, Dangote’s wealth jumped from $12.1 billion last year to an estimated $13.9 billion.\nForbes attributed the growth to a 30% increase in the stock price of Dangote Cement, his most valuable asset.\nTwo other Nigerian billionaires – Abdulsamad Rabiu and Mike Adenuga – ranked 6th and 7th richest persons on the continent with estimated values of $7 billion and $6.7 billion respectively.\nThe report added that Africa’s billionaires were richer than they had been in years, despite the global pandemic."
  },
  {
    "headline": "Suspension Of Fuel Subsidy Removal Will Result In More Borrowings, Says Adesina",
    "summarized_story": "﻿Nigeria may have to continue to borrow due to the suspension of the removal of fuel subsidy, the Presidency said on Wednesday.\nThe President’s Special Adviser on Media and Publicity, Femi Adesina, stated this during an interview on Channels Television’s breakfast programme, Sunrise Daily.\nBut many, including the President of the Nigerian Bar Association (NBA), Olumide Akpata, believe the suspension of the fuel subsidy removal has to do with the coming elections in 2023.\nHe also debunked claims that the present administration’s proposal to extend the removal of fuel subsidy by 18 months was intended to booby-trap the next president.\nThis fuel subsidy, whether it stays or goes, is going to have a serious impact on the economy.”"
  },
  {
    "headline": "Gov Primary: Soldiers Arrest Over 100 Armed Thugs In Ekiti Border",
    "summarized_story": "Over 100 armed thugs have been arrested by soldiers in Ekiti border town of Itawure in Efon Alaaye.\nPolice Spokesperson in the state, Sunday Abutu, confirmed to Channels television that the suspects coming from Oyo state axis were apprehended by soldiers on guard at the border town with Osun State.\nHe explained that the suspected political thugs were arrested with various dangerous weapons including cutlasses, guns, and charms.\nThe PDP primary scheduled for today is set to commence as eight aspirants are out to contest for the party’s ticket in the 2022 Governorship election.\nThe delegate primary election is holding in Ado Ekiti, the Ekiti State capital."
  },
  {
    "headline": "Fuel Subsidy: NLC Suspends Planned Nationwide Protest",
    "summarized_story": "The Nigeria Labour Congress (NLC) has suspended its planned nationwide protest.\nThe decision comes hours after the union had vowed to continue with its planned nationwide rally on Thursday and after the Federal Government announced the suspension of the planned removal of the fuel subsidy.\nRead Also: FG Proposes Extension Of Fuel Subsidy Removal By 18 Months, Seeks To Amend PIA“NLC is still standing on its position,” he had said.\nThe Federal Government had earlier announced the suspension of the planned removal of fuel subsidy.\nShe explained that the government would make provisions for fuel subsidy beyond its initial June deadline in the 2022 budget."
  },
  {
    "headline": "FG Proposes Delay Of Fuel Subsidy Removal By 18 Months, Seeks To Amend PIA",
    "summarized_story": "The Federal Government is proposing to extend the period for the implementation of the removal of subsidy on Premium Motor Spirit (PMS), popularly known as petrol, by 18 months.\nThe Minister of State for Petroleum Resources, Mr Timipre Sylva, announced this on Tuesday while briefing State House correspondents in Abuja.\nHe disclosed that the government has concluded plans to approach the National Assembly to amend the Petroleum Industry Act (PIA).\n“With assent by the President on August 16, 2021, the PMS subsidy removal was therefore expected to take place effective February 16, 2022.\nPresident Muhammadu Buhari, he stated, has assured Nigerians that his administration would continue to put in place all necessary measures to protect the livelihoods of the citizens, especially the most vulnerable."
  },
  {
    "headline": "Alleged N84m: EFCC To Arraign Edrian Osagie Days After Siege At Court",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) is set to arraign a suspect, Edrian Osagie, two days after its operatives kept a vigil at the Federal High Court in Ikoyi, Lagos.\nAccording to documents obtained by Channels Television on Wednesday, Osagie is charged with two counts bordering on fraud and stealing to the tune of N84 million.\nThe suspect is to be arraigned before Justice Serifat Solebo of the Special Offences Court sitting in Ikeja.\nREAD ALSO: FG Didn’t Suspend Fuel Subsidy Removal Because Of 2023 Elections, Says AdesinaIn the first count, the EFCC accused Osagie of obtaining money by false pretence contrary to Sections 1(1) and 1(3) of the Advance Fee Fraud and Other Fraud Related Offences Act No.\nThe anti-graft agency, in the second count, accused the suspect of stealing contrary to Sections 278 and 285 of the Criminal Law of Lagos State of Nigeria, No 11, 2011."
  },
  {
    "headline": "Okowa recalls EAC Oghenesivbe three weeks after he was sacked -",
    "summarized_story": "Governor of Delta State, Ifeanyi Okowa, has recalled to duty his Executive Assistant on Communications, Fred Latimore barely three weeks after he was sacked.\nThe governor had on 29th December, 2021, relieved his appointment on grounds of gross insubordination and recklessness, traced to a post the Mr Latimore made on social media which was condemned in government circles.\nAdvertisementGovernor Okowa in a recall letter signed by the Secretary to the State Government, Patrick Ukah, cautioned Mr Latimore to strictly abide to the rules of engagement for political appointees and aides to the governor.\nReacting to development, Coalition for Media Politics and Governance in a statement by its Publicity Secretary, Tagbarha Malcolm, thanked Governor Okowa for being a listening, pragmatic, foresighted and responsive leader."
  },
  {
    "headline": "Reps, Senate harmonise Electoral Act Amendment Bill -",
    "summarized_story": "The National Assembly has Harmonized the Electoral Act Amendment Bill to allow for direct Primaries, indirect primaries and Consensus in Political party Elections.\nPresident of the Senate , Ahmad Lawan made the announcement at Plenary on Tuesday.\nAdvertisementConsensus is one the three options introduced in the re-amended Electoral Act Amendment Bill which the Senate passed on January 19.\nRecall that both chambers of the National Assembly Recommitted the Bill after it was Rejected by President Muhammadu Buhari and rescinded it’s decision on the contentious clause 84 that imposes Direct Primaries on Political PartiesAdvertisementWhile the Senate left all options open for the selection of Political Candidates, the House of reps did not approve for Consensus.\nHowever both Chambers have now harmonized contending clauses of the bill to now permit direct and indirect primaries and consensus."
  },
  {
    "headline": "Corruption Index: Nigeria ranks 154 out of 180 countries on CPI for 2021 -",
    "summarized_story": "Nigeria has once again dropped places to rank at 154 out of 180 countries in the transparency international corruption perception index report for 2021This was revealed at the launch of the 2021 index report released exclusively in Nigeria by the civil society legislative advocacy centreAdvertisementThis ranking puts Nigeria on 24 points dropping one point in scores and down 5 places compared to the previous year on the list."
  },
  {
    "headline": "Court fixes February 23 for arraignment of Ondo Speaker, lawmakers -",
    "summarized_story": "An Akure High Court has fixed February 23 for the arraignment of the Speaker of the Ondo State House of Assembly, Mr Bamidele Oleyeloogun and two members of the Assembly.\nThe EFCC had dragged the Speaker, former Clerk of the Assembly, Mr.\nAccording to him, the EFCC has not made the charges against the suspects available in order to prepare the defence.\nBut the counsel to the EFCC, Mr K U. Kudus said he has served the suspects through the House of Assembly.\nAdvertisementKudus asked the court to adjourn the matter for him to properly serve the suspects."
  },
  {
    "headline": "IMF Urges El Salvador to Remove Bitcoin as Legal Tender",
    "summarized_story": "The International Monetary Fund (IMF) has urged El Salvador to reverse its decision to make Bitcoin legal tender.\nIn September, El Salvador became the first country to allow consumers to use the cryptocurrency in all transactions, alongside the US dollar.\nWhen El Salvador introduced the virtual currency as a legal tender, the government released a new digital wallet app, giving away $30 (£22) in Bitcoin to every citizen.\nIt presented the measure as a way to boost economic development and jobs, but El Salvador has been divided by the move.\nPresident Bukele announced in November plans to build a Bitcoin city at the base of a volcano in El Salvador, with the cryptocurrency used to fund the project."
  },
  {
    "headline": "AFCON: Mane Concussed But Scores Before Being Taken Off as Senegal Reach Quarter Finals",
    "summarized_story": "Sadio Mane scored as Senegal beat nine-man Cape Verde 2-0 in the last 16 at the Africa Cup of Nations, but was immediately forced off with concussion.\nMane curled in off the underside of the crossbar soon after keeper Vozinha had been dismissed over a nasty clash of heads with the Liverpool forward.\nCape Verde midfielder Patrick Andrade had been shown a straight red card midway through the first half, while Bamba Dieng added Senegal’s second in second-half injury time.\nSenegal manager Aliou Cisse said Mane had been taken to hospital following the game.\nMeanwhile, the Cape Verde keeper couldn’t walk straight before being ushered away by his team-mates following his red card."
  },
  {
    "headline": "Unvaccinated Man Denied Heart Transplant by Boston Hospital",
    "summarized_story": "A US hospital has rejected a patient for a heart transplant at least in part because he is not vaccinated against Covid-19.\nDJ Ferguson, 31, is in dire need of a new heart, but Brigham and Women’s Hospital in Boston took him off their list, said his father, David.\nThe hospital’s carefully worded statement may suggest other factors lie beyond the patient’s unvaccinated status for his ineligibility, but it refused to discuss specifics, citing patient privacy.\nA father-of-two with a third child on the way, Mr Ferguson remains at the hospital, said his loved ones.\nEarlier this month, a Minnesota woman sued her local hospital after doctors tried to take her unvaccinated husband off the ventilator he had been on for two months."
  },
  {
    "headline": "US Could Sanction Putin Personally If Russia Invades Ukraine, Biden Says",
    "summarized_story": "US President Joe Biden says he would consider personal sanctions on Vladimir Putin if Russia invades Ukraine.\nMr Biden said there would be “enormous consequences” for the world if Russia made a move on the nation, which sits on its south-western border.\nDiplomats from Russia, Ukraine, Germany and France will gather in Paris on Wednesday for talks about the ongoing tensions.\nTaking questions from reporters on Tuesday, Mr Biden replied “yes” when asked whether he could see himself imposing sanctions on the Russian president personally in the event of an invasion.\nMr Biden added that he would feel obliged to beef up Nato’s presence in eastern Europe if Russia invaded."
  },
  {
    "headline": "Nigeria to Amend Oil Law as Buhari Suspends Fuel Subsidy Removal for 18 Months",
    "summarized_story": "The implementation of the PIA which stipulates the removal of petrol subsidy ought to be in February 2022 and was later shifted to July 2022.\nHowever, due to pressure and threats of protests by the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC), the decision was on Monday suspended.\nThe Nigeria Labour Congress (NLC) also announced the suspension of its nationwide protest.\nThis decision to move the date and suspend subsidy removal beyond June is therefore not surprising.\n“On one hand is the issue of problem of relieving itself of the onerous burden of a burgeoning petrol subsidy."
  }
]