[
  {
    "headline": "SON gets new ISO certification to check cybercrimes",
    "summarized_story": "The Standards Organisation of Nigeria has unveiled plans to checkmate cyber crimes with its ISO 27001 Information Security Management Systems Courses certification.\nThe certification is aimed at standardising the nation’s Information Technology sector.\nDirector-General, SON, Mallam Farouk Salim, made this known in a report generated from the agency’s certification validation exercise made available to newsmen on Friday in Lagos.\nThe SON boss further said the training would also ensure that SON could commence offering ISO 27001 Information Security Management Systems Courses for institutions and businesses.\n“It will also help institutions and businesses that wish to secure their information away from hackers and other cyber security threats."
  },
  {
    "headline": "Incessant attacks on Shiroro communities insane, unacceptable, says Gov Bello",
    "summarized_story": "The Governor of Niger State, Abubakar Sani Bello, has described the attacks by terrorists in some communities in the Shiroro Local Government Area of the state as insane and unacceptable.\nThis was disclosed in a statement signed by the Chief Press Secretary to the Governor, Mary Noel-Berje, Friday.\n“It is now time that full-fledged war should be declared on these unscrupulous elements since they have been proscribed as terrorists.\nTwo communities in Shiroro LGA were reported to have been attacked recently when most of the villagers were on their farms to harvest their farm produce.\nThe attacks led to the killing of many, houses and food bans were also burnt."
  },
  {
    "headline": "Father Edeh disowns Pro-Biafra Facebook Post",
    "summarized_story": "Renowned Catholic Cleric and Chancellor of Madonna University, Prof. Emmanuel Edeh has disowned a Facebook post in which he reportedly threw his support for pro-Biafra agitation.\nIn the said post, Father Edeh was said to have asked President Muhammadu Buhari to let the people of Biafra to freely exit Nigeria, adding “Nigeria expired in 2014.\n“According to Amalgamation document, any nation that wants to leave after 100 years can freely do so,” Edeh reportedly said in the now disowned Facebook post.\nWhile denying the post which has since gone viral, Prof Edeh said he did not make any post or publication in the Facebook or in any other platform whatsoever concerning IPOB or Biafra.\n“The general public is hereby notified that the aforesaid post or publication in the Facebook was not made by him and should be seen as having nothing to do with it,” the statement noted."
  },
  {
    "headline": "One year remembrance: Family, friends, others remember Ndubuisi Kanu",
    "summarized_story": "By Dapo AkinrefonMrs Gladys Ndubuisi Kanu, widow of former military administrator of Imo and Lagos States, Rear Admiral Ndubuisi Kanu (retd), on Thursday, organised a one year remembrance service and reception in his honour.\nIn a statement, Mrs Kanu also dismissed a statement purportedly issued by one Kelly Kanu, who claimed to be the head of the family noting that “it is a shame that he did not participate in his father’s memoria.”The statement reads: “The one year remembrance service and reception for my dear late husband, Rear Admiral Ndubuisi Kanu was held yesterday, 13th of January 2022.\nIt is now up to the family to take up that mantle and privilege, and I am personally committed to continuing his good works.\n“Brought to my attention is a statement by Mr Kelly Kanu purported as head of my husband Rear Admiral Ndubuisi Kanu’s family.\nAdditionally, I am the only wife (and also the only legal wife) of Admiral Godwin Ndubuisi Kanu and therefore in law, the widow and the head of family."
  },
  {
    "headline": "Air Peace honours Nigerian military with Priority boarding",
    "summarized_story": "By Lawani MikairuAir Peace, has announced the introduction of a Priority Boarding Policy for Nigeria’s military personnel- both serving and retired.\nAccording to the Executive Chairman of the airline, Barrister Allen Onyema, this is a way of honouring them for the huge sacrifices they make for the nation.\nOnyema said that the airline holds in high regard the indispensable contributions of the military in securing Nigeria and defending its territory from external aggression.\nOur ground staff have also been enjoined to appreciate them”, he said.\nOnyema urged other passengers to show understanding and cooperate with the airline’s ground personnel to ensure a seamless implementation of the new policy, and called on other applicable businesses to adopt a similar policy in honour of the Nigerian military."
  },
  {
    "headline": "Again, Djokovic faces deportation after cancellation of visa for second time",
    "summarized_story": "Novak DjokovicBy Emmanuel OkogbaWorld number 1, Novak Djokovic could still be deported despite winning his first appeal against attempts to deport him by the Australian government over his Covid-19 vaccine status.\nThe decision was taken by immigration minister Alex Hawke and the 34-year-old could now be deported from Australia.\nIt also means that Djokovic could possibly face a three-year ban from getting a visa for the country, but this can be waived.\nAccording to reports, Lawyers and Judge agree this case is fresh and not related to what happened at the airport when Djokovic arrived.\nHis legal team say the argument now is over whether Djokovic will excite anti vax sentiment if he stays."
  },
  {
    "headline": "Group urges Buhari not to transmit NDDC 2021 budget, demands board inauguration",
    "summarized_story": "Civil society organisation, the Niger Delta Peoples Forum has condemned the reported surreptitious meeting between the NDDC Sole Administrator, Effiong Akwa, with a joint session of the National Assembly committees on Niger Delta Affairs.\nThe NDDC Act which explicitly states how the Commission is to be governed is clear on the process for the approval of NDDC annual Budget by the National Assembly.\nThe 2020 Financial year for NDDC’s budget as approved by the National Assembly expired on December 31, 2021.\nThis will ensure compliance with the NDDC Act, promote and sustain peace, equity and fairness, transparency and accountability, good governance and rapid development and transformation of the Niger Delta Region.\nChief Boma Ebiakpo, National Chairman, Niger Delta Peoples Forum"
  },
  {
    "headline": "Roads linking federal secretariat Abuja to be shut over Armed Forces Day",
    "summarized_story": "Ahead of the Armed Forces Remembrance Day, commemorated every January 15th, the Federal Government has ordered the closure of roads linking the National Arcade, Abuja as from 2:00pm on Friday.\nThe directive was contained in a circular that emanated from the Office of the Head of Civil Service of the Federation, Dr. Folasade Yemi-Esan.\nThe circular called the attention of all Ministries, Departments and Agencies (MDAs) of government located around the area, including the general public.\nIt notified that there would be a closure of the linking roads to the federal secretariat from 2.00pm prompt today.\nRecall that the armed forces remembrance day is an annual activity to honour the nation’s fallen heroes."
  },
  {
    "headline": "Nnamdi Kanu: Lawyer gives update ahead of trial resumption",
    "summarized_story": "Ifeanyi Ejiofor, lead counsel to the detained leader of the Indigenous People of Biafra, Nnamdi Kanu has said all is set for the secessionist to reappear in court to continue his trial next week.\nThe statement claimed Nnamdi Kanu’s detractors will be comprehensively humbled and permanently put to shame after the next court session.\n“We coalesced the product of our individual reflections on the most potent legal strategies henceforth to be adopted, fine-tuned and harmonized them, and then distilled them into a single, conclusive, potent, workable formula.\n“You will all behold with your eyes an interesting dimension in the harmonized workable formula we have evolved.\nFurther, Onyendu utilized the opportunity afforded by our visit to mandate us to admonish his teeming supporters and followers”."
  },
  {
    "headline": "NDLEA silent as Obi Cubana faces ‘drug money’ probe weeks after EFCC invitation",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) is investigating Obi Iyiegbu a.k.a.\nObi Cubana over his alleged connection with drug lords.\nThe Chairman of Cubana Group was grilled over funds paid into his companies’ accounts by convicted dealers from India, Malaysia and Nigeria.\nNDLEA Media Director, Femi Babafemi refused to provide any information on the probe when contacted on Friday.\nAsked to confirm if Obi Cubana will return for questioning, Babafemi reiterated: “Again, no comment”."
  },
  {
    "headline": "AbiaPoly SUG decries hike in cost of commodities, warn campus vendors",
    "summarized_story": "The Students Union of Government (SUG), Abia State Polytechnic, Aba, has frowned at the hike in the prices of commodities on campus by vendors and canteen operators.\nThe SUG’s position on the hike of commodities on campus is contained in a press release jointly signed by Chief Judge of the Students Union Government, Akandu Chima, the Speaker, Oya Harrison Onyekachi and the SUG President, Ibeh Prince Progress.\nThe student union government further warned against hawking within the school premises by vendors, stressing that such would no longer be tolerated on campus.\nThe press release said, ”Students are by this notice informed to report any kind of extortion and exploitation to the Students Union Government for necessary actions.\n“Students are also encouraged to obey the school rules and regulations and the SUG code of conduct as enshrined in the SUG constitution."
  },
  {
    "headline": "Your audit report is biased, unfair, must be disregarded – Provost, OCE to Osun Auditor general",
    "summarized_story": "The management of Osun State College of Education, Ila-Orangun has demanded a withdrawal of a recent audit report indicting its bursary department.\nIn a letter to the State’s Commissioner for Education, Oladoyin Folorunsho, Prof Afolabi claimed the audit report which indicted him and others was biased, unfair and should be disregarded.\nHe expressed concern over the declaration of a state of emergency by the Auditor General on the institution’s bursary department, claiming the audit report which indicted him and others was biased, unfair and should be disregarded.\nDAILY POST gathered that the initial audit report of the college by the approved firm was balanced and favourable as it hailed the transparent and accountable stance of the college Bursar.\nIn the new audit report by the Auditor General, the Bursar, Oyediji was accused of financial impropriety and reported to the Osun State House of Assembly."
  },
  {
    "headline": "I’ve retired from impregnating women – 2Baba",
    "summarized_story": "Multiple award-winning singer, Innocent Idibia aka 2Baba has declared he won’t impregnate any woman again.\nThe “African Queen” iconic singer said this in a viral video, which surfaced online during Idoma International Carnival, an annual event in Otukpo, the hometown of 2Baba, in Benue State.\nHe said: “I see say some babes dey fear to shout like that for that side.\nhes__black said: “Baba please no retire, Ijeoma for my street dey form hard to get and she the crush on you.\nAbeg Annie na joke oo.”Ezeqwesiri stated: “He didn’t say he retired."
  },
  {
    "headline": "Ohanaeze: Igbo President will ensure balance, sense of belonging",
    "summarized_story": "By Emmanuel Badejo and Yetunde AfolabiA President of the Southeast extraction will ensure political balance and a sense of belonging to the region, President-General of Ohanaeze Ndigbo Worldwide, Prof George Obiozor, said yesterday.\nThe former Ambassador to the United States said history, the principle of fairness, morality and “all logical reasoning” justify the demand for an Igbo president.\nOn Igbo President, the Ohanaeze President-General said: “It is important at this time in the history of Nigeria for each region to be given a sense of belonging for peace to reign.\nWe have our strategies and we are united enough to produce the president of Nigeria.\n“However, I can’t predict the Igbo president, but from all we can see, an Igbo should be the next president."
  },
  {
    "headline": "Tinubu a dedicated leader, political colossus – Gov Matawalle",
    "summarized_story": "Zamfara Governor Bello Matawalle has thanked the National leader of the All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu for finding time to visit the State over the recent twin bandits attacks which left 58 persons dead in some communities of Anka and Bukkuyum local government areas.\nThe Governor also noted “since the sad incident of attacks in Anka and Bukkuyum local government areas, we’ve been inundated with messages and visitations from all over the country.\n- Advertisement -Considering the reality that the conflict is tied to ethnic fault lines, Matawalle said he initiated a reconciliation programme which leaders of thought overwhelmingly accepted all over the State.\n“As a result of the programme of dialogue and reconciliation, hostilities ceased for a period of over nine months.\nIn furtherance of the government intervention, Gov Matawalle noted that under the dialogue process, the state government have also been committing enormous resources in the provision of logistics and allowances for the security forces."
  },
  {
    "headline": "Djokovic Deportation: Atedo Peterside commends Australian authorities",
    "summarized_story": "Chairman of Anap Foundation COVID-19 Think Tank, Atedo Peterside, has commended the decision of Australian authorities to kick Tennis star, Novak Djokovic out of the country.\nBut Djokovic’s high-powered legal team overturned the visa decision in court on a procedural matter related to his airport interview.\n- Advertisement -On Friday, the country revoked the tennis star visa for a second time under separate powers in Australia’s Migration Act.\nRead Also: Djokovic situation is bad for tennis, Murray saysHe carpeted the star for not isolating himself after testing positive for the dreaded infection.\nSo too is his failure to isolate himself after testing positive for #COVID19.”"
  },
  {
    "headline": "Kanu begs supporters to be peaceful in court Tuesday",
    "summarized_story": "Detained leader of Indigenous People of Biafra(IPOB), Nnamdi Kanu has appealed to his supporters to conduct themselves in a peaceful manner during his next court appearance.\nHis lawyer, Ifeanyi Ejiofor made this known in statement after his visit on Thursday to Kanu in detention.\n- Advertisement -“We are optimistic that the court outings of Onyendu would be impressive.\n“Further, Onyendu utilised the opportunity afforded by our visit to mandate us to admonish his teeming supporters and followers.\nEjiofor said that Kanu expressed his profound gratitude and appreciation to millions of his followers and supporters scattered throughout the face of the earth."
  },
  {
    "headline": "2023 presidency: Why I’m yet to join presidential race –Orji Kalu",
    "summarized_story": "By Wilfred EyaSenate Chief Whip and Former governor of Abia State, Dr Orji Uzor Kalu has given reasons why he is hesitant to declare for the 2023 presidential race.\nPresident Buhari cannot do everything in one day.\nI am going to be 62 years old on April 21 and President Buhari is my father.\nWhat is happening in Nigeria is that every president, governor, minister, commissioner, whoever he succeeds would be his enemy.\nSo, I believe in what President Buhari said."
  },
  {
    "headline": "NLNG crashes cooking gas price, approves 100% production into domestic market",
    "summarized_story": "The development may not be unconnected with strong calls and appeals from stakeholders in the gas sector that NLNG increase its supply of LPG into the domestic market which they claim accounts for about 65 per cent.\nThey argued that the shortfall of 35 per cent is sourced from imports which comes at a premium due to the imposition of Value Added Tax of 7.5 per cent among other added cost, leading to a sharp rise in cooking gas price.\nConsumers of cooking gas had in the last five months contended with the escalating price of the product, forcing many to resort to the use of dirty fuels which included; charcoal, firewood, Kerosene among others.\nNLNG explained that these initiatives are designed to increase LPG availability in Nigeria, diversifying its uses and support the Federal Government’s Decade of Gas initiative.\nNLNG is currently the highest single supplier of LPG into the domestic market, with an estimated 400,000 metric tonnes supplied in 2021."
  },
  {
    "headline": "Buhari leads Sanwo-Olu, Abiodun, others to visit Shonekan’s family",
    "summarized_story": "By Lukman OlabiyiPresident Muhammadu Buhari, yesterday, led Lagos State Governor, Babajide Sanwo-Olu, his Ogun and Yobe states counterparts, Dapo Abiodun and Mai Mala Buni, to visit the Lagos residence of the head of Interim National Government during the annulled June 12, 1993 presidential election, the late Ernest Shonekan.\nPresident Buhari and his entourage, who arrived at Shonekan’s house, Lugard Avenue at about 4:40pm were received by members of the late Shonekan family.\nBuhari, who was on a one-day presidential visit to Ogun State to commission some projects by the Governor Abiodun’s administration, stopped over in Lagos on his way to Abuja and spent some time to commiserate with the Shonekan family.\nHe said the late elder statesman did his best for the country in contributing to the growth and development of Nigeria.\nThe governor also praised Shonekan’s contributions to the economy of Nigeria as boardroom guru and employer of labour, especially during his tenure as the chairman and managing director of the United Africa Company."
  },
  {
    "headline": "APC govs DG warns against electing emperor as national chairman",
    "summarized_story": "From Romanus Ugwu, Abuja and John Adams, NigerDirector General of All Progressives Congress (APC) Progressive Governors Forum (PGF), Salihu Lukman, has warned against electing an emperor as the national chairman in the forthcoming convention.\n“Where necessary, APC leaders may wish to stretch the search for a national chairman beyond current aspirants.\nAPC need a national chairman, who is humble, with very good relations and respect among both party leaders and members.\n“Being a humble national chairman, such a person must be ready to subordinate himself/herself to party leaders at local levels.\nHowever, the national chairman and party leaders at state level should be encouraged to develop structured processes of consultations to ensure the political interest of the national chairman is protected in the state."
  },
  {
    "headline": "Nigeria loses N630.57bn to Twitter ban",
    "summarized_story": "By Chinenye AnuforoNigeria lost a whopping N630.57 billion in seven months of ban on Twitter operations in the country just as US, UK, EU welcome its return to Nigeria.\nIn the same vein, former Vice President, Atiku Abubakar, has expressed gladness over the lifting of the Twitter ban by the Federal Government.\nAtiku, in a tweet, said the effects of the Twitter ban on small businesses in Nigeria was evident for all to see.\nBut, the Federal Government on Wednesday finally lifted the ban on Twitter operations in Nigeria.\nWhile some Nigerians reacted positively to the lifting of the ban on Twitter by the government others were of the view that the ban was unnecessary ab initio."
  },
  {
    "headline": "Breaking: Again, Australia Revokes Novak Djokovic’s Visa",
    "summarized_story": "Australia has revoked tennis star Novak Djokovic’s visa for a second time in a row over his right to remain in the country unvaccinated.\nThe decision on “health and good order” grounds means he could be deported and get a three-year visa ban.\nThe men’s tennis number one was scheduled to play in the Australian Open, which begins on Monday.\nFor the moment, Djokovic remains in the Australian Open draw and is due to face fellow Serb Miomir Kecmanovic early next week.\nBut on Friday evening in Melbourne, Mr Hawke cancelled Djokovic’s visa under separate powers in Australia’s Migration Act."
  },
  {
    "headline": "Buhari: Abiodun Worthy Example of Promises Made, Promises Kept",
    "summarized_story": "Describing Abiodun as the “Performing Governor of Nigeria’s Gateway State,” the president maintained that the governor was a worthy example of promise made, promises kept.\n“This has made Ogun State one of the safest and most peaceful states in the country and investors’ destination of choice,” Buhari stated.\n“I am particularly impressed by the quality and standard of your road projects, and the creative way you have deployed resources to reconstruct and rehabilitate them.\nIt is significant to note that the two road projects being commissioned today are federal roads.\nThe president was received by Abiodun and five other governors, namely, Governor Babajide Sanwo-Olu of Lagos; Yobe State Governor, Mai Mala Buni; Ekiti State Governor, Dr. Kayode Fayemi; Osun State Governor, Alhaji Gboyega Oyetola; Governor Rotimi Akeredolu of Ondo State, and the representative of Oyo State Governor, Mr. Rauf Olaniyan."
  },
  {
    "headline": "We’re Tackling Mutant Polio Virus Type2 Outbreak, Says FG",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe federal government yesterday said it was working with development partners to address cases of circulating mutant polio virus Type2 (cMPV2) found in some parts of the country.\nIt blamed the cases of polio outbreak on disruptions to routine immunisation due to the COVID-19 pandemic.\nEfforts are also being ramped up to increase routine immunisation coverage beyond pre-COVID values,” he said.\nHe said, “For the avoidance of doubt, no case of Wild Polio Virus (WPV) has been reported anywhere in the country since the last case in 2016.\n“NPHCDA assures Nigerians that the agency and partners will continue to conduct surveillance and vaccination campaigns to prevent and contain any possible importation of the Wild Polio Virus into the country."
  },
  {
    "headline": "Emefiele: Pan-African Settlement Platform Will Reduce Dollar, Other FX Usage in Africa",
    "summarized_story": "PAPSS is a cross-border financial market infrastructure enabling payment transactions across Africa, bridging trade challenges in a continent with over 41 known currencies.\nIt is expected to boost intra-African trade by transforming and facilitating payment, clearing and settlement for cross-border trade across Africa.\nPAPSS provides the solution to the disconnected and fragmented nature of payment and settlement systems that had long impeded intra-African trade.\n“Prior to the launch of PAPSS, settlements for intra Africa trade required a third currency and a non-African correspondent bank.\n“The launch of PAPPS gives the fresh opportunity and aspiration for the African continent."
  },
  {
    "headline": "Anambra Governor-elect, Soludo, Appoints Ezekwesili as Head of Transition Committee",
    "summarized_story": "David-Chyddy Eleke in AwkaThe governor-elect of Anambra State, Prof. Chukwuma Soludo, has released a list of people to midwife his swearing-in as governor of Anambra State on 17 March.\nThe list, which was released to THISDAY by Soludo’s media aide, Joe Anatume, comprised 80 members with prominent Nigerians who will play diverse roles.\nThe former Minister of Education, Oby Ezekwesili, will head the committee, while Prof. Benedict Oramah, Prof. Pat Utomi and Mr Osita Chidika are members of the committee.\n“This is to announce the constitution of a Transition Committee which will liaise with a team set up by the government of Anambra State to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\n“Members are expected to arrive on Wednesday, 19th while the inauguration and first plenary sessions start on the 20th."
  },
  {
    "headline": "BREAKING: Boko Haram Attacks Nigerian Police Training School, Abducts Many Instructors",
    "summarized_story": "Members of the deadly Boko Haram terrorist sect, on Thursday, invaded the police mobile training school in the Limankara Gwoza local government area of Borno State abducting many people in the process.\nThe training school is located twenty-five kilometres from Gwoza town, the hometown of Senator Ali Ndume, the Chairman Senate Committee on Army.\nThe insurgent fighters reportedly attacked the training school on Thursday night with gun trucks and shot sporadically into the air before kidnapping the mobile police instructors.\nAlso, the Borno State Governor, Babagana Zulum lamented the current security situation in the State and the Northwest as he charged the military not to relax or rest on their oars.\nAccording to Zulum, Boko Haram terrorists now celebrate wedding ceremonies and collect taxes from some communities without confrontation by the military."
  },
  {
    "headline": "BREAKING: Boko Haram Attacks Nigerian Police Training School, Abducts Many Instructors",
    "summarized_story": "Members of the deadly Boko Haram terrorist sect, on Thursday, invaded the police mobile training school in the Limankara Gwoza local government area of Borno State abducting many people in the process.\nThe training school is located twenty-five kilometres from Gwoza town, the hometown of Senator Ali Ndume, the Chairman Senate Committee on Army.\nThe insurgent fighters reportedly attacked the training school on Thursday night with gun trucks and shot sporadically into the air before kidnapping the mobile police instructors.\nAlso, the Borno State Governor, Babagana Zulum lamented the current security situation in the State and the Northwest as he charged the military not to relax or rest on their oars.\nAccording to Zulum, Boko Haram terrorists now celebrate wedding ceremonies and collect taxes from some communities without confrontation by the military."
  },
  {
    "headline": "How Pastor In Apostle Suleman’s Church Ordered Members To Brutalise Me, Husband – Nigerian Woman In Austria Recounts Ordeal",
    "summarized_story": "According to her, Jesse had reached out to her to support him with the payment of church rent to avoid eviction.\nIt had also been reported that Pastor Jesse promised to pay back the loan but refused after several years.\nAccording to her, anytime she requested a repayment, the pastor would start blackmailing and threatening to deal with her.\nI recently stopped, to talk to members and the pastor concerning the loans I loaned him which they used to pay the rent for the church.\nSee Also Scandal Exclusive: Pastor In Apostle Suleman's Omega Fire Ministry Allegedly Brutalises Austria-based Nigerian Lady For Asking Repayment Of Five-year-old Loan“I got there with my three kids."
  },
  {
    "headline": "How Pastor In Apostle Suleman’s Church Ordered Members To Brutalise Me, Husband – Nigerian Woman In Austria Recounts Ordeal",
    "summarized_story": "According to her, Jesse had reached out to her to support him with the payment of church rent to avoid eviction.\nIt had also been reported that Pastor Jesse promised to pay back the loan but refused after several years.\nAccording to her, anytime she requested a repayment, the pastor would start blackmailing and threatening to deal with her.\nI recently stopped, to talk to members and the pastor concerning the loans I loaned him which they used to pay the rent for the church.\nSee Also Scandal Exclusive: Pastor In Apostle Suleman's Omega Fire Ministry Allegedly Brutalises Austria-based Nigerian Lady For Asking Repayment Of Five-year-old Loan“I got there with my three kids."
  },
  {
    "headline": "How Pastor In Apostle Suleman’s Church Ordered Members To Brutalise Me, Husband – Nigerian Woman In Austria Recounts Ordeal",
    "summarized_story": "According to her, Jesse had reached out to her to support him with the payment of church rent to avoid eviction.\nIt had also been reported that Pastor Jesse promised to pay back the loan but refused after several years.\nAccording to her, anytime she requested a repayment, the pastor would start blackmailing and threatening to deal with her.\nI recently stopped, to talk to members and the pastor concerning the loans I loaned him which they used to pay the rent for the church.\nSee Also Scandal Exclusive: Pastor In Apostle Suleman's Omega Fire Ministry Allegedly Brutalises Austria-based Nigerian Lady For Asking Repayment Of Five-year-old Loan“I got there with my three kids."
  },
  {
    "headline": "EXTRA: God preserved me to become Nigeria's president, says Dele Momodu",
    "summarized_story": "Dele Momodu, journalist and publisher of Ovation Magazine, says he has been preserved by God to become Nigeria’s president.\nEarlier, Momodu declared his 2023 presidential interest when he met with Ayorchia Ayu, chairman of the Peoples Democratic Party (PDP), at the party headquarters in Abuja.\nThere is no brand bigger than — brand Dele Momodu — in Nigeria.\nYou hardly find such in any political party.\nDele Momodu was preserved by God for that role.”When asked if he would leave the PDP if he did not get the ticket, he said he would support any candidate who emerges as the party’s standard-bearer."
  },
  {
    "headline": "EXTRA: God preserved me to become Nigeria's president, says Dele Momodu",
    "summarized_story": "Dele Momodu, journalist and publisher of Ovation Magazine, says he has been preserved by God to become Nigeria’s president.\nEarlier, Momodu declared his 2023 presidential interest when he met with Ayorchia Ayu, chairman of the Peoples Democratic Party (PDP), at the party headquarters in Abuja.\nThere is no brand bigger than — brand Dele Momodu — in Nigeria.\nYou hardly find such in any political party.\nDele Momodu was preserved by God for that role.”When asked if he would leave the PDP if he did not get the ticket, he said he would support any candidate who emerges as the party’s standard-bearer."
  },
  {
    "headline": "Insecurity: 14 Nigerians killed every day in 2021 -- Zamfara, Kaduna top list of deaths",
    "summarized_story": "Killings were reported in all the months of 2021; May had the highest reported deaths with 684 while October had the least with 290.\nSouth-east witnessed a sharp rise in violent attacks with 567 deaths from reported attacks.\nAdvertisementZamfara had the highest number of reported deaths with 703 deaths, followed by Kaduna with 652 and Benue with 460.\nTheCable observed that Zamfara, Kaduna, Benue and Niger accounted for 42 percent of the reported deaths in 2021.\nAdvertisementThe north-west region recorded the highest number of reported deaths with 1,963 deaths, followed by the north-central with 1,248 and the north-east with 548."
  },
  {
    "headline": "Insecurity: 14 Nigerians killed every day in 2021 -- Zamfara, Kaduna top list of deaths",
    "summarized_story": "Killings were reported in all the months of 2021; May had the highest reported deaths with 684 while October had the least with 290.\nSouth-east witnessed a sharp rise in violent attacks with 567 deaths from reported attacks.\nAdvertisementZamfara had the highest number of reported deaths with 703 deaths, followed by Kaduna with 652 and Benue with 460.\nTheCable observed that Zamfara, Kaduna, Benue and Niger accounted for 42 percent of the reported deaths in 2021.\nAdvertisementThe north-west region recorded the highest number of reported deaths with 1,963 deaths, followed by the north-central with 1,248 and the north-east with 548."
  },
  {
    "headline": "Report: NDLEA grills Obi Cubana over ‘drug links’ amid EFCC probe",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has questioned Obi Iyiegbu, the socialite better known as Obi Cubana, over allegations linking him to an illegal narcotics business.\nIt was gathered that the socialite was allowed to go home in order to get some documents and return at a later date.\nAdvertisementIt is also understood that the NDLEA and the Economic and Financial Crimes Commission (EFFC) have widened their probe into Obi Cubana and his business based on the premise that he may be involved in the drug business.\nAdvertisementThe fresh case comes after the EFCC had similarly grilled Cubana for alleged money laundering and tax fraud.\nIt also follows after NDLEA arrested and detained De General, a skit maker, over drugs found in his Lagos home."
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "Tarneem Saeed: The entrepreneur at the forefront of Sudan’s economic renaissance",
    "summarized_story": "alsoug, founded in 2016 by Tarneem Saeed, is reportedly the biggest tech startup in the country; the funding round speaks to this fact.\nWhat is surprising, however, is that, in a conservative and conflict-torn nation like Sudan, a woman-led company is at the forefront of bringing Sudan’s economy back to health.\nGet the best African tech newsletters in your inboxTarneem Saeed and founding alsougSaeed left Sudan for the first time when she was 14.\nAccording to Saeed, the company has managed to capture the biggest market share because of their operational strategy.\nThe Sudan market is tough, and what helped alsoug was building light as they grew; they didn’t try to overweigh the market all at once."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Real estate as NFTs, social media in the metaverse: Projections for blockchain in Africa",
    "summarized_story": "However, Buchi Okoro, CEO of crypto exchange, Quidax, doesn’t think so.\nSocial media is going to the metaverseThe metaverse, NFT, and Web3 were some of the biggest buzzwords of 2021 in the crypto sphere.\nSource: TechnextHanu Fejiro Abodje, CEO of alternative payments solution company, Patricia, has indicated an interest in the Solana blockchain, which has been touted as the Ethereum killer.\nIt brings ease and simplicity to using crypto platforms, reducing the financial barrier of participating in activities such as NFTs and decentralised finance (DeFI).\nAfrican NFT project, Afrobubble, was created on the Solana blockchain because of the ease the chain brings to buying and selling NFTs."
  },
  {
    "headline": "TwitterBan and future shutdowns, Lipa Later’s $12m pre-Series A, Fintech Farm’s $7.4m seed",
    "summarized_story": "Today, I’m discussing:Nigeria’s Twitter ban as a model for future shutdownsLipa Later’s $12 million raiseFintech Farm’s $7.4m funding#TwitterBan Update: A model for future shutdowns?\nBut now, in Nigeria, why would Twitter agree to some of the conditions imposed by the federal government?\nOluwanifemi Kolawole answered my questions and probably some of yours in this article: #Twitterban update: A precedent for future shutdowns?\nLipa Later’s $12 million pre-Series ASource: SuppliedKenyan Buy Now, Pay Later (BNPL) startup, Lipa Later, has raised $12 million in pre-Series A to expand into Nigeria, Ghana, and Tanzania.\nFintech Farm’s $7.4 million seed roundSource: TechcrunchA UK-based fintech startup, Fintech Farm, that creates digital banks in emerging markets, has raised $7.4 million in seed funding to launch neobanks in 8 countries over the next 24 months."
  },
  {
    "headline": "#Twitterban update: A precedent for future shutdowns?",
    "summarized_story": "We are deeply committed to Nigeria, where Twitter is used by people for commerce, cultural engagement, and civic participation.\nOrdinarily, this does not apply to social media sites because they are not under their jurisdiction.\nFar from over: Possible tales of ‘once again’While China is considered the region with the strictest Internet shutdowns, Africa is often regarded as the most volatile environment for social media.\nEthiopia, for instance, has had 12 Internet shutdowns, and as of 2020, Chad had accumulated almost two and a half years of Internet disruptions within five years.\nWhile circumventing social media censorship with VPNs appears to be the easiest way out, the issue of privacy and free speech are still cause for worry."
  },
  {
    "headline": "BEDC to restore service to Uvbe, Evbuobanosa, Abudu, others soon – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOGHADA – Expectations are high in some communities in Orhionmwon and parts of Uhunmwode local government areas of Edo State, as maintenance work on broken down electricity cables, poles and transformers in the area is expected to commence soon.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, among others have been without electricity for more than five years.\nAccording to a youth leader in the area, Saturday Irabor, the Agbor business unit of Benin Electricity Distribution Company (BEDC) notified the communities of arrangements to reconnect them back to the national grid.\nThe official was however silent about the electricity debt owed by the communities, which BEDC earlier said prompted it to suspend service to the area.\nHowever, barely two months after the installation, vandals struck and went away with the armoured cables in the transformers which they later abandoned inside a bush where the community recovered them."
  },
  {
    "headline": "Delta Police Arrests Suspected Internet Fraudsters, Recovery Arms, Ammunitions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command says that two suspected internet fraudsters are currently cooling their feet in police custody following his arrest on the 8/01/2022 .\nABH 911 GW with two male occupants namely Daniel Anikpe “M” age 27Yrs and Chikeluba James Ani “M” age 27Yrs both residing at Ulo line shop off Asaba –Ibusa road.\n“After a painstaking search was conducted on the suspects and the vehicle, one locally made double barrel pistol, three live cartridges, one jack knife, two wraps of substances suspected to be Indian hemp.\n“He also stated that he bought the gun at a cost of twenty-five thousand naira(#25,000).\nInvestigation is ongoing.” The statement said."
  },
  {
    "headline": "Edo community vs abattoir operator: Absence of defendant lawyer stall case in court – Nigerian Observer",
    "summarized_story": "The community also asked for N5 million damages from the defendant for the nuisance she has alleged been and still constituting in the area.\nAt the hearing yesterday, counsel to the defendant pleaded for adjournment on the ground that his principal, Dr. Osagie Obayuwana, was at the Supreme Court, in Abuja and would wanted to personally handle the case.\nHe told the court that Dr. Obayuwana would appear before the court on the next adjourned date.\nHe however urged the court to fine the defense counsel N50,000, so that they would be deligent in the case next time.\nChief Magistrate Prince Mutairu Oarhe, having listern to both counsels argument and counter argument adjourned the case to February 16, 2022 for continuation of hearing."
  },
  {
    "headline": "Obaseki mourns death of former Interim Head of Govt, Ernest Shonekan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI am saddened by the passing of Nigeria’s former Interim Head of National Government, Chief Ernest Shonekan, at the age of 85.\nShonekan was an unassuming leader and a cerebral lawyer, who helped to steady our nation during the turbulent years of Nigeria’s Third Republic.\nAs the founder of the Nigeria Economic Summit Group, his commitment to private and free enterprise remains indelible in the annals of our history.\nIt is heartbreaking that Chief Shonekan will not be available to offer his priceless advice and guidance as we approach another election season.\nHe will be remembered for his fortitude while he was on the saddle as Interim Head of National Government as well as the genuine effort made to guide Nigeria back to democratic rule."
  },
  {
    "headline": "Buhari hails Ahmad Lawan-led 9th N’Assembly as Senate President urges consensus on critical issues",
    "summarized_story": "President Muhammadu Buhari has applauded the current National Assembly and particularly the leadership style of it’s chairman, the Senate President, Ahmad Lawan.\nProfessor Gambari said the President sent him to deliver a congratulatory message and express his admiration about Lawan’s personal achievements.\nSpeaking at the occasion, the Senate President passionately appealed to politicians irrespective of their political affiliations to work towards building consensus on critical national issues.\nYou can’t be President, you can’t be Senator, you can’t be member of House of Representatives, you can’t be Governor, you can’t be anything unless there is a country.\n“Regardless of our political affiliations, in the ninth Senate, we have always approached issues mainly in national interest,” Lawan said."
  },
  {
    "headline": "Buhari visits Ogun, commissions Abiodun’s projects",
    "summarized_story": "Idowu OlakunleNigeria’s president, Muhammad Buhari on Thursday, visited Ogun State where he commissioned some monumental projects constructed by the governor, Prince Dapo Abiodun.\n‘‘This has made Ogun State one of the safest and most peaceful states in the country and investors’ destination of choice,” Buhari said.\n‘‘It is significant to note that the two road projects being commissioned today are federal roads.\nIt depicts that something new is happening in Ogun State, a welcoming entrance into the State Capital at the centre point of the State.’’He added that the project is also iconic, depicting the joining of hands for building the future of Ogun State in togetherness.\nHe said his “Administration in Ogun State has continued to fulfil all its promises to the people within the available means."
  },
  {
    "headline": "Osun 2022: PDP Screens Dele Adeleke, 5 others for Osun Governorship Election",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Peoples Democratic Party (PDP) governorship screening committee for Osun state headed by former Attorney General of the Federation and Minister for Justice, Mohammed Adoke on Wednesday screened all the six governorship aspirants that purchased the nomination forms.\nSix of them turned in for the screening and we screened all of them and we are satisfied with the answers they gave us.\n“We ensured that the process was transparent, we ensured that they were given fair hearing and we ensured that we executed the mandate given to us by the party.\n“In fact the national convention screening committee has been made standing committee for the party.\nAlso, another aspirant, Alhaji Abdulateef Akinbade, expressed optimism that he would not be disqualified following the way the screening committee conducted the exercise."
  },
  {
    "headline": "Emmanuel Difom named Guinness Nigeria’s Finance and Strategy Director",
    "summarized_story": "Adebayo ObajemuGuinness Nigeria has appointed Emmanuel Difom as Finance and Strategy DirectorThe brewery giant has given notice to the investing public that the Board of Directors of the Company at its meeting held on 26th October 2021, gave approval to the appointment of Mr. Emmanuel Difom as the Finance and Strategy Director of the Company with effect from 1 st November 2021.\nMr. Difom has fifteen years of experience at top level.\nHe is a an achiever with strong experience in Business Strategy, Finance, and Tax management supported by a solid background in FMCG, Oil and gas and Banking sectors.\nThe Board of Directors is assured that Mr. Difom brings the right skillset to the Board with his level of experience and understanding of the Diageo landscape.\nIn addition to this, the wide experience of Mr. Difom in British American Tobacco (BAT), his knowledge of the business terrain in Nigeria and his good track record were very high points contributing to the Board’s confidence in his appointment as the Finance and Strategy Director."
  },
  {
    "headline": "Plateau Killings: Retaliatory Attacks Unacceptable, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has expressed sadness about the fresh killings in Bassa local government area of Plateau State, saying circle of violence in the name of retaliation is unacceptable.\nThe President noted that the latest incident in the state was not in keeping with the principles of the peace agreements reached between the Irigwes and the Fulanis in Bassa LGA.\n“My thoughts are with the families of the victims in this time of grief.\nThis is unacceptable,” the President added.\nADVERTISEMENTThe President, however, commended Governor Simon Lalong for the state government’s handling of the incident so far."
  },
  {
    "headline": "EFCC Arrests Fake Army General For Alleged N270m Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested an impostor, Bolarinwa Oluwasegun, who claimed to be a General of the Nigerian Army for alleged N270million fraud.\nEFCC spokesman, Wilson Uwujaren, stated in a statement on Thursday that the suspect was arrested by operatives of the Lagos Zonal Command of the anti-graft agency, at his house in the Alagbado area of Lagos State on Wednesday, January 12, 2022.\nHe said that the suspect posed as an Army General to make false representations to his victim, Kodef Clearing Resources, that President Buhari had shortlisted him as the Chief of Army Staff.\nHe added that Oluwasegun also allegedly forged several documents with the signature of the President Muhammadu Buhari in his bid to defraud the victim.\nUwujaren said that the operatives recovered six pump action guns, three cartridge bullets, a swagger stick and several forged documents from the suspect, who he said would be charged to court as soon as investigations were concluded."
  },
  {
    "headline": "APC Hails Buhari, Nigerians For Resisting Twitter ‘Interference’",
    "summarized_story": "The All Progressives Congress (APC) has applauded President Muhammadu Buhari and Nigerians for what it described as their firm stance against the interference of microblogging site, Twitter Inc, in Nigeria’s internal and national security affairs.\n“We also applaud Twitter for allowing good reason and common interest prevail by agreeing to open their office in Nigeria.\nRussia has VKontakte (VK), China has Weibo, among several homegrown social media platforms.\nNigerians talented in the development of social media/software applications are challenged to develop homegrown applications that can rival existing social media platforms and meet the need of Nigerians.\n“Finally we reiterate our charge to operators of social media pages to use their platforms to check divisive and inciting rhetoric, particularly in Nigeria."
  },
  {
    "headline": "APC Hails Buhari, Nigerians For Resisting Twitter ‘Interference’",
    "summarized_story": "The All Progressives Congress (APC) has applauded President Muhammadu Buhari and Nigerians for what it described as their firm stance against the interference of microblogging site, Twitter Inc, in Nigeria’s internal and national security affairs.\n“We also applaud Twitter for allowing good reason and common interest prevail by agreeing to open their office in Nigeria.\nRussia has VKontakte (VK), China has Weibo, among several homegrown social media platforms.\nNigerians talented in the development of social media/software applications are challenged to develop homegrown applications that can rival existing social media platforms and meet the need of Nigerians.\n“Finally we reiterate our charge to operators of social media pages to use their platforms to check divisive and inciting rhetoric, particularly in Nigeria."
  },
  {
    "headline": "Bayelsa Govt To Organise State Burial For First African Harvard Graduate",
    "summarized_story": "The governor of Bayelsa State, Senator Douye Diri, has said that the state government will organise a state burial for the late Ambassador Baraebibai Ekpebu.\nEkpebu, a former Nigerian Ambassador to Côte d’Ivoire, died at the age of 90 at the Federal Medical Centre, Yenagoa, Bayelsa State capital on January 2, 2021.\nThe deceased, who was the first African to graduate from the prestigious Harvard University in the United States, also attended Princeton University.\nThe governor said the deceased, who was a pioneer executive council member of the old Rivers State when it was created in 1967, would be remembered for his distinguished service to the Ijaw ethnic nationality and the Nigerian state.\n“The late Professor was a founding member of the old Rivers State and started his service in that state."
  },
  {
    "headline": "How ministry, police, NDA, REA, five others spent N49.5bn without NASS approval – Auditor",
    "summarized_story": "The Office of the Auditor General of the Federation has disclosed that nine Ministries, Departments and Agencies of the Federal Government spent about N49.5bn above their approved budgets between 2018 and 2019.\nThe OAuGF made the discrepancy known in its “2019 Annual Report on Non-Compliance, Internal Control, and Weakness Issues in MDAs of the Federal Government of Nigeria for the year ended December 31, 2019”, which was submitted to the National Assembly.\nIt added that the Ministry of Agriculture and Rural Development spent the highest amount with N48.4bn while the Pharmacists Council of Nigeria, Abuja, spent the least amount of N1.68m.\nA closer look at the report showed that the Ministry of Agriculture was also in violation of Paragraph 2906 (ii) of the Financial Regulations which stipulates that“…all procurement plans must be supported by prior budgetary appropriation as proof of availability of funds.\nIn other words, payments that are not provided for in the annual estimates shall not be accepted.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "How ministry, police, NDA, REA, five others spent N49.5bn without NASS approval – Auditor",
    "summarized_story": "The Office of the Auditor General of the Federation has disclosed that nine Ministries, Departments and Agencies of the Federal Government spent about N49.5bn above their approved budgets between 2018 and 2019.\nThe OAuGF made the discrepancy known in its “2019 Annual Report on Non-Compliance, Internal Control, and Weakness Issues in MDAs of the Federal Government of Nigeria for the year ended December 31, 2019”, which was submitted to the National Assembly.\nIt added that the Ministry of Agriculture and Rural Development spent the highest amount with N48.4bn while the Pharmacists Council of Nigeria, Abuja, spent the least amount of N1.68m.\nA closer look at the report showed that the Ministry of Agriculture was also in violation of Paragraph 2906 (ii) of the Financial Regulations which stipulates that“…all procurement plans must be supported by prior budgetary appropriation as proof of availability of funds.\nIn other words, payments that are not provided for in the annual estimates shall not be accepted.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "13 not 37 people killed in Niger attack – Police",
    "summarized_story": "The Niger State Police Command has refuted claims by some news outlets that 37 people were killed in Nakundna and Wurukuchi communities in Shiroro Local Government Area; insisting that 13 people lost their lives when suspected bandits/terrorists attacked some villagers who were harvesting crops.\nThe Public Relations Officer (PRO) of the Niger Police Command Wasiu Abiodun, a Deputy Superintendent of Police (DSP), said: “The Command wishes to state that, on January 10, at about 10 in the morning, suspected bandits/terrorists stormed Nakundna Village near Kaure in Shiroro Local Government Area, and unfortunately, 13 people, who were harvesting in their farms, lost their lives as a result of the attack.\n“However, the police command swiftly deployed tactical teams to the scene led by Area Commander for Shiroro as details of the incident were not immediately available due to the rough terrain and lack of communication network in the area.”The command added that the Commissioner of Police, Niger State Command, CP Monday Bala Kuryas hereby condoles with the families of the victims and reassures Nigerians that the police and other security agencies will not relent in the ongoing onslaught against banditry and other forms of criminalities in the state.\nHe equally advised reporters to avoid rushing to publish stories without adequate verification to avoid causing panic and public outrage.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "13 not 37 people killed in Niger attack – Police",
    "summarized_story": "The Niger State Police Command has refuted claims by some news outlets that 37 people were killed in Nakundna and Wurukuchi communities in Shiroro Local Government Area; insisting that 13 people lost their lives when suspected bandits/terrorists attacked some villagers who were harvesting crops.\nThe Public Relations Officer (PRO) of the Niger Police Command Wasiu Abiodun, a Deputy Superintendent of Police (DSP), said: “The Command wishes to state that, on January 10, at about 10 in the morning, suspected bandits/terrorists stormed Nakundna Village near Kaure in Shiroro Local Government Area, and unfortunately, 13 people, who were harvesting in their farms, lost their lives as a result of the attack.\n“However, the police command swiftly deployed tactical teams to the scene led by Area Commander for Shiroro as details of the incident were not immediately available due to the rough terrain and lack of communication network in the area.”The command added that the Commissioner of Police, Niger State Command, CP Monday Bala Kuryas hereby condoles with the families of the victims and reassures Nigerians that the police and other security agencies will not relent in the ongoing onslaught against banditry and other forms of criminalities in the state.\nHe equally advised reporters to avoid rushing to publish stories without adequate verification to avoid causing panic and public outrage.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Dele Momodu, PDP aspirant endorses Bola Tinubu",
    "summarized_story": "Ovation magazine publisher Dele Momodu has endorsed the presidential aspiration of Asiwaju Bola Ahmed Tinubu.\nLet me put it more frontally, Tinubu will love to drop the Chieftaincy title, Asiwaju, for that of President Bola Ahmed Tinubu.\nAfter the death of General Sani Abacha, Tinubu returned home to contest as Governor of Lagos State and won a convincing victory.\nHe began the systematic and robust increase of the internally generated revenue of Lagos State which his successors have had no choice but to emulate, and sustain incrementally thus making Lagos State one of the richest self-sustaining ‘governments’ in Africa.\nDespite not having access to funding for his local governments, Tinubu single-handedly revived and revamped Local Governments in Lagos State and brought tremendous developments to practically every part of Lagos State."
  },
  {
    "headline": "8 dead, 4 injured in Bauchi auto crash",
    "summarized_story": "By Olaide AyindeThe Sector Commander, Federal Road Safety Corps (FRSC) in Bauchi, Yusuf Abdullahi, has said no fewer than eight persons lost their lives in a second road crash recorded on Thursday in the state.\nAbdullahi confirmed the incident to the News Agency of Nigeria (NAN), on Friday in Bauchi.\nNAN reports that the accident occured barely 11 hours after seven persons lost their lives and two others injured in a ghastly auto crash on Bauchi-Jos Road.\nThe Commander said that the personnel of the Corps cleared the accident scene and attributed the accident to road obstruction and over speeding.\n“Four males sustained serious degrees of injuries."
  },
  {
    "headline": "BREAKING: Boko Haram Kidnaps Mobile Police Officers In Borno",
    "summarized_story": "Boko Haram militants have kidnapped an undisclosed number of mobile police officers from a police mobile training school in the Limankara Gwoza local government area of Borno State, Senator Ali Ndume’s hometown.\nAccording to information obtained by The PUNCH, insurgent fighters attacked the training school with gun trucks at 8:22 p.m. on Thursday, January 13th, and fired sporadically into the air before kidnapping the mobile Police instructors.\nGwoza town is twenty-five kilometers away from the training school.\nIt is a border town between Adamawa State’s Borno and Madagali LGAs.\nThe incident comes seven days after terrorists attempted to penetrate a Nigerian Army base in Gwoza, but were successfully repulsed by Nigerian army soldiers."
  },
  {
    "headline": "IPOB: Nnamdi Kanu Fully Prepared To Appear In Court Next Week — Lawyer",
    "summarized_story": "Mazi Nnamdi Kanu, the leader of the Indigenous People of Biafra, is hopeful of success because he will appear before Justice Binta Nyako of a Federal High Court in Abuja next week, according to his lawyer, Ifeanyi Ejiofor.\nThis was said by Ejiofor in a statement released on Friday morning following his customary visit to Kanu at the Department of State Services Headquarters.\nWe are optimistic that the court outings of Onyendu would be impressive.\nI declare to you, Umuchineke, that Onyendu is fully prepared to appear in court as from January 18 2022.\n“Onyendu expresses his profound gratitude and appreciation to millions of his followers and supporters scattered throughout the face of the earth."
  },
  {
    "headline": "How Nigeria Baptist Convention Paid Bandits N250million To Secure Release Of Abducted Bethel School Students",
    "summarized_story": "The Nigeria Baptist Convention has stated that it spent N250 million to obtain the return of students kidnapped by terrorists in 2021 from Bethel Baptist College in Kaduna.\nAccording to Tribune, the President of the Nigeria Baptist Convention, Rev Dr Israel Akanji, made the announcement in Gombe on Friday at the First Baptist Church in Gombe at the 2022 International General Workers Conference for the North-East.\nHe said, “Initially we didn’t want to spend money, we didn’t believe in spending any money, that was how we began.\nI even said this openly that we will not spend money but I am also saying it openly now that we have had to spend money, we were forced to spend money.\n“Whoever is going to be the next president of Nigeria must be ready to confront the insecurity in our land."
  },
  {
    "headline": "Twitter Yet To Meet Some Conditions Despite Lifting Of Ban In Nigeria",
    "summarized_story": "Twitter Yet To Meet Some Conditions Despite Lifting Of Ban In NigeriaAccording to a source, Twitter has yet to meet some of the conditions stated by the Nigerian government before the ban on the microblogging platform is lifted.\nThe administration of President Muhammadu Buhari declared on Wednesday that the Twitter ban had been lifted.\nTwitter will also train Nigerian IT employees and strategic intelligence officials on how to report government abuse and irregularities.\nDespite the lifting of the restriction, an inquiry by the ICIR revealed that several of the conditions had yet to be completed.\nAs a result of this event, the social networking app may not have met all of the Nigerian government’s requirements before the ban was lifted."
  },
  {
    "headline": "Picture: Police arrest housewife for attempting to sell another’s son",
    "summarized_story": "A housewife identified as Aisha Ibrahim has been arrested by the Zamfara state police command for planning to sell her co-wife’s son in Gusau, the state capital.\nShe was arrested with the two-year-old baby boy who she was planning to sell off at Gusau.\nAisha was among the suspects paraded by Zamfara Police Commissioner, CP Ayuba Elkana, at a press briefing on Thursday.\nShe was paraded alongside the two-year-old boyWhile confessing to the crime, Aisha said the child she wanted to sell is the son of her co-wife.\nShe added that she wanted to sell off the boy in retaliation for alleged theft, and sale of her own son by the co-wife."
  },
  {
    "headline": "Another Nigerian law enforcement agency arrests Obi Cubana",
    "summarized_story": "Business man and night club owner, Obi Iyiegbu, popularly known as Obi Cubana has been questioned by the National Drug Law Enforcement Agency (NDLEA) over suspicious payments into his account by three convicted drug dealers from Nigeria, Malaysia and India.\nThe Economic and Financial Crimes Commission (EFCC) had last year also invited the businessman to answer questions about the sources of his wealth.\nAlready, NDLEA has granted him bail after hours of questioning, and he is expected to return at a later date at their headquarters, Blueprint gathered.\nAlthough, the agency is yet to issue an official statement regarding the latest development as at the time of filling this report."
  },
  {
    "headline": "Breaking: Again, Australia cancels Novak Djokovic’s visa, tennis star faces deportation",
    "summarized_story": "Tennis star Novak Djokovic faces deportation yet again after the Australian government revoked his visa for a second time.\nThe men’s world number one on Monday won a legal battle against Australia’s decision to cancel his visa and deport him.\n“This decision followed orders by the Federal Circuit and Family Court on 10 January 2022, quashing a prior cancellation decision on procedural fairness grounds.\n“In making this decision, I carefully considered information provided to me by the Department of Home Affairs, the Australian Border Force and Mr Djokovic.\n“The Morrison Government is firmly committed to protecting Australia’s borders, particularly in relation to the Covid-19 pandemic.”"
  },
  {
    "headline": "Democracy Has Come To Stay In Nigeria – General Irabor",
    "summarized_story": "The Chief of Defence Staff, General Lucky Irabor, has pledged the loyalty of the military leadership to democratic rule in the country.\nIrabor made the pledge on Friday during an interview on Channels Television’s Sunrise Daily, where he commended the efforts of military personnel ahead of the Armed Forces Remembrance Day.\nSeven weeks later, Sudanese armed forces detained Prime Minister Abdalla Hamdok over his refusal to support their coup on Monday.\nBack in the country, General Irabor admitted that some Nigerians might still be struggling with their experience regarding military involvement in politics in the past.\n“Going forward, I believe that some of these misperceptions that some Nigerians have had with respect to military engagement will begin to change.”"
  },
  {
    "headline": "Nigeria Records 395 Cases Of Circulating Mutant Poliovirus Type 2",
    "summarized_story": "The National Primary Healthcare Development Agency (NPHCDA) has confirmed 395 new cases of Circulating Mutant Poliovirus Type 2 (cMPV2) across 27 states and the Federal Capital Territory (FCT).\nNPHCDA Executive Director, Dr Faisal Shuaib, disclosed this in a statement on Thursday, saying the outbreak was a result of the immunity gaps in children.\nHe attributed this to low routine immunisation coverage and the suspension of several polio campaigns at the heat of the COVID-19 pandemic.\nREAD ALSO: COVID-19: UK’s Johnson Cancels Trip After Lockdown ApologyDr Faisal, however, stated that the circulating mutant Polio-Virus Type 2 recorded in the 27 states and Abuja was different from the wild poliovirus, which the World Health Organisation gave its Polio Free Certification to Nigeria in 2020.\nHe gave the assurance that the NPHCDA would scale up routine immunisation, especially in the affected states in order to curb the spread of the circulating mutant Polio-Virus Type 2."
  },
  {
    "headline": "Ebonyi State Will Never Be Part Of Biafra, Says Dave Umahi",
    "summarized_story": "﻿Governor Dave Umahi of Ebonyi State has said that his state will not take part in the struggle for the actualization of Biafra.\n“First and foremost, I have been saying it, if anybody tells you about Biafra, tell them Ebonyi State will never be part of Biafra.\nHe argued that Igbos have investment everywhere across the country, saying it would be impossible to think of secession when in power.\nAccording to the governor, Ebonyi State is better in a fair and equitable Nigeria because the state has investments everywhere and one cannot set fire to his own house.\n“What we did in Ebonyi State, we can replicate in Nigeria."
  },
  {
    "headline": "Troops Rescue Abducted Polytechnic Students At ‘Abandoned Poultry Farm’",
    "summarized_story": "Three Plateau State Polytechnic students abducted on Wednesday have been rescued unhurt by troops of Operation Safe Haven.\nThe students were kidnapped by gunmen at Barkin Ladi Local Government Area of the state.\nREAD ALSO: FG Lifts Twitter Suspension After Seven MonthsThe search, the military spokesman said, led to the rescue of the abducted students at an abandoned poultry farm.\nThe rescued students have since been reunited with their families while a manhunt is ongoing to apprehend the gunmen behind the kidnapping, the military said.\nChannels Television had earlier reported that the students, two females and one male, were abducted from one of the private hostels known as the ‘Plateau Embassy’ in the polytechnic."
  },
  {
    "headline": "Why Nigerians Should Not Wear Military Camouflage – General Irabor",
    "summarized_story": "﻿The Defence Headquarters (DHQ) has advised Nigerians to shun the use of camouflage for now, although it is not against the law for civilians to wear military gear.\nFor the Chief of Defence Staff, General Lucky Irabor, the present security situation does not allow the use of military gear by people who are not personnel of the DHQ.\nHe gave the clarification on Friday during an interview on Channels Television’s Sunrise Daily, in reaction to a question about the crackdown on the use of military gear by civilians.\n“The criminals among us have had to take advantage of the military, police, and other security agencies’ gear to perpetrate crime,” said General Irabor.\nGeneral Irabor gave an assurance that the DHQ would continue to take appropriate actions to ensure that Nigerians do not see the military in a bad light when they wear its gear."
  },
  {
    "headline": "Updated: Tinubu visits Zamfara, appeals for continued prayer for peace",
    "summarized_story": "The National Leader of the APC, Asiwaju Bola Tinubu has visited Zamfara to commiserate with Governor Bello Matawalle and residents of the State over the incessant killings by bandits.\nOla Awakan reports that the incessant killings by bandits in Zamfara has become a course of worry to Nigerians.\nWithin the first two weeks of January 2022 hundreds of people are reported to have been killed in Zamfara.\nNational leader of the APC, Asiwaju Bola Tinubu was received in the Government house as he condemned the killings by bandits.\nGovernor Bello Matawalle responded by thanking Bola Tinubu for his show of life."
  },
  {
    "headline": "Ezekwesili heads 80-man transition committee in Anambra",
    "summarized_story": "Anambra State government has announced an 80-man transition committee to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\nThis was disclosed a statement issued on Thursday by Joe Anatune, Media Assistant to the Anambra State Governor-Elect, Chukwuma Soludo Secretariat.\nThe members include:1) Mrs Oby Ezekwesili — Chairperson2) Prof. Benedict Okey Oramah3) Rt.\nIfeanyi Okeoma68) Amb Uche Ajulu-Okeke69) Chief Pat Ubajaka70) Prof. Okey Ikeanyibe71) Comrade Charles Onyeagba72) Prof.\nAu Nnonyelu73) Dr. Forster E. Ihejiofor74) Mr. Odera Ozoka75) Mr. ThankGod Ibeh76) Prof. Sylvia Chika Ifemeje77) Mr. Kanayo Nwafor78) Comrade Churchill Okonkwo79) Sir Damian Okolo80) Dr. Chinedu Onyeizugbe"
  },
  {
    "headline": "February APC National Convention requires no consultation",
    "summarized_story": "The Director General Of the Progressives Governors Forum, Salihu Lukman, has said that the February date for the National Convention of the National Convention requires nor consultation.\nMr Lukman said the more the party continue to allow the leadership of the Caretaker Extraordinary Convention Planning Committee to refuse to commence the process of organising the February APC National Convention, the more party leaders would have supported the CECPC in weakening the electoral prospect of the APC.\nPresident Muhammadu Buhari had agreed to February for the party’s national convention, but the body language of the Caretaker Committee suggest otherwise.\nMr Lukman suggest that the APC must not make the mistake of orientating it’s internal party mobilisation for the emergence of candidates for 2023 elections, especially Presidential Candidate only based on personality contest.\nHe appeal to party stakeholder, as the first challenge is to ensure that the CECPC has no option but to organise the APC National Convention in February as decided based on all the consultations that has taken place, and failure to do otherwise will mean going against president Muhammadu Buhari’s order."
  },
  {
    "headline": "Tinubu visits Zamfara, commiserates Gov Matawalle over killings -",
    "summarized_story": "Former Lagos state Governor and National leader of the All Progressive Congress, Asiwaju Bola Ahmed Tinubu has arrived Zamfara State Government House Gusau.\nThe APC National leader is in Gusau to Commiserate With Governor Bello Matawalle and the people of the state over the recent killings in Anka and Bukuyyum Local Government Areas.\nMr. Tinubu and his entourage were recieved by Zamfara State Governor Bello Matawalle and other top government functionariesHe is currently in a closed door meeting with Governor Bello Matawalle."
  },
  {
    "headline": "Supreme Court Halts Covid Vaccine Mandate for US Businesses",
    "summarized_story": "At the same time, the court is allowing the administration to proceed with a vaccine mandate for most health care workers in the U.S.\nWhen crafting the OSHA rule, White House officials always anticipated legal challenges — and privately some harbored doubts that it could withstand them.\nThe mandate covers virtually all health care workers in the country, applying to providers that receive federal Medicare or Medicaid funding.\nDecisions by federal appeals courts in New Orleans and St. Louis had blocked the mandate in about half the states.\nA separate vaccine mandate for federal contractors, on hold after lower courts blocked it, has not been considered by the Supreme Court."
  },
  {
    "headline": "Lockdown Parties in No 10 Downing Held on Eve of Prince Philip’s Funeral",
    "summarized_story": "Downing Street staff held two parties the night before Prince Philip’s funeral – at a time when Covid restrictions banned indoor mixing.\nPrime Minister Boris Johnson was not at either party – but it raises further questions about a culture of rule-breaking at Downing Street.\nBut Mr Johnson has faced particular criticism after it emerged he had attended one on 20 May 2020 during the first lockdown.\nHe told BBC Newsnight he had submitted the letter with a “heavy heart”, believing there was no sign the revelations about parties in Downing Street during lockdown would end soon.\nMr Bridgen, who backed Mr Johnson in the 2019 Conservative leadership contest, said this was “preventing the government from functioning as normal and that’s an untenable position”."
  },
  {
    "headline": "NBA: Giannis Antetokounmpo leads Milwaukee Bucks to Win Over Golden State Warriors",
    "summarized_story": "Giannis Antetokounmpo hit his third triple-double of the season as the Milwaukee Bucks secured a 118-99 win over the Golden State Warriors.\nThe 27-year-old notched 30 points, 12 rebounds and 11 assists to help the champions end a two-game losing streak and secure their second win in six.\nStephen Curry made 12 points, eight rebounds and four assists for the Warriors, with Andrew Wiggins top-scoring for the visitors with 16 points.\nShai Gilgeous-Alexander scored 33 points, 10 rebounds and nine assists to help the Thunder end a five-game losing run.\nJames Harden starred again with 26 points, nine assists and seven rebounds for the Nets, who fell to a sixth defeat in nine games."
  },
  {
    "headline": "Zenith Bank’s Share Price Makes History, Outperforms GTCO on NGX",
    "summarized_story": "For the first time in many years, the stock price of Zenith Bank Plc on the Nigerian Exchange Limited (NGX) has overtaken that of Guaranty Trust Holdings Plc (GTCO).\nAccording to capital market analysts, the stock price of Zenith Bank in the last 10 years has never outpaced GTCO.\nOn the other hand, GTCO depreciated by 2.1 per cent to close yesterday at N25.45, from the N26 the stock market price opened this year.\nThe stock price of GTCO over the years traded higher than GTCO on the bourse.\nThe bank’s share price gained one per cent to close 2021 at N25.15 in 2021."
  },
  {
    "headline": "Nigeria: Dele Momodu Notifies PDP of Presidential Bid, Says Ambition Aimed at Reconciliation",
    "summarized_story": "Publisher of Ovation International Magazine, Bashorun Dele Momodu, on Thursday, notified the leadership of the Peoples Democratic Party (PDP) of his intention to vie for the nation’s top job, saying his decision was aimed at national reconciliation and healing.\nMomodu, while speaking, commended the PDP national chairman for finding time to receive him at a short notice, which he said was evidence of Ayu’s demonstration of his intellectual discipline, simplicity and cosmopolitan worldview.\nHis words: “The time has come for full reconciliation and forgiveness and a closure of our ugly past.\n“In the last few days, there have been widespread speculations about my presidential bid for a second time.\nHe, therefore said, “After due consultations with my family, friends and some stakeholders, I have arrived at the decision to contest the 2023 Presidential election on the platform of our great party, PDP."
  }
]