[
  {
    "headline": "Do you drink and smoke? Read this!",
    "summarized_story": "Lara AdejoroThe World Health Organisation says alcohol is a direct cause of seven ​​forms of cancer.\nAccording to experts, one of the ways alcohol can cause cancer is through DNA damage.\nThe WHO Regional Office for Europe (WHO/Europe) is one of WHO’s six regional offices around the world.\nThe UN body also says the risk of cancer from alcohol consumption increases from the first drink“All types of alcoholic beverages, including beer, wine, and spirits, can cause cancer.\n“To make alcohol less affordable, to ban or restrict alcohol marketing across all types of media, to reduce alcohol availability can support the reduction of alcohol consumption and ultimately of cancers due to alcohol consumption,” it said."
  },
  {
    "headline": "Do you drink and smoke? Read this!",
    "summarized_story": "Lara AdejoroThe World Health Organisation says alcohol is a direct cause of seven ​​forms of cancer.\nAccording to experts, one of the ways alcohol can cause cancer is through DNA damage.\nThe WHO Regional Office for Europe (WHO/Europe) is one of WHO’s six regional offices around the world.\nThe UN body also says the risk of cancer from alcohol consumption increases from the first drink“All types of alcoholic beverages, including beer, wine, and spirits, can cause cancer.\n“To make alcohol less affordable, to ban or restrict alcohol marketing across all types of media, to reduce alcohol availability can support the reduction of alcohol consumption and ultimately of cancers due to alcohol consumption,” it said."
  },
  {
    "headline": "Poor menstrual hygiene, risk factor for reproductive infections, says physician",
    "summarized_story": "Dayo OjerindeA public health physician, Dr. Opeyemi Adeyemi, has urged girls and women to maintain menstrual hygiene, saying menstrual health is the state of physical, mental, and social wellbeing and not merely the absence of disease in relation to the menstrual cycle.\n“Menstrual hygiene is very important because it is a component of reproductive health.\nThere are a lot of NGOs constantly creating awareness, having menstrual health outreaches and providing free menstrual products.\n“Menstrual hygiene education is embedded in sex education.\nI’m an advocate for home-based sex education but I also emphasise the need for an age-appropriate sex education curriculum in schools,” she said."
  },
  {
    "headline": "Poor menstrual hygiene, risk factor for reproductive infections, says physician",
    "summarized_story": "Dayo OjerindeA public health physician, Dr. Opeyemi Adeyemi, has urged girls and women to maintain menstrual hygiene, saying menstrual health is the state of physical, mental, and social wellbeing and not merely the absence of disease in relation to the menstrual cycle.\n“Menstrual hygiene is very important because it is a component of reproductive health.\nThere are a lot of NGOs constantly creating awareness, having menstrual health outreaches and providing free menstrual products.\n“Menstrual hygiene education is embedded in sex education.\nI’m an advocate for home-based sex education but I also emphasise the need for an age-appropriate sex education curriculum in schools,” she said."
  },
  {
    "headline": "Welcome back! – digitalpaper.vanguardngr.com",
    "summarized_story": ""
  },
  {
    "headline": "You have successfully logged out! – digitalpaper.vanguardngr.com",
    "summarized_story": ""
  },
  {
    "headline": "Saraki will heal the nation, says group",
    "summarized_story": "Kindly Share This Story:“Saraki is the best and most qualified politician to heal the nation at this time”, said a statement released by the National Spokesperson of the Saraki Support Group, (SSG), Mr. Ed Malik Abdul.\nHe explained that considering the myriads and multi-faceted challenges facing the nation now, the country needs a compassionate leader with the public service pedigree of the former Senate President, Dr. Bukola Saraki to engender and bring healing to the soul of the nation.\nAccording to the SSG spokesperson, Saraki as Senate president, showed grace under fire and kept his emotions under control and faced the challenges as they came and coming out successful in every assignment.\nThe spokesperson remarked that the Saraki Support Group is mobilizing and starting the enlightenment and political outreach programs early to enable Nigerians know more about the endearing qualities of Right Honourable Bukola Saraki and start gearing up for robust and agenda-driven leadership.\n“We therefore invite all Nigerians to share in this vision of a Saraki presidency to make Nigeria great again”, the Statement concluded."
  },
  {
    "headline": "State of the Nation: NPO asks FG to implement el-Rufai, Oronsaye C’ttees’ reports",
    "summarized_story": "Kindly Share This Story:By Henry OjeluThe Nigerian Press Organisation, NPO has said that full implementation of the Governor el-Rufai and Oronsaye committee reports on restructuring will go a long way in tackling the security challenges in the country.\nThe organisation also appealed to politicians and state actors to minimise their inflammatory rhetoric in order to reduce tension and ease the growing sense of fear among the people.\nIt explains why our country is seemingly overwhelmed by non-state actors engaged in criminality and separatist agitations.\nThat the bill has stayed this long in the National Assembly militates against improved corporate governance in the oil sector.\nWe are aware that borrowing is good so long as such loans are deployed to funding enduring development projects, within the GDP ratio."
  },
  {
    "headline": "Asaba Declaration: Assert your powers to keep Nigerians united, NEF urges Buhari",
    "summarized_story": "Kindly Share This Story:By Luminous JannamikeThe Northern Elders Forum, NEF, yesterday called on President Muhammadu Buhari to assert his constitutional powers to keep all Nigerians united and secured in every part of the country.\n“The South South is squeezed between fear and uncertainty, and its leaders are gambling that they can benefit from further weakening the federal administration and the North if it rides along with the rest of the South.\n“Other political leaders who take advantage of the limitations of the President to light fires should know that they will get burnt in them.\n“The forum restates its readiness to engage any group of Nigerians in exploring productive paths to a better future.\n“The forum once again condoles the nation and families of Lt-Gen I Attahiru and other military officers who died in active duty."
  },
  {
    "headline": "Restructuring will boost Nigeria’s economy, end insecurity – Peter Obi",
    "summarized_story": "A former Governor of Anambra State, Peter Obi has said that restructuring will boost Nigeria’s economy and end insecurity.\nThe former Vice Presidential Candidate of the Peoples Democratic Party in 2019 said with restructuring, governors would look inward to make their states industrious.\n“There’s an urgent need to restructure the country for the economy to grow to the desired level.\n“Rather, it should be seen as a move to build the ailing economy and restore adequate security in the country.\n“Restructuring the country will bring out the comparative advantage of every state, and our natural resources that are lying waste will be fully harnessed to boost the state economy.”"
  },
  {
    "headline": "Gov Ugwuanyi orders immediate reconstruction of burnt police station",
    "summarized_story": "Enugu State Governor, Rt.\nIfeanyi Ugwuanyi, on Tuesday, paid an immediate visit to the police station set ablaze by unknown gunmen in Iwollo, Ezeagu Local Government Area of the State.\nGovernor Ugwuanyi, during the visit expressed sadness over the heinous act, just as he condoled and requested to meet with families of slain policemen.\nThe Enugu State Deputy Governor, Hon.\nMeanwhile, the Commissioner of Police in Enugu State, Mohammed Ndatsu Aliyu, who was also at the scene, has ordered a discreet investigation."
  },
  {
    "headline": "2023: Gov Bello's presidential ambition dead on arrival",
    "summarized_story": "One of the early birds for the 2023 Presidential race is governor of Kogi State, Alhaji Yahaya AlBello.\nKOGITES REACTKogites have continued to react to the presidential ambition of Governor Yahaya Bello of Kogi State.\nGov Bello vs Kogi WorkersDuring Governor Bello’s first tenure between 2016-2019 in Kogi State, he had a strain relationship with Kogi workers.\nStakeholders reactMeanwhile, some political stakeholders in the state have admitted that the presidential ambition of Governor Bello is highly suspicious.\nAlso speaking, The Kogi State Chairman, Conference of Nigeria Political Party, (CNPP), Mohammed Kabir Abdullahi described Bello’s presidential ambition as a phantom project that is dead on arrival."
  },
  {
    "headline": "Biafra Day: Ohanaeze urges ceasefire, unconditional release of detainees",
    "summarized_story": "Ahead of the May 30 Biafra Day celebration, the Ohanaeze Ndigbo Worldwide has called on Biafra agitators to avoid the temptation of engaging in any form of clash with security operatives.\nWhile calling for a six-month ceasefire deal on the side of the agitators and the government, he demanded unconditional release of all detainees.\nCarrot and stick approach remain the best way to make peace with the agitators.\n“All activities of arms struggle, attacks on police formations and INEC offices in southeastern Nigeria must end, most police officers killed in these dreadful assaults are igbos, and it must end quickly.\n“Police and military special operations in the Southeast must respect human rights and put human face to deescalate the chaos and violence in the South East,” Ohanaeze further stated."
  },
  {
    "headline": "Lawmakers advocate more financial commitment to healthcare",
    "summarized_story": "Lawmakers in the health sector say they have begun a review of the country’s health sector with a view to strengthening it with requisite laws following the emergence of the COVID-19 pandemic.\nThe lawmakers made the assertions at the Annual Legislative Summit on Health, which focused on Universal Health Coverage and Health Security.\nThey explained that the National Assembly is amending laws to ensure that the health sector serves the nation as it should.\nHe said the legislators were worried by the weak financial commitment of the government in the health sector, the poor implementation of healthcare laws.\n‘‘The Act that establishes the National Health Insurance Scheme has been amended to afford Nigerians the opportunity to benefit from health insurance."
  },
  {
    "headline": "Kanu hires U.S. firm to lobby for Biafra",
    "summarized_story": "By Chris Njoku, OwerriLeader of the proscribed Indigenous People of Biafra (IPOB) Nnamdi Kanu yesterday said he hired another lobbying group in the United States to facilitate the recognition of Biafra independence.\nHe told our reporter: “Yes, it’s true we hired another lobbying group in the USA to facilitate the coming and recognition of Biafra independence.\n“We engaged them with the wholesome amount of N300 million to lobby for Biafra freedom in America and the whole world.”The one-year deal, he said, will run for 12 months.\nKanu told The Nation that IPOB supporters raised the funds.\nThat is why our leader Mazi Nnamdi Kanu said that nobody can change our resolve towards the fight for Biafra freedom and independence."
  },
  {
    "headline": "Omidiran endorses Aisha Buhari Six-Nation tourney",
    "summarized_story": "Honourable Ayo Omidiran, chairperson of the Nigeria Football Federation Women Football development committee has explained the motive behind the launch of the Aisha Buhari Cup.\nIn September, six nations will feature in the maiden invitational women’s football tournament, including South Africa, Cameroon, Mali, Morocco, Ghana and host country Nigeria in Lagos.\nThe showpiece which has been endorsed by the First Lady Aisha Buhari, wife of President Muhammadu Buhari as one of her programmes aimed at uplifting the girl-child on the continent.\nThe announcement has attracted many questions as some considered the staging of the competition by the Nigeria Football Federation struggling with financial problems as waste of public funds.\n“We shall make our recommendation to the NFF and hopefully, our plans will be implemented,” concluded the proprietor of Omidiran Babes."
  },
  {
    "headline": "2020-2021 season: Simy, Zanusi, Onuachu make Africa best discoveries",
    "summarized_story": "As the 2020-21 season draws to a close, Nigeria’s trio of Simy Nwankwo, Zaidu Sanusi and Paul Onuachu has been listed among ESPN’s top 10 Africa’s breakout stars of the outgoing season.\nAccording to ESPN, the selected players burst onto the scene this term, and this took their careers to new heights during a memorable campaign in the outgoing football season across Europe.\nThe towering front man has been outstanding for relegated Crotone, scoring 20 goals for the league’s second-bottom club to finish joint-fifth in the goal scoring charts.\nADVERTISEMENTLast term, he registered nine goals in 22 games — finding the net approximately once every 170 minutes — but has improved his output dramatically this season.\nHis goals helped Genk to secure Champions League qualification next season."
  },
  {
    "headline": "Gumel gets another term as ANOCA treasurer",
    "summarized_story": "President of the Nigeria Olympic Committee (NOC) Habu Gumel has been re-elected by a clear majority as Association of National Olympic Committees of Africa (ANOCA) treasurer in a head-to-head with Togo’s Akpaki Kodjo Ogouwa, winning 43 to their opponent’s 10.\nAlso, Algeria’s Mustapha Berraf has been re-elected as President of ANOCA after defeating challenger Lydia Nsekera in yesterday’s election at the organisation’s General Assembly in Cairo.\nADVERTISEMENTBerraf, an International Olympic Committee (IOC) member who became President in 2018, will serve a second four-year term.\nSudan’s Ahmed Hashim was re-elected as the general secretary of ANOCA, defeating Seydina Omar Diagne of Senegal by 29 votes to 24.\nKamal Lahlou of Morocco was elected as third vice-president ahead of Negroes Kgosietsile of Botswana and Julien Minavoa of Benin."
  },
  {
    "headline": "#EndSARS: 7 months after Lagos still counting its losses –Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Government has said the actual value of the damage to property in various parastatals aftermath of #EndSARS mayhem were yet to be determined seven months after.\nAyantayo said the state was still counting its losses following the unfortunate EndSARS protest and the attendant destruction of public and private property.\nHe said the state suffered heavy damage to critical public property which nearly brought it to a standstill economically.\nIt is pertinent to mention here that 20 parastatals were affected in varying degrees which include Lekki Concession Company, Motor Vehicle Administration Agency, Lagos State Fire Service, Lagos State Public Works Corporation, Lagos State Material Testing Laboratory, Lagos State Metropolitan Area Transport Authority, Lagos Bus Service Limited, Lagos Television, Lagos Internal Revenue Service, Lagos State Traffic Management Authority,, among others.\nGovernor to come up with total assessment of losses suffered is still working on the total estimate and is yet to submit full report,” Ayantayo said."
  },
  {
    "headline": "Kalu mourns demise of Pharaoh Okadigbo",
    "summarized_story": "Former Abia State Governor and Senate Chief Whip, Dr. Orji Uzor Kalu, has commiserated with the family of former Senate president, the late Chuka Okadigbo, over the demise of their son, Pharaoh Okadigbo.\nAcknowledging the outstanding qualities of the deceased, Kalu prayed to God to comfort the Okadigbo family.\nIn a condolence message, Kalu described the deceased as humble, easy-going and kind-hearted, adding that his demise is painful and shocking.\nHe said, “I was shocked to hear the news of the passing of Mr. Pharaoh Okadigbo.\n“It is with deep sorrow, the family of the late Dr. Chuba Okadigbo announces the death of Pharaoh Okadigbo, a husband, father, son, brother, and nephew."
  },
  {
    "headline": "NNPC, Bonga sign agreement to unlock 2bn barrels in OML 118",
    "summarized_story": "Nigeria stands to reap about $700million benefit as the Nigerian National Petroleum Corporation (NNPC) and Bonga PSC signed agreements to unlock about two billion barrels of oil for the country under the Oil Mining Lease (OML) 118.\nUnder the arrangement, the NNPC and Bonga PSC will be executing five agreements that will deliver about $700million of immediate benefit to Nigeria.\nThe OML 118 with its straddle fields boast of the presence of the five major players in the deepwater space not only in Nigeria but also globally.\nOML 118 is the first major deepwater development in Nigeria in the deepwater Niger Delta 75 kilometres from shore containing the Bonga fields at water depth over 1000m.\nThe objective was that the HoT would translate to fully termed agreements including the Dispute Resolution Agreement and a new PSC Agreement for the OML 118 Contract Area."
  },
  {
    "headline": "Drop arms, embrace agriculture, Emefiele advises youths",
    "summarized_story": "From Uche Usim, AbujaGovernor, Central Bank of Nigeria (CBN), Godwin Emefiele, has urged restive youths across the country to drop their arms and embrace the Anchor Borrowers’ Programme (ABP), an agricultural revolution scheme aimed at solving the unemployment and food insufficiency nightmare.\nEmefiele who made these disclosures at the end of MPC May on Tuesday urged the state governments to repay the $2.1 budget support loan hanging on their necks.\nEmefiele said: “Security challenges and the economy are interconnected.\nI am aware that six of them are coming to the country in the month of July and August.\nOur brothers should drop their arms and embrace the Anchor Borrowers Programme.”“I’m optimistic that before the end of the year, this challenge would have abated”."
  },
  {
    "headline": "Restructuring’ll end insecurity, boost economy –Obi",
    "summarized_story": "From Felix Ikem, NsukkaFormer Governor of Anambra State, Mr. Peter Obi, has said restructuring Nigeria will boost the economy and put an end to the security challenges in the country.\nObi said this in Nsukka, Enugu State, yesterday, while delivering the 4th Adada Lecture titled “Restructuring, security challenges and development,”organised by Association of Nsukka Professors (ANP), held at the University of Nigeria, Nsukka (UNN).\nHe said with restructuring governors of various states would look inward to make their states productive and establish state, local and community police that would end criminality.\nHe wondered why Nigerians are not so comfortable when they hear the word ‘restructuring’ stressing that people should stop misunderstanding restructuring as a plan to divide the country, but rather see it as measure to boost the economy as well as end insecurity in the country.\nChinyeaka Ohaa,chairman of the occasion said that the topic of the occasion could not have come at a better time as the country than now when the country is witnessing serious security challenges."
  },
  {
    "headline": "Buhari Not in Support of Open Grazing, Presidency Clarifies",
    "summarized_story": "Some senior lawyers also faulted Buhari’s opposition to the open grazing ban, alleging ethnic bias.\nShehu said the president viewed open grazing as old-fashioned and was looking forward to a replacement for the medieval practice.\nBut he reiterated that banning open grazing without an alternative is not a good approach to the issue.\nOgbe, in the statement, had said that the decision to ban open grazing was in the best interest of all Nigerians.\nHe said since there was a popular demand for the proscription of open grazing, efforts should be made to immediately establish ranches."
  },
  {
    "headline": "Air Force Raises Committee to Audit Aircraft’s Safety",
    "summarized_story": "• Panel gets June 18 deadline to submit reportKingsley NwezehThe Nigerian Air Force (NAF) yesterday set up a committee to conduct a safety audit of its operational and engineering units.\nThere have also been trending calls on the social media for the air force to ground the remaining two.\nBut the air force has insisted that the planes are in good conditions.\nThe statement reads: “The Chief of the Air Staff (CAS), Air Marshal Oladayo Amao, has constituted a committee of serving and retired senior officers to conduct a safety audit of all Nigerian Air Force (NAF) operational and engineering units.\n“The committee is to, among other terms of reference, analyse safety reports from operational and engineering units, conduct safety evaluation of NAF units and recommend measures to enhance safety of operations in the units."
  },
  {
    "headline": "Drop Your Arms, Embrace Anchor Borrowers’ Programme, Emefiele Tells Bandits",
    "summarized_story": "He also announced that the central bank has been encouraged to increase its COVID-19 Targeted Credit Facility to N400 billion from N300 billion.\nAccording to Emefiele, his appeal to criminals to embrace family is because there is a linkage between security and economic growth.\nI am aware that six of them are coming to the country in the month of July and August.\n“I, therefore, would like to appeal to our brothers, who decide that they want to live in bushes and forests, that they should please, begin to retreat, drop their arms and come and embrace the anchor borrowers’ programme.\n“I am optimistic before the end of the year that the security challenges confronting the country will substantially abate,” he stated."
  },
  {
    "headline": "£4.2m Ibori Loot Returned to Delta, Says Accountant General",
    "summarized_story": "By Adedayo AkinwaleThe Accountant General of the Federation, Mr. Ahmed Idris, has revealed that the £4.2 million loot recovered from a former Governor of Delta State, James Ibori, and his associates, which was recently repatriated from the United Kingdom, has been returned to Delta State.\nMalami’s stance consequently led to calls from the Delta State government and other stakeholders on the federal government to return the recovered loot to the state in line with established precedents whereby such funds were returned to states from which the recovered loot was stolen.\nHe explained that such funds like that of Ibrori which was looted from the treasury of a state were always returned to the state.\nSome recoveries are for State governments – specific state governments.\nSuch recoveries goes specifically to thoseStatess.”When asked where the Ibori loot was paid into, Idris without mincing words, said it was paid to Delta State government."
  },
  {
    "headline": "CBN Retains Interest Rate at 11.5%",
    "summarized_story": "By James EmejoThe Central Bank of Nigeria (CBN), Tuesday resolved to retain Monetary Policy Rate (MPR) otherwise known as interest rate at 11.5 per cent.\nThe CBN Governor, Mr. Godwin Emefiele, after the two-day monthly Monetary Policy Committee meeting, said the committee also resolved to maintain the asymmetric corridor of +100/-700 basis points around the MPR.\nThe apex bank also left the Cash Reserve Ratio at 27.5 per cent and Liquidity Ratio at 30 per cent.\nThe MPR is the rate at which the CBN lends to commercial banks and often determines the cost of borrowing in the economy.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Sowore Remains Our Chairman, AAC Says As It Disclaims Leonard Nzenwa As Speaker At Event",
    "summarized_story": "The African Action Congress (AAC) has urged the public to disregard an information being circulated that Leonard Nzenwa will speak as the chairman of the party at an upcoming webinar.\nIt also reiterated that Mr. Omoyele Sowore remains the National Chairman of the AAC, as ratified in the convention of the party on the 6th October, 2018.\n\"As a political party that engages with the principles of democracy as its guide, Leonard Nzenwa was issued a query letter on the 17th January, 2019 and was suspended pending investigation and his defense (https://aacparty.org/case-against-dr-leonard-ezenwa/).\nThe AAC REITERATES THAT THE SAID INDIVIDUAL, LEONARD NZENWA IS NO LONGER A MEMBER of the AFRICAN ACTION CONGRESS (AAC), let alone an executive at the national level.\n\"COMRADE OMOYELE SOWORE REMAINS THE NATIONAL CHAIRMAN OF THE PARTY, ratified alongside other officers at the first and only Convention which held in Lagos on 6th, October 2018 in line with the provisions of Section 57 of the party’s constitution."
  },
  {
    "headline": "Sowore Remains Our Chairman, AAC Says As It Disclaims Leonard Nzenwa As Speaker At Event",
    "summarized_story": "The African Action Congress (AAC) has urged the public to disregard an information being circulated that Leonard Nzenwa will speak as the chairman of the party at an upcoming webinar.\nIt also reiterated that Mr. Omoyele Sowore remains the National Chairman of the AAC, as ratified in the convention of the party on the 6th October, 2018.\n\"As a political party that engages with the principles of democracy as its guide, Leonard Nzenwa was issued a query letter on the 17th January, 2019 and was suspended pending investigation and his defense (https://aacparty.org/case-against-dr-leonard-ezenwa/).\nThe AAC REITERATES THAT THE SAID INDIVIDUAL, LEONARD NZENWA IS NO LONGER A MEMBER of the AFRICAN ACTION CONGRESS (AAC), let alone an executive at the national level.\n\"COMRADE OMOYELE SOWORE REMAINS THE NATIONAL CHAIRMAN OF THE PARTY, ratified alongside other officers at the first and only Convention which held in Lagos on 6th, October 2018 in line with the provisions of Section 57 of the party’s constitution."
  },
  {
    "headline": "EXCLUSIVE: How Gunmen Killed Mother Of IPOB Lawyer, Okoroafor 3 Months After He Escaped Assassination",
    "summarized_story": "Gunmen believed to be working for political actors have attacked and shot dead Madam Edith Okoroafor, the mother of a top lawyer of the Indigenous People of Biafra, Barrister Richard Okoroafor, in Ekiti State.\nBarrister Chukwuemeka OkoroaforThe IPOB lawyer’s mother was killed last Wednesday.\nWe shall be burying her in her hometown, Ekerawen in Agharho, Delta State, on Saturday,” the lawyer said in the notice.\nSee Also Military How Nigerian Army Attempted To Assassinate Biafran Lawyer, Nnamdi Kanu Cries OutIn the third week of February, there was an assassination attempt on Okoroafor’s life.\nThe IPOB leader, Nnamdi Kanu, had accused the Nigerian Army of attempting to assassinate Okoroafor."
  },
  {
    "headline": "EXCLUSIVE: How Gunmen Killed Mother Of IPOB Lawyer, Okoroafor 3 Months After He Escaped Assassination",
    "summarized_story": "Gunmen believed to be working for political actors have attacked and shot dead Madam Edith Okoroafor, the mother of a top lawyer of the Indigenous People of Biafra, Barrister Richard Okoroafor, in Ekiti State.\nBarrister Chukwuemeka OkoroaforThe IPOB lawyer’s mother was killed last Wednesday.\nWe shall be burying her in her hometown, Ekerawen in Agharho, Delta State, on Saturday,” the lawyer said in the notice.\nSee Also Military How Nigerian Army Attempted To Assassinate Biafran Lawyer, Nnamdi Kanu Cries OutIn the third week of February, there was an assassination attempt on Okoroafor’s life.\nThe IPOB leader, Nnamdi Kanu, had accused the Nigerian Army of attempting to assassinate Okoroafor."
  },
  {
    "headline": "Internet Fraudster Kills Twin Brother, Found Seated Beside His Decomposing Body",
    "summarized_story": "A suspected internet fraudster, popularly called Yahoo boy, has allegedly killed his twin brother at Oleh, headquarters of Isoko South Local Government Area, Delta State.\nThe suspect, it was gathered, was found with a dog and the decomposing body of the deceased in their apartment at Old Olomoro Road, Monday, after neighbours perceived a offensive smell emanating from the flat.\nThe door was forced open and they found him sitting close to the decomposing body of his twin brother.\nA dog was also found in the house,” a source told Vanguard.\nWhen they broke into the house, they saw the decomposing body and the twin brother.”"
  },
  {
    "headline": "Emefiele: We're expecting 12 fighter jets to help us solve insecurity",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), says the country is expecting 12 fighter jets.\nAdvertisementThis, he said, will help solve the insecurity in the country.\nEmefiele, while speaking on Tuesday at a monetary policy committee meeting in Abuja, expressed concern over the negative effects of insecurity on the economy.\nAccording to Emefiele, the fighter jets will help address the rising security challenges in the country.\n“About three years ago, the federal government and the United States signed a pact that resulted in a government-to-government acquisition of military equipment, out of which, we are expecting 12 fighter planes that would help us solve our insecurity."
  },
  {
    "headline": "Emefiele: We're expecting 12 fighter jets to help us solve insecurity",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), says the country is expecting 12 fighter jets.\nAdvertisementThis, he said, will help solve the insecurity in the country.\nEmefiele, while speaking on Tuesday at a monetary policy committee meeting in Abuja, expressed concern over the negative effects of insecurity on the economy.\nAccording to Emefiele, the fighter jets will help address the rising security challenges in the country.\n“About three years ago, the federal government and the United States signed a pact that resulted in a government-to-government acquisition of military equipment, out of which, we are expecting 12 fighter planes that would help us solve our insecurity."
  },
  {
    "headline": "Open grazing: Southern governors building ethnic monsters, say northern elders",
    "summarized_story": "The Northern Elders’ Forum (NEF) has accused southern governors of building “ethnic monsters” in a bid to whip up sentiments in the country.\nAdvertisementTwo weeks ago, governors of the 17 southern states had met in Asaba, Delta state capital, to discuss the state of the nation.\nAfter the meeting, the governors called on President Muhammadu Buhari to be fairer in political appointments, convene a national dialogue, embrace the calls for restructuring, and ban open grazing.\nBut their resolutions were criticised by some leaders from the north, including Senate President Ahmad Lawan and Yahaya Bello, governor of Kogi state.\nAdvertisementIn a statement on Tuesday, Hakeem Baba-Ahmed, spokesperson of NEF, said the resolutions by the southern governors is an attempt to split the north and subject its people to humiliation and attacks."
  },
  {
    "headline": "Open grazing: Southern governors building ethnic monsters, say northern elders",
    "summarized_story": "The Northern Elders’ Forum (NEF) has accused southern governors of building “ethnic monsters” in a bid to whip up sentiments in the country.\nAdvertisementTwo weeks ago, governors of the 17 southern states had met in Asaba, Delta state capital, to discuss the state of the nation.\nAfter the meeting, the governors called on President Muhammadu Buhari to be fairer in political appointments, convene a national dialogue, embrace the calls for restructuring, and ban open grazing.\nBut their resolutions were criticised by some leaders from the north, including Senate President Ahmad Lawan and Yahaya Bello, governor of Kogi state.\nAdvertisementIn a statement on Tuesday, Hakeem Baba-Ahmed, spokesperson of NEF, said the resolutions by the southern governors is an attempt to split the north and subject its people to humiliation and attacks."
  },
  {
    "headline": "NAF sets up committee to conduct safety audit -- days after Kaduna crash",
    "summarized_story": "The Nigerian Air Force (NAF) has set up a committee to conduct safety audit on its operational and engineering units.\nThe committee is chaired by Abraham Adole, deputy theatre commander, operation Hadin Kai (formerly known as Lafiya Dole) — a military operation aimed at defeating Boko Haram.\nAdvertisementThe NAF spokesman added that the committee will submit its report on or before June 18, 2021.\n“The committee is to, among other terms of reference, analyse safety reports from operational and engineering units, conduct safety evaluation of NAF units, and recommend measures to enhance safety of operations in the units,” the statement reads.\nAttahiru and 10 other military officers lost their lives while on the Beechcraft 350, a military aircraft belonging to NAF."
  },
  {
    "headline": "Jo’Burg, Marrakesh, Lagos: Which African cities have the highest internet speeds?",
    "summarized_story": "In a world of online gaming, Zoom meetings and video-on-demand streaming, internet speed is everything.\nSouth Africa leads mobile, Ghana fixed broadbandUsers can test internet speed using a number of options.\nFor this, we’ll focus on mobile internet speeds and latency – a measure of how responsive an internet connection is.\nAs such, we are limited in how certain we are of the cities with the top internet speeds in Africa.\nHowever, the numbers show a wide gap between internet speeds in Africa and the rest of the world."
  },
  {
    "headline": "Ethiopia awards its first private telecoms licence to Vodafone consortium",
    "summarized_story": "Ethiopia has awarded one out of the two private telco licences it intends to award to a consortium that includes the Vodafone group.\nThe consortium, which made a winning bid of $850 million, comprises Vodafone, Nairobi-based Safaricom Ltd, CDC Group Plc and Sumitomo Corp.\nEtisalat, Orange Telecoms, MTN and Saudi Telecom Company were some of the companies that registered interest.\nIn the end, only two companies put bids forward; the Vodafone consortium and MTN.\nRegardless, MTN also made a bid of $600 million which was considered not good enough, and now the second telecoms licence will now be retendered for new offers."
  },
  {
    "headline": "Successful product managers are walking encyclopedias.",
    "summarized_story": "Successful product managers need to learn a little bit about each of them because we do a lot of directing in our work.\nShould aspiring product managers expect to manage diverse teams?\nHow then do successful product managers navigate team management?\nI asked her what other skills she believes aspiring product managers need to be excellent in their roles?\nSuccessful product managers must own the product and visualize the bigger picture at all times."
  },
  {
    "headline": "Samsung A12 Vs Infinix HOT 10T: Which Is A Better Buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inches.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "New FirstBank Website Puts YOU, the customer, First!",
    "summarized_story": "With this design, the FirstBank website reformats to fit the screen of whatever device the visitor is using to view it and allows users the flexibility to conduct business wherever they may be.\nOn its new website, FirstBank puts an obvious button to online banking in top navigation so visitors know exactly where to go.\nSeparate Product Pages with Strong Calls-to-ActionThe FirstBank website has unique secondary pages for every product, and clear calls-to-action for people to be able to navigate to those pages.\nWith the new FirstBank website, customers are at an edge in the industry as they establish a relationship with the Bank that puts YOU, its customers, First.\nYou can visit the new FirstBank website here."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "[SPONSORED] Techuncode reviews Samsung A12 vs Infinix HOT 10T: Which is a better buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inch.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "[SPONSORED] Techuncode reviews Samsung A12 vs Infinix HOT 10T: Which is a better buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inch.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "Egyptian agritech startup, Mozare3, raises over $1 million pre-seed to grow its network of farmers",
    "summarized_story": "Egyptian agritech startup, Mozare3, has raised over $1 million in a pre-seed round.\nThe startup also plans to develop the first digital community for Egyptian farmers and offer them agronomy support through its professional network.\nThe agritech startup assists farmers sell their crops by working with institutional buyers like frozen vegetable processors, large retailers, and wholesalers.\nAccording to MENabytes, Abou Bakr said they currently have offtake agreements with 100 farmers and three large institutional buyers.\nAdvertisementThe Egyptian agritech startup plans to introduce credit solutions to fund purchases of different products like motorbikes for the farmers and their families."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Nigeria officially moves towards overdue single exchange rate",
    "summarized_story": "The Central Bank of Nigeria (CBN) took a major step towards full exchange rate unification Tuesday after uploading the more market-reflective NAFEX rate of N410.25 per US dollar on its website.\nA full unification entails closing the gap between the now sole official rate and the parallel market rate.\nAnalysts expect the CBN to now…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "CBN holds interest rate over fragile economic recovery",
    "summarized_story": "Faced with a double dilemma of an inflation uptick and weak growth, the Central Bank of Nigeria (CBN) on Tuesday kept benchmark rates unchanged as it continues to weigh out its previous policy measures to spur growth and rein in rising commodity prices.\nNigeria’s inflation rate marginally retreated for the first time in 19 months…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Shell’s $10bn Bonga project to proceed in N320bn boost to govt revenue",
    "summarized_story": "Shell’s $10bn Bonga project to proceed in N320bn boost to govt revenueThe long-delayed $10billion Shell Bonga South West project is likely to commence soon as partners resolve a lingering dispute over terms and ink a deal that will restart the project.\nThis development could create jobs, boost Nigeria’s revenue, and prompt other operators whose projects have also been suspended due to contract disputes with the Nigerian…"
  },
  {
    "headline": "EIRS Hails IUO On Tax Compliance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOKADA(OVIA NORTHEAST) – Edo State Internal Revenue Service (EIRS), yesterday appreciated Igbinedion University, Okada (IUO) for being tax compliant.\nResponding to the raised tax issues on behalf of the Vice Chancellor, IUO, Professor Lawrence Ikechukwu Ezemonye, Dr. Nosa Edogiawerie (Bursar) appreciated the delegation and encouraged its continuance for ease of tax administration in the state.\nHe affirmed that non payment of tax would dent the image of the hospital and possibly attract a riot act from government.\nAn expatriate and Director of Administration, Igbinedion University Teaching Hospital, Michael Strauss, stated that taxes must be deducted to be responsible employees to government which depends on revenue to succeed.\nHe stated that if taxes are not paid to government one could get punished (nailed) as applicable in advanced countries hence appreciated government for it’s resilience at tax collection."
  },
  {
    "headline": "Ambrose Alli Varsity: Visitation Panel indicts ousted mgt of 1.7bn fraud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…N133m lease obtained for motor vehicle procurementBENIN CITY – The Ambrose Alli University, Ekpoma, Special Visitation Panel has indicted the ousted management of the institution for “indiscriminate procurement of loans/overdraft” to the tune of N1,794,069,811.02 within the period under review.\nThe panel, which was constituted by Governor Godwin Obaseki in the wake of the agitation by staff unions in the school and other stakeholders in the university community, was tasked to investigate operations of the university in terms of revenue generation, transparency, accountability, adherence to due process, mode of employment and promotions and sustainability.\nThe panel, set up in October, 2020, was chaired by Prof. Ikponmwosa Omoruyi, a Professor of Law at the University of Benin.\nProf. Lawrence Atsegbua, who is a member of the panel, is also a Professor of Law at the University of Benin and a Senior Advocate of Nigeria (SAN).\nOthers on the panel are Mrs. M. E. Ohiowele, Roland Ogbebor, Dr. J. O. Okovido and Venerable Osaze Egbenusi, as members, with Mrs. P. E. Aziegbemhin, as Secretary."
  },
  {
    "headline": "CLEEN Foundation Trains Law Enforcement Agencies On Anti-Human Trafficking / Forced Migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A Non-Governmental Organization (NGO), CLEEN Foundation has called for concerted efforts among law enforcement agencies in Edo State against the menace of human trafficking and forced migration.\nBenson Olugbuo, Executive Director of the foundation, who made the call at a two-day capacity building workshop for law enforcement agencies in Edo State, noted that a united front would contribute significantly to solving the problem.\nOlugbuo said law enforcement agencies can play a critical role in the fight against the menace through intelligence gathering, prosecution of traffickers within the ambit of the law, protection of victims and others as stipulated by various operational legal frameworks.\nAccording to him, the role of the law enforcement agencies cannot be downplayed if we are ever going to make significant strides in our effort to overcome this enigma.\nHe, therefore, urged the participants to be more resolute in fighting human trafficking and forced migration in the state and to provide necessary support for victims."
  },
  {
    "headline": "Intimidating Profile And Destruction Of Aregbesola’s 64th Birthday Billboard – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestNon progressive in Osun State are being intimidated by Aregbesola’s rising profile.\nA billboard erected by the Caretaker Secretary of the All Progressives Congress (APC) in the State of Osun, Hon.\nThe billboard was erected at the famous Old Garage area, Osogbo, The billboard was erected at the famous Old Garage area, Osogbo, the state capital.\nThis was a direct attack on Aregbesola and his rising profile in Osun State.\nInwalomhe Donald writes fro Osogbo, Osun State..."
  },
  {
    "headline": "APC charges Delta governor on £4.2m Ibori loot",
    "summarized_story": "ADVERTISEMENTThe All Progressives Congress (APC) in Delta State has called on Governor Ifeanyi Okowa to make judicious use of the £4.2 million recovered from former governor James Ibori, for the good of the people of the state.\n“For the sake of our dear state, we call on the State Governor, Ifeanyi Okowa, not to allow this economic lifeline (monies) to go the way of the past.\nHe urged the governor to be transparent in handling the recovered money and other monies accruing to the state.\n“As a matter of fact, we urge the governor to tie this money to specific projects in the state.\nThe Accountant General of the Federation, Ahmed Idris, said on Tuesday that the £4.2 million recovered from Mr Ibori has been paid to the Delta State government."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "How police officer detonated grenade in Ebonyi State",
    "summarized_story": "The Ebonyi State police command has explained that an explosion which happened in the Afikpo area of the state was caused by a grenade detonated by a police officer, Idi Aminu.\nIn a statement, its Police Public Relations Officer (PPRO), DSP Loveth Odah, the Ebonyi police command, explained that the police officer mistakenly hit the device which killed him.\nShe stressed that there was no bomb explosion in Ebonyi state contrary to initial speculations.\n“My attention has been drawn to a news making the round in some section of the media that there was an explosion of a suicide bomb in Afikpo, Ebonyi State this afternoon.\nA similar incident equally occurred in front of the Ebonyi State Old Government House as some mobile police officers were servicing their APC machine."
  },
  {
    "headline": "CBN’s MPC retains Monetary Policy Rate at 11.5%",
    "summarized_story": "OBINNA EZUGWUThe Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) on Tuesday, voted unanimously to retain Monetary Policy Rate (MPR) at 11.5 percent.\nThe committee also retained Cash Reserve Ratio (CRR) at 27.5 percent, and Liquidity Ratio at 30 percentIt equally maintained Asymmetric Window of +100 and -700 basis points around the MPR.\nMore later…"
  },
  {
    "headline": "Police kill two gunmen in Imo, recover arms",
    "summarized_story": "The Imo State Police Command says it killed two gunmen during a gun duel that lasted for hours in the Ohaji/ Egbema axis of the state on Tuesday.\nHe said the bandits were suspected to be part of the gang that attacked the Owerri Correctional Centre and the state Police command headquarters in Owerri, on April 5.\n“Imo Police Command neutralised hoodlums that masterminded the attack on the Command Headquarters and Correctional Centre in April, 2021.Recovered AK 47 Rifle with a cache of live ammunition,” he said.\n”One Ak47 Rifle with breach number 11654 and a cache of live ammunition were recovered.\nAlso recovered are a number of expanded ammunition, matchets and criminal charms tied around the waist of the suspects."
  },
  {
    "headline": "Just in: £4.2m Ibori loot paid to Delta State govt – Accountant General",
    "summarized_story": "The Accountant General of the Federation, Mr. Ahmed Idris has said the £4.2m ‘looted’ by ex-governor of the state, James Ibori, has since been transmitted to Delta state government.\nMr. Idris made the disclosure before the House of Representatives Ad hoc Committee on “Assessment and Status of all Recovered Loots Movable and Immovable Assets from 2002-2020 by agencies of the Federal Government of Nigeria for Effective Efficient Management and Utilization”.\nHe was responding to posers from the legislators on the difference between the Federation and Consolidated Revenue Fund Accounts of the Federation, and the desegregation of Recovered Assets and funds, according to Vanguard.\nRecall that the Federal Government had recently announced that the government of United Kingdom had returned £4.2m said to have been looted by Ibori and his associates while he was in office as governor."
  },
  {
    "headline": "An Sha Son Yin Lalata Da Ni A Kannywood – Nafisat Macen Sirri",
    "summarized_story": "NAFISAT SALISU da aka fi sani da SARAUNIYA cikin shirin MACEN SIRRI ta bayyana yadda ta sha haduwa da ‘yan fim da suka nuna sha’awar lalata da ita a Kannywood a ganawarta da LEADERSHIP A YAU ta hannun MUHAMMAD LAWAN RANO, Kano:LEADERSHIP A YAU: Mene ne cikakken sunanki?\nNAFISA SALISU: uhmm (dariya) gaskiya na ci karo da masu nuna sha’awar lalata da ni.\nNAFISA SALISU: A’a ba ni da aure kuma ban taɓa yi ba amma ina da niyyar yi Insha Allahu.\nNAFISA SALISU: Ina aikin gyaran gashi da kuma yin dinki daman kuma shi na gada daga gurin mahaifiyata.\nBai taba nuna sha’awar lalata da nib a, ya dauke ni kamar ‘yar uwarsa ya taimake ni ya kai ni inda ban yi zato ba a rayuwa, na san mutane da dama saboda shi."
  },
  {
    "headline": "Kwana 100 Na Shugabancin Kumbotso: Ko Kwalliya Ta Biya Kudin Sabulu?",
    "summarized_story": ""
  },
  {
    "headline": "Dubban Mutane Za Su Amfana Da Shirin Kiwon Lafiya Kyauta A Zariya",
    "summarized_story": "Aikin da tawagar kwararun likitocin Afirka karkashin jagorancin Honarabul Dajta Joseph Haruna Kigbu (Likitan Talakawa) ke gabatarwa.\nDa yake jawabi a wajen tsaron, Honarabul Datti Muhammad Babawo ya ce, wannan shirin kiwon lafiya shine karo na hudu da yake gayyato wannan tawagar kwararun likitoci.\nYa kara da cewa, duk abinda kake yi dole ka tuna da al’ummarka da suka zabe ka.\nKigbu ya kara da cewa, za a gudanar da bincike kan cututtukar da suka hada da cutar Tarin fuka da kanjamau da Ido da sauransu.\nZa a kuma yi yi tiyata a fannoni daban-daban ga masu lalura."
  },
  {
    "headline": "An kaddamar Da Shirin Rage Zaman Kashe Wando Ga Matasan Sokoto",
    "summarized_story": "Share on TelegramShare on TwitterShare on FacebookDaga Zubairu M. LawalAn samu kwakkwarar hadin giwa tsakanin Gwamnatin Jihar Sokoto da Majalisar dinkin Duniya da kungiyoyi masu zaman kansu domin samar da aikin dogaro da kai da tsaro mai muhimmanci a fadin Jihar Sokoto.\nTun a shakarar da ta gabatane ake ta kokarin samar da wannan hanyar ta hadin gwiwa, wanda zata kawar da ayyuka ta’addanci a jihar baki daya.\nGwamnatin sakoto ta shirya tare da ma’aikatan tsaro da hadin gwiwar hukumar kula da kananan yara ta Majalisar dinkin Duniya ‘UNICEF’, kuma an samu bayanai masu muhimmanci ta hanyoyin da za a samar da tsaro.\nYa kuma nuna goyon bayan da kungiyar UNICEF da kuma kungiyar habakan bada gudummawar kudi.\nWannan kudirori zai taimaka wajen zartar da wannan aiki da kuma da tabbatar da mutane zasu cigaba da rayuwa cikin salama."
  },
  {
    "headline": "Sarkin Karaye Na Binciken Dagacin butu-butu Bisa Sayar Wa Bakin Fulani Gona",
    "summarized_story": ""
  },
  {
    "headline": "Reps query handling of $23m, N2.725 billion by AGF, NNPC —",
    "summarized_story": "The lawmakers particularly asked the NNPC to furnish it with details of the revenue it calls ‘Advance Consideration’ which amounts to N2.725 billion in the 2018 and 2019 accounts of the corporation.\nAccording to the documents submitted to the committee which is investigating revenue remittances, NNPC received advanced consideration of N820.511 million from customers in 2018 and N1.904 billion in 2019.\nDeputy Chairman of the Committee, Saidu Abdullahi expressed worry over the manner NNPC subsidiaries were operating in the country in terms of revenue remittances.\nAlso, the Securities and Exchange Commission (SEC) is considering todownsize its workforce to cut cost in the face of dwindling revenue.\nAgain in May 2020, we succeeded in recovering $311, 797, 866.11 from the Island of Jersey and indeed the UK."
  },
  {
    "headline": "OML 118: NNPC, SNEPCo, others sign multibillion dollar deep-water...",
    "summarized_story": "The five agreements signed include, Dispute Settlement Agreement, Settlement Agreement, Historical Gas Agreement, Escrow Agreement and Renewed PSC Agreement.\nAccording to him, this is an indication of “a renewed confidence between NNPC and her partners; between the Government and the investing communities which include NNPC.\n“Ultimately, these agreements will engender growth in our country where investment will come in for other assets, not just in the deep-water, but even for new investors.\nIt is an opportunity for them to see that this country is ready for business,” the GMD enthused.\n“Today, we have signed agreements that define the future of deep-water for Nigeria."
  },
  {
    "headline": "On 2nd anniversary, Sanwo-Olu gets kudos for unveiling of iconic projects",
    "summarized_story": "Having been able to weather the storm, the All Progressives Congress in Lagos has applauded and celebrated Sanwo-Olu.\n“The Lagos State government under Governor Babajide Sanwo-Olu has become the reference point for good, focused, impactful, inclusive, responsible, responsive, innovative and humane governance.” He said.\nHe added: “We are indeed convinced that Lagos State is in safe hands.\nHe also noted: “The state government embarked on the massive construction and rehabilitation of roads and fulfilled its commitment to complete inherited projects.\nIt will be rescaled that the governor has unveiled iconic projects to commemorate his second anniversary in office which began from Tuesday, April 27."
  },
  {
    "headline": "Compel Shell to clean up N’Delta oil spills now, CSOs tell Federal Govt —",
    "summarized_story": "By Doosuur IwambeCivil society organisations (CSOs) in Nigeria have asked the federal government to compel Shell to clean up the massive pollution its extractive activities have created in the Niger Delta.\nThe CSOs cautioned that Shell’s plan to move offshore is only targeted at evading the scrutiny that its onshore activities have attracted.\nFour farmers had sued the company for oil spills that they said caused widespread pollution of the land.\n“We never expected less from a company that has ridden roughshod on the environment and people of the Niger Delta while raking in blood profits.\nThe era of impunity is over.”The organisations urged communities to explore legal tools such as the liability roadmap launched in 2020, to hold Shell accountable."
  },
  {
    "headline": "$23m withdrawal: Trouble looms as reps query AGF, Ahmed Idris",
    "summarized_story": "Members of the House of Representatives on Tuesday queried the Accountant General of the Federation, Ahmed Idris, over the borrowings from the assets recovery account by government agencies.\nSpecific reference was made to the sum of $23 million from the account, which is yet to be refunded.\nHe said unless the Accountant General could provide evidence of the refund, it would be considered that such withdrawals were made illegally.\n“What we are trying to draw attention to is that money is being borrowed out from the recovery account and not being refunded.\nUnless you are able to prove to us that it was refunded, we consider that to mean that payments have been made illegally,” Adeogun said."
  },
  {
    "headline": "$23m withdrawal: Trouble looms as reps query AGF, Ahmed Idris",
    "summarized_story": "Members of the House of Representatives on Tuesday queried the Accountant General of the Federation, Ahmed Idris, over the borrowings from the assets recovery account by government agencies.\nSpecific reference was made to the sum of $23 million from the account, which is yet to be refunded.\nHe said unless the Accountant General could provide evidence of the refund, it would be considered that such withdrawals were made illegally.\n“What we are trying to draw attention to is that money is being borrowed out from the recovery account and not being refunded.\nUnless you are able to prove to us that it was refunded, we consider that to mean that payments have been made illegally,” Adeogun said."
  },
  {
    "headline": "Marwa to politicians, students: You must undergo drug test",
    "summarized_story": "The Chairman of the National Drug Law Enforcement Agency, Brigadier General Buba Marwa (retd.\n), has emphasised on the need for politicians seeking public offices and students seeking admission into higher institutions to undergo drug integrity tests.\nThe statement titled ‘Why politicians, students, must undergo drug test – Marwa’ was made public by the NDLEA Director of Publicity and Media, Femi Babalola, where the Chairman pointed out that politicians in the forthcoming elections should undergo drug tests.\n“He said same thing applies to students who are seeking admission into higher institutions.\n“He said because of the evidence-based strong nexus between drug abuse and security challenges across the country, concerted efforts must be made towards tackling the drug scourge headlong."
  },
  {
    "headline": "Marwa to politicians, students: You must undergo drug test",
    "summarized_story": "The Chairman of the National Drug Law Enforcement Agency, Brigadier General Buba Marwa (retd.\n), has emphasised on the need for politicians seeking public offices and students seeking admission into higher institutions to undergo drug integrity tests.\nThe statement titled ‘Why politicians, students, must undergo drug test – Marwa’ was made public by the NDLEA Director of Publicity and Media, Femi Babalola, where the Chairman pointed out that politicians in the forthcoming elections should undergo drug tests.\n“He said same thing applies to students who are seeking admission into higher institutions.\n“He said because of the evidence-based strong nexus between drug abuse and security challenges across the country, concerted efforts must be made towards tackling the drug scourge headlong."
  },
  {
    "headline": "Abidemi Rufai: New charge emerges, surety Nekpen in trouble",
    "summarized_story": "The news platform said an appeal has been filed before a western district judge in Washington state.\nRufai was to be released to the home of a family friend Nekpen Soyemi, a nurse with an address on Long Island.\nHe would also be forbidden from leaving the Eastern District of New York — or eventually, the Western District of Washington.\nThe appeal noted that Rufai has no clear ties to the Western District of Washington, and has just one family member living in the United States.\nMarshals Service transport him to the Western District of Washington, and then he can have another bail release hearing here,” Langlie said."
  },
  {
    "headline": "Asahi Shimbun calls for Tokyo Olympics cancellation",
    "summarized_story": "Agency ReportOne of Japan’s leading newspapers Asahi Shimbun called for Tokyo Olympic Games to be cancelled in an editorial on Wednesday.\nAsahi is an official partner of the Tokyo 2020 Olympics,It cited risks to public safety and strains on the medical system from the COVID-19 pandemic.\nPoll after poll has shown the majority of the public is opposed to holding the Games this summer.\nThat Asahi, one of Japan’s most prestigious newspapers, broke ranks with other partners is likely to intensify focus on the viability of the Games.\nThe United States on Monday issued an advisory against travel to Japan, but Japanese officials said it would not affect the Games."
  },
  {
    "headline": "Mali coup plotters carry out second coup, Goita seizes power",
    "summarized_story": "By Abankula with agency reportsMali’s interim vice president Colonel Assimi Goita said on Tuesday he had seized power as a fresh coup within an older coup unravelled in the country.\nGoita was one of the coup plotters that toppled the elected government of Ibrahim Boubacar Keita last August.\nHe said he took over power because President Bah Ndaw and Prime Minister Moctar Ouane failed to consult him about a cabinet reshuffle, which dropped two former coup leaders.\nFrench President Emmanuel Macron condemned what he said was a “coup within a coup” and raised the threat of targeted sanctions.\nLast month a military council seized power in Chad after the battlefield death of president Idriss Deby."
  },
  {
    "headline": "BREAKING: Suicide Bomber Strikes Near Primary School In Ebonyi",
    "summarized_story": "According to Vanguard, a suspected suicide bomber detonated explosives in Ebonyi on Tuesday.\nAccording to witnesses in the area, the attack happened around 12:00 p.m. near a primary school in Afikpo community, Afikpo North Local Government Area.\n“He attempted to enter Amaizu/ Amangballa Primary School, but was turned away by school security since he could not justify his presence.\n“He quickly began rushing inside an adjacent bush before a loud bang was heard,” a witness told Vanguard.\nThe incident comes as Nigerian troops hunt down suspected IPOB members in Ebonyi and other parts of the country’s south-east, where separatist agitations have grown in recent weeks."
  },
  {
    "headline": "BREAKING: Recovered £4.2m Ibori Loot Returned To Delta — Accountant-General",
    "summarized_story": "The £4.2 million looted by a former Governor of Delta State, James Ibori, which the Federal Government recently repatriated from the United Kingdom, has been restored to the state, according to the Accountant General of the Federation, Mr. Ahmed Idris.\nIdris revealed this in Abuja on Tuesday when he testified before the House of Representatives’ Ad hoc Committee on Assessment and Status of All Recovered Loots Movable and Immovable Assets by Agencies of the Federal Government of Nigeria for Effective Efficient Management and Utilisation from 2002 to 2020.\nThe Accountant-General, who was interrogated for nearly an hour by the committee, maintained that funds plundered from a state’s treasury are always restored to the state.\nStates can sue the federal government to recoup such payments, he added.\nMore details later…"
  },
  {
    "headline": "BREAKING: Cholera Outbreak Kills 20 People In Bauchi",
    "summarized_story": "In Bauchi State, a new cholera outbreak has killed at least 20 people in different regions of the state.\nAccording to reports, 322 people have been affected with the sickness.\nDuring a press conference on Tuesday morning, the State Commissioner for Health, Dr Aliyu Mohammed Maigoro, provided an update on the situation.\nSince the first case was reported in April, he said, the disease has spread to nine local government regions.\nThe index instance, according to the Commissioner, was a 37-year-old patient admitted to Burra General Hospital on April 24, 2021."
  },
  {
    "headline": "OPEN GRAZING: We’ll no longer tolerate attacks on herders, NEF warns",
    "summarized_story": "The Northern Elders Forum (NEF) has lamented alleged killing and attacks on northerners living in the south and other parts of the country.\nThe forum said many state governors were to blame for allowing attacks on helpless herders in their states, even as it said it was open to dialogue in ending insecurity in Nigeria.\n“Attacks on lawful Fulani and other Northerners in the South must stop and those who have killed them must be brought to book.\nOther political leaders, who take advantage of the limitations of the President to light fires, should know that they will get burnt in them.\nThe forum restates its readiness to engage any group of Nigerians in exploring productive paths to a better future."
  },
  {
    "headline": "PDP, APC bicker over attacks on INEC facilities",
    "summarized_story": "The Peoples Democratic Party (PDP) Tuesday accused the All Progressives Congress (APC) of being behind the burning of offices of the Independent National Electoral Commission (INEC) in various parts of the country.\nPDP National Publicity Secretary Kola Ologbondiyan made the position known in a statement issued in Abuja.\nThis is also as the APC administration has failed to take decisive steps to protect INEC facilities from assailants.\n“Our party calls on the Inspector General of Police to immediately invite and question APC leaders over the burning of INEC offices.\nAPC respondsAnd in a swift response, the governing APC said the opposition PDP was behind the consistent attacks on the INEC facilities."
  },
  {
    "headline": "Breaking – OML 118: FG to rake in $780m in revenues as NNPC, SNEPCo, others sign multi-billion dollar deep-water agreement",
    "summarized_story": "The five agreements signed include, Dispute Settlement Agreement, Settlement Agreement, Historical Gas Agreement, Escrow Agreement and Renewed PSC Agreement.\nAccording to him, this is an indication of “a renewed confidence between NNPC and her partners; between the Government and the investing communities which include NNPC.\n“Ultimately, these agreements will engender growth in our country where investment will come in for other assets, not just in the deep-water, but even for new investors.\nIt is an opportunity for them to see that this country is ready for business,” the GMD enthused.\n“Today, we have signed agreements that define the future of deep-water for Nigeria."
  },
  {
    "headline": "Electronic giant bags Red Dot award for excellence in product design -NigPilot",
    "summarized_story": "Electronic giant, LG has bagged the Red Dot award for its strength in consumer product design and quality for most of its products across the globe.\n“Among the most meaningful is the honor bestowed upon LG designer appliances in the Materials and Surfaces category for their implementation of color, material, and finish CMF.\n“Introduced as a bold reimagining of conventional appliances, LG’s designer appliance is a melding of technologically advanced home appliances with premium materials that can be customized to meet the specifications of each customer.\nOther honors include recognition for LG WashTower™, a single-unit, vertical laundry solution that frees up more floor space while handling ultra-large loads, for exceptional design.\nThe Red Dot Design Award is one of the three most prestigious professional design competitions in the world and the distinctive mark has become established internationally as one of the most sought-after seals of quality for exceptional design.."
  },
  {
    "headline": "Environmental: LG to partner key stakeholders on improved planet -NigPilot",
    "summarized_story": "President, LG Electronics, Middle East & Africa Region, Mr. IL Hwan Lee has expressed the readiness to partner with key organizations with shared goals across the globe to promote an improved environment.\nAccording to him, LG’s pledge is to support stakeholders’ growth and independence through partnership.\nThe Achievement of the United Nations Sustainable Development Goals (SDGs) by 2030 is a Grand Challenge, especially for businesses.\n“As a responsible global corporate citizen, LG Electronics is set to contributing to the achievement of the SDGs as the main goal of its social contribution activities.\nSome of such that promote eco-friendly society include LG DUAL Inverter, LG NeON 2, LG WashTower and the CordZero M9 robot vacuum cleaner."
  },
  {
    "headline": "ARAN commends FG over efforts to recover stolen artifacts -NigPilot",
    "summarized_story": "Artifacts Rescuers Association of Nigeria , (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral.\nObalosa reiterated committment of his associations’ readiness to continue working with the Federal Government and all security agents in the country, assuring that all Nigeria’s treasures will be returned."
  },
  {
    "headline": "Film producers drums support for APGA aspirant -NigPilot",
    "summarized_story": "The Chairman Board of Trustees (BOT), Association of Music, Film Producers and Marketers of Nigeria, (AMFPMN) , Mayor Uzoma Ubaoha said that Dr. Okwudili Christopher Ezenwankwo is the only credible aspirant among other aspirants within the All Progressive Grand Alliance (APGA).\nHe however cautioned All progressive Grand Alliance (APGA) not to make a serious mistake in giving the ticket to any other person instead of Dr. Okwudili Christopher Ezenwankwo.\nIt is not being done to give any body who is not a home based and never laboured for the party ticket to sell the party over-night.\nDr. Ezenwankwo has led the entire Anambra Markets and did marvelously well.\nWe in the music industry wants him, traders needs him because he consolidated all Anambra Markets and mingled with the common people,” he said."
  },
  {
    "headline": "Ibori’s £4.2m Loot Returned To Delta State Govt – Accountant-General",
    "summarized_story": "The Accountant General of the Federation, Ahmed Idris on Tuesday said the £4.2m looted by ex-Delta State Governor, James Ibori, has been returned to the state.\nAccording to him, any recovery arising from looted funds from a particular state would go directly to the states.\n“It was paid to Delta State,” he said when asked where the money was diverted to.\nHonourable Chairman, any recovery arising from the looted funds from a particular state goes to the state.\nThe state governors will not even allow this to fly.”READ ALSO: FG Expects £4.2m Ibori Loot From UK Govt SoonHe added, “Some recoveries are for some state governments, specific state governments."
  },
  {
    "headline": "FG’s Insistence On Open Grazing Points To A Hidden Agenda – Benue Govt",
    "summarized_story": "Benue State Governor, Samuel Ortom on Tuesday said the Federal Government’s insistence on open grazing suggests it has a hidden agenda.\nThe Presidency had on Monday faulted the recent resolutions of the Southern Governors, including the ban on open grazing in the entire southern part of the country.\nThe Southern Governors, the Benue leader added, adopted ranching as the alternative method of rearing animals.\nHe added, “As it stands, the Presidency is the lone hand pushing for the continuation of open grazing and the return of cattle routes of 1950s and 60s.\nBesides, the international best practice of animal husbandry is ranching; and that’s the stand of Benue State.”"
  },
  {
    "headline": "CBN Retains Monetary Policy Rates At 11.5%",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) has again voted to retain the monetary policy rate at 11.5 percent.\nThe announcement was made by the CBN governor, Godwin Emefiele during a press briefing at the CBN headquarters on Tuesday.\nHe explained that the move is expected to allow further economic growth, after the country exited recession in the fourth quarter of 2020, amid rising inflation.\nThe MPC also noted that at least 70% of Nigeria’s population must be vaccinated if the country means to achieve economic recovery.\nResponding to questions on the CBN ban on cryptocurrency transactions in Nigerian banks, the CBN governor insisted that the encrypted nature of cryptocurrency transactions makes it hard for fraud to be investigated and criminals apprehended."
  },
  {
    "headline": "Gunmen Kill Four Police Officers, Burn Down Station In Enugu",
    "summarized_story": "Gunmen on Tuesday attacked Iwollo Oghe Police Station in Ezeagu Local Government Area of Enugu State, killing four officers.\nThe officers died of gunshot wounds sustained in a gun duel while trying to repel the attack.\nAn investigation has been launched into the attack to fish out the assailants and their cohorts.\nEarlier in April, two officers were killed in an attack on a police station in Adani, Uzo-Uwani Local Government Area of Enugu State, raising concerns over incessant assaults on security formations in the largely peaceful South-East region.\nTo curtail these attacks, the Inspector-General of Police (IGP), Usman Baba last week launched a special operation designed to restore peace to the South-East."
  },
  {
    "headline": "Army To Hold Passing Out Parade For Recruits One Week After Attahiru’s Death",
    "summarized_story": "The Passing Out Parade (POP) of the 80 Regular Recruit Intakes (RRI) has been postponed to May 29 following the death of the Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru.\nAttahiru, alongside 10 other senior military personnel died last week Friday in a plane crash in Kaduna State.\nAudu Arigu, Assistant Director, Army Public Relations, Nigerian Army Depot, announced the postponement via a statement on Tuesday.\nThe ceremony was originally scheduled for May 22 with the late Army chief supposed to serve as Reviewing Officer and Special Guest of Honour.\nHe said the event was the climax of the recruits’ intensive training, adding that the ceremony showcases the height of military discipline and regimentation."
  },
  {
    "headline": "Ebonyi State Government denies suicide bomber explosion, says incident was an accident",
    "summarized_story": "Ebonyi State Government has denied that there was a Suicide Bomber explosion in the state.\nThe Ebonyi State Government, Southern, Nigeria has flayed the reports that a particular suicide bomber had detonated explosives attached to his body in the state.\nHe said “My attention has been drawn to a news making the round in some section of the media that there was an explosion of a suicide bomb in Afikpo, Ebonyi State this afternoon.\n“A similar incident equally occurred in front of the Ebonyi State Old Government House as some mobile police officers were servicing their APC machine.\n“Furthermore, Ebonyians and residents of Ebonyi State are reminded that generating and spreading of fake news aimed at causing panic in the state is actionable."
  },
  {
    "headline": "Bandits Kill Ten In Five Zamfara Communities Unspecified number of Persons Abducted -",
    "summarized_story": "Bandits have killed ten persons and several others were abducted in five Zamfara communitiesThe Communities are Dandamji, Gidan Runji, Doka, Yanmadanga and Yarkatsina all in Bungudu local government area of the stateThe bandits invaded the communities Monday evening on motorcycles with sophisticated weaponsUnspecified number of persons were abducted and livestock were also taken awayThe spokesperson of the Zamfara State Police Command Shehu Mohammed Confirmed the incident to TVC NEWSAdvertisementHe says troops are on the trial of the criminals to ensure the safe return of the abducted persons."
  },
  {
    "headline": "Nigeria: Southern Governors’ Ban on Open Grazing ‘Show of Power’, Garba Shehu Insists",
    "summarized_story": "The Nigerian Presidency is insisting that the ban by the country’s Southern Governors on open Grazing is a show of power as they proffered no alternatives or solutions.\nGarba Shehu, a senior special assistant on media to President Muhammadu Buhari stated this on Tuesday when he appeared on ARISE News.\nAccording to the presidential aide, the objectives of both the southern governors and the president in terms of putting an end to open grazing are the same.\nHe noted that while President Buhari wants to see ranching, he wants it done in an organised manner.\nHe however called on the governors who have kicked against the alternative to open grazing provided by the President to respect the office of the Nigerian President."
  },
  {
    "headline": "Nigeria Needs to Localise Police to Keep Up with Armed Non-state Actors: Tanwa Ashiru",
    "summarized_story": "Tanwa Ashiru, a security and intelligence analyst, and a US Air Force veteran who worked in the Department of Defense and the US National Security Agency spoke to ARISE News on Nigeria’s security challenges and possible solutions.\nThese include the framework for a national dialogue, the import of ISWAP and Boko Haram joining forces, and localising police to help subdue armed non-state actors.\nWatch this insightful video for more."
  },
  {
    "headline": "Education Key to Unlocking the Potential in Africa’s Music Industry: Godwin Tom",
    "summarized_story": "Godwin Tom is an African entertainment industry change agent constantly driving innovations in management within the music and entertainment industry.\nFounder of Music Business Academy for Africa and CEO iManage Africa Entertainment Limited,he hascover 18 years as a talent manager and business executive and has practical experience at management level in marketing, public relations, image consulting, branding, and publishing.\nOver the years, he has successfully worked with or managed talents such as Wizkid, Davido, Waje, MI, Wande Coal, Bez, Ice Prince, Show Dem Camp, to mention a few.\nBringing professionalism to the entertainment industry with an understanding of the demands of a business environment, he is now introducing The Music Business Academy for Africa 2021, a platform dedicated to training and developing an informed and empowered workforce for Africa’s entertainment industry.\nHe speaks with Seyitan Atigarin in this interview."
  },
  {
    "headline": "Nigeria: Repatriated £4.2m Ibori Loot ‘Returned to Delta State’",
    "summarized_story": "Nigeria’s Accountant-General, Ahmed Idris says the recently repatriated £4.2 million loot recovered from a former governor of Delta State, James Ibori and his associates has been returned to the state government.\nThe Accountant General of the Federation told members of the ad hoc committee of the House of Representatives that the money was returned to the state to avoid litigation against the federal government.\nSome recoveries are for state governments, and when they come, we will send them to the state governments, including the Ibori loot.\n“The recovery of the Ibori loot was paid to Delta state.\nThe states will not allow their monies to be taken; they will take us to court, and we don’t joke with that.”By Abel Ejikeme"
  },
  {
    "headline": "Nigeria: Gunmen Kill Four Police Officers in Southeastern Enugu",
    "summarized_story": "Gunmen in the early hours of Tuesday attacked the Iwollo Police Division in Ezeagu Local Government Area of Enugu State and razed the station.\nThe Commissioner of Police in Enugu State, Mr Mohammed Aliyu, who confirmed the attack in a statement said he was already on ground to ascertain the level of destruction and casualties.\nThe eyewitness said that the attack threw the entire Iwollo community into fear and panic throughout the night.\nRecall that on April 21, unknown gunmen shot two police operatives dead during an attack on Adani Police Station in Uzo-Uwani Local Government Area of Enugu State.\nThe station was also set ablaze completely at about 2:30 am."
  }
]