[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Enugu fans express dismay over Super Falcon 2-1 loss to S/Africa",
    "summarized_story": "Some football enthusiasts in Enugu, on Monday expressed dismay over the Super Falcons of Nigeria’s 2-1 loss to Banyana Banyana of South Africa at the ongoing African Women Cup of Nations (WAFCON) in Morocco.\nOkechukwu Nnamani said the players showed weakness in strength and needed to be replaced with vibrant and energetic players.\nThe Chief Executive Officer of Enugu Coal City Girls, advised female football administrators in the country to look into the players welfare and growth of the nation’s female league.\n“I know that we can do better than this with the home base players with well organised league.\n“Before, we use to hammer teams 5-0 but these days, those teams are now thrashing us and this shows that we are going down in female football,” he said."
  },
  {
    "headline": "Enugu fans express dismay over Super Falcon 2-1 loss to S/Africa",
    "summarized_story": "Some football enthusiasts in Enugu, on Monday expressed dismay over the Super Falcons of Nigeria’s 2-1 loss to Banyana Banyana of South Africa at the ongoing African Women Cup of Nations (WAFCON) in Morocco.\nOkechukwu Nnamani said the players showed weakness in strength and needed to be replaced with vibrant and energetic players.\nThe Chief Executive Officer of Enugu Coal City Girls, advised female football administrators in the country to look into the players welfare and growth of the nation’s female league.\n“I know that we can do better than this with the home base players with well organised league.\n“Before, we use to hammer teams 5-0 but these days, those teams are now thrashing us and this shows that we are going down in female football,” he said."
  },
  {
    "headline": "Lagos closes Redeemers School over death of boy, 5 year old",
    "summarized_story": "…Says school is unapprovedBy Olasunkanmi AkoniFollowing the mysterious death of Chidera Eze, a five year-old boy, Lagos State Government, on Monday, sealed off the premises of Redeemers Nursery and Primary School, Ogba, Ikeja.\nAccording to information, the school is owned by Redeemed Christian Church of God (RCCG), Dominion Sanctuary, Acme Road, Ikeja.\nAccording to Adefisayo, the investigations would also ascertain how the Redeemers had conducted its operations in accordance with the schools’ safety standards and guidelines set for education institutions across Lagos.\nWhile grieving over death, Eze also, accused the school management of cover-up attempt.\nHow I received the sad news, father narrates“I dropped my children: Chidera Andre Eze and his younger brother, at their school, Redeemers Nursery and Primary School Dominion Sanctuary ACME Road, Ọgba, Ikeja."
  },
  {
    "headline": "2023: Fresh trouble for APC as group files perjury case against Tinubu",
    "summarized_story": "The suit, marked FHC/ABJ/CS/1058/2022, was brought before the court by the Incorporated Trustees of Center for Reform and Public Advocacy, a Civil Society Organization, CSO.\nCited as Respondents in the suit are the IGP and the Nigerian Police Force, NPF.\nThe CSO, told the court that it earlier forwarded a petition to Police authorities, demanding further action on the said investigative report.\nIt said the Respondents have also “not notified the Applicant of any action taken on the said letter”.\n“On the strength of the above, we demand that you initiate the criminal proceedings of Senator Bola Ahmed Tinubu consequent upon the express findings of the Lagos State House of Assembly as captured above”, it further stated."
  },
  {
    "headline": "10 days after defecting to YPP, Abia gov replaces Obingwa council boss with deputy",
    "summarized_story": "By Steve OkoTen days after defecting from the ruling Peoples Democratic Party, PDP, to Young Progressives Party, YPP, the Chairman of Obingwa Local Government Area of Abia State, Hon.\nThe two-year tenure of the replaced Chairman, Nwoke will be due in December 2022.\nSpeaking after swearing in the new Council Chairman, Ikpeazu who just returned from a vacation in Turkey with Gov.\nIkpeazu accused the replaced Council boss of breaching the provisions of Section 23, Sub-section 1(f) of the Abia State local Government Law No.\nIn a swift response, the replaced Council boss expressed surprise at his purported replacement, dismissing it as illegality."
  },
  {
    "headline": "Interpol confirms arrest of suspected Nigerian cybercriminal in South Africa",
    "summarized_story": "A 28-year-old Nigerian has been arrested in relation to a cybercrime ring involved in phishing, internet, romance scams and money laundering.\nThe suspect, identified as James Junior Aliyu was arrested at an upmarket estate in Sandton, Johannesburg, after a takedown operation.\nMembers from the Interpol National Crime Bureau (NCB) in Pretoria with assistance from members of the SAPS Gauteng Highway Patrol Unit raided the upmarket estate at 10:00 on Wednesday, 29 June 2022, where they effected the arrest.\nHis arrest follows a widespread investigation involving law enforcement authorities from South Africa (SA) and the United States of America (USA).\nIt was reported that Authorities in the USA, where the investigation originated have applied for his extradition."
  },
  {
    "headline": "Gunmen kill security man, set filling station ablaze in Ondo",
    "summarized_story": "Tension heightened on Monday in Igoba community in Akure North Local Government Area of Ondo State following the killing of a security guard identified as ‘Mr Sunday’ by gunmen.\nThe unidentified attackers who also set the station ablaze shot and killed the security guard who was manning the Titolu Venture filling station in the community.\nThe manager of the station, Ajisafe Oluwatobiloba, said while attempting to determine what started the fire, they came upon the body of the security guard.\n“I was called by one of the residents, and when we arrived, we noticed the station blazing.\n“We called the fire department, and they came to put out the fire without realizing the culprits had slain our security guard,” he claimed."
  },
  {
    "headline": "July 4 parade: 30 shot, 6 dead in US",
    "summarized_story": "The July Fourth parade in the Chicago suburb of Highland Park ended on a fatal note on Monday.\nSix people, among the 30, shot at about 10:14 am, have been confirmed dead.\nRotering told a news conference that instead of celebrating freedom, the people are now mourning the tragic loss of life and struggling with the terror.\n“Our hearts go out to the families of the victims at this devastating time”, Rotering added.\nPritzker said there are no words for a “monster who lies in wait and fires into a crowd of families with children celebrating a holiday”."
  },
  {
    "headline": "Church holds special prayer session to counter bandits in Taraba, Nigeria",
    "summarized_story": "The Christian Association of Nigeria (CAN) in Taraba State has organised a prayer session against bandits in the state.\nLeading the congregation at the prayer organised by the Teckan/Eckwa block of CAN, Rev.\n”The church is out to provoke the Holy Spirit to rise against those perpetrating crime in the Nigerian society and doing all within their powers to ensure disunity among Nigerians”.\nsaying such an idea if allowed to see the light of day would spell doom for the Nigerian nation.\nThey believe it has become necessary to seek God’s intervention to have a free, fair and credible general poll come next year."
  },
  {
    "headline": "FG raises concern over prevalence of Fistula, slams quack doctors",
    "summarized_story": "The Federal Government has reiterated its resolve to check the increase in incidents of vesicovaginal fistula among Nigerian women and proffer ways to alleviate the pains of sufferers.\nHe frowned at the activities of quack doctors leading to the surge of the Fistula crisis in the country.\n“So this is far devastating to women and girls because you can imagine smelling urine and stool.\n“What we aim to do is to work together with all our partners to ensure zero tolerance to Fistula in Nigeria.\n“We know the doctors would have done a good job, they’ve corrected the fistula case but the woman would have to go back into the society, the society that has rejected her."
  },
  {
    "headline": "Shittu, Yusuf, Oyedepo, others shortlisted for SAN rank The Nation Newspaper",
    "summarized_story": "Frontline prosecutors of the Economic and Financial Crimes Commission (EFCC) Wahab Shittu, Rotimi Oyedepo and Chief Fassy Yusuf are among the 129 lawyers nominated for the award of Senior Advocated of Nigeria (SAN) by the Legal Practitioners’ Privileges Committee (LPPC).\nThis was contained in a notice signed by the Chief Registrar of the Supreme Court/Secretary of the LPPC, Hajo Sarki Bello.\nA total of 73 lawyers were nominated in the advocates category while 56 were in academic category.\nThe notice said the applicants were graded on the basis of an LPPC integrity system, under paragraph 12 (2) and 20 of the LPPC guidelines 2018.\nThe LPPC asked the public to vet the qualifications of the candidates, and send their comments and complaints not later than 4pm on July 18."
  },
  {
    "headline": "RPC regulates lawyer's conduct, not law firm, court rules The Nation Newspaper",
    "summarized_story": "The National Industrial Court of Nigeria, Port Harcourt Division has held that the Rules of Professional Conduct for Legal Practitioners in Nigeria (RPC) 2007, regulates individual lawyer’s conduct, not the law firm.\nHe anchored his objection on Rule 8 of the RPC, which restricts appearance of lawyers in salaried employment and company directors on behalf of their employer/company.\nHe further submitted that since the Directors are the same persons running the law firm, “whatever taints them by the RPC applies to their law firm, including whoever they would appoint to represent them in court for the company where they are paid Directors”.\nAnd as such, the lawyers who filed the defence processes and appeared in court from the law firm should not be prevented from carrying out their legal practice in the law firm.\nIn his ruling, Justice Ogbuanya, while agreeing that both partners of the law firm could not appear in court or frank court processes, rather held that the act of the law firm’s partners being salaried directors would not prevent the other lawyers in their law firm from plying their trade and representing the Defendant company in court."
  },
  {
    "headline": "DPP drops defilement charge against ex-school driver The Nation Newspaper",
    "summarized_story": "The Lagos State Directorate of Public Prosecutions (DPP) has dropped a charge of defilement filed against a former driver of Beehive Nursery and Primary School, Agidingbi in Ikeja, Lagos, Kingsley Okwumbu.\nThe DPP dropped the charge, which was before Magistrate Ejiro Kubeinje of an Ikeja Magistrates’ Court, due to insufficient evidence.\nThere was never a time when the bus driver was alone with any of the pupils in the bus.\nIt was noted that the child’s mother suspected defilement when the child would cry whenever she washed her private parts.\nMagistrate Kubeinje had on April 19 remanded Okwumbu at the Kirikiri Correctional Centre after directing the police to send the case file to the Lagos DPP for legal advice."
  },
  {
    "headline": "NBA election: presidential debate holds Thursday The Nation Newspaper",
    "summarized_story": "ECNBA chairman Richard Ayodele Akintunde, SAN, and Secretary Mabel Ekeke disclosed this in a statement obtained by The Nation yesterday.\nThe positions being contested for, according to the ECNBA, include President, 1st Vice-President, 2nd Vice-President, 3rd Vice-President, General Secretary, Assistant General Secretary, Treasurer, Welfare Secretary, Publicity Secretary, Ass.\nPublicity Secretary and General Council of the Bar.\nFor General Secretary, those to face the voters are Adegbite Adesina, Asenoguan Osamuede, Ogiegbaen Callistus and Yamah Desmond, while Aka Oluwaseun, Balogun Dhikrullah, Kip Daniel and Oseme Peremene are to slug it out for the Assistant General Secretary post.\nThe Publicity Secretary position will see Emoghwanre Ogaga and Lawal Akorede battle each other at the poll; while the Assistant Publicity Secretary post will be contested for by Ajiboye Charles and Nwoye Akachukwu."
  },
  {
    "headline": "Wike’s camp gives ‘Ayu must go’ condition to back Atiku The Nation Newspaper",
    "summarized_story": "The camp of Rivers State Governor Nyesom Wike is seeking the immediate resignation of National Chairman Iyorchia Ayu as a condition for peace.\nIt follows overtures to the aggrieved governor by presidential candidate Atiku Abubakar.\nHowever, the presidential candidate insisted that the chairman should remain in office to lead his campaign for next year’s election after which he will quit.\nThey maintained that Atiku should honour his promise that once the PDP presidential candidate emerges from the North, a Southerner will lead the party.\n“It was agreed that once a presidential candidate comes from the North, the National Chairman of the party, Dr. Iyorchia Ayu, will step down."
  },
  {
    "headline": "VP slot: Islamic cleric, MBF, Afenifere, others reject Muslim-Muslim ticket",
    "summarized_story": "Kaduna-based Islamic cleric, Sheik Haliru Maraya, said it was wrong for any Muslim to support a Muslim-Muslim ticket.\nThe cleric, in a statement, yesterday, said those promoting the Muslim-Muslim ticket do not wish the country well.\n“The journey will still be rough for Muslim-Muslim ticket but it is a lesser risk for the party.\n“There is a huge difference between when a Northern Muslim runs a Southern Muslim presidential ticket, and when a Southern Muslim runs a Northern Muslim presidential ticket.\nKeeping in mind that the Vice President is selected and not elected, a Muslim- Muslim ticket, or a South-South ticket will represent a clear demonstration of insensitivity and political recklessness,” he said."
  },
  {
    "headline": "Amotekun’ll confront bandits in forest –Akeredolu",
    "summarized_story": "By Christopher Oji, Sunday Ani and Chukwudi NwejeOndo State Governor, Oluwarotimi Akeredolu (SAN), has said that members of the South West security outfit, Amotekun, would no longer wait for herdsmen and bandits terrorising the state to attack the people, but take the battle to them in the forest.\nSpeaking during the Politics Today programme on Channels Television, yesterday, Akeredolu decried a situation where criminals are left to acquire illegal weapons, while Nigerians are disposed of their legally acquired weapons.\nThe governor also charged the people of Ondo State to, henceforth, confront the criminals when they attack them, instead of running into their homes.\nHow we are going to confront the criminals is not what we shall discuss in public, but how we are going to do it is nobody’s business,” he said.\nHow do we determine those behind the attack when herdsmen, bandits and terrorists are all in the bushes."
  },
  {
    "headline": "Sultan, CAN, Methodist bishop, others move to douse religious, ethnic tension",
    "summarized_story": "By Chukwudi NwejeAhead of the 2023 general election, eminent religious and civic leaders from across Nigeria have joined their voices to condemn the growing issues of injustice and inequitable representation in government.\nThe religious leaders, including Sultan of Sokoto, Muhammadu Sa’ad Abubakar, President, Christian Association of Nigeria (CAN), Samson Ayokunle, and President and founder, Vision Africa, Sunday Onuoha, made their views known in a joint statement entitled: ‘Declaration for a Peaceful and Secure Nigeria’, issued after an International Religious Freedom Summit in Washington, D.C., at the weekend.\nTherefore, the essential freedom and dignity of every person must be respected and protected.\n“We recognise and respect the various traditions and faith communities present in Nigeria, and will promote their collaboration to advance the well-being of all and to resolve conflicts peacefully,” they said.\n“We will engage in constructive, respectful dialogue, always seeking pathways to cooperative action that promote the common good for the people and country of Nigeria."
  },
  {
    "headline": "FG unviels criteria for 2022 FGCs admission",
    "summarized_story": "From Fred Ezeh, AbujaFederal Government has reconfirmed that it would strictly abide by the established criteria for admission into 110 Federal Government Colleges (FGCs) otherwise known as Unity Schools.\nIt said 60 per cent of the admission would be based on national merit, 30 per cent would be on equality of states while 10 per cent will be on exigency.\nA statement from Federal Ministry of Education indicated that the Minister of Education, Mallam Adamu Adamu, disclosed the information at the meeting of the Principals of the110 Unity Colleges in Benin, which marks the commencement of the admission process into Unity Colleges.\nAdamu who was represented by Hajia Binta Abdulkadir, director, Senior Secondary Education in the Ministry, directed that the admission process must be guided by the principles of fairness, equity and good conscience.\nHe emphasised that candidates who applied for admission from outside of their immediate communities should be given priority in the admission process."
  },
  {
    "headline": "Soludo winning war against hoodlums, gunmen in Anambra –APGA",
    "summarized_story": "Chinedu Obigwe, yesterday, declared that Anambra State Governor, Chukwuma Soludo, has successfully waged a justified ‘war’ against hoodlums masquerading as unknown gunmen in the State.\nThe governor had appealed to all armed groups terrorising Anambra State to surrender their weapons, come out of the bush and change from their evil ways, but they refused to heed his wise counsel.\n“Governor Soludo gave ndi Anambra the assurance that the Egyptians they see today, they shall see no more.\n“The war against them is not stopping anytime soon because governor Soludo vowed to ensure that nobody among them would be spared.\n“The mission of Governor Soludo is to turn Anambra to a liveable and prosperous homeland and nothing will stop him from actualising this mission,” he said."
  },
  {
    "headline": "Runsewe Vindicated as Knocks Trail Clerics Praying at Bobrisky’s Housewarming – THISDAYLIVE",
    "summarized_story": "Even so, not everybody has been brave enough, like that African President, to speak out against the rising tide of this behaviour.\nBut the Director-General of the National Council for Arts and Culture (NCAC), Segun Runsewe, is leading the conversation.\nIn the beginning, Bobrisky received knocks because he claimed that he bought the house for N400 million.\nDuring the ceremony, however, Bobrisky was not the main attraction, rather the Islamic clerics who attended the housewarming ceremony took the spotlight.\nThe clerics were not at Bobrisky’s party to renounce his cross-dressing lifestyle."
  },
  {
    "headline": "Finance Minister Heads NELMCO Governing Board – THISDAYLIVE",
    "summarized_story": "Ndubuisi Francis in AbujaThe Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed is to head the Governing Board of the Nigeria Electricity Liability Management Company Ltd. (NELMCO).\nThis followed the approval by the National Council on Privatisation (NCP) of the immediate composition and the proposed governance framework for the sustainable management and payment of post-privatisation liabilities of the power sector transferred to NELMCO, which hitherto was without a board.\nThe approval by the NCP chaired by the Vice President, Prof. Yemi Osinbajo was one of the major decisions taken by the Council at its third meeting for 2022 held at the Presidential Villa, and presided over by him.\nNELMCO is a Special Purpose Entity (SPE) created by the federal government, and saddled with the responsibility of managing the liabilities and non-core assets of the defunct Power Holding Company of Nigeria (PHCN).\nThe NCP noted the need to ensure an appropriate governance framework and sustainable management of the NELMCO’s affairs as contained in the provisions of its Memorandum and Articles of Association (MEMART) necessitated the constitution of the board."
  },
  {
    "headline": "Enrolment of Pupils Rises from 900,000 to 2.2m in Katsina – THISDAYLIVE",
    "summarized_story": "Francis Sardauna in KatsinaThe Katsina State Commissioner for Education, Badamasi Lawal Charanchi, Monday said the enrolment of primary school pupils has risen from 900,000 to 2.2 million in the state due to the state government’s effort at revamping the education sector.\nThe commissioner, who disclosed this while addressing some journalists in his office, explained that out of the 2.2 million pupils enrolled in primary schools across the state, 1.2 million are girls.\nHe said: “When we came on board in 2015, there were only 900,000 primary school pupils but today, we have 2.2 million children coming to school.\n“Numbers of primary school teachers also increased from 19,000 to 27,000.\nThis is aside from the adequate teaching and learning materials being provided to schools by the government,” he added."
  },
  {
    "headline": "Group Drags IG to Court over Alleged Refusal to Prosecute Tinubu on Alleged Perjury – THISDAYLIVE",
    "summarized_story": "* Asks for an order of mandamusAlex Enumah in AbujaA non-governmental group has dragged the Inspector General of Police (IG) before the Abuja Division of the Federal High Court over his alleged refusal to prosecute the candidate of the All Progressives Congress (APC), Asiwaju Bola Tinubu, over allegations bordering on perjury.\nThe suit dated and filed on July 4 on behalf of the applicant by Mike Nwankwo, has the Nigerian Police Force and the IG as first and second respondents.\nThe applicant claimed it has the legal competence to invoke the jurisdiction of the court to compel the respondents to discharge their legal, constitutional and public duties in line with the law.\nThe applicant further claimed that Tinubu “forged all the educational certificates he listed in his INEC Form CF 001 which he admitted he did not posses in annexure C”.\n“On the strength of the above, we respectfully demand that you initiate the criminal proceedings of Senator Bola Ahmed Tinubu consequent upon the express findings of the Lagos State House of Assembly as captured above,” it said."
  },
  {
    "headline": "Osinbajo: New ECOWAS Leadership must Resolve Lingering Issues in Subregion – THISDAYLIVE",
    "summarized_story": "* Body lifts economic and financial embargoes on MaliDeji Elumoye in AbujaVice-President Yemi Osinbajo has charged the new leadership of the Economic Community of West African States (ECOWAS) to resolve all pending issues affecting the subregion.\nThe lingering issues, according to him, included economic challenges especially with the Russia-Ukraine crisis, economic problems and military coups in three of the West African countries.\nHe said the subregional body’s leaders must work harder to resolve the identified lingering issues in the region.\n“So, we expect that the new leadership will take over and work as hard and perhaps much harder to resolve some of the issues.\nThere are even additional challenges today – economic challenges, especially with the Russian-Ukraine crisis, and economic problems."
  },
  {
    "headline": "EXCLUSIVE: Organ Harvesting: Beatrice, Wife Of Nigerian Ex-Deputy Senate President, Ekweremadu, Held In HMP Bronzefield Prison, Europe’s Largest Female Jail",
    "summarized_story": "Beatrice, wife of the former Deputy Senate President, Ike Ekweremadu, is being held at HMP Bronzefield prison in the United Kingdom, SaharaReporters has gathered.\nHMP Bronzefield is an adult and young offender female prison located on the outskirts of Ashford in Surrey, England.\nBronzefield is the only purpose-built private prison solely for women in the UK, and is the largest female prison in Europe.\nSee Also News Organ Harvesting: Ekweremadu Appears Before UK Court, Date Fixed To Decide Location Of Trial“The women are unlocked at 08:00hrs for breakfast and to receive any medication they may require.\nThe Uxbridge Magistrate Court last week denied Beatrice access to Ekweremadu who is being detained in another prison."
  },
  {
    "headline": "EXCLUSIVE: Organ Harvesting: Beatrice, Wife Of Nigerian Ex-Deputy Senate President, Ekweremadu, Held In HMP Bronzefield Prison, Europe’s Largest Female Jail",
    "summarized_story": "Beatrice, wife of the former Deputy Senate President, Ike Ekweremadu, is being held at HMP Bronzefield prison in the United Kingdom, SaharaReporters has gathered.\nHMP Bronzefield is an adult and young offender female prison located on the outskirts of Ashford in Surrey, England.\nBronzefield is the only purpose-built private prison solely for women in the UK, and is the largest female prison in Europe.\nSee Also News Organ Harvesting: Ekweremadu Appears Before UK Court, Date Fixed To Decide Location Of Trial“The women are unlocked at 08:00hrs for breakfast and to receive any medication they may require.\nThe Uxbridge Magistrate Court last week denied Beatrice access to Ekweremadu who is being detained in another prison."
  },
  {
    "headline": "Nigerian Soldiers Kick Against Army Day Celebration, Accuse Top Officials Of Corruption",
    "summarized_story": "This is coming barely 48 hours to this year’s July 6th Army Day Celebration, in which the aggrieved soldiers have insisted that there is nothing to celebrate.\nAccording to them, the major problem is that some of the top Army officers are involved in massive corruption and feeding large on the entitlements of personnel.\n“They are celebrating Army Day while some soldiers are using their money to pay for the houses they are living in while they are serving in the army because there is no accommodation in barracks.\nSoldiers use their money to buy uniforms and they are talking about Army Day celebration.\nYet, the army would say that they are taking care of soldiers and the families of soldiers that lost their lives."
  },
  {
    "headline": "Nigerian Soldiers Kick Against Army Day Celebration, Accuse Top Officials Of Corruption",
    "summarized_story": "This is coming barely 48 hours to this year’s July 6th Army Day Celebration, in which the aggrieved soldiers have insisted that there is nothing to celebrate.\nAccording to them, the major problem is that some of the top Army officers are involved in massive corruption and feeding large on the entitlements of personnel.\n“They are celebrating Army Day while some soldiers are using their money to pay for the houses they are living in while they are serving in the army because there is no accommodation in barracks.\nSoldiers use their money to buy uniforms and they are talking about Army Day celebration.\nYet, the army would say that they are taking care of soldiers and the families of soldiers that lost their lives."
  },
  {
    "headline": "Hoodlums Attack Bauchi State Lawmakers, Damage Cars, Doors, Windows",
    "summarized_story": "Barely a day after some unknown hoodlums attempted to burn down the Bauchi State House of Assembly, another set of hoodlums on Monday attacked the lawmakers in their guest house and smashed their cars and windows of the houses.\nThe hoodlums, who were said to be about 50, stormed the guest house where the lawmakers were holding a meeting on Sir Kashim Road, a few meters away from the Government House and tried to chase them away.\nAs we rushed out to see what was happening, the hoodlums rushed in holding guns, cutlasses and other dangerous weapons.\nAll that is required is for us to sit down and dialogue in order to have a solution to the problem.\nIt is simply a misunderstanding among members of the House.”The security guard of the guest house also told newsmen that the hoodlums attacked the house with different dangerous weapons."
  },
  {
    "headline": "Kaduna guber: Uba Sani announces Hadiza Balarabe, deputy governor, as running mate",
    "summarized_story": "Uba Sani, governorship candidate of the All Progressives Congress (APC) in Kaduna, has announced Hadiza Balarabe, the current deputy governor, as his running mate.\nSpeaking on his choice of the deputy governor as running mate, the lawmaker said he arrived at the decision after consultations with “critical stakeholders”.\nHadiza Balarabe has contributed immensely to the giant strides recorded by the Mallam Nasir El-Rufai’s administration in infrastructure and human capital development.\nAdvertisement“I wish to therefore call on the good people of Kaduna State to support the choice of Dr. Hadiza Sabuwa Balarabe as my running mate.\nYour mandate in 2023 will enable us to build a peaceful, prosperous, and greater Kaduna State."
  },
  {
    "headline": "Kaduna guber: Uba Sani announces Hadiza Balarabe, deputy governor, as running mate",
    "summarized_story": "Uba Sani, governorship candidate of the All Progressives Congress (APC) in Kaduna, has announced Hadiza Balarabe, the current deputy governor, as his running mate.\nSpeaking on his choice of the deputy governor as running mate, the lawmaker said he arrived at the decision after consultations with “critical stakeholders”.\nHadiza Balarabe has contributed immensely to the giant strides recorded by the Mallam Nasir El-Rufai’s administration in infrastructure and human capital development.\nAdvertisement“I wish to therefore call on the good people of Kaduna State to support the choice of Dr. Hadiza Sabuwa Balarabe as my running mate.\nYour mandate in 2023 will enable us to build a peaceful, prosperous, and greater Kaduna State."
  },
  {
    "headline": "Owo attack: Security agencies jumped into conclusion with ISWAP claim, says Akeredolu",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo, says he still has reservations about the claim that the Islamic State in West Africa Province (ISWAP) was responsible for the Catholic church attack.\nThe governor, who spoke on Channels Television on Monday, said he doesn’t agree with the federal government and security agencies that ISWAP was solely responsible for the attack in Owo.\nOn June 5, gunmen attacked St. Francis Catholic Church, Owo, in Ondo state and killed over 40 worshippers.\nAdvertisementA few days after the attack, Rauf Aregbesola, minister of interior, had said the attack was orchestrated by ISWAP.\n“In Ondo state, we have faced terrorism from the three — whether it’s bandits, Fulani herdsmen or ISWAP — they work together."
  },
  {
    "headline": "Owo attack: Security agencies jumped into conclusion with ISWAP claim, says Akeredolu",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo, says he still has reservations about the claim that the Islamic State in West Africa Province (ISWAP) was responsible for the Catholic church attack.\nThe governor, who spoke on Channels Television on Monday, said he doesn’t agree with the federal government and security agencies that ISWAP was solely responsible for the attack in Owo.\nOn June 5, gunmen attacked St. Francis Catholic Church, Owo, in Ondo state and killed over 40 worshippers.\nAdvertisementA few days after the attack, Rauf Aregbesola, minister of interior, had said the attack was orchestrated by ISWAP.\n“In Ondo state, we have faced terrorism from the three — whether it’s bandits, Fulani herdsmen or ISWAP — they work together."
  },
  {
    "headline": "Six killed in shooting at US Independence Day parade",
    "summarized_story": "Six persons have been killed, following a shooting during a parade at Highland Park in Illinois, Chicago, USA.\nA parade to mark 246 years of independence in the US, was on at the Highland Park when gunshots were heard and people started running.\nIt was an active shooter incident that occurred in downtown Highland Park during our 4th of July holiday parade this morning.\nWe have secured the perimeter around downtown Highland Park and are continuing our searches.\n“At this time, two dozen people have been transported to the Highland Park Hospital."
  },
  {
    "headline": "How Nigerian startups can build healthier cultures",
    "summarized_story": "Earlier in May, TechCabal asked 5 employees at different startups what was important to them when considering a job offer.\nBut they ranked something else even higher: company culture.\nTurnover costs startups up to 20% of an employee’s annual salary, and for managerial roles, the costs will go up.\nBucknor uses the 70–20–10 model to explain why it’s important that startups learn how to give constructive feedback.\nThe way you address those needs impact your relationship with the children.”The right incentives, according to Samson-Grace, can boost a startup’s culture."
  },
  {
    "headline": "10 lessons Emeka Ajene learned while building Gozem",
    "summarized_story": "Emeka Ajene co-founded Gozem alongside Raphael Dana in 2018.\nAcross African markets where the innovation economy is still nascent and some positive aspects of Silicon Valley-style management aren’t widely-adopted (yet?\nHearing but not heeding is what kills young men.” — Igbo proverbAttracting talent is a challenge for all organizations, and doubly so for early-stage companies.\nAnd for startups operating in African markets, the talent challenge is compounded by the relative lack of depth within local talent pools.\nDuring my time in Togo, Gozem experienced its share of unforeseen external bad luck, from office flooding to power outages to regular connectivity disruptions and more."
  },
  {
    "headline": "South Africa’s Constitutional Court rules against communications minister’s digital migration deadline",
    "summarized_story": "South Africa’s constitutional court has ruled against Khumbudzo Ntshavheni’s decision to switch off analogue broadcast systems by June 30, 2022, declaring it unconstitutional.\nNtshavheni – who serves as the country’s current Minister of Communications and Digital Technologies – wants South Africa to migrate to digital broadcast systems.\nSTBs would enable households to continue having access to television channels on their analogue television sets after the analogue switch-off.\nIn the final ruling, the High Court dismissed the application from e.tv, MMA and SOS but extended the analogue switch-off date to June 30, 2022.\nIn a unanimous judgment, the Constitutional Court ruled that the power to determine the analogue switch-off date and the registration deadline for STBs is located within the minister’s original constitutional policymaking function."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How fuel queues in Abuja is being tackled – NNPC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian National Petroleum Company Limited (NNPC Ltd) started its weekly activities with a resolve to quickly end the incessant queues at various filling stations in the Federal Capital Territory (FCT), Abuja.\n“No one can guarantee stability of petroleum products supply; the world has never seen this kind of uncertainty.\nSpeaking at the event in Abuja, the Minister of State for Petroleum Resources, Chief Timipre Sylva, said that the presentation of the Licences was part of the implementation of the PIA 2021.\nKomolafe added that the conclusion of the 2020 Marginal Fields Bid Round brought to an end the era of Marginal Field awards as stipulated by the PIA.\n“I make bold to say that harnessing our abundant resources remains Nigeria’s major pathway towards leveraging gas, the least carbon-emitting fossil fuel, as a transition fuel."
  },
  {
    "headline": "Kidnap of catholic priests: Edo Acting gov meets security chiefs, assures security in churches, communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Acting Governor, Rt.\nComrade Philip Shaibu, on Monday, said the government is strengthening its security architecture and reviewing strategies to guarantee the safety and security of residents across communities in the state.\nShaibu said this while addressing journalists after an emergency State Security Council meeting held at the Government House, Benin City.\nThe emergency meeting followed the kidnapping of two catholic priests along Benin-Auchi Road at the Ekpoma axis, in Edo State.\nWe are looking beyond securing the churches alone but focusing on securing our communities and state."
  },
  {
    "headline": "3 Killed As Police Rescue Abducted Italian Cleric In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Operatives of Edo State Police Command have neutralised three suspected kidnappers during a successful rescue operation of an Italian catholic priest abducted in the state, last Sunday.\nThe Deputy Public Relations Officer for Edo State Police Command ASP Jennifer U. Iwegbu stated this in a statement made available to journalists through the command’s official WhatsApp platform, today.\n“Operatives of the Edo state police command attached to Iguobazuwa Division on the 03/07/2022 at about 1745hrs received information that Rev.\nThe police assured residents of the state of adequate security and solicited for enhanced synergy towards fighting crime and criminality in Edo State.\nChristopher Odia of St. Michael Catholic church, lkhabigbo, Etsako West local government area of Edo state."
  },
  {
    "headline": "Financial experts attribute decline in living standards to high inflation rate – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestFinancial experts say the increasing inflation rate in Nigeria has impacted negatively on the living standard of Nigerians.\nAcccording to the National Bureau of Statistics (NBS), Nigeria’s inflation rate increased to 17.71 per cent on a year-on-year basis in May 2022.\n“Others are a lower standard of living, increased poverty level as Nigerians are increasingly unable to access necessary goods and services.\nAlaje said the average inflation rate for a nation should be between three to five per cent but unfortunately, in the last seven years Nigeria’s inflation rate had been in double digits.\n“We are calling on the Nigerian government to seek out ways to reduce the inflation rate, 17.7 per cent rate is unacceptable to us."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Lagos shuts Redeemer’s school after drowning of five-year-old pupil",
    "summarized_story": "The Lagos State Ministry of Education has shut the Redeemer’s Nursery and Primary School, Ogba, Lagos State after the drowning of Chidera Eze, a five-year-old pupil.\nThe commissioner made this known in a statement titled, “Lagos State Shuts Redeemers Nursery and Primary School’.\nRecall that Chidera Eze drowned during a swimming lesson organised by the school in the Ikeja area of the state in May 2022.\n“The investigation is sequel to the death of a five-year-old pupil, who is suspected to have drowned during a swimming lesson while in the custody of the school.\n“A preliminary probe by the Office of Education Quality Assurance of the Ministry has shown that the Redeemers Nursery and Primary School, Ogba, is yet to conclude its registration and is, therefore, not yet an approved school."
  },
  {
    "headline": "NIPR, NCC collaborate to achieve national integration",
    "summarized_story": "The elusive national integration has become a worrisome subject to the Nigerian Institute of Public Relations (NIPR), for which it has mapped out a strategy for a multi-ethnic and multi-sectoral strategy to be consummated through a national integration summit slated for August 2022.\nNeliaku said the key objective of the visit was to see how the Institute will leverage communication to address security concerns, enhance peace building, and facilitate national integration.\nDescribing NCC as one of the pillars of Nigeria’s national integration efforts, he said the Institute believes the Commission will partner in the successful hosting of the “Citizens Summit on National Integration, Peace and Security (CSNIPS)”, which takes place in Abuja, from 23rd to 24th August, 2022.\nMuoka said the EVC of NCC, holds NIPR in high esteem, “which is the reason he cherished the visit and asked me to receive you in his stead.\n), Lady Chinenye Ihuoma, and Ohaeri Osondu, all Fellows and Council Members of NIPR, that the Commission will continue to collaborate with the NIPR for direction in best practices in corporate relations."
  },
  {
    "headline": "5-year-old drowning: Lagos shuts Redeemer’s Primary School, Ogba",
    "summarized_story": "The Lagos State Ministry of Education has shut the Redeemer’s Nursery and Primary School, Ogba, Lagos State.\nThe Commissioner for Education, Folasade Adefisayo, announced the shutdown on Monday in a statement titled, “Lagos State Shuts Redeemers Nursery and Primary School’.\nIt would be recalled that five-year-old pupil of the Redeemer’s school, Chidera Eze, drowned during a swimming lesson organised by the school in the Ikeja area of the state in May 2022.\nSome teachers and caregivers of the school had taken Chidera and his colleagues for the swimming lesson at the Ivory Health Club, Ogundana Street, Ikeja.\nA preliminary probe by the Office of Education Quality Assurance of the Ministry has shown that the Redeemers Nursery and Primary School, Ogba, is yet to conclude its registration and is, therefore, not yet an approved school."
  },
  {
    "headline": "FG kicks as US senators accuse it of religious freedom violation",
    "summarized_story": "Nigeria’s federal government has condemned the call by five US senators for the re-designation of Nigeria as a country of particular concern over alleged violation of religious freedom.\nLate June, five US senators asked Antony Blinken, US secretary of state, Anthony Blinken to re-designate Nigeria as a country of particular concern.\nIn December 2020, the US listed Nigeria among countries blacklisted for “violating religious freedom” under the CPC designation, but removed the country from the list in November 2021.\n“We want to say once again that Nigeria does not have a policy that denies people the freedom to practice their religion.\nHe said commentators who are not well-versed in the politics and happenings in Nigeria took criminalities and communal clashes as issues of religious persecution."
  },
  {
    "headline": "Anamekwe, acting accountant-general who said govt borrows to pay salaries removed",
    "summarized_story": "Chukwuyere Anamekwe, acting accountant-general of the federation who disclosed weeks ago that the government is broke as is borrowing to pay salaries, has been removed.\nIn May, Anamekwe was appointed amid a probe into allegations of N80 billion fraud linked to Ahmed Idris, former accountant-general of the federation.\nLast month, Anamekwe claimed that Nigeria is borrowing money to pay salaries.\nHis interests include public financial management (PFM), financial reporting, cash management/Treasury Single Account, revenue/collections management, expenditure and management internal control.\nThey include Government Finance Statistics by International Monetary Fund (IMF) in Washington DC and Public Financial Management Reform in a Changing World by the Harvard Kennedy School, Boston MA, USA."
  },
  {
    "headline": "Osun Poll: Vote Buying, Rigging Won’t Save APC, Oyetola – PDP Group",
    "summarized_story": "The PDP New Generation Youth and Women Campaign Council for Osun State governorship election has said that no amount of vote-buying and rigging will stop the candidate of the Peoples Democratic Party (PDP), Senator Ademola Adeleke, from winning the July 16, 2022 governorship poll.\n“On July 16th, the people of Osun will vote in their hundreds of thousands for Ademola Adeleke, the candidate who is the people’s choice and the most popular.\nWe are confident that Ademola Adeleke, the Osun PDP candidate for governor in the upcoming election, is prepared to free the people from hunger and poverty, thanks to recent local government tours and rallies.\nThe PDP must act urgently to save the state from the APC and the present Governor’s policies of poverty, hunger, and underdevelopment,” he said.\nWith their votes and support for the PDP, the people of Osun will send the APC packing with their votes and support toward the PDP – it is a new dawn,” Akinniyi stated."
  },
  {
    "headline": "Osun Poll: Vote Buying, Rigging Won’t Save APC, Oyetola – PDP Group",
    "summarized_story": "The PDP New Generation Youth and Women Campaign Council for Osun State governorship election has said that no amount of vote-buying and rigging will stop the candidate of the Peoples Democratic Party (PDP), Senator Ademola Adeleke, from winning the July 16, 2022 governorship poll.\n“On July 16th, the people of Osun will vote in their hundreds of thousands for Ademola Adeleke, the candidate who is the people’s choice and the most popular.\nWe are confident that Ademola Adeleke, the Osun PDP candidate for governor in the upcoming election, is prepared to free the people from hunger and poverty, thanks to recent local government tours and rallies.\nThe PDP must act urgently to save the state from the APC and the present Governor’s policies of poverty, hunger, and underdevelopment,” he said.\nWith their votes and support for the PDP, the people of Osun will send the APC packing with their votes and support toward the PDP – it is a new dawn,” Akinniyi stated."
  },
  {
    "headline": "JUST-IN: We Will Call Off Strike Moment Federal Govt Accepts UTAS – ASUU",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has challenged the federal government to accept the University Transparency and Accountability Solution (UTAS) payment platform for it to call off the ongoing strike.\nASUU national president, Prof. Emmanuel Osedeke, who said this while speaking on Channels Television on Monday night, said the strike will continue unless government accept UTAS and honour the 2009 agreement.\nIt would be recalled that the ASUU strike action, which started on February 14, 2022 has entered 140th day this Monday.\nASUU has been at loggerheads with the federal government, citing the refusal of the latter to honour the 2009 agreement it entered with the Union.\nWhen would they accept UTAS?"
  },
  {
    "headline": "JUST-IN: We Will Call Off Strike Moment Federal Govt Accepts UTAS – ASUU",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has challenged the federal government to accept the University Transparency and Accountability Solution (UTAS) payment platform for it to call off the ongoing strike.\nASUU national president, Prof. Emmanuel Osedeke, who said this while speaking on Channels Television on Monday night, said the strike will continue unless government accept UTAS and honour the 2009 agreement.\nIt would be recalled that the ASUU strike action, which started on February 14, 2022 has entered 140th day this Monday.\nASUU has been at loggerheads with the federal government, citing the refusal of the latter to honour the 2009 agreement it entered with the Union.\nWhen would they accept UTAS?"
  },
  {
    "headline": "Money Laundering: ICPC Calls For Self-regulation By Estate Developers",
    "summarized_story": "The Independent Corrupt Practices and other related offences Commission (ICPC) has urged the leadership of the Real Estate Developers Association of Nigeria (REDAN) to self-regulate its members as part of measures to prevent being used for money laundering and illicit financial flows (IFFs).\nThe ICPC chairman, Prof. Bolaji Owasanoye, gave the advice in his goodwill message at the 13th annual general meeting (AGM) and conference of the association held in Enugu State.\nHe said, “It is my position that self-regulation is a way out of this quagmire for the association.\nREDAN should consciously draw up programmers to build capacity of its members on modern trends in construction and also hold its members to the highest level of ethical standards.\n“The Association should introduce and enforce high ethical standards for its members especially to ensure their processes are not used for Money Laundering."
  },
  {
    "headline": "PDP Sets Up Panel To Beg Wike",
    "summarized_story": "If Wike was to be the vice-presidential candidate for Atiku, by now, you know Wike is a very practical person.\n“In this one, offers were made and people pushed for Governor Wike as the vice-presidential candidate of the party.\nEven God hates injustice.”On the PDP candidate sending emissaries to Wike, the lawmaker asked, “Does that not tell you something?\nHe noted, “This question actually ought to be directed at the PDP presidential candidate, His Excellency, Alhaji.\nLet the party’s NWC and the Presidential candidate walk up to Wike and talk with him now that he is back in the country,” he advised."
  },
  {
    "headline": "BREAKING: Buildings, Vehicles Destroyed As Thugs Attack PDP Members During Meeting In Kogi",
    "summarized_story": "BREAKING: Buildings, Vehicles Destroyed As Thugs Attack PDP Members During Meeting In KogiSeveral persons have been injured after suspected thugs invaded the venue of a meeting of the Peoples Democratic Party (PDP) youths in Ologba, Dekina Local Government Area of Kogi State.\nAccording to eyewitness accounts, guns, knives, clubs, horns and other dangerous weapons were used by the invading thugs during the attack.\nThough details of the incident are still sketchy, SaharaReporters learnt that the hoodlums also burnt several vehicles and motorcycles belonging to some PDP members.\nThe thugs came to the PDP youth meeting venue yesterday (Sunday) at Ologba, destroyed properties, burnt vehicles and motorcycles,” one of the sources told SaharaReporters on Monday.\nThe prominent politician was sleeping in her home when political thugs set the building alight."
  },
  {
    "headline": "Real reasons for persistent insecurity, massacres in South-East – Nnamdi Kanu’s lawyer",
    "summarized_story": "The Special Counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, Aloy Ejimakor, has given reasons for the persistent insecurity in the southeast.\nEjimakor said the perceived injustice meted on the southeast is responsible for the persistent insecurity in the region.\nHe lamented that people of the southeast are being blamed for insecurity incidents.\nBut today, the opposite is the case as Southeast officers and ranks are significantly redlined from all critical security formations, particularly the ones based in the Southeast.\n“This means that the Southeast shall be equal partakers in the opportunities of the Nigerian enterprise."
  },
  {
    "headline": "Alleged Christians Persecution: FG replies five U.S. Senators",
    "summarized_story": "The President Muhammadu Buhari-led Federal Government on Monday condemned the call by five US Republican Senators asking for the redesignation of Nigeria as a country of particular concern because of alleged persecution of Christians.\nThe Senators who made the call in a letter to the US Secretary of State, Antony Blinken also alleged violation of freedom of Christians’ rights to practice their religion.\nNAN reports the minister is in London for engagements with international media as well as some relevant Non-Governmental-Organisations.\n‘We want to say once again that Nigeria does not have a policy that denies people the freedom to practice their religion.\n“If statistic is to be taken, I can say confidently that as many Muslims as Christians have been victims of these criminals,” he said."
  },
  {
    "headline": "Osun guber: Sanwo-Olu, Ganduje upbeat, INEC vows to beat Ekiti record",
    "summarized_story": "He added that Governor Oyetola had performed creditably well to deserve another term to consolidate on the good works he started.\nThis is a decision that will bring development and progress not only to Osun but to entire Nigeria as Osun election will determine next year’s general elections,” SanwoOlu said.\nINEC assuresMeanwhile, Chairman Independent National Electoral Commission (INEC) Professor Mahmood Yakubu has expressed the commission’s determination to surpass its record in Ekiti by conducting a hitch-free governorship election in Osun state.\nSpeaking in Osogbo after assessing the non-sensitive materials, Yakubu said the commission is ready to go on with the Osun governorship election and achieve better results.\n“Remember, Ekiti was good, but we want Osun to beat our record in Ekiti and the 2023 General election."
  },
  {
    "headline": "Breaking: In Kaduna, APC retains Muslim-Muslim ticket as Uba Sani picks El-Rufai’s deputy as running mate",
    "summarized_story": "The governorship candidate of the All Progressives Congress (APC) in Kaduna state, Senator Uba Sani, has picked Governor Nasir El-Rufai’s deputy, Dr. Hadiza Balarabe, as his running mate for the upcoming 2023 gubernatorial elections in the state.\n“I wish to, therefore, call on the good people of Kaduna state to support the choice of Dr. Hadiza Sabuwa Balarabe as my running mate.\nI also enjoin them to come out en masse to vote for our ticket during the forthcoming 2023 general elections.\nYour mandate in 2023 will enable us to build a peaceful, prosperous, and greater Kaduna state.\n“Together, we are determined to make the state a reference point for good and responsive governance,” Sani stated."
  },
  {
    "headline": "FG to U.S. Senators: No Nigerian persecuted on religious ground",
    "summarized_story": "The Senators who made the call in a letter to the US Secretary of State, Antony Blinken, also alleged violation of freedom of Christians’ rights to practice their religion.\nNAN reports the minister is in London for engagements with international media as well as some relevant non-governmental organisations.\n‘We want to say once again that Nigeria does not have a policy that denies people the freedom to practice their religion.\n“Nobody in Nigeria is being persecuted, but we have issues of criminality going on and the criminals really do not make distinction of any religion.\nThe minister further said the only known group that target Christians was the Islamic State’s West Africa Province (ISWAP)."
  },
  {
    "headline": "Group Berates Oil Marketers, Commends Kyari",
    "summarized_story": "The Coordinator, Stand Up Nigeria, Sunday Attah, on Saturday berates the action of some oil marketers who are hiding under various claims to create artificial logjams in order to force the government to increase the pump price of fuel.\nAttah describe the development as most unfair as even under the current arrangement where the official pump price is N165 the marketers still make huge profits.\nThe group however, exonerated the NNPC from playing any role in the ongoing scarcity after carrying out investigation into the cause of the problem.\nThis is most unfair as even under the current arrangement where the official pump price is N165 the marketers still make huge profits”.\nWe therefore call on the marketers to show more sense of patriotism by taking into cognisance the pains they put other Nigerians through just to make profit."
  },
  {
    "headline": "ACCI Appoints MD/CEO Bristol Group as Vice President – Industry",
    "summarized_story": "The Executive Committee and Council Members of Abuja Chamber of Commerce and Industry has appointed the group Managing Director and Chief Executive Officer (MD/CEO) of Bristol Group, Dr Chijioke Ekechukwu as the Vice President -Industry of the Chamber.\nThe President of ACCI, Dr Al-Mujtaba Abubakar announced the appointment of Dr Ekechukwu at the 16th EXCO meeting on Thursday as ACCI VP Industry to replace the late Ichie Jude Igwe who occupied the position till his demise on the 15th of October 2021.\nDr Chijioke has served as the Director General ACCI betweeen 2017 and 2018.\nHe is on the Board of First Generation Mortgage Bank Ltd, Abuja, Bristol Academy Ltd and Dignity Finance and Investments Ltd.\nHe is also the Chairman of Oriental Rice Mill Ltd.Dr. Ekechukwu, a former President of Rotary Club of Abuja is happily married with children."
  },
  {
    "headline": "Economy Diversification: Why Nigeria’s mining sector offers robust economic potential- Adegbite",
    "summarized_story": "“Let me emphasis that, investment in the minerals and mining sector by stakeholders is a patriotic duty of every citizen who believe in the Nigerian Project.\nThe Federal government is developing a well governed mining sector with sustainable capacity and has also articulated a roadmap to address some of the identified challenges in the mining sector.\nThe initiatives and strategies outlined in the roadmap are designed largely to make the mining and minerals sector an irresistible destination for global capital.\nIn addition, developmental plans should take into cognizance the overall development aspirations of the State alongside the prospects and challenges of mining activities“The Mining sector to significantly contribute to Nigeria’s economy cannot be over-emphasized.\nKey programs of relevance to the sector must be critically and more robustly assessed by qualified professionals in the mix of our national development."
  },
  {
    "headline": "MMSD task staff on dedication to duty for improved productivity",
    "summarized_story": "has called on Civil Servants to be dedicated to duty for improved productivity.\nAdegbite made the call during the celebration organized by the ministry to commemorate the 2022 African Public Service Day in Abuja.\nShe told the workers that the occasion also affords the opportunity to specially acknowledge members of staff that have distinguished themselves through outstanding performance.\nUmar Adamu Tsoho who was honoured with the “Presidential Public Service Award” by the OHCSF for outstanding service.\nIt is indeed a noble achievement to successfully exit the Federal Civil Service through retirement."
  },
  {
    "headline": "Russian-Ukraine War: Buhari wants EU to increase oil and gas purchases from Nigeria",
    "summarized_story": "By Mathew Dadiya, AbujaPresident Muhammadu Buhari, Thursday in Lisbon, Portugal, indicated that Nigeria is ready to fill the natural gas gaps in Europe predicated by the current Russian-Ukrainian war.\nThe President also said with over 200 million mainly young people, Nigeria is ready to be the hub of the African Continental Free Trade Area (AFCFTA).\nIn his statement on areas of cooperation between Nigeria and Portugal delivered at the Presidential Palace in Lisbon, Buhari urged Portugal to consider Nigeria as a valued and trusted partner in Africa.\nOn oil and gas, Buhari said with the current Russian-Ukraine war, increased cooperation in oil and gas between the two countries has become vital to avoid a crisis in the demand and supply chain, even as Nigeria is already a major supplier of gas to Portugal.\nBuhari also stressed the need to establish a Joint Commission, saying:‘‘We believe that the establishment of a Joint Commission will help to promote the full realization of the objectives of our bilateral relations."
  },
  {
    "headline": "FG Was Too Quick To Blame ISWAP For Owo Church Attack – Akeredolu",
    "summarized_story": "Governor Oluwarotimi Akeredolu of Ondo State has again disagreed with the Federal Government over who should be blamed for the killing of worshipers in Owo.\n“It is important to let us know because the security agencies were too quick to jump to the conclusion that it was done by ISWAP.\nThe security agencies were too quick to link the incident to ISWAP.\nGovernor Oluwarotimi Akeredolu on Owo Church attack.\n#PoliticsToday pic.twitter.com/VOMEcD44gB — Channels Television (@channelstv) July 4, 2022Amid controversy over who was responsible for the incident, the Federal Government linked the killings to ISWAP, a position which Governor Akeredolu disagreed with."
  },
  {
    "headline": "Security Operatives Take Over Legislative Complex Amid Bauchi Assembly Crisis",
    "summarized_story": "There was an unusual presence of security operatives on Monday at the Bauchi State House of Assembly complex in the state capital.\nGovernor Bala Mohammed’s Special Adviser on State and National Assembly Liaison, Sani Burra, confirmed the situation at the complex in a statement on Monday.\nHe too immediately mobilised personnel to the complex to ensure that no damage is done.”While police authorities have yet to explain why their men were stationed at the Assembly complex, the governor’s aide spoke about the crisis among the lawmakers.\n“As you are aware, the crisis is that of the leadership of the House, not against the Executive,” Burra clarified.\n“We are trying to pacify the 22 lawmakers to wait for their colleagues who are presently on pilgrimages to Saudi Arabia and Israel before they will do whatever they want to do."
  },
  {
    "headline": "Bandits Kidnap Another Catholic Priest In Kaduna",
    "summarized_story": "Another priest of the Catholic Church, has been kidnapped by bandits in Kauru local government area of Kaduna State.\nThe victim, Reverend Father Emmanuel Silas was kidnapped from the parish rectory of Saint Charles Catholic Church, Zambina in Kauru Local Government within the early hours of Monday.\nThe incident comes less than two weeks after the priest in charge of the Kaduna Polytechnic Catholic community, Reverend Father Vitus Borogo was killed on his farm at Kujama in Chikun Local Government Area of Kaduna State.\nHe, however, solicits the prayers for the immediate and safe release of the Kidnapped priest, saying that the Catholic Community will use all available legal means to ensure the release of the kidnapped Reverend Father.\nREAD ALSO: Kidnappers Kill Catholic Priest, Hunter In EdoBarely a week before the incident, Channels Television reported the abduction and subsequent killing of Reverend Father Christopher Odia of St. Michael Catholic Church, lkhabigbo in Etsako LGA of Edo State."
  },
  {
    "headline": "PHOTOS: Arsonists Attack INEC Office In Enugu, Destroy Buildings, Ballot Boxes",
    "summarized_story": "An office of the Independent National Electoral Commission (INEC) in Enugu State, has been set ablaze by yet to be identified arsonists.\nMr Okoye disclosed that the Resident Electoral Commissioner (REC) for Enugu State, Mr. Emeka Ononamadu, reported that INEC’s Igboeze North Local Government Area office had been burnt.\nAlthough no casualties were reported, 748 ballot boxes, 240 voting cubicles, office furniture and equipment were destroyed in spite of the best effort of the Enugu State Fire Service deployed from Nsukka.\n“The attack, coming in the middle of the voter registration exercise and other preparations for 2023 General Election, is worrisome,” the INEC spokesman stressed.\nThis followed earlier attacks on Udenu Local Government Area office on 13th May 2021 and the State Headquarters in Enugu on 16th May 2021."
  },
  {
    "headline": "Morocco 2022: Banyana Snatch All Three Points In 2-1 Win Over Super Falcons",
    "summarized_story": "South Africa’s Banyana Banyana edged the Super Falcons 2-1 in the opening match of Group C of the 12th Women Africa Cup of Nations in Morocco on Monday, in the process picking all three points and shooting to the top of the pool.\nIt was a somewhat balanced first 45 minutes with both teams unable to achieve any breakthrough.\nThe Super Falcons looked rejuvenated after Francisca Ordega and Uchenna Kanu came into the fray for Asisat Oshoala and Ifeoma Onumonu respectively.\nTwo minutes into added time, Rasheedat Ajibade reduced the deficit when she found the ball at her feet in the box after good work and passed by captain Onome Ebi.\nCup holders Nigeria must gain all three points against Botswana in their second match of the competition on Thursday to revive their campaign."
  },
  {
    "headline": "Why I visited Nnamdi Kanu in detention",
    "summarized_story": "Governor of Anambra State, Professor Chukuma Soludo has explained why he visited the detained leader of the proscribed People of Biafra, Nnamdi Kanu in DSS custody.\nAnd in that, we met with transporters, traditional rulers and prepared to give amnesty to those in the bush.\n“The truth is that, Nnamdi Kanu is the leader of IPOB, and it has Eastern Security Network.\nBut it’s evident to me that quite a number of criminal gangs have emerged because it’s a lucrative criminality – kidnapping, stealing etc.\nBasically, we have three operating documents – first, the Soludo solution, Anambra vision 2070 which I chaired and the transition committee report."
  },
  {
    "headline": "Group makes case for Gov. El-Rufai as APC Presidential running mate -",
    "summarized_story": "A group in Kaduna state known as Tinubu Support Organization (TSO) are appealing to The All Progressive Congress (APC) presidential flag bearer, Bola Ahmed Tinubu to adopt the Kaduna State Governor, Nasir El-Rufai as his running mate ahead of the 2023 Presidential election.\nThey also revealed that Governor Nasir El-rufai resisted pressure to be dragged into the presidential race.\nTSO believes that the choice of running mate is a critical success factor for the victory of Asiwaju.\nThis is a man that is running a state government with appointees from all over Nigeria.\nWe appeal to all our leaders in the APC to support Asiwaju Bola Ahmed Tinubu to choose El-Rufai as his running mate.”Advertisement"
  },
  {
    "headline": "PDP Faults Governor Matawalle's Directives On Bearing Firearms -",
    "summarized_story": "The Peoples Democratic Party in Zamfara has kicked against the state Governor, Bello Matawalle, over his directive for citizens to bear arms for self defenceThe decision according to the PDP could lead to lead to anarchy and political vendetta against the opposition partiesAdvertisementAdvertisementThe state secretary of the party, Faruku Ahmed stated this at a press conference held at the party’s secretariate in Samaru, GusauHe says it is the sole responsibility of government at all levels to protect the lives and property of all citizensAdvertisementAdvertisementThe Zamfara main opposition party insist the Matawalle’s decision is uncalled for“Security is everybody’s business, hence to secure the lives and property is the responsibility of the state and federal governments“ He saidAdvertisementAdvertisement” As peace-loving and law-abiding citizens, we fault Zamfara State and the Federal Government for shifting such a serious constitutional responsibility to ordinary citizens whom majority are struggling to meet their daily damand” Ahmed maintained“It has been clear that the security agencies, groups and legal experts within and outside the state have opposed the firearms acquisition deal”AdvertisementAdvertisementThe PDP noted that the ruling APC’s failure has left Governor Bello Matawalle with no option than to manipulate the insecurity situation within the state to witch-hunt opposition https://www.tvcnews.tv/purplegold/post-new.php#parties.\n“As such, the PDP perceived the exercise as a deliberate attempt to divert public resources.”AdvertisementAdvertisementThe PDP through it’s Secretary, therefore, called on the federal government and heads of security agencies to stop Governor Matawalle from what they described as dangerous plan of allowing people to bear arms which may not be for the good of the country.\nThe opposition party is also accusing the state government under the leadership of Governor Bello Matawalle of esterblishing security Committees that is Targeted at frustrating opposition parties in the stateAdvertisementAdvertisement“We are calling on the Inspector General of police, the DSS and the NSCDC to be eagle eye on the ill-intention of targeting the opposition parties using various security committees established by Zamfara State government because the approach seems to be so tricky.” The PDP Lament.\nAdvertisement"
  },
  {
    "headline": "APC Northwest excos pledge to deliver zone in 2023",
    "summarized_story": "The Northwest Leadership of the ruling All Progressive Congress (APC) has pledged to ensure the party emerges victorious in the coming general elections.\nMr. Salihu Lukman, who is National Vice Chairman of the Northwest region explained that the zone has the political strength to secure victory for the party in 2023.\nAdvertisementAdvertisementHe made this known in Kaduna when critical stakeholders of the party met to strategize on ways to take their campaigns to the grassroots.\nThey also advised the party’s supporters within the zone to ensure they register and obtain their PVC’s.\nAdvertisement"
  },
  {
    "headline": "NFF President, Amaju Pinnick Paid N15 million For My Surgery – Etim Esin",
    "summarized_story": "Former Super Eagles Star, Etim Esin, narrates his health ordeal in an exclusive interview with ARISESports Correspondent, Aron Akerejolu and the role of the Nigerian Football Federation in his time of need."
  },
  {
    "headline": "The Possibility of a Third Force in 2023 Far From Being Feasible – Reno Omokri",
    "summarized_story": "Lawyer & Human Rights Activist, Reno Omokri speaks on the emergence of a third force in the Nigerian political space ahead of the 2023 elections and it’s implication on the two major political parties in Nigeria"
  },
  {
    "headline": "Buba Galadima: Peter Obi Should Grab NNPP’s Offer, The Best South East Can Get in 2023 is VP",
    "summarized_story": "A Chieftain of the New Nigeria People’s Party (NNPP) Buba Galadima, projecting that given the lack of political structure by the Presidential Candidate of Labour Party (LP), it is only proper for Peter Obi to quickly accept the offer of a Vice President’s slot offered by the NNPP presidential candidate, Rabiu Kwankwaso."
  },
  {
    "headline": "Indigenous Participation in Nigeria’s Gas Sector Now 50%, Says NUPRC Boss Komolafe",
    "summarized_story": "He explained that today, seven indigenous companies are among the top 20 with the highest oil reserves in the country.\n“Over 29 assets have been divested between 2009 till date presenting an opportunity for indigenous companies,” he stated.\nFifty seven fields, he recalled were recently issued in 2020 resulting in 102 Petroleum Prospecting Licences (PPLs) issued by the commission to indigenous companies.\nThe Group was established in 2015 with the primary objective of promoting and advancing the development of the Nigerian energy industry.\nHe commended the President, Muhammadu Buhari, for his steps to lift the petroleum industry through the passage of the Petroleum Industry Act (PIA) as well as his support for the group and lauded the transparent conduct of the recent marginal fields bid rounds."
  },
  {
    "headline": "PDP Urges Buhari to Investigate Ex-Army Chief Buratai Over Recovered N1.8bn",
    "summarized_story": "The PDP said the assertion by the NSA heightened suspicion on allegations of barefaced looting of money meant to equip the security forces.\nIt further recalled it had also alleged that the PDP drew attention to plans of the APC to create a slush fund account from monies fraudulently drawn from the national treasury to finance their plot to rig the 2023 general elections.\nThis, the PDP said was evidenced by the alleged massive use of money by the APC to prosecute a vote buying scheme in the recent Ekiti State Governorship election.\nIn view of this, the PDP stated: “This is because any allegation bordering on looting of funds meant for the fight against terrorism is of grave national concern and consequence.\nIt must be thoroughly investigated and anybody found wanting must be made to face the full weight of the law no matter how highly placed.”"
  }
]