[
  {
    "headline": "Navy releases seized vessel 17 months after",
    "summarized_story": "The Nigerian Navy Ship on Friday released a seized vessel, MV Platform Care I, to its owner at the Naval Base in Warri, Delta State, warning vessel operators to always obtain necessary documents for their activities as part of precautionary measures to checkmate insecurity in the country.\nThe PUNCH gathered that the release of MV Platform Care I followed directives from the naval headquarters.\nIt was further gathered that the vessel was seized in February 2020 for not having regular documents of the Nigerian Maritime Administration and Safety Agency and the Department of Petroleum Resources.\nCommander Levi Deyin, executive officer of NNS Delta, signed the release on behalf of the Chief of Naval Staff, Vice Admiral Awwal Gambo, as well as the Commander NNS Delta, Commodore Abdulhamid Baba-Inna.\nSpeaking at the brief ceremony marking the handing-over of the vessel, the naval executive officer emphasised the need for operators to acquire relevant documents during operations."
  },
  {
    "headline": "Man Utd manager Solskjaer ‘delighted’ to sign three-year deal",
    "summarized_story": "Manchester United manager Ole Gunnar Solskjaer has signed a new-three year deal, the Premier League club announced on Saturday.\nThe Norwegian, who took over from Jose Mourinho in 2018, will stay at Old Trafford until at least 2024, with the option of an extra year.\n“Everyone knows the feeling I have for this club, and I am delighted to have signed this new contract,” Solskjaer told the club website.\n“Manchester United wants to be winning the biggest and best trophies and that’s what we are all striving for.\n“I can’t wait to get out in front of a packed Old Trafford and get this campaign started.”(AFP)"
  },
  {
    "headline": "ATTACK ON CLARK: PANDEF asks Ohaneze Ndigbo to rein-in IPoB",
    "summarized_story": "Anything short of that would be inferred to be tacit approval of the balderdash of IPoB,” he said.\n“It is rather puerile for IPOB or any other group to consider that Niger Delta region would be part of any arbitrary contraption.\nIf it becomes necessary for the Niger Delta people to pull out of this country, we shall do so, on our terms.\n“Nevertheless, since the IPOB belligerents are so infantile and uninformed, it would suffice to state that the influence and significance of Chief E. K. Clark transcend the South-South zone and the Niger Delta.\nHe is an unswerving voice that resonates across Nigeria; for decades, speaking out against oppression, discrimination, and marginalization in the country,” PANDEF chairman asserted."
  },
  {
    "headline": "Why Lagos LG/Council elections witnessed low turnout – Voters",
    "summarized_story": "Some residents in Lagos on Saturday expressed dissatisfaction with the ongoing local government elections, because the restriction of movement came as a surprise to most of them.\nA resident of Oto Awori LCDA, Mr Anayo Nebonta, told NAN that he only “got wind” of the election this morning on his way to his business.\n“I advice that in a democratic setting like Nigeria, there should be sufficient publicity, to prepare voters for the exercise.\nAdegoke said ” I will say that some lagosians are not aware that there will be elections today.\nSeveral voters in the area complained that they were not previously aware of the election."
  },
  {
    "headline": "Lagos LG polls: low turnout, faulty card readers at Otto Awori LCDA",
    "summarized_story": "For instance, in Ward B unit 005, and unit 008 card reader failed.\nAs of 9 am few voters were at the polling unit.\nAt about 10:30 am when Vanguard got to polling Ward B unit 008, only three voters had voted, as the card reader wasn’t not recognizing the voters’ fingerprints.\nAt Ward B Unit 006 and Unit 007 the LASIEC officials came around 9 am, card reader is functioning and voting has commenced in earnest.\nAt Olorunda Local Council Development Area, Morogbo polling unit 010 Ward E, polling unit officials were just setting up at about 11:29 a, and voting hasn’t commenced."
  },
  {
    "headline": "Sanwo-Olu, wife, cast votes at Ikoyi unit",
    "summarized_story": "By Olasunkanmi AkoniGovernor of Lagos State, Mr. Babajide Sanwo-Olu, along with his wife, Dr. Ibijoke at about 11.04 cast their votes at Ward E, polling Unit 019, Femi Okunnu/Jakande, Eti-Osa Local Govrnment Area, LCDA, Ikoyi Lagos, amid low turn out of voters.\nThe duo, who arrived the Ward 09, Polling Unit after at about 11 M due to late arrival of ad-hoc staff of Lagos State Independent Electoral Commission, LASIEC, voted at 11:05am having been accredited by the presiding officer of LASIEC, for the Unit, Mr. Bamigbade Rasak Temitope.\nSanwo-Olu, however, appealed to residents and all registered eligible voters to come out and exercise their voting rights and vote for their choice of candidates.\nHe also commended LASIEC officials on the peaceful conduct of the exercise so far.\nDetails later:Vanguard News Nigeria"
  },
  {
    "headline": "Lagos LG elections: Low turnout in Festac town",
    "summarized_story": "By Innocent AnabaThe local government elections in Festac town, Amuwo-Odofin, Lagos State started in many of the polling units on time, but witnessed low turn-out as at 11am.\nAt 21 Road, 3rd Avenue, 1st Avenue, 5th Avenue, 22 Road, 23 Road, 24 Road, 7th Avenue, 6th Avenue, among others, you could see election officials with party agents at the polling units, awaiting voters, while in few others, voters were turning up at intervals.\nPolitical parties on the ballot papers sighted by this report showed that it only the All Progressives Congress, APC, the People Democratic Party, PDP and Labour Party that were on the ballot.\nAt all the polling units visited by this reporter at press time, police personnel were seen within the vicinity and the exercise was going on peacefully.\nVanguard News Nigeria"
  },
  {
    "headline": "Sunday Igboho: Sanwo-Olu breaks silence, says people are working privately",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos State has reacted to the arrest of Yoruba activist, Sunday Adeyemo, popularly called Sunday Igboho, in Cotonou, Benin Republic.\nSanwo-Olu stated that: “These are very difficult times for all of us.\nI can assure you that people are working behind the scenes.\nHis wife was released on Thursday after a hearing on the activist’s extradition to Nigeria but Igboho was remanded following the adjournment of the hearing.\nSunday Igboho’s wife committed no crime to be detained – Fani-Kayode tells Benin, Nigerian govts"
  },
  {
    "headline": "Suspension, discipline of members didn’t start with current Assembly – Imo Chief Whip, Okwara",
    "summarized_story": "The lawmaker, who doubles as the Chief Whip of the Assembly, maintained that the suspended lawmakers went contrary to the rules and regulations of the Assembly and were subsequently suspended.\nOrji Kalu links prison term to 2023 presidencyAccording to him, “the originator of the phrase was one of the arrowheads in the previous House.\n“The immediate past speaker of this 9th Assembly, Chiji Collins, was one of those who were affected at the previous House.\n“A lot of people have been asking to know what the suspended lawmakers committed that was termed ‘unparliamentary’.\n“Although, one of the suspended members has appealed to the ad hoc disciplinary committee to plead for his misconduct."
  },
  {
    "headline": "Emir Gambari appoints Abdulrazaq’s brother, APC, PDP stalwarts as Ilorin chiefs",
    "summarized_story": "The Emir of Ilorin and Chairman, Kwara State Council of Chiefs, Ibrahim Sulu-Gambari,has appointed new chiefs into the Emirate Council.\nEx-factional Chairman of the People’s Democratic Party (PDP), Abubakar Kawu Baraje, was appointed ‘Tafida’.\nSulyman Onikijipa Billahi was appointed ‘Grand Mufty’ of Ilorin Emirate; Yakub Aliagan is now ‘Sarkin Mallami’; Sakariyau Onimago emerged ‘Shetima.\nThe former Kwara Governor urged the appointees to justify the confidence reposed in them by the monarch “who has played the role of a good father to all indigenes and residents of Ilorin”.\nKwara PDP inaugurates reconciliation committee to unite party members"
  },
  {
    "headline": "Bauchi revokes licenses of private Colleges of Education",
    "summarized_story": "In a move aimed at curbing proliferation of private Colleges of Education in the state, the Bauchi State Government has revoked the licences of all private National Certificate of Education (NCE) awarding institutions across the state with immediate effect.\nMadara stated that the decision was taken with a view to ensuring that quality education was provided to the citizens as well as restoring the lost glory of education in the state.\n“Following the incessant proliferation of NCE awarding institutions in the state, the government has resolved to revoke all approvals given by the Ministry with immediate effect,” he said.\n“The decision by the government to revoke the license of these NCE awarding institutions was taken in good faith so as to ensure that quality education is provided to the citizens and also to restore the lost glory of education in the state.\n“However, any interested institution wishing to continue should reapply through the Ministry."
  },
  {
    "headline": "COVID-19 Delta variant: Akeredolu fumes over churches’ non-compliance to protocols",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, has decried the rate at which churches fail to adhere to the COVID-19 protocols in the state.\nAccording to Akeredolu, this is the time for everyone, particularly churches, to comply with the necessary protocols due to the deadly Delta variant of the virus.\nAkeredolu however admonished the people on the need to continue to adhere strictly to COVID-19 protocols in order to prevent the Delta variant of the disease from spreading into the state.\n“Don’t take this COVID-19 for granted, particularly when you understand the Delta variant that is just coming which is more dangerous than what we had before.\nMuslims shun COVID-19 protocols at Bauchi praying grounds"
  },
  {
    "headline": "PHOTOS: Voters on queue for Lagos Council poll",
    "summarized_story": "Patricia Technologies Limited is proud to announce that we have moved our operations to the Republic of Estonia, with our..."
  },
  {
    "headline": "Clarion Chukwurah celebrates 57th birthday with topless pictures",
    "summarized_story": "By Gbenga BadaVeteran thespian Clarion Chukwurah has released a couple of topless pictures to celebrate her 57th birthday.\nOn Saturday, the enigmatic actress took to her Instagram page to share a total of eight pictures – four out of which had her topless.\nWith a strong message of hope for Nigeria, Chukwurah said she’s unbreakable and will be restored like Nigeria.\n“My name is Clarion Chukwurah, today is my birthday… I am a Nigeria and I say I am unbreakable, by grace I will be restored.\nAmen,” Chukwurah wrote in parts."
  },
  {
    "headline": "Igboho fights back, sues DSS, Malami for N500b",
    "summarized_story": "Igboho filed a suit at the Oyo State High Court, Ibadan, against the DSS and the Attorney General of the Federation (AGF), Abubakar Malami (SAN), seeking N500 billion damages.\nHe is praying the court for an order for the enforcement of his fundamental human right.\nADVERTISEMENTThe sum was described as “exemplary and/or aggravated damages for breaching the applicant’s fundamental rights in the course of illegal and/or malicious invasion of his residence situate, lying and being at Igboho Villa.\nHe adjourned till July 29 for further hearing in the suit which has the DSS and its Director General as respondents.\n“Upon the applicants’ arrest, the applicants were subsequently transferred to Federal Capital Territory, Abuja under the watch and guide of the respondents, who have since held the applicants in detention till date."
  },
  {
    "headline": "PHOTOS: Lagos-Abeokuta expressway deserted as Lagos council poll holds",
    "summarized_story": "Patricia Technologies Limited is proud to announce that we have moved our operations to the Republic of Estonia, with our..."
  },
  {
    "headline": "China’s Yang wins first Tokyo Olympics gold medal",
    "summarized_story": "Agency ReporterThe first gold medal of the Tokyo Olympic Games was awarded to Qian Yang of China in the women’s 10-metre air rifle event on Saturday morning.\nThe 21-year-old student, already an Asian Games champion, prevailed in the final with an Olympic record score of 251.8.\nADVERTISEMENTRussian Anastasiia Galashina, competing as a neutral athlete given her country’s doping ban, came second on 251.1 while Switzerland’s Nina Christen won the bronze medal with 230.6.\nREAD ALSO: Tokyo Olympics begin with colourful ceremony in empty stadium“It’s unbelievable that I can be here,” said a delighted Yang, who did not initially realise she had won.\nI just wanted to fix myself and fix my mood during the competition.”(dpa/NAN)"
  },
  {
    "headline": "56 Days After, Bandits Hold on to 116 Tegina Pupils, Amass N50m Ransom",
    "summarized_story": "The kidnappers had agreed to free the remaining 116 pupils if the ransom reduced from the initial N200 million to N50 million was paid.\nBut after counting the money, the abductors declared that it was N4.6 million short, and detained the conveyor of the ransom.\n“We are fed up, we are leaving everything to God” one of the parents told THISDAY yesterday.\nSome parents told THISDAY that the Niger State Government promised to help offset part of the ransom but failed to deliver.\nGovernment is not helping matters at all saying this, saying that, yet we cannot see anything on the ground.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Terrorists Burn Army Armoured Vehicle, Kill Four in Zamfara Community",
    "summarized_story": "Francis Sardauna in KatsinaBandits, yesterday morning, launched fresh onslaught on Dansadau community, in Maru Local Government Area of Zamfara State, killing four villagers.\nThey also kidnapped 14 others and set ablaze a military armoured personnel vehicle in the community.\nHe added that the invaders also injured seven other residents before they burnt the military armoured personnel vehicle, stating that despite the ongoing peace and reconciliation programme being run by the state government, killing and kidnapping of innocent people remained the order of the day in Zamfara.\nThe military armoured personnel vehicle while trying to fight the bandits hit a pole and the soldiers abandoned it and ran away.\nDansadau community is about 99 kilometers from Gusau the Zamfara State capital and is one of the hottest zones in terms of banditry, kidnappings, and other nefarious activities in the state."
  },
  {
    "headline": "I Don’t want Your Bribes, Invest in CSR, Buhari Tells Contractors",
    "summarized_story": "Rather, he advised the affected contractors to be alive to their Corporate Social Responsibilities (CSR) through which they could give back to the immediate community where they operate.\nThis is just as the President’s son, Yusuf Buhari, was named the new Talban Daura by the Emir of Daura, Dr Umar Faruk Umar.\nPresident Buhari said pointedly, “I don’t want your cheque.\n“We don’t want cheques from anyone or organisation as returns or influence of any kind.\nI doubt if we will be here today.”Emir Faruk also publicly announced conferment of the title of Talban Daura on the President’s son, Yusuf Buhari."
  },
  {
    "headline": "World Bank: Nigeria Going through Its Worst Unemployment Crisis",
    "summarized_story": "*Says country’s asylum seekers grew from 27,557 to 408,078 in 10 Years*Applications for refugee status increased by 1,380%* Estimates 4,000 Nigerian children made orphans by COVID-19 World Bank: Nigeria Going through Its Worst Unemployment CrisisBy Ndubuisi Francis and Emmanuel AddehNigeria is currently going through one of its worst unemployment crises in recent times, a new report by the World Bank has stated.\nThis is as the World Bank, in a separate report, has estimated that about 4,000 Nigerian children were made orphans by the COVID-19 pandemic between March 2020 and July 2021.\nThe report, which expressed concern about the country’s rising unemployment situation was published by the Washington-based institution with support from the Korea World Bank Partnership Facility (KWPF) and the Rapid Social Response (RSR) trust funds.\nWorld Bank, however, blamed a combination of rising unemployment, booming demographics, and unfulfilled aspirations as resulting in increasing pressure on young Nigerians to migrate in search of gainful employment overseas.\n“The expanding working-age population combined with scarce domestic employment opportunities is creating high rates of unemployment, particularly for Nigeria’s youth,” the World Bank report noted."
  },
  {
    "headline": "CBN Targets October for Digital Currency Launch",
    "summarized_story": "James Emejo with agency reportThe Central Bank of Nigeria (CBN) yesterday disclosed that its much-anticipated digital currency will be launched on October 1.\nMohammed said the digital payment instrument would further improve payment efficiency, revenue tax collection, remittance improvement, and targeted social intervention.\n“We have spent over two years studying this concept of central bank’s digital currency and we have identified the risks.\nSo, the central bank’s digital currency is the third form of fiat money.\n“The central bank digital currency will just be as good as you having cash in your pocket."
  },
  {
    "headline": "EXCLUSIVE: Blind Saxophonist Arrested In Dunamis Church Falls Sick In Department Of State Services’ Custody, Denied Access To Doctors",
    "summarized_story": "The DSS had arrested five human rights activists who wore the #BuhariMustGo T-Shirts during a Sunday service in the church, including the blind saxophonist and had refused them access to their family members.\nSaharaReporters learnt on Saturday that the saxophonist was denied access to doctors or drugs by the secret police detectives as his condition continued to deteriorate in the cell.\nThe DSS has denied their lawyers, family and doctors access to them since their arrest.\nThe saxophonist is seriously ill.”SaharaReporters had reported that the DSS operatives admitted that it was the Dunamis church which called for the arrest of the human rights activists who wore the #BuhariMustGo T-Shirts to its church service.\nHuman rights’ activists, Omoyele Sowore and Deji Adeyanju, had met with the Senior Pastor, Paul Enenche, over the arrest of six activists."
  },
  {
    "headline": "EXCLUSIVE: Blind Saxophonist Arrested In Dunamis Church Falls Sick In Department Of State Services’ Custody, Denied Access To Doctors",
    "summarized_story": "The DSS had arrested five human rights activists who wore the #BuhariMustGo T-Shirts during a Sunday service in the church, including the blind saxophonist and had refused them access to their family members.\nSaharaReporters learnt on Saturday that the saxophonist was denied access to doctors or drugs by the secret police detectives as his condition continued to deteriorate in the cell.\nThe DSS has denied their lawyers, family and doctors access to them since their arrest.\nThe saxophonist is seriously ill.”SaharaReporters had reported that the DSS operatives admitted that it was the Dunamis church which called for the arrest of the human rights activists who wore the #BuhariMustGo T-Shirts to its church service.\nHuman rights’ activists, Omoyele Sowore and Deji Adeyanju, had met with the Senior Pastor, Paul Enenche, over the arrest of six activists."
  },
  {
    "headline": "EXCLUSIVE: Blind Saxophonist Arrested In Dunamis Church Falls Sick In Department Of State Services’ Custody, Denied Access To Doctors",
    "summarized_story": "The DSS had arrested five human rights activists who wore the #BuhariMustGo T-Shirts during a Sunday service in the church, including the blind saxophonist and had refused them access to their family members.\nSaharaReporters learnt on Saturday that the saxophonist was denied access to doctors or drugs by the secret police detectives as his condition continued to deteriorate in the cell.\nThe DSS has denied their lawyers, family and doctors access to them since their arrest.\nThe saxophonist is seriously ill.”SaharaReporters had reported that the DSS operatives admitted that it was the Dunamis church which called for the arrest of the human rights activists who wore the #BuhariMustGo T-Shirts to its church service.\nHuman rights’ activists, Omoyele Sowore and Deji Adeyanju, had met with the Senior Pastor, Paul Enenche, over the arrest of six activists."
  },
  {
    "headline": "BREAKING: Bandits Sack Kaduna Police Station, Kill Officer In Attempt To Free Detainees",
    "summarized_story": "Suspected bandits have invaded a police station in Marraraban — Jos village in Kaduna State leaving a police officer dead.\nIt was gathered that the bandits attacked the station on Saturday in an attempt to release their detained colleagues.\nA former senator representing Kaduna Central, Shehu Sani, disclosed this in a tweet on his Twitter account.\nHe wrote, “Bandits raided a police formation in Marraraban-Jos village in the Outskirts of Kaduna in an attempt to free their detained men and they killed a police officer in Kundun-Zungeru, Niger State, the birthplace of the late President (Nnamdi) Azikiwe.\nThe bandits and the police are battling.”As of the time of filing this report, the bandits and police officers are still involved in a gun battle."
  },
  {
    "headline": "BREAKING: Bandits Sack Kaduna Police Station, Kill Officer In Attempt To Free Detainees",
    "summarized_story": "Suspected bandits have invaded a police station in Marraraban — Jos village in Kaduna State leaving a police officer dead.\nIt was gathered that the bandits attacked the station on Saturday in an attempt to release their detained colleagues.\nA former senator representing Kaduna Central, Shehu Sani, disclosed this in a tweet on his Twitter account.\nHe wrote, “Bandits raided a police formation in Marraraban-Jos village in the Outskirts of Kaduna in an attempt to free their detained men and they killed a police officer in Kundun-Zungeru, Niger State, the birthplace of the late President (Nnamdi) Azikiwe.\nThe bandits and the police are battling.”As of the time of filing this report, the bandits and police officers are still involved in a gun battle."
  },
  {
    "headline": "Igboho drags FG to court, demands N5.5bn as damages for house invasion",
    "summarized_story": "Sunday Adeyemo, a Yoruba nation agitator better known as Sunday Igboho, has sued the federal government over the invasion of his house, demanding N5.5 billion in damages.\nAdvertisementThe Ibadan home of Igboho was invaded by personnel of the Department of State Services (DSS) on July 1.\nIgboho, who claimed to be in the house at the time of the invasion, was not found by the DSS.\nHe was however arrested with his wife at the Cardinal Bernardin International Airport, Cotonou, Benin Republic on Monday.\nAdvertisementIn a notice of application filed by Yomi Aliyu, his lawyer, at the Ibadan high court, Igboho said his fundamental human rights were trampled upon by the government."
  },
  {
    "headline": "Igboho drags FG to court, demands N5.5bn as damages for house invasion",
    "summarized_story": "Sunday Adeyemo, a Yoruba nation agitator better known as Sunday Igboho, has sued the federal government over the invasion of his house, demanding N5.5 billion in damages.\nAdvertisementThe Ibadan home of Igboho was invaded by personnel of the Department of State Services (DSS) on July 1.\nIgboho, who claimed to be in the house at the time of the invasion, was not found by the DSS.\nHe was however arrested with his wife at the Cardinal Bernardin International Airport, Cotonou, Benin Republic on Monday.\nAdvertisementIn a notice of application filed by Yomi Aliyu, his lawyer, at the Ibadan high court, Igboho said his fundamental human rights were trampled upon by the government."
  },
  {
    "headline": "LIVE: Low voter turnout as Lagos holds LG elections",
    "summarized_story": "Elections into 57 seats in local governments (LGs) and local council development areas (LCDAs) of Lagos state have commenced.\nAdvertisementThe election is taking place across 13,323 polling units in the state."
  },
  {
    "headline": "LIVE: Low voter turnout as Lagos holds LG elections",
    "summarized_story": "Elections into 57 seats in local governments (LGs) and local council development areas (LCDAs) of Lagos state have commenced.\nAdvertisementThe election is taking place across 13,323 polling units in the state."
  },
  {
    "headline": "'Network providers assured us of 100% coverage' -- INEC insists on e-transmission of results",
    "summarized_story": "The Independent National Electoral Commission (INEC) says all network providers in Nigeria have assured of 100 percent coverage for electronic transmission of results.\nAdvertisementTheCable had reported how the national assembly blocked the electronic transmission of election results in the electoral act amendment bill.\nThe bill was eventually passed at the senate, but with a clause allowing the Nigerian Communications Commission (NCC) to certify national coverage, followed by an approval by the national assembly before INEC can transmit results electronically.\nThe NCC had also stated that only 50% of polling units in Nigeria have network coverage for e-transmission of results when it appeared before a house of representatives panel.\nSo, INEC is still wondering why NCC has suddenly made a U-turn that there is not enough network coverage in every part of Nigeria."
  },
  {
    "headline": "CBN regulations holding back mobile money revolution in Nigeria",
    "summarized_story": "In Ghana, it would be an “anomaly” for a supermarket, small store, or business merchant to not use a mobile money service for transactions.\nNew agent and electronic money guidelines were released in 2014, allowing network operators to run mobile money services, with supervision from the banking regulator.\nUptake in mobile money services and financial inclusion have equally increased across the country.\nThe regulatory framework is one of the core reasons why mobile money uptake has been relatively slow in Nigeria.\n“The CBN recognises the importance of Mobile Network Operators in the operations of mobile money services and appreciates the criticality of the infrastructure they provide."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October..."
  },
  {
    "headline": "Nigeria’s apex bank chooses open-source blockchain to run digital currency pilot on October 1, 2021",
    "summarized_story": "Share this article:The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October 1, 2021.\nThe apex bank announced earlier on June 10, 2021, that it would launch a pilot scheme for its digital currency before the end of the year.\nHyperledger Fabric blockchainThe Hyperledger Fabric blockchain is a private and permissioned blockchain network designed by computer hardware company, International Business Machines Corporation (IBM).\nIn a Cointelegraph article on July 2, 2019, Stuart Popejoy, blockchain expert and founder of hybrid blockchain platform, Kedena, said that “Fabric’s architecture is far more complex than any blockchain platform while also being less secure against tampering and attacks.\nAdvertisementMeanwhile, CBN says Nigeria cannot be left behind when 80% of central banks globally are considering issuing a central bank digital currency (CBDC)."
  },
  {
    "headline": "Twitter’s downvote button, Cellulant’s licence approval, Convergence Partners’ $120m round",
    "summarized_story": "Today, I’m discussing:Twitter’s shiny new downvote buttonConvergence’ Partners’ $120m roundCellulant’s licence approval in TanzaniaTwitter is testing out a downvote buttonPhoto by Claudio Schwarz | @purzlbaum on UnsplashWhat happened?\nTwitter says while the downvote button will be visible, only the reply owner can know the exact number received.\nHowever, according to Twitter, this is not a dislike button and while it bears some resemblance to Reddit’s downvote button, it will not affect the order of replies.\nCellulant’s new approval will allow it connect to banks, online merchants, payment processors, merchants, state governments, and customers to meet their digital payment demands in Tanzania.\nConvergence Partners raises $120 millionSouth African tech investment firm, Convergence Partners, has raised $120 million to drive inclusion in Africa."
  },
  {
    "headline": "Google x Maliyo Games, Instagram and YouTube’s new features, and Clubhouse leaves beta",
    "summarized_story": "Mobile gaming: Per Business Wire, the mobile gaming market was worth $98 billion globally in 2020 and is expected to grow to $272 billion by 2030.\nAccording to Kevuru games, 59.9% of games were played on mobile in 2020, while 28.70% and 16.11% were played on PC and console, respectively.\nOn July 20, 2021, the company announced in a blog post that it was launching Sensitive Content Control.\nAccording to Instagram, sensitive content isn’t content that breaks the rules but could upset some users.\nOn July 20, 2021, YouTube announced it is rolling out a beta version of its new feature, Super Thanks."
  },
  {
    "headline": "COVID-19: Breach of measures fuels third wave amid poor communication",
    "summarized_story": "The breach of essential preventive measures for COVID-19 has contributed to the rise of a third wave in Nigeria, according to the centre for disease control, but this has been poorly communicated.\nSeven months ago, in the wake of a second wave that saw COVID-19 cases shooting up from 122 to an all-time-high of 2,314 in January, communication from the government on the state of things was at a relative high level.\nRead Also: With 1,301 new infections, Nigeria’s COVID-19 cases rise to 111,305But as a third wave looms with more than 100 percent rise in daily caseloads, the convergence of communication from these government bodies has nosedived.\nThe presidential committee has stopped meeting for daily briefings and all communications have been split through individual channels of ministries and agencies.\n“There are varying factors associated with an increase in COVID-19 cases."
  },
  {
    "headline": "Tips for composing a compelling CV",
    "summarized_story": "Writing a compelling Curriculum Vitae (CV) is very important especially at a time when the job opportunities in Nigeria are reducing by the day.\nTo most recruiters or Human Resource (HR) professionals, a CV is the first advertisement of yourself to show the kind of person you are.\nThis is why having a good, detailed and well written CV can help attract the right jobs.\nFive HR professionals polled in a Business Day survey gave tips on how to write a compelling CV that attracts employers.\nUnini Mosimabale, HR at Alles Charis Gas LimitedA CV should have a professional summary of a few lines and should be written in the third person."
  },
  {
    "headline": "We banned Twitter because of Nnamdi Kanu, EndSARS protests – Malami",
    "summarized_story": "The federal government has said the decision to ban microblogging platform Twitter was because it was being used by Nnamdi Kanu, the leader of the Indigenous People of Biafra (IPOB), and to promote EndSARS protests on October 1.\nIn the counter-affidavit filed by the AGF, the government said it at no time restrained Nigerians from using Twitter.\nThe motion filed at the Federal High Court had contended that the Twitter ban was a fundamental human rights bridge breach.\nBut the AGF countered, saying Nigerians were still using Twitter despite the suspension.\nThe government told the court that the Twitter suspension would be lifted once the platform registers with the NBC and the Corporate Affairs Commission."
  },
  {
    "headline": "Human Trafficking: CLEEN Foundation trains law enforcement officers on victims centre approach – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The need for further capacity building, training and retraining essentially on our legal frameworks on the the need for victims-centre-approach towards preventing Human Trafficking and Forced Migration in Edo State took central stage as the CLEEN Foundation, a leading NGO in Nigeria again conducted a 2-Day training workshop for Law Enforcement senior officers in the state.\nIn his welcome address, the Executive Directive of the foundation, Benson Olugbuo, said that the workshop was also aimed at inter-agency collaboration in the fight against trafficking and forced migration as well as providing assistance to victims of trafficking through the instrumentality of existing laws.\nOlugbuo, who was represented at the event by the Program Manager, Ruth Olofin, noted that the role of law enforcement agencies is critical in addressing human trafficking, “hence, their roles cannot be downplayed if we are going to make significant stride in our effort to overcome this enigma.\n“The workshop is important because the tricks used by traffickers and their enablers are constantly evolving, so we don’t need old skills to be responding to emerging tactics by traffickers.\n“There is need to bring our Law Enforcement Agencies to speed on what they need to do when confronted with situation of human trafficking and forced migration and how their service delivery can also be gender responsive too to the need of the victims."
  },
  {
    "headline": "Cabinet: Obaseki receives screening committee’s report on 818 nominees – Nigerian Observer",
    "summarized_story": "Godwin Obaseki has received names of potential political appointees that will make his cabinet from the 15-man screening committee he inaugurated for the exercise.\nAccording to him, the political elite in Edo have a sense of preservation, knowing where the state should be rather than where they will be.\n“The purpose of political appointment in government and the role of the civil servants are different and should not be mixed.\nEarlier, the Chairman of the screening Committee Prof. Dennis Agbonlahor, said that the committee examined and screened 129 Commissioner nominees, 113 Senior Special Assistants (SSAs) and 576 Special Assistants (SAs).\nAgbonlahor said that the committee did a good job as all the political appointees were properly examined, screened and their performances scored accordingly."
  },
  {
    "headline": "Obaseki pledges increased support, partnership with security agencies to combat crime in Edo – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the Edo State Commandant of NSCDC, Mr. Aniekan Udoeyup, who was on a courtesy visit at the Government House, Benin City.\n“I want to assure you that we will continue to work with your command.\nI still have to pay salaries, so it will be very challenging for us to bear the burden of other federal security agencies in totality,” Obaseki added.\nEarlier, Udoeyup commended the governor for his support towards the command, adding that they would continue to provide security for all in the state.\nThe commandant, however, appealed to the governor to support the command with logistics to enable them to combat crimes on the highway."
  },
  {
    "headline": "Shaibu hails Edo Beads as state’s basketball team qualifies for national league after 23 years – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Deputy Governor, Rt.\nPhilip Shaibu, has congratulated the state’s basketball team, the Edo Beads, for the team’s qualification for the National Premier League after 23 years.\nShaibu, who received the team led by its coach, Victor Umoru, at the Government House in Benin City, saluted the Edo Beads for making the state proud.\nThe Deputy Governor further reassured the commitment of the state government towards the development of sports, noting that the state is determined to reclaim its lost glory in sports in the country.\nNarrating the team’s success story, the coach noted that for the past 23 years the basketball team has not been in any of the national leagues."
  },
  {
    "headline": "40-year-old man arrested for allegedly raping minor",
    "summarized_story": "ADVERTISEMENTThe police have arrested a 40-year old man, Ado Ubale, for allegedly raping an eight-year old girl in Sule-Tankarkar Local Government Area of Jigawa State.\nThe police said the suspect was arrested on July 18 following a complaint from Abdulhadi Lawan.\nThe police said the victim was taken to the Sexual Assault Referral Centre in the state capital, Dutse, for medical examination.\nFollowing the complaint, the suspect was arrested immediately and taken into custody for investigation, the police spokesperson said.\nHe added that the police commissioner ordered the Criminal Investigation Department to take over the case."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Glo extends 22X value to all prepaid customers",
    "summarized_story": "Glo has announced the extension of its 22X Value offer to its customers on the pre-paid platform.\nThe 22X Value offer which was first launched in January offered subscribers who had not used their lines for 30 consecutive days 22 times value of every voice or data recharge from N100.\nGlobacom explained that the 22X offer is meant to allow customers to satisfy their browsing and talking needs from the same recharge.\nThey will also receive a bonus value of N2,100 for data and voice calls to all networks in Nigeria.\nDepending on the recharge amount, customers can enjoy as much as 5GB of bonus data and hundreds of bonus minutes Glo said."
  },
  {
    "headline": "We’re determined to ensure food sufficiently, job creation in Ogun – Gov Abiodun",
    "summarized_story": "Olakunle IdowuOgun State governor, Prince ‘Dapo Abiodun, yesterday said his administration is determined to make sure there is food in abundance in the state while people also live without fear.\nAbiodun added that part of his government’s initiative is also to create employment opportunities for the people especially the youth.\nA beneficiary, Ogunkola Gbemisola, while commending the state governor for providing them with different anchors for their various agricultural produce, noted that the agric scheme has helped in developing their economic worth.\nThe monarch called on the party candidates not to betray the trust of the people when they eventually get into office.\nResponding, Abiodun informed Alake of his administration’s decision to regenerate the state capital."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Benin court frees Sunday Igboho’s wife, shifts his trial till Monday as Nigeria fails to file charges",
    "summarized_story": "The Cour De’appal De Cotonou, Benin Republic, has adjourned the hearing of the case of Yoruba Nation activist, Sunday Adeyemo, alias Sunday Igboho till Monday, July 26.\nThe umbrella body of the Yoruba self-determination group, Ilana Omo Oodua confirmed this in a statement on Friday.\n“That Nigeria has not been able to come up with charges that could lead the court to order lgboho’s extradition to Nigeria.\nThe court, however, ruled that Igboho be remanded in police custody till the next date of adjournment.\nThis comes as the Department of State Services declared Igboho wanted for allegedly stockpiling arms, an allegation he has denied."
  },
  {
    "headline": "Court Restrains Union From Picketing FIRS Offices",
    "summarized_story": "The National Industrial Court, Abuja Judicial Division has stopped the Nigerian Civil Service Union (NCSU) from either picketing the offices of the Federal Inland Revenue Service (FIRS) nationwide or calling for a strike at any of the service’s offices across Nigeria.\nJustice O Y Anuwe issued the order of interim injunction yesterday in a suit with the FIRS as the claimant/applicant instituted against the NCSU, the defendant/respondent.\nThe court ordered; “Respondents are restrained from picketing the offices of the applicant on 26th July 2021 or any other day pending the determination of the Motion on Notice.\nThey are also restrained from going on strike, as by so doing, the very essence of the substantive suit is defeated.\nThe FIRS took that decision for reasons outlined in an official announcement circulated to all staff."
  },
  {
    "headline": "Court Restrains Union From Picketing FIRS Offices",
    "summarized_story": "The National Industrial Court, Abuja Judicial Division has stopped the Nigerian Civil Service Union (NCSU) from either picketing the offices of the Federal Inland Revenue Service (FIRS) nationwide or calling for a strike at any of the service’s offices across Nigeria.\nJustice O Y Anuwe issued the order of interim injunction yesterday in a suit with the FIRS as the claimant/applicant instituted against the NCSU, the defendant/respondent.\nThe court ordered; “Respondents are restrained from picketing the offices of the applicant on 26th July 2021 or any other day pending the determination of the Motion on Notice.\nThey are also restrained from going on strike, as by so doing, the very essence of the substantive suit is defeated.\nThe FIRS took that decision for reasons outlined in an official announcement circulated to all staff."
  },
  {
    "headline": "Why I Dont Visit Daura Often – President Buhari",
    "summarized_story": "President Muhammadu Buhari has said he would love to visit Daura more frequently, but for the high cost of presidential movements and exposing security personnel to the weather, assuring that his heart remains with the people.\nAccording to a statement by presidential spokesman, Garba Shehu, Buhari spoke yesterday when he visited the Emir of Daura, Dr Umar Faruk Umar, at his palace.\nThe emir thanked the president for always creating time to visit his hometown and the palace despite the tight schedule.\nAt the meeting, the Emir publicly announced conferment of the title of Talban Daura on Yusuf Buhari, son of President Buhari.\nThe emir also announced creation of a district in the community of the president, with headquarters in Dimurkol."
  },
  {
    "headline": "Why I Dont Visit Daura Often – President Buhari",
    "summarized_story": "President Muhammadu Buhari has said he would love to visit Daura more frequently, but for the high cost of presidential movements and exposing security personnel to the weather, assuring that his heart remains with the people.\nAccording to a statement by presidential spokesman, Garba Shehu, Buhari spoke yesterday when he visited the Emir of Daura, Dr Umar Faruk Umar, at his palace.\nThe emir thanked the president for always creating time to visit his hometown and the palace despite the tight schedule.\nAt the meeting, the Emir publicly announced conferment of the title of Talban Daura on Yusuf Buhari, son of President Buhari.\nThe emir also announced creation of a district in the community of the president, with headquarters in Dimurkol."
  },
  {
    "headline": "Buni Commiserates With Flood Victims, Orders SEMA To Provide Assistance",
    "summarized_story": "Yobe State governor, Mai Mala Buni, has commiserated with the people of Jakusko local government area of the state over the flood that recently ravaged some communities.\nThe governor also directed the ministry of Health and the State Emergency Management Agency (SEMA) to provide emergency support in Girgir and Jakusko while investigation on the suspected case of cholera is to be conducted.\nHe also directed SEMA to provide the flood victims relief materials for their immediate needs to cushion their hardship, and compile a comprehensive report on the destruction and assistance required.\nADVERTISEMENTBuni urged the people to support the victims, saying, “We should be our brothers’ keepers and complement government’s efforts to make the victims comfortable.”The governor further directed the State Environmental Sanitation Agency to ensure that drainages and waterways are evacuated, and appealed to the affected and other communities to vacate waterways to ensure free flow of rain water."
  },
  {
    "headline": "Nollywood actor bedridden for 20 years cries for help",
    "summarized_story": "Aside from being an actor, he had his eyes fixed on a thriving music career.\nSince then, the father of one has been exposed to a flipside of life steeped in pain, loneliness and despair.\nHe was billed between N3.5m and N3.8m at a hospital in Lagos some years back but he couldn’t afford it.\nWhile narrating his plight to City Round, Kabarachi said the bill might have increased due to the country’s economic situation.\nUnfortunately, the hospital had neither the required medical personnel nor the equipment to take care of my medical needs."
  },
  {
    "headline": "Nollywood actor bedridden for 20 years cries for help",
    "summarized_story": "Aside from being an actor, he had his eyes fixed on a thriving music career.\nSince then, the father of one has been exposed to a flipside of life steeped in pain, loneliness and despair.\nHe was billed between N3.5m and N3.8m at a hospital in Lagos some years back but he couldn’t afford it.\nWhile narrating his plight to City Round, Kabarachi said the bill might have increased due to the country’s economic situation.\nUnfortunately, the hospital had neither the required medical personnel nor the equipment to take care of my medical needs."
  },
  {
    "headline": "Donda album: Kanye West, JAY-Z reunite for new song",
    "summarized_story": "Kanye West has reunited with his former collaborator JAY-Z for their first song together in more than five years.\nThe rappers previously worked together frequently, but fell out after JAY-Z and his wife Beyonce opted not to attend Kanye and Kim Kardashian’s wedding in 2014.\nBut following Kanye’s recent split from Kim, it appears they are back on good terms, and Jay appears on a tune on the rapper’s highly anticipated album Donda, which was released on Friday.\nKanye premiered the song at a listening party in Atlanta, Georgia on Thursday night, with the tune closing the event.\nDonda – named after Kanye’s late mother – also includes collaborations with Lil Baby, Lil Durk, Pusha T and Travis Scott."
  },
  {
    "headline": "Donda album: Kanye West, JAY-Z reunite for new song",
    "summarized_story": "Kanye West has reunited with his former collaborator JAY-Z for their first song together in more than five years.\nThe rappers previously worked together frequently, but fell out after JAY-Z and his wife Beyonce opted not to attend Kanye and Kim Kardashian’s wedding in 2014.\nBut following Kanye’s recent split from Kim, it appears they are back on good terms, and Jay appears on a tune on the rapper’s highly anticipated album Donda, which was released on Friday.\nKanye premiered the song at a listening party in Atlanta, Georgia on Thursday night, with the tune closing the event.\nDonda – named after Kanye’s late mother – also includes collaborations with Lil Baby, Lil Durk, Pusha T and Travis Scott."
  },
  {
    "headline": "Southwest governors working behind scene for Igboho’s release – Sanwo-Olu",
    "summarized_story": "By Kazeem UgbodagaLagos State Governor, Babajide Sanwo-Olu on Saturday said Southwest governors are working behind the scene to secure the release of Yoruba Nation agitator, Sunday Igboho.\nSanwo-Olu, who fielded questions from newsmen was asked what the Southwest governors were doing to secure the release of Igboho.\nThe governor replied that they were working behind the scene for his release.\nMeanwhile, Sanwo-Olu voted at his polling unit 019, ward 09, Ikoyi on Saturday, saying the Local Government poll in the state has been peaceful so far.\nThe governor arrived his polling unit with his wife, Ibijoke around 11:03am and voted few minutes later."
  },
  {
    "headline": "Up, Up go Nigeria’s COVID-19 cases",
    "summarized_story": "By Abujah Racheal/AbujaNigeria recorded 317 new COVID-19 cases on 23 July, from 187 cases on 22 July.\nNCDC gave the update on Saturday as COVID-19 cases rose for the ninth consecutive week.\nThe new cases were reported from 10 states and the Federal Capital Territory (FCT) of Abuja.\n“Rivers recorded 32, while Ekiti and the FCT registered five cases each.\nFriday’s report included four states with zero cases."
  },
  {
    "headline": "Buhari: I could visit Daura every 2 weeks; no one can stop me",
    "summarized_story": "Michael AdeshinaPresident Muhammadu Buhari said he would have loved to visit his hometown, Daura, every two weeks but for the high cost of presidential movements and exposing security personnel to the weather.\nBuhari stated this on Friday when he visited the Emir of Daura, Dr. Umar Faruk Umar, at his Palace.\n“We still thank God for keeping us together.\nIn his remarks, the Emir of Daura thanked the President for always creating time to visit his hometown and the palace despite the tight schedule.\n“Your visit to Daura reflects your good character which we are very proud of."
  },
  {
    "headline": "BREAKING: Bandits Sack Kaduna Police Station, Kill Officer In Attempt To Free Detainees",
    "summarized_story": "Suspected bandits attacked a police station in Kaduna State’s Marraraban — Jos area, killing one officer.\nOn Saturday, the criminals allegedly stormed the station in an attempt to free their incarcerated compatriots.\nShehu Sani, a former senator from Kaduna Central, revealed this in a message on his Twitter account.\nHe wrote, “Bandits raided a police formation in Marraraban-Jos village in the Outskirts of Kaduna in an attempt to free their detained men and they killed a police officer in Kundun-Zungeru, Niger State, the birthplace of the late President (Nnamdi) Azikiwe.\nThe bandits and the police are battling.”As of the time of filing this report, the bandits and police officers are still involved in a gun battle."
  },
  {
    "headline": "Ogun LG Polls: Residents Defy Government’s Restriction Of Movement Order [Photos]",
    "summarized_story": "The people of Ogun State are unwilling to comply with the state administration’s instruction to restrict movement in respect of today’s local government elections.\nThe Ogun State Government issued a directive on Friday prohibiting vehicular movement from 7 a.m. to 4 a.m. on Saturday, according to NEWS DIRECT.\nAs of 8 a.m., bikers and commercial drivers were observed with passengers in Abeokuta, the state capital.\nLong lines of vehicles were halted at numerous checkpoints set up by troops, police officers, and traffic enforcement officials for disobeying the sit-at-home edict.\nAccording to NEWS DIRECT, the people of Ogun will elect new chairman and councilors today, barely five years after the 2016 election."
  },
  {
    "headline": "Beninese Government Likely To Drop Charges As Sunday Igboho Seeks Asylum",
    "summarized_story": "Sunday Adeyemo, alias Sunday Igboho, a Yoruba Nation agitator, is seeking asylum in the Republic of Benin after failing to make it to Germany, according to sources.\nIgboho and his German-based wife, Ropo, were arrested at the airport on Monday around 8 p.m. as they attempted to board a flight to Germany.\nA passport was allegedly forged for Igboho in the Benin Republic for the purpose of the Germany trip.\n“Igboho has already applied for asylum in Germany and he hopes to file a similar application in Benin Republic in the coming days,” the source said.\nAccording to the source, the Beninese government may decide to withdraw the migration-related charges brought against Igboho for allegedly forging a passport."
  },
  {
    "headline": "Sunday Igboho Demands N5.5bn Damages From FG Over Invasion Of House",
    "summarized_story": "Chief Sunday Adeyemo aka Sunday Igboho, a Yoruba Nation activist, is suing the Attorney General of the Federation (AGF) and the Department of State Services (DSS) for N5 billion in damages following the invasion of his home by DSS agents in the early hours of July 1.\nIgboho, who is now detained in Benin Republic, filed the complaint on Friday through his lawyer, Chief Yomi Alliyu, at the Federal High Court in Ibadan (SAN).\nTwo of his associates were slain, and 12 others were apprehended, during the raid.\nIgboho claims that the raid of his home in Ibadan’s Soka neighborhood was deliberate and a violation of his fundamental human rights.\nHe listed the things as N2 million in cash, €1,000 in cash, travel documents, gold jewelry and wristwatches, an iPhone 12 smartphone, a Samsung smartphone, and other unidentified items."
  },
  {
    "headline": "Nigeria’s Oshonaike crashes out of 2020 Olympics, retires",
    "summarized_story": "Oshonaike who spoke immediately after the match said, “I’m going to appear in Paris 2024 but as a spectator.”Liu, 36, sealed a 4-1 win over Oshonaike, who is competing at her seventh Olympics.\nOshonaike put up a good fight in the first game going down 11-7 but was no match for her opponents in the second and third games losing 11-3 and 11-4.\nThe veteran Olympian took the fourth game 13-11, before Liu won the fifth game 11-4.\nSpeaking after her defeat, Oshonaike said: ”I just lost, I’m supposed to be kind of sad, but I’m happy that we can be here at the Olympics.\nThis is the spirit of the Games, you lose or win but we are all Olympians.”"
  },
  {
    "headline": "Breaking: Chinese wins first 2020 Tokyo Olympic gold medal",
    "summarized_story": "She had to put her own medal round her neck and sing the national anthem behind a mask, but Chinese shooter Yang Qian still celebrated winning the first gold medal of the Tokyo Olympics.\nThe morning after the delayed Games had opened with a scaled-back and sombre ceremony, Yang won the 10-metre rifle competition in front of empty stands.\nShe was handed her medal on a tray by International Olympic Committee president Thomas Bach in accordance with the Covid-19 protocols that will affect every aspect of these Games.\nRock music had been piped into the venue and only a handful of Chinese support staff were there to congratulate her on her victory after a nail-biting final in which she clinched victory with an Olympic record over Russian Anastasiia Galashina in the last round, but she savoured the moment.\n“I’m extremely proud and happy to win,” said Yang, 21."
  },
  {
    "headline": "Pictures: Concerns as Senator James Manager kneels before ex- governor James Ibori over ‘gubernatorial ambition’",
    "summarized_story": "NextPatriarchy’ll be subdued, won’t be barrier to women – Talabi Taiwo Michael"
  },
  {
    "headline": "NASS insensitive to concerned Nigerians on PIB, Electoral Act – Senator Dickson -NigPilot",
    "summarized_story": "Senator representing Bayelsa West District in the National Assembly, Seriake Dickson, has described the recently passed Petroleum Industry Bill, PIB , and the Electoral Act (Amendment) Bill, 2021 by the parliament as offensive and insensitive to concerned Nigerians.\nDickson, who addressed journalists yesterday in Abuja over the perceived shortcomings in the two bills, however, warned that the approved three percent Host Communities Trust Fund in the PIB may lead to unrest in the Niger Delta region.\n“Might and majority do not build a diversified nation like Nigeria, but presence of justice, fairness.\nHe therefore appealed to President Muhammadu Buhari not to assent to the bill, but send it back for more consultation and required Inclusiveness in its proposals.\n“Fortunately a window of striking out that amendment is already provided by the House of Representatives which adopted the clause as originally proposed."
  },
  {
    "headline": "Finally, Nigeria takes delivery of six Super Tucano aircraft -NigPilot",
    "summarized_story": "The statement added that top government functionaries and Service Chiefs received the modern platforms from the manufacturer.\nRecall that the Nigerian Air Force (NAF) on 15, July 2021, in a statement announced that the first batch of six A-29 Super Tucano aircraft departed the United States of America on Wednesday, 14 July 2021 enroute Nigeria.\nThe second batch of the remaining six aircraft brand would be delivered towards the end of the year.\nMilitary experts believe that the arrival of the six A-29 Super Tucano aircraft would change the paradigm in the war against insurgency and anti banditry operations.\n“With the delivery of the modern aircraft to government today, there is end in sight in the over one decade war against insurgency and terrorism,” they said."
  },
  {
    "headline": "Nigerian Army immortalize late COAS, Ibrahim Attahiru -NigPilot",
    "summarized_story": "The Nigerian Army on Thursday immortalized the immediate past Chief of Army Staff (COAS), late Lt Gen Ibrahim Attahiru who died in an air mishap in Kaduna.\nThe Chief of Army Staff (COAS) Lieutenant General Faruk Yahayadisclosed that the complex was christened after the late Chief of Army Staff, Lieutenant General Ibrahim Attahiru, to honor him for his contribution and sacrifice towards the upliftment of the Nigerian Army.\nThe structure, as described by the cantonment maintenance officer, Major Suleiman, has the capacity to accommodate eight staff officers and other supporting staff.\nThe new office accommodation consists of six medium size en-suite offices, two executive size en-suite offices, two Personal Assistants’ offices, as well as two offices for administrative staff.\nDignitaries present at the occasion were the Chief of Operations Army, Major General Olufemi Akinjobi, Theatre Commander OPHK, Major General Christopher Musa, Provost Marshal Army, Major General Olumuyiwa Aiyenigba, Chief of Military Intelligence (Army) Brigadier General Danladi Salihu, Acting General Officer Commanding 7 Division/Commander Sector 1 OPHK, Brigadier General Abdulwahab Eyitayo, Component Commanders OPHK and Principal Staff Officers, amongst others."
  },
  {
    "headline": "COAS presents new vehicle to Regimental Sergeant Majors -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS) Lieutenant General Faruk Yahaya has presented a new official vehicle to the Regimental Sergeant Majors (RSM) of the Nigerian Army to enhance their functionality.\nGeneral Yahaya handed over keys and official documents of a brand new Toyota Hilux to the Regimental Sergeant Major (RSM) of Headquarters 7 Division, Master Warrant Officer Mohammed Babayo, during an operational visit to the Divisions.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu in a statement saidthe move is aimed at restoring the prestige associated with the office of an RSM.\nGeneral Yahaya described RSM as the custodian of Nigerian Army customs, ethics, and traditions.\nIt will be recalled that the COAS had earlier presented two Hilux vehicles to Army Headquarters and Army Headquarters Garrison RSMs, during the Nigerian Army Day Celebration (NADCEL) 2021 in Abuja."
  },
  {
    "headline": "LIVE UPDATES: Local Government Elections Hold In Lagos, Ogun",
    "summarized_story": "Welcome to our live updates on today’s Local Government Elections In Lagos and Ogun states.\nAhead of the elections, restriction of movement was announced in both states and an additional 25,000 policemen have been deployed in Lagos State to beef up security.\nOur reporters bring updates from three senatorial districts in Lagos State – Lagos Central, Lagos East, Lagos West, and Ogun State capital city – Abeokuta.\nLawal Oladimeji, the presiding officer at the polling unit addresses the press and gives statistics of registered voters.\nLagos State Independent Electoral Commission (LASIEC) officials with ballot boxes and other election materials set up in preparation."
  },
  {
    "headline": "Lagos Local Government Elections In Photos",
    "summarized_story": "The Lagos State Local Government Elections took off on a slow start on Saturday as voters trickled in at polling centres across the state.\nAs monitored by our correspondents some officials of the Lagos State Independent Electoral Commission (LASIEC) arrived promptly in some polling units while others got to the polling centres more than one hour after the scheduled time for the election commencement.\nOne of the candidates for the position of Local Government Chairman, Agboola Odunifa (Lagos Island East) of the Peoples Democratic Party (PDP) lamented the low turnout of voters.\nMeanwhile, the state governor Babajide Sanwo-Olu and his wife cast their votes at Unit 09 Ward L2, Lateef Jakande Road, Ikoyi at 11:03 am.\nSee photos below…"
  },
  {
    "headline": "Police To Deploy Additional 25,000 Officers Ahead Of Lagos Council Polls",
    "summarized_story": "﻿An additional 25,000 policemen will be deployed to beef up security in the local government elections scheduled to hold on Saturday in Lagos State.\nThe Chairperson, Lagos State Independent Electoral Commission (LASIEC), Justice Ayo Philips, disclosed this on Channels TV’s Politics Today on Friday.\nPhilips explained that the Commissioner of Police for Lagos State gave her the assurance earlier in the day.\nOnigbanjo told the judge that the Federal High Court lacked the jurisdiction to entertain their claims.\nThe court also transferred the suit to the State High Court pursuant to Section 22 (2) Federal High Court Act."
  },
  {
    "headline": "‘Keep Your Cheque’, President Buhari Tells Businessmen To Remember The Needy",
    "summarized_story": "President Muhammadu Buhari has urged businessmen, contractors and other privileged Nigerians who are beneficiaries of government patronage to always engage in Corporate Social Responsibility, instead of seeking to favour individuals with gifts.\nSpeaking further, President Buhari noted that he would love to visit Daura more frequently, but for the high cost of presidential movements and exposing security personnel to the weather, assuring that his heart remains with the people.\nIn his remarks, the Emir of Daura thanked the President for always creating time to visit his hometown and the palace despite the tight schedule.\nAt the meeting, the Emir publicly announced the conferment of the title of Talban Daura on Yusuf Buhari, son of President Buhari.\nThe Emir also announced the creation of a District in the community of the President, with headquarters in Dumurkol."
  },
  {
    "headline": "Man Utd Manager Solskjaer ‘Delighted’ To Sign New Three-Year Deal",
    "summarized_story": "Manchester United manager Ole Gunnar Solskjaer has signed a new-three year deal, the Premier League club announced on Saturday.\nThe Norwegian, who took over from Jose Mourinho in 2018, will stay at Old Trafford until at least 2024, with the option of an extra year.\n“Everyone knows the feeling I have for this club, and I am delighted to have signed this new contract,” Solskjaer told the club website.\n“Manchester United wants to be winning the biggest and best trophies and that’s what we are all striving for.\n“I can’t wait to get out in front of a packed Old Trafford and get this campaign started.”"
  },
  {
    "headline": "Video: Sanwo-Olu votes, commends LASIEC, Lagos residents",
    "summarized_story": "Lagos State governor, Babajide Sanwo-Olu, has cast his ballot at Ward E, Polling Unit 019, Lagos Island.\nin the ongoing local government election in the state.\nAddressing journalists after casting his ballot, governor Sanwo-Olu commended the peaceful conduct of the exercise and enjoined Lagos residents to maintain the peace throughout the exercise.\nHe also commended the Lagos state Independent Electoral Commission for conducting what he described as transparent and credible."
  },
  {
    "headline": "Ogun Council Poll: Governor Abiodun votes at Polling Unit 2, Ita-Isoyin, Iperu Remo",
    "summarized_story": "Ogun state governor, Dapo Abiodun, has cast his ballot at Ward 3, Polling Unit 2, Ita-Isoyin, Iperu Remo.\nHe was accompanied by his wife and other party faithful in the state."
  },
  {
    "headline": "Live Updates: Ogun residents vote to elect Council chairmen, Councillors",
    "summarized_story": "The local government Election in Ogun State has commenced with officials of the Ogun State Independent Electoral Commission on ground in most of the polling centre visited in some parts of Ogun Central and Ogun East Senatorial Districts.\nCurrently, voters are casting their ballots at different polling units in Iperu Remo, Ogun East Senatorial District.\nAlthough, the turnout is still low, officials of the electoral body and party agents were seen at different polling units monitored so far.\nThe Governor, Dapo Abiodun is expected to join other residents to cast his ballot at ward 3, polling units 2, ita-Isoyin, Iperu Remo, Ikenne, Ogun State.\nAdvertisement=======================================================Ogun State Governor, Dapo Abiodun casts his ballot at Ward 3, Polling Unit 2, Ita-Isoyin, Iperu Remo, Ogun State"
  },
  {
    "headline": "Biden Approves $100m Emergency Funds to Resettle Afghan Refugees",
    "summarized_story": "US President Joe Biden has authorised up to $100m from an emergency fund to meet “unexpected urgent” refugee needs stemming from the situation in Afghanistan, including for Afghan special immigration visa applicants, the White House said.\nThe Biden administration is reviewing other US facilities in the US and overseas where SIV applicants and their families could be accommodated.\nSpecial immigrant visas are available to Afghans who worked as translators or in other jobs for the US government after the 2001 US-led invasion.\n“The president and the administration supports the leadership of the Afghan people, including Ashraf Ghani,” Psaki told reporters.\n“I would note that there are ongoing political negotiations and discussions that we certainly support between Afghan leaders, members of the Afghan government and the Taliban."
  },
  {
    "headline": "Jeff Bezos, Richard Branson Not Yet Astronauts, US Says",
    "summarized_story": "That means Jeff Bezos and Sir Richard Branson may not yet be astronauts in the eyes of the US government.\nTo qualify as commercial astronauts, space-goers must travel 50 miles (80km) above the Earth’s surface, which both Mr Bezos and Mr Branson accomplished.\nMr Bezos and the three other crew members who flew on Blue Origin’s spacecraft may have less claim to the coveted title.\nThe wings spotted on Mr Bezos and Sir Richard following their flights were custom-made pins by their own companies.\nHowever, a glimmer of hope remains for Sir Richard, Mr Bezos and any future stargazers hoping to be recognised as astronauts."
  },
  {
    "headline": "Family of James Brown Settles 15-year Battle Over His Estate",
    "summarized_story": "The family of entertainer James Brown has reached a settlement ending a 15-year battle over the late singer’s estate, an attorney involved in the mediation said Friday.\nDavid Black, an attorney representing Brown’s estate, confirmed to The Associated Press that the agreement was reached July 9.\nThe fight over Brown’s estate even spilled over into what to do with his body.\nBrown was eventually buried in Beech Island, South Carolina, at the home of one of his daughters.\nLast year, the South Carolina Supreme Court ruled that Hynie had not been legally married to Brown and therefore did not have a right to his multimillion-dollar estate."
  },
  {
    "headline": "Nigeria: 56 Days After, Kidnappers Hold on to 116 Tegina Pupils Despite Receiving $100,000 Ransom",
    "summarized_story": "The kidnappers had agreed to free the remaining 116 pupils if the ransom reduced from the initial N200 million to N50 million was paid.\nBut after counting the money, the abductors declared that it was N4.6 million short, and detained the conveyor of the ransom.\n“We are fed up, we are leaving everything to God” one of the parents told THISDAY on Friday.\nSome parents told THISDAY that the Niger State Government promised to help offset part of the ransom but failed to deliver.\nGovernment is not helping matters at all saying this, saying that, yet we cannot see anything on the ground.”Laleye Dipo in Minna"
  },
  {
    "headline": "Nigeria: Terrorists Burn Army Armoured Vehicle, Kill Four in Zamfara Community",
    "summarized_story": "Bandits, Friday morning, launched fresh onslaught on Dansadau community, in Maru Local Government Area of Zamfara State, killing four villagers.\nThey also kidnapped 14 others and set ablaze a military armoured personnel vehicle in the community.\nHe added that the invaders also injured seven other residents before they burnt the military armoured personnel vehicle, stating that despite the ongoing peace and reconciliation programme being run by the state government, killing and kidnapping of innocent people remained the order of the day in Zamfara.\nThe military armoured personnel vehicle while trying to fight the bandits hit a pole and the soldiers abandoned it and ran away.\nDansadau community is about 99 kilometers from Gusau the Zamfara State capital and is one of the hottest zones in terms of banditry, kidnappings, and other nefarious activities in the state."
  }
]