[
  {
    "headline": "Owo attack aims to divide Nigerians – Arewa forum",
    "summarized_story": "The Arewa Consultative Forum has condemned the terrorist attack on St. Francis Catholic Church, Owo in Ondo State, in which scores were killed while several others worshippers sustained injuries on Sunday.\nThis was contained in a statement by the Secretary-General of the ACF, Murtala Aliyu, issued in Kaduna on Wednesday.\nThe ACF described the attack as an unimaginable erosion of inhumanity enveloping the nation, and aimed at setting peace-loving people against each other.\n“The Arewa Consultative Forum will strongly appreciate all efforts be put in bringing the culprits to book.\nThe Forum shall not take any excuse for linking such dastardly act to only unknown gunmen, as we live and dine with the perpetrators in our communities."
  },
  {
    "headline": "Nigeria, 22 countries meet in Morocco over Atlantic Ocean",
    "summarized_story": "A total of 23 African countries have converged on Rabat in Morocco to chart a new course to maximise the utilisation of the Atlantic Ocean for the benefit of the continent.\nThe meeting, which is on issues bordering the Atlantic ocean, will also develop an African vision that will promote the continent’s identity and security.\nThe Atlantic is the second-largest ocean in the world, covering about 106,460,000 square kilometres.\nThe ministerial meeting would focus on political dialogue, security and safety, as well as blue economy, connectivity, environment, and energy.\nThe African Atlantic Countries are Nigeria, Morocco, Mauritania, Senegal, Gambia, Cape Verde, Guinea, Guinea Bissau, Sierra Leone, Liberia, Côte d’Ivoire, Ghana, Togo, Benin, and Cameroon."
  },
  {
    "headline": "Agric Minister discloses cocoa production to hit 500,000 tonnes by 2024",
    "summarized_story": "As Cote d’Ivoire, Ghana, Ecuador remain top 3By Gabriel Ewepu – AbujaThe Minister of Agriculture and Rural Development, Dr Mohammad Abubakar, Tuesday, disclosed Nigeria’s cocoa production to hit 500,000 metric tonnes annually in 2024.\nHowever, the Minister reiterated importance of traceability and transparency in the cocoa industry including the National Cocoa Farm Irrigation, improvement of the cocoa sector through research, input delivery, production, value addition, processing and export.\n“The two countries are benefiting while Nigerian cocoa farmers are at disadvantage of this benefit due to unregulated and liberalized cocoa industry in the country.\nEarlier, the Executive Director, ICCO, Arrion Michel, commended the Minister for his efforts to boost cocoa production.\n“Cote d’Ivoire, Ghana and Ecuador are the major producers of cocoa while Nigeria is the fourth producer of the commodity."
  },
  {
    "headline": "Court nullifies rescheduled PDP primaries in Ebonyi",
    "summarized_story": "By Peter Okutu, AbakalikiA Federal High Court sitting in Abakaliki, yesterday nullified the rescheduled Primaries of the People’s Democratic Party (PDP), Ebonyi State, which took place on 4th and 5th of June 2022.\nThe Court also restrained the party from refusing to receive and transmit the name of Mr Ifeanyi Ọdịi, who won the cancelled governorship primaries, to the Independent National Electoral Commission (INEC) as the candidate of the party for Ebonyi 2023 governorship election.\nThe Judge noted that the rescheduled primaries was held in flagrant disregard to the party’s guidelines and constitution.\nHe also averred that the rescheduled primary election flouted the Electoral Law as amended as the Independent National Electoral Commission (INEC) did not monitor the said election.\nAccording to the Judge, any other primary election organized by the Party while the Court had ordered both parties to maintain the status quo, remains null and void."
  },
  {
    "headline": "N770bn: Ekwugum blasts Omo-Agege, says allegation unfounded, shameful",
    "summarized_story": "Ekwugum who was reacting to allegations by the Deputy Senate President, Senator Ovie Omo-Agege, that the state government has received over N770 billion in the last seven years without visible developments, said the allegation was unfounded, unguarded, pitiful, premature and shameful coming from such a ranking political office holder.\n“Senator Omo-Agege needs to be reminded that it took money to get these projects done.\n“Indeed, Omo-Agege’s criticism of ‘successive administrations’ of the PDP in Delta State suggests the latter to be the case.\n“Apparently, he has forgotten that he served in various capacities under the James Ibori administration as Special Assistant, Executive Assistant, Commissioner and Secretary to the State Government.\n“Omo-Agege is best advised to concentrate on his doomed governorship ambition instead of trying to throw stones at Governor Okowa whose enviable place in history is already guaranteed.”"
  },
  {
    "headline": "APC presidential primary: Osinbajo’s campaign spokesperson congratulates Tinubu",
    "summarized_story": "The spokesman of the Yemi Osinbajo Campaign Organisation, Mr Richard Akinnola, has congratulated the former governor of Lagos State, Bola Tinubu.\nAkinnola who made the disclosure in a post on his Facebook page, said: “Congratulations, Asiwaju Tinubu, the presumed winner of the primaries.\nHowever, I’m very proud of my choice of support in the person of Prof. Yemi Osinbajo.\n“As l often say, God rules in the affairs of men and He has a purpose for what just happened.\nNo be say person die, Life goes on."
  },
  {
    "headline": "APC presidential primary: Osinbajo leaves convention venue as vote counting continues",
    "summarized_story": "Vice President, Yemi Osinbajo exchanging greetings with President Muhammadu Buhari the venue of the presidential primary of the ruling All Progressives Congress, APCVice President Yemi Osinbajo has departed the Eagles Square, the venue of the presidential primary of the ruling All Progressives Congress, APC.\nAccording to reports, Osinbajo left the event while the counting of votes by national delegates was still ongoing.\nEarlier, President Muhammadu Buhari also exited the presidential convention some minutes after he delivered his address.\nHe left with his wife, Aisha at about 1.30 a.m and was seen off by top officials, including Vice-president Yemi Osinbajo, one of the contestants in the primary.\nWhile seven aspirants stepped down for Tinubu, one stepped down for Osinbajo but Amaechi put up a strong defence of his aspiration."
  },
  {
    "headline": "Owo massacre: Set up vigilantes in your council areas to prevent attacks – Akeredolu tells LG chairmen",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, has encouraged the chairmen of the state’s 18 local government councils to establish community security guards, often known as vigilantes, in their council areas.\nAccording to the governor, the move will improve security at the grassroots level.\nThe governor also stated that the Ondo State Security Network Agency, also known as Amotekun Corps, will assist in the training of the vigilante for effective security in their domain.\nHe emphasized the importance of each local government having its own vigilante to support the Amotekun Corps and other security organizations in the state.\nThe Owo attack, he said, was a tragic incident devoid of any sense of decency and a serious assault on humanity."
  },
  {
    "headline": "ASUU strike: NLC sends message to FG, demands immediate actions",
    "summarized_story": "NLC President, Mr Ayuba Wabba, made the call in his contributions to the report of the Director-General, International Labour Organisation, during the 110th International Labour Conference in Geneva, Switzerland.\nAccording to Wabba, the NLC has written to the Federal Government on how to end the university workers’ strike.\n“We call on the government to bring this strike to an end without further delay,” he said.\nWabba said that the NLC had written to President Muhammadu Buhari on how to use a high-powered delegation to end the strike.\n“I am also aware that the Interfaith Religious Council also met with Mr President and the thinking was in the same direction."
  },
  {
    "headline": "Idoma Governor achievable – Ortom",
    "summarized_story": "Benue State Governor, Samuel Ortom has said that the prospect of an Idoma person emerging as governor of the State in the future is achievable.\nGovernor Ortom spoke on Tuesday when he received a delegation of the Benue Rebirth Movement, BRM, led by AVM Monday Morgan rtd, who paid him a solidarity visit at the Benue Peoples House, Makurdi.\nThe Governor stated that he remained committed to the unity of Benue towards upholding justice, equity and fairness for all people of the State, irrespective of their ethnic backgrounds.\nHe acknowledged that so far, BRM had achieved enlightenment in the quest for an Idoma governor but enjoined the group to employ persuasion, dialogue, negotiation and eschew militancy, intimidation, victimization or blackmail, which he noted will not build confidence.\nGovernor Ortom promised that his administration would look into the request by BRM for an amendment to the Benue Chieftaincy Laws to suit the peculiarities of the Idoma culture before the end of his tenure next year."
  },
  {
    "headline": "Zamfara: Over one million people have received COVID-19 vaccine – State govt",
    "summarized_story": "Zamfara State government has said that 1,517,119 residents of the State have received COVID-19 vaccine.\nThe Programme Manager, Zamfara State Health Care Board, Mustafa Aliyu disclosed this while presenting a paper at a one-day workshop organised by the board for newsmen in the State on Tuesday.\nHe said, “853,392 people received the first dose; 555,509 received the second dose, while 107,209 people have received the booster dose.”According to him, with this development, only 33 percent of the residents of the State have so far received the vaccine.\n“We are putting on more efforts to ensure that the 70 percent of the residents of the State receive the vaccine before the end of September this year,” he noted.\nThe program manager urged the people to ensure that they reported to any of the COVID-19 vaccine centres in the State to receive the vaccine, which he said is free."
  },
  {
    "headline": "Owo massacre: Gov. Akeredolu gives update, reveals number of victims",
    "summarized_story": "Eighty persons were affected in Sunday’s attack on St. Francis Catholic Church, Owo, Ondo State, Gov.\n“At Owo, the anger is palpable; the tension is at an abrasive level just as the urge for reprisals is high.\n“In honour of those who lost their lives to this unfortunate attack, I have already directed that all flags be flown at half-mast for seven days.\nI can assure you that security operatives have been deployed to monitor and restore normalcy to the Owo kingdom.\n“I commiserate with my people in Owo, particularly the families of those who lost their lives to this wicked attack."
  },
  {
    "headline": "BREAKING: Tinubu leads APC presidential primary by wide margin",
    "summarized_story": "Former Lagos Governor, Asiwaju Bola Ahmed Tinubu, is leading by a wide margin from results so far sorted in the ongoing All Progressives Congress (APC) Presidential Primary at the Eagles Square, Abuja.\nFrom the results so far from 17 out of 40 polling boxes, Tinubu has polled 1069 votes out of a total of 2, 203 accredited votes in the exercise.\nNone of the other contenders has close to 290 votes.\nDetails Shortly…"
  },
  {
    "headline": "Why I want to be President, by Tinubu",
    "summarized_story": "Why I want to be President, by TinubuAll Progressives Congress (APC) National Leader Asiwaju Bola Ahmed Tinubu yesterday said he wanted the party’s presidential ticket because he had what it takes to lead the nation to a brighter future.\nAddressing delegates at the APC Presidential Convention in Abuja, he said the party must come out of the convention stronger and better, poised for victory.\nTinubu said he had the experience, having led Lagos to being the fifth largest economy in Africa today.\n“I will use the experience and it will benefit all Nigerians,” Tinubu said.\nTinubu said: “My experience in office and the knowledge gained through hard work, tough trials and patient undertaking have prepared men for this hour."
  },
  {
    "headline": "Fed Govt: cocoa production to hit 500,000 tons by 2024",
    "summarized_story": "The Federal Government has unveiled plans to increase the production of cocoa from the present 340,000 tons to 500,000 tons by 2024.\nWhile explaining that Nigeria was ranked number four among cocoa producing countries in the world, Abubakar assured that the country can achieve an increase in cocoa production based on the present drive of the Federal Government and relevant stakeholders towards utilisation of improved varieties.\nHe noted that of utmost importance is traceability and transparency in the cocoa sector, national cocoa farm irrigation, improvement of the cocoa sector through research, input delivery, production, value addition, processing and export.\nThe Minister said the interactive meeting between the Nigerian delegation and Ghana cocoa board has yielded a positive result with the recent approval by the ministry to establish the National Cocoa Management Committee (NCMC).\nHe pledged that the ministry would implement the LID system in Nigeria as it strives to take cocoa production to a new height."
  },
  {
    "headline": "Nigeria’s oil revenue dips to N945b",
    "summarized_story": "Despite the steady rise in crude oil price, the country’s earnings from the commodity dropped for the fourth month.\nA breakdown of the components of oil revenue showed that no revenue accrued from crude oil and gas exports in January, the second straight month the government has earned nothing from such a major income source.\nAccording to the data, revenue from petroleum profit tax and royalties, which forms the bulk of oil revenue, declined by 31 per cent to N247 billion compared to N360 billion the previous month and was also below the monthly target of N277 billion.\nAccording to the National Operations Controller, Independent Petroleum Marketers Association of Nigeria (IPMAN), Mike Osatuyi, the dip in oil revenue does not come to him as a surprise.\nThe best solution to curbing this revenue dip in oil is to remove subsidy, but subsidy cannot be removed now when the country is hot."
  },
  {
    "headline": "I'm most qualified of all candidates, says Amaechi",
    "summarized_story": "Immediate Past Minister of Transportation Rotimi Amaechi has claimed he is the most qualified aspirant to fly the flag of the All Progressives Congress (APC) in the 2023 elections.\nI was elected Speaker of the Rivers State House of Assembly and I served for two terms.\nWhile serving as a speaker, I was the Chairman of the State Speakers of Nigeria twice.\n“Your Excellency, by your grace and the Grace of God, you appointed the Ministry for Transportation; again, I served twice.\nYour Excellency, you appointed me the Director General of your campaign, and again I served twice."
  },
  {
    "headline": "BREAKING: APC Primaries: Amaechi defeats Osinbajo",
    "summarized_story": "Former Minister of Transport and erstwhile Rivers State Governor Rotimi Amaechi has scored 316 in the just concluded APC Presidential primaries.\nAmaechi who tailed Asiwaju Bola Ahmed Tinubu, defeated the Vice President Yemi Osinbajo who came a distant third with 235 votes.\nDetails soon….\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "APC Convention: Tinubu in commanding lead",
    "summarized_story": "The leader of the All Progressives Congress and a presidential aspirant of the party, Bola Tinubu, is leading in the ongoing presidential primary of the party in Abuja.\nTinubu so far, is leading with over 890 votes, while his closest contenders, Rotimi Amaechi and Yemi Osinbajo.\nFourteen aspirants in the race are Mr Chukwuemeka Nwajuba, Pastor Tunde Bakare, Mr Ahmed Rufai, Senator Rochas Okorocha, Mr Jack Rich, Gov.\nDavid Umuahi, Asiwaju Bola Tinubu, Sen. Ahmed Yarima, Dr Ahmed Lawal, Vice-President Yemi Osinbajo, Mr Rotimi Amaechi, Gov.\nNine aspirants had earlier withdrawn from the race including Mrs Uju Kennedy-Ohnenye, Dr Felix Nicholas, former Gov."
  },
  {
    "headline": "Uzodimma laments injustice in Nigeria that denies South East the presidency",
    "summarized_story": "Imo state governor, Hope Uzodinma, has said that the south-eastern part of Nigeria was denied the opportunity to produce the next president owing to a lack of equity.\nUzodimma spoke on a Lagos based television station, Channels TV programme, saying that the south-east should produce the next president, but they will not due injustice being meted out to that part of the country.\n“In a situation where equity should be the issue we (south-east) don’t need to struggle for it.\nHe explained that, “this is what has to be discussed at the party level because it is a serious matter.\nYou cannot just wake up and take any decision, there are consequences to every action."
  },
  {
    "headline": "APC presidential primary: Osinbajo departs convention venue",
    "summarized_story": "(11.59am) The Vice President and a Presidential Aspirant of the All Progressive Congress, Yemi Osinbajo has departed the Eagles Square, the venue of the presidential primary of the ruling APC.\nAccording to reports, Osinbajo left the event while the counting of votes by national delegates was still ongoing.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it .\nDo not miss the Vital Information, it goes off in 2 days!"
  },
  {
    "headline": "Tinubu, Osinbajo, Amaechi garner votes at APC convention",
    "summarized_story": "Are you a Man 40 yrs and above?\nDo not miss the Vital Information, it goes off in 2 days!\nThe voting exercise to determine who among the aspirant will emerge the standard bearer, started at about 2.40 am and ended at 7.45 am.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "BREAKING: Tinubu set to win APC presidential primary by wide margin",
    "summarized_story": "Bola Ahmed Tinubu, former Lagos state governor, is on course to win the presidential primary of the All Progressives Congress (APC) by a wide margin.\nFollowing the completion of the vote-sorting process, he was ahead of his fellow challengers in the race by a mile.\nFrom the votes sorted, Tinubu had over 1000 votes while his closest challenger, Rotimi Amaechi, polled 316.\nThe counting of the votes is still ongoing at Eagle Square, Abuja.\nAdvertisementMore to follow…"
  },
  {
    "headline": "BREAKING: Tinubu set to win APC presidential primary by wide margin",
    "summarized_story": "Bola Ahmed Tinubu, former Lagos state governor, is on course to win the presidential primary of the All Progressives Congress (APC) by a wide margin.\nFollowing the completion of the vote-sorting process, he was ahead of his fellow challengers in the race by a mile.\nFrom the votes sorted, Tinubu had over 1000 votes while his closest challenger, Rotimi Amaechi, polled 316.\nThe counting of the votes is still ongoing at Eagle Square, Abuja.\nAdvertisementMore to follow…"
  },
  {
    "headline": "LIVE: Tinubu on course for victory at APC presidential primary",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "LIVE: Tinubu on course for victory at APC presidential primary",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "Uzodimma: South-east should produce next president -- but there's no justice",
    "summarized_story": "Hope Uzodimma, governor of Imo, says the south-east was denied the opportunity to produce the next president owing to a lack of equity.\nUzodimma spoke on Wednesday when he featured on Sunrise Daily, a Channels TV programme.\nThere has been a clamour for political parties to zone their presidential tickets to the south-east.\nSpeaking on Wednesday, Uzodimma who is the chairman of the APC special convention, said the south-east should produce the next president, but they will not because of injustice.\n“In a situation where equity should be the issue we (south-east) don’t need to struggle for it."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "iOS 16, New MacBooks, Apple Pay later and other announcements at WWDC 2022",
    "summarized_story": "With iOS 16, Apple is ending software support for the devices released before the iPhone 8 (2017), which includes the iPhone 6S, iPhone 6S Plus, iPhone SE 2016, iPhone 7, and iPhone 7 Plus.\niOS 16 allows for more Lockscreen customization such as color and font changes, as well as support for widgets.\nUsers can choose which photos to share based on a certain start date, or via share photos face detection.\nApple Pay LaterSource: AppleBuy now, pay later services have been on the rise and Apple has decided it wants a part of the $22.86 billion market.\nThe company announced Apple Pay Later, a new feature for Apple Pay to let users pay for purchases in 4 installments over time without interest or any fees."
  },
  {
    "headline": "Nine African startups joins Norrsken's accelerator",
    "summarized_story": "Nine African startups representing 8 countries have been selected to participate in the second edition of the Norrsken Impact Accelerator, a prominent early-stage accelerator.\nThe accelerator is one of the programmes of the Norrsken Foundation.\nNorrsken Foundation has been courting Africa since it announced in 2019 the launch of its entrepreneurship hub, Norrsken House, in Kigali, Rwanda.\nIn the same year, it selected 11 startups from Africa to join the inaugural edition of the Norrsken Impact Accelerator.\n“Our accelerator brings together over one hundred extraordinary individuals who channel their knowledge, experience and network to pave the way for early-stage, up-and-coming impact tech startups,” said Funda Sezgi, Norrsken Impact Accelerator managing director and co-founder."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "World Environment Day 2022: Chevron Nigeria’s Commitment to a Sustainable Future – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Every year on June 5, the world commemorates World Environment Day (“WED”) to celebrate and promote environmental awareness and sustainability across the globe.\nThe theme for this year is “Only One Earth” with focus on “Living Sustainably in Harmony with Nature.” It beams a spotlight on climate action, nature action and pollution action while encouraging everyone, everywhere to live sustainably.\n“Our Environmental philosophy and processes lay the foundation for sound environmental management.\nIn 2005, CNL began supporting a yearly postgraduate research scholarship for PhD students in environment and conservation, instituted by the NCF.\nEdu Memorial Lecture to promote environmental management awareness and partners with the Lagos State Government and NCF to sponsor an annual environmental awareness programme, tagged, Walk for Nature, an event held to create awareness and promote nature conservation and sustainable environmental management."
  },
  {
    "headline": "Edo FA Cup: Insurance FC, Feeders Land In Quarter Finals As Edo Queens Whitewash Genesis Queens – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestFootball activities resumed yesterday in the ongoing Edo FA Cup after the tragic incident on Thursday that put the Challenge cup on hold as Bendel Insurance FC and Feeders defeated their opponents to book quarter finals place in the Challenge Cup.\nTaiwo tapped in Feeders grasuate Chinedu’s fine pull out from the right flank to take the game beyond the reach of Star City .\nIn the second game,Towo Eventus’ brace (8,51) minutes and Jude Oghe’s16th goals dumped out Konstanz Dike FC from the competitionThe defending champions Insurance FC will be playing against an experienced side B.J Foundation FC in the first quarter finals game today at the School of Health Technology.\nIn the female fixtures, Edo Queens FC have booked the finals ticket in the Edo FA Cup after Whitewashing Genesis Queens FC 9-0.\nThey await the winners between Fortress Ladies and Brave Hearts Ladies in the second semifinals game."
  },
  {
    "headline": "Owo church massacre: Your govt in Abuja has failed Nigerians – EDSG chides Edo APC – Nigerian Observer",
    "summarized_story": "According to him, “Edo APC has been uncomfortably mum about the recent attack at the St. Francis Catholic Church in Owo, Ondo State, which has drawn condolences and condemnation from across the country.\n“When Governor Godwin Obaseki embarks on foreign trips to seek investment, Edo APC is quick to throw tantrums.\nBut on a very important occasion such as the Owo attack, they have failed to make a statement to commiserate with the victims.\nThis failing is what Edo APC has refused to acknowledge and draw the attention of its leaders in the executive arm of government to so as to forestall a reoccurrence.\nThe government must rise up to the occasion and take responsibility for the task of protecting the lives of Nigerians,” Osagie charged."
  },
  {
    "headline": "Obaseki extends tenure of AAU Special Intervention Team – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has approved the extension of the tenure of the 10-man Ambrose Alli University Special Intervention Team.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie, Esq., said the special team’s tenure was extended by 6 (six) months.\nOgie noted, “It is hereby announced for the information of the general public and in particular, the Ambrose Alli University Community that further to the provision of Section 2(c) of the Ambrose Alli University (Special Intervention Powers) Law 2021, the Governor, His Excellency, Mr. Godwin N. Obaseki has approved the extension of the tenure of the 10-man Ambrose Alli University Special Intervention Team by 6 (six) months.\n“Accordingly, the general public and the Staff and students of the Ambrose Alli University, Ekpoma are to note the foregoing.”The intervention team was set up by Governor Obaseki to exercise all the powers and functions of the Governing Council of the Ambrose Alli University, with a charge for them to advance the government’s vision to reposition the institution to meet global standards.\n“You are also going to develop a means of funding the university outside government resources by developing a strategy that will help reduce overdependence on government and separate politics from the university.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Owo Massacre: We’ve recorded 38 deaths so far – Church",
    "summarized_story": "The Catholic Diocese of Ondo on Tuesday said 38 persons have so far been confirmed dead in the Sunday terrorists’ attack on St. Francis Catholic Church, Owo.\n“But in the catholic hospital, which is St. Louis Hospital in Owo, and the Federal Medical Centre in Owo, we have 38 bodies.”Meanwhile, Akeredolu said no fewer than 22 people were killed in the attack.\nHe said the attack affected 80 people out of which 22 lost their lives, while 56 survivors are on admission at the Federal Medical Centre, Owo, St Louis Hospital, Owo and the Owo General Hospital as well as some other private hospitals.\n“The site, that is, St. Francis Catholic Church, Owaluwa, Owo presents a gory war-like scene.\nThe Federal Medical Centre, Owo, the St. Louis Hospital, Owo, the General Hospital, Owo as well as some private hospitals in Owo were filled with the injured, most of who were in critical conditions."
  },
  {
    "headline": "Despite Okada bans, Nigeria’s import bill on motorcycles rises 22% to N74.6bn",
    "summarized_story": "The amount spend by Nigerians on importing motorcycles rose quarter-on-quarter (QoQ) by 22 per cent to N74.6 billion in the first quarter of 2022, Q1’22, from N61.25 billion in Q4’21.\nThis is according to data from the National Bureau of statistics (NBS)However, the Q1’22 figure represented a 37 percent decline year-on-year (YoY) against the N117.65 billion recorded in Q1’21.\nThe NBS Foreign Trade in Goods Statistics report stated, “In the first quarter of 2022, manufactured goods mainly imported were ‘Safety or relief valves’ from France and China worth N70.2 billion and N3.30 billion followed by ‘Motorcycles and cycles fitted with an auxiliary motor.\nThe rise in the motorcycle import bills has been steady since last year after an unexplained decline in the second quarter of 2021.\nThis is even a number of states, including Lagos and Anambra, among others have implemented policies of commercial motorcycles operation restriction"
  },
  {
    "headline": "Experts to discuss Nigeria’s financial initiative at Oriental News Nigeria confab",
    "summarized_story": "Stakeholders in Nigeria’s financial sector would engage in a robust round table discussion on governments’ key policy around inclusive financial system that will cover all strata of the society.\nSTANMEG Communications using rigorous research tools observed huge gap in the financial services system with some members of other social strata excluded.\nSince 2005, the Nigerian financial services sector has witnessed increasing activities by both the government and the regulatory authorities aimed at deliberately promoting policies that are intended to grow financial inclusion.\nThe principle of financial inclusion has assumed greater level of importance in recent times due to its perceived importance as a driver of economic growth.\nIn other words, access to financial services, that are well suited for low-income earners promote enormous capital accumulation, credit creation and investment boom."
  },
  {
    "headline": "Muslim-Muslim ticket: Tinubu distances self from viral text message sent to delegates",
    "summarized_story": "Bola Ahmed Tinubu, former Lagos governor and presidential aspirant of the All Progressives Congress (APC), has distanced himself from a viral text message alleging that he intends to pick a fellow Muslim as his running mate if he emerges as APC’s 2023 presidential candidate.\nTinubu, who is poised for victory at the ongoing presidential primary, described the text message as a fake, stressing that it was fashioned by “undemocratic elements” whom he said are already intimidated by his “imminent victory” at the poll.\nWe enjoin the distinguished delegates to ignore this completely.\n“The fake text message is a ploy by some undemocratic elements to confuse and hoodwink delegates sensing that Asíwájú Tinubu is comfortably coasting home to victory.\n“Truth is Asíwájú is destined for victory and no one can scuttle this through their shameful tactics."
  },
  {
    "headline": "JUST IN: Tinubu takes early lead as counting begins",
    "summarized_story": "Former governor of Lagos State, Bola Ahmed Tinubu, is taking early lead as counting of votes continue at the All Progressives Congress (APC) presidential primary.\nAt the completion of sorting of votes from the first ballot box, Tinubu recorded far more votes than Rotimi Amaechi, former Rivers State governor who appears to be coming second.\nAhmad Lawan, senate president; Yemi Osibanjo, vice president; Yahaya Bello, governor of Kogi State; Ben Ayade, governor of Cross River and David Umahi, governor of also recorded votes.\nTinubu is widely projected to emerge winner, and had seven aspirants step down for him before voting began on Tuesday night.\nThose who stood down for the former Lagos governor include Ibikunle Amosun, Kayode Fayemi, Ajayi Borroffice, Dimeji Bankole, Godswill Akpabio, Abubakar Badaru and Uju Ken-Onanenye."
  },
  {
    "headline": "Attack On Owo Church Sacrilegious, Says Tambuwal",
    "summarized_story": "Governor of Sokoto State Aminu Waziri Tambuwal has described last Sunday’s attack on St Francis Catholic Church, Owo, Ondo State by suspected terrorists as sacrilegious.\nUnofficial reports put the number of people killed during the attack at 50.\nADVERTISEMENTTambuwal, in a statement he personally signed on behalf of the government and people of Sokoto State, condoled with the governor of Ondo State, Rotimi Akeredolu and condemned in strong terms, the attack on the congregation at Owo Church.\n“This is mortally unfortunate, terrifying and calls for a serious re-evaluation of the crass irresponsibility that have characterized rudderless steering of the ship of state.\n“I also pray for those who lost their lives, the wounded and hospitalized, while extending my administration and state’s condolences to the families of those who lost their lives, the Catholic Church and the good people of Ondo State,” he said."
  },
  {
    "headline": "Attack On Owo Church Sacrilegious, Says Tambuwal",
    "summarized_story": "Governor of Sokoto State Aminu Waziri Tambuwal has described last Sunday’s attack on St Francis Catholic Church, Owo, Ondo State by suspected terrorists as sacrilegious.\nUnofficial reports put the number of people killed during the attack at 50.\nADVERTISEMENTTambuwal, in a statement he personally signed on behalf of the government and people of Sokoto State, condoled with the governor of Ondo State, Rotimi Akeredolu and condemned in strong terms, the attack on the congregation at Owo Church.\n“This is mortally unfortunate, terrifying and calls for a serious re-evaluation of the crass irresponsibility that have characterized rudderless steering of the ship of state.\n“I also pray for those who lost their lives, the wounded and hospitalized, while extending my administration and state’s condolences to the families of those who lost their lives, the Catholic Church and the good people of Ondo State,” he said."
  },
  {
    "headline": "Catholic Priest Killed By Bandits, Buried Without His Corpse",
    "summarized_story": "Family, friends and church members wept profusely yesterday when the Catholic Archdiocese of Kaduna performed the funeral rites without the corpse of slain Rev Fr Joseph Bako Aketeh.\nThe cleric was kidnapped by terrorists who later killed him while in their captivity.\nADVERTISEMENTThe funeral rite was performed at St. John’s Catholic church Kudenda, Kaduna where he was kidnapped by terrorists on March 8th, 2022.\nIt would be recalled that the late Fr Bako was kidnapped at his residence at St John’s Catholic Church Kudenda where he served as a parish priest alongside his brother Sunday Bako.\nThe Catholic Archdiocese of Kaduna confirmed his death and that of his brother through its chancellor."
  },
  {
    "headline": "Catholic Priest Killed By Bandits, Buried Without His Corpse",
    "summarized_story": "Family, friends and church members wept profusely yesterday when the Catholic Archdiocese of Kaduna performed the funeral rites without the corpse of slain Rev Fr Joseph Bako Aketeh.\nThe cleric was kidnapped by terrorists who later killed him while in their captivity.\nADVERTISEMENTThe funeral rite was performed at St. John’s Catholic church Kudenda, Kaduna where he was kidnapped by terrorists on March 8th, 2022.\nIt would be recalled that the late Fr Bako was kidnapped at his residence at St John’s Catholic Church Kudenda where he served as a parish priest alongside his brother Sunday Bako.\nThe Catholic Archdiocese of Kaduna confirmed his death and that of his brother through its chancellor."
  },
  {
    "headline": "Power Shift: Why I Revolted Against Northern APC Govs – Kogi Gov",
    "summarized_story": "Kogi State governor and an aspirant for the presidential ticket of the All Progressives Congress (APC), Yahaya Bello, has said that he revolted against his counterparts in the North because they attempted to suppress the voice of the people.\nHe disclosed this to State House correspondents yesterday after meeting with President Muhammadu Buhari at the Presidential Villa.\nADVERTISEMENTBello maintained that the party could only retain power if the rules of engagement were strictly followed.\nSo that’s exactly what I revolted against and I remain the leading candidates into this general election.\nI decided to leave the meeting where such concoction was ongoing."
  },
  {
    "headline": "Breaking: Buhari, Osinbajo return to Eagle Square",
    "summarized_story": "President Muhammadu Buhari has returned to Eagle Square, venue of the All Progressives Congress (APC) Presidential primary.\nHe had earlier left the venue of the primary after delivering his speech early Wednesday.\nBefore his arrival, Vice President Yemi Osinbajo made his return to the Eagle Square to receive the president.\nOsinbajo had earlier left the venue of the event fuelling speculations that he might have been distrusted by the way the primary is going.\nAisha Buhari was also on ground at the Eagle Square."
  },
  {
    "headline": "Just In: Rochas Okorocha scores zero at APC presidential primary",
    "summarized_story": "Just In: Rochas Okorocha scores zero at APC presidential primary54 minutes ago"
  },
  {
    "headline": "#APCPrimaries: Tinubu in early lead after 19 ballot boxes sorted",
    "summarized_story": "Former Governor of Lagos State, Asiwaju Bola Ahmed Tinubu, is set to emerge the flagbearer of the All Progressives Congress (APC) in the 2023 elections.\nThough the counting of votes is still ongoing at the time of filing this report, votes so far counted show Tinubu is in a comfortable lead.\nTinubu has so far recorded over 70 per cent of votes counted.\nThe aspirants that pitched their tents with Tinubu at the convention ground include Governors Kayode Fayemi of Ekiti and Abubakar Badaru of Jigawa.\nOthers include former Minister of Niger Delta Affairs, Godswill Akpabio, Senator Ibikunle Amosun, Senator Ajayi Borroffice, ex-Speaker Dimeji Bankole and Mrs Uju Ohanenye."
  },
  {
    "headline": "APC Convention: Vice President, Osinbajo Storms Out Of Eagles Square",
    "summarized_story": "Yemi Osinbajo, Nigeria’s Vice President and a presidential aspirant in the All Progressives Congress (APC), left Eagles Square early Wednesday morning as it became increasingly evident that his goal of succeeding his boss as the country’s next president may have come to naught.\nFormer Lagos governor Bola Tinubu was among the 23 candidates for the APC presidential ticket in 2023, with Osinbajo regarded a front-runner.\nThe events in Eagles Square revealed that he may not have a chance against the guy who first propelled him to prominence by appointing him as the Attorney-General and Commissioner of Justice in Lagos State.\nFollowing the APC’s victory in 2015, Tinubu nominated him as Vice President to President Muhammadu Buhari.\nAccording to PM News, it is unclear whether the Vice President left Eagles Square early in anticipation of losing the primary election or simply to refresh himself with the potential of returning before the start of ballot sorting and release of the primary election results."
  },
  {
    "headline": "BREAKING: Voting Ends At Ruling APC Presidential Convention Amid Rigging Allegation",
    "summarized_story": "At the present All Progressives Congress special convention in Abuja, where the party’s presidential candidate for 2023 is being chosen, voting has officially ended.\nThe voting by the 2,322 delegates ended about 7.30 a.m., according to SaharaReporters.\nPresident Muhammadu Buhari left Eagle Square, the convention’s venue, around 1.20 a.m. on Wednesday, just before voting began.\nSince national chairman Abdullahi Adamu sought to force a consensus candidate on the party, the ruling party has been in disarray.\nThe three-day special national convention of the party kicked out on June 6 and will conclude today with the choosing of a presidential flag bearer."
  },
  {
    "headline": "“Amaechi Leave That Place, You’re Disturbing The Process” – APC Members Booes Ex-Minister For Alleged Rigging At Party’s Presidential Primaries",
    "summarized_story": "“Amaechi Leave That Place, You’re Disturbing The Process” – APC Members Booes Ex-Minister For Alleged Rigging At Party’s Presidential PrimariesSome Rivers State delegates have accused the All Progressives Congress (APC) presidential primary at Eagle Square Abuja of being rigged.\nThey further claimed that the delegates list had been tampered with by allowing non-delegates to vote.\nSome delegates were not on the ground, but their accreditation tags were provided to others, according to the disgruntled delegates.\nThe crisis threatened to derail the election, with security personnel and election officials scrambling to keep the situation under control.\nThe security officers had been able to calm the frazzled nerves of the unhappy delegates as of the time of writing this piece."
  },
  {
    "headline": "#Live: Watch as APC presidential primary enters day 2 (VIDEO)",
    "summarized_story": "The ruling All Progressives Congress (APC) presidential primary election delegates have cast their votes, as party faithful across borders await results.\nWatch video below.\nShare this: TwitterFacebook"
  },
  {
    "headline": "FirstMobile App: Promoting safe, convenient mobile banking experience",
    "summarized_story": "First Bank of Nigeria Limited has continued to upgrade its FirstMobile App, its industry-leading mobile banking application.\nFirstBank’s FirstMobile ApplicationFirstMobile banking App is another version of the First Bank internet banking accessible by customers with smart devices like smart phone.\nFeaturesThe bank also announced the upgrade of its mobile banking application with new and improved features to promote safe and convenient Mobile Banking experience for customers.\nGlobal recognitionFirstMobile, the First Bank mobile banking application, has retained its leading position in the industry.\nThe bank won the 2020 Best Mobile Banking App award in the Global Finance Best Digital Bank Awards 2020."
  },
  {
    "headline": "[Happening now] APC presidential primary: Uncertainty as voting ends, ballot box sorting begins",
    "summarized_story": "Voting at ongoing All Progressives Congress (APC) presidential primary has ended with electoral officials sorting ballot boxes inside Eagles Square Abuja.\nBlueprint crew covering the proceedings reports that former governor of Lagos state Asiwaju Ahmed Tinubu, Vice President Yemi Osinbajo and former Transport Minister Rotimi Amaechi were top three leading contenders as at Tuesday night and early Wednesday morning.\nDetails loading…[Live updates]Share this: TwitterFacebook"
  },
  {
    "headline": "NMGS carries out investigations into gas emission, flare at Emene Enugu",
    "summarized_story": "By Palma IleyeNigerian Mining and Geosciences Society, NMGS, has said that its team of professionals have carried out an investigation into the gas emission and flare encountered during the drilling of a water borehole at Caritas University Amorji Nike, Emene Enugu, Enugu State.\nHe pointed out that the initial speculation that the flare was methane gas from fracking of the mature and fractured Nkporo/Enugu Formation is discountenanced due to the sustained flare that has maintained its intensity for over 7 days.\n“Drilling a relief well to kill the pressure and kill the flare may not be feasible because the subsurface geology and structure of the area are not understood.\n“Professional bodies like the NMGS with highly experienced and well-trained geoscientists should be involved in efforts by agencies of government and other organizations to find solutions to this hazard and further investigate the gas resources of the area.\n“If the gas resource in the area is found to be substantial, the federal government and Enugu State Government should develop a framework to harness the gas resources to enhance industrialization and job creation for the benefit of the state and the nation,” he continued."
  },
  {
    "headline": "Nigeria spent $13m on bitumen importation in 2020- NMCO",
    "summarized_story": "By Palma IleyeDirector General Nigeria Mining Cadastral Office, NMCO, Engr Simon Obadiah Nkom has said that Nigeria spent $13 million on bitumen importaton in 2020.\n“This shows that there will be rise in the value of bitumen market by 2027 which is why Nigeria should look into bitumen exploration that will bring development to the country.\nNkom stressed that Nigeria was ranked 6th in global bitumen deposit as demand for the mineral in Nigeria is high due to high road construction.\nMeanwhile, the total value of capital importation into Nigeria in Q1 2022 stood at US$1,573.14 million from US$2,187.63 million in the preceding quarter, the National Bureau of Statistics has said.\nWhen compared to the corresponding quarter of 2021, capital importation decreased by 17.46 per cent from US$1,905.89 million."
  },
  {
    "headline": "Quality geoscience data brought more investors into the mining sector- Garba",
    "summarized_story": "By Palma IleyeDirector General, Nigerian Geological Survey Agency, NGSA, Dr Abdulrazaq Garba, has said that there has been an influx of investors because of the quality of geoscience data the agency had generated.\n“Another advantage of Nigeria lithium is hard rock lithium found and that is what investors are looking out for worldwide.\nNIMEP is a hallmark project that provides reliable geo-sciences information needed by investors to make the right mining investment decisions in Nigeria.\nGarba said that many companies both local and international investors are interested in the data set generated.\nGarba said that the government had invested funds in generating Geoscience data for those minerals to enable investors have adequate knowledge about them."
  },
  {
    "headline": "Nigeria records N1.2trn in trade surplus in Q1 2022",
    "summarized_story": "Latest data released by the National Bureau of Statistics (NBS) has shown that Nigeria recorded N1.2 trillion trade surplus in the first three months of 2022.\nThe data is contained in report by the NBS titled: ‘Foreign trade in goods statistics (Q1 2022)’.\nIn the first quarter of 2022, Nigeria’s total trade stood at N13 trillion, this was higher than the value recorded in the fourth quarter of 2021 (N11.7 trillion) and the value recorded in the corresponding period of 2021, which stood at N7.86 trillion.\n“Total Exports were N7.1 trillion of which re-exports stood at N115.80 billion, while total imports stood at N5.90 trillion,” the report reads.\nMeanwhile, most goods were exported to India (1.18 trillion), Spain (N677.69 billion), the Netherlands (N660.59 billion), Indonesia (N474.41 billion), and the United States (N372.73 billion)."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria",
    "summarized_story": "By our correspondentAn Agricultural based company operating under the aegis of Green Agriculture West Africa Limited; GAWAL has reiterated its commitment to contribute to food security in Nigeria via quality and high yielding seeds.\nHe said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tons per hectare.\nThis outstanding result has ensured that more and more people are showing interest in GAWAL R1 “Through different channels, a growing number of Nigerian farmers and organizations are reaching us to buy GAWAL R1 rice seeds.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company that not only sold seed but taught farmers advanced planting techniques for optimum yield."
  },
  {
    "headline": "LIVE: Counting Of Votes Begins In APC Presidential Primary",
    "summarized_story": "Twenty-three aspirants later appeared before the APC presidential screening committee led by the party’s former chairman, John Odigie-Oyegun.\nVIDEOS TO CATCHAPC Presidential Primary: I’m Not Surprised By Aspirants Stepping Down – Fouad OkiWhy South East Could Not Get APC Presidential Ticket – Hope UzodimmaVoting Continues As APC Delegates Elect Presidential CandidateFULL VIDEO: APC Presidential Aspirants Make Final Appeal To Delegates8:15 am: Sorting of votes has commenced7:00 am: Voting is still ongoing.\n– Bola Ahmed Tinubu addresses APC delegates.#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/C50KEHYF33 — Channels Television (@channelstv) June 7, 20228:15 pm: Things are not falling apart in APC.\nPresident Muhammadu Buhari has arrived at Eagle Square, venue of the APC presidential primary.\nExtra: More videos from TwitterPresidential aspirant Bola Ahmed Tinubu has arrived at Eagle Square, venue of the APC presidential primary."
  },
  {
    "headline": "Owo Terror Attack: 22 Dead, 56 On Hospital Admission – Akeredolu",
    "summarized_story": "Ondo State Governor, Arakunrin Oluwarotimi Akeredolu has disclosed that 80 persons were involved in last Sunday’s terror attack at St Francis Catholic Church, Owa-luwa street, Owo.\nGovernor Akeredolu said 22 people lost their lives to the horrific attack while 52 survivors are on admission at the Federal Medical Center, Owo, St Louis Hospital, Owo and the Owo General Hospital as well as some private hospitals.\n“The site, that is, St. Francis Catholic Church, Owaluwa, Owo presents a gory war-like scene.\nThe Federal Medical Centre, Owo, the St. Louis Hospital, Owo, the General Hospital, Owo as well as some private hospitals in Owo were filled with the injured, most of who were in critical conditions.\n“In the same vein, I commend the medical teams of the Federal Medical Centre, Owo, the St. Louis Hospital, Owo, the General Hospital, Owo and some private hospitals who showed love and participated in stabilising the victims in the various hospitals."
  },
  {
    "headline": "[UPDATED] Akpabio, Amosun, Fayemi, Four Others Step Down For Bola Tinubu",
    "summarized_story": "These aspirants later beckoned on their teeming supporters who stormed the venue of the APC presidential primary to vote for Tinubu when it was time for the election.\nSimilarly, six other aspirants mounted the podium to announce their withdrawal from the contest for the APC presidential ticket and subsequent support for Tinubu.\nBut I have stepped down for Bola Ahmed Tinubu.\nI am stepping down for Bola Ahmed Tinubu.\n– Kayode Fayemi#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/PcngsJQVZM — Channels Television (@channelstv) June 7, 2022Bankole Steps DownI will like to step down for Bola Ahmed Tinubu – Dimeji Bankole#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/QdPDhpE8iN — Channels Television (@channelstv) June 7, 2022Badaru Steps DownI want to reconfirm my withdrawal from this race and support our leader Bola Ahmed Tinubu – Mohammed Badaru Abubakar#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/Kte9P2iwhd — Channels Television (@channelstv) June 7, 2022Boroffice Steps DownI am stepping down for Bola Ahmed Tinubu – Ajayi Boroffice#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/WcoRifWzfl — Channels Television (@channelstv) June 7, 2022This is a developing story, please check back for the updated version…"
  },
  {
    "headline": "APC Presidential Aspirant, Nicholas Felix Steps Down For Osinbajo",
    "summarized_story": "A presidential hopeful of the All Progressives Congress (APC), Nicholas Felix, has stepped down for the Vice President, Professor Yemi Osinbajo, to emerge as the party’s candidate in the coming elections.\nFelix, a Nigerian pastor based in the United States, announced that he was withdrawing from the contest to support the Vice President’s presidential ambition on Tuesday in Abuja.\nHe was addressing a crowd of APC faithful comprising party leaders, delegates, and other supporters at the Eagle Square, the venue of the presidential convention in the nation’s capital."
  },
  {
    "headline": "Zverev Has Surgery On Torn Ankle Ligaments After French Open Fall",
    "summarized_story": "Alexander Zverev has had surgery on torn ligaments in his right ankle following his painful exit from the French Open semi-finals.\nThe US Open starts on August 29.\n“Next week I’ll reach a career-high ranking of number two in the world, but this morning I had to undergo surgery.\n“After further examination in Germany, we received confirmation that all three of the lateral ligaments in my right ankle were torn.\nHe lost the 2020 US Open final to Dominic Thiem, having led by two sets."
  },
  {
    "headline": "Delegates set to start voting in APC Presidential Primary",
    "summarized_story": "Delegates from Abia State are expected to kick Start the Voting in the Special National Convention and Presidential Primary of the All Progressives Congress at the Eagle Square in Abuja.\nThey are now expected to slug it out to determine who gets the ticket as the Presidential candidate of the ruling All Progressives Congress.\nEight aspirants had stepped down earlier at the start of the Convention urging the delegates to vote for their leader Asiwaju Bola Ahmed Tinubu while Dr Felix Nicholas stepped down for Vice President Yemi Osinbajo.\nDelegates will now choose from the remaining candidates to determine who becomes the party’s presidential flagbearer to face the formidable challenges posed by Former Vice President, Alhaji Atiku Abubakar and Former Anambra State Governor Peter Obi of the Labour Party and Dr Rabiu Musa Kwankwaso of the New Nigerian Peoples Party.\nPresident Muhammadu Buhari who is the party’s leader has since left the venue of the convention after his speech urging the delegates to vote their conscience adding that he has no anointed candidate."
  },
  {
    "headline": "APC Special Convention is Nigeria's encounter with Destiny",
    "summarized_story": "Remember, we formed this party, APC, not simply to wrest power from a wrong and failing PDP.\nWithin this context, the APC under President Muhammadu Buhari has governed with patriotic and disciplined commitment this past seven years.\nThere is a general agreement that 2023 will be an encounter with destiny, when our nation shall need a certain type of leader to realise a better Nigeria.\nThere is a general agreement that 2023 will be an encounter with destiny, when our nation shall need a certain type of leader to realise a better Nigeria.\nAs an indivisible, united country, we shall overcome the destructive forces attempting to steal our destiny."
  },
  {
    "headline": "Senators Akpabio, Amosun, Fayemi step down for Asiwaju Tinubu -",
    "summarized_story": "Senator Godswill Akpabio has stepped down from the Presidential race to back the candidacy of the National Leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu.\nFormer Ogun State Governor, Senator Ibikunle Amosun has also followed suit.\nOthers are Former Zamfara State Governor, Ahmad Sanni Yerima, Mr Jack Rich, Dr Jack Nicholas, Former Ogun State Governor, Senator Ibikunle Amosun, Ekiti State Governor Kayode Fayemi, Kogi State Governor, Yahaya Bello, Cross River State Governor Ben Ayade, Former Speaker of the House of Representatives, Dimeji Bankole, Jigawa State Governor, Mohammad Badaru, Former Akwa Ibom State Governor, Obong Godswill Akpabio and Senator Robbert Ajayi Borrofice and Others.\nFor his part, the National Secretary of the All Progressives Congress, Senator Iyiola Omisore, said the party is well positioned for all round success.\nHe added that with over 45 Millionm members the All Progressives Congress has ensured inclusivenes in Politics for a majority of Nigerians."
  },
  {
    "headline": "IGP Establishes Electoral Offences Desks Across Nigeria -",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba, psc(+), has approved the establishment of Electoral Offences Desk at the Force Criminal Investigations Department (FCID), Force Headquarters, Abuja, and across Nigeria with the Commissioner of Police, FCID, as the Desk Officer.\nThe IGP has equally approved its establishment at State Commands across the nation with the Assistant Commissioners of Police in charge of the Criminal Investigation Departments as State Desk Officers.\nThe mandate of the Electoral Offences Desk Officers includes the collation and investigation of all electoral offences/complaints from members of the public or any quarters, with a view to determining culpability in line with the amended Electoral Act 2022, and …proffering charges before Courts of competent jurisdiction for necessary legal action.\nThe IGP tasked the Desk to commence its activities immediately with some isolated cases recorded during the pre-election activities such as screening, conventions, primaries, etc.\nThe Inspector-General of Police, IGP Usman Alkali Baba has ordered the immediate transfer of the case to the Electoral Offences Desk at the Force Criminal Investigation Department (FCID) and the immediate arrest of the concerned aspirant for necessary investigative actions."
  },
  {
    "headline": "After Fayemi, Akpabio, Amosun, 4 Others Step Down, Tinubu Projected to Win APC Presidential Ticket – Arise News",
    "summarized_story": "According to exit polls, Tinubu is likely to win most votes in the North-west, South-west, some North-central and doing well in other places.\nHis words: ”As we go into the presidential primary, I urge all to keep to the same spirit.\nTo ensure a hitch-free presidential primary, please, let us work collectively in the interest of our great party and our great country,” he said.\nPeter said, “Although the TCA is not biased towards any presidential aspirant contesting to be the presidential flag bearer of the All Progressives Congress (APC).\nWe, however, owe it to the party and party members to guide them in terms of direction ahead of the National Convention."
  },
  {
    "headline": "Nigeria, Others Losing $95bn in Productivity Due to Unsafe Food Intake",
    "summarized_story": "“Unsafe food hinders development especially on low and middle Income economies which lose around $95 billion in productivity associated with illness, disability and premature death suffered by workers,” he said.\nSpeaking on the diseases resulting from in-take of contaminated food, Ehanire said over 200 diseases were caused by unsafe food consumption.\n“Unsafe food causes one in every six deaths from diarrhea, a major killer of children of the age group,” he said.\nHe said the World Food Safety Day provided an opportunity to raise awareness about the dangers of unsafe food, government, producers, handlers and consumers having a role to play in making food safe.\nShe added that they should support policy measures and legal frameworks to strengthen the national food safety system and ensure it complies with food safety standards and regulations."
  },
  {
    "headline": "UN Secretary-General Calls on Nigerian Government to Bring Perpetrators of Owo Attack to Justice",
    "summarized_story": "The Secretary-General of the United Nations, António Guterres has condemned Sunday attack of St. Francis Catholic Church in Owo, Ondo State where over 50 persons were reported to have been killed, calling on the Nigerian government to bring the perpetrators to justice.\nA statement by his spokesperson, Stéphane Dujarric read that the Secretary General condemned the heinous attack.\nDujarric said the Secretary-General emphasized that attacks on places of worship are abhorrent, while urgingthe Nigerian authorities to spare no effort in bringing the perpetrators to justice.\nAccording to her, the Secretary-General extended his heartfelt condolences to the families of the victims and wishes a speedy recovery to the injured, and also expressed his sympathies to, and solidarity with, the Government and people of Nigeria."
  },
  {
    "headline": "APC Presidential Ticket: Fayemi, Amosun, Akpabio Step Down for Bola Tinubu",
    "summarized_story": "Governors’ Chairman and Ekiti State Governor Kayode Fayemi, former Governor of Ogun State Senator Ibikunle Amosun, and former Governor of Akwa Ibom, Senator Godswill Akpabio have all stepped down their ambition for former Lagos State Governor, Asiwaju Bola Tinubu.\nThey all urged their supporters to vote for Tinubu ahead of delegates voting.\nDetails Later."
  },
  {
    "headline": "Olu Falae: I’m Not Interested in Amendments, Nigeria Needs a New Constitution",
    "summarized_story": "Elder Statesman, Olu Falae, says the constitution governing the laws in Nigeria remains a challenge for Nigerians.\nAdding that for Nigeria to move beyond basic hindrances the constitution should be changed."
  }
]