[
  {
    "headline": "BREAKING: Buhari signs Petroleum Industry Bill into law",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has signed the Petroleum Industry Bill 2021 into law.\nDetails later…"
  },
  {
    "headline": "HURIWA to FG: Declare bandits as terrorists, leave IPOB, Yoruba Nation",
    "summarized_story": "Civil rights advocacy group, Human Rights Writers Association of Nigeria, has asked the Federal Government to declare as terrorists, bandits downing Nigerian Air Force jets, killing and maiming citizens all over the country.\nNational Coordinator of HURIWA, Emmanuel Onwubiko, and the group’s Media Affairs Director, Zainab Yusuf, made this known in a statement on Sunday, titled, ‘HURIWA Cautions AGF On Yoruba Nation/IPOB’.\nThe group was reacting to a statement by the AGF Office that the government might proscribe Yoruba Nation group just like it outlawed the Indigenous People of Biafra in 2017.\nReacting, HURIWA said it was unjust that the government proscribed IPOB and might outlaw Yoruba Nation separatist group but failed to declare bandits ravaging parts of the country as terrorists.\nof “being so sectional” and “carpeted the Federal Government for failing to declare as terrorists, the armed militia in the forests of Zamfara State who shot down a military jet belonging to the Nigerian Air Force.”"
  },
  {
    "headline": "You’re pillar of unity, Abubakar greets Babangida at 80",
    "summarized_story": "Were those innocent travellers you butchered part of those that killed your Christian brothers and kinsmen at the said earlier date?\nI have condemned the targeting and mass murder of Christians by Muslims consistently over the years and I have expressed outrage about this every time it happens.\nAm I supposed to keep quiet and relish it when it happens the other way around and when Christians murder Muslims simply because I am a Christian?\n“You can’t deny IBB the credit for his sincere efforts to build a viable federation founded on equitable representation,’’ Abubakar said.\nHe described IBB as a man of vast knowledge, wisdom, a wealth of experience and a broad outlook on life."
  },
  {
    "headline": "BREAKING: Buhari signs PIB into law",
    "summarized_story": "By Johnbosco Agbakwuru, ABUJAPRESIDENT Muhammadu Buhari, on Monday, signed the Petroleum Industry Bill, PIB, 2021 into law.\nSpecial Adviser to the President on Media and Publicity, Chief Femi Adesina, disclosed this in a statement he issued in Abuja.\n“The ceremonial part of the new legislation will be done on Wednesday, after the days of mandatory isolation would have been fulfilled.”The Petroleum Industry Act provides a legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nRecall that the Senate had passed the Bill on July 15, while the House of Representatives did the same on July 16,.\nThe National Assembly’s signing ended a long wait since early 2000s."
  },
  {
    "headline": "Gunmen abduct 18 students, staff, kill 3 in Zamfara school",
    "summarized_story": "The Management of Zamafara School of Agriculture and Animal Science, Bakura, has confirmed the kidnap of 15 students of the school and four staff by gunmen.\nMalam Atiku Aliyu, the Deputy Registrar of the school, who confirmed the attack to the Newsmen on Monday, said the incident occurred on Sunday.\nHe said the gunmen killed three others, a policeman and two security guards during the attack.\nAliyu said that they stormed the school at about 10:00 p.m., shot the policeman and the two security guards dead, before moving into the hostel and staff quarters to abduct the victims.\nThe deputy registrar appealed to the security agencies to come to the aid of the school."
  },
  {
    "headline": "Calm down, security has improved in Borno – Coordinator tell Corps members",
    "summarized_story": "Mr. Nura Umar, State Coordinator of the National Youth Service Corps (NYSC) in Borno, has called on corps members to remain calm as security had improved in the state.\n“The prevailing security challenge in Borno informed the establishment of the temporary camp here in Katsina State.\n“We are in active collaboration with all the security agencies to safeguard the lives and property of corps members,’’ he assured.\nThe state coordinator also urged the Corps members to shun drug abuse and other vices, and also be good ambassadors of their families.\nUmar said the corps members would be posted to infrastructure, education, health and agriculture sectors for their primary assignments."
  },
  {
    "headline": "Calm down, security has improved in Borno – Coordinator tell Corps members",
    "summarized_story": "Mr Nura Umar, State Coordinator of the National Youth Service Corps (NYSC) in Borno, has called on corps members to remain calm as security had improved in the state.\n“The prevailing security challenge in Borno informed the establishment of the temporary camp here in Katsina State.\n“We are in active collaboration with all the security agencies to safeguard the lives and property of corps members,’’ he assured.\nThe state coordinator also urged the Corps members to shun drug abuse and other vices, and also be good ambassadors of their families.\nUmar said the corps members would be posted to infrastructure, education, health and agriculture sectors for their primary assignments."
  },
  {
    "headline": "Cote d’Ivoire declares first Ebola outbreak since 1994",
    "summarized_story": "Cote d’Ivoire’s Health Ministry has announced the first case of Ebola since 1994.\nThe individual had travelled to Cote d’Ivoire by road and reached Abidjan on 12 August.\nThe Ebola crisis in Guinea was declared over on 19 June 2021 after four months and there is no indication that the current case in Cote d’Ivoire is linked.\n“Much of the world’s expertise in tackling Ebola is here on the continent and Cote d’Ivoire can tap into this experience and bring the response to full speed,” he said.\nAt least 5,000 Ebola vaccines which the WHO helped secure to fight the outbreak in Guinea are being transferred to Cote d’Ivoire, following an agreement between the neighbours."
  },
  {
    "headline": "BREAKING: Buhari signs Petroleum Industry Bill into law",
    "summarized_story": "President Muhammadu Buhari on Monday signed the Petroleum Industry Bill 2021 into law.\nThis was confirmed in a statement signed by Femi Adesina, Special Adviser on Media and Publicity to the President, and sent to DAILY POST.\nBuhari is presently on five days quarantine as required by the Presidential Steering Committee on COVID-19 after returning from London on Friday August 13.\nPart of the statement read: “The Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\n“The Senate passed the Bill on July 15, 2021, while the House of Representatives did the same on July 16, thus ending a long wait since early 2000s, and notching another high for the Buhari administration.”Why Buhari can’t seek medical attention in Nigeria – Femi Adesina"
  },
  {
    "headline": "Employment: Itsekiri graduates give Chevron 28 days ultimatum",
    "summarized_story": "The National Association of Itsekiri Graduates, NAIG, has issued a 28-day ultimatum to Chevron Nigeria Limited to commence or put to action the reclassification of Itsekiri Graduates of VTP5/OTP2 and VTP6.\nNAIG President and Secretary, Ben Eyitemi Eburajolo and Esiategiwa Mino, handed down the ultimatum at a press briefing held at its secretariat in Warri, Delta State.\nNAIG threatened to shut down Chevron’s operations in Itsekiriland if it fails to comply with the ultimatum.\n“Resume Operations and Maintenance(O&M) training with employment in view immediately as enshrined in our Memorandum of Understanding(MoU) with you.\nHence, the reason they left their high paying jobs to pass through the O/M training at Ogere amongst others.”Itsekiri group threatens to shut down oil installations in Niger Delta, issues FG 14 days ultimatum"
  },
  {
    "headline": "WAEC: Students in S/East may miss English, Maths exams over IPOB’s sit-at-home – Bamgbose",
    "summarized_story": "The dates fall on a Monday and given the sit-at-home protest students in the South East region may not be able to sit for the examination.\nIt should be recalled that the sit-at-home started on 9th August, and students from the South East missed the examination for Mathematics.\n“The Nnamdi Kanu I know won’t have supported such an idea that would jeopardize the educational progress of hundreds of thousands of students in the South East, this will be counterproductive.\nThe other aspect of it is that this protest might stall the early release of Nnamdi Kanu from detention.\n“There is no justification whatsoever to continue the sit-at-home protest to the detriment of our students who may eventually be deprived of gaining admission to tertiary institutions."
  },
  {
    "headline": "Zamfara college confirms attack, says two abducted employees, student escaped",
    "summarized_story": "The management of the College of Agriculture and Animal Science, Bakura, Zamfara State, has confirmed the attack which led to the death of some security officers, and abduction of students.\nThe Deputy Provost of the College, Ali Atiku, while speaking to newsmen on Monday revealed that two members of staff and one student have escaped from the kidnappers’ den.\nAtiku also confirmed that two security watchmen attached to the school were murdered during the attack.\nHe said, “Two staff and one student escaped from the bandits after they kidnapped them and returned to the school early this morning.\nHe said the command would issue a statement on details of the attack later."
  },
  {
    "headline": "Tony Salam concedes WBA title fight defeat to Perez",
    "summarized_story": "NIGERIAN boxer Tony “Sugar” Salam has rated Cuba’s Mike Perez as a better fighter during their vacant WBA Inter-continental Cruiserweight title fight at the Hotel Atlantis The Palm, Dubai, United Arab Emirates on Friday night.\nThe Nation reports the 35-year-old Perez scored a third-round technical knockout over the gritty Nigerian challenger and captured the pioneer organisation’s regional belt with a resounding and convincing performance.\nI learned a lot from the fight.\nADVERTISEMENT“I’m sorry that I let my family, fan across the world, friends and Nigerian as whole down,” Salam posted on his Facebook page.\n“Top respect to Mike Perez."
  },
  {
    "headline": "BREAKING: Body of Ebonyi APC youth leader, two others pulled from mining pit",
    "summarized_story": "The body of All Progressive Congress (APC) Ebonyi chapter youth leader, Ogochukwu Elem has been pulled from a mining pit in the State.\nThe bodies of two others with him when his car plunged into the pit on Saturday were also pulled out.\nThey were pulled from the pit with a crane supplied by the Ministry of Infrastructure and local divers on Monday.\nThe Volkswagen Golf car, which the victims were driving in, was also pulled from the pit.\nThe visibly angry Governor condemned the activities of miners who dig the morning pits indiscriminately thereby endangering lives and destroying the environment."
  },
  {
    "headline": "Akeredolu, Akure women mourn late Rep Omolafe",
    "summarized_story": "Women in Akure kingdom on Monday stormed the streets of Akure to mourn the sudden death of Hon.\nPeretei said late Omolafe was a constant political star since he served as Executive Chairman, Akure South Local Government Area in 2004.\nAccording to him: “The Peoples Democratic Party, Ondo State Chapter is pained.\nSenator Akinyelure said late Omolafe has touched people’s lives through his philanthropic gesture.\nLate Omolafe was a former taxi driver who rose to be elected to the National Assembly."
  },
  {
    "headline": "BBNaija Shine Ya Eye: What Arin, Princess earned",
    "summarized_story": "Evicted housemates, Arin and Princess, earned from sponsored tasks before they exited the show.\nPrincess won N500,000 as a member of Team Guinness Gold in the Black Shines Brightest task.\nHowever, Arin left the house without winning a sponsored task.\nAll her winnings were few remunerations paid to them in Abeg Nairas.\nArin’s best friend, Peace, seems to be on a winning streak as she has won the Head Of House game, and sponsored tasks culminating at N750,000 as of day 24"
  },
  {
    "headline": "Chaos as thousands flee Afghanistan after Taliban takeover",
    "summarized_story": "KABUL, Afghanistan (AP) — Thousands of people packed into the Afghan capital’s airport on Monday, rushing the tarmac and pushing onto planes in desperate attempts to flee the country after the Taliban overthrew the Western-backed government.\nU.S. troops fired warning shots as they struggled to manage the chaotic evacuation.\nIn the capital, a tense calm set in, with most people hiding in their homes as the Taliban deployed fighters at major intersections.\nMany fear chaos, after the Taliban freed thousands of prisoners and the police simply melted away, or a return to the kind of brutal rule the Taliban imposed when it was last in power.\nVideos circulating on social media showed hundreds of people running across the tarmac as U.S. soldiers fired warning shots in the air."
  },
  {
    "headline": "Suspended sit-at-home: Normal life returns in Enugu",
    "summarized_story": "Geoffrey Anyanwu, EnuguNormal life has returned to Enugu following the suspension of the every Monday sit-at-home order by the Indigenous People of Biafra (IPOB).\nBut with IPOB’s later decision to listen to voices of reasoning and suspension of the sit-at-home, normal life returnedthis morning in Enugu as people are going about their work and businesses including students.\nUnlike last Monday, shops, markets, fuel stations, banks, departmental shops are all opened now in Enugu, with commercial vehicle operators taken over the roads as usual.\nA shop owner along Chime Avenue, New Haven, Tony said, “I thank God that the IPOB changed their mind.\nWe are worried how we will again close shop today, but thank God , people are coming out gradually.”"
  },
  {
    "headline": "Catholic bishops brand Nigeria world’s most terrorised nation",
    "summarized_story": "The clerics blamed Nigerian leaders and northern governors for not doing enough to stem the spate of attacks and killings of innocent persons.\n“Except for the civil war, our nation has never witnessed the kind of wide spread macabre, evil, wanton destruction and murderous blood-letting.\nLife has never been so cheap, nor has Nigeria ever been at the stage we are in now.\nDeaths in the hands of kidnappers, killer herdsmen, bandit, terrorist groups have made Nigeria the most terrorised country in the world.\n“We have declared a week of prayer and fasting for peace in our land from August 15 to 22, 2021."
  },
  {
    "headline": "Otedola: How IBB asked Jonathan to sit on Yar’Adua’s chair",
    "summarized_story": "Writing on the need for entrepreneurs to engage with political authorities in one of the chapters, Otedola maintains that such a relationship will benefit the country.\n“With Jonathan now legally empowered to act as president, there remained the critical optics: would he stand-in for the president confidently and authoritatively?\n“As Jonathan entered the council chamber, he made to sit on the chair of the vice president, his usual seat.\nAs the protocol officer pulled out the chair, Jonathan marched towards the seat reserved for the president.\nIn the book, Otedola said entrepreneurs must engage with political authorities because it is only when there is peace that the economy can boom."
  },
  {
    "headline": "NDLEA nabs Italy-bound woman with 100 wraps of heroin at Lagos airport",
    "summarized_story": "In the same vein, on Thursday, August 12, 2021, operatives of the MMIA Command of the Agency intercepted a United Kingdom bound consignment of illicit drugs at the NAHCO export shed of the airport.\nFurther investigation reveals the consignment contains 66.600kg of cannabis sativa; 1.600kg heroin and 1.450kg of Cocaine with a combined weight of 69.65kilograms, all concealed inside cosmetics.\nWhen the export package was opened and examined, 2.3kg of cocaine and 23.5kg of compressed cannabis were discovered inside.\nRecovered from the vehicle include six parcels of skunk weighing 3.6kg; 30 pinches of Crack Cocaine weighing 87grams and six sachets of Arizona weighing 265grams.\nMeanwhile, on Friday, August 13, Benue State command of the agency arrested an interstate trafficker, Eze Victor Ezenwanne at Apir- Aliade road, Makurdi with 65.436kilograms of diazepam tablets."
  },
  {
    "headline": "EXCLUSIVE: Buhari Under Pressure To Remove Governor Buni As APC Party Chairman Amid Multi-billion Naira Asset Declaration Scandal",
    "summarized_story": "President Muhammadu Buhari is under intense pressure to remove the Governor of Yobe state, Mai Mala Buni as the Chairnan of the All Progressives Congress (APC) Caretaker and Extraordinary Convention Planning Committee (CECPC), SaharaReporters has gathered.\nA Presidential source told SaharaReporters that pressure is being mounted on Buhari to call for the Yobe state governor's removal as the party’s chairman.\nThis comes amid spirited efforts by Buni and his supporters to cover up a multi-billion naira asset declaration scandal he is involved in.\nSee Also Exclusive EXCLUSIVE: National Chairman Of Buhari's APC Party, Governor Buni In Multi-billion Naira Asset Declaration ScandalSaharaReporters gathered that Buni, who was the National Secretary of the APC until his election as Yobe state governor in 2019, was involved in anticipatory declaration, a criminal offence under the Code of Conduct Bureau (CCB) law.\nA source at the CCB told SaharaReporters that investigation of the governor’s anticipatory declaration has gone far at the agency."
  },
  {
    "headline": "EXCLUSIVE: Buhari Under Pressure To Remove Governor Buni As APC Party Chairman Amid Multi-billion Naira Asset Declaration Scandal",
    "summarized_story": "President Muhammadu Buhari is under intense pressure to remove the Governor of Yobe state, Mai Mala Buni as the Chairnan of the All Progressives Congress (APC) Caretaker and Extraordinary Convention Planning Committee (CECPC), SaharaReporters has gathered.\nA Presidential source told SaharaReporters that pressure is being mounted on Buhari to call for the Yobe state governor's removal as the party’s chairman.\nThis comes amid spirited efforts by Buni and his supporters to cover up a multi-billion naira asset declaration scandal he is involved in.\nSee Also Exclusive EXCLUSIVE: National Chairman Of Buhari's APC Party, Governor Buni In Multi-billion Naira Asset Declaration ScandalSaharaReporters gathered that Buni, who was the National Secretary of the APC until his election as Yobe state governor in 2019, was involved in anticipatory declaration, a criminal offence under the Code of Conduct Bureau (CCB) law.\nA source at the CCB told SaharaReporters that investigation of the governor’s anticipatory declaration has gone far at the agency."
  },
  {
    "headline": "BREAKING: Bandits Abduct Many Students In Zamfara, Kill Policeman, Three Others",
    "summarized_story": "Gunmen suspected to be bandits have abducted many students and teachers of the College of Agriculture in the Bakura Local Government Area of Zamfara state.\nNiger, Katsina, Zamfara, Sokoto and many other states in North-west and North-central Nigeria are bedevilled by bandits attacks.\nThe bandits kill and kidnap at will despite the large deployment of police officers and soldiers to the affected states.\nThe latest incident comes a few weeks after bandits abducted students of Bethel Baptist High School in Damishi, Chikun Local Government Area of Kaduna state.\nIn February 2021, gunmen struck the Government Secondary School in Kagara, Niger State, abducting school pupils, teachers, and workers."
  },
  {
    "headline": "BREAKING: Bandits Abduct Many Students In Zamfara, Kill Policeman, Three Others",
    "summarized_story": "Gunmen suspected to be bandits have abducted many students and teachers of the College of Agriculture in the Bakura Local Government Area of Zamfara state.\nNiger, Katsina, Zamfara, Sokoto and many other states in North-west and North-central Nigeria are bedevilled by bandits attacks.\nThe bandits kill and kidnap at will despite the large deployment of police officers and soldiers to the affected states.\nThe latest incident comes a few weeks after bandits abducted students of Bethel Baptist High School in Damishi, Chikun Local Government Area of Kaduna state.\nIn February 2021, gunmen struck the Government Secondary School in Kagara, Niger State, abducting school pupils, teachers, and workers."
  },
  {
    "headline": "UK-based Nigerian Businessman Accuses Police Of Frustrating Probe Of Brother-In-Law Over Death Of Sister",
    "summarized_story": "A United Kingdom-based Nigerian businessman, Romeo Ozoagu, has accused his brother in-law, Ignatius Okonkwo of killing his sister, Eucharia Okonkwo (the accused person's wife).\nRomeo claimed that without proper investigation, the police freed Ignatius after arresting and detaining him over the death of his wife.\nHe also expressed dissatisfaction with the manner by which the police handled the investigation into the death of the deceased.\nI immediately called my younger brother, Hillary Ozoagu, and cousin, Ezenwa, to visit my sister’s house to verify the information, because I was still in shock.\nHe stated, “The FESTAC Divisional Polive Officer arranged for some policemen to go to Ignatius’ house and get him arrested."
  },
  {
    "headline": "Afghanistan crisis: Five killed at Kabul airport amid chaos",
    "summarized_story": "Five people were killed in a chaos at Kabul airport on Monday as hundreds of people tried to forcibly board evacuation flights meant for embassy staff.\nAdvertisementTaliban fighters on Sunday, invaded the outskirts of Kabul, demanding transfer of power.\nIn the ensuing chaos, thousands of Afghans headed for the airport in the hope of catching a flight out of the country.\nIn 2001, US-led forces removed the Taliban from power, but the group has returned, asking to take over the central government.\nAdvertisementThe Taliban have, however, reportedly insisted that their fighters would not enter people’s homes or interfere with businesses."
  },
  {
    "headline": "Afghanistan crisis: Five killed at Kabul airport amid chaos",
    "summarized_story": "Five people were killed in a chaos at Kabul airport on Monday as hundreds of people tried to forcibly board evacuation flights meant for embassy staff.\nAdvertisementTaliban fighters on Sunday, invaded the outskirts of Kabul, demanding transfer of power.\nIn the ensuing chaos, thousands of Afghans headed for the airport in the hope of catching a flight out of the country.\nIn 2001, US-led forces removed the Taliban from power, but the group has returned, asking to take over the central government.\nAdvertisementThe Taliban have, however, reportedly insisted that their fighters would not enter people’s homes or interfere with businesses."
  },
  {
    "headline": "Buhari signs Petroleum Industry Bill into law",
    "summarized_story": "President Muhammadu Buhari has signed the Petroleum Industry Bill (PIB) 2021 into law.\nAdvertisementIn statement issued by Femi Adesina, presidential spokesman, Buhari assented to the bill on Monday in his determination to fulfill his constitutional duty.\nIn 2018, after the national assembly passed a harmonised version of the bill — the petroleum industry governance bill (PIGB), President Muhammadu Buhari refused assent due to “legal and constitutional reasons”.\nAdvertisementThe Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nOn July 1, the senate and the house of representatives had recommended 3% and 5% percent respectively to host communities."
  },
  {
    "headline": "Buhari signs Petroleum Industry Bill into law",
    "summarized_story": "President Muhammadu Buhari has signed the Petroleum Industry Bill (PIB) 2021 into law.\nAdvertisementIn statement issued by Femi Adesina, presidential spokesman, Buhari assented to the bill on Monday in his determination to fulfill his constitutional duty.\nIn 2018, after the national assembly passed a harmonised version of the bill — the petroleum industry governance bill (PIGB), President Muhammadu Buhari refused assent due to “legal and constitutional reasons”.\nAdvertisementThe Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nOn July 1, the senate and the house of representatives had recommended 3% and 5% percent respectively to host communities."
  },
  {
    "headline": "PHOTOS: Streets deserted in Imo despite cancellation of sit-at-home order by IPOB",
    "summarized_story": "Major parts of Owerri, the capital of Imo state, were deserted on Monday morning despite the cancellation of the sit-at-home order by the proscribed Indigenous People of Biafra (IPOB).\nAdvertisementCommercial activities are grounded out of fear of the unknown.\nBelow are pictures."
  },
  {
    "headline": "Rebecca Enonchong released in Cameroon after arbitrary detention",
    "summarized_story": "On Friday, charges against Cameroonian tech entrepreneur Rebecca Enonchong were dropped, after she had been illegally detained for three days by the government.\nAll charges dropped!” Enonchong said on Twitter.\nOutside of the tech and business world, Enonchong is known to be an advocate for progressive policies and better governance in Cameroon, which has often involved criticising the oppressive administration of Paul Biya.\nSuch claims are hard to prove but the unlawful detention is certainly a reminder of an enduring habit of arbitrary arrests and detentions in the West-Central African country.\nEnonchong has been released but thousands of others suspected of opposing President Biya haven’t been so “lucky”."
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, What we’re discussing today: Yemi Keri and more women becoming angel investorsFundraising in Africa so..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Nigerians’ persistent pension withdrawal mirrors rising unemployment",
    "summarized_story": "The trend of Nigerians increasingly tapping their pensions prematurely is yet another indication of the unemployment crisis in a country with the second-highest jobless rate globally.\nNearly 50 percent of the total pension contributed by Nigerians in the last five years was withdrawn in the same period.\nThe spike in pension withdrawals is coming at a time when the country’s unemployment rate jumped to a 13-year high in 2020.\nUnemployment in Africa’s most populous nation rose to its highest in over a decade and the world’s second-highest in 2020.\nThis mirrors the fragile state of Nigeria’s economic progressEconomic growth in Africa’s top crude producing nation averaged 1.2 percent between 2015 and 2019."
  },
  {
    "headline": "Knotty pipelines cost oil companies $325m in 1 month",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) and its other major partners lost over $325 million in the month of June to a combination of power failure, industrial strike actions and production shut-in due to repairs at various crude oil terminals scattered across Nigeria.\nIn Africa’s biggest oil-producing country, NNPC runs a network of over 5,000km…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "After two months, FG finds it can’t do without Twitter",
    "summarized_story": "After two months, FG finds it can’t do without TwitterAfter two months of revenue losses to business owners and de-branding the corporate image of the country, the Nigerian government says it is ready to lift the ban it had placed on Twitter.\nThe ban would be lifted in a matter of days given that the microblogging firm and the government have reached some critical…"
  },
  {
    "headline": "Obaseki assures of sustained investment in state’s security architecture …pledges improved security across Edo communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has reassured residents that his government will sustain investment in the state’s security architecture to ensure the protection of lives and property of citizens.\nObaseki gave the assurance when he received executive members of Esan Okpa Initiative, who were on a courtesy visit at the Government House, Benin City.\nAccording to him, “We are working to ensure that we improve the security situation in the State.\nWe will follow the world’s best practices in ensuring the school becomes world-class.\nMathew Egbodon said the group, an umbrella body for Esan people worldwide, is ready to collaborate with the government on issues concerning the Esan people."
  },
  {
    "headline": "Obaseki tasks youths on innovative use of tech to address food challenges – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged young people to join the global effort in exploiting technological innovations to build enduring systems to tackle food challenges so as to feed the world’s growing population in the wake of the coronavirus (COVID-19) pandemic.\nThe governor said this in commemoration of the International Youth Day marked by the United Nations and its sister organisations.\n“Through the Edo State Skills Development Agency (EdoJobs), we organise trainings for Edo youths on in-demand technology-oriented skills especially to encourage them to provide solutions to the global demand for healthy foods,” Obaseki said.\nHe noted that the state government will sustain the execution of other youth-focused training, as Edo State transits to become the technology hub of South-south Nigeria.\nIt also aims to promote ways to engage them in becoming more actively involved in making positive contributions to their communities.”..."
  },
  {
    "headline": "NNL Rescheduled week 24: Insurance Thrash Crown FC 4-0,Shaibu hails team’s home win record – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBendel Insurance Football Club of Benin, weekend thrashed Crown FC of Ogbomosho 4-0 in the Nigeria National League (NNL) week 24 rescheduled match to maintain hundred percent home win record.\nOn resumption, Insurance looked unsatisfied with the 2-0 lead,as they continued to fight for more until Bright Osah tried a long range shot that Crown FC Goalkeeper could not stop to increase the tally.\nThe Benin Arsenal have two away games remaining,J.Atete FC and Joy Cometh of Lagos.\nWe have shown good example of sportsmanship; how football game should be.\nIt is on record that each time we finished playing in Benin, players of both teams hug each other and excange pleasantries."
  },
  {
    "headline": "Group hails Obaseki for infrastructural devt in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A group of professionals under the aegis of Obaseki/Shaibu Support Group, Rivers State, has applauded Governor Godwin Obaseki of Edo State for prioritising investment in infrastructural development.\nUsen listed some of the projects to include the Gelegele River Port Construction, Edo Production Centre, Ossiomo Power Plant, Reactivation of the Rubber Plant in Urhoghide and the Edo Industrial Park, among others.\n“We see the work of his Excellency as building a great foundation for industrial and economic growth of Edo State.\nThis is excellent and much of the benefits may not be seen within the lifetime of this administration.”On his part, Governor Obaseki, who was represented by the Chief of Staff to the Governor, Hon.\nOsaigbovo Iyoha, hailed the group for the support, noting, “We thank your group for the support and showing leadership when it was needed; we will continue to support the group."
  },
  {
    "headline": "Plateau Killings: 33 victims rescued as IGP deploys intervention team",
    "summarized_story": "ADVERTISEMENTThe Inspector-General of Police, Usman Alkali, has deployed officers from the Police Intervention Team to Plateau State for an on-the-spot assessment following the killings in Rukuba Community in Jos North Local Government Area of the state.\nThe team, led by a deputy inspector-general, Sanusi Lemu, was also asked to ensure enhanced, coordinated response to protecting the community and boost public confidence in the affected area of the state.\n“Also deployed are investigators and covert operatives from the Force Criminal Investigations Department (FCID) and the Force Intelligence Bureau (FIB).\n“The operatives are expected to provide additional investigative, intelligence and forensic support to the Plateau State Police Command in the ongoing investigations and rescue operations.\n“Meanwhile, the IGP noted that twenty (20) suspects have been arrested in connection with the attack while thirty-three (33) victims have been rescued."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigeria only witnessed this spate of bloodletting during the civil war – Catholic Bishops",
    "summarized_story": "The bishops a statement jointly signed by the Archbishop of Kaduna and Chairman of the Ecclesiastical Province, Most Rev.\nJohn Namaza Niyiring, Bishop of Kano who’s Secretary of the Province, noted that except during the civil war, Nigeria had never witnessed the kind of widespread macabre and destruction and bloodletting going on in the land.\nThe men of God stated the statement titled, ‘Our hope does not disappoint us,’ released in Kaduna on Sunday.\nAccording to the Bishops, life has never been so cheap, nor has Nigeria ever been at the stage Nigerians found themselves at the moment.\n“We are now one of the most dangerous place to be born into, the least peaceful countries in the world."
  },
  {
    "headline": "Economic activities crippled in Nigeria’s Southeast as residents shun streets for fear of IPOB",
    "summarized_story": "Economic activities have again been disrupted in some major cities of Nigeria’s Southeast as residents stay indoors for fear of possible attacks following an already suspended sit-at-home order issued by the Indigenous People of Biafra (IPOB).\nReacting, the group’s media and publicity secretary, Emma Powerful, had explained that the suspension was a directive from the leader, Kanu.\nHe said the group had taken into cognizance the concerns expressed by Biafrans all over the world over the suspension of the sit-at-home directive.\n“There is no gainsaying the fact that one of the major fundamental guiding principles of IPOB is command and control.\n“In accordance with the directive from our leader, our sit-at-home will in the meantime be observed on the date of our leader’s court appearances.”"
  },
  {
    "headline": "Secondus: North, South fight for presidency",
    "summarized_story": "As the North strategizes to secure presidency come 2023, political expediencies demand that sacking Uche Secondus from being chairman of the People’s Democratic Party may not be in its best interest, since replacing him with a Northerner means automatic ticket for the South to produce the president.\nHowever, some Northern leaders are saying the idea of Southern presidency is good for the unity of the country.\nHe disclosed that he is of the view that the presidency should go to the south in the year 2023 because the unity of our country is very important.\nZulum disclosed that he is of the view that the presidency should go to the south in the year 2023 because the unity of our country is very important.\n“The south has ruled for 13 years and the north has ruled for 11 years under the nascent democracy from 1999 to 2023."
  },
  {
    "headline": "Nigeria’s rising debt worries World Bank",
    "summarized_story": "This is even as the World Bank insists that Nigeria’s debt burden is becoming dangerous for her continued economic sustainability.\nAccording to the report, Nigeria is ranked fifth on the list with $11.7bn IDA debt stock, while India led the list with $22bn IDA debt stock, followed by Bangladesh with $18.1bn IDA debt stock, Pakistan with $16.4bn IDA debt stock, and Vietnam with $14.1bn IDA debt stock.\nEthiopia with $11.2bn IDA debt stock, Kenya with $10.2bn IDA debt stock, Tanzania with $8.3bn IDA debt stock, Ghana with $5.6bn IDA debt stock, and Uganda with $4.4bn IDA debt stock were other countries on the list, according to the financial statement by the International Development Association (IDA), and which is part of the World Bank’s FY21 audited financial statements.\nHe projected that going by current trends, before the end of 2021 the country’s debt stock would rise to $40billion.\n“You look at the World Bank economic quality indicators and you will be shocked at what you are seeing."
  },
  {
    "headline": "Buhari Greets IBB At 80, Says We’ve Mutual Hope In Strong, United Nigeria",
    "summarized_story": "President Muhammadu Buhari has sent birthday greetings to former Military President, Ibrahim Babangida, wishing him a “long and healthy life” as he marks his 80th birthday.\nPresident Buhari in a statement by presidential spokesman, Garba Shehu, noted that as former military commanders during the war, both retiring as Generals, they have mutual interests, great hopes and expectations in a strong and united Nigeria.\nPresident Buhari expressed hope that privileged Nigerians like ex-President Babangida and others like himself will recommit to ongoing efforts to help the nation to reach more glory, progress, and prosperity."
  },
  {
    "headline": "Buhari Greets IBB At 80, Says We’ve Mutual Hope In Strong, United Nigeria",
    "summarized_story": "President Muhammadu Buhari has sent birthday greetings to former Military President, Ibrahim Babangida, wishing him a “long and healthy life” as he marks his 80th birthday.\nPresident Buhari in a statement by presidential spokesman, Garba Shehu, noted that as former military commanders during the war, both retiring as Generals, they have mutual interests, great hopes and expectations in a strong and united Nigeria.\nPresident Buhari expressed hope that privileged Nigerians like ex-President Babangida and others like himself will recommit to ongoing efforts to help the nation to reach more glory, progress, and prosperity."
  },
  {
    "headline": "Nigeria Records 541 New COVID-19 Cases",
    "summarized_story": "Nigeria has registered 541 new cases of coronavirus (COVID-19) as active cases continue to soar in the West African country.\nThe Nigeria Centre for Disease Control (NCDC), which made this known via its verified website on Monday morning, said the additional infections, though declined from the 655 recorded on Saturday, raised the cumulative cases to 182,503.\nThe centre said that the number of known active cases was now 13,152, an increase from 12,917 reported on Saturday.\nADVERTISEMENTThe public health agency, however, did not state the percentage of COVID-19 variants in the newly recorded infections.\nThe NCDC said that a multi-sectoral national Emergency Operations Centre (EOC), activated at Level 2, continued to coordinate the national response activities."
  },
  {
    "headline": "Nigeria Records 541 New COVID-19 Cases",
    "summarized_story": "Nigeria has registered 541 new cases of coronavirus (COVID-19) as active cases continue to soar in the West African country.\nThe Nigeria Centre for Disease Control (NCDC), which made this known via its verified website on Monday morning, said the additional infections, though declined from the 655 recorded on Saturday, raised the cumulative cases to 182,503.\nThe centre said that the number of known active cases was now 13,152, an increase from 12,917 reported on Saturday.\nADVERTISEMENTThe public health agency, however, did not state the percentage of COVID-19 variants in the newly recorded infections.\nThe NCDC said that a multi-sectoral national Emergency Operations Centre (EOC), activated at Level 2, continued to coordinate the national response activities."
  },
  {
    "headline": "BREAKING: Ondo House Of Reps Member, Adedayo Omolafe, Is Dead",
    "summarized_story": "A Member of the House of Representatives representing Akure North/South federal constituency of Ondo State, Hon.\nAdedayo Omolafe, is dead.\nOmolafe, popularly known as ‘Expensive’ was formerly a chairman of Akure South local government area of the State.\nLEADERSHIP gathered that the deceased lawmaker, a member of the Peoples Democratic Party (PDP), died around 2am on Monday morning as confirmed by one of his close allies, who did not want his name mentioned.\nADVERTISEMENTDetails Later…"
  },
  {
    "headline": "COVID-19 killed 38 in one week – NCDC",
    "summarized_story": "The latest epidemiological report of the Nigeria Centre for Disease Control (NCDC) has shown that 38 persons died of COVID-19 in one week.\nRecoveries improved by 248 per cent in the week under review, the report said.\nAlso, COVID-19 testing dropped drastically in some states: Kebbi (two), Bauchi (seven), Niger (17), Jigawa (29), Kogi (31), Ebonyi (40), Osun (69), and Abia (84).\nOn what it was doing to curb the community transmission of the COVID-19 pandemic, the NCDC said: “In the last two weeks, there has been a steady increase in the number of new COVID-19 cases reported.\nThe management of COVID-19 cases is based on factors, such as age and pre-existing conditions, to reduce the risk of severe illness and/or long-term effects of the disease."
  },
  {
    "headline": "COVID-19 killed 38 in one week – NCDC",
    "summarized_story": "The latest epidemiological report of the Nigeria Centre for Disease Control (NCDC) has shown that 38 persons died of COVID-19 in one week.\nRecoveries improved by 248 per cent in the week under review, the report said.\nAlso, COVID-19 testing dropped drastically in some states: Kebbi (two), Bauchi (seven), Niger (17), Jigawa (29), Kogi (31), Ebonyi (40), Osun (69), and Abia (84).\nOn what it was doing to curb the community transmission of the COVID-19 pandemic, the NCDC said: “In the last two weeks, there has been a steady increase in the number of new COVID-19 cases reported.\nThe management of COVID-19 cases is based on factors, such as age and pre-existing conditions, to reduce the risk of severe illness and/or long-term effects of the disease."
  },
  {
    "headline": "How Nigeria recorded 111 kidnapping cases in eight months",
    "summarized_story": "How Nigeria recorded 111 kidnapping cases in eight monthsHow Nigeria recorded 111 kidnapping cases in eight monthsSince April 2014 after the Boko Haram terrorists abducted 276 schoolgirls from their dormitories in Chibok, Borno State, mass kidnapping for ransom has gradually, become the other of the day in Nigeria.\nFindings by Sunday Vanguard show that the country has witnessed staggering 111 kidnapping incidents in the last eight months, that is, from January to mid-August, 2021.\nFebruary 10: Unidentified gunmen kidnap seven travellers on Benin-Warri Highway at Sapele Oghara axisFebruary 13: The traditional ruler of Uruagu, Nnewi, Anambra State abducted.\nFebruary 25: No fewer than 317 students of Government Girls Science Secondary School, Jangebe, Talata Mafara LGA, Zamfara State, abducted by bandits.\n56 kidnapped in Niger State."
  },
  {
    "headline": "How Nigeria recorded 111 kidnapping cases in eight months",
    "summarized_story": "How Nigeria recorded 111 kidnapping cases in eight monthsHow Nigeria recorded 111 kidnapping cases in eight monthsSince April 2014 after the Boko Haram terrorists abducted 276 schoolgirls from their dormitories in Chibok, Borno State, mass kidnapping for ransom has gradually, become the other of the day in Nigeria.\nFindings by Sunday Vanguard show that the country has witnessed staggering 111 kidnapping incidents in the last eight months, that is, from January to mid-August, 2021.\nFebruary 10: Unidentified gunmen kidnap seven travellers on Benin-Warri Highway at Sapele Oghara axisFebruary 13: The traditional ruler of Uruagu, Nnewi, Anambra State abducted.\nFebruary 25: No fewer than 317 students of Government Girls Science Secondary School, Jangebe, Talata Mafara LGA, Zamfara State, abducted by bandits.\n56 kidnapped in Niger State."
  },
  {
    "headline": "'Cattle boy' Hichilema trounces Zambia's President Lungu",
    "summarized_story": "Esau Chulu, electoral commission chairman said at Lusaka’s result centre: “I therefore declare that Hichilema to be president of Zambia”.\nHichilema, who clinched victory in his sixth attempt, said he would address the media at 12 noon, Zambia’s time.\nThis is the third time that power has shifted peacefully from a ruling party to the opposition since Zambia’s independence from Britain in 1964.\nHichilema, 59, a former CEO at an accounting firm before entering politics, now faces the task of reviving Zambia’s fortunes.\nHichilema is no stranger to controversy in the copper-rich nation, having run afoul of the authorities numerous times."
  },
  {
    "headline": "Buhari sends loaded birthday message to Babangida",
    "summarized_story": "By AbankulaPresident Muhammadu Buhari has sent a somewhat loaded birthday greetings to former President Ibrahim Babangida, who famously toppled him in August 1985.\nFor one, it was one of the shortest birthday felicitations from Buhari to any living Nigerian.\nBuhari described Babangida and himself as privileged Nigerians and hoped Babangida will recommit to ongoing efforts to help the nation to reach more glory, progress, and prosperity.\nThe message did not even give a scant mention to Babangida’s achievements while in office for eight years.\nIndeed, one of the misdeeds of Babangida while in office, the annulment of the 1993 June 12 election was corrected by Buhari in 2018."
  },
  {
    "headline": "Streets deserted in Imo despite cancellation of sit-at-home order by IPOB",
    "summarized_story": "Major parts of Owerri, the capital of Imo state, were deserted on Monday morning despite the cancellation of the sit-at-home order by the proscribed Indigenous People of Biafra (IPOB).\nRecall that the pro-Biafra group had earlier announced that every Monday, the entire Southeast and some parts of Southsouth would be on a lockdown, as part of measures to force the Federal Government to release Kanu unconditionally.\nLast Monday’s sit-at-home received condemnation in several quarters, especially as it affected students writing their National Examination Council (NECO) Mathematics examination."
  },
  {
    "headline": "Despite Suspension Of Sit-At-Home Order, Awka, Onitsha Residents Fail To Resume Businesses",
    "summarized_story": "Residents of Awka and Onitsha are still hesitant to venture out, despite the Indigenous People of Biafra (IPOB) directive suspending the ‘every Monday’ sit-at-home protest proclaimed in solidarity with Nnamdi Kanu.\nAs of 8 a.m. on Monday, calls to Onitsha residents revealed that the streets were still deserted.\nMr Theophilus Omaka, a dealer in Onitsha’s major market, told DAILY POST that only a few traders had arrived at the market as of 8 a.m.\n“But today, it is already 8am, and the markets are already open, but only a few traders have arrived.\nA trader at Aroma, popularly known as Oga Boss, who traders in phone parts said: “I didn’t plan to go out today because of the sit-at-home."
  },
  {
    "headline": "BREAKING: Two Kidnapped Zamfara College Staff, Student Escape",
    "summarized_story": "Two staff members and one student from Zamfara College of Agriculture and Animal Science Bakura had managed to flee and return to the college.\nThis was revealed by Ali Atiku, the College’s Deputy Provost, during a press conference on Monday.\nHe said, “Two staff and one student escaped from the bandits after they kidnapped them and returned to the school early this morning.\n“As I am talking to you now, we have formally discovered that the bandits have kidnapped 15 students all of them male, three women and one person who are also our staff and killed two of our security watchmen.”As of the time of reporting this story, the State Police command had yet to comment on the matter.\nAlhaji Habibu Mainasara, the College’s Provost, was once kidnapped by bandits and released after paying a ransom."
  },
  {
    "headline": "BREAKING: Bandits Attack Zamfara College, Kidnap 15 Students, 4 Staff, Kill Security Officers, Others",
    "summarized_story": "A group of bandits raided the College of Agriculture and Animals Health Bakura in Zamfara State, kidnapping 15 students and four staff members while killing one police officer and two security officers.\nAliyu Atiku, the college’s Deputy Registrar, reported the occurrence to journalists over the phone.\nAccording to him, the Bandits stormed the school’s main campus around 10:00 p.m. on Sunday and remained there for about an hour and a half.\nHe claimed that after the Bandits kidnapped two staff members and one student, they escaped and returned to the school early this morning.\n“As I am talking to you now, we have formally discovered that the bandits kidnapped 15 students all of them male, three women and one person who are also our staff and killed two of our security watchmen, one police office,” he said."
  },
  {
    "headline": "Breaking: Another nollywood star is dead",
    "summarized_story": "The Chairman of the Actors Guild of Nigeria, Lagos State Chapter, Emeka Rising Ibe, on Monday confirmed the death of its members Doris Chima.\nChima was said to have suffered breast cancer in past years.\nIbe who expressed sadness over her death said the deceased was a dedicated member and a good woman.\nAnother popular nollywood actress Rachel Oniga had died few days ago.\nDetails loading…"
  },
  {
    "headline": "Breaking: Again, bandits invade Zamfara college, kidnap 15 students, 4 staff, kill cop, others",
    "summarized_story": "Palpable tension gripped College of Agriculture and Animals Health Bakura in Zamfara State as a group of Bandits stormed the institution, kidnapped 15 students, four staff, killed one police officer and two security men.\nThe Deputy Registrar of the college, Aliyu Atiku, confirmed the incident to Journalists via telephone conversation.\nAccording to him, the Bandits stormed the main campus of the school around 10:00 pm on Sunday and spent about one and a half hours operating in the school.\nHe said, two staff and one student escaped from the Bandits after they kidnapped them and returned to the school early this morning.\n“As I am talking to you now, we have formally discovered that the bandits kidnapped 15 students all of them male, three women and one person who are also our staff and killed two of our security watchmen, one police office,” he said."
  },
  {
    "headline": "Breaking: Another popular federal lawmaker is dead",
    "summarized_story": "A serving member of the House of Representatives Adebayo Isaac Omolafe has ‘suddenly’ passed on.\nOmolafe popularly known as Expensive represents Akure north and south federal constituency.\nHe reportedly died early Monday morning, according to a close family source who said the legislator didn’t show sign of sickness before he slept last night.\nThe ninth National Assembly has recorded a number of deaths since 2019 after its inauguration.\nDetails loading…"
  },
  {
    "headline": "Crumbling terrorists’ dynasty and role of air power -NigPilot",
    "summarized_story": "It was a Russian-American aviation pioneer, inventor, and influential advocate of strategic airpower, Alexander Nikolaievich Prokofiev de Seversky who posited that “Only air power can defeat airpower.\nThe actual elimination or even stalemating of an attacking Air Force can be achieved only by a superior Air Force”.\nHere, NAF aircraft prevented the troop’s location from being overrun and inflicted heavy casualties on the ISWAP forces leading to their eventual withdraw.\nThe air operations destroyed three (3) gun trucks, neutralized many terrorists, and prevented our troop’s location from being overrun.\nThe successes recorded by NAF’s air component also extended to Operation HADARIN DAJI (OPHD) in the Northwest as well."
  },
  {
    "headline": "Akpabio commissions Corps Members’ lodge in Rivers -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio, has commissioned and handed over the newly completed Corps’ Members’ Lodge and Viewing Centre constructed by the ministry in Koroma Tai Community, Tai Local Government Area of Rivers State.\nIn a statement made available by Mrs. Deworitshe Patricia, Director of Press and Public Relations in the ministry, Akpabio while handing over the project, urged the Koroma Tai Community to be dedicated to the protection and maintenance of the property to complement government efforts.\nHe informed that the Niger Delta region should expect more intervention projects as soon as the 2022 appropriation bill is passed.\nWe have noted and learned many lessons from the development of this project and will factor this into future projects”.\nChairman of Tai LGA, Friday Mbakpone reacting, noted that corps members play important roles in the community, school and offices, just as he commended the Niger Delta ministry for providing comfort to the youth."
  },
  {
    "headline": "Aggrieved APC Members Join YPP in Kwara -NigPilot",
    "summarized_story": "Group of People who had initially denounced their membership from the All Progressives Congress (APC) Kwara state chapter has officially joined the Young Progressives Party (YPP) in the state.\nThe group disclosed this while addressing Journalists at the YPP party secretariat in Ilorin, Kwara state capital said the group picked YPP ahead of other parties due to outstanding attributes the party posses.\nAddressing Journalists, the coordinator of the group, Hon.\nStating the reason why the group settled for YPP, AbdulFatah said “we have reached out to the existing registered political parties in Nigeria.\nIt is evident that they have seen the light ahead and have decided to join the true progressives party to fix Nigeria and Kwara State in particular” he said"
  },
  {
    "headline": "Lack of resources, bane of energy efficiency in West Africa – Hon. Tunis – NigPilot",
    "summarized_story": "The Community Parliament of the Economic Community of West African States (ECOWAS) has said that lack of resources and ignorance is the bane of energy efficiency in West Africa.\nThe Speaker of ECOWAS Parliament Rt.\n“Even more important was the disclosure of the opportunities that energy efficiency provides and how investments in energy provide relatively quick returns with a high degree of certainty”.\nWhile noting that improving energy efficiency is about dollars and cents, the Speaker said that its impact on society is far-reaching.\nHe explained that the Parliament is inclined to emphasize that private sector engagement is fundamental to the community goal of achieving energy efficiency."
  },
  {
    "headline": "Nigeria Kicks Off Phase Two Of Covid Vaccination",
    "summarized_story": "The Federal Government on Monday commenced the administration of new vaccines marking the start of the second phase of the COVID-19 vaccination programme.\nThe second phase of the vaccination programme was breathed into life after the US donated over four million doses of the Moderna vaccine.\nThe single-shot J&J vaccine was acquired through the African Vaccine Acquisition Trust (AVAT), with support from Afrexim bank.\nMore of the J&J vaccines are expected in the country soon.\nAccording to Health Minister, Osagie Ehanire, Nigeria has procured nearly 40 million doses of the J&J vaccines through AVAT."
  },
  {
    "headline": "Gunmen Abduct Students In Zamfara College, Kill Security Personnel",
    "summarized_story": "Gunmen suspected to be armed bandits have abducted students from the College of Agriculture and Animal Science in Bakura Local Government Area of Zamfara State.\nThe armed men also killed a security personnel.\nDuring the attack, the gunmen killed two watchmen.\nREAD ALSO: Gunmen Kill Former Councillor In ZamfaraThis is not the first time that the school is being attacked by bandits.\nIn July, the Provost of the school, Mr. Habibu Mainasara was kidnapped from his official residence in the institution."
  },
  {
    "headline": "Panic In Kabul As Taliban Takes Control Of Afghanistan",
    "summarized_story": "But the United States ultimately failed to build a democratic government capable of withstanding the Taliban, despite spending billions of dollars and providing two decades of military support.\nAfter police and other government forces gave up their posts in Kabul on Sunday, Taliban fighters took over checkpoints across the city and entered the presidential palace.\nMuska Dastageer, a lecturer at the American University of Afghanistan, which opened five years after the Taliban were ousted, said Kabul residents felt “frightened and helpless”.\nBut Washington was left shocked by the rapid collapse of the Afghan government, and critics have said the United States’ reputation as a global power has been badly tarnished.\n“America’s credibility as an ally is diminished,” said Husain Haqqani, Pakistan’s former ambassador to the United States."
  },
  {
    "headline": "How IBB Asked Jonathan To Sit On Yar’Adua’s Chair – Otedola",
    "summarized_story": "Billionaire businessman Femi Otedola has joined Nigerians in felicitating with former military President, General Ibrahim Babangida, who marks his 80th birthday on Tuesday, August 17.\nGo and sit on that chair!’“He looked at me for some time and responded that he would think about it.\n“A week later, on Tuesday, February 9, the National Assembly adopted the famous ‘Doctrine of Necessity’ to make Dr Jonathan the Acting President pending the return of President Yar’Adua from his medical leave.\nAs Dr Jonathan entered the council chamber, he was made to sit on the chair of the Vice President—his usual seat.\n“As the protocol officer pulled out the VP’s chair, Dr Jonathan marched towards the seat reserved for the President."
  },
  {
    "headline": "JUST IN: President Buhari Signs Petroleum Industry Bill Into Law",
    "summarized_story": "President Muhammadu Buhari has signed the Petroleum Industry Bill 2021 into law.\nThis is according to a statement signed by presidential spokesperson Femi Adesina.\nAccording to the statement, President Buhari signed the bill into law while in quarantine, after his arrival from the United Kingdom.\nThe Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nThe Senate had passed the bill on July 15 and the House of Representatives followed suit0 on July 16, thus ending a long wait since the early 2000s."
  },
  {
    "headline": "BREAKING: President Buhari signs Petroleum Industry Bill into law",
    "summarized_story": "President Muhammadu Buhari has signed the Petroleum Industry Bill into law.\nThis is coming few weeks after the bill was passed by the national Assembly.\nDetails shortly."
  },
  {
    "headline": "ASUU threatens strike if FG fails to sign draft renegotiated agreement",
    "summarized_story": "The Academic Union of Universities has hinted of the possibility of another industrial action by the end of this month should the federal government fail to sign draft renegotiated agreement of May, 2021.\nThe union at its national executive council meeting in Ilorin, the Kwara state capital, says government should be held responsible for the possible industrial disharmony.\nASUU national president, Professor Victor Emmanuel says the union hopes the government will urgently sign the agreement to sustain and improve on the current industrial peace on the university campuses."
  },
  {
    "headline": "National Under 12/15 handball tourney: Team Sokoto wins three out of four trophies",
    "summarized_story": "Team Sokoto won three of the four trophies at the recently concluded National U-12/U-15 Boys and Girls Handball Championship, which was held at Sokoto’s Giginya Memorial Stadium.\nThe squad won the Boys and Girls U-15 trophies, as well as the Girls U-12 trophies, but lost in the Boys U-12 final to KADA Stars from Kaduna.\nSimilarly, in the earlier final match, the Sokoto U-15 girls overcame their opponent from Abia state 19-13.\nPlateau state’s U-12 and U-15 girls won fair play teams in both categories, while Kaduna’s U-15 boys earned fair play in the U-15 boys category.\nWinnersUnder 12 Boys CategoryKaduna 1stSokoto 2ndFCT 3rdAdvertisementUnder 12 Girls categorySokoto 1stGboko 2ndPlateau 3rdUnder 15 Girls CategorySokoto 1stAbia 2ndKaduna 3rdUnder 15 Boys CategorySokoto 1stKebbi 2ndAdamawa 3rd*FINALS RESULTSU-12 BOYSSokoto 23Kaduna 24AdvertisementU-15 GIRLSAbia 14Sokoto 19U-15 BOYSKebbi 14Sokoto 343RD PLACEU-12 BOYSFCT 24Kano 8U-15 GIRLSKaduna 21FCT 17AdvertisementU-15 BOYSAdamawa 28Kaduna 24"
  },
  {
    "headline": "President Buhari Signs Petroleum Industry Bill Into Law",
    "summarized_story": "Nigeria’s President Muhammadu Buhari on Monday signed the Petroleum Industry Bill 2021 into law.\nPresidential aide Femi Adesina in a statement said President Buhari who is working from home assented to the Bill on Monday, August 16, in his determination to fulfil his constitutional duty.\nThe Nigerian leader is complying with a mandatory five days quarantine as required by the Presidential Steering Committee on COVID-19 after returning from London on Friday, August 13.\nMr Adesina in the statement said “the ceremonial part of the new legislation will be done on Wednesday, after the days of mandatory isolation would have been fulfilled.\n“The Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters."
  },
  {
    "headline": "Federer’s Return to Court Uncertain as He Needs Third Knee Surgery, to Be Out For ‘Many Months’",
    "summarized_story": "He returned to Grand Slam action at the French Open in late May and then pulled out of the tournament after three victories.\nThe US Open is the season’s last Grand Slam tournament, and it begins Aug. 30 in New York.\nFederer won 16 of his Grand Slam titles between 2003 and 2010 but remained at or near the top of the sport into his late 30s.\nHe won the Australian Open and Wimbledon during a resurgent 2017 and defended his title at Melbourne Park in 2018, his most recent Grand Slam championship.\nFederer’s spot in the US Open main draw will go to Tallon Griekspoor of the Netherlands, the U.S. Tennis Association said."
  },
  {
    "headline": "Otedola: How IBB Asked Jonathan to Sit on Yar’Adua’s Chair in 2010",
    "summarized_story": "I travelled back to Abuja by road in the evening and went straight to have dinner with Dr Jonathan.\nGo and sit on that chair!’“He looked at me for some time and responded that he would think about it.\n“With Jonathan now legally empowered to act as President, there remained the critical optics: would he stand-in for the President confidently and authoritatively?\nAs Dr Jonathan entered the Council Chamber, he made to sit on the chair of the Vice President—his usual seat.\n“As the protocol officer pulled out the VP’s chair, Dr Jonathan marched towards the seat reserved for the President."
  },
  {
    "headline": "Naomi Osaka Pledges to Donate Prize Money to Haiti Earthquake Relief Efforts",
    "summarized_story": "Naomi Osaka has pledged to donate any prize money she wins from this week’s Western & Southern Open tennis tournament to relief efforts in Haiti.\nHaiti was rocked by a 7.2 magnitude earthquake Saturday morning that has left more than 700 dead.\nI’m about to play a tournament this week and I’ll give all the prize money to relief efforts for Haiti.\nFrancois taught Naomi and her sister Mari to play tennis by following a model outlined by Richard Williams, who had success in teaching his daughters Venus and Serena Williams the game.\nOsaka, 23, finished second at the Western and Southern Open last year after withdrawing from the final with a hamstring injury."
  },
  {
    "headline": "Barcelona Begins La Liga’s First Post-Messi Era with Win Over Real Sociedad",
    "summarized_story": "Barcelona won their first LaLiga match of the post-Lionel Messi era with a 4-2 victory that saw Real Sociedad mount a late rally.\nGerard Pique scored Barca’s first goal on the night with a close-range header from Memphis Depay’s free kick delivery in the 19th minute.\nMartin Braithwaite doubled Barca’s lead just seconds before half-time with a back-post header off a delivery from Frenkie de Jong.\nLa Real pulled one back in the 82nd minute when Julen Lobete scored, with Mikel Oyarzabal scoring three minutes later on a stunning free-kick to cut Barca’s lead to one.\nThe match saw the return of fans to Camp Nou in 17 months, with 20,000 supporters in attendance."
  }
]