[
  {
    "headline": "Post-term babies at risk of neurological conditions, death, gynaecologists warn",
    "summarized_story": "Amarachi OkehMaternal and child health experts say pregnant women should seek prompt medical intervention for overdue pregnancy, warning that post-term babies are at risk of neurological deficiencies and death.\nSpeaking with PUNCH Healthwise in separate interviews, the maternal and child health experts said caregivers must also intervene once pregnancy exceeds 42 weeks.\nShe also noted that overdue babies are babies born after 42 weeks.\n“Once it’s the date of birth, we normally use 40 weeks, we don’t wait till 42 weeks.\nIn Nigeria, once it is 41 weeks and three days, the woman is induced,” Dr. Kenechukwu said."
  },
  {
    "headline": "Post-term babies at risk of neurological conditions, death, gynaecologists warn",
    "summarized_story": "Amarachi OkehMaternal and child health experts say pregnant women should seek prompt medical intervention for overdue pregnancy, warning that post-term babies are at risk of neurological deficiencies and death.\nSpeaking with PUNCH Healthwise in separate interviews, the maternal and child health experts said caregivers must also intervene once pregnancy exceeds 42 weeks.\nShe also noted that overdue babies are babies born after 42 weeks.\n“Once it’s the date of birth, we normally use 40 weeks, we don’t wait till 42 weeks.\nIn Nigeria, once it is 41 weeks and three days, the woman is induced,” Dr. Kenechukwu said."
  },
  {
    "headline": "NCDC’ll have funds to prepare for future pandemic –FG",
    "summarized_story": "Mamora said this at a virtual conference on ‘Nigeria and the next pandemic: Preparedness, response and vaccines’ organised by The Conversation Africa.\nThe minister said, “The NCDC will have access to 2.5 per cent of the five per cent of the funds earmarked for health emergencies.\nMamora added that Nigeria had learnt a lot of lessons from the COVID-19 pandemic and it would prepare the country for future pandemics.\n“As many are aware, the world is facing inequitable distribution of COVID-19 vaccines, with Africa bearing the brunt of it.\n“In Nigeria, we have taken this opportunity to fully establish our capacity for vaccine manufacturing."
  },
  {
    "headline": "NCDC’ll have funds to prepare for future pandemic –FG",
    "summarized_story": "Mamora said this at a virtual conference on ‘Nigeria and the next pandemic: Preparedness, response and vaccines’ organised by The Conversation Africa.\nThe minister said, “The NCDC will have access to 2.5 per cent of the five per cent of the funds earmarked for health emergencies.\nMamora added that Nigeria had learnt a lot of lessons from the COVID-19 pandemic and it would prepare the country for future pandemics.\n“As many are aware, the world is facing inequitable distribution of COVID-19 vaccines, with Africa bearing the brunt of it.\n“In Nigeria, we have taken this opportunity to fully establish our capacity for vaccine manufacturing."
  },
  {
    "headline": "Boko Haram, bandits are different from IPOB, Nnamdi Kanu — El-Rufai",
    "summarized_story": "Governor of Kaduna State, Nasir El-Rufai.\nBy Agbonkhese ObohGovernor Nasir el-Rufai of Kaduna State has said that Boko Haram terrorists and bandits are different from the Indigenous People of Biafra, IPOB, and their leader, Nnamdi Kanu, because they don’t have a recognised and centralised leadership.\nAccording to el-Rufai, “I was very happy (when Nnamdi Kanu was arrested) because, first he jumped bail, jeopardising his sureties.\n“Let’s take Boko Haram for instance.\n“It is not like Shekau was in Saudi Arabia, sitting in one place, tweeting about the break up of Nigeria or asking Boko Haram to go and kill Helen and Nasir el-Rufai."
  },
  {
    "headline": "We’re tired of killings in S-West —Gani Adams, Yoruba in Diaspora, others",
    "summarized_story": "Aare Onakakanfo of Yorubaland, Iba Gani Abiodun Ige AdamsBy Dapo Akinrefon, LAGOSYORUBA in the Diaspora, under the aegis of Yoruba One Voice, YOV, yesterday, renewed its call for the liberation of the Yoruba race, saying it is tired of the killings and destruction in the region.\n“Killer herdsmen run amok in our land daily, with cases of extra-judicial killings already reaching an alarming crescendo.\n“The latest was the attack on chief Sunday Igboho’s resident where eight people were killed with wanton destruction to his property.\nAdekoya said: “Our agitation today is not new, and it is supported by millions of Yoruba all over the world.\nThe agitation for the actualization of the June 12 mandate led to the killing of thousands of Yoruba across the Western states."
  },
  {
    "headline": "Nnamdi Kanu caused death of 60 in 4 months; but he‘ll get fair trial— FG",
    "summarized_story": "“Indeed, it would seem that the position of the (western nation) seems to have further emboldened Nnamdi Kanu, the self-confessed leader of IPOB.\nThe treacherous action of Uhuru Kenyatta against Nnamdi Kanu and Biafrans at large is a clear violation of the 1949 Geneva Convention, and United Nations Code.\n“We still don’t understand why Uhuru Kenyatta and some corrupt officials of his government would prefer to betray Nnamdi Kanu and Biafrans.\nHe said: “Mazi Nnamdi Kanu and the activities of pro – Biafra agitators do not pose any danger to Nigeria’s existence.\n“What poses a dangerous problem to Nigeria’s existence is the Fulani domination of Nigerian state against the general interest of other ethnic nationalities."
  },
  {
    "headline": "Igboho Residence's Raid: DSS kills 2, nabs 13, advises him to surrender",
    "summarized_story": "You can watch the raid video HERE and see pictures of arms DSS said it recovered from Igboho’s residence HERE.\nSpeaking on the raid, DSS spokesman, Peter Afunaya, told newsmen that “A team of joint security operatives raided the residence of Sunday Adeyemo at Soka in Ibadan.\n“On approach to his residence, the team came under heavy gun attack by nine men suspected to be Igboho’s guards.\nThe DSS said: “Igboho may run as far as he can.\nHe might have attacked security operatives as his strength carried him."
  },
  {
    "headline": "45 years after, Makurdi community gets electricity, tarred road",
    "summarized_story": "The road is also complemented with a 12-km stretch of power transmission line that electrifies the communities on that axis of the town.\nAnd that is why we now have electricity and a good road that we never dreamt of before now.\n“Even if I answer the heavenly call I will go home a happy woman because my children can now proudly say and claim that they are in Makurdi town.\n“What this road and electricity has brought for us is unimaginable.\n“After living in this community for several years without a good motorable road that runs through the communities we now have every reason to proudly say that we also live in Makurdi town."
  },
  {
    "headline": "PIB: How northerners outwitted their southern colleagues",
    "summarized_story": "The chairman of the caucus, Sarkin Adar from Sokoto State is the chairman of the lower chamber committee on petroleum (upstream).\nSpeaking at the event, the Sultan said the PIB must support the exploration of oil in the frontier basins.\nThe PIB is proposing the establishment of a frontier basin exploration fund.\nSection 240 of the bill makes provision for the host communities trust fund.\nThe House committee recommended 5 per cent for the host communities, which oil companies are to contribute to communities where they are operating."
  },
  {
    "headline": "Insecurity: Amotekun raids black spots, arrests 400 suspects in Ondo",
    "summarized_story": "No fewer than 400 suspects have been arrested in Ondo State by operatives of the state Security Network, known as the Amotekun Corps.\nThe arrest of the suspects was part of the move to rid the state of criminals as well as curb the rate of crimes in the state.\nAccording to the corps, the arrest of the suspects was aided through the ongoing ‘Operation Clean Up’ in various parts of the state.\nAdeleye added that with the black spots within the senatorial districts of the state identified and combed, the operation would be concentrated more in the northern senatorial district due to the prevalence of insecurity in the axis.\nWhile stressing that a 24-hour patrol had been intinitiated, the Amotekun boss said that local hunters and vigilantes were engaged particularly when combing the forests."
  },
  {
    "headline": "Bandits kill headmaster, two others in Plateau",
    "summarized_story": "A headmaster was reportedly killed by suspected Fulani terrorists operating around Riyom Local Government Area of Plateau State in north central Nigeria.\nDAILY POST learnt that the gunmen invaded Gwol-Hoss village of Riyom about 10.45 p.m. on Wednesday and hacked one Bitrus Manzere, a primary school headmaster, to death.\n“What surprised everybody is that this thing is happening very close to the military base.\nThe children indeed and all community needs were left with shock when they brought his corpse,” John Peter, a member of the community told DAILY POST.\nThe police in Jos could not be reached to confirm the incident, however, a soldier at the base around the village confirmed that a headmaster from the village was killed."
  },
  {
    "headline": "Sunday Igboho: Fulanis'll bring catastrophe to Nigeria",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has said Fulani and their collaborators are trying to bring catastrophe to Nigeria.\nIPOB made the remark while daring the Nigerian government and security agents, especially the Department of State Services, DSS, to stop taking it for granted.\nSpokesman of the group, Emma Powerful, was reacting to the attack on the residence of Yoruba freedom fighter, Sunday Adeyemo also known as Sunday Igboho.\n“Fulani and their collaborators are trying to bring catastrophe to Nigeria.\nThey should stop taking the indigenous nations in Nigeria for granted."
  },
  {
    "headline": "Alleged N7.1bn fraud: Court to hear Kalu’s suit seeking to stop retrial Sept 20",
    "summarized_story": "Justice Inyang Edem Ekwo of the Federal High Court in Abuja has fixed September 20 for judgment in a suit by former Abia State Governor, Dr Orji Uzor Kalu, seeking to stop his retrial in an alleged N7.1billion fraud.\nHowever, in a vehement opposition to the suit., the EFCC through its counsel Rotimi Jacobs SAN asked the court to dismiss the suit with anger.\nThe anti-graft commission argued that since the Supreme Court order benefitted Kalu, he must bear the burden that arose from the apex court verdict.\nJacobs described Kalu suit as approbating and reprobating at the same time, frivolous, irritating and sought for it’s dismissal with order of Kalu to face retrial.\nAlso Kalu is asking the Federal High Court to restrain the EFCC from retrying him on the same alleged N7.1b money laundering charges against him."
  },
  {
    "headline": "JUST IN: Kenya denies involvement in arrest, extradition of Nnamdi Kanu",
    "summarized_story": "By Vincent Ikuomola AbujaKenya government on Friday denied involvement in the arrest of IPOB leader, Nnamdi Kanu, saying “it does not want to be dragged into Nigeria’s internal affairs.”Kenya High Commissioner to Nigeria, Amb.\nWilfred Machage spoke in Abuja on Friday.\nHe said; ” I wish to categorically state that we are not happy at this ridiculous attempt of dragging the name of Kenya and President Uhuru Kenyatta on this matter of arrest and extradition of self-claimed IPOB leader.”ADVERTISEMENTDetail shortly…"
  },
  {
    "headline": "DSS thought Igboho turned into cat to escape arrest, says spokesperson",
    "summarized_story": "But on Thursday, the DSS said a joint team of security operatives raided Igboho’s residence based on an intelligence report.\nIn a live broadcast monitored by The Nation early friday, Koiki, said: “DSS released false allegations against him (Igboho) just to silence him and not to speak up again.\nWhile we were preparing for the rally, somebody was preparing plan B against the rally.\n“They took one of his cats away, thinking he transformed into a cat during the attack to escape.\nAll the allegations against Igboho should be for terrorists killing people in the country.”"
  },
  {
    "headline": "DSS declares Igboho wanted after arms recovery in home raid",
    "summarized_story": "During the early morning raid, about 1:34 am on Thursday, two of Igboho’s men were killed, 13 were arrested and taken to Abuja.\nArms, ammunition, charms among other items, were recovered from the house after almost one hour of gun exchange between security operatives and Igboho’s guards.\nDepartment of State Services (DSS) said last night that security operatives carried out the raid after an intelligence report confirmed the stockpiling of arms in the house.\nDSS spokesman Dr. Peter Afunanya told reporters that when security operatives approached the house, they came under heavy gunfire from nine of Igboho’s men.\nSix (6) of them were armed with AK-47 gun and Three (3) others, with Pump-Action riffles."
  },
  {
    "headline": "Why I celebrated Governor Sanwo’s two years in office, by Stella Monye",
    "summarized_story": "By Sampson Unamka and Kehinde OlusanyaVeteran musician Stella Monye has revealed why she celebrated Lagos Governor Babajide Sanwo-Olu’s two years in office at an event that she hosted recently.\nIn an interview when she visited The Nation newspaper recently, she noted the Governor has been hard working, prompting her decision to hold an event for him.\nAccording to her: “Sanwo-Olu has been working so hard, I looked at his achievement and then I said okay if they are doing two years celebration for him, let me come up with some kind of celebration for him so I came up with 104 voices for the choral group for him, you know, which was held at the Eko FM multipurpose hall on Friday which happened to be his birthday.\nADVERTISEMENT” Even though I didn’t know it was his birthday, it was just a coincidence so it became a double celebration and it was okay, it was fun we had 104 voices choral voices from Adeniran Ogunsanya College of Education Music Department which I went to work with for this project and I had a lot of other, we had Atilogu cultural group, we had the riverine cultural group among others.”She however noted one of the highlights of the event was the rendition enacted in three major languages from Nigeria by the choral group.\nAccording to Monye, the Governor was represented at the event by Tourism Commissioner, Uzamat Akinbile-Yusuf."
  },
  {
    "headline": "We would cripple Nigeria if Kanu dies – IPOB",
    "summarized_story": "From Stanley Uzoaru, OwerriThe Indigenous People of Biafra (IPOB) has threatened to cripple Nigeria if anything should happen to its leader, Nnamdi Kanu whose being detained by the Department of State Service(DSS).\nAnd his lawyers are being harassed and we pity them and Nigeria if anything happen to our leader Mazi Nnamdi Kanu the Nigeria Government and security agencies must understand the product we are made of and how prepared we are.\nNnamdi Kanu must not die in custody.\n“The Fulani- controlled federal government of Nigeria and DSS should release our leader for international medical check up.\nShould anything untoward happen to our leader while in detention or even after, we will totally cripple Nigeria and its Government."
  },
  {
    "headline": "Senate passes PIB, disagrees with Reps on percentage for host communities",
    "summarized_story": "From Fred Itua, AbujaFourteen years after the first attempt was made, the Senate and House of Representatives, yesterday, passed into law the Petroleum Industry Bill (PIB).\nBut it was not without controversy and drama as senators and House of Reps disagreed on what percentage host communities should get from crude oil drilled in their areas.\nThe senate went ahead to approval a Host Community Trust Fund, which would be anchored by oil and gas companies operating in the host communities for the three per cent.\nThe Authority shall have the power to acquire, hold and dispose of property, sue and be sued in its own name.\n“The Authority shall be responsible for the technical and commercial regulation of midstream and downstream petroleum operations in the petroleum industry."
  },
  {
    "headline": "Kanu: FG reveals 2-year effort to nab IPOB leader",
    "summarized_story": "“We commend the professionalism, diligence, patriotism and painstaking efforts of our security and intelligence agencies.\n“We can tell you that the forensic investigation carried out so far has revealed a treasure trove of information on the proscribed IPOB leader and his collaborators.\n“Finally, there have been speculations on how this re-arrest was pulled off and in which country the hitherto fugitive leader of the proscribed IPOB was nabbed.\nMeanwhile, a day after Kingsley, younger brother of the IPOB leader said the separatist leader was arrested in Kenya, Nairobi has denied the claim.\nThe British High Commission in Nigeria has also said Kanu was not arrested in the United Kingdom where the embattled IPOB leader is a citizen."
  },
  {
    "headline": "Arrest Miyetti Allah, Bandits leaders same way you arrested Kanu, Wike, Ortom urge FG",
    "summarized_story": "“We must not make hullabaloo about the prosecution of Nnamdi Kanu.\n“You cannot say because Nnamdi Kanu is from a particular area, let us prosecute him.\nIf Nnamdi Kanu can be arrested from a foreign land.\n“It is laughable and unfortunate when I heard that Miyetti Allah are calling Nnamdi Kanu a terrorist.\nSomeone who is fighting for the liberation of his people is being called a terrorist by a terrorist organisation called Miyetti Allah and Fulani herdsmen."
  },
  {
    "headline": "Why we raided Sunday Igboho’s home in Ibadan-DSS",
    "summarized_story": "Molly Kilete, AbujaThe Department of State Services(DSS), has explained why it carried raided the home of Sunday Igboho, in Ibadan, Oyo State .\nHe told newsmen in Abuja that on approaching the premises, the security operatives were attacked by men suspected to be working as security guards for the suspect.\n“On approach to the residence, the team came under heavy gun attack by nine (9) men, suspected to be IGBOHO’s guards.\n“In the course of the exchange, two (2) of IGBOHO’s armed men were gunned down while the rest were subdued and arrested.\nHe might have attacked security operatives as his strength carried him."
  },
  {
    "headline": "DSS Raids Igboho’s House, Declares Him Wanted",
    "summarized_story": "He might have attacked security operatives as his strength carried him.\nTwo Yoruba sons have been killed in the house of Chief Sunday Igboho.\nWe do not know of the location where they were taken to,” Igboho’s spokesman, Mr. Olayomi Koiki, said.\nHe added that Igboho’s passport and travel documents were stolen together with his phones, his personal effects, computers and N2 million.\nHe stated that the gunmen killed seven occupants of the building and whisked away Igboho’s wife and others."
  },
  {
    "headline": "National Assembly Passes PIB, Approves 3% for Host Communities",
    "summarized_story": "Also, the Senior Special Assistant to the President on National Assembly (Senate), Senator Babajide Omoworare said the federal lawmakers had broken the jinx.\nThe Senate passed the much-awaited PIB after a clause-by-clause consideration of all the 318 clauses of the bill.\nThe bill was first sent to the National Assembly in 2008 by President Umaru Yar’Adua, now deceased, without translating into an Act.\nThe bill had proposed five per cent of the annual profit share of the oil companies for the host communities.\nFemi Gbajabiamila, on the passage of the PIB by the National Assembly."
  },
  {
    "headline": "FG Projects N11.9tn Budget, N900bn for Subsidy in 2022",
    "summarized_story": "Ndubuisi Francis in AbujaThe federal government is projecting N900 billion for fuel subsidy in an estimated N11.907 trillion budget for 2022.\nThe minister lamented that subsidy is exerting huge cost on the country, adding that in a particular month, N150 billion was spent on subsidising petrol.\nBut if we get rid of subsidy completely, it is not a popular view with labour,” Ahmed said.\nOn the funding of the N5.6 trillion deficit, Ahmed said it would be done through borrowing from both domestic and foreign sources at 50 per cent.\nOn the 2021 budget performance, Ahmed said a total of N973 billion had been released for capital projects as of May."
  },
  {
    "headline": "OPEC Defers Decision on Oil Output Cuts",
    "summarized_story": "Earlier, there were expectations that the cartel could boost production output by another 400,000 barrels beginning in August, an increase seen as likely to be easily absorbed by the market amid expectations for rising demand.\nAt the inconclusive meeting, the OPEC+ ministerial committee had proposed the planned increase to the wider group, but a disagreement between Saudi Arabia and Russia, the biggest producers in the OPEC+ alliance, remained largely unresolved.\nBefore the deferment of the meeting, oil prices reacted with Brent crude trading above $75 a barrel, close to a two-and-a-half-year high as the policy from August to December was being awaited.\nWhile the full house decided to shift a definitive decision on the matter till today, OPEC had earlier finished its meeting just before an OPEC+ ministerial committee met after that, before the inconclusive one by OPEC+ ministers.\nHe, however, stated that OPEC still sees growth in the second half of the year."
  },
  {
    "headline": "DSS Confirms Raid on Igboho’s House, Orders Yoruba Activist to Report to Nearest Security Agency",
    "summarized_story": "He said operatives raided his residence in Soka, Ibadan Thursday and arrested nine of his associates.\nIt said operatives recovered seven AK 47 assault rifles, 30 fully charged AK 47 and 5,000 rounds of 7.62 mm ammunition.\nHe might have attacked security operatives as his strength carried him.\nHis strength will sure fail him and the law will catch up with him.\nHe stated further: “Consequently, Adeyemo/Igboho is advised to turn himself in to the nearest security agency."
  },
  {
    "headline": "Nigerian Army Arrests Youths in Enugu Communities Over Expulsion Of Herdsmen, Cattle",
    "summarized_story": "Soldiers of the Nigerian Army have invaded and arrested youths in two communities in the Nkanu East and Nkanu West local government areas of Enugu State for allegedly attacking and sending away herdsmen and their cows from the areas.\nCommunity sources said the soldiers invaded Ekpoffo on Wednesday and whisked away some youths to unknown destinations.\nA source said, “Soldiers numbering over 100 stormed Ekpoffo community in Nkanu East around 7.30pm on Wednesday.\nAnother community source said the soldiers also invaded Ndiagu- Akpugo community and razed some houses.\nThe Deputy Director, Army Public Relations, 82 Division, Enugu, Col. Abubakar Abdullahi, declined comment when contacted on the incident."
  },
  {
    "headline": "Nigerian Army Arrests Youths in Enugu Communities Over Expulsion Of Herdsmen, Cattle",
    "summarized_story": "Soldiers of the Nigerian Army have invaded and arrested youths in two communities in the Nkanu East and Nkanu West local government areas of Enugu State for allegedly attacking and sending away herdsmen and their cows from the areas.\nCommunity sources said the soldiers invaded Ekpoffo on Wednesday and whisked away some youths to unknown destinations.\nA source said, “Soldiers numbering over 100 stormed Ekpoffo community in Nkanu East around 7.30pm on Wednesday.\nAnother community source said the soldiers also invaded Ndiagu- Akpugo community and razed some houses.\nThe Deputy Director, Army Public Relations, 82 Division, Enugu, Col. Abubakar Abdullahi, declined comment when contacted on the incident."
  },
  {
    "headline": "BREAKING: Nigeria's Secret Police Declare Igboho Wanted, Parade His 'Foot Soldiers', Recover Arms, Charms During Raid",
    "summarized_story": "The Department of State Services (DSS) has paraded some supporters of Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, who were arrested during a raid on his residence at Soka in Ibadan Oyo State.\nThe spokesperson for the service, Peter Afunnaya, who addressed journalists on Thursday night in Abuja said the service got intelligence that Ighoho had stockpiled arms in his house.\nOthers include 2 pistol holsters, 1 binocular, 18 walkie-talkies, 3 voodoo charm jackets/ traditional body armour.\n\"The arrest and seizures are no doubt confirmation of a grand plan by Igboho and cohorts to wage a violent insurrection against the Nigerian state.\n\"Consequently Adeyemo/Igboho is advised to turn himself in to the nearest security agency.\""
  },
  {
    "headline": "BREAKING: Nigeria's Secret Police Declare Igboho Wanted, Parade His 'Foot Soldiers', Recover Arms, Charms During Raid",
    "summarized_story": "The Department of State Services (DSS) has paraded some supporters of Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, who were arrested during a raid on his residence at Soka in Ibadan Oyo State.\nThe spokesperson for the service, Peter Afunnaya, who addressed journalists on Thursday night in Abuja said the service got intelligence that Ighoho had stockpiled arms in his house.\nOthers include 2 pistol holsters, 1 binocular, 18 walkie-talkies, 3 voodoo charm jackets/ traditional body armour.\n\"The arrest and seizures are no doubt confirmation of a grand plan by Igboho and cohorts to wage a violent insurrection against the Nigerian state.\n\"Consequently Adeyemo/Igboho is advised to turn himself in to the nearest security agency.\""
  },
  {
    "headline": "I Was Very Happy When I Heard About Nnamdi Kanu’s Arrest— Kaduna Governor, El-Rufai",
    "summarized_story": "Kaduna state governor, Nasir El-Rufai says he was happy when he heard about the arrest of Nnamdi Kanu, the leader of the Indigenous People of Biafra (IPOB).\nKaduna State Governor Nasiru Ahmed El-RufaiSpeaking in an interview on BBC Pidgin, El-Rufai said Boko Haram terrorists and bandits are different from the IPOB because they don’t have a recognised and centralised leadership.\nThe governor said, “I was very happy (when Nnamdi Kanu was arrested) because, first he jumped bail, jeopardising his sureties.\n“Nnamdi Kanu is in one place while Shekau is waging guerrilla warfare.\nWho is the equivanlent of Nnamdi Kanu with banditry?"
  },
  {
    "headline": "EXPLAINER: Is 3% for host communities in PIB to be taken from 13% derivation?",
    "summarized_story": "The PIB contains 5 chapters, including governance and institutions, administration, host communities development, petroleum industry fiscal framework and miscellaneous provisions in 319 clauses and 8 schedules.\nDuring the session on Thursday, fierce argument ensued in the senate over the allocation of 3 percent operating expenditure of oil firms to host communities.\nAdvertisementStakeholders, most especially host communities are also asking if the 3 percent will be taken from the 13 percent derivation fund.\nThis is lower than the 10 percent allocation agitated for by the host communities at a recent public hearing.\nThe fund would be transferred to a frontier exploration fund escrow account dedicated for the exploration and development activities in the frontier acreages."
  },
  {
    "headline": "EXPLAINER: Is 3% for host communities in PIB to be taken from 13% derivation?",
    "summarized_story": "The PIB contains 5 chapters, including governance and institutions, administration, host communities development, petroleum industry fiscal framework and miscellaneous provisions in 319 clauses and 8 schedules.\nDuring the session on Thursday, fierce argument ensued in the senate over the allocation of 3 percent operating expenditure of oil firms to host communities.\nAdvertisementStakeholders, most especially host communities are also asking if the 3 percent will be taken from the 13 percent derivation fund.\nThis is lower than the 10 percent allocation agitated for by the host communities at a recent public hearing.\nThe fund would be transferred to a frontier exploration fund escrow account dedicated for the exploration and development activities in the frontier acreages."
  },
  {
    "headline": "ICYMI: 14-year-old pupil dies from ‘condom infection’ in Abuja",
    "summarized_story": "A 14-year-old pupil of Premiere Academy, Lugbe in Abuja, has passed away after she was allegedly abused sexually.\nAdvertisementVihimga Akpagher, the deceased’s mother, alleged that the pupil died from an infection after a condom was found in her private parts.\nShe explained that the school had initially asked her not to bother, assuring her that her daughter was doing fine.\nVihimga said her daughter eventually died at the hospital after enduring trauma which made her slip into a coma.\nShe was traumatised.”AdvertisementBut in a statement via its Facebook page, the institution dismissed the claim that the student left the school sick, noting that she was healthy."
  },
  {
    "headline": "ICYMI: 14-year-old pupil dies from ‘condom infection’ in Abuja",
    "summarized_story": "A 14-year-old pupil of Premiere Academy, Lugbe in Abuja, has passed away after she was allegedly abused sexually.\nAdvertisementVihimga Akpagher, the deceased’s mother, alleged that the pupil died from an infection after a condom was found in her private parts.\nShe explained that the school had initially asked her not to bother, assuring her that her daughter was doing fine.\nVihimga said her daughter eventually died at the hospital after enduring trauma which made her slip into a coma.\nShe was traumatised.”AdvertisementBut in a statement via its Facebook page, the institution dismissed the claim that the student left the school sick, noting that she was healthy."
  },
  {
    "headline": "'Yoruba nation rally' in Lagos will go ahead, says Igboho's aide",
    "summarized_story": "Olayomi Koiki, media aide of Sunday Adeyemo, a Yoruba youth leader better known as Sunday Igboho, says the Yoruba nation rally scheduled for July 3 in Lagos will still take place despite Igboho’s announcement that the rally has been suspended.\nTwo persons died in the attack while some of the supporters of Igboho were arrested and later paraded in Abuja.\nIn a live broadcast on Friday, Koiki said he had been in contact with the organisers of the rally, insisting that it will go ahead.\nOnce again, the 3rd of July rally will go ahead as planned.\nHe is working tirelessly for the release of 10 persons that were kidnapped from the house of Sunday Igboho.”Hakeem Odumosu, commissioner of police in Lagos state, has however warned Igboho and other agitators not to hold any rally in Lagos."
  },
  {
    "headline": "TeamApt closes undisclosed Series B round to extend its banking services across Africa",
    "summarized_story": "Nigeria-based TeamApt, which offers agent banking services with plans to roll out consumer-focused digital banking features, has raised an undisclosed sum in a Series B round.\nTeamApt’s pivotal business at the moment is Moniepoint, a software solution that powers agent banking in Nigeria.\nBut the agent banking space is thought to include Firstmonie, Paga and OPay, the Opera-backed fintech.\nIn March 2021, TeamApt said it processed over ₦1trillion ($2.4 bn) for the first time.\nWhile Moniepoint will continue to power agent banking, TeamApt plans to build a consumer app side of it for individuals as a digital bank."
  },
  {
    "headline": "Faith Keza is leading Irembo to fully digitise Rwanda",
    "summarized_story": "And steering the Irembo ship is Faith Keza.\nFaith is also on the board of the Rwanda National Bank and the Rwanda Development Board.\nSo no, I don’t have great memories.”After a semester at MIT, Faith realized her maths major wasn’t for her.\nBut a lot of plans were stalled and so Faith decided to return on her own to Rwanda and while there, she joined Irembo as CTO.\nWith Faith Keza, Irembo could be at the front of that movement."
  },
  {
    "headline": "Inside Branch’s ambitious '20% investment' challenge to Nigerian banks",
    "summarized_story": "Four years, ₦40 billion (~$97 million) and three million loans later, the business is evolving.\nIt was the first question Dayo Ademola, Branch Nigeria’s managing director, faced on CNBC in May.\nBoth numbers would give a clearer picture of the returns on their three million loans.\nGoing by its profitability and investor capital, it would appear both metrics are in good health.\nIt will then be intriguing to see customer reaction to the newly launched investment offer."
  },
  {
    "headline": "Eswatini government shuts down internet amid violent pro-democracy protests",
    "summarized_story": "pic.twitter.com/Pk9ao9duio — Swazi News (@SwaziNews) June 29, 2021Eswatini protestors now operating at night burning businesses linked to King Mswati and Government properties.\nESWATINI GOVT orders major network providers to cut internet connection, closes schools, imposes 6pm-5am curfew as protests continue.\nBetween January 2020 and February 2021, internet and social media blackouts were imposed in Uganda, Chad, Tanzania, and Ethiopia.\nKing Mswati III has ruled by decree for more than three decades, with unfettered political power over his 1 million people.\nAmid the protests, reports say the king has fled to neighbouring South Africa although Eswatini’s acting Prime Minister, Themba Masuku, denied the claims on Tuesday."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "There’s no such thing as a bad investment – TEN13’s Stewart Glynn talks startup funding",
    "summarized_story": "However, angel investors and venture capitalists are a similarly courageous group of individuals who are seldom celebrated.\nFor this week’s edition, I talked to Stewart Glynn, a Partner at TEN13, an Australian venture capital firm.\nIn December 2019, after wondering how to institutionalise their investments, Baxter and Glynn decided to start TEN13.\nOn bad investments and common mistakes founders makeFor now, Glynn explains that the goal is to fund ten companies every year.\nKnowing this, I asked Glynn how TEN13 deals with investments that do not go according to plan."
  },
  {
    "headline": "Women’s online safety, MTN Uganda’s 5G partnership, Kenya taxes Internet services",
    "summarized_story": "MTN Uganda partners with TIP to build 5G TechnologyMTN Uganda has partnered with members under the Telecom Infra Project (TIP), an engineering-focused community, to automate its network preparation for 5G technology.\nMTN Uganda will use TIP’s Disaggregated Cell Site Gateway (DCSG) technology to build network capabilities at 2,500 locations across Uganda.\nRemember that, in 2019, MTN Uganda began a new initiative committed to developing 5G technology as part of an ongoing transformation across its operations.\nKenya plans to increase the cost of airtime and dataThe Kenyan Parliamentary Committee has proposed additional taxes that will increase the cost of airtime and Internet data services.\nBy making this change, the tax on phone and Internet data service fees would go up from 15% to 20%."
  },
  {
    "headline": "BusinessDay @ 20: Going strong like the way we started",
    "summarized_story": "As we celebrate 20 years of impact journalism in Nigeria, many things have changed, while many things remain the way they were.\nThe strong presence of indigenous Nigerian banks on the African continent owes its success to the policy implemented in early 2000’s which was the focus of the maiden edition of this newspaper.\n“Is Coke losing flavour?” was another important story that featured in BusinessDay’s maiden publication.\nThe maiden publication also featured Virgin Atlantic’s maiden flight into Nigeria.\nBusinessDay also reported that “NNPC reviews cash call payment” in the maiden edition."
  },
  {
    "headline": "Nigeria struggles with poverty that private sector can fix",
    "summarized_story": "With 87 million Nigerians living in poverty, Nigeria is home to the highest number of poor people globally.\nIf anything, the Nigerian government is seemingly tightening its grip on the economy when it should be giving the private sector a bigger role to play.\nThe government is also crowding out the private sector with its sheer size of borrowings.\nThe private sector creates the bulk of jobs in Nigeria but data from the World Bank which shows that the ease of doing business in Nigeria ranks among the lowest globally (despite recent gains) means the private sector is constrained.\n“I would like to see the government focus on improving the ease of doing business to reduce poverty,” a bank CEO told Business Day."
  },
  {
    "headline": "Flashback Friday when BusinessDay started in 2001",
    "summarized_story": "Read Also: Growing the economy, improving governance, and integrating the nationThe first publication of BusinessDay in 2001 featured one of the macroeconomic numbers in a story titled “Banks reject foreign exchange requests,” written by Oluwole Elisha.\nExchange rate N135.5k/$ (black market)Exchange rate regime, which was a managed float with no pre-announced target, stood at N113.2k per dollar at the Inter-Bank Foreign Exchange Market (IFEM) as of May 2001.\nIn response to the pressures in the exchange market stemming from expansionary fiscal policy, the CBN reverted to the pre-reform (i.e.\nMRR 16.5%The Monetary Rediscounted Rate (MRR), which is currently the Monetary Policy Rate (MPR), was tightened by the CBN in early 2001.\nForeign reserves have increased only modestly during the first five months of 2001, notwithstanding continued high foreign exchange inflows from oil."
  },
  {
    "headline": "Edo Inland Dry Port: Promoter meets stakeholders, prospective port users, seeks improved collaboration – Nigerian Observer",
    "summarized_story": "The Managing Director of AMES-Edo Inland Container Dry Port, Engr.\nStakeholders at the meeting include Okomu Plc, Manufacturers Association of Nigeria (MAN), Rongtai Industry, ESIPO and Zanithcarex Int’l Limited, among others.\n“It will be a customs port, and a lot of activities at the Lagos Port will be done here at Edo State, yielding huge resources for the state and the federal government.\nBut with the Dry Port, no need to go through the Lagos Port but the Edo Dry Port.\n“The Edo State Government is facilitating the Ossiomo-Power to be connected to the Dry Port for 24/7 electricity supply to reduce cost and ensure that end-users and other stakeholders benefit.”..."
  },
  {
    "headline": "Senate Passes The Petroleum Industry Bill, Approves 3% Allocation to Host Communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The 9th Senate, Thursday, passed the much awaited Petroleum Industry Bill (PIB) with the approval of 3% allocation to host communities.\nThe petroleum industry bill that had become the albatross of successive dispensation has now been passed as a bill.\nDuring a clauce by clause consideration of the Bill, there was still unease over the contentious clause regarding profit sharing for the host communities.\nLawmakers from the South-South, agreed that the fund for host communities should be raised from 2.5 percent to 5 per cent, A request that was immediately turned down by other lawmakers forcing the Senate President to follow the majority vote of 3% allocation to host communities.\nHe also thanked all Nigerians for their patience and support to ensuring the smooth passage of the Bill."
  },
  {
    "headline": "First black female Irish mayor feat worthy of emulation ― NBM – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The NBM of Africa, a Non-Governmental Organisation, commited to the principles of democracy, equity and social justice has felicitated with Ms. Uruemu Adejinmi over her recent election as the first migrant, first African and first black female to become Mayor in the Republic of Ireland.\nThe group said this in a press statement issued on Wednesday by the Public Relations Officer (PRO) NBM of Africa, Mr Oluwatosin Dixon.\nHe said they salute the courage, doggedness and relentlessness in her and other people of African descent across the world.\n“We congratulate Ms. Adejinmi, members of her family and the African diaspora of Ireland.\n“We wish her the best in office and expect her to leave an everlasting legacy as a forerunner and role model,” the statement added."
  },
  {
    "headline": "Edo mobile court convicts 11 traders for selling on walkways, other unauthorized places – Nigerian Observer",
    "summarized_story": "Okunrobo, on Thursday, convicted 11 traders for disobeying the directive of the Edo State Government on selling on walkways and other unauthorized places.\nThe traders include Mr. Igwue Edwin, Mr. Andy Daniel, Mr. Ikechukwu Nkpuma, Miss Susan Mark, Mr. Daniel Erabhaghen and Mrs. Felicia Ade.\nOthers are Miss Inegbedion Philo, Miss Promise Obodoagwu, Miss Success Blessing, Ms. John Natabor and Ms. Usman Eva.\nEarlier, the State Counsel, Aigbokhaode Ayo Esq., told the court that the traders were seen either hawking or selling in unauthorized locations.\nEfosa said that the traders exposed themselves to danger, adding that they were served court notices to vacate the place and they refused."
  },
  {
    "headline": "Nigerians react to Sunday Igboho’s house invasion by SSS",
    "summarized_story": "PREMIUM TIMES reported how Mr Igboho’s house, located in Soka, Ibadan, capital of Oyo State was invaded around 1:00 a.m. on Thursday.\nThe attack occurred barely 72 hours before the planned rally in Lagos by Mr Igboho and others to further canvas a Yoruba nation.\n“The attack on Sunday Igboho’s house is most unfortunate.\nA taxi driver in Ibadan, Rotimi Olayemi, said the Yoruba nation agitator is a necessary evil in Nigeria.\nYoruba Nation agitation is a political ideology to realise the independence and sovereign country for the Yoruba race in Nigeria but many political leaders in the region have rejected and kicked against the idea."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NEMA Raises Alarm Over 2021 Flooding, Unveils Guidelines For Disaster Management",
    "summarized_story": "Director General of National Emergency Management Agency (NEMA) Mustapha Habib Ahmed, raised the alarm during the presentation of the Disaster Risk Management Implications of the 2021 Seasonal Climate Prediction and Annual Flood Outlook in Abuja yesterday.\nThe NEMA boss advised the state government and other stakeholders to immediately commence the education and enlightenment of residents on the impending flood which he said had greatest damage potential of all disasters.\nAt the same time, some southern states of Nigeria including Lagos and Ogun are expected to experience later than normal onset dates”.\nEmergency responders are always local and we must give them the right information to enable effective disaster risk communication.\nHe appreciated NEMA for supporting the installation of weather stations in Gombe, Keffi and Ado Ekiti noting that the equipment would further enhance seasonal forecast services in the country."
  },
  {
    "headline": "NEMA Raises Alarm Over 2021 Flooding, Unveils Guidelines For Disaster Management",
    "summarized_story": "Director General of National Emergency Management Agency (NEMA) Mustapha Habib Ahmed, raised the alarm during the presentation of the Disaster Risk Management Implications of the 2021 Seasonal Climate Prediction and Annual Flood Outlook in Abuja yesterday.\nThe NEMA boss advised the state government and other stakeholders to immediately commence the education and enlightenment of residents on the impending flood which he said had greatest damage potential of all disasters.\nAt the same time, some southern states of Nigeria including Lagos and Ogun are expected to experience later than normal onset dates”.\nEmergency responders are always local and we must give them the right information to enable effective disaster risk communication.\nHe appreciated NEMA for supporting the installation of weather stations in Gombe, Keffi and Ado Ekiti noting that the equipment would further enhance seasonal forecast services in the country."
  },
  {
    "headline": "BREAKING: Kenyan Govt Denies Involvement In Nnamdi Kanu’s Arrest",
    "summarized_story": "The Kenya Government has dismissed claims that it was involved in the arrest and extradition of Nnamdi Kanu, leader of the outlawed Indigenous People of Biafra (IPOB) to Nigeria.\nHowever, the British High Commission in Nigeria had denied that the IPOB leader was arrested or extradited from the UK, where he is a citizen.\nAt a press briefing by the Kenyan High Commission in Nigeria in Abuja on Friday, the High Commissioner, Ambassador (Dr.) Wilfred Machage, denied the involvement of his country in the whole saga.\nRecall that Nnamdi Kanu’s family and the IPOB had earlier accused the Kenyan government of having committed the most serious violation of international law.\nKanu was arrested last Sunday by what the Nigerian government described a combined operation of Nigerian and foreign security services."
  },
  {
    "headline": "BREAKING: Kenyan Govt Denies Involvement In Nnamdi Kanu’s Arrest",
    "summarized_story": "The Kenya Government has dismissed claims that it was involved in the arrest and extradition of Nnamdi Kanu, leader of the outlawed Indigenous People of Biafra (IPOB) to Nigeria.\nHowever, the British High Commission in Nigeria had denied that the IPOB leader was arrested or extradited from the UK, where he is a citizen.\nAt a press briefing by the Kenyan High Commission in Nigeria in Abuja on Friday, the High Commissioner, Ambassador (Dr.) Wilfred Machage, denied the involvement of his country in the whole saga.\nRecall that Nnamdi Kanu’s family and the IPOB had earlier accused the Kenyan government of having committed the most serious violation of international law.\nKanu was arrested last Sunday by what the Nigerian government described a combined operation of Nigerian and foreign security services."
  },
  {
    "headline": "Last US, NATO Forces Leave Key Afghanistan Base",
    "summarized_story": "The last US and Nato forces have left Afghanistan’s Bagram airbase, the centre of the war against militants for some 20 years.\nThe pull-out could signal that the complete withdrawal of foreign forces from Afghanistan is imminent.\nPresident Joe Biden has said US forces will be gone by 11 September.\nBut the withdrawal from the sprawling base, north of Kabul, comes as the main jihadist group, the Taliban, advances in many parts of Afghanistan.\nThe attacks were carried out by al-Qaeda, an international jihadist group then based in Afghanistan with the support of the Taliban, who had been in control of the country since the 1990s."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Nnamdi Kanu: Kenya unaware of IPOB leader’s arrest, says official",
    "summarized_story": "Also, an Official in the Kenya Ministry of Interior said that the ministry is not aware of the “extradition” of Nnamdi Kanu to Nigeria.\nThe PUNCH had reported that the circumstances of Kanu’s arrest have been a subject of media speculation in Nigeria.\nWhile some reports have named the United Kingdom, the Czech Republic, and Israel as countries where Kanu may have been in recent times, the IPOB leader’s family claimed that he was re-arrested in Kenya.\nAlso, Muteshi while dismissing the family’s claim told Kenya’s Nation that it was not possible to tell whether Mr Kanu had entered Kenyan territory.\n“We will continue to respect and honour the obligations,’’ he saidMohammed noted that the forensic investigation carried out so far had revealed a treasure trove of information on the proscribed IPOB leader and his collaborators."
  },
  {
    "headline": "Nnamdi Kanu: Kenya unaware of IPOB leader’s arrest, says official",
    "summarized_story": "Also, an Official in the Kenya Ministry of Interior said that the ministry is not aware of the “extradition” of Nnamdi Kanu to Nigeria.\nThe PUNCH had reported that the circumstances of Kanu’s arrest have been a subject of media speculation in Nigeria.\nWhile some reports have named the United Kingdom, the Czech Republic, and Israel as countries where Kanu may have been in recent times, the IPOB leader’s family claimed that he was re-arrested in Kenya.\nAlso, Muteshi while dismissing the family’s claim told Kenya’s Nation that it was not possible to tell whether Mr Kanu had entered Kenyan territory.\n“We will continue to respect and honour the obligations,’’ he saidMohammed noted that the forensic investigation carried out so far had revealed a treasure trove of information on the proscribed IPOB leader and his collaborators."
  },
  {
    "headline": "EFCC Arraigns Two In Rivers For Alleged N10.7m Oil Fraud",
    "summarized_story": "By JUMOKE SANNIThe Port Harcourt Zonal Office of the Economic and Financial Crimes Commission, EFCC, on Thursday, July 1, 2021 arraigned Chukwuma Samuel Kaniku and Muhammad Abdullahi before Justice S. I.\nIn view of their pleas, prosecution counsel, N. A. Dodo prayed the court to fix a date for commencement of trial.\nHowever, counsel to the 1st defendant, S. U. Amakiri made an oral application for the bail of the 1st defendant and it was declined by the court.\nAlso, counsel to the 2nd defendant, M. M. Suleiman, prayed the court for a short adjournment to enable him file an application for the bail of his client.\nJustice Mark ordered that the defendants be remanded in Port Harcourt’s Correctional Centre and adjourned the matter till July 14, 2021 for hearing of bail applications."
  },
  {
    "headline": "EFCC Arraigns Two In Rivers For Alleged N10.7m Oil Fraud",
    "summarized_story": "By JUMOKE SANNIThe Port Harcourt Zonal Office of the Economic and Financial Crimes Commission, EFCC, on Thursday, July 1, 2021 arraigned Chukwuma Samuel Kaniku and Muhammad Abdullahi before Justice S. I.\nIn view of their pleas, prosecution counsel, N. A. Dodo prayed the court to fix a date for commencement of trial.\nHowever, counsel to the 1st defendant, S. U. Amakiri made an oral application for the bail of the 1st defendant and it was declined by the court.\nAlso, counsel to the 2nd defendant, M. M. Suleiman, prayed the court for a short adjournment to enable him file an application for the bail of his client.\nJustice Mark ordered that the defendants be remanded in Port Harcourt’s Correctional Centre and adjourned the matter till July 14, 2021 for hearing of bail applications."
  },
  {
    "headline": "Lagos rally will hold tomorrow: Igboho’s spokesman",
    "summarized_story": "Despite the warning by Lagos Commissioner of Police, CP Hakeem Odumosu against holding any rally in Lagos, spokesman of Sunday Igboho, the Yoruba Nation agitator said they are unstoppable.\nA spokesman for Sunday Igboho, Olayomi Koiki said the 3 July rally will go ahead at Ojota, despite the storming of Igboho’s Ibadan home by the DSS and the arrest of 13 people.\n“I can still confirm officially that the Lagos rally in as much as whatever news or rumours you’ve been listening to from different outlets, will go as planned”, Koiki said in a video posted on Facebook.\n“The rally in Lagos is going to be a peaceful rally, it is going to be a mega rally, do not be disturbed about what happened.\nThe agency which said it recovered 10 guns in Igboho’s Ibadan home, claimed the Yoruba Nation activist was planning to wage a violent insurrection against the Nigerian State."
  },
  {
    "headline": "Juan Mata extends contract with Manchester United",
    "summarized_story": "By Muhaimin OlowoporokuManchester United midfielder Juan Mata has agreed a new one-year contract to stay at Old Trafford until next summer.\nThe new contract will take Mata into a ninth season as a United player, having joined from Chelsea in January 2014 for what was then a club record £37.1m transfer fee.\nMata has played 273 times for United but his role last season was significantly reduced as a result of the 2020 arrival of Bruno Fernandes and the continued rise of Mason Greenwood.\nWhen speaking about Mata’s future in May, United boss Ole Gunnar Solskjaer explained that the player would have the final say over whether he was to stay or go.\nWith United willing to offer a new contract, Mata has chosen to stay, despite the likelihood that he will remain a back-up player in a squad that has now added Jadon Sancho to the mix."
  },
  {
    "headline": "Photos: DSS orders forensics into Igboho’s guns, amulets",
    "summarized_story": "The Department of State Services(DSS) on Thursday night said “Further exploitation and forensic analysis” of the items seized in the Ibadan home of Sunday Igboho, are ongoing.\nSpokesman of the agency, Dr. Peter Afunanya made this known on Thursday night as he displayed the men and materials seized during the early morning raid.\nThe agency exhibited weapons, amulets and travelling passports.\nAmong the ‘offensive’ weapons was $5 in five one dollar currency.\nAlso exhibited were the 13 people arrested in Igboho’s home in Soka, Ibadan."
  },
  {
    "headline": "Kenyan Government Denies Being Involved In Kanu’s Arrest",
    "summarized_story": "The Kenyan government has denied involvement in the arrest and extradition to Nigeria of Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB.\nKenyan authorities have stated that they are unable to confirm whether Nnamdi Kanu was arrested in the East African country.\nRecall that Nigerian authorities hinted that Nnamdi Kanu was apprehended in London, United Kingdom, before being extradited to Nigeria.\n“I can’t know that,” Mr Muteshi told Kenyan Newspaper, Nation, when asked whether the claims made by the family were true.\nAccording to the newspaper, Kenyan Government Spokesperson Cyrus Oguna refused to comment on the situation."
  },
  {
    "headline": "Igboho Should Be Thankful Buhari’s Government Only Planted Guns, Not Bombs In His House — Deji Adeyanju",
    "summarized_story": "Deji Adeyanju, a human rights activist, claims that the Nigerian government planted firearms at the home of Yoruba independence hero Sunday Adeyemi, also known as Sunday Igboho.\nDeji revealed this in a tweet condemning the government’s security operatives’ killing of two individuals in Igboho’s home.\nHe further stated that Igboho should be grateful that government operatives had planted guns in his home rather than bombs.\n“Igboho should be thanking God that it is only guns they planted in his house and not bombs.\n“This hopeless government killed 2 people in Igboho’s house and they are acting like they didn’t committed any crime today,” he said."
  },
  {
    "headline": "Sunday Igboho: Yoruba Nation Lagos Rally Will Hold – Co-organisers Dare Police",
    "summarized_story": "Ilana Omo Oodua (IOO), a co-organizer of the Yoruba Nation demonstration, has promised to go ahead with or without Sunday Igboho.\nAfter Nigerian forces invaded his residence in the Soka neighborhood of Ibadan on Thursday, Igboho called off the march.\nA source in the IOO, a body of self-determination Yoruba groups, told DAILY POST that the rally will go on as planned.\nI am telling you now that the Yoruba Nation rally will hold.\n“The Ilana Omo Oodua under the leadership of Professor Akintoye already made it clear that we will come out,” he said."
  },
  {
    "headline": "REVEALED: Identity Of One Of Sunday Igboho’s Aides Killed By DSS During Raid On His House",
    "summarized_story": "Two men were killed but the identity of the other has yet to be ascertained at the time of filing this report.\nAlso, Koiki alleged that only one of the men was shot at while the other was butchered to death by the DSS.\nHe wrote, “May your soul rest in peace, killed by DSS working for Nigeria government during the attack on Chief Sunday Igboho house on the 1st of July 2021.\nThey killed him in cold blood.”Meanwhile, the DSS confirmed the attack on Igboho’s house stating that they killed two allies of the Yoruba rights activist, during the invasion of his residence in Ibadan, Oyo state.\nHe also declared Igboho wanted, urging him to report to the nearest police station."
  },
  {
    "headline": "Breaking: Activist, Sunday Igboho, makes u-turn on Yoruba nation rally in Lagos",
    "summarized_story": "Despite the Department of State Security (DSS) raid on residence of Yoruba Nation Agitator, Chief Sunday Adeyemo popularly known as Sunday Igboho, the Yoruba Nation rally in Lagos will go on as planned.\nBut Lagos Commissioner of Police, CP Hakeem Odumosu warned Igboho and other agitators not to stage any rally in Lagos.\nHe stated that anyone caught participating or facilitating the rally would be dealt with within according to the law.\nHe said: “I can still confirm officially that the Lagos rally in as much as whatever news or rumours you’ve been listening to from different outlets, will go as planned“The 3rd of July Mega rally will go as planned.\n“The rally in Lagos is going to be a peaceful rally, it is going to be a mega rally, do not be disturbed about what happened."
  },
  {
    "headline": "Kanu will get fair deal he denied others, FG assures",
    "summarized_story": "The Nigerian government Thursday assured Nigerians and the international community that the rearrested leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, will be given fair trial.\nAssurance on fair trialAddressing journalists in Abuja, Minister of Information and Culture Lai Mohammed assured the IPOB leader would be given fair trial while the case lasts.\n“We can tell you that the forensic investigation carried out so far has revealed a treasure trove of information on the proscribed IPOB leader and his collaborators.\nDecapitate them,” the letter further quoted Kanu’s alleged instructions to IPOB members.\nBelow is a list of IPOB attacks in the South East/South South Zones as contained in the letter:1."
  },
  {
    "headline": "13 years after, Senate Passes PIB amidst tension",
    "summarized_story": "At a storming session Thursday, the Senate passed for third and final reading the much expected Petroleum Industry Bill (PIB) 13 years after it was introduced.\nThe joint committee had in the 540-page report, recommended 3% for Host Communities Development Trust Fund which the Deputy Senate President Ovie Omo-Agege in his earlier remarks, commended and thanked the Senate leadership for.\nTroubleshooting effortBut in a trouble shooting effort, Senate Leader Yahaya Abdullahi quickly rose to appeal to Sekibo for withdrawal of the point of order.\nSo I appeal to my brother and friend, Senator Sekibo to please withdraw this point of order.”Making similar appeal, Senate President Lawan said: “It is the right of every senator here to call for division, it’s your right.\nThe 30%, as stated in the report, is to be taken from NNPC Limited’s profit from oil and gas."
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Igboho’s Men Engaged Us In Gun Battle, Says DSS",
    "summarized_story": "The Department of State Services (DSS) claims men suspected to be guards of Sunday Igboho engaged operatives of the agency in a gun battle during a raid on the home of the Yoruba Nation agitator in Ibadan on Thursday morning.\nThis is according to the DSS spokesman, Peter Afunanya, who stated this during a press conference on Thursday following the arrest of 13 of Igboho’s armed men by a team of joint security operatives.\n“On approach to his residence, the team came under heavy gun attack by nine men suspected to be Igboho’s guards.\n“In the course of the exchange, two of the armed men were gunned down, while the rest were subdued and arrested.\nSunday Adeyemo, aka Sunday Igboho, is now on the run.”While noting that two of Igboho’s men were killed, the secret service said DSS operative sustained injuries."
  },
  {
    "headline": "We Will Hold ‘Yoruba Nation’ Rally In Lagos On Saturday – Ilana Omo Oodua",
    "summarized_story": "The umbrella body of Yoruba Self-Determination Groups, Ilana Omo Oodua (IOO), has confirmed that the pro-Yoruba nation’s rally scheduled to hold in Lagos State on Saturday, July 3, will still take place.\n“Our rally scheduled to hold on Saturday will still hold without any fear or intimidation and we promise to be peaceful like we have always been,” Adeleye said.\nMeanwhile, the IOO, in another letter to the Lagos State Commissioner of Police, Mr. Hakeem Odumosu, and copied to the Governor of Lagos State, Mr. Babatunde Sanwoolu by its General Secretary and Legal Adviser, Arc.\nOlasupo Ojo respectively, urged the state Police Command to ensure that the rally is peaceful, orderly and not hijacked by hoodlums as earlier insinuated by the police.\nOn our own part, we promise to cooperate with the police towards ensuring that the rally is peaceful and orderly,” the statement added."
  },
  {
    "headline": "PHOTOS: DSS Confirms Raid On Igboho’s House, Parades 13 Suspected Armed Yoruba Nation Agitators",
    "summarized_story": "The Department of State Services (DSS) on Thursday said a team of joint security operatives raided the home of Yoruba Nation agitator Sunday Adeyemo aka Sunday Igboho in Ibadan, arresting 13 of his armed men.\nHe said the raid was based on intelligence that Igboho was stockpiling arms to cause chaos within the region.\nAfunanya said when the security operatives approached the house, they were attacked by nine of Igboho’s boys who engaged them in a gun duel but were subsequently overpowered.\nBelow are photos of items recovered from Igboho’s house.\nREAD ALSO: Gunmen ‘Invade’ Sunday Igboho’s House, Again – AideREAD ALSO: Attack On Sunday Igboho A Sad Reminder Of What Nigerians Went Through Under Abacha – AfenifereA full communique regarding the joint operation at Igboho’s house appears below."
  },
  {
    "headline": "Nigeria-UK Discuss Electoral Act Amendment, PIB And Twitter Ban",
    "summarized_story": "The meeting which lasted for almost an hour served as a platform for discussing bilateral issues relating to Asset Recovery, Anti-corruption crusade, amendment of the Electoral Act, the Audit Bill, Petroleum Industry Bill, Twitter ban, and counter-terrorism approaches.\nHe said to strengthen the fight against corruption the government came up with the Proceeds of Crime Bill and Audit Bill among others.\nHe maintained that the interest of Nigerian interest matters most for any company that wants to do business in the country.\n“If you want to operate as a business entity in Nigeria, you must do so within the context of Nigerian laws.\nNothing offensive and nothing that breaches the Nigerian laws should be entertained”."
  },
  {
    "headline": "Biden Offers Comfort As Rescue Suspended At Florida Building Collapse",
    "summarized_story": "The 18 confirmed dead so far include two children, aged four and 10, she said late Wednesday.\nBiden and first lady Jill Biden left the White House early for Surfside, saying they wanted to support first responders and comfort grieving relatives.\nThank you, thank you, thank you.”The couple stopped at an improvised memorial wall one block from the mangled building, which rose above the fence covered with photos, homemade signs and flowers.\nElad Edri, deputy commander of an Israeli search and rescue team, said rescuers had completed a map outlining bedrooms and other living spaces in the building where residents could be trapped.\nIn a letter to residents in April, Jean Wodnicki, chair of the condo association, described “accelerating” damage to the 40-year-old building since then."
  },
  {
    "headline": "BREAKING: Kenyan Govt denies involvement in arrest, extradition of Nnamdi Kanu",
    "summarized_story": "Kenyan government has denied involvement in arrest and extradition of the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu.\nAt a press briefing, the Kenyan High Commission in Nigeria, Wilfred Machage, said it is to fuel antagonistic attacks between Nigeria and Kenya."
  },
  {
    "headline": "AIG Zone 10 Says Police To Partner Vigilantes, Hunters in Kebbi, Others",
    "summarized_story": "In a bid to end the activities of bandits in Sokoto, Kebbi and Zamfara states, the Assistant Inspector General of Police in charge of zone 10 Ali Aji Janga says the zone will prioritised intelligence gathering, collaboration with sister security agencies and also incorporate members of the vigilantes and local hunters in the fight against banditry.\nThe AIG revealed this during a conference with Police Commissioners from Sokoto, Kebbi and Zamfara states at the zonal headquarters in Marina area of Sokoto state.\nThe Zone 10 Police zonal Headquarters comprises of Sokoto, Kebbi and Zamfara police commands with headquarters in Sokoto state.\nAccording to him, it has now become important to engage the local vigilantes and hunters who are from these areas a and also understand the terrain to support the Nigeria Police in the fight against Armed bandits.\nAIG Janga is also concern about the safety of arms and ammunition in the zone as well as training of personnel on weapon handling in the three commands of Sokoto, Kebbi and Zamfara that make up the zone."
  },
  {
    "headline": "Sokoto’ll Be Fulcrum of PHC Development – UNICEF",
    "summarized_story": "The United Nations Children’s Fund (UNICEF) says it will develop and unfold a template that will make Sokoto state an exemplar and fulcrum for the enhancement of primary health care (PHC) in the North-Western region of Nigeria.\nThis was disclosed by the UNICEF Country Representative, Mr Peter Hawkins, who led a team of two other health experts on a visit to Governor Aminu Tambuwal of Sokoto state at the state’s liaison office in Abuja.\nGovernor Tambuwal on his part assured the UNICEF that with the huge technical and financial assistance being proposed for disbursement to various states, the efforts of the body will receive strong support from the Nigerian Governors Forum (NGF).\nIn his capacity as the Deputy Chairman of the NGF, Tambuwal says they will :continue to do their best and work to see that the states buy-in into the program.\nMr. Hawkins says since last year, after a meeting with states in the Federation, UNICEF had mulled the idea of Sokoto state as part of its focal point of primary health care development in the Northern region and Nigeria."
  },
  {
    "headline": "Favourites Clash as Belgium Battle Italy for Euro Semi-final Spot in Munich",
    "summarized_story": "Belgium and Italy will go head-to-head for a spot in the Euro 2020 semi-finals when they meet in Munich for their quarter-final tie on Friday.\nTwo teams that have each won a record 14 games in a row in the European Championship,” Martinez added.\nBut the prospect of facing Belgium, who have also won four out of four games at Euro 2020, does not mean Mancini will adopt more conservative tactics.\nItaly have reached the quarter-final of the European Championship for a fourth consecutive tournament.\nIndeed, that accounts for three of Italy’s five European Championship penalty shootouts – more than any other nation prior to the 2020 edition."
  },
  {
    "headline": "Covid: Australia to Halve Arrivals and Trial Home Quarantine",
    "summarized_story": "Australia will halve the number of international arrivals it accepts after Covid outbreaks put half the population in lockdown this week.\nVirus leaks from hotel quarantine – which is mandatory for all arrivals – have been the source of numerous outbreaks across the country.\n“We have seen breaches occur, predominantly as a result of infection control procedures and human error… those issues need to continue to be strengthened,” Mr Morrison said.\nThe Delta outbreaks prompted emergency talks between the prime minister and state and territory governments.\nMr Morrison reiterated on Friday that all Australians would be able to receive their first dose by the end of 2021."
  },
  {
    "headline": "OPEC Defers Decision on Oil Output Cuts",
    "summarized_story": "Earlier, there were expectations that the cartel could boost production output by another 400,000 barrels beginning in August, an increase seen as likely to be easily absorbed by the market amid expectations for rising demand.\nAt the inconclusive meeting, the OPEC+ ministerial committee had proposed the planned increase to the wider group, but a disagreement between Saudi Arabia and Russia, the biggest producers in the OPEC+ alliance, remained largely unresolved.\nBefore the deferment of the meeting, oil prices reacted with Brent crude trading above $75 a barrel, close to a two-and-a-half-year high as the policy from August to December was being awaited.\nWhile the full house decided to shift a definitive decision on the matter till today, OPEC had earlier finished its meeting just before an OPEC+ ministerial committee met after that, before the inconclusive one by OPEC+ ministers.\nHe, however, stated that OPEC still sees growth in the second half of the year."
  },
  {
    "headline": "Twitter’s Suspension In Nigeria’s National Interest, Attorney-General Malami Insists",
    "summarized_story": "The Attorney-General of the Federation (AGF) and Minister of Justice, Mr. Abubakar Malami on Thursday insisted that the suspension of Twitter’s operations in Nigeria was informed by the need to protect the national interest.\nMalami stated that the interest of Nigeria is paramount in all considerations and must be respected by any company that wants to do business in the country.\nOn PIB, the minister said steps had been taken to ensure pending bills were transmitted to President Muhammadu Buhari for assent.\nHe said to strengthen the fight against corruption, the government came up with the Proceeds of Crime Bill and Audit Bill, among others.\nLaing thanked the minister for the “clarification” of the issues, saying that the steps taken in the fight against corruption and electoral reforms are “really encouraging.”THISDAY"
  },
  {
    "headline": "US Hands Bagram Airfield to Afghans after Nearly 20 Years",
    "summarized_story": "After nearly 20 years, the U.S. military left Bagram Airfield, the epicenter of its war to oust the Taliban and hunt down the al-Qaida perpetrators of the 9/11 terrorist attacks on America, two U.S. officials said Friday.\nIn a worrying development, the government has resurrected militias with a history of brutal violence to assist the Afghan security forces.\nAt its peak around 2012, Bagram Airfield saw more than 100,000 U.S. troops pass through its sprawling compound barely an hour’s drive north of the Afghan capital Kabul.\nGlobalSecurity, a security think tank, says Bagram includes three large hangars, a control tower and numerous support buildings.\nThere was no immediate comment from Afghan officials as to the final withdrawal from Bagram Airfield by the U.S. and its NATO allies."
  }
]