[
  {
    "headline": "Insecurity: ICC to investigate abduction of Nigerian schoolchildren",
    "summarized_story": "The Prosecutor of the International Criminal Court is set to investigate the numerous cases of abduction of Nigerian school children, especially in its northern region following a petition filed by the Socio-Economic Rights and Accountability Project.\nA. Khan, and received a response from the Head of the Information and Evidence Unit, Mark P. Dillon, on behalf of the ICC Prosecutor.\n“By this decision, the ICC prosecutor has taken a significant step toward ensuring that those suspected to be responsible for grave crimes against Nigerian schoolchildren are exposed, and held to account.\nImpartial justice and reparation will deal a decisive blow to impunity of perpetrators, and improve access of Nigerian children to education.\nSERAP will work closely with the ICC to achieve these important objectives,” Oluwadare said in the statement."
  },
  {
    "headline": "State Congress: Ebonyi PDP debunks claims of imposition",
    "summarized_story": "The Ebonyi State Chapter of the Peoples Democratic Party has debunked the claims that its newly elected Chairman, Mr Tochukwu Okorie, was foisted on party faithful through an undemocratic process.\nBut while reacting to Onu’s petition to the Congress Appeal Committee, Okorie said there was no iota of truth in his opponent’s claims, urging the Committee and the general public to disregard them as frivolous and baseless.\n“Other documents to prove my claims and attached herewith include a financial waiver granted to candidates in Ebonyi State by the National Working Committee of PDP allowing them to obtain forms without paying.\n“Recall that seven aspirants had initially indicated their interest to vie for the position of the Chairman of the PDP Ebonyi State chapter.\nThe State Congress Committee Chairman, Senator Ben-Collins Ndu, in his powers as the Returning Officer, declared me as the winner."
  },
  {
    "headline": "Ohanaeze Ndigbo attacks Malami over allegations against Nnamdi Kanu",
    "summarized_story": "The Attorney-General of the Federation had addressed a press conference last Friday in Abuja, where he levelled extensive allegations against Nnamdi Kanu, leader of the IPOB.\nReacting to Malami’s outburst, Ohanaeze Ndigbo expressed disappointment that the Attorney General descended to the level of total ignorance and shopping for offences just to nail Kanu.\nOhanaeze Ndigbo calls on the Nigeria Barr Association, NBA, to re-examine Mr. Abubakar Malami in a bid to establish his suitability and competence for the elevated Office he occupies.\n“Ohanaeze Ndigbo still believes that all these grandstanding and hyperboles by the federal government about the Igbo or IPOB are machinations in self-denial.\nThe Ohanaeze Ndigbo Worldwide and the Leader of IPOB, Mazi Nnamdi Kanu are united against the orchestrated marginalization of the Igbo in one Nigeria."
  },
  {
    "headline": "NDLEA intercepts 2,060kg Heroin, Others at Lagos airport, Ondo, Edo, Kano",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency, NDLEA, have intercepted over 2,060 kilograms of assorted drugs including heroin, methamphetamine, cannabis, tramadol and rohypnol in various operations at the Murtala Muhammed International Airport, MMIA, Lagos as well as Ondo, Edo, Kano, Kaduna, Plateau and some courier companies.\nTwo consignments of heroin weighing 4.40kg and 550grams were intercepted on October 6 and 15 respectively at the cargo shed of the MMIA, Ikeja.\n“Attempts by another freight agent, Igwe Okoye Onwukwe to export two consignments of cannabis to the United Kingdom have been foiled by NDLEA operatives.\nLikewise in Kaduna, another suspected fake soldier, Abiodun Ademoya, from Akure south in Ondo state was arrested in Zaria with 11.6kg of cannabis.\nCommending the officers and men of the MMIA, Ondo, Edo, Kano, Kaduna and Plateau Commands as well as DOGI, for their resilience and tenacity, Chairman/Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "SERAP’S petition: ICC prosecutor seeks investigation into abduction of Nigerian schoolchildren",
    "summarized_story": "The ICC prosecutor’s decision followed a petition sent to the court by the Socio-Economic Rights and Accountability Project, SERAP.\nThe organisation, had in the petition dated 4 September 2021 urged the ICC prosecutor, Mr Karim A.\nSERAP’s petition to the ICC prosecutor, read in part: “Senior government officials know well or ought to know that their failure to prevent these crimes will violate the children’s human rights and dignity.\nAccording to reports, more than 100 of those girls are still missing.”The ICC prosecutor decided to seek an investigation after undertaking a preliminary examination of the cases of abduction of children in the country.\nIf the investigation identifies suspected perpetrators of the crimes alleged in SERAP’s petition, prosecutors can ask judges to issue international arrest warrants, which can remain under seal to help authorities apprehend those charged."
  },
  {
    "headline": "Fed Poly Bauchi sacks 2 lecturers for alleged sexual harassment",
    "summarized_story": "The Governing Council of the Federal Polytechnic, Bauchi has approved the dismissal of two lecturers, Malam Abubakar Baba and Mr Adebusoye Sunday over allegations of sexual harassment levelled against them.\nThe Rector, Mr Sunusi Gumau, announced their dismissal while briefing newsmen at the end of the 98th meeting of the council, on Sunday in Bauchi.\nIn the rules of the Polytechnic, if an issue of this magnitude happens, the complainant has to write and immediately she wrote.\n“Today; the council has finally approved the dismissal of Abubakar Baba from the services of the Federal Polytechnic, Bauchi,” said the Rector.\nMeanwhile, the Rector revealed that the Students’ Academic Board of the institution had also expelled 30 students for various offences."
  },
  {
    "headline": "COVID-19: NCDC registers additional 159 infections, one death as of Oct 23",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has registered an additional 159 new COVID-19 infections and one death across 13 states of the federation on Saturday.\nRecall that 159 additional cases reported on Saturday, indicate a decreased from the 176 cases posted previously in the country.\nWhile Delta in the South South reported 10 cases, Lagos State, the epicentre of the disease, reported seven cases followed by Plateau with five cases.\nIt also includes backlog of cases reported from Lagos State.\nIn Week 41, the number of discharged cases increased to 1,869 from 1,177 in week 40."
  },
  {
    "headline": "Goronyo market attack: CAN consoles Sokoto people",
    "summarized_story": "The Christian Association of Nigeria (CAN), has condoled with the Sultan of Sokoto, Alhaji Muhammadu Sa’ad Abubakae III, the people and the government of Sokoto State on the recent killing of innocent people and destruction of property by bandits at the Goronyo Central Market in the state.\nCAN noted with shock, pain and disappointment the reported attacks and the loss of many lives despite all efforts being made by the government to stop these criminal elements.\nThe statement lamented that while still counting the loss of lives and property at the Goronyo market, the criminals also attacked the Kaduna-Abuja train line.\nThe Chriatian body said, “We Nigerians are no longer sleeping with our eyes closed because we are all living in fear.\nThis is too bad.”Bandits invade Sokoto market, kill scores"
  },
  {
    "headline": "Two lecturers sacked over alleged sexual harassment in Bauchi",
    "summarized_story": "The Governing Council of the Federal Polytechnic, Bauchi, has approved the dismissal of two lecturers, Malam Abubakar Baba and Mr Adebusoye Sunday, accused of allegedly harassing their students sexually.\nThe Rector, Mr Sunusi Gumau, stated this while briefing newsmen at the end of the 98th meeting of the council, on Sunday in Bauchi State.\nGumau said that the decision was reached after a thorough investigation of the matter by a committee set up by the institution.\n“This is the final verdict of all that has been making waves in the media concerning the issue of our staff reported on alleged case of rape.\n“Today; the council has finally approved the dismissal of Abubakar Baba from the services of the Federal Polytechnic, Bauchi,” NAN quoted the Rector as saying."
  },
  {
    "headline": "Zamfara: Military onslaught forces bandits to relocate to Katsina",
    "summarized_story": "A traditional ruler, the district Head of Batsari in Katsina State, Alhaji Tukur Mu’azu, has lamented that bandits who escaped from the military onslaught in Zamfara State are now relocating to Katsina State, especially to communities and villages within Batsari Local Government Area of the State.\nThe district head gave the names of the communities where the bandits are now erecting their tents and hiding as Yaso Duba, Sabon-garin Dunburawa, Baking – Ragi and Labor.\nAccording to the district Head, the relocation of the bandits to Katsina state was due to the pressure on them in the forests of Zamfara and Katsina States.\n“Batsari Local Government Area of Katsina State is one of the areas worse hit by insurgency due to its proximity to Zamfara State and the dreaded Rugu Forest.\nAlhaji Mua’zu said the success could not be unconnected to the ongoing onslaught against the bandits in the forests, as well as the stiff security measures enforced by the Zamfara lState Government."
  },
  {
    "headline": "​Buhari yet to sign HND, BSc dichotomy bill passed in June",
    "summarized_story": "President Muhammadu Buhari is yet to sign the Higher National Diploma (HND) and Bachelor’s Degree (BSc) dichotomy bill.\nThe Senior Staff Association of Nigerian Polytechnics (SSANIP) has urged Buhari to give his assent to the legislation.\nHowever, SSANIP expressed disappointment about the non-payment of salaries of some state polytechnics workers.\nOgunsipe listed Rufus Giwa Polytechnic in Owo, Ondo (11-month unpaid salaries) and Osun State Polytechnic in Iree, Osun (30-month unpaid half salaries).\nOthers are College of Technology, Esa-Oke in Osun (30-month unpaid half salaries) and Abia State Polytechnic in Aba, Abia (28-month unpaid salaries)."
  },
  {
    "headline": "Group raises alarm over threat to life of Oyo Deputy Governor, tasks police",
    "summarized_story": "Our correspondent gathered that the deputy Governor had last week written a petition to the state police command, alleging threat to his life.\nThis made the deputy Governor to raise the alarm and he reported the incidents to the commissioner of Police.\nOlowonjaye advised the CP to put in place machineries to ensure the safety of the Deputy Governor.\nOlowonjaye while speaking further condemned the attack and destruction of property of the wife of the Deputy Governor, Professor Amdalat Olaniyan.\nHe spoke further by describing as unwarranted the purported move to impeach the Deputy Governor."
  },
  {
    "headline": "BREAKING: Three cops feared killed as gunmen attack another Ebonyi police station",
    "summarized_story": "Three policemen were feared killed in a Sunday morning attack by gunmen on a Police Divisional headquarters at Unwana, Afikpo North local government area of Ebonyi State.\nThe gunmen were said to have attacked the Division around 2am and killed one Police constable and two Inspectors.\nThe source said one of the gunmen was killed by the police who repelled the attack.\nHe said:“They killed three policemen – one constable and two inspectors and the police killed one of the gunmen.\n“The men were masked but the one killed had his face unveiled by the police to ascertain his identity."
  },
  {
    "headline": "VIDEO: Gov Makinde inspects Abolongo Correctional Facility after gunmen attack",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "36 Speakers to Buhari: declare bandits terrorists",
    "summarized_story": "36 House of Assembly Speakers have called on President Muhammadu Buhari to declare bandits as terrorists and enemies of the nation.\nThis was their resolution at a Conference of Speakers of State Houses of Assembly in Katsina on Sunday.\nHe said: ’’We call on President Muhammadu Buhari to declare bandits as terrorists and enemies of the state.\nThe Conference has observed all the activities carried out by the bandits as containing the same mode of operations used by terrorists.\n- Advertisement -The Speakers’ Conference further commended Governors who gave their assents to the fund management bills passed by their respective State assemblies and called on those yet to do so to expedite action on the bill for effective implementation of financial autonomy for the state legislatures and judiciary."
  },
  {
    "headline": "Fed Poly Bauchi sacks two lecturers for alleged sexual harassment",
    "summarized_story": "The Governing Council of the Federal Polytechnic, Bauchi has approved the dismissal of two lecturers, Malam Abubakar Baba and Mr Adebusoye Sunday, accused of allegedly sexually harassing of their students.\nThe Rector, Mr Sunusi Gumau, stated this while briefing newsmen at the end of the 98th meeting of the council, on Sunday in Bauchi.\nGumau said that the decision was reached after thorough investigation of the matter by a committee set up by the institution.\n“Today; the council has finally approved the dismissal of Abubakar Baba from the services of the Federal Polytechnic, Bauchi,” said the Rector.\nMeanwhile, the Rector revealed that the Students’ Academic Board of the institution had also expelled 30 students for various offences."
  },
  {
    "headline": "Jailbreak: 1 soldier, 2 others feared dead",
    "summarized_story": "The security personnel that died or injured, as gathered, were attached to the Correctional Centre to provide security.\nA pick-up van, belonging to Operation Burst, which is a joint security network of Oyo State, was sighted at Abolongo riddled with bullets just as bloodstain was seen in the vehicle.\nSunday Sun reliably gathered that a total of 837 inmates were freed by the gunmen that came in large numbers on motorcycles.\nThe Director General of Operation Burst, Col. James Oladipo (rtd), said that the injured soldier was not dead as at 1:30p.m yesterday, saying, however, that the soldier was critically injured and he was not sure if he could survive the injury.\nThe Commandant of Amotekun Corps in Oyo State, Col. Olayinka Olayanju (rtd) told journalists on phone that one Amotekun Corps member died during the gun duel, while another sustained critical injury."
  },
  {
    "headline": "Oyetola reveals how Osun is keeping safe at Editors’ conference",
    "summarized_story": "They also have the responsibility for ensuring security, governance and economic development in their abodes.\nWe continue to insist that, rather than compete for relevance with conventional security agencies and other local security outfits, their activities should be complementary.\nGovernors of the Southwest, therefore, collaborated in establishing a regional security network, popularly known as Amotekun, to supplement the work of state security agencies in policing the region’s forests and roadways.\nThis security arrangement, otherwise known as community policing, has become necessary because our conventional security agencies are overstretched and sorely underfunded.\nOur response to this in the codification of our State’s first Youth Policy Document, comprising of themes of engagement across 4Es – Youth Empowerment, Youth Education, Youth Entrepreneurship and Youth Engagement segments."
  },
  {
    "headline": "Parallel congresses: More trouble for APC",
    "summarized_story": "Although ward and LG congresses have been a celebration of resentment and animosity, the recently concluded state congresses may have heightened the fragile peace among stakeholders in the party.\nIt was that bad that APC could rightly be described as a house of commotion and a party presently divided against itself.\nAlready, the gladiators are at each other’s throats over such primordial sentiment before the recently-concluded state congresses across the country.\nIf the party is claiming that there is no crisis trailing the congresses, we should ask those making such claims how many leaderships the congresses produced in their states.\nGovernors deploy state resources to control political parties in their states to decide which candidate will emerge."
  },
  {
    "headline": "Yes, I use sex toys –Kemi Stone, actress/filmmaker",
    "summarized_story": "Aside her first love: acting, the soft-spoken lady also deals in aphrodisiacs and sex toys.\nBut I have produced four movies including Ojo Kan, Ijogbon, Kemi Olode and Kadara Eda, which is new and not yet out.\nWhat is the movie, Kadara Eda all about?\nImmediately I got signed by the biggest skincare brand, House of Phreeda, I went on set of my new movie, Kadara Eda and I posted some location pictures.\nIt’s my new movie, Kadara Eda, which will be out in November."
  },
  {
    "headline": "Insecurity: Buhari no longer capable of protecting Nigerians –Ummah Getso, former YPP VP candidate",
    "summarized_story": "She was the vice presidential candidate of the Young Progressives Party (YPP) in the 2019 Presidential elections.\nPeople are now afraid of Nigeria and Nigeria is one of the best places to live, but see how we are turning it.\nIt started small, but I don’t know what is setting or blowing the fire, I don’t know what really happened to my people that this has continued to happen.\nNigerians don’t love themselves anymore, so much emphasis on our differences.\nWe should start thinking of a better future for this country and things can be fixed by the grace of God."
  },
  {
    "headline": "BREAKING: Senator Dino Melaye Did Not Graduate With A First-Class Degree From Baze University - Sources",
    "summarized_story": "Former Kogi West Senator in the eighth National Assembly, Dino Melaye, graduated with Second Class Lower Division and grappled with several “carry-overs” while studying Law at the Baze University in the Federal Capital Territory, Abuja, SaharaReporters has learnt.\nSaharaReporters obtained the Baze University convocation booklet which showed, contrary to trending reports that Melaye finished top of his class, that the senator finished with a second class division degree.\nSome online reports had claimed that Melaye emerged as the best graduating student of Baze University, Abuja, despite currently staying in Dubai, the United Arab Emirates.\nSaharaReporters has confirmed from documents that the former senator did not finish with a first class degree in Law from the university.\nSee Also Exclusive ABU Whistleblowers Contradict VC, Insist Dino Melaye Did Not Graduate“Dino and I are supposed to be ‘friends’ but differences never permitted while we were in school."
  },
  {
    "headline": "BREAKING: Senator Dino Melaye Did Not Graduate With A First-Class Degree From Baze University - Sources",
    "summarized_story": "Former Kogi West Senator in the eighth National Assembly, Dino Melaye, graduated with Second Class Lower Division and grappled with several “carry-overs” while studying Law at the Baze University in the Federal Capital Territory, Abuja, SaharaReporters has learnt.\nSaharaReporters obtained the Baze University convocation booklet which showed, contrary to trending reports that Melaye finished top of his class, that the senator finished with a second class division degree.\nSome online reports had claimed that Melaye emerged as the best graduating student of Baze University, Abuja, despite currently staying in Dubai, the United Arab Emirates.\nSaharaReporters has confirmed from documents that the former senator did not finish with a first class degree in Law from the university.\nSee Also Exclusive ABU Whistleblowers Contradict VC, Insist Dino Melaye Did Not Graduate“Dino and I are supposed to be ‘friends’ but differences never permitted while we were in school."
  },
  {
    "headline": "EXCLUSIVE: Buhari To Visit Saudi Arabia, Europe On Tuesday To Attend Lesser Hajj, Undergo Medical Checkup",
    "summarized_story": "President Muhammadu Buhari will on Tuesday leave the country for Saudi Arabia and later proceed to France and Scotland where he is expected to begin a fresh round of medical checkup, SaharaReporters has learnt.\nSaharaReporters gathered that Buhari will spend up to two weeks on his medical tour but his first point of call is Saudi Arabia for Umrah, otherwise known as the Lesser Hajj.\nFile Photo: Buhari medical tourismSaharaReporters learnt that the President after performing the Umrah will then go to Europe for his medical examinations.\n“Baba (Buhari) is going to Saudi Arabia, France and Glasgow from Tuesday.\nThe trip will not exceed two weeks but the first stop is Saudi Arabia."
  },
  {
    "headline": "EXCLUSIVE: Buhari To Visit Saudi Arabia, Europe On Tuesday To Attend Lesser Hajj, Undergo Medical Checkup",
    "summarized_story": "President Muhammadu Buhari will on Tuesday leave the country for Saudi Arabia and later proceed to France and Scotland where he is expected to begin a fresh round of medical checkup, SaharaReporters has learnt.\nSaharaReporters gathered that Buhari will spend up to two weeks on his medical tour but his first point of call is Saudi Arabia for Umrah, otherwise known as the Lesser Hajj.\nFile Photo: Buhari medical tourismSaharaReporters learnt that the President after performing the Umrah will then go to Europe for his medical examinations.\n“Baba (Buhari) is going to Saudi Arabia, France and Glasgow from Tuesday.\nThe trip will not exceed two weeks but the first stop is Saudi Arabia."
  },
  {
    "headline": "How I Made It Through Studying Law At Baze University By Osita Chidoka",
    "summarized_story": "Yes, I have graduated with an LLB Second-Class Upper from Baze University.\nAfter eight years of high-octane service, from the Federal Road Safety Corps (FRSC) to the Ministry of Aviation, Baze University was therapeutic.\nMy wife can't wait to form a law partnership with me, Chidoka and Chidoka, where she would be the senior partner.\nTo my children, thank you for all the support and be reminded that I will not accept a degree less than a second-class upper.\nHopeful about the future, proud that I applied Uche in learning and Uchu in Perseverance and commitment to earn a law degree."
  },
  {
    "headline": "'Cameroonian soldiers harassing us' --- Taraba LG chairman cries out",
    "summarized_story": "John Amamzalla, chairman of Kurmi LGA in Taraba state, says soldiers from Cameroon are harassing some communities under his council.\nAdvertisementAmamzalla said the soldiers have repeatedly invaded Mairogo and Tosso villages.\nThe LGA chairman said the soldiers claimed that they are looking for Ambazonian agitators, hence the invasion of these communities.\nAdvertisementIn May, TheCable had reported how IPOB and Ambazonia entered into an alliance for the exchange of personnel and weapons.\nAmamzalla said there is a need for the foreign soldiers to go through the right channels in their hunt for agitators."
  },
  {
    "headline": "'Cameroonian soldiers harassing us' --- Taraba LG chairman cries out",
    "summarized_story": "John Amamzalla, chairman of Kurmi LGA in Taraba state, says soldiers from Cameroon are harassing some communities under his council.\nAdvertisementAmamzalla said the soldiers have repeatedly invaded Mairogo and Tosso villages.\nThe LGA chairman said the soldiers claimed that they are looking for Ambazonian agitators, hence the invasion of these communities.\nAdvertisementIn May, TheCable had reported how IPOB and Ambazonia entered into an alliance for the exchange of personnel and weapons.\nAmamzalla said there is a need for the foreign soldiers to go through the right channels in their hunt for agitators."
  },
  {
    "headline": "Na’Abba: Northerners against zoning because they see Buhari's term as a waste",
    "summarized_story": "Ghali Umar Na’Abba, former speaker of the house of representatives, says many northerners see President Muhammadu Buhari’s term in office as wasted opportunity.\n“It is not as if northerners and southerners are at war, but in any relationship from time to time, you get some friction.\nSomeone told me that this man can’t even manage his home, how can he manage a country?\nAdvertisement“This idea of zoning, no matter how many times a president comes from a particular zone, it will never satisfy anybody.\nNa’Abba said for the country to be better, it must focus on building strong institutions and not strong men."
  },
  {
    "headline": "Na’Abba: Northerners against zoning because they see Buhari's term as a waste",
    "summarized_story": "Ghali Umar Na’Abba, former speaker of the house of representatives, says many northerners see President Muhammadu Buhari’s term in office as wasted opportunity.\n“It is not as if northerners and southerners are at war, but in any relationship from time to time, you get some friction.\nSomeone told me that this man can’t even manage his home, how can he manage a country?\nAdvertisement“This idea of zoning, no matter how many times a president comes from a particular zone, it will never satisfy anybody.\nNa’Abba said for the country to be better, it must focus on building strong institutions and not strong men."
  },
  {
    "headline": "Federal poly Bauchi sacks two lecturers over ‘sexual assault’",
    "summarized_story": "The Federal Polytechnic in Bauchi has sacked two lecturers of the institution accused of sexually harassing female students.\nGumau said the sacked lecturers include Musa Baba Abubakar of the general studies department and Adebusoye Michael Sunday of the nutrition and dietetics department.\n“This issue of Musa Baba, came up on August 3, 2021.\nAdvertisement“The Council today, has finally, approved the dismissal of Abubakar Musa Baba from the service of the Polytechnic, Bauchi.\nAlso, Adebusoye Michael Sunday is dismissed from the services of the Federal Polytechnic, Bauchi with effect from Saturday on a similar case."
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Technology is awesome, but it’s yet to conquer stuttering",
    "summarized_story": "Stuttering in a tech-enabled worldOne can be forgiven for thinking that there is a tech solution somewhere that does away with stuttering.\nStuttering has no known cure, and the best technology can currently do is what therapy does — treat or manage the condition like other speech defects.\nPeople can get the most out of treatment if they address stuttering early enough — preferably as children.\nNumbers don’t lieAccording to The Stuttering Foundation, stuttering affects 1% of the world’s population; depending on what global population you accept, that’s 78 or 79 million people.\n“Stuttering has shaped my personality; I’m reserved, and I don’t say anything around strangers unless it’s necessary because I don’t like being asked to repeat myself."
  },
  {
    "headline": "Techpoint Awards, AltSchool by TalentQL, Privacy Roundtable PT2, Brass’ $1.7m funding",
    "summarized_story": "This lack of degree options and the scarcity of developers is what TalentQL is looking to solve with AltSchool.\nThere’s more: TalentQL launches AltSchool Africa to train entry level tech talent for freeSo you care about your privacy?\nOn Thursday, October 21, 2021, Brass, a Nigerian digital bank, announced $1.7 million in funding to aid their growth across Africa.\nCurrently, the platform provides SMEs with various services, including payroll and expense management, credit and payment services, and API support.\nThey claim to have disbursed $2 million in credit via their crediting platform, Brass Capital, which is still in the Beta phase."
  },
  {
    "headline": "What does the African fintech need?",
    "summarized_story": "The virtual event focused on fintech’s allure to investors, the benefits Africans derive from fintech start-ups, partnerships between banks and fintech startups, and the role of regulators in the industry.\nHowever, Agboola disagreed with that view, arguing that he sees a situation where fintech complement the works that banks do and vice versa, advocating for partnerships between banks and fintech.\nDeepening financial inclusion is high on the agenda of Nigeria’s Central Bank and Y’ello Digital Financial Services has been playing its part in helping the apex realize this goal.\nWith its wide network of over 150,000 MoMo agents, the organization offers financial services to customers.\nWith 54 countries in Africa, providing financial services to users comes with lots of regulatory hurdles in each country."
  },
  {
    "headline": "Is Nigeria winning war on terror?",
    "summarized_story": "He wondered how the young lady would make it to Jigawa under the climate of insecurity in Nigeria.\nRead Also: Insecurity costs Nigeria $40.6bn worth of investments in 1 year“What more evidence do we need to know that Nigeria is losing the war against terrorism when what appear on international news networks about Nigeria are killings and violence?\nHe observed that it appears there is compromise somewhere and the government and the military cannot execute the war.\nIf government is serious and engages the military properly, Nigeria will win the war against terrorism,” Onikoyi said.\nWhile also regretting that Nigeria is losing the terror war, Chijioke .J."
  },
  {
    "headline": "Buhari to unveil eNaira on Monday says CBN",
    "summarized_story": "President Muhammadu Buhari is scheduled to formally unveil the Nigerian Central Bank Digital Currency (CBDC), known as the eNaira, on Monday 25 October 2021, at the State House, Abuja, Nigeria’s Central Bank said on Saturday.\nRead also: CBN suspends eNaira launchFollowing a series of engagements with relevant stakeholders including the banking community, fintech operators, merchants and indeed, a cross-section of Nigerians, the CBN designed the digital currency, which shall be activated on Monday, October 25, 2021.\nThe eNaira, therefore, marks a major step forward in the evolution of money and the CBN is committed to ensuring that the eNaira, like the physical Naira, is accessible by everyone.\nThe CBN will continue to work with relevant partners to ensure a seamless process that will benefit every user, particularly those in the rural areas and the unbanked population.\nThe theme of the eNaira is: “Same Naira, more possibilities”, the statement reads."
  },
  {
    "headline": "Meet Nigeria’s 3 unicorns in 2021",
    "summarized_story": "In business, a unicorn is a privately held startup company valued at over $1 billion.\nIn September 2014, 16 investors participated in the $3 million raised in the seed and angel rounds.\nThe company completed a $40 million funding in series C round in October 2017 led by CRE Venture Capital.\nFive out of these investors led the startup to be a Unicorn in September after a series E round funding.\nIn March 2021, Flutterwave raised a $170 million Series C funding round."
  },
  {
    "headline": "Minister Commends PTI Principal For Repositioning Institute, As 2,297 Students Graduate – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI- Honorable Minister of State for Petroleum Resources, Chief Timipre Sylva has commended the Principal of the Petroleum Training Institute (PTI), Effurun, Uwvie Local Government Area of Delta State, for repositioning the Institute,and making it more Industry driven.\nThe Ministry gave the Commendation last Saturday at the PTI Conference Center, Effurun during the 2018/2019 and 2019/2020 graduation ceremony of the Institute.\nIn his address, Governor of Delta State, Dr. Ifeanyi Okowa, represented by Commissioner of Higher Education, Professor Patrick Mobuoghare, congratulated the entire Management, staff and students of the Institute.\nHe admonished the graduands to exhibit both academic content and character in their dealings as they go into the larger society.\nA total of 2,297 students from the 2018/2019 and 2019/2020 academic sessions were conferred with diplomas and Certificates."
  },
  {
    "headline": "Senator Uche Ekwunife Trains Past Presidents General On Community Security – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Senator representing Anambra Central Senatorial District, Distinguished Senator Uche Ekwunife trains past Presidents General from Anambra Central Senatorial District on community security.\nThis is part of the week-long capacity building and empowerment programme facilitated by the Senator.\nThe training is geared towards improving the secuity consciousness and awareness of the past PGs as critical stakeholders of their various communities.\nRecall, that Senator Ekwunife had in the past organised similar trainings for the Traditional Rulers and Presidents General of various communities in the Senatorial District.\nThese series of trainings are in line with the Senator’s unwavering commitment to community development through grassroots engagement and education."
  },
  {
    "headline": "Sen Alimikhena Conferred with title of the Traditional Prime Minister of Uwanno Kingdom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Senate Committee chairman on Customs, Excise and Tariff, Senator Francis Asekhame Alimikhena, All Progressives Congress (APC), Edo North has been conferred with the traditional title as the ‘Iyase’ of Uwanno Kingdom.\nThe conferment of the traditional title on the Senator was performed by the Okumagbe of Uwanno Kingdom, His Royal Majesty, Dr. George Oshiapi Egabor, JP, OON, Omoaze 1 is one of the highest titles given to a worthy son of the land.\nThe title of Iyase on the former Deputy Chief Whip of the Senate, makes him the first traditional Prime Minister of Uwanno kingdom, Etsako East, Edo State.\nHis amiable wife, Lady ( Chief) Monica Emesomiade Alimikhena was also conferred with the traditional title of ‘Iyi- Iyase’ of the Uwanno Kingdom by the Monarch.\nThe lawmaker is being recognised by his people because of his numerous contributions to the growth and development of Uwanno kingdom and Edo North at large."
  },
  {
    "headline": "Edo Poly Inaugural Lecture: Experts charge CBN on policies to deepen use of ATMs – Nigerian Observer",
    "summarized_story": "Edo Poly Inaugural Lecture: Experts charge CBN on policies to deepen use of ATMsShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Central Bank of Nigeria (CBN) has been advised to strengthen policies that would accelerate the deployment and usage of Automated Teller Machines (ATMs) across the country.\nHe urged the CBN to develop and implement policies that will improve ATM transactions in terms of charges and transaction failures.\nThe lecturer noted that such policies by the CBN would ultimately improve service delivery, especially with the realities of the post-pandemic world.\nThe queuing theory explains how ATMs innovation assists in solving waiting time in the bank for the good of society.\n“Banks should provide more Automated Teller Machines in different strategic areas and busy streets with attached security features to prevent vandalisation and robbery."
  },
  {
    "headline": "Colombia’s most-wanted drug kingpin, Otoniel, captured",
    "summarized_story": "Colombia’s most-wanted drug trafficker and the leader of the country’s largest criminal gang has been captured.\nDairo Antonio Úsuga, known as Otoniel, was seized at his jungle hideout by the country’s security forces, Al Jazeera reports.\nHe likened it to the arrest three decades ago of the notorious Colombian drug kingpin, Pablo Escobar.\nThe drug lord was captured in his rural hideout in Antioquia province in north-western Colombia, close to the border with Panama.\nMr Otoniel now faces a number of charges, including sending shipments of cocaine to the U.S., killing police officers and recruiting children."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "President Buhari to unveil eNaira tomorrow",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, will on Monday, tomorrow, formally unveil the country’s first digital currency, eNaira.\nSpokesperson for Central Bank of Nigeria (CBN), Mr. Osita Nwasinobi, disclosed this in a statement on Saturday.\nCBN had postponed the unveiling of the eNaira on October 1, citing key activities lined up for the country’s 61st independence anniversary.\n“The eNaira therefore marks a major step forward in the evolution of money and the CBN is committed to ensuring that the eNaira, like the physical Naira, is accessible by everyone.\n“Accordingly, following Monday’s formal launch by the President, the Bank will further engage various stakeholders as we enter a new age consistent with global financial advancement.”Nwanisobi noted that the theme of the eNaira launch is ‘Same Naira, More Possibilities’."
  },
  {
    "headline": "FBN Holdings makes u-turn, confirms Otedola’s purchase of 5.07% stake",
    "summarized_story": "OBINNA EZUGWUFBN Holdings Plc, the holding company for First Bank of Nigeria Limited, has confirmed that billionaire investor and philanthropist, Femi Otedola acquired 5.07% of its shares.\n“The attention of FBN Holdings Plc has been drawn to media reports today (Friday) that a certain individual has acquired significant shareholding interest in FBN Holdings Plc,” the statement had said.\n“As a listed company, the shares of FBN Holdings are publicly traded, and sale and acquisition of shares is expected in the normal course of business.\nThe total shareholding has now taken Mr. Otedola’s ownership to 5.07% more than any other single shareholder on record.\n“Based on the foregoing, the equity stake of Mr. Otedola Olufemi Peter and his nominee in the Company is now 5.07%.”"
  },
  {
    "headline": "262 Oyo prison escapees recaptured, 575 still at large",
    "summarized_story": "The Nigeria Correctional Service (NCS) has said 262 inmates from the 837 that escaped from the Abolongo Correctional Centre in Oyo town have been recaptured.\nSpokesperson of the NCS Oyo command, Olanrewaju Anjorin who stated this in a statement on Saturday, said while 262 escaped inmates had been recaptured, 575 were still at large.\nRecall that gunmen invaded the facility on Friday at about 9.30 p.m., blowing up the facility with dynamite and freeing all 837 awaiting trial inmates.\nMr Anjorin said, “All the awaiting trial detainees were forced out of custody, the cells housing the convicts and the female inmates were not vandalised.\n“Of this number, awaiting trial persons were 837 representing 92 per cent with just 64 convicts,” Mr Anjorin said"
  },
  {
    "headline": "IPOB threatens one week lockdown in Southeast from November 5",
    "summarized_story": "Separatist group, the Indigenous People of Biafra (IPOB) threaten to lockdown the entire South East States from November 5 if their leader, Nnamdi Kanu, is not released from the Department of State Service (DSS) custody.\n“Failure to release our leader onyendu Mazi Nnamdi Kanu on or before November 4, 2021, our one week Sit-At-Home begins on November 5, 2021 till November 10,” Powerful said.\nWe can never allow our leader onyendu Mazi Nnamdi Kanu to be tried secretely and we can never also allow him to be tried under Sharia law under any guise.\n“Unless the federal government releases him unconditionally before November 4, we shall sacrifice one week for him as a warning protest to convey to our oppressors that Nnamdi Kanu represents over 70 million Biafrans.\nNnamdi Kanu must be freed because he committed no crime."
  },
  {
    "headline": "UK Investments Boost Opportunities For Nigerian Farmers",
    "summarized_story": "United Kingdom government’s investment in agriculture has expanded market access and catalysed private sector investments to create economic opportunities for smallholder farmers in Northern Nigeria.\nIndications to this development emerged when the UK aid funded programme, Propcom Mai-karfi hosted an event with key stakeholders in the agriculture sector in Abuja on Thursday to provide more assistance to smallholder farmers in Nigeria’s rural communities.\nAccording to a statement issued by the Press & Public Affairs Officer/ Foreign and Commonwealth Office, Ndidi Amaka Eze, Propcom Mai-karfi supported over 1.25 million women and men in Northern Nigeria to generate over N37 billion in incomes over the past 9 years.\nSpeaking during the event, UK’s Deputy High Commissioner in Lagos, Ben Llewellyn-Jones, said “We are very pleased to be able to celebrate today with all our partners the impact Propcom Mai-Karfi has made in Northern Nigeria over the last 9 years.\n“Its success has only been possible due to the drive, motivation, and willingness of our partners to adopt the market-driven approaches that ultimately create greater economic opportunities for poor men and women."
  },
  {
    "headline": "UK Investments Boost Opportunities For Nigerian Farmers",
    "summarized_story": "United Kingdom government’s investment in agriculture has expanded market access and catalysed private sector investments to create economic opportunities for smallholder farmers in Northern Nigeria.\nIndications to this development emerged when the UK aid funded programme, Propcom Mai-karfi hosted an event with key stakeholders in the agriculture sector in Abuja on Thursday to provide more assistance to smallholder farmers in Nigeria’s rural communities.\nAccording to a statement issued by the Press & Public Affairs Officer/ Foreign and Commonwealth Office, Ndidi Amaka Eze, Propcom Mai-karfi supported over 1.25 million women and men in Northern Nigeria to generate over N37 billion in incomes over the past 9 years.\nSpeaking during the event, UK’s Deputy High Commissioner in Lagos, Ben Llewellyn-Jones, said “We are very pleased to be able to celebrate today with all our partners the impact Propcom Mai-Karfi has made in Northern Nigeria over the last 9 years.\n“Its success has only been possible due to the drive, motivation, and willingness of our partners to adopt the market-driven approaches that ultimately create greater economic opportunities for poor men and women."
  },
  {
    "headline": "I Was A Destitute Apprentice Turned Lawmaker, Now A Law Graduate – Ifeanyi Ubah",
    "summarized_story": "The governorship candidate of the Young Progressives Party (YPP) in the November 6 Anambra State governorship race, Senator Patrick Ifeanyi Ubah, has revealed that he was a “destitute apprentice” before his breakthrough to be a Senator and now a Law graduate.\nBesides the Anambra lawmaker, Senator Dino Melaye, former Minister of Aviation, Osita Chidoka, and Dr. Adaora Umeoji, were among the high-profile graduands of the private University, who also studied Law.\n“First and foremost, I want to thank God Almighty for His guidance without which none of this would have been possible.\n“My learning experience has truly been a fascinating and unforgettable one and I have so many people to thank for that.\n“Yesterday might have been my last day as a Law undergraduate; however, I believe that a greater phase of learning has only started from this point."
  },
  {
    "headline": "I Was A Destitute Apprentice Turned Lawmaker, Now A Law Graduate – Ifeanyi Ubah",
    "summarized_story": "The governorship candidate of the Young Progressives Party (YPP) in the November 6 Anambra State governorship race, Senator Patrick Ifeanyi Ubah, has revealed that he was a “destitute apprentice” before his breakthrough to be a Senator and now a Law graduate.\nBesides the Anambra lawmaker, Senator Dino Melaye, former Minister of Aviation, Osita Chidoka, and Dr. Adaora Umeoji, were among the high-profile graduands of the private University, who also studied Law.\n“First and foremost, I want to thank God Almighty for His guidance without which none of this would have been possible.\n“My learning experience has truly been a fascinating and unforgettable one and I have so many people to thank for that.\n“Yesterday might have been my last day as a Law undergraduate; however, I believe that a greater phase of learning has only started from this point."
  },
  {
    "headline": "Huge debt: Reps threaten Heritage bank with takeover, MD’s arrest",
    "summarized_story": "The House of Representatives, on Thursday, threatened that it will ask the Central Bank of Nigeria to take over the ownership of Heritage Bank of Nigeria for owing the Federal Government more money than its entire share capital.\nThe committee also threatened to issue an arrest warrant on the Managing Director of Polaris Bank for failing to appear before it to explain why the bank had not remitted over $32m owed to the Nigerian National Petroleum Corporation.\nAdeogun said, “If Heritage Bank is owing Nigeria more than its share capital, we will not hesitate to ask the National Assembly to write to CBN to take over Heritage Bank.\nAdeogun also condemned the attitude of the management of Polaris Bank for not honouring an out-of-court settlement with the NNPC and failing to pay up its debt to the government.\nWhile the bank insisted that it had completed the payment of its debt, the NNPC said it had not received the payment."
  },
  {
    "headline": "Huge debt: Reps threaten Heritage bank with takeover, MD’s arrest",
    "summarized_story": "The House of Representatives, on Thursday, threatened that it will ask the Central Bank of Nigeria to take over the ownership of Heritage Bank of Nigeria for owing the Federal Government more money than its entire share capital.\nThe committee also threatened to issue an arrest warrant on the Managing Director of Polaris Bank for failing to appear before it to explain why the bank had not remitted over $32m owed to the Nigerian National Petroleum Corporation.\nAdeogun said, “If Heritage Bank is owing Nigeria more than its share capital, we will not hesitate to ask the National Assembly to write to CBN to take over Heritage Bank.\nAdeogun also condemned the attitude of the management of Polaris Bank for not honouring an out-of-court settlement with the NNPC and failing to pay up its debt to the government.\nWhile the bank insisted that it had completed the payment of its debt, the NNPC said it had not received the payment."
  },
  {
    "headline": "Report accuses NIMASA of paying N13.5bn on idle N50bn floating dock in three years",
    "summarized_story": "The newspaper said the floating dock has remained idle since it arrived in the country on June 11, 2018 at the Nigerian Navy Dockyard, Lagos.\nHe said, “Indeed, the floating dock was supposed to go to Okerenkoko in Delta State, but with the conditions that exist now, it is almost impossible.\nIf you know the complexity of a floating dock, the draft you need to keep and operate it is 12 meters.\n“If the NIMASA had procured the floating dock the way it was scheduled from the beginning, there won’t be this confusion.\n“We have men on board 24 hours, so the issue about the payment of $30,000 wharfage is a lie."
  },
  {
    "headline": "Report accuses NIMASA of paying N13.5bn on idle N50bn floating dock in three years",
    "summarized_story": "The newspaper said the floating dock has remained idle since it arrived in the country on June 11, 2018 at the Nigerian Navy Dockyard, Lagos.\nHe said, “Indeed, the floating dock was supposed to go to Okerenkoko in Delta State, but with the conditions that exist now, it is almost impossible.\nIf you know the complexity of a floating dock, the draft you need to keep and operate it is 12 meters.\n“If the NIMASA had procured the floating dock the way it was scheduled from the beginning, there won’t be this confusion.\n“We have men on board 24 hours, so the issue about the payment of $30,000 wharfage is a lie."
  },
  {
    "headline": "PDP floors APC in rescheduled LG poll in Kaduna",
    "summarized_story": "Mr Francis Zimbo, the candidate of the Peoples Democratic Party (PDP) has won Saturday’s rescheduled chairmanship election in Zango Kataf Local Government Area of Kaduna State.\nThe election was rescheduled to Saturday over security concerns.\nHowever, the Returning Officer, Prof. Nuhu Garba, said Zimbo scored 28,771 votes to defeat Mr. John Hassan of the All Progressives Congress (APC) who polled 19,509 votes.\nRelated News 6 killed in Kaduna village“Mr Francis Zimbo of the PDP, having satisfied the requirements of the law and scored the highest number of votes is hereby declared winner of the election and returned elected,’’ Prof. Garba said.\nPDP also won nine of the 11 councillorship seats while the APC clinched the remaining two seats."
  },
  {
    "headline": "Winners' Chapel USA HQ opens, Oyedepo says it's God's miracle",
    "summarized_story": "Bishop David Oyedepo, the founder and presiding Bishop of the megachurch Faith Tabernacle aka Winners’ Chapel has spoken on God’s miracle as the church headquarters in USA opens today.\nThe cleric at the first Service, Faith Tabernacle First Pre-Shiloh Encounter Service said the church has continued to see the grace of God.\n“I remember last year we dedicated the sanctuary in Zambia, in spite of lockdown.\nThousands of rural Churches were being built, then another one being dedicated today in North America.\nFaith Dome, Winners Chapel USA headquarters for North and South America located in Maryland would be dedicated today."
  },
  {
    "headline": "How Gunmen attacked Oyo prison: Gov. Makinde speaks",
    "summarized_story": "Governor Seyi Makinde said security operatives were ambushed during the attack on the Abolongo custodial centre in Oyo town.\nMakinde stated this during a TV broadcast on Saturday evening on the Oyo State Broadcasting Corporation.\nHe said an army official and one Amotekun official were killed during the attack.\nThe governor added that a female Amotekun operative was also badly injured during the attack.\nThe Governor told residents of Oyo town to remain calm as an investigation into the attack had begun."
  },
  {
    "headline": "JUST IN: APC National Chairman Storms Tinubu’s House [ PHOTOS]",
    "summarized_story": "Mallam Mai Mala Buni, the chairman of the APC caretaker committee has paid a courtesy visit on Asiwaju Bola Ahmed Tinubu at his Ikoyi residence in Lagos.\nGovernor Buni made the visit on Saturday night alongside members of the caretaker committee.\nMr Tinubu who recently returned to Nigeria after a medical vacation in London has been receiving visitors both from his party and opposition party, PDP."
  },
  {
    "headline": "BREAKING: ICC To Probe Kidnapping Of Students In Nigeria.",
    "summarized_story": "The prosecutor of the International Criminal Court (ICC), Karim A. Khan, is requesting permission to probe the kidnapping of students in Nigeria.\nThe probe will cover kidnappings in Nigeria’s North, closure of schools, and the persistent failure of the federal and state authorities to end the abduction.\nOTP-CR-363/21, Khan told SERAP that the criteria for a probe into a string of abductions have been met.\nSERAP will work closely with the ICC to achieve these important objectives”, deputy director, Kolawole Oluwadare assured.\nLast week, 27 students and 3 teachers abducted from the Federal Government College, Birnin Yauri in Kebbi, regained freedom."
  },
  {
    "headline": "2023: Tinubu’s Presidential Ambition Gathers Momentum As Kano Declares Support for APC Leader",
    "summarized_story": "Chidari spoke at the inauguration of the Tinubu Support Group (TSG) and the state steering committees of the group in Abuja on Saturday, October 23.\nHe said Kano state, which has the highest number of voters and delegates in the country, would repay Tinubu’s act of helping President Muhammadu Buhari to become president in 2015.\n“My claim that Asiwaju Bola Tinubu is the maker of modern Lagos State is a truthful assertion.\nThe landscape can tell the stories of its transformation from 1999 to 2007.”The director-general of the TSG, Arch.\nUmar Ibrahim Mohammed noted that the inauguration of the committee is in support of the group’s collective aspiration for a new and better Nigeria from 2023."
  },
  {
    "headline": "Anambra election: IPOB threatens stay-at-home order from November 5",
    "summarized_story": "The November 6 governorship election in Anambra State now faces challenges as the Indigenous People Of Biafra (IPOB), has threatened a week-long stay-at-home order if their leader, Mazi Nnamdi Kanu, was not released unconditionally.\n“Our leader, Onyendu Mazi Nnamdi Kanu must be released unconditionally on or before November 4, 2021 because he has not committed any offence known to any law.\nFailure to release our leader, Onyendu Mazi Nnamdi Kanu on or before November 4, 2021, our one-week sit-at-home strike begins on November 5, 2021 till November 10,” the statement said.\nWe can never allow our leader, Onyendu Mazi Nnamdi Kanu, to be tried secretly and we can never also allow him to be tried under Sharia law under any guise.\n“Nnamdi Kanu must be freed because he committed no crime."
  },
  {
    "headline": "Breaking: Gunmen attack police divisional headquarters, kill 3",
    "summarized_story": "Gunmen in the early hours of Sunday reportedly attacked Police divisional headquarters at Unwana, Afikpo North local government area of Ebonyi state and killed three policemen on duty.\nThe gunmen which were said to have attacked the division at about 2am, killed one constable and two inspectors, Blueprint reports.\nA source from the area who spoke to Blueprint noted that the gunmen masked their faces and one of them was killed by the police who repelled the attack.\nHe said, “They killed three policemen – one constable and two inspectors and the police killed one of the gunmen.\n“The men were masked but the one killed had his face unveiled by the police to ascertain his identity."
  },
  {
    "headline": "PICTURES: Arotile, Ukaigwe, Edo deputy governor, others for honours as Ratels Sports Development Foundation celebrates heroes",
    "summarized_story": "The prestigious Awards will witness decorations of Nigeria women football heroes as put together by the organisers of this year’s Flying Officer’s Cup.\nThe categories are: Post-humous Award, Life Time Achievement Award, Heroic Icon of the Year, Grassroots Women Football Icon of the Year, RSDF Gallantary Star Award, Women Football Promoter of the Year, Women Football Pioneer Award and Role Model Coach Award.\nHenrietta Ukaigwe: She was a veteran sports journalist cum women’s football promoter.\nWomen Football Grassroots Icon of the year: Barrister Seyi Akinwunmi.\nWomen Football Trailblazer of the year: Aisha Falode."
  },
  {
    "headline": "Nnamdi Kanu: IPOB dares FG, threatens to shutdown South East ahead Anambra guber poll if…",
    "summarized_story": "The proscribed Indigenous People of Biafra (IPOB), has threatened to shutdown the entire South East part of the country as from November 4 should federal government fails to release its leader Nnamdi Kanu.\nThe threat by IPOB if it goes through will disrupt governorship election in Anambra state scheduled for November 6, 2021.\n“Failure to release our leader onyendu Mazi Nnamdi KANU on or before November 4, 2021, our one week Sit-At-Home begins on November 5, 2021 till November 10.\nWe can never allow our leader onyendu Mazi Nnamdi KANU to be tried SECRETLY and we can never also allow him to be tried under SHARIA law under any guise.\nNnamdi Kanu must be freed because he committed no crime."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "FG to tackle maternal mortality occasioned by loss of blood -NigPilot",
    "summarized_story": "Worried by rising cases of pregnancy-related deaths, the National Blood Service Commission has vowed to drastically reduce the level of maternal mortality occasioned by blood loss during childbirth.\nSpeaking during a media briefing alongside sponsor of the Bill, now an Act of the Parliament, Hon.\nAbas Tajudeen, the Director-General of the agency, Dr. Omale Joseph explained that not less than 15 percent of every 1,000 women die due to blood loss during childbirth and urged Nigerians to imbibe the practice of donating blood.\n“As you donate blood, you’re saving a life, and not only that, research has shown that people who donate blood regularly live more healthy”, he submitted.\nIt would be recalled the Commission’s establishment Bill, which was introduced by Hon."
  },
  {
    "headline": "Birthday Felicitations: NCFront hails exemplary leadership of Kwankwaso, Dokpesi @ 65, 70 -NigPilot",
    "summarized_story": "The leadership of the National Consultative Front, NCFront, has felicitated with Dr. Mallam Rabiu Musa Kwakwanso and Dr. Raymond Dokpesi on the occasion of their 65th and 70th Birthdays anniversaries respectively.\nIn a congratulatory statement issued Friday and signed by the Head, Public Affairs Bureau, Dr Tanko Yunusa, NCFRONT recognized their contributions to nation building and for egalitarian society.\nThe group described the two prominent Nigerians as leaders of conscience who have identified with, supported and contributed to the efforts of the National Consultative Front since its inception.\nIt will be recalled that on the 21st of October, 2021, Dr Raymond Dokpesi, the Chairman of the African Independent Television turned 70, while Mallam Rabiu Musa Kwakwanso clocked 65.\nHe added that Kwankwaso is without doubt a leader , an administrator and philosopher whose thoughts and actions symbolise an embodiment of a political cum leadership ideals that this country should be proud of."
  },
  {
    "headline": "NIA honours Aviation Minister for infrastructural development -NigPilot",
    "summarized_story": "Nigeria’s Minister of Aviation, Sen. Hadi Sirika has received the Honorary Fellowship and Distinguished Service Award of the Nigerian Institute of Architects, NIA, for his infrastructural developments within the aviation sector.\nThe Award was given to the minister at the Institute’s Architecture Annual Award 2021 in Abuja on Thursday.\nPresenting the award, the Institute noted that under his supervision, the Ministry of Aviation embarked upon 157 projects and delivered 134 to 100 percent completion for the first time in the history of Nigerian Aviation.\nThe NIA also cited the rehabilitation of the runways of the Abuja Airport and the Enugu Airport according to ICAO specifications which were not only delivered ahead of schedule, but within budget.\nDisclosing that he has rejected 390 awards in the past, Sirika said he had to make an exception for the NIA award because of the integrity of the institution."
  },
  {
    "headline": "Rubber stamp 9th assembly would approve Buhari’s third term if… – Wabara -NigPilot",
    "summarized_story": "Former president of the Senate, Adolphus Wabara Thursday hinted that the present 9th National Assembly would have approved an unconstitutional third term for President Muhammadu Buhari if he had insisted on going for it.\nWabara spoke Thursday in Abuja as a special guest at the public presentation of the book: “Standing Strong”, authored by former president of the Senate, Ken Nnamani.\nThe former Senate president who stepped down under intense pressure in the 5th assembly thanked President Muhammadu Buhari for standing strong against the pressure from certain quarters for him to seek a third term.\nHe eulogized the author, Sen. Ken Nnamani who he described as uncommon patriot and nationalist who stood strong in the face of pressure from the political lackeys of former president Olusegun Obasanjo who were bent on smuggling the third term agenda into the constitution through a backdoor.\nAlso speaking at the event, former Minister of defence, Theophilus Danjuma while commending the author, described the book as a text book for young Nigerians who are aspiring to lead a “difficult nation like Nigeria.”"
  },
  {
    "headline": "ICC Prosecutor Seeks Investigation Into Abduction Of Nigerian Schoolchildren",
    "summarized_story": "The prosecutor of the International Criminal Court (ICC) is set to seek authorisation from the Pre-Trial Chamber of the court to open an investigation into cases of abduction of schoolchildren in several parts of Northern Nigeria.\nAlso to be investigated are the closure of schools, and the “persistent failure of Nigerian authorities” at both the federal and state levels to end the abduction.\nAccording to the agency’s Deputy Director, Kolawole Oluwadare, the ICC prosecutor’s decision followed a petition sent to the court by SERAP.\nSERAP had in the petition dated 4 September 2021 urged the ICC prosecutor, Mr Karim A.\nThe ICC prosecutor decided to seek an investigation after undertaking a preliminary examination of the cases of abduction of children in the country."
  },
  {
    "headline": "Boko Haram Terrorists In 10 Gun Trucks Attack Yobe Military Base",
    "summarized_story": "A Nigerian military base in Gujba Local Government Area of Yobe State has been reportedly attacked by armed persons suspected to be members of Boko Haram.\nResidents told Channels Television that the terrorists drove into Katarko village in 10 gun trucks and attacked the military formation, where they engaged the security operatives at the base in a heavy shooting.\nThe residents were forced to run into the nearby bushes for safety but a military source said the troops repelled the attack.\nMeanwhile, the Nigerian Air Force under Operation Hadin Kai has continued its onslaught on terrorist targets on islands and localities around the Lake Chad area.\nIt noted that the air operations will be sustained until the area is rid of all terrorists and insurgents."
  },
  {
    "headline": "Nigeria Records 159 COVID-19 Cases, 74 More Recoveries",
    "summarized_story": "Nigeria has witnessed a decline in the number of COVID-19 cases with 159 new infections reported within the past 24 hours.\nTopping the list is Kaduna State with 47 new cases, followed by Enugu with 44 fresh infections and Benue with 36.\nAfter the US, the hardest-hit countries are Brazil with 604,679 deaths from 21,697,341 cases, India with 453,042 deaths from 34,143,236 cases, Mexico with 285,669 deaths from 3,772,556 cases, and Russia with 228,453 deaths from 8,168,305 cases.\nLatin America and the Caribbean overall has 1,512,762 deaths from 45,653,856 cases, Europe 1,366,679 deaths from 71,928,513 infections, and Asia 860,332 deaths from 55,340,236 cases.\nThe United States and Canada have reported 761,871 deaths from 46,992,403 cases, Africa 216,423 deaths from 8,456,873 cases, the Middle East 205,919 deaths from 13,786,823 cases, and Oceania 2,593 deaths from 234,614 cases."
  },
  {
    "headline": "President Buhari To Unveil e-Naira On Monday",
    "summarized_story": "President Muhammadu Buhari is scheduled to unveil the e-Naira on Monday, the Central Bank of Nigeria said on Saturday.\nThe digital currency had been earmarked for public presentation on October 1 but the CBN shelved the plans citing key activities lined up for Independence Day.\n“President Muhammadu Buhari is scheduled to formally unveil the Nigerian Central Bank Digital Currency (CBDC), known as the eNaira, on Monday 25 October 2021, at the State House, Abuja,” the statement said.\n“The eNaira therefore marks a major step forward in the evolution of money and the CBN is committed to ensuring that the eNaira, like the physical Naira, is accessible by everyone.\n“Visit the website to explore the benefits of our eNaira: www.enaira.gov.ng.”"
  },
  {
    "headline": "Federal Poly Bauchi Sacks Two Lecturers For Sexual Harassment",
    "summarized_story": "Two lecturers of the Federal Polytechnic Bauchi have been dismissed after being found guilty of sexual harassment.\nChannels Television gathered that the lecturers found guilty are Abubakar Baba of the General Studies Department and Adebusoye Sunday of the Nutrition and Dietetic Department.\nREAD ALSO: Colombia’s Most-Wanted Drug Lord ‘Otoniel’ Captured“This issue of Isa Baba came up on 4th August 2021.\n“The Senior Staff Appointment, Promotion and Disciplinary Committee met and invited the suspect, we cross-examined them here, made the recommendation to the Council and the Council today has finally approved the dismissal of Abubakr Musa Baba of the Federal Poly Bauchi.\nMeanwhile, 30 students of the polytechnic have been expelled for various offenses of malpractice and certificate forgery."
  },
  {
    "headline": "JUST IN: Security agents takeover Taraba APC office",
    "summarized_story": "Police and other security agents have taken over Taraba’s All Progressives Congress (APC) secretariat following the court ban of the party’s state congress.\nThe court injunction from Federal High court Jalingo,restrained the party from going ahead with today’s scheduled congress.\nThe APC held its nationwide congresses last week except Taraba and OYo States’ rescheduled for today owing to internal crisis in the party.\nBut the Youth Wing of APC in Taraba State has warned against flouting court order by the party stakeholders.\nAddressing a press conference at the party Secretariat, the leader of the group, Mama Nashiru said his group didn’t want replay of events that made APC lost Zamfara State."
  },
  {
    "headline": "Concerned APC Stakeholders forum faults Caretaker Committee on State Congresses -",
    "summarized_story": "Concerned APC Stakeholders forum in a statement signed by it’s spokesman, Abubakar Usman, has faulted the Caretaker Extraordinary Convention Planning Committee on the State congresses.\nFrom Kano to Kwara, to Sokoto, and other states they described the issue of parallel congresses as embarrassing.\nWhile a few states conducted the congresses with a semblance of the true letters and spirit of consensus, which they say must be commended for.\nThey enjoined patriotic party members, to display honesty towards the survival of the APC and the sustenance of the legacies of President Muhammadu Buhari’s government.\nThe forthcoming National Convention they believe presents an opportunity that must not be missed to Harmonisethe party’s structure."
  },
  {
    "headline": "Just In: Gunmen abduct two sisters in Ondo",
    "summarized_story": "Gunmen have kidnapped two sisters in nursery class in Akure, Ondo State capitalThe state police command has confirmed the incident, saying the abduction took place on Friday night.\nThe spokesperson of the Ondo police, Funmilayo Odunlami, said upon their return from an outing at about 8:00 p.m., the mother parked the car in front of her house and went out to open the gate leaving the two kids in the vehicle.\nShe said another car with three occupants suddenly drove up to her and one of the occupants collected her car keys and drove away with the kids still inside the car.\nThe police spokesperson said The anti-kidnapping section of the police is already on the trail of the assailants to rescue the victims"
  },
  {
    "headline": "Interior Ministry confirms attack on armed attack on Oyo Custodial centre -",
    "summarized_story": "The Ministry of Interior has confirmed an armed attack on Abolongo Custodial Centre, in Oyo, Oyo State by yet to be identified gunmen.\nAccording to a statement by the media officer, the gunmen attacked the facility at about 10.00pm on Friday.\nThe attackers subsequently used grenades and other explosives to gain access into the awaiting trial section of the facility and set free many of the awaiting trial inmates.\nMeanwhile, the Controller General of the Nigerian Correctional Service has been on the situation immediately the incident occurred and the minister of Interior has been briefed on the attack.\nThe minister assured members of the public to go about their normal businesses as the situation is under control."
  },
  {
    "headline": "The Gravedigger’s Wife: Somali Love Story Wins Africa’s Top Film Prize",
    "summarized_story": "A Somali film exploring what people will do for love has won the grand prize at the prestigious Pan-African film festival in Burkina Faso.\nThe Gravedigger’s Wife, written and directed by Finish-Somali director Khadar Ahmed, beat off competition at Fespaco from 16 other movies.\n“It is a beautiful film that tells a story with humanity,” Mauritanian film director Abderrahmane Sissako is quoted as saying.\nWords can not express my gratitude and appreciation for this type of love from the continent,” Ahmed wrote on Instagram.\nA rare feature-length film in Somali, The Gravedigger’s Wife is also Somalia’s first entry in the Best International Feature Film category at the Oscars."
  },
  {
    "headline": "Picasso Masterpieces Fetch Nearly $110m at Las Vegas Auction",
    "summarized_story": "Eleven Pablo Picasso artworks that have been on display at a Las Vegas hotel for more than two decades have sold at auction for nearly $110m (£80m).\nThe works, which were owned by MGM Resorts, featured in the Picasso Restaurant at the Bellagio Hotel.\nBut the company said Saturday’s auction would help it improve the diversity of its fine art collection.\n“At nearly 2m (6.5ft) tall, the 1959 work is a hugely impressive example of Picasso’s achievements during this important stage in his career,” the auction house, Sotheby’s, said.\nThe record for a Picasso is $179.4m, which was paid for his painting The Women of Algiers in 2015."
  },
  {
    "headline": "Turkey’s Erdogan Orders Expulsion of 10 Western Ambassadors",
    "summarized_story": "Turkish President Recep Tayyip Erdogan moved to expel the ambassadors of 10 Western countries who appealed for the release of a jailed civil society leader.\n“They must know and understand Turkey,” Erdogan added, accusing the envoys of “indecency”.\n“They must leave here the day they no longer know Turkey,” Erdogan said.\nThe US said it was aware of the reports and was seeking clarity from the Turkish Ministry of Foreign Affairs.\nErdogan was quoted on Thursday as saying the ambassadors in question would not release “bandits, murderers and terrorists” in their own countries."
  },
  {
    "headline": "575 Inmates at Large, 262 Recaptured as Gunmen Invade Prison in Southwest Oyo State",
    "summarized_story": "Gunmen had on Friday night attacked the Abolongo Correctional Centre in Oyo town and freed the inmates.\n“The attackers subsequently used grenades and other explosives to gain access into the awaiting trial section of the facility and set free many of the awaiting trial inmates.\nProviding details of the attack yesterday, the Nigeria Correctional Service, Oyo State Command, said 837 awaiting trial inmates escaped from the correctional centre when suspected gunmen attacked the facility.\nHe said 262 escaped inmates “have been recaptured, while 575 were still at large.\nOf this number, according to the command, awaiting trial persons were 837 representing 92 per cent, while the convicts were 64."
  },
  {
    "headline": "Buhari to Unveil CBN’s eNaira on Monday",
    "summarized_story": "President Muhammadu Buhari will on Monday formally launch the Nigerian Central Bank Digital Currency (CBDC), known as the eNaira at the State House, Abuja.\nThe apex bank had designed the digital currency, following a series of engagements with relevant stakeholders including the banking community, fintech operators, merchants, and indeed, a cross-section of Nigerians.\nAccording to the bank, the eNaira marks a major step forward in the evolution of money as well as the CBN’s commitment to ensuring that the digital currency, like the physical Naira, is accessible by everyone.\nThe bank explained that eNaira wallet is required to access, use and hold eNaira.\nHowever, the CBN, in the framework for the operation of the eNaira further set the transaction and balance limits for individual and merchant eNaira wallets."
  }
]