[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "16,000 jostle for Ondo Amotekun’s 350 jobs",
    "summarized_story": "By Dayo Johnson, AkureApplicants,16,000, have applied for the 350 vacant slots in the Ondo State security outfit, codenamed Amotekun.\nThe security commander, Chief Àdetunji Adeleye said this in Akure over the weekend.\nHe said that successful applicants will soon be invited for training.\nHe said only successful candidates whose names appear on the Corps website are to resume at the training camp.\nThe commander advised the applicants to visit the Corps’ website for further details."
  },
  {
    "headline": "How 1,130 looted Benin Bronzes got to Germany – FG",
    "summarized_story": "In the statement signed by Mr Segun Adeyemi, the Minister of Foreign Affairs of Germany, Ms Annalena Baerbock, and the Minister of State for Culture and Media, Ms. Claudia Roth, signed for Germany.\nThe minister recalled that the artefacts were looted from the ancient Benin Kingdom during the Benin Expedition of 1897 by the British force.\nAccording to Mohammed, other museums and institutions are expected to take a cue from what Germany has done.\nAlso Speaking, the Minister of Foreign Affairs of Germany said, ”It was wrong to take the (Benin) bronzes.\nThis is the beginning to right the wrong.”According to the statement, in a symbolic gesture signifying the impending return of the artefacts, two of the Benin Bronzes were handed over to Nigeria at the ceremony."
  },
  {
    "headline": "Ogun workers suspend 4-Day strike",
    "summarized_story": "By James Ogunnaike, AbeokutaThe Organized Labour in Ogun State on Friday evening suspended its 4-day old strike with immediate effect.\nThe State Chairman of the Nigeria Labour Congress, Comrade Bankole Emmanuel made this known with a letter he signed alongside leaders of sister unions; Trade Union Congress, (TUC) and Joint Action Congress, (JAC) to call off the strike.\nThe letter reads, “We hereby suspend the industrial strike action in Ogun State and hereby direct all workers to resume to their duty post with immediate effect”Meanwhile, one of the union soldiers was reportedly dead during the protest at the Labour House, Abiola Way, Abeokuta while expressing their grievance to the state government.\nThe deceased was said to be the Former Chairman, Youth Council of Nigeria, Odeda Comrade Sunday Ogunjimi who died during struggle at NLC Secretariat,Leme, Abeokuta, and his body has been deposited at Federal Medical centre Idi—Aba Abeokuta"
  },
  {
    "headline": "Kaigama condemns abduction, killings of Christians, Catholic Priests",
    "summarized_story": "Ignatius Kaigama has condemned the series of abductions, persecution and killings of innocent Christians especially Catholic Priests in the country by terrorists describing the development as unfortunate and unacceptable.\nIsaac Bundepuun Dugu as the second Bishop of Katsina-Ala Catholic Diocese, Benue state.\nWhile lamenting the worsening insecurity in parts of the country, Archbishop Kaigama called for sustained prayers to end the development.\nHe also acknowledged the deplorable condition of federal roads in the state especially the Gboko-Katsina road and promised to take the matter to the Federal Government.\nThe event attracted Catholic faithful and top government functionaries from within and outside the state."
  },
  {
    "headline": "Naira gains marginally at Investors and Exporters Window by 0.01%",
    "summarized_story": "The Naira on Friday gained marginally against the dollar at the Investors and Exporters Window, exchanging at N425.00.\nThe figure represented an appreciation of 0.01 per cent, compared with N425.05 exchanged on Thursday.\nAn exchange rate of N444.00 to the dollar was the highest rate recorded within the day’s trading before it settled at N425.00.\nThe Naira sold for as low as N411.10 to the dollar within the day’s trading.\nA total of 78.86 million dollars was traded in foreign exchange at the official Investors and Exporters Window on Friday."
  },
  {
    "headline": "Akwa Ibom Chief Judge threatens to jail rights lawyer over bias accusation",
    "summarized_story": "The Chief Judge of Akwa Ibom State, Justice Ekaette Obot, has threatened to put behind bars a Lagos-based human rights lawyer, Inibehe Effiong (Esq) for accusing her of being biased or likelihood of bias in the ongoing libel suit by Akwa Ibom State Governor, Mr Udom Emmanuel and Senator Effiong Bob against his client, Leo Ekpenyong, Esq.\nHowever, the defence counsel also filed another motion praying the Chief Judge to recuse from the case, alleging prejudice and likelihood of bias.\nDuring a proceeding held at High Court 1, Chief Judge’s court, Barracks road today, the defence counsel said “My Lord, my client Mr Leo Ekpenyong (Esq) has alleged bias, or likelihood of bias of the honourable Chief Judge of Akwa Ibom State, Honourable justice Ekaette Obot.\nThe seeming hostility that characterized the proceedings to set aside the default judgement is discouraging.\nI still set aside that judgement only for you to capitalize on it and you want to play on the intelligence of the court?"
  },
  {
    "headline": "Nigeria, Germany sign agreement for return of looted Benin Bronzes",
    "summarized_story": "Nigeria and Germany have signed an accord for the return of 1,130 Benin Bronzes.\nInformation and Culture Minister, Lai Mohammed and Minister of State for Foreign Affairs, Zubairu Dada signed for Nigeria.\nMinister of Foreign Affairs, Annalena Baerbock and Minister of State for Culture and Media, Claudia Roth signed for Germany.\nMohammed noted that Germany did not colonise Nigeria and was not part of the looting of the artefacts.\nHe said they were looted from the ancient Benin Kingdom during the Benin Expedition of 1897 by the British force."
  },
  {
    "headline": "Ogun NLC member slumps, dies during workers’ meeting",
    "summarized_story": "There was palpable tension at the secretariat of the Ogun State chapter of the Nigeria Labour Congress (NLC) in Abeokuta, on Friday, following the death of a member of the union, identified as Sunday Ogunjimi.\nOgunjimi was among other workers who had gathered at the NLC secretariat to await the outcome of a meeting between the state government and the leaders of the striking workers.\nDAILY POST reports that members of the unions had converged at the NLC secretariat in Leme area of Abeokuta, demanding that the leadership address them.\nThis led to an uproar with threats of attacks on the union leaders.\nThe angry workers also threatened to beat the state NLC chairman, Comrade Emmanuel Bankole whose appeal fell on their deaf ears."
  },
  {
    "headline": "Stop attacking other religions – Imam tells Muslims",
    "summarized_story": "Bello said this while addressing Muslim faithful at a special Juma’at prayer to commemorate the year 2022 Nigerian Army Day Celebration (NADCEL), held in Owerri on Friday.\n“Islam promotes peaceful co-existence with adherents of other faiths, thus it is pertinent for Muslims to tolerate the rights of others to practice their faith, devoid of aggression.\nHe also called on all Muslim faithful to pray for Nigeria’s leaders and gallant soldiers to overcome the nation’s travails.\nYahaya, represented by Maj.-Gen. J. H. Abdulsalami, called on Muslim faithful to seize the opportunity to pray for the safety and success of troops, while reassuring the officers of his commitment to their welfare.\nThe Muslim faithful in Owerri and environs gathered to observe the requests."
  },
  {
    "headline": "Katsina: Cashier robbed of N61m at gunpoint, police suspect foul play",
    "summarized_story": "A cashier in the office of the Secretary to the Government of Katsina State, on Thursday, was allegedly robbed of N61 million he withdrew from one of the banks in the state capital.\nIt baffled the command for a state government staff to carry such a huge amount of money without police escort,” Gambo said.\nGambo further disclosed that Mr Darma only sustained minor bruises in the attack, contrary to the story that the robbers shot him on his arm.\n“He was alleged to have single-handedly withdrawn the sum of sixty-one million naira from the bank.\nThere is a conspiracy theory we are investigating here,” Gambo said."
  },
  {
    "headline": "Court restrains Kano from borrowing N10bn for CCTV The Nation Newspaper",
    "summarized_story": "A Federal High Court in Kano presided over by Justice Abdullahi Liman, on Friday restrained the Kano State Government from borrowing N10 billion for the installation of Closed-Circuit Television (CCTV) cameras.\nAbdullahi Ganduje of Kano State from borrowing N10 billion loan.\nOther respondents in the suit are the Attorney-General of Kano State, Commissioner of Finance Kano and Speaker Kano State House of Assembly.\nOthers are Access Bank, Federal Ministry of Finance, Debt Management Office and Fiscal Responsibility Commission.\nHe also ordered the plaintiff to serve Federal Ministry of Finance, Debt Management office and Fiscal Responsibility Commission with the order and other court processes."
  },
  {
    "headline": "Ex-CJN Tanko: Bowing out in a storm The Nation Newspaper",
    "summarized_story": "The abrupt resignation of Justice Tanko Muhammed as the 17th Chief Justice of Nigeria (CJN) manifested as a rude shock to everyone during the week.\nTanko served as a Justice of the Supreme Court of Nigeria since 2005 and the CJN since 2019.\nHe is the third Supreme Court Justice to occupy the top position under the Buhari-led Administration.\nBut Tanko denied the allegations raised against him by the Supreme Court Justices.\nMany argued that Tanko’s resignation was a swift one to avoid being consumed by his current travails."
  },
  {
    "headline": "Matawalle’s curious gospel of self-defense The Nation Newspaper",
    "summarized_story": "Matawalle, confronted with a seemingly helpless situation, decided to put the fate of security in the hands of the residents.\nWhile some believe Matawalle’s move is a strong challenge to the federal government and relevant security agencies to act swiftly and tame the marauders.\nSome others argued that granting residents permission to carry arms could open up a state of anarchy and lawlessness across Nigeria.\nBut the bottom line remains that the continuous bandit and terrorist attacks have left many victims agitated, bitter, and traumatised.\nThe committees are Intelligence Gathering on Banditry, Community Protection Guards (CPG), Prosecution of Banditry-Related Offences, and State Security Standing Panel."
  },
  {
    "headline": "When marriage isn’t sitcom…Funke Akindele’s second marriage hits the rocks The Nation Newspaper",
    "summarized_story": "Estranged celebrity couple, Funke Akindele-Bello and Abdulrasheed Bello aka JJC Skillz were in the public eye this week, especially on social media platform.\nIt would be recalled that JJC Skillz, in April, dismissed rumours of a crisis in their marriage.\nAnnouncing their separation, JJC Skillz wrote: “Dear Friends and family, I need to let you know that Funke and I have separated.\nReacting, to JJC SKillz recent announcement of his separation from Akindele, fans of the celebrity couple expressed sadness over the duo’s sweet love gone sour.\nThe movie star also warned men about women who are “social media freaks.”Also reacting, Funke’s stepson, Benito, who had on several occasions dragged his controversial step mum on social media, wrote a cryptic message."
  },
  {
    "headline": "Pressure mounts on Atiku, Ayu as PDP crisis deepens The Nation Newspaper",
    "summarized_story": "On the same day as Ortom, former Ekiti State Governor Ayodele Fayose declared on Twitter that it was the turn of the southern part of Nigeria to produce President Muhammadu Buhari’s successor.\nAtiku and Ayu are currently out of the country; the former vice president in Dubai and the party chairman on vacation.\nWike has remained silent since he was overlooked by Atiku in his choice of running mate, although his associates, including Benue State Governor Samuel Ortom, have openly condemned the way the Rivers State governor was treated.\nAlthough Asiwaju Tinubu is presently in France, he didn’t have any meeting with Governor Wike whether in that country or anywhere whatsoever.\n“This, however, does not detract from the fact that the APC presidential candidate holds Governor Wike in high esteem."
  },
  {
    "headline": "2023: Six govs move against Atiku",
    "summarized_story": "From Fred Itua, AbujaAhead of the constitution of the campaign organisation of the presidential candidate of the Peoples Democratic Party (PDP), Alhaji Atiku Abubakar, the crisis rocking the party appears far from over.\nRevealing further, the source said when Wike lost the primary election to Atiku, party leaders agreed that it would be best to pick him as the running mate to Atiku.\nHe revealed the aforementioned governors met with Atiku and other leaders to pick Wike as a popular choice, but were ignored by Ayu and Atiku, who are believed to be micro-managed by some powerful Northern leaders.\nBut they’ll sabotage Atiku the same way PDP governors sabotaged President Goodluck Johnathan in 2015.\nAnd many PDP governors are close friends of the presidential candidate of the APC, Bola Ahmed Tinubu."
  },
  {
    "headline": "Insecurity: Fresh alarm in Abia, Imo, Enugu",
    "summarized_story": "Saturday Sun investigations showed that the Umunneochi/Lokpanata axis of Abia State, Mbano/Mbaise and Isi-Uzo areas of Imo and Enugu States, respectively, harbour notorious camps of kidnappers.\nIt was also discovered that their methods and tactics were almost similar notwithstanding the gang and where they operated.\nIn January this year, an attack at Abor Community in Eha-Amufu, claimed one life with three others critically wounded.\nMany residents of the communities were also said to be missing while houses and motorcycles were burnt during the attack on seven farm settlements.\nThe woman leader was abducted at her farm while the monarch’s incident happened in his palace."
  },
  {
    "headline": "2023: Ohanaeze, Afenifere, MBF canvass support for Southern candidates",
    "summarized_story": "By Chukwudi NwejeProminent socio-political and cultural organisations in the South-West and South-East, as well as the Middle Belt Forum have reiterated their preference for a president from Southern Nigeria in 2023.\nPan Igbo socio cultural organisation, Ohanaeze Ndigbo Worldwide, pan Yoruba socio-political organisation, Afenifere and the Middle Belt Forum (MBF), told Saturday Sun, in separate telephone interviews on Friday that they will support only a Southern presidential candidates at the general election in 2023.\nAlthough they did not go into specifics of who the preferred candidate is, spokesman of Ohanaeze Ndigbo, Chief Alex Ogbonnia, his Afenifere counterpart, Jare Ajayi and President of MBF, Dr Pogu Bitrus, all urged people of Southern Nigeria to make their choice from the list of presidential candidates from the South.\nThe various groups had, at a meeting held in January this year in Abuja, under the banner of Southern and Middle Belt Leaders Forum (SMBLF), called on all the political parties in the country to zone their presidential tickets to the south.\nThe meeting held under the chairmanship of elder statesman, Chief Edwin Clark, was attended by Chief Ayo Adebanjo, acting leader of Afenifere, Professor George Obiozor, President-General of Ohanaeze Ndigbo, Dr. Pogu Bitrus, President of the MBF and Senator Emmanuel Ibok Essien, National Chairman of Pan Niger Delta Forum, (PANDEF)."
  },
  {
    "headline": "Pastor, wife held as 3 die in church during deliverance",
    "summarized_story": "From Lateef Dada, OsogboA 48-year-old Pastor, Taiwo Olaniyi and his wife, Kemi, 28 have been held by the Osun State Police Command over the death of three persons in their church during deliverance.\nThe owner of Cherubim and Seraphim Church in Osogbo is said to be operating a healing centre and trado-medical home in his church.\nIt was gathered that one Rasheedat Mufutau, 58, was taken to the church because she has diabetes and died.\nThe Police Public Relations Officer in the state, Yemisi Opalola, who confirmed the incident, said it happened on June 28.\nShe said three persons were arrested but the third suspect was released because he was just a church member."
  },
  {
    "headline": "No amount of money will make me do erotic films –Ibiwari Etuk",
    "summarized_story": "Pornographic or explicit erotic films are no go areas for Nollywood actress, Ibiwari Gift Anietie Etuk aka Ibiwari Etuk.\nIn a chat with Saturday Sun, the talented role interpreter admitted that only nudity can limit the full display of her acting skills.\n“Porn or explicit erotic films are my no, no.\nI can never find myself doing such, no matter how much money is involved,” she said.\nAs for me, depending on the circumstances, I don’t think I will except it’s a life threatening situation or it will help save a life.”"
  },
  {
    "headline": "Senator Nwaoboshi Jailed 7years for Money Laundering – THISDAYLIVE",
    "summarized_story": "The Lagos Division of the Court of Appeal has sentenced Senator Peter Nwaoboshi (Delta North) to seven years imprisonment for money laundering.\nThe court also ordered that the senator’s two companies, Golden Touch Construction Project Ltd and Suiming Electrical Ltd, be wound up in line with the provisions of Section 22 of the Money Laundering Prohibition Act 2021.\nThe Economic and Financial Crimes Commission (EFCC) had arraigned the defendants over the acquisition of a property named Guinea House on Marine Road, Apapa, Lagos, for N805 million.\nThe conviction and sentencing Friday were sequel to an appeal by the commission challenging the judgment of Justice Chukwujekwu Aneke of the Federal High Court which discharged and acquitted the defendants on two counts of fraud and money laundering.\nThe Appeal Court held that the trial judge erred in dismissing the charges against the respondents, noting that the prosecution had proved the ingredients of the offence and consequently found the defendants guilty as charged."
  },
  {
    "headline": "First Vessel Berths at Lekki Deep Seaport – THISDAYLIVE",
    "summarized_story": "Three Ship-to-Shore cranes and 10 Rubber-Tyred Gantries critical to the commencement of operations of the 1.5 billon Lekki Deep Seaport arrived in Nigeria on Friday.\nThe News Agency of Nigeria(NAN) reports that operations at the Deep Seaport are expected to commence in September.\nTheir arrival, according to Mr Mohammed Bello-Koko, Managing Director of the Nigerian Ports Authority(NPA), represents a major step toward birthing Nigeria’s first Deep Seaport.\n“This is why matters related to the operationalisation of Lekki Deep Seaport before the end of this year have been placed on top priority,” he declared.\nApart from being Nigeria’s first Deep Seaport, Lekki Port will also be the first fully automated port at take-off."
  },
  {
    "headline": "Nigeria, Germany Sign Joint Declaration on Restitution of Benin Bronzes – THISDAYLIVE",
    "summarized_story": "Olawale Ajimotokan in AbujaNigeria and Germany have signed a historic joint declaration that will formally pave the way for the return of 1,130 Benin Bronzes to Nigeria, 125 years after they were looted from the ancient Benin Kingdom during the Benin Expedition of 1897.\nHe said that many of the Benin Bronzes in German public institutions got there via trade and donations.\n“Germany has gained more friends in Nigeria and all over the world by returning to Nigeria what rightfully belongs to it,” Mohammed said.\nIn her remarks, the German Minister of Foreign Affairs of Germany, Ms. Baerbock, said it was morally impermissible to take the Benin bronzes.\nAt the signing ceremony and in a symbolic gesture signifying the impending return of the artefacts, two of the Benin Bronzes were handed over to Nigeria."
  },
  {
    "headline": "Oyo SDP Guber Candidate, Lana, Berates Govs for Producing Poor Citizens – THISDAYLIVE",
    "summarized_story": "Kemi Olaitan in IbadanThe gubernatorial candidate of the Social Democratic Party (SDP) in Oyo state, Mr. Michael Lana, has come hard on governors in the country, accusing them of producing poor citizens rather than prosperous ones.\n“Because, what we have now is not governance, it is just mismanagement of state resources.\n“That is why I choose SDP because it is more or less an offshot of Unity Party of Nigeria (UPN) by late Obafemi Awolowo.\nWhat has been the effect of the expenditure of the state resources on the ordinary people.\n“We are only producing more poor and poor people instead of prosperous citizens."
  },
  {
    "headline": "Buhari Reappoints Oniha as DMO DG for Another Five-year Term – THISDAYLIVE",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has approved the re-appointment of the Director-General of the Debt Management Office (DMO), Patience Oniha, for a second term of five years in accordance with Section IV (9-i) of the Debt Management Office (Establishment ETC) Act, 2003.\nPresidential spokesman, Mallam Garba Shehu, in a statement yesterday, said the renewal of the appointment, takes effect from July 1, 2022.\nAccording to the statement, Oniha’s appointment for a second term was based on the significant achievements recorded by the DMO in the last five years, under her leadership.\nUnder her watch, as part of the initiatives to improve the sustainability of the public debt and opening up avenues for raising long term funds for corporates, the DMO introduced long term Bonds with tenors of 30 years in the domestic and international markets.\nInternally, Oniha was said to have introduced reforms to strengthen the DMO, as a critical agency in the public finance ecosystem of the country."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "BREAKING: Nollywood Actress, Funke Akindele's Husband Announces Separation From Wife",
    "summarized_story": "Nollywood actress, Funke Akindele’s husband, Abdulrasheed Bello, also known as JJC Skillz has announced his separation from the popular actress.\nAccording to him, the couple has yet to resolve other issues including the custody of their children and other business interests.\nHis post reads, “Dear Friends and family I need to let you know that Funke and I have separated.\nI know I have tried my best to fix things but I believe it is beyond repair now.\n“I'm making this announcement so that the public is clear that we both are pursuing separate lives."
  },
  {
    "headline": "NOSDRA moves to stop OML 18 leak after three weeks of oil spill",
    "summarized_story": "The National Oil Detection and Response Agency (NOSDRA) says a leak from a wellhead at oil mining lease (OML) 18, operated by Eroton Exploration and Production Limited, will be stopped this weekend.\nOML 18 is a large oil bloc located in Port Harcourt, Rivers state, containing 11 oil and gas fields.\n“The spill started on the 15th of June 2022, and immediately an emergency response procedure was activated,” Massade had said.\nAdvertisementGiving an update, Idris Musa, director-general, National Oil Spill Detection and Response Agency, told TheCable that the leak would be finally put off this weekend.\nOn November 5, 2021, a similar incident occurred at OML 29, operated by Aiteo Eastern Aiteo Eastern Exploration and Production, spreading to several communities in Bayelsa state."
  },
  {
    "headline": "NOSDRA moves to stop OML 18 leak after three weeks of oil spill",
    "summarized_story": "The National Oil Detection and Response Agency (NOSDRA) says a leak from a wellhead at oil mining lease (OML) 18, operated by Eroton Exploration and Production Limited, will be stopped this weekend.\nOML 18 is a large oil bloc located in Port Harcourt, Rivers state, containing 11 oil and gas fields.\n“The spill started on the 15th of June 2022, and immediately an emergency response procedure was activated,” Massade had said.\nAdvertisementGiving an update, Idris Musa, director-general, National Oil Spill Detection and Response Agency, told TheCable that the leak would be finally put off this weekend.\nOn November 5, 2021, a similar incident occurred at OML 29, operated by Aiteo Eastern Aiteo Eastern Exploration and Production, spreading to several communities in Bayelsa state."
  },
  {
    "headline": "Court jails Nigerian senator for seven years over money laundering",
    "summarized_story": "Peter Nwaoboshi, senator representing Delta north district, has been sentenced to seven years imprisonment for money laundering.\nThe senator was convicted by the Lagos division of the appeal court on Friday.\nDelivering judgment on Friday, the appellate court overturned the lower court’s judgment and convicted the senator.\nAccording to a statement by the EFCC, the court of appeal held that the trial judge erred in dismissing the charges against the respondents.\nThe court of appeal also ordered that the two companies be wound up."
  },
  {
    "headline": "Court jails Nigerian senator for seven years over money laundering",
    "summarized_story": "Peter Nwaoboshi, senator representing Delta north district, has been sentenced to seven years imprisonment for money laundering.\nThe senator was convicted by the Lagos division of the appeal court on Friday.\nDelivering judgment on Friday, the appellate court overturned the lower court’s judgment and convicted the senator.\nAccording to a statement by the EFCC, the court of appeal held that the trial judge erred in dismissing the charges against the respondents.\nThe court of appeal also ordered that the two companies be wound up."
  },
  {
    "headline": "Owo attack: US senators ask Blinken to relabel Nigeria as religious freedom violator",
    "summarized_story": "In December 2020, the US listed Nigeria among countries blacklisted for “violating religious freedom” under the CPC designation.\nIn a June 29, 2022 letter, the senators questioned why Nigeria was “inexplicably” removed “despite no demonstrable improvement in the country’s religious freedom conditions”.\nAdvertisement“Last year, however, you inexplicably removed Nigeria’s designation as a Country of Particular Concern (CPC) despite no demonstrable improvement in the country’s religious freedom conditions.\nReligious violence and intolerance directed toward Nigerian Christians has worsened in recent years.\n“One report documented more than 4,650 cases of Nigerian Christians who were killed for their faith in 2021."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "South Africa’s Constitutional Court rules against communications minister’s digital migration deadline",
    "summarized_story": "South Africa’s constitutional court has ruled against Khumbudzo Ntshavheni’s decision to switch off analogue broadcast systems by June 30, 2022, declaring it unconstitutional.\nNtshavheni – who serves as the country’s current Minister of Communications and Digital Technologies – wants South Africa to migrate to digital broadcast systems.\nSTBs would enable households to continue having access to television channels on their analogue television sets after the analogue switch-off.\nIn the final ruling, the High Court dismissed the application from e.tv, MMA and SOS but extended the analogue switch-off date to June 30, 2022.\nIn a unanimous judgment, the Constitutional Court ruled that the power to determine the analogue switch-off date and the registration deadline for STBs is located within the minister’s original constitutional policymaking function."
  },
  {
    "headline": "Binance partners with TikTok star Khaby Lame to drive Web3 Adoption",
    "summarized_story": "Binance, the world’s biggest crypto exchange company, has partnered with 22-year-old Senegalese TikTok sensation, Khaby Lame, to drive global crypto and Web3 adoption.\nResponding to questions about this development, the founder and CEO of the crypto giant, Changpeng Zhao, tweeted: “Well, he’s the most followed creator on TikTok.\nLame rose to fame by reacting wordlessly to complicated and absurd “life hacks” videos using TikTok’s duet and stitch features.\nAccording to him, the partnership with Binance “aligns perfectly” with what he normally does, which is making complicated things easier and more fun.\nLame will also be partnering with Binance to create exclusive nonfungible token (NFT) collections."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "NGX suspends trading in shares of Ardova, C&I Ieasing, Mutual Benefit, 6 others",
    "summarized_story": "The Nigerian Exchange Limited (NGX) has effective Friday July 1, suspended trading in shares of nine (9) companies for defaulting in filing their audited financial statements for the year ended December 31, 2021.\nThese companies are: African Alliance Insurance Plc, Niger Insurance Plc, Royal Exchange Plc, Ekocorp Plc, C & I Leasing Plc, Mutual Benefit Assurance Plc, Coronation Insurance Plc, Premier Paints Plc and Ardova Plc.\nRead also: NGX, GRI, PRI collaborate to boost awareness on ESG Data Metrics for sustainable investingThe suspension of trading in these companies shares will only be lifted upon their submission of the relevant accounts, provided the NGX Regulation Limited (NGX RegCo) is satisfied that the accounts comply with all applicable rules of NGX."
  },
  {
    "headline": "Shiroro attackers won’t go unpunished – Buhari",
    "summarized_story": "President Muhammadu Buhari has described Thursday’s attack in Shiroro Local Government Area of Niger State as a direct assault on Nigeria which will not be allowed to go unpunished.\nPresident Buhari stated this while paying tributes to the gallant men of the security forces who lost their lives in the process of defending the attack.\nPresident Buhari, in a related development, expressed appreciation to Portugal for the deployment of weapons and training of military personnel in ensuring peace in the sub-region.\nPresident Buhari expressed optimism that his State Visit would further strengthen the goodwill and collaboration between the two countries.\nHe described the signing of the agreements ‘‘as excellent foundations for increased bilateral trade.’’"
  },
  {
    "headline": "Nigerian airlines’ insurance costs spike above African peers",
    "summarized_story": "Nigerian airlines have seen their insurance costs surge above what their peers in Ghana, South Africa and other African countries pay to insure their aircraft.\nBusinessDay’s investigations show that while Nigerian airlines pay between 8 percent and 10 percent of the value of an aircraft to insure it, airlines operating in Ghana, South Africa and other African countries pay 2-3 percent.\nRead also: EXPLAINER: What passengers could gain from Nigerian airlines’ new allianceIn addition to this, the inability of all Nigerian insurance companies to put together to insure a single brand new aircraft in the country made them to reinsure with foreign insurance companies, thereby increasing airlines’ insurance costs.\nMost African airlines, including Nigeria, insure their aircraft through local insurance firms, which then reinsure with Allianz, a German firm or the Lloyd’s of London, an insurance and reinsurance market located in London.\nAllen Onyema, chairman of Air Peace, Nigeria’s largest carrier, said what it cost Nigerian airlines to insure just one aircraft is what it cost airlines outside Nigeria to insure over three aircraft."
  },
  {
    "headline": "FG reappoints Oniha as DG, as DMO releases Sukuk rental payment calender – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Federal Government has reappointed patience Oniha as Director-General of the Debt Management Office (DMO) for another five years.\nMeanwhile, the DMO has released the Federal Government of Nigeria (FGN) Sukuk Rental Payment Calendar.\nAlso on the calendar is the 15.74 FGN Sukuk 2025, issued on Dec. 28, 2018, with Maturity Date as Dec. 28, 2025, and Rental Payment Dates as June 28 and Dec. 28.\nThere is also the 11.20 per cent FGN Sukuk 2027, issued on June 16, 2020, with Maturity Date as June 16, 2027, and Rental Payment Dates as Dec. 16 and June 16.\nThe last item on the calendar is the 13.00 per cent FGN Sukuk 2031, issued on Dec. 29, 2021, with Maturity Date as Dec. 29, 2031, while Rental Payment Dates are June 29 and Dec. 29."
  },
  {
    "headline": "Police Move To Stop Cult Killings, Nab 4 In Edo …as court remands suspects – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Police Command has moved to end the ongoing cult clash, arresting four suspected cultists in Benin City.\nThe police command therefore warned against incessant cult-related killings so far recorded in Benin City in the last 24 hours.\n“The Edo state Police Command warns residents of the State, especially Benin-city to stop incessant Cult killings as recorded in the last 24 hrs.\nIt was further stated that the Commissioner of Police in Edo State CP Abutu Yaro has ordered massive deployment of operatives towards restoring peace in the state.\n“The 4 suspects arrested are; 1."
  },
  {
    "headline": "Tallen, CSOs seek review of laws to protect the poor – Nigerian Observer",
    "summarized_story": "They made the call on Thursday at a National conference with the theme ‘Nigerian Criminal Justice System: The Criminalisation of Poverty in Nigeria’.\nThe conference was to examine Nigeria’s dysfunctional criminal justice system, which the organisers said unequally and disproportionately affected the poor and the most vulnerable in the society.\nThe Minister of Women Affairs, Mrs Pauline Tallen, said it was imperative to review the justice system to support people faced with economic obstacles, rather than incarcerating them.\nHe said that this was necessary because the criminal justice system in the country, disproportionately affect the poor.\n“We think that the criminal justice system that criminalises the people needs to be addressed,’’ he added."
  },
  {
    "headline": "Calabar Port receives first large vessel in 3 years – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestActivities at the Calabar Port were boosted on Thursday as a general cargo vessel berthed with 204 heavy-duty trucks, 22 cubic metres of pipes and other containers.\nThe manager said that Calabar Port was still viable and of economic benefit to the state and to Nigeria.\n“The significance of the berthing of this vessel is to tell the world that Calabar Port is active and working.\nThe rumour going round that nothing is happening in Calabar Port is fake.\n“The length of this vessel is 190 metres, and this has never happened in recent times at Calabar Port."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Osun 2022: A vote for Oyetola, a vote for accountability, transparency – Oyebamiji",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Chairman, Governor Adegboyega Oyetola re-election campaign committee for Irewole/Ayedaade/Isokan Federal constituency, Mr Bola Oyebamiji has called on residents of the State to vote for the governor, as according to him, his credibility has been tested in his first term.\nOyebamiji spoke on Thursday as the campaign train of Governor Oyetola stormed the federal constituency for a rally to canvas votes for the Governor towards the July 16 Gubernatorial elections.\nThe Campaign train moved to the Federal Constituency with visits to Irewole and Isokan Local Government areas where the Governor unveiled his second term plans.\nSpeaking further, Oyebamiji stressed that the current economic situation of the State requires someone with God’s wisdom who is well grounded in the art of governance, stressing that Governor Oyetola is the only candidate endowed with the qualities to run Osun.\nWhile expressing gladness at the exploits of the Governor in the state, Oyebamiji used the medium to acknowledge God’s goodness in his life, stressing that with God all things are possible."
  },
  {
    "headline": "Margie Offoha’s “Flag of Our fatherland: Nigeria” poem trends globally",
    "summarized_story": "A Poem on Nigeria titled “Flag of our fatherland, Nigeria” written by Mrs Margie Chinyere Offoha, Nigerian -American citizen, a Novelist and poet, has gained a pride of place in global highly rated allpoetry.com.\nThe poet went further to query, “Oh, mighty flag of our fatherland can you see the pain and suffering your children are enduring?\nOh, mighty flag of our land, can you hear our cry?\nOh, mighty flag, what happened to the promise you made, many years ago?\nOh, mighty green, white, and green, the flag of our homeland, hear our cry."
  },
  {
    "headline": "Insurgency in Nigeria spiraling out of control, threatens country’s unity, stability",
    "summarized_story": "Zamfara has been one of the worst-affected states by banditry in Nigeria.\nFor that, the state government said it is “ready to facilitate people, especially farmers, to secure basic weapons for defending themselves”.\nAccording to them, this seeming silence by both government and military in Nigeria do not, in any way, reassure Nigerians that the government is on top of the situation.\nOr that the government is , in all sincerity, fulfilling one of her primary obligation of protecting the lives and properties of her citizens.\nAny person who gives wrong information against anybody should equally serve the same punishment as an informant and will be treated as such."
  },
  {
    "headline": "U.S. Consulate celebrates 4 years of empowering bizwomen via Academy for Women Entrepreneurs",
    "summarized_story": "On Thursday, a diverse group of 250 women graduated from the fourth cohort of the U.S. Academy for Women Entrepreneurs (AWE) and joined 520 other Nigerian businesswomen who have benefitted from the program.\nDesigned to help women realize their economic potential, the AWE program is a U.S. government initiative that supports women entrepreneurs around the world and connects them with funding opportunities that facilitate their business expansion and entrepreneurial success.\nThe U.S. Department of State established the Academy for Women Entrepreneurs in 2019 to provide women entrepreneurs with the skills, resources, and networks needed to start and scale successful businesses.\nU.S. Consulate Acting Consul General James Suor, in his remarks, highlighted the importance of empowering women and girls for economic growth.\nSuor expressed great pride in the graduates, noting that women entrepreneurs are a growing market force that serves as a critical source of innovation for job creation and economic growth."
  },
  {
    "headline": "FirstGem: FirstBank launches single-digit loan for women-owned businesses",
    "summarized_story": "Key Points*The FirstGem fund (FirstGem loan) is a single-digit loan scheme, exclusively designed to put women at an advantage in contributing to the socio-economic development of the country.\nThe FirstGem loan scheme is designed for female-owned or partnered SMEs in the following sectors Food/Beverage processing & Packaging, Beauty and cosmetics, Confectionaries, Catering & Restaurants, Transportation (Logistics) and Agric/Agro-Allied (retail value chain).\nWith an interest rate of 9% per annum, FirstGem loan is a collateral-free loan that is available to the bank’s existing and prospective female customers.\nTo access the loan, Female owned or partnered SMEs can visit the Bank’s website – https://www.firstbanknigeria.com/personal/loans/more-financing-options/firstgem-funds/ – to download and fill out the Retail Loan Application Form.\nThe facility, which is in the sum of US$100 million will have a minimum of 30% allocated in the form of credit lines to women entrepreneurs"
  },
  {
    "headline": "Nigeria Hails Germany Over Joint Declaration On Return Of Benin Bronzes’",
    "summarized_story": "Nigeria and Germany yesterday in Berlin signed a historic joint declaration that will pave the way for the return of 1,130 Benin Bronzes to Nigeria, 125 years after they were looted from the ancient Benin Kingdom during the Benin Expedition of 1897.\n‘’Germany has gained more friends in Nigeria and all over the world by returning to Nigeria what rightfully belongs to it,’’ he said.\nOn his part, the minister of State for Foreign Affairs, Ambassador Zubairu Dada, called Germany the ‘champion of justice and fairness’.\nAlso Speaking, the minister of Foreign Affairs of Germany, Ms Baerbock, said: ‘’It was wrong to take the (Benin) bronzes.\nThis is the beginning to right the wrong.’’In a symbolic gesture signifying the impending return of the artefacts, two of the Benin Bronzes were handed over to Nigeria at the signing ceremony."
  },
  {
    "headline": "Nigeria Hails Germany Over Joint Declaration On Return Of Benin Bronzes’",
    "summarized_story": "Nigeria and Germany yesterday in Berlin signed a historic joint declaration that will pave the way for the return of 1,130 Benin Bronzes to Nigeria, 125 years after they were looted from the ancient Benin Kingdom during the Benin Expedition of 1897.\n‘’Germany has gained more friends in Nigeria and all over the world by returning to Nigeria what rightfully belongs to it,’’ he said.\nOn his part, the minister of State for Foreign Affairs, Ambassador Zubairu Dada, called Germany the ‘champion of justice and fairness’.\nAlso Speaking, the minister of Foreign Affairs of Germany, Ms Baerbock, said: ‘’It was wrong to take the (Benin) bronzes.\nThis is the beginning to right the wrong.’’In a symbolic gesture signifying the impending return of the artefacts, two of the Benin Bronzes were handed over to Nigeria at the signing ceremony."
  },
  {
    "headline": "Don’t Cause Problem With Religious Based Tickets, Coalition Tells Politicians",
    "summarized_story": "The Interfaith Coalition, a Christian and Muslim group has called on Nigerian politicians to shun the idea of fielding religious-based tickets.\nBut Speaking at a press conference, the Co-chairman of the Interfaith Coalition, Dan Kadzai said picking a running mate from the same faith will create tension in the polity.\nAccording to Kadzai, “in the whole of the Christians in Nigeria even if you want to put a dummy running mate, you did not see one among the Christians?\nNorth East is faced with Boko Haram and ISWAP terrorists, North West is faced with banditry.\nEven in the North Central, we have kidnappers and bandits, “ the Interfaith Coalition said warning politicians not to divide the country further."
  },
  {
    "headline": "Don’t Cause Problem With Religious Based Tickets, Coalition Tells Politicians",
    "summarized_story": "The Interfaith Coalition, a Christian and Muslim group has called on Nigerian politicians to shun the idea of fielding religious-based tickets.\nBut Speaking at a press conference, the Co-chairman of the Interfaith Coalition, Dan Kadzai said picking a running mate from the same faith will create tension in the polity.\nAccording to Kadzai, “in the whole of the Christians in Nigeria even if you want to put a dummy running mate, you did not see one among the Christians?\nNorth East is faced with Boko Haram and ISWAP terrorists, North West is faced with banditry.\nEven in the North Central, we have kidnappers and bandits, “ the Interfaith Coalition said warning politicians not to divide the country further."
  },
  {
    "headline": "Rotary District 9125 To Promote Healthcare, Peace Building – Governor",
    "summarized_story": "He said the District would also promote and encourage peace Building efforts by collaborating with relevant authorities through its Institute of Peace Building.\nRotary District 9125 is composed of 143 clubs, spread across 23 states including the Federal Capital Territory (FCT), which makes it the largest Rotary District in the country.\n“Sometimes, we build healthcare centres and hand them over to local authorities and they are not well managed.\nHe added: “We also intend to engage in the promotion of peace building.\nWe have an Institute of Peace Building and we have a committee nationwide working in collaboration with all the other Districts to make sure that we promote peace building through awareness creation, engagements with people in government and to make sure that everything is done.”"
  },
  {
    "headline": "‘Their Blood Will Turn To Fire’ — Redeemed Church Overseer, Pastor Adeboye Rains Curses On Terrorists, Sponsors",
    "summarized_story": "The General Overseer of the Redeemed Christian Church of God, Pastor Enoch Adeboye, has “cursed” kidnappers, herdsmen and other criminal groups terrorising Nigeria.\nDuring his sermon at the ongoing July Holy Communion Service, Adeboye prayed that terrorists and all their sponsors would not know peace.\nIn his words: “As the Lord lives, every evil plot against the church of the Lord will be consumed by fire in the name of Jesus.\nFrom now every kidnapper, terrorists including their sponsors will never experience rest again.\n”As long as Jesus lives, as long as the name of God I serve is the consuming fire, every evil plot against the church of God, the fire of God will consume them.”"
  },
  {
    "headline": "JUST IN: Appeal court convicts Senator Nwaoboshi of money laundering",
    "summarized_story": "JUST IN: Appeal court convicts Senator Nwaoboshi of money launderingA court of appeal panel has convicted Senator Peter Nwaoboshi of money laundering, court sources have said.\nNwaoboshi, senator representing Delta North district on the platform of the All Progressives Congress (APC), was convicted following an appeal by the Economic and Financial Crimes Commission (EFCC).\nThe agency had appealed the June 2021 ruling of Justice Chukwujekwu Aneke of the Federal High Court, Lagos.\nThe judge discharged and acquitted Mr Nwaoboshi, 64, of about N322 million money laundering claims filed by the EFCC, triggering the appeal.\nThe EFCC had alleged that N322 million of the money formed part of the proceeds of an unlawful act, claiming the fund was transferred to vendors by order of Suiming Electrical Ltd."
  },
  {
    "headline": "BREAKING: Orubebe officially joins APC in Delta",
    "summarized_story": "Former Minister of Niger Delta Affairs, Elder Godsday Peter Orubebe has officially joined the ruling All Progressives Congress, APC.\nHe said he is in the APC to deliver all the five candidates, especially three candidates in the Burutu Local Government Area of Delta in the forthcoming election.\nElder Orubebe boasted that resources to prosecute the elections will be provided.\nWhile sympathizing with the Ijaw APC family over their inability to get any appointments, Elder Orubebe assured them that he will ensure, “what due Ijaw people will be secured.”The APC Local Government Area Chairman in Burutu, Comrade Moni Seikemienghan Moni thanked Orubebe for joining the party just as he expressed confidence that he (Orubebe) in addition is a big plus to the party.\nAccording to him, “Ijaw Nation now have high ranking politician that will stand in the gap.”"
  },
  {
    "headline": "BREAKING: 2023: North-West APC demands vice-presidential slot",
    "summarized_story": "The leaders of the All Progressives Congress (APC) from the North-West have demanded the position of vice president ahead of the July 15 deadline set by the Independent National Electoral Commission (INEC) for the substitution of candidates by political parties where necessary.\nAgainst this background, the leaders of the party from the region have decided to engage the presidential candidate of the party, Senator Bola Tinubu, to make their views known.\nThe North-West leaders are coming out for the first time after the special convention of the party which produced Tinubu to make a demand for the position.\nThe position of the North-West APC leaders was contained in a statement issued by the APC National Vice-Chairman (North-West), Dr. Salihu Lukman after their meeting held on Thursday in Kaduna.\nDetails in a moment…"
  },
  {
    "headline": "ASUU strike: SERAP move to sue Buhari",
    "summarized_story": "The Socio-Economic Rights and Accountability Project, SERAP, has said it will take a legal action against President Muhammadu Buhari over the lingering strike embarked on by public universities’ lecturers.\nSERAP said this on its verified Twitter handle @SERAPNigeria Today.\nReacting to the impasse between the government and lecturers, SERAP said: “BREAKING: The ASUU strike which has kept poor children at home while the children of Nigeria’s politicians attend private schools, is a CRIME AGAINST HUMANITY.\n“We’re suing the Buhari administration over its violation of poor children’s rights to education and equal protection.”Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "PDP crisis over Atiku’s running mate: I don’t want Atiku to smell Aso Villa in 2023 – Afegbua",
    "summarized_story": "…Says PDP crisis’ll frustrate the ex-VPA former chieftain of the Peoples Democratic Party (PDP), who was also a commissioner for information in Edo state, Prince Kassim Afegbua, has said he would not want the presidential candidate of the PDP, Atiku Abubakar, to get close to Aso Villa come 2023.\nHe said further that the crisis rocking the main opposition party, emanating from the former vice-president’s choice of running mate, would eventually frustrate him at the polls.\nHe said, “Well, talking about the Peoples Democratic Party (PDP) as the largest opposition party and all of that, well I think the party presently, under the leadership of Iyorchia Ayu, is in disarray.\nSo, presently if you put the equation together, the leadership of the party should come from the South where most of their governors are.\nOrtom was there on account of being a member of the PDP Governors’ Forum."
  },
  {
    "headline": "Breaking: Mohammed Salah strikes new deal, becomes Liverpool’s highest-paid player",
    "summarized_story": "The 30-year-old Egypt forward only had a year left on his previous deal and there had been doubts about whether he would stay.\nSalah has scored 156 goals in 254 appearances during his five years at Anfield since moving from Roma.\nBBC Sport understands the new deal makes Salah the highest paid player in Liverpool’s history.\nSalah has won the Champions League, Premier League, FA Cup, League Cup, Fifa Club World Cup and Uefa Super Cup during his time at Anfield.\nHe has also won or shared three Premier League Golden Boots and been named the PFA player of the year twice while with Klopp’s side."
  },
  {
    "headline": "ACCI Appoints MD/CEO Bristol Group as Vice President – Industry",
    "summarized_story": "The Executive Committee and Council Members of Abuja Chamber of Commerce and Industry has appointed the group Managing Director and Chief Executive Officer (MD/CEO) of Bristol Group, Dr Chijioke Ekechukwu as the Vice President -Industry of the Chamber.\nThe President of ACCI, Dr Al-Mujtaba Abubakar announced the appointment of Dr Ekechukwu at the 16th EXCO meeting on Thursday as ACCI VP Industry to replace the late Ichie Jude Igwe who occupied the position till his demise on the 15th of October 2021.\nDr Chijioke has served as the Director General ACCI betweeen 2017 and 2018.\nHe is on the Board of First Generation Mortgage Bank Ltd, Abuja, Bristol Academy Ltd and Dignity Finance and Investments Ltd.\nHe is also the Chairman of Oriental Rice Mill Ltd.Dr. Ekechukwu, a former President of Rotary Club of Abuja is happily married with children."
  },
  {
    "headline": "Economy Diversification: Why Nigeria’s mining sector offers robust economic potential- Adegbite",
    "summarized_story": "“Let me emphasis that, investment in the minerals and mining sector by stakeholders is a patriotic duty of every citizen who believe in the Nigerian Project.\nThe Federal government is developing a well governed mining sector with sustainable capacity and has also articulated a roadmap to address some of the identified challenges in the mining sector.\nThe initiatives and strategies outlined in the roadmap are designed largely to make the mining and minerals sector an irresistible destination for global capital.\nIn addition, developmental plans should take into cognizance the overall development aspirations of the State alongside the prospects and challenges of mining activities“The Mining sector to significantly contribute to Nigeria’s economy cannot be over-emphasized.\nKey programs of relevance to the sector must be critically and more robustly assessed by qualified professionals in the mix of our national development."
  },
  {
    "headline": "MMSD task staff on dedication to duty for improved productivity",
    "summarized_story": "has called on Civil Servants to be dedicated to duty for improved productivity.\nAdegbite made the call during the celebration organized by the ministry to commemorate the 2022 African Public Service Day in Abuja.\nShe told the workers that the occasion also affords the opportunity to specially acknowledge members of staff that have distinguished themselves through outstanding performance.\nUmar Adamu Tsoho who was honoured with the “Presidential Public Service Award” by the OHCSF for outstanding service.\nIt is indeed a noble achievement to successfully exit the Federal Civil Service through retirement."
  },
  {
    "headline": "Russian-Ukraine War: Buhari wants EU to increase oil and gas purchases from Nigeria",
    "summarized_story": "By Mathew Dadiya, AbujaPresident Muhammadu Buhari, Thursday in Lisbon, Portugal, indicated that Nigeria is ready to fill the natural gas gaps in Europe predicated by the current Russian-Ukrainian war.\nThe President also said with over 200 million mainly young people, Nigeria is ready to be the hub of the African Continental Free Trade Area (AFCFTA).\nIn his statement on areas of cooperation between Nigeria and Portugal delivered at the Presidential Palace in Lisbon, Buhari urged Portugal to consider Nigeria as a valued and trusted partner in Africa.\nOn oil and gas, Buhari said with the current Russian-Ukraine war, increased cooperation in oil and gas between the two countries has become vital to avoid a crisis in the demand and supply chain, even as Nigeria is already a major supplier of gas to Portugal.\nBuhari also stressed the need to establish a Joint Commission, saying:‘‘We believe that the establishment of a Joint Commission will help to promote the full realization of the objectives of our bilateral relations."
  },
  {
    "headline": "Stakeholders target transport sector as alternative revenue booster",
    "summarized_story": "By Disun AmosunStakeholders in the nation’s Road Transportation sector on Thursday advocated for proper harnessing of the huge potentials offered by it as a means of diversifying Nigeria’s economy.\nThe Speaker, House of Representatives, Hon.\nThe Speaker described Transport as an activity as old as human existence, and explained that the sector could be made to lift the nation out from the blues.\nAccording to Mr Abbas, the House Committee on Land Transport is aware of all these menaces and is working assiduously to see how it can be brought to a halt or to the barest minimum.\n“The Committee on Land Transport is desirous to promulgate laws that would turn around the transport sector within the shortest possible time”, he said."
  },
  {
    "headline": "Germany Signs Deal To Return Benin Bronzes To Nigeria",
    "summarized_story": "Germany signed an agreement on Friday to begin sending hundreds of Benin bronzes back to the Federal Government, rubber-stamping the biggest effort yet by a European country to return the looted artworks.\nForeign Minister Annalena Baerbock and Culture Minister Claudia Roth signed the deal with their Nigerian counterparts in Berlin after Germany first announced that it would begin returning the bronzes last year.\n“Today we have reason to celebrate, because we have reached a historic agreement — the Benin bronzes are returning home,” Baerbock said.\nThousands of Benin bronzes, metal plaques and sculptures that once decorated the royal palace of the Kingdom of Benin are now scattered around European museums after being looted by the British at the end of the 19th century.\nNigeria has been negotiating the return of Benin bronzes from several European countries and plans to build a museum in Benin City in southern Edo state, where it hopes to house them."
  },
  {
    "headline": "Loyalty To Nigeria Is Reason I Want To Become President, Al-Mustapha Declares",
    "summarized_story": "﻿The Chief Security Officer to late General Sani Abacha, Major Hamza Al-Mustapha (retd) has said that his loyalty to Nigeria is the reason he is again running for the position of president come 2023.\nAl-Mustapha who is presidential candidate of the Action Alliance (AA) stated this on Friday when he appeared as a guest on Channels Television’s Politics Today.\n“It is that sense of awareness, that commitment driven by the energy of patriotism that brought us to the fore to face politics, ” Major Al-Mustapha asserted.\n“For the last seven years since I came out of prison, we have been undertaking researches in and out of Nigeria, and our findings are extremely disturbing.\n“What every committed Nigerian should do right now is to understand the enormity of the problems facing Nigeria,” the AA presidential candidate opined."
  },
  {
    "headline": "Money Laundering: Appeal Court Jails Senator Nwaoboshi For Seven Years",
    "summarized_story": "The Lagos Division of the Court of Appeal on Friday convicted and sentenced Senator Peter Nwaoboshi, senator representing Delta North Senatorial District at the National Assembly, to seven years imprisonment along with his two companies: Golden Touch Construction Project Ltd and Suiming Electrical Ltd.\nThis was contained in a statement from the Economic and Financial Crimes Commission (EFCC), which prosecuted the case.\nIn addition, the Court of Appeal ordered that the companies who were the second and third respondents in appeal be wound up in line with Section 22 of the Money Laundering (Prohibition) Act, 2011 (as amended) and their properties forfeited to the Federal Government.\nHowever ruling on the EFCC’s appeal on Friday, the Court of Appeal held that the trial judge erred in dismissing the charges against the respondents.\nIt said the prosecution had proved the ingredients of the offence and consequently found the defendants guilty as charged."
  },
  {
    "headline": "Alleged Organ Harvesting: Court Orders Immigration, Others To Release Requested Information To Ekweremadu",
    "summarized_story": "A Federal High Court in Abuja has ordered the release of the official details of an alleged organ donor to a former Deputy Senate President, Ike Ekweremadu, and his wife, Beatrice.\nBy the court order, all official information in relation to the donor, including the account opening package, are to be released to Senator Ekweremadu and his wife to ascertain his real age.\nThis followed an originating summon filed by Senator Ekweremadu and his wife through their counsel and a Senior Advocate of Nigeria (SAN), Adegboyega Awomolo.\nFollowing their arrest by the London Metropolitan Police, the duo appeared before a UK court which ordered that they should be remanded in custody till July 7 while investigations continue into the allegations against them.\nAlthough the Met police said the donor was 15, the NIS said it issued an international passport indicating his age as 21 after due process."
  },
  {
    "headline": "Sharia Court Sentences Three To Death By Stoning For Raping Boys In Bauchi",
    "summarized_story": "An Islamic court in Bauchi state has sentenced three men to death by stoning for raping two boys, an official said Friday.\nBauchi is among a dozen states in the north where Sharia law is in operation alongside common criminal justice.\nThe court in the town of Ningi handed down the sentences on the trio on Wednesday, Sharia police or Hisbah official Adamu Dankafi said.\nREAD ALSO: I Have No Regrets Working With Abacha, Says Al-MustaphaRaping minors is punishable by death under Nigeria’s Sharia law, although like most other death sentences it has never been enforced.\n“The Upper Sharia Court One in Ningi handed down the death sentence on the three men for committing homosexual acts with two brothers aged 10 and 12,” Dankafi said."
  },
  {
    "headline": "PDP already mending fences ahead 2023",
    "summarized_story": "The Governor of Delta state and running mate to the presidential flag bearer of the People’s Democratic Party, Ifeanyi Okowa said his party is already mending fences ahead of next year’s presidential elections.\nHe said issues within the party that are capable of jeorpadising the chance of the party on the ballot are being identified and tackled.\nHe said there consultations, negotiations, and interaction currently ongoing as an internal dispute resolution mechanism.\nGovernor Okowa said what seems like a disagreement between majors stakeholders in the party is normal within a democratic institution like the PDP.\nTHE Delta State Governor told state house correspondent after meeting privately with Vice President Yemi Osinbajo that his party has what it takes to oversee the admin situation of the country in 2023."
  },
  {
    "headline": "Oyo REC, Agboke confirms extension of Continuous Voters Registration -",
    "summarized_story": "The Oyo State Resident Electoral Commissioner, Mutiu Agboke has confirmed the extension of the ongoing Continuous Voters Registration exercise till further notice.\nA press statement signed by the REC said the Independent National Electoral Commission Oyo State has announced the Continuation of the ongoing Continuous Voters Registration till further notice.\nMutiu Agboke noted that the Continuation of the exercise became necessary for the Commission to continue to provide Electoral services to the people of the state and in order to register all eligible and interested persons.\nThe Resident Electoral Commissioner stressed that, the Commission has also deployed additional machines to areas of pressure in the State, adding that INEC would continue to serve the people of the State with regards to the ongoing exercise.\nHe however implore the general public not to indulge in multiple registration saying that such would amount to electoral offence punishable under the Law."
  },
  {
    "headline": "Edo federal lawmaker, Jude Ise-Idehen is dead",
    "summarized_story": "The lawmaker representing Egor/Ikpoba Okha federal constituency of Edo State, in the House of Representatives, Jude Ise-Idehen is dead.\nHe died on Friday at age of 52 years.\nSpokesman of the House, Benjamin Kalu, confirmed the death in a telephone chat with TVC News.\nJude Ise-Idehen won the Peoples Democratic Party’s ticket to seek re-election in the 2023 general election.\nJude Ise-Idehen was a devout catholic, an entrepreneur, a philanthropist and a former member of Edo State House of Assembly."
  },
  {
    "headline": "8 reportedly killed during protest against military rule in Sudan",
    "summarized_story": "Eight people have been reported killed as huge crowds took to the streets of Sudan amid a communications blackout to rally against the country’s military leadership that seized power eight months ago.\nSix people were fatally shot when police fired live ammunition at protesters in Omdurman, the twin city of Khartoum, the Sudanese capital.\nTens of thousands of people were estimated to be protesting in Khartoum and its twin cities of Omdurman and Bahri.\nSecurity forces used tear gas and water cannons to prevent protesters from marching towards the presidential palace in central Khartoum.\nThe “March of Millions” on Saturday, however, is expected to be the largest coordinated demonstration to date."
  },
  {
    "headline": "PDP is Going Through Turbulence of Managing Decisions That Have Been Taken – Kola Ologbodiyan",
    "summarized_story": "The People’s Democratic Party (PDP) will need to put its house in order as the 2023 general elections draws near.\nSince the emergence of Atiku Abubakar as its standard bearer, and the choice of Delta State governor Ifeanyi Okowa as his running mate, some party members feel Rivers State Governor Nyesom Wike should have been picked ahead of his Delta state counterpart.\nTo discuss the internal issues within the party, is Kola Ologbodiyan, former National Publicity Secretary of Peoples Democratic Party."
  },
  {
    "headline": "Atiku Will Unite PDP + Igbokwe Says Wike And Tinubu Met In France – Trending With Ojy Okpe",
    "summarized_story": "Reactions have trailed the response by the presidential candidate of the Peoples Democratic Party Atiku Abubakar who on Thursday reacted to the reported crisis within the opposition party.\nIn another development, a cross section of Nigerians on Thursday reacted to the supposed meeting between the Presidential candidate of the All Progressives Congress Asiwaju Bola Ahmed Tinubu, and the Rivers State Governor Nyesom Wike in France.\nFinally, In Nigeria Singer and producer Abdulrasheed Bello better known as JJC Skillz on Thursday took to instagram to announce his separation from popular Nollywood Actress Funke Akindele."
  },
  {
    "headline": "Nigeria: Appeal Court Jails Delta Senator Nwaoboshi 7 Years for Money Laundering",
    "summarized_story": "RelatedStories No Content AvailableEFCC had arraigned the three defendants over the acquisition of a property named Guinea House, Marine Road, in Apapa, Lagos, for N805 million.\n“It also proved that the loan of N1.2 billion together with interest of N24 million was properly granted to the third.\nNothing else was proved by the complainant or prosecutor in this case,” the judge said.\nHowever ruling on the EFCC’s appeal on Friday, the Court of Appeal held that the trial judge erred in dismissing the charges against the respondents.\nIt said the prosecution had proved the ingredients of the offence and consequently found the defendants guilty as charged."
  },
  {
    "headline": "Ukraine War: Russian Missile Strikes Kill 20 in Odesa Region",
    "summarized_story": "At least 20 people, including one child, have died in overnight Russian missile strikes on Ukraine’s southern Odesa region, Ukrainian officials say.\nAnother four people, including the child, were killed in a separate strike on a holiday resort in the village.\nThe child killed at the holiday resort was a 12-year-old boy, said Kyrylo Tymoshenko, deputy head of President Volodymyr Zelensky’s office.\nAndriy Yermak, Ukrainian President Volodymyr Zelensky’s chief of staff, accused Russia of being a “terrorist country”.\nUkraine had hoped that the Russian withdrawal on Thursday from the strategically important Snake Island would ease the threat to Ukraine’s biggest Black Sea port of Odesa and wider region."
  },
  {
    "headline": "Russia Begins Shipping Grain From Occupied Ukraine Port",
    "summarized_story": "Russia on Thursday began shipping grain from Ukraine’s occupied territory, with a vessel carrying 7,000 tons of cereal sailing from Ukraine’s occupied port of Berdyansk.\nThursday’s grain shipment from the port of Berdyansk marks the opening of a sea route to export wheat from Ukraine to third countries.\nRussia’s Black Sea ships “are ensuring the security” of the journey, he said, adding that the Ukrainian port had been demined.\nRussia insists that it will let Ukraine ship its grain if Kyiv forces demine sea lanes.\nThe Kremlin claims local residents will choose their own future, suggesting they are in favor of a referendum on the status of Ukraine’s occupied territory."
  }
]