[
  {
    "headline": "Dieting cannot cure stomach ulcer, seek appropriate treatment, physician tells patients",
    "summarized_story": "Angela OnwuzooA Consultant Public Health Physician, Dr. Chukwuma Anyaike, has urged stomach ulcer patients to seek appropriate treatment, noting that dieting cannot cure the health condition.\nSpeaking in an interview with PUNCH HealthWise, Anyaike said it is risky for people to trivialise stomach ulcers, warning against self- medication.\nAccording to him, some people have lost their lives to stomach ulcers, as a result of self-medication and their refusal to seek help from experts.\n“It’s very wrong for someone to say that there is no drug for a stomach ulcer.\nDr. Anyaike noted that a stomach ulcer could cause internal bleeding if left untreated."
  },
  {
    "headline": "Dieting cannot cure stomach ulcer, seek appropriate treatment, physician tells patients",
    "summarized_story": "Angela OnwuzooA Consultant Public Health Physician, Dr. Chukwuma Anyaike, has urged stomach ulcer patients to seek appropriate treatment, noting that dieting cannot cure the health condition.\nSpeaking in an interview with PUNCH HealthWise, Anyaike said it is risky for people to trivialise stomach ulcers, warning against self- medication.\nAccording to him, some people have lost their lives to stomach ulcers, as a result of self-medication and their refusal to seek help from experts.\n“It’s very wrong for someone to say that there is no drug for a stomach ulcer.\nDr. Anyaike noted that a stomach ulcer could cause internal bleeding if left untreated."
  },
  {
    "headline": "How to reduce burden of lupus disease –Rheumatologist",
    "summarized_story": "A Consultant Rheumatologist, Dr. Hakeem Olaosebikan, has called for improved awareness to reduce the burden of Systemic Lupus Erythematosus disease.\nHe made the call in commemoration of the World Lupus Day celebrated annually on May 10, with this year’s theme as “Lupus: A Challenge to Resilience.”Systemic lupus erythematosus or lupus disease is an autoimmune disease that occurs when the body system attacks its tissues and organs.\nAccording to Olaosebikan, lupus can affect people of all nationalities, races, ethnicities, genders and ages.\nThe rheumatologist said that diagnosing lupus was often difficult as its symptoms mimic those of other common ailments.\nOlaosebikan said that understanding lupus would assist control its impact and ensure that people with lupus are diagnosed and treated effectively."
  },
  {
    "headline": "How to reduce burden of lupus disease –Rheumatologist",
    "summarized_story": "A Consultant Rheumatologist, Dr. Hakeem Olaosebikan, has called for improved awareness to reduce the burden of Systemic Lupus Erythematosus disease.\nHe made the call in commemoration of the World Lupus Day celebrated annually on May 10, with this year’s theme as “Lupus: A Challenge to Resilience.”Systemic lupus erythematosus or lupus disease is an autoimmune disease that occurs when the body system attacks its tissues and organs.\nAccording to Olaosebikan, lupus can affect people of all nationalities, races, ethnicities, genders and ages.\nThe rheumatologist said that diagnosing lupus was often difficult as its symptoms mimic those of other common ailments.\nOlaosebikan said that understanding lupus would assist control its impact and ensure that people with lupus are diagnosed and treated effectively."
  },
  {
    "headline": "We want a reformed LG administration profiling vigilante personnel – Edo DG",
    "summarized_story": ".Akoko-Edo Forums wants improved government presenceBy Ozioruva AliuBENIN CITY – THE Deputy Governor of Edo State, Rt.\nHon Comrade Philip Shaibu on Tuesday said the administration of Governor Godwin Obaseki was reforming the local government administration in the state to perform optimally like the state government.\nBesides, he said the government is currently profiling personnel of the state vigilante groups who are complementing the efforts of the conventional security apparatus to ensure arms do not get into wrong hands.\nWe want people.”On security, Shaibu said “We are profiling our personnel in the vigilante so that arms will not get into the wrong hands.\nThe AAU multi campus policy has been rolled out but we appeal to the government to look at the possibility of extending it to Akoko-Edo local government area."
  },
  {
    "headline": "Nigeria to end N500bn annual medical tourism — FG",
    "summarized_story": "The Federal Government says with the coming up of affordable world class health facilities, Nigeria will soon put an end to the over N500 billion being spent on medical tourism annually.\nSpeaking after a tour of the hospital, the minister said with more world class healthcare facilities like Duchess Hospital coming on stream, Nigeria is set become a destination for medical tourists.\nHe recalled that in the wake of COVID-19, the CBN set up the N100 billion Healthcare Sector Intervention Fund, which was later expanded to N200 billion.\nHe said the intervention fund was to provide credit support for the healthcare sector through long-term, low-cost financing.\n“You are also aware of the Federal Government’s Intervention in the Healthcare Sector through the Nigerian Sovereign Investment Authority (NSIA)."
  },
  {
    "headline": "Beware of rogues preparing to take over from you – Mbazulike tells Buhari",
    "summarized_story": "Now somebody bought forms for you, somebody forced to agree and append your signature on the forms, what a lie.\nHow come appointees and lawmakers are doling out such an amount of money to buy forms, where did they get such money.\nNobody is controlling them, they are telling the world that they are out of control, people that lack conscience.\n“And he is accepting that people bought form for him?\n“Also annoying is the claim that a group has equally bought form for former President Goodluck Jonathan."
  },
  {
    "headline": "2023: Orji Kalu hailed for withdrawing from Presidential Race, supporting Lawan",
    "summarized_story": "By Henry Umoru, ABUJAAHEAD of the 2023 Presidential election, a group under the aegis ofNational Stability Project has hailed the Chief Whip of the Senate, Senator Orji Uzor Kalu, All Progressives Congress, APC, Abia North for withdrawing from the Presidential race and supporting the Presidential aspiration of the President of the Senate, Senator Ahmad Lawan.\nIn a statement on Tuesday by the National Stability Project, a foremost political pressure group while commending the former Abia State Governor for withdrawing from the Presidential race and throwing his weight behind Lawan, said that with the action, Senator Kalu has distinguished him as a patriotic and selfless personality.\nAlso Read:2023: Toe the line of justice by supporting Ahmed Lawan — Orji Kalu tells supportersRecall that Senator Kalu who recently withdrew from the Presidential race said on Monday that he was backing the President of the Senate for the actualization of his aspiration to succeed President Muhammadu Buhari in 2023, just as he cited the lack of support from other Southern regions for South East.\nThe National Stability Project urged other Nigerians from all the regions, nooks, and crannies of the country to support Senator Lawan in his bid to rescue and rebuild the nation.\nSoon after the purchase of the forms, members of the group drove straight to the Maitama Guest House of the President of the Senate to present the form to him."
  },
  {
    "headline": "2023: APC begins aspirants’ screening on Thursday",
    "summarized_story": "By Omeiza Ajayi, AbujaThe ruling All Progressives Congress APC on Tuesday ended its sale of nomination and expression of interest forms, with no fewer than 25 aspirants jostling for its presidential ticket.\nAlthough, the directorate of organization was still computing the figures of aspirants including those who picked forms in their states as of press time, Vanguard gathered that there are at least 105 governorship aspirants, nearly a thousand national assembly aspirants and more than 1,500 aspirants for states Houses of Assembly.\nSubmitting his forms on Tuesday at the International Conference Centre ICC Abuja, Lagos State Governor, Babajide Sanwo-Olu urged stakeholders to cede the APC presidential ticket to the Southwest.\nALSO READ:On why the recent meeting of some Southwest APC leaders with some presidential aspirants from the zone did not result into a consensus arrangement, the governor said; “That is unfair for you to say we did not arrive at a consensus.\n“I think we believe so and I think that is what is fair, that is what is just, but it is really about Nigeria."
  },
  {
    "headline": "BREAKING: Another bomb explosion rocks Jalingo metropolis",
    "summarized_story": "A blast suspected to be a bomb explosion, has again exploded in Jalingo, the capital of Taraba State.\nThe explosion, which occurred on Tuesday at about 9pm, took place a few metres away from the military base located in the Jalingo metropolis.\nApart from that of Iware, it would be recalled that another explosion occurred in Nukkai area of Jalingo city last month.\nHe, however, promised to furnish our reporter with detailed information as soon as they are made available to the command.\nThe explosion, as observed by our correspondent, is the third of its kind in the state within the space of one."
  },
  {
    "headline": "Tenure elongation: I’ll hand over to next govt on May 29, 2023 – Buhari replies Clarke",
    "summarized_story": "President Muhammadu Buhari has responded to the call for him to extend his tenure by six months.\n“However, Chief Clarke is right to say that without security, Nigeria would not likely realize its true potential as a peaceful and prosperous nation.\n“Till the last day of the administration, the security of the citizens shall remain the administration’s paramount concern.\nYet, in any case, respect for the constitution and Nigerians’ democratic rights remains the best path to securing and then maintaining peace.\n“This, he claims, is necessary to create a new constitution for the people, made possible, paradoxically, by ignoring their democratic rights."
  },
  {
    "headline": "JAMB: 54,000 candidates registered for 2022 UTME from Kwara – Adio",
    "summarized_story": "About 54,000 candidates from Kwara State are involved in this year’s Unified Tertiary Matriculation Examination, UTME.\nChairman of the Kwara State Television Board, Ahmed Adio, disclosed this during a courtesy visit to the Vice-Chancellor of the state University, Malete, Professor Muhammed Mustapha Akanbi, on Tuesday.\nHe described the number as one of the highest in the North-Central geo-political zone, which Kwara state belonged.\nAdio extended the invitation for the Vice-Chancellor of the institution, to feature on its flagship morning programmes, A.M DRIVE.\nProfessor Akanbi commended Governor Abdulrahman AbdulRazaq for his exemplary policy of non-interference in the running of the Kwara State University, Malete and for supporting the institution at all times."
  },
  {
    "headline": "Yobe rainstorm: Governor Buni commiserates with victims’ families",
    "summarized_story": "Yobe State Governor, Hon.\nMai Mala Buni has commiserated with the families of five persons who died from building collapse following heavy rainstorm in Damaturu, the state capital.\nGovernor Buni said it is very sad to lose the victims in this very unfortunate natural disaster but that is the time decreed by the Almighty Allah.\nHe sympathised with those who sustained injuries and prayed for their quick recovery.\nIt could be recalled that five people were confirmed dead and many injured on Monday following a heavy downpour and thunderstorm in Damaturu, the Yobe State capital."
  },
  {
    "headline": "Biafra: Igbos not leaving Nigeria – Umahi",
    "summarized_story": "Ebonyi State Governor, Dave Umahi, said despite the agitation for Biafra, Igbos will remain in Nigeria.\nUmahi spoke to State House correspondents at the Presidential Villa on Tuesday, NAN reports.\nThe visit was to thank President Muhammadu Buhari for his two-day working trip to Ebonyi on May 5 and 6.\nHe dismissed the insinuation that the people of the South-East were no longer interested in Nigeria.\nThe governor stated that Igbos were not in support of any form of agitation or plans to secede."
  },
  {
    "headline": "Presidency rejects calls for extension of Buhari’s tenure, interim govt",
    "summarized_story": "The Presidency has said President Muhammadu Buhari-led administration does not subscribe to suggestions that it would need to extend its tenure beyond the May 29, 2023 by six months to establish peace and security.\nThe Presidency was reacting to two legal luminaries, Chief Robert Clarke (SAN) and Chief Afe Babalola, who in separate calls, expressed opinions suggesting that the administration should delay the upcoming general elections, extend its tenure by six months or constitute an Interim Government.\n“Till the last day of the administration, the security of the citizens shall remain the administration’s paramount concern.\n“This, he claims, is necessary to create a new constitution for the people, made possible, paradoxically, by ignoring their democratic rights.\n“Instead, this administration proposes something entirely simpler: honouring the constitution and people’s right to decide”, it said."
  },
  {
    "headline": "Why we adopted eNaira, by Emefiele",
    "summarized_story": "Central Bank of Nigeria (CBN) Governor Godwin Emefiele has said the adoption of the eNaira was meant to strengthen the payment system infrastructure.\nHe assured that the CBN will always invest in hi-tech projects that will boost the nation’s global competitiveness.\nThe team came to Nigeria to study the Central Bank Digital Currency (eNaira).\nEmefiele said: “The eNaira, being the first of its kind for a large country like Nigeria, was attracting the interests of many countries, Uganda inclusive.\nThe President also declared that the introduction of the eNaira would enable the government to send direct payments to citizens eligible for specific welfare programmes as well as foster cross border trade."
  },
  {
    "headline": "Aviation fuel not selling at N700 per litre, says MOMAN",
    "summarized_story": "Major Oil Marketers Association of Nigeria (MOMAN) has debunked claims Aviation Turbine Kerosene (ATK), also known as aviation fuel, was sold at N700 per litre in some parts of the country.\nIsong said: “I am not aware that aviation fuel is sold anywhere at N700 per litre.\n“There is no where aviation fuel is sold at N700 per litre,” the executive secretary said.\nHe said enquiries made by MOMAN showed that aviation fuel was cheaper in Nigeria compared to other West African countries.\nIt is not only aviation fuel that has gone up, even though it is a contributory factor."
  },
  {
    "headline": "Adamu Garba withdraws from APC presidential race over N100m nomination fee",
    "summarized_story": "A presidential aspirant on the platform of the All Progressives Congress (APC), Adamu Garba II, on Tuesday withdrew from the race.\nGarba announced his withdrawal at a briefing in Abuja.\nHe attributed his decision to the high cost of obtaining APC’s expression of interest and nomination forms for presidency and cost of running for political office.\nAccording to him, selling presidential forms at N100 million would promote fcommercialization of the political space.\n“When we raised this concern on several media fora, the party, however, believed the high cost of form will separate the serious contenders from unserious ones."
  },
  {
    "headline": "JUST IN: Sanwo-Olu submits nomination forms, promises better Lagos",
    "summarized_story": "JUST IN: Sanwo-Olu submits nomination forms, promises better LagosLagos Governor Babajide Sanwo-Olu has submitted his expression of interest and nomination forms for a second term in office.\nHe submitted his form accompanied by prominent Lagosians, including Ayangurin of Ikorodu, Oba Kabiru Sotobi and the Osolo of Isolo, Oba Kabiru Agbabiaka, among others.\nSpeaking with reporters, Sanwo-Olu expressed confidence in his re-election.\nHe also promised to consolidate on the programmes, projects and policies that have made the State investors delight in the last three years.\nHe assured Lagosians that his administration will continue to accord priority to sustain the peace and development of the State."
  },
  {
    "headline": "Senate bars ministers, others from voting at party congresses, primaries",
    "summarized_story": "Th bill to amend the 2022 Electoral Act No.\nOmo-Agege, in his presentation, said the bill seeks to amend the provision of section 84(8) of the Electoral Act.\n“The extant section only clearly provides for the participation of elected delegates in the conventions, congresses or meetings of political parties held to nominate candidates of political parties.\nA statement by the Clerk Yahaya Danzaria, implored lawmakers, who are currently on break to prepare for their political parties’ primaries, to endeavours to attend today emergency session.\nThe section failed to capture statutory delegates to political parties congresses and convention for the purpose of nominating their candidates for elections."
  },
  {
    "headline": "Sex tape: Lagos arraigns 4 Chrisland schoolteachers",
    "summarized_story": "ASP Cardoso told the court that the defendants committed the offence on April 25, at Chrisland School, in Victoria Garden City, Idimu, Lagos.\nShe stated that the teachers allegedly obstructed the course of justice by hiding the indecent acts of the students’ sex video before it later went viral.\nHis offence, according to Cardoso, contravened sections 411 and 97 (1) (3) of the Criminal Laws of Lagos State, 2015 (Revised).\nShe ordered that the sureties must submit copies of their National Identification Number (NIN) and their Lagos State Residents Registration Agency (LASRRA) card.\nShe also ordered that the sureties must be gainfully employed with evidence of three years tax payment to the Lagos State Government."
  },
  {
    "headline": "Emefiele: INEC to void strategic ties with CBN",
    "summarized_story": "However, should I answer their calls and decide to seek presidential nomination, I will use my own hard earned savings to buy my own nomination forms.\nHe said he would continue to serve the country in his capacity as CBN governor until he received divine counsel to contest for a higher office.\n“Indeed, there have been various reports that the CBN governor is nursing an intention to run for the office of President.\nIt is a performance failure of the CBN because the President does not manage inflation, statutorily it is the function of the CBN.\nAnd under the CBN act, CBN is supposed to be independent."
  },
  {
    "headline": "NANS issues FG, ASUU 9-day ultimatum to open public universities",
    "summarized_story": "From Fred Ezeh, Abuja and Layi Olanrewaju, IlorinThe National Association of Nigerian Students (NANS) has issued a nine-day ultimatum to the Federal Government and the Academic Staff Union of Universities (ASUU) to re-open all public universities for academic activities.\nThe lecturers’ industrial action aims at pressing home the demand for the revitalisation of public universities, earned academic allowances and deployment of the University Transparency and Accountability Solution for payment of university lecturers.\n•Unilorin students protestMeanwhile, students of the University of Ilorin (Unilorin), yesterday, staged a protest.\nPresident of SSANU, Mohammed Ibrahim explained that the platform was designed to accommodate all stakeholders in the university system, notably, academic, non academic staff and academic technologies.\nThe two unions like ASUU had rejected IPPIS introduced by the Federal Government for the payment of workers’ salaries."
  },
  {
    "headline": "Imo: Court bars PDP, INEC from using results of aborted ad hoc delegate list",
    "summarized_story": "From Godwin Tsa, AbujaA High Court of the Federal Capital Territory (FCT) sitting in Zubwa, Abuja, has barred the Imo State chapter of the Peoples Democratic Party (PDP) from using the result of the three-man ad hoc delegates election results.\nJustice Bello Kawu granted the preservative order after listening to a motion ex parte filed by Chidinma Nancy Uzomba, an aspirant cleared by the PDP to contest the election for Ideato federal constituency.\nIn the suit No: FCT/HC/BW/CV/1450/2022, the claimant listed the PDP and the Independent National Electoral Commission (INEC) as defendants.\nThe motion was accompanied by an affidavit of urgency deposed to by Maliki Sylvanus from the law firm of Mike Ozekhome.\nThe order further bars INEC from accepting from the PDP any list of candidates from Imo State who emerged from any primary election held with the list of the ill-fated delegates list."
  },
  {
    "headline": "2023: Jonathan Meets Adamu, Hours After Group Purchased Forms on His Behalf",
    "summarized_story": "The meeting, THISDAY gathered, took place few hours after a Fulani group, under the aegis of the Nomadic Pastoralists and the Almajiri Communities, purchased the ruling party’s nomination and expression of interest forms, sold for N100 million, for Jonathan.\nThe meeting between Jonathan and Adamu held at a secret location in Abuja and lasted about an hour, specifically between 9pm and 10 pm.\nThe statement read, “It has come to the notice of His Excellency Dr. Goodluck Ebele Jonathan, that a group has purportedly purchased Presidential Nomination and Expression of Interest forms, of the APC in his name.\n“We wish to categorically state that Dr. Jonathan was not aware of this bid and did not authorise it.\nOthers are: Governor Yahaya Bello of Kogi State; Ebonyi State governor, Dave Umahi; former Imo State governor, Senator Rochas Okorocha; Minister of State, Education, Hon."
  },
  {
    "headline": "Presidential Poll: Court Summons INEC, AGF over Emefiele’s Participation",
    "summarized_story": "Emefiele had amongst others, approached the Federal High Court for an order restraining the defendants from preventing or hindering his participating in the process of the presidential election slated for February next year.\nHe submitted that constitutional provisions stipulated that he can only resign his appointment as Governor of CBN 30 days to the presidential election which he is interested in contesting.\nArguing the motion for maintenance of status quo, Emefiele’s lawyer, Chief Mike Ozekhome, SAN, told the court that Emefiele “is in a dilemma” as to whether he can run in the forthcoming presidential election.\nFHC/ ABJ/ CS/610/2022, the plaintiff sought the interpretation of certain parts of the constitution that has to do with his aspiration of contesting the 2023 presidential election.\nHe sought another declaration that he can validly participate in the congresses of any political party of his choice as well as vote and be voted for."
  },
  {
    "headline": "Dasuki Formally Hands over Finance Ministry, Extols Tambuwal for Getting World Bank’s $55m Grant for Sokoto",
    "summarized_story": "Former Sokoto State Commissioner for Finance, Hon.\nDasuki who took over the affairs of the Ministry in 2019, had earlier tendered his resignation in March in compliance with the Electoral Act.\nHe recently returned from a foreign trip to formally hand over to the permanent secretary.\nHe said with the reforms initiated and executed, the Finance Ministry was adequately prepared to continue to lead the way in the development agenda of the state government.\nDasuki said those reforms boosted the state’s cash inflow and paved way for the provision of developmental projects across Sokoto."
  },
  {
    "headline": "Fulani Group Picks APC Presidential Nomination Forms for Jonathan",
    "summarized_story": "Adedayo AkinwaleA Fulani group has picked All Progressives Congress expression of interest and nomination forms for former President Goodluck Jonathan.\nJonathan who was elected President on the platform of the Peoples Democratic Party was defeated by President Muhammadu Buhari in 2015.\nThere had been speculations that the former president was considering taking another shot at the presidency but on the plaform of APC, the party which sent him out of Aso Rock seven years ago.\nSee photos of members of the group at the International Conference Centre Abuja, where they picked the forms for JonathanShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Kalu Withdraws from Presidential Race",
    "summarized_story": "Sunday AborisadeThe Chief Whip of the Senate, Orji Uzor Kalu, on Monday, formally withdrew from the race to succeed President Muhammadu Buhari next year.\nKalu, in a statement personally signed by him in Abuja, however declared his support for the candidature of the Senate President, Ahmad Lawan, for the top job.\nThe Senate President had on Monday, received the N100 million All Progressives Congress’ (APC) presidential forms purchased for him by the National Stability Project led by Chief Sam Nkire, who is the chairman of the movement.\n“In the absence of a South-easterner being president of Nigeria in 2023, I have my full support for a North-easterner.\nThis is because it would be the closest to the equity, fairness and justice everyone is talking about."
  },
  {
    "headline": "“Apostle Suleman Is Small, A Chronic Liar:” Watch SaharaTV Live Interview With Stephanie Otobo",
    "summarized_story": "You may also like"
  },
  {
    "headline": "“Apostle Suleman Is Small, A Chronic Liar:” Watch SaharaTV Live Interview With Stephanie Otobo",
    "summarized_story": "You may also like"
  },
  {
    "headline": "“Apostle Suleman Is Small, A Chronic Liar:” Watch SaharaTV Live Interview With Stephanie Otobo",
    "summarized_story": "You may also like"
  },
  {
    "headline": "Nigerian Government's ‘No work, No Pay’ Policy, An Attempt To Intimidate Striking Workers — Group",
    "summarized_story": "The Workers and Youth Solidarity Network has condemned the ‘no work, no pay' policy of the Nigerian Government against workers of public universities in the country.\nThe group noted, “To us in the WYSN, the 'No work, no pay' policy is an attempt to intimidate the striking workers.\nASUU members haven't received their salary for three months now in a Federal Government attempt to force them back to work.\n“We also extend our solidarity to Obafemi Awolowo University Students for their plan for protest actions.\n“We call on the National Association of Nigerian Students (NANS) to declare total support for ASUU strike and break away from dilly-dallying with a regime that doesn't care for education."
  },
  {
    "headline": "Buhari will hand over in 2023, says presidency on call for tenure extension",
    "summarized_story": "Garba Shehu, presidential spokesman, says President Muhammadu Buhari will hand over to his successor at the end of his tenure in 2023.\nOn Monday, Robert Clarke, senior advocate of Nigeria (SAN), had said the Nigerian constitution allows Buhari to extend his tenure in order to tackle the country’s security challenges.\nWe wish to categorically restate that the president will step down on May 29th, 2023, after serving two terms – as per the constitution,” he said.\n“However, Chief Clarke is right to say that without security, Nigeria would not likely realise its true potential as a peaceful and prosperous nation.\nTill the last day of the administration, the security of the citizens shall remain the administration’s paramount concern."
  },
  {
    "headline": "Buhari will hand over in 2023, says presidency on call for tenure extension",
    "summarized_story": "Garba Shehu, presidential spokesman, says President Muhammadu Buhari will hand over to his successor at the end of his tenure in 2023.\nOn Monday, Robert Clarke, senior advocate of Nigeria (SAN), had said the Nigerian constitution allows Buhari to extend his tenure in order to tackle the country’s security challenges.\nWe wish to categorically restate that the president will step down on May 29th, 2023, after serving two terms – as per the constitution,” he said.\n“However, Chief Clarke is right to say that without security, Nigeria would not likely realise its true potential as a peaceful and prosperous nation.\nTill the last day of the administration, the security of the citizens shall remain the administration’s paramount concern."
  },
  {
    "headline": "Ahmed Yerima: Christians in Zamfara benefited from Sharia law when I was governor",
    "summarized_story": "Ahmed Yerima, former governor of Zamfara, says Christians in the state benefited from Sharia law when he was in power.\nThe former Zamfara governor had, in October 1999, introduced Sharia law in the state, after which several other states in the north followed suit.\nWhen asked during the programme if he thinks the north is better with Sharia law, the former governor said “yes, during my time”.\nAdvertisement“During my time, if you check records, president Obasanjo declared in his government, that Zamfara state is a crime-free state.\nAsk the Christians in Zamfara, they’ll tell you that at that time, they were better off."
  },
  {
    "headline": "Ahmed Yerima: Christians in Zamfara benefited from Sharia law when I was governor",
    "summarized_story": "Ahmed Yerima, former governor of Zamfara, says Christians in the state benefited from Sharia law when he was in power.\nThe former Zamfara governor had, in October 1999, introduced Sharia law in the state, after which several other states in the north followed suit.\nWhen asked during the programme if he thinks the north is better with Sharia law, the former governor said “yes, during my time”.\nAdvertisement“During my time, if you check records, president Obasanjo declared in his government, that Zamfara state is a crime-free state.\nAsk the Christians in Zamfara, they’ll tell you that at that time, they were better off."
  },
  {
    "headline": "Umahi: If Jonathan joins APC, it'd be one of the wonders of this century",
    "summarized_story": "Dave Umahi, governor of Ebonyi state, says if former President Goodluck Jonathan joins the All Progressives Congress (APC), it would be a development worthy of the Guinness Book of World Records.\nA coalition of northern groups had bought the presidential nomination form of the APC for the former president on Monday, urging him to join the race.\nIn a swift reaction, Jonathan had disowned the groups and distanced himself from the actions of the members.\nSpeaking on Tuesday at the state house, Abuja, Umahi said the form was purchased to embarrass Jonathan.\nCommenting on the Jonathan situation, Umahi said it would be difficult for the ruling party to campaign with the former president as its candidate."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "CAR becomes first African country to legalise crypto",
    "summarized_story": "The Central African Republic (CAR) has just become the first African country to adopt bitcoin as a legal tender.\nAfter El Salvador, CAR is just the second country in the world to legalise it.\nKenya, Nigeria, Togo, South Africa, Ghana, and Tanzania are also featured in its Top 20 Global Crypto Adoption Index.\nIn fact, at 11%, CAR has the fifth-lowest internet penetration rate in Africa, and this brings into question the feasibility of crypto adoption in the country.\nNot sure how BEAC (central bank for 6 central African countries that use XAF currency tied to Euro) will react."
  },
  {
    "headline": "Adaverse and EMURGO encourage founders to build solutions on the Cardano blockchain",
    "summarized_story": "EMURGO is the official commercial arm governing investment operations of the Cardano blockchain, which is regarded as one of the top platforms for building tech solutions in the blockchain space.\nShogo Ishida and Yosuke Yoshida (co-CEOs of EMURGO Africa and the Middle East) were the representatives of EMURGO present at the hangout.\nDiscussing the good, he said that the absence of regulation in the blockchain space gives people the opportunities to experiment.\nThe goal of the collaborations is to increase the Cardano blockchain usage and encourage founders to build solutions that will be hosted on the blockchain.\nFounders and developers are encouraged to build their solutions on the Cardano blockchain."
  },
  {
    "headline": "How Saze Ibraheem found satisfaction in marketing",
    "summarized_story": "Share this article:“I’m fortunate to really enjoy what I do for work, and want to have more of an impact on the people I work with.” — Saze Ibraheem, Head of Marketing, ART X Collective.\nSaze Ibraheem, who moderated the panel session with three other Twitter executives, was consulting for Techpoint Africa.\nChatting with Saze Ibraheem at her home in LagosI can say that the event has played a part in shaping the Nigerian narrative.\nWhere it all startedSaze Ibraheem, Head of Marketing, ART X Collective“I’m so bullish on Lagos; it really has my heart.\nUp the ladder and still goingSaze Ibraheem, Head of Marketing, ART X CollectiveSaze usually prefers to help businesses turbo-charge their ideas, but she hasn’t always been a fan of entrepreneurship."
  },
  {
    "headline": "Meta hasn’t come to play",
    "summarized_story": "And that’s one reason we have the Techpoint Africa Podcast.\nMeanwhile, Meta CEO, Mark Zuckerberg, stated that similar functionality would be added to Facebook soon and possibly to other Meta apps in the future.\nPerhaps unsurprisingly, Facebook says it will continue to collect users’ location data for other experiences to personalise and improve its products and recommend ads to you.\nTechpoint Africa will host entrepreneurs and startup enthusiasts at Techpoint Pitch Friday on Friday, May 13, 2022, by 5 p.m at 43b Emina Crescent, Opebi, Allen, Ikeja.\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "IvoryPay to Launch Crypto Payment Gateway for Online Businesses in Emerging Markets",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Trade, commerce, and the entire system of value exchange are no longer confined to the geographical boundaries of one country.\nWith IvoryPay, businesses in emerging markets will be able to reduce the cost of transacting, increase transaction processing and payment confirmation speed, and accept payments in stable currencies.\nThe IvoryPay ecosystem comprises three components which include the Ivorypay payment gateway solution, the NFT Storefront, and the IVRY token.\nThe payment gateway infrastructure helps online businesses easily accept payment in stablecoins and the IVRY token, offering customers the option to make payments using the most convenient means.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "ARM Labs partners Techstars to support, deepen fintech development in Nigeria",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo kickstart the programme, the firm recently launched ARM Labs Techstars Accelerator programme in Lagos.\nChief Executive Officer, ARM, Jumoke Ogundare, said: “Over the years, ARM has been on a mission to support African fintech startups that are solving key problems in innovative ways.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "2023: Goodluck Jonathan won’t contest, says spokesman",
    "summarized_story": "Goodluck Jonathan, a former president of Nigeria will not seek reelection on the All Progressives Congress (APC) platform in the 2023 elections, his spokesman has said.\nJonathan rejected the N100 million worth All Progressives Congress (APC) presidential nomination forms bought for him by a group known as Association Fulani/Almajir.\nThe Fulani/Almajiri stormed the Abuja International Conference Centre, venue for the sale of APC nomination forms Monday night and obtained the documents for the former president to run for the exalted office again.\nThe statement read: “It has come to our notice that a group has purportedly purchased Presidential Nomination and Expression of Interest forms, of the All Progressives Congress APC, in the name of former President Goodluck Ebele Jonathan.\n“Buying a presidential aspiration form in the name Jonathan without his consent, knowing the position he had held in this country, is considered an insult to his person."
  },
  {
    "headline": "Nigeria’s top banker Emefiele in eye of the storm",
    "summarized_story": "BusinessDay gathered that the CBN governor had been a card-carrying member of APC since February 2021.\nIt says the governor shall be in charge of the day-to-day management of the bank and shall be answerable to the board of directors for his acts and decisions.\nThe PDP said Emefiele’s involvement in “partisan politics while still holding office as CBN governor underpins the impunity, lawlessness and recklessness of the Muhammadu Buhari-led APC administration”.\nHe said: “I think first is to look at what the CBN Act says.\nThe CBN Act already constraint him not to be in that platform and still running for election."
  },
  {
    "headline": "FG’s growing appetite for debt ignores fiscal alarm bells",
    "summarized_story": "Rising global interest rates has made it more expensive for frontier and emerging markets to borrow money from the international market, yet Nigeria’s debt appetite remains high as government expenses pile.\nThis year, Abuja increased its spending plans to make room for a nine-fold increase of a controversial petrol subsidy.\nThat will be the second time this year that the government is tapping a volatile Eurobond market that many sovereigns have steered clear off for fear of high pricing.\n“It was unexpected,” Tatonga Rusike, the London-based sub-Saharan Africa economist at Bank of America Corp, said of Nigeria’s Eurobond sale.\nThe World Bank estimates Nigeria’s subsidy bill will top N4 trillion ($9.6 billion) this year."
  },
  {
    "headline": "Obaseki’s energy reforms: Edo residents count gains, as Ossiomo Power battles BEDC for market share – Nigerian Observer",
    "summarized_story": "Checks in the Benin metropolis have revealed that the two major power distribution companies in the state, Benin Electricity Power Distribution Company (BEDC) and Ossiomo Power Company are in a fierce battle for the customers with the competition assuring better power options to residents.\nMr. Sylvester Omorogbe, who resides in the Ugbor axis of Benin City, said a lot of people are now opting for power supply from Ossiomo Power because of its reliability and ease of payment.\nAccording to him, “We have just connected to Ossiomo Power.\n“In fact, if you go around, you will discover that a lot of the new houses in the area are connected to the power company.\nThey also use it as a marketing tool to even increase the rent for their houses because the people are assured of stable power."
  },
  {
    "headline": "Obaseki: How we created 300,000 jobs in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government has created over 300, 000 direct and indirect jobs in the state in partnership with the private sector.\nObaseki, who spoke to journalists in Benin City, said through pragmatic reforms and interventions that have revived the state’s economic landscape and attracted more investors into Edo, the government has been able to engage more youths, create jobs and reduce unemployment.\nAccording to him, “apart from interventions by the state’s skills development agency, EdoJobs in the information technology, manufacturing, construction and the creative industry, we have embarked on people-centric programmes that have transformed the job landscape in Edo and positively impacted the livelihoods of the people.”He listed some of the interventions to include the Power Purchase Agreement (PPA) with Ossiomo Power Company to provide stable power to drive the state’s industrial sector; the establishment of the 6000bpd Edo Refinery and Petrochemical Company Limited, and the extensive agricultural development programmes such as the Edo State Oil Palm Programme (ESOPP), which have opened up the space for large scale commercial farming in the state, impacting the lives of thousands of farmers, among other initiatives.\nObaseki added, “We have also upskilled our youths and placed them on a pedestal to actively participate in the fourth industrial revolution through capacity building and skills development initiatives, chief among which is the Edo Tech Park programme developed in partnership with a leading technology company, Decagon, through which we are training not less than 15,000 software engineers in the state in the next five years.\n“The Edo Innovation Hub, Edo Production Centre, the Victor Uwaifo Creative Hub and Sound Stage are other expressions of how we have meaningfully engaged our youths, leading to the creation of over 300,000 jobs in the state.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Senate Amends Electoral Act, 2022 to Allow Voting Right for President, others during Primaries – Nigerian Observer",
    "summarized_story": "Senate Amends Electoral Act, 2022 to Allow Voting Right for President, others during PrimariesShare FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Nigerian Senate, on Tuesday, amended Section 84 (4) of the Electoral Act, 2022 to allow voting right for the president and others Executives during party primaries.\nThe said amendment will allow ‘statutory delegates’, which are all elected to participate and vote in the conventions, congresses or meetings of political parties.\nThe bill was sponsored by the Deputy Senate President, Ovie Omo-Agege (Delta Central).\n“This is an unintended error, and we can only correct it with this amendment now before us”, the Deputy Senate President said.\n“So, this is an emergency effort to ensure that nobody is denied his or her rightful opportunity as a delegate, especially the statutory delegates, and these are those who are elected."
  },
  {
    "headline": "Over 250 participants for 4th Templars, Patrelli Cricket Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOver 250 participants are expected to feature in the fourth edition of the Templars and Patrelli Secondary School Cricket Competition in Benin.\nTemplars and Patrelli are both law firms located in Lagos, but will individually organize the male and female categories of the event respectively.\nThe Templars tournament will see 11 secondary schools participate in the male event while Patrelli competition, which is focused on promoting and providing equal participation and opportunities for girls in sport, will have eight schools featuring.\nOthers are Odion Isesele, David Abiebhode, Asia Joshua, Selim Salau, Reigneth Osagie among others —who are part of the Edo State Under17 squad.\nThis program is a key aspect of the Templars and Patrelli corporate sustainability and responsibility strategy which focuses on youth empowerment through sports as well as support the youth development initiative of the Edo state government."
  },
  {
    "headline": "I’ve supported 6000 people with N3.2bn, produced 500 millionaires in Kebbi – Malami",
    "summarized_story": "Nigeria’s attorney general and minister of justice, Abubakar Malami, says he supported 6000 people with N3.2 billion in Kebbi State during Covid-19 lock downs.\nThe attorney general also said he made over 500 people millionaires in the state.\nMr Malami stated this at his Birnin Kebbi, GRA residence while hosting a supporters group on a solidarity visit last week.\nMalami announced his intention to run for the governorship position of the state in 2023 under the All Progressives Congress (APC).\nMr Aleiro is supporting the senate majority leader, Hahaya Abdullahi, who also declared his intention to contest the governorship election."
  },
  {
    "headline": "Senate amends electoral act to allow government officials vote at party primaries",
    "summarized_story": "The Nigerian senate has amended the Electoral Act, 2022, to allow statutory delegates to participate and vote in the conventions, congresses or of political parties.\nThe senate on Tuesday made the amendment according to a release from the Office of the Senate President, Ahmad Lawan, who is also also a presidential aspirant of the All Progressives Congress (APC).\n13 was sponsored by the Deputy Senate President, Ovie Omo-Agege (Delta Central).”Omo-Agege, in his presentation, said the bill seeks to amend the provision of section 84(8) of the Electoral Act.\nThis is an unintended error, and we can only correct it with this amendment now before us”, the Deputy Senate President said.\n“So, this is an emergency effort to ensure that nobody is denied his or her rightful opportunity as a delegate, especially the statutory delegates, and these are those who are elected."
  },
  {
    "headline": "Osun 2022: APC is party to beat – Oriolowo",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe senator representing Osun West Senatorial District, Senator Adelere Oriolowo, has declared that the All Progressives Congress (APC) remains the only party to beat in the forthcoming Osun State governorship election.\nSenator Oriolowo made this declaration in a press statement issued on his behalf by his Media Team and made available to newsmen in Osogbo the Osun State capital.\nThe Iwo born politician said APC remains the party to beat and that there is nobody that the opposition parties will put forward that the APC will not defeat, either in the gubernatorial election which is around the corner or future elections.\nSenator Oriolowo who has just obtained his nomination and interest form to run for the second term in the Senate for Osun West Senatorial District under the same platform of the All Progressives Congress, APC said his bid to return to the Senate is to consolidate on his achievements.\nOriolowo who is a seasoned Engineer, declared that he deserves a second term in office, adding that he has fulfilled most of his promises to the constituents."
  },
  {
    "headline": "2023: Uzodinma asks APC, PDP to zone presidential ticket to Southeast",
    "summarized_story": "Governor of Imo State, Senator Hope Uzodinma, has asked both the All Progressives Congress (APC) and the People’s Democratic Party (PDP) to zone their presidential tickets to the Southeast in the interest of equity and justice.\nHe said the Southeast is in a similar state now and many Nigerians know.\nWhat is utmost in the mind of every political party is to win election.\n“The 1999 situation is repeating itself and many Nigerians are in support of the presidency going to the South-East.\nSpeaking on the alleged disunity among five governors of the Southeast, Uzodimma said: “The situation in the South-East is not different from other zones."
  },
  {
    "headline": "Police Arraign 4 Chrisland School Teachers Over Concealment Of Sex Tape",
    "summarized_story": "The Police, on Tuesday, arraigned four teachers of Chrisland Schools before a Lagos State Magistrate’s Court sitting in Yaba for allegedly concealing a sex tape made by some students of the school.\nThe teachers, three male and a female, who accompanied the students to the World School Games in Dubai, United Arab Emirates, however, pleaded not guilty to the charge.\nShe insisted that the offence contravened the provisions of Sections 411 and 97 (1) (3) of the Criminal Laws of Lagos State, 2015 (Revised).\nThe court directed that the sureties must submit copies of their National Identification Number (NIN), and their Lagos State Residents Registration Agency (LASRRA) cards.\nAdebayo further directed that the case file should be duplicated and sent to the Lagos State Directorate of Public Prosecution (DPP) for legal advice."
  },
  {
    "headline": "House Of Reps To Amend Electoral Act, Summons Emergency Plenary",
    "summarized_story": "The House of Representatives has, for the third time within two weeks, summoned another emergency plenary.\nThe agenda of the emergency sitting, which will be held on Wednesday, May 11, 2022, is to amend a fundamental error in the newly passed Electoral Act, 2022.\nA terse statement by the clerk of the House, Dr. Yahaya Danzaria, on Tuesday, said: “This is to inform all Hon Members, staff, media and the general public that the House hereby reconvenes for an emergency plenary session against tomorrow, Wednesday, 11th May, 2022 at 11:00am.\n“This session has become necessary especially as to amend a fundamental error in the Electoral Act.\nThe House regrets this short notice and implores all Members to be present.”"
  },
  {
    "headline": "Strike: Senate To Intervene In Federal Govt, ASUU Impasse",
    "summarized_story": "The NANS President, Sunday Asefon, who spoke for his other colleagues, lamented their continued stay at home and disruption of their academic programme, urging the Senate President to intervene in the dispute between the Federal government and the University teachers.\nResponding, the Senate President expressed unhappiness about the turn of events, recalling that the Senate had intervened in the past before everything broke down again.\n“Your prayer that you want the Federal government and ASUU back to negotiate and resolve the issues.\n“It is an opportunity for me also to appeal to ASUU to suspend this strike period because there is no way ASUU can negotiate with the Federal government when it is on strike.\nThe Senate President said the 2009 agreement which is the crux of the matter was not properly thought out before it was signed."
  },
  {
    "headline": "Strike: Senate To Intervene In Federal Govt, ASUU Impasse",
    "summarized_story": "The NANS President, Sunday Asefon, who spoke for his other colleagues, lamented their continued stay at home and disruption of their academic programme, urging the Senate President to intervene in the dispute between the Federal government and the University teachers.\nResponding, the Senate President expressed unhappiness about the turn of events, recalling that the Senate had intervened in the past before everything broke down again.\n“Your prayer that you want the Federal government and ASUU back to negotiate and resolve the issues.\n“It is an opportunity for me also to appeal to ASUU to suspend this strike period because there is no way ASUU can negotiate with the Federal government when it is on strike.\nThe Senate President said the 2009 agreement which is the crux of the matter was not properly thought out before it was signed."
  },
  {
    "headline": "Kogi Reps Seat: Group Purchases APC Nomination Forms For Ozomata",
    "summarized_story": "A vote for Dr. Sanni Abdullahi Ozomata is a vote for quality representation.\n“You all would have noticed that Dr. Sanni Abdullahi Ozomata is not present here and is not involved in the purchase of this form.\n“We also take this moment to appreciate the executive governor of Kogi State, His Excellency, Alh Yahaya Adoza Bello on his developmental and transformative strides in Kogi State.\n“”The League of Young Professionals is in support of the Presidential ambition of his Excellency as the 2023 general elections draw closer.\n“We, The League of Young Professionals is a body set up to help, support, and change the lives of young people by providing personal and professional development opportunities."
  },
  {
    "headline": "Insha Allah I will be president, I'll banish hunger",
    "summarized_story": "By Hajara LemanAPC presidential aspirant Bola Tinubu has assured the people of Gombe State that he will curb hunger and ensure shared prosperity in the country if elected President of Nigeria in 2023.\nTinubu said this in Gombe on Tuesday when he paid homage to the Emir of Gombe, Alhaji Abubakar Shehu-Abubakar III.\nHe stated that he would work together with successful governors and all stakeholders to make things better for the country.\n“If elected as the President of Nigeria and Insha Allah I will be, I will work with the successful governors to make things better.\nEarlier in his welcome speech, Gov Inuwa Yahaya said the prominent leader came to seek the delegates’ support preparatory to the party’s primaries."
  },
  {
    "headline": "#EndSARS: Oyetola to pay compensation to victims of police brutality",
    "summarized_story": "Gboyega Oyeola of Osun will pay compensation to victims of police brutality as recommended by the State’s #EndSARS panel on May 12, accordinThis is contained in a statement by the Chief Press Secretary to the governor, Mr Ismail Omipidan, in Tuesday in Osogbo.\nOmipidan said that the compensation was in line with the recommendations of the #EndSARS Panel, set up by the governor, following a presidential directive.\nOyetola-led administration had resolved to rid the state of all forms of injustice and the oppression of the weak.\nIt will be recalled that Oyetola set up a Judicial Panel of Inquiry against Police Brutality, Human Rights Violations and Related Extra Judicial Killings.\nAlso, the governor, in his message to Osun youths during the one-year anniversary of #EndSARS, promised to pay the compensation as recommended by the Panel, even after submitting the report to the Presidency as directed."
  },
  {
    "headline": "BREAKING: Nigerian Court Nullifies Sale, Disposal Of Recovered Assets By Attorney-General, Malami’s Committee",
    "summarized_story": "The Attorney-General of the Federation (AGF) Abubakar Malami (SAN) has had all sales and disposals of assets made under the Asset Tracing, Recovery and Management Regulations, 2019 annulled by the Federal High Court in Lagos.\nThe Asset Tracing, Recovery and Management Regulations, 2019 were also declared unconstitutional by the court as “an invalid statutory instrument.”The Asset Tracing, Recovery and Management Regulations, 2019, were found to be “ultra vires the office and powers” of the AGF, according to the court.\nThe Inter-Ministerial Committee on the Disposition of Assets Forfeited to the Nigerian Government was inaugurated by the AGF on November 9, 2020.\n“Consequently, the administrative powers to be exercised by the Honourable Attorney-General of the Federation must flow from the enabling statutes.\nSome officials in the Federal Ministry of Justice had been reportedly selling off forfeited and retrieved assets owned by the Nigerian Government."
  },
  {
    "headline": "JUST IN: Adamu Garba withdraws from presidential contest after collecting N83 million from Nigerians",
    "summarized_story": "Adamu Garba has withdrawn from the presidential race scheduled for next year after raising N83 million from Nigerians.\nMr Garba told Peoples Gazette that even though he had withdrawn from the exercise, it won’t be the end of his quest to govern Nigeria someday.\nMr Garba said the N100 million for nomination forms of the ruling All Progressives Congress is exploitative and may not encourage good governance.\nThe development comes after the politician raised over N83 million in donations from Nigerians.\nDetails shortly…"
  },
  {
    "headline": "Addax Petroleum Confirms 1 Dead In Bomb Explosion At Its Izombe Flowstation",
    "summarized_story": "Addax Petroleum Development Nigeria Ltd. says a suspected vandal died in Wednesday’s explosion at its flowstation in Izombe, Imo.\nAddax said it was collaborating with regulatory agencies and security agencies in ongoing investigations into the incident.\n“At about 01:15am on May 4, 2022, an explosion occurred along a trackroad leading to one of the well heads at Izombe Flow station in OML 124.\n“An immediate search was conducted, and unexploded Improvised Explosive Devices (IEDs) and a corpse were found at the scene.\n“Government Security and Regulatory Agencies were promptly notified of the incident."
  },
  {
    "headline": "BREAKING: Oyo’s only PDP senator Kola Balogun joins APC",
    "summarized_story": "The lawmaker representing Oyo South Senatorial District at the Senate, Senator Kola Balogun, has defected to the All Progressives Congress.\nBalogun, who is the Olubadan of Ibadan, Oba Lekan Balogun’s younger brother, was the only senator elected to the Upper Legislative on the platform of the Peoples Democratic Party in Oyo State in 2019.\nThe senator resigned from the PDP after Governor Seyi Makinde allegedly handed over the PDP ticker for Oyo South Senatorial District to Joseph Tegbe, who defected to the PDP from the APC.\nSenator Balogun is already at the APC Secretariat in Ibadan with Senator Teslim Folarin, who is set to declare his governorship ambition at the same ceremonyMeanwhile, the Palace of Olubadan has distanced itself from the action of the monarch’s son, Femi, who was said to have visited Tegbe and declared support for his political aspiration.\nThe statement read, “The purported visitation of Femi Balogun, son of Olubadan of Ibadanland, Oba (Sen.) Lekan Balogun, to his schoolmate and a politician in the state, Mr. Olasunkanmi Tegbe, is a private and personal affair of Femi and has no blessings of the Olubadan palace."
  },
  {
    "headline": "NASS amends Electoral Act, okays LG chairs, vice, councillors as statutory delegates",
    "summarized_story": "Ahead of primary elections to be held by the various political parties this month for emergence of candidates for the 2023 general elections, the recently passed 2022 Electoral Act has been amended by the Senate for accommodation of statutory delegates in the process.\nOmo-Agege specifically in the bill titled: “A bill for an Act to Amend the 2022 Electoral Act no 13 and for other related matters”, said section 84(8) of the Electoral Act 2022 does not provide for the participation of what is generally known as Statutory delegates in the conventions, Congresses or meetings of political parties held to nominate candidates for general elections.\nThe Senate, accordingly, gave the bill expeditious consideration and passage by in a session, read it for second and third readings.\n“It is good that clause 84 (8) of the electoral Act 2022 has been amended in the Senate today and will be followed by the House of Representatives tomorrow for required concurrence and transmission to Presidency for assent.\n“This is very important to enable every statutory delegate to participate in the coming primary elections,” he said."
  },
  {
    "headline": "June 3 deadline on primaries: INEC turns down 37-day extension request by political parties",
    "summarized_story": "The Independent National Electoral Commission (INEC) Tuesday rejected appeals by political parties to review its timelines and schedule of activities, specifically, to shift deadline for party primaries to July 9 instead of the commission’s date of June 3.\n“Any review to extend the timeline for one activity will affect other activities and put unnecessary pressure on political parties and the Commission.\nSimilarly, the Commission has prepared a calendar of party primaries for presidential, governorship, national and state assembly seats based on the proposals submitted by political parties as at Friday 6th May 2022.\n“To assure citizens that you are not paying lip service to this commitment, political parties should encourage greater involvement of all under-represented segments of the society as candidates for elections.\n“The developments inevitably therefore, greatly disrupted planned activities and programmes of the political parties, leading to the loss of about two weeks out of the allotted time of the timetable."
  },
  {
    "headline": "Breaking: Super Eagles coach invites 8 home-based players, 22 others ahead Mexico, Ecuador friendly clash",
    "summarized_story": "Super Eagles’ first assistant Coach, Salisu Yusuf has released a list of 30 players, including Captain Ahmed Musa and forward Moses Simon, ahead of the prestigious international friendly matches against the ‘A’ Men National Teams of Mexico and Ecuador in the United States of America.\nThe three –time African champions will clash with CONCACAF powerhouse Mexico at the AT & T Stadium in Dallas, State of Texas on Saturday, 28th May, before flying to New Jersey to tackle Ecuador at the Red Bull Arena in Harrison on Thursday, 2nd June.\nYusuf, who is also Head Coach of the CHAN and the U23 teams, has included eight home–based professional players, including goalkeepers Adewale Adeyinka and Ojo Olorunleke, defender Ibrahim Buhari, and forwards Victor Mbaoma and Ishaq Rafiu.\nOnly 25 players will make the final list for the tour, which is preparatory to next month’s 2023 Africa Cup of Nations qualifying matches against Sierra Leone in Abuja (9th June) and São Tomé & Príncipe in Marrakech, Morocco (13th June).\nGoalkeepers: Maduka Okoye (Sparta Rotterdam, The Netherlands); Adewale Adeyinka (Akwa United); Ojo Olorunleke (Enyimba FC)Defenders: Olaoluwa Aina (Torino FC, Italy); Abdullahi Shehu (AC Omonia, Cyprus); Zaidu Sanusi (FC Porto, Portugal); William Ekong (Watford FC, England); Leon Balogun (Glasgow Rangers, Scotland); Isa Ali (Remo Stars); Chidozie Awaziem (Alanyaspor FC, Turkey); Oluwasemilogo Ajayi (West Bromwich Albion, England); Calvin Bassey (Glasgow Rangers, Scotland); Ibrahim Buhari (Plateau United)Midfielders: Joseph Ayodele-Aribo (Glasgow Rangers, Scotland); Alex Iwobi (Everton FC, England); Oghenekaro Etebo (Watford FC, England); Chiamaka Madu (Rivers United); Babatunde Afeez Nosiru (Kwara United); Azubuike Okechukwu (Yeni Malatyaspor, Turkey); Samson Tijani (Red Bull Salzburg, Austria); Alhassan Yusuf (Royal Antwerp FC, Belgium)Forwards: Ahmed Musa (Fatih Karagumruk, Turkey); Moses Simon (FC Nantes, France); Samuel Chukwueze (Villarreal FC, Spain); Ademola Lookman (Leicester City, England); Sadiq Umar (UD Almeria, Spain); Emmanuel Dennis (Watford FC, England); Cyriel Dessers (Feyenoord FC, The Netherlands); Victor Mbaoma (Enyimba FC); Ishaq Rafiu (Rivers United)Share this: TwitterFacebook"
  },
  {
    "headline": "Adegbite extols gemstone, Jewellery grandaunts",
    "summarized_story": "Adegbite gave this commendation on Friday, during the graduation ceremony of the first batch of the gemstone and jewelry making trainees of the Abuja Chambers of Commerce and Industry.\nWhile addressing the graduands, the minister charged them to impart the knowledge they have acquired to others in their communities.\nAdegbite further assured them as he disclosed that the second phase of the training was in progress.\nHe commended the doggedness of the 21 participants of the first batch of the training for staying through to the end.\nThe Project Coordinator disclosed that there are plans for advanced training for the 21 successful master training graduands, this, he said would be communicated to them in due course."
  },
  {
    "headline": "NHP Taraba named ‘Muhammadu Buhari’ Housing Estate",
    "summarized_story": "…,To promote decent housing access for the people of Taraba State.\n– Taraba State GovernorBy Chioma NnodimMinister of State for Works and Housing Mr.Mu’azu Jaji Sambo, Executive Governor of Taraba State Darius Dickson, Ishaku, top government officials and local residents in Jauro –Yinu Taraba State converged at the commissioning and handover ceremony of National Housing Programme in Jalingo Taraba State, as Sambo named the National Housing Programme in Jalingo, Taraba Stste Muhammadu Buhari Housing Estate weekend.\nIt is on this note and for his contribution to National Development through the National Housing Programme that I, Mu’azu Jaji Sambo Hon.\nMinister of State, Works and Housing name the National Housing Project site in Jalingo , Taraba State as “ Muhammadu Buhari Housing Estate , Jalingo,” Sambo said.\nThe use of available local building materials in the National Housing Programme has stimulated the economy through the production and use of local materials ."
  },
  {
    "headline": "Customs seize poisonous bags of rice imported from India",
    "summarized_story": "According to acting Controller Ejibunu, “Pursuant to the Federal Government’s policy that encourages local production of rice against the importation of foreign parboiled rice, this Unit had seized 7,259 (of 50 kg each) bags of rice, which is an equivalent of over twelve (12) trucks load.\n“Consequent upon this laboratory analysis on the foreign parboiled rice; as a responsible government agency, we are letting Nigerians know that apart from the negative economic impact of importing foreign rice into the country, some of these imported rice are unhealthy for human consumption.\nThus, we advise consumers to desist from patronizing the federal government banned foreign parboiled rice.\n“We as citizens have a collective responsibility to safeguard our economy and health for the benefit of all.\n“A total of twelve suspects were arrested in connection with some of the seizures; for committing various Customs offences."
  },
  {
    "headline": "33% Pension increase: PHCN retirees excluded by wages commission – PTAD",
    "summarized_story": "“This is because PHCN pensioners were already on a special salary structure before the Pension review for Pensioners who while in service were on one of the Harmonized Salary Structures of the Federal Public Service.\n“It should be noted that PHCN pensioners took the Federal Government to the National Industrial Court (NIC) Abuja on this issue.\nAfter several engagements, President Muhammadu Buhari, approved the implementation of 9.7% increase in the pensions of Ex-PHCN Retirees under the Defined Benefit Scheme (DBS).\nIt is therefore preposterous and uncalled for that this group wants to conveniently forget the amicable agreement reached by all parties and arm-twist the Federal Government to make claims on the 33% pension increment,” PTAD said in a statement it issued on Friday.\nThe pensioners reportedly alleged that PTAD colluded with some “powerful individuals” to deprive them of the 33% pension increment as approved by the federal government in 2010."
  },
  {
    "headline": "PBR Cowpea has revolutionalised Nigeria’s food production – NABDA DG",
    "summarized_story": "By Eunice OrikeAs Nigeria prepares for the 2022 planting season, director-general of the National Biotechnology Development Agency NABDA, Prof. Abdullahi Mustapha, has commended the Pod Borer Resistant PBR, Cowpea for revolutionalising Nigeria’s food production.\nMustapha who spoke during a press conference on the commercialisation of the new variety of cowpea, said that the food crop is revolutionalising Nigeria’s food production with its tremendous yield, quick harvest, non-shattering and good cooking characteristics.\nAnd that if the 3 million hectares, PBR Cowpea is planted on 1million hectares, the savings on the cost of insecticide is N16,200 billion annually.\n“The feat attained with the development and commercialisation of the PBR Cowpea has, again, proven that if determined, Africa has what it takes to solve its challenges.\nSpeaking on the safety of the improved PBR Cowpea, the director-general, National Biosafety Management Agency (NBMA), Dr. Rufus Ebegba, assured Nigerians the crop is safe for both human consumption and the environment."
  },
  {
    "headline": "Senate To Intervene In ASUU Strike, Faults 2009 Agreement",
    "summarized_story": "Senate President Ahmad Lawan on Tuesday said the upper chamber will wade into the ongoing strike action of the Academic Staff Union of Universities.\nSpeaking with officials of the National Association of Nigerian Students (NANS), Lawan faulted the 2009 agreement between the Federal Government and ASUU.\nNANS has threatened to shut down all federal roads in protest against the strike.\nASUU on Monday said it was extending its strike for another three months.\nThe academics have proposed an alternative payroll system, the University Transparency and Accountability Solution (UTAS)."
  },
  {
    "headline": "Wonder Of The World If Jonathan Joins APC, Says Umahi",
    "summarized_story": "Ebonyi State Governor Dave Umahi on Tuesday described the possibility of former President Goodluck Jonathan joining the All Progressives Congress as another wonder of the world.\nA Northern Coalition on Monday had the purchases the APC’s nomination and expression of interest forms for former President Goodluck Jonathan.\nREAD ALSO: I Did Not Beg To Pay N100m APC Nomination Form Fee, Says Tunde BakareBut Jonathan later rejected the forms, saying he did not authorise the purchase.\nUmahi on Tuesday wondered how the APC would align its policies and promises if Jonathan, a member of the Peoples Democratic Party, clinches the ruling party’s presidential ticket.\nHe added that it would be a material for the World Guinness Book of Records if such an event materialises."
  },
  {
    "headline": "No Extension Of Timeline For Party Primaries – INEC",
    "summarized_story": "The Independent National Electoral Commission on Tuesday said it has no intention of extending the timeline for party primaries.\nINEC Chairman, Prof. Mahmood Yakubu made the comment while speaking at a consultative meeting with leaders of political parties in Abuja.\nPolitical parties in the country had asked INEC to extend the timelines for the 2023 general elections by two months.\nREAD ALSO: Political Parties Have One Month To Conduct Primaries, Says INECSpecifically, the parties want slight changes to the primaries’ timeline, as stipulated by the electoral umpire.\n“Twice in the last two weeks, the Commission had cause to remind political parties of the necessity for strict compliance with the timelines for party primaries,” the INEC Chairman said."
  },
  {
    "headline": "Senate Amends Electoral Act To Allow President, Govs, Lawmakers, Others Vote At Party Congresses, Primaries",
    "summarized_story": "The Senate on Tuesday amended the Electoral Act, 2022, to allow ‘statutory delegates’ – all those elected – to participate and vote in the conventions, congresses, or meetings of political parties.\nIn his presentation, the Deputy Senate President, Ovie Omo-Agege, who sponsored the ‘Bill to amend the 2022 Electoral Act No.\n“This is an unintended error, and we can only correct it with this amendment now before us”, the Deputy Senate President said.\nIn his remarks after the bill was passed, the Senate President, Ahmad Lawan, said the amendment became imperative in view of the deficiency created by the provision of section 84(8) of the extant Act.\n“These are the President, Vice President, members of the National Assembly, governors, members of the State Houses of Assembly, chairmen of councils and their councillors, national working committee members of all the political parties, and so on."
  },
  {
    "headline": "Conference Of Speakers To Pursue Debt Forgiveness For Africa – Gbajabiamila",
    "summarized_story": "Conference of Speakers and Heads of African Parliaments (CoSAP)on Tuesday agreed to pursue debt forgiveness for the continent from creditor-nations.\nSpeaker of the House of Representatives, Femi Gbajabiamila, disclosed this in Abuja while briefing reporters on the sidelines of a two-day conference which held in the nation’s capital.\n“We talked about debt cancellation and debt forgiveness.\nWe felt parliament should be involved and speak as one voice and speak to our creditors and make a case as to why we needed debt forgiveness,” he said.\nSome argued that in countries that secured debt reliefs, the parliaments must interrogate how the money returned to them was spent."
  },
  {
    "headline": "Oyo slams Senator Folarin over false claims during declaration -",
    "summarized_story": "Adisa said: “We have read with amusement words credited to an Oyo APC governorship aspirant, Senator Teslim Folarin, that he is coming to rescue Oyo State and that none of the aspirants in the ill-fated APC, Oyo State chapter is as bad as Governor Makinde.\n“Indeed, we must commend Folarin for letting the Oyo State public know that governorship aspirants in APC are bad products.\nHowever, there is no basis to compare any of the APC governorship aspirants with Governor Makinde.\n“Senator Folarin was also credited to have said that all tangible projects in the state were done by the previous government.\nThis is an outright lie and we are sure that the people of Oyo State do not need such a lie."
  },
  {
    "headline": "Election timetable, timeline will not be reviewed, INEC declares -",
    "summarized_story": "Leaders of Political Parties are currently meeting with the leadership of the Independent National Electoral Commission in Abuja.\nIt is the commission’s regular quarterly Consultative meeting with political parties to review activities ahead of the election and give updates where necessary.\nIn his opening remark, Chairman of the Independent National Electoral Commission, Professor Mahmood Yakubu, disclosed that timetable and timeline of elections will not be reviewed.\nThe INEC chairman also added that political parties should conduct primaries in a transparent manner.\nThe IPAC Chairman said the alteration in the dates will not in anyway affect the timetable of the 2023 general elections"
  },
  {
    "headline": "Again, Police fail to produce Farah Dogogo in court",
    "summarized_story": "The Rivers Stste Police Command on Monday failed to produce detained Rivers State PDP Governorship aspirant, Farah Dogogo in court for second consecutive day.\nThe member of the House of Representatives faces criminal charges for allegedly hiring thugs to disrupt the screening of party’s State and National Assembly aspirants in Port Harcourt.\nThe aspirant has been in detention since the 28th of April 2022."
  },
  {
    "headline": "Delegates recieve Atiku in Ondo, Former VP promises Change -",
    "summarized_story": "The former vice President said it is sad that students have been at home for more than three months.\nHe won the last delegates election to emerge as the Presidential Candidate of the Peoples Democratic Party in 2019.\nAlhaji Atiku Abubakar was Vice President to President Olusegun Obasanjo between 1999-2007 under the Peoples Democratic Party under the administration of Former President Olusegun Obasanjo.\nHe was originally elected Governor of Adamawa State before his nomination as Vice Presidential Candidate by Chief Olusegun Obasanjo in 1999.\nAlhaji Atiku was the Leader of the reputed Strongest Political Group of the over 34 that formed the Peoples Democratic Party, the Peoples Democratic Movement."
  },
  {
    "headline": "WHO Says China’s Zero-Covid Strategy Unsustainable",
    "summarized_story": "Speaking after Tedros, WHO emergencies director Mike Ryan said the impact of a “zero-COVID” policy on human rights also needs to be taken into consideration.\nStill, China’s zero-COVID policy has drawn criticism ranging from scientists to its own citizens, leading to a cycle of lockdowns of many millions of people, anguish and anger.\nMost other nations that shared its approach initially have now at least begun a transition to strategies to live with the virus.\nShanghai’s measures have been particularly strict, with residents allowed out of compounds only for exceptional reasons, such as a medical emergency.\nIts quarantine policy has also been criticised for separating children from parents and putting asymptomatic cases among those with symptoms."
  },
  {
    "headline": "Super Eagles Coach Yusuf Invites Musa, Simon, 28 Others for Mexico, Ecuador Friendlies",
    "summarized_story": "Super Eagles’ First Assistant Coach, Salisu Yusuf has released a list of 30 players, including captain Ahmed Musa and forward Moses Simon, ahead of the prestigious international friendly matches against the ‘A’ Men National Teams of Mexico and Ecuador in the United States of America.\nThe three –time African champions will clash with CONCACAF powerhouse Mexico at the AT & T Stadium in Dallas, State of Texas on Saturday, 28th May, before flying to New Jersey to tackle Ecuador at the Red Bull Arena in Harrison on Thursday, 2nd June.\nYusuf, who is also Head Coach of the CHAN and the U23 teams, has included eight home–based professional players, including goalkeepers Adewale Adeyinka and Ojo Olorunleke, defender Ibrahim Buhari, and forwards Victor Mbaoma and Ishaq Rafiu.\nOnly 25 players will make the final list for the tour, which is preparatory to next month’s 2023 Africa Cup of Nations qualifying matches against Sierra Leone in Abuja (9th June) and São Tomé & Príncipe in Marrakech, Morocco (13th June).\nGoalkeepers: Maduka Okoye (Sparta Rotterdam, The Netherlands); Adewale Adeyinka (Akwa United); Ojo Olorunleke (Enyimba FC)Defenders: Olaoluwa Aina (Torino FC, Italy); Abdullahi Shehu (AC Omonia, Cyprus); Zaidu Sanusi (FC Porto, Portugal); William Ekong (Watford FC, England); Leon Balogun (Glasgow Rangers, Scotland); Isa Ali (Remo Stars); Chidozie Awaziem (Alanyaspor FC, Turkey); Oluwasemilogo Ajayi (West Bromwich Albion, England); Calvin Bassey (Glasgow Rangers, Scotland); Ibrahim Buhari (Plateau United)Midfielders: Joseph Ayodele-Aribo (Glasgow Rangers, Scotland); Alex Iwobi (Everton FC, England); Oghenekaro Etebo (Watford FC, England); Chiamaka Madu (Rivers United); Babatunde Afeez Nosiru (Kwara United); Azubuike Okechukwu (Yeni Malatyaspor, Turkey); Samson Tijani (Red Bull Salzburg, Austria); Alhassan Yusuf (Royal Antwerp FC, Belgium)Forwards: Ahmed Musa (Fatih Karagumruk, Turkey); Moses Simon (FC Nantes, France); Samuel Chukwueze (Villarreal FC, Spain); Ademola Lookman (Leicester City, England); Sadiq Umar (UD Almeria, Spain); Emmanuel Dennis (Watford FC, England); Cyriel Dessers (Feyenoord FC, The Netherlands); Victor Mbaoma (Enyimba FC); Ishaq Rafiu (Rivers United)"
  },
  {
    "headline": "Musk Says He Would Reverse Twitter Ban on Donald Trump",
    "summarized_story": "Billionaire Elon Musk said Tuesday he would reverse Twitter’s ban on former U.S. President Donald Trump when he buys the social media platform, the clearest signal of Musk’s intention to cut moderation of the site.\nMusk, the world’s richest person and chief executive of Tesla Inc, has inked a $44 billion deal to buy Twitter.\nThe question of reinstating Trump has been seen as a litmus test of how far Musk will go in making changes.\nWe shouldn’t have social media companies that are restricting people’s ability to get their message out,” added Scott.\nThe platform is owned by Trump Media & Technology Group, which is led by Devin Nunes, a former Republican congressman."
  },
  {
    "headline": "Segun Oni: The People Of Ekiti Have Gone Through Several Governors, But They Still Want Me",
    "summarized_story": "Segun Oni, Ekiti State Governorship Aspirant for the Social Democratic Party, speaks to ARISE News on #TheMorningShow, about his political ambitions at state level.\nHe also shares his thoughts on the current state of political affairs, at the national level; commenting on the presidential race specifically."
  },
  {
    "headline": "Jonathan’s Presidential Bid -Trending With Ojy Okpe",
    "summarized_story": ""
  }
]