[
  {
    "headline": "Why parents should worry about children bedwetting again after six months –Paediatrician",
    "summarized_story": "Alege said although stress is a common cause of bedwetting in children, physical, emotional and sexual abuse or even neglect could make children who have attained bladder control suddenly start bedwetting.\nSpeaking in an interview with PUNCH HealthWise, the paediatrician said parents need to support their children’s bedwetting by all means.\nHe told our correspondent that after attaining bladder control, bedwetting in children has a lot to do with emotional imbalance.\n“A very important thing for parents to know is that bedwetting is neither the fault of the child nor that of the parents.\nThe paediatrician said, “Some affected children may have developed psychological complications during the period of bedwetting."
  },
  {
    "headline": "Why parents should worry about children bedwetting again after six months –Paediatrician",
    "summarized_story": "Alege said although stress is a common cause of bedwetting in children, physical, emotional and sexual abuse or even neglect could make children who have attained bladder control suddenly start bedwetting.\nSpeaking in an interview with PUNCH HealthWise, the paediatrician said parents need to support their children’s bedwetting by all means.\nHe told our correspondent that after attaining bladder control, bedwetting in children has a lot to do with emotional imbalance.\n“A very important thing for parents to know is that bedwetting is neither the fault of the child nor that of the parents.\nThe paediatrician said, “Some affected children may have developed psychological complications during the period of bedwetting."
  },
  {
    "headline": "Nine states, FCT report 65 new COVID-19 cases",
    "summarized_story": "Amarachi OkehNine states and the Federal Capital Territory reported 65 new cases of COVID-19 on Friday, according to figures released on Saturday by the Nigeria Centre for Disease Control.\nThe agency did not report any additional COVID-19 related death.\nKaduna recorded the highest number of new infections with 20, followed by Gombe – 10, FCT – 9, Rivers – 9, Bauchi – 6, Lagos – 3, Delta, Edo, Kano and Oyo recorded two cases in each state.\nThe health agency said the 65 new COVID-19 infections have brought the number of confirmed COVID-19 cases in the country to 212,511.\nWith no additional COVID-19 related death reported, the death toll from the virus remains 2,902, the NCDC said."
  },
  {
    "headline": "Nine states, FCT report 65 new COVID-19 cases",
    "summarized_story": "Amarachi OkehNine states and the Federal Capital Territory reported 65 new cases of COVID-19 on Friday, according to figures released on Saturday by the Nigeria Centre for Disease Control.\nThe agency did not report any additional COVID-19 related death.\nKaduna recorded the highest number of new infections with 20, followed by Gombe – 10, FCT – 9, Rivers – 9, Bauchi – 6, Lagos – 3, Delta, Edo, Kano and Oyo recorded two cases in each state.\nThe health agency said the 65 new COVID-19 infections have brought the number of confirmed COVID-19 cases in the country to 212,511.\nWith no additional COVID-19 related death reported, the death toll from the virus remains 2,902, the NCDC said."
  },
  {
    "headline": "Anambra: Soludo laments glitch in technology, lack of security presence, few INEC officials",
    "summarized_story": "The governorship candidate candidate of All Progressive Grand Alliance, APGA, Charles Soludo, has said he has been unbale to vote due to technological challenges.\nHe also raised concerns over the little or no presence of security agents, and not enough INEC officials to man some voting points.\nSoludo, the former Governor of the Central Bank of Nigeria, CBN, however, expressed optimism, saying he is preaching patience and waiting for the INEC equipment to start working.\nHe noted that a technical person had arrived to fix the issue with INEC equipment.\nGenerally, there is widespread reports of INEC officials arriving late to polling units and subsequent slow pace of activities."
  },
  {
    "headline": "Xavi Hernández named new FC Barcelona coach",
    "summarized_story": "FC Barcelona has reached an agreement with Xavi Hernández for him to become a first-team coach for the rest of the current season and two more seasons.\nXavi Hernández, a youth team product at Barça, has left his current club, Al-Sadd of Qatar, after talks held over the last few days with the owners of the club.\nIt is expected that Xavi Hernández will arrive in Barcelona this weekend and that on Monday 8 November his presentation as new FC Barcelona first-team coach will take place in an event open to the public at Camp Nou.\nAfter the event, Xavi Hernández will appear in a press conference in the Ricard Maxenchs press room.\nShortly we will detail the agenda for the presentation of Xavi Hernández as the new coach of the first team."
  },
  {
    "headline": "[VIDEO] American Blogger, Sabbatical, shares his experience at the Lagos Airport",
    "summarized_story": "[VIDEO] American Blogger, Sabbatical, shares his experience at the Lagos Airport"
  },
  {
    "headline": "Ignore security threats, invest in your country, Dabiri-Erewa begs Nigerians abroad",
    "summarized_story": "By Luminous Jannamike, ABUJAThe Chairman of Nigerians in Diaspora Commission, NIDCOM, Hon.\nAbike Dabiri-Erewa, on Tuesday, asked Nigerians residing abroad to ignore the pockets of security threats in the country and double their investments at home.\nDabiri-Erewa, who made the appeal while briefing journalists on the preparation for the 4th Nigeria Diaspora Investment Summit billed to hold from November 16 – 17 in Abuja, stated that targeting Nigerians abroad for inward investment was the best strategy to help the country achieve economic growth and transformation.\nBut Dabiri-Erewa argued that unduly harping on Nigeria’s security problems would further demarket the country before potential investors, and l prove counter-productive to the Federal Government’s quest to increase Diaspora Direct Investment.\nThe NIDCOM CEO disclosed that the theme of this year’s Nigeria Diaspora Investment Summit would be ‘Diaspora Partnership and Linkages for Post-COVID Economic Growth’, and added that it would also attract over 5000 participants and 800 core investors across the globe."
  },
  {
    "headline": "Anambra Guber: Our prosperity depends on choice of next governor, Ezenwa tells Ndi-Anambra",
    "summarized_story": "By Luminous JannamikeTHE Chief Executive Officer of GSS Group, Arc.\nHe said, “Today, being November 6, 2021, will herald another era in the lives of Ndi Anambra.\n“We set up the GSS Real Estate, GSS Construction, GSS Security, GSS Production and BigBen Fashion with our Headquarters in Awka Anambra State, to fight unemployment in the state.\n“Consequently, we deserve the best for the prosperity of Ndi Anambra as the Government Policies and Agenda would play a huge role in the dream of solving the four basic needs of Ndi Anambra by GSS Group.\n“I implore Ndi Anambra to come out en masse and vote for the right candidate into power."
  },
  {
    "headline": "Anambra Decides: Voting technology has failed – Soludo laments at polling unit",
    "summarized_story": "The Anambra governorship candidate of the All Progressives Grand Alliance, APGA ,Prof. Charles Soludo has lamented the failure of card readers at the polling units.\nSoludo at his polling unit said he was yet to cast his votes as they were having technical difficulties with the card reader.\nThere are also many polling units without INEC officials.\nBy 12:30 voting is yet to start at my polling unit and we haven’t started voting.\n“The second thing is inadequacy of INEC staff to be punctual at the polling units."
  },
  {
    "headline": "Anambra Decides: INEC reveals when Nigerians will see election results on portal",
    "summarized_story": "The Independent Electoral Commission, INEC, has informed Nigerians, especially those paying keen interest on the Anambra governorship election on when to visit its Election Results Viewing Portal for results.\nThe Commission explained that the portal is basically for the viewing of results and is not expected to display other forms of information.\nINEC assured that the election results would be uploaded from the 5,634 polling units to its result-viewing portal.\nIt said the result-viewing portal would only be active from 3:30 to 4 pm when polling units must have counted their results.\nSpeaking to DAILY POST on how the portal functions and when Nigerians should expect results to start entering the portal, INEC’s Spokesman, Rotimi Oyekanmi, said: “It is Result Viewing Portal which means that it is platform where election results are displayed by INEC."
  },
  {
    "headline": "Ozigbo expresses worry over poor internet, asks INEC to extend voting time",
    "summarized_story": "The Peoples Democratic Party (PDP) candidate, Mr. Valentine Ozigbo has expressed worry over the poor internet connectivity experienced by voters in the use of the Bi-modal Voter Accreditation System (BVAS) machine.\nMr. Ozigbo decried that it took him over 20 minutes to casts his vote and wondered what other voters would experience in various parts of the state.\nOzigbo had cast his vote at Social Centre, Unit 010, Amesi, Aguata Local Government Area, where he spoke to journalists.\nHe seized the opportunity to call for an extension of voting period, especially as voting is said to be ending at 2:30pm.\nHe further decried late arrival of materials at Awka South, Orumba North, other parts, and urged INEC officials to ensure materials get to those areas to avoid disenfranchising voters."
  },
  {
    "headline": "Plateau Assembly crisis, huge embarrassment to Nigeria – Saraki",
    "summarized_story": "Immediate past Senate President, Dr. Abubakar Bukola Saraki, has described the crisis that has kept Plateau State House of Assembly under lock as an embarrassment to Nigeria, after practicing democracy for 21 uninterrupted years.\n“The Plateau crisis should be viewed in a larger context.\nNeither is it about the two claimants to the office of Speaker of the State House of Assembly or their supporters in the legislature.\nIt is even bigger than Plateau State or any individual.\nIt is also not difficult to determine whether 16 members of the Plateau State House of Assembly want Hon."
  },
  {
    "headline": "VC warns students against cultism, immoral conducts",
    "summarized_story": "Students of the Federal University, Dutse, FUD, have been warmed to shun away any act of immoral conducts and criminal activities.\nHe explained that the university received applications from over 20,153 candidates in 2020, out of which, only 4290 students were admitted.\nThe Vice Chancellor congratulate the new students for being lucky despite the competitiveness nature of the admission.\nHe, however, advised the students to face their studies and stay away from examination malpractices, drugs abuse, cultism, indecent dressing and other social vices.\nThe VC noted that the university shall deal decisively with anyone found violating the rules and regulations governing the institution."
  },
  {
    "headline": "Northern governors greet Emir of Argungu on 25th anniversary",
    "summarized_story": "The Northern Governors Forum has congratulated the Emir of Argungu, His Royal Highness Alhaji Samaila Muhammad Mera on his 25th anniversary on the throne.\nChairman of the forum and Governor of Plateau State, Simon Lalong, in a statement, said the royal father has shown tremendous passion for the development of his people, especially in the areas of education, health and economic prosperity.\nHe commended him for working with the state government in reviving the Argungu Fishing Festival, which he said has brought back the historic culture of the Emirate."
  },
  {
    "headline": "BREAKING: Protests in Nnewi over alleged unavailability of result sheet",
    "summarized_story": "BREAKING: Protests in Nnewi over alleged unavailability of result sheetVoters are protesting the alleged unavailability of original result sheets in Polling Unit 002, Enem Hall, Otolo Ward 2 in Nnewi North Local Government Area.\nAccording to them, the original result sheets were not brought by electoral officials.\nA Peoples Democratic Party (PDP) member, Chima Christian, told our correspondent: “We have refused the commencement of accreditation/voting because the INEC officials did not come with original result sheet.\n“Until we sight the election result sheet, voting will not commence.\n“Those preparing to write election results in their hotel rooms will meet their waterloo today,” he said"
  },
  {
    "headline": "Abuja fire incident: Police confirm five dead, 10 injured",
    "summarized_story": "The Federal Capital Territory (FCT) Police Command has launched an investigation into the fire incident that occurred at the Kubwa Village Market of the FCT on Friday evening.\nA statement on Saturday by the FCT Police Public Relations Officer, Josephine Adah, reads: “Unfortunately, the remains of five persons already burnt beyond recognition were evacuated from the scene by the rescue team and taken to the hospital where they were confirmed dead.\n“Ten others who were seriously injured were immediately taken to the hospital and are currently receiving medical attention.\n“The CP commiserated with the families of the victims.\nHe noted that the inferno is under control and commended the people who were at the scene at the time for supporting in the rescue operation and general control of the fire,” the statement adds."
  },
  {
    "headline": "Paris Club refund: Court bars Buhari, AGF from deducting $418m from states",
    "summarized_story": "Justice Inyang Ekwo issued the order after listening to Jibrin Okutepa (SAN) and Ahmed Raji (SAN) who argued the states’ ex-parte application.\nDeductions lawful, Federal Government insistsReacting, the Federal Government faulted the claim by the 36 state governments that the planned deduction of $418million was unlawful.\n“Two of these judgments were consent judgments based on terms of settlement entered into by NGF in 2017 & 2019.\nAgain, two of the four judgments were based on an earlier judgment delivered by the Federal High Court in 2013.\nIn furtherance of the consent and settlement the NGF itself made payments in billions to the consultants based on the same judgment it is deriding now."
  },
  {
    "headline": "Breaking: Anambra deputy governor, Okeke, votes in Enugwu-Ukwu, says process transparent",
    "summarized_story": "From Obinna Odogwu, AwkaDeputy Governor of Anambra State, Dr Nkem Okeke, at exactly 10:04am cast his vote in the ongoing governorship election in the state.\nHe voted at polling unit 005, Ward 3, Umueze Awovu in Enugwu-Ukwu community in Njikoka Local Government Area.\nThe deputy governor, while fielding questions from newsmen shortly after casting his vote, said that he was impressed with the process so far.\nMore details coming"
  },
  {
    "headline": "Jubilations as Lawan, Kalu bag chieftaincy titles in Argungu",
    "summarized_story": "There were jubilations in the ancient town of Argungu in Kebbi State on Friday when the Emir, Alhaji Samaila Mera and the Argungu Emirate Council, honoured the Senate President, Ahmad Lawan and the Chief Whip, Orji Uzor Kalu, with chieftaincy titles.\nLawan was honoured with the title of Ganuwan Kabi (Defender of Kabi Kingdom) while Kalu received therevered traditional title of Kibiyan Kabi (Commander of the Archers).\nThe occasion was part of the activities to commemorate the 25th anniversary of the coronation of the Emir.\nLawan and Kalu who arrived Kebbi with their entourage were duly received by the state Governor, Abubakar Atiku Bagudu and the enthusiastic and good people of Kebbi State .\nKalu was also presented a bow and arrow which signified the meaning of the title."
  },
  {
    "headline": "Why grazing routes won’t work in Nigeria -Akeredolu",
    "summarized_story": "From Bamigbola Gbolagunte, AkureOndo State governor, Mr. Rotimi Akeredolu, has declared that grazing routes would not work in Nigeria because the country can no longer continue to live in the past.\nThe governor said many states in the country have signed the anti-open grazing laws to protect the people and their means of livelihood.\nAkeredolu declared that the Western Nigeria Security Network Agency, codenamed Amotekun Corps was effectively filling the vacuum created by the overstretched conventional security agencies, particularly the police in the state.\nGovernor Akeredolu noted that Amotekun Corps was a product of circumstance, essentially created to fill the obvious security gap in the state for the security of all.\nThe governor stressed that Amotekun’s efforts with the help of other security agencies have brought relative peace to the state."
  },
  {
    "headline": "Don’t let Igboho die, Yoruba elders warn FG, Benin govt",
    "summarized_story": "They include the pan Yoruba socio-cultural and political organisation, Afenifere, as well as the Yoruba Council of Elders (YCE) and Ilana Omo Oodua (IOO).\nThey appealed to the government of Benin Republic to allow him access to medical help in any place of his choice.\nWe plead with the government of Benin Republic to grant him the opportunity to get medical help there.\n“We have confidence that Benin Republic that normally follows the rule of law, will ensure that justice is done,” he said.\nIf anybody tells you it is the government of Benin Republic that is holding Igboho, it is a lie."
  },
  {
    "headline": "Baba Ijesha facing another defilement allegation, police officer tells court",
    "summarized_story": "Wahab Kareem, Assistant Superintendent of Police, on Friday told an Ikeja Special Offences Court that Nollywood actor, Olanrewaju James alias “Baba Ijesha” was facing another allegation of child defilement.\nKareem, attached to the State Criminal Investigation Department (SCID), Yaba, Lagos, testified as the fifth prosecution witness in James’s trial for defilement of a minor.\nThe landlord showed us an apartment and said: “This is where Baba Ijesha used to stay.\nHe added that James was not taken to Ikorodu to counter the other claim of defilement due to security reasons.\nActress and comedienne Adekoya, alias Princess, the foster mother of the alleged victim, was present in court."
  },
  {
    "headline": "Live Updates: Anambra Governorship Election",
    "summarized_story": "She said that she had tried to get INEC officials to rectify the situation, but they are not responding.\nMeanwhile, at Oko in Orumba LGA and Ekwulobia in Aguata South LGA, there was low voter turnout as the streets were practically deserted.\nThe polling center houses polling units 023, 024, 025 and 028The NUJ centre houses 029 unit, yet no polling officials.\n10:10 AMVoters Awaiting INEC Officials in NriSegun JamesThere is tension in Nri Boys High School, Nri in Anaocha Local Government Area as no INEC officials nor materials has arrived as the people wait.\nTHISDAY gathered that police officers for the Anambra election submitted their bank details and their IPPIS for their payment, and it was being handled by the Federal Government and not the police."
  },
  {
    "headline": "Anambra Votes Amid Fear, Tension; Soludo, Ozigbo, Uba are Frontrunners",
    "summarized_story": "For most of yesterday, tension remained very high, with streets deserted, but the police and other security agencies have assured Anambra State voters of maximum security and want them to come out without fear.\nThough, there is no written agreement on the rotation of governorship in Anambra State on Senatorial basis, this has in many previous elections determined the emergence of a governor.\nIn the Southern zone, Uba is also very popular, but will be splitting his votes in the zone with Soludo and Ozigbo.\nThough, there is no written agreement on the rotation of governorship in Anambra State on Senatorial basis, this has in many previous elections determined the emergence of a governor.\nIn the Southern zone, Uba is also very popular, but will be splitting his votes in the zone with Soludo and Ozigbo."
  },
  {
    "headline": "Osinbajo: I’m Not Owner of Collapsed Ikoyi Building’s Land",
    "summarized_story": "Reports surfaced online linking the Vice-President to the collapsed building’s land, and there were also claims that the said land was sold to Osinbajo by Chief Michael Ade-Ojo, Founder of Elizade Motors.\nOsinbajo debunked the reports, and said further that he never intervened with the regulatory authorities in Lagos State to unseal the Ikoyi property at any point.\nThe Vice President said he had briefed his lawyers to sue the online medium that linked him to the said property.\n“Also, the attention of the Vice President has been drawn to an obviously sponsored falsehood regarding the recently collapsed building.\n“He has, indeed, never acted to influence any other regulatory action on the collapsed building, or any other building for that matter, in Lagos State."
  },
  {
    "headline": "CBN Grants MTN, Airtel Approval in Principle to Operate Payment Service Bank",
    "summarized_story": "Emma OkonjiThe Central Bank of Nigeria (CBN) has granted approval in principle to MTN and Airtel to operate a payment service bank (PSB) across the country, aimed at further driving financial inclusion in Nigeria.\nThe approval in principle for both telecoms operators is coming two years after CBN granted the same category of licence to 9mobile, Globacom and another operator.\nCBN had since communicated the approval in principle licence to both MTN and Airtel.\nAnnouncing the approval yesterday, MTN in a statement signed by the Company’s Secretary, Uto Ukpanah, said: “MTN Nigeria Communications Plc (MTN Nigeria) as promoter, received an Approval in Principle (AIP) dated November 4, 2021 from the Central Bank of Nigeria (CBN) for a licence application for the proposed MoMo Payment Service Bank Limited.\nIn addition, the PSB license is intended to promote rural financial inclusion and requires that 25 per cent of financial service touchpoints by the operator must be in rural areas."
  },
  {
    "headline": "MTN, Airtel Get CBN’s Approval in Principle to Operate Payment Service Banks",
    "summarized_story": "Emma OkonjiThe Central Bank of Nigeria (CBN) has granted approval in principle to MTN and Airtel to operate payment service bank (PSB) across the country, aimed at further driving financial inclusion in Nigeria.\nCBN had since communicated the approval to both telecoms operators.\nAnnouncing the approval, MTN in a statement Friday, signed by the Company’s Secretary, Uto Ukpanah, said: “MTN Nigeria Communicafions Plc (MTN Nigeria) as promoter, received an Approval in Principle (AIP) dated 4 November 2021 from the Central Bank of Nigeria (CBN) for a licence application for the proposed MoMo Payment Service Bank Limited.\nAirtel, which also announced the approval CBN granted it to operate PSB, through a statement signed by the Group Company Secretary, Simon O’Hara, said: “Airtel Africa, with presence in 14 countries across Africa, announces that its subsidiary SmartCash Payment Services Bank Limited has been granted approval in principle to operate a payment service bank business in Nigeria.\nFinal approval is subject to the Group satisfying certain standard conditions within six months.”Commenting on the approval, the CEO, Airtel Africa, Segun Ogunsanya, said: “I am very pleased that Smartcash has been granted an approval in principle to operate a service bank business in Nigeria."
  },
  {
    "headline": "LIVEBLOG: Anambra Governorship Election Update",
    "summarized_story": "You may also like"
  },
  {
    "headline": "LIVEBLOG: Anambra Governorship Election Update",
    "summarized_story": "You may also like"
  },
  {
    "headline": "BREAKING: Fire Guts Kubwa Village Market Abuja, Many Feared Dead",
    "summarized_story": "The popular Kubwa Village Market in the Bwari Area Council, Abuja, is currently on fire, leading to the death of an unspecified number of persons.\nThe incident comes a few days after a 21-storey building collapsed on Gerrard Road, in the Ikoyi area of Lagos State.\nSaharaReporters had earlier published on Thursday that the figure of victims confirmed dead at the site of the crumbled building had risen to 36.\nThe 21-floor building that collapsed was one of 360 degrees towers in the highbrow Lagos area.\nEmergency workers have evacuated nine persons alive from the debris of the building while about 39 persons have been confirmed dead."
  },
  {
    "headline": "BREAKING: Fire Guts Kubwa Village Market Abuja, Many Feared Dead",
    "summarized_story": "The popular Kubwa Village Market in the Bwari Area Council, Abuja, is currently on fire, leading to the death of an unspecified number of persons.\nThe incident comes a few days after a 21-storey building collapsed on Gerrard Road, in the Ikoyi area of Lagos State.\nSaharaReporters had earlier published on Thursday that the figure of victims confirmed dead at the site of the crumbled building had risen to 36.\nThe 21-floor building that collapsed was one of 360 degrees towers in the highbrow Lagos area.\nEmergency workers have evacuated nine persons alive from the debris of the building while about 39 persons have been confirmed dead."
  },
  {
    "headline": "EXCLUSIVE: Wife, Brothers Of Late Owner Of Collapsed Ikoyi Building, Osibona Fight Over Bank Details, Exotic Cars, Other Assets, Engage Lawyer",
    "summarized_story": "The relations of Femi Osibona, owner of the 21-storey building that collapsed in the Ikoyi area of Lagos State, are currently in a messy fight over the personal property of the deceased, SaharaReporters has learnt.\nThe family allegedly denied the wife access to the deceased’s apartment because there were bundles of money, keys to expensive vehicles and others in the house.\nOne of the sources said, “The brothers and wife of Femi Osibona are fighting over access to bank details of the deceased and keys to expensive vehicles.\nOn Monday, the building located on Gerrard Road, Ikoyi, Lagos collapsed with a yet-to-be-ascertained number of persons still trapped beneath the rubble.\nAccording to Highbrow Living Magazine, the collapsed property, comprising four-bedroom maisonettes, flats, duplex and penthouses, was 65 per cent sold out."
  },
  {
    "headline": "Odili home invasion: Malami may lose SAN rank if found culpable, says NBA president",
    "summarized_story": "AdvertisementSecurity operatives on October 29 invaded the house of Odili, a justice of the supreme court, on the claim that “illegal activities” were going on there.\nThis is consistent with the position of the National Executive Council of the NBA, to the effect that the attorney-general definitely has questions to answer.\nThis is why the panel to be set up by the president is very necessary.\nSo, without mincing words, those are the steps that the NBA can take.”Akpata also added that action will be taken against Emmanuel Iyanna, the chief magistrate who issued the search warrant leading to the invasion of Odili’s home.\n“Questions must be asked of the quality and sufficiency of the materials placed before his worship before issuing the search warrant in the first place."
  },
  {
    "headline": "Odili home invasion: Malami may lose SAN rank if found culpable, says NBA president",
    "summarized_story": "AdvertisementSecurity operatives on October 29 invaded the house of Odili, a justice of the supreme court, on the claim that “illegal activities” were going on there.\nThis is consistent with the position of the National Executive Council of the NBA, to the effect that the attorney-general definitely has questions to answer.\nThis is why the panel to be set up by the president is very necessary.\nSo, without mincing words, those are the steps that the NBA can take.”Akpata also added that action will be taken against Emmanuel Iyanna, the chief magistrate who issued the search warrant leading to the invasion of Odili’s home.\n“Questions must be asked of the quality and sufficiency of the materials placed before his worship before issuing the search warrant in the first place."
  },
  {
    "headline": "Dele Momodu: Femi Osibona didn't cut corners, he planned to live in collapsed IKoyi building",
    "summarized_story": "Dele Momodu, journalist and former presidential candidate, says Femi Osibona, owner of Fourscore Homes and developer of the 21-storey building that collapsed in Lagos, did not cut corners.\n“I had known Femi for over 20 years in London as an extremely gifted marketer.\nHe told me how God had blessed him mightily and had made him veer into real estate in London.\nAdvertisement“Out of the failing of Femi Fourscore would arise a Nigerian Neil Armstrong who will make building on the sea seem like strolling to the next street.\n“It has been most painful reading how some people reduced Femi’s epic struggles and vision to fronting for the vice-president."
  },
  {
    "headline": "Dele Momodu: Femi Osibona didn't cut corners, he planned to live in collapsed IKoyi building",
    "summarized_story": "Dele Momodu, journalist and former presidential candidate, says Femi Osibona, owner of Fourscore Homes and developer of the 21-storey building that collapsed in Lagos, did not cut corners.\n“I had known Femi for over 20 years in London as an extremely gifted marketer.\nHe told me how God had blessed him mightily and had made him veer into real estate in London.\nAdvertisement“Out of the failing of Femi Fourscore would arise a Nigerian Neil Armstrong who will make building on the sea seem like strolling to the next street.\n“It has been most painful reading how some people reduced Femi’s epic struggles and vision to fronting for the vice-president."
  },
  {
    "headline": "#AnambraDecides: Ozigbo asks INEC to extend time of election over technical glitches",
    "summarized_story": "Valentine Ozigbo, candidate of the Peoples Democratic Party (PDP) in the Anambra governorship election, has appealed to the Independent National Electoral Commission (INEC) to extend the duration of the exercise owing to reported glitches with the Bimodal Voter Accreditation System (BVAS).\nAdvertisementThe malfunctioning of BVAS has been reported in some polling units across the state.\nReacting to this development at his polling unit, Ozigbo said INEC should ensure that the glitches are fixed so as to enable eligible voters to cast their vote.\n“That’s the only way we can truly ensure that this election is by the people; by the greater Nigerians.\nAdvertisement“I’m by this appealing to the chairman of INEC that you reach out to your team in the various 21 local governments."
  },
  {
    "headline": "MTN Group to sell $245m-worth shares of Nigerian subsidiary",
    "summarized_story": "South Africa-based MTN Group has announced plans to sell 575 million shares of its most profitable subsidiary MTN Nigeria, which went public in Lagos in 2019.\nThe offer is expected to close in December 2021.”The transaction will see MTN Group rake in proceeds of about ₦101 billion ($245 million), based on MTN Nigeria’s (MTNN) current share price of ₦175.60.\nA Bit of HistoryThe planned sell-off is part of a broader intention, announced by MTN Group earlier, to sell down 14% of its current shareholding in the Nigerian unit.\nLast year, the Johannesburg-based group was unable to repatriate its $280 million dividend from its Nigerian subsidiary due to the challenges of securing foreign currency, amid the country’s forex liquidity crisis.\nDespite the domestic challenges, MTN Nigeria has shown resilience."
  },
  {
    "headline": "A surge in African fintech's intra-continental expansion to target SMEs",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango/birdSupport for small businesses keen to trade across the continent’s single market is being eyed as a potentially lucrative market by more and more African fintech startups.\nSurge in intra-continental expansionIn the last month alone, a number of startups have either raised growth funds, acquired another player present in regional markets within the same vertical, or tapped top talent in the telecoms industry.\nTheir intention appears to be the targeting of small industries and traders seeking cross-border opportunities in new African markets.\nThe program comes barely a month after Tala raised 145 million dollars in equity, hinting that part of the growth funds would go toward supporting its geographical expansion.\nUntil recently, a lack of local knowledge and access to trade and market information has been linked to low trade volumes and value."
  },
  {
    "headline": "African founders lead Payhippo’s $3m seed investment",
    "summarized_story": "There’s a new exciting trend in the African tech ecosystem: African founders backing fellow founders especially in pre-seed and seed funding, which is an indication that the African tech ecosystem is maturing.\nCapital is a lifeline of businessThere are over 40 million small and medium businesses (SMEs) in Nigeria.\nBut only a few of these businesses have access to capital, mostly due to heavy collateral requirements and long time of loan processing.\nFounded by Zach Bijesse, CEO, Chioma Okotcha, COO, and Uche Nnadi, CTO, Payhippo provides small businesses with short-term working capital with average loan amounts of $1300.\n“Access to credit is a critical necessity for small businesses to manage their daily challenges."
  },
  {
    "headline": "Chipper Cash valued at $2 billion after investment from world’s most valuable crypto exchange",
    "summarized_story": "The investment was led by FTX, the most valuable crypto derivatives exchange company owned by the youngest billionaire in the world, Sam Bankman-Fried.\nWith a valuation of over $2 billion, Chipper Cash has now attained a unicorn status.\nChipper Cash is FTX’s first investment in Africa.\nChipper Cash boasts of having over 4 million users across the world.\nAs a result of this partnership, FTX will increase its footprint in Africa and Chipper Cash will be integrated into the FTX product so that African users can fund their crypto wallet through Chipper Cash."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "NFTs and music, Egypt’s money rain, Payhippo’s $3m seed, and Opibus’s $7.5m funding",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Music and blockchainFunding rounds in EgyptPayhippo’s $3m seedOpibus’s $7.5m fundingNFTs and musicThe NFT market keeps growing.\nSource: SuppliedNigerian fintech startup, Payhippo, has closed a $3 million seed funding round.\nThe company produces heavy-duty electric vehicles (EVs) such as buses and trucks by converting petrol and diesel-based vehicles into electric, reducing cost and, in a way recycling older vehicles.\nOpibus has been manufacturing EVs since 2017, intending to make electric vehicles affordable in Africa.\nHowever, we still have the likes of Jet Motor Company that announced a $9 million funding in 2020, Siltech, and Ampersand playing in the space."
  },
  {
    "headline": "Blockchain meets music: How music label owner promotes artistes and sells their music as NFTs",
    "summarized_story": "But music NFTs are gaining some wind too.\nThe song was minted on Rocki, an NFT music platform on Binance Smart Chain (BSC).\nNFTs are transforming the music businessHector believes NFTs are going to be a big part of the music business in a few years.\nWhy buy music NFTs?\nHe’s currently creating a crypto token and, at the same time, building a blockchain metaverse where crypto and NFTs reign supreme."
  },
  {
    "headline": "MallforAfrica shuts down, Affiong Williams’ ReelFruit, Chipper Cash’s extension round, Violence against journalists",
    "summarized_story": "For Affiong Williams, Founder and CEO of agritech startup, ReelFruit, starting a fruit processing business in Nigeria with no template to draw from was a bold move.\nThe extension round was led by crypto exchange platform, FTX with SVB Capital, Deciens Capital, Ribbit Capital, Bezos Expeditions, One Way Ventures, and Tribe Capital participating.\nCurrently serving seven African countries, Chipper Cash was founded in 2018 by Sam Serunjogi and Maijid Moujaled to facilitate cross border payment in Africa.\nThis is where Chipper Cash has found a sweet spot.\nSerunjogi reveals that Chipper Cash offers remittances at “considerably cheaper” prices than other competitors."
  },
  {
    "headline": "COVID-19 vaccines: Catholic priest urges church members not to doubt their veracity – Nigerian Observer",
    "summarized_story": "Sam Tumba, the Parish Priest of Holy Rosary Catholic Church, Wuse, Zone 11, has urged church members not to doubt the veracity of COVID-19 vaccines.\nTumba, however, encouraged the newly ordained priests to remain focused and humble.\nHe urged the ordained priests to be cautious and act Christ-like before the people of God.\nThe News Agency of Nigeria (NAN) reports that the five newly ordained priests are Rev.\nOne of the ordained priests, Rev."
  },
  {
    "headline": "EFCC denies staff taking picture with Obi Cubana – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Economic and Financial Crimes Commission (EFCC) has described as “fake news” the report making rounds that its staff posed for photograph with the popular socialite and businessman, Obinna Iyiegbu, popularly known as Obi Cubana.\nUwujaren said that at no time during investigation nor the period in which Obi Cubana was in the Commission’s custody or released did he pose for photograph with its members of staff.\n“Members of the public are strongly advised to ignore the fake news and misleading imputation which has been traced to the social media account of one Sabi Radio (sabiradio).\nAccording to him, one Uncle Deji, a popular security expert using his social media handle, also debunked the fake news.\nThis picture was taken 7th October 2021 during a book launch of Colonel Chukwu Obasi at Nigerian Army Resource Centre in Abuja in which Obi Cubana attended as a guest."
  },
  {
    "headline": "Anambra governorship election in a slow start – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAwka – Late arrival of election materials and INEC officials resulted in a slow start of Saturday’s governorship election in Anambra, the News Agency of Nigeria (NAN) reports.\nINEC officials were yet to arrive at many polling units as at 9 a.m.\nMr Duke Emeka, a voter told NAN that he had been waiting at the venue for a long time.\n“We have been here for the past three hours and there is no sign of INEC officials or voting materials.\nThe same scenario obtained in many other polling units in Awka when correspondents of NAN went around the state capital."
  },
  {
    "headline": "Deplorable Road: Uteh Palace Residents Appeal to Government – Nigerian Observer",
    "summarized_story": "speaking on behalf of the landlords and land ladies in area, Robert Owen Okhiendovbere who is also the odionwere of Uteh palace road appealed to the government to call on Niger Delta Development Commission (NDDC) to as a matter of urgent solution to come back to site and complete the road project.\nHe noted that the people in the street (Ute- palace road) and environs cannot access their houses anytime it rains as a result of the heavy flooding and big pot holes created as a result of the heavy duty vehicles that ply the road.\nPa Robert Owen further added that the road was constructed half way by NDDC and with substandard materials and it was also not done to specification from those concerned, then they have been suffering since 2014 when they abandoned the road project half way.\nAlso speaking Mrs Josephine Osayande a resident in the area and Mr Friday David and Osamudiamen Idehen who are Keke riders that ply the Ute- palace road said the road leads to about 12 villages down to the bypass adding that the deplorable condition of the road is really affecting their only means of livelihood that there is no day they do not visit the mechanic workshop to fix their Keke (tricycle).\nThey added that they have exhausted all the means to fix the road hence the protest to appeal to Edo State Government to come to their aid by calling on NDDC to come and complete the road project that was done half way."
  },
  {
    "headline": "#AnambraDecides2021: Malfunction of BVAS machines characterise voting process",
    "summarized_story": "Anambra East is one of the 21 local governments in Anambra where a governorship election is being held today.\nMr Obiano whose polling unit is at Eri Primary School, Unit 004, Otuocha 1, Aguleri, Anambra East LGA, exercised his franchise hitch-free.\nPREMIUM TIMES reported how Mr Obiano and his wife, Ebelechukwu, cast their ballot using the BVAS machine at about 9:28 a.m. on Saturday.\nHe complained about the malfunction of the BVAS machine.\n“The BVAS machine has been a major issue for us here,” he said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "First Bank Lagos Amateur Open Golf Championship Begins",
    "summarized_story": "First Bank of Nigeria Limited, has announced the commemoration of the 2021 and 60th edition of its annually sponsored Lagos Amateur Golf Championship.\nThe FirstBank Lagos Amateur Open Golf Championship is a World Amateur Golf Ranking (WAGR) listed competition that attracts the best golfers from the amateur scene, not only in Nigeria but across the continent and indeed the world.\nThe highlights of the press conference are the unveiling of the “Corporate Golf Challenge”, “CEO’s CUP”, ProAm and Ladies Invitational.\nSpeaking on the landmark event the Group Head, Marketing and Corporate Communications, Ms. Folake Ani-Mumuney said “at Firstbank, we are excited to celebrate the landmark diamond jubilee of the Lagos Amateur Open Golf Championship which is indeed the longest sponsored golf championship in the country and arguably, the continent.\nThe clinic will be facilitated each day, from Friday, 19th to Sunday 21st November 2021 at Ikoyi Club 1938 Golf Club Driving Range."
  },
  {
    "headline": "Death toll in Abuja market explosion rises to 7",
    "summarized_story": "At least, seven people have died from an explosion that occurred on Friday in Abuja market.\nThe explosion, from a kerosene tank kiosk opposite Kubwa Modern Market in Abuja, happened around 7pm Friday.\nThe explosion triggered flame that consumed many shops and injured several people.\nHe said one of them was referred to the Abuja national hospital, but died while on transit to the facility.\nAliyu Sabo, a fruit seller not too far from the scene of the accident, said told Daily Trust that he fled after the powerful sound."
  },
  {
    "headline": "#AnambraDecides: State govt says APC has written election results for 10 LGAs",
    "summarized_story": "Anambra State government has raised alarm what it said is a plan by the All Progressives Congress (APC) to declare written results of today’s governorship election in 10 local government areas.\nThe state commissioner of information and public enlightenment, Mr. C Don Adinuba who stated this on Friday, said the government has credible intelligence that the APC had already written results for 10 local governments ahead of the governorship election holding today, Saturday.\n“The Anambra State Government has credible intelligence showing that the All Progressives Congress (APC) has already written results of 10 Local Government Areas as regards the gubernatorial election which will take place tomorrow, November 6, 2021,” he said.\n“The results are those of Onitsha North, Onitsha South, Aguata, Orumba South, Orumba North, Idemili North, Idemili South, Ogbaru, Anambra East and Anambra West.\nThey should come out openly and apologise to the people for their failure in 16 years in Anambra, “the APC said."
  },
  {
    "headline": "Nigerian Army says 17,000 Boko Haram insurgents have surrendered",
    "summarized_story": "The Nigerian Army has said the number of Boko Haram insurgents who have surrendered to the federal government forces has now reached 17,000.\nAccording to him, the growing number of those surrendering had warranted the intervention of the NEDC in their maintenance.\nThe theatre commander said those that surrendered comprised combatants, non-combatants, those conscripted against their wish and family members.\nHe noted that the development was a source of concern for members of the Islamic State of West Africa Province (ISWAP), who had hoped to inherit Boko Haram fighters.\n“We know that if we have peace in the northeast it will transcend to other regions,” Mr Musa said."
  },
  {
    "headline": "NACCIMA To Set Up South-East Regional Headquarters In Imo",
    "summarized_story": "The Nigeria Association of Chambers of Commerce, Industry, Mines and Agriculture (NACCIMA) is to establish a South-East regional headquarters in Owerri, the capital of lmo State.\nThe NACCIMA boss stated this in his message at the investiture of the new president of the Owerri Chambers of Commerce, Industry, Mines and Agriculture (OCCIMA), Barrister Tony Amadi, in Owerri.\nWith an industrial layout and a conducive environment, Udeagbala expressed optimism that the South-East would be saturated with investors.\nTony Opara, in his inaugural speech commended his predecessors for their efforts to take the Association to greater heights through exemplary, dynamic and purposeful leadership.\nOpara appealed to Governor Hope Uzodinma to assign the State International Exhibition Centre – former FSP Park Mbari in Owerri to OCCIMA and designate same as ‘Imo International Trade Fair Centre’."
  },
  {
    "headline": "NACCIMA To Set Up South-East Regional Headquarters In Imo",
    "summarized_story": "The Nigeria Association of Chambers of Commerce, Industry, Mines and Agriculture (NACCIMA) is to establish a South-East regional headquarters in Owerri, the capital of lmo State.\nThe NACCIMA boss stated this in his message at the investiture of the new president of the Owerri Chambers of Commerce, Industry, Mines and Agriculture (OCCIMA), Barrister Tony Amadi, in Owerri.\nWith an industrial layout and a conducive environment, Udeagbala expressed optimism that the South-East would be saturated with investors.\nTony Opara, in his inaugural speech commended his predecessors for their efforts to take the Association to greater heights through exemplary, dynamic and purposeful leadership.\nOpara appealed to Governor Hope Uzodinma to assign the State International Exhibition Centre – former FSP Park Mbari in Owerri to OCCIMA and designate same as ‘Imo International Trade Fair Centre’."
  },
  {
    "headline": "Federal Govt Moves To Reposition Public Service",
    "summarized_story": "The Head of Service of the Federation, Dr. Folasade Yemi-Esan, has said the federal government is poised to re-engineer the public service to enable it render high quality service to the country.\nDr. Yemi-Esan further said the Federal Civil Service Strategy and Implementation Plan (FCSSIP) 2017-2020 derived from the Economic Recovery and Growth Plan (ERGP) of the Federal Government.\nHe urged the leadership of the Civil Service to embrace these principles so as to make success of their endeavours.\nIn his own speech, the Chairman of the House Committee on Public Service Matters, Engr.\nBut with bad civil servants even the best laws cannot help”He therefore urged civil servants to rededicate themselves to ensure the success of the FCSSIP."
  },
  {
    "headline": "Federal Govt Moves To Reposition Public Service",
    "summarized_story": "The Head of Service of the Federation, Dr. Folasade Yemi-Esan, has said the federal government is poised to re-engineer the public service to enable it render high quality service to the country.\nDr. Yemi-Esan further said the Federal Civil Service Strategy and Implementation Plan (FCSSIP) 2017-2020 derived from the Economic Recovery and Growth Plan (ERGP) of the Federal Government.\nHe urged the leadership of the Civil Service to embrace these principles so as to make success of their endeavours.\nIn his own speech, the Chairman of the House Committee on Public Service Matters, Engr.\nBut with bad civil servants even the best laws cannot help”He therefore urged civil servants to rededicate themselves to ensure the success of the FCSSIP."
  },
  {
    "headline": "Police Officer Stabs Colleague To Death",
    "summarized_story": "The commissioner of police in Bayelsa State, Mr Ben Okolo, yesterday in Yenagoa confirmed the stabbing to death of a police officer by his colleague.\nThis is contained in a statement issued by police spokesman in the state, Mr Asinmi Butswat.\nAn off-duty police officer, Sgt.\nGovernor Akpoboloukeme, stabbed his colleague, Sgt.\nThe two cousins left the venue with the belief that they were going to their separate homes."
  },
  {
    "headline": "Fraudster Who Impersonates Facebook Official Jailed six months in Ilorin",
    "summarized_story": "By JUMOKE SANNIThe Ilorin Zonal Command of the Economic and Financial Crimes Commission, EFCC, on Thursday, November 4, 2021 secured the conviction of one Shitu Labeeb Adebowale, accused of parading as Sheryl Sandberg, a Chief Operative Officer of one of the leading social media platform, Facebook, to swindle unsuspecting victims.\nJustice Adenike Akinpelu of the Kwara State High Court, Ilorin found the defendant guilty of the two count-charge preferred against him by the EFCC, and sentenced him to six months imprisonment.\nFollowing his plea, counsel to the EFCC, Innocent Mbachie, drew the attention of the court to plea bargain agreement entered by the defendant.\nJustice Akinpelu held that the prosecution had proved its case beyond reasonable doubt.\nConsequently, she pronounced the defendant guilty and sentenced him to a prison term of six months on each count, to run concurrently with option of fine of N150,000 (One Hundred and Fifty Thousand Naira Only) on each count."
  },
  {
    "headline": "Fraudster Who Impersonates Facebook Official Jailed six months in Ilorin",
    "summarized_story": "By JUMOKE SANNIThe Ilorin Zonal Command of the Economic and Financial Crimes Commission, EFCC, on Thursday, November 4, 2021 secured the conviction of one Shitu Labeeb Adebowale, accused of parading as Sheryl Sandberg, a Chief Operative Officer of one of the leading social media platform, Facebook, to swindle unsuspecting victims.\nJustice Adenike Akinpelu of the Kwara State High Court, Ilorin found the defendant guilty of the two count-charge preferred against him by the EFCC, and sentenced him to six months imprisonment.\nFollowing his plea, counsel to the EFCC, Innocent Mbachie, drew the attention of the court to plea bargain agreement entered by the defendant.\nJustice Akinpelu held that the prosecution had proved its case beyond reasonable doubt.\nConsequently, she pronounced the defendant guilty and sentenced him to a prison term of six months on each count, to run concurrently with option of fine of N150,000 (One Hundred and Fifty Thousand Naira Only) on each count."
  },
  {
    "headline": "US actor, George Clooney begs media: Don’t publish my children’s photos,",
    "summarized_story": "American actor George Clooney has called on the media not to publish pictures of his children, to avoid putting them in danger.\nThe “Oceans 11” star says that as a human rights lawyer, his wife Amal Clooney takes on evil-doers, making the couple’s children potential targets for retribution.\nNot paranoid jeopardy but real-world issues, with real-world consequences,” the “Gravity” actor wrote.\nClooney accused the newspaper of fabricating an article saying his future mother-in-law objected to his upcoming marriage in 2014.\nAFP has contacted the Daily Mail for a response to the letter."
  },
  {
    "headline": "US actor, George Clooney begs media: Don’t publish my children’s photos,",
    "summarized_story": "American actor George Clooney has called on the media not to publish pictures of his children, to avoid putting them in danger.\nThe “Oceans 11” star says that as a human rights lawyer, his wife Amal Clooney takes on evil-doers, making the couple’s children potential targets for retribution.\nNot paranoid jeopardy but real-world issues, with real-world consequences,” the “Gravity” actor wrote.\nClooney accused the newspaper of fabricating an article saying his future mother-in-law objected to his upcoming marriage in 2014.\nAFP has contacted the Daily Mail for a response to the letter."
  },
  {
    "headline": "Ikoyi Collapsed Building: VP Yemi Osinbajo To Sue Bloggers, Journalists, Social Media Users",
    "summarized_story": "Vice President, Yemi Osinbajo has commenced moves to sue media houses, publishers, journalists, bloggers, social media users, WhatsApp groups and others linking him to the Ikoyi building collapse.\nIn a statement on Saturday, a lawyer, Ebun-Olu Adegboruwa announced that the VP instructed him to issue a public notice on the matter.\nThe Senior Advocate of Nigeria (SAN) said publications which mentioned Osinbajo as the owner of the structure were sponsored by “faceless individuals and entities”.\nFor the records, our Client is not involved in, associated or connected with the ownership or development of the collapsed building, in any manner whatsoever.\n“We therefore implore you not to yield your noble platforms for the dissemination of any libelous publication of and concerning our Client, henceforth.”"
  },
  {
    "headline": "Bandits Have Confessed To Being Sponsored By Politicians — Governor Bello Matawalle",
    "summarized_story": "Some of those collaborating with bandits, according to Governor Bello Matawalle, have admitted to being backed by politicians.\nMatawalle made the remark in an interview with RadioNow in Lagos.\nThe Governor of Zamfara State, who did not reveal the names of the politicians exposed by those collaborating with bandits, also claimed that these politicians have been telling bandits not to believe in and enroll in his government’s amnesty and reconciliation program because they do not want him to succeed.\n“So they’ve been making so many unprecedented comments about the dialogue issues and the reconciliation.\nThey said some of the politicians are the ones funding them, telling them the state and federal government are not serious on what we promise to them.”"
  },
  {
    "headline": "[BREAKING] Ikoyi: I’m Not Owner Of 21-Storey Building – Osinbajo",
    "summarized_story": "Vice President, Yemi Osinbajo, SAN, has refuted claims that he owns the land upon which the collapsed building in Ikoyi stood.\nOsinbajo, who condoled with the families and relatives of all those who have died and those who were injured or affected in the collapsed building under construction on Gerrard Road, Ikoyi, described the incident as a horrible tragedy.\n”All property and assets owned by the Vice President have been publicly declared.\n”Also, the Vice President has never spoken to the Governor of Lagos State or any other official of the State Government regarding the unsealing of the said building on Gerrard Road, Ikoyi, which subsequently collapsed.\nHe has, indeed, never acted to influence any other regulatory action on the collapsed building, or any other building for that matter, in Lagos State.”Osinbajo further explained that he has no interest and has never had any interest, in the land, the building or development."
  },
  {
    "headline": "BREAKING: Professors, Other Abducted Staff Of Uni-Abuja Rescued, Suspects Arrested",
    "summarized_story": "Two University of Abuja professors and other staff members who were kidnapped recently have recovered their freedom.\nRecall that on Monday, some criminal elements suspected of being kidnappers broke into the university’s staff quarters and carried some inhabitants away to an unknown place.\nThe kidnappers called the victims’ relatives a day after their kidnapping and wanted N300 million in exchange for their release.\nHowever, DSP Josephine Adeh, the Federal Capital Territory Command’s Police Public Relations Officer, verified their release to DAILY POST on Friday morning.\nThe development, she said, came as a result of the command’s efforts in a combined operation with other security agencies."
  },
  {
    "headline": "Anambra Election: Confusion as man collapse at Polling Unit in Awka South (Pictures)",
    "summarized_story": "Next[LIVE) Anambra election: Voters troop out, frustrated as voting machines malfunction in Amesi, Orumba, other areas, PDP candidate votes after long wait (Pictures)"
  },
  {
    "headline": "[Live] Anambra election: Obiano votes as Police groan over non-payment of feeding allowance",
    "summarized_story": "Governor Willie Obiano of Anambra state has just voted in his home town Aguleri at the ongoing governorship election.\nMeanwhile, a trending video has revealed where Police operatives assigned for Saturday’s gubernatorial election in Anambra state are over the inability of the police authorities to pay them approved N10, 000 feeding allowance.\nThe officers were seen demanding that the N10,000 be paid to them without further delay.\nIt was learnt that the officers, many of whom arrived Anambra during the week, were not given accommodation.\nAccording to the video, the officers gathered at Idemili Ogidi Police Division, chanting “pay us our money.”More updates coming…"
  },
  {
    "headline": "[Live] Anambra election: Heavy security presence as electorate chose next governor, accreditation, voting begin",
    "summarized_story": "There is heavy security presence across polling units as eligible voters in Anambra state file out to elect their next governor.\nBlueprint reports that while voting had commenced at some polling units, officers of the Independent National Electoral Commission (INEC) were yet to arrive at many.\nAlso, voters and accredited civil society groups were equally seen waiting for INEC officials at Nri ward 1 (002, 001, and 003) in Anaocha LGA.\nAccreditation and voting were on as at 10am in Agulu ward 2 (polling units 001) in Anaocha LGA.\nMore updates coming…"
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Amotekun: Arrest, parade of Northerners dangerous to Nigeria’s unity –Group -NigPilot",
    "summarized_story": "A socio-political group, the Northern Conscience for 2023, NCfor2023, has described the arrest and parade of some youths believed to have been Northerners by the South West Security Network code-named Amotekun , as dangerous for the unity of Nigeria.\nThe security outfit had arrested 18 youths accused of hiding under bags of beans in a trailer, who were all paraded yesterday.\n“It is even more disturbing when one considers that he claims to be a Senior Advocate of Nigeria (SAN) who should have sound knowledge of the law and the constitution; and the fact that Ametokun is not recognized by the Constitution as a law enforcement agency with powers to parade suspects,” he added.\nThe group’s leader, who maintained that the North remains committed to the unity of Nigeria and the invisibility of the country, warned of grave consequences if the region retaliates the treatment meted it in recent times, by other parts of the country.\nThe country cannot afford to endure the carnage and lawlessness spreading within its borders like wildfire,” Gololo further cautioned."
  },
  {
    "headline": "Impeachment saga: Civil society condemns attack on Gov Lalong -NigPilot",
    "summarized_story": "*Preaches peace to embattled SpeakerThe coalition of Civil Society for Good Governance, CCSGG, has condemned in strong terms tirades and attacks against the Plateau State governor, Barrister Simon Bako Lalong by the impeached Speaker of the State House of Assembly, Rt.\n“Gentlemen of the press, we are aware that Plateau State House of Assembly was the first out of 36 States of the Federation to enjoy legislative and judicial autonomy, even when Hon.\n“The lawmakers decided to impeach their leader based on reasons best known to them and elected Hon.\nYakubu Sanda as new Speaker, which we consider as democracy in action, hence, peace should be allowed to reign at all cost,” the convener stressed.\nIt, however, commended Governor Lalong for his maturity and leadership that has ensured peace and tranquility as well as socio-economic and infrastructural development of the state, while calling on the citizens, particularly the youths not to allow themselves to be used."
  },
  {
    "headline": "East-West Road has gulped N359bn- Akpabio -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio has disclosed that over N359billion has so far been expended on the 657km dual carriage East-West Road stretching from Calabar in Cross River State, to Effurun in Delta State since it was initiated in 2006.\nAkpabio said bearing in mind the objectives of President Muhammadu Buhari on the completion of ongoing projects, the Niger Delta Ministry was considering raising funds from other sources to ensure the completion of section I-IV of the road before the end 2023.\nThe minister made this statement during the Ministry’s 2021 Budget Performance Review and 2022 Proposed Budget Consideration to the House of Representative Committee on Niger Delta Affairs on Tuesday in Abuja.\nSpeaking earlier, during the budget presentation the Chairman House of Representative Committee on Ministry of Niger Delta Affairs Hon.\nEssien Ekpeyong, assured that the Legislature is committed to the security of lives and investment in the Niger Delta region and for economic and social activities to strive."
  },
  {
    "headline": "I don’t need god-father to be APC national Chairman – Moniedafe",
    "summarized_story": "One of the prominent contenders for the national chairmanship position of the ruling All Progressives Congress, APC, Chief Sunny Sylvester Moniedafe, on Monday canvassed for the abolition of the concept of godfatherism in Nigerian politics saying it can not last any longer.\nHe said, “This thing is all about I need god-father, and this is what I want us to completely forget about.\nSunny Moniedafe, who threw his hat into the ring for the party’s national chairmanship office in March, 2021 belonged to the ACN bloc and was the Abuja chairman of the party.\nHe was Secretary of ACN in the FCT before the formation of the mega APC.\nHowever, unlike some of the aspirants in the APC national chairmanship race who are publicly backed by one or more prominent figures in the party, Mr Moniedafe at the moment has only his campaign promises."
  },
  {
    "headline": "PHOTOS: Voting Commences In Anambra Governorship Election",
    "summarized_story": "Voting has commenced in the 2021 Anambra governorship elections.\nSome 18 political parties are on the ballot as the race to replace current Governor, Willie Obiano, comes to a head.\nAlthough there have been hiccups with accreditation equipment in some polling units, the exercise is well underway in others.\nChannels Television reporters observed the commencement of voting at Unit 10, Amawbia 1, Community Primary School in Awka.\nReporters also observed voting in Ofuiyi Square, Umueze Isuofia in Aguata local government area of the state."
  },
  {
    "headline": "Five ‘Burnt Beyond Recognition’ In Abuja Market Tanker Fire",
    "summarized_story": "At least five persons have died in a fire incident at the Kubwa Village Market in Abuja, the police said on Saturday.\nThe fire incident occurred on Friday evening after a kerosene tanker exploded.\n“The Federal Capital Territory (FCT) Police Command has commenced investigations into the unfortunate fire incident that occurred at the Kubwa Village Market of the FCT in the evening of 5th November, 2021,” the statement said.\n“The Commissioner of Police, FCT, CP Babaji Sunday, who described the incident as unfortunate, has ordered a discrete investigation into the incident.\n“He further implores residents to report all suspicious movements, emergencies or distresses, through these numbers: 08032003913, 08061581938, 07057337653 and 08028940883.”"
  },
  {
    "headline": "UPDATED: Court Stops FG From Deducting $418m From States’ Account",
    "summarized_story": "The Federal High Court in Abuja has stopped the Federal Government from executing its plan to deduct $418 million from the bank account of the 36 states of the Federation.\nIn 2006, Nigeria paid $12 billion to get a $18 billion debt write-off by the Paris Club of international creditors.\nBut this move was rejected by the states who sought redress in court after the Federal Government said it would commence the deduction.\nThe Attorneys-General of the 36 states were listed as plaintiffs in the suit filed by their lawyers on October 27.\nThe states based the application on 13 grounds, which included that the plaintiffs were the attorneys-general and chief law officers of their respective states as created by the Constitution."
  },
  {
    "headline": "NDA Attack: I Was Embarrassed That We Didn’t Foresee Such A Threat – CDS",
    "summarized_story": "Chief of Defence Staff, General Lucky Irabor, has said that he was embarrassed that the army did not foresee the attack on the Nigerian Defence Academy.\n“But that, of course, is a lesson we have factored, and it does not in any way dampen the preparedness of the Armed Forces of Nigeria to what it should.\nAnd it does not in any way speak to our weakness and our inability to defend the nation”.\nRead Also: Bandits Attack NDA, Kill Two Officers, Abduct OneThe academy was attacked by bandits in August, resulting in the abduction of one officer and the death of two others.\nThe sound of the gunfire, however, alerted the troops of the NDA Quick Response Team, who arrived at the scene, but were unable to rescue the kidnapped officer as the bandits were already gone with the victim"
  },
  {
    "headline": "People Feared Dead in Kubwa market fire in Abuja",
    "summarized_story": "We will bring you the details as events unfold.\nTheir is no confirmation as of now on the cause of the fire at the popular Kubwa International Market in the FCT.\nThe fire which reportedly started at about 8pm Friday night is still raging at the time of this report.\nMany People are feared dead after a fire incident at the popular Kubwa International Market in Abuja according to report.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided."
  },
  {
    "headline": "ISWAP Ambushes Travellers, abduct 7 Security Personnel, Free Others in Borno -",
    "summarized_story": "More facts have emerged on how terrorists, suspected to be members of the Islamic State of West African Province detained seven security personnel in Borno state.\nThe security personnel, were abducted by the ISWAP on November 2, 2021 along the Damaturu-Maiduguri Road, following an ambush.\nThe terrorists, who were said to be armed and dressed in military uniforms staged the ambush at Tamsukawu village in Kaga Local Government of Borno, 7km away from Ngamdu a Super Camp of the Nigerian Military.\nAn eyewitness Isamil Bakura who luckily escaped the ambush, disclosed that the terrorists also intercepted 31 persons on seven vehicles that were heading to Maiduguri.\nThe Military is yet to issue a statement regarding this development"
  },
  {
    "headline": "Photos: Tinubu observes Juma'at prayers in Abuja",
    "summarized_story": "The National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu, on Friday joined other Muslim faithful in Abuja to observe two rakats prayer in Abuja.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month November 2021 (91) October 2021 (496) September 2021 (546) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,410) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,585) Formula 1 (19) Golf (15) Health News (2,209) inside lagos (1) International (7,185) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,795) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (21,444) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,644) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,415) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (285) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,041)"
  },
  {
    "headline": "INEC to spend N7Billion for Ekiti, Osun Governorship Elections -",
    "summarized_story": "Chairman of the Independent National Electoral Commission, Prof. Mahmoud Yakubu, has disclosed that the Election Management body has budgeted N7bn for the conduct of the Ekiti and Osun states governorship elections in 2022.\nYakubu said this while defending the N140bn INEC 2022 budget before the joint Senate and House of Representatives Committees on INEC and Electoral Matters.\nHe said, “We also budgeted N7bn for the conduct of Ekiti and Osun governorship election including the possibility of runoffs.\nHe added that “We made a provision of N2.6bn for Ekiti State with a population of over one million registered voters and N4.4bn for Osun with 30 local government areas."
  },
  {
    "headline": "New York County Prosecutor Casts Doubt on Sex Offense Charge Against Cuomo",
    "summarized_story": "A New York county prosecutor on Friday asked a judge to delay for two months the arraignment of former New York Governor Andrew Cuomo on a misdemeanor sex offense charge, saying a local sheriff may have botched the case by rushing to file the complaint.\nAlbany County Sheriff Craig Apple filed a “forcible touching” charge against Cuomo last month based on one woman’s accusation that Cuomo groped her under her blouse at the Executive Mansion in the New York state capital of Albany.\nSoares said in his letter that his office had been investigating Cuomo for months when the sheriff surprised him with a criminal filing.\n“There was sworn testimony included, and we followed the policies and protocols set to interview victims of sex crimes,” Apple said.\nIf convicted on the misdemeanor charge, he would face a possible sentence of up to a year in jail."
  },
  {
    "headline": "Fuel Tanker Blast in Freetown Kills at Least 91, Says Morgue",
    "summarized_story": "Ninety-one people were killed in the capital of Sierra Leone on Friday when a fuel tanker exploded following a collision, the central morgue and local authorities said.\nThe government has not yet confirmed the death toll, but the manager of the central state morgue in Freetown said it had received 91 bodies following the explosion.\nVictims included people who had flocked to collect fuel leaking from the ruptured vehicle, Yvonne Aki-Sawyerr, mayor of the port city, said in a post on Facebook.\n“We’ve got so many casualties, burnt corpses,” said Brima Bureh Sesay, head of the National Disaster Management Agency, in a video from the scene shared online.\n“It’s a terrible, terrible accident.”Images shared widely online showed several badly burned victims lying on the streets as fire blazed through shops and houses nearby."
  },
  {
    "headline": "Nigeria VP Osinbajo Denies Owning Collapsed Ikoyi Building’s Land",
    "summarized_story": "Nigeria Vice President Yemi Osinbajo has denied any link with the 21-storey building that collapsed in Ikoyi, Lagos on Monday, saying he has no interest whatsoever in the said property.\nReports surfaced online linking the Vice-President to the collapsed building’s land, and there were also claims that the said land was sold to Osinbajo by Chief Michael Ade-Ojo, Founder of Elizade Motors.\nThe Vice President said he had briefed his lawyers to sue the online medium that linked him to the said property.\n“Also, the attention of the Vice President has been drawn to an obviously sponsored falsehood regarding the recently collapsed building.\n“He has, indeed, never acted to influence any other regulatory action on the collapsed building, or any other building for that matter, in Lagos State."
  },
  {
    "headline": "Nigeria: Soludo, Uba, Ozigbo are Frontrunners as Anambra Votes Amid Fear, Tension",
    "summarized_story": "Amid fear and tension, caused by an endless bloodbath, which hindered campaigns of the political parties, the people of Anambra State will on Saturday vote to elect a new governor.\nFor most of yesterday, tension remained very high, with streets deserted, but the police and other security agencies have assured Anambra State voters of maximum security and want them to come out without fear.\nThough, there is no written agreement on the rotation of governorship in Anambra State on Senatorial basis, this has in many previous elections determined the emergence of a governor.\nIn the Southern zone, Uba is also very popular, but will be splitting his votes in the zone with Soludo and Ozigbo.\nHe and his party also have high popularity in the Central zone, just as it is expected that his largest number of votes will come from the Northern zone."
  },
  {
    "headline": "Pfizer Says Its Antiviral Pill Slashes Risk of Severe Covid By 89%",
    "summarized_story": "Pfizer’s pill, with the brand name Paxlovid, could secure U.S. regulatory approval by the end of the year.\nPresident Joe Biden said the U.S. government has secured millions of doses of Pfizer’s drug.\nPfizer’s pill is given in combination with an older antiviral called ritonavir.\nBourla added that for high-income countries Pfizer expects to price its treatment close to where Merck has priced its drug.\nPfizer did not detail side any effects but said adverse events happened in about 20% of both treatment and placebo patients."
  }
]