[
  {
    "headline": "NMA mourns female doctor killed in Abuja-Kaduna train attack",
    "summarized_story": "The Nigerian Medical Association has expressed sadness over the death of Dr. Chinelo Nwando Megafu, who was killed during an attack on the Abuja-Kaduna train on Monday.\nDr. Megafu was reported to have died hours after she made a post on Twitter, announcing that she had been shot on the train.\nUjah said the recruitment of more security personnel and the provision of modern security gadgets and ammunition cannot be overemphasised.\nHe also prayed for the families of Dr. Megafu and all other victims of the very unfortunate incident to find strength to bear the irreparable loss.\nThe terrorist were said to have opened fire, shooting sporadically on the train, and later gained access into the train."
  },
  {
    "headline": "NMA mourns female doctor killed in Abuja-Kaduna train attack",
    "summarized_story": "The Nigerian Medical Association has expressed sadness over the death of Dr. Chinelo Nwando Megafu, who was killed during an attack on the Abuja-Kaduna train on Monday.\nDr. Megafu was reported to have died hours after she made a post on Twitter, announcing that she had been shot on the train.\nUjah said the recruitment of more security personnel and the provision of modern security gadgets and ammunition cannot be overemphasised.\nHe also prayed for the families of Dr. Megafu and all other victims of the very unfortunate incident to find strength to bear the irreparable loss.\nThe terrorist were said to have opened fire, shooting sporadically on the train, and later gained access into the train."
  },
  {
    "headline": "Pharmaceutical research should be encouraged, supported in pharmacy faculties -Experts",
    "summarized_story": "President of the association, Ike Onyechi, made the call while speaking with PUNCH HealthWise in Lagos ahead of the upcoming 50th anniversary celebration of the UNN Pharmacy Faculty.\nHe said, “Universities are places of research and studies by the UNN pharmacy faculty will not only impact positively on the quality of teaching but also the quality of drugs.\nSo, it has become necessary to start doing what is done around the world like establishing an endowment foundation that will support research and development.\n“This will help to enhance the health of the nation as it would help boost pharmaceutical research.\nAkpa who is also an alumnus of the UNN Pharmacy Faculty said pharmacy faculties in the country can help conduct more pharmaceutical research if supported."
  },
  {
    "headline": "Pharmaceutical research should be encouraged, supported in pharmacy faculties -Experts",
    "summarized_story": "President of the association, Ike Onyechi, made the call while speaking with PUNCH HealthWise in Lagos ahead of the upcoming 50th anniversary celebration of the UNN Pharmacy Faculty.\nHe said, “Universities are places of research and studies by the UNN pharmacy faculty will not only impact positively on the quality of teaching but also the quality of drugs.\nSo, it has become necessary to start doing what is done around the world like establishing an endowment foundation that will support research and development.\n“This will help to enhance the health of the nation as it would help boost pharmaceutical research.\nAkpa who is also an alumnus of the UNN Pharmacy Faculty said pharmacy faculties in the country can help conduct more pharmaceutical research if supported."
  },
  {
    "headline": "Al Rihla: FIFA, Adidas unveil official match ball for Qatar World Cup",
    "summarized_story": "World Football governing body, FIFA, has released images of what the match ball for this year’s World Cup would look like.\nNamed Al Rihla, which means ‘the journey’, it is the 14th successive ball that adidas has created for the FIFA World Cup and is designed to support peak game speeds, as it travels faster in flight than any ball in the tournament’s history.\nAl Rihla means “the journey” in Arabic and is inspired by the culture, architecture, iconic boats and flag of Qatar.\nThe bold, vibrant colours set on a pearlescent background represent the FIFA World Cup host country and the ever-increasing speed of the game.\nThe draw for the World Cup group stage is set for this Friday."
  },
  {
    "headline": "Kaduna Train Attack: Passenger died of heart attack, terrorists left with SUVs filled with victims — Survivor",
    "summarized_story": "Muhammadu, who said they were about 10 left in Coach SP 17 when the terrorists left, told his experience in a radio interview on Tuesday night.\n“One of the VIPs, who managed to escape and returned to us, told us that the terrorists filled vehicles with abductees.\nThe terrorists were two steps away from me, but after killing a passenger, they went out of the train arguing.\nLater about 300 soldiers came.\nThe soldiers took us to a nearby hill where we sat down."
  },
  {
    "headline": "[VIDEO] Makoko Free School: A Cry For Help",
    "summarized_story": "Living in the slum without the barest of basic infrastructure is much worse than you can imagine.\nRELATED NEWS"
  },
  {
    "headline": "Driver killed, many abducted, as 300 soldiers exchanged fire with terrorists – Survivor",
    "summarized_story": "Muhammadu said that the terrorists came with buses and evacuated a number of passengers during the Monday night train attack.\nThe terrorists, many of them, rushed into our coach and killed a passenger.\nWe were about 10 that remained in coach when they left.”“The terrorists proceeded to the VIP coach and abducted many passengers.\nLater about 300 soldiers came.\nAlmighty Allah saved us ““The soldiers killed some of the terrorists."
  },
  {
    "headline": "Court sentences 2 SSS 3 students to 7 years imprisonment for stealing",
    "summarized_story": "Justice Yetunde Adesanya sentenced them after they pleaded guilty to a plea bargain agreement.\nWhen the case came up on March 4, 2022, the convicts opted for a plea bargain agreement and it was adjourned till March 29, 2022 for sentence.\nAnyanwu and Chibike, who were re-arraigned on a one-count amended charge of stealing before Justice Adesanya yesterday changed their not guilty plea to guilty.\n“I have considered the plea bargain and sentencing agreement, which was agreed and duly executed between the parties.\n“I hereby convict you, Udochukwu Anyanwu and Udo Chibike of the offence of stealing and you are guilty as charged."
  },
  {
    "headline": "Gov Ortom mourns as Fulani herdsmen kill scores in Benue fresh attack",
    "summarized_story": "Benue State Governor, Samuel Ortom has expressed grief over the sustained invasion and killings by Fulani herdsmen.\nThere were coordinated attacks on Guma, Kwande and Gwer West local government areas of the state on Tuesday, March 29th, 2022.\nTheir corpses were taken and deposited at a hospital in Gbajimba, Guma Local Government Area of the state.\nIn Kpankeeke, a suburb on the outskirts of Naka, headquarters of Gwer West local government, gory images of persons killed by another set of herdsmen littered the streets.\nAnother body of a young man yet to be identified was later sighted along the road."
  },
  {
    "headline": "Funke Akindele, Tuface, Falz lament Abuja-Kaduna attack",
    "summarized_story": "Nigerian celebrities have cried out following an attack on the Abuja-Kaduna train which left many dead and injured.\nHer post read: “This news is so heartbreaking.\nMy heart goes out to families that lost loved ones in the Kaduna-Abuja train attack in Nigeria.\nHis post read: “Back-to-back bombings on the Kaduna-Abuja rail.\nWhat the actual f**k.“My heart goes out to the families that had loved ones on the Kaduna-Abuja rail."
  },
  {
    "headline": "Oby Ezekwesili reveals why Kaduna train attack happened",
    "summarized_story": "Oby Ezekwesili, a former Minister of Education, has said that attacks such as the bombing of the Kaduna-bound train could only happen when a country is being ruled by callous leaders.\nGunmen suspected to be terrorists bombed the Abuja-Kaduna train between Katari and Rigina axis on Monday night, leaving hundreds of passengers dead in the attack.\nHer tweet was seen as a prank by many social media users, who went on to call her different names.\n“May God comfort the families of Chinelo and other victims of the terrorist attack of Kaduna bound train,” she added.\n“It is the greatest tragedy of life to be ruled by a political class that places zero value on life."
  },
  {
    "headline": "IPOB rejects naming Second Niger Bridge after Buhari, lists those to be picked",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Wednesday, rejected the naming of the second Niger Bridge after President Muhammadu Buhari.\nBuhari’s Personal Assistant on New Media, Bashir Ahmad, had disclosed that the Second Niger Bridge was named after the President.\n“IPOB is vehemently opposed to naming the second Niger Bridge after Buhari.\nHe added: “Again, we want to debunk the allegation by Fashola that IPOB disturbed the construction of second Niger Bridge.\n“South East has more credible names and more important persons who the federal government can name the second Niger bridge after."
  },
  {
    "headline": "Kalu condemns Abuja-Kaduna train attack, commiserates with victims",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr Orji Kalu has frowned at the attack on the Kaduna bound train from Abuja on Monday.\nThe Abia North Senator, however, commiserated with families of the departed souls and wished the victims hospitalized a speedy recovery.\nHis words, “I condemn in totality the attack on the Abuja-Kaduna train by unknown persons.\nThe security agencies must launch a robust investigation into the ugly incident.\n“I equally pray for the quick recovery of victims hospitalized and safe release of abducted victims”."
  },
  {
    "headline": "FEC observes silence for victims of Kaduna train attack",
    "summarized_story": "President Muhammadu Buhari on Wednesday led the Federal Executive Council (FEC) to observe a minute silence in honour of the victims of the terrorist attack on the Abuja-Kaduna train.\nThis is coming hours after the President ordered the military and security outfits to go after the terrorists, rescue all kidnapped passengers and bring the terrorists to justice.\nThe weekly virtual FEC presided over by President Buhari, started by 10am with the Secretary to the Government of the Federation (SGF), Mr Boss Mustapha, calling for a minute silence to be observed.\nMustapha disclosed the main and rescued train were attacked resulting in the death of eight persons, over 46 people injured and several others kidnapped.\nOthers are Minister of State for Labour and Employment, Mr Festus Keyamo (SAN), Minister of State Mines and Steel, Uche Ogar, while other ministers are attending virtually from their various offices."
  },
  {
    "headline": "OAU student: Adedoyin, 6 workers have case to answer — Court",
    "summarized_story": "An Osun State High Court, Osogbo presided by Justice Oyebola Ojo has ruled that Hilton Hotel owner, Dr. Rahmon Adedoyin, and six workers have a case to answer over the death of an MBA student of Obafemi Awolowo University, Ile-Ife, Timothy Adegoke.\nAt the sitting on Wednesday, Justice Ojo said a prima facie case was established against all the defendants.\nShe said: “Evidence before the court states that Timothy lodged in the hotel owned by Adedoyin.\nK. Eleja said in view of the ruling, the defence would enter their defense but asked for time to prepare for the defence.\nThe case was adjourned till April 25, 2022 for opening of defense."
  },
  {
    "headline": "2023: PDP groups clash over zoning",
    "summarized_story": "The battle over zoning of the Peoples Democratic Party (PDP) presidential ticket has shifted to the 37-man zoning committee chaired by Benue State Governor Samuel Ortom.\nYesterday, the pro-North group, under the aegis of Justice and Equity Group (JEG), sent a memorandum to the zoning committee.\nIn its own memo to the Zoning Committee signed by Paul Nwanubia, the group described as unfortunate that some people could be kicking against zoning at this point in time.\nThey deserted the PDP because they said former President Goodluck Jonathan and the South did not respect zoning.\n“Now that it’s their turn to respect our zoning arrangement, zoning has suddenly become an evil that must be rejected."
  },
  {
    "headline": "FIFA official dies after Abuja stadium stampede",
    "summarized_story": "Joseph Kabungo, FIFA/ CAF Doping Control Officer in charge of the decisive Qatar 2022 Play Off between Nigeria and Ghana at the Moshood Abiola Stadium in Abuja on Tuesday, is reportedly dead.\nRead Also: Osimhen wins second Serie A Player of the monthThough there is no official statement yet, the Zambian who was his country’s national team doctor when the Chipolopolo won the African Cup of Nations in 2020, reportedly suffered heart attack following the stampede at the Stadium after the ill-fated 1-1 draw between the Super Eagles and Black Stars at the match venue.\nKaboungo has been on the CAF medical team since 2013."
  },
  {
    "headline": "Wobbling Eagles out of Qatar 2022",
    "summarized_story": "Ghana yesterday drew 1-1 with Nigeria to qualify for the 2022 World Cup in Qatar on the away goals rule after both rivals played out a scoreless draw in Kumasi Friday night.\nThe Black Stars of Ghana thus advanced to their fourth World Cup after they also featured at the 2006, 2010 and 2014 tournaments.\nIn the 59th minute, Osimhen’s improvised overhead kick from inside the box missed the Ghana goal not by much.\nMeanwhile, Senegal became the second African team to progress after Ghana after a dramatic 3-1 penalty shootout win against Egypt.\nIn the ensuing penalty shoot-out, Sadio Mane was the hero as he did during the 2021 AFCON final between the two sides as he fired the decisive winning penalty to send Senegal through to Qatar 2022 with a 3-1 win."
  },
  {
    "headline": "2nd Niger Bridge: IPOB replies Fashola, we’re not Boko Haram",
    "summarized_story": "The group also rejected the proposal of the Second Niger bridge being named after President Muhammadu Buhari, describing such a proposal as laughable.\n‘We wish to restate our position on this and reject naming the second Niger bridge after the name of a Fulani man who came to power and completely sidelined our people.\n‘IPOB is vehemently opposed to naming the Second Niger Bridge after Buhari.\n‘Again, we want to debunk the allegation by Fashola that IPOB disturbed the construction of the 2nd Niger Bridge.\nIf the second Niger Bridge is being done in the North, Boko Haram, Ansaru, ISWAP and the pampered bandits would have chased them away."
  },
  {
    "headline": "Plateau residents lament over fire outbreak at technology incubation centre in Mabudi",
    "summarized_story": "From Gyang Bere, JosThe residents of Langtang South Local Government Area of Plateau State have lamented over the fire incident that engulfed the National Board of Technology Incubation (NBTI) by unidentified persons at Mabudi.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nMr Lohpon Nimfah Lar, an eyewitness to the incident, said they worked with other locals to put out the fire.\n‘At about 8 pm on Sunday we were told that fire is on the Incubation Centre and we ran to this place, there was no water.\nOne of us had to remove his shirt and everybody was told to urinate on the shirt,’ he explained."
  },
  {
    "headline": "Kalu condemns Abuja-Kaduna train attack",
    "summarized_story": "Chief Whip of the Senate, Dr. Orji Kalu, has described the attack on the Kaduna-bound train from Abuja on Monday as evil and cruel.\nLamenting the ugly incident, Kalu commiserated with families of the departed souls, while wishing hospitalised victims speedy recovery.\nKalu urged security agencies to work assiduously in rescuing kidnapped victims, adding that the perpetrators of the evil act must face the wrath of the law.\n“I condemn in totality the attack on the Abuja-Kaduna train by unknown persons.\n“Security agencies must launch a robust investigation into the ugly incident."
  },
  {
    "headline": "Kalu condemns Abuja-Kaduna train attack",
    "summarized_story": "Chief Whip of the Senate, Dr. Orji Kalu, has described the attack on the Kaduna-bound train from Abuja on Monday as evil and cruel.\nLamenting the ugly incident, Kalu commiserated with families of the departed souls, while wishing hospitalised victims speedy recovery.\nKalu urged security agencies to work assiduously in rescuing kidnapped victims, adding that the perpetrators of the evil act must face the wrath of the law.\n“I condemn in totality the attack on the Abuja-Kaduna train by unknown persons.\n“Security agencies must launch a robust investigation into the ugly incident."
  },
  {
    "headline": "How fans vandalised the Abuja stadiums after Nigeria-Ghana encounter",
    "summarized_story": "The Black Stars of Ghana ended Nigeria’s dream of becoming the first African country to qualify for four consecutive World Cups.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nHowever, following the final whistle, a crowd of irate fans stormed the pitch and damaged some of the stadium facilities.\nWitnesses told sunnewsonline.com that the fans poured into the pitch from all sides, upturning the dugout while smashing its glasses in anger.\nThe irate fans also carried out the act despite attempts by security operatives to stop them with teargas."
  },
  {
    "headline": "Breaking News: CAF Doctor Dies in Abuja Stadium Stampede",
    "summarized_story": "He was on duty as Doping officer.\nHe collapsed suddenly and died.\nCause of death not confirmed yet.\nHe lost consciousness was rushed to an ambulance closer to the Ghana dressing for CPR.\nThe entire Ghanaian contingent watched on as resuscitation attempts were made with oxygen mask."
  },
  {
    "headline": "Scores Feared Kidnapped in Terrorists’ Daredevil Raid on Kaduna Train",
    "summarized_story": "According to her, “The terrorists were moving about in the train, but they did not come to where I was seated.\nThe security personnel on the train announced that everybody should lie down on the floor of the train.\nMeanwhile, the Kaduna State Governor, Mallam Nasir El-Rufai, has visited victims of the attacks in the hospitals.\nThe lawmaker, noted that terrorists had in recent times stepped up attacks on some communities and public facilities in Kaduna State.\nThis came as the police IG said seven people lost their lives while 29 persons sustained injuries in Monday’s train attack along the Abuja- Kaduna route."
  },
  {
    "headline": "Nigeria’s Multiple, Overlapping Tax System Worries Buhari",
    "summarized_story": "•Says it’s inefficient, creates uncertainty, instability•Canvasses efficient tax administration for increased revenueDeji Elumoye in AbujaPresident Muhammadu Buhari has faulted the nation’s current multiple and overlapping tax system saying it’s inefficient and creates uncertainty and instability.\n”One key deliverable of this year’s tax dialogue is to promote synergy in tax administration among the different tiers of government.\nAccording to her: “The other tax revenue objectives are:”To institutionalise a healthy tax culture among Nigerians.\nThe right attitude towards taxation will enable every Nigerian to become a co-guardian of the tax system and the commonwealth.\nAs such, all hands must be on deck to support the tax system and make it function efficiently."
  },
  {
    "headline": "$418m Paris Refund: Governors Appeal Suit Challenging Dismissal of Deductions",
    "summarized_story": "Chuks OkochaGovernors of the 36 States of the Federation have appealed the court judgment which dismissed their suit challenging the federal government’s planned deduction of $418 million from the federation account to settle debts owed consultants engaged by the states and local governments on the Paris Club refunds.\nJustice Inyang Ekwo had dismissed a suit by the Attorney-General of the 36 states against the federal government in a judgment delivered recently saying the attorneys-general have not shown enough evidence to accord them the right to institute the action.\nHe held that there was no express evidence to show that the governors of the 36 states consented to the filing of the suit.\nHowever, the governors through their attorneys in their appeal, advised the general public and all financial institutions in Nigeria and abroad that the matter was subjudice and urging them to desist from dealing with the defendants in the suit.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: 8 Corpses Recovered, 26 Injured in Kaduna Train Attack",
    "summarized_story": "* Passenger manifest shows 362 onboard* Search and rescue operations ongoingBy John Shiklam in KadunaThe Kaduna state government has confirmed that eight corpses have so far been recovered while 26 people were injured in Monday’s terrorists attack on the Abuja- Kaduna train.\nSamuel Aruwan, the Kaduna state Commissioner for Internal Security and Home Affairs, disclosed this in a statement on Tuesday.\nThe statement added that passenger manifest did not include staff of the Nigerian Railway Corporation (NRC£ and security officials who were on board the train.\n“The passenger manifest does not include NRC staff and security officials who were on board.\n“Furthermore, security agencies have reported that eight bodies were recovered and 26 persons were injured during the attack."
  },
  {
    "headline": "How Buhari Avoided Nigeria-Ghana Match After DSS Warned Him Of Bomb Attack In Stadium",
    "summarized_story": "President Muhammadu Buhari stayed away from the Super Eagles Clash with Ghana on Tuesday at the M.K.O.\nAbiola National Stadium after he was warned of an imminent bomb attack, according to a memo from the State Security Service.\n“Intelligence available to the Service indicate [sic] imminent attack on M.K.O Abiola National Stadium, Abuja by members of the proscribed Indigenous People of Biafra (IPOB) using prime improvised explosive devices on 29th March, 2022.\nWhen his name was announced, Nigerians in the stadium booed him,” a spectator at the stadium confirmed to SaharaReporters.\nIt came as bandits continued their reign of terror on the vast swathes of the country’s northwestern territories."
  },
  {
    "headline": "How Buhari Avoided Nigeria-Ghana Match After DSS Warned Him Of Bomb Attack In Stadium",
    "summarized_story": "President Muhammadu Buhari stayed away from the Super Eagles Clash with Ghana on Tuesday at the M.K.O.\nAbiola National Stadium after he was warned of an imminent bomb attack, according to a memo from the State Security Service.\n“Intelligence available to the Service indicate [sic] imminent attack on M.K.O Abiola National Stadium, Abuja by members of the proscribed Indigenous People of Biafra (IPOB) using prime improvised explosive devices on 29th March, 2022.\nWhen his name was announced, Nigerians in the stadium booed him,” a spectator at the stadium confirmed to SaharaReporters.\nIt came as bandits continued their reign of terror on the vast swathes of the country’s northwestern territories."
  },
  {
    "headline": "EXCLUSIVE: Real Reason Former Lagos Governor, Tinubu Cancelled 70th Birthday Colloquium In Lagos",
    "summarized_story": "“Contrary to his claims, the real reason was poor attendance; Buhari boycotted; the Senate President boycotted; only three governors showed up; Ganduje, Oyetola Gboyega of Osun and Lagos Governor, Babatunde Sanwo-Olu.\nIt was all false that he cared about the train victims,” one of the top sources explained.\n“They used their absence to send a final message to Tinubu that he won’t be their candidate.\n“He (Tinubu) only used that to save face; the truth is that he was embarrassed by the level of attendance despite assurances that heavyweights would attend.\n\"Even the Vice President (Prof Yemi Osinbajo) didn’t attend, though he was in Abeokuta the previous day,” another top source said."
  },
  {
    "headline": "EXCLUSIVE: Real Reason Former Lagos Governor, Tinubu Cancelled 70th Birthday Colloquium In Lagos",
    "summarized_story": "“Contrary to his claims, the real reason was poor attendance; Buhari boycotted; the Senate President boycotted; only three governors showed up; Ganduje, Oyetola Gboyega of Osun and Lagos Governor, Babatunde Sanwo-Olu.\nIt was all false that he cared about the train victims,” one of the top sources explained.\n“They used their absence to send a final message to Tinubu that he won’t be their candidate.\n“He (Tinubu) only used that to save face; the truth is that he was embarrassed by the level of attendance despite assurances that heavyweights would attend.\n\"Even the Vice President (Prof Yemi Osinbajo) didn’t attend, though he was in Abeokuta the previous day,” another top source said."
  },
  {
    "headline": "Nigerian Governors Appeal $418 Million Paris Club Refund Judgment",
    "summarized_story": "The 36 state governors have appealed the Abuja Division of the Federal High Court judgment, which dismissed their suit challenging the planned deduction of $418 million from the federation account.\nA Federal High Court in Abuja had on March 25 dismissed a suit instituted by the 36 States’ Attorneys-General challenging plans by the Nigerian government to deduct funds from the federation account to settle the $418 million judgment debt in relation to the Paris Club refund.\nThe governors made the appeal through their Attorneys-General in a statement signed by five Senior Advocates of Nigeria, S. I. Ameh, J. S. Okutepa, Dr Garba Tetengi, Ahmed Raji and Olumuyiwa Akinboro.\nThe governors advised the public and all financial institutions in Nigeria and abroad that the matter was subjudice, urging them to desist from dealing with the defendants in the suit.\nOthers, according to the statement, include Riok Nigeria Limited, Prince Nicholas Ukachukwu, Dr Ted Iseghohi Edwards, Panix Alert Security Systems Limited, Dr George Uboh, Ned Munir Nwoko, Prince Orji Orizu and Olaitan Bello."
  },
  {
    "headline": "Ondo varsity VC: Education must be skill-driven if FG means well for youths -",
    "summarized_story": "Temi Ologunorisa, the vice-chancellor (VC) of Olusegun Agagu University of Science and Technology (OAUSTECH), Okitipupa, Ondo state, is advocating a skill-driven educational system in Nigeria.\nAdvertisementAccording to NAN, the professor spoke on Tuesday during a visit by Akoko youths to the institution’s campus.\nOlogunorisa said a skill-driven system was the best way of developing the educational sector in the country.\nThe vice-chancellor also said the government and other stakeholders in the educational sector must synergise for the sector to attain the 21st-century skill-driven system.\n“[This is] in addition to degree courses in Basic Medical Sciences, Management Science, Marine Science and Technologies, Environmental Studies, and professional postgraduate programmes."
  },
  {
    "headline": "It was all Glitz and Glam as OPPO Nigeria launched A96 smartphone",
    "summarized_story": "On March 23, 2022, OPPO Nigeria officially unveiled A96, an affordable luxury A Series smartphone which has been hailed as A Perfect Choice to own.\nThe launch took place at the prestigious Radisson Blu Hotel in Ikeja GRA, Lagos.\nIris Cao, the marketing director, during her welcome speech presentation, reeled out the interesting functionalities of the new OPPO A96 smartphone.\nThe task was simple, as best as one could, say all the functionalities of the new OPPO A96 phone and you would stand a chance to win a prize.\nA good number of people volunteered but there could be only one winner who took the grand prize of the new A96 smartphone."
  },
  {
    "headline": "VC protest: We don’t dialogue with touts, says OAU",
    "summarized_story": "The Obafemi Awolowo University (OAU) says it didn’t dialogue with those protesting against the appointment of its new vice-chancellor (VC) because it doesn’t engage with touts.\nBut locals in the varsity’s host community who favoured the installation of an Ife indigene had started a protest.\nAdvertisementThe protesters had shut OAU’s two major gates, preventing staff and students from either coming into or leaving the university.\nWe’re not supposed to engage anybody because we don’t engage touts,” he said.\nWe’re more enlightened than that.”A students union executive at OAU, who also spoke with TheCable Lifestyle, confirmed that activities had returned to the campus."
  },
  {
    "headline": "'Corps member wearing skirt not in our camp' -- Oyo NYSC reacts",
    "summarized_story": "The National Youth Service Corps (NYSC) in Oyo state has dismissed a viral video purportedly showing a corps member wearing a long skirt in its orientation camp.\nBut in the now-viral clip, the female corps member was seen donning a long white skirt.\nReacting in a statement, Olatoye Christy, the Oyo NYSC spokesperson, said the scene was not from the orientation camp in the state.\nAdvertisement“The attention of the management of the NYSC Oyo State has been drawn to the video that has gone viral in the social media showing an unidentified corps member that was purportedly spotted in NYSC Oyo State camp wearing a long white skirt instead of the conventional white short,” it read.\n“It is important to set the record straight that the scene was never captured in Oyo State camp."
  },
  {
    "headline": "Williams Uchemba: It is good Nigeria didn’t qualify for World Cup",
    "summarized_story": "Williams Uchemba says it’s a good thing that the Super Eagles of Nigeria failed to qualify for the 2022 World Cup in Qatar.\nThe Black Stars of Ghana qualified for the World Cup on Tuesday after playing a 1-1 draw with Nigeria.\nUchemba said so be it if missing out on the World Cup would make Nigeria pay serious attention to the pressing issues in the country.\nAmid unsafe roads, the railway station in Gidan, Kaduna state, was also invaded by gunmen in another attack.\nThis came hours after gunmen reportedly killed several residents across nine communities in Giwa LGA on Friday."
  },
  {
    "headline": "Everything you need to know about Web3—according to a blockchain engineer",
    "summarized_story": "Tudonu is currently building Wallet Cloud, a blockchain wallet-as-a-service platform, which provides an API that allows businesses to use blockchain wallets.\nTudonu: Web3 is an umbrella term for the blockchain space.\nTudonu: Web3 is an umbrella term for the blockchain space, and the blockchain itself is the technology.\nWeb3 is broader in terms of adoption, usage, application, and the consequences of the blockchain technology itself.\nTudonu: Web3 is an umbrella term for the blockchain space, and the blockchain itself is the technology."
  },
  {
    "headline": "Nigeria-based CredPal gets $15m to expand its buy now pay later business",
    "summarized_story": "Buy now pay later (BNPL)—a short-term consumer financing that allows shoppers to purchase products online and pay in installments with nominal or no fees—is sweeping the global e-commerce sector.\nThis will be used to expand its consumer credit offerings in its home country, Nigeria, and scale across Africa.\nThe more you use your credit card, the more your reward – from 1% to 15% across our partnered merchants!\npic.twitter.com/PCekh7M5oZ — CredPal (@CredPal) November 26, 2020“What we’ve done is encapsulate the lifestyle of the average working-class Nigerian and ensure that every person can find something specifically for them on CredPal,” Olaogun said in a recent interview.\nWhile competition appears to be heating up, there is a significantly large market of consumers and merchants to be tapped."
  },
  {
    "headline": "Digital Nomads: The pastor turned tech bro",
    "summarized_story": "The reason, Jay says, was that the lecturers in charge, at the time, knew nothing about the applications of tech.\nThis was 2018, mind you, but they said that tech wasn’t that important in the country, and that I should research something else.\nFor Jay, this event pushed him towards putting his degree to good use and becoming an all-round tech bro.\nHe doesn’t think his lecturers meant any harm, but he believes their lack of knowledge on the impact of tech will have damning consequences on the students they teach.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Okubanjo to step back from people decisions at Bento Africa",
    "summarized_story": "Bento’s board’s decision comes a few days after TechCabal exposed the harrowing experiences of ex-employees of payroll startup Bento Africa and how Okubanjo had allegedly been the orchestrator of that through direct and indirect bullying, verbal abuse, and threats to employees.\nOur responsibility and charter is to the Company, not the founders we invest in,” the board said in an email sent to all Bento employees, past and present.\nFurthermore, the board said that while Okubanjo is taking a back seat with immediate effect, an internal investigation into Bento’s workplace culture has begun.\nThe board claimed to have “…ensured that the current team is safe and free to speak freely.\nWith Love, Okubanjo admits to encouraging a work culture of “long workdays and weeks” and apologised for his abusive outbursts."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Kainji to subsidy: How Nigeria’s debt drifted from grace to grass",
    "summarized_story": "Nigeria’s motivation for increased borrowing was to make up for the revenue shortfall caused by low oil prices, which bottomed in 2016.\nThe country has racked up more external debt than any other member of the Organization of the Petroleum Exporting Countries since then, according to World Bank data.\nOil prices have since recovered but Nigeria’s finances have not.\nLow oil production caused by reduced investments in its oil sector, as well as the cost of the petrol subsidy, has muted the gains of higher oil prices for Nigeria.\nIn another instance of how other oil exporters are benefiting from higher oil prices, Angola is seeing its currency, the Kwanza, gain substantially against the dollar since the rally in crude oil."
  },
  {
    "headline": "Kainji to subsidy: How Nigeria’s debt drifted from grace to grass",
    "summarized_story": "Nigeria’s motivation for increased borrowing was to make up for the revenue shortfall caused by low oil prices, which bottomed in 2016.\nThe country has racked up more external debt than any other member of the Organization of the Petroleum Exporting Countries since then, according to World Bank data.\nOil prices have since recovered but Nigeria’s finances have not.\nLow oil production caused by reduced investments in its oil sector, as well as the cost of the petrol subsidy, has muted the gains of higher oil prices for Nigeria.\nIn another instance of how other oil exporters are benefiting from higher oil prices, Angola is seeing its currency, the Kwanza, gain substantially against the dollar since the rally in crude oil."
  },
  {
    "headline": "Nigeria’s misplaced borrowing priority",
    "summarized_story": "This government’s capital expenditure as a percentage of total expenditure has been, on average, about 21 percent from June 2015–June 2021 (the “term”).\nConsequently, fiscal deficits are being financed by borrowing from the domestic & foreign debt markets.\nA less discussed topic is the composition of Nigeria’s external debt & the interest burden.\nNigeria’s total foreign debt increased from US$10.3 billion as of 30th June 2015to US$38.4 billion as of31st December 2021.\nDuring this period, multi- & bi-lateral loans decreased from 70 percent & 15 percent to 49 percent & 11 percent of total foreign debt, respectively."
  },
  {
    "headline": "Shaibu Hosts Football Scouts From Sweden – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…Says Edo Poised For Sporting ExcellenceBENIN CITY – Edo State Deputy Governor, Rt.\nComrade Philip Shaibu, has played host to a delegation of international football scouts,Nexer Aiding Group Dreams Football from Sweden.\nSpeaking while receiving the Swedish delegation at the Government House, Benin City, the Deputy Governor reiterated the commitment of the present administration towards transforming the sports sector.\nAccording to Shaibu: ” this administration is focused in restoring the golden era of sports in Edo State”.\nThe scouts delegation arrived Nigeria to hunt for young football talents between the ages of 15 – 19 years."
  },
  {
    "headline": "Constitution Review: IPC stands with women to protest rejection of bills – Nigerian Observer",
    "summarized_story": "In a statement by the Executive Director, Lanre Arogundade, IPC which was signed by Stella Nwofia Program Manager,IPC said.\n“It is unfortunate that the 9th National Assembly (NASS) would contravene the country’s international legal obligations by denying Nigeria women the opportunity of better inclusion and greater representation in governance by voting against the pro-gender bills.\nArogundade stated that the rejection puts the country in bad light as it negates this years’ campaign theme #BreakTheBias of the United Nations (UN) International Women’s Day to be celebrated globally on March 8, 2022 (IWD 2022) under the broad theme “Gender equality today for a sustainable tomorrow”.\n“Furthermore, the proposed bills that were rejected would have addressed the current gender imbalance across the legislative arms of governments in the country, whilst reducing the under-representation of women in political office,” he stressed.\nIPC therefore calls on the National Assembly to reconsider its decision and take proactive and affirmative action in providing more opportunities for women to participate in politics, governance, and all spheres of human endeavour."
  },
  {
    "headline": "NWFL Wk 13: Edo Queens Se To Wrap-up Super 6 Ticket in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo Queens Football Club of Benin will this Wednesday the 30th of March 2022, at the Samuel Ogbemudia Stadium Benin-City host Pelican Stars FC of Calabar in the last home match of the 2021/2022 NWFL Wk13: premiership game.\nAt this point in time, it is a well- known fact that Edo Queens are resilient as they have their eyes fixed on the NWFL title having lost only one game since the beginning of the season.\nIn the first leg game played in Calabar, Edo Queens defeated Pelican Stars 1-0 right in front of their aggressive teeming home fans.\nSo in this return leg in Benin, we don’t need a prophet to tell us that Edo Queens will also show their supremacy by making sure they replicate what they did in Calabar few months ago.\nDespite losing to Nasarawa Amazons 2-0 last week, Edo Queens still top the table in Gruop A with 23 points, from 10 matches, Nasarawa Amazons seat second with 21 points, Confluence Queens have 16 points, Naija Ratels 15 points, Osun Babes 14 points, Adamawa Queens 9 points while Pelican Stars have 4 points."
  },
  {
    "headline": "Obaseki: Edo building sustainable infrastructure, expanding private sector space, others to attract new investments – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is building sustainable infrastructure, strengthening reforms and enhancing security to ensure the influx of investors into the state.\nThe governor, who spoke to journalists in Benin City, said his administration is also expanding the private sector space to make the state an investment hub and ensure sustainable development and economic prosperity for the state.\nWhen we came into office, there were only two airlines flying into the state, today, there are five of them.\n“The state has generally become more attractive to investments with the influx of investors in real estate, hospitality, oil and gas, industries, technology, agriculture, and manufacturing, among others.”“The security situation in the state has improved significantly with the linkage of the Edo State Security Network with the federal security structure.\nThis has ensured synergy that has helped in curbing urban crime, banditry and other forms of criminality,” he added."
  },
  {
    "headline": "‘We’d have saved lives if my N3bn request for drones was granted’ – Amaechi on Kaduna train attack",
    "summarized_story": "Minister of Transportation, Rotimi Amaechi, has said the lives lost to Monday night’s horrendous attack by terrorists on Kaduna bound train could have saved if his request for funds to procure equipment for digital security was approved.\nAccording to him, the equipment would eliminate all blind spots on the train corridors across the country.\nWe know we needed to have digital security equipment on the corridors.\n“We have lost track.\nHe added, “The Kaduna state government and the Nigerian Railway Corporation are all trying to make contact with those on the manifest."
  },
  {
    "headline": "Ecobank reportsv334% increase in profit to N146bn in 2021",
    "summarized_story": "Ecobank Plc, Nigerian lender, has declared a profit of N146.33 billion in full year 2021, a 334% increase year-on-year.\nEcobank Plc has been able to double its profits in 4 years since hitting N69 billion in 2017 with the profit now touching roughly N146 billion.\nThe statement from the financial institution revealed that in FY 2021, Net interest income grew by 12% from N346.61 billion to N386.71 billion in the current period.\nThe Bank’s profit performance for FY 2021 was on the back of all margin growth as income from interest, investment and fees and commission income all appreciated year on year.\nA further look at the results show that the lender earned N603.37 billion from its lending business as Interest income grew by 14% from N531.22 billion."
  },
  {
    "headline": "Ecobank hits tripled profit in FY2021",
    "summarized_story": "BY EMEKA EJEREPan-African lender, Ecobank Plc has posted highest annual growth in profit, recording a Profit After Tax (PAT) of N146.33 billion in 2021, a 334% increase year-on-year.\nProfit Before Tax (PBT) stood at N195.7 billion, 194 per cent higher than that of 2020.\nBy this development, Ecobank Plc has been able to double its profits in 4 years since hitting N69 billion in 2017 with the profit now touching roughly N146 billion.\nHowever, Ecobank Plc last traded at N11.80 per share, with its market capitalization standing at N216.52 billion as of Tuesday, March 29, 2022.\n“At 31 December 2021, gross loans and advances to customers was US$10,228 million (31 December 2020: US$9,798 million) against which total loan impairment amount of US$652 million (31 December 2020: US$558 million) were recorded, thus leaving a net loan balance of US9,576 million (31 December 2020: $9,240 million),” independent auditor Deloitte noted in its report."
  },
  {
    "headline": "Abuja Disco appoints Adeoye Fadeyibi new MD, Abdulahi Burkullu named CTO",
    "summarized_story": "The Abuja Electricity Distribution Plc (AEDC) has announced the appointment of Mr Adeoye Fadeyibi as its new Managing Director/Chief Executive OfficerThe distribution company also appointed Engineer Kassim Abdulahi Burkullu as its new Chief Technical Officer in a major reorganisation.\nFadeyibi, the new CEO, a turn-around manager with over 20 years executive management experience, succeeds Engr.\nAkinwumi Bada, who served as the company’s Interim Managing Director since last year and is now leaving to pursue other personal business aspirations.\nKassim Abdulahi Burkullu as its new Chief Technical Officer (CTO), replacing Mr. Oluwafemi Zacchaeus who had served as the Interim Chief Technical Officer.\nHe joined AEDC from Kano Electricity Distribution Company (KEDCO) where he was Head, Corporate Technical Operations Services."
  },
  {
    "headline": "Bar Week: Akwa Ibom Committed To Effective Administration Of Justice – Gov Emmanuel",
    "summarized_story": "The Akwa Ibom State governor, Mr. Udom Emmanuel, has pledged to continue to uphold the rule of law and effective administration of justice for the benefit of all citizenry and stakeholders.\nGovernor Udom Emmanuel reechoed his stance Monday, March 28, 2022, during the opening ceremony of the 2022 Bar Week of the Nigerian Bar Association (NBA), Uyo Branch.\nRepresented by his Attorney-General and Commissioner for Justice, Uko Udom, SAN, Governor Emmanuel expressed his desire for continued partnership and collaboration between the bar and his administration for the promotion of peace, security and progress of the state.\n“There’s an emerging part of maritime law, which is critical to our people, state and as a country.\nADVERTISEMENTThe highpoint of the event was the official unveiling and launching of the 2022 Bar Journal by Governor Emmanuel."
  },
  {
    "headline": "Kaduna Train Attack: Bank Of Agric MD Still Missing",
    "summarized_story": "The managing director of the Bank of the Agriculture (BoA), Alwan Ali Hassan’s whereabout was still unknown on Tuesday following bandit attack on an Abuja-Kaduna train on Monday night.\nIt was gathered that Hassan alongside his nice were aboard when terrorists attacked the ill-fated train.\nAccording to a source close to his family, Mr Hassan’s phone number could not be reached since the the attack.\nHe said, “We can not tell if he has been kidnapped or not but we are worried because we have been unable to reach him since yesterday (Monday).\nADVERTISEMENT“His phone lines have been switched off and no one has contacted the Bank or any of his family members.”ADVERTISEMENT"
  },
  {
    "headline": "Kaduna Train Attack: Bank Of Agric MD Still Missing",
    "summarized_story": "The managing director of the Bank of the Agriculture (BoA), Alwan Ali Hassan’s whereabout was still unknown on Tuesday following bandit attack on an Abuja-Kaduna train on Monday night.\nIt was gathered that Hassan alongside his nice were aboard when terrorists attacked the ill-fated train.\nAccording to a source close to his family, Mr Hassan’s phone number could not be reached since the the attack.\nHe said, “We can not tell if he has been kidnapped or not but we are worried because we have been unable to reach him since yesterday (Monday).\nADVERTISEMENT“His phone lines have been switched off and no one has contacted the Bank or any of his family members.”ADVERTISEMENT"
  },
  {
    "headline": "Train Attack: Buhari Orders Service Chiefs To Hunt Down Terrorists",
    "summarized_story": "He also directed the Nigerian Railway Corporation (NRC) management to speedily repair the damaged lines and resume normal service without delay.\nPresident Buhari reiterated his earlier directive that the military should deal ruthlessly with terrorists.\n“No one should be allowed to hold the country to ransom,” said the President.\nADVERTISEMENT“The attack on the train, a safe means of transport to many, is callous; and our thoughts are with the families of the deceased and prayers for the injured,” he added.\nThe President commended the law enforcement agencies for their prompt response and emergency personnel who were responsible for the evacuation and treatment of the injured persons."
  },
  {
    "headline": "Train Attack: Buhari Orders Service Chiefs To Hunt Down Terrorists",
    "summarized_story": "He also directed the Nigerian Railway Corporation (NRC) management to speedily repair the damaged lines and resume normal service without delay.\nPresident Buhari reiterated his earlier directive that the military should deal ruthlessly with terrorists.\n“No one should be allowed to hold the country to ransom,” said the President.\nADVERTISEMENT“The attack on the train, a safe means of transport to many, is callous; and our thoughts are with the families of the deceased and prayers for the injured,” he added.\nThe President commended the law enforcement agencies for their prompt response and emergency personnel who were responsible for the evacuation and treatment of the injured persons."
  },
  {
    "headline": "Buhari, ministers mourn Kaduna train attack victims",
    "summarized_story": "By Ismaila ChafePresident Muhammadu Buhari and members of the Federal Executive Council (FEC), on Wednesday in Abuja observed a minute silence in honour of the victims of Abuja-Kaduna train attack.\nThe meeting began with the Secretary to the Government of the Federation, Boss Mustapha, calling for a minute silence to be observed in honour of the victims.\nThe Kaduna-bound train, which left Abuja at 6 p.m. on Monday, was attacked by suspected terrorists at about 7.45 p.m., just about 15 minutes before reaching Kaduna.\nThe Vice-President Yemi Osinbajo, and the Chief of Staff to the President, Prof. Ibrahim Gambari are attending the meeting .\nThe rest are Minister of State for Labour and Employment, Festus Keyamo, and Minister of State Mines and Steel, Uche Ogar among others."
  },
  {
    "headline": "Chrisland Schools win 34 medals at 2022 World School Games",
    "summarized_story": "Athletes representing Chrisland Schools won a total of 34 medals across various competitions and categories at the 2022 World School Games which took place in Dubai from March 10 till 13 March 2022.\nThe schools participated in both the U-11 and U-13 categories of the four-day annual competition with schools from all over the world.\nAn impressive display at the event saw the school win gold medals in 400m, 4 X 100m mixed relays, 4 X 100m relay (boys), triple jump, long jump, 80m hurdles, shot put among other events.\nThe medal haul includes five gold medals, seven silver medals, and one bronze medal in the U-11 category and ten gold medals, six silver medals, and four bronze medals in the U-13 category.\nThe Managing Director, Chrisland Schools, Mrs. Ibironke Adeyemi, commended the students for making the institution proud and assured them of the school’s commitment to nurturing their talents."
  },
  {
    "headline": "Kwankwaso Reveals Reason Why He Dumped PDP For NNPP",
    "summarized_story": "Senator Rabiu Musa Kwankwaso, a former governor of Kano State, has disclosed why he switched from the opposition Peoples Democratic Party (PDP) to the New Nigeria Peoples Party (NNPP).\nKankwaso, a presidential candidate in the 2019 elections, officially abandoned the PDP on Wednesday, according to NEWS DIRECT.\nKwankaso, speaking while receiving his new party’s membership card, blamed his actions on the main opposition party’s crisis.\nHe said, “We had a situation in April last year where zonal positions were being shared among the States and all leaders in the six other States were given the opportunity to nominate.\nBut in Kano, some people felt I wasn’t that important, so they had to do what they did."
  },
  {
    "headline": "Osun Guber: Oyetola Will Be Re-elected, The Odds Notwithstanding — Sanwo-Olu",
    "summarized_story": "The Governor of Lagos State, Mr. Babajide Sanwo-Olu, has expressed confidence in the ability of his Osun State counterpart, Adegboyega Oyetola, to be re-elected for second term.\nSanwo-Olu said the Governor has done well to get re-elected for second term, saying “Against all odds Oyetola will be returned for second term”The Lagos State Governor made the statements while giving his remarks at the special prayers session organised to celebrate the 70th birthday anniversary of a former Governor of Lagos State and National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu.\nThe prayer which was held at the premises of the residence of the former Lagos State Governor, had in attendance ‘who is who’s in the country."
  },
  {
    "headline": "Katsina Commissioner Shot By Terrorists During Abuja-Kaduna Train Bombing, Loses Two Toes",
    "summarized_story": "The Katsina State Commissioner for Health, Nuhu Danja, has been confirmed to be among those who sustained gunshot wounds in the Kaduna-Abuja train attack.\nThe Secretary-General of the Trade Union Congress (TUC) of Nigeria, Barrister Musa-Lawal Ozigi, was also confirmed among the passengers killed when terrorists bombed the Abuja-Kaduna train.\nSaharaReporters earlier reported that a former Deputy Governor of Zamfara State, Malam Ibrahim Wakkala, was among the Abuja-Kaduna train passengers who was shot by terrorists on Monday evening.\nSaharaReporters had reported that two cleaners and workers of the attacked Abuja-Kaduna train identified as Loretta and Abdul were confirmed dead.\nThere are at least 970 passengers on board the train, according to official sources familiar with the train service."
  },
  {
    "headline": "JUST IN: Terrorists Attack Train Station In Kaduna",
    "summarized_story": "JUST IN: Terrorists Attack Train Station In KadunaTerrorists have attacked Gidan train Station along the Abuja-Kaduna rail track.\nSources quoted by Channels TV said the terrorists may have planted IEDs on the tracks forcing the train heading to Abuja from Kaduna to a stop.\nThis is the second attack within 24 hours along the same axis.\nAt least seven persons were killed when terrorists attacked a train at Dutse village on Monday."
  },
  {
    "headline": "Breaking: CAF official dies day after fans invaded Abuja stadium",
    "summarized_story": "An official of the Confederation of African Football (CAF) has reportedly passed on following the invasion of the Nigeria’s National Stadium by hoodlums.\nHoodlums invaded the Moshood Abiola Stadium in Abuja after Nigeria lost on aggregate to Ghana in the second leg of the 2022 World Cup qualifying tie.\nAs soon as the referee declared the match closed, a lot of angry Nigerian fans invaded the stadium complex, destroying the facility as well as causing havoc.\nDr. Joseph Kabungo, one of the CAF’s doping officials for the game between Ghana and Nigeria was caught in the crisis.\nHe was reported to have lost lost consciousness after he was beaten and stepped on as fans try to make their way out of the stadium due to stampede."
  },
  {
    "headline": "Train attack: Names of prominient dead, missing, injured victims emerge as Buhari, NASS drop hint for security chiefs",
    "summarized_story": "Kaduna state Governor Nasir el-Rufai has confirmed that eight dead bodies were recovered, 26 people injured, with several passengers onboard the Abuja-Kaduna train attacked Monday night by bandits, still missing.\n“Security agencies have reported that eight bodies were recovered and 26 persons were injured during the attack.\nThe missing, dead passengersIn a related development, the Secretary General, Trade Union Congress (TUC), Comrade Musa Lawal Ozigi and the Kwara state branch chairman of the union, Comrade Akin Akinsola, were among victims of the Kaduna train attack.\n“The current security malaise in the state is certainly not what the people of Kaduna state bargained for.\nThe terrified passengers only breathed a sigh of relief when security agencies arrived and secured the train and the area."
  },
  {
    "headline": "Breaking: Super Eagles fail to pick 2022 World Cup ticket",
    "summarized_story": "After a disappointing 1-1 draw in the return leg of 2022 FIFA World Cup playoffs against the Black stars of Ghana, Super Eagles failed to pick the expected ticket to Qatar.\nDetails loading…"
  },
  {
    "headline": "PHOTOS: ‘Saddened’ Osinbajo, El-Rufai Visit Kaduna Train Attack Victims",
    "summarized_story": "Vice President Yemi Osinbajo has said that he is saddened by the terrorist attack on a train conveying hundreds of travellers at Dutse forest in Chikun Local Government Area of Kaduna.\nOsinbajo during his visit to Kaduna state on Tuesday described the incident as “another mindless terrorist attack on citizens.”He said this during his visit to the 44 Nigerian Army Reference Hospital in Kaduna and urged Nigerians not to let the attacks break their spirit.\nREAD ALSO: ‘A Horrific And Preventable Death,’ NMA Mourns Doctor Chinelo“I am saddened by another mindless terrorist attack on citizens.\nThe Vice-President was accompanied by Kaduna State Governor Nasir El-Rufai.\nSee photos of their visit to the hospital below…Earlier, the Inspector-General of Police Usman Alkali Baba, Chief of Defence Staff General Lucky Irabor, and top officials of the Nigerian Railway Corporation, visited the site of the terrorist attack."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: ‘I Warned That Lives Will Be Lost’ – Amaechi",
    "summarized_story": "The Minister of Transportation Rotimi Amaechi has reacted to the terrorist attack on the Abuja-Kaduna train saying he had warned that lives would be lost.\nREAD ALSO: Trade Union Secretary Killed In Abuja-Kaduna Train AttackHe lamented that now it will take more than N3 billion to replace what has been lost to the attack on the Abuja-Kaduna rail route.\nThe cost of what we’ve lost is more than N3 billion.\nWe’ve lost tracks, we’ve lost locomotives and coaches.\n“To fix all the things on that track now, will cost us more than N3 billion."
  },
  {
    "headline": "VIDEO: Survivors Of Abuja-Kaduna Train Attack Narrate How They Were Shot At",
    "summarized_story": "﻿Survivors of the Abuja-Kaduna train attack on Monday have narrated how terrorists shot at them.\nAt least eight persons have been confirmed dead and many feared abducted.\nAbout 26 persons were injured and are receiving treatment at two hospitals in Kaduna, the state government said on Tuesday.\n“We have a lot of insecurity in Nigeria,” Fatima Shaibu, one of the survivors who spoke to Channels Television, said.\n“By road we are not safe, by train we are not safe.”"
  },
  {
    "headline": "EFCC Arrests Suspect On FBI Wanted-List In Enugu",
    "summarized_story": "The Enugu Zonal Command of the Economic and Financial Crimes Commission (EFCC), has arrested Emmanuel Dike Chidiebere, a suspect on the watch list of the American Federal Bureau of Investigation (FBI), for conspiracy, wire fraud and money laundering.\nActing on verified intelligence, operatives of the Commission on Wednesday, March 23, 2022, tracked the suspect to Orlu Local Government Area of Imo State where he was arrested.\nChidiebere is alleged to have defrauded some victims in America, Cote D’Ivoire and Poland of some undisclosed amount of money and went underground.\nRead Also: [VIDEO] Survivors Of Abuja-Kaduna Train Attack Narrate How They Were Shot AtThe suspect’s arrest comes few weeks after the EFCC apprehended two other individuals on the FBI’s wanted-list.\nOsondu Igwilo and Kelechi Vitalis Anozie, were apprehended in Lagos and Enugu respectively, they had been on the watchlist of the FBI for a few years now."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: ‘398 Passengers Bought Tickets’; Govt Releases Manifest",
    "summarized_story": "The Kaduna State Government has released the passenger manifest for the Abuja-Kaduna train service AK9 which was attacked by bandits on Monday.\nAccording to the documents, 398 passengers bought tickets for the trip but 362 of these passengers were validated as having boarded the train through the gate.\nKaduna State Governor, Nasir El-Rufai on Tuesday visited some of the victims receiving treatment at the 44 military hospital and St. Gerald hospital.\nThe bandits were said to have opened fire, shooting sporadically on the train, and later gained access to the train.\nThe Dutse village is just a few kilometres from the Rigasa train station, which is the last transit point of the train."
  },
  {
    "headline": "Gbajabiamila pays tribute to Tinubu at 70, says he's pillar of modern developmental strides in Lagos",
    "summarized_story": "The Speaker of the House of Representatives Rep. Femi Gbajabiamila has paid glowing tributes to the national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, on his 70th birthday.\nThe speaker noted with delight Tinubu’s invaluable contributions to Nigeria’s democracy in the past decades, saying he has unmatched credentials.\nSpeaker Gbajabiamila recalled how Tinubu used his acumen to turn things around in Lagos State when he served as governor for eight years.\nReferring to Tinubu as the pillar of modern developmental strides in Lagos State, Gbajabiamila said he believes the APC national leader will go down in history as one of the best and most impactful democrats Nigeria has had.\nThe speaker wished the Asiwaju more fruitful years in good health as well as increased wisdom from the Almighty God."
  },
  {
    "headline": "Niger Governor greets Tinubu at 70, describes him as a \"transformative leader\"",
    "summarized_story": "Niger State Governor and Chairman North Central Governors Forum (NCGF) Abubakar Sani Bello has paid glowing tributes to National Leader of All Progressives Congress APC and former Governor of Lagos State, Senator Asiwaju Bola Tinubu as he celebrate his 70th birthday.\nGovernor Sani Bello, in a congratulatory massage to the septuagenarian described him as a visionary and transformative leaderThe Governor said the celebrant who is also the Jagaban of Borgu Kingdom, has remained a Colossus and a phenomenon in the annals of the ruling party and the nation’s political history.\nThe Governor noted that the exceptional political career and service of Tinubu, has inspired so many people and has produced many successful leaders in the country.\nHe added that the APC National Leader is an icon, bridge builder and a patriotic elder statesman who believes in the development, unity and corporate existence of Nigeria.\nThe Governor prayed for more years in good health and wisdom for the celebrant, to continue to serve humanity."
  },
  {
    "headline": "Femi Adekanmbi eulogises Asiwaju Bola Tinubu @ 70",
    "summarized_story": "A former commissioner for culture, tourism and special duties in Ondo State, Chief Femi Adekanmbi has described the National leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu as a phenomenon in the annals of the nation’s political history.\nAdekanmbi in a message to celebrate the former Lagos State Governor at 70, described him as a visionary and transformative leaderAccording to him, ” Asiwaju Bola Ahmed Tinubu who is also the Jagaban of Borgu Kingdom, has remained a colossus and a phenomenon in the annals of the ruling party and the nation’s political history.\n“The exceptional political career and service of Tinubu, has inspired so many people and has produced many successful leaders in the country”.\nHe added that the APC National Leader is an icon, bridge builder and patriotic elder statesman who believes in the development, unity and corporate existence of Nigeria.\n“I felicitate with you on your 70th birthday Asiwaju."
  },
  {
    "headline": "Breaking: Osinbajo meets Obasanjo in Abeokuta",
    "summarized_story": "Vice President Yemi Osinbajo on Monday met with former President Olusegun Obasanjo in Abeokuta, the Ogun State capital.\nOur Correspondent gathered that Osinbajo visited Ogun State for a high-level dialogue organised by the Coalition for Dialogue on Africa (CoDA).\nThe dialogue tagged, ‘West Africa: Rising To The Challenge Of Consolidating Democratic Governance’, planned to hold at the Olusegun Obasanjo Presidential Library (OOPL), Abeokuta on Monday and Tuesday.\nHe who was escorted by the Ogun State Governor, Dapo Abiodun and was received by former President Obasanjo as they proceeded to the venue.\nFormer President Goodluck Jonathan was also in attendance during the programme."
  },
  {
    "headline": "Russia Launches New Attacks after Peace Promise",
    "summarized_story": "The governor of Ukraine’s Chernihiv region says there is no let-up in attacks by Russia, despite its pledge to reduce military activity there.\nOf course not,” he said, adding Russia had bombarded Chernihiv “all night long”.\nOn Tuesday, Russia said it would cut back operations around Chernihiv and the capital, Kyiv.\nAir raid sirens sounded in Kyiv in the early hours of Wednesday, hours after Russia said it would withdraw some troops from around the capital.\nRussia’s pledge to cut back military activity was met with scepticism."
  },
  {
    "headline": "Air France KLM Loses Fight Against EU Cartel Fine",
    "summarized_story": "Air France-KLM and its Dutch subsidiary KLM on Wednesday lost their challenge against million-euro fines re-imposed by EU antitrust regulators five years ago for taking part in an air cargo cartel two decades ago.\nThe European Commission had fined Air France 182.9 million euros ($204 million), the highest, followed by KLM at 127.1 million.\nRelatedStories No Content AvailableThe Luxembourg-based General Court rejected Air France KLM and KLM’s appeals and those brought by Martinair Holland, Cargolux, Lufthansa (LHAG.DE) and Singapore Airlines (SIAL.SI).\nIt reduced the Commission’s fines but also hiked them for Japan Airlines, Air Canada, British Airways, Cathay Pacific Airways, SAS Cargo Group and Others, Latam Airlines Group and Lan Cargo.\nThe cases are T-323/17 Martinair Holland, T-324/17 SAS Cargo Group and others, T-325/17 KLM, T-336/17 Air Canada, T-334/17 Cargolux Airlines, T-337/17 Air France–KLM, T-338/17 Air France, T-340/17 Japan Airlines, Case T-341/17 British Airways, T-342/17 Deutsche Lufthansa and others, T-343/17 Cathay Pacific Airways, T-344/17 Latam Airlines Group & Lan Cargo and T-350/17 Singapore Airlines & Singapore Airlines Cargo."
  },
  {
    "headline": "Russian Pledge to Scale Back in Ukraine Draws Skepticism",
    "summarized_story": "Russia’s pledge to scale back some military operations in Ukraine drew skepticism, a bitter reality check in a rare moment of optimism five weeks into what has devolved into a bloody war of attrition.\nRussian delegation head Vladimir Medinsky said negotiators would take Ukraine’s proposals to Russian President Vladimir Putin and then Moscow would provide a response, but he did not say when.\nCavusoglu said he expected a meeting between the Russian and Ukrainian foreign ministers at an unspecified time.\n“We judge the Russian military machine by its actions, not just its words,” British Deputy Prime Minister Dominic Raab told Sky News on Wednesday.\n“Such activity is placing further pressure on Russia’s already strained logistics and demonstrates the difficulties Russia is having reorganizing its units in forward areas within Ukraine.”"
  },
  {
    "headline": "Nigeria Suffers $14bn Loss to Farmer-Herder Clashes, Says VP Osinbajo",
    "summarized_story": "Nigeria has lost over $14 billion yearly due to the frequent farmer-herder clashes, Vice President Yemi Osinbajo said on Tuesday.\nOsinbajo made the disclosure in Lagos, while declaring this year’s Livestock and Aquaculture Trade Fair open.\nAlso speaking, the Minister of Agriculture & Rural Development, Mahmood Abubakar, called for the development of the nation’s fishing industry.\nRepresented by Mrs. Omolara Oguntuyi, Abubakar noted that the nation has no business importing fish going by the nation’s abundant marine resources.\nFish do not grow on sand but in water and the country is blessed with abundant amount of water."
  },
  {
    "headline": "Nigeria: Aviation Minister Sirika Insists Government Will Own Only 5% of National Carrier",
    "summarized_story": "Nigeria’s Minister of Aviation, Senator Hadi Sirika has insisted that the planned national carrier which is billed to commence operation later this year would be private sector driven as the federal government would only have five per cent stake.\nThe minister made this known on Tuesday while fielding questions during the discussion on the future of global aviation at the ongoing World Government Summit Dubai Expo 2020, where he reiterated that members of the public would have 95 per cent stake in the national carrier with the core investor holding 49 per cent equity.\nSirika said aviation remains the fastest growing sector of the nation’s economy since the COVID-19 lockdown and described the country as the best place for airline business in Africa.\nSirika also stated that the Aviation Road Map programme developed by the President Muhammadu Buhari administration was running its full course with planned actualisation of the national carrier, setting up of an aircraft maintenance facility, leasing company, aerospace university and concession of major airports in the country.\nThe minister stressed that Nigeria needs a national carrier because of its 200 million population, most of whom are very mobile and exploiting all modes of transportation, including air transport, which has recorded increasing passenger traffic since after the coronavirus lockdown."
  }
]