[
  {
    "headline": "Carry out inspections on buildings to avoid collapse, LASEMA urges residents",
    "summarized_story": "Lagos State Emergency Management Agency has urged residents to carry out regular inspections on buldings for cracks and other structural defects to prevent them from collapsing.\nThe Agency, in a post on social media, advised building owners against work within limited funds at the expense of safety, quality and structural stability.\nLASEMA said this in reaction to the incidence of building collapse in Lagos which has been on the increase in recent times.\n“Building owners should not work within limited funds at the expense of safety, quality and structural stability.\n“All Stakeholders in the construction industry should adhere strictly to the provisions of the Lagos State Building Code,” the Agency said."
  },
  {
    "headline": "Pictorial: Swearing-in ceremony of new corps members in Gombe",
    "summarized_story": "New members of the National Youth Service Corps were sworn in at the Temporary Orientation Camp Amada, Gombe State, during the Swearing-in ceremony of the 2021 Batch C Stream II Corps.\nAccording to the Gombe NYSC coordinator, Ada Imoni, 1566 Corps members, made up of 618 males and 948 females were sworn in during the ceremony on Tuesday.\nSee photos from the ceremony below:Photos: Chima AzubikeCopyright PUNCH.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Ilana Omo Oodua quits NINAS, as Prof Akintoye resigns",
    "summarized_story": "Professor Banji AkintoyeBy Sola Isola – IbadanIlana Omo Oodua (IOO), the umbrella body of Yoruba Self-Determination Groups, has moved out of the Nigerian Indigenous Nationalities Alliance for Self-Determination (NINAS).\nAlso, the Chairman of NINAS, Professor Banji Akintoye, has left his chairmanship role in the organization with immediate effect.\n“Therefore, we the leadership of Ilana Omo Oodua, wish to inform the general public that the Yoruba Bloc under the leadership of Ilana Omo Oodua Worldwide has moved out of the Nigerian Indigenous Nationalities Alliance for Self-Determination (NINAS) with immediate effect in order to safeguard the integrity and honour of our agitation for Self-Determination.\nHowever, it is now obvious to most people in the Yoruba Self-Determination struggle that the LNC is not working in tandem with our objective in Ilana Omo Oodua.\n“Furthermore, Ilana Omo Oodua hereby withdraw its membership of NINAS with immediate effect."
  },
  {
    "headline": "Seplat to acquire ExxonMobil’s oilfields in Nigeria",
    "summarized_story": "By Prince OkaforNigerian independent oil and gas company, Seplat Energy Plc together with a partner, is in competitive discussions to acquire ExxonMobil’s Nigerian shallow water business.\nThe Energy Company listed on both the London and Nigerian Stock Exchanges disclosed this in a statement issued on the Nigerian Exchange Limited (NGX).\nIt would be recalled that in October, ExxonMobil’s President, Liam Mallon, had said the company remains “committed” to Nigeria despite its decision to divest from the joint venture (shallow water) with the Nigerian National Petroleum Corporation (NNPC).\nHowever, the Chief Financial Officer, Seplat Energy, Emeka Onwuka, noted that the company was looking to acquire the asset in partnership with an ally.\nWhen Energy Vanguard contacted ExxonMobil’s Manager, Media and Communications, Oge Udeagha, he said: “Thanks for checking in with us."
  },
  {
    "headline": "Nnamdi Kanu’s lawyer berates DSS for granting Orji Kalu access to his client",
    "summarized_story": "Nnamdi Kanu, IPOB leaderBy Ikechukwu Nnochiri – AbujaMr Ifeanyi Ejiofor, lead counsel to the detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, on Tuesday, berated the Department of State Services, DSS, for granting a former Governor of Abia State, Orji Uzor Kalu, private access to his client in detention.\nEjiofor, who described Kalu’s visit to his client as “bizarre and unusual”, maintained that it was in gross violation of the court-ordered guideline for visitation.\nHe alleged that the DSS gave the erstwhile governor access to the IPOB leader before the time scheduled for a formal visit.\nHe wrote: “This afternoon, I visited my brother, Mazi Nnamdi Kanu in DSS custody, Abuja.\n“We can at best describe what transpired yesterday between a visitor whom the detaining authority ostensibly aided to violate the court-ordered guideline for visiting our Client as bizarre and unusual."
  },
  {
    "headline": "Owning a home in Lagos with a limited budget is possible – See how",
    "summarized_story": "Meridian Park Estate has filled this obvious vacuum in the real estate sector by providing inexpensive housing options for Lagosians without compromising quality, space or location.\nFor more than 6 years, hundreds of families have moved into Meridian Park Estate with an initial deposit, as low as N5.99 million.\nThese initiatives ensure that the budget does not put a stop to Lagosians’ hope of owning their own property.\nMeridian Park Estates, sited in different parts of Lagos city like Ajah, Ogombo, Awoyaya, and Abraham Adesanya, have changed the narrative for average Nigerians.\nContact the Meridian Luxury Park Estates on 08149906219 for our numerous offers, and super flexible payment plan, because not even your budget can stop you now."
  },
  {
    "headline": "A generation ambushed by drugs [Opinion]",
    "summarized_story": "Drug trafficking and drug abuse/addiction form parts of a vicious circle.\nWhere there is a high level of drug abuse, there must always be a correspondingly high level of drug trafficking and vice versa.\nOf the 14m people abusing drugs, 10.6m abuse cannabis Sativa, aka Indian hemp – the rest abuse various other hard drugs.\nMost of the poor people who abuse drugs either use Indian hemp or abuse pharmaceutical drugs like tramadol, cough syrups and the infamous mkpuru Miri trending across social media lately.\nGovernment must confiscate all monetary proceeds of drug trafficking, and drug pushers punished by the law."
  },
  {
    "headline": "BREAKING: Court declares deposed Kano Emir, Sanusi’s banishment as unlawful",
    "summarized_story": "Justice Anwuli Chikere of the Federal High Court in Abuja has declared as illegal, unlawful and unconstitutional, the banishment of the deposed Emir of Kano, Sanusi Lamido Sanusi to Awe, a remote community in Nasarawa State.\nThe court held that the restrictions placed on Sanusi after his deposition on March 9, 2020, on allegations of insubordination are a clear arbitrary violation of his right to freedom of movement and personal liberty granted by the Nigerian constitution.\nJustice Chikere agreed with Prince Lateef Fagbemi SAN, counsel to Sanusi, that his client was moved out of Kano to Abuja and later to Awe, in Nasarawa State against his wish.\nThe judge subsequently voided the arrest, harassment, and banishment of Sanusi to Abuja and later to Nasarawa State and set it aside on ground of being an infringement of his fundamental human rights.\nA sum of N10 million was awarded to the former Emir as damages to be paid to him by the respondents."
  },
  {
    "headline": "We’ll provide enough COVID-19 vaccines for you – NYSC to members",
    "summarized_story": "The Director-General of the National Youth Service Corps (NYSC), Brigadier General Shuaibu Ibrahim, has reminded corps members that the Federal Government’s deadline of December 1 for all its employees to get vaccinated against COVID-19 before access to public offices applies to them.\nHe called on the NYSC members to get vaccinated against the deadly pandemic assuring that the vaccines would be made available to them throughout the service year.\nThe NYSC DG asked the corps members to adhere religiously to the COVID-19 safety protocols in order to stay safe.\nShe also called on the corps members to fully participate in camp activities as a way of increasing their knowledge of their fellow countrymen.\nShe urged the corps members to ensure to use their social media presence to spread and promote love rather than fake news."
  },
  {
    "headline": "Workers must not be shortchanged – CAN reacts to El-Rufai’s four-day working week",
    "summarized_story": "The Kaduna State chapter of the Christian Association of Nigeria (CAN) has expressed reservation with the Governor Nasir El-Rufai-led government’s announcement that it will commence transition to a four-day working week for civil servants in the state.\nJohn Joseph Hayab in a statement, “On Monday, 29th November 2021, the Kaduna state government announced that it will commence transition to four-day working week for civil servants in the state.\nHe advised civil servants in the state not to celebrate the policy yet until they are convinced that there is no hidden agenda behind it.\n“Workers must be sure that the policy is not aimed at reducing their salaries,” he advised.\nHe reiterated, “What economic value will this “Greek gift” add to workers?”CAN appealed to members of the Kaduna State House of Assembly to be on the side of the people and distance themselves from unpopular policies that bring pain and hardship."
  },
  {
    "headline": "FG issues new COVID-19 directives to travelers ahead of yuletide",
    "summarized_story": "Ahead of the festive season, the Presidential Steering Committee on COVID-19 has issued fresh directives to travellers coming into the country.\nPassengers arriving in Nigeria are now required to conduct a PCR test, 48 hours before embarking on their trips to the country and another day two and day seven PCR tests on arrival.\nOutbound passengers on their part will be required to either show proof of COVID-19 vaccination or provide a negative PCR test taken 48 hours before departure.\nHe said the committee will ensure that the directives are enforced through suspension of passports of offenders or their prosecution, or both.\n”The slower and delayed vaccination rollout in low and middle-income countries has left many of the citizens vulnerable to COVID-19 variance."
  },
  {
    "headline": "Umahi suspends female council boss for allegedly exposing citizens to security threats",
    "summarized_story": "Governor David Umahi of Ebonyi State has suspended indefinitely, Mrs Rose Nkwuda, the coordinator of Igbeagu Development Centre for allegedly exposing citizens of the area to security threats.\nUmahi, in a statement signed and made available to journalists in Abakaliki through the secretary to the state government, SSG, Dr. Kenneth Ugbala, said the suspension is with immediate effect.\nThe statement reads in part: “Following the directive of the Governor, Chief David Nweze Umahi, the Coordinator of Igbeagu Development Centre, Hon.\nMrs. Rose Nkwuda is to proceed on indefinite suspension with immediate effect.\n“The reason for the suspension is that the Development Centre Coordinator compromised on security issues thus exposing our people to security threats.”The governor however directed the embattled former Coordinator to “handover all government property in her possession to the Secretary to the State Government and Coordinating Commissioner, on or before the close of work today”."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Mambila Power Project: Fashola slams N2b libel suit against Sunrise Power CEO, Adesanya‎",
    "summarized_story": "Adesanya was said to have, in the said publications, accused Fashola of frustrating the completion of the Mambila Power Project and engaging in acts of corruption in relation to the project while serving as Minister of Power, Works and Housing.\nThe Ministers stated that the advertorial publications, caption: Mambilla Power Project: Open letter to Mr. Babatunde Fasola,” and sponsored by Adesanya.\n“amount to nothing less than character assignation, with a view to achieving damaging effects against the claimant (Fashola).\nWhile Adesanya and Thisday are yet to respond to the suit, The Guardian, in its statement of defence, denied any wrongdoing.\nIt argued that the publication referred to by Fashola “is a fair and accurate publication of a rejoinder about issues relating to the management and/or administration of the Mambilla Power Project by the claimant as to the Minster of Power."
  },
  {
    "headline": "Court jails Ondo accoutnant for N7m theft",
    "summarized_story": "An Ondo State High Court has sentenced an Ondo civil servant, Aminu Kamilu, to seven-year imprisonment with hard labour.\nKamilu is an accountant attached to the Ondo State Hospital Management Board.\nJustice Olamide acquitted the second defendant, Azeez Musa, saying the convict single-handedly committed the offence.\n- Advertisement -He ordered the Ondo State government to restore other civil servants indicted in connection to the theft to their former positions.\nJustice Olamide said the sentence would serve as a deterrent to other civil servants who might want to tamper with government money."
  },
  {
    "headline": "BREAKING: Crisis hits Southern, Middle Belt alliance as Banji Akintoye resigns as chair",
    "summarized_story": "In what appears to be a brewing controversy, one of the frontline agitators for an Independent Yoruba Nation, Prof. Banji Akintoye, has resigned as the Chairman of the Nigerian Indigenous Nationalities Alliance for Self-Determination (NINAS).\nIlana Omo Oodua (IOO), the umbrella body of Yoruba Self-Determination Groups, also cut off from the NINAS Alliance with immediate effect.\nHowever, it is now obvious to most people in the Yoruba Self-Determination struggle that the LNC is not working in tandem with our objective in Ilana Omo Oodua.\n“Furthermore, Ilana Omo Oodua hereby withdraw its membership of NINAS with immediate effect.\nAll the Yoruba People Worldwide that believe in the agitation for Yoruba Nation Self-Determination at home and abroad are, by this statement, notified to comply."
  },
  {
    "headline": "Japan urges citizens to leave Ethiopia amid mounting tensions",
    "summarized_story": "Japan Foreign Minister, Yoshimasa Hayashi, called on Japanese citizens in Ethiopia to leave amid arising military tensions, adding that there had been no reports about Japanese casualties so far.\n“It is true that Japan has sent experts from the Foreign Ministry and the Ministry of Defense to assess the situation in Ethiopia and collect data.\nWe urge Japanese citizens to leave this country,” Hayashi said.\nREAD ALSO: Save EthiopiaHe said to date, no data about “physical damage” inflicted on Japanese nationals in Ethiopia had been confirmed.\nThe situation prompted several countries to start evacuating their diplomatic missions from Ethiopia, while the government declared a six-month state of emergency in November."
  },
  {
    "headline": "BREAKING: Gunmen, Army in fire fight in Imo over sit-at-home",
    "summarized_story": "From Stanley Uzoaru, OwerriSuspected gunmen in Mgbidi and Akata areas of Oru West Local Government Area of Imo State in the early hours of Tuesday, engaged the operatives of the Nigerian Army in a gun duel, in a bid to enforce a sit-at-home order.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHowever, a source said they were later confronted by the military who acted on a tip off and responded swiftly to counter their order.\nAs at the time of this report, it was not clear if there was any casualty on both sides.\nAlthough a statement by the spokesperson of the group, Emma Powerful did not order a sit-at-home but urged the people to lockup their shops temporarily during the period of the prayers and open shortly after."
  },
  {
    "headline": "APC crisis worsens as youths ‘sack’ CECPC",
    "summarized_story": "Senator James Akpanudoedehe, national secretary of the party’s Caretaker and Extra-ordinary Convention Planning Committee (CECPC) said this when he spoke with newsmen in Abuja, yesterday.\nLar added that the race for the APC national chairmanship was an open contest, saying the best candidate should be allowed to emerge.\n“This Caretaker Committee has sacked the Buni-led caretaker committee and (it) stands dissolved, disbanded and no longer represent the APC members.\n“However laughable, the criminal attempt of the purported group to usurp the leadership of the President Muhammadu Buhari-led APC now borders on treasonable felony.\nThe national secretary, (South), national legal adviser (North), national treasurer, (South), national financial secretary, national organising secretary (North), national publicity secretary (South) among other positions."
  },
  {
    "headline": "Igbo traders reject new increment in Customs import duty",
    "summarized_story": "From Geoffrey Anyanwu, EnuguSouth East Amalgamated Markets Traders Association (SEAMATA) has rejected the recent “astronomical and indiscriminate” increment in the import duty on cargoes charged by the Nigerian Customs.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nSEAMATA further complained that current import duties were no longer calculated based on invoice value of consignments.\n“The Nigerian Customs on their own, work out payable import duty now based on “estimated” invoice value of consignment as against the actual invoice value of goods from the country of origin.\n“We are appealing to the Honourable Minister of Finance, Budget and National Planning to prevail on the Nigerian Customs to, as a matter of urgency, suspend the exercise."
  },
  {
    "headline": "Ayu seeks stronger opposition party coalition against APC",
    "summarized_story": "From Ndubuisi Orji, AbujaIncoming National Chairman of the Peoples Democratic Party (PDP), Iyorchia Ayu, has stressed the need for a stronger coalition by opposition political parties to rescue the country from alleged misrule of the All Progressives Congress (APC)-led administration.\nAyu stated this when he received a delegation of opposition parties led by the spokesman of the Coalition of United Political Parties (CUPP), Ikenga Ugochinyere, at his residence, yesterday, in Abuja.\nAyu said the APC administration, apart from failing to keep its campaign promises to secure the country among others, has allegedly ruined the country’s economy.\n“Things have gone wrong and it is the responsibility of every political party to point them out and provide alternative ways of tackling them.\nUgochinyere congratulated Ayu on his election as PDP chairman and expressed hopes that his emergence would reposition the opposition coalition in the run-up to the 2023 polls."
  },
  {
    "headline": "Buhari, Kalu, Ayade condole with Maduka, family",
    "summarized_story": "President Muhammadu Buhari, the Chief Whip of the Senate, Dr. Orji Uzor Kalu, and Cross River State Governor, Ben Ayade, have commiserated with the Founder and Chief Executive Officer of Coscharis Group, Cosmas Maduka, over the passing of his wife, Charity.\nCharity, vice chairman of the Coscharis Group, died at about 8.pm on Saturday, November 29 in Umudim-Nkwa, Nnewi, Anambra State.\nMrs Maduka (nee Ikedife of Umuenem, Otolo, Nnewi) played a vital role in the growth of Coscharis – a name coined from her husband’s firs name, ‘Cosmas’, and hers, ‘Charity’.\nKalu encouraged family members of the deceased to uphold her worthy legacies, adding that she impacted humanity through various initiatives.\nHe said the late Mrs Maduka was a wonderful and rare source of wisdom, strength and wit which will be sorely missed by those who knew her."
  },
  {
    "headline": "China Pledges One Billion Additional COVID-19 Vaccines for Nigeria, Other African Countries",
    "summarized_story": "Ghebreyesus noted that the emergence of the Omicron variant underlined how perilous and precarious the situation could be.\nMeanwhile, Ghebreyesus commended South Africa and Botswana for detecting, sequencing, and reporting the Omicron variant.\nIn a statement issued by NCDC Director General, Dr. Ifedayo Adetifa, the centre said, “We are aware of reports of a new COVID-19 variant – the B.1.1.529 lineage.\nThe measures are enforced by the Presidential Steering Committee on COVID-19 (PSC-COVID-19), through the COVID-19 Health Protection Regulations 2021.\nAfter South Africa announced the discovery of the new COVID-19 variant, Omicron, to the World Health Organisation (WHO), some countries banned flights from the African country."
  },
  {
    "headline": "COVID-19: Omicron Variant Yet to Be Detected in Nigeria, Says FG",
    "summarized_story": "•To issue travel guideline todayOlawale Ajimotokan in AbujaAs countries across the world continued to take measures to prevent the spread of the new COVID-19 variant, Omicron, Nigeria yesterday said there was currently no reported detection of the strain in the country.\nNational COVID-19 Incident Manager, Dr. Mukhtar Muhammad, stated this position yesterday in Abuja at a media briefing organised by the Presidential Steering Committee (PSC) on COVID-19.\nWe have taken far-reaching proactive measures to minimise and mitigate this possibility.”The discovery last week by South Africa and Botswana of the more infectious variant of COVID-19 elicited global concern.\nHe said this was one of the factors fuelling COVID-19 and the emergence of variants of concern, including Omicron.\nMustapha stated, “As the DG WHO has just stated today, the emergence of the highly-mutated Omicron variant underlines just how perilous and precarious our situation is."
  },
  {
    "headline": "Breaking: Canada Says Two Cases of COVID-19 Omicron Variant Have Nigeria Travel History",
    "summarized_story": "Onyebuchi Ezigbo in Abuja with Agency reportsCanada said it has confirmed two cases of COVID-19 omicron variant from persons who had recently travelled from Nigeria.\nAccording to report by Associated Press, the government of Canada had announced the detection of the new COVID19 variant in a statement issued on Sunday.\n“Today, the province of Ontario has confirmed two cases of the omicron variant of COVID-19 in Ottawa, both of which were reported in individuals with recent travel from Nigeria.\nBut the federal government through the Nigeria Centre for Disease Control (NCDC) has said that the deadly omicron variant of the coronavirus was yet to be detected in the country.\nA statement issued on Sunday by its Director General, Dr. Ifedayo Adetifa however urged Nigerians to go and get vaccinated and also to adhere strictly to COVID19 health Advisory as a means of avioding any spread of more deadly COVID-19 variant."
  },
  {
    "headline": "Omicron COVID-19: Nigeria Stands with S’Africa, Warns West against Discrimination",
    "summarized_story": "The Nigerian government warned Western countries against discrimination against South Africa following travel restrictions imposed on Southern African countries in the aftermath of the new virus discovery.\nEhanire insisted that the move by Western countries to ban or try to isolate South Africa was discriminatory.\nEhanire stated, “Therefore, the world should wait for that time, than to be enmeshed in heavy discrimination against South Africa.\nThe federal government would open its doors to Ramaphosa and others who are coming from South Africa until science says otherwise.\nForeign nationals traveling from South Africa, Botswana, Namibia, Zimbabwe, Lesotho, Eswatini, Malawi and Mozambique were banned from entering South Korea, the agency said."
  },
  {
    "headline": "NDIC to Adopt Risk-based Approach in Determining Banks’ Premium",
    "summarized_story": "*Says in event of banks’ failure, 97% depositors would be coveredUgo AliogoThe Nigeria Deposit Insurance Corporation (NDIC) said it was reviewing its approach for determining the premium by banks to its Deposit Insurance Fund (DIF), with a view to adopting a risk-based approach.\nThe NDIC, in calculating premiums from deposit money banks, usually chose between adopting a flat-rate premium or a system that sought to differentiate premiums on the basis of individual-bank risk profiles.\nA flat-rate premium system has the advantage of being relatively easy to understand and administer.\nAlso, it allows the strong banks to subsidise the weak ones for the stability of the financial system.\nFor instance, in 2016, 2017, 2018 and 2019, the total number of accounts in the deposit money banks stood at 83 million; 99.1million; 112 million and 128.4 million respectively."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Governor Stops Construction Project Over Rift With Senator, Puts Residents At Risk Of Floods",
    "summarized_story": "Party leaders in the state have also been unable to settle the rift between both politicians, it was gathered.\n\"Governor Bagudu is desperate to go to the Senate when his tenure as chief executive officer of Kebbi State expires in May 2023.\n\"We have suffered a lot; this construction was meant to help lessen that problem until this new development.\nBagudu has been governor of Kebbi since 2015 after first serving as a senator from 2011 to 2015.\nThe governor later gained immunity against such after becoming Kebbi governor in 2015."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Governor Stops Construction Project Over Rift With Senator, Puts Residents At Risk Of Floods",
    "summarized_story": "Party leaders in the state have also been unable to settle the rift between both politicians, it was gathered.\n\"Governor Bagudu is desperate to go to the Senate when his tenure as chief executive officer of Kebbi State expires in May 2023.\n\"We have suffered a lot; this construction was meant to help lessen that problem until this new development.\nBagudu has been governor of Kebbi since 2015 after first serving as a senator from 2011 to 2015.\nThe governor later gained immunity against such after becoming Kebbi governor in 2015."
  },
  {
    "headline": "BREAKING: Residents Flee As Boko Haram Terrorists Launch Fresh Attack On Borno Community",
    "summarized_story": "Early reports indicate that the insurgents stormed the community Monday morning, shooting heavy artillery.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "BREAKING: Residents Flee As Boko Haram Terrorists Launch Fresh Attack On Borno Community",
    "summarized_story": "Early reports indicate that the insurgents stormed the community Monday morning, shooting heavy artillery.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "Crisis Hits Southern, Middle Belt Alliance As Yoruba Self-Determination Leader, Prof Akintoye Quits, Forms New Group",
    "summarized_story": "The Chairman of the Nigerian Indigenous Nationalities Alliance for Self-Determination (NINAS), Prof Banji Akintoye, has quit his position in the group.\n“Also, Ilana Omo Oodua (IOO), the umbrella body of Yoruba Self-Determination Groups, has moved out of the NINAS Alliance with immediate effect.\nHowever, it is now obvious to most people in the Yoruba Self-Determination struggle that the LNC is not working in tandem with our objective in Ilana Omo Oodua.\n\"Furthermore, Ilana Omo Oodua hereby withdraws its membership of NINAS with immediate effect.\nAll the Yoruba people worldwide that believe in the agitation for Yoruba Nation self-determination at home and abroad are, by this statement, notified to comply."
  },
  {
    "headline": "257 projects worth N20bn duplicated in 2021 budget, says ICPC",
    "summarized_story": "Bolaji Owasanoye, chairman of the Independent Corrupt Practices and Other Related Offences Commission (ICPC), says 257 projects amounting to N20.138 billion were duplicated in the 2021 budget.\nHe said during the exercise, the ICPC forced 67 contractors back to site and ensured completion of 966 projects worth N310 billion some of which were hitherto abandoned.\n“Our findings indicate that the same malady of corruption afflicts executive as well as zip projects thus undermining government projections, escalating the cost of governance and denying Nigeria value for money,” Owasanoye said.\n“Other challenges relate to duplication of projects in the budget.\nICPC review found that 257 projects amounting to N20.138bn were duplicated in the 2021 budget leading us to submit an advisory to the Honourable minister of finance which was promptly actioned by the minister to prevent abuse.”"
  },
  {
    "headline": "257 projects worth N20bn duplicated in 2021 budget, says ICPC",
    "summarized_story": "Bolaji Owasanoye, chairman of the Independent Corrupt Practices and Other Related Offences Commission (ICPC), says 257 projects amounting to N20.138 billion were duplicated in the 2021 budget.\nHe said during the exercise, the ICPC forced 67 contractors back to site and ensured completion of 966 projects worth N310 billion some of which were hitherto abandoned.\n“Our findings indicate that the same malady of corruption afflicts executive as well as zip projects thus undermining government projections, escalating the cost of governance and denying Nigeria value for money,” Owasanoye said.\n“Other challenges relate to duplication of projects in the budget.\nICPC review found that 257 projects amounting to N20.138bn were duplicated in the 2021 budget leading us to submit an advisory to the Honourable minister of finance which was promptly actioned by the minister to prevent abuse.”"
  },
  {
    "headline": "ICPC: Labour ministry, UCH Ibadan involved in recruitment scam",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) says the ministry of labour and the University College Hospital Ibadan are involved in illegal recruitment.\nAdvertisementBolaji Owasanoye, ICPC chairman, said this on Monday while speaking at the third national summit on diminishing corruption in the public service.\nOwasanoye said an investigation carried out by the ICPC revealed that several MDAs are involved in illegal recruitment which reflects in the huge wage bill on personnel and operational costs standing at about 70 percent of the annual budget.\nAdvertisement“ICPC investigation of some cases of illegal recruitment forwarded to us by the head of the civil service of the federation has so far implicated ministry of labour and the University College Hospital Ibadan and a number of corrupt staff of other MDAs at a lower level.\nThis abuse of power is consummated with complicity of compromised elements in IPPIS."
  },
  {
    "headline": "ICPC: Labour ministry, UCH Ibadan involved in recruitment scam",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) says the ministry of labour and the University College Hospital Ibadan are involved in illegal recruitment.\nAdvertisementBolaji Owasanoye, ICPC chairman, said this on Monday while speaking at the third national summit on diminishing corruption in the public service.\nOwasanoye said an investigation carried out by the ICPC revealed that several MDAs are involved in illegal recruitment which reflects in the huge wage bill on personnel and operational costs standing at about 70 percent of the annual budget.\nAdvertisement“ICPC investigation of some cases of illegal recruitment forwarded to us by the head of the civil service of the federation has so far implicated ministry of labour and the University College Hospital Ibadan and a number of corrupt staff of other MDAs at a lower level.\nThis abuse of power is consummated with complicity of compromised elements in IPPIS."
  },
  {
    "headline": "DMO: Borrowing helped Nigeria recover from economic shocks",
    "summarized_story": "Patience Oniha, director-general of the Debt Management Office (DMO), says federal government relied on debt to finance over 90 percent of budget deficits.\nAccording to the DMO DG, public debt was instrumental in helping Nigeria bounce back from the recession caused by economic shocks, which put a strain on the country’s revenue.\nShe added that government understands the need for caution when borrowing, especially with mounting public debt and rapidly increasing debt service obligations.\nAdvertisement“It is true that the public debt has been growing.\nHe, however, said that effective debt management that emphasises transparency, due process, and fiscal discipline can precipitate a turnaround in the economy."
  },
  {
    "headline": "Are Ugandan telcos equipped to protect user data?",
    "summarized_story": "Law in actionUganda implemented its first codified legislation on data protection, the Data Protection, and Privacy Act, in 2019.\nSince its implementation, Uganda’s core data privacy act has proven to be an effective regulator, to some extent.\nThe regulation was meant to tackle fraud and crime, but, in the hands of telcos with suboptimal data privacy frameworks, it offered new capabilities for exploitation.\nFacebook has also been in and out of courts in the US and UK over data privacy issues, since 2018.\nAs Uganda’s tech industry continues to develop, it too will have to contend with the benefits and costs of tech development."
  },
  {
    "headline": "African female founders need access to high-impact mentors",
    "summarized_story": "Beyond funding, African female entrepreneurs need access to high-impact mentors and who are willing to open up their network and teach what they know.\nWhile FirstCheck argues that African women in tech are “over-mentored” and “under-funded”, early-stage female founders need some handholding.\nSo Ouffata founded The African Tech Vision (ATV) to create and open up entrepreneurial pathways for ambitious African female founders and executive leaders.\nEmpowering African female entrepreneurs at scaleThe African Tech Vision is a free entrepreneurial programme designed to support early-stage African female founders and help them achieve their goals.\nFor Ouffata, betting on African female founders is a personal decision that fits into the larger vision of The African Tech Vision program."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "About Parag Agrawal, Twitter’s new boss, and NFTs simplified",
    "summarized_story": "Jack Dorsey is no longer Twitter CEO, a company he co-founded in 2006 and has held a role in for 15 years.\nHe is now replaced by the CTO, Parag Agrawal (pictured in featured image).\nFun fact: Based on 2020 values, Jack owns 2% of Twitter, making up $849M of his $12,3B total net worth.\nAnother fun fact: Parag Agrawal was among 4 Twitter executives who visited Nigeria with Jack Dorsey in 2019.\nAn alumnus of the Indian Institute of Technology, Bombay, and Stanford University, Parag was instrumental in Twitter’s foray into AI and Machine Learning."
  },
  {
    "headline": "Fintech predictions, Sabi’s $6 million raise, Nigeria’s cooking gas woes, Sanicle’s $160k funding",
    "summarized_story": "Nigeria’s cooking gas woesIf you are like me and have contemplated using firewood as an alternative to cooking gas in the last few weeks, then some of these statistics might not surprise you.\nIn October 2021, the average price of 12.5kg cooking gas in Nigeria increased by 62.76% compared to October 2020.\nThe graph above shows the increase in the price of cooking gas since November 2019.\nTo see the top ten states by average cost of cooking gas as of October 2021, kindly follow this link.\nTake a listenDakuku Peterside has some thoughts on Nigeria’s rising cooking gas prices."
  },
  {
    "headline": "The next frontier for fintech: Disruptive business models",
    "summarized_story": "Africa’s fintech industry is one of the largest and probably the most advanced.\n“We would see more fintech companies, funding more fintech companies.\nCurrently, the fintech industry is very API and cloud computing driven.\nHowever, Olowe and Hassan believe that rather than disruptive technologies, it would be a more disruptive business model.\nCiting companies like Inflow Finance and Sproutly Nigeria, Hassan says infrastructure like Mono’s would be the base of novel business models."
  },
  {
    "headline": "BusinessDay invites Nigeria’s fast-growing companies to apply for Africa ranking",
    "summarized_story": "The Financial Times (FT) and Statista are currently inviting companies based in Africa to register for recognition in the inaugural ranking of Africa’s Fastest Growing Companies.\nRead also: Nigerian fintechs walk tight rope after record fundingIn addition, African fintech companies have attracted significant attention from investors in recent times.\nInterestingly, the amount African fintech firms raised between January and September 2021 was higher than $1.06 billion raised between 2011 and 2020 by 35.8 percent.\nThis means African fintech companies in nine months in 2021, surpassed a decade of their fundraising records.\nThe proposed fastest African companies’ report, when completed, will showcase the firms responsible for driving economic growth, supporting job creation and poverty alleviation in many African countries."
  },
  {
    "headline": "MTN to give investors 1 share for every 20 bought",
    "summarized_story": "MTN Group will give retail investors one share for every 20 shares they buy and hold for at least 12 months during a share sale this week, according to Karl Toriola, the chief executive officer of the Nigerian unit.\nInstitutional investors had the first opportunity to participate in the share sale where 10 percent of the 575 million shares on offer.\nThis week will be the turn of retail investors who have a chance to get one share for every 20 shares they buy.\nThis implies that investors would be getting a five percent bonus on every 20 shares up to the set limit.\nMTN Nigeria closed at N190 per share Monday, according to data from the NGX."
  },
  {
    "headline": "CNG can save Nigeria N3trn, but infrastructure lacking",
    "summarized_story": "Switching from petrol to Compressed Natural Gas (CNG) can save Nigeria as much as N3 trillion yearly but this requires a political will to fix the teething problems facing the country’s domestic gas sector, experts have said.\nThe world is turning away from petrol to CNG as an alternative energy source because it is cheaper and burns cleaner.\nExperts say converting from petrol to Natural Gas Vehicles (NGV), a campaign Egypt has taken head-on and making progress with, is a necessity that can reduce Nigeria’s exposure to the wasteful subsidy regime.\nNigeria spent a combined total of N905.27billion to keep the pump price of petrol at N145 per litre as of August 2021.\nBut without subsidies, CNG per cubic metre costs between N100 and N110 per standard cubic meter (the equivalent of a litre)."
  },
  {
    "headline": "Edo govt issues contravention, demand notices to owners of illegally converted buildings – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo Government on Monday issued contravention and demand notices to owners of properties that have been illegally converted to commercial use in the Benin metropolis.\nThe Commissioner for Physical Planning and Urban Development, Isoken Omo, while addressing journalists in Benin City, urged the property owners to regularise their approvals immediately or risk their properties being sealed off.\nShe said the development is aimed at bringing sanity to the Benin metropolis in line with the 30-year development plan of the Governor Godwin Obaseki-led administration.\nOmo said that the ministry served contravention and demand notices on property owners in the affected areas, decrying the spate of conversion of residential buildings to business facilities.\nShe disclosed that such acts have an impact on the planning, infrastructure, social life, and well-being of the affected areas."
  },
  {
    "headline": "Obaseki mobilizes contractors to begin construction of failed portions of Benin-Sapele Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, assured residents along the Benin-Sapele Road axis that the government will immediately begin rehabilitation work on the road, starting from the popular RCC to Ogheghe junction.\nThe governor, who visited the area, said his administration is aware of their plights and will mobilize contractors to the site to commence rehabilitation work on the failed portions of the road.\nI will immediately mobilize contractors to commence work here.\n“I will mobilize two contractors to the site and they will start rehabilitation of the road from RCC.\nWe hope to see the rehabilitation of the road commence as promised.”..."
  },
  {
    "headline": "Obaseki’s drive to transform Edo into an agric hub in line with SDGs – Alufohai – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Focal Person of the Edo State Sustainable Development Goals (SDGs) Office, Mrs. Eire Ifueko Alufohai, has said Governor Godwin Obaseki’s vision to Make Edo Great Again (MEGA) is part of the plans to expedite the realization of the Sustainable Development Goals (SDGs) and place the state on the path to actualizing the goals by 2030.\nShe noted, “Pillar five in the MEGA vision of Governor Obaseki is about making Edo State the agribusiness hub in Nigeria, ensuring food sufficiency for production and industrial raw materials.\nI tell you that this is in line with the SDGs zero hunger, which is goal two.\nThe MEGA pillar five does not only aim at this, but it also aims at processing industrial raw materials.\nThis is to strengthen the means of implementation and revitalize the global partnership for sustainable development."
  },
  {
    "headline": "Insecurity: FG making frantic efforts to tackle security challenges- Omo-Agege – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Deputy President of the Senate, Sen. Ovie Omo-Agege, has appealed to Nigerians to be patient, saying the Federal Government is making frantic efforts to tackle security challenges in the country.\nOmo-Agege (Delta Central-APC) made the appeal on Monday at the 90th Anniversary of the Urhobo Progress Union (UPU) Worldwide.\nThe event was held at the UPU’s Secretariat in Uvwiamughe Community, Agbarho, Ughelli North Local Government area of Delta.\nHe urged the Urhobo sons and daughters, particularly the youth to play their parts in the quest for the socioeconomic and political advancement of the Urhoboland.\nEarlier, the President-General of UPU, Mr Moses Taiga, said that the organisation started as Urhobo Brotherly Society in 1931."
  },
  {
    "headline": "Parag Agrawal replaces Jack Dorsey as Twitter CEO",
    "summarized_story": "OBINNA EZUGWUParag Agrawal is an Indian-American technology expert, on Monday become the new Chief Executive Officer of tech giant, Twitter.\nThis follows the decision of Twitter CEO Jack Dorsey to down as chief of the social media company, effective immediately.\nDorsey, 45, was serving as both the CEO of Twitter and Square, his digital payments company.\nSinger called for Dorsey to step down as CEO of one of them before the investment firm reached a deal with Twitter’s management.\nTwitter shares have jumped 85% since Dorsey took over as CEO on Oct 5."
  },
  {
    "headline": "First Bank holds non-oil export webinar series, creates awareness on its export solutions",
    "summarized_story": "First Bank of Nigeria Limited, Nigeria’s premier financial inclusion services provider, has announced the convening of its non-oil export webinar series.\nThe Event is centered on deliberating opportunities that will enhance the country’s expansion of its drive towards diversifying the national economy, thereby reducing the reliance of oil as a mainstay of the country’s revenue.\nThe first series of the virtual event is scheduled for 10am on Tuesday, 30th November 2021 via Zoom meeting.\nThe webinar series aims to facilitate sustainable exports as well as guide participants on ways of navigating the hurdles and challenges of exports in Nigeria.\nThe webinar will explore market and economic trends, unique export opportunities and potentials within the non-oil export industry across the geopolitical zones in the country."
  },
  {
    "headline": "Battle for non-interest banking hots up",
    "summarized_story": "TAJ Bank was also given a licence by the CBN in 2019 to operate non-interest banking under the Islamic banking principles, seven years after Jaiz started operations.\nThough, Jaiz and TAJ started first as non-interest banks, Lotus Capital, owned by the Adeolas, was the pioneer of non-interest finance in Nigeria.\n“Non-Interest Banking is geared towards supporting the real sector and LOTUS Bank aims to improve financial inclusion in the country.\nIn addition, the bank will operate transparent pricing models as is the norm in non-interest banking”, Tooki said.\n“With evolving digital solutions and a millennial generation coming into centre-stage, LOTUS Bank is bringing onboard innovative and comprehensive non-interest compliant financial solutions in investment banking, consumer banking, asset management, private banking, and wealth management."
  },
  {
    "headline": "Mkpuru Mmiri: havoc in South East",
    "summarized_story": "“A lot of people are taking Mkpuru Mmiri, but it’s those it is already having effects on their bodies that you easily tell.\nBut drug problem is often hardly tractable.\nUntil recently, drug abuse in the country was thought to be mostly a Northern problem, even if the South was not immune from it.\nDrug abuse is prevalent, too, among the rich, perhaps even worse, observers say.\nDrug addiction and drug abuse have been an issue for Nigerian youths for a very long time."
  },
  {
    "headline": "BREAKING: Court Sacks APC Exco Loyal To Ganduje",
    "summarized_story": "A Federal Capital Territory (FCT) High Court presided over by Justice Hamza Muazu, has sacked the executive committee of All Progressives Congress (APC) in Kano State loyal to Governor Abdullahi Ganduje.\nDelivering the ruling on Tuesday, the judge granted the reliefs sought by the Senator Ibrahim Shekarau faction of the party, seeking a declaration that the Ganduje faction under the chairmanship of Abdullahi Abbas, did not conduct party’s ward and local government congresses.\nThe court affirmed the legitimacy of the Shekarau faction of the exco led by Ahmadu Haruna Zago.\nADVERTISEMENTDetails Later…"
  },
  {
    "headline": "BREAKING: Court Sacks APC Exco Loyal To Ganduje",
    "summarized_story": "A Federal Capital Territory (FCT) High Court presided over by Justice Hamza Muazu, has sacked the executive committee of All Progressives Congress (APC) in Kano State loyal to Governor Abdullahi Ganduje.\nDelivering the ruling on Tuesday, the judge granted the reliefs sought by the Senator Ibrahim Shekarau faction of the party, seeking a declaration that the Ganduje faction under the chairmanship of Abdullahi Abbas, did not conduct party’s ward and local government congresses.\nThe court affirmed the legitimacy of the Shekarau faction of the exco led by Ahmadu Haruna Zago.\nADVERTISEMENTDetails Later…"
  },
  {
    "headline": "COVID-19: Rotary Club Laments Vaccine Apathy Among Nigerians",
    "summarized_story": "The Rotary Club International has lamented vaccine apathy among Nigerians and called on the government to use persuasion rather than dishing out ultimatums.\n“We are here at Jabi, Daki Biyu, Agwan Lambo with National Primary Healthcare Development Agency to create awareness and to give the COVID-19 vaccination.\nI also visited the Jabi Mall and Silverbird center at Wuse and there is still alot of resistance as regards COVID-19 vaccination.\nThere is alot of miscommunication about what the vaccine is about, whether COVID-19 is real,” she said.\n“They don’t believe COVID-19 is real, they don’t trust what the government says."
  },
  {
    "headline": "COVID-19: Rotary Club Laments Vaccine Apathy Among Nigerians",
    "summarized_story": "The Rotary Club International has lamented vaccine apathy among Nigerians and called on the government to use persuasion rather than dishing out ultimatums.\n“We are here at Jabi, Daki Biyu, Agwan Lambo with National Primary Healthcare Development Agency to create awareness and to give the COVID-19 vaccination.\nI also visited the Jabi Mall and Silverbird center at Wuse and there is still alot of resistance as regards COVID-19 vaccination.\nThere is alot of miscommunication about what the vaccine is about, whether COVID-19 is real,” she said.\n“They don’t believe COVID-19 is real, they don’t trust what the government says."
  },
  {
    "headline": "Transportation, Panacea For Realising AfCFTA Objectives – Amaechi",
    "summarized_story": "Minister of Transportation, Rotimi Amaechi, said the transportation sector was key to realising the major objectives of the African Continental Free Trade Area (AfCFTA).\nAmaechi, while reiterating the commitment of President Muhammadu Buhari-led administration towards providing efficient transport system in the country, said the government was embarking on huge transport infrastructure investment across the country.\nAccording to him, “The transportation Sector is blessed with myriad of potentials and opportunities for development.\nAccording to him, “Transport infrastructure is widely seen as an enabling industry that facilitates national, regional and international integration and trade.\n”Therefore, there is urgent need for massive investment in connectivity and transportation infrastructure, because transportation is the link between all the factors of production.”"
  },
  {
    "headline": "Things to know about Parag Agrawal, new Twitter CEO",
    "summarized_story": "Twitter co-founder Jack Dorsey announced on Monday that he had resigned as CEO effective immediately.\nHe also announced Parag Agrawal as his replacement.\nWith Twitter still suspended in Nigeria, below are things you should know about the new Twitter boss who will be ensuring the platform gets up and running soon in Africa’s most populous country.\nHe joined Twitter in October 2011 as an ads engineer and soon after held the title of the company’s ‘distinguished software engineer’.\nAgrawal was also previously tasked with finding a leader for Project Bluesky, a research project Twitter launched to establish open and decentralised standards for social media platforms."
  },
  {
    "headline": "Things to know about Parag Agrawal, new Twitter CEO",
    "summarized_story": "Twitter co-founder Jack Dorsey announced on Monday that he had resigned as CEO effective immediately.\nHe also announced Parag Agrawal as his replacement.\nWith Twitter still suspended in Nigeria, below are things you should know about the new Twitter boss who will be ensuring the platform gets up and running soon in Africa’s most populous country.\nHe joined Twitter in October 2011 as an ads engineer and soon after held the title of the company’s ‘distinguished software engineer’.\nAgrawal was also previously tasked with finding a leader for Project Bluesky, a research project Twitter launched to establish open and decentralised standards for social media platforms."
  },
  {
    "headline": "PFN to FG: N5,000 grant for ‘poor’ Nigerians’ll promote corruption",
    "summarized_story": "The Pentecostal Fellowship of Nigeria has told the Federal Government that the proposed N5,000 grant to poor Nigerians will promote corruption in the country.\nThe President of PFN, Bishop Wale Oke, stated that most of the so-called poor Nigerians do not have phones or bank accounts and may not benefit from the grant.\nThe Minister of Finance, Budget and National Planning, Zainab Ahmed, recently said that the Federal Government would give a transport grant of N5,000 each to between 30 million and 40 million poor Nigerians for a duration of 12 months, as a replacement for the proposed removal of fuel subsidy.\nHe further urged the government to shelve the proposed policy in order not to worsen people’s hardship and trigger a crisis in the country.\n“Again, the planned introduction of N5,000 for 40 million poor Nigerians is to create a cesspool of corruption."
  },
  {
    "headline": "PFN to FG: N5,000 grant for ‘poor’ Nigerians’ll promote corruption",
    "summarized_story": "The Pentecostal Fellowship of Nigeria has told the Federal Government that the proposed N5,000 grant to poor Nigerians will promote corruption in the country.\nThe President of PFN, Bishop Wale Oke, stated that most of the so-called poor Nigerians do not have phones or bank accounts and may not benefit from the grant.\nThe Minister of Finance, Budget and National Planning, Zainab Ahmed, recently said that the Federal Government would give a transport grant of N5,000 each to between 30 million and 40 million poor Nigerians for a duration of 12 months, as a replacement for the proposed removal of fuel subsidy.\nHe further urged the government to shelve the proposed policy in order not to worsen people’s hardship and trigger a crisis in the country.\n“Again, the planned introduction of N5,000 for 40 million poor Nigerians is to create a cesspool of corruption."
  },
  {
    "headline": "Akintoye, 44 leaders of Ilana Omo Oodua pull out of NINAS",
    "summarized_story": "Also, Ilana Omo Oodua (IOO), the umbrella body of Yoruba Self-Determination Groups, has moved out of the NINAS Alliance with immediate effect.\n“Furthermore, Ilana Omo Oodua hereby withdraw its membership of NINAS with immediate effect.\nProf. Banji Akintoye – Alana of Ilana Omo Oodua Worldwide.\nOmo Oba Kazeem Onikeke – Oyo State Coordinator, Ilana Omo Oodua Worldwide12.\nFemi Oluwajuyitan – Ilana Omo Oodua New Media Unit41."
  },
  {
    "headline": "Ecobank Nigeria to sustain SMEs support",
    "summarized_story": "Managing Director/Regional Executive, Ecobank Nigeria, Patrick Akinwuntan has said the bank will continue to support Small and Medium Enterprises (SMEs), take banking to every Nigerian through its agency banking network.\nThe bank’s digital services will also support industries that focus on exports such as agriculture and manufacturing in 2022.\nAs the country increases its exports, it will improve foreign exchange earnings, widen employment base, further support industries and a more stable Gross Domestic Product (GDP)” he advised.\nMr. Akinwuntan also called for a more stable environment devoid of insecurity as a prelude to ensuring an improved production and return Nigeria back from a consuming nation.\nStating that a steady growth of employable youths is critical for Nigeria’s economy to improve her production level."
  },
  {
    "headline": "EFCC Arraigns Popular Lawmaker Over Fake Seminar",
    "summarized_story": "Economic and Financial Crimes Commission (EFCC), has arraigned on Tuesday the Speaker, Ondo State House of Assembly, Bamidele Oleyelogun, over financial misconduct.\nAccording to Daily Independent, the legislator is being arraigned for alleged N2.4million fake seminar under his watch.\nIroju Ogundeji, the deputy speaker of the Assembly who was controversially removed, of collecting and sharing some money for a seminar in Lagos which they never attended.\nOgundeji had written EFCC to probe the fund allegedly received and shared by the speaker and others for a bogus seminar in Lagos State.\nBut operatives of the Olokuta Correctional Centre prevented journalists who were on ground to cover the court proceedings from gaining entry into the court."
  },
  {
    "headline": "Gunmen, Nigerian Army Exchange Fire In Imo Over Sit-At-Home Order",
    "summarized_story": "At Mgbidi and Akata in the Oru West Local Government Area of Imo State, Nigerian Army soldiers and some militants are engaged in a fierce shootout.\nAccording to The Sun, the gunfight began at 6 a.m. on Tuesday, when gunmen enforcing the Indigenous People of Biafra (IPOB)’s partial lockdown order barricaded the roads and ordered people to return to their homes.\nHowever, according to the source, they were later met by the military, who retaliated quickly to their command.\nIt is unclear whether there were any casualties on both sides at the time of this report.\nAlthough a statement from the group’s spokesperson, Emma Powerful, did not order a sit-in, it did encourage people to close their shops for the duration of the prayers and reopen shortly afterward."
  },
  {
    "headline": "Nigerian Civil Servants, Families Rush To Hospitals For COVID-19 Vaccines Ahead Of December 1 Deadline",
    "summarized_story": "“So far, we have been able to vaccinate dozens of civil servants and their family members with the Astrazeneca and Modena today.\nAlso, we have been able to administer the second round of the COVID-19 vaccine to many people today.\nSo, I don’t think if you will get the exact number of civil servants that have been vaccinated against COVID-19,” he said.\nGovernment must deploy all the resources it has to ensure that all Nigerians are vaccinated not only civil servants.\nThe civil servants are a fraction of the over 200m people in the country."
  },
  {
    "headline": "What I Told Kanu In DSS Custody Today —Orji Kalu",
    "summarized_story": "The Chief Whip of the Senate, Orji Uzor Kalu, said he visited the leader of the proscribed Indigenous Peoples of Biafra, Nnamdi Kanu, in the custody of the Department of State Services on Monday afternoon.\nKalu, in a statement personally signed by him and made available to our correspondent in Abuja, said the IPOB leader was in good health and under proper care.\nKalu said, “This afternoon, I visited my brother, Maazi Nnamdi Kanu in DSS custody, Abuja.\n“I met him in good health and care and we discussed as ‘Umunne’.\n“Even though my ideology and his ideology are totally different, God has made us brothers and we can’t run away from each other."
  },
  {
    "headline": "Factional APC caretaker c’ttee impostors – Akpanudoedehe",
    "summarized_story": "He said a zoning formula for positions in the new National Working Committee is expected to emerge at a national convention slated for February 26, 2022.\n“As widely reported, the successful meeting between the APC leadership, Progressive Governors’ Forum and the President produced February 2022 as the timeframe for the party’s National Convention.\nSo, we suggest that the APC governors, the president and the party should call a NEC meeting to rectify that February 2022 suggestion for the party’s national convention.\nIt is only the party’s NEC that can take such decision as regards when its national convention will hold.\nAt what point did they start zoning that they are talking about zoning the party’s national championship position to the North Central?"
  },
  {
    "headline": "Ignore Igbo elders’ request for Nnamdi Kanu’s release, NEF tells Buhari",
    "summarized_story": "The Northern Elders Forum (NEF) has asked President Muhammadu Buhari to ignore the request of Igbo elders to terminate the trial of Nnamdi Kanu and release him unconditionally.\nIn a statement made available to Blueprint in Abuja Monday and signed by NEF’s Director, Publicity and Advocacy, Dr Hakeem Baba-Ahmed, the forum said Buhari would be interfering in the judicial process should he consider the request of the Igbo elders.\nIt reads: “Northern Elders Forum has carefully studied the request of Igbo Elders for President Muhammadu Buhari to terminate the trial of Nnamdi Kanu and release him unconditionally.\nIt has also noted President Buhari’s response which both raised very weighty issues related to the request, and his commitment to consider it.\n“Increase in the price of fuel in particular will compound the already desperate condition of living of most Nigerians."
  },
  {
    "headline": "Breaking: Again, Lionel Messi beats Lewandowski, others, wins Ballon d’Or *Full results",
    "summarized_story": "Paris St-Germain and Argentina forward Lionel Messi won the Ballon d’Or – awarded to the best footballer of the year – for a record seventh time.\nThe Ballon d’Or is voted for by 180 journalists from around the world, although there was no award in 2020 because of the coronavirus pandemic.\nEither Messi or Cristiano Ronaldo (five wins) collected the award every year from 2008 to 2019, apart from in 2018 when Croatia midfielder Luka Modric won it.\nMessi had already won the trophy more times than any other player and his seventh success comes after wins in 2009, 2010, 2011, 2012, 2015 and 2019.\nFourteen of the 30 players shortlisted for the Ballon d’Or currently play in the Premier League."
  },
  {
    "headline": "FG Condemns Murder Of Policemen, Says Perpetrators Will Face Justice",
    "summarized_story": "The Federal Government has condemned the recent murder of two policemen in the South-East, warning that those who carried out the killings will be apprehended and brought to justice.\nLai Mohammed, the Minister of Information and Culture, gave the assurance during a press conference in Lagos on Monday.\nREAD ALSO: Subsidy Removal Has To Happen For Nigeria’s Economy To Stand – Muda Yusuf“We have credible information that ASP Francis Idoko (AP No.\nThe Minister wondered why those calling for a political solution to the IPOB issue have yet to condemn the appalling murder of serving police officers.\nMohammed condoled with the families of the slain officers, praying that God will comfort and strengthen them."
  },
  {
    "headline": "Nigeria, South Africa Will Partner To Promote Africa’s Development Interest – Onyeama",
    "summarized_story": "The Nigerian government has reassured the Republic of South Africa that it will continue to strengthen bilateral ties and work together to promote Africa’s development.\nOnyeama said both countries have common interests which must be used to move Africa forward.\n“Nigeria’s and South Africa’s bilateral interests must go beyond trade level to that of influencing Africa’s position at the multinational level, where both countries seek the progress of the African continent.\n“We have no doubt that if Nigeria and South Africa come together, work together, it would be for the benefit of the whole of Africa.\nIt is our belief that Nigerian and South Africa are critical to Africa’s developmental progress,” she said."
  },
  {
    "headline": "Subsidy Removal Has To Happen For Nigeria’s Economy To Stand – Muda Yusuf",
    "summarized_story": "Former Director-General of the Lagos State Chamber of Commerce and Industry, Muda Yusuf, has backed the removal of fuel subsidy, saying the move is necessary for the nation’s economy to stand.\nLast week, the Minister of Finance, Budget and National Planning, Zainab Ahmed, had announced that the government would remove fuel subsidy and replace it with a monthly N5,000 transport stipend to about 40 million poor Nigerians.\nSpeaking during an interview on Channels Television’s Sunrise Daily, Yusuf condemned a situation, whereby the Federal Government spends N3 trillion annually on fuel subsidies.\nREAD ALSO: Governor Ayade Suspends 2021 Calabar Carnival“For this economy to continue to stand, this is something that has to happen.\nWhile noting that the new government’s policy would not be easy on Nigerians, the former LCCI boss said the subsidy removal would have a lot of social implications."
  },
  {
    "headline": "FG Maintains No Record Of Omicron Variant In Nigeria Yet",
    "summarized_story": "﻿The Federal Government on Monday insisted Nigeria is yet to record a case of the Omicron variant of the COVID-19, despite Canadian authorities’ claims that two passengers from Nigeria had tested positive.\nAnd what we know, for now, is that we do not have a case in Nigeria at the moment.\nShadow of Omicron“The emergence of the highly-mutated Omicron variant underlines just how perilous and precarious our situation is,” Tedros told world leaders at the start of the three-day gathering.\nA progress report will be presented at the regular World Health Assembly annual gathering in 2023, with the final outcome presented for consideration at the 2024 WHA.\nSwiss Health Minister Alain Berset said the world needed to take immediate, bold action, as he called for a legally-binding instrument."
  },
  {
    "headline": "Judiciary Will Not Rest Until Corruption Is Stamped Out Of Nigeria – CJN",
    "summarized_story": "The Chief Justice of Nigeria, Tanko Mohammed has vowed that the judiciary would not rest on its oars until corruption is stamped out of the country.\nThe CJN said this on Tuesday during the third National Summit on diminishing Corruption in the Public Sector in Abuja.\nAccording to him, between 2020/2021, over 756 corrupt cases were handled in the country.\nHe also added that from January to November this year, 1,144 suspects were convicted of various corruption offenses and financial crimes including hundreds of millions of cash forfeitures, alongside eight aircraft, seven fuel stations among others.\nHe further noted that for any nation to prosper, the judiciary must remain independent and insulated from interference (financial or otherwise)."
  },
  {
    "headline": "Breaking: Ondo Speaker appears in court over fraud allegation -",
    "summarized_story": "The trial of the Speaker of the Ondo State House of Assembly Bamidele Oloyelogun over allegation of fraud did not hold due to the absence of counsel to the economic and financial crimes commission.\nThe speaker arrived the premises of the country around 8.am on TuesdayThe EFCC had in March questioned the Speaker over an allegation of fraud that allegedly rocked the Assembly.\nThe anti graft agency also detained the Clerk of the Ondo State House of Assembly, Mr.\nBode Adeyelu and three others staff for alleged N2.4 million seminar fraud.\nThe trial did not however hold due to the absence of the counsel to the EFCC"
  },
  {
    "headline": "Ondo Assembly postpones Screening Of Commissioner- Nominees -",
    "summarized_story": "The screening of Commissioner nominees by the Ondo State House of Assembly billed to continue on Tuesday has been rescheduled.\nThe exercise which started Monday was suspended because the Chairman House Committee on Selection and the Speaker of the House, Rt Honourable Oleyelogun Bamidele David is indisposed.\nThe exercise will continue tomorrow Wednesday 1st December,2021 at 1pm at the Conference Room of the Speaker.\nIn a Press statement signed by the Chairman House Committee on Information, Youth and Sports Development, Akogun Olugbenga Omole the House regretted all inconveniences caused by the suspension.\nThe house enjoined the remaining Commissioner nominees to report promptly on the rescheduled date with all necessary documents."
  },
  {
    "headline": "Court declares arrest, arraignment of Ikeanga Ugochinyere unlawful -",
    "summarized_story": "The FCT High court sitting in Apo presided by Justice Binta Mohammed has granted the application for a judicial review filed by Spokesperson of the CUPP, Ikenga Imo Ugochinyere to restrain the Wuse Chief Magistrate from going ahead with the case of criminal defamation brought against him by the Inspector General of Police on the account of the Speaker of the House of Representatives.\nA Chief Magistrate in Wuse District of Abuja had granted bail to Mr Ugochinyere in the sum of two hundred thousand naira and 1 surety in like sum.\nHe had pleaded not guilty to a 4 count charge of defamation brought against him by Speaker House of Representatives Femi Gbajabiamila and the entire member the House.\nIn a first Information report the prosecution had claimed that Mr Ugochinyere, conspired with others at large to commit an offence of defamation against the Speaker and the entire House of Representatives when he accused them of collecting 10 million dollars in order to pass the Infectious Disease Bill.\nJustice Binta Mohammed held that the magistrate court acted with out jurisdiction to entertain the matter against Mr ugochinyere."
  },
  {
    "headline": "Zamfara APC excos visit party bigwigs, promise to take party to greater heights -",
    "summarized_story": "The newly elected officers of the ruling All Progressive Congress in Zamfara said they are committed to respecting the party’s constitution and constituted authorities.\nThe Zamfara APC also says, they will show leadership by example and ensure that no duly registered member of the party is left behindThis was stated in a press statement signed by the publicity secretary of the Party Yusuf Idris GusauThe state Chairman of the party Tukur Umar Danfulani who led other party executive council members to a thank you visit to some party bigwigs in the state says, APC in Zamfara been rebranded and that all loyal members will be fully engaged in the party’s activitiesHe adds that his council have gained the confidence of the political gladiators under the good, people oriented and focused leadership of Governor Bello Matawalle who is also the leader of the party in the state.\nSome of the party bigwigs visited includes Former Governors Ahmad Sani Yeriman Bakura and Mamuda Aliyu ShinkafiOthers are Senator Hassan Nasiha who held brief for the party as Caretaker Committee Chairman and former Chairman House of Representatives Committee on Security and Intelligence, Sani Aminu JajiThe former Governors insist that the APC in Zamfara is united and has no Faction.\nThe duo also called on those challenging the decision of the apex body of the party to desist in the interest of peace, unity and progressSenator Yerima assured of his continuous support to the executive and all party affairs.\nThe first civilian Governor of the state Sani Yarima says, the APC is one in Zamfara and called on those challenging constituted authority of the party in the state to stop doing so in the interest of peace, unity and progress."
  },
  {
    "headline": "Nigeria VP Osinbajo Inaugurates N13bn Delta Secretariat Complex, IPP Project",
    "summarized_story": "Nigeria’s Vice-President, Prof. Yemi Osinbajo, on Monday inaugurated the multi-billion naira Delta State Secretariat Complex named after the Asaba monarch, H.R.M, Prof. Chike Edozien.\nAlso, the vice-president inaugurated the Asaba IPP (independent power project) established under a joint partnership with the Delta State Government and Bestanchury Power Solutions Nigeria Limited and Africa Plus Partners.\nIn due course, touch builders become historical monuments and the commissioning of this secretariat is special in two different ways.\nFirst the civil service and the people of Delta are today being presented with the state of the art functional and befitting secretariat after many years.\nOkowa said, “By now, many people will probably be wondering if the Vice-President has Delta roots."
  },
  {
    "headline": "In Most Barbaric Manner, Proscribed IPOB Beheads Two Nigeria Police Officers – Arise News",
    "summarized_story": "Also, the Northern Elders Forum (NEF), on Monday, kicked against alleged plans by President Muhammadu Buhari to succumb to pressure and terminate the on-going trial of the IPOB leader, Nnamdi Kanu.\n”Two of the officers, Inspectors Akubo and Adamu, were killed in the most gruesome manner and their decapitated bodies videotaped and circulated widely.\nHe also queried why those making calling for political solution have yet to condemn the appalling murder of serving police officers.\nMeanwhile, NEF, while advising President Buhari not to yield to pressure to release Kanu, said granting such request could do more harm to the country.\nHis words: “This afternoon, I visited my brother, Maazi Nnamdi Kanu in DSS custody, Abuja."
  },
  {
    "headline": "Omicron ‘Not Yet Detected’ in Nigeria",
    "summarized_story": "As countries across the world continued to take measures to prevent the spread of the new COVID-19 variant, Omicron, Nigeria on Monday said there was currently no reported detection of the strain in the country.\nNational COVID-19 Incident Manager, Dr. Mukhtar Muhammad, stated this position yesterday in Abuja at a media briefing organised by the Presidential Steering Committee (PSC) on COVID-19.\nMuhammad said PSC would be issuing a travel guideline today to prevent the virus from spreading.\nHe said this was one of the factors fuelling COVID-19 and the emergence of variants of concern, including Omicron.\nMustapha stated, “As the DG WHO has just stated today, the emergence of the highly-mutated Omicron variant underlines just how perilous and precarious our situation is."
  },
  {
    "headline": "UAE Pledges $2bn to Support Nigeria’s Mining Sector",
    "summarized_story": "As part of efforts to support Nigeria’s Mines and Steel Development sector, the office of the past ruler of Abu Dhabi, United Arab Emirates (UAE), His Royal Highness, Sheikh Hamdan bin Khalifa, has pledged the sum of $2 billion to Nigeria.\nThe donations according to Khalifa and Global Peace Ambassador, United Nations, Zulfiquar Ghadiyali, was to further cement the close trade and bilateral relationship that exists between the two countries.\nOgah, in a statement yesterday, noted that the Expo, with participants from over 200 countries, provided the opportunity to showcase the potentials of Nigerian minerals sector on Dubai soil with special emphasis on gold and other precious minerals abundant in Nigeria.\nThe minister, who was honoured with the “Excellence in Public Service Award,” by FIN-Africa-UAE Trade and Investment Forum Dubai, expressed gratitude to Khalifa over the amount he pledged for Nigeria’s sustainable development drive.\nHe assured of federal government’s commitment to ensure appropriate deployment of the funds, when the agreement was signed."
  },
  {
    "headline": "IATF Generates $42.1bn Trade, Investment Deals",
    "summarized_story": "The recently concluded second Intra-African Trade Fair (IATF 2021) generated a record $42.1 billion in trade and trade-related investment deals, according to the latest tally released yesterday by the IATF Advisory Council.\nThis record value of trade and investment deals was the outcome of more than 500 business deals included during the rich and varied seven-day programme of business-to-business, business-to-government and government-to-government exchanges, exhibitions, trade and investment conference sessions.\nIATF 2021 surpassed its pre-set target of $40 billion in trade and investment deals, going well beyond the $32 billion in transactions closed during the first edition in Cairo, Egypt in 2018.\nAgainst a target of 1,100 exhibitors, IATF 2021 saw 1,161 exhibitors showcase their goods and services.\nBuyers, sellers and investors came physically and virtually from across Africa and beyond to connect and exchange trade, investment and market information."
  }
]