[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Akwa Ibom APC Crisis: Police confirms REC, Igini report on forgery",
    "summarized_story": "The Police investigation on the allegation of forgery and perjury has also confirmed that Mr. Augustine Ekanem was duly elected as the State Chairman of APC during the party’s congress.\nAccording to the Report, the complainant Yusuf Sheriff Banki, had in a letter to the Police with the reference No.\n4 209, dated 22nd June, 2022, requested for legal advice on the alleged case of forgery and perjury against Ntukekpo.\nIt said, “That in his capacity as the Chairman, he (Banki) superintended over the Congress and submitted report with summary of result sheet to APC NationalSecretariat.\n“It is also observed, that records received from both Independent NationalElectoral Commission INEC and the All Progressives Congress APC Headquartersrevealed that Augustine Ekanem is the State APC Chairman of Uyo AkwaIbom State."
  },
  {
    "headline": "Suspension not enough, arrest, prosecute Emir who turbaned bandit leader – Ohanaeze Ndigbo",
    "summarized_story": ".Renews call for release of Nnamdi Kanu.\nZamfara State Government, had Sunday, announced the suspension of the Marafa for ‘turbaning’ the bandit leader.\n” Mazi Nnamdi Kanu should be released.\n” And when Nnamdi Kanu talks, somebody will say that Kanu is agitating!\nAccording to him, another Fulani succeeding Buhari will embolden Fulani bandits to take their atrocities to higher dimension."
  },
  {
    "headline": "Cultism: IG orders Lagos CP to Investigate Portable over formation of One Million Boys",
    "summarized_story": "By: Kingsley Omonobi – AbujaAftermath the disclosure by popular music star, Portable in a trending/viral video that he was one of those instrumental to the formation of the notorious cultist group, One Million Boys in Lagos, the For e headquarters has ordered an investigation.\nIt said, “Sequel to the trending video of one Habeeb Okikiola aka Portable where he claimed to have formed the One-Million Boys cult group terrorising some parts of Lagos State, the IGP has ordered CP Lagos to investigate the indicting statement and take necessary legal action.\nA statement by Force Public Relations Officer, CSP Muyiwa Adejobi said, “This directive is premised on the continuous effort of the Nigeria Police Force to fish out pillars and sponsors of cult groups in order to decimate their activities and restore sanity to our society."
  },
  {
    "headline": "DCLM says Pastor Kumuyi’s comment on Muslim-Muslim ticket not political",
    "summarized_story": "By Chioma Onuegbu, UyoDeeper Christain Life Ministry, DCLM, has said the comments by its General Superintendent, Pastor William Kumuyi, on the Muslim-Muslim ticket during a recent media chat in Ilorin, was not a political commentary aimed at attacking any personality in the country.\nThe Church which made the clarification in a statement made available to newsmen yesterday in Uyo, Akwa Ibom State capital, noted that Pastor Kumuyi’s comment was misrepresented by a section of the media.\nThe statement reads:” Deeper Christian Life Ministry is aware of a news story on Muslim-Muslim ticket making the rounds and attributed to the General Superintendent of the church, Pastor William Kumuyi.\n“During the chat, Pastor Kumuyi appealed to all parties to take interest of Nigerians into consideration while making their choices in representing the people, adding that ,“The Muslim-Muslim or Christian-Christian ticket’ is a difficult and slippery area.\nAs usual, Pastor Kumuyi calls on Nigerians to continue praying for the country and the manifestation of God’s will in Nigeria”"
  },
  {
    "headline": "Why FG continues to subsidize petrol consumption – NNPC CEO",
    "summarized_story": "By Obas Esiedesa, AbujaThe Chief Executive Officer of NNPC Limited, Mallam Mele Kyari has explained that the Federal Government’s decision to retain subsidy on petrol pump price was social and economic, and had nothing to do with politics.\nKyari who disclosed this during an interview aired by Channels Television said the subsidy policy has nothing to do with the corporation, noting that in the new NNPC Limited, the company would bill the government for handling the transaction.\nAccording to him, the NNPC will buy the product and sell it to the government which will in turn supply it to Nigerians.\nThere are always social circumstances that make the government and states decide whether they are going to provide subsidies on certain commodities.\nFor instance, when you take out tax from petroleum you are simply putting back a subsidy on it”."
  },
  {
    "headline": "Aero Contractors suspend passenger flight operations",
    "summarized_story": "Aero Contractors Company Nig.\nA statement on Monday disclosed that the decision followed the impact of the challenging environment on daily operations.\nAero said most of its aircraft were undergoing maintenance, resulting in inability to offer efficient service to customers.\nThe challenges listed include high cost of maintenance, skyrocketing fuel prices, inflation and forex scarcity caused by high exchange rates.\nHowever, the suspension does not affect Aero’s Approved Maintenance Organisation (AeroMRO); Training School and charter services."
  },
  {
    "headline": "Suspected criminals arrested by police for stealing, vandalizing EEDC cables in Ebonyi",
    "summarized_story": "No fewer than five suspected criminals were on Monday arrested by Ebonyi State Police Command over alleged conspiracy, stealing and vandalization of Enugu Electricity Distribution Company, EEDC, armoured cables in the state.\nThe commissioner noted that the suspected criminals, who hails from Inyimagu Amuzu community in Ezza South and Izzi LGAs, specialize in vandalizing and stealing EEDC armoured cables and assorted other electrical installations.\nItems recovered from the suspected criminals include; “100mm armored cables, other assorted electrical wares.”The owner of a white bus with Reg.\nA sales girl and boy at the scrap shop Automobile Site Abakaliki and a native of Ukwuakparata Izzi LGA was also arrested.\nThe commissioner, however, tasked community leaders not to allow vandals cart away the belongings of EEDC cables and other belongings in the state."
  },
  {
    "headline": "Lai Mohammed bashed for accusing Peter Obi of sponsoring EndSARS protest",
    "summarized_story": "But CNPGG insisted that the EndSARS protest was a consequence of bad governance, occasioned by insecurity, youth unemployment, poverty and police brutality.\n“Mostly all the people and the misguided youths who championed the ENDSARS Protest are all campaigning for Peter Obi for President.\nThat will go a long way in telling you that Peter Obi knows much about the ENDSARS Protest and those behind that ugly act must be brought to book to face disciplinary actions.\n“The APC project is one that is characterised by failed promises and arrogance of power, which Lai Mohammed embodies.\n“It is curious that a man, who apologised personally and on behalf of the Nigerian Government for their failure, would now have the audacity to blame Peter Obi for instigating the famous EndSARS protest."
  },
  {
    "headline": "Buhari not ready to end ASUU strike – Don",
    "summarized_story": "A professor of political science from Usmanu Dan fodio University Sokoto, Professor Ibrahim Bande Zagga, has criticised President Muhammadu Buhari over the prolonged strike by the Academic Staff Union of Universities, ASUU.\nHe said from all indications, Buhari is not cut out to resolve the long standing agreements with university unions.\n“How much does ASUU require to end the strike?\nIt is a very simple committee comprising the union and the federal government, which have met and reports submitted to the federal government.\n“So, it is not about religion but a patriotic leader who can bail out the country muslim- muslim or Christian it does not matter.”"
  },
  {
    "headline": "El-Rufai blocked use of Arewa House in Kaduna – Peter Obi’s supporters",
    "summarized_story": "Peter Obi Support Network (PSON) has accused Kaduna State Governor, Nasir El-rufai, of preventing a Northern meeting in support of Peter Obi.\nThe followers of the Labour Party (LP) presidential candidate planned to use the popular Arewa House on Rabah Road.\nThe spokesman, Sani Saeed Altukry said the venue’s manager “called to notify that we cannot have Peter/Datti Northern Summit in Arewa House”.\n“The governor issued a directive cancelling the use of the venue after the group had paid for its use.\nThe POSN charged “all oppressed Nigerians and everyone that desires good governance” to keep their spirits high ahead of the 2023 elections."
  },
  {
    "headline": "Sam Larry disowns Portable over one million boys 'cruise' video The Nation Newspaper",
    "summarized_story": "Music promoter Sam Larry has denied claims by self-styled ‘wahala’ singer, Habeeb Okikiola, aka Portable that he is aware he (Portable) founded well-known cult groups Ajah boys and One Million Boys which terrorised Lagos State residents.\nSam Larry said he just assisted Portable with his trip because he is a music promoter.\nI don’t know anything about them and I don’t know them.\n“My wife’s family and other people have been calling to ask me what is the meaning of One Million Boys Portable mentioned my name about?\nOn one side of the video was Portables chat with him apologising to the music promoter describing his action as “cruise”."
  },
  {
    "headline": "Akintoye dissolves Ilana Omo Oodua executive council The Nation Newspaper",
    "summarized_story": "The Alana of Ilana Omo Oodua Worldwide and Leader of Yoruba Nation Self-Determination Struggle, Prof Banji Akintoye has dissolved the World Executive Council of Ilana Omo Oodua.\nThe dissolution, according to a a statement by the group’s Communications Manager Maxwell Adeleye, takes immediate effect,Addressing members of the Worldwide Executive Council at a meeting yesterday, Akintoye announced that a Worldwide Interim Management Council shall be constituted shortly to retool, reinvent and rebrand the apex body of the Yoruba Nation Agitation for the optimal gain of the Yoruba people.\nAkintoye said the Interim Management Council will work with him to conduct a new election that will usher in a new Worldwide Executive Council.\nThe dissolution, according to Akintoye, excludes the ex-officios who are Homeland States and Diaspora Coordinators.\nAkintoye thanks the members of the dissolved executive council for their contributions to the development of Yoruba Land and wish them best of luck in their future endeavors."
  },
  {
    "headline": "Woman with drugs in fetish bowls intercepted at Lagos airport The Nation Newspaper",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA) have arrested a 27-year-old alleged drug queen, Mrs. Opoola Mujidat, for reportedly planting drugs concealed in fetish bowls on two Oman-bound male passengers at the Murtala Muhammed International Airport (MMIA) Ikeja, Lagos.\nSpokesman of the Agency Femi Babafemi said in a statement yesterday that the bowls contained “scary native black soap and sponge”.\nBabafemi said the passengers, Raji Babatunde Kazeem and Akinbobola Omoniyi, were travelling together to Oman on an Ethiopian Airlines flight on Monday when they were intercepted by NDLEA operatives at the airport.\nBabafemi also said that in Nasarawa State, NDLEA operatives intercepted over 91 jumbo bags of cannabis, weighing 1,029.5kg concealed in a truck mounted on a gas tank by Doma Road, around 500 Housing Estate, Lafia.\nHe said a 52-year-old suspect, Ernest Ojieh, was arrested in connection with the seizure on Saturday."
  },
  {
    "headline": "Actress Ada Ameh dies in Delta hospital The Nation Newspaper",
    "summarized_story": "Popular actress, Ada Ameh is dead, The Nation has learnt.\nShe died in Warri, Delta State around 11 pm on Sunday, a source who pleaded anonymity said on Monday morning.\nAmeh was said to have been a guest of an oil company top shot and his family when she suddenly collapsed.\nThe Nation gathered that several movie stars have been trooping the facility on Monday morning to see her remains.\nBorn on May 15, 1974 in Ajegunle, Lagos, the popular actress shared a video of her eating with the family around 12:53pm on Sunday on her official Instagram page."
  },
  {
    "headline": "10 reasons Peter Obi can’t win 2023 presidency, by Sunday Adelaja The Nation Newspaper",
    "summarized_story": "Founder of Embassy of the Blessed Kingdom of God for All Nations, Kyiv, Ukraine, Pastor Sunday Adelaja, has offered reasons why Labour Party (LP) presidential candidate, Peter Obi cannot succeed President Muhammadu Buhari in 2023.\nAdelaja, in a post on his verified Facebook page, said facts and statistics are not on the side of Peter Obi to become the next President.\nHe judged the All Progressives Congress (APC) presidential candidate, Asiwaju Bola Tinubu, to be more qualified than Obi.\n“I strongly doubt that the Labour Party of Peter Obi has 8809 party branches in Nigeria.\n“The only person who praises the works of Peter Obi in Anambra is Peter Obi himself."
  },
  {
    "headline": "2023: Reject candidates with links to Boko Haram, drugs, corruption, CAN directs Christians",
    "summarized_story": "By Chinelo ObogoChristian Association of Nigeria (CAN) has directed all churches in Nigeria to advise their members not to vote any presidential candidates with links to hard drugs, Boko Haram or any violent religious groups.\nThe body said the candidate must not be a member of any cult, must not have any involvement with drugs, witchcraft, Boko Haram or any violent religious group.\nWe reject open grazing, rather, there should be modernisation of animal husbandry, local control of economy including waters, rivers and forests.\n“The candidate must not be a member of any cult, must have no involvement in drugs and witchcraft, no fanaticism, no relationship to Boko Haram or other violent religious groups.\nThis year by the grace of God, we would select a good person."
  },
  {
    "headline": "NNPC increases petrol pump price to N179",
    "summarized_story": "By Adewale SanyaoluThe Nigerian National Petroleum(NNPC) Limited has approved an upward review in the pump price of Premium Motor Spirit(PMS) from N165 per litre to N179 per litre, effective today(Tuesday)NNPC Limited in a notice to fuel marketers directed them to change the petrol price on pumps to the new price effective today(Tuesday).\nThis was even as the company equally increased the ex- depot price from N148.17 to N167 per litre.\nIt would be recalled that Daily Sun had exclusively reported on Monday the unofficial deregulation attempts by fuel retailers as they have adopted different price bands.\nFindings by Daily Sun across some filling stations in Lagos revealed that majority of the filling stations have adopted different price models.\nAll the above three filling stations in Lekki have had the new prices reflected on their meters while the big board which normallyhave their prices displayed for motorists to see have equally been changed."
  },
  {
    "headline": "BREAKING: Morroco defeats Nigeria 5-4",
    "summarized_story": "Moroco has qualified for the final of the 2022 Women’s Africa Cup of Nations on Monday after defeating Nigeria 5-4 on penalties.\nThey will face South Africa in the final.\nSuper Falcons of Nigeria failed to earn a 10th final match appearance after falling 4-5 on penalty kicks."
  },
  {
    "headline": "Aftermath of Kuje prison attack: Kyari, others seek fresh bail",
    "summarized_story": "From Godwin Tsa, AbujaThe suspended Deputy Commissioner of Police (DCP), Abba Kyari, has filed a fresh bail application, pending his trial, in the wake of the terrorist attack on the Kuje Correctional Centre.\nKyari, who is facing drug trafficking charges, predicated his application on safety grounds.\nAlready, Justice Emeka Nwite has fixed tomorrow to hear the bail application.\nJohn Nuhu- also prayed the court to okay their release on bail on similar grounds.\nKyari’s counsel, Ikpeazu, said his client’s fresh application became necessary, considering the nature of assignments he undertook while performing his duties as a police officer."
  },
  {
    "headline": "UK, US elated over Osun guber election",
    "summarized_story": "In the same vein, the U.S. Mission to NIgeria lauded Osun State citizens on the peaceful gubernatorial poll.\nHe also congratulated the PDP and the people of Osun State for their steadfastness, courage and vigilance during the election .\nWhat has happened in Osun State is an indication of PDP’s stand in the whole country.\nYou can bear me witness that it didn’t work in Osun state, so we should not support this kind of politics.\nAlso, Transition Monitoring Group (TMG) lauded INEC’s efforts at the Osun election."
  },
  {
    "headline": "SON Urged to Upgrade ICT Infrastructure for Easy Interface With Customs – THISDAYLIVE",
    "summarized_story": "The Comptroller General of the Nigeria Customs Service (NCS), Col Hameed Ali (Rtd) has urged the Standards Organisation of Nigeria (SON) to upgrade its IT infrastructure to enable a smooth interface with the NICIS II platform of the service.\nThe customs boss stated this when the Director-General of SON, Mallam Farouk Salim, along with his management team, visited the customs headquarters in Abuja.\nThe SON Director-General emphasised the strategic role played by the Nigeria Customs Service in the fight against the importation of substandard products.\nThe CGC emphasised the need for SON to upgrade its IT infrastructure to enable a smooth interface with the NICIS II platform of the NCS.\nThe DG promised to do all in his power to make this a reality while also requesting for Customs Officers to be trained in ISO certifications."
  },
  {
    "headline": "FG Reaffirms Commitment to Achieve National Food Security – THISDAYLIVE",
    "summarized_story": "Gilbert EkugbeThe Permanent Secretary, Federal Ministry of Agricultural and Rural Development, (FMARD), Dr. Ernest Umakhihe, has emphasised the commitment of the Ministry to attaining national food security.\nHe stated this during the flag off the distribution of free agricultural inputs and quality seeds in in Benin City, Edo State.\nThe permanent secretary said that the distribution of agricultural inputs would enhance food and nutrition security, economic growth and job creation, especially during the Post COVID-19 era.\n“Similarly, 10 per cent is targeted at persons with special needs and this has been communicated to the Farmers’ associations to act accordingly,” he said.\nOne of the beneficiaries, a physically challenged farmer, Mr. Efosa Baldwin, thanked the ministry for the free agricultural inputs and pledged to make judicious use of the inputs."
  },
  {
    "headline": "Religiosity Versus Spirituality – THISDAYLIVE",
    "summarized_story": "In fact, the only times many Nigerians ever fast, is when they want God to deal with their enemies.\nWhat does Scripture say in Proverbs 14:34?\nIt happens in Nigerian Pentecostal and Evangelical churches where people worship men of God, instead of God.\nScripture makes a very big distinction between religiosity and spirituality.\nAnd from that time till today, my spirituality has deepened, and my religiosity has loosened."
  },
  {
    "headline": "FIABCI-Nigeria Elects new Executive Members for 2022/2023 – THISDAYLIVE",
    "summarized_story": "Fadekemi AjakaiyeThe International Real Estate Federation Nigeria Chapter -FIABCI Nigeria has elected new Executive and Board Members to manage its affairs in 2022/2023.\nThe new members that were elected during FIABCI Nigeria’s Annual General Meeting held in Lagos recently included: President – Mr Gladstone Opara; Vice President – Mr Akin Opatola; Secretary General – Mr Ayodele Olamoju; Treasurer – Mrs Tolu Dima-Okojie; Publicity Secretary – Mr Bawa-Allah; and Assistant Secretary General – Mr Alfred Osagie.\nThe Board Members are: Immediate Past President – Mr Adeniji Adele; Immediate Past Secretary General – Mr Ayodeji Odeleye; Immediate Past President FIABCI-Africa and Near East – Mr Joseph Akhigbe; and Young Member Committee President – Mrs Rei Obaigbo.\nThe Un-official Members are: Mr Gbenga Ismail; Mr Bolu Olanrewaju; Ms Ivie Idike; and Mr Frank Okosun."
  },
  {
    "headline": "Mamador Launches New Communication, Inspires Nigerian Women – THISDAYLIVE",
    "summarized_story": "Staying true to its promise of empowering Nigerian women, premium food brand Mamador produced by PZ Wilmar launched a new communication titled ‘Explore your Flavour’.\nThe communication, which is a wake-up call for women to experience life outside of routines and step into a world of endless possibilities was launched via a digital campaign recently.\nThe brand equally released a television commercial with the intention of reaching every Nigerian woman and ushering her into an era of exploration and self-fulfilment.\n“The average Nigerian woman is nurturing a potential talent or two which she refuses to explore due to circumstances or maybe societal pressure.\nMamador is out to give her that boost of confidence she needs to remember those talents and explore her flavours outside of her usual life routines.”Over the years, Mamador has made strong contributions to the Nigerian society, championing women’s causes, from its innovative virtual Mamador August Meeting, Corporate social initiatives that have been aimed at women at all levels."
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "Two dead as Ghana confirms Marburg virus disease outbreak -- first time ever",
    "summarized_story": "The Ghana Health Service (GHS) has confirmed the country’s first-ever outbreak of the Marburg virus disease.\nThe World Health Organisation (WHO) identifies the Marburg virus as one that causes fever as experienced by persons who contract Ebola.\nAdvertisement“The laboratory corroborated the results from the Noguchi Memorial Institute for Medical Research, which suggested their illness was due to the Marburg virus.\nIn August 2021, a case of Marburg virus disease was reported in Guinea, but five weeks after, the outbreak was declared over.\nAdvertisementThere is currently no approved vaccine for the Marburg virus, but patients are usually treated with rehydration."
  },
  {
    "headline": "Two dead as Ghana confirms Marburg virus disease outbreak -- first time ever",
    "summarized_story": "The Ghana Health Service (GHS) has confirmed the country’s first-ever outbreak of the Marburg virus disease.\nThe World Health Organisation (WHO) identifies the Marburg virus as one that causes fever as experienced by persons who contract Ebola.\nAdvertisement“The laboratory corroborated the results from the Noguchi Memorial Institute for Medical Research, which suggested their illness was due to the Marburg virus.\nIn August 2021, a case of Marburg virus disease was reported in Guinea, but five weeks after, the outbreak was declared over.\nAdvertisementThere is currently no approved vaccine for the Marburg virus, but patients are usually treated with rehydration."
  },
  {
    "headline": "Osun guber: Some associates of Aregbesola worked with me, says Adeleke",
    "summarized_story": "Ademola Adeleke, governor-elect of Osun state, says some associates of Rauf Aregbesola, minister of interior, supported him during the governorship election.\nOn Sunday, Adeleke, candidate of the Peoples Democratic Party (PDP), was declared winner of the Osun governorship election.\nAdeleke secured 403,371 votes to defeat his closest contender, Gboyega Oyetola of the All Progressives Congress (APC), who polled 375,027 votes.\nAdvertisementPrior to the election, Aregbesola and Oyetola fell out over the tussle for control of the Osun APC leadership.\nSpeaking on the claim that Aregbesola supported the PDP, Adeleke said he did not work with the minister on his governorship bid."
  },
  {
    "headline": "Osun guber: Some associates of Aregbesola worked with me, says Adeleke",
    "summarized_story": "Ademola Adeleke, governor-elect of Osun state, says some associates of Rauf Aregbesola, minister of interior, supported him during the governorship election.\nOn Sunday, Adeleke, candidate of the Peoples Democratic Party (PDP), was declared winner of the Osun governorship election.\nAdeleke secured 403,371 votes to defeat his closest contender, Gboyega Oyetola of the All Progressives Congress (APC), who polled 375,027 votes.\nAdvertisementPrior to the election, Aregbesola and Oyetola fell out over the tussle for control of the Osun APC leadership.\nSpeaking on the claim that Aregbesola supported the PDP, Adeleke said he did not work with the minister on his governorship bid."
  },
  {
    "headline": "Study: COVID vaccines linked to menstrual period changes, breakthrough bleeding",
    "summarized_story": "A new study by researchers in the USA shows that persons reported experiencing heavier bleeding during menstruation after receiving COVID vaccines.\nRegularly menstruating people with endometriosis, menorrhagia, fibroids, and PCOS were slightly more likely to experience heavier bleeding.\n“Among nonmenstruating premenopausal respondents, those with breakthrough bleeding after vaccine were more likely to have been pregnant and/or given birth.\nLast, among postmenopausal respondents, those with breakthrough bleeding after vaccine were more likely to be younger and/or be Hispanic/Latinx.\nWe emphasize that menstrual bleeding changes of this nature are generally not indicative of changes to fertility.”"
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Ping Express founders admit to breaking US AML rules.",
    "summarized_story": "The firm, Ping Express, admitted in US district court filings that it broke money laundering rules after it transferred $167 million out of the US.\nPing Express CEO Anslem Oshionebo, 45, and COO Opeyemi Ode, 43, both recently received 27-month prison sentences, and the company’s business manager, Aleoghena Okhumale, received a 42-month prison sentence for intentionally transferring criminal proceeds.\nPing Express also admitted it failed to seek sufficient details about the sources or purposes of the funds it helped to transmit, or the customers initiating the transmissions.\nPing Express itself faces up to 5 years of probation and a $500,000 fine.\nPer Bloomberg, the current controlling shareholder of Payzen, Adekanmi Adedire, said that his company is “unrelated” to Ping Express, which is a “totally different entity”."
  },
  {
    "headline": "Flutterwave, Eversend and other fintech African startups shut down virtual card service",
    "summarized_story": "Earlier on Friday, many African fintech startups offering virtual dollar card services sent emails to their customers stating that their virtual card service will be unavailable indefinitely starting Saturday, July 16, 2022.\nThis announcement by Flutterwave is bound to affect many other startups who use the company’s white-labeled virtual card service to issue virtual cards to their customers.\nOther fintech startups including crypto exchange Busha, Rwanda-headquartered Payday, and Ugandan Eversend also issued similar notices.\nIt’s not clear which “card partner” Flutterwave and the other fintech startups are referring to, but these platforms have issued virtual cards powered by MasterCard and Visa—two leading global card issuers.\n“It affects us in a big way because all our Facebook ads are connected to our Barter virtual card,” Douglas Kenydson CEO Selar said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Meet Burna Boy's monitor engineer, Precious Tawo as he takes us on his journey into sound engineering",
    "summarized_story": "Without further ado, let’s meet Precious Tawo, freelance sound engineer and production manager.\nOn the 20th day [of the Calabar festival], we were doing a sound check in the stadium for the band, and my boss was not on the stage.\nPrecious Tawo’s journey into sound engineeringPrecious TawoI didn’t choose the path; the path chose me.\nAnd in 2013, the Calabar Festival was very popular.\nWe tried everything and eventually had to plug my monitors into my boss’ equipment."
  },
  {
    "headline": "Protesting Pensioners Not Retirees Of Delta State Govt – Aniagwu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAsaba – Delta State Government on Monday said protesting pensioners in the state are not retirees of the state government but primary school retirees under the local government councils.\n“We have it on good authority that the incessant protests emanating from a section of pensioners in the state have become politically motivated.\n“The leader of the protesters is Mrs Helen Ejie, a retired teacher from Iyiatu Primary School, Utagba-Ogbe in Ndokwa West.\n“We have seen some stage-managed protests by individuals who ordinarily are supposed to appreciate what the state government has done.\n“We have so far cleared Local Government Pensions to early 2018 and Primary School Teachers owed several years of arrears of pension to August 2016."
  },
  {
    "headline": "Emulate Osinbajo, stop medical tourism, NMA urges politicians – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian Medical Association (NMA) has called on other political office holders in the country to emulate Vice President, Prof. Yemi Osinbajo to end medical tourism.\nThe National President of the association, Dr Uche Ojinmah said this in a ‘Get-Well Wish’ statement on Monday in Abuja.\nHe also commended Osinbajo for demonstrating confidence in Nigerian doctors and the healthcare system.\n“We wish to thank God for seeing our Vice President through surgery.\nAll Nigerian doctors are praying for his quick and complete recovery.”The News Agency of Nigeria (NAN) reports that a successful surgical operation was performed on Osinbajo by a team of Nigerian doctors in Lagos to treat a recurrent pain caused by a fracture in his leg."
  },
  {
    "headline": "7, 408 driver’s licences unclaimed in Delta – FRSC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Federal Road Safety Corps (FRSC) in Delta on Monday said 7, 408 driver’s licences approved in 2021 were yet to be collected in the state.\n”It is worrisome that as at June, no fewer than 7,408 driver’s licences that have been processed and are yet to be collected across our licencing centres in the state,” he said.\n“It seems that many motorists are reluctant to collect their licences, possession of a valid licence remains a major requirement for drivers.\n”Having a valid driver’s licence gives motorists’ the legal backing and confidence to be on the road, and saves them unnecessary embarrassment,” he said.\nOn motorists yet to get their valid licences, Eshiet said defaulters risk a N10,000 fine or six months imprisonment or both."
  },
  {
    "headline": "Training in peacetime breeds confidence during operations, wartime – Army – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Chief of Training (Army), Maj.-Gen. Abdulsalam Ibrahim, says the continuous training of personnel in peacetime helps to breed confidence in them during operations and wartime.\nHe said this at the opening of the Army Headquarters Garrison (AHQ Gar) Operations Planning Cadre 2022, on Monday in Abuja.\nIbrahim, represented by the Deputy Chief of Training (Exercises), Brig.-Gen. Valentine Okoro, said the Army prioritise training to enhance the capacity and confidence of personnel in confronting current and emerging security challenges.\nHe hailed the commander of AHQ Garrison for implementing all scheduled training activities for the year with utmost enthusiasm.\n“There is no gainsaying that personnel’s training in peacetime breeds confidence during operations and wartime."
  },
  {
    "headline": "NLA President, National Librarian for NBRP Book Clubs in Libraries parley",
    "summarized_story": "The newly elected National President of the Nigerian Library Association, NLA, Pastor Dominic Omokaro and the National Librarian/CEO, National Library of Nigeria, Professor Veronica Chinwe Anunobi would be participating as Special Guests at a parley on Managing Book Clubs in Libraries being convened by the Network of Book Clubs and Reading Culture Promoters in Nigeria, NBRP, on August 17.\nThe session, according to a statement from Emmanuel Okoro, NBRP secretary, would be moderated by the University Librarian, Federal University Otuoke, Vice President, NBRP and Chair of the organisation’s 774 Book Clubs and Libraries Project, Professor Felicia Etim.\nThe Network of Book Clubs and Reading Culture Promoters in Nigeria is the umbrella body of book clubs and reading promoters in Africa’s most populous nation.\nThat occasion would also be used to select the Nigerian National Book Clubs City, 2024.\nAn initiative of the NBRP that is modelled after the UNESCO World Book City Project, the National Book Clubs City for 2022 is Uyo while Lagos is already waiting in the wings to flag off its tenure as National Book Clubs City 2023."
  },
  {
    "headline": "US. Mission congratulates Osun citizens on peaceful conduct of guber election",
    "summarized_story": "The United States mission to Nigeria has congratulated the people of Osun State on the peaceful conduct of the gubernatorial election on Saturday, July 16.\nRecall that in the governorship election held on Saturday, Senator Ademola Adeleke of the People’s Democratic Party defeated the incumbent governor, Gboyega Oyetola of the All Progressives Congress.\nThe mission which commended the state electorates over the conduct of the election in a statement on Monday, also hailed the Independent National Electoral Commission (INEC) for helping to facilitate the peaceful conduct.\n“We commend the concerted efforts of the Independent National Electoral Commission (INEC) staff and security personnel who helped facilitate a secure process that reflected the will of the people,” the statement said.\n“We encourage all Nigerian citizens to register to vote now so that your voice can be heard in the national and state elections in 2023.”"
  },
  {
    "headline": "Morocco beats 9-women Falcons on penalties to qualify for WAFCON final",
    "summarized_story": "The Atlas Lionesses of Morocco, on Monday night, prevailed against valiant Super Falcons of Nigeria 5-4 on penalties to advance to the final of the ongoing Women’s African Cup of Nations.\nThe Nigerian side lost two key players to red card but fought valiantly to hold the host nation for over an hour of football.\nGoalkeeper Chiamaka Nnadozie failed to catch the ball and it fell kindly to an advancing Moroccan player who slotted at the back of the net to level matters in the 66th minute.\nHowever, the Atlas Lionesses eventually prevailed 5-4 on penalties after striker, Ifeoma Onumonu missed her spot kick.\nThe Moroccans face South Africa in the finals, in a match that will see a first time winner emerge."
  },
  {
    "headline": "Police order Lagos CP to investigate Portable over ‘One Million Boys’ formation",
    "summarized_story": "The Nigerian Police Force has ordered its commissioner in Lagos to investigate singer, Portable, over claims that he formed One Million Boys and other cult groups in the state.\nThe controversial singer had claimed in a video that that he is the founder of One Million Boys, a cult group that terrorised residents of Lagos State in recent months.\nResponding to the claim in a statement on Monday, Prince Olumuyiwa Adejobi, force public relations officer, said, “Sequel to the trending video of one Habeeb Okikiola aka Portable where he claimed to have formed the One-Million Boys cult group terrorising some parts of Lagos State, the IGP has ordered CP Lagos to investigate the indicting statement and take necessary legal action.\n“This directive is premised on the continuous effort of the Nigeria Police Force to fish out pillars and sponsors of cult groups in order to decimate their activities and restore sanity to our society.”"
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Vehicle Rams Into Newspaper Stand, Kills 3 In Delta",
    "summarized_story": "Tragedy struck in Warri, Delta State at the weekend when a Range Rover jeep with vehicle registration number EFR 940 – TT, rammed into the popular newspaper stand at Iyara Roundabout, killing three newspaper readers and injuring one.\nAn eye-witness narrated that the incident occurred while the driver of the vehicle tried to negotiate the roundabout at high speed.\nHe lost control and rammed into the newspaper stand.\nIt was further gathered that the driver sustained serious injuries while the other two persons in the vehicle escaped unhurt.\nThe Police Public Relations Officer (PPRO) Delta Command, DSP Bright Edafe, requested that a text message be sent to him when he was asked to confirm the accident."
  },
  {
    "headline": "Vehicle Rams Into Newspaper Stand, Kills 3 In Delta",
    "summarized_story": "Tragedy struck in Warri, Delta State at the weekend when a Range Rover jeep with vehicle registration number EFR 940 – TT, rammed into the popular newspaper stand at Iyara Roundabout, killing three newspaper readers and injuring one.\nAn eye-witness narrated that the incident occurred while the driver of the vehicle tried to negotiate the roundabout at high speed.\nHe lost control and rammed into the newspaper stand.\nIt was further gathered that the driver sustained serious injuries while the other two persons in the vehicle escaped unhurt.\nThe Police Public Relations Officer (PPRO) Delta Command, DSP Bright Edafe, requested that a text message be sent to him when he was asked to confirm the accident."
  },
  {
    "headline": "Nigerian Students Studying Abroad, Travelers To Pay N40,000 For Police Character Certificate",
    "summarized_story": "Nigerians travelling abroad, including students are now to pay N40,000 for Police Character Certificate (PCC), also known as Police Clearance Certificate.\nThis followed a new directive from the Nigeria Police high command allegedly given on July 22, 2023, directing the increase of the fee for PCC from N5,000 to N40,000.\nThe new fee is a 700 per cent increase from the original fee of N5,000.\nBefore this official hike, the actual price was known as it could range range from as low as N5,000 to as high as N100,000, depending on the police officer one approaches or the individual requesting for it.\nMessages sent to Force PRO, CSP Olumuyiwa Adejobi, seeking confirmation and reasons for the increase were not answered as at press time."
  },
  {
    "headline": "Nigerian Students Studying Abroad, Travelers To Pay N40,000 For Police Character Certificate",
    "summarized_story": "Nigerians travelling abroad, including students are now to pay N40,000 for Police Character Certificate (PCC), also known as Police Clearance Certificate.\nThis followed a new directive from the Nigeria Police high command allegedly given on July 22, 2023, directing the increase of the fee for PCC from N5,000 to N40,000.\nThe new fee is a 700 per cent increase from the original fee of N5,000.\nBefore this official hike, the actual price was known as it could range range from as low as N5,000 to as high as N100,000, depending on the police officer one approaches or the individual requesting for it.\nMessages sent to Force PRO, CSP Olumuyiwa Adejobi, seeking confirmation and reasons for the increase were not answered as at press time."
  },
  {
    "headline": "Police To Probe Musician, Portable, Over Claim He Founded ‘One Million Boys’ Cult Group",
    "summarized_story": "The Inspector-general of Police (IGP), Usman Baba, has ordered an investigation into the claim by musician, Habeeb Okikiola, also known as Portable, that he formed the notorious cult group, One Million Boys.\n‘One Million Boys’ is a deadly cult group known for terrorising Lagos State and other parts of the South-western States for some time now.\nLEADERSHIP gathered that the order by the IGP came after the Zazu music crooner openly confessed on a trending video that he formed the deadly cult group.\nwhile confirming the order, said: “sequel to the trending video of one Habeeb Okikiola, aka Portable, where he claimed to have formed the One-Million Boys cult group terrorising some parts of Lagos State, the IGP has ordered CP Lagos to investigate the indicting statement and take necessary legal action.\n“This directive is premised on the continuous effort of the Nigeria Police Force to fish out pillars and sponsors of cult groups in order to decimate their activities and restore sanity to our society.”"
  },
  {
    "headline": "BREAKING: Oyo Assembly approves nomination of Bayo Lawal as new Deputy Governor",
    "summarized_story": "The Oyo State House of Assembly has approved the nomination of Barrister Bayo Lawal as the new Deputy Governor of the state.\nNews Direct reports that the approval is coming few hours after the Assembly removed the Rauf Olaniyan.\nOur correspondent however reports that the assembly has approved the nomination of Lawal.\nThe name of the new Deputy Governor was sent to the House by Governor Seyi Makinde.\nOur correspondent reports that the state secretariat which houses the House of Assembly has been under heavy security presence."
  },
  {
    "headline": "BREAKING: Suspected Islamic Terrorists Invade Enugu Community, Kidnap Over 15 Residents",
    "summarized_story": "Gunmen suspected to be Islamic terrorists masquerading as herdsmen have reportedly kidnapped over 15 residents of Mgbuji Eha-Amufu Community in the Isi-Uzo local government area of Enugu State.\nThe invasion of the community and abduction of the residents occurred on Monday morning.\nThe invading terrorists were said to have driven towards the Benue State border with Enugu after the abductions.\nAccording to SaharaReporters had reported that gunmen suspected to be Islamic terrorists in police and military uniforms on July 5, kidnapped seven residents of the same community and shot three others.\nMeanwhile, efforts by SaharaReporters to get the reaction of Enugu State Police Command were not successful."
  },
  {
    "headline": "BREAKING: Oyo Assembly Impeaches Deputy Governor, Olaniyan",
    "summarized_story": "Engineer Rauf Aderemi Olaniyan, the deputy governor of Oyo State, has been removed from office.\nOn Monday, members of the state House of Assembly impeached Olaniyan.\nThe lawmakers impeached the deputy governor around 11:30 a.m.Members of the Peoples Democratic Party predominate in the House of Assembly (PDP).\nFollowing the panel’s recommendation, the MPs declared during Monday’s session that they had impeached the deputy governor.\nAfter the report of the seven-person panel formed to look into claims made against the deputy governor was adopted, it was announced that the deputy governor had been impeached on Monday."
  },
  {
    "headline": "JUST IN: Nollywood Loses Another Veteran Actress",
    "summarized_story": "JUST IN: Nollywood Loses Another Veteran ActressVeteran actress Mrs Oluwasolamipe Onayiga, who played the role of Ireti in Kunle Bantefa’s popular soap Fuji House of Commotion, is dead.\nHer husband, Pastor Tosin Onayiga, confirmed the incident.\nHer shocking death comes after news broke that another popular actress, Ada Ameh died on Sunday night.\nAccording to The Nation, Ada died on Sunday in Warri, Delta State.\nIt was gathered that ‘The Johnsons’ star, collapsed and died around 11 pm on Sunday."
  },
  {
    "headline": "Breaking: After picking 2022 World Cup ticket, Super Falcons succumb to Moroccan semi-final defeat, fail to defend WAFCON title",
    "summarized_story": "Nigeria’s Super Falcons on Monday night lost 4-5 on penalties to host Morocco in the semi-final of the ongoing Women African Cup of Nations (WAFCON).\nFew days ago, the Nigerian team picked 2022 World Cup ticket after beating Cameroon.\nHowever, the team coached by a foreign coach was reduced to nine women on the pitch against hard-fighting Moroccan side.\nTwo Super Falcons Ayinde and Rasheedat Ajibade were shown red card during the match.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Forensic expert tells court: 21 exhibits linked to Kyari contained cocaine",
    "summarized_story": "Head of Narcotics National Drug Law Enforcement Agency (NDLEA) Mrs Patricia Afolabi has told the Federal High Court in Abuja how she conducted a forensic analysis on cocaine exhibits linked to the suspended Deputy Commissioner of Police Abba Kyari currently standing trial for drug-related charges.\nKyari, a former head of the IGP Intelligence Response Team (IRT) and his co-defendants are currently standing trial over charges brought against them by the NDLEA.\nNDLEA Abuja.”And following the “no objection” response from the defence lawyers, the judge, Emeka Nwite Nwite, admitted all the exhibits in evidence.\nAccording to her, it was not customary that all suspects would be present when substances were being handed over for analysis.\nThe NDLEA chief who said she had a three-decade experience in forensic analysis, said: “I was not present when the drug was recovered."
  },
  {
    "headline": "VIDEO: Watch Portable reveal how he founded notorious cult group ‘One Million Boys’",
    "summarized_story": "In a video the musician posted after some social media users ridiculed him for backing the APC during the just concluded Osun governorship election, Portable seemingly incriminated himself as one of those behind the formation of the notorious cult group, One million boysHe has since deleted the video from his social media account.\nOne Million Boys is the code-name of a robbery gang known for its notorious robbery activities around Lagos and its surroundings.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Rivers: Nirvana, Access Bank Donate Cartons of Food Items to Sickle Cell Disease Persons",
    "summarized_story": "A non governmental organisation, Nirvana Initiative and Hacey Health Initiative in partnership with Access Bank has lifted the lives of people living with sickle cell disease by donating cartons of food items to them and their relatives in Rivers State.\nNirvana Initiative through Sickle Cell Awareness and Health Foundation, held the sensitisation and food donation event at the University of Port Harcourt Teaching Hospital (UPTH) where many with sickle cell trait and their parents disclosed their challenges.\nA facilitator at the programme, Dabata Omubo-Pepple, Executive Director of Sickle Cell Awareness and Health Foundation, explained that the gesture by the NGO to reach out to people living with the disease was in commemoration the world sickle cell day, earlier celebrated in June.\nA way of reaching out with people living with sickle cell disease with a welfare package which has to do with food, reminding them that food is important in their day to day and also to support them”.\nMy parent realized that I am a sickler when I was about a year old and my mum was already pregnant with my little sister who also had sickle cell”."
  },
  {
    "headline": "X-raying reforms in SEC and uncanny zeal for investment space",
    "summarized_story": "Also, the Yuguda-led executive management team has been implementing capital market development goals set out in the Capital Market Master Plan (CMMP) (2015-2025) and successfully completed the review of CMMP to realign the initiatives/deliverables to prevailing market conditions and keep the document relevant in the dynamic capital market due to issues related to Fintech, sustainability and regional integration.\nThis is even as it processed six Schemes of Merger, seven Acquisitions, 21 Corporate Restructurings, and three Takeovers during the period.\nUnder his leadership, rules for the integrated West African Capital Market were developed and reviewed.\nOn human capital development, the Commission had in 2019 conducted an internal capacity assessment that outlined staffing deficits and needs.\nThe Commission has also secured counterpart funding of $450,000 from AfDB on its Nigeria Securities Market Surveillance System Project to support the deployment of a real-time market surveillance system for the Nigerian capital market."
  },
  {
    "headline": "TAJBank opens new branch to deepen financial inclusion",
    "summarized_story": "…as excited traders jostle to open accountBY Kehinde IbrahimTAJBank Ltd, a leading non-interest hank, has continued its service and financial inclusion drive with the opening of a new, technology-powered branch in Wuse 2, Abuja.\nThe opening of the new branch brings the lender’s growing branch network to 22 within its first two years of operation.\nJoda explained: “The opening of the new branch is to continue with our strategy of ensuring that we take the TAJBank brand to all the nooks and crannies of the Country with the aim of addressing the service needs of our teeming customers.\n“We understand that Customers want to do business and sometimes someone to give them that advisory service they yearn for which in turn will help to address their financial challenges”, he added.\nThe non-interest bank is also set to launch Nigeria’s first private sector Sukuk offering under a N100 billion programme."
  },
  {
    "headline": "NES28 to rally stakeholders for sustainable economic growth",
    "summarized_story": "While welcoming participants to the event, the chairman of the NESG, Mr Asue Ighodalo, said that the annual Nigerian Economic Summits had been sustained as a public-private dialogue platform by the NESG (representing the private sector) and the Federal Ministry of Finance, Budget and National Planning (representing the Federal Government of Nigeria).\nHe noted that the Summit is a foremost platform through which the federal and state governments engage with corporate leaders and discuss Nigeria’s national and sub-national economic realities to co-create reform strategies that are critical for the advancement and reform of the Nigerian economy.\nMr Ighodalo stated that the vision of a secure, developed, prosperous and macro-economically stable country where the rule of law prevails and no one is left oppressed appears dimmed with today’s considerable headwinds, but the current electoral cycle offers a unique opportunity to reflect and reset.\nHe noted that the challenge of non-inclusive economic growth reflects low productivity across employment-elastic sectors, which continues to weaken their capacity to create more job opportunities and decent employment.\n“Government has a pivotal role in jump-starting and addressing with utmost urgency six critical challenges including non-inclusive economic growth, macroeconomic instability, infrastructure deficit, human capital deficit and skills gap, national insecurity and weak economic competitiveness,” he stated."
  },
  {
    "headline": "Danger as Naira hits N620/$ at parallel market",
    "summarized_story": "Naira yesterday fell to N620 per dollar at the parallel market amid the lingering scarcity of the greenback.\nCurrency traders known as Bureaux De Change operators (BDCs) said there was increased demand for the dollar by importers at the street market.\nThe traders put the buying price of the dollar at N614 and the selling price at N620, leaving a profit margin of N6.\nAccording to the Central Bank of Nigeria (CBN), the parallel market is not a true reflection of the country’s exchange rate.\nOn Tuesday, the euro fell to parity against the dollar for the first time in almost 20 years."
  },
  {
    "headline": "Strike: Aviation Union Faults FG, To Join Protest In Solidarity With University Workers",
    "summarized_story": "The National Association of Aircraft Pilots and Engineers (NAAPE) has criticised the Federal Government over its handling of the crises in the nation’s educational sector.\nIn a statement on Monday by its Deputy General Secretary, Umoh Ofonime, NAAPE expressed worry over the impasse between the government and the Academic Staff Union of Universities (ASUU) which has grounded academic activities in public universities across the country.\nSince the industrial action began, several negotiations between the union and the government have ended in deadlock.\nWorried by the lingering crises in the tertiary education sector, the NLC had announced plans to commence a two-day nationwide protest in solidarity with the striking members of unions in the public universities.\nThe announcement was contained in a circular dated July 15, 2022, and addressed to the chairpersons and secretaries of its state councils."
  },
  {
    "headline": "Ex-Oyo Attorney-General, Bayo Lawal, Becomes Makinde’s Deputy",
    "summarized_story": "A former Attorney-General of Oyo State, Bayo Lawal, has become the Deputy Governor of the State.\nUntil his appointment as Deputy Governor, Lawal was the chairman of the Oyo State Housing Corporation.\nThe governor said, ”I want to start by welcoming our new Deputy Governor, His Excellency, Barrister Bayo Lawal, to the Oyo State Executive Council.\n“As we all know, you are already a part of this administration as the chairman of the Oyo State Housing Corporation.\nOthers who attended the event were former Speaker of the Oyo State House Assembly, Senator Monsurat Sunmonu, members of the House of Assembly, and some service commanders, among others."
  },
  {
    "headline": "‘A Man Of Impeccable Integrity,’ Kwankwaso Unveils Idahosa As NNPP VP Candidate",
    "summarized_story": "﻿The presidential candidate of the New Nigeria People’s Party (NNPP), Rabiu Kwankwaso, has unveiled Bishop Isaac Idahosa as his running mate for the 2023 elections.\nWhile speaking at the unveiling ceremony held on Monday at the International Conference Centre (ICC) in Abuja, he described the Edo State-born clergyman as a man of integrity.\n“Idahosa is a man of impeccable integrity and credibility who clearly understands the country’s contemporary challenges,” said Kwankwaso who is a former governor of Kano State.\n“I believe we can work together with sincerity to heal the wounds inflicted on the country.\n“We live in a country where victims of insecurity are constantly being ignored while still being accused of exaggeration, lying, or both,” said Kwankwaso."
  },
  {
    "headline": "INEC Materials Storage: We Will Engage In Talks With CBN – Festus Okoye",
    "summarized_story": "In June, INEC chairman, Mahmood Yakubu, had stated that sensitive election materials would no longer be “routed” through the apex bank.\nREAD ALSO: Osun Election: INEC Begins Distribution Of Sensitive Materials“It’s going to be a huge logistics nightmare.\nOkoye also insisted that the recently concluded elections in Ekiti and Osun governorship storage measures will not be tenable going into the general elections in 2023.\n“You cannot use the Ekiti governorship election and Osun governorship election as a measure of what will happen in 2023,” he said.\nWe did the same thing with the Osun election, and we moved the materials to our state offices."
  },
  {
    "headline": "Osun Election: I Did Not Work With Aregbesola, Says Adeleke",
    "summarized_story": "Senator Ademola Adeleke, the Osun Governor-Elect, has said he did not work with Rauf Aregbesola, the Minister of Interior, during the just concluded gubernatorial election in the state.\nIn a pre-recorded interview that aired on Monday on Channels Television’s Politics Today, Adeleke said, “I did not work with Aregbesola, I do not even talk to him”.\n“It was later that he apologised and he told me he has been thinking ‘why is Senator Adeleke greeting me?\nWe are trying to mess him up and he is still greeting me’.\nHe, however, stressed that though Aregbesola’s allies might have joined the PDP and worked with him, it is not clear that the minister orchestrated their moves."
  },
  {
    "headline": "Ekiti APC, Governor-elect begins thank you tour, road show",
    "summarized_story": "Ekiti State Governor- elect, Biodun Abayomi Oyebanji and the deputy governor- elect, Monisade Afuye on Monday (today) July 18, commenced a ‘thank you tour’ to all the 16 local government areas of the state to express their gratitude to the people of the State for their support in the June 18 governorship election.\nThe tour kicked off from Ikole local Government on Monday by 10am.\nAdvertisementAdvertisementThe second phase of the tour would involve visitation to ethnic groups, trade unions and community leaders.\nRecall that the Governor-Elect had visited prominent Ekiti leaders and stakeholders within and outside the state shortly after his election.\nAdvertisementOyebanji said the consultation would continue till his inauguration, adding that regular consultation with stakeholders and leaders will be a major feature of his administration’s Public engagement policy."
  },
  {
    "headline": "Oyo Assembly confirms Bayo Lawal as Deputy Governor -",
    "summarized_story": "Oyo state House of Assembly has confirmed the Chairman of Oyo state Housing Corporation Bayo Lawal as the New Deputy Governor of the state.\nThe Announcement was made by the Oyo state Speaker of House of Assembly Adebo Ogundoyin during a plenary session.\nAdvertisementThe announcement was made shortly after the Governor of Oyo state Seyi Makinde nominated Bayo Lawal for approval by the House.\nAdvertisementAdvertisementBayo Lawal is the current Chairman of the Oyo state Housing Corporation and the current running mate of the Governor.\nHe was also the Attorney General and Commissioner for Justice during the administration of former Oyo State Governor, Alhaji Lam Adeshina."
  },
  {
    "headline": "Analysis: Why Oyetola lost to PDP's Ademola Adeleke -",
    "summarized_story": "Journalist and Political Commentator, Adewale Adeoye throw more light on how Senator Ademola Adeleke defeated incumbent governor, Gboyega Oyetola at the poll.\nHe also explained the factors responsible for the shocking defeat among others.\nAdvertisementAdvertisement"
  },
  {
    "headline": "Structure, not candidate is the problem of Nigeria",
    "summarized_story": "A Chief Lecturer at the National Institute of Journalism, Dr. Jide Johnson said there’s need to “restructure” the Nigerian system and “bring power back to the people”.\nHe disclosed while featuring on TVC’s This Morning show with Yori Folarin.\nAdvertisementThe former deputy Provost at the Institute of Journalism said Nigerians should not see candidates seeking political office as the problem of the country, rather the structure the country is operating.\nAdvertisement"
  },
  {
    "headline": "All Set for Zenith Bank’s 7th Annual International Trade Seminar on Non-Oil Export",
    "summarized_story": "The seventh Annual Edition of the Zenith Bank International Trade Seminar would be held on Wednesday, July 20, 2022, at the Civic Centre, Victoria Island, Lagos, and virtually by 9.00 am.\nThe seminar with the theme: “Unlocking Opportunities in Nigeria’s Non-Oil Export Business,” was part of Zenith Bank’s efforts to support the Central Bank of Nigeria’s (CBN) initiatives to grow the country’s non-oil export sector.\nAccording to a statement, the forum would provide an opportunity for all participants, including relevant government agencies, to explore ways to unlock the immense opportunities in Nigeria’s non-oil export sector.\nThe second panel, titled: “Funding/Logistics/Government Support for the Non-Oil Export Sector,” would explore the availability of long-term funds, insurance & reinsurance, and risk-sharing mechanism for the non-oil export sector.\nThe third panel discussion titled, “The ABC of Non-Oil Export,” would focus on the pitfalls in the non-oil export business, standardisation and grading of primary export products, as well as the export of services, especially the burgeoning Nigerian creative industry."
  },
  {
    "headline": "Buhari Congratulates Osun Governor-Elect Adeleke, Says People’s Will Must Be Respected",
    "summarized_story": "“With everything that we have all witnessed here in Osun State, one lesson remains clear: the people of Nigeria want better.\n“On behalf of the government and the good people of Oyo State, I congratulate the Osun State Governor-Elect, Senator Ademola Adeleke and the people of Osun State on this victory.\n“I congratulate the governor-elect of Osun State, Senator Ademola Adeleke for his victory in the well-conducted polls last Saturday.\nAvoid Litigation, Congratulate Adeleke, Lawyer Tells OyetolaHuman rights lawyer, Pelumi Olajengbesi, has asked the Osun State Governor, Gboyega Oyetola, to concede defeat and congratulate the governor-elect of the state, Senator Ademola Adeleke.\n“Your perseverance, steadfastness, focus, determination and unwavering commitment to the wellbeing of the citizens of Osun State has paid off."
  },
  {
    "headline": "Nigeria to Continue Setting Petrol Prices Despite NNPC’s Transition to Commercial Entity",
    "summarized_story": "The Group Chief Executive Officer (GCEO) of the Nigerian National Petroleum Company Limited (NNPC), Mallam Mele Kyari, has maintained that determination of fuel prices would continue to be a decision by the federal government despite the firm’s transitioning to a commercial entity.\n“The state has continued to maintain that we must continue to pay subsidy on petroleum products.\nNNPC is a partner company for the global EITI initiative, like very many other private companies that voluntarily chose to become partner company to the EITI.\nBeyond just publishing your financial statements, there are very many other disclosure requirements for being a partner company to EITI.\n“We believe that this is good for our company, we will continue to sustain this."
  },
  {
    "headline": "Nigeria Labour to Embark on Nationwide Protest Over Closed Universities",
    "summarized_story": "The Nigeria Labour Congress (NLC) has expressed its resolve to hold a two-day national protest to demand the immediate reopening of the country’s public-owned tertiary institutions which have been shut for five months.\nThe NLC accused the federal government of not negotiating in good faith to resolve the crisis in Nigeria’s public Universities.\nAmong the resolutions reached at the NEC meeting were the condemnation of the alleged unserious attitude of government to negotiations as well the activation of, “no work–no pay” policy on the striking university workers.\nThe NEC went on to resolve to organise a one-day solidarity action in support of Congress affiliates in the education sector.\n“We challenge the self-acclaimed “Conciliator,” Dr. Chris Ngige to produce any factual evidence to back his crooked claims,” he stated."
  },
  {
    "headline": "Sri Lanka: Acting President Declares State of Emergency Ahead of MPs’ Vote",
    "summarized_story": "Sri Lanka’s acting president, Ranil Wickremesinghe, has declared a state of emergency as his administration seeks to quell social unrest and tackle an economic crisis gripping the island nation.\nWickremesinghe had announced a state of emergency last week, after president Gotabaya Rajapaksa fled the country to escape a popular uprising against his government.\nBhavani Fonseka, senior researcher at the Centre for Policy Alternatives, said declaring a state of emergency was becoming the government’s default response.\nWickremesinghe will be the candidate for the Rajapaksas’ ruling party, the Sri Lanka Podujana Peramuna (SLPP), which still has the largest number of seats in parliament.\nHe stands a high chance of being elected after the vote by MPs in parliament scheduled for next Tuesday or Wednesday."
  }
]