[
  {
    "headline": "NDLEA intercepts N6.5bn drugs in Lagos, goes after fleeing baron",
    "summarized_story": "A suspected drug baron, Tony Onwurolu, has been declared wanted by the National Drug Law Enforcement Agency as the agency recovered a consignment of 26.150 kilogrammes of heroin at the SAHCO shed of the Murtala Mohammed International Airport, Ikeja, Lagos.\nIt was gathered that the drug, with a street value of N6.5bn, arrived in Lagos on June 30, 2021, in 25 parcels from South Africa through a private Nigerian airline.\nA statement by the Director, Media and Advocacy, NDLEA, Femi Babafemi, on Sunday, said the consignment was detained for screening following reasonable suspicion of the content.\nThey were, however, able to search his home and recover a number of documents to establish his true identity.\nGen. Mohamed Buba Marwa (retd), has directed that the fleeing drug baron, Tony Chidi Onwurolu, be declared wanted immediately and his details submitted to Interpol for tracking across the world."
  },
  {
    "headline": "Septuagenarian body decomposes as sisters keep mother’s corpse for nine days",
    "summarized_story": "Residents of Universal Road, in the Okhoro area of Benin, Edo State, were in shock on Sunday after discovering the decomposing body of a septuagenarian, Mrs Agbenese Oshoma, nine days after she died.\nThe two sisters reportedly went about their daily activities inside the house while their mother’s corpse decomposed.\nOur correspondent gathered that the two children told the neighbours that they were instructed by the ‘Lord’ not to disclose the death to anybody.\nThe neighbours and the landlord were said to have moved the body to a morgue, while the police were invited.\nThe Edo State Police Public Relations Officer, SP Kontongs Bello, did not take his calls or respond to a text message sent to him as of the time of filing this report."
  },
  {
    "headline": "S’West govs propose six regions, demand LG autonomy, resource control",
    "summarized_story": "Governors in the South-West geopolitical zone have proposed conversion of the present six geopolitical zones into federating units, as part of the ongoing review of the 1999 Constitution by the National Assembly.\nOur correspondent obtained the document containing the proposals by the governors, which was presented to the South-West caucus of the National Assembly on Tuesday.\nAfer the meeting, Akeredolu had said the South-West would be approaching the constitution amendment with a common front.\nThe federating units or regions are divided into the following geopolitical zones: North-West Zone, North-Eastern Zone, Middle – Belt Zone, South-East Zone, South-South Zone, South-West Zone and the Federal Capital Territory.\nAlso, the South-West governors proposed that Section 8 be amended by deleting Subsections 5 and 6, thereby removing the powers to create state from the Federal Government."
  },
  {
    "headline": "LEDAP, Malala Fund embark on awareness campaign to address school drop-out, others",
    "summarized_story": "By Bashir Bello, KanoWorried by the high rate of out of school children, a Non-Governmental Organization, Legal Defence and Assistance Project (LEDAP) in partnership with Malala Fund says it is embarking on an awareness campaign to address the trend.\nMaryam Ahmad further decried the high rate of out of school children in the country which stands at 13.5 million.\nCrisis, insecurity, cultural and religious dispositions and poor funding have been limiting factors to quality education in these states.\n“The emergence of the novel COVID-19 pandemic has further put a strain on child education.\n“Against this backdrop, LEDAP in conjunction with Malala Fund is raising awareness on the right to free, compulsory and quality basic education in Nigeria."
  },
  {
    "headline": "SDGs on energy: Indigenous, US firms sign MoU for production of HDPE in Nigeria",
    "summarized_story": "HDPE pipes and fittings are useful in several applications, including pipelines, buried firewater, potable water, and wastewater management systems.\nQSES is an integrated innovation and business solutions provider to the Energy, Manufacturing, and Agro-allied sectors of the economy.\nThe vision of the company is to be the foremost energy and business solutions provider across the vast economic spectrum in sub-Saharan Africa and the world.\nISCO Industries, founded in 1962, is a total piping solutions provider headquartered in the USA supplying a wide variety of HDPE pipe and piping materials to projects across the world.\nISCO has more than 35 locations in North America and holds a significant stock of HDPE pipe and piping products."
  },
  {
    "headline": "Buhari mourns Barntex, former Kaduna deputy governor",
    "summarized_story": "President Muhammadu Buhari has joined the government and people of Kaduna State to mourn Mr Barnabas Bala Bantex, who died in Abuja on Sunday.\nBarntex was Gov Nasiru el-Rufai’s deputy in his first tenure which spanned from 2015 and 2019.\nBuhari, in a condolence message by his Senior Special Assistant on Media and Publicity, Malam Garba Shehu, on Sunday in Abuja, described the deceased as a “true gentleman and consummate professional”.\nThe president also affirmed that the former Deputy Governor, who served as chairman of Kaura Local Government and represented Kaura in the House of Representatives, was a potent voice on peace, stability and progress.\nThe News Agency of Nigeria (NAN) reports that Barntex was the pioneer Chairman of the APC in the north-western state."
  },
  {
    "headline": "Makinde mourns Oyo-born rapper, Sound Sultan",
    "summarized_story": "Governor Seyi Makinde of Oyo State, on Sunday, described the death of an Iseyin.\nOyo State-born singer, Lanre Fasasi, popularly known as Sound Sultan, as a huge loss to the state and the entertainment world.\nThe statement quoted the governor as describing Sound Sultan as a ‘humble, great talent and a shining light’ who has positively impacted the society with his act.\n“The news of the death of popular singer and producer, Lanre Fasasi, popularly known as Sound Sultan, unsettled me greatly.\n“In him, Oyo State lost a great and humble artiste and ambassador."
  },
  {
    "headline": "Killing of UNICAL Student: Army apprehends Soldier, sets up investigation board",
    "summarized_story": "“On receiving the information, the soldier was apprehended by own troops, while trying to flee out of the town to evade arrest.\n“He is currently in the custody of the Military Police and investigation has commenced to ascertain the circumstances that led to the killing of the student.\n“He assured them of the commitment of Nigerian Army authorities towards ensuring that justice prevails in the unfortunate incident.\n“The Nigerian Army remains a disciplined and professional organization and will not condone such unprofessional conduct by any of its personnel.\n“The Nigerian Army will continue to operate within the ambit of the law, hence, would not tolerate any act of infringement on the fundamental human rights of citizens by its personnel."
  },
  {
    "headline": "Police confirm kidnapping of Emir of Kajuru, 10 others in Kaduna",
    "summarized_story": "The Police Command in Kaduna State said the Emir of Kauru, Alhaji Alhassan Adamu and ten members of his immediate family were abducted by armed bandits in the early hours of Sunday.\nThe state police Command in a statement by its State Police Public Relations Officer, ASP Mohammed Jalige said, “The incident occurred about 0234hrs when armed wielding bandits in large numbers invaded Kajuru town, shot sporadically and gained access into the Chief’s residence where they abducted him and ten members of his immediate family to an unknown destination.”The statement explained that the Kaduna Police Command through the Divisional Police Officer (DPO) Kajuru, Kaduna is in receipt of an unfortunate report on the kidnap of the Chief of Kajuru, His Royal Highness, Alhaji Alhassan Adamu in the early hours of today 11th July, 2021.\nThe police noted further that notwithstanding, the Joint patrol of the Police Mobile Force (PMF), conventional Police and the Nigerian Army attached to Kajuru LGA are currently engaged in search and rescue mission around the forest for a possible rescue of the victims while IGP’s Tactical units have been contacted for technical support.\nThe Command said it is saddened with the incident and it’s not relenting in ensuring lasting solution to current upsurge of criminality in the state.\nThe statement enjoined members of the public to remain calm and always support the Police and other security agencies with credible information that will enable them curtail any possible attack on innocent citizens before it happened."
  },
  {
    "headline": "Railway projects: Why we ignore Nigerians, award contracts to Chinese",
    "summarized_story": "The Minister of Transportation, Rotimi Ameachi, has disclosed why local contractors cannot handle big rail construction projects in the country.\nAmaechi said local contractors lack the capacity to handle big rail construction projects they want.\nHe spoke in Lagos State while responding to agitation from local contractors on why they have been sidelined in the award of rail contracts.\nAmaechi said local contractors needs to acquire the requisite experience before they could handle rail projects in Nigeria.\nshow us you have the capacity and equipment and we will choose you.”Railway projects across Nigeria are handled by Chinese companies."
  },
  {
    "headline": "Scores feared dead, churches, houses burnt as communities clash in Benue",
    "summarized_story": "Unspecified number of persons have been killed in a communal clash that broke out between Ipav and Yandev communities in Gboko Local Government Area of Benue State.\nDAILY POST gathered that the incident, which began on Saturday and lasted till Sunday evening, was due to a land dispute between Mbakpegh of Ipav and Mbatur of Yandev communities at the bank of a stream called Amboor.\nIt was learnt that over 30 houses including worship centers were razed down during the incident.\nAn eyewitness, James Aondover, who posted the development on his Facebook account, said economic tress like oranges, mangoes and cashews were cut down by the warring communities.\nMore to follow……"
  },
  {
    "headline": "COVID-19 third wave: Isolation wards getting full again",
    "summarized_story": "The Governor of Lagos State, Babajide Sanwo-Olu, has said the isolation centres in the state are getting occupied again.\nSanwo-Olu, during a media briefing on Sunday, expressed concern over the increasing cases in the state and hinted there is a potential third wave in Lagos.\nAccording to him, the isolation centres have recorded a five per cent increase in occupancy in two weeks.\n“The rapid increase within a week gives great cause for concern.\nAlso, within the last two weeks, the occupancy rate at our two isolation centres increased from an average of one per cent to sic per cent,” Sanwo-Olu said."
  },
  {
    "headline": "Atiku reacts to death of singer",
    "summarized_story": "Former presidential candidate of the Peoples Democratic Party, PDP, Atiku Abubakar, has reacted to the death of Olanrewaju Fasasi also known as Sound Sultan.\nAtiku described Sound Sultan as a role model to people in the entertainment world.\nIn a tweet, the former Vice President wrote: “In the short time Olanrewaju Fasasi, fondly known as Sound Sultan, spent on this side of the divide, he was a role model to many in the world of entertainment.\n“May the devout man of faith and family Rest In Peace.\nAmeen.”Sound Sultan died in the United States, US, on Sunday after a battle with Angioimmunoblastic T-Cell Lymphoma."
  },
  {
    "headline": "12 memorable facts about Sound Sultan",
    "summarized_story": "By Samuel OamenPopular rapper Lanre Fasasi aka Sound Sultan died on Sunday July 11, 2021.\nHere are facts about Sound Sultan you should know:1.\nSound Sultan began a working relationship with Wyclef Jean, featuring alongside 2face Idibia and Faze on “Proud to be African” from Wyclef’s welcome to Haiti: Creole 101 album.\nIn 2009, Sound Sultan married his long-term girlfriend Chichi Morah, now known as Farida Fasasi from Igbo ethnic group.\nIn 2015, Sound Sultan released the rap single “Remember” after a long absence from the music scene."
  },
  {
    "headline": "PHOTOS: Messi smiles at last as Argentina win Copa America",
    "summarized_story": "Many studies have established that at least 1 out of 4 couples today struggle with one infertility problem or another,..."
  },
  {
    "headline": "Champion Messi speaks after Copa America win",
    "summarized_story": "Agency ReporterThe Barcelona star struggled to contain his emotions after helping Argentina to Copa America glory by beating Brazil 1-0Lionel Messi spoke of his “immense happiness” after the Argentina star finally ended his long wait for international glory with victory in the Copa America final against Brazil.\nA first-half goal from Angel di Maria was enough to secure a 1-0 victory against Brazil at Maracana and secure Argentina’s first Copa America title since 1993.\nMessi was named player of the tournament after scoring four goals and laying on five assists in what was his 10th tournament appearance for his country.\nSpeaking to reporters after the game a clearly emotional Messi attempted to comprehend the scale of his achievements.\n“I feel that God was saving this moment for me, against Brazil in the final and in his country."
  },
  {
    "headline": "Eunisell pledges to help marginal field owners accelerate oil production",
    "summarized_story": "Oil Service Company, Eunisell Limited has pledged assistance to new owners of Marginal Oil & Gas Fields in Nigeria, in accelerating the development of their fields.\nThe commitment was made at a recent meeting between Eunisell Limited and select owners of marginal fields in Lagos.\nMarginal field owners in Nigeria face significant challenges that hamper the development of their fields.\nADVERTISEMENTIkenga pledged his company will provide oil field owners’ production solutions that will help them overcome these challenges.\nWith 25-year experience in Nigeria, Eunisell is known for delivering fast track production solutions to Oil & Gas exploration and production companies in West Africa."
  },
  {
    "headline": "Sound Sultan buried in New York",
    "summarized_story": "Olanrewwaju Abdul-Ganiu Fasasi popularly known as Sound Sultan who died early Sunday of throat cancer was buried in accordance with Muslim rites.\nThe late multi-talented singer who passed on at the age of 44 following his battle with Angioimmunoblastic T- Cell Lymphoma was buried at 3:00 PM New York time at the Marlboro Muslim Cemetery, Morganville, New York.\nThe late Sound Sultan is survived by his wife, three children and siblings.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Kingdom wins Nigerian Idol season 6",
    "summarized_story": "By Rita OkoyeKingdom Kroseide has emerged the winner of the Nigerian Idol season 6.\nThis was announced at the Grand Finale which held at the Africa Magic studios on Sunday, July 11.\nKingdom battled with Francis Atela for the most-coveted title of the Nigerian Idol season 6 winner and emerged victorious."
  },
  {
    "headline": "Kaduna ex-Deputy Governor, Bantex is dead",
    "summarized_story": "From Noah Ebije, KadunaThe immediate past Deputy Governor of Kaduna State, Arc.\nBarnabas Bala Bantex has been reported dead in an Abuja hospital today.\nBantex was governor Nasir El-Rufai’s Deputy between 2015 to 2019 when he left government house to contest for southern Kaduna Senatorial seat, but lost the election under APC ticket.\nDetails later.\nSent from Yahoo Mail on AndroidBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Sound Sultan dies of throat cancer at 44",
    "summarized_story": "By Rita Okoye, LagosPopular Nigerian rapper Olanrewaju Fasasi, popularly known as Sound Sultan, has died of throat cancer in the United States.\nSound Sultan’s career in show business started in the 1990s when he hosted shows to raise money for studio sessions.\nSound Sultan began a working relationship with Wyclef Jean when featured alongside 2Face Idibia and Faze on “Proud to be African” from Wyclef’s Welcome to Haiti: Creole 101 album.\nIn 2012, it was announced that Sound Sultan was made a UN Ambassador for Peace for his exemplary lifestyle and career.\nIn 2015, Sound Sultan released the rap single “Remember” after a long absence from the music scene."
  },
  {
    "headline": "BREAKING! Kanu: Ohanaeze breaks silence, constitutes legal team",
    "summarized_story": "From Magnus Eze, EnuguThe Ohanaeze Ndigbo Worldwide has bared its mind on the interception and re-arraignment of leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nNational Executive Committee (NEC) of the apex Igbo body rose from its meeting in Enugu, Saturday, pledging to monitor every aspect of the trial process.\nA communique released by its spokesman, Alex Ogbonnia said the group has constituted a committee of eminent Igbo lawyers and leaders to track the proceedings throughout the trial.\nThe communique read: “That Ohanaeze Ndigbo Worldwide has observed with keen interest the recent re-arraignment and consequent trial of our son, Mazi Nnamdi Kanu.\n“That as part of our avowed determination to ensure the fair trial of Mazi Nnamdi Kanu, we have constituted a legal team led by the National Legal Adviser of Ohanaeze Ndigbo Worldwide and eminent Igbo leaders to monitor the legal proceedings, throughout the trial."
  },
  {
    "headline": "Barnabas Bala, Ex-Deputy Governor of Kaduna, is Dead",
    "summarized_story": "By John ShiklamThe immediate past deputy governor of Kaduna state, Mr. Barnabas Bala (Bantex), is dead.\nHe was at one time Chairman of Kaura Local Government Area of Kaduna state.\n“Bantex had served the people of Kaduna State in several capacities prior to becoming Deputy Governor.\n“We would miss his brilliance and his commitment to Kaduna State, his easygoing manners, his sense of humour and steadfastness to his convictions.\n“I have spoken to his family and conveyed our condolence on behalf of the government and people of Kaduna State."
  },
  {
    "headline": "Breaking: Popular Nigerian Singer, Sound Sultan, is Dead",
    "summarized_story": "By Vanessa ObiohaPopular Nigerian singer Olanrewaju Fasasi, known as Sound Sultan, has passed on.\n“It is with heavy hearts that we announce the passing of our multitalented veteran singer, rapper, songwriter Olanrewaju Fasasi aka Sound Sultan,” read the statement.\nThe music industry too was churning out new hip hop stars like the Plantashun Boiz, Remedies and a host of others.\nWith his big brother Baba Dee paving way for him in the industry, Sultan soon had the klieg lights on him.\nAn unconventional storyteller, he marked his 18th anniversary in the music industry in 2018."
  },
  {
    "headline": "Diplomatic Community Meets, Writes N’Assembly over Draft Electoral Law",
    "summarized_story": "A meeting between the National Assembly leadership and a group of five foreign envoys, including the European Union, led by the United Kingdom held last week.\nAccording to National Assembly sources privy to the meeting as well as the letter, the countries, included the United Kingdom, France, United States, and the European Union.\nBut fingers are being pointed at the leadership of the National Assembly.\nMany of National Assembly members are believed to be readying to seek election in other capacities in 2023.\nMark Terseer Gbillah, alleged that the Senate made 20 illegal insertions into the 2021 Electoral Bill under consideration in the National Assembly."
  },
  {
    "headline": "APC Writes INEC, Demands Indefinite Postponement of Party Congresses",
    "summarized_story": "But National Secretary of APC, Senator John Akpanudoedehe, said the party did not intend a postponement of the congresses but to cure legal landmines since the earlier date was not sacrosanct.\nThe APC national secretary said, “The above document in circulation did not intend a postponement of the ccongresses.\n“Those who have not been registered in these states can purchase forms for congresses, party office elections and convention.\nDauda stated, “The postponement is another scheme to perpetually remain in office, even though they are occupying such offices illegally.\nThe postponement, according to political analysts, may have put the permutations of potential presidential contenders in suspense."
  },
  {
    "headline": "Kanu-Agabi Leads PDP’s Legal Team in Bid to Oust Matawalle, Others",
    "summarized_story": "But a massive crowd of PDP supporters yesterday treated Zamfara State Deputy Governor Mahdi Gusau, who remained in the party, to a tumultuous welcome in the state capital, Gusau.\nThe legal action, THISDAY gathered, was not limited to Matawalle, as it would also challenge the legality of the defection of members of the national and state assemblies from Zamfara State.\nThose who accompanied the deputy governor included his father, Gen Aliyu Gusau, and PDP caretaker committee members.\nHe maintained that as the highest political office holder in the party, he had become the leader of the party in the state.\nThe former publicity secretary dispelled insinuations that all the state House of Assembly members had moved to APC with the governor."
  },
  {
    "headline": "BREAKING: Nigerian Singer, Sound Sultan Is Dead",
    "summarized_story": "Nigerian singer, Olanrewaju Fasasi, popularly known as Sound Sultan is dead.\nSaharaReporters in May 2021 reported that Sound Sultan was battling with throat cancer in the United States of America.\nIt’s usually used to treat cancer, as cancer cells grow and divide faster than other cells.\nIn 2012, it was announced that Sound Sultan was made a UN Ambassador for Peace for his exemplary lifestyle and career.\nIn 2015, Sound Sultan released the rap single \"Remember\" after a long absence from the music scene."
  },
  {
    "headline": "BREAKING: Nigerian Singer, Sound Sultan Is Dead",
    "summarized_story": "Nigerian singer, Olanrewaju Fasasi, popularly known as Sound Sultan is dead.\nSaharaReporters in May 2021 reported that Sound Sultan was battling with throat cancer in the United States of America.\nIt’s usually used to treat cancer, as cancer cells grow and divide faster than other cells.\nIn 2012, it was announced that Sound Sultan was made a UN Ambassador for Peace for his exemplary lifestyle and career.\nIn 2015, Sound Sultan released the rap single \"Remember\" after a long absence from the music scene."
  },
  {
    "headline": "BREAKING: Bandits Abduct Emir, 13 Other Family Members In Kaduna",
    "summarized_story": "Gunmen suspected to be bandits have abducted the Emir of Kajuru, Alhaji Alhassan Adamu Kajuru and 13 of his family members in his palace.\nIt was gathered that the 85-year-old monarch was abducted alongside Salama Kajuru, Abubakar Kajuru and his grandchildren on Sunday morning.\nAlhaji Mustapha Abubakar Kajuru, editor of Taskira Hausa Newspaper confirmed the incident.\n“They abducted the Emir and the Salama of Kajuru, Alhaji Abubakar Kajuru and his grandchildren.\nAll in all, 13 family members were abducted with the Emir,” he said."
  },
  {
    "headline": "BREAKING: Bandits Abduct Emir, 13 Other Family Members In Kaduna",
    "summarized_story": "Gunmen suspected to be bandits have abducted the Emir of Kajuru, Alhaji Alhassan Adamu Kajuru and 13 of his family members in his palace.\nIt was gathered that the 85-year-old monarch was abducted alongside Salama Kajuru, Abubakar Kajuru and his grandchildren on Sunday morning.\nAlhaji Mustapha Abubakar Kajuru, editor of Taskira Hausa Newspaper confirmed the incident.\n“They abducted the Emir and the Salama of Kajuru, Alhaji Abubakar Kajuru and his grandchildren.\nAll in all, 13 family members were abducted with the Emir,” he said."
  },
  {
    "headline": "Nigerian Army Reacts To Soldier Killing Final-Year Varsity Student In Calabar",
    "summarized_story": "The Nigerian Army has confirmed that one of its personnel shot dead a final-year student of the University of Calabar, Mr Gray Agbesu, on Friday, July 9.\nThe soldier was one of the personnel deployed to the Calabar Correctional Service facility.\nHe assured them of the commitment of Nigerian Army authorities towards ensuring that justice prevails in the unfortunate incident.\n“The Nigerian Army remains a disciplined and professional organisation and will not condone such unprofessional conduct by any of its personnel.\nThe Nigerian Army will continue to operate within the ambit of the law, hence, would not tolerate any act of infringement on the fundamental human rights of citizens by its personnel."
  },
  {
    "headline": "EXPLAINER: What is lymphoma -- the cancer that killed Sound Sultan?",
    "summarized_story": "He is survived by his wife, three children, and his siblings.”AdvertisementHere is what you should know about the form of cancer that killed Sound Sultan.\nLymphocytes are a type of white blood cell that fights infection, according to the American Society of Hematology.\nAdvertisementOnce present in the lymph system, lymphoma can quickly spread to different tissues and organs.\nAccording to the National Genome Research Institute, lymphoma can be broadly classified into two — Hodgkin’s lymphoma and non-Hodgkin’s lymphoma.\nAITL is a form of cancer that affects the T-cells, which are the forms of white blood cells that destroy body cells that have become cancerous."
  },
  {
    "headline": "EXPLAINER: What is lymphoma -- the cancer that killed Sound Sultan?",
    "summarized_story": "He is survived by his wife, three children, and his siblings.”AdvertisementHere is what you should know about the form of cancer that killed Sound Sultan.\nLymphocytes are a type of white blood cell that fights infection, according to the American Society of Hematology.\nAdvertisementOnce present in the lymph system, lymphoma can quickly spread to different tissues and organs.\nAccording to the National Genome Research Institute, lymphoma can be broadly classified into two — Hodgkin’s lymphoma and non-Hodgkin’s lymphoma.\nAITL is a form of cancer that affects the T-cells, which are the forms of white blood cells that destroy body cells that have become cancerous."
  },
  {
    "headline": "Afenifere: Only restructuring can save Nigeria from catastrophe",
    "summarized_story": "The executive council of Afenifere, a pan Yoruba socio-political organisation, has warned of looming disaster if Nigeria does not return to “true federalism”.\nAnd the most potent recipe to prevent the catastrophe is restructuring that would return the country to true federalism,” the statement reads.\n“After reviewing recent developments in the country, Afenifere executive council said that the signs are ominous, requiring steps to prevent the country from apocalypse.\n“The executive council meeting called on President Muhammadu Buhari, the national and state assemblies and all other concerned authorities to ensure that restructuring takes place within remaining part of this year.\n“Afenifere is in full support of the governors to have laws banning open grazing latest by September 1, this year."
  },
  {
    "headline": "Afenifere: Only restructuring can save Nigeria from catastrophe",
    "summarized_story": "The executive council of Afenifere, a pan Yoruba socio-political organisation, has warned of looming disaster if Nigeria does not return to “true federalism”.\nAnd the most potent recipe to prevent the catastrophe is restructuring that would return the country to true federalism,” the statement reads.\n“After reviewing recent developments in the country, Afenifere executive council said that the signs are ominous, requiring steps to prevent the country from apocalypse.\n“The executive council meeting called on President Muhammadu Buhari, the national and state assemblies and all other concerned authorities to ensure that restructuring takes place within remaining part of this year.\n“Afenifere is in full support of the governors to have laws banning open grazing latest by September 1, this year."
  },
  {
    "headline": "'COVID-19 cases increasing' — Sanwo-olu warns Lagos residents of third wave",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos state, has asked residents to comply with all COVID-19 protocols while warning of the third wave of the pandemic.\nAdvertisementSanwo-Olu said the state is experiencing what “appears to be the start of a potential 3rd wave of the COVID-19 pandemic”.\nAlso, within the last two weeks, the occupancy rate at our 2 isolation centres increased from an average of 1% to 6%.\nAdvertisement“Greater vigilance is required at this time in our churches and mosques and other places of religious worship,” he said.\nThe festivities will no doubt bring people together in large numbers and create conditions that can sadly cause the spread of the coronavirus."
  },
  {
    "headline": "Overworked staff, mass exits: The inside story of GTBank’s mobile app and USSD transaction failures",
    "summarized_story": "His orange branded Guaranty Trust Bank (GTB) app had not launched as he tried severally to make a transfer from his current account to the empty savings account linked to the debit card on his Uber app.\nI have not been able to access my GT Mobile App for days now.\nJust ask any GTB customer.\nToday, other banks have adopted it and an estimated 40 million Nigerians use USSD services for mobile banking.\nIts mobile app also has over a million downloads on the Google play store alone."
  },
  {
    "headline": "Peter Njonjo wants to change the way food moves in Africa",
    "summarized_story": "Peter Njonjo started his first business in high school.\nHis name is Peter Njonjo and this is his life in tech.\nHe chose to attend the United States International University Africa (USIUA), a private university in Nairobi.\nThree years later, he would be in charge of Coca-Cola’s operations in six countries across East Africa: Kenya, Uganda, Tanzania, Ethiopia, Eritrea, and Mozambique.\nI’m the firstborn of four children.”That is how Peter Njonjo starts his story on our call."
  },
  {
    "headline": "MultiChoice’s bank accounts blocked in Nigeria over alleged ₦1.8 trillion tax fraud",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) on Thursday said it has directed commercial banks to freeze the accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA), in an attempt to recover ₦1.8 trillion in taxes from the companies.\nMultiChoice Group is a South African entertainment giant and owner of the popular DStv and GOtv services.\nParticularly, [MultiChoice Nigeria Limited] has avoided giving the FIRS accurate information on the number of its subscribers and income,” he said.\nAccording to the FIRS chair, Nigeria contributed 34% of total revenue for the group and the bulk of revenue for MultiChoice Africa.\nMultiChoice is the latest South African firm involved in a huge tax scandal in Nigeria."
  },
  {
    "headline": "Nigeria’s Daystar Power secures $20 million from IFC",
    "summarized_story": "Daystar Power, a provider of hybrid solar power solutions to businesses in West Africa, has secured a facility of $20 million from the International Finance Corporation (IFC) to fund its project pipeline in Nigeria.\nFounded in 2017 by Sunrah Ventures, Daystar Power is an off-grid power service provider whose solutions, “Solar-as-a-Service” and “Power-as-a-Service” provide clean and reliable power while significantly reducing overall power costs for clients.\nDaystar Power will receive a $10 million local currency loan from IFC, which will be provided to its Nigerian subsidiary, Daybreak Power Solutions.\nDaystar Power is working with the Canadian-funded IFC program, Energy2Equal, to close gender gaps and increase women’s participation in the renewable energy sector.\nDaystar Power has 29 megawatts (MW) of installed solar power capacity to date."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Smile Identity’s $7m Series A, Safaricom increases cost of airtime, MarketForce’s $2m pre-Series A, Nigeria attempts blocking MultiChoice accounts",
    "summarized_story": "Safaricom increases the cost of airtimeKenyan President, Uhuru Kenyatta, has accepted the Kenyan Parliamentary Committee’s additional taxes proposal.\nKenyan B2B retail platform, MarketForce, has raised $2 million pre-Series A to focus on its business-to-business (B2B) retail marketplace, RajeRaje.\nNigeria to block MultiChoice Nigeria and MultiChoice Africa’s accountsDStv dish.\nYesterday, Thursday, July 8, 2021, Nigeria’s Federal Inland Revenue Service (FIRS) announced that it had directed commercial banks to freeze the accounts of MultiChoice Nigeria Limited (MCN) and MultiChoice Africa (MCA) in an attempt to recover ₦1.8 trillion in taxes from the companies.\nSo, the banks that handle business for MultiChoice Africa and MultiChoice Nigeria were instructed to perform a balanced search on their accounts before undertaking any other transaction on their behalf."
  },
  {
    "headline": "Nigeria’s tax authority queries Multichoice over possible ₦1.8 trillion tax fraud",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) has directed some commercial banks to freeze and recover ₦1.8 trillion ($4.4 billion) from MultiChoice Nigeria (MCN) and MultiChoice Africa’s accounts.\nThe firms are subsidiaries of South Africa-based MultiChoice Group, which provides television and other entertainment services across Africa like DStv, GOtv, and video-on-demand platform, Showmax.\nIn the statement, FIRS said that it discovered that the companies have persistently breached all agreements and undertakings with the Service.\nIt also added that the group’s performance did not reflect in their tax obligations and compliance level in the country.\nAccording to Reuters, MultiChoice Group makes a third of its business elsewhere on the continent outside South Africa."
  },
  {
    "headline": "Kenyan B2B retail platform, MarketForce, raises $2m pre-Series A to scale its B2B e-commerce marketplace for merchants",
    "summarized_story": "End-to-end retail distribution platform, MarketForce, was founded in 2018 by Tesh Mbaabu and Mesongo Sibuti, Chief Executive Officer (CEO) and Chief Technology Officer (CTO), respectively.\nThese stores also help customers access various forms of financial services such as payments, savings, remittances, and insurance.\nPer TechCrunch, the retail startup got into Y Combinator because they utilise FMCG distribution networks.\nRejaReja model, a B2B e-commerce marketplace for merchants, was launched in 2020 to assist informal retail merchants purchase and sell FMCGs and digital financial services.\nAlthough retail distribution is a core business, the CEO stated that finding the right talent and individuals willing to innovate and revolutionise the space has been an interesting challenge."
  },
  {
    "headline": "COVID-19: Sanwo-Olu raises red flag, says 3rd wave likely",
    "summarized_story": "Also, within the last two weeks, the occupancy rate at our isolation centres increased from an average of 1 percent to 6 percent.\nThis is the new and disturbing reality that now confronts us,” Sanwo-Olu said, warning religious centres and private organisations to immediately step up preventive measures.\nSo, Nigeria is counting on us in Lagos State to be resolute in our stand against the virus.\nWe will also focus on sequencing the samples we are collecting to ensure we are detecting and keeping track of the different variants in circulation.\nThe festivities will no doubt bring people together in large numbers and create conditions that can sadly cause the spread of the Coronavirus."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "Gold Post Gains for the 3rd Week in a rowGold ended the week bullish and that counts as the third straight weekly gain for the yellow metal.\nIn the coming week, oil prices are expected to be bearish amid uncertainty over global supplies after an OPEC+ impasse.\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold in the NAFEX window.\nFunding rates are expected to continue their double digits trend in the coming week in the absence of any maturity.\nMarket breadth for the week closed positive with 44 gainers led by UAC-PROP and CUTIX as against 22 losers led by REDSTAREX and ETERNA."
  },
  {
    "headline": "Don’t elevate injustice to statecraft, Nigerians tell Buhari",
    "summarized_story": "Many Nigerians are increasingly getting disturbed about the style of governance of the Muhammadu Buhari administration.\nThe concern for many people is that the alleged injustice is being elevated to a statecraft.\nObservers say Nigeria is on the verge of collapse, if urgent steps are not taken to correct the glaring division arising from the non-inclusive style of the Buhari administration.\nConcerns have continued to grow in Nigeria in recent years over the leadership style of President Buhari.\nPresently, there is general belief that the country is divided as never before, while the policies, conduct, programmes of President Buhari have fueled hatred among the different ethnic groups."
  },
  {
    "headline": "N6.5bn Worth Heroin Intercepts At Lagos Airport By NDLEA …Declares Drug Baron Wanted – Nigerian Observer",
    "summarized_story": "132 Lateef Adegboyega Street, off Ago palace way by Grandmate bus stop Okota, Lagos.\nDuring the follow up operation, Tony Chidi Onwurolu who obviously mounted a counter-surveillance around his neighbourhood fled his home before the arrival of the team of operatives who stormed his residence.\nThey were however able to search his home and recovered a number of documents to establish his true identity.\nGen. Mohamed Buba Marwa (rtd) has directed that the fleeing drug baron, Tony Chidi Onwurolu be declared wanted immediately and his details submitted to Interpol for tracking across the world.\nIn the same vein, operatives of the Command also intercepted a 4.3kg of skunk imported from Canada."
  },
  {
    "headline": "Edo residents commend Command, Control Centre on rapid response to Benin fire emergency – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Residents of Edo State have commended the state government’s Command and Control Centre for responding rapidly to distress call over a fire incident on a two-storey building in Benin City, the state capital.\nA resident in the state, Osagie Moses praised the centre for its quick response to a distress call over a fire incident in Ekehuan Road on Sunday morning.\nOmoluru Osayande urged residents to take advantage of the take advantage of the Centre by calling the Edo Helplines on 08000911911 and 08001235111, for prompt response during emergencies.\nAccording to him, the Edo Command and Control Centre is equipped to respond and coordinate with the relevant agencies of government in responding to emergencies.\nOmoluru Osayande said residents should be proactive in preventing fire outbreaks, noting, “One recurring cause of fire outbreak is carelessness."
  },
  {
    "headline": "Obaseki to flag-off campaign to drive good hygiene, tackle open defecation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will on Friday, July 16, 2021, flag-off the “Clean Nigeria: Use the Toilet” campaign, to drive sustainable sanitation and end open defecation in the state.\nIn a statement, Director, Administration and Supplies, Small Town and Rural Water Supply and Sanitation Agency, Eigbe A.\nEndurance said the governor will launch the campaign at the New Festival Hall in Government House, Benin City.\nAccording to the Director, “Governor Godwin Obaseki, will on Friday, July 16, 2021, chair the one-day official flag-off of the ‘Clean Nigeria: Use the Toilet’ campaign.\nEigbe said the state government has continued to provide more schools, markets, health centres in rural communities with clean water and toilet facilities that would make the environment safe for residents across the state."
  },
  {
    "headline": "Edo govt, FG distribute gadgets, engagement letters to NSIP independent monitors in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Federal Government has distributed engagement letters and monitoring devices to independent monitors to track the success of its National Social Investment Programme (NSIP) in Edo.\nMinister of Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiiya Farouq distributed the engagement letters and tablets to the beneficiaries in Benin City, the Edo State capital.\nAccording to the Minister, “the application, which we call the Social Investment Management Information System (SIMIS), is a mobile and web-based application designed for monitoring the National Social Investment Programme (NSIP).\n“Using this application, the ministry sees real-time reports of activities of the Independent Monitors on the field.\nIn her contribution, the Focal Person of the Social Investment Programme in Edo, Osayuwamen Aladeselu, urged the monitors to assist the government to achieve its vision of improving the lives of the people in Edo."
  },
  {
    "headline": "COVID-19: Oyo records Delta variant, warns against losing guards",
    "summarized_story": "ADVERTISEMENTThe Oyo State government has recorded the more dangerous Delta variant of the coronavirus infection.\nThis is coming a few days after Nigeria’s capital city, the Federal Capital Territory(FCT), recorded the first case of the variant.\nThe statement reads in part: “This strain has been associated with high transmission, increased severity of infection and outcomes.\n“As such, this is to warn that the virus is still very much within the society.”It warned residents of the state to continue to comply with all advisories aimed at curtailing the spread of the virus.\nThe statement added: ”It would be appreciated if all in-bound travelers from overseas maintain the mandatory seven-day isolation and subsequent testing before mingling with the populace."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Yoruba Council hails Buhari over renewed commitment to crush bandits, restates commitment to united Nigeria",
    "summarized_story": "A Yoruba interest group, Igbimo Apapo Yoruba Lagbaye, (Yoruba Council Worldwide), has canvassed support for President Muhammadu Buhari on his push to put an end to banditry and lingering insurgencies in Nigeria.\nThe Federal Government had announced that the military formations and other sister security agencies would rise forcefully against criminal bandits wreaking havoc in the country.\nThe new measure, according to President Buhari would be focused majorly on Zamfara, Kaduna, Kastina and to the hinterland of Oyo, Ekiti, Ondo and other parts of the country, where terrorism and banditry thrive.\nOladotun Hassan, president of the council in a release signed by its Publicity Secretary, Otunba Gboyega Adeoye, commended the effort and encouraged the Federal Government, to spare no rod in the implementation.\nThe group advised Buhari to create a Joint Regional Security Networks Agency to help assist in building stronger and better community intelligence gathering and support base for all security agencies, among other propositions."
  },
  {
    "headline": "NDIC Boss, Hassan Calls for Inclusion of Deposit Insurance Courses in ICAN Programmes",
    "summarized_story": "According to Hassan, this would help to bridge the knowledge gap and address misconceptions on the benefits and limitations of the DIS, particularly its contributions to financial system stability.\nMr. Hassan noted that public awareness was a critical factor towards ensuring the maximum impact and penetration of the benefits of the deposit insurance system on the general public and the financial system as a whole.\nThe NDIC Boss thereafter, congratulated Mrs. Eyitayo on her assumption of office as the 57th ICAN President.\nIn her remarks, Mrs Eyitayo acknowledged the invaluable contributions of the NDIC in stabilizing the financial system in Nigeria.\nShe expressed the commitment of the Institute towards the continued partnership with the Corporation to achieve greater awareness of the deposit insurance system amongst members of the Institute."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Igboho: Illegal invasion, arrest of citizens by FG ungodly – Osun cleric",
    "summarized_story": "By Sunday Oguntuyi, OsogboA cleric in Osun State, Evangelist Paul Olusegun Oyeniran, has called on federal government to desist from unwarranted arrest and intimidation of citizens of the country, as according to him, such act is ungodly and inimical to the scripture.\nEvangelist Oyediran who is the General overseer of the Ambassador of Christ Teaching and Evangelical Ministries (ACTEM), stated this while speaking with newsmen at Ode Omu in Ayedaade local government area of the state over the weekend.\nAccording to the man of God, the present administration of President Mohammadu Buhari started well but need to take caution in the area of unwarranted invasion of the citizens which may cause spontaneous reaction from the people in the country.\nOyediran cited invasion of Sunday Igboho at Soka in Ibadan by the men of Department of State Service (DSS), as an example, noting that the action has been generating a lots of reactions.\nOyeniran admonished the government to toe the line of peace and not allow segregation in the country which may occure as a result of its actions."
  },
  {
    "headline": "Bantex: Kaduna Govt Declares Monday Work-free Day",
    "summarized_story": "The Kaduna State government has formally announced the death of former deputy governor of the state, Barnabas Yusuf Bala (Bantex).\nThe state government has also declared Monday, July 12, 2021 as a work-free day in honour of his memory and service to the state.\nA statement signed by the special adviser to the governor (Media & Communication), Muyiwa Adekeye, on Sunday, said Architect Barnabas Bala, who served as deputy governor of Kaduna State from May 2015 to May 2019, died on Sunday in Abuja.\nHe said Governor Nasir El-Rufai has sent a personal message of condolence to the family, noting that it was a blessing to know Bantex and to work with him.\n“The governor acknowledged his commitment to the progress of Kaduna State and prayed God to grant him peaceful repose and to comfort his family,” the statement added."
  },
  {
    "headline": "Bantex: Kaduna Govt Declares Monday Work-free Day",
    "summarized_story": "The Kaduna State government has formally announced the death of former deputy governor of the state, Barnabas Yusuf Bala (Bantex).\nThe state government has also declared Monday, July 12, 2021 as a work-free day in honour of his memory and service to the state.\nA statement signed by the special adviser to the governor (Media & Communication), Muyiwa Adekeye, on Sunday, said Architect Barnabas Bala, who served as deputy governor of Kaduna State from May 2015 to May 2019, died on Sunday in Abuja.\nHe said Governor Nasir El-Rufai has sent a personal message of condolence to the family, noting that it was a blessing to know Bantex and to work with him.\n“The governor acknowledged his commitment to the progress of Kaduna State and prayed God to grant him peaceful repose and to comfort his family,” the statement added."
  },
  {
    "headline": "New Fibroid Care Centre Will Stem Medical Tourism In Nigeria-Dr Abayomi",
    "summarized_story": "In a bid to avert the $1.2 billion spent on medical tourism yearly in Nigeria, a state-of-the-art Fibroid Care Centre has been launched in the country.\nThe CEO/managing director, Fibroid Care Centre, Dr. Abayomi Ajayi, at the official opening ceremony of the Centre on Friday, said the Fibroid Care Centre is a contribution to the Nigeria government’s efforts in averting medical tourism in the country.\nThe managing director explained that the Fibroid Care Centre is a specialist healthcare facility focused on giving Nigerian women best-in-class minimally and non-invasive solutions to their fibroid challenges.\nMeanwhile, some of the women who have accessed fibroid treatment at the centre, expressed gratitude to God, for using Dr. Ajayi to help them live more fulfiled lives.\nI urge women to try the HIFU treatment option."
  },
  {
    "headline": "New Fibroid Care Centre Will Stem Medical Tourism In Nigeria-Dr Abayomi",
    "summarized_story": "In a bid to avert the $1.2 billion spent on medical tourism yearly in Nigeria, a state-of-the-art Fibroid Care Centre has been launched in the country.\nThe CEO/managing director, Fibroid Care Centre, Dr. Abayomi Ajayi, at the official opening ceremony of the Centre on Friday, said the Fibroid Care Centre is a contribution to the Nigeria government’s efforts in averting medical tourism in the country.\nThe managing director explained that the Fibroid Care Centre is a specialist healthcare facility focused on giving Nigerian women best-in-class minimally and non-invasive solutions to their fibroid challenges.\nMeanwhile, some of the women who have accessed fibroid treatment at the centre, expressed gratitude to God, for using Dr. Ajayi to help them live more fulfiled lives.\nI urge women to try the HIFU treatment option."
  },
  {
    "headline": "SERAP Asks Court To Slash Buhari, Govs, NASS Members’ Allowances",
    "summarized_story": "The group said this should be done by the duo by performing their statutory functions.\nSERAP said slashing jumbo pay for these high-ranking political office-holders would reduce the unfair pay disparity between political officer holders and judicial officers.\nThe rights organisations said addressing the persistent poor treatment of judges, would improve access of victims of corruption to justice and effective remedies.\nThe suit said the remuneration and allowances of judges have fallen substantially behind the average salaries and allowances of high-ranking political office-holders such as President, Vice-President, governors and lawmakers.\n“The review of the remuneration, allowances, and conditions of service for political, public and judicial office holders carried out by the RMAFC in 2009 shows a huge disparity between the remuneration and allowances of judges and those of high-ranking political office-holders."
  },
  {
    "headline": "Three dead after rainstorm in Ebonyi",
    "summarized_story": "NO fewer than three persons were weekend struck dead by thunder in Afikpo Town, Afikpo North Local Government Area of Ebonyi state.\nIt was gathered that the incident happened in the Ngodo community during a heavy downpour that lasted for over 5 hours.\nHe said: “Yes, it is true that thunder killed three persons in our place.\nAnother resident, Eze Christian Egwu told Vanguard that the heavy downpour started about 10:am on that fateful day.\nIt is true that thunderstruck; two persons dead in Ngodo”."
  },
  {
    "headline": "Three dead after rainstorm in Ebonyi",
    "summarized_story": "NO fewer than three persons were weekend struck dead by thunder in Afikpo Town, Afikpo North Local Government Area of Ebonyi state.\nIt was gathered that the incident happened in the Ngodo community during a heavy downpour that lasted for over 5 hours.\nHe said: “Yes, it is true that thunder killed three persons in our place.\nAnother resident, Eze Christian Egwu told Vanguard that the heavy downpour started about 10:am on that fateful day.\nIt is true that thunderstruck; two persons dead in Ngodo”."
  },
  {
    "headline": "Fresh protest in Abuja Dunamis Church",
    "summarized_story": "On their way out of the church, they were ambushed by Dunamis Church security who handed them over to the DSS after they were mercilessly tortured.\nWe have demanded the Dunamis Church to secure their release and we have also sued both Dunamis Church and the DSS.\n“The reaction of Dunamis church to the protest by family and friends of the arrested youths have yet again that the church is in direct connivance with the regime in the detention of the activists.\n“It is to this end that we state categorically that we’d be occupying the Dunamis Church if the activists are not released and allowed to return to their families.\nAnd with this, we want to state categorically that mobilizations have now begun to picket the Dunamis Church."
  },
  {
    "headline": "Fresh protest in Abuja Dunamis Church",
    "summarized_story": "On their way out of the church, they were ambushed by Dunamis Church security who handed them over to the DSS after they were mercilessly tortured.\nWe have demanded the Dunamis Church to secure their release and we have also sued both Dunamis Church and the DSS.\n“The reaction of Dunamis church to the protest by family and friends of the arrested youths have yet again that the church is in direct connivance with the regime in the detention of the activists.\n“It is to this end that we state categorically that we’d be occupying the Dunamis Church if the activists are not released and allowed to return to their families.\nAnd with this, we want to state categorically that mobilizations have now begun to picket the Dunamis Church."
  },
  {
    "headline": "Sound Sultan buried in US (Photos)",
    "summarized_story": "By Taiwo OkanlawonPopular Nigerian legendary singer, Lanre Fasasi, better known as Sound Sultan has been buried according to Islamic rites in the United States.\nThe singer’s family had earlier broken the news that Sound Sultan had passed away due to throat cancer (angioimmunoblastic T-Cell lymphoma) in the USA.\nThe family of the late singer, his friends, and singer Olamide were spotted at the funeral.\nThe singer’s wife, Farida at a point, fell on her knees and broke down while calling her late husband’s name.\nFarida was also spotted laying on her late husband’s coffin before it was finally put in the ground."
  },
  {
    "headline": "Virgin Galactic announces sweepstake for space flight",
    "summarized_story": "Virgin Galactic wants everyone to have the experience of spaceflight, just like founder Richard Branson had on 11 July.\nThe space company has announced a sweepstake to enable “people of all ages and backgrounds, from anywhere, of any gender, of any ethnicity have equal access to space”.\nThe winner will be entitled to bring a friend along for the first commercial Virgin Galactic spaceflights, scheduled for a date to be determined in 2022.\nHe will also be entitled to a guided tour of Spaceport America given by Branson, along with hotel accommodation and flight to New Mexico.\n“And now… You’ll be one of the first people to live that dream on a Virgin Galactic spaceflight!”, Branson said."
  },
  {
    "headline": "Italy break England’s heart, lift Euro 2020 trophy",
    "summarized_story": "By Kazeem UgbodagaItaly have broken England’s heart after lifting Euro 2020 trophy at Wembley on Sunday, winning 3-2 on penalties.\nWith no goal on extra-time, the match has to be decided through penalty shootouts.\nEngland’s two late substitutes, Marcus Rashford and Jadon Sancho brought in because of their prowess in penalty kick, missed their shootouts.\nAfter Jorginho wasted his kick that could have given Italy victory, Bukayo Saka needed to score to keep parity.\nEngland could only convert two of their five penalties, while Italy scored three penalties to carry the day."
  },
  {
    "headline": "REVEALED: How Nnamdi Kanu Was Kidnapped In Kenyan Airport Parking Lot [Photos]",
    "summarized_story": "Nnamdi Kanu, the embattled leader of the Indigenous People of Biafra, IPOB, was captured in Kenya and returned to Nigeria, according to new information.\nKanu did not fly to Kenya with his Nigerian passport, but rather with his British passport, according to Sahara reporters.\nHe was travelling on a British passport, not a Nigerian passport as alleged by Malami.\n“Evidence seen by the Guardian shows Kanu entered Kenya this year on his British passport on a visa expiring in June.\nKanu was not in possession of a Nigerian passport, his family said, and he has verbally renounced his Nigerian citizenship in broadcasts."
  },
  {
    "headline": "BREAKING: Churches, Mosques To Operate At 50% As COVID-19 3rd Wave Hits Lagos",
    "summarized_story": "As a third wave of the COVID-19 Pandemic has hit Lagos, Governor Babajide Sanwo-olu has ordered all religious houses to run at 50% capacity.\nAccording to a statement released by Sanwo-Olu on Sunday evening, the incidence of COVID-19 patients has increased since the beginning of July, indicating the start of a third wave of infections.\nAlso, within the last two weeks, the occupancy rate at our 2 isolation centres increased from an average of 1% to 6%.\n“Greater vigilance is required at this time in our Churches and Mosques and other places of religious worship.\nResisting Pandemic Fatigue Whilst both the Federal and State Governments have a huge role to play in the management of the COVID-19 pandemic, the responsibility of managing the third wave ultimately belongs to all of us.”"
  },
  {
    "headline": "JUST IN: Head of Planned Parenthood Nigeria, Ibrahim Ibrahim Is Dead",
    "summarized_story": "Dr Ibrahim Ibrahim, the Executive Director of the Nigerian Planned Parenthood Federation, has died.\nAccording to sources close to the family, the deceased was killed in a car accident in Abuja on Sunday morning, which also killed two others.\nBetween 1997 and 2000, Mr Ibrahim worked at the PPFN as an Assistant Director (Service Delivery and Information, Education, and Communication).\nHe served as the organization’s Director of Operations from 2000 to 2001, and then as its Executive Director until now.\nMr Ibrahim previously worked for the Jigawa State Ministry of Health as an Assistant Director."
  },
  {
    "headline": "Buhari Reacts To Death Of Ex-Kaduna Deputy Governor, Bantex",
    "summarized_story": "President Muhammadu Buhari has expressed his condolences following the death of Barnabas Yusuf Bala (Bantex), a former Deputy Governor of Kaduna State during Governor Nasir Ahmed El-first Rufai’s term.\nArchitect Bantex, a real gentleman and consummate professional, will be warmly remembered for his many years of great service in his native State and his dedication to the nation, Buhari said in a statement issued by his Senior Special Assistant on Media and Publicity, Garba Shehu.\nThe President, according to Shehu, also affirmed that the former Deputy Governor, who served as chairman of Kaura Local Government Council and member representing Kaura Federal Constituency in the House of Representatives, was a potent voice on peace, stability and progress at the State and National level.\nHe extended his deepest condolences to the family of Bala, his friends, associates and many followers, who benefited immensely from his responsible stewardship as a public servant and political office holder.\nBuhari prayed God almighty to grant the departed eternal rest and comfort those who mourn the irreparable loss."
  },
  {
    "headline": "VIDEO: Watch horrible reaction from fans moment England fail to win Euro 2020",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Popular Nigerian musician, Sound Sultan, buried in US",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Italy break England heart, win Euro 2020 at Wembley",
    "summarized_story": "Italy defeated England via penalties 3-2 on Sunday night and won Euro 2020 after regulation and extra time in a pulsating final decided at Wembley.\nDetails loading…"
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Bandits Abduct Emir of Kajuru, 13 Family Members",
    "summarized_story": "﻿Bandits have kidnapped the Emir of Kajuru and 13 of his family members, including two of his grandchildren, in a late-night attack in Kajuru Local Government Area of Kaduna State.\nThe bandits swooped on the Emir in the early hours of Sunday morning, just six days after the abduction of 121 students of Bethel Baptist school in neighbouring Chikun Local Government Area.\nIt was gathered that the bandits numbering over 200 stormed the emirate, firing gunshots, before proceeding to the Emir’s palace and taking him and 13 members of his family away.\nSpokesman of Kaduna State Police Command, Mohammed Jalige, who confirmed the incident, said the 85-year-old second-class traditional Ruler was kidnapped from his palace.\nThe abduction is the latest in the LGA, which is 30 kilometres away from the state capital, and has become notorious for kidnappings."
  },
  {
    "headline": "Nigerian Singer, Sound Sultan Is Dead",
    "summarized_story": "﻿Nigerian singer, songwriter, actor and movie producer, Olanrewaju Fasasi, popularly known as Sound Sultan is dead.\nAccording to a statement released by the family and signed by his sibling Kayode Fasasi, the 44-year-old singer died from “a hard-fought battle with Angioimmunoblastic T-Cell Lymphoma”.\nSound Sultan came into the spotlight in the early 2000’s when he released his first single ‘Jagbajantis’, which became an instant hit in Nigeria.\nView this post on Instagram A post shared by Efe Omorogbe (@efeomorogbe)Tributes have been pouring in from colleagues, friends, and fans across the country.\nView this post on Instagram A post shared by Simi (@symplysimi)View this post on Instagram A post shared by FAZE (@fazealone)"
  },
  {
    "headline": "SERAP Asks Court To Slash Allowances For Buhari, Govs, NASS Members",
    "summarized_story": "SERAP is arguing that “slashing jumbo pay for these high-ranking political office-holders would reduce the unfair pay disparity between political officer holders and judicial officers, address the persistent poor treatment of judges, and improve access of victims of corruption to justice and effective remedies”.\n“The huge pay disparity between these high-ranking political officer-holders and judges is unfair, unjust, and discriminatory, especially given the roles of judges to the people and the country,” it said.\n“The NSIWC in a letter to SERAP admitted that it has powers to examine, streamline and recommend the salary scales applicable to each post in the public service but informed us to redirect our request to the RMAFC,” SERAP said.\n“Despite their important roles and responsibilities, Nigerian judges are poorly treated, particularly when their remuneration, salaries, allowances, and conditions of service are compared with that of political office-holders.\nJudges should not have to endure the most poignant financial worries,” it said."
  },
  {
    "headline": "NDLEA Intercepts ₦6.5bn Worth Of Heroin At Lagos Airport",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has intercepted a consignment of 26.150 kilograms of heroin with a street value of over a ₦6.5 billion at the Murtala Mohammed International Airport (MMIA), Lagos.\n132 Lateef Adegboyega Street, off Ago palace way by Grandmate bus stop Okota, Lagos.\nDuring the follow-up operation, Tony Chidi Onwurolu, who obviously mounted counter-surveillance around his neighborhood fled his home before the arrival of the team of operatives who stormed his residence.\nThey were however able to search his home and recovered a number of documents to establish his true identity.\nThirty-six wraps of the suspected substance later tested positive for Cocaine weighing 600grams,” the NDLEA spokesman stated."
  },
  {
    "headline": "Italy Win Euro 2020, Deny England First Trophy In 55 Years",
    "summarized_story": "Italy have beaten England on penalties to win the Euro 2020, denying the Three Lions their first major trophy in 55 years.\nThe Italians defeated England 3-2 on penalties in Sunday’s Euro 2020 final as Marcus Rashford, Jadon Sancho and Bukayo Saka missed in the shoot-out following a 1-1 draw after extra time at Wembley.\nLuke Shaw scored for England inside two minutes, the fastest ever goal in a European Championship final, but Leonardo Bonucci bundled in an equaliser at a corner midway through the second half.\nNeeding to score to keep England alive in the shoot-out, Saka’s spot-kick was saved by Italy goalkeeper Gianluigi Donnarumma as the Azzurri won the tournament for the second time."
  },
  {
    "headline": "Sultan of Sokoto declares Tuesday, July 20 Eid-el-Kabir",
    "summarized_story": "Sultan of Sokoto and President General Nigerian Supreme Council for Islamic Affairs Muhammad Sa’ad Abubakar has announced that Sunday July 11 is the first day of Dhul-Hijja 1442AHThis is contained in a statement signed by the Wazirin Sokoto and Chairman, Advisory Committee on Religious Affairs Sultanate Council Sokoto, Professor Sambo Junaidu.\nThe Advisory Committee on Religious Affairs in collaboration with the National moon sighting committee says they received reports on Saturday of the sighting of the crescent of Dhul-Hijja1442AH.\nHe also wished the Ummah a very happy Eid-el-Kabir in advance.\nWith this declaration by the Sultan, Nigeria.\nMuslimas will observe the 2021 Eid-el-Kabir on Tuesday, July 20, which is equivalent to the 10th of Dhul-Hijja 1442 AH."
  },
  {
    "headline": "President Buhari mourns Yusuf Bala, fmr deputy governor of Kaduna State",
    "summarized_story": "President Muhammadu Buhari has mourned a former governor of Kaduna State, Barnabas Yusuf Bala (Bantex), who served during the first tenure of Governor Nasir Ahmed El-Rufai.\nA statement by his Senior Special Assistant on Media and Publicity, Garba Shehu, on Sunday reads, President Muhammadu Buhari joins the government and people of Kaduna State to mourn the passing of Architect Barnabas Yusuf Bala (Bantex), a former Deputy Governor of the State during the first tenure of Governor Nasir Ahmed El-Rufai.\n“President Buhari believes that Architect Bantex, a true gentleman and consummate professional, will be fondly remembered for his many years of distinguished service in his home State, his patriotism to the nation as well as forthrightness in politics.\n“The President extends his deepest condolences to the family of Bala, his friends, associates and many followers, who benefited immensely from his responsible stewardship as a public servant and political office holder.\nAdvertisement“President Buhari prays God almighty to grant the departed eternal rest and comfort those who mourn the irreparable loss”."
  },
  {
    "headline": "LASG removes partially collapsed building, to remove 70 Others",
    "summarized_story": "The Lagos State Building Control Agency (LASBCA) has demolished a partially collapsed structure at no 19, Church Street, Lagos Island.\nSpeaking at the site of the building, the General Manager of the Agency Arc.\nGbolahan Oki said it had become necessary to immediately remove the building seeing that it is highly dilapidated, distressed and not fit for human habitation.\nHe emphasized that there are over fifty buildings marked for demolition in Lagos and the motive is to sanitize and rid Lagos of distressed and dilapidated buildings in a bid to stem the era of building collapse in the state.\nAdvertisementMr. Oki appealed to residents to assist the government in actualizing its objective of creating a safer Lagos by reporting noticed substandard building constructions and dilapidated structures within their locality to the agency for necessary actions."
  },
  {
    "headline": "Billionaire Adventurer Richard Branson Reaches Space in His Own Ship",
    "summarized_story": "Swashbuckling entrepreneur Richard Branson hurtled into space aboard his own winged rocket ship Sunday, beating out fellow billionaire Jeff Bezos.\n“The whole thing, it was just magical,” a jubilant Branson said after the trip home aboard the gleaming white space plane, named Unity.\nUpon his return to Earth, he announced a sweepstakes drawing for two seats on a Virgin Galactic jaunt.\nVirgin Galactic already has more than 600 reservations from would-be space tourists, with tickets initially costing $250,000 apiece.\nKerianne Flynn, who signed up in 2011 to fly with Virgin Galactic, had butterflies ahead of the launch Sunday."
  },
  {
    "headline": "Basketball: Nigeria Shock US 90-87 in pre-Olympic Opener",
    "summarized_story": "This is not how USA Basketball expected to open its Olympic summer.\nKevin Durant, who had never before played in a loss for USA Basketball in 39 senior international games, had 17 points.\nThe Americans had gone 39-0 in their last three Olympic seasons — including pre-Olympic exhibitions — on their way to gold medals and had been 54-2 in major exhibitions since NBA players began playing for USA Basketball in 1992.\n“Nigeria’s come a long way with their basketball,” USA Basketball managing director Jerry Colangelo said.\nI don’t think any African team has been able to beat USA Basketball in an exhibition game or a real game."
  },
  {
    "headline": "Nigeria’s Leisure Market Developed During Pandemic: Radisson Blu Anchorage GM Raza",
    "summarized_story": "General Manager of the Radisson Blu Anchorage Hotel Lagos, Ahmed Raza explains how the Covid-19 pandemic helped develop Nigeria’s local leisure market by forcing hoteliers to look inwards following travel bans and the slump in business travel.\nWatch the video for more…"
  },
  {
    "headline": "Pandemic Has Given Us Opportunity to Reinvent Ourselves, Renovate Hotel: Radisson Blu Anchorage GM Raza – Arise News",
    "summarized_story": "General Manager of the Radisson Blu Anchorage Hotel Lagos, Ahmed Raza explains how the Nigerian hospitalty market has evolved over the past year or two due to the Covid-19 pandemic.\nSpeaking about the Victoria Island-based hotel in particular, he says it was an opportunity to innovate, reinvent, renovate and re-design with more local content.\nWatch the video for more…"
  },
  {
    "headline": "Nigeria Immigration Boss Babandede on Border Security, Visa Policy and Covid-19",
    "summarized_story": "In an exclusive interview with Arise News, the Comptroller-General of Nigeria Immigration Service (NIS), Muhammad Babandede, says the service is engaging in various border management strategies to make Nigeria safer.\nHe also spoke on enhancing border security, visa policy, his recent trip to Katsina State, National Security, Developmental milestones within the immigration service as well as handling covid-19 in Nigeria.\nWatch the interview for more…"
  }
]