[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "APC appeals to Nigerians to shun sentiments on its choice of Shettima",
    "summarized_story": "Ajaka made the appeal in a statement on Monday in Abuja while reacting to sentiments being expressed by especially opposition political parties on APC’s choice of Shettima.\nThe APC spokesman described Shettima as the best choice for the APC to win the forthcoming 2023 presidential election.\nHe added that the sterling qualities of Shettima as APC’s Vice-Presidential candidate, had once again thrown the opposition parties off balance.\n“The PDP and others would have preferred our presidential candidate to settle for the less to make it easy for them to win election.\n“While we sympathise with the opposition parties, we appeal to Nigerians, who will eventually be the beneficiaries of good governance under Tinubu-Shettima presidency, to see beyond the sentiments of religion and tribe."
  },
  {
    "headline": "Makinde, Ikpeazu celebrate with Wike as son graduates from UK university [Photos]",
    "summarized_story": "L-R: Govs Seyi Makinde, Nyesom Wike; Jasmine Nyesom Wike (daughter) Jordan Nyesom-Wike (graduand) and Justice Eberechi Nyesom-Wike(wife) at the event in United KingdomJordan Nyesom-Wike, son of the Rivers State Governor, Nyesom Wike has graduated from the University of Exeter, in the United Kingdom.\nJordan graduated with Second Class Honours, Upper Division in Law from the afroesaid university.\nGovernor Wike’s family alongside some PDP governors attended the graduation as seen in a photo obtained by Vanguard on Monday.\nThose at Jordan’s graduation event captured in the photo include, Wike; Oyo State governor, Seyi Makinde, Abia State governor, Okezie Ikpeazu, Wike’s wife, Justice Eberechi Nyesom-Wike and his daughter, Jasmine Nyesom-Wike."
  },
  {
    "headline": "N’Delta‘ll fight FG’s plan seize its land, waters – Pukon, IYC scribe",
    "summarized_story": "“Therefore, all well-meaning Niger Deltans and indeed even those in Buhari presidency that are against the bill, assert that Federal Government would not take our crude oil and gas resources, while also plotting to take over our land and waters.\n“What is more, the reintroduction of this obnoxious Water Resources Bill is indeed a confirmation that President Muhammadu Buhari is not committed to national unity and cohesion.\nI have been following recent developments to the controversial National Water Resources Bill, 2020 that has re-emerged on the floor of the House of Representatives.\nIndeed, as many public commentators posit, the bill is not in the interest of our nation.\nHence, the government of the day must focus on how hope and confidence can be inspired."
  },
  {
    "headline": "Muslim/Muslim ticket: Consider competency, not religion — Tinubu’s group begs Nigerians",
    "summarized_story": "He therefore, appealed to Nigerians to consider competency, dexterity, capacity, knowledge and skills in doing things because religion or ethnic consideration would not help anyone.\nIn the market place, do we ask about the religion before buying goods and services,” Ayeni stated.\nAccording to Ayeni,”APC will get more votes from core North considering the fact that Senator Shettima is from there.\nSenator Shettima has larger support of the northern which would consolidate on the winning of the party from the zones.\n“We want to assure you that Asiwaju Bola Ahmed Tinubu is always giving everyone their respect."
  },
  {
    "headline": "2023: HEDA to INEC, be strict with certificates submitted by candidates",
    "summarized_story": "By Gabriel Ewepu – AbujaAn anti-corruption and human rights organization, Human and Environmental Development Agenda, HEDA, Sunday, called on the Independent National Electoral Commission, INEC, to be strict with authencity of certificates submitted by candidates of political parties.\nHe urged Prof Yakubu not to be intimidated by politicians whose certificates are doubtful as most of them fall short of the requirements and provisions of the Electoral Act.\n“We have been keenly following the developments around submission of candidates’ names and credentials list for the 2023 general elections by political parties, and the most recent news of candidates claiming their school certificates are missing.\n“We believe that the Commission’s guidelines towards preparation for the 2023 general election to political parties and the public are clear enough on presentation of certificates.\n“We demand that your Commission communicate the invalidity of affidavits as submitted by some candidates in the forthcoming elections to all affected candidates and their parties."
  },
  {
    "headline": "FG not helping issues on security matters – Gov Matawalle",
    "summarized_story": "Governor Bello Mohammed Matawalle of Zamfara State has lamented that the Federal Government was not helping issues as far as security matters are concerned.\nThe Governor disclosed this when he received a coalition of civil society organisations at his Maradun country home.\nGovernor Matawalle stated that the Federal Government has failed in its constitutional responsibility to protect the lives and properties of the entire citizenry.\nThe Governor stated that if the Federal Government could extend the retirement age of medical doctors, university lecturers, and judges, it should consider doing the same for security personnel.\nHe advocated that the Federal Government should extend the retirement age of the army, police, air force, and other security agencies to 70 years like those in the medical, academic, etc."
  },
  {
    "headline": "BREAKING: Kuje jailbreak: NDLEA arrests wanted terrorist with drugs in Abuja",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has arrested a terror suspect who escaped from the Kuje prison.\nThe fleeing terrorist, Suleiman Sidi was arrested in the early hours of Monday in Abuja, a statement by spokesman Femi Babafemi said.\nSidi was nabbed at the Area 1 motor park while attempting to board a commercial vehicle to Maiduguri, Borno State.\nDuring preliminary interview, the terror suspect confirmed he was remanded at the Medium Security Correctional Centre in Kuje.\nGen. Buba Marwa (Retd) has directed his transfer to the Nigerian Correctional Service (NCoS)."
  },
  {
    "headline": "Anglican Church rejects APC Muslim-Muslim ticket, urges Buhari to resign",
    "summarized_story": "The Anglican Communion in Calabar, Cross River State, has called for the immediate resignation of President Muhammadu Buhari and his government.\nThe church has also expressed deep disappointment at and outrightly rejected the national party, the APC, Muslim-Muslim presidential ticket for next year’s election, insisting that the secularity of Nigeria must be respected.\nHow can they be so insensitive and comfortable with the way things are going in Nigeria in recent times.\n“Nigerians have acclimatised to the lies told us for so long that every further step we take is a comedy.\nSpeaking about the APC running mate, Rev Egbe said, “We absolutely do not, will not, and cannot accept a Muslim-Muslim or Christian-Christian ticket."
  },
  {
    "headline": "Ned Nwoko clarifies plans to marry Nigerian comedienne, Emmanuella",
    "summarized_story": "Nigerian billionaire, Ned Nwoko, has debunked rumours that he proposed marriage to Nigerian superstar Emmanuella Samuel.\nReports had it that Nwoko attempted to wed the teenage star.\nIt was alleged that Ned Nwoko is in talks with Emmanuella’s family over a marriage proposal list.\nThe fan with username, don.makas.165 had asked, “Ned, I hear say you wan marry Emmanuella.\nIs it true or false?”Ned responded, ”I have beautiful wives.”Another fan @jennifereverest24 asked, ”the news about you and Emmanuella, is it true?”Ned responded, ”It is fake news.”"
  },
  {
    "headline": "Oyetola’s camp not behind attack on Yusuff Lasun’s residence – Omipidan",
    "summarized_story": "The Chief Press Secretary to Governor Adegboyega Oyetola of Osun State, Ismail Omipidan, has said that Lasun Yusuff, the gubernatorial candidate of the Labour Party in the Osun gubernatorial election, is no threat to his principal’s second term ambition.\nOmipidan was reacting to the allegation of the former Deputy Speaker of the House of Representatives on Monday after his personal residence was attacked early on Monday morning that the governor’s camp is responsible for the incident.\nOmipidan stated that since there were security personnel attached to him, the attack should have been repelled successfully.\nLasun is no threat to Mr governor we are not after any citizen of Osun State, let alone Lasun Yusuff.\n“It is not only that my principal does not know anything about the attack but I am doubtful of the claim being made by Honourable Lasun Yusuff."
  },
  {
    "headline": "Cristiano Ronaldo not for sale, says Erik ten Hag The Nation Newspaper",
    "summarized_story": "Manchester United manager Erik ten Hag has said Portugal superstar Cristiano Ronaldo is “in our plans” for the new season and “not for sale”.\nThe 37-year-old will miss the first part of United’s pre-season tour to Thailand and wants to leave the club.\nWe are planning with Cristiano Ronaldo for this season.\nThe Dutchman added that he spoke to Ronaldo before the tour, explaining: “I had a good talk.\nTen Hag emphasised United will only recruit players if he believes they will fit into his intended style of play."
  },
  {
    "headline": "Five drown in Delta tank farm fire The Nation Newspaper",
    "summarized_story": "Five bodies of persons fleeing the scene of the fire explosion that rocked the tank farm of Matrix Energy Limited at Ifiekporo in Warri South council area of Delta State have been recovered along the bank of Warri River.\nThe victims whose identities were yet to be ascertained were recovered by local divers on Sunday.\nReports say the deceased five were among those scampering for safety when the fire broke out in the gas section of the tank farm on Friday evening.\nThey were reportedly outside the tank farm premises.\nHe also disclosed that the local divers suspect that there may be other victims, which is why the search would continue on Monday."
  },
  {
    "headline": "Elon Musk trolls Twitter over suspended take-over deal The Nation Newspaper",
    "summarized_story": "The world’s richest man Elon Musk has taken a swipe at Twitter over their decision to file legal action against him following his decision to put its acquisition deal on hold.\nIn May, Musk revealed the “deal” with the micro-blogging and social networking company Twitter was on hold after Twitter agreed weeks ago on a ‘definitive deal’ to sell itself to Musk at approximately $44 billion.\nHe tweeted: “Twitter deal temporarily on hold pending details supporting calculation that spam/fake accounts do indeed represent less than 5% of users”.\nHis attorneys on Friday filed a letter with the SEC accusing Twitter of being in material breach of the transaction agreement.\nHe wrote that the social media platform is “committed to closing the transaction on the price and terms agreed upon with Mr. Musk and plans to pursue legal action to enforce the merger agreement."
  },
  {
    "headline": "Lagos boat capsize: Death toll now 17 The Nation Newspaper",
    "summarized_story": "Death toll in Friday night’s boat accident at Mile Two, Lagos has risen to 17, the National Emergency Management Agency (NEMA) said last night.\nNEMA’s Lagos Coordinator, Ibrahim Farinloye, on Saturday confirmed the recovery of two bodies said to be those of a 52-year-old man and a woman, 20.\nFarinloye said: “17 bodies have been recovered so far from the Lagos Lagoon after the boat accident.\nRecovery search continues.”According to Farinloye, illegal operators were responsible for carrying out services after the 7pm deadline approved by regulators.\nHe said another problem identified was that these illegal operators do not have life jackets for passengers."
  },
  {
    "headline": "Why I selected Shettima as running mate, by Tinubu The Nation Newspaper",
    "summarized_story": "Presidential candidate unveils ex-Borno governor after briefing BuhariInterim running mate Masari pulls out voluntarilyAll Progressives Congress (APC) presidential candidate Asiwaju Bola Tinubu yesterday explained why he picked the former governor of Borno State, Senator Kashim Shettima, as his running mate for next year’s poll.\nTinubu also said he chose the former governor, following consultations with party stakeholders and other Nigerians as a democrat.\nTinubu said: “I announce the selection of Senate Kashim Shettima as my partner and running mate in the mission to advance and reclaim the fortunes of this great country and the hopes of its people.\nHe noted that his choice of a running mate had been an open and burning question adding that it gave rise to much speculation and debate.”Tinubu said Masari’s withdrawal has put an end to the speculation.\nI appreciate the perspectives of leading members of the party, political allies and key national figures who see Nigeria’s future as I do."
  },
  {
    "headline": "CAN, others kick as Tinubu picks Muslim running mate",
    "summarized_story": "However, the decision to settle for a Muslim-Muslim ticket has elicited wide condemnations from Christians and Northern minorities.\nThe APC flag bearer arrived Daura to pay Sallah homage to President Buhari who arrived his home town on Friday.\n”APC, Tinubu misfiredPDP chieftain and former presidential aspirant, Alhaji Isa Saulawa, described the Muslim-Muslim ticket as signifying victory for his party, the PDP.\nThere is nothing wrong with Muslim-Muslim ticket or Christian-Christian ticket in a democratic setting.\n“If you take Kaduna State as a case study, you see that the Muslim-Muslim ticket is viable where the governor is Muslim and the deputy is also Muslim."
  },
  {
    "headline": "Lagos boat mishap: Death toll rises to 17",
    "summarized_story": "The National Emergency Management Agency (NEMA), yesterday said that 13 more bodies were recovered from the ill-fated boat sailing from Mile 2 to Ibeshe, a suburb of Lagos, on Saturday.\n“Late yesterday night, two more bodies were recovered in addition to the two earlier recovered in the morning.\nThe coordinator decried illegal boat operators plying the waterways beyond the stipulated official hours which he said leads to avoidable deaths.\n“It was revealed that the regulatory bodies have tried to stamp out illegal operations of small boat operators, who hardly use life jackets after official hours.\nBut it is only at this odd hour that illegal operators always put the lives of unsuspecting passengers at risk,’’ Farinloye said."
  },
  {
    "headline": "Nationwide shutdown of electricity, railway imminent over ASUU, others",
    "summarized_story": "According to the union, the industrial action is undoubtedly exposing the students to all forms of negative vices inimical to nation-building.\nNUEE charged government to address all issues concerning non-implementation of agreements and other matters affecting Nigeria’s tertiary education institutions.\nThe Federal Government should always remember that an idle hand is the devil’s workshop,” the union said.\nMeanwhile, the railway workers said they may be compelled to embark on a total and indefinite strike any moment from now to challenge the insensitivity of the management and the board of Nigerian Railway Corporation to the welfare and wellbeing of the railway workers.\n“The review committee worked inconclusively and, till now, there is no known standard condition of service in the rail transport industry."
  },
  {
    "headline": "Security beef-up as NSCDC hints of ISWAP planned attacks",
    "summarized_story": "From Romanus Ugwu, and Molly Kilete, AbujaThe Federal Government has beefed up security within the Federal Capital Territory (FCT) following a security alert on fresh terrorists’ attacks by the Nigerian Security and Civil Defence Corps (NSCDC).\n“Intelligence abounds that ISWAP terrorist group has claimed responsibilities of the Tuesday July 5, 2022 attack on Kuje Medium Security Custodial Centre, releasing their adherent members.\n“Every security agency gives intelligence report to the concerned authority from time to time and this one from the NSCDC is not an exception.\nIt is just a security measures that we are taking,” she said.\nSimilarly, the commander Guards Brigade, Nigerian Army, Brigadier General Usman, called on resident continue to be security conscious and report any suspicious movement to the security agencies."
  },
  {
    "headline": "Osun: Oyetola, 4 other governorship candidates speak on security, economy, others",
    "summarized_story": "From Lateef Dada, Osogbo and Molly Kilete, AbujaFive governorship candidates in Osun State, yesterday, spoke on their plans to improve the security of the state, raise the economy and others if elected on July 16.\nI will create 100,000 jobs.”He told other contestants to step down for him, saying, “I will collaborate with all security operatives and recruit more Amotekun.\nOn security, Oyetola said: “We have the joint task force that takes care of armed robbery, kidnapping and banditry.\nDIG Kokumo, supervisory DIG for the South-West Geo-Political Zone, is to be assisted by four Assistant Inspectors-General of Police, four Commissioners of Police, 15 Deputy Commissioners of Police, and 30 Assistant Commissioners of Police.\nForce Force Public Relations Officer, Muyiwa Adejobi, in statement, said the IGP has also ordered deployment of adequate police personnel in the ranks of Chief Superintendents of Police and below to ensure a crisis free election."
  },
  {
    "headline": "Health Workers Union Threatens to Embark on Strike in Solidarity with ASUU, Others – THISDAYLIVE",
    "summarized_story": "The Medical and Health Workers Union of Nigeria (MHWUN) has said it will go on a solidarity strike in support of the Academic Staff Union of Universities (ASUU), and other unions.\n“Discerning minds will agree with us that the negative impact of the strike to the future of our children and Nigeria in general cannot be quantified, ’’he said.\nHe said that this pathetic development had further exposed workers, whose salaries and income has already been eroded by inflation, to greater hardships.\n“The situation reinforces the earlier call by the organised labour for a resolute action on domestic refining of petroleum,’’ he said.\nMHWUN, however, reiterated the union’s call for its members to ensure they registered and obtained their Permanent Voter’s Card."
  },
  {
    "headline": "Ebonyi APGA Threatens to Boycott LG Elections over Fees – THISDAYLIVE",
    "summarized_story": "Benjamin Nworie in AbakalikiEbonyi State chapter of the All Progressives Grand Alliance (APGA) has threatened to boycott the forthcoming local government election in the state over alleged exorbitant fees placed on the nomination forms by the State Independent Electoral Commission (SIEC).\nHe stressed that APGA would not participate in the elections if the amounts are not reduced.\nThe APGA chairman described it as an attempt to abort democracy, uproot fair play and discard level playing ground in the process.\nHe, therefore, asked EBSIEC to remove the exorbitant fees immediately so that all parties can participate in the process, declaring that APGA would take EBSIEC to court if it fails to do so.\n“We’ll take EBSIEC to court if they fail to allow other parties participate in the upcoming local government chairmanship and councillorship election by refusing to remove and/or slash the exorbitant fees,” Okorouka said."
  },
  {
    "headline": "Monarchs Urged to Engage Hunters, Vigilance Group to Fight Insecurity in Edo – THISDAYLIVE",
    "summarized_story": "Adibe Emenyonu in Benin CityFollowing the growing level of insecurity in Edo State with the recent kidnapping and killing of a reverend father, the Acting Governor of Edo State, Mr. Philip Shaibu, has given marching orders to all traditional rulers across the state to engage local hunters and vigilantes to flush out criminals herders in all the forests in the state.\nShaibu gave the marching order after an emergency security meeting with traditional rulers, opinion leaders and security agencies in the state.\nHe said that traditional rulers would henceforth be held responsible for any act of kidnapping and terrorism that occurred in their domain.\nOther parts of the resolutions read: “That everybody currently residing in any forest in Edo State in the guise of camping should vacate such areas with immediate effect.\nThe acting governor mandated all acting local governments’ chairmen to use all the security apparatus including the police, army, vigilante groups, hunters and others to forcefully remove any airing groups or individuals within the next 10 days."
  },
  {
    "headline": "Group Advocates Artisanal Refineries Legalisation to Check Fuel Scarcity – THISDAYLIVE",
    "summarized_story": "“On April 24, 2022, for example, an explosion in one of these refineries killed over 100 people.\n“If the illegal refineries are legalized, standardized and monitored, it could be a win-win situation for all.\nDoes it make sense?.”Group Advocates Artisanal Refineries Legalisation to Check Fuel ScarcityThe federal government has been urged to legalise the operations of illegal crude oil refineries in order to make petroleum products available and affordable in the country.\n“On April 24, 2022, for example, an explosion in one of these refineries killed over 100 people.\n“If the illegal refineries are legalized, standardized and monitored, it could be a win-win situation for all."
  },
  {
    "headline": "Feto Maternal Medicine Specialists Meet – THISDAYLIVE",
    "summarized_story": "The Association of Feto Maternal Medicine Specialists of Nigeria has been enjoined to uphold professional ethics and uphold highest standards of subspecialist practice.\nThe Chairman 5th Scientific Conference Local Organising Committee (LOC) of the association, Dr Femi Oloyede, made the call in a statement, which also announced the 2022 annual general meeting of the association.\nAccording to him, “ the theme for 2022 annual general meeting of AFEMSON is ‘The Placenta : Exploring the fetal maternal nexus’ and the conference is slated to hold between July 13 to 16, 2022 in Abeokuta, Ogun State.”Oloyede further added that the conference shall feature scientific papers presentations by various foreign and national experts on modern practice on fetal medicine, such as placenta ultrasonography, nuchal translucency scan and umbilical artery Doppler scan.\nSome of the international speakers expected are: Prof. Dilly Anumba from UK, Dr Shady Saleem from Egypt, Dr from Belgium and National speakers are : Prof Femi Kuti (Ife), Bose Afolabi (LUTH), Jamilu Tukur (Katsina), and Hadiza Galadanci (Kano)The Governor of Ogun state, Prince Dapo Abiodun is expected to declare open the conference and AGM while Ogun State Commissioner for Education, Dr Tomi Coker, is the keynote speaker."
  },
  {
    "headline": "Nigerian Pastor, Ibiyeomie Again Threatens To Kill Anyone Who Insults Bishop Oyedepo Of Winners' Chapel",
    "summarized_story": "The General Overseer, Salvation Ministries, Pastor David Ibiyeomie has again threatened to kill anyone who insults Bishop David Oyedepo, the presiding Bishop of the Faith Tabernacle in Ota, otherwise called Winners’ Chapel International.\nStressing that if Bishop Oyedepo was not alive his Christianity would have been nonsense.\n“Insult me, insult my wife, I don’t care but if you take your mouth to touch my wife, you are touching me.\nIf you insult Oyedepo I will kill you, that’s how God is.\nIf Bishop Oyedepo was not alive, my Christianity would have been nonsense."
  },
  {
    "headline": "Nigerian Pastor, Ibiyeomie Again Threatens To Kill Anyone Who Insults Bishop Oyedepo Of Winners' Chapel",
    "summarized_story": "The General Overseer, Salvation Ministries, Pastor David Ibiyeomie has again threatened to kill anyone who insults Bishop David Oyedepo, the presiding Bishop of the Faith Tabernacle in Ota, otherwise called Winners’ Chapel International.\nStressing that if Bishop Oyedepo was not alive his Christianity would have been nonsense.\n“Insult me, insult my wife, I don’t care but if you take your mouth to touch my wife, you are touching me.\nIf you insult Oyedepo I will kill you, that’s how God is.\nIf Bishop Oyedepo was not alive, my Christianity would have been nonsense."
  },
  {
    "headline": "BREAKING: APC Presidential Candidate, Tinubu Picks Former Borno Governor, Shettima As Running Mate, Travels To Daura To Inform Buhari",
    "summarized_story": "There are indications that the All Progressives Congress presidential candidate for the 2023 elections, Bola Tinubu has finally settled for a Muslim - Muslim ticket, by picking former governor of Borno State, Senator Kashim Shettima as his running mate.\nSaharaReporters gathered that Tinubu had wanted to pick the incumbent governor of Borno, Babagana Zulum as the running mate but he reportedly pleaded that his mentor, Shettima should rather be picked.\nA source in the APC told SaharaReporters that Bola Tinubu had gone to Daura, Katsina State to inform President Muhammadu Buhari about his final choice.\n\"Tinubu has picked Kashim Shettima former Borno State governor as his running mate.\n\"I was thinking he might pick Zulum the current Borno State governor."
  },
  {
    "headline": "BREAKING: APC Presidential Candidate, Tinubu Picks Former Borno Governor, Shettima As Running Mate, Travels To Daura To Inform Buhari",
    "summarized_story": "There are indications that the All Progressives Congress presidential candidate for the 2023 elections, Bola Tinubu has finally settled for a Muslim - Muslim ticket, by picking former governor of Borno State, Senator Kashim Shettima as his running mate.\nSaharaReporters gathered that Tinubu had wanted to pick the incumbent governor of Borno, Babagana Zulum as the running mate but he reportedly pleaded that his mentor, Shettima should rather be picked.\nA source in the APC told SaharaReporters that Bola Tinubu had gone to Daura, Katsina State to inform President Muhammadu Buhari about his final choice.\n\"Tinubu has picked Kashim Shettima former Borno State governor as his running mate.\n\"I was thinking he might pick Zulum the current Borno State governor."
  },
  {
    "headline": "'If With Pastor Osinbajo As Nigerian Vice President, Christians Are Being Killed, Imagine What Will Happen With Muslim President And VP,' Christian Association Warns Fellows",
    "summarized_story": "The Christian Association of Nigeria (CAN) has warned Nigerian Christians not to vote for the Muslim-Muslim ticket of the ruling All Progressives Congress in the 2023 presidential election.\nThe umbrella body of Christians in Nigeria said that if they vote Muslim-Muslim ticket, then they should be ready to live with the consequences thereafter.\nIt reported that his decision to settle for a Muslim-Muslim ticket had elicited wide condemnations from Nigerian Christians, including Northern minorities.\nThe Nigerian Christian body, which spoke through its spokesman, Adebayo Oladeji, said it was up to Nigerians to decide their fate for the next four years.\n“If you have a government where a pastor is a vice president and pastors and worshippers are being killed, you can imagine what will happen when we have a Muslim-Muslim ticket."
  },
  {
    "headline": "APC: Opposition dazed over Tinubu’s choice of running mate",
    "summarized_story": "Murtala Yakubu Ajaka, deputy national publicity secretary of the All Progressives Congress (APC), says opposition parties have been thrown off balance by Bola Tinubu’s choice of running mate.\nTinubu, APC presidential candidate, unveiled Kashim Shettima, former governor of Borno state, as his running mate on Sunday.\n“The sterling qualities of our vice presidential candidate, in the person of Senator Kashim Shettima, has once again thrown the opposition parties off balance,” the deputy spokesman said.\n“Both Asiwaju Bola Ahmed Tinubu and Senator Kashim Shettima are not religious fundamentalists or ultra Muslims, their records in public offices are testimonies to rely on.\nAdvertisement“As a two-term governor in Borno state, Shettima enjoyed the support of the Christian community throughout his tenure."
  },
  {
    "headline": "APC: Opposition dazed over Tinubu’s choice of running mate",
    "summarized_story": "Murtala Yakubu Ajaka, deputy national publicity secretary of the All Progressives Congress (APC), says opposition parties have been thrown off balance by Bola Tinubu’s choice of running mate.\nTinubu, APC presidential candidate, unveiled Kashim Shettima, former governor of Borno state, as his running mate on Sunday.\n“The sterling qualities of our vice presidential candidate, in the person of Senator Kashim Shettima, has once again thrown the opposition parties off balance,” the deputy spokesman said.\n“Both Asiwaju Bola Ahmed Tinubu and Senator Kashim Shettima are not religious fundamentalists or ultra Muslims, their records in public offices are testimonies to rely on.\nAdvertisement“As a two-term governor in Borno state, Shettima enjoyed the support of the Christian community throughout his tenure."
  },
  {
    "headline": "Gunmen 'invade' Yusuf Lasun's residence -- hours after Osun guber debate",
    "summarized_story": "Yusuf Lasun, former deputy speaker of the house of representatives, says gunmen invaded his residence in Osun state on Monday.\n“Just in: gun men in uniforms are presently in my residence shooting sporadically,” he wrote.\nAdvertisementJust in: gun men in uniforms are presently in my residence shooting sporadically… — Rt.\nLasun Yussuff Suleiman (@LasunRt) July 11, 2022AdvertisementWhen TheCable contacted Opalola Yemisi, police spokesperson in Osun, to inquire about the attack, she said officers have been dispatched to investigate the matter.\nWhile speaking at the debate, Lasun said state police is inevitable if security challenges must be addressed."
  },
  {
    "headline": "Gunmen 'invade' Yusuf Lasun's residence -- hours after Osun guber debate",
    "summarized_story": "Yusuf Lasun, former deputy speaker of the house of representatives, says gunmen invaded his residence in Osun state on Monday.\n“Just in: gun men in uniforms are presently in my residence shooting sporadically,” he wrote.\nAdvertisementJust in: gun men in uniforms are presently in my residence shooting sporadically… — Rt.\nLasun Yussuff Suleiman (@LasunRt) July 11, 2022AdvertisementWhen TheCable contacted Opalola Yemisi, police spokesperson in Osun, to inquire about the attack, she said officers have been dispatched to investigate the matter.\nWhile speaking at the debate, Lasun said state police is inevitable if security challenges must be addressed."
  },
  {
    "headline": "Osun guber: Adeleke addresses 'pounds, dollars' boast, says he meant foreign investment",
    "summarized_story": "Ademola Adeleke, the Peoples Democratic Party (PDP) candidate for the Osun governorship election, says he has no plan to buy votes in the July 16 governorship election.\nThe governorship candidate addressed his “pounds, dollars and euros” boast during the governorship election debate organised by Channels Television on Sunday.\nAnd it is not only naira; I came with dollars, pounds, and euros.\nAdvertisementWhen asked during the debate if his foreign currency reserve was to buy votes, Adeleke said it was a description of the foreign investment he intends to bring into Osun state.\nAfter losing the 2018 contest to Oyetola, the PDP candidate described the election as a “stolen mandate”."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Digital Nomads: Freelance digital marketer Baraka Mafole wants Tanzanians to thrive in the digital economy",
    "summarized_story": "After discovering that his fellow students were making money online, Mafole decided to join them; he spent hours learning digital skills.\nIn the last decade, the Tanzanian digital ecosystem has evolved as more Tanzanian citizens have access to digital services.\nThis led them to co-found an initiative called Tanzania Digital Trailblazers later that month, a series of virtual events to bring awareness of digital skills to young Tanzanians.\nThis time around, they added physical monthly digital skills training events to the mix.\nMafole said that dozens of Tanzanian youths have connected with his story and have been inspired to upgrade their lives by learning digital skills."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website.\nNairobi, he explains, already has plenty of delivery products—Uber and Bolt, for example—so Vanoma will not be expanding there just yet."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How I Work: Henry Oji, Lead Photographer at Big H Studios",
    "summarized_story": "Walk us through a typical workdayI’m the lead photographer at Big H Studios.\nMy role is to coordinate the work across board and to ensure that we deliver the service that people are paying for.\nAnd after that is done, I would send the pictures to the editing team to finish the skin work.\nIf at all there is a shortcut, I would say, do the work and delegate where you can so that you don’t overburden yourself with a lot of work.\nI like to watch comedy a lot because laughing is very important in any type of work."
  },
  {
    "headline": "Road to NPFL: Alli Wants Massive Support For Insurance Against Ikorodu City – Nigerian Observer",
    "summarized_story": "The Sports Commission boss made the call ahead of the club’s crucial fixture against Ikorodu Utd FC.\nA win for the Edo Arsenal will guarantee their promotion with two matches to spare.\nThe ex International who is still basking in the euphoria of Insurance victory against their strongest foe, Gateway Utd, 4-0 last week craves for full capacity Stadium during the midweek tie.\nThe Benin Arsenals need just three points to seal her promotion ticket to the NPFL and a win against Ikorodu City FC on Wednesday would guarantee that.\nThe fans have shown tremendous support and understanding this season and this match against Ikorodu will be fitting end to a glorious outing."
  },
  {
    "headline": "No complacency as we transform to limited coy — Kyari – Nigerian Observer",
    "summarized_story": "No complacency as we transform to limited coy — KyariShare FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian National Petroleum Company Limited (NNPC Ltd.) started the new week with an assurance to its investors and stakeholders that the days of complacency were over.\nThe NNPC GMD/CEO also said that the Petroleum Industry Act (PIA) had also provided ample incentives for investors in the gas sector.\nThe GMD/CEO of NNPC Ltd., Malam Mele Kyari, made the call at the NNPC Spotlight Session of the just concluded 21st Nigerian Oil and Gas Conference and Exhibition which held at the International Conference Centre, Abuja.\nWunti made the disclosure in Abuja during a panel session at the just concluded 21st Nigerian Oil and Gas Conference and Exhibition with the theme, “Funding the Nigerian Energy Mix for Sustainable Economic Growth”.\nThe Nigerian oil and gas industry, and indeed the entire global energy community missed his invaluable contributions to the growth of the industry."
  },
  {
    "headline": "Attacks on Military, Police Formations, Correctional Centres and Aregbesola – Nigerian Observer",
    "summarized_story": "OF late, there had been series of sponsored attacks on military, police, INEC offices and correctional centres facilities.\nThere have been more attacks on military and police facilities than correctional centres.\nSeveral but unsuccessful attempts were made to attack correctional facilities since then, as the armed guards repelled them on each occasion.\nThese are not mean institutions, and are manned by many top officialsThe state is host to the elite 1st Division of the Nigerian Army, Nigerian Army Depot, Zaria, Armed Forces Command and Staff College, Jaji, Nigerian Defense Industry, Nigerian Airforce Training School, Nigerian Police College and the Nigerian Navy School of Armament, Kachia.\nOther military institutions in Kaduna are: The Nigerian Army School of Legal Services, Bassawa Zaria, the Nigerian Defence Academy, the Nigerian Army School of Artillery, Kachia, the Nigerian Army School of Military Police, Army Operation Base, Southern Kaduna and the Nigerian Army School of Infantry."
  },
  {
    "headline": "Eid-el-Kabir: Benin monarch tasks muslims on religious tolerance, peace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Benin Monarch, His Royal Majesty, Oba Ewuare II has tasked Muslims on religious tolerance towards achieving stability and peaceful coexistence in Nigeria.\nSpeaking when he received members of Benin Muslim Congress during the Eid-El-Kabir festival at his palace in Benin City, where they offered prayers for Benin Kingdom and Nigeria at large, he said “That is what the Sultan usually tells us when we are together in a gathering.\nHe expressed concern over the security challenges in NigeriaLeader of the group and Chief Imam of Benin Central Mosque, Sheikh Adulfatai Enabulele, eulogized the Benin monarch for his traditional and spiritual role in Edo State and Nigeria at large.\nAccording to him, “We muslims in this Kingdom, by the grace of God will continue to work assiduously to make sure that nobody comes here (Edo) and misbehaves.\nWe pray that the security agencies have the will power to deal with them (criminals),” he said."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Insecurity: We’re paying so much money to bandits – Gen. Haruna",
    "summarized_story": "The retired military general noted that a situation where the government now has to negotiate with bandits and terrorists was unacceptable, as according him, the country is paying so much money to the terrorists which is helping to fuel insecurity.\nThe former chairman, executive council, of Arewa Consultative Forum who spoke on Arise TV on Monday, said, “Our security needs overhaul; Insecurity is a disturbing issue.\nBut principally, the police are responsible for internal security and the political leadership has the duty of constitutional responsibility.\nWe have this problem where the army is the first line of security, such that there is no clear delineation of responsibility.\n“It is so unfortunate that we paying so much money to bandits to free hostages.”"
  },
  {
    "headline": "IOCs to remit N400bn oil debt for July – Report",
    "summarized_story": "Five international oil companies (IOCs) operating in Nigeria’s oil and gas sector are to remit an outstanding balance of about N400bn to the federation government through the Nigerian National Petroleum Company Limited (NNPC) this July, according to The Punch.\nAccording to figures on April 2022 domestic crude oil payable in July 2022 obtained from NNPC on Sunday, the companies would pay N399.91bn this month for domestic crude oil sold by the firms in April 2022.\nData from NNPC indicated that N92.64bn for 2.2 million barrels of crude oil would come from Chevron, while N201.49bn for 4.75 million barrels of oil would be paid by Mobil.\nFor First E&P, a total of N28.13bn for 650,058 barrels of crude oil would come from the oil firm this July for products sold in April 2022.\nThe IOCs had repeatedly complained of their inability to produce more crude oil for export due to the massive theft of the product by criminals."
  },
  {
    "headline": "EXPLAINED: Why Elon Musk is terminating $44b Twitter deal",
    "summarized_story": "In May, Twitter informed that it suspended over half a million accounts suspected to be spam every day.\nTwitter Chief Executive Officer, Parag Agrawal, had explained the efforts of the company at reducing spam accounts.\nMusk claimed Twitter did not provide him with necessary information on the prevalence of fake or spam accounts on its platform, a concern he first raised in May.\nSecondly, there were also questions about how Musk would finance the $44 billion deal.\nIn May, Musk had told the US SEC that the deal would include $33.5 billion in equity, up from an earlier commitment of $27.25 billion."
  },
  {
    "headline": "Mercy Aigbe celebrates daughter, Michelle, on 21st birthday",
    "summarized_story": "Nollywood actress Mercy Aigbe has celebrated her daughter, Michelle, on the occasion of her 21st birthday.\nThe actress on her Instagram page realmercyaigbe, shared a photo of Michelle and wrote, “Look who turned 21 today!!!!\n💃💃💃…1”My hunny bunny, my chocolata, my caramel topping, the apple of my eyes, my sweetheart, my angel, the first fruit of my womb, by this time 21years ago I don push you out 😁😅, my big baby, the best gift from God to me, my jewel, the best daughter ever, my smart, very intelligent daughter, my source of strength, my world, my everything 😍”You will continue to be the head in all you do, the Lord will prosper you beyond measures, you will continue to grow from glory to glory, the Lord will guide and protect you, no evil shall befall you, you shall thrive and be successful even beyond my expectations, in Jesus’ mighty name!\nI love you my princess @michelleio__"
  },
  {
    "headline": "2023: Kwankwaso hints at backing Tinubu [VIDEO]",
    "summarized_story": "Rabiu Musa Kwankwaso, presidential candidate of the New Nigeria People’s Party (NNPP), has hinted at possibility of backing Bola Ahmed Tinubu, candidate of the All Progressives Congress (APC).\nThe former Kano governor’s NNPP doesn’t have enough national spread, and merger talks with Labour Party collapsed last month.\nKwankwaso during an interview session on Arise TV on Sunday, indicated that he was more inclined to work with the former Lagos governor.\nOrdinarily, if I cannot get it, I can recommend him but it’s going to be like building something on zero.\n“When I see him, I wish him well or when you see him before me, tell him I wish him well — but let’s take it easy.”Watch video below:"
  },
  {
    "headline": "JUST-IN: Osun LP Gov’ship Candidate Escapes Death As Gunmen Attack Residence",
    "summarized_story": "The Labour Party (LP) gubernatorial candidate for the July 16, 2022 governorship election in Osun State, Rt.\nLasun Yusuf, narrowly escaped death in the early hours of Monday after unknown gunmen attacked his residence.\nThe former Deputy Speaker of the House Representatives was attacked at Ilobu, his hometown, in Irepodun local government area of the State at about 2.00am.\nRaising the alarm on his verified Twitter handle, Yussuff said the gunmen were shooting sporadically in his compound.\nThe LP governorship candidate wrote: “Just in: gun men in uniforms are presently in my residence shooting sporadically…”When contacted, his media aide, Mr. Oyewole Oladimeji, confirmed the incident."
  },
  {
    "headline": "JUST-IN: Osun LP Gov’ship Candidate Escapes Death As Gunmen Attack Residence",
    "summarized_story": "The Labour Party (LP) gubernatorial candidate for the July 16, 2022 governorship election in Osun State, Rt.\nLasun Yusuf, narrowly escaped death in the early hours of Monday after unknown gunmen attacked his residence.\nThe former Deputy Speaker of the House Representatives was attacked at Ilobu, his hometown, in Irepodun local government area of the State at about 2.00am.\nRaising the alarm on his verified Twitter handle, Yussuff said the gunmen were shooting sporadically in his compound.\nThe LP governorship candidate wrote: “Just in: gun men in uniforms are presently in my residence shooting sporadically…”When contacted, his media aide, Mr. Oyewole Oladimeji, confirmed the incident."
  },
  {
    "headline": "Social Action Group Demands Inauguration Of NDDC Board",
    "summarized_story": "The groundswell of agitations for the inauguration of a substantive board of the Niger Delta Development Commission (NDDC) in compliance with the law, has continued to increase following the recent appointment of Obong Umana Okon Umana as the Minister of Niger Delta Affairs.\nThis is moreso with Umana’s promise to “meet the yearnings of the people of the Niger Delta for development.”The latest demand comes from Social Development Integrated Centre, also known as Social Action, which has called on the Federal Government to inaugurate a substantive NDDC Board and address other malfeasances in the Commission.\nSocial Action, therefore, charged the citizens of the Niger Delta region to take the bull by the horn and drive the change narrative for the most advantageous performance of the Commission.\n“We call on the people of the Niger Delta region to work with other civil society organizations to collectively push the bar of accountability and strengthen the regional mechanism to ensure an improved NDDC,” it reiterated.\nIt is only by mobilizing all the arsenals at our collective disposal that we can get the NDDC to its right course and advance the sustainable development of the region."
  },
  {
    "headline": "Social Action Group Demands Inauguration Of NDDC Board",
    "summarized_story": "The groundswell of agitations for the inauguration of a substantive board of the Niger Delta Development Commission (NDDC) in compliance with the law, has continued to increase following the recent appointment of Obong Umana Okon Umana as the Minister of Niger Delta Affairs.\nThis is moreso with Umana’s promise to “meet the yearnings of the people of the Niger Delta for development.”The latest demand comes from Social Development Integrated Centre, also known as Social Action, which has called on the Federal Government to inaugurate a substantive NDDC Board and address other malfeasances in the Commission.\nSocial Action, therefore, charged the citizens of the Niger Delta region to take the bull by the horn and drive the change narrative for the most advantageous performance of the Commission.\n“We call on the people of the Niger Delta region to work with other civil society organizations to collectively push the bar of accountability and strengthen the regional mechanism to ensure an improved NDDC,” it reiterated.\nIt is only by mobilizing all the arsenals at our collective disposal that we can get the NDDC to its right course and advance the sustainable development of the region."
  },
  {
    "headline": "E-Learning Is The New Education Model – Commissioner",
    "summarized_story": "Last Thursday, Kaduna State Government launched an e-learning portal which is also known as Nigeria Learning Passport.\nAnd it’s actually a collaboration with the federal government and UNICEF and of course our state, Kaduna state.\nSo basically, Nigeria Learning Passport is an online e-learning platform with mobile and offline capability.\nNigeria Learning Passport is also an ‘education model’ for early childhood education, primary and secondary education, adolescent skills, and technical and vocational education.\nBetter Education Service Delivery for All (BESDA) is an education programme which some selected states are running in conjunction with Universal Basic Education Commission (UBEC)."
  },
  {
    "headline": "APC Chieftain, Bwala Dumps Party Over Tinubu, Shettima’s Presidential Muslim-Muslim Ticket",
    "summarized_story": "Daniel H. Bwala, a senior member of the ruling All Progressives Congress (APC), has left the party over the selection of a Muslim-Muslim presidential ticket for the 2023 general elections.\nAs widespread criticism and rejection followed the party’s selection of Senator Kashim Shettima, the former governor of Borno State, as Bola Tinubu’s running mate for the APC presidential nomination, Bwala announced his resignation from the party on Sunday night.\nAt this time of our national existence, our efforts and energy should gravitate towards uniting our people,” Bwala wrote on his Twitter page.\nMany Nigerians, especially members of opposition parties have criticised the ruling party over its Muslim-Muslim ticket, with some describing it as “terrible” and an indication of the party’s “insensitivity” to the current situation in the country.\nSome critiques of the APC’s Muslim-Muslim ticket choice have also said that the party is insensitive to Nigeria’s religious composition and argued that it is capable of igniting religious dichotomy in the country."
  },
  {
    "headline": "Terrorists Demand N4.3bn For Abducted Kaduna Train Hostages",
    "summarized_story": "NEWS DIRECT has learned that terrorists are requesting a N100m ransom for each of the 43 passengers from the Kaduna train who have been kidnapped and are currently in their custody.\nDuring the attack, the terrorists overpowered the security guards monitoring the facility and released approximately 300 Boko Haram fighters, convicted criminals, and other prisoners.\nNEWS DIRECT had reported that the terrorists attacked the Abuja-Kaduna train on March 28, killing eight and kidnapping no fewer than 61 passengers.\nOn June 12, the terrorists released 11 hostages after 75 days in captivity, while another seven regained their freedom on Saturday.\nThe source said the seven victims that were released on Saturday paid an undisclosed amount."
  },
  {
    "headline": "BREAKING: Tinubu Announces Kashim Shettima As Running Mate",
    "summarized_story": "Bola Tinubu, the presidential candidate of the All Progressives Congress, has announced Senator Kashim Shettima as his running mate.\nMr Tinubu announced this while addressing journalists in Katsina State on Sunday.\nTinubu earlier chose Ibrahim Kabiru Masari, as a placeholder for the vice-presidential slot.\nAddressing journalists on Sunday, Tinubu said a substantive running mate would replace Ibrahim Masari.\nWhen quizzed further on the substantive running mate, Tinubu said, “Kashim Shettima, I have not discussed with him but I have disclosed it to you.”Meanwhile, Ibrahim Masari who was earlier announced as a placeholder for the vice-presidential slot has resigned."
  },
  {
    "headline": "BREAKING: Tinubu Finally Picks Muslim Running Mate",
    "summarized_story": "Bola Tinubu of the All Progressives Congress, or APC, has chosen a Muslim as his running partner for the 2023 presidential election.\nAccording to the DAILY POST, certain national stakeholders urged the former governor of Lagos State against choosing a Muslim running mate since a Muslim-Muslim ticket would exclude Christians.\nHowever, according to a report published by Vanguard on Sunday, Tinubu has chosen Senator Kashim Shettima as his running mate.\nShettima served as the governor of Borno State for two terms and is the senator for Borno Central in the Red Chamber.\nWithin the next week, Tinubu is anticipated to inform President Muhammadu Buhari of his choice of running partner."
  },
  {
    "headline": "2023: Another top APC chieftain dumps party as Tinubu picks running mate",
    "summarized_story": "A chieftain of the All Progressives Congress (APC), Daniel Bwala, on Sunday, dumped the ruling party after its presidential candidate, Asiwaju Bola Tinubu, announced Kashim Shettima, as his running mate.\nBwala stated that the efforts and energy of the ruling party should be in uniting Nigerians at such a time and not otherwise.\nAt this time of our national existence, our efforts and energy should gravitate towards uniting our people.\n“Asiwaju has announced Kashim Shetima as his running mate.\nKwankwaso is planning to announce a Pentecostal Bishop as his running mate."
  },
  {
    "headline": "Breaking: Popular Ibadan market on fire",
    "summarized_story": "A popular market in Ibadan, Oyo state capital has been gutted by fire.\nBlueprint gathered that the market is known as Bodija got burnt on Monday morning, one of the days the federal government declared as public holiday in respect to this year’s Sallah celebrations by Muslim faithful.\nAuthorities such as fire service and Police are to comment on the incident.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Tinubu on APC running mate: Real reason I picked Shettima",
    "summarized_story": "After series of consultations and high-level politicking, the All Congress (APC) presidential candidate and national leader of the party, Asiwaju Bola Ahmed Tinubu, Sunday confirmed former Borno state Governor Kashim Shettima as his running mate.\nThe announcement came against the backdrop of the argument for and against the APC Muslim-Muslim presidential ticket.\nHowever, in announcing Shettima’s choice, Tinubu said the serving lawmaker remains the best person that could help him achieve good governance.\nShettima, a serving lawmaker and close associate of Tinubu, has been a staunch supporter and campaigner for the choice of former Lagos state governor as the next president.\n“In full compliance with existing law and regulation, I submitted all necessary documents regarding my nomination as the APC presidential candidate to INEC."
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "REA, FADAMA sign MoU for Agriculture, water resources programmes electrification",
    "summarized_story": "By Onu OkorieRural Electrification Agency REA has signed a Memorandum of Understanding MoU with the National Fadama Development Project NFDP to collaborate on several activities during the planning and implementation of electrification programmes targeted at agriculture, land and water resources.\nAccording to him, “The MoU will mutually benefit both the REA and FADAMA.\nThese “Agro-Energy” programmes are intended to provide electricity for productive use and unlock the economic potential/activities in rural and agrarian communities alike.\nREA intends to provide decentralised solar pumps and/or centralised solar mini-grids to viable FADAMA irrigation schemes.\nREA intends to provide Solar Home Systems (SHS) and Solar Street Lights (SSLs) to viable IDP communities."
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "‘They Wanted To Eliminate Me’, Osun Labour Party Candidate Lasun Recounts Attack Ordeal",
    "summarized_story": "Lasun who is a former Deputy Speaker of the House of Representatives confirmed the attack while briefing reporters on Monday, hours after the incident was reported to have taken place.\nThe building is located in Oke Ima area of Ilobu, the hometown of the governorship candidate Irepodun Local Government Area of the state.\nThe governorship candidate believes the attacked who stormed his residence at about 2am came with the intention of harming him.\nBefore the interview with reporters, the former deputy speaker had taken to his Twitter handle to raise an alarm over the attack.\nAkin Ogunbiyi of the Accord Party and Oyegoke Omigbodun of the Social Democratic Party (SDP) also took their stand on the stage."
  },
  {
    "headline": "Kuje Jailbreak: Wanted Suspected Terrorist Arrested With Drug In Abuja",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA) have arrested one of the wanted terror suspects who escaped from the Medium Security Correctional Centre, Kuje in Abuja, following an attack on the facility by terrorists.\nChecks by Channels Television also showed that the suspect hailed from Borno State in the north-east region of the country.\nAlthough the pictures are the same, the Nigerian Correctional Service (NCoS) had while declaring the suspect alongside 68 others wanted, identified him as Suleiman Idi.\nGen. Mohamed Buba Marwa (Retd) has directed that the wanted suspect should be immediately handed over to the Nigerian Correctional Service, NCoS.”Suleiman’s arrest came three days after another suspected terrorist who fled the correctional facility, Hassan Hassan, was recaptured in Nasarawa State.\nOthers are Mohammed Goni Kyari, Mohammed Guja, Mohammed Saleh Buba, Mohammed Umar, Mukhtar Ussaini Khalidu, Musa Adamu, Musa Umar, Onyemire Asagba, Rabiu Shaibu, Sahabi Ismail, Sani Mohammed, Umar Ahmadu Ladan, Usman Balarebe, Yahaya Adamu Abubakar, Yusuf Yakubu, Abdulazeez Obadaki, Auwal Abubakar, Mansur Mohammed Usman, Mohammed Abubakar, Mohammed Jamiu Eneji Sani, Muazu Abubakar, Muhammed Sani Adamu, Muktar Umar, Nambil Zakari Gambo, Sadiq Garba Abubakar, Yazid Muhammed Usman, Yusuf Ali Yusuf."
  },
  {
    "headline": "‘Religion Cannot Always Determine Our Path,’ Tinubu Speaks About Muslim-Muslim Ticket",
    "summarized_story": "The presidential candidate of the All Progressives Congress (APC), Bola Tinubu, has explained the reason for his decision to pick a Muslim as his running mate in the forthcoming general elections.\nHis choice of Shettima who is a Muslim as running mate has, however, sparked widespread criticism, especially from the Christian community in the country.\nREAD ALSO: Tinubu Picks Ex-Borno Governor Shettima As Running MateThe APC standard-bearer, in his reaction, believes the challenges facing Nigeria require placing competence in governance above religious sentiments.\n“Religion, ethnicity, and region cannot always and fully determine our path,” he was quoted as saying in a statement on Sunday by Bayo Onanuga, a spokesman for the Tinubu Campaign Organisation.\nVIDEO: Why I Picked Kashim Shetimma As Running Mate – Tinubu“I am mindful of the energetic discourse concerning the possible religion of my running mate,” the APC flagbearer said."
  },
  {
    "headline": "Osun Election: Candidates To Sign Peace Accord On July 13 – Peace Committee",
    "summarized_story": "Ahead of the July 16 governorship election in Osun State, political candidates and their parties will on Wednesday sign a Peace Accord to commit themselves to the smooth conduct of the exercise.\nChairman of the committee and former Head of State, General Abdusalami Abubakar (rtd), stated this via a statement issued on Sunday.\nREAD ALSO: Osun Debate: Adeleke Tackles Oyetola On State Helicopter, Use Of Amotekun“The NPC hereby wishes to announce that a peace accord will be signed by the various political parties and stakeholders on 13th July 2022, in Osogbo, Osun State,” he said.\nAbubakar also called on the Independent National Electoral Commission, (INEC) and all stakeholders to consolidate on the success of the recently held Ekiti State governorship poll.\nWe call on INEC and the security agencies to ensure inclusivity, facilitating an electoral exercise where the electorate is not disenfranchised because of gender, religious beliefs, ethnic affiliation, or disability."
  },
  {
    "headline": "At Least 11 Killed As Bandits Invade Farms In Zamfara Community",
    "summarized_story": "No fewer than 11 locals have been killed as bandits attacked Dangulbi community in Maru Local Government Area (LGA) of Zamfara State.\nDangulbi is about 100km away from Gusau, the Zamfara state capital.\nThe spokesperson for the Zamfara State Police Command, Mohammed Shehu, confirmed the casualty figure to Channels Television on Monday morning via a telephone chat.\nHe stated that the police authorities have since deployed a reinforcement team to the area to restore calm and normalcy in the community.\n“He (Damina) attacked Kango village, a 2km settlement away from Dangulbi, and killed seven people,” he continued."
  },
  {
    "headline": "2023 Presidency: Meet Tinubu's running mate, Kashim Shettima",
    "summarized_story": "AdvertisementTHE 55 YEARS OLD SENATOR BORN ON THE 2ND OF NOVEMBER 1966 WAS A TWO TERM GOVERNOR OF BORNO STATE BETWEEN 2011 AND 2019.\nSENATOR KASHIM SHETIMMA WA AT THE HELMS OF AFFAIRS AS GOVERNOR OF BORNO STATE IN THE HEAT OF THE BOKO HARAM INSURGENCY.\nSENATOR SHETIMMA HAS ALWAYS SPOKEN UP ON MATTERS OF NATIONAL SECURITY AND HAS OVER TIME CALLED FOR THE EQUIPPING, FUNDING AND RECRUITMENT MORE SECURITY PERSONNEL TO ENABLE THE COUNTRY CONFRONT EMERGING THREATS TO NATIONAL SECURITY.\nAdvertisementAdvertisementAs Governor of Borno State, he GOT COMMENDATIONS FOR HOW HE MANAGED challenges arising from the Boko Haram insurgency which he inherited in 2011.\nAdvertisementIn mid-2007, Shettima was appointed Commissioner, Borno State Ministry of Finance and Economic Development."
  },
  {
    "headline": "How Shettima will Impact Tinubu's 2023 Presidential bid",
    "summarized_story": "A former deputy governor of Borno state, Adamu Dibal, shared his reaction to the selection of Sen. Kashim Shettima as Tinubu’s running mate in the 2023 Presidential Election.\nThe former Borno State second-in-command strongly feels that the union of Tinubu and Shettima has solidified the APC ticket, promising that “APC will win the entire Northeast in 2023”.\nAdvertisementRecall that the APC Presidential candidate, Asiwaju Bola Ahmed Tinubu on Sunday announced the selection of former governor of Borno State, Kashim Shettima after a closed door meeting with President Buhari in Daura.\nAdvertisement"
  },
  {
    "headline": "Tinubu pays Sallah homage to Buhari in Daura, picks Shettima as running mate -",
    "summarized_story": "The All Progressives Congress Presidential candidate, Asiwaju Bola Ahmed Tinubu has announced firmer governor of Borno State, Kashim Shettima as his running mateThe former governor of Lagos state made the announcement on Sunday shortly after a closed door meeting with the president.\nAdvertisementAdvertisement"
  },
  {
    "headline": "Zulum welcomes nomination of Shettima as APC’s vice presidential candidate -",
    "summarized_story": "The Borno State Governor, Babagana Zulum has described the choice of Senator Kashim Shettima as the All Progressives Congress Vice Presidential candidate, as the wisest choice made by the party’s presidential candidate, Asiwaju Bola Ahmed.In a statement personally signed by the Governor describes Shettima as one of the patriotic Nigerians who understands the complexities of the country.\nGovernor Zulum promised to campaign vigorously to secure overwhelming victory for the APC in 2023 general elections.\nAdvertisementThe statement adds that the APC presidential candidate Senator Bola Tinubu has chosen a running mate with very deep knowledge not only of the Nigerian economy but also of that of the world.\nThe governor expressed gratitude to President Muhammadu Buhari for his political leadership over the years and for supporting Shettima’s choice as the party’s vice presidential candidate.\nAdvertisement"
  },
  {
    "headline": "IOCs Killing Local Oil Servicing Companies in Nigeria, Says Wabote",
    "summarized_story": "Speaking at the just-concluded Nigeria Oil and Gas (NOG) in Abuja, Wabote stated that as the IOCs complain about the inclement business environment, they must also take cognisance of their negative attitude towards local oil servicing companies.\nHowever, Wabote explained that since oil price hit new heights, there had been no plan to increase it for local companies.\nOil price was $27 and at some point it was negative.\n“If you leave it to me, I will fix a price to it because it has to move in tandem with the oil price.\n“Meanwhile, they will demand for the service and the local companies will provide them the service, but when it is time to pay, the don’t."
  },
  {
    "headline": "Shettima as Running Mate: APC Governors Displeased as Tinubu Says Spirit of 1993 Upon Us in 2023",
    "summarized_story": "At this time of our national existence, our efforts and energy should gravitate towards uniting our people“Asiwaju has announced Kashim Shettima as his running mate.\nKwankwaso is planning to announce a Pentecostal bishop as his running mate.\nBut, as was expected, the choice of my Vice Presidential running mate remained an open and burning question.\n“I am mindful of the energetic discourse concerning the possible religion of my running mate.\n“In 1993, Nigerians embrace Chief MKO Abiola and a fellow Muslim running mate, Baba Gana Kingibe in one of our fairest elections ever held."
  },
  {
    "headline": "15 Bodies Recovered from Lagos Boat Mishap",
    "summarized_story": "Eleven more bodies were on Sunday recovered from the ill-fated boat sailing from Mile 2 to Ibeshe in the Ojo area of Lagos State after four were found on Saturday.\nThe acting Coordinator of the Lagos Territorial Office of the National Emergency Management Agency (NEMA), Ibrahim Farinloye, confirmed the development.\n“It is likely that two more bodies have been sighted.\nThe NEMA coordinator insisted that wooden boats are not permitted to be used as passengers’ boats.\n“But only at these odd hours the illegal operators always put the lives of unsuspecting passengers at risk,” he added."
  },
  {
    "headline": "Nigeria: Kidnappers Release Pastor’s Daughter After Killing Siblings, Shooting Father",
    "summarized_story": "Adamawa State Police Command in Nigeria’s North-East, has confirmed the release of the kidnapped 13-year-old daughter of Pastor Daniel Umaru, after a huge ransom was allegedly paid to her abductors.\nThe kidnappers, had shot the cleric, killed his two sons and kidnapped his only daughter last week in Mubi, Adamawa State.\nReports from the affected areas had revealed that gunmen shot Pastor Umaru, gunned down his two sons and kidnapped his 13-year-old daughter in Adamawa State.\nThe sons died while the pastor was taken to hospital, where he has been fighting to survive.\nThe mother of the deceased was said to have suffered trauma following the tragedy that befell the family."
  },
  {
    "headline": "Candidates Jostle to Replace UK PM Johnson in Packed Race",
    "summarized_story": "The contest to replace British Prime Minister Boris Johnson gathered pace on Sunday as five more candidates declared their intention to run, with many pledging lower taxes and a clean start from Johnson’s scandal-ridden premiership.\nJohnson had on Thursday said he would resign as Prime Minister, after lawmakers and cabinet colleagues rebelled over his handling of a series of scandals, including breaches of lockdown rules in gatherings at his Downing Street office.\nI believe that a socialist or socialist-led coalition government at the next election would be a disaster for the UK,” Mordaunt said in a statement.\nParty members would elect a new party leader over the summer, who would then become prime minister.\nThat’s why I’d be very careful not to promise (tax) cuts that would stoke inflation,” he said."
  }
]