[
  {
    "headline": "Eid-el-Fitr: Lagos makes a U-turn, cancels Wednesday holiday",
    "summarized_story": "The Lagos State Government said it only approved May 2nd and 3rd as public holidays to celebrate the 2022 International Workers’ Day and the Eid-el-Fitr celebrations.\nThe government also told workers in the Centre of Excellence to disregard its earlier circular which approved three straight days as public holidays.\nThe Head of Service in the state, Hakeem Muri-Okunola, in a circular to workers dated April 27, 2022, had approved May 2-4 as public holidays.\nHowever, upon the declaration by the Minister of Interior, Rauf Aregbesola, that May 2-3 were approved, the Lagos HoS made a U-Turn and approved the same, urging workers to disregard the first circular.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Osun 2022: Monarch warns against defamation",
    "summarized_story": "The Owa Obokun of Ijesaland, Oba Gabriel Adekunle Aromolaran, has charged politicians to do away with the campaign of calumny against each other.\nThe monarch, ahead of the July 16, Osun 2022 gubernatorial election, called on politicians to limit their campaigns to issues rather than mudslinging and casting aspersions on one another.\nHe gave the advice while receiving the gubernatorial candidate of the Peoples Democratic Party, Senator Ademola Adeleke, in his palace at Ilesa.\nThe monarch noted that the people of Ijesaland had always relied on the strength of the unity in the land to achieve development.\nHe also urged Adeleke to stand by his campaign promises if he emerged as the governor."
  },
  {
    "headline": "Farmers were deceived into planting GMOs – Activist, Nnimmo Bassey",
    "summarized_story": "Environmental Activist, Nnimmo Bassey has flayed the federal government for distributing commercial quantities of Genetically Modified Cowpea to farmers without informing them they were being given GM beans to plant.\nThe introduction of genetically engineered cowpea is a great cause for concern for farmers, consumers, and civil society organizations across the continent.\n“We are calling for the prohibition of GM seeds in Nigeria.\n‘‘GM seeds decrease soil fertility, erode biodiversity, impoverish small scale farmers and promote land grab for monocultures.\nResearch shows that Nigeria is known worldwide as a centre for cowpea production and also the largest importer of cowpea in Africa, ironically."
  },
  {
    "headline": "Eid-el-Fitri: Kogi CP assures of hitch-free celebration",
    "summarized_story": "The Kogi State Commissioner of Police, Edward Egbuka, has assured members of the public of a hitch-free Eid-el-Fitri celebration.\nThe Commissioner, in a statement through the command Public Relations Officer, SP William Ovye Aya, on Friday ordered watertight security across the state before, during and after the celebrations.\nEgbuka, who met with senior officers of the command in Lokoja charged all Area Commanders, Tactical and Operational Commanders as well as the Divisional Police Officers to beef up security within their areas of responsibility and to ensure massive deployment of patrol teams along the major highway and undercover operations to black spots, flashpoints, and other vulnerable criminal spots to nip in the bud all forms of crimes and criminality across the state.\nWhile felicitating with Muslims on the occasion of 2022 Eid-el-Fitri, the statement added that “the Commissioner of Police reiterates the Command’s level of preparedness, determination and commitment in synergy with other security agencies in ensuring safety of lives and property”.\nThe statement however admonished the people of Kogi State to continue to collaborate with the security forces with credible and useful information on the activities of criminal elements in order to curtail their acts."
  },
  {
    "headline": "Osun announces new date for school resumption",
    "summarized_story": "The Osun State Government has announced a new date for the resumption of pupils and students of both public and private schools in the state.\nThe state government announced May 9 as against an earlier announced 2nd of May for the commencement of the 2021/2022 third term academic session.\nThe new directive is contained in a press statement signed by the Permanent Secretary, Ministry of Education, Adelani Aderinola.\nHe further stated that the new date is informed by the public holidays which fall within the first three days of the earlier announced resumption date.\nAderinola enjoined parents and guardians to use the opportunity to keep custody of their children and wards preparatory to the newly announced date of resumption."
  },
  {
    "headline": "2023: Voter education will address apathy – Gbajabiamila",
    "summarized_story": "Speaker of Nigeria’s House of Representatives, Hon.\nFemi Gbajabiamila, has said voter education and enlightenment could address apathy and increase voter turnout in the forthcoming 2023 elections.\n“Clearly, we need to reform our campaign finance laws and the entire system through which we fund politics and political operations in the country.\n“Each electoral amendment effort reflects a considered attempt to provide a more robust statutory framework for elections.\n“In the 2022 Appropriations Bill, the legislature has made provisions to allow both the Independent National Electoral Commission (INEC) and the security agencies to make adequate plans for these contingencies."
  },
  {
    "headline": "US confirms first human case of H5 bird flu",
    "summarized_story": "The United States has confirmed the first known human case of H5 bird flu in a person in the western state of Colorado.\nThe patient reported fatigue for a few days as the only symptom and had since recovered.\nAccording to the CDC, the patient is being isolated and treated with the influenza antiviral drug oseltamivir.\n“This case does not change the human risk assessment for the general public, which CDC considers to be low,’’ the agency said.\nThe first case of H5N1 viruses was reported in Britain in December 2021."
  },
  {
    "headline": "‘Petition against Gov Abiodun’s second term a failed project’",
    "summarized_story": "He assured that he and Ogun West senatorial district wre solidly behind him to coast home to victory come 2023.\nAside from re-registering his membership of the All Progressives Congress (APC) in Ogun State, Adeola said he has also swapped his INEC’s Permanent Voters’ Card (PVC) to Ogun State.\n“This is however one of the bold decisions that I have to take if truly I want to do politics in Ogun State”.\nMy senatorial seat in Lagos State is never threatened, even if I choose to contest again in Lagos State, I will still win.\n“While I was representing Lagos State, I was equally contributing my quotas to Ogun West politics."
  },
  {
    "headline": "FG declares May 2, 3 public holidays",
    "summarized_story": "The Federal Government has declared Monday 2nd and Tuesday 3rd May, 2022 as public holidays to mark workers day and EIdul-Fitr celebrations.\nThe Minister of Interior, Ogbeni Rauf Aregbesola, made the declaration on behalf of the Federal Government.\nA statement signed by the Permanent Secretary in the Ministry, Dr Shuaib Belgore said Aregbesola commended workers for their hard work, diligence and sacrifice.\nWe are alive because we work and only the dead is incapable of working.”Aregbesola enjoined workers to imbibe the culture of productivity.\nAregbesola called on all Muslims to imbibe and practice the virtues of kindness, love, tolerance, peace, self-denial, sacrifice and good neighbourliness as exemplified by the Holy Prophet Muhammad (Peace be upon Him)."
  },
  {
    "headline": "Malami to run for Kebbi governor",
    "summarized_story": "Minister of Justice and Attorney-General of the Federation (AGF) Abubakar Malami says he has accepted calls from Kebbi people to run for the governor.\nMalami made the acceptance in Birnin Kebbi yesterday at an interactive session with APC stakeholders in the state.\n“Since you want me to contest governorship position of the state, I hereby accept your demand since you want me to do so.\n“People from the state have been pressurising me to contest the governorship position in 2023.\nHe called on the youth to emulate the humility of Malami as a son of Islamic teacher."
  },
  {
    "headline": "PDP screens 48 aspirants for governor in S’West, S’East",
    "summarized_story": "Southwest:Eleven aspirants from Oyo, Lagos and Ogun states appeared before the PDP screening panel at the Zonal Office, Ibadan.\nSome of the screened aspirants commended the screening committee for transparency.\nThe governor, in the statement, directed the police to arrest Dagogo, who immediately denied the allegations and vowed to attend the screening exercise.\nThis will encourage more beneficial schemes as people-oriented government.”NortheastPDP screens Fintiri, Bauchi SSG, othersAspirants from Adamawa, Bauchi, Borno, Gombe, Taraba, and Yobe appeared before the screening committee.\nOther PDP aspirants are Aminu Ayuba, Joseph Albasu Kunin (TarabKunine) Dr. Babayo Ardo Kumo, Gombe: Jamulu wanna Ishiaku and Dr. Ali Tikau Adamu (Yobe)."
  },
  {
    "headline": "Buhari to court: Electoral Act 84 (12) unconstitutional",
    "summarized_story": "By Yusuf Alli and Eric Ikhilae, AbujaSection 84(12) of the Electoral Act 2022 cannot stand, President Muhammadu Buhari and the Attorney-General of the Federation (AGF) Abubakar Malami (SAN) told a court yesterday.\nPresident Buhari and Malami’s position is contained in a joint counter-affidavit they filed in the suit numbered FHC/ABJ/CS/247/2022 by the PDP.\nThey added that they had never taken it upon themselves to declare Section 84(12) or any provision of the Electoral Act, 2022 unconstitutional, as such a declaration was beyond their constitutional powers.\n“Section 84(12) of the Electoral Act, 2022 is inconsistent with Sections 1(3), 42, 65, 66 particularly sections 66 (1) (f), 106 and 107 of the Constitution.\n“Based on cogent reasons and the need for fairness, the NWC has dropped the guideline on resignation because it is at variance with 84 (12) of the Electoral Act which is silent on timeline for resignation."
  },
  {
    "headline": "2023: Bala Mohammed, Saraki under pressure",
    "summarized_story": "By Wilfred Eya and Noah Ebije, KadunaWith deadline for the primaries of political parties fast approaching, Bauchi State Governor, Bala Mohammed and former Senate president, Bukola Saraki have come under intense pressure as Northern elders intensify efforts to get one of them to step down.\nBoth aspirants emerged as the Northern consensus candidates of the main opposition Peoples Democratic Party (PDP) for the 2023 presidential election.\nHe said the Northern leaders have insisted that either of Mohammed or Saraki must step down for the other to reduce friction during the primary.\nApart from Mohammed, Saraki and Tambuwal, the other candidate in the consensus arrangement was Mohammed Hayatu-Deen, former managing director of African International Bank.\nProfessor Abdullahi, who is the Convener of the Northern Elders Forum (NEF) stated this at his Zaria residence while reacting to the Coalition of Northern Groups (CNG) leadership who paid him a visit."
  },
  {
    "headline": "2023: Tension mounts as PDP screens Atiku, Tambuwal, Obi, 14 others today",
    "summarized_story": "From Ndubuisi Orji, AbujaTension is mounting in the Peoples Democratic Party (PDP) as it finalises plans to screen 17 aspirants who obtained Expression of Interest and Nomination Forms for its May 28/29 presidential convention.\nThe aspirants include former vice president, Atiku Abubakar; former Secretary to Government of the Federation (SGF), Anyim Pius Anyim; former Senate President, Bukola Saraki; former governor of Anambra State, Peter Obi and Sokoto State governor, Aminu Tambuwal.\nDo not miss the Vital Information, it goes off in 2 days!\nParty leaders, especially those who are pro-zoning are concerned that immediately the screening is concluded, discussions on report of the committee may become an academic exercise.\nThe recommendation has not gone done well with stakeholders in the South, with the Southern PDP governors insisting that the ticket must be zoned to the area."
  },
  {
    "headline": "Insecurity threat to Nigeria’s nationhood –Gbajabiamila",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila, has said security challenges pose serious threat to the foundations of Nigeria’s nationhood.\nHowever, we cannot do this for as long as our present national security challenges persist.”He, however, said the Nigerian Government had responded to the challenges by increasing funding for the police and the military and recruiting personnel for security agencies, among others.\nThe speaker said upon resumption, the House would do what was required to overcome the difficulties and deliver the dividends of democracy to the people.\nGbajabiamila also said he convened the first Conference of Speakers of African Parliaments (CoSAP), as a platform for continental parliamentary cooperation and coordination aimed at changing the dynamic.\nGbajabiamila said the Nigerian House of Representatives would this year host the inaugural in-person meeting of CoSAP to establish a framework of action."
  },
  {
    "headline": "Kalu to deliver Enugu’s Economic Summit Lecture",
    "summarized_story": "100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nAre you a Man 40 yrs and above?\nDo not miss the Vital Information, it goes off in 2 days!\nThe lecture was put together by the Egede Economic Summit Initiative to commemorate the fourth anniversary of the coming together of the different technocrats , intellectuals , eminent businessmen and leaders of repute to discuss the way forward in our economy with special emphasis on agriculture.\nBefore delivering the lecture, Kalu is expected to pay a courtesy call Governor Ifeanyi Ugwuanyi"
  },
  {
    "headline": "The Sun award recognition of my modest achievements –Umahi",
    "summarized_story": "Ebonyi State Governor, David Umahi, has expressed delight at his nomination as The Sun Man of the Year 2021, describing the award as not only prestigious but also gratifying.\nUmahi and 25 others would receive various categories of awards on May 7, 2022, at The Sun awards ceremony holding in Lagos.\nHe thanked the Management of The Sun for finding him worthy of the award, while promising to continue delivering good governance and rapid development of Ebonyi State.\nUmahi dedicated the Man of the Year award to God, saying that his achievement in Ebonyi State was a miracle made possible by divine grace.\nI’m proud to dedicate this ward to God almighty, because what I see in Ebonyi State is a miracle."
  },
  {
    "headline": "Train Attack: Terrorists Release Photograph of Baby Delivered in Captivity By Abducted Woman",
    "summarized_story": "*Umar expresses dismay, appeals for international community’s interventionEmmanuel AddehThe photograph of a new-born baby girl delivered in a terrorists’ den by a mother abducted during the March 28 attack on an Abuja-Kaduna-bound train has been released by the abductors.\nA family member of the woman had first hinted that she had been delivered of her baby, although the identity of the new-born child was not disclosed until the terrorists released her picture.\nTHISDAY reported on Tuesday that one of the two pregnant women among the passengers kidnapped during the attack by the terrorists had been delivered of her baby.\nUmar had on Wednesday appealed to the federal government to do more to secure the release of victims of the Kaduna train abduction.\n“I appeal to the federal government to do more to secure the immediate release of these innocent victims."
  },
  {
    "headline": "IMF: Fuel Subsidy Causing Deterioration in Fiscal Balance in Nigeria",
    "summarized_story": "Nume EkegheThe International Monetary Fund (IMF) yesterday maintained that prolonged payment of petrol subsidy in Nigeria was affecting the country’s fiscal balance despite revenue increase from rise in global oil price.\n“Therefore, removing generalised subsidies is crucial to ensure that the rise in commodity prices generates fiscal savings.\nIt added: “Nigeria’s growth outlook has improved through higher oil prices and a stronger-than-anticipated recovery of manufacturing and agriculture.\nMoreover, low vaccination rates, rising security risks, and elevated price pressures weigh negatively on the medium-term growth outlook.\nHe said: “Higher oil prices may generate a windfall gain for the region’s 8 oil exporters."
  },
  {
    "headline": "Zenith Bank’s Growth Accelerates with 22% Rise in Gross Earnings in Q1",
    "summarized_story": "Kayode TokedeZenith Bank Plc has announced its unaudited results for the first quarter (Q1) ended 31st March 2022, with an impeccable growth of 22 per cent in gross earnings, from N157.3 billion reported in Q1 2021 to N191.5 billion in Q1 2022.\nIts profit after tax also grew by 10 per cent, from N53.06 billion to N58.19 billion over the same period.\nThe growth in the topline arose from both interest income and non-interest income.\nInterest income grew by 25 per cent, from N101.12 billion in Q1 2021 to N126.38 billion in Q1 2022, while non-interest income grew by 12 per cent, from N51.20 billion to N57.23 billion.\nCustomer deposits grew by 12 per cent, from N6.47 trillion in December 2021, to N7.25 trillion in March 2022."
  },
  {
    "headline": "THISDAY Presents Video Evidence of Wike’s Unreliability: Praising Amaechi, Obaseki Yesterday, Attacking Them Next Day",
    "summarized_story": "The video further showed that the newspaper’s publication of June 23, 2020, with caption: “With a Friend Like Wike, Obaseki Meets His PDP’s Waterloo; Almost,” was not libelous.\nDuring the cross examination, the witness, Igbanoi, argued that the publication by THISDAY did not make Wike’s political associates and friends to shun or abandon him.\nHe was appointed Director General of Obaseki Campaign Organisation despite the publication an indication that the publication clearly did not injure his public perception.\nLast month, the Rivers State High Court sitting in Port Harcourt had also watched video clips tendered by THISDAY.\nThe governor had claimed during his appearance in court that the publication portrayed him as deceitful, untrustworthy person."
  },
  {
    "headline": "Tinubu Joins Political, Business Leaders in S’Arabia for Prayers and Networking",
    "summarized_story": "The latest personality and political heavyweight to join other Nigerian leaders in prayer at a high octane networking, is the former governor of Lagos State and frontline presidential hopeful, Bola Ahmed Tinubu, who was though in Mecca for the Umrah as with others, however, found the atmosphere conducive for political networking, as usual.\nParticularly, this has become a political culture in Lagos State, where Tinubu was governor for eight years and has continued to dominate its politics in the last 23 years.\nIt was not surprising, therefore, that for an avowed kingmaker, who decided to throw his hat into the ring, joining other like-minds for Umrah, both for prayers and political networking, was almost a question of when.\nBut, as usual, such a gathering always affords us the opportunity to critically look at the state of the nation, particularly, now being an election season.\nYes, we’re – all networking and programming for the 2023 elections,” said one of the political leaders, who is also in Saudi for Umrah."
  },
  {
    "headline": "Security risks, low vaccination rates threaten Nigeria's economic outlook, IMF warns",
    "summarized_story": "The International Monetary Fund (IMF) says low vaccination rates, inflation and insecurity may threaten Nigeria’s economic growth.\nThe Bretton Woods institution said this in its April 2022 regional economic outlook for sub-Saharan Africa titled ‘A New Shock and Little Room to Maneuver’.\nAdvertisement“Nigeria’s growth outlook has improved through higher oil prices and a stronger-than-anticipated recovery of manufacturing and agriculture,” the report reads.\n“The outlook is subject to high uncertainty associated with oil prices and financial conditions.\nAdvertisementThe IMF projected that sub-Saharan Africa’s economic growth in 2022 will weaken to 3.8 per cent due to the Russia-Ukraine war."
  },
  {
    "headline": "Security risks, low vaccination rates threaten Nigeria's economic outlook, IMF warns",
    "summarized_story": "The International Monetary Fund (IMF) says low vaccination rates, inflation and insecurity may threaten Nigeria’s economic growth.\nThe Bretton Woods institution said this in its April 2022 regional economic outlook for sub-Saharan Africa titled ‘A New Shock and Little Room to Maneuver’.\nAdvertisement“Nigeria’s growth outlook has improved through higher oil prices and a stronger-than-anticipated recovery of manufacturing and agriculture,” the report reads.\n“The outlook is subject to high uncertainty associated with oil prices and financial conditions.\nAdvertisementThe IMF projected that sub-Saharan Africa’s economic growth in 2022 will weaken to 3.8 per cent due to the Russia-Ukraine war."
  },
  {
    "headline": "AT A GLANCE: Buhari's cabinet members seeking elective positions in 2023",
    "summarized_story": "Rotimi Amaechi, minister of transportation, was the first political appointee of President Muhammadu Buhari to formally declare his intention to run for president in 2023, and within weeks, other cabinet members announced their bids for the most important office in Nigeria.\nTheCable brings to you Buhari’s cabinet members seeking elective positions.\nPRESIDENTIAL HOPEFULSYEMI OSINBAJOAdvertisementVice-president Yemi Osinbajo announced his presidential ambition on April 11.\nThe minister said he wants to contest the party’s presidential ticket to make a difference in the lives of Nigerians.\nEditor’s note: This list will be updated as more cabinet members declare their political ambitions."
  },
  {
    "headline": "AT A GLANCE: Buhari's cabinet members seeking elective positions in 2023",
    "summarized_story": "Rotimi Amaechi, minister of transportation, was the first political appointee of President Muhammadu Buhari to formally declare his intention to run for president in 2023, and within weeks, other cabinet members announced their bids for the most important office in Nigeria.\nTheCable brings to you Buhari’s cabinet members seeking elective positions.\nPRESIDENTIAL HOPEFULSYEMI OSINBAJOAdvertisementVice-president Yemi Osinbajo announced his presidential ambition on April 11.\nThe minister said he wants to contest the party’s presidential ticket to make a difference in the lives of Nigerians.\nEditor’s note: This list will be updated as more cabinet members declare their political ambitions."
  },
  {
    "headline": "Why are ethnicity, zoning dominant issues of 2023 elections?",
    "summarized_story": "Why are concerns over ethnicity, region and religion the nominators of conversation on the 2023 elections?\nIn every election cycle, these misnomers have become the fundamental benchmark for selecting leaders by political parties and for electing the same by citizens?\nCharacter, antecedents, history of demonstrated patriotism and respect for diversity, proven leadership competence should be the leading issues as we head for the 2023 elections.\nSulaiman: On the issues guiding the elections, what do you have to say on what is playing out in the country?\nMaking the 2023 elections about an ethnic group or region is reinventing a bogey."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "A Kenyan Eden",
    "summarized_story": "Remember we had a Twitter Space titled Do startups need financial literacy?\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nEden Life’s expansion and acquisitionEden Life, a Lagos-based startup, has announced plans to expand into Nairobi, Kenya.\nBuilding on its success in Lagos, Nigeria, Eden says it intends to remove obstacles to discovering dependable household services in Nairobi.\nWhat I’m reading and watchingOpportunitiesThe FT x Cardano Blockchain Challenge is sourcing ventures building or interested in leveraging the Cardano blockchain platform and community."
  },
  {
    "headline": "“All startup founders must be financially literate.” – Olumide Adesina",
    "summarized_story": "Share this article:What do you think of when you hear financial literacy for startups?\nIf you’re like most people, you’re probably wondering why startups have to be financially literate, especially when much of the conversation around financial literacy has been about personal finance.\nAs surprising as it is, even businesses need financial literacy.\nHowever, he pointed out that knowing about financial issues does not equate to financial literacy.\nWith many startups opting for venture capital investments, Adesina observed that founders need to be careful while deciding what kind of investment they accept."
  },
  {
    "headline": "Another NFT hack?",
    "summarized_story": "Billed as the next generation of the web, Web3 focuses on decentralisation using decentralised blockchains.\nLet NFT artists and blockchain devs show you the ropes at the Techpoint Africa Blockchain Summit.\nAnother NFT phishing schemeOn Monday, April 25, 2022, the Instagram account of the popular NFT collection, Bored Ape Yacht Club (BAYC), was hacked.\nEssentially, the hacker duped victims into handing over control of their wallets by creating a fake advertisement for an upcoming NFT project.\nThe hacker tricked users into clicking a link to “mint” a bogus NFT by sending Ethereum (eth) and, in some cases, an NFT to wrap into a token."
  },
  {
    "headline": "Bekonta extends blockchain awareness and user education to Serving Corps Members.",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain awareness and user education is a background check that must be done to foster blockchain adoption.\nThe Festival of Culture with the Bekonta presence engaged Youth Corps Members in a unique way.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Get 30GB Free Data from Geneix and Free Ear Buds when you buy the Infinix Hot 12",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:The recently launched Hot12 from Infinix is nothing short of Hot, Bold, Trendy.\nYou can bet on a Fast and Fun Vibe with the Hot series, but not just that.\nYou can enjoy the best of your internet experiences with a whopping 30GB worth of free data and free quality ear buds for a blissful smartphone experience.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Grammar in dialogues",
    "summarized_story": "GAB: Oh, no!\nGirlfriend: Then write ‘Fine, babe’ (which means you are fine), not ‘Fine babe’ (which means you are talking about another fine woman).\nBoyfriend: Nawa o. Sha let’s eat madam.\nGirlfriend: Then, you should type ‘Let’s eat, madam.’ The presence of the vocative comma indicates that you want ‘madam’ to eat with you, whereas its absence means that you actually want to eat ‘madam’.\nWould you mind if I gift you with a copy of my grammar textbook, ‘Grammar in Discourse Form’?"
  },
  {
    "headline": "And Fidelis Anosike took home the ultimate prize",
    "summarized_story": "I met Rita Dominic before I met her.\nIn all of this, remember both of you that mature love is mature.\nRita, remember you are a role model to women over 30 who have hoped and waited.\nIn all of this, remember both of you that mature love is mature.\nFrom Rita’s beautiful wedding apparels to Fidelis”s one in a million dance steps."
  },
  {
    "headline": "How to manage petty leaders in your organisation – 4",
    "summarized_story": "These effects may trigger a vicious circle that sustains petty behaviour.\nPettiness affects all members of the organisation, all the way from the customers/clients, peers, subordinates, superiors, management board, and the general interpersonal climate of the workplaceSo, let us analyse the interactions of individual predispositions and situational facilitators that enhances petty behaviour by leaders in your organisation.\nThis acceptance may translate into a higher tolerance for pettiness or petty behaviour.\nRead also: How to manage petty leaders in your organisation – 3The acquisition and successful use of power may enhance self-perceptions, legitimise one’s position, and compensate for a perceived personal inability to influence others.\nSo, what are the effects of petty leadership on subordinates in any organisation?"
  },
  {
    "headline": "The first Emmanuel Adeyemo Elebute Memorial Lecture, and matters arising",
    "summarized_story": "It was the first memorial lecture held in honour of Professor Emmanuel Adeyemo Elebute, who died in 2019 at the age of 87 years.\nProfessor Elebute was a distinguished Professor of Surgery who scored many firsts in the Nigerian healthcare space.\nWith like-minded collaborators, Elebute set up the Society for Quality Health in Nigeria (SQHN), which was incorporated in 2006.\nHe spoke glowingly of his association with the late Professor Elebute.\nHe emphasised the crucial importance of Quality in Healthcare and commended the efforts of the Society for Quality Healthcare in Nigeria in carrying forward Elebute’s vision."
  },
  {
    "headline": "The game of chess in the APC",
    "summarized_story": "Mr Tinubu kept his own side of the bargain by sticking with Buhari through thick and thin.\nIn 2014, his support was critical to Mr Buhari picking the presidential ticket of the APC.\nMr Tinubu is not unaware of these realities.\nMany other contestants also close to President Buhari have since declared their intentions to contest for the party’s ticket.\nBut you cannot give us erratic electricity that is undependable and then blame us again that we are lazy,” Mr. Tinubu told his cheering supporters."
  },
  {
    "headline": "BIU LAWSA Laud Hon. Andrew Emwanta, Erstwhile President of LAWSA for Dedication and Pragmatic approach to duty – Nigerian Observer",
    "summarized_story": "“I was so committed that little did I know I will become President of LAWSA.\nWe felt Law students should be trained in a manner that they should be able to separate the law and religion.\n“Those were some of the things we did when we were there and eventually I ran for the office of LAWSA President and I won.\n“As a former LAWSA President, the moment you invite me for an event I am under obligation to attend and that obligation extends to my colleagues who are lawyers.\n“Then secondly, the law students must work towards achieving any set target."
  },
  {
    "headline": "Obaseki approves policy on aging to cater for elderly persons in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has approved the Edo State Policy on Aging to provide social care and protection for senior citizens in the state.\nThe Edo State Commissioner for Orientation and Communication, Andrew Emwanta, who disclosed this to journalists in Benin City, said the policy is part of efforts by the government to uphold the rights and dignity of senior citizens.\nHe said the Governor approved the new policy at the weekly Executive Council (EXCO) meeting, at the Government House, Benin City.\nHe said, “The Executive Council has approved the Edo State Policy on Aging which will provide social care and protection for senior citizens.\nThe Council resolved that the policy should move from being a policy on aging to a policy for senior citizens and the age of senior citizens was put at 65 years and above after careful deliberations."
  },
  {
    "headline": "Obaseki hands over defunct Edo College of Education, urges FG to name institution after Tayo Akpata – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Thursday, handed over the defunct Edo College of Education, Ekiadolor to the Federal Government, imploring the government to rename the citadel of learning after the executive secretary of the defunct Petroleum Trust Fund (PTF) and one-time Commissioner for Education in old Bendel State, Chief Tayo Akpata.\nObaseki handed over the institution to the Minister of Education, Mallam Adamu Adamu, reassuring that his administration will sustain investment in technical and vocational education in the state.\nThe governor said, “The only thing we ask for is that the school be named after one of our visionary commissioners for education, Tayo Akpata, who transformed our education landscape.\n“For us sir, we’re hoping that you will make this school a school of excellence to train teachers in technical subjects.\nSo, this federal college of education, technical, is going to help us in the revolution that we seek to achieve in our educational system in Edo."
  },
  {
    "headline": "Ex-gov’ship Candidate Appeals To EDSG To Tackle Insecurity – Nigerian Observer",
    "summarized_story": "Oboh said it is a known fact that the predominant occupation of the people in Esan land is farming, adding that due to the high level of insecurity in that region, they have ceased to go to their farms.\nShe decried that with the way things are and if not tackled, it may lead to a serious food crisis in that land.\nThe Esans are dying; the unknown herdsmen are killing our farmers.\nI am pleading to the conscience of our state governor, Godwin Obaseki, to use his executive powers to protect our farmers from being slaughtered.\nSecurity agents must be sent to the farm borders before more death and famine cripple our people for good, “she decried."
  },
  {
    "headline": "2023: Why I’m no longer interested in Nigeria’s politics – Elliot Uko",
    "summarized_story": "Evangelist Elliot Ugochukwu-Uko, founder of Igbo Youth Movement (IYM) and secretary of Eastern Consultative Assembly (ECA) has said he is not interested in Nigeria’s politics of 2023, because another election is not the solution to the country’s problems.\nI’m not interested in accommodation within the system nor access to power and patronage.\n“Forty-three years ago, in 1979, I witnessed the largest human crowd I’d ever seen as a teenager when the great Zik launched the NPP presidential campaign at Ngwo Park, Bede Wright, Uwani Enugu.\n“Six years earlier, Chief Ewelle of Easygoing Hotel Ipodo, Ikeja, took me to the HOPE 93 Campaign office of MKO Abiola to meet Dr Jonathan Zwingina at the Opebi by Allen office of the Abiola campaign office.\nI am greatly embarrassed by the greed for power, and self entered thoughtlessness of ex President Jonathan, who is willing to crush the South East dream after all we did for him."
  },
  {
    "headline": "2023: Bayelsa govt distances self as Diri’s aide opposes Jonathan’s alleged power bid",
    "summarized_story": "The government of Bayelsa State has distanced itself from the views shared by Daniel Alabrah, Governor Douye Diri’s Chief Press Secretary, in an article of former president, Goodluck Jonathan’s alleged presidential bid.\nAlabrah, had in the said article opposed the alleged presidential bid by Jonathan, noting that it would shortchange the entire southern Nigeria.\nJonathan who completed his first term as president of Nigeria in 2015, would only hold office for an additional one term if elected president.\nAlabrah said in the online article, “My personal view is that another Goodluck Jonathan presidency will shortchange the whole southern Nigeria.\nHis views are not, cannot, and should not be attributed to the Governor and the Government of Bayelsa State."
  },
  {
    "headline": "TotalEnergies to exit Nigeria’s onshore oilfields, blames disruptions",
    "summarized_story": "Oil major, TotalEnergies has announced plans to sell its minority stake in a Nigerian oil joint venture, joining other top firms divesting from onshore oilfields in the country.\nShell, the operator of the licences, is already considering bids from four local firms for its 30 per cent shareholding in the company.\nIn May 2021, Shell said it has started discussions with the federal government to sell its onshore oil assets in Nigeria.\nThe company would join the league of foreign oil companies exiting the Nigerian oil market after operating in the market for over 60 years.\nInternational oil companies (IOCs) intend to focus on deep-water fields due to the operational difficulties — including sabotage — experienced on onshore fields."
  },
  {
    "headline": "2023: Buhari vows to protect votes, warns global community against interference",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, has cautioned against foreign interference in the 2023 general elections in the country, just as he assured of his commitment to ensure that votes count.\n“As you’re all aware, the tenure of this Administration ends on 29th May, 2023.\nTypical of election years all over the world, the tempo of political activities is often high,” he said.\nI’m committed to bequeathing a stronger culture of credible elections to Nigeria than I met.\nOn COVID-19, Buhari restated Nigeria’s demand for vaccine equity and waiver of patents for manufacturing vaccines and approved drugs to treat the highly infectious disease."
  },
  {
    "headline": "PDP Guber Aspirant, Dagogo, Arrested At Screening Venue In Rivers",
    "summarized_story": "A member of the House of Representatives and Peoples Democratic Party (PDP) governorship aspirant in Rivers State, Hon.\nFarah Dagogo, has been arrested at the South-South zonal secretariat of the party in Port Harcourt.\nRecall that Dagogo, who represents Bonny/Degema federal constituency, was declared wanted by Governor Nyesom Ezenwo Wike on Wednesday evening for allegedly hiring suspected cultists to attack the state PDP secretariat in Port Harcourt.\nDagogo, however, denied the allegation moment later on Wednesday.\nADVERTISEMENTLEADERSHIP learnt that the federal lawmaker was arrested inside the main hall of the PDP zonal secretariat, venue of the party’s screening committee for the for governorship aspirants from four states in the zone."
  },
  {
    "headline": "Federal Govt Declares Monday, Tuesday Public Holiday To Mark Worker’s Day, Eid-el-Fitr",
    "summarized_story": "The federal government has declared Monday and Tuesday, May 2 and 3, 2022 as work-free day to mark this year’s Worker’s Day and Eid-el-Fitr celebrations.\nThis was announced by the minister of interior, Ogbeni Rauf Aregbesola, in a statement signed by the permanent secretary, Ministry of Interior, Dr. Shuaib Belgore.\nThe minister ongratulated workers across the country on this year’s celebration, while also commending them for their hard work, diligence and sacrifice to the nation’s growth and development.\nIn the same vein, the federal government through the minister also congratulated all Muslims for their successful completion of the holy month of Ramadan.\nAregbesola wished all Muslims a happy Eid-ul-Fitr celebration and prayed that the peace, blessings and favours of Allah be with all."
  },
  {
    "headline": "2 Chibok Girls Who Escaped From Boko Haram Bag Master’s Degree",
    "summarized_story": "Two Chibok schoolgirls, who escaped from Boko Haram terrorists after their abduction alongside over 200 other schoolgirls in Chibok, Borno State on April 14, 2014, have bagged Master’s degree.\nJoy Bishara and Lydia Pogu will receive master’s degree from Florida’s Southeastern University on Friday.\nIt could be recalled that on April 14, 2014, 276 pupils of Government Girls Secondary School, Chibok, Borno State, were kidnapped by the Boko Haram insurgents.\nBishara and Pogu received bachelor’s degree in the fall of 2021.\nA release from the institution said Pogu will receive a master’s in Human Services during Friday’s graduation ceremony, and Bishara will receive a master’s degree in Social Work, reports The Ledger based in Lakeland Florida."
  },
  {
    "headline": "2 Chibok Girls Who Escaped From Boko Haram Bag Master’s Degree",
    "summarized_story": "Two Chibok schoolgirls, who escaped from Boko Haram terrorists after their abduction alongside over 200 other schoolgirls in Chibok, Borno State on April 14, 2014, have bagged Master’s degree.\nJoy Bishara and Lydia Pogu will receive master’s degree from Florida’s Southeastern University on Friday.\nIt could be recalled that on April 14, 2014, 276 pupils of Government Girls Secondary School, Chibok, Borno State, were kidnapped by the Boko Haram insurgents.\nBishara and Pogu received bachelor’s degree in the fall of 2021.\nA release from the institution said Pogu will receive a master’s in Human Services during Friday’s graduation ceremony, and Bishara will receive a master’s degree in Social Work, reports The Ledger based in Lakeland Florida."
  },
  {
    "headline": "Chaos As Gunmen Attack ‘Empty Bullion Van’ In Imo",
    "summarized_story": "A bullion van belonging to a yet-to-be identified bank was on Thursday afternoon attacked by gunmen along the Ogbor-Nguru – Nwankwo in the Aboh Mbaise local government area of Imo State.\nADVERTISEMENT“In a bid to rob the van, the robbers ambushed the driver, such that the vehicle somersaulted and crashed into other parked vehicles.\nIt was learnt that the bullion van had already been emptied and was heading back when it was attacked.\nOne Mr Uche said the gunmen gave the driver a hot chase before he caved in.\nAbattam said: “Sketchy information revealed that the bullion van was returning after delivering money and was attacked by hoodlums."
  },
  {
    "headline": "2023 Presidency: Atiku, Saraki, Others Undergo Screening In Abuja",
    "summarized_story": "Candidates for the Peoples Democratic Party’s presidential ticket are being examined at Legacy House in Abuja, which serves as the party’s alternate National Secretariat.\nFormer Vice President Atiku Abubakar, former Senate Presidents Bukola Saraki and Pius Anyim have all shown up for the screening, which started about 11:00 a.m.All three candidates had been screened at the time of filing this report, but they did not reveal the results since it would jeopardize their candidacy.\nDetails later…"
  },
  {
    "headline": "2023 Presidency: Tinubu Eminently Qualified To Rule Nigeria ― Amaechi",
    "summarized_story": "Tinubu, a former governor of Lagos State, and Amaechi are APC presidential candidates.\nSanwo-Olu, in his address, expressed best wishes in Amaechi’s presidential ambition as well, saying, though, he is also eminently qualified for the top job.\n“I want to say to you that you’re eminently qualified and I want to wish you well in this journey.\nHis words: “It is a difficult thing to even come here because we already know that our leader comes from Lagos state.\n“We know that our leader is eminently qualified to rule this country."
  },
  {
    "headline": "JUST IN: NLC to embark on three-day warning strike",
    "summarized_story": "JUST IN: NLC to embark on three-day warning strikeThe Nigeria Labour Congress (NLC) has threatened to embark on a three-day nationwide warning strike, in solidarity with affiliate unions in the universities and Nigerian students.\nAccording to the CWC, the NLC has threatened to hold protests against the lingering ASUU strike within the subsisting 21days ultimatum.\n“This is also occasioned by government’s failure to honour agreements reached with trade unions in our universities.\nIt also said affiliates of the NLC were to issue public statements condemning the intermittent strikes in Nigeria’s universities.\nThe CWC also reiterated the readiness of Nigerian workers to use their Permanent Voter Cards to vote only for candidates and political parties that subscribe to the Nigerian Workers Charter of Demands."
  },
  {
    "headline": "2 Dead In Multiple Crash Involving A Gas Tanker, Truck And Cars In Lagos",
    "summarized_story": "A multiple crash involving 4 vehicles occurred at Odo Itlya Alaro located on the bridge linking Maryland and Ojota, Ikorodu roa Road, Lagos caused 2 fatalities.\nThe incident occurred at about 0215hours this morning.\nA gasoline tanker, a Toyota Camry car whose only occupant escaped unhurt and a tipper/lorry load with sharp sand.\nHit the Toyota Camry from the rear and the sand spilled on the Camry.\nThe sight is gory.🤮🤮#doggy #Lekki Sodom and gomorah — °Roland_Ted° 🟡 (@RolandTedroxx) April 29, 2022Traffic on Ikorodu road coming from Ojota as early as 6 am."
  },
  {
    "headline": "Pictures: Dare hosts APC leaders to Iftar, peeaches peace",
    "summarized_story": "Pictures: Dare hosts APC leaders to Iftar, peeaches peaceThe Minister of Youth and Sports Development, Sunday Dare, recently hosted the Muslim community and leaders of the All Progressive Congress (APC), Oyo state chapter to a break of Ramadan fast at his Ibadan home.\nDare who strongly believes in religious tolerance, identified with Muslim faithful as they carry out their Islamic obligations in the holy month of Ramadan.\nHe also urged the APC Leaders in the state to use the Ramadan period to resolve the crisis rocking the party in the state, and pray fervently for the state and nation at large.\nLet me use this opportunity to appeal to members of our party in Oyo state to come together and let’s reconcile our differences in the spirit of Ramadan.\nApart from various federal projects that Dare facilitated in Oyo state, it could be recalled that the youth in Oyo state have benefited in Work Experience Programmes (WEP), digital trainings, and stipends given to the less privileged in the state."
  },
  {
    "headline": "Atiku to PDP NWC on 2023 presidency: With my 11m votes, I deserve right of first refusal",
    "summarized_story": "He also told the party’s National Working Committee (NWC) that he deserved the right of first refusal, given his experience and competence.\nAnd in his response, the PDP national chairman, Dr Iyorchia Ayu, told the governor to settle for either of the two options, saying he cannot have the two all to himself alone.\nAyuIn his reaction, the PDP national chairman, Senator Ayu, said he won’t work for Atiku alone, but all the 17 aspirants.\nOrtom committeeConsequently, the PDP National Executive Committee (NEC) swiftly inaugurated a 37- man zoning committee led by Benue state Governor Samuel Ortom on the 24th of March, 2022.\n“On our part, we will ensure the party’s national convention and even congress at all levels to elect party’s candidate for all position is free, fair and credible.”Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: High profile football agent is dead",
    "summarized_story": "High-profile football agent Mino Raiola has died at the age of 54 following a battle with lung disease.\nRaiola represented the likes of Paul Pogba, Erling Haaland and Zlatan Ibrahimovic.\nBack in January, Raiola underwent checks in Italy after reports said he was rushed to hospital for surgery.\nGerman newspaper BILD said he was intensive care due to a lung disease, although his spokesperson downplayed the visit, saying: ‘Mino Raiola is undergoing the usual medical examinations that require anesthesia.\nA promising footballer growing up, Raiola took over the reins as the head of HFC Haarlem’s youth team aged just 20 in 1987 before beginning his career as a football agent."
  },
  {
    "headline": "Seplat Energy’s revenue grows by 58.6% to N100.6bn",
    "summarized_story": "The company also generated cash from its operations to the tune of N74.4bn from N1.7bn year-on-year, rising by 197.8 per cent.\nThe energy Company’s also grew its revenue by 58.6 per cent to N100.6bn from N57.9bn year-on-year; as its gross profit soars to N48.8bn from N20.1bn year-on-year, rising by 122.3 per cent.\nIn its operations, Seplat Energy demonstrated a strong safety record, which extended to 26.1 million hours without LTI from operated assets (2.0 million hours in Q1 2022).\nIt will also bring a significant undeveloped gas resource base which, alongside our ANOH gas project development, will underpin Nigeria’s energy transition and drive domestic and export revenues when developed.\n“We have proven we have the financial strength and credibility to attract international finance into Nigeria’s energy sector and this will help us in our aim to deliver energy transition and provide cleaner, more reliable and more affordable energy for Nigeria’s young and growing population.”"
  },
  {
    "headline": "Women in Oil, Gas to benefit from $40m NCDMB/NEXIM Bank Fund- Wabote",
    "summarized_story": "By Palma IleyeExecutive Secretary of the Nigerian Content Development and Monitoring Board, NCDMB, Engr.\nSimbi Kesiye Wabote has said on Wednesday that women entrepreneurs in the Nigerian oil and gas industry should break barriers by taking advantage of the $40m fund created specifically for them under the Nigerian Content Intervention Fund, NCI Fund.\n“To provide a fair chance for women in the oil and gas industry, the Board partnered with the NEXIM Bank to establish a $20 million fund that was matched with an additional $20 million fund by NEXIM bank, making the total pool of funds available to women in oil and gas to be $40 million,” he said.\nHe explained that the Board and its partners have introduced and implemented several initiatives that promote diversity in the oil and gas industry.\nHe added that “the Board has also organized events that were targeted at women and community activities to promote inclusiveness."
  },
  {
    "headline": "N69.4bn Debt: Court orders stay of contempt proceedings initiated by Jimoh Ibrahim against AMCON",
    "summarized_story": "CA/ABJ/CV/269/2022 in the case between the Asset Management Corporation of Nigeria (AMCON) vs Barrister Jimoh Ibrahim has ruled that all proceedings including the contempt proceedings initiated by Barrister Jimoh Ibrahim and co at the trial court should be stayed pending the hearing, and determination of the substantive appeal.\nWith that ruling, Barrister Jimoh Ibrahim and Co have been again neutralized from executing the said contempt proceedings order, which he obtained under questionable circumstances.\nAMCON over the years had tried all reasonable and peaceful resolution strategies to recover the debt from Jimoh Ibrahim to no avail.\nFHC/ABJ/CS/760/2021 to seek justice, and accordingly received an order of the trial court to take over the businesses of Jimoh Ibrahim.\nAMCON further received the backing of the trial court to appoint a Receiver/Manager to oversee the businesses on behalf of AMCON."
  },
  {
    "headline": "MTNN, Pan-Atlantic University launch media innovation programme",
    "summarized_story": "By Kehinde Ibrahim, LagosMTN Nigeria and Pan-Atlantic University (PAU), yesterday, announced the launch of the MTN Media Innovation Programme (MTN MIP), which will be run by PAU’s School of Media and Communication (SMC).\nThe six-month, fully funded fellowship for Nigerian media practitioners is designed to support the sustainable development of the nation’s changing media scene.\nIt is open to media practitioners across the spectrum, including print, electronic, online platforms and social media content creators.\nThus, it is only fitting that we support developments in the Nigerian media space with our infrastructure and enable capacity building initiatives to enable innovation in media practice.\nThe MTN Media Innovation Programme could not have come at a better time for Nigerian media practitioners to imbibe these pertinent values,” Professor Enase Okonedo, Vice Chancellor, Pan-Atlantic University, added."
  },
  {
    "headline": "NCC moves to strengthen colocation, infrastructure sharing market segment",
    "summarized_story": "By Asuelimen OsasuyiNigerian Communications Commission, NCC, has commenced the process of conducting a study to assess the current level of competition in the colocation and infrastructure sharing, CIS, segment of the Nigerian telecommunications sector.\nAccording to NCC, seventy-eight licensees are currently operating in that market segment.\nThe NCC takes this issue as priority in view of the critical role played by the colocation and infrastructure sharing segment of the telecom ecosystem in ensuring robust services.\nFor instance, at the time the 2013 study was conducted, the CIS market segment was still at embryonic stage and as such, much emphasis was not placed on it.\nThe Director PCEA also informed that activities in the CIS market have also attained the targets set out in the Nigerian National Broadband Plan (2020-2025)”."
  },
  {
    "headline": "Electoral Act: Your Election Can Be Annulled, Gbajabiamila Tells Appointees Yet To Resign",
    "summarized_story": "﻿The Speaker of the House of Representatives Femi Gbajabiamila has advised political appointees seeking elective positions to resign, saying their elections might be annulled if they refused to do so.\nAccording to him, Section 84(12) of the Electoral Act 2022, which stipulates that political appointees should resign before seeking political offices in the next election, should be obeyed.\nAnd that particular provision had a reason behind it,” the lawmaker said.\n“But then, there is also a court decision that said that nullification by the court should not be executed as of yet.\nThen, there has also been an appeal by the National Assembly to set it aside."
  },
  {
    "headline": "2023: N100m Nomination Form Fee With Minimum Wage At N30k Is ‘Immoral’ – Falana",
    "summarized_story": "﻿ ﻿Human rights lawyer Femi Falana has faulted the N100m presidential nomination form fee set by the ruling All Progressives Congress (APC), describing it as “immoral” since the country’s minimum is N30,000.\nFalana made the comment on Thursday, days after the APC fixed the prices for nomination forms for those vying for seats in the 2023 elections.\nThe Peoples Democratic Party (PDP) also pegged its presidential form fee at N40m.\n“Those outrageous nomination fees are immoral, insensitive, and illegal,” he said during an interview on Channels Television’s Politics Today.\nThat is against the spirit and the letters of the constitution.”‘Not For The Rich’Falana’s comment comes on the heels of debates about the prices for nomination forms by the APC."
  },
  {
    "headline": "Bitcoin Not A Panacea For Africa’s Economic Woes – IMF",
    "summarized_story": "Bitcoin is not a cure-all for Africa’s economic woes, the International Monetary Fund warned Thursday, after the Central African Republic adopted the cryptocurrency as legal tender.\n“It is really important to not see such things as a panacea” for the challenges that countries face, he said.\nThe Central African Republic has become the second country in the world to adopt bitcoin as official currency after El Salvador, which did so last year.\nIt is among six central African countries that share the CFA franc — a regional currency that is backed by France and pegged to the euro.\nOther countries have already initiated legislative processes to adopt bitcoin, according to the specialised site Coinmarketcap.com."
  },
  {
    "headline": "Ochanya: Court Acquits Lecturer Accused Of Rape, Another Jails Wife For Negligence",
    "summarized_story": "Ochanya was admitted to the Federal Medical Centre in Makurdi for two months before she died on October 17, 2018.\nOn October 10, 2019, the Benue State government arraigned 54-year-old Ogbuja before the Makurdi High Court on four counts of rape and Ochanya’s death.\nThe anti-trafficking agency accused Mrs Ogbuja of failing in her duty to protect the deceased from being raped by her husband and son.\nAgreeing with the prosecution, she said “the evidence that Ochanya told the defendant (Mrs Ogbuja) about what was going on, and was not successfully challenged,” proved NAPTIP’s case.\nBut Justice Olajunwo sentenced Mrs Ogbuja to five months imprisonment without an option of a fine, after listening to her lawyer’s plea for clemency."
  },
  {
    "headline": "Man Utd Manager Ralf Rangnick Named Austria Coach",
    "summarized_story": "Manchester United manager Ralf Rangnick has been appointed coach of Austria’s national team, the federation said Friday, but he will continue in a consultancy role at the club.\nRangnick joined United as interim manager in November last year and will move into an advisory position after Ajax coach Erik ten Hag comes in as the new permanent manager.\nThe 63-year-old German “will combine the job with his consultancy role at Old Trafford as planned,” United said in a statement.\nThe Austrian federation said Rangnick had been given a two-year deal that will be extended to four years if he secures qualification for the 2024 European championship.\n“We are very pleased that in Ralf Rangnick we have been able to attract an outstanding expert in international football,” Austrian federation president Gerhard Milletich said."
  },
  {
    "headline": "AGF Abubakar Malami declares intention to contest as Governor of Kebbi State -",
    "summarized_story": "The Minister of Justice and Attorney-General of the Federation (AGF) Abubakar Malami says he has accepted calls from the people of Kebbi State to run for the office of the governor.\nThe Minister said “Since you want me to contest governorship position of the state, I hereby accept your demand since you want me to do so.\n“People from the state have been pressurising me to contest the governorship position in 2023.\nHis declaration to run for the Governorship position in the State now has put paid to all insinuations and rumours of his ambition for 2023.\nHe is seeking to succeed current governor, Abubakar Atiku Bagudu, who is in his second term as governor."
  },
  {
    "headline": "Osinbajo visits Delta, seeks support for presidential ambition",
    "summarized_story": "Vice President and APC Presidential Aspirant Yemi Osinbajo in continuation of his nationwide consultation is in Delta to seek support of party delegates ahead of the presidential primaries of the ruling All Progressives CongressOn Arrival to the state Mr. Vice President first visited the Obi of Asaba, Chike Edozien at his palace to receive royal blessing for nonagenarian king who has few words for him especially about challenges confronting the nationThe Vice President later had a closed door meeting with delegates of the All Progressives Congress as he expresses hope towards clinching the ticket of the party"
  },
  {
    "headline": "We'll support whoever emerges PDP presidential candidate- Makinde -",
    "summarized_story": "Oyo State Governor, Seyi Makinde, has declared that leaders and members of the Peoples Democratic Party will rally behind anyone whoever emerges the party’s presidential candidate after its presidential primaries.\nAccording to him, all stakeholders in the party will support whoever God gives to the party and also work together to rescue Nigeria.\nThe governor stated this at the Presidential Lodge of the Oyo State Government House, Agodi, Ibadan, when Akwa Ibom State governor and presidential aspirant on the platform of the PDP, Udom Emmanuel, met with party delegates from the South-West geopolitical zone.\nSpeaking at the Government House shortly after receiving the Akwa Ibom State governor, Makinde commended PDP leaders and delegates for strengthening democracy within the party and the country.\n“This is PDP and after we have chosen the flagbearer, we are also still going to work together to rescue Nigeria."
  },
  {
    "headline": "Stolen money at APC secretariat not for party",
    "summarized_story": "The All Progressives Congress, APC, has cleared the air on the reported missing/stolen $50,000, saying it does not belong to the party nor the secretariat.\n“On Wednesday, April 27, 2022, a sum of $50,000 was reported lost by an individual around the entrance gate of the National Secretariat of the Party.\n“To be clear, the lost money does not belong to the Party.\n“As widely advertised and reported in major news outlets, all purchase of forms are payable to designated bank accounts of the Party.\n“We urge our party members and the general public to disregard any reports or suggestion to the contrary as false and grossly misleading,” the statement said."
  },
  {
    "headline": "Scandal-Hit Boris Johnson Faces Major Test in Local UK Elections",
    "summarized_story": "John Jones is the sort of voter that British Prime Minister Boris Johnson cannot afford to lose – but already has.\nThe 75-year-old retired hospital supplies manager said he won’t vote Conservative again until Johnson has gone.\n“I used to vote Conservative, I don’t even vote at all now because I can’t trust anyone,” she said.\nThe prime minister and his supporters will hope such discontent is not widespread, and he remains popular with some.\nA poor performance in local elections can presage the ousting of an unpopular prime minister."
  },
  {
    "headline": "Ukraine Says Russia Taking ‘Colossal Losses’ in Eastern Battle",
    "summarized_story": "Having failed in an assault on Kyiv in the north of Ukraine last month, Russia is now trying to fully capture two eastern provinces known as the Donbas.\n“We have serious losses but the Russians’ losses are much much bigger…They have colossal losses,” presidential adviser Oleksiy Arestovych said.\nThe Ukrainian general staff said Russia was shelling positions along the line of contact to prevent the Ukrainians from regrouping.\nUkraine says 100,000 civilians are still in the city, which is mostly occupied by Russia.\nThe capital of Ukraine is the goal and they want to occupy it,” Mayor Vitali Klitschko said, supervising the cleanup."
  },
  {
    "headline": "Musk Sells $4bn in Tesla Shares, Presumably for Twitter Deal",
    "summarized_story": "Elon Musk has sold 4.4 million shares of Tesla stock worth roughly $4 billion, most likely to help fund his purchase of Twitter.\nThe world’s richest man, who is the CEO of Tesla, tweeted that he doesn’t plan any further sales of the company’s shares.\nMost of the sales took place on Tuesday, when Tesla shares closed down 12%, a huge single-day drop.\nAnalysts said Tesla investors fear Musk will be distracted by Twitter and less engaged in running the electric car company.\nTesla shares closed Thursday down slightly at $877.51."
  },
  {
    "headline": "Fuel Subsidy Causing Deterioration in Nigeria’s Fiscal Balance,IMF Says",
    "summarized_story": "“Therefore, removing generalised subsidies is crucial to ensure that the rise in commodity prices generates fiscal savings.\nIt added: “Nigeria’s growth outlook has improved through higher oil prices and a stronger-than-anticipated recovery of manufacturing and agriculture.\n“The outlook is subject to high uncertainty associated with oil prices and financial conditions.\nMoreover, low vaccination rates, rising security risks, and elevated price pressures weigh negatively on the medium-term growth outlook.\nHe said: “Higher oil prices may generate a windfall gain for the region’s 8 oil exporters."
  },
  {
    "headline": "Kaduna Train Attack: Terrorists Release Picture of Baby Delivered in Captivity",
    "summarized_story": "The picture of a new-born baby girl delivered in a terrorists’ den by a woman abducted during the March 28 attack on an Abuja-Kaduna-bound train has been released by the abductors.\nThe terrorist group suspected to be Ansaru, a breakaway group from Boko Haram, released the picture on Wednesday night.\nARISE News had reported the birth of the baby by the abductee in the terrorists’ den.\nA family member of the woman had first hinted that she had been delivered of her baby, although the identity of the new-born child was not disclosed until the terrorists released her picture.\nNine persons, including a young medical doctor, were killed during the attack, with scores injured and over 60 passengers kidnapped."
  }
]