[
  {
    "headline": "Workers kick as FCTA bars unvaccinated staff from offices",
    "summarized_story": "The Federal Capital Territory Administration on Monday barred workers and visitors without proof of vaccination or negative PCR test done within 72 hours from assessing its offices.\nThis, however, led to outrage as some workers accused the FCTA of not respecting their rights.\nThe administration had penultimate week notified workers and visitors that unvaccinated persons and those without negative PCR test would be barred from entering its offices.\nOur correspondent observed that workers without vaccination cards returned home, while others were seen loitering around.\nShe said, “I do not want to misplace my vaccination card."
  },
  {
    "headline": "N’Assembly may override Buhari’s assent, says Senate chairman",
    "summarized_story": "Members of the National Assembly are considering overriding the President, Major General Muhammadu Buhari (retd.\nChairman of the Senate Committee on Independent National Electoral Commission, Senator Kabiru Gaya, made this known on Monday.\nBoth the Senate and the House of Representatives had suspended action on the bill till resumption on January 18, 2022.\nThe Senate President would now be required to refer the letter from Mr President to the committee.\nAsked if overriding Buhari’s veto was under consideration, Gaya said, “It is under consideration."
  },
  {
    "headline": "Prison attackers mustn’t live to tell story, Aregbesola tells NCoS officials",
    "summarized_story": "The Minister of Interior, Rauf Aregbesola, on Monday ordered prisons officers to shoot dead anybody who attempts to attack any correctional centre in the country.\nThe minister gave this order while inspecting the Agodi Custodial Centre, Ibadan, Oyo State capital.\nHe commended the officers and men of the custodial centre for what he described as high level hygiene and cleanliness of the place but stressed that attackers must not be allowed to live to tell the story.\nHe said, “The most important thing is the security impregnability of this facility.\nThis is a red zone, dangerous zone."
  },
  {
    "headline": "Electoral Bill: PDP governors urge NASS to override Buhari’s veto",
    "summarized_story": "Ifeanyi Ugwuanyi of Enugu; Bala Mohamed of Bauchi and the Deputy Governor of Zamfara State, Mahdi Aliyu Muhammed at the PDP Governors’ Forum meeting in Port Harcourt, Rivers State on Monday.\nThe Peoples Democratic Party (PDP) Governors’ Forum has urged the National Assembly to immediately conclude issues surrounding the Electoral Act Amendment Bill by overriding President Muhammadu Buhari’s veto.\nThe communique reads: “The PDP Governors’ Forum congratulated the entire PDP family for conducting a smooth and successful National Convention that led to the emergence of the highly-acclaimed Senator Iyiochia Ayu-led National Executive Committee.\n“The PDP Governors requested the National Assembly to quickly conclude deliberation on the Electoral Act Amendment either by overriding the President’s veto or delete the areas of complain.\n“In 2015 under the PDP, the exchange rate was N198 to a dollar, it is now over N500 per dollar under the APC."
  },
  {
    "headline": "[UPDATED] Threat to life: Ughegbe is cheap blackmailer, the police invited us too ― Premiere Academy Management",
    "summarized_story": "Reacting to a statement issued by the said activist, purporting “a threat to life”, the management wondered how a police invitation for him to shed light on his many shocking claims on Keren’s death amounts to “a threat to life”.\nWe did not raise alarm and allege threat to life.\n““The management dismissed Ughegbe and his sponsors as rabble-rousers, who rather than cooperate with the police as Premiere Academy management has painstakingly done, seek only to befuddle the public with lies and innuendo.\n“We have since come to the painful conclusion that these people are not interested in unraveling the truth about Keren’s last days.\nWe are concerned that someone, somewhere may be trying to hide something about the final days of Keren’s life which were spent in the custody of her mother and not in Premiere Academy."
  },
  {
    "headline": "CSOs urge NASS to prioritise electoral bill upon resumption",
    "summarized_story": "file photo: Buhari meeting with National Assembly leadership in the State House, Abuja.\nA Coalition of Civil Society Organisations (CSOs), has urged the National Assembly to prioritise conclusion of the Electoral Bill during its first sitting when it resumes from recess on Tuesday.\nThe CSOs made the call on Monday in Abuja at a news conference tagged: “Civil Society Statement on the need for the National Assembly to Act with Dispatch on the Electoral Bill on Resumption from Recess’’.\nALSO READ: NASS staff slips from stairs, diesArogundade said that the objective of the forum was on the need for the National Assembly to prioritise the review of the Bill with dispatch.\n“The leadership of the National Assembly should therefore, conclude this process as any further delay will undermine public confidence in the reform process.”[NAN]Vanguard News Nigeria"
  },
  {
    "headline": "Shonekan had great vision, Nigeria would ‘ve benefitted more if he stayed longer in office — Jonathan",
    "summarized_story": "Former President Goodluck Ebele Jonathan has described former Head of the Interim National Government, Chief Ernest Shonekan as a man of great vision, stressing that Nigeria would have benefitted more if the late Head of State had been allowed to stay longer in office.\nDr Jonathan stated this while paying a condolence visit to the family of the late Head of State in Lagos on Monday.\nThe former President described Shonekan as a leader with an enviable background in the corporate world and considerable knowledge of economic issues.\nHe said further: “Chief Ernest Shonekan was somebody I worked with closely as one of the members of the Council of State.\n“When he took office as Head of Interim Government, the first thing he did was to release political prisoners."
  },
  {
    "headline": "PenCom reviews Pension Reform Act 2014",
    "summarized_story": "The National Pension Commission (PenCom) has reviewed the Pension Reform Act 2014 (PRA 2014) as a prelude to advancing legislative action on the Bill.\nThis is contained in a statement by Peter Aghahowa, Head, Corporate Communications of PenCom, on Monday in Abuja.\nHe said that PenCom organised the retreat on the review of PRA 2014 in Abuja between Jan. 12 and 14.\nAghahowa said that the retreat was aimed at identifying salient issues to be reviewed in the PRA 2014 as a prelude to advancing legislative action on the Bill.\nAghahowa said that the PRA 2014 was enacted following a review of the initial PRA of 2004, which introduced legal and institutional frameworks of the Contributory Pension Scheme (CPS) and established PenCom to regulate and supervise all pension matters in Nigeria."
  },
  {
    "headline": "Biafra: Sowore fumes as FG files terrorism charges against Nnamdi Kanu",
    "summarized_story": "Publisher of SaharaReporters, Omoyele Sowore, has lambasted the Federal Government for filling fresh terrorism charge against the detained leader of the proscribed Indigenous People of Biafra, Mazi Nnamdi Kanu.\nReacting, the Nigerian human rights activist, slammed the government saying the President Muhammadu Buhari’s government is the one practicing terrorism by allegedly kidnapping Kanu from Kenya.\nIn a post on his verified Facebook page, Sowore demanded Kanu’s freedom with the hash tag, RevolutionNow.\nA government of terrorists filing frivolous terrorism charges when they are the ones that carried out a terrorist act by kidnapping Kanu from Kenya and extraordinarily “renditioning” to Nigeria!\nDAILY POST reports that the amendment is coming few hours to the resumption of Nnamdi Kanu’s trial as he is expected to appear in court on Tuesday."
  },
  {
    "headline": "2023: Why Nigerian women must unite – Aisha Buhari",
    "summarized_story": "Aisha Buhari has charged Nigeria women to unite ahead of the 2023 general elections.\nShe also wants the All Progressive Congress (APC) to adopt new strategies to ensure more women participate in decision-making.\nThe VP is in Nigeria for the maiden edition of APC National Progressive Women Conference.\n“Women need to be encouraged to participate more in politics and the country needs our participation.\n“It is necessary to look forward to how best we can work together to unite women in the forthcoming campaigns ahead of 2023 elections.”She said Howard-Taylor’s presence and words would boost the morale of women participating at the conference."
  },
  {
    "headline": "Biafra: Nnamdi Kanu’s lawyer reacts as FG files new terrorism charges against IPOB leader",
    "summarized_story": "Aloy Ejimakor, Special Counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has reacted to the fresh charge against the Biafra agitator.\nEjimakor said the fresh charge against Kanu was an exercise in futility.\nSpeaking with DAILY POST, the counsel described the charge filed at the eve of Kanu’s resumed trial as a “dilatory tactics.”The Federal Government had filed a fresh terrorism charge against Kanu, ahead of his resumed trial on Tuesday.\nThe IPOB leader was facing a seven-count treasonable felony charge before Justice Binta Nyako-led Federal High Court.\n“Better yet, it is an exercise in futility, because it cannot overcome the vested jurisdictional defects springing from the extraordinary rendition of Nnamdi Kanu."
  },
  {
    "headline": "Monarchs move against bandits, herders’ attacks in Ondo",
    "summarized_story": "Monarchs in Akoko axis of Ondo State, have disclosed their resolve to bring to an end the current spate of insecurity in the state.\nAccording to the traditional rulers, the recent surge of attacks on communities by suspected Fulani herders as well as the activities of highway robbers in the State will soon be a thing of the past.\nThe monarchs who converged on Oka-Akoko, headquarters of Akoko South West Local Government Area stated that the security situation in the area had been stifling developments in the four local governments within the axis.\nOver the weekend, some women within the axis had stripped half-naked over the criminal activities in Akoko land.\nOba Adeleye disclosed that the security situation had affected business activities in Akoko land as investors were not interested to invest in the communities due to the security situations."
  },
  {
    "headline": "Biafra: Nigerian govt files new terrorism charges against Nnamdi Kanu",
    "summarized_story": "The Federal Government of Nigeria, on Monday, filed new terrorism charges against the leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu.\nIn the amended process it filed before the Federal High Court in Abuja, the federal government increased the counts in the initial charge it preferred against Kanu.\nThe IPOB leader, who has been in detention since his alleged abduction from Kenya and repatriation to Nigeria, faced a seven-count treasonable felony charge.\nHe will now enter his fresh plea to a 15-count amended charge marked FHC/ABJ/CR/383/2015, and signed by the Director of Public Prosecution, DPP, M. B. Abubakar.\nThe charge was amended barely 24 hours before the scheduled commencement of hearing by trial Justice Binta Nyako."
  },
  {
    "headline": "Prayers held for Bello’s presidential ambition, aide’s abducted mother",
    "summarized_story": "The Global Alliance of Progressive Professionals (GAP3) has launched an aggressive spiritual intervention to realise the presidential ambition of Kogi State Governor Yahaya Bello.\nThe National Coordinator, Dr Fahad Chikaji Ahmed-led crusaders for Bello’s presidency made this known in a statement in Kaduna where the event was held.\nReligious faithful, members and leaders of the group attended interdenominational service, including executives of the group from the 36 states and Abuja.\nAhmed noted that Bello’s administration pioneered excellent service delivery to the people by performing beyond his campaign promises.\nThe feat, he maintained, should be replicated at the national level, adding that Bello’s team is a winning team and no responsible human society throws away its winning team."
  },
  {
    "headline": "IPOB: FG amends charge against Kanu from 7 to 15",
    "summarized_story": "The Federal Government has amended the charge against the Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu, raising the counts from seven to 15 ahead of the resumed hearing on Tuesday.\nBut on Monday, Kanu’s legal team said it was served with an amended 15-count charge filed on January 17, adding 10 counts to the counts in the old charge.\nA lawyer in Kanu’s team, Maxwell Opara described the amendment as a ploy by the prosecution to clog progress in the case.\nOpara told The Nation that he was served with the amended charge while the legal team was preparing to visit Kanu in the custody of the State Security Service (SSS) on Monday.\n- Advertisement -“My annoyance is not about 15 worthless and empty amended charges, but it is just a calculated attempt to delay the trial and have an excuse to further incarcerate MNK (Maxi Nnamdi Kanu) in solitary confinement."
  },
  {
    "headline": "Buhari to unveil CBN, RIFAN mega rice pyramids in Abuja Tuesday",
    "summarized_story": "President Muhammadu Buhari will tomorrow unveil one million bags of rice paddy stacked as pyramids in Abuja.\nThe rice pyramids were built with 1 million bags of rice paddy planted and harvested from states across the country under the Anchor Borrowers’ Programme (ABP).\nThe bags of rice paddy that formed the pyramids were recovered from farmers in lieu of cash to pay back for the loans they collected under the ABP.\n- Advertisement -“Aggregated paddy for the pyramids across the country is a fraction of the recovered paddies.\nFrom an average yield of 1.8 metric tonnes per hectare in the pre-ABP era, the initiative has increased the average yield for rice paddy and maize to about 4 to 5 metric tonnes per hectare."
  },
  {
    "headline": "JUST IN: NASS staff slumps, dies on staircase",
    "summarized_story": "A staff of the National Assembly on Monday collapsed and died while ascending the second floor of the White House through the staircase.\nCleaners, who sighted him when he fell, were said to have alerted staff who immediately came to his aid.\nHis colleagues were said to have rushed him to the National Assembly Clinic for medical attention but he died on the way there.\nThe worker (not staff) was said to have been taken to the National Hospital where he is receiving medical attention.\nDirector of Information, National Assembly, Dr Emmanuel Agada, said he could not confirm the death incident since he has not received any information on it."
  },
  {
    "headline": "PGF DG resigns over APC national convention controversy",
    "summarized_story": "The Director-General of the Progressive Governors Forum (PGF) Salihu Lukman has resigned his appointment over the crisis on the National Convention of the ruling All Progressives Congress (APC) scheduled for February.\nLukman, who had insisted on the conduct of the convention in February as agreed by the Forum at its November meeting, has persistently blamed the continued delay of the convention on the Chairman and Secretary of the party’s Caretaker/Extra-ordinary Convention Planning Committee (CECPC).\nHis position and persistence drew the ire of some Governors, who were said to have decided to penalise Lukman at their meeting on Sunday.\nSome of the Governors were said to have suggested that he should be asked to resign instead of penalised.\nIt was later gathered that the embattled PGF boss threw in his resignation letter on Tuesday morning."
  },
  {
    "headline": "BREAKING: FIBA throws out Nigeria from BAL Final Round",
    "summarized_story": "By Joe ApuNigeria has been delisted from the Final Round of this year’s Basketball African League, BAL by FIBA Africa with immediate effect.\nThe basketball ruling body in a letter dated January 14, 2022, signed by the Secretary General, Alphonse Bile and addressed to the President of the Nigeria Basketball Federation, Engr.\nAhmadu Musa Kida stated that Nigeria’s Rivers Hoopers cannot participate in this year’s Final Round.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nReason for FIBA Africa’s sanction according to a document available to Daily SunSports is that Nigeria did not conclude its League."
  },
  {
    "headline": "BREAKING: Kidnappers abduct Plateau traditional ruler, Da. Gyang Balak, demand N10m ransom",
    "summarized_story": "From Gyang Bere, JosGunmen suspected to be kidnappers on Sunday night abducted Da.\nGyang Balak Gut, the Gwom Rwei Vwang in Jos South Local Government Area of Plateau State.\nThe source said the kidnappers have established contact with the family and demanding for a ransom of N10 million.\n“Troops of Operation SAFE HAVEN in conjunction with other security agencies are on the trail of the kidnappers.\nSince then, prominent personalities which includes Ex-Plateau Governorship Aspirant, Kemi Nshe, lecturer with Plateau State University Bokkos and students of Plateau State Polytechnic Barkin-Ladi have all been kidnapped within the duration of less than one month."
  },
  {
    "headline": "National Convention: February date sacrosanct–APC Governors",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) governors, under the aegis of Progressive Governors Forum (PGF), have declared, as sacrosanct, the February date for the conduct of the party’s National Convention.\nProgressive Governors Forum (PGF) Chairman, Abubakar Atiku Bagudu, dropped the hint after the Governors’ marathon meeting in Abuja on Sunday night, passing a vote of confidence in the Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee (CECPC).\nAsked if the initially proposed February date for the convention is still realistic, he replied: “Yes.\n“The President visited Ogun where he commended and inaugurated projects, he visited Borno State.\n“We are united behind Mr. President and we thank him and we are united and solidly behind the Caretaker Committee,” he noted."
  },
  {
    "headline": "Insecurity: Farms, streams no longer safe, laments ￼Archbishop Kaigama",
    "summarized_story": "From Fred Ezeh and Aidoghie Paulinus, Abuja AbujaArchbishop of Abuja Catholic Archdiocese, Ignatius Kaigama, has lamented that rising insecurity across Nigeria has made farms, streams and other places unsafe.\nHe said the situation has affected food productions, people’s sources of livelihood and could be responsible for high cost of food items.\nHe reminded governments of their constitutional responsibility and challenged them to rise to the occasion to salvage Nigeria from imminent problem.\nYet, the assurances of political leaders and security operatives always leave more to be desired.\nWe joined millions of Nigerians to appreciate the sacrifices of our fallen and living heroes."
  },
  {
    "headline": "NDLEA intercepts 1.5m tramadol tablets en route Kebbi, Kano at Lagos airport, seaport",
    "summarized_story": "The banned substances were loaded in Onitsha, Anambra State, heading to Yauri, Kebbi State.\nThis is even as a total of 425,000 Diazepam tablets were recovered at Segemu, Kano.\nThe drugs seized included: 394,480 capsules and 3,000 tablets of Tramadol weighing 83.707kg; Exol-5: 647,500 tablets weighing 203.315kg; Diazepam: 12,500 tablets weighing 2.05kg; Bromazepam: 1,500 tablets weighing 0.45kg; Codeine based syrup: 999 bottles weighing 134.865kg; Pentazocine injections: 4,000 ampoules weighing 16.64kg.\n“In Plateau state, a fake security agent, Babagana Maaji has been arrested through a controlled delivery of 5.6kg cannabis from Lagos.\n“While commending the officers and men of the various commands for their remarkable efforts, Chairman and Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Abayomi: Omicron Now Predominant Covid Variant in Lagos",
    "summarized_story": "Lagos Commissioner for Health, Prof Akin Abayomi, has said that Omicron is now the predominant variant of Covid-19 in Lagos.\nSpeaking in an interview on Arise TV Monday, Prof Abayomi said Omicron swept through Lagos like a wildfire during Christmas and the new year.\nOur data shows that the predominant virus in circulation in Lagos now is the Omicron.\n“The ability of this new variant to spread very quickly is what we are seeing in other parts of the world.\nOmicron swept through Lagos like a wild fire and everybody recognizes that at one point around Christmas, and the new year, there wasn’t a household that didn’t have one person with a respiratory tract infection,” he said."
  },
  {
    "headline": "Breaking: Inflation Rises to 15.63%",
    "summarized_story": "By James EmejoThe Consumer Price Index (CPI) which measures inflation rose to 15.63 per cent year on year in December compared to 15.40 per cent in the preceding month, the National Bureau of Statistics (NBS), said Monday.\nThe headline index had maintained a decline for eight months, from April 2021 to November before returning to the upward trajectory in December.\nInflation stood at 18.12 per cent in April, 17.93 in May, 17.75 per cent in June, 17.38 per cent in July, 17.01 in August, 16.63 per cent in September, 15.99 in October and 15.40 per cent in November.\nAccording to the CPI figures for December, the 0.23 per cent increase was occasioned by the increase in prices of goods and services as a result of increase in their demand during the month under review, being a festive season.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Farmers Count Gains of Anchor Borrowers Scheme, to Unveil Mega Rice Pyramid",
    "summarized_story": "Obinna ChimaThe Anchor Borrowers’ Programme (ABP), an initiative of the Central Bank of Nigeria (CBN), has been described as a major agricultural breakthrough and a source of pride to the country, as rice farmers continue to count gains under the scheme.\nTo mark the successes recorded under the programme, particularly, in the area of rice cultivation, the Rice Farmers Association of Nigeria (RIFAN), in collaboration with the CBN, would tomorrow unveil the world’s largest rice pyramid in Abuja.\nRIFAN stated in a publication to announce tomorrow’s programme, “RIFAN will also use the occasion to flag off its 2021 – 2022 Dry Season Farming activities and celebrate the Annual Rice Festival.\nRIFAN has been the major driver of the rice value chain under the ABP for the past six years.\nIt is also a loan to farmers without collateral and the benefitting farmers are given farm input and cash to cultivate their farms, including the experiment on rice."
  },
  {
    "headline": "Abiodun Pledges Improved IGR in 2022",
    "summarized_story": "Ogun State Governor, Dapo Abiodun has said his administration would continue to work assiduously to improve the state’s internally generated revenue (IGR).\nAbiodun stressed that the incumbent government would continue to do all it can to increase the state IGR.\n“Last year, the National Bureau of Statistics came up with a report that showed Ogun State was the state with the highest improved Internally Generated Revenue.\nThis is unprecedented in the history of this state; our state had been number three last year.\nWe are very proud that this is happening right here in Ogun State."
  },
  {
    "headline": "N2.4bn Judgment Debt: Supreme Court Reverses Self, Restores GTBank’s Appeal against Innoson Motors",
    "summarized_story": "Alex Enumah in AbujaThe Supreme Court has set aside its earlier ruling which dismissed Guaranty Trust Bank’s (GTB) appeal against a N2.4 billion judgment in favour of Innoson Motors Nigeria Limited.\nThe apex court set aside its own decision on Friday, while delivering judgment in an application by GTB seeking the re-listing of the appeal on the grounds that it was wrongly dismissed.\nThe apex court in reversing itself relied on Order 8 Rules 16 of the Supreme Court’s rules that empowers it to set aside its decision in certain circumstances, like any other court.\n“It will be unjust to visit the sin of the court’s Registry on an innocent, vigilant, proactive and diligent litigant.\nThe application is therefore, meritorious and hereby succeeds,” the apex court held."
  },
  {
    "headline": "BREAKING: Nigerian Government Files Fresh Terrorism Charges Against Nnamdi Kanu",
    "summarized_story": "The Nigerian Government on Monday filed fresh terrorism charges against detained leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu.\nAccording to the amended process it filed before the Federal High Court sitting in Abuja, the Nigerian Government increased the counts in the initial charge it preferred against Kanu.\nNnamdi KanuThe IPOB leader, who was hitherto facing a seven-count treasonable felony charge, will now enter his fresh plea to a 15-count amended charge marked FHC/ABJ/CR/383/2015 and signed by Director of Public Prosecution, M.B Abubakar.\nThis amended charge came barely 24 hours to the scheduled commencement of hearing by Justice Binta Nyako.\nThe court had on December 2, 2021 fixed Tuesday to hear some pending applications including the one Kanu filed to be discharged and acquitted."
  },
  {
    "headline": "BREAKING: Nigerian Government Files Fresh Terrorism Charges Against Nnamdi Kanu",
    "summarized_story": "The Nigerian Government on Monday filed fresh terrorism charges against detained leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu.\nAccording to the amended process it filed before the Federal High Court sitting in Abuja, the Nigerian Government increased the counts in the initial charge it preferred against Kanu.\nNnamdi KanuThe IPOB leader, who was hitherto facing a seven-count treasonable felony charge, will now enter his fresh plea to a 15-count amended charge marked FHC/ABJ/CR/383/2015 and signed by Director of Public Prosecution, M.B Abubakar.\nThis amended charge came barely 24 hours to the scheduled commencement of hearing by Justice Binta Nyako.\nThe court had on December 2, 2021 fixed Tuesday to hear some pending applications including the one Kanu filed to be discharged and acquitted."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Establish Two Markets In Controlled Territories In Borno",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) has established two open markets in Borno State.\nSaharaReporters gathered that the markets are established in Daban Gajere, located very close to Bulwa Bakin Dam and Tamfalla in the Marte Local Government Area.\nSaharaReporters also reported how ISWAP established two Wilaya’s (Caliphates) at Lake Chad and Sambisa forest to sustain its war against countries in Sub-Saharan Africa.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Establish Two Markets In Controlled Territories In Borno",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) has established two open markets in Borno State.\nSaharaReporters gathered that the markets are established in Daban Gajere, located very close to Bulwa Bakin Dam and Tamfalla in the Marte Local Government Area.\nSaharaReporters also reported how ISWAP established two Wilaya’s (Caliphates) at Lake Chad and Sambisa forest to sustain its war against countries in Sub-Saharan Africa.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Police Summon Controversial Former Kano Commissioner, Muazu Magaji, Silent On Reason For Invitation",
    "summarized_story": "The Kano State Police Command has summoned Muazu Magaji, a former Commissioner for Works in the administration of Governor Abdullahi Umar Ganduje.\n“When I insisted, they said it was the Kano state government that filed a complaint against me,” he said.\nWhen asked whether he honoured the invitation, Magaji said he was presently in Abuja and that he would honour the invitation once he gets to Kano on Tuesday.\nMagaji has been controversial since he was sacked as commissioner in Kano.\nFrom that moment, the sacked commissioner has been criticising Ganduje and his administration on Facebook."
  },
  {
    "headline": "FUTA students protest ‘extortion, harassment by thugs’",
    "summarized_story": "Some students of the Federal University of Technology, Akure (FUTA) living off-campus on Monday staged a protest over alleged incessant extortion and harassment by suspected thugs and cultists.\nAdvertisementThe protesting students gathered at the road leading to the varsity’s second gate, crippling vehicular and other activities in the area for hours.\nShe said the thugs would ambush and extort male students on their way to classes, while female students were constantly harassed as well.\nAdvertisement“We have two gates, south gate and north gate.\nI stay at south gate and I know how it can be."
  },
  {
    "headline": "Five ways technology can ease stress of back-to-school rush",
    "summarized_story": "There is also taking time out of their busy schedules to help their kids with homework among other things.\nFor parents trying to ease their ‘back to school’ stress, here are five ways that technology can help:AdvertisementSet reminders with Google AssistantSetting reminders is a smart way to remember all the things that are important for school, from lunches to school events.\nParents should however allow their children to generate the answers to their homework questions before searching Google for the answer.\nAdvertisementThere are also a variety of educational videos for children that can help parents tutor children who wish to learn more beyond their school work.\nFamily Link allows parents to set digital rules to help guide their children as they learn and explore online."
  },
  {
    "headline": "Police arrest ‘killer’ of UNIJOS student",
    "summarized_story": "The Plateau state police command has arrested Moses Oko, the alleged killer of Jennifer Anthony, a student of the University of Jos (UNIJOS).\nAdvertisementBartholomew Onyeka, the state commissioner of police, disclosed this on Wednesday while parading the suspect at the command’s headquarters in Jos.\nJennifer, a 300-level student of the institution, was declared missing by her friends on social media in December.\nAdvertisementAccording to him, the suspect had fled the hotel “after commiting the crime.”The commissioner of police said the suspect was arrested in Benue with the help of his father who is a lecturer at UNIJOS.\n“The command in a bid to arrest the perpetrator launched an aggressive manhunt on the suspect and tactically trailed him to Benue State where he was arrested by hawked-eye police operatives of the Command."
  },
  {
    "headline": "Kaduna asks public schools to adopt four-day work week",
    "summarized_story": "The Kaduna government has directed all public schools in the state to migrate to the four-day working week.\nSchools are set to reopen on January 10 for the second term of the 2021/2022 academic session.\nThe Kaduna government, on December 1, 2021, began its pre-announced transition to a four-day work week.\nLawal, in her recent notice, asked public schools in the state to adjust to the new system.\nAdvertisementShe advised members of the school security committee to ensure proper monitoring of security apparatus."
  },
  {
    "headline": "Yul Edochie gifts N100,000 to visually-impaired fan for mimicking him",
    "summarized_story": "Yul Edochie, the Nollywood actor, has gifted Daniel Eze, a visually-impaired fan, the sum of N100,000 for imitating him.\nAdvertisementIn an Instagram post, Edochie shared a video wherein Eze was delivering a solo performance while mimicking the actor’s deep and baritone voice.\nEdochie, who appeared to have been impressed, immediately said he would be blessing Eze with N100,000.\nIn the video, Eze appreciated Edochie, stating that the money will be useful for him in school.\nAdvertisement View this post on Instagram A post shared by Yul Edochie (@yuledochie)Advertisement View this post on Instagram A post shared by Yul Edochie (@yuledochie)AdvertisementCopyright 2022 TheCable."
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "What YCombinator’s new $500,000 deal means for African startups",
    "summarized_story": "Considering that in its 17 years of existence, this is the fourth time the accelerator—which has funded 3,306 startups and 66 African startups—is changing its standard deal, it’s worth looking into what the change means.\nFor an investor, investing with a SAFE option means putting money into a startup without a set valuation.\nThis is beneficial to founders as they are not pressured early on to give their startups a valuation.\nIn the case of YC’s new deal, the accelerator is investing $375,000 at an agreement that it’ll own a future part of a startup.\nThis means Y Combinator still has the right to defend 4% of their stake in companies by investing at a follow-up round."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "How Wiicreate is helping African startups improve brand visibility with branded merchandise",
    "summarized_story": "However, Oreoluwa Shonibare, Co-founder and CEO of Wiicreate, saw an opportunity to help startups improve their offline marketing campaigns using branded merchandise.\nHe sold over 100 T-shirts and, in the process, learnt how merchandise could be used to communicate a brand’s value proposition.\nOver the next two years, they designed T-shirts for students and over 30 Nigerian startups, including fintech startups, Cowrywise and PiggyVest.\nA screenshot of the Wiicreate website“We basically help companies curate, ship, and brand merchandise ranging from T-shirts to water bottles, hoodies and thank you cards, just name it.\nWith Qwiik, users can print and have their A4 documents delivered to any part of the country."
  },
  {
    "headline": "The WiiCreate story, investing in Morocco",
    "summarized_story": "AdvertisementThe brainchild of Oreoluwa Shonibare and David Onwochie, WiiCreate was founded in 2017 after a tweet by the latter.\nOnwochie was looking for a co-founder with a graphic design background, and Shonibare fit the bill to a tee.\nAccording to Mezzour, it is the national brand to promote the Moroccan digital sector.\nIn 2021, Moroccan startups hit a record-high of $29 million in funding, perhaps an indication of the country’s burgeoning tech ecosystem.\nTL;DR: Morocco is looking for outside investments into its tech ecosystem."
  },
  {
    "headline": "Real estate as NFTs, social media in the metaverse: Projections for blockchain in Africa",
    "summarized_story": "However, Buchi Okoro, CEO of crypto exchange, Quidax, doesn’t think so.\nSocial media is going to the metaverseThe metaverse, NFT, and Web3 were some of the biggest buzzwords of 2021 in the crypto sphere.\nSource: TechnextHanu Fejiro Abodje, CEO of alternative payments solution company, Patricia, has indicated an interest in the Solana blockchain, which has been touted as the Ethereum killer.\nIt brings ease and simplicity to using crypto platforms, reducing the financial barrier of participating in activities such as NFTs and decentralised finance (DeFI).\nAfrican NFT project, Afrobubble, was created on the Solana blockchain because of the ease the chain brings to buying and selling NFTs."
  },
  {
    "headline": "What tenants do not know about Lagos monthly rent",
    "summarized_story": "January 2022 when the proposed Lagos Monthly Rent scheme is planned to start is here, yet the enthusiasm that should greet such a scheme remains to be seen.\nThis may be partly because many of the tenants do not have the right information on how the scheme will serve their needs.\nThe portal would also be open to landlords who might wish to place their properties there for rent.\nThe Lagos State government, late last year at the Lagos Real Estate Market Place Conference and Exhibition, announced that it would be implementing a monthly rent scheme starting from January this year.\nLagos is an active rental market where it is estimated that 60 percent of its population live in rented accommodation spending about 50 percent of their income on rent."
  },
  {
    "headline": "Non-profit NSSF’s initiative delivers 1.6m COVID-19 vaccinations in 3 months",
    "summarized_story": "The NSSF was formed through the collaboration between Global Citizen (GC) and the Nigeria Sovereign Investment Authority (NSIA).\nThe NSSF in September 2021 entered into a partnership with the NPHCDA to assist people in Adamawa, Edo, Imo, Katsina, Nasarawa and Ogun to get vaccinated against COVID-19.\nRead also: Why Lagos ranks low despite hitting highest COVID-19 vaccination volumeThe vaccination teams operated from markets, places of worship, schools and other public spaces.\n“So far, the campaign has reached over 12 million Nigerians who have been better informed about the need to be vaccinated against the COVID-19 virus,” said the NSSF.\nIn 2020, they raised billions of naira to build and equip medical centres to attend to COVID-19 patients."
  },
  {
    "headline": "Insurance Broker Commits Suicide In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – A young man, identified as Nnamdi Godson Nwokorie believed to be a staff of Prudential Zenith Life Insurance Plc, has reportedly committed suicide on Sunday in Sapele, Sapele Local Government Area of Delta State.\nHe was said to have hanged himself under a water tank scaffold at his residence in Ugbeyiyi, Sapele.\nThere were indications from his Facebook profile that , deceased, worked with Prudential Zenith Life Insurance Plc said to be incorporated and registered in England and Wales.\nWe don’t only provide insurance cover for our clients, but we live up to our promises.”He went ahead to add: “#PrudentialZenithLifeInsurance: We even provide cover against the dreaded COVID-19.\nTrust us for ur life insurance cover as well as investment.”Young and handsome Nnamdi’s hope for a better life was upbeat when in January 24, 2021 he quipped: “It’s a new beginning."
  },
  {
    "headline": "Edo explores potentials in water transport to boost economy, strengthens security on waterways – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…police, other security agencies hail ObasekiBENIN CITY – The Edo State Government is sustaining programmes and reforms to harness the huge economic potentials in its water transportation ecosystem to boost economic growth and development, in line with the government’s Making Edo Great Again (MEGA) Agenda.\nThe team inspected the recently procured four Nr200HP Armoured gunboats and four speedboats at the Government House, Benin City; the Marine Police Base, on Ologbo River, and the Modern Concrete Pedestrian Jetty, with awaiting Lounge at Ologbo, Ikpoba-Okha Local Government Area of Edo State.\nOsifo noted that the state’s waterways offer a unique economic opportunity to the government and citizens, noting that if properly harnessed, the waterways have the potential to boost the state’s revenue and ensure economic prosperity for the state.\nThe EDSOGPADEC boss added, “these facilities would also positively affect the physically challenged as there is a part on the walkway of the Jetty designed for the physically challenged.\nOgbadu said with the facilities, the crime rate in the state will be totally reduced to the barest minimum, reassuring of effective and efficient use of the facilities in the best interest of Edo people."
  },
  {
    "headline": "Five Star Obulor Shines at Female Cricket League Opener in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Assistant Captain of the Female National Cricket Team, Agatha Obulor gave a command performance at the opening match of the 2022 season of the, Edo Female Cricket League that at the Edo Boys High School, in Benin City over the weekend.\nObulor, retruned in the second inning, knocking five wickets off the Supernova’s hope for a chase of the 149 runs deficit.\nBarrister Abraham Oviawe, the Vice Chairman of the Cricket League says that the scores on the board in the opening games of the league tells a story of growth and maturity.\nThe Edo State Cricket female Cricket League is the pioneer state female league in the country and the second league that engages the female gender after the South-South Female Cricket League, that also includes the state in their geo-mapping.\nWith a surprise win from AAU Cricket Club against Dolphins last weekend, we can expect a fiercer battle for a spot in the top four when play resumes for week seven fixtures."
  },
  {
    "headline": "Edo govt holds EXCO retreat, as Salami, Rewane harp on reforms, opportunities for growth – Nigerian Observer",
    "summarized_story": "In attendance are the Edo State Governor, Mr. Godwin Obaseki; Deputy Governor, Rt.\nComrade Philip Shaibu; Secretary to the State Government, Osarodion Ogie Esq., Special Advisers and Commissioners and other members of the Edo State Executive Council.\nSalami, who lauded the Edo State Government on the initiative for the retreat, stressed on the need for state-level data to be able to generate real-time data to inform decision-making and engender sustainable development in the state.\nOn his part, Rewane said Edo State can grow at a Gross Domestic Product (GDP) rate of 7.8 percent if the government takes bold and strategic decisions to harness its resources to drive development.\nRewane noted that the growth areas in the state include agriculture, culture and tourism, light manufacturing and power, noting that the state has huge potential to become a leisure hub."
  },
  {
    "headline": "Pastor Adeboye intervenes as Osun APC crisis gets messier",
    "summarized_story": "At the on set of their journey in Osun State, Oyetola was one of the Lagos boys, brought to Osun to occupy strategic positions which the locals had been promised.\nThough, left to Aregbesola, Oyetola was not his choice for the position of the Chief of Staff.\nAs a matter of fact, both Aregbesola and Oyetola did not know the nitty- gritty of Osun politics, it was this lawyer, recommended by the former Osun State Governor, Chief Bisi Akande that made their navigation in Osun politics easy.\nLasun Yusuf, and the the Ex Speaker of the Osun State House of Assembly, Hon Najeem Salami with the Progressives Top of Aregbesola.\nPart of their arrangement was their visit and appeal to the General Overseer of the Redeemed Christian Church of God (RCCG) Pastor Enoch Adeboye, who is also an indigene of Osun State, to wade into the matter."
  },
  {
    "headline": "Continuous borrowing: Nigeria in dire straits",
    "summarized_story": "This is because, with an already scheduled N6.123trillion budget deficit in 2022, Nigeria is sure to continue on a borrowing binge.\nAlready the government has accumulated a total debt stock of about N28 trillion in the last six years.\nThis is further broken into domestic borrowing of N2.44 Trillion and N2.44 Trillion for foreign borrowing.\nFigures on the document also revealed that between 2022 and 2024, Nigeria will spend N14.6 Trillion on debt servicing.\nThis is broken down as; N3.6 Trillion in 2022, N4.9 Trillion in 2023, and N6.1 Trillion in 2024."
  },
  {
    "headline": "Fiscal, monetary policy conflicts threaten economic recovery",
    "summarized_story": "One of such policy conflicts militating economic recovery is the federal government’s excessive borrowings from the Central Bank of Nigeria, CBN, through the Ways and Means Advances may have become the single most adverse factor impeding the performance of the CBN, and worsening the economic crisis in the country.\nThis was disclosed in the Monetary Policy category of the CBN Frequently Asked Questions, FAQs, under the title, “Can government frustrate CBN policy”?\nIt was stated that there are certain distortions in the Monetary policy base due to the over dependence of the government on the CBN on deficit financing.\n“Yes, when the federal government exceeds its revenue, the CBN finances government deficit through Ways and Means Advances subject to a certain limit.”In the existing laws.\n“To raise taxes for recurrent expenditure is to further restrict economic growth and increase poverty and unemployment."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Buni Hails Buhari, Lawan For Improved Security In N’East, Synergy In Governance",
    "summarized_story": "The governor of Yobe State, Hon.\nBuni acknowledged that there is now a significant improvement in the security situation in the North-East particularly in Yobe State.\nThe Yobe governor also commended the Senate President, Ahmad Lawan.\nHe thanked President Buhari for providing the security personnel the required resources to secure lives and property in the country.\nLawan was once Danmasani Bade but having been elevated by the Bade Emirate Council in Yobe State as Sardaunan Bade, his first son, Ibrahim Ahmad Lawan now bears the title."
  },
  {
    "headline": "Akpabio Group Empowers 1,500 In Gombe",
    "summarized_story": "Senator Godswill Akpabio for Common Good (SGACG), a group calling on the Minister of Niger Delta Affairs, Senator Godswill Akpabio, to contest for the office of president of Nigeria in 2023, has empowered about 1,500 people in Gombe State.\nAccording to the group, the empowerment was part of its commitment to putting Nigerians first and garnering support for Senator Godswill Akpabio, and to persuade him to participate in the 2023 general elections.\nThe empowerment took place Saturday, January 15, 2022 at the second Senator Akpabio Youth Empowerment Programme (SAYEP) in Gombe.\nThe programme attracted youths and well-skilled individuals from North-East region who benefited from the gesture of the Minister’s supporters.\nTafida, who thanked Nigerians for their continued support for Akpabio, added: “the measure of what the group is doing is a small replica of the good intentions of the Minister for Nigerians."
  },
  {
    "headline": "Ousted Malian President, Keita, Dies At 76",
    "summarized_story": "Former president of Mali, Ibrahim Boubacar Keita, who was sacked by the military, is dead.\nKeita, who led Mali from 2013 until he was ousted in a coup in 2020, died yesterday at the age of 76 in Bamako, the nation’s capital.\nHis family said, “President IBK died this morning at 0900 GMT in his home” in Bamako.\nKeita was two years into his second five-year term when he was toppled by the military in 2020.\nUnder pressure from the Economic Community of West African States (ECOWAS), the junta released Keita on August 27 and returned him to his residence in Bamako, under surveillance."
  },
  {
    "headline": "Ousted Malian President, Keita, Dies At 76",
    "summarized_story": "Former president of Mali, Ibrahim Boubacar Keita, who was sacked by the military, is dead.\nKeita, who led Mali from 2013 until he was ousted in a coup in 2020, died yesterday at the age of 76 in Bamako, the nation’s capital.\nHis family said, “President IBK died this morning at 0900 GMT in his home” in Bamako.\nKeita was two years into his second five-year term when he was toppled by the military in 2020.\nUnder pressure from the Economic Community of West African States (ECOWAS), the junta released Keita on August 27 and returned him to his residence in Bamako, under surveillance."
  },
  {
    "headline": "Amnesty Boss Backs Wike’s War Against Illegal Refineries",
    "summarized_story": "The interim administrator of the Presidential Amnesty Programme (PAP), Colonel Milland Dikio (rtd), has thrown his weight behind the war against illegal refineries declared by Rivers State governor, Nyesom Ezenwo Wike.\nHe said illegal refineries were not the only cause of the environmental devastation in the region, insisting that other harmful practices are also responsible for polluting the environment.\nThe Amnesty boss said: “I commend the Rivers State Governor, Wike, for taking on the issue of illegal oil refineries also known as kpofire head on.\nADVERTISEMENTHe said: “We’re looking for partnership with businesses that can train these ex-agitators and give them the required skills for employment in their businesses.\nIts a partnership because we want those who train them to guarantee that they will employ them."
  },
  {
    "headline": "2023: I will focus on enablers that’ll promote prosperity, development for Nigerians – Anyim",
    "summarized_story": "Former Senate President and Presidential aspirant in the 2023 general election, Sen. Anyim Pius Anyim, Monday said he will tackle Nigeria’s debt problem and other economic challenges through the aggressive pursuit of industrialisation and manufacturing, talents and innovation, science and technology.\nNigerians are no longer optimistic about the economy as the country’s debt have risen to N35.5trn, unemployment at 33.3 per cent, while inflation is at 15.4 per cent.\nIn his words: “For me, the drivers of the economy will now be on industrialisation and manufacturing, talents and innovation, science and technology.\n“That obviously will expand the economy; that will make the economy more competitive and more dynamic.\n“I will also focus on the enablers of development."
  },
  {
    "headline": "2023: I will focus on enablers that’ll promote prosperity, development for Nigerians – Anyim",
    "summarized_story": "Former Senate President and Presidential aspirant in the 2023 general election, Sen. Anyim Pius Anyim, Monday said he will tackle Nigeria’s debt problem and other economic challenges through the aggressive pursuit of industrialisation and manufacturing, talents and innovation, science and technology.\nNigerians are no longer optimistic about the economy as the country’s debt have risen to N35.5trn, unemployment at 33.3 per cent, while inflation is at 15.4 per cent.\nIn his words: “For me, the drivers of the economy will now be on industrialisation and manufacturing, talents and innovation, science and technology.\n“That obviously will expand the economy; that will make the economy more competitive and more dynamic.\n“I will also focus on the enablers of development."
  },
  {
    "headline": "Weeping as bandits kill 16, abduct many in Kebbi",
    "summarized_story": "Banditry, killings and abductions for ransom has again taken a centre stage with a huge number of bandits on Friday, invading Dankade village under Zuru emirate in Kebbi state killing at least 16 civilians, including policeman and a soldier.\nAccording to the Kebbi State police command PRO, DSP Nafiu Abubakar, the bandits were engaged by Police and the military forcing the bandits to leave their targets.\nThe State police command PRO told Vanguard that the bandits, through another route, invaded Dankade village where they killed at least 16 civilians, including a policeman and a soldier and yet-to-be ascertain a number of civilians were also abducted by the bandits.He added that “bandits also set a number of houses ablaze.\n“The Kebbi state police commissioner CP Musa Baba has since mobilised armed officers and men to the scene of the incident for an on the spot assessment of damages and restore normalcy at the affected village.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Weeping as bandits kill 16, abduct many in Kebbi",
    "summarized_story": "Banditry, killings and abductions for ransom has again taken a centre stage with a huge number of bandits on Friday, invading Dankade village under Zuru emirate in Kebbi state killing at least 16 civilians, including policeman and a soldier.\nAccording to the Kebbi State police command PRO, DSP Nafiu Abubakar, the bandits were engaged by Police and the military forcing the bandits to leave their targets.\nThe State police command PRO told Vanguard that the bandits, through another route, invaded Dankade village where they killed at least 16 civilians, including a policeman and a soldier and yet-to-be ascertain a number of civilians were also abducted by the bandits.He added that “bandits also set a number of houses ablaze.\n“The Kebbi state police commissioner CP Musa Baba has since mobilised armed officers and men to the scene of the incident for an on the spot assessment of damages and restore normalcy at the affected village.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "BREAKING: FG Files Fresh Terrorism Charges Against Nnamdi Kanu",
    "summarized_story": "On Monday, the Federal Government filed new terrorist accusations against Nnamdi Kanu, the embattled leader of the outlawed Indigenous People of Biafra.\nThe government raised the charges in the initial charge it filed against Kanu in the revised process it filed before the Federal High Court in Abuja.\nKanu, who has been held in jail since his alleged kidnapping in Kenya and forcible repatriation to Nigeria, will now enter a new plea to 15 revised charges marked FHC/ABJ/CR/383/2015 and signed by the Director of Public Prosecution, DPP, M. B. Abubakar.\nThe charges were changed just 24 hours before trial Justice Binta Nyako was about to begin hearings.\nDetails later…"
  },
  {
    "headline": "2023: Wike’s Presidential Posters Hit The Streets Of Abuja",
    "summarized_story": "2023: Wike’s Presidential Posters Hit The Streets Of AbujaRivers Governor Nyesom Wike’s posters have saturated portions of Abuja, the nation’s capital.\nOn Monday, the posters with Wike’s bold photo and name debuted.\nThey were placed in important locations throughout the public sector, including traffic kiosks, airports, Asokoro, and the Federal Secretariat.\nThe posters were sponsored by “Northerners For Change Group”."
  },
  {
    "headline": "2023: Ohanaeze woos North, sets aside N10 billion for Igbo presidency",
    "summarized_story": "This was even as the Ohanaeze disclosed that Igbo in diaspora have set aside N10 billion naira to support any candidate of Igbo extraction that will emerge for the presidential race.\nMazi Isiguzoro also disclosed that the delegation had met with some religious Clerics in the north over the presidential project.\nHe said the Igbo delegation for 2023 presidency would continue to lobby all parts of the country for the power shift to the South East region.\nThere should be no more abusive words between north and south East as we used to read on pages of newspapers.\nResponding, Yerima Shettima told the Ohanaeze delegation that it was good to negotiate when seeking for power, adding that nobody achieved good thing through threat."
  },
  {
    "headline": "BREAKING: Salihu Lukman Resigns As APC Governors Forum DG Amid Convention Controversy",
    "summarized_story": "Salihu Lukman resigns as APC governors forum DG over convention controversySalihu Lukman, director-general of the Progressive Governors Forum (PGF), has resigned from his position, TheCable understands.\nHis resignation is coming on the heels of the controversy surrounding the planned convention of the All Progressives Congress (APC).\nSome of the governors of the ruling party had called for his resignation during a meeting at the federal capital territory (FCT) on Sunday night.\nMore to follow…"
  },
  {
    "headline": "About one year to 2023 polls: INEC waits, tension mounts over unsigned Electoral Bill",
    "summarized_story": "More than any other thing, the delay has kept the Independent National Electoral Commission (INEC) waiting and guessing on how best to plan ahead of the 2023 general elections.\nWhen probed further, he said he cannot predict what the final decision of lawmakers would be on the electoral bill.\nINECMeanwhile, the INEC has expressed its desire to have the new Electoral Act 2021 Amendment Bill signed into law at the earliest possible time.\n“It is the Independent National Electoral Commission’s (INEC) desire that the new Electoral Act Amendment Bill is signed into Law at the earliest possible time.\nHowever, the commission will rely on existing relevant laws to do our job if eventually the Electoral Act Amendment bill was not signed into law."
  },
  {
    "headline": "Breaking: Missing body found in search for British woman after Tsunami hit Tonga",
    "summarized_story": "A body has been found in the search for a British woman who was swept away as a tsunami struck Tonga on Saturday.\nDesperate family members had appealed for help finding 50-year-old Angela Glover, who was hit by huge waves on the island’s west coast.\nShortly before the tsunami happened Angela – who moved to Tonga in 2015 – posted a picture of red skies on Instagram, saying she had witnessed “a few swells” as authorities warned of a tsunami risk.\nShe was swept away as the island was hit by 4ft waves on the west coast of Tongatapu, the country’s main island, where she was staying.\nJames contacted police and the British Embassy after his wife did not return home, Mr Eleini said."
  },
  {
    "headline": "Breaking: PGF boss resigns over APC national convention controversy",
    "summarized_story": "Following the division among the governors of the ruling All Progressives Congress (APC) and the Caretaker Extraordinary Convention Planning Committee (CECPC) over whether the national convention should hold or not, the Director General of the Progressive Governors Forum (PGF) Salihu Lukman, has resigned from the office.\nBlueprint gathered reliably that Sunday’s meeting of the APC governors deliberated on whether the DG should be forced to resign or not.\nIt was gathered that governors were sharply divided over the matter.\nA competent source told Blueprint that while majority of the governors opposed to the pressure to force Lukman’s resignation, few of the governors insisted on him to go.\nEffort to speak with the PGF boss was unsuccessful as at the time of filling this report."
  },
  {
    "headline": "UPDATED: Again, FG Files Amended Charges Against Nnamdi Kanu",
    "summarized_story": "The Nigerian Government has again filed amended charges against the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nThe amended 15-count charge bordering on acts of terrorism was filed on Friday last week at the Federal High Court in Abuja, the Federal Capital Territory (FCT).\nJustice Binta Nyako, who was to preside over the case, later fixed Tuesday (January 18), to hear some pending applications, including the one Kanu filed to be discharged and acquitted.\nKanu initially faces a seven-count treasonable felony charge will now enter his fresh plea to a 15-count amended charge.\nVIDEO: ‘We Cannot Release Him,’ Buhari Says Nnamdi Kanu Should Defend Himself In CourtThe IPOB leader, who was initially detained and arraigned in court, fled the country in 2017 after he was granted bail for medical reasons."
  },
  {
    "headline": "VIDEO: Why Banditry Will Not End Soon In Zamfara – Matawalle",
    "summarized_story": "Zamfara State Governor, Bello Matawalle, has revealed why banditry will not end soon in the state.\nThe governor attributed the continued attacks by bandits on innocent residents of various communities in the state to the activities of some individuals.\n“I don’t think this issue of banditry will end very soon because already, some people are behind it,” the governor said.\nHe debunked the claims that up to 200 persons were killed in Bukuyyum and Anka Local Government Areas of Zamfara.\nBut as I’ve been saying, there are some political bandits who have been spreading lies, rumours so that they can achieve some political gain.”"
  },
  {
    "headline": "PDP Governors Ask Buhari To Restructure Nigeria’s Security Architecture",
    "summarized_story": "Governors of the Peoples Democratic Party (PDP) have asked President Muhammadu Buhari to restructure Nigeria’s security architecture.\nThe governors, who met in Port Harcourt, Rivers State on Monday, made their demand via a communique issued to journalists after their meeting.\nAccording to them, the unemployment rate was 7.3% under PDP, adding that it is now 33%, one of the highest in the world under APC.\n“In particular, it is clear that the APC Government is a massive failure when compared with the records of PDP in government.\nSpecifically, they urged the federal lawmakers to either override President Buhari’s veto or delete areas of complaints."
  },
  {
    "headline": "FCTA Denies Unvaccinated Residents Entry Into Public Facilities",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) has commenced the enforcement of the ‘No Vaccination Card” restriction or “Proof-of-Negative-Test-Result” for entry into public facilities.\nThe enforcement exercise which commenced on Monday comes more than a month after the Federal Government gave its own directive.\nOnly civil servants with vaccination cards were allowed access into the facility.\nSome of the civil servants alleged that they were not notified about the enforcement exercise and were taken unawares.\nMr. Ikaro, however, denied the allegation, insisting that adequate notice was given to the civil servants."
  },
  {
    "headline": "Governors No Longer Use Convoy Of 30 To 40 Vehicles – Gov Abubakar",
    "summarized_story": "Jigawa State Governor, Mohammed Badaru Abubakar, has said that governors no longer use convoys of 30 to 40 vehicles as measures to cut costs in governance.\nYou don’t see governors going in a convoy of 30, 40 vehicles.\nThat is the first step to reduce the cost of governance.”Rather than borrowing money for spending, he explained that state governors are prioritising employment in the education, health sectors.\nHe also debunked insinuations that governors were feasting heavily on security votes in their respective states.\nGovernor Abubakar also revealed steps by governors to look beyond oil and generate more money for the survival of states."
  },
  {
    "headline": "Aggrieved PDP Governorship aspirants protest in Ado Ekiti -",
    "summarized_story": "PDP Governorship Aspirants,Biodun Olujimi and Segun Oni Leads Protest Against Former Governor Ayodele Fayose Accusing him of Hijacking the Ward Congress Held on Saturday 15th January 2022.\nSome Party Faithfuls Joined the Protest this morning calling for the indefinite Suspension of Fayose from the PDP.\nThe Party Leaders accused Fayose of Sabotaging the Efforts of the Party by collating Ward Excos at a Private Event Center Owned by Him while the real Congress was ongoing in the 177 Wards of the State.\nThey Therefore Urged the National Working Committee to disregard any Purported List sent by Ayodele Fayose to the Party Secretariat in Abuja as they declared that there is no Congress Held in the State."
  },
  {
    "headline": "Group commends Taraba for implementing people-oriented projects -",
    "summarized_story": "A Coalition of Hausa-Fulani socio-cultural groups in Taraba state has passed a vote of confidence in Governor Darius Ishaku’s government for implementing people-oriented projects."
  },
  {
    "headline": "APC Govs confirm February sacrosanct for national convention -",
    "summarized_story": "Governors of the ruling All Progressives Congress APC on Sunday night met in Abuja to chart a way forward for the conduct of the long-awaited national convention.\nAt the end of the meeting, the governors upheld the February date for the national convention and passed a vote of confidence in the Caretaker Extraordinary Convention Planning Committee"
  },
  {
    "headline": "PDP Govs strategise on how to knock out APC",
    "summarized_story": "In this video, Political Technocrat, Dr Dayo Kayode and Public Affairs Analyst Ambrose Igboke.\nreview the top headlines from the Nigerian Newspapers for the 17th of January 2022."
  },
  {
    "headline": "Anyim Pius Anyim: ‘I Am Most Qualified to Fix Nigeria’",
    "summarized_story": "Former President of the Senate and the Secretary to the Government of the Federation between 2011 and 2015, is leaving no stone unturned to emerge the presidential candidate of the Peoples Democratic Party in the 2023 general election.\nHe speaks on his plans for Nigeria and his chances of clinching the ticket of the Peoples Democratic Party – the PDP."
  },
  {
    "headline": "ISWAP Attacks Military Institute, As Buni Hails Buhari On Improved Security – Trending with Ojy Okpe",
    "summarized_story": "The world’s largest rice pyramids are enabled by the Central Bank Of Nigeria’s Anchor Borrowers Program, in collaboration with the Rice Farmers Association of Nigeria.\nThe pyramids are set to be unveiled by President Muhammadu Buhari on Tuesday at the Abuja Chamber of Commerce and Industry’s Trade Fair Complex.\nMeanwhile, the Governor of Yobe State, Mai Mala Buni, has come under fire on social media for hailing President Buhari for his efforts at restoring peace and normalcy to the troubled North-Eastern region of the country.\nThe insurgents invaded the army institute which is located in the hometown of the immediate past Chief of Army Staff and current Nigerian Ambassador to the Republic of Benin, Tukur Buratai.\nFinally, Nigerian Police Officers and officers of the Nigerian Security and Civil Defence Corps, had an altercation at an illegal refining depot, in Obio-Akpor local government area of Rivers State."
  },
  {
    "headline": "Hakeem Baba-Ahmed : North’s Support for Buhari Was A Mistake",
    "summarized_story": "Ahead of next year’s elections, the Northern Elders’ Forum, NEF, has said the region will support only a presidential candidate who has the capacity to address the nation’s socio-economic and security problems, irrespective of where the person comes from.\nAccording to the forum, the north will no longer vote for a candidate based on sentiments as the region did for President Muhammadu Buhari in 2015, describing the incumbent as a disappointment not only to the north but the entire country.\nTo throw more light on the 2023 presidency and what the north has to lose with the conduct of a national census this year, is Dr Hakeem Baba-Ahmed, Director of Publicity and Advocacy, Northern Elders’ Forum."
  },
  {
    "headline": "Omicron Went Through Lagos ‘Like a Wildfire’ During Christmas, Says Health Chief Abayomi",
    "summarized_story": "Lagos State Commisioner for Health Prof Akin Abayomi spoke exclusively to ARISE News on various subjects, especially on the Omicron Covid variant which he says is now dominant in Lagos.\nWatch this snippet…For full interview, see link:"
  },
  {
    "headline": "AFCON: Algeria’s 35-Match Undefeated Run Ends after Equatorial Guinea Loss",
    "summarized_story": "Equatorial Guinea have caused the greatest upset so far at this year’s Africa Cup of Nations (AFCON), defeating continental champions Algeria 1-0.\nThis was the second disappointment for the Algerian side in the tournament, held in Cameroon, having tied with Sierra Leone in their opening match last week.\nThe holders now need a win in their final group game against Ivory Coast on Thursday to have a chance of reaching the round of 16.\nSierra Leone has now drawn against two heavyweights in Algeria and Ivory Coast to be unbeaten on its first AFCON appearance in 26 years.\nThe Gambia is unbeaten in its first two games at a major tournament, having won against Mauritania in its opener."
  }
]