[
  {
    "headline": "DSS bows to pressure, releases eight Igboho’s aides",
    "summarized_story": "The Department of State Service has released eight of the 12 detained aides of Yoruba Nation activist, Sunday Adeyemo, popularly known as Sunday Igboho.\nThe release of the eight aides came on the heels of the 48-hours ultimatum which the lawyer to the aides, Pelumi Olajengbesi, gave the DSS on Friday.\nThe PUNCH had earlier reported that the DSS had arrested 12 Igboho’s aides from his home in Ibadan on July 1.\nThe DSS’ lawyer, I. Awo, opposed the bail of other four of the aides on the ground that the DSS was still investigating them.\nSeeking to further detain the four aides, the DSS had filed an appeal at the Court of Appeal challenging the bail granted to the four aides."
  },
  {
    "headline": "Group berates Edo over compulsory COVID-19 vaccination",
    "summarized_story": "A group, Nigeria COVID Response Alliance, has condemned the pronouncement of the Edo State Government not to allow people who are yet to be vaccinated to enter places of worship or shopping malls.\nTo begin with, does Mr Obaseki have enough vaccines for the 3,233,336 residents of Edo State were they all to step out for the vaccine in compliance with this half-baked measure?\nEdo coalition protestsMeanwhile, members of the civil societies group in Benin, Edo State, on Monday protest against the government pronouncement.\nThe Interim state chairman, Edo Civil Society, Bishop Osadolor Ochei, said it is the right of the citizens to decide whether to be vaccinated or not.\nAlso, convener and spokesperson for the group, Chris Iyama said, “You cannot force someone to eat what he or she doesn’t want."
  },
  {
    "headline": "LASEPA, NAFDAC arrest 4 persons tampering with pollution evidence in Lagos",
    "summarized_story": "The Lagos State Environmental Protection Agency (LASEPA) and the National Agency for Food and Drug Administration Control (NAFDAC), have arrested four persons for allegedly tampering with environmental pollution evidence found in Ikorodu.\nThe News Agency of Nigeria (NAN), reports that, on Aug. 22, 2021, LASEPA issued a statement, warning property owners against using their facilities as illegal scrap yards, saying it promoted environmental pollution.\nThe spokesperson said that the joint inspection revealed more toxic substances, stressing that they promptly halted all activities on the site by placing a LASEPA stop work order, leading to the arrest of four persons.\nShe said the joint operation was carried out by Mrs Adedayo Adedayo, Director E-waste, (LASEPA), and Mr Ado Kabiri, Principal Regulatory Officer, NAFDAC.\n“The arrested suspects attempted to destroy previously-established evidence by gaining access to the sealed site illegally (jumping over the fence) and attempting to destroy evidence by arson."
  },
  {
    "headline": "Organised labour appeals to FG against electricity, petrol price hike",
    "summarized_story": "The organised labour has appealed to the Federal Government against any plan to increase the price of electricity or petrol to avert a crisis in the economy.\nMr Babatunde Olatunji, President, National Union of Chemical, Footwear Rubber Leather and Non-Metallic Product Employees (NUCFRLANMPE), made the appeal at the 29th Annual Industrial Relations seminar of the union in Ibadan on Monday.\nThe theme of the five-day seminar is ‘‘Socio-economic crises and COVID-19 Pandemic: Issues, challenges and way forward”.\nAccording to Olatunji, any plan to increase electricity or petrol will be a wrong step and the organised labour will do everything within its capacity to resist it.\n”Government should ensure adequate power, security of lives and properties as well as regulate multiple taxation and charges to allow manufacturing companies survive, thus promote Gross Domestic Products in the country,” he said."
  },
  {
    "headline": "CJN summons 6 chief judges over conflicting orders to political parties",
    "summarized_story": "….judges to face NJC panelBy Ikechukwu Nnochiri, ABUJAThe Chief Justice of Nigeria, CJN, Justice Ibrahim Muhammad, has summoned six Chief Judges to an emergency meeting over conflicting court orders that emanated from their judicial divisions within the last one month.\nA top source at the National Judicial Council, NJC, who confirmed the development to Vanguard, said the CJN was deeply embarrassed that such conflicting orders emerged from courts of the same coordinate jurisdiction.\nThe CJs are expected to explain the rationale behind the incessant granting of conflicting ex-parte applications by judges in their divisions, especially on suits that were instituted by members of various political parties.\nThe memo dated Monday, August 30, read in part: “My attention has been drawn to media Rmreports to the effect that some Courts of coordinate jurisdiction were granting conflicting Exparte Orders on the same subject matter.\n“This is even more compelling having regard to earlier NJC‘s warning to judicial officers on the need to be circumspect in granting Exparte applications”."
  },
  {
    "headline": "Impending attack: Military deploy troops to Plateau",
    "summarized_story": "“Troops of OpSH in the general area were also informed of the DSS report about the movement of strange persons in the area.\nWe therefore urge the communities to remain vigilant and continue to provide security agencies with timely, accurate and detailed security information about movement of suspicious persons or group of persons for prompt response.\nHis words, “In each local government area, we have a sector, with a Commander.\nIf in the military we have a section, that is 10 personnel, a platoon with 40, a company 120 etc.\nWhat I know is that we have troops on ground, the Sectors’ Commanders are there too, we have various checkpoints with personnel there.”Vanguard News Nigeria"
  },
  {
    "headline": "Our senior members abusing judicial process for politicians — NBA cries out",
    "summarized_story": "….seeks an urgent audience with CJNBy Ikechukwu Nnochiri, ABUJAThe Nigerian Bar Association, NBA, has alleged that some of its senior members are yielding themselves to politicians to be used as willing tools to wantonly abuse the judicial process.\nAccording to the legal association, it has evidence that some of its senior members acted in breach of rules of professional conduct for legal practitioners, by assisting politicians to procure ex-parte orders.\nConsequently, the NBA leadership said it would urgently seek an audience with the Chief Justice of Nigeria, CJN, Justice Ibrahim Muhammad.\n“In deference to the revered office of our courts, the NBA shall refrain from further comments on this matter in the meantime.\nIt can no longer be business as usual, further read the statement signed by NBA President, Mr Olumide Akpata."
  },
  {
    "headline": "BBNaija: I won’t eat for one day – Shehu Sani on Maria’s eviction",
    "summarized_story": "Shehu Sani, former Kaduna Central Senator, has reacted to the eviction of Maria from the Big Brother Naija, BBNaija, show.\nSani said he would not eat for one day due to Maria’s eviction from the BBNaija show.\nIn a tweet, the socio-political activist stressed that Maria’s eviction was unfair.\nAccording to Sani: “Evicting #Maria is unfair; I won’t eat for one day #BBNaijia6 #BBNajia.”Maria was one of the housemates evicted from the reality television show on Sunday.\nQueen, Maria, Pere, JMK, Sammie, and Cross were up for eviction last week."
  },
  {
    "headline": "Ajiroba of Lagos, Rasheed Williams is dead, Sanwo-Olu reacts",
    "summarized_story": "The Ajiroba of Lagos, Chief Rasheed Williams, has passed away.\nWilliams, a renowned socialite, was a member of Metropolitan Club, Yoruba Tennis Club and Eko Club, where he was the first president.\nSanwo-Olu recalled how Williams combined work and social life in a way that impacted the state and the nation positively.\nHe said Willams served Lagos meritoriously as a member of the Constituent Assembly, representing the Lagos lsland Local Government.\nThe governor said the fifth Ajiroba of Lagos also distinguished himself in private practice as an administrator and insurance expert."
  },
  {
    "headline": "Gunmen invade Oyedepo’s church, abduct members",
    "summarized_story": "Unknown gunmen suspected to be bandits have attacked a branch of Living Faith Church Worldwide at Osara community, along Lokoja-Okene road in Adavi Local Government Council of Kogi State.\nDAILY POST gathered that the kidnappers, who invaded the church premises when some of its members were rehearsing during the weekend, abducted at least three members.\nThe assailants were said to have stormed the area, shooting sporadically to scare away interveners before whisking the victims to an unknown destination.\nHabeeb Jamiu added that the council was working with security agents in the area to ensure that the victims are rescued unhurt.\nThe Kogi State Police Public Relations Officer, CSP Williams Ovye Aya, had not answered calls for comment as at press time."
  },
  {
    "headline": "Kwara Gov, Fulani leaders meet on security, peaceful coexistence",
    "summarized_story": "Governor Abdulrahman Abdulrazaq of Kwara State has met with Fulani leaders in the state with security and peaceful coexistence top on the agenda.\nThe meeting is amidst ultimatums on cattle grazing in some southern states and mass exodus of herders to the northern part of the country, especially Kwara State.\nHe said, “the meeting is for security and peaceful coexistence especially in the light of what is happening around us.\n“The Fulani in Kwara, like other communities in the state, will receive government’s protection and patronage in terms of infrastructure projects and social security programmes,” he further assured.\nPresident, Fulani Elites, Kwara State chapter, Alhaji Ahmed Magaji, said it was unfortunate that nomadic Fulani identity was being painted badly."
  },
  {
    "headline": "We’ll migrate all govt personnel, institutions to IPPIS platform – FG",
    "summarized_story": "The Federal Government said it has resolved to migrate all government personnel, agencies and institutions that drew their cost from the Consolidated Revenue Fund to the IPPIS platform.\n“It is heart-warming that since the inception of the IPPIS payment platform, there has been a significant level of transparency in government payroll administration.\nFurthermore, the IPPIS has brought greater efficiency into planning for personnel emoluments as well as planning for personnel budget.\n“In the light of the benefits of the system, the federal government resolved to migrate all government personnel, agencies and institutions that draw their personnel cost from the Consolidated Revenue Fund (CRF) to the IPPIS platform.\n“However, the Office of the Accountant General of the Federation has recorded significant successes in this regard."
  },
  {
    "headline": "Labour pickets HoS office in Cross River",
    "summarized_story": "Organised Labour in Cross River State on Monday locked the gate to the state secretariat and picketed the office of the Head of Service (HoS), Mrs. Gereldine Akpet-Ekanem.\nADVERTISEMENTThey carried placards with inscriptions such as: “The HoS must go”, “HoS must refund N25,000 collected from directors illegally”, “Ayade don’t kill our civil service”, “Ayade pay those employed since 2018”, “Ayade remit deductions from workers’ salaries to beneficiaries”, among others.\nThe state Chairman, Joint Public Service Negotiating Council (JPSNC), Godwin Otei, while addressing members at the gate of the HoS office, said the discrepancy and injustice were uncalled for and must be stopped.\nThe Nation contacted Mrs. Akpet-Ekanem to clear the air on the allegations by the Labour, but she did not answer her calls.\nTUC Chairman Ogbodum confirmed that at press time, about 75 directors had collected their N25,000 by hand."
  },
  {
    "headline": "NAFDAC launches campaign against public health challenges",
    "summarized_story": "The National Agency for Food and Drug Administration and Control (NAFDAC) has rolled out a campaign against public health challenges in the Southsouth.\nInaugurating the campaign in Port Harcourt, Rivers State, NAFDAC Director General Prof. Mojisola Adeyeye warned the public against patronising substandard and falsified COVID-19 Personnel Protective Equipment (PPE).\nAdeyeye hoped that the campaign would address the challenges, noting that NAFDAC was working to fish out individuals jeopardising people’s health.\nShe described the campaign as one of the veritable regulatory mechanisms put in place by NAFDAC to promote and protect people’s health.\nADVERTISEMENTShe observed that the COVID-19 period worsened manufacturing and distribution of substandard products and advised people to be wary of fake PPE at markets."
  },
  {
    "headline": "Activists give Fed Govt 14 days to publish NDDC forensic audit report",
    "summarized_story": "A civil society group in Port Harcourt, Rivers State, the Social Action and Mac Arthur Foundation, has given the Federal Government 14 days to make public a forensic audit report of the Niger Delta Development Commission (NDDC), or face protest.\nThe group spoke on Monday in Port Harcourt at a media parley.\nIt gave the Federal Government till September ending to constitute members of the board of the commission or face legal action.\n“Development experts should be brought on board to manage the commission as development agencies are run elsewhere in the world.\nThe NDDC is supposed to be a development agency and not an offshoot, an arm of any party in power, as it is currently."
  },
  {
    "headline": "Mark panel links PDP crisis to Wike, Secondus",
    "summarized_story": "The eight-man panel headed by former Senate President David Mark has decided to meet with the two gladiators before the end of this week to press for the withdrawal of court cases in connection with the crisis.\nThe suit was filed by members of the PDP in Rivers State.\nAccording to a source, members have identified Wike and Secondus as the arrowheads of the crisis rocking the PDP.\nThe source said: “We have resolved to hold a frank session with Wike and Secondus within the next 48 hours.\nOur report may even guide PDP to look its constitution on intra-party disputes.”The source said the panel might meet Wike and Secondus separately."
  },
  {
    "headline": "Conflicting orders: CJN summons CJs of Rivers, Anambra, Kebbi, 3 others",
    "summarized_story": "From Godwin Tsa AbujaChief Justice of Nigeria(CJN), Ibrahim Muhammad, has summoned six state chief judges over conflicting court orders on the same subject matter in the last one month.\nThey affected judges are those from Rivers, Cross River, Anambra, Imo, Jigawa and Kebbi states.\nA copy of the summons which was sighted by our reporter directed the affected chief judges are to appear before the CJN to explain what warranted their issuance of conflicting orders by courts of coordinate jurisdiction on the same issue.\nThe summons read: “My attention has been drawn to media reports to the effect that some courts of coordinate jurisdiction were granting conflicting exparte orders on the same subject matter.\nHe called on judicial workers to make transparency and integrity their watchword in the conduct of court affairs across the country."
  },
  {
    "headline": "Sit-at-home: 3 killed as residents disobey govs’ directives to shun lockdown",
    "summarized_story": "Meanwhile, residents across the South East states of Anambra, Imo, Ebonyi, Abia and Imo gain complied with the sit-at-home order despite its suspension.\nAs usual, there were few vehicles on the road while banks, markets and artisans locked up their premises.\nA joint security patrol team in a convoy of 10 vans were seen patroling round the capital city to ensure people were not harassed.\nCommercial bus drivers and tricycle operators came out in their numbers, but the hustling and bustling associated with some parts of the capital city were not there.\nAlso, major roads leading to Main Market Onitsha such as Old Market, New Market, Venn Roads were deserted as youths turned the roads to football pitches."
  },
  {
    "headline": "CBN picks Bitt Inc as technical partner for e-Naira roll-out",
    "summarized_story": "From Uche Usim, Abuja and Chinwendu ObienyiIn line with on going plans to roll-out its digital currency by year end, the Central Bank of Nigeria (CBN) on Monday announced the formal engagement of the global Fintech company, Bitt Inc., as its technical partner for Nigeria’s eNaira.\nAccording to him, in choosing Bitt Inc, the CBN will rely on the Company’s tested and proven digital currency experience, which is already in circulation in several Eastern Caribbean Countries.\nBitt Inc. was key to the development and successful launch of the Central Bank Digital Currency (CBDC) pilot of the Eastern Caribbean Central Bank (ECCB) in April 2021.\n“In order to catalyse the adoption of the e-naira, banks will facilitate onboarding and provide world-class customer service.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Don’t lose hope, CAN, PFN tell Nigerians",
    "summarized_story": "From Oluseye Ojo, IbadanThe Christian Association of Nigeria (CAN) and the Pentecostal Fellowship of Nigeria (PFN) have said Nigeria would bounce back to reckoning in spite of political challenges, besetting its progress.\nThey urged Nigerians not to lose hope in the corporate existence of the nation.\n“I stand in the place of Ezekiel and I prophesy to Nigeria and Nigerians, that there shall henceforth be showers of rain upon you.\nAll Nigerians, from the youngest to the oldest, shall dwell in safety in Jesus name.\nThe name Nigeria, shall be respected everywhere."
  },
  {
    "headline": "Confusion over alleged sealing of Plateau Assembly",
    "summarized_story": "From Gyang Bere, JosPersons believed to be security personnel, yesterday, stormed the Plateau State House of Assembly and prevented members from sitting.\n“It is not true that the House was sealed by security agencies, but we have presence of security personnel due to the tension over alleged plan to impeach the governor.\nCommissioner for Information and Communication, Dan Manjang, refuted claims that the Assembly complex was sealed by the state government and urged residents to regard it as fake news.\n“To the best of our knowledge, the House of Assembly remains open for legislative business.\nThis action has generated tension in different parts of the state as some individuals have sustained the pressure on the House to impeach the governor."
  },
  {
    "headline": "Worried About Conflicting Court Orders, CJN Summons 6 High Court CJs",
    "summarized_story": "By Alex Enumah in AbujaIn what appears to be a swift response to THISDAY report over the menace of conflicting orders by courts of equal jurisdiction, the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad, has invited six High Court Chief Justices to explain the rationale behind the development.\nTHISDAY in its Monday, August 30 Edition, with the headline: ‘Concerns Mount as Court Injunctions, Orders Threaten Nation’s Democracy,’ expressed worries over the spate of conflicting court orders by some judges across the country.\nWhile the High Courts of Imo, Jigawa and Anambra needs to explain their roles in the Anambra governorship election, the High Courts of Rivers, Kebbi and Cross River on the other hand are involved in the case of the PDP Chairman, Prince Uche Secondus.\nOur correspondent noted that the CJN complained bitterly on the huge embarrassment caused the Nigerian judiciary by the actions of those who issued the conflicting orders upon ex-parte applications by some political parties.\nOur source, who pleaded anonymity, confided in our correspondent that the meeting between the CJN and the Heads of Court concerned is a prelude to the larger NJC meeting likely to hold next week."
  },
  {
    "headline": "Concerns Mount as Court Injunctions, Orders Threaten Nation’s Democracy",
    "summarized_story": "The electoral umpire had on July 16 published the name of Umeoji as the APGA candidate following an order by the Jigawa State High Court on June 28.\nOn July 18 justice Charles Okaa of Anambra State High Court directed INEC to publish Soludo’s name as APGA’s candidate.\nMeanwhile justice Iheka of the Imo State High Court again ordered INEC to publish Umeoji’s name.\nWhat the commission does in terms of obedience to court orders is that if a judgment comes today, the commission obeys the order, because it is the latest in time.\n“So, what the political parties have been doing, and what they are doing is that they anticipate the commission, and the moment you’re proceeding, they get court orders."
  },
  {
    "headline": "Insecurity: State Police is the Way to Go, Masari Insists",
    "summarized_story": "While decrying the growing insecurity in the country, Masari expressed concern that the number of policemen available to his state were less than 3,000 and therefore not enough to protect the citizens.\nKatsina State as of 2006 had a population of 5.6 million, even if we are growing at three per cent, what would be the population by 2021?\nSpeaking further, Masari explained that, in his state, a local government with 34 policemen, had over 300 villages and towns to secure.\nAccording to the lawmaker, the insecurity challenge plaguing the state was unimaginable, because about 32 out of the 34 LGAs in the state were now being threatened by the bandits.\nIn May, Deputy Speaker of the state, Shehu Tafoki, had also cried profusely while talking about rising insecurity in his constituency."
  },
  {
    "headline": "Zenith Bank Shows Resilience, Grows H1 Profit By 3% to N117bn",
    "summarized_story": "The Group also recorded a nine per cent growth in non-interest income from N116 billion in June 2020, to N127 billion in June 2021.\nOverall, the significant reduction in interest expense by 26 per cent and growth in non-interest income by nine per cent culminated in improved profitability.\nThe Group’s retail journey continued to deliver positive results as retail deposits grew by N38.2 billion from N1.72 trillion to N1.76 trillion year-to-date (YTD).\nAlso, the financial institution’s savings balances grew marginally by two per cent YTD to close at N1.18 trillion, from N1.16 trillion as at December 2020.\n“The bank continues to distinguish itself in the Nigerian financial services industry through superior service offerings, unique customer experience and sound financial indices."
  },
  {
    "headline": "Kachikwu: How I Recovered My Vehicle from US Authorities",
    "summarized_story": "Kachikwu denied receiving N9.7 billion in his bank account, and threatened to sue an online publication that claimed he smuggled the jaguar car to the US and was impounded.\nThe former minister made a demand of N3 billion compensation from the online publication, People’s Gazette, following the false and malicious publication.\nIt said the online newspaper had in its August 23, 2021 edition claimed that Kachikwu purchased a stolen vehicle, which was smuggled from a United Kingdom Assembly to California in the United States.\nKachikwu also debunked the claim that some N9.7 billion was found in his First Bank account, insisting that while he maintained a domiciliary account, the statement put out a false transaction of N9.7 billion inside a dollar domiciliary account.\nMeanwhile, First Bank Nigeria PlC, has faulted the accuracy of the details provided by the online publication."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "BREAKING: Femi Otedola 'Accepts' PDP’s Offer To Run Against Ambode",
    "summarized_story": "Femi Otedola, a businessman and Chairman of Forte Oil PLC, has “accepted” the offer of a governorship ticket by the Peoples Democratic Party (PDP).\nPDP offers Femi Otedola governorship ticket.\nPDP offers Femi Otedola governorship ticket.\nAnd I am sure you feel the same way because we all envision a better Lagos, a Lagos of our dreams.\nI ask you to believe again and together, let’s achieve more,” Governor Ambode said."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "Osinbajo: Like Mandela, leaders must be ready to risk their popularity to promote peace",
    "summarized_story": "Vice-President Yemi Osinbajo says Nigerian leaders must be ready to risk their popularity — like Nelson Mandela, South Africa’s first black president — to promote peace in the country.\n“We can all talk nicely and say the right things, but unless people are prepared to make some concessions which may cost them popularity within their own group, we cannot move forward.\n“These are stories of people who are not only political or religious leaders but just ordinary people, doing the right thing.\nUnless we are prepared to not just talk about it but to make an open display, first of all, of those who are doing the right things.\nAdvertisement“But more importantly, challenging our leaders to say the right things and to be prepared to risk some popularity in order to do so, then we will just be wasting a lot of time.”"
  },
  {
    "headline": "Osinbajo: Like Mandela, leaders must be ready to risk their popularity to promote peace",
    "summarized_story": "Vice-President Yemi Osinbajo says Nigerian leaders must be ready to risk their popularity — like Nelson Mandela, South Africa’s first black president — to promote peace in the country.\n“We can all talk nicely and say the right things, but unless people are prepared to make some concessions which may cost them popularity within their own group, we cannot move forward.\n“These are stories of people who are not only political or religious leaders but just ordinary people, doing the right thing.\nUnless we are prepared to not just talk about it but to make an open display, first of all, of those who are doing the right things.\nAdvertisement“But more importantly, challenging our leaders to say the right things and to be prepared to risk some popularity in order to do so, then we will just be wasting a lot of time.”"
  },
  {
    "headline": "NCDC records 63 deaths in one week as suspected cholera fatalities exceed 2,000",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says the death toll from suspected cholera infections across the country currently stands at 2,035.\nAdvertisementThe agency said 11 states and the federal capital territory (FCT) reported 3,098 additional suspected cases of cholera infections for the reporting week.\nBauchi, Katsina and Zamfara states accounted for 73.9 percent of the suspected cases reported in week 33.\n“Twenty-three states and FCT have reported suspected cholera cases in 2021.\nThe agency, however, added that there has been a 44 percent decrease in the number of suspected cases in week 33, compared to the previous week."
  },
  {
    "headline": "NCDC records 63 deaths in one week as suspected cholera fatalities exceed 2,000",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says the death toll from suspected cholera infections across the country currently stands at 2,035.\nAdvertisementThe agency said 11 states and the federal capital territory (FCT) reported 3,098 additional suspected cases of cholera infections for the reporting week.\nBauchi, Katsina and Zamfara states accounted for 73.9 percent of the suspected cases reported in week 33.\n“Twenty-three states and FCT have reported suspected cholera cases in 2021.\nThe agency, however, added that there has been a 44 percent decrease in the number of suspected cases in week 33, compared to the previous week."
  },
  {
    "headline": "CBN picks Bitt Inc., Barbados-based startup, as technical partner for eNaira rollout",
    "summarized_story": "The Central Bank of Nigeria (CBN) says it has engaged Bitt Inc, a global fintech company, as the technical partner for its digital currency, eNaira.\nAdvertisementBitt is a Barbados-based startup that led the development of the Eastern Caribbean Currency Union’s “DCash” — the first digital cash issued by a currency union central bank.\nEmefiele listed the benefits of the Central Bank Digital Currency (CBDC) to include increased cross-border trade, accelerated financial inclusion, cheaper, and faster remittances.\nLast month, the apex bank said it will launch the pilot scheme of eNaira by October 1, 2021.\nAdvertisement“In choosing Bitt Inc, the CBN will rely on the company’s tested and proven digital currency experience, which is already in circulation in several Eastern Caribbean Countries,” the statement reads."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How customer loyalty is helping Nigerian fintech apps through regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nGet the best African tech newsletters in your inboxBeyond offering financial products with attractive investment returns, the startups have invested in building a customer trust and loyalty bank.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "Obaseki celebrates former RATTAWU Deputy President, Hon. Edekere at 70 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with former Deputy National President of Radio, Television and Theatre Workers Union (RATTAWU), Hon.\nOsamudiamen Edekere at Diocese of Benin, Anglican Communion, St. Matthew’s Cathedral, Benin City, Edo State.\nOsaigbovo Iyoha, described Edekere as a foremost Edo politician, commending his role in his victory in the September 19, 2020 gubernatorial poll.\nObaseki noted: “Hon Edekere is one of our foremost leaders from the Governor’s Oredo Local Government Area.\nWe pray God keeps him in good health as he celebrates many more years to come.”Edekere served as President, Bendel State Council of Radio, Television and Theatre Workers Union (RATTAWU) from 1981 to 1983 and the Deputy National President of RATTAWU (1983-1983)."
  },
  {
    "headline": "Benin River Port critical to Nigeria’s economy – Obaseki … NIMASA expresses readiness to support project – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the Benin River Port project is critical and strategic to Nigeria’s economy, noting that the state government is willing to partner with the Nigerian Maritime Administration and Safety Agency, (NIMASA) to bring the project to reality.\nHe said Edo State is very unique in its ecology, which spans swamp, rain forest, and savanna planes, noting, “There is nothing we cannot grow here.\nThe global economy is going to be driven by other factors outside the traditional crude oil or the fuel economy that we are used to.\nJamoh acknowledged that the Benin River Port project is a testament that Edo understands the benefits of shipping and expressed readiness to ensure the state explores the opportunities of the blue economy.\nHe noted that the NIMASA was ready to sponsor indigenes of the state to Greece on fully-funded scholarship to study Maritime Science."
  },
  {
    "headline": "There were prophecies that came before 21st Olu was crowned – Chief Mene – Nigerian Observer",
    "summarized_story": "In this interview, BETTY IDIALU speaks with Chief Brown Mene, the Ogwaolusan of Warri kingdom, who was also a member of the Olu Advisory Council .\nI know God will ask them that’s why I pray for them that they should repent before it is too late.\nHowever, this opportunity has made the 21st Olu to be crowned with a golden crown.\nThey had thought that they would withhold the progression of the advancement of the Warri Kingdom, but the way things have turned out, it is a progression.\nSir, Chief Ayiri Emami has been hammering on the fact that the present Olu was rejected by the Oracle in 2015."
  },
  {
    "headline": "Weightlifting boss targets doping-free federation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe caretaker committee chairman of the Nigeria Weightlifting Federation (NWF) Ibrahim Abdul has stated that it is the plan of the committee to have a doping-free sport in the nearest future.\nAbdul who was represented by board member, Lawrence Iquaibom, at a seminar organised by the federation with the theme “The Menace of Doping in Sports”, held at the VIP Lounge of the Godswill Akpabio International Stadium, Uyo, said building a federation devoid of doping remained a target of the board.\n“As soon as this committee was inaugurated, the chairman mentioned specifically in one of our meetings two months ago that we were going to try to educate our athletes, our coaches and our referees so that they can come at par with what is obtainable globally.\n“That is why when we decided to put up this competition, we decided to put up this together, which is athletes and officials in the area of doping in sports, because it is a teamwork.”“We need to work together as a team in order to eradicate this ugly incident in weightlifting”.\nThe chairman added that incidents of the past made the seminar timely."
  },
  {
    "headline": "Residents flee as terrorists attack Borno community",
    "summarized_story": "The report also stated that residents, mostly civilians escaped into the bush while humanitarian workers were seen moving towards the Cameroon border.\nThe latest attack on Rann comes on the heels of massive surrendering by some of the terrorists.\nGovernor Babagana Zulum said apart from the 3,000 terrorists currently in the custody of government, another 900 confirmed members of Boko Haram had surrendered to the Cameroonian forces.\nMeanwhile, community leaders have agreed to the return of repentant Boko Haram terrorists into their communities.\nTwo of the abductees were later killed by the Boko Haram."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Dangote Tasks Journalists On Professionalism, High Ethical Standard",
    "summarized_story": "Idowu Olakunle, AbeokutaPresident of the Dangote Group, Alhaji Aliko Dangote, has tasked media practitioners on professionalism and high ethical standard in the discharge of their duties as watchdogs of the society.\n“Without using social media functionally, some of us will soon be irrelevant in the media profession.\nWith social media, some of us can be bigger brands than the companies we work for.\nThere is more to social media than social, its a professional tool for the new age journalist,” he declared.\n“There is more to social media than sharing your content, you need to engage with content of others."
  },
  {
    "headline": "Shun Negligence in Discharge of Your Accounting Duties – Osun L.G.S.C, Boss, Adedeji Charges L.G. Accountants",
    "summarized_story": "By Sunday Oguntuyi OsogboAccountants in the Local Government service have been admonished to display utmost integrity, honesty and avoid negligence while discharging their duties.\nChairman, Osun State Local Government Service Commission, Elder Tunde Adedeji, gave the advise today while declaring open a 2-day workshop titled “Placement and Preparation of Salaries and Leave Bonuses of Local Government Employees,” held at the Local Government Service Commission Multi-purpose Hall, Osun State.\nElder Adedeji opined that keeping and interpreting financial reports accurately will, in no small measure, assist in the running of local government councils efficiently.\nSpeaking earlier, the Coordinating Director of the agency Bar.\nHe emphasised that having wrong mentality and approach in financial practices can lead to crisis."
  },
  {
    "headline": "Nasarawa gov, Abdullahi Sule dissolves cabinet",
    "summarized_story": "Nasarawa State governor, Abdullahi Sule on Monday, dissolved the state’s cabinet, sacking all his Commissioners, Senior Special Advisers and Special Assistants.\nThe governor who announced the dissolution of the state executive council’s shortly after an executive council meeting, thanked the commissioners and the aides for their sacrifices and contributions to the successes recorded by his administration.\nThe dissolution has finally laid to rest rumours of eminent cabinet dissolution that had been making the rounds.\nThe governor, is however, expected to re-appoint some of the sacked members of the cabinet."
  },
  {
    "headline": "First Bank sponsors Duke of Shomolu production, as Aremu and Awo takes centre stage",
    "summarized_story": "First Bank of Nigeria Limited has announced its sponsorship of ‘A Deep Dive Into History’, a theatre production from the Duke of Shomolu (DOS) Production House, spearheaded by Joseph Edgar.\nAremu is a powerful depiction of the life and times of Chief Olusegun Obasanjo GCFR.\nAremu is a rich cultural play that preaches hope to the audience, that they can be whoever they want to be.\nThe DOS production is a leading brand in the Performing Arts sector in Nigeria and was established in 2018.\nIn addition, with this initiative and other sponsored events, FirstBank is committed to strengthening its contribution to the development of the entertainment industry in the country."
  },
  {
    "headline": "Na’Allah’s Son Murder, Tragic Chapter In Our Security Challenges – Buhari",
    "summarized_story": "President Muhammadu Buhari has expressed “deep sorrow” following the killing of Captain Abdulkareem, the first son of Senator Bala Ibn Na’Allah in Kaduna.\n“The death of Abdulkareem is another tragic chapter in our current security challenges, but I reassure Nigerians that my commitment to protect the lives and property of all Nigerians remains unwavering,” the President in a statement by Presidential spokesman, Garba Shehu, on Monday.\n“I’m saddened by the tragic loss of Abdulkareem and other victims of violence and I wish to appeal to Nigerians to help our security agencies with intelligence in order to track down and bring these terrorist gangs to justice,” he further stressed.\nADVERTISEMENTAccording to President Buhari, “human intelligence is essential to the efforts to defeat these criminals; those who work as informants for criminals are destroying their own communities for the sake of pitiful financial gratification.”The President prayed to Almighty Allah to repose the soul of the late Abdulkareem and give Senator Bala Na’Allah and his family as well as their friends the strength to bear the “very painful loss.”"
  },
  {
    "headline": "Na’Allah’s Son Murder, Tragic Chapter In Our Security Challenges – Buhari",
    "summarized_story": "President Muhammadu Buhari has expressed “deep sorrow” following the killing of Captain Abdulkareem, the first son of Senator Bala Ibn Na’Allah in Kaduna.\n“The death of Abdulkareem is another tragic chapter in our current security challenges, but I reassure Nigerians that my commitment to protect the lives and property of all Nigerians remains unwavering,” the President in a statement by Presidential spokesman, Garba Shehu, on Monday.\n“I’m saddened by the tragic loss of Abdulkareem and other victims of violence and I wish to appeal to Nigerians to help our security agencies with intelligence in order to track down and bring these terrorist gangs to justice,” he further stressed.\nADVERTISEMENTAccording to President Buhari, “human intelligence is essential to the efforts to defeat these criminals; those who work as informants for criminals are destroying their own communities for the sake of pitiful financial gratification.”The President prayed to Almighty Allah to repose the soul of the late Abdulkareem and give Senator Bala Na’Allah and his family as well as their friends the strength to bear the “very painful loss.”"
  },
  {
    "headline": "Residents Flee As Terrorists Overrun Military Base In Borno",
    "summarized_story": "Residents of Rann in Kalabalge local government area of Borno State on Monday reportedly fled their homes after suspected Islamic State West Africa Province (ISWAP) terrorists attacked a Military base in the area.\nAccording to fleeing residents, the fighters who came in large number are allowing civilians pass while trapping humanitarian workers in the town.\nHumanitarian workers are trapped while others are hibernating outside the community.”According to reports, many humanitarian workers have taken to the bush moving towards the Cameroon border trying to find their way out and avoiding the militants.\n“They burnt down the military base and some vehicles.\nThe military has not issued any statement with regards to the attack as at the time of filing this report."
  },
  {
    "headline": "Residents Flee As Terrorists Overrun Military Base In Borno",
    "summarized_story": "Residents of Rann in Kalabalge local government area of Borno State on Monday reportedly fled their homes after suspected Islamic State West Africa Province (ISWAP) terrorists attacked a Military base in the area.\nAccording to fleeing residents, the fighters who came in large number are allowing civilians pass while trapping humanitarian workers in the town.\nHumanitarian workers are trapped while others are hibernating outside the community.”According to reports, many humanitarian workers have taken to the bush moving towards the Cameroon border trying to find their way out and avoiding the militants.\n“They burnt down the military base and some vehicles.\nThe military has not issued any statement with regards to the attack as at the time of filing this report."
  },
  {
    "headline": "NACCIMA Fetes Diplomatic Community In Abuja Tuesday",
    "summarized_story": "The Nigerian Association of Chambers of Commerce, Industry, Mines and Agriculture (NACCIMA) would be hosting members of the Diplomatic Community to a lunch on Tuesday, August 31, 2021.\nIn a statement signed by the Director General of NACCIMA, Ambassador Ayoola Olukanni, at the weekend, the event is to formally introduce Ide John Udeagbala, the newly inaugurated National President of NACCIMA, and also provide an opportunity to strengthen business relations with the diplomatic community.\nAt the inauguration held in Aba, Abia State, Dele Oye esq was installed as the 1st National Deputy President, while Alh.\nJani Ibrahim emerged as the 2nd Deputy President.\nNACCIMA champions the course of business through its advocacy role and influences public policies that promote free enterprise."
  },
  {
    "headline": "Unilag graduate who hawked mangoes gets six PhD scholarship offers abroad",
    "summarized_story": "A Nigerian, Onyeka Chukwudozie, has been offered six doctorate scholarship offers from universities in Australia and California.\nAccording to him, the scholarship offers came after he had been rejected by universities over the years.\nOf the offers he got, the scholar chose to study Biological sciences (virology) at the University of California, San Diego.\nI am starting my PhD in Biological Sciences (virology) programme here at one of the most prestigious schools in the world UC San Diego (University of California, San Diego).\n“That same boy today gained a total of six PhD scholarships, which include University of California San Diego, Rice University, Two offers from Purdue University, University of Kansas and University of Melbourne, Australia."
  },
  {
    "headline": "Unilag graduate who hawked mangoes gets six PhD scholarship offers abroad",
    "summarized_story": "A Nigerian, Onyeka Chukwudozie, has been offered six doctorate scholarship offers from universities in Australia and California.\nAccording to him, the scholarship offers came after he had been rejected by universities over the years.\nOf the offers he got, the scholar chose to study Biological sciences (virology) at the University of California, San Diego.\nI am starting my PhD in Biological Sciences (virology) programme here at one of the most prestigious schools in the world UC San Diego (University of California, San Diego).\n“That same boy today gained a total of six PhD scholarships, which include University of California San Diego, Rice University, Two offers from Purdue University, University of Kansas and University of Melbourne, Australia."
  },
  {
    "headline": "Photo: DSS releases eight of 12 detained Igboho’s aides",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Photo: DSS releases eight of 12 detained Igboho’s aides",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Boko Haram members should be encouraged to surrender -Senate President",
    "summarized_story": "The Senate President, Ahmad Lawan, said on Monday that more Boko Haram members should be encouraged to surrender.\nHe said the news that the terrorists are coming out of their trenches to surrender to Nigerian troops is “a welcome development”.\nLawan stated this in Maiduguri, Borno State at the Palace of Shehu of Borno, Abubakar El-Kanemi, according to a press statement on Monday.\n“The recent surrender by Boko Haram elements is a good development for the security of this country.\n“And I want to assure you, Your Royal Highness, that the National Assembly and particularly the Senate will work very closely with the Borno State Government in this respect."
  },
  {
    "headline": "We are ready to help Nigeria identify sponsors of Boko Haram",
    "summarized_story": "The United States Ambassador to Nigeria, Mary Leonard says her country is ready to partner Nigeria to identify the sponsors of Boko Haram and extremism in the country.\nLeonard said partnering Nigeria to identify sponsors of Boko Haram was something the U.S. was very eager to do.\nLeonard, however, said that the induction of the A-29 Super Tucanos, was a significant milestone in the US.-Nigerian bilateral relations.\nShe added that the U.S. had remained committed to support Nigeria fight insecurity.\nLeonard said the U.S. government was also committed to supporting democracy and economic programmes of the government through the embassy."
  },
  {
    "headline": "South African Anderson fires 49 aces in first round win",
    "summarized_story": "South African Kevin Anderson fired down 49 aces to defeat Czech Jiri Vesely 7-6(1) 4-6 3-6 7-6(5) 7-6(4) in the first round on Monday, stunning spectators at the U.S. Open.\nThe 6’8″ power server rattled off 17 aces in the final set alone, the last one coming on match point.\nHe broke into wide grin in his moment of triumph before hoisting his arms aloft.\nWhile his ace tally was well short of John Isner’s record of 113, which he achieved during his 11-hour five-minute first-round win at Wimbledon in 2010, it nonetheless earned a standing ovation from the crowd packed into one of Flushing Meadows’ outside courts.\nAnderson, the runner-up in 2017, faces 11th seed Diego Schwartzman of Argentina in the second round."
  },
  {
    "headline": "JUST IN: New militant group emerges in South East, kill officers",
    "summarized_story": "A new militant group, ‘Biafran Motherland Warrior’, has emerged in the South East.\nA new video, which has gone viral, showed the group attacking security agents in Mbaise.\nIt was gathered that the people of the area had raised the alarm about the activities of the group.\nThough not much is known about them, they are said to be targeting security agents.\nThe Police Public Relations Officer, CSP Mike Abattam, was not available for comments as his phone rang unpicked."
  },
  {
    "headline": "BREAKING: Detained Associates Of Sunday Igboho Released",
    "summarized_story": "Eight detained aides of Sunday “Igboho” Adeyemo have been released to their lawyers, News Direct can report.\nThe aides were released to their lawyer on Monday following threats of filing a contempt lawsuit against the security agency, News Direct gathered.\nThe lawyer had previously given the DSS an ultimatum to free the jailed aides, who were arrested at Mr. Adeyemo’s house, also known as Sunday Igboho.\nRecall that on July 23, Judge Obiora Egwuatu of the Federal High Court in Abuja ordered the DSS to bring the detainees before the court on July 29.\nHowever, just 8 of the 12 detained aides were produced by the DSS."
  },
  {
    "headline": "BREAKING: Gov Sule Sacks Commissioners, Aides",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule fired all of his commissioners, senior special advisers, and special assistants on Monday.\nSule, who announced the dissolution of the state executive council’s shortly after an executive council meeting, thanked the commissioners and the aides for their sacrifices and contributions to the successes recorded by his administration.\nThe dissolution has finally laid to rest rumours of eminent cabinet dissolution that had been making the rounds.\nSources close to the government house told Vanguard exclusively that some of the sacked members of the cabinet would be reappointed.\nOthers, according to the government house sources, include the Commissioner for Education and that of Local Government and Chieftaincy affairs."
  },
  {
    "headline": "Many Feared Dead As Boko Haram Terrorists Take Over Borno Community",
    "summarized_story": "Rann is the headquarters of Kala Balge Local Government Area of Borno state and has experienced several attacks from the insurgents.\nThe latest attack comes a few hours after Borno State leaders agreed to the return of ‘repentant’ Boko Haram terrorists into their communities.\nThe decision was taken at a stakeholders meeting on Sunday to discuss the prevailing security situation in the state.\nThe meeting was organised by the government of Borno State.\nZulum said the stakeholders’ meeting became necessary following the mixed reactions that recently trailed the mass surrender of ‘former’ Boko Haram fighters."
  },
  {
    "headline": "COVID-19: First journalist to take jab in Cross River dies as Edo records more new cases, deaths",
    "summarized_story": "The Edo state COVID-19 Task Force Monday said the state has recorded seven deaths from COVID-19-related pandemic.\nJust recently, Governor Godwin Obaseki said there won’t be a gathering of religious worshippers if the people refused to get vaccinated.\n“We have collected 1,624 samples in this third wave, out of which 228 are positive cases, 19 recoveries and seven deaths representing 15.\nJournalist dies in C/RiverIn a related development, the first Cross River state journalist to take the AstraZeneca vaccine, Edem Edem of Daily Post, has died.\nEdem was the Financial Secretary of the Nigeria Union of Journalists (NUJ) Cross River state Council."
  },
  {
    "headline": "At 53%, Nigeria’s borrowing sensible, responsible – FG",
    "summarized_story": "Amidst scathing criticisms trailing Nigeria’s rising debt profile, the federal government Monday explained it was borrowing “sensibly and responsibly” because the borrowed fund would be expended on proceeds-yielding infrastructure.\nSpeaking further, Hajiya Ahmed said: “We are borrowing with a very close consideration to the sustainability of the borrowing.\nThe borrowing level for Nigeria today is still 23 percent of the GDP.\n“The second-quarter growth of 2021 would have been much stronger than the 5.01 percent, but for agriculture, that recorded a slightly lower growth.\nThe CAN leader further stated that “the name Nigeria shall be respected everywhere."
  },
  {
    "headline": "Pictures: Plateau govt distributes relief materials to Jos victims’ attack",
    "summarized_story": "Governor Simon Lalong of Plateau state on Monday distributed relief materials to surviving victims of attack in Jos local government areas.\nRepresented by the his deputy Prof.\nSunny Tyoden, the governor assured the victims of continued support."
  },
  {
    "headline": "50 civil servants shortlisted for Oxford Leadership Programme -NigPilot",
    "summarized_story": "50 public servants selected to participate in the University of Oxford Leadership Programme, have received a commendation from the Head of Civil Service of the Federation, Dr, Folashade Yemi-Esan.\nThe AIG Public Leaders Programme, PLP, is offered in partnership with the Blavatnik School of Government, University of Oxford, after a rigorous and competitive process.\n“The public sector is a key driver of a nation’s economic development, and by offering this world-class executive education programme to public servants, the Aigboje Aig-Imoukhuede Foundation has shown a commendable commitment to the development of the nation.\nThe AIG PLP is a unique executive training programme designed to equip future public sector leaders with the skills and knowledge they need to run their organisations effectively.\nAccording to the Foundation, the programme will commence in September 2021 in Nigeria, while the next round of applications is slated to open in 2022."
  },
  {
    "headline": "Victor Uwaifo: Isa Yuguda mourns late music maestro -NigPilot",
    "summarized_story": "Former Governor of Bauchi State, Mallam Isa Yuguda, has expressed shock over the death of music maestro, Sir Victor Uwaifo.\nSir Uwaifo passed on at the age of 80 in Benin City, Edo State on Sunday.\nIn a Press release today in Abuja, Yuguda, a former Minister of Transport and Later Aviation described the death of Sir Victor Uwaifo, as a big loss to the entertainment industry and to the nation.\nHe recalled how Sir Uwaifo contributed significantly to the growth of the music and entertainment sectors in the country, which earned him several national and international awards, including the prestigious Order of the Niger, OON.\nYuguda, a frontline Chairmanship aspirant of the All Progressive Congress, APC, condoled with the family of Sir Victor Uwaifo and the good people of Edo State on the demise of the musician and urged them to bear the irreparable loss with fortitude."
  },
  {
    "headline": "APC, PDP leadership mess and entrenchment of good democratic values -NigPilot",
    "summarized_story": "Both the ruling All Progressives Congress, APC, and the major opposition party, the Peoples Democratic Party, PDP, have been enmeshed in some form of worrisome leadership crises from time immemorial.\nAbout a month later, seven members of the National Working Committee (NWC) resigned, citing Mr. Secondus’ leadership style.\nThis made the party on Wednesday adopt its Deputy National Chairman (South), Elder Yemi Akinwonmi, as acting Chairman.\nBut in one of his academic papers titled “Nigerian Politics and Fallacy of PDP – APC Semblance (Part one)”, the Director-General of Progressive Governors Forum, PGF, an umbrella body for governors elected under the platform of APC , Dr. Salihu Moh.\nThe APC Chieftain however faulted Jega for failing to provide facts to show that both APC and opposition Peoples Democratic Party, PDP, have failed Nigerians."
  },
  {
    "headline": "Experts put Nigeria’s infrastructure gap at $3trn -NigPilot",
    "summarized_story": "Research experts have estimated Nigeria’s infrastructure gap at $3 trillion, about six times the size of its annual Gross Domestic Product, GDP.\nSpeaking during a virtual meeting on the institutionalization of R&D in Infrastructure Development thematic group of the TETFund Research and Development Standing Committee, RDSC , they stressed the importance of infrastructural development to economic growth.\nUsman noted that this has widened the country’s infrastructure gap and has been a major impediment toeconomic growth.\nJaiyeola said one of the challenges facing the private sector was infrastructure, adding that the country needs funds annually to finance infrastructure if it must get out of the rocks.\nIn his remarks, the Chairman of RDSC, Prof Njidda Gadzama, who stressed the importance of infrastructure, said whatever is done in terms of development cannot be successful without infrastructure."
  },
  {
    "headline": "UPDATED: DSS Releases Eight Igboho’s Aides, Four Still In Custody",
    "summarized_story": "The Department of State Services (DSS) has released eight of the 12 aides of Yoruba Nation agitator, Sunday Adeyemo, also known as Sunday Igboho, in its custody.\nThe detained persons have been in the custody of the security agency 61 days after they were arrested by security operatives in early July.\nREAD ALSO: DSS Confirms Raid On Igboho’s House, Parades 13 Suspected Armed Yoruba Nation AgitatorsThe DSS, however, refused to release the remaining four persons, contrary to an order of the court that granted bail to the entire 12 aides of the Yoruba Nation agitator in the custody of the agency.\nThe DSS had also confirmed the arrest of 13 persons, but 12 of them were paraded at its office in Abuja.\nDespite the withdrawal, the DSS has only released eight of the 12 detained persons."
  },
  {
    "headline": "CJN Summons Heads Of Courts Over Conflicting Orders",
    "summarized_story": "The Chief Justice of Nigeria (CJN) and Chairman of the National Judicial Council, (NJC), Justice Tanko Muhammad has summoned the Chief Judges of Rivers, Kebbi, Cross River, Anambra, Jigawa and Imo State to an emergency meeting.\nThis is part of efforts to stem the recent wave of embarrassing and conflicting exparte orders emanating from judges in their jurisdictions.\nIn a letter of invitation dated 30th of August, 2021 and sighted by our judiciary correspondent, the CJN summoned the head of the concerned courts to the emergency meeting to brief him on the incessant granting of the conflicting orders on suits instituted by different political parties before the various courts.\nA part of the invitation letter reads, “My attention has been drawn to media reports to the effect that some courts of coordinate jurisdictions were granting conflicting exparte orders on the same subject matter.\nIt has become expedient for me to invite you for a detailed briefing on the development."
  },
  {
    "headline": "To Deal With Tensions, Leaders Must Make Sacrifices – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has called on leaders to make sacrifices in order to deal with tensions among people of different faiths and ethnicities in the country.\nHe stated this on Monday while receiving a delegation from the Muslim Public Affairs Centre (MPAC) – led by its Executive Chairman Mr Disu Kamor – at the Presidential Villa in Abuja.\n“There is a need to understand first of all, that there is no way that we can deal with the tensions between the faiths and ethnicities in Nigeria today unless those in leadership are prepared to make some important sacrifices,” Osinbajo said while citing the efforts of late South African leader Nelson Mandela and Imam Abubakar Abdullahi of Barkin Ladi in Plateau State.\n“Those sacrifices are sacrifices even in what you say, how you say it, and then sacrifices also in the acknowledgment of whatever people are saying and the willingness to accept.”Osinbajo also called for interfaith dialogue, emphasizing the importance of language and communication to prevent violence.\nMPAC is a non-governmental organization dedicated to the promotion of peacebuilding and interfaith cohesion, among others."
  },
  {
    "headline": "Plateau Security: Lalong Relaxes Curfew In Jos, Bassa",
    "summarized_story": "﻿Governor of Plateau State Simon Lalong has relaxed curfews imposed on parts of the state due to insecurity.\nThe Governor, in a broadcast on Monday, said the 24-hour curfew in Jos North is now to be enforced from 6pm to 6am until further notice.\n“The curfew in Jos South and Bassa is to also be further relaxed,” Lalong said.\n“We apologise for any inconveniences this postponement might cause.”‘Purely criminal’Recent attacks in Jos North, Bassa, Riyom, and Barkin Ladi have plunged Plateau into a state of high tension.\nAbout 36 people were killed last week in Yelwa Zangam village, Zangam District in Jos North Local Government Area."
  },
  {
    "headline": "Stringent Measures Against Banditry Not Intended To Hurt Zamfara Residents – Govt",
    "summarized_story": "The Zamfara State government has sought the continued support of the residents in the fight against banditry, even in the face of the stringent measures announced recently.\nIn a statement on Monday, the Commissioner for Information in Zamfara, Ibrahim Dosara, explained that the recent measures were put in place to check the activities of bandits in the state.\n“The government deemed it necessary to take these measures in view of the values it attaches to human lives and the property of the citizenry,” he said.\nAmong the measures announced by the government, last Friday was the restriction of fuel sales to the state capital and the headquarters of the local government areas of the state.\nBut the government stated that normal market activities of buying and selling for local consumptions were exempted from the ban."
  },
  {
    "headline": "US Investigates Civilian Deaths after Kabul Drone Strike Kills 10, Including 6 Children – Arise News",
    "summarized_story": "The US says its investigating civilian deaths after its drone strike near Kabul airport ended up killing 10 members of one family, including six children.\nBBC reports that the 10 family members were killed when a car parked at their home was struck by an explosion on Sunday.\nThat included one of his relatives, Ahmad Naser, who was killed in the strike and had previously worked as a translator with US forces.\nOther victims had previously worked for international organisations and held visas allowing them entry to the US.\nCentral Command had previously said the strike was successful at “eliminating an imminent” threat to Kabul’s airport."
  },
  {
    "headline": "China Limits Children to 3 Hours of Online Gaming a Week",
    "summarized_story": "China is banning children from playing online games for more than three hours a week, the harshest restriction so far on the game industry as Chinese regulators continue cracking down on the technology sector.\nThe new regulation affects some of China’s largest technology companies, including gaming giant Tencent, whose Honor of Kings online multiplayer game is hugely popular globally, as well as gaming company NetEase.\nThe gaming restrictions are part of an ongoing crackdown on technology companies, amid concerns that technology firms — many of which provide ubiquitous messaging, payments and gaming services — may have an outsized influence on society.\nChinese authorities in recent months have targeted e-commerce and online education, and have implemented new regulations to curb anti-competitive behavior after years of rapid growth in the technology sector.\nLast month, authorities banned companies that provide tutoring in core school subjects from making a profit, wiping out billions in market value from online education companies such as TAL Education and Gaotu Techedu."
  },
  {
    "headline": "Paris Limits Car Speed to 30 Km/hour in Bid to Boost Safety, Air Quality",
    "summarized_story": "The new speed limit should help reduce pollution, noise and the number of serious accidents, he said.\nThe 30 kph limit already applies to about 60% of the Paris area but will now cover the entire city.\nHowever, a few major thoroughfares such as the Champs Elysees will be exempt, with the speed limit remaining at 50 kph.\nCity hall has said police will be lenient in applying the new speed limit in the first weeks.\nOther French cities with a 30 kph speed limit include Bordeaux, Strasbourg and Toulouse."
  },
  {
    "headline": "Nigeria’s Chief Justice Summons Top Judges of Six States Over Conflicting Court Orders – Arise News",
    "summarized_story": "The Chief Justice of Nigeria, CJN, Justice Ibrahim Tanko Muhammad has summoned six Chief Judges in the country to an emergency meeting over conflicting court orders emanating from their states in the last one month.\nJustice Mohammed who is also the Chairman of the National Judicial Council, NJC, issued the summons to the Chief Judges of Rivers, Kebbi, Cross River, Anambra, Jigawa and Imo State.\nThe summons obtained by ARISE News indicated that the affected Chief Judges are to appear before the NJC to explain what warranted the issuance of conflicting orders by courts of coordinate jurisdiction.\n“My attention has been drawn to media reports to the effect that some courts of coordinate jurisdictions were granting conflicting exparte orders on the same subject matter,” a part of the invitation letter reads.\nThis is even more compelling having regard to an earlier NJC warning to judicial officers on the need to be circumspect in grating exparte applications.”By Abel Ejikeme"
  },
  {
    "headline": "Zambian President Sacks Army and Police Chiefs",
    "summarized_story": "Newly sworn-in Zambian President Hakainde Hichilema has replaced the country’s top military commanders and the head of the police – and signalled a focus on the security forces being more accountable to the citizens.\nThe president late on Sunday announced new commanders of the Zambian army, the air force and the national service and their deputies, as well as a new inspector general of police.\nHe said the police must carry out proper checks before detaining suspects and that “no one should be arrested before investigations are concluded”.\nMr Hichilema, who was voted in as president earlier this month in a landslide victory, has been the victim of police brutality in the past.\nHe has been arrested and detained multiple times in the past – and had promised to deal with the heavy-handedness of the security forces."
  }
]