[
  {
    "headline": "Gunmen burn INEC headquarters, attack police station in Anambra",
    "summarized_story": "The Police in Anambra State have confirmed attacks on the state headquarters of the Independent National Electoral Commission and Police B’Division in Awka, the State capital on Sunday night.\nHe said, “Please, I will get back to you as soon as I get the full details.”Gunmen had around 9pm on Sunday invaded B Division Police Station and the INEC office in Awka.\n“The gunmen set the police station and INEC office ablaze.\nIt was gathered the gunmen invaded the area in three Hilux vehicles.\nThey then stopped at Ekwueme Square and shot for about 10 minutes before proceeding to the INEC Office which they set on fire,” the eyewitness added."
  },
  {
    "headline": "Malami, Ahmed, Emefiele appear before Reps today over looted assets probe",
    "summarized_story": "THE House of Representatives has invited ministries, departments and agencies of the Federal Government as well as top officials, the private sector and civil society organisations to explain the status of looted funds and public assets recovered in the last 18 years.\nChairman of the committee, Mr Adejoro Adeogun, had last week laid an interim report by the committee.\nAmong those to appear before the committee on Monday are the Minister of Justice and Attorney General of the Federation, Abubakar Malami (SAN); Minister of Finance, Budget and National Planning, Zainab Ahmed; National Security Adviser, Major-General Babagana Monguno (retd.\n); Accountant General of the Federation, Ahmed Idris; and the Auditor General of the Federation, Adolphus Aghughu.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Treat military plane crashes as national emergency, CAN tells Buhari",
    "summarized_story": "Kindly Share This Story:The Christian Association of Nigeria, CAN yesterday asked President Muhammadu Buhari to declare military plane crashes in the country as a national emergency.\nAt least 20 military officers were killed in the three crashes.\nWe pray that this type of national tragedy will never occur again.\n“We cannot continue to lose our finest military and security officers to air disasters without treating the situation as a national emergency.\n“We must ascertain that all military aircrafts are fit to fly and that the training of the flight officers is excellent."
  },
  {
    "headline": "Lagos LG polls: I’ve no preferred candidates —Tinubu",
    "summarized_story": "In a statement by his media office, Tinubu said: “The Lagos APC Governance Advisory Council, GAC, meeting of Friday, May 21, 2021, discussed ways to ensure the fairness of the party primaries for the polls.\nREAD ALSO:“Asiwaju Tinubu would like it to be known, by way of this statement, that he has no preferred candidates for the upcoming local government primaries.\n“The APC Constitution directs that the party’s candidates should emerge through direct or indirect primaries or by consensus.\n“In this vein, Asiwaju appeals to party leaders in all the local governments to allow democracy to flourish.\nIn the Lagos APC, democracy not devious rumors must be allowed to flourish.”Vanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "Gunmen abduct 400-Level student, 3 others in Ogun",
    "summarized_story": "Kindly Share This Story:By James OgunnaikeFour persons, including a 400-Level student, were kidnapped in separate operations in Ogun State between Wednesday and Saturday.\nThe other abduction took place on a farm located at Abule Itoko village in Odeda Local Government Area of the state.\nREAD ALSO:It was also learned that the FUNAAB student, being an indigent person, had been working on that farm in the last three years to fund his education before the incident.\nThe authorities of FUNAAB said Toyinbo is a 400-Level student of Aquaculture and Fisheries Management in the institution.\nHe stated: “A 400-Level student of Aquaculture and Fisheries Management, Federal University of Agriculture, Abeokuta, FUNAAB, Toyinbo Nathaniel Olayinka, has been abducted by suspected kidnappers in a private farm at Abule, Itoko, Odeda, Ibadan Road."
  },
  {
    "headline": "Lagos Govt captures 10,000 worship centres in website",
    "summarized_story": "Kindly Share This Story:The Lagos State Commissioner for Home Affairs, Mr Anofiu Elegushi on Sunday said 10,000 religious organisations, both Christian and Muslim, were captured in the government’s website.\n”At present, the website designed for this enumeration, has over 10,000 data of both Muslim and Christian organisations across the state,” Elegushi said.\n”I am happy to report that in the last two years, the state has enjoyed tremendous religious’ harmony and peaceful co-existence.\nElegushi said as part of measures to ensure a successful pilgrimage, intending pilgrims were screened both administratively and medically, with COVID-19 vaccine administered to them.\nOn the readiness for 2021 Pilgrimage exercise by intending Christian pilgrims, Elegushi said the Permanent Secretary in the ministry, led a 6-man delegation to Jordan, ahead of the proposed May 2021 pilgrimage."
  },
  {
    "headline": "Insurgency: Attahiru would’ve made Nigeria proud — Buratai",
    "summarized_story": "Attahiru and 10 military officers lost their lives in an air crash near Kaduna International Airport on Friday.\nAmin.’’5 generals on consideration for COAS replacementAlso, indications emerged weekend that five major Generals were being considered to replace the late Chief of Army Staff, Lt. General Ibrahim Attahiru.\n“It should be noted that the postponement became necessary as the late Army Chief was one of the major stakeholders that would have taken part in the summit.\nHe said: “The entire Christian Youths in Nigeria are grieved by the death of the Chief of Army Staff, Lt. General Ibrahim Attahiru and other military officers.\nIt could be the President, a governor, Senator, military officers or ordinary citizens."
  },
  {
    "headline": "Why we honoured Gov. Ugwuanyi as ‘COVID-19 Response Champion’",
    "summarized_story": "The Association of Medical Laboratory Scientists of Nigeria (AMLSN) said it honoured Governor Ifeanyi Ugwuanyi of Enugu State with the ‘COVID-19 Response Champion’ award, in recognition of his sterling performance and discharge of duties during the peak period the COVID-19 pandemic ravaged the world.\n“Your Excellency (Ugwuanyi), we did not choose you just for the sake of choosing you.\nWe chose you because we carefully monitored your administration’s activities and response rate in the heat of the pandemic.\n“We monitored how you deployed resources swiftly, trained and motivated health workers and enlightened the public.\n“We wish to encourage you to keep showing diligence to duty and demonstrating great empathy to people’s safety”, AMLSN’s President said."
  },
  {
    "headline": "Police begins investigation into Ogun explosions as gas kills 6, injures 8",
    "summarized_story": "The Ogun State police command has commenced action on the recent gas explosions in Abeokuta, the state capital.\nAccording to the command’s spokesperson, Abimbola Oyeyemi, two gas plants suspected to have supplied the gas and the cylinders have been sealed up.\nOyeyemi told DAILY POST that samples of the gas from the plants were also taken for analysis by the Standard Organization of Nigeria(SON).\nThe police warned welders and technicians to stop using oxygen gas simultaneously with cooking gas while welding.\n“Pending the outcome of the investigation, and in order to prevent further disaster, welders throughout the state are advised to stop using oxygen gas simultaneously with liquefied petroleum gas-LPG (cooking gas), while carrying out their welding jobs,” Oyeyemi stated."
  },
  {
    "headline": "COVID-19 Scare: NCDC allegedly sends Saudi returnees to isolation centre over fake vaccine certificate",
    "summarized_story": "There was fear at the Aminu Kano International Airport as the NCDC allegedly detained some air travellers for entering the country with fake COVID-19 vaccination certificates.\nSources said the passengers arrived the Kano International Airport from Saudi Arabia at about 8:00pm on Sunday aboard Air Badr, a Sudanese airline.\nApprehension, however, began when NCDC officials while conducting checks on the passengers travelling documents discovered that nearly all COVID-19 vaccination certificates presented were fake.\nIsa Ali told our reporter that the authorities amid safety concerns banned passengers from disembarking from the airbus.\nWhen contacted, Ms Maimuna, a spokesperson for the Aminu Kano International Airport said she was not in Kano but promised to make her enquiries and revert to DAILY POST."
  },
  {
    "headline": "Presidency shares Buhari’s discussion with late General Attahiru’s wife",
    "summarized_story": "President Muhammadu Buhari has described Lt. General Ibrahim Attahiru, the late Chief of Army Staff as an outstanding soldier and an institution builder.\nThe Nigerian President said General Attahiru fought valiantly for Nigeria until he breathed his last.\nGarba Shehu, the presidential spokesman, disclosed details of Buhari’s telephone conversation with Mrs. Fati Attahiru, in a statement Sunday night.\nBuhari hailed the sacrifices of the military men who lost their lives and the Armed Forces in general.\nThe President gave the grieving spouses assurances that the nation will never forget the supreme sacrifice of their spouses."
  },
  {
    "headline": "FG declares 63 Nigerians, 27 foreigners wanted",
    "summarized_story": "Sixty-three Nigerians and 27 foreigners have been declared wanted by the federal government over violation of COVID-19 guidelines.\nThe Secretary to the Government of the Federation (SGF) and Chairman Presidential Steering Committee (PSC) on COVID-19, Boss Mustapha disclosed this Sunday night.\nMustapha said the Presidential Steering Committee had earlier in May 2021 issued a Travel Advisory for passengers arriving in Nigeria from some countries currently battling with the virus to observe seven days compulsory quarantine.\nAccording to him, some travellers who arrived Nigeria from the restricted countries recently, have violated the protocol, posing threat to health of Nigerians.\nDAILY POST reports that Brazil, India and Turkey were among the countries list due to new variant of the disease ravaging them in that part of the world."
  },
  {
    "headline": "Bello, Akanbi rule 2021 NTTF National Championships",
    "summarized_story": "By Olalekan OkusanWomen’s singles defending champion Fatimo Bello of G20 retained her title as Rilwan Akanbi of Atinuke Table Tennis Club emerge men’s singles champion at the 2021 Nigeria Table Tennis Federation (NTTF) National Championships.\nAkanbi, whose inconsistency has dropped his national rating worked his way to the top of the men’s singles after edging out title contenders like Amadi Omeh and Azeez Solanke before finally ending the unbeaten run of Taiwo Mati in the final.\nThe former Asoju Oba champion, Akanbi , had to rally from 2-0 down to beat Ondo’s Mati 4-3 (7-11, 8-11, 11-6, 11-6, 11-9, 8-11, 11-9) to the admiration of the fans at the Molade Okoya-Thomas Hall of Teslim Balogun Stadium.\nA delighted Akanbi described his win as a reward of hardwork: “I am so delighted to win this title because nobody considered me as a title contender having lost form in the last three years.”ADVERTISEMENTMeanwhile, Bello continued her reign as the best female player in the country with a convincing 4-1 (15-13, 11-9, 8-11, 11-5, 11-1) win over Bose Odusanya in the women’s singles final.\nOndo and G20 won the highest number of medals in the 12 events in the five-day championships with 18 states and 18 clubs made up of 300 players."
  },
  {
    "headline": "Olympic medallist arrested over murder case",
    "summarized_story": "Two-time Olympic wrestling medallist Sushil Kumar was arrested on Sunday, Indian police said, after a week-long manhunt over the alleged murder of a fellow athlete.\nDhankad, a former junior champion who was training as a senior wrestler, later died in hospital.\nKumar was arrested yesterday in northwest Delhi with another suspect, Delhi police said.\n“They were switching their location when they were arrested,” the police officer told AFP.\nADVERTISEMENTBut Kumar, via his lawyers, had said he was innocent and accused police of a biased investigation."
  },
  {
    "headline": "CAF Super Cup slated for bio-bubble in Qatar",
    "summarized_story": "The Total CAF Super Cup in Doha, Qatar on Friday night, 28 May 2021 will be played in a biologically safe environment (bio-bubble).\nADVERTISEMENTThe Qatari capital Doha hosted the two previous editions of the Total CAF Super Cup and will be once again the host of the annual one-match playoff.\nThe Total CAF Super Cup is an annual match between the winner of Total CAF Champions League and the winner of Total CAF Confederation Cup.\nThe first edition was held in 1993 between the winner of the African Cup of Champions Clubs (now known as the CAF Champions League) and the winner of the African Cup Winners’ Cup.\nSince 2004, it brought together the winners of CAF Champions League and CAF Confederation Cup."
  },
  {
    "headline": "Pyramids push Enyimba out of Confed Cup",
    "summarized_story": "Enyimba could only manage a stale 1-1 with Pyramids FC at the Enyimba International Stadium in Aba to crash out of the CAF Confederations Cup on 5-2 aggregate.\nHe robbed an Enyimba defender and curled a superb shot into the top corner of the net.\nEnyimba levelled the score through a goal from Iwuala Anayo five minutes before the break but Pyramids held on to seal smooth passage to the semis for a second consecutive year.\nPyramids’ Argentinian coach Rodolfo Arruabarrena gave rest a number of his regular players following the comfortable first-leg win, including error-prone goalkeeper Sherif Ekramy, who made way for former Egyptian international Ahmed El-Shennawi.\nLast year’s Confederation Cup runners-up Pyramids will face either Morocco’s Raja Casablanca or South Africa’s Orlando Pirates in the semi-final of Africa’s secondary club competition."
  },
  {
    "headline": "Yoruba APC leaders reject Oduduwa,Biafra option",
    "summarized_story": "By Vincent KaluConcerned about the state of the nation, particularly the serious security challenges facing the country, All Progressives Congress (APC) leaders in the South West met at Lagos House, Marina, yesterday.\nThe communique read in part: “We noted with significant concern the security situation in the country.\nTerrorism and violent criminality threaten many areas, adversely affecting the lives and livelihoods of too many innocent and peace-loving Nigerians.\nFor Nigeria to overcome these challenges, we must do so with unity of purpose and action.\nOthers were the National Leader of APC, Bola Tinubu; Chief Segun Osoba; Minister of Trade and Industry, Chief Niyi Adebayo; Gen Akinriade Alami (retd)."
  },
  {
    "headline": "Count me out of agitation for Yoruba nation – Akeredolu",
    "summarized_story": "From Bamigbola Gbolagunte, AkureOndo State Governor, Mr. Rotimi Akeredolu, has distanced himself from the agitation for a separate Yoruba nation, saying he does not believe in the secession agenda.\n“He neither believes nor supports the quest for the Yoruba nation outside of Nigeria in the manner canvassed.\nGovernor Akeredolu stands by a virile, united and indivisible Nigeria as demanded by the Southern Governors’ Forum.\nTherefore, the vigour, zeal, leadership and candour displayed by Governor Akeredolu for a just and fair Nigeria is altruistic and borne out of patriotism for the nation as well as love for his people, the Yoruba ethnic nationality.\nIt is important, therefore, to state without any equivocation that the Yoruba nation secessionist promoters do not enjoy any lending hand in Governor Akeredolu.”"
  },
  {
    "headline": "We must negotiate Nigeria’s unity – Cardinal Onaiyekan",
    "summarized_story": "From Uba Vikky, AbujaEmeritus Archbishop of Abuja Catholic Archdiocese, John Cardinal Onaiyekan, has said Nigeria’s unity is negotiable and that those holding contrary opinion should be disregarded.\nIf we do not talk, we might end up killing one another.”The cleric also accused the National Assembly of neglecting its duties, stating that the role of the National Assembly is to discuss pressing issues plaguing the peace of the nation and to find possible solutions.\n“Under normal circumstances, it is the National Assembly that should handle these kind of things.\nThe system is set up so that the National Assembly can challenge the government.\nBut we have reached a situation where we have a National Assembly that is proud to be a rubber stamp."
  },
  {
    "headline": "Again, herdsmen murder 5 in Taraba",
    "summarized_story": "From Sylvanus Viashima, JalingoArmed herdsmen reportedly killed five persons at Ukoo Abaa village, near Kufai Amadu, in Takum Local Government Area of Taraba State.\nMr. Paul Yade told Daily Sun on the phone that five persons were macheted to death at Ukoo Abaa village, near the Taraba/ Benue border.\n“The attackers, in their numbers, killed five persons and proceeded to the neighbouring Benue State.\nIn a communiqué signed by Alhaji Adamu Abacha (Sarkin Fulani Bali) and Zaki David Gbaa, Ter Bali II and Chairman, Taraba State Tiv Traditional Leaders Council, the groups condemned the attacks and called for a ceasefire.\nThe groups also resolved to come together, forgive one another and live in peace as brothers and sisters."
  },
  {
    "headline": "NDLEA intercepts N8bn cocaine, arrests drug kingpin at Lagos airport",
    "summarized_story": "From Godwin Tsa, AbujaOperatives of the National Drug Law Enforcement Agency (NDLEA) has arrested a Brazil based drug kingpin, Ejiofor Enwereaku, and also intercepted 36 blocks of cocaine, weighing 27.95 kilogrammes with a street value of over N8billion at the Murtala Muhammed International Airport (MMIA), Ikeja, Lagos.\nThe disclaimed bag was promptly secured by NDLEA operatives for investigation.\nOn Sunday, May 9, 2021, a man came to the airport to make inquiry on how to get the disclaimed bag released.\nThe disclaimed bag was opened in the presence of the arriving passenger and the man who came to negotiate the release of the disputed bag.\nWhen it was opened, it was found that the bag contained 36 blocks of cocaine, weighing 27.95kg."
  },
  {
    "headline": "Labour Warns NEC against Endorsing Proposed N385 Petrol Price",
    "summarized_story": "He also stated that labour will use all arsenal at its disposal to resist any attempt to increase petrol pump price.\nAlso, the Oyo State Chairman of the Trade Union Congress (TUC), Mr. Emmanuel Ogundiran, said the union would resist the proposed increment of price of petrol to N385 per litre.\nThe state Chairman of NLC, Mr.\nSimilarly, the state Chairman of the TUC, Helen Odofun, told THISDAY that any increase in fuel price would affect the economy.\n“Government has said it very clear that they have no intention to increase the price of the petrol,” he said."
  },
  {
    "headline": "NNPC: 52m Crude Oil Barrels Lost to OPEC Cuts",
    "summarized_story": "While Nigeria’s crude oil production level before the curbs was two million barrels per day (bpd), recent data from NNPC indicated that while the average daily crude oil production for the entire year stood at 1.775 million bpd, total production for the whole year was 704.741 million barrels.\nAlthough the document did not separate the quantity of crude oil produced from condensates, with a 225,000 bpd approximate under-production, at least 6.75 million bpd of crude oil was shut in to comply with the oil cartel’s agreement.\nIn June, production further reduced to 1.68 million barrels per day on the average, 1.65 million bpd in July and 1.64 million bpd in August.\nIn all, the Production Sharing Contracts (PSC) portion of the total national output took the lion’s share of oil drilled in 2020, hitting 281.1 million barrels of the total 704.7 million barrels of crude oil produced during the year.\nThe Joint Venture (JV) agreements yielded 226.5 million barrels, while the Alternative Financing (AF) sources resulted in the production of 75.2 million barrels."
  },
  {
    "headline": "Gunmen Attack Police Station, INEC, Others in Awka",
    "summarized_story": "•INEC postpones meeting with security chiefsChuks Okocha in Abuja and David-Chyddy Eleke in AwkaGunmen yesterday attacked the ‘B’ Division Police Station and the headquarters of the Independent National Electoral Commission (INEC) in Awka, Anambra State.\nA source said the gunmen first moved to INEC headquarters in the state, but were repelled by security men on duty, before they moved to ‘B’ division.\nAs at press time, there was heavy shooting by the gunmen in Awka, causing fear among residents who scampered to safety.\nINEC Postpones Meeting with Security ChiefsThe Independent National Electoral Commission (INEC) has put off its planned meeting with security chiefs.\nThe Chief Press Secretary to the INEC chairman, Mr. Rotimi Oyekanmi, said in a statement that the emergency meeting of INEC and security chiefs, earlier scheduled for today, had been postponed."
  },
  {
    "headline": "Race for New Army Chief Begins",
    "summarized_story": "However, a report by an online newspaper, PRNigeria, gathered that Ali-Keffi was not among the most senior officers in the army.\nHe is the Chief of Administration of the Nigerian Army and former Director Foreign Liaison at the Defence Agency.\nHe is the current Theatre Commander Operation in the North-east and former General Officer Commanding Officer of the 1 Division of the Nigerian Army.\nTHISDAY gathered that the utmost consideration in the appointment of an army chief is operational and intelligence experience, especially when the nation is in a state of war.\nHowever, a top military officer said some factors would be considered for the appointment of service chiefs beyond seniority."
  },
  {
    "headline": "Breaking: FG Revokes Visas of 27 Indians, Declares 63 Nigerians Persons of Interest",
    "summarized_story": "The Chairman Presidential Steering Committee (PSC) on COVID-19 and Secretary to the Government of the Federation, Mr Boss Mustapha, announced the measures against the passengers in a public statement issued on Sunday.\nHe said the violators arrived in Nigeria through the Murtala Mohammed International Airport, Lagos and Nnamdi Azikwe International Airport, Abuja between May 8 and 15, 2021.\nIn the list released by the PSC, 90 persons from Nigeria and India were found to have violated the Health Protection Regulations after arriving in Nigeria from restricted countries.\nThe PSC stated that the indiscretion of the persons of interests constituted an immediate health hazard to the society.\nIt subsequently warned the violators to report to the nearest public health departments within 48 hours for immediate evaluation."
  },
  {
    "headline": "fiancée of pilot killed in Kaduna crash pens touching tribute",
    "summarized_story": "Bunmi Oladuntoye, fiancée of Taiwo Olufemi Asaniyi, the pilot who flew the military aircraft that crashed in Kaduna state, has penned a touching tribute to her late lover.\nThe deceased and Oladuntoye were said to have scheduled their wedding for October later in the year before the tragic incident.\nAdvertisementShe also described the late flight lieutenant as a man of charming personality who brought her happiness and also encouraged her.\nTo Nigerians and the world at large, my fiancé, flight lieutenant to Asaniyi was a great man who dedicated his life to serving this country,” she added.\n“To Nigerians and the world at large, my fiancé flight lieutenant to Asaniyi was a great man who dedicated his life to serving this country."
  },
  {
    "headline": "fiancée of pilot killed in Kaduna crash pens touching tribute",
    "summarized_story": "Bunmi Oladuntoye, fiancée of Taiwo Olufemi Asaniyi, the pilot who flew the military aircraft that crashed in Kaduna state, has penned a touching tribute to her late lover.\nThe deceased and Oladuntoye were said to have scheduled their wedding for October later in the year before the tragic incident.\nAdvertisementShe also described the late flight lieutenant as a man of charming personality who brought her happiness and also encouraged her.\nTo Nigerians and the world at large, my fiancé, flight lieutenant to Asaniyi was a great man who dedicated his life to serving this country,” she added.\n“To Nigerians and the world at large, my fiancé flight lieutenant to Asaniyi was a great man who dedicated his life to serving this country."
  },
  {
    "headline": "Buhari calls Attahiru's wife, says late army chief was an outstanding soldier",
    "summarized_story": "President Muhammadu Buhari has condoled with Fati, wife of late Ibrahim Attahiru, chief of army staff, via a telephone call.\nAdvertisementAttahiru and 10 other military officers died in an air crash near the Kaduna international airport on Friday.\nIn a statement on Sunday, Garba Shehu, presidential spokesman, said the president described the army chief as an outstanding soldier who fought valiantly for Nigeria until his death.\nAdvertisement“President Muhammadu Buhari has described Lt. General Ibrahim Attahiru, the late Chief of Army Staff as an outstanding soldier and an institution builder, who fought valiantly for Nigeria until he breathed his last,” Shehu said in the statement.\n“Mrs Attahiru, on behalf of the rest of the families, thanked the President for the love and care he has shown to them,” Shehu said."
  },
  {
    "headline": "Buhari calls Attahiru's wife, says late army chief was an outstanding soldier",
    "summarized_story": "President Muhammadu Buhari has condoled with Fati, wife of late Ibrahim Attahiru, chief of army staff, via a telephone call.\nAdvertisementAttahiru and 10 other military officers died in an air crash near the Kaduna international airport on Friday.\nIn a statement on Sunday, Garba Shehu, presidential spokesman, said the president described the army chief as an outstanding soldier who fought valiantly for Nigeria until his death.\nAdvertisement“President Muhammadu Buhari has described Lt. General Ibrahim Attahiru, the late Chief of Army Staff as an outstanding soldier and an institution builder, who fought valiantly for Nigeria until he breathed his last,” Shehu said in the statement.\n“Mrs Attahiru, on behalf of the rest of the families, thanked the President for the love and care he has shown to them,” Shehu said."
  },
  {
    "headline": "Kaduna crash: Buhari directs flags to fly at half-mast for three days",
    "summarized_story": "President Muhammadu Buhari has ordered flags to be flown at half-mast in honour of Ibrahim Attahiru, the chief of army staff, and 10 other officers who died in an air crash in Kaduna.\nAdvertisementThe 11 officers were on board a military aircraft which crashed near the Kaduna international airport on Friday.\nThe officers were buried at the national military cemetery in Abuja on Saturday.\nAdvertisementAccording to a statement issued on Sunday by Boss Mustapha, secretary to the government of the federation, the directive on the flags is to be carried out in all public buildings and official residences for three days.\n“Similarly, the President has also approved a work-free day for members of the Armed Forces on Monday, 24th May, 2021.”"
  },
  {
    "headline": "NCC plans to deploy Device Management System to prevent phone theft",
    "summarized_story": "Two weeks after the Nigerian Communications Commission (NCC) said it had issued 54 million people their national identity numbers, it is in the process of deploying a Device Management System (DMS).\nA Device Management System will take this step even further, allowing the government even more access to what should be private information.\nWhen there’s a central registry for IMEI, the police could identify the owners of lost and stolen phones thousands of times daily.\nA critical part of this paper argues for a central database of mobile phones that law enforcement agencies presumably can access.\n*An earlier version of this report stated that the NCC asked telcos to register the IMEI numbers of their subscribers; the NCC has now clarified its position"
  },
  {
    "headline": "How to build high-performance teams with Chichi Offodile and Seni Sulyman",
    "summarized_story": "In what can be termed a mini-MBA session, Seni Sulyman and Chichi Offodile in an edition of TechCabal Live shared expert advice on how to build high-performance teams.\nTheir Journey at Helium Health and AndelaThe conversation begins with Chichi and Seni talking about their journeys at Helium Health and Andela respectively.\nHer strength lies in figuring out how to build a sustainable company and that’s what she set out to do via a transformation plan.\nBoth Seni and Chichi believe that it starts with hiring people with the potential to be high achievers and then setting a good example as a leader.\nHe ends with a caveat – it’s a little difficult to build a high-performing team without working really hard."
  },
  {
    "headline": "Stax wants you to enjoy USSD with better design, without ever dialling codes again",
    "summarized_story": "—Most people who started using mobile phones in the 2000s became familiar with USSD through loading and checking airtime balance.\nMaking USSD smartStax is a mobile app currently available only to Android users in 10 countries, including Nigeria, Uganda, Kenya and Tanzania.\nWhen a user gives Stax access, the app activates a screen reading functionality and acts as a web browser.\nStax wants the app to be under 10MB so that it will work easily on every (Android) phone.\nWith a large user base, Stax could begin enabling discovery and access to third party services, in what could make Stax a super app of sorts."
  },
  {
    "headline": "Are you ready to Branch in?",
    "summarized_story": "Here are a few more things that sets Branch apart from both your regular banking and other financial apps.\nBonus programs: Most financial apps have some form of bonus program but none of them is like Branch.\nWhereas other financial apps pay one-time bonuses for referrals, Branch pays you N500 when friends you refer pay up their first loan.\nThe money part: Branch gives you up to N500,000 in loans within seconds of applying on the app.\nClearly, Branch offers you more flexibility and a lot more profit than other financial apps."
  },
  {
    "headline": "Founders of TradeDepot selected as Endeavor Entrepreneurs",
    "summarized_story": "Fast-growing retail distribution platform in Africa joins the leading global entrepreneur support organizationLagos, May 20 — Endeavor Nigeria has welcomed three new entrepreneurs into its global network.\nOnyekachi Izukanne, Michael Ukpong, and Ruke Awaritefe, the co-founders of TradeDepot, were selected as Endeavor Entrepreneurs on May 18, 2021, at the 15th Virtual International Selection Panel (v-ISP #15).\nThe Endeavor network includes some of the world’s most exciting scale-up entrepreneurs and most experienced mentors and investors.\nTo date, Endeavor has screened more than 60,000 individuals and selected more than 2,000 founders leading over 1,200 scale-up companies.\nIn Nigeria, we aim to select 4-6 companies a year and today there are 19 Endeavor Entrepreneurs who are leading 11 companies in the portfolio."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Safaricom consortium gets Ethiopia’s first private national telecoms licence",
    "summarized_story": "Nearly three years after Ethiopia’s Prime Minister, Abiy Ahmed, announced plans to open up the country’s telecommunications sector, a new nationwide telecom licence has been granted to the Global Partnership for Ethiopia.\nThe consortium — which includes Vodafone, Vodacom, Safaricom, Sumitomo Corporation, and the CDC Group — with a bid offering of $850 million beat MTN’s coalition to acquire Ethiopia’s first private national telecom licence.\nRecall that in February 2021, the Ethiopian Communications Authority (ECA) had denied Safaricom’s claims to have been shortlisted on a list of bidders for an operator’s licence.\nThe country’s Council of Ministers still plans to issue another licence and have unanimously decided to expedite tasks that would enable the issuance of the second licence.\nWhile Safaricom and its fellow telcos may have to tread with caution, the country is set to benefit greatly."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Safaricom consortium gets Ethiopia’s first private national telecoms licence",
    "summarized_story": "Nearly three years after Ethiopia’s Prime Minister, Abiy Ahmed, announced plans to open up the country’s telecommunications sector, a new nationwide telecom licence has been granted to the Global Partnership for Ethiopia.\nThe consortium — which includes Vodafone, Vodacom, Safaricom, Sumitomo Corporation, and the CDC Group — with a bid offering of $850 million beat MTN’s coalition to acquire Ethiopia’s first private national telecom licence.\nRecall that in February 2021, the Ethiopian Communications Authority (ECA) had denied Safaricom’s claims to have been shortlisted on a list of bidders for an operator’s licence.\nThe country’s Council of Ministers still plans to issue another licence and have unanimously decided to expedite tasks that would enable the issuance of the second licence.\nWhile Safaricom and its fellow telcos may have to tread with caution, the country is set to benefit greatly."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "Nigeria’s largest FMCGs’ profits far from pre-pandemic levels",
    "summarized_story": "The stagnant profit of Nigeria’s largest Fast Moving Consumer Goods (FMCGs) companies is the latest sign of how Africa’s largest economy is gasping for breath.\nBusinessDay’s analysis of the financial statements of Nestle Nigeria, Dangote Sugar, Cadbury, Unilever, and NASCON reveals that their cumulative profit after tax for the period ended March 2021 was N21.43…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Thirst for debt: Companies’ borrowing to remain robust in 2021",
    "summarized_story": "Thirst for debt: Companies’ borrowing to remain robust in 2021Corporate debt issuance in Nigeria is expected to remain robust throughout 2021 even as interest rates begin to rise from last year’s record low levels, according to a new research by GCR Nigeria credit ratings.\nNigerian corporates issued a record N1.02 trillion ($2.69bn) of local currency debt instruments in 2020, the highest since at least…"
  },
  {
    "headline": "Nigeria’s Q1 GPD numbers show poverty still on the rise",
    "summarized_story": "There were no surprises in the latest GDP numbers for Nigeria published by the National Bureau of Statistics (NBS) on Sunday.\nRead Also: Nigeria needs 14% of GDP to meet SDG by 2030, says IMF Africa’s largest economy expanded at a tepid 0.51 percent in the first quarter of 2021, a rate too slow to reduce…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Residents excited with progress on 8.3km Ekehuan Road dualisation project … As contractor commences asphalting of road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestResidents in Benin City have commended the Governor Godwin Obaseki-led administration for the progress of work on the 8.3km Ekehuan Road dualisation project.\nA cross section of residents who spoke to journalists at the weekend, said the timely completion of the road project will fast track economic development along the road, which is the major link road to the Benin River Port project.\n“With the pace of work, we are confident that a good part of the 8.3km road will be open to motorists.\nThe state government should ensure that contractors handling the project move faster in delivering the project.\nA part of the road project includes an underground drainage system, which on completion, will tackle flooding problems in the area."
  },
  {
    "headline": "COVID-19: Edo govt urges vaccination, compliance with guidelines to contain pandemic – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has reiterated the need for residents to get vaccinated against coronavirus (COVID-19) and continue to comply with all preventive protocols to contain the pandemic in the state.\nEdo State COVID-19 Incident Manager, Dr. Andrew Obi, who gave the charge while speaking to journalists in Benin-city, said the state has continued to record success in the management of the pandemic.\nObi, who urged residents to support the government’s efforts at curbing the spread of the virus to ensure a total victory over the pandemic, reassured that the Governor Godwin Obaseki-led administration will continue to deploy resources to check the spread of the pandemic and protect residents across all communities in the state.\n“We urge everyone to support the government’s efforts at containing the pandemic by complying with guidelines to curtail the spread of the virus.\nHe charged residents with any COVID-19 symptoms to contact the Edo Emergency Operation Centre on this toll-free number: 08003625000 for assistance."
  },
  {
    "headline": "German govt firms collaboration with FG, Obaseki, Oba of Benin on return of Benin artefacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Director General for Culture and Communication in the German Foreign Ministry, Dr. Andreas Gorgen, has maintained that the German Government has acknowledged the looting of Benin artefacts and is committed to its return and restoration.\n“We express our gratitude to Governor Godwin Obaseki, the Federal Government and the Oba of Benin who have granted us an audience on this issue.\nIt’s a historical day for me as well, as I saw the tradition and culture of the Benin people.\nWe are happy that the objects will return to this museum and back to Nigeria.\nWe want to support you in capacity building, training, education, and learn from you the knowledge of the Benin Bronze.”..."
  },
  {
    "headline": "Examining the causes of rampant plane crashes – Nigerian Observer",
    "summarized_story": "“It was the wind shear and the government put in money to install wind shear system in all international airports.\n“I think if I am not making mistake, somewhere along he line, all airports were installed with wind shear system.\n“My worry is that are we sure the wind shear system in Kaduna airport is working,?” he asked.\nWind shear, sometimes referred to as wind gradient, is a difference in wind speed or direction over a relatively short distance in the atmosphere.\n“However, globally, there are three or four reasons that are attributed to air crashes in any part of the world."
  },
  {
    "headline": "Aisha Buhari visits family of late army chief, Ibrahim Attahiru",
    "summarized_story": "ADVERTISEMENTThe first lady, Aisha Buhari, on Sunday, paid a condolence visit to the family of the late Chief of Army Staff, Ibrahim Attahiru.\nShe joined other Nigerians to mourn Mr Attahiru and other officers who died in Friday’s plane crash.\nMrs Buhari shared a short message and pictures of her visit on Facebook Saturday evening.\n“The death of the Late Chief Of Army Staff and the other military officers aboard the ill-fated aircraft is a monumental loss to their families and the Nation at large,” she wrote.\nHer visit occurred as Nigerians continued to express outrage over President Muhammadu Buhari’s failure to attend the burial of the late officers or visit their family for condolences."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "SEC adopts sustainable finance guidelines for capital market operators",
    "summarized_story": "The Securities and Exchange Commission (SEC), says it has adopted the Nigerian Sustainable Finance Principles (NSFP) which was developed by the Financial Services Regulation Coordinating Committee (FSRCC) for Capital Market Operators (CMOs).\nThe commission in a statement in Abuja on Sunday, said that the objectives of the guidelines were to stimulate a resilient, competitive and sustainable market that would promote economic development.\nIt said it will also help in accessing affordable capital market products by the economically less privileged.\nAccording to the Commission, the guidelines and approach were principle-based and therefore do not prescribe specific implementation requirements.\nSEC, however, listed its regulated entities to include CMOs, Trade Groups, Self-Regulated Organisations (SROs) and Capital Trade Points"
  },
  {
    "headline": "How LG is Championing SDGs through Environmentally Friendly Products and Collaboration",
    "summarized_story": "According to Mr. IL Hwan Lee, President, LG Electronics, Middle East & Africa Region, LG is committed to the triple bottom line of people, planet and profit.\n“As a responsible global corporate citizen, LG Electronics is set to contributing to the achievement of the SDGs as the main goal of its social contribution activities.\nSome of such that promote eco-friendly society include LG DUAL Inverter, LG NeON 2, LG WashTower and the CordZero M9 robot vacuum cleaner.\nLG Electronics continuously develops and implements initiatives that contribute to achieving these 5 SDGs, and monitors the progress.\nTo fulfill this commitments, LG Electronics is improving the life of its customers by providing more easy-t-use products applied with AI and future technology."
  },
  {
    "headline": "LG HVAC Tech earns international certifications for indoor air quality",
    "summarized_story": "Bamidele BamikeCommercial air conditioning technology from LG Electronics has garnered a number of recognitions from trusted international organizations for its ability to improve indoor air quality, the company has said.\nCertifications from Intertek, TÜV Rheinland and Underwriters Laboratories (UL) awarded to LG Dual Vane Cassette system are confirmation of the effectiveness of LG HVAC solutions in delivering clean air, LG said in a statement.\nThe LG DUAL Vane Cassette is the world’s first HVAC solution to receive UL’s GREENGUARD Gold Certification for low volatile organic compound (VOC) emissions.\nFor these reasons alone, LG DUAL Vane Cassette is the ideal option for use in schools and healthcare facilities where air quality is of utmost priority.\n2 What’s more, LG Dual Vane Cassette’s air-cleansing and allergen-removing capabilities are also certified by the British Allergy Foundation."
  },
  {
    "headline": "Nigeria’s economy grows by 0.51% in Q1, 2021",
    "summarized_story": "OBINNA EZUGWUNigeria’s gross domestic product (GDP) increased by 0.51 percent in the first quarter of 2021, an improvement from 0.11 percent increase in the fourth quarter of 2020.\n”The Q1’21 growth rate was slower than the 1.87 percent growth rate recorded in Q1’20 but higher than 0.11 percent recorded in Q4’20, indicative of a slow but continuous recovery.\n“Nevertheless, quarter on quarter, real GDP grew at -13.93 percent in Q1’21 compared to Q4’20, reflecting a generally slower pace of economic activities at the start of the year.\nCompared to Q4 2020 which recorded –19.76 percent growth rate, growth in Q1’21 was higher by 17.6 percent points.\n“Quarter-on-quarter, the oil sector recorded a growth rate of 35.65% in Q1 2021."
  },
  {
    "headline": "PMB Mourns NASCO Founder, Ahmed Nasreddin",
    "summarized_story": "President Muhammadu Buhari has described the death of founder of the NASCO Group Ahmed Nasreddin as “a great loss not only to Plateau State, but also to the entire country.”President Buhari in a statement by his media aide, Garba Shehu, noted that “the pioneering role of the industrialist in the development of agriculture in Northern Nigeria since 1963 was a historic giant stride for which he would never be forgotten.”He said the late Nasreddin “was a man of vision who built the company from strength to strength and became one of the biggest employers of labour in the country.”According to the President, “The deceased lived a fulfilled life having witnessed the tremendous impact made by his company in the life of the people and on the economy of the country.”"
  },
  {
    "headline": "PMB Mourns NASCO Founder, Ahmed Nasreddin",
    "summarized_story": "President Muhammadu Buhari has described the death of founder of the NASCO Group Ahmed Nasreddin as “a great loss not only to Plateau State, but also to the entire country.”President Buhari in a statement by his media aide, Garba Shehu, noted that “the pioneering role of the industrialist in the development of agriculture in Northern Nigeria since 1963 was a historic giant stride for which he would never be forgotten.”He said the late Nasreddin “was a man of vision who built the company from strength to strength and became one of the biggest employers of labour in the country.”According to the President, “The deceased lived a fulfilled life having witnessed the tremendous impact made by his company in the life of the people and on the economy of the country.”"
  },
  {
    "headline": "Bandits Attack Police Station In Zamfara Kill 2 Policemen, Seize 2Ak 47 Rifles",
    "summarized_story": "Bandits have killed two policemen in Magami Town, Gusau local government area, Zamfara State and took away their two AK 47 rifles.\nAn indigene of the area, Malam Almu Usman, said the policemen were on duty at the Magami police station around 8 o’clock in the night on Saturday when the bandits sneaked into the station and began to shoot.\nUsman said, “Two policemen were shot dead during the attack, while other policemen escaped with various degrees of injuries”.\nAccording to him, the bandits who were in large number, did not attack anybody in the town, explaining that, “Immediately they arrived the town, they went straight to the police station and started shooting sporadically”.\nSpeaking to journalist’s, the spokesperson of the command, SP Mohammed Shehu, said “The policemen lost their lives in operation while repelling attack on Magami Community by suspected armed bandits who came in their large number to attack the innocent people of the area”."
  },
  {
    "headline": "Bandits Attack Police Station In Zamfara Kill 2 Policemen, Seize 2Ak 47 Rifles",
    "summarized_story": "Bandits have killed two policemen in Magami Town, Gusau local government area, Zamfara State and took away their two AK 47 rifles.\nAn indigene of the area, Malam Almu Usman, said the policemen were on duty at the Magami police station around 8 o’clock in the night on Saturday when the bandits sneaked into the station and began to shoot.\nUsman said, “Two policemen were shot dead during the attack, while other policemen escaped with various degrees of injuries”.\nAccording to him, the bandits who were in large number, did not attack anybody in the town, explaining that, “Immediately they arrived the town, they went straight to the police station and started shooting sporadically”.\nSpeaking to journalist’s, the spokesperson of the command, SP Mohammed Shehu, said “The policemen lost their lives in operation while repelling attack on Magami Community by suspected armed bandits who came in their large number to attack the innocent people of the area”."
  },
  {
    "headline": "Alumni Rejects Ambrose Alli Special Intervention Law",
    "summarized_story": "The National Executive Council (NEC) of Ambrose Alli University Alumni Association Worldwide, yesterday, in Benin City, Edo State, condemned the Ambrose Alli University Special Intervention Powers provisions law 2021, which gave the visitor, the Edo State governor, Mr Godwin Obaseki the power to appoint an acting vice chancellor for the university.\nThe association arrived at the decision after its emergency meeting held in Benin.\n“NEC condemned the new law in its entirety and sought that it be repealed without further delay, as the law is capable of causing anarchy in the University and creating a legacy reminiscent of military dictatorship.\nBy that, the appointment of an acting Vice-Chancellor should follow due process and with a definite duration, after which the process of appointing a substantive Vice-Chancellor should commence by the 1999 University law as amended.\nMost of the products of our University are doing excellently well in their choosing endeavours.”"
  },
  {
    "headline": "Nigeria to help other African nations in aviation, says Sirika —",
    "summarized_story": "Minister of Aviation, Senator Hadi Sirika, has reiterated the readiness of the Federal Government to offer appropriate technical support to African countries for the development of their aviation sectors.\n“RTC Nigeria has evolved over the years.\nIt began in 1957 as a National Meteorological Training School in Lagos, Nigeria, to train Class IV Meteorological Technicians while in 1964, a Regional Meteorological Training Centre (RMTC) was established, also in Lagos, Nigeria, to train Class III and Class II Meteorological Technicians.\nCurrently, the process is ongoing for the designation of the National Water Resources Institute, Kaduna, Nigeria as a WMO RTC for operational Hydrology.\nThis is to emphasise the presence of capacities in Nigeria to meet the training demands of the continent,” the Aviation minister stated."
  },
  {
    "headline": "How father of three died in congested task force cell — Daily Times Nigeria",
    "summarized_story": "Daily Times reports that the suspects numbering over 70, were arrested, squeezed into a waiting black maria, and whisked away to the Task Force office in Oshodi, around 3a.m.\nWhile waiting for the Task Force to officially convey a heartfelt condolence with a clear intention to adequately compensate the family of the deceased,” he stated.\nMoliki said: “ Thee is a petition to the Lagos State Government and they are already working on it.\nThe family has written the Lagos State Government and investigation is on.”Contacted for comment, the Lagos State Police Public Relations Officer (PPRO) Olumiyiwa Adejobi, simply said he was not aware of the matter.\nHe told the correspondent to sent a message on her inquiry, which will be forwarded to the Task Force office, the message was sent, but as at press time, Adejobi was yet to respond."
  },
  {
    "headline": "N6.5bn contracts: Senate questions NECO over failure to follow due...",
    "summarized_story": "Tunde Opalana, AbujaThe National Examination Council (NECO) has been asked to explain how contracts worth N6.5 billion for the printing of security and non- security documents were awarded without due process.\nHinging on the 2017 report of Office of Auditor General of the Federation, the Senate Committee on Public Account faulted NECO on shoddy handling of two contracts worth N451 million and N6.1 billion respectively.\nThe report indicted the examination body of inability to present any record of approval for the contract in the first contract that cost about N451 million.\n” The above unilateral award of contracts without following due process may lead to awarding contracts to unqualified contractors.\nThere was no Technical and Financial evaluation, Evidence of placement of advertisement was not attached to either payment vouchers or contract files."
  },
  {
    "headline": "'N2 trillion stolen yearly in Nigeria by officials' — Daily Times Nigeria",
    "summarized_story": "Success NwoguExperts have said that about N2 trillion is allegedly stolen every year in Nigeria by public and private officials, usually with the technical assistance of professionals.\nHe added that the participants at the summit said Nigeria has 107 registered professional groups and that some of the members allegedly are enablers of corruption.\nHe stated that the country’s main professional groups at the conference committed themselves to collaborating with anti-corruption institutions and civil society working on anti-corruption.\nHe stated that Abdullahi, who doubles as the Nigerian Ambassador to Russia said the future of transparency and accountability hinges on high moral standards of Nigerian professional bodies.\nHe added that government’s efforts will not fully succeed if professionals continue to offer professional services to dubious officials."
  },
  {
    "headline": "VIDEO: 20 FASCINATING FACTS ABOUT BILLIONAIRE GLO FOUNDER, MIKE ADENUGA (THE GURU)",
    "summarized_story": "You might also like"
  },
  {
    "headline": "VIDEO: 20 FASCINATING FACTS ABOUT BILLIONAIRE GLO FOUNDER, MIKE ADENUGA (THE GURU)",
    "summarized_story": "You might also like"
  },
  {
    "headline": "Ortom to Benue people: No more complaints, cries, we must defend ourselves from killer herdsmen",
    "summarized_story": "Governor Samuel Ortom of Benue State weekend said though the state was under siege of armed herdsmen, there was no need for anyone to cry or complain anymore except for the people to stand up and defend themselves in order to live.\nThe Governor spoke during a funeral oration in honour of Mama Enenu Ebute, mother of Justice Mary Abounu, wife of the Benue State Deputy Governor, Mr Benson Abounu at Adoka, Otukpo Local Government Area of the state.\n“We have had enough of this, we cannot continue to cry, we must all defend ourselves.\nHe also pointing out that support and synergy with security agents was imperative in the fight against the worsening insecurity in the country.\nAnd urged that all hands must be on deck to salvage the country."
  },
  {
    "headline": "Ortom to Benue people: No more complaints, cries, we must defend ourselves from killer herdsmen",
    "summarized_story": "Governor Samuel Ortom of Benue State weekend said though the state was under siege of armed herdsmen, there was no need for anyone to cry or complain anymore except for the people to stand up and defend themselves in order to live.\nThe Governor spoke during a funeral oration in honour of Mama Enenu Ebute, mother of Justice Mary Abounu, wife of the Benue State Deputy Governor, Mr Benson Abounu at Adoka, Otukpo Local Government Area of the state.\n“We have had enough of this, we cannot continue to cry, we must all defend ourselves.\nHe also pointing out that support and synergy with security agents was imperative in the fight against the worsening insecurity in the country.\nAnd urged that all hands must be on deck to salvage the country."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "52 Nigerians hit with severe reactions after taking AstraZeneca vaccine",
    "summarized_story": "By Kazeem UgbodagaThe National Primary Health Care Development Agency, NPHCDA, on Friday disclosed that 52 Nigerians have experienced moderate to severe reactions after taking the AstraZeneca vaccine.\nExecutive Director and Chief Executive Officer, NPHCDA, Dr. Faisal Shuaib disclosed this at a news conference in Abuja.\nHe also said 8,439 Nigerians experienced mild Adverse events following immunization (AEFI) after taking the vaccine.\n“Similarly, 52 cases of moderate to severe incidents of AEFI have been reported.\nAccording to Shuaib, as of today, April 16th, 1,071,346, representing 53.2% of the eligible persons targeted with the AstraZeneca vaccine had been administered their first dose in this vaccination phase."
  },
  {
    "headline": "Buhari Orders Nigeria Flag To Be Flown Half-mast For 3 Days In Honour Of COAS",
    "summarized_story": "General Muhammadu Buhari(rtd), the president of Nigeria and commander-in-chief of the Nigerian Armed Forces, has ordered that the Nigerian national flag be flown at half-mast in all public buildings and official houses across the country from Monday May 24 to Saturday May 26, 2021, according to Newsdirect.ngThe Presidency published a statement on Sunday, May 23, 2021, confirming this.\nPresident Buhari gave this order in honour of the late Chief of Army Staff and other military officers who died in Friday’s plane crash.\nThe President has also approved Monday May 24, 2021 as a work-free day for members of the Nigerian Armed Forces."
  },
  {
    "headline": "Attahiru: How Family, Army Clashed At Funeral Ceremony",
    "summarized_story": "On Saturday, the family of the late Chief of Army Staff, Lt Gen Ibrahim Attahiru, had a dispute with the Nigerian Army over his burial.\nThey insisted that Attahiru be buried without a coffin, as per Islamic tradition.\nSenior Army officers, on the other hand, maintained that the late COAS will be buried in accordance with military custom.\nAttahiru and ten other military officers were killed in a plane crash at Kaduna International Airport on Friday.\nBrigadier Generals Ahmed Kuliya, O Olayinka, and MI Abdulkadir; Majors N Hamza, LA Hayat; Sergeants O Adesina, and Umar; and Aircraftman OM Oyedepo, Flt Lt TO Asaniyi, and Flt Lt AA Olufade were among those killed."
  },
  {
    "headline": "BREAKING: Gunmen Attack Police Station, Set INEC Office Ablaze In Anambra",
    "summarized_story": "The B-Division police station and INEC office in Awka, Anambra state have been attacked by some unknown gunmen.\nAccording to reports, the gunmen firstly attacked B-Division police station and shot for more than an hour, stopped at Ekwueme Square and shot for 10 minutes before proceeding to the INEC office.\nThe INEC office in Awka is currently on fire but there are no records of any deaths yet.\nMore details later…"
  },
  {
    "headline": "Audit report: Senate probes NECO over alleged N6.5bn contracts",
    "summarized_story": "The National Examination Council (NECO) is in the eye of the storm again over alleged N6.5billion contract award without due process.\nThis was stated in the 2017 Audit Report submitted to the Senate Committee on Public Accounts.\nAt another session on Friday, the upper legislative chamber confronted the NECO Registrar, Professor Godswill Obioma, with another damning report of alleged N6.5 contracts award without due process.\nThe contracts in question as contained in the 2017 Audit report and read out by the Chairman Senate Committee on Public Accounts Mathew Urhoghide ( PDP Edo South) awere the printing of security and non-security documents.\n“The above unilateral award of contracts without following due process may lead to awarding contracts to unqualified contractors."
  },
  {
    "headline": "Insecurity: Bandits abduct 14 in Kaduna, NAF rescues scores, 20 gunmen invade FCT, abduct father, son",
    "summarized_story": "Armed bandits Sunday attacked Unguwan Kabulo community in Chikun local government area of Kaduna state and abducted 14 people, Blueprint has gathered.\nThe commissioner said when the air platforms traced them to the outskirts of the village, the bandits had scampered into the forest and abandoned the women.\nSecurity agencies reported that the armed bandits attacked the Buruku-Birnin Gwari road and Nasiru Muhammad was shot dead around Ungwan Yako forest along the route.\nSokotoAlso, some suspected bandits Friday night killed three persons at Garin Zogo village in Sabon Birni local government of Sokoto state.\n“But the quick intervention of the Police, JTF, and other local security outfits prevented the gunmen from carrying out their nefarious activities,” she said."
  },
  {
    "headline": "Breaking: Gunmen abduct undergraduate, farmer in Ogun",
    "summarized_story": "A 400-level student of Aquaculture and Fisheries Management of Federal University of Agriculture Abeokuta (FUNAAB), Toyinbo Nathaniel Olayinka, has been abducted on Saturday from a farm at Abule-Itoko on the Abeokuta-Ibadan road in Odeda local hovernment area of Ogun state.\nOlayinka was reportedly kidnapped alongside the owner of the private farm, identified as Dominic, and a 17-year-old Togolese lady.\nAdepoju noted that the victim has been living and working as a practicing livestock farmer for the past three years to sustain himself as a self sponsored indigent student of the University.\nHe affirmed that the management of the University has reported the abduction at Ogun State Police Command headquarters, Eleweran and its working with the command to ensure the safety and release of the kidnapped student.\nConfirming the incident, the Police Public Relations Officer (PPRO), DSP Abimbola Oyeyemi, confirmed that the student was abducted with a relative of the farm owner at the early hours of Saturday."
  },
  {
    "headline": "Senate is serious about constitutional amendment, says BMO",
    "summarized_story": "Buhari Media Organisation, BMO, on Sunday said the one week suspension of plenary by the Senate to enable its members to participate in the zonal public hearing for the constitution review across the country has shown that the legislative body is serious about constitutional amendment.\nBMO said the public hearing for amendment of constitution as facilitated by National Assembly committee on Constitution review is the only acknowledged constitutional platform recognized by law, as part of the process of amending the Constitution and should be acknowledged by everybody.\n“The National Assembly has been very much up to speed on national opinions around the amendment and updating of the Nigerian Constitution.\nIt would witness two public hearings per geopolitical zone and a national public hearing is expected to hold in Abuja, the nation’s capital.\n“Chairman, Senate Committee on Constitution Review, Senator Ovie Omo-Agege called on those who have already submitted memoranda to speak to the documents at the events”."
  },
  {
    "headline": "PDP is still the party of choice for Nigerians – Chief Segun Oni -NigPilot",
    "summarized_story": "Former governor of Ekiti State, Segun Oni has declared that the Peoples Democratic Party, PDP, remains the choice party for Nigerians.\nReacting to the defection of Governor Ben Ayade of Cross Rivers State to the APC, Segun Oni advised members of the PDP not to despair or lose hope about the development.\n“I will like to urge members of the PDP to not despair or lose hope about the recent developments.\nThe country’s political environment reflects people seeking an alternative to the APC, and it is only the PDP that can provide this alternative.\nThe PDP is still the party of choice for all Nigerians."
  },
  {
    "headline": "Stop military aggression in South East, HURIWA tells Buhari -NigPilot",
    "summarized_story": "A leading civil rights advocacy group, Human Rights Writers Association of Nigeria, HURIWA, has asked President Muhammadu Buhari to end his “unwarranted military aggression” in parts of South East with specific reference to the reported airstrikes in Imo State.\nThe Rights group stated that the airstrikes have created an atmosphere of fear and a climate of uncertainty in the entire Imo State with millions of people unsure of their safety any longer.\nHURIWA lamented that human rights violations by the soldiers during internal military operations which became unprecedented in the past few weeks in the South East of Nigeria have started portraying the Nigerian Army in bad light around the World with the concomitant use of extralegal killings of civil by the soldiers.\n“The directive by President Buhari to the military to wage aggressive attacks against locations in the South East of Nigeria without provocation may lead to a genocide which the Rights group is appealing to World leaders to intervene now before it becomes too late.\nThe civil rights advocacy group stated that an indigene of the area reortedly said, “There is an ongoing military airstrike in Odenkwume and Amuzi communities in Obowo and their neighbouring communities in Ihitte/Uboma LGA."
  },
  {
    "headline": "IPC Trains 51 Journalists on Safety Security and Trauma Management -NigPilot",
    "summarized_story": "The International Press Centre has trained 51 Journalists in the Southeast and South South on Safety Security and Management of Trauma in Coverage of Dangerous Assignments.\nThe online zoom training centred on security consciousness of journalists, safety measures and methods of managing stress, trauma and other psychological effects while carrying out their assignments.\nHe explained that IFEX also supports the building of appropriate capacities for journalists including safety in investigative reporting, digital security and management of post-traumatic stress disorder.\nGillo reminded journalists that security of their devices from optimal confidentiality is key to safe practice of the profession.\nDr. Uzo Israel who spoke on managing stress, trauma and other psychological effects called on journalists to take the Management of their health seriously."
  },
  {
    "headline": "Buhari Directs National Flag To Fly At Half-Mast, Declares Monday Work-Free Day For Military Personnel",
    "summarized_story": "President Muhammadu Buhari has directed that the national flag be flown at half-mast in all public buildings, facilities, and official residences across the country.\nMustapha added that the President has approved Monday as a work-free day for members of the Nigerian Armed Forces.\nThe remains of the late Attahiru and 10 other officers who died in the plane crash in Kaduna were laid to rest on Saturday at the National Military Cemetery in Abuja.\nOther officers and who lost their lives included Brigadier-General MI Abdulkadir, Brigadier-General Olayinka, Brigadier-General Kuliya, Major LA Hayat, Major Hamza and Sergeant Umar.\nDetails of his conversation are highlighted in the statement below signed by the President’s spokesman, Garba Shehu."
  },
  {
    "headline": "Gunmen Burn INEC Office In Anambra",
    "summarized_story": "The headquarters of the Independent National Electoral Commission (INEC) in Anambra State has been set ablaze by gunmen.\nThey also attempted to attack the Police ‘B’ Divisional Headquarters close to the INEC office but were repelled by the operatives on duty.\nThey were reported to have later proceeded to the Ekwueme Square axis and fired gunshots for another 10 minutes before storming the INEC headquarters and set it on fire.\nChannels Television obtained a video showing the INEC office going up in flames.\nThey included the Roban Road, Central Bank of Nigeria (CBN) Road, Arroma Road, and Ifite Road – all in the state capital."
  },
  {
    "headline": "How Bandits Attacked Five Zamfara Communities, Killed Over 20 People – Witnesses",
    "summarized_story": "No fewer than 20 people have been killed and many others injured when bandits attacked five communities in two local government areas of Zamfara State.\nThey noted that the bandits, in large numbers, invaded the communities on Saturday afternoon and started shooting sporadically, killing innocent residents in the process.\n“They (the bandits) attacked a village called Gabaken and killed five people; in Torawa, they killed five people.\nOne person was killed in a village called Rigiya; a village called Donroyi in Zurmi Local Government, they killed four people.\n“In a village called Riwoji where I come from, they killed four and injured seven people, including my father’s younger brother,” said one of the witnesses, Umar Abubakar."
  },
  {
    "headline": "COVID-19: FG Publishes Names Of 90 Nigerians, Foreigners Who Evaded Quarantine",
    "summarized_story": "The Presidential Steering Committee (PSC) has published the names of 90 returning travellers who evaded the mandatory seven-day quarantine for persons arriving from restricted countries.\nA statement issued on Sunday by the PSC Chairman and Secretary to the Government of the Federation (SGF), Boss Mustapha, revealed that the erring persons comprised 63 Nigerians and 27 foreigners.\nMustapha advised Nigerians to be wary of such persons of interest, saying they constitute an immediate health hazard to the society.\n“Additional list of Batch II defaulters shall be published in a subsequent announcement by the PSC,” the committee chairman stated.\nSee the full list of the persons whose names were published below:"
  },
  {
    "headline": "PHOTOS: Aisha Buhari Visits Attahiru’s Widow, Family",
    "summarized_story": "The First Lady, Mrs Aisha Buhari, has paid a condolence visit to the family of the late Chief of Army Staff, Lieutenant General Ibrahim Attahiru.\nMrs Buhari took to Twitter on Sunday to share photos of her visit to the deceased’s family on her verified handle.\nShe described the death of the late army chief and the other military officers aboard the aircraft as a monumental loss to their families and the nation at large.\nOther officers and who lost their lives included Brigadier-General MI Abdulkadir, Brigadier-General Olayinka, Brigadier-General Kuliya, Major LA Hayat, Major Hamza, and Sergeant Umar.\nMustapha added that the President has approved Monday as a work-free day for members of the Nigerian Armed Forces."
  },
  {
    "headline": "Aisha Buhari pays condolence visit to family of Chief of Army Staff",
    "summarized_story": "The First, Aisha Buhari has paid a condolence visit to the Family of the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru.\nShe was accompanied by the Minister of Women Affairs, APC Women Rep, DG National Centre for Women Development and other associates.\nThe wife of the President described the death of the Chief Of Army Staff and the ten other officers aboard the ill-fated aircraft as a monumental loss to their families and the Nation at large.\nShe further prayed that the Almighty grant their families the fortitude to bear the irreplaceable loss."
  },
  {
    "headline": "Kaduna insecurity: Bandits kill driver of traditional ruler",
    "summarized_story": "Bandits in Kaduna have killed the driver to the Emir of Birnin Gwari, Jibril Mai-Gwari the Second.\nThe driver Nasiru Mohammed was shot by armed Bandits while driving back to Kaduna around Ungwan Yako in Brinin Gwari local government area of the state.\nThe state Commissioner for Security and Home affairs Samuel Aruwan, said the state Governor Nasir El- Rufai, is saddened by the incident.\nAccording to him, Governor El-Rufai has sent condolences to His Royal Highness the Emir of Birnin Gwari, and also prayed for the repose of the soul of the slain driver."
  },
  {
    "headline": "Italian Cable Car Crash Kills at Least 13",
    "summarized_story": "At least 13 people have died and three were seriously injured when a cable car linking Italy’s Lake Maggiore with a nearby mountain in the Alps collapsed.\nThe Stresa-Mottarone cable car takes tourists and locals from the town on Lake Maggiore, almost 1,400 metres above sea level to the top of the Mottarone mountain in 20 minutes.\nThe accident happened as the cable car was travelling up the mountain, with the cabin dropping some 20 metres and rolling several times down the steep slopes before it was stopped by trees.\nLuca Cari, a fire brigade spokesman, said it was still not clear how many people were in the cable car.\nThe cable car service first opened in August 1970 after almost three years of works to replace a cog railway, its website saidSeverino said that important maintenance works, including changing the cables, had been carried out in recent years."
  },
  {
    "headline": "Liverpool, Chelsea Claim Last Champions League Spots, Leicester Lose Out",
    "summarized_story": "Liverpool secured third place in the Premier League and Champions League football with a 2-0 win over Crystal Palace at Anfield on Sunday.\nIt took Mane until 36 minutes to tap the ball in from close range following a Roberto Firmino corner.\nPalace sought an equaliser in the second half but none materialised as Liverpool took advantage with a second Mane goal.\nMeanwhile, West Ham and Leicester City will play Europa League football next season after plenty of twists and turns on a dramatic final day of the 2020/21 Premier League campaign.\nChelsea however squeezed into the top four above Leicester by one point despite going down 2-1 at Aston Villa, with Liverpool third behind champions Manchester City and Manchester United."
  },
  {
    "headline": "Nigeria Drug Agency Intercepts $20m Cocaine, Arrests Brazil-based Kingpin at Lagos Airport",
    "summarized_story": "A Brazil based drug kingpin has been nabbed with 36 blocks of cocaine, weighing about 30 kilogrammes with a street value of over N8 billion (about $20m) at the Murtala Muhammed International Airport, MMIA, Lagos by operatives of the National Drug Law Enforcement Agency (NDLEA).\nBabafemi disclosed that the disclaimed bag was opened in the presence of the arriving passenger and the man who had come to negotiate it’s release.\nHe said when it was opened, the bag was found to contain 36 blocks of cocaine, weighing 27.95 kilogrammes.\nThe spokesman said during preliminary interrogation after his arrest, Enwereakuconfessed to have been contracted by his Ethiopian associate who is a notorious drug baron to claim and push out the consignment in Lagos, Nigeria.\nBabafemi said the suspect also admitted to have paid the $24,500 bribe in three tranches to compromise NDLEA officers."
  },
  {
    "headline": "Severe Weather Kills 21 Ultramarathon Runners in China",
    "summarized_story": "The race was halted when some of the 172 runners went missing, and a rescue operation was launched.\nHigh winds and freezing rain hit participants in the 100km (60-mile) ultramarathon in the Yellow River Stone Forest, a tourist site in Gansu province, on Saturday.\nOfficials said 151 runners were now confirmed safe, and that eight of them were injured.\nSurviving participants said the forecast had shown some wind and rain was anticipated, but nothing as extreme as what they experienced.\nShe headed back to the hotel after previous experience with hypothermia but others continued or were already in worst hit areas."
  },
  {
    "headline": "Hamas Defiant with Military Parade, Appearance of Top Leader",
    "summarized_story": "Hundreds of masked Hamas fighters brandishing assault rifles paraded in Gaza City and the group’s top leader made his first public appearance on Saturday, in a defiant show of strength after the militants’ 11-day war with Israel.\nIn the fighting, Israel unleashed hundreds of airstrikes against militant targets in Gaza, while Hamas and other militants fired more than 4,000 rockets toward Israel.\nOn Saturday, hundreds of Hamas fighters wearing military camouflage paraded past the mourning tent for Bassem Issa, a senior commander killed in the fighting.\nThe top Hamas leader in Gaza, Yehiyeh Sinwar, paid his respects in his first public appearance since the war began.\nPrime Minister Netanyahu said Friday that more than 200 militants were killed, including 25 senior commanders."
  }
]