[
  {
    "headline": "SAN, others berate Buhari regime for attack on Sowore",
    "summarized_story": "Human rights activist and Senior Advocate of Nigeria, Ebun-Olu Adegboruwa, on Monday said the regime of the President, Major General Mohammadu Buhari (retd.\n), should be held responsible for the attack on a human rights activist, Omoyele Sowore, who only sought to exercise his fundamental human rights.\nSowore was injured by a tear gas canister fired by a police operative in Abuja.\nThe politician was preparing to hold a rally with some associates when the incident happened at the Unity Fountain in Abuja on Monday.\n“The Unity Fountain is a public place, where other citizens have held protests in support of the Buhari administration in recent past, without let or hindrance and even with police escorts."
  },
  {
    "headline": "Mali suspended as ECOWAS member until return to civil rule",
    "summarized_story": "MALI has been suspended from the West African regional bloc, the Economic Community of West African States.\nThe decision was announced after an emergency meeting of the bloc’s leaders in Accra, Ghana, on Sunday.\nGhana’s Foreign Affairs Minister, Shirley Botchwey, told journalists that the Mali junta’s non-adherence to the mediatory role of ECOWAS necessitated the decision of ECOWAS leaders.\nECOWAS envoy, former Nigerian president, Goodlluck Jonathan, had briefed the meeting behind closed-doors on his mediatory trips to Mali last week.\nThe heads of state also demanded the immediate release of the former president and prime minister of the transition who were kept under house arrest."
  },
  {
    "headline": "Five killed in Ebonyi as sit-at-home records full compliance",
    "summarized_story": "Total compliance in EbonyiAlso, in Abakaliki, the Ebonyi State capital, streets, shops, schools, markets, banks, hospitals and even some police facilities were deserted on Monday morning as residents obeyed the sit-at-home order issued by the proscribed IPOB.\nThe total compliance to this year’s sit-at-home order by Ebonyi people was a sharp departure from what obtained in previous editions, which hitherto recorded partial compliance in the city.\nPeople were seen in the Ebonyi State capital relaxing on tarred roads because there was no vehicular movement.\nThe development was in a total compliance to the sit-at-home order declared by the IPOB.\nCop, four others killed in EbonyiA policeman attached to the Ebonyi State Police Command and four Biafra agitators were reportedly killed on Monday while the sit-at-home order was being observed."
  },
  {
    "headline": "Smoking one cigarette a day harms smoker’s health ― WHO",
    "summarized_story": "Kindly Share This Story:By Chioma ObinnaOn this year’s World No Tobacco Day, the World Health Organisation, WHO has warned that smoking one cigarette a day can seriously harm a person’s health even as it disclosed that no fewer than 1.2 million non-smokers die from exposure to tobacco smoke.\nContinuing, she said: “National toll-free lines where tobacco users can call and get advice are available in six countries.\nNicotine replacement therapy is sold in pharmacies in 19 countries with governments fully covering the costs in Eswatini, Mauritius and Seychelles.\n“Nicotine replacement therapy is included in the essential medicines list in Algeria, Ethiopia and South Africa.\nThese include the development and implementation of programmes to promote quitting tobacco in schools, universities, health facilities, workplaces and sporting environments."
  },
  {
    "headline": "Former Vice President ATIKU ABUBAKAR commissions two factories in ADAMAWA",
    "summarized_story": "Kindly Share This Story:By Umar Yusuf – YolaFormer Vice President ATIKU ABUBAKAR as part of her efforts of bringing succour to the ordinary Nigerians, especially in the areas of job creation and poverty alleviation Monday in YOLA commissioned a factory woven sack and shrink laminate plants.\nThis is in addition, to the various factories established in the state by the former vice president geared towards boosting the economy of the state and providing employment opportunities to the teeming youths of Adamawa state.\nSpeaking at the ceremony, Alhaji .shehu Atiku Abubakar said that the woven sacks factory is established to serve as a background strategy to provide sacks for Rico Gado Nutrition and to also addressed the needs of Adamawa agrarian community and the numerous factories packaging products with sacks.\nShehu noted that the priam group plans to invest more than $20 million in the Adamawa state economy in the next two years adding that, these investments will enable priam group to reach a revenue target of 30 billion naira by 2023 and 50 billion by 2025.\nOn his part, Gov.Ahmadu Fintiri lauded former vice president Atiku Abubakar for establishing another factory in the state among many others which will provide employment opportunities to the people of the state and Nigerians."
  },
  {
    "headline": "BAYELSA: Gov Diri lauded for supporting sports development",
    "summarized_story": "Kindly Share This Story:By Emem Idio, YenagoaThe Governor of Bayelsa State Senator Douye Diri has been commended for his unquenchable love and commitment for sports development generally, and for endowing a tournament in his name with the hosting of the maiden edition of the Gov.\nDouye Diri National Scrabble Championship in Yenagoa.\n“As this tournament has shown, we can marry Scrabble with tourism to showcase the beauty of Bayelsa.\nRegardless of the challenges, we still remain grateful to the Governor of Bayelsa State, Senator Douye Diri.\n“I have no doubt that Scrabble has the potential to beam positive spotlights on our state, given the right motivation and support."
  },
  {
    "headline": "Counter-insurgency: Military achieving commendable successes through inter-agency collaboration – COAS",
    "summarized_story": "Kindly Share This Story:The Chief of Army Staff, Maj.-Gen. Faruk Yahaya, says the military has achieved commendable successes in its counter-insurgency operations due to he renewed and enhanced inter-agency collaboration between services and security agencies.\nThe theme of the seminar is “Effective Coordination of Security Agencies Towards Improved Internal Security of Nigeria”.\nRepresented by the Chief of Civil Mikitary Affairs (Army), Maj.-Gen. Anthony Omizoje, the COAS, said that all the existing security threats were surmountable through effective collaboration between security agencies.\nHe said that collaboration was the catalyst to effectively tackle the prevailing security challenges bedeviling the country towards achieving a safe and secure country.\nAdetula said that there was need to have understanding that whatever affects national security would also affect development and vice vasa."
  },
  {
    "headline": "UI don frowns against secession, calls for moral rejuvenation",
    "summarized_story": "Kindly Share This Story:By Adeola BadruThe Dean, Faculty of Arts, University of Ibadan, Professor Abdul Hafiz Oladosu, has identified moral rejuvenation as essential to reduce the act of corruption in the country.\nHe made the call in Ibadan at a stakeholders’ summit organised by Political Awareness Group, PAG, an Association of Muslim Professionals and Technocrats for Good Governance.\nLadoja, who was represented by the former Secretary to Oyo State Government, Barrister Sharafadeen Abiodun Alli, warned against criminalising an ethnic group, maintaining that every tribe has criminal elements.\nThe former Chairman, Oyo State Universal Basic Education, and also the Chairman on the occasion, Dr Sulaiman Adediran, enjoined Muslims to develop themselves politically and be advocates of good governance.\nEarlier, the Chairman, Political Awareness Group, Barrister AbdWaheed Olowonjaye, noted that the organisation stands for good governance and was ready to support those who shared PAG’s agenda."
  },
  {
    "headline": "Senate President cautions against revenge over killing of Gulak",
    "summarized_story": "The President of the Nigerian Senate Dr. Ahmad Lawan, has appealed for restraint on the part of those calling for revenge on the gruesome murder of the Chieftain of the All Progressive Congress APC Ahmed Gulak in Owerri, Imo State.\nGulak, a former Speaker of the Adamawa State House of Assembly was shut to death by unknown gunmen on Sunday in Oweri, Imo State.\nThe Senate President, while condemning the killing, maintained that there can be no justification for the brutal murder of a human being and fellow citizen.\nThe Imo State Police Command, however, announced has since announced that it has neutralised the killers of the foremost politician and lawyer as well as recovered ammunition and vehicles from them.\nThe group, however, withdrew the threat on Monday following the elimination of the suspected killers of the late politician by the state Police Command."
  },
  {
    "headline": "Biafra: Why IPOB cannot give sit-at-home order in Rivers – Gov Wike",
    "summarized_story": "Governor Nyesom Wike of Rivers State has declared that the proscribed Indigenous People of Biafra (IPOB) cannot give a sit-at-home order to the people of his state because they are not part of South-East.\nWike, speaking during an interview on Channels Television’s Politics Today on Monday, reiterated that IPOB doesn’t exist in Rivers.\nWike said, “IPOB cannot make an order for people to sit at home in Rivers State.\nI have said so clearly before because it doesn’t exist in Rivers State.\nRivers State is South-South, we’re in the Niger Delta."
  },
  {
    "headline": "Buhari appoints Muhammad as Senior Citizens Centre board chair, Habib is new NEMA DG",
    "summarized_story": "President Muhammadu Buhari has approved the take-off of the National Senior Citizens Centre and the constitution of a 12-member board.\nThe Centre was passed into law as the National Senior Citizens Centre Act, 2017 to cater for the needs of senior citizens (70 and above) in the country.\nBuhari appointed AVM M. A. Muhammad (rtd) as the Board Chairman; Dr Emem Omokaro as the Director-General.\nThe President also approved the appointment of Ahmed Mustapha Habib as the new Director-General of the National Emergency Management Agency (NEMA).\nHe replaces Muhammad, the board chairman of Senior Citizens Board."
  },
  {
    "headline": "Ahmed Gulak: Ndigbo cannot afford to be linked to senseless murder",
    "summarized_story": "Chris Ngige, Minister of Labour and Employment, has described the gruesome murder of the All Progressives Congress (APC) chieftain and former Political Adviser to President Jonathan, Hon.\n”Ndigbo cannot afford to be linked to a senseless murder or any other action that can bitterly sour our relationship with our brothers from other parts of Nigeria.”The minister appealed to all political actors and aggrieved youths in Imo and every state in the South East to immediately halt the escalating violence and embrace dialogue.\nHe also advises all aggrieved persons to eschew violence as there is nothing that cannot be resolved through dialogue.\nHe, therefore, condoled the government and good people of Adamawa over this tragic loss, especially his immediate family, relatives and friends.\nThe minister similarly condoled with the Enugu State Government and the people of Mbu in Isiuzo Local Government Area over the murder of retired Justice Stanley Nnaji of the Enugu State High Court."
  },
  {
    "headline": "Gulak: Bauchi lawyers seek deployment of strategic security in South-East",
    "summarized_story": "While stating that although the killing of Gulak was painful, Barrister Mu’azu added that northerners should not retaliate as it could lead to anarchy in the country.\nThe chairman stated that it was necessary to look at recent events leading to Gulak’s murder, saying that the proscribed Indigenous People of Biafra (IPOB) had issued a stay-at-home directive to the people of South-East before the sad murder.\nHe then urged the South-East governors to not only condemn the activities of IPOB but also deploy the best known security strategies against its members.\n“We call on the Federal Government to deploy the most sophisticated security strategies in all parts of the country battling one form of security challenge or the other.\n“We equally call on the eastern governors to come out and join Governor Nyesom Wike of Rivers State in condemning the activities of the dreaded group (IPOB) and deploy the best known security strategies against its members,” Mu’azu stated."
  },
  {
    "headline": "On Lagos-Ogun joint development commission",
    "summarized_story": "By Elijah UdofiaSIR: Ogun and Lagos states can be likened to Siamese twin.\nAn operation to separate one from another is so complicated that any mistake, can lead to the death of either of the twin.\nADVERTISEMENTIn an effort to take full advantage of their closeness and shared socio-cultural affinity for the benefit of their people, Ogun and Lagos State governors, Dapo Abiodun and Babajide Sanwo-Olu, on May 24, at the Presidential Lodge, Abeokuta, signed a Memorandum of Understanding to formally inaugurate the Lagos-Ogun Joint Development Commission.\nThe joint commission is expected to focus on addressing infrastructural deficit, particularly road, that is pronounced in the border areas.\nThe physical planning including disaster management, partnership in the cultivation and processing of food crops, among others, are other areas the commission will work on."
  },
  {
    "headline": "What is happening in Southeast is terrorism",
    "summarized_story": "What makes these tragedies more devastating is the open support by some citizens of the Southeast.\nOn a supposedly #BiafraRemembranceDay, instead of being a solemn occasion, there were reports of killings and arsons in the south-east.\nDoes freedom fighting entail killing and destruction of lives?\nThe southeast is a commercial centre; the multiplier effect of the activities of gunmen on the region is colossal.\nWhat is happening in the southeast is terrorism."
  },
  {
    "headline": "Tasks before the new NPA leadership",
    "summarized_story": "ADVERTISEMENTAnother particularly important issue is inefficient and inadequate port and shipping infrastructure.\nAny reform the new NPA boss would embark must factor in the pathetic state of port access roads, particularly, the Lagos port complex, Apapa and Tin Can Island Port.\nWorried, experts have repeatedly noted that if the Nigerian maritime sector was properly harnessed and managed, it can generate N7trillion to the national coffers and create numerous jobs for Nigerians.\nPut succinctly, Nigeria and Nigerians are unable to fully reap the benefits available in the maritime sector.\nSo, Bello-Koko would be expected to take encumbrances affecting the optimisation of the maritime sector to the National Assembly for legislative overhaul."
  },
  {
    "headline": "Nigeria: A frail or a failed state?",
    "summarized_story": "Nigeria’s is experiencing a reckless political system that is corrupt, self-serving, and manipulative.\nJust like a dilapidated building can be reinforced to save it from collapsing, can Nigeria be resuscitated from its frail state?\nI would say joint actions of Nigerian citizens can create the basis for offering Nigeria a new lease of life.\nIn addition, the country has a frail working system as a result of a failed governance.\nNigeria is in a state of comatose."
  },
  {
    "headline": "BREAKING: Traders injure as explosion rocks market in Rivers",
    "summarized_story": "From TONY JOHN, Port HarcourtSome traders at the Mile 3 Market in Diobu axis of Port Harcourt, Rivers State, yesterday, sustained injuries following an explosion of a substance suspected to be dynamite that occurred in the place.\nDaily Sun gathered that the explosion occurred in the morning at the Mile 3 Motor Park, which has been converted to a trading point.\nEyewitnesses said some traders and passengers sustained injuries as they scampered for safety following the explosion.\nOmoni said the Explosive Ordinance Disposal (EOD) was immediately despatched to the scene to sweep and render the entire market safe.\nSimilarly, major business areas like Okija and Azikiwe Streets in Port Harcourt City, were partially open."
  },
  {
    "headline": "Breaking: Gunmen kill Imo Immigration command’s provost",
    "summarized_story": "From Stanley Uzoaru, OwerriGunmen continued their nefarious activities in Imo State as they killed the provost of the State command provost of the Nigerian Immigration Service,(NIS) Okiemute Mrere.\nAccording to the source, Mrere, was riding a Hilux van belonging to NIS when he was allegedly ambushed, and shot to death.\nBut his official Hilux van he was riding in before his death was riddled with bullet the source added.\n“The provost of Nigerian Immigration service, Imo state command, Okiemute Mrere, has been assassinated.\nHe was riding in his official Hilux van when he was attacked, they shot him several times judging from the bullet holes on his official vehicle."
  },
  {
    "headline": "Michael Okpara centenary celebration holds in Abuja June 3",
    "summarized_story": "The first posthumous and commemorative centenary anniversary in honour of Dr. Michael Iheonukara Okpara, first republic politician, nationalist and former premier of Eastern Region of Nigeria (1959 -1966) holds on Thursday, June 3 at Sheraton Hotels and Towers, Abuja.\nThe event will also feature the presentation of Okpara Leadership Prize to a number of personalities, two universities and their Vice Chancellors, namely Michael Okpara University of Agriculture, Umudike (MOUAU) in Abia State and the University of Nigeria, Nsukka (UNN).\nThe Centenary Organising Committee proffered reasons for presenting the Okpara Leadership Prize to the personalities.\nThe amiable Premier and nationalist, Dr. Okpara would have been 100 years old having been born on 25 December 1920.\nDr. Okpara was former member of Eastern Nigeria House of Assembly on the ticket of the National Council of Nigeria and the Cameroons (NCNC)."
  },
  {
    "headline": "Sit-at-home: Tension, fear grip South East",
    "summarized_story": "Similarly, MASSOB leader, Uchenna Madu, yesterday, warned the Nigeria security agencies that their threats would not hold waters.\nThis came as the various police commands threatened to crush any form of procession or gathering relating to Biafra today.\nAttendance in many churches was scanty due to fear, as many people assumed the sit-at-home started yesterday as it used to.\nSimilarly, a wave of uncertainty enveloped Enugu State, yesterday, ostensibly because of recent security threats.\nHis warning is coming on the heels of the sit-at-home order for today by members of the Indigenous People of Biafra (IPOB)."
  },
  {
    "headline": "COVID-19: Erring passengers risk jail or N500,000 fine",
    "summarized_story": "By Doris ObinnaThe Lagos State Government has said that new Coronavirus Act of 2021 empowers Mr.\nGovernor to sanction erring individuals with fines of up to N500,000 and/or imprisonment of up to five years.\nIn a statement, yesterday, the commissioner said the state is going to follow to the letter laid sanctions by Lagos State House of Assembly, which is also implemented by the Attorney General of the state.\nWe have isolated 433 passengers in our various accredited hotels and facilities; 262 are in Isolation and 154 passengers have been discharged with a negative COVID-19 test.\n“All absconders will also face the penalties of the coronavirus pandemic Law 2021 of Lagos State, including varying lengths of prison time up to one year and fines of up to N500,000."
  },
  {
    "headline": "Buhari Appoints Kingibe as Special Envoy on Lake Chad Basin",
    "summarized_story": "Olawale Ajimotokan in AbujaPresident Muhammadu Buhari has approved the appointment of Ambassador Babagana Kingibe as his Special Envoy with cabinet rank status to Chad and the Lake Chad Basin Region.\nIn his new role as the Special Envoy, Kingibe will among others monitor development in Chad and the Lake Chad Basin Region by aiding reconciliation and seamless progress toward the return to democratic rule at the end of the current Transitional Council Rule.\nHe is to collaborate with member countries and partners in the region with similar initiative to restore stability, promote peace and security.\nHe is also to promote other initiatives ancillary to the restoration of peace in Chad, the north- east of Nigeria and the Lake Chad Basin Region.\nKingibe, who was on the joint ticket with late Chief Moshood Abiola, winner of the annulled June 12, 1993 Presidential election, is an accomplished multi-lingual diplomat, who had at various times served the nation as Federal Permanent Secretary, Secretary to the Constituent Assembly, Cabinet Minister and Secretary to the Government of the Federation."
  },
  {
    "headline": "FCT Police Debunk Sowore Shooting Report",
    "summarized_story": "Olawale Ajimotokan in AbujaThe FCT Police have debunked a video that has gone viral on social media that activist, Omoyele Sowore, was shot by a female Assistant Commissioner of Police Monday morning at the Unity Fountain.\nThe Police Public Relations Officer,ASP Yusuf Mariam, issued the rebuttal in a statement on behalf of the Commissioner of Police, FCT Police Command.\nShe said that contrary to the speculation, police operatives professionally restored calm at the Unity Fountain following attempts by a group of protesters to incite public disturbance.\nASP Yusuf said the protesters who went on ramapage were resisted by police operatives in order to prevent them from causing a breakdown of law and order, adding there was no record of any shooting incident as at the time of this release.\nThe Command enjoins residents to remain calm and law-abiding while reaffirming its commitment towards the protection of lives and property within the FCT."
  },
  {
    "headline": "Bandits Kill 15 in Niger Community",
    "summarized_story": "By Laleye Dipo in MinnaNo fewer than 15 villagers are reported to have been killed in Beri town in Bobi district of Mariga local government of Niger state on Monday morning.\nTHISDAY was told that the men of the local vigilant group were able to neutralise five of the bandits.\nAlso on Monday, some bandits raided Ungwan Bako in the Kotonkoro district of Mariga local government abducting many people mostly women and children.\nThe Niger State Emergency Management Agency NSEMA confirmed the incidents but did not give details.\nPolice Public Relations Officer Niger State Police Command Public Relations Officer, DSP Wasiu Abiodun, did not respond to calls made to his cell phones for comments on the development."
  },
  {
    "headline": "Revenue Agencies Remit N1.5tn to Federation Account in Q1",
    "summarized_story": "By Ndubuisi Francis and James EmejoThe Revenue Mobilisation Allocation and Fiscal Commission (RMAFC) has disclosed that the revenue generating agencies in the country made a total remittance of over N1.5 trillion (N1,538,021,801,518.37) into the Federation Account during the first quarter of 2021.\nThe Chairman of the Commission, Elias Mbam, said this while receiving a revenue performance report from the Post-Mortem Sub Committee of the Federation Account Allocation Committee (FAAC) in Abuja.\nThe sum of N496,390,010,655.56 was also remitted into the Federation Account as Value Added Tax (VAT) in the first quarter of 2021.\nThis, according to Mbam, surpassed the targeted tax revenue by N36,803,760.80, representing 108.01 per cent for the period under review.\nMbam stated that RMAFC was committed in its effort to increasing revenue generation into the Federation Account and equitable distribution of the accrued revenues to the three tiers of government."
  },
  {
    "headline": "Rescue our Children from Kidnappers, Father of Abducted Girls Appeals to FG, Niger",
    "summarized_story": "Female school teacher among those kidnappedBy Laleye DipoThe father of five of the abducted girls in Salihu Tanko Islamiyya School in Tegina Rafi Local Government Area of Niger State, Ali Mohammed, a tipper driver, has appealed to the state and federal governments to rescue the pupils from the kidnappers.\nSpeaking in an interview with THISDAY Monday, Mohammed said no fewer than 25 of the bandits stormed the school and took away the pupils to an unknown destination.\nAccording to him, the school had a population of over 200 pupils with more than half of the population being girls, adding that most of the kidnapped pupils are girls.\nMohammed wondered why policemen, whose station is located a few meters from the school, could not rescue the pupils from the kidnappers.\nIn his statement, Musa described the incident “as callous and unfortunate” before asking the federal government to strengthen security in Niger State, particularly in areas where bandits have been terrorizing the people."
  },
  {
    "headline": "UNVEILED: CSP Daniel, Notorious Ex-SARS Officer Who Shot Sowore, Supervised Killing Of Shi'ite Members, Tear-gassed Charly Boy",
    "summarized_story": "Altine Hyelhira Daniel, a notorious police officer who shot human rights activist, Omoyele Sowore during a protest to demand an end to insecurity in the country was part of the deadly Special Anti-Robbery Squad (SARS), sometimes known as killer squad before it was banned, SaharaReporters has gathered.\nSowore was on Monday morning shot at the Unity Fountain, Abuja while he was trying to gain entrance into the place.\nThe activist was said to have been speaking with a detachment of police officers stationed at the public facility when the female officer fired at him.\nThe notorious female officer was also the one that led the detachment of police officers that tear-gassed Nigerian showbiz maestro and rights activist, Charles Oputa, popularly known as Charly Boy, in August 2017 during a peaceful protest.\nDaniel as well led many operations that led to the death of many Shi'ites members during #FreeEl-zakzaky protests in Abuja, the nation's capital."
  },
  {
    "headline": "UNVEILED: CSP Daniel, Notorious Ex-SARS Officer Who Shot Sowore, Supervised Killing Of Shi'ite Members, Tear-gassed Charly Boy",
    "summarized_story": "Altine Hyelhira Daniel, a notorious police officer who shot human rights activist, Omoyele Sowore during a protest to demand an end to insecurity in the country was part of the deadly Special Anti-Robbery Squad (SARS), sometimes known as killer squad before it was banned, SaharaReporters has gathered.\nSowore was on Monday morning shot at the Unity Fountain, Abuja while he was trying to gain entrance into the place.\nThe activist was said to have been speaking with a detachment of police officers stationed at the public facility when the female officer fired at him.\nThe notorious female officer was also the one that led the detachment of police officers that tear-gassed Nigerian showbiz maestro and rights activist, Charles Oputa, popularly known as Charly Boy, in August 2017 during a peaceful protest.\nDaniel as well led many operations that led to the death of many Shi'ites members during #FreeEl-zakzaky protests in Abuja, the nation's capital."
  },
  {
    "headline": "Another Foreign Affairs Director In Buhari Government Caught In Financial Fraud, Shielded By Ministers Since 2019",
    "summarized_story": "An assistant director in the Ministry of Foreign Affairs, Mrs Amie Alex-Irobi, is presently at the centre of a N2.5 million financial fraud which she engaged in towards a firm, Eraskorp Nigeria Limited, according to documents obtained by SaharaReporters.\nThe firm, after the director defaulted, then wrote a petition to the Ministry and the woman was subsequently brought before the Economic and Financial Crimes Commission, for more detailed investigations.\n“As at April 2019, Mrs Amie Alex-Irobi had neither refunded the said sum of money nor sourced any contracts/projects for our client.\nTop sources told SaharaReporters that after Alex-Irobi came back from the EFCC, her financial fraud investigations gradually died down after lobbying with the two ministers.\n“In 2016, she was demoted from rank of Assistant Director GL 15 to Chief Programme Officer GL 14 for acts of serious misconduct."
  },
  {
    "headline": "Another Foreign Affairs Director In Buhari Government Caught In Financial Fraud, Shielded By Ministers Since 2019",
    "summarized_story": "An assistant director in the Ministry of Foreign Affairs, Mrs Amie Alex-Irobi, is presently at the centre of a N2.5 million financial fraud which she engaged in towards a firm, Eraskorp Nigeria Limited, according to documents obtained by SaharaReporters.\nThe firm, after the director defaulted, then wrote a petition to the Ministry and the woman was subsequently brought before the Economic and Financial Crimes Commission, for more detailed investigations.\n“As at April 2019, Mrs Amie Alex-Irobi had neither refunded the said sum of money nor sourced any contracts/projects for our client.\nTop sources told SaharaReporters that after Alex-Irobi came back from the EFCC, her financial fraud investigations gradually died down after lobbying with the two ministers.\n“In 2016, she was demoted from rank of Assistant Director GL 15 to Chief Programme Officer GL 14 for acts of serious misconduct."
  },
  {
    "headline": "Attempts To Murder Sowore: In Vain Buhari's Bangles Cast! By Kunle Wizeman Ajayi",
    "summarized_story": "The protest at Unity Fountain was called by the Femi Falana-led T-PAPS and Omoyele Sowore was invited alongside other change-seeking activists and people.\nAs early as 6.00am, the Unity Fountain had been sealed by war-ready police and DSS officers.\nDSP Altine Daniel herself shot directly at Sowore and even told him pointedly after the activist queried that; \"I did!\"\nSowore at the hospital after being shotBut DSP Altine and the police thugs of President Buhari have failed again.\nThe drunk SARS officers were pointedly agitated to inflict deadly injuries on us all, and especially Omoyele Sowore."
  },
  {
    "headline": "Wike to Uzodimma: Don't politicise Gulak's death... allow police conclude investigation",
    "summarized_story": "Nyesom Wike, governor of Rivers, says it is too early to say the murder of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, is politically-motivated.\nAdvertisementReacting to the development, Wike, in an interview with Channels Television on Monday, asked Uzodimma to allow security operatives conclude their investigation before attributing the murder to politicians.\nThe Rivers governor said the comments of his Imo colleague show that Uzodimma already knows the outcome of the police investigation.\nI think the governor of Imo state, my brother, Hope Uzodimma, should allow the security agencies to do their proper investigation,” Wike said.\nHow could a man at that level come to Imo state incognito?”"
  },
  {
    "headline": "Wike to Uzodimma: Don't politicise Gulak's death... allow police conclude investigation",
    "summarized_story": "Nyesom Wike, governor of Rivers, says it is too early to say the murder of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, is politically-motivated.\nAdvertisementReacting to the development, Wike, in an interview with Channels Television on Monday, asked Uzodimma to allow security operatives conclude their investigation before attributing the murder to politicians.\nThe Rivers governor said the comments of his Imo colleague show that Uzodimma already knows the outcome of the police investigation.\nI think the governor of Imo state, my brother, Hope Uzodimma, should allow the security agencies to do their proper investigation,” Wike said.\nHow could a man at that level come to Imo state incognito?”"
  },
  {
    "headline": "Uzodimma: Gulak’s murder appears to be political assassination",
    "summarized_story": "Hope Uzodimma, governor of Imo state, says the killing of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, seems to be politically-motivated.\nAdvertisementGulak was murdered in Owerri, Imo capital, on Sunday while on his way to the airport.\n“Alhaji Ahmed Gulak was in Imo State for a national assignment.\nThat is exactly why his gruesome murder appears to be a clear case of political assassination.\n“Let me make it very clear that everything will be done by security agencies to find those who murdered Gulak and their sponsors."
  },
  {
    "headline": "Uzodimma: Gulak’s murder appears to be political assassination",
    "summarized_story": "Hope Uzodimma, governor of Imo state, says the killing of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, seems to be politically-motivated.\nAdvertisementGulak was murdered in Owerri, Imo capital, on Sunday while on his way to the airport.\n“Alhaji Ahmed Gulak was in Imo State for a national assignment.\nThat is exactly why his gruesome murder appears to be a clear case of political assassination.\n“Let me make it very clear that everything will be done by security agencies to find those who murdered Gulak and their sponsors."
  },
  {
    "headline": "Gulak was in Imo as part of constitution review committee, says son",
    "summarized_story": "Mohammed, son of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, says his father visited Imo as a member of the committee on constitutional review.\nAdvertisementGulak, a chieftain of the All Progressives Congress (APC), was killed on Sunday in Owerri, Imo state capital.\nAdvertisementThe deceased was the chairman of the APC committee that conducted the primaries for Imo governorship election in 2019.\nAdvertisement“Afterwards, everybody in the house began to cry.’’On what took Gulak to Imo, he noted that the deceased was part of the committee on ongoing constitutional review.\nHe was happy and told me ‘God bless you, my son’,” Mohammed said."
  },
  {
    "headline": "Almentor’s online learning platform for Africa and the Middle East gets $6.5m backing from Partech, Sawari and Sango Capital",
    "summarized_story": "Almentor, a video-based online learning platform for the Middle East and North Africa, has raised $6.5m in a Series B round led by Partech from its Africa Fund.\nHow Almentor worksFrom gamified mobile apps to websites that enable streaming, online learning comes in different varieties across the world.\nAlmentor can be accessed in multiple countries across Africa but the content is focused on North Africa and the Middle East.\nIn 2019, Almentor’s $4.5 million Series A was led by Sawari Ventures, an Egyptian firm that closed a $71 million fund in April.\nSawari also invested in this Series B round as Sango Capital, a firm based in South Africa."
  },
  {
    "headline": "Bezos Expeditions invests again as Chipper Cash raises $100 million in Series C round",
    "summarized_story": "Barely seven months after a $30 million funding round in which Jeff Bezos participated, Chipper Cash has raised $100 million in a Series C round.\nExisting Chipper Cash investors like Deciens Capital, Ribbit Capital, Bezos Expeditions and 500 Startups participated.\nChipper Cash enables individuals to transfer money at zero fees between African countries.\nSegunjogi’s comment suggests that Chipper Cash may also now be worth over $1bn, even if they have raised $80m less than the Nigerian fintech.\nLike Flutterwave, Chipper Cash is headquartered in San Francisco but has over 200 employees working out of Africa and serving African customers."
  },
  {
    "headline": "The Next Wave: Nigeria and other real-time payments leaders",
    "summarized_story": "Another space where Nigeria’s example may influence the global space is real-time payments, as we’ll see shortly after a message from our partners.\nIndia’s real-time payments revolution started in 2016 when the Unified Payments Interface (UPI) was launched.\nBut before all this, Nigeria made a similar historic move with NIBSS Instant Payments (NIP) in 2011.\nNIBSS (Nigeria Interbank Settlement Scheme, a company co-owned by banks in Nigeria) built E-bills Pay on the NIP platform to enable account-to-account payments.\nIt is already being called “NIBSS for fintechs.”The upshot: Nigeria does not have India or China’s population to top real-time payments lists."
  },
  {
    "headline": "2021 Oxford Africa Conference Innovation Fair Pitch competition: Winners announced!",
    "summarized_story": "The Oxford Africa Conference Innovation Fair took place on the 28th and 29th of May 2021 with a cohort of 11 highly innovative companies, based across five African countries.\nIn addition, each company received one-on-one mentorship from an industry leader in their field, which was enabled by the support of the TechCabal team.\nThe Fair ended with a highly competitive pitch competition judged by: Dr. Watu Wamae (PhD) – Research Engagement Manager at the Africa Oxford Initiative; Dr. Amy Kao (PhD) – Oxford Sciences Innovation Associate and Dr. Tinashe Chandauka – Oxford Sciences Innovation Associate.\nEmerging from the 11 finalists, the overall cash prize winners were: Maxi Mobility winning 5,000 GBP for first place, Hustlenomics winning 2,500 GBP for second place and Sanaa space winning third prize of 1,000 GBP.\nThe 11 finalist companies in the Oxford Africa Conference Innovation Fair were:EcoboraEcovonHustlenomicsMazi MobilityNatal CaresNuna Premium ResourcesAkoo AudiobooksPledreRecon Health MediaSanaa SpaceThe icreate ProjectFollow the Oxford Africa Conference social media pages or look at our website to learn more about the companies and conference:Or contact:Shaan Pattni, Daniel KandieCo-Managers of the Oxford Africa Conference Innovation Fair"
  },
  {
    "headline": "Unicorn Incubation Campus Launch",
    "summarized_story": "Unicorn Group is launching the largest incubation campus.\nEverywhere you turn, Africans are innovating and creating solutions that are not only unlocking Value on the continent but also putting the world on notice, this is why the Unicorn Campus is giving innovation a home.\nAnyone from age 10 can be a member at the first 24-hour innovation and Incubation house in Africa.\nWith Access Capital for bringing great ideas to life, mentors, advisers, library, technology, resources, global networks, ideas.\nThe campus features 6 floors of business learning and innovation that will help create a world-class network for African start-ups and entrepreneurs."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How Nigerian credit fintech startup, BFREE, is helping Africans repay their loans",
    "summarized_story": "AdvertisementWhile loan collection for BVN-linked bank accounts may be somewhat smooth, the reverse is the case for credit fintech startups.\nMoreover, with millions of people demanding personal loans, lending amounts for these platforms become smaller.\nThat’s exactly what we are doing at BFREE,” Flosbach says.\n“Here we deploy machine learning algorithms that predict the probability to repay a customer and define the use case of the customer,” Flosbach submits.\nWhile they reach out to the debtors, the co-founders believe that in an ethical credit collection, not everyone would repay."
  },
  {
    "headline": "How Nigerian credit fintech startup, BFREE, is helping Africans repay their loans",
    "summarized_story": "AdvertisementWhile loan collection for BVN-linked bank accounts may be somewhat smooth, the reverse is the case for credit fintech startups.\nMoreover, with millions of people demanding personal loans, lending amounts for these platforms become smaller.\nThat’s exactly what we are doing at BFREE,” Flosbach says.\n“Here we deploy machine learning algorithms that predict the probability to repay a customer and define the use case of the customer,” Flosbach submits.\nWhile they reach out to the debtors, the co-founders believe that in an ethical credit collection, not everyone would repay."
  },
  {
    "headline": "It might get harder for budding African creators to make money with YouTube’s new terms of service",
    "summarized_story": "Google-owned video-sharing platform, YouTube, released an update to its terms of service in November 2020.\nThe update revealed that taxes will now be levied on the royalties of content creators resident in the US, who are already entitled to payments on the platform.\nThis will soon take place in other countries as the new terms of service are rolled out.\nThe YPP was launched in December 2007 as a means of revenue generation for creators, who allow ads to appear on their videos for an amount of money.\nThe new policy puts some creators on the platform at a disadvantage, especially those still looking to grow their channels."
  },
  {
    "headline": "News",
    "summarized_story": "Going by an update to @YouTube terms of service, from June 1 2021, creators outside the US that are not on the YouTube Partner Program (YPP) might now have ads appear on their videos with no entitleme…"
  },
  {
    "headline": "Oil up, near $70 a barrel as demand outlook improves",
    "summarized_story": "Oil prices firmed on Monday, with Brent trading near $70 a barrel on growing optimism that fuel demand will grow in the next quarter, while investors looked ahead to see how producers will respond at this week’s OPEC+ meeting.\nTrading was thin as U.S. and UK markets were closed on Monday due to public holidays….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Is crypto the future of money?",
    "summarized_story": "Imagine walking into your favourite clothing store and after shopping for some outfits, you are told the price is 0.00062 BTC rather than N10,000.\nOr you are taking a trip and you don’t need to take any physical cash and from the plane tickets, accommodation and food all paid with Bitcoin and everyone receives it…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s NAFEX adoption may be long walk from full unification -",
    "summarized_story": "Issues around liquidity and restriction on dollar deposits and usage are bigger challenges to full unification than merely recognising an overdue update on the CBN website, analysts say.\nRead Also: BDCs tell public to patronize CBN-licenced operatorsNigeria, unlike it African peers, has continued to operate multiple exchange rate windows.\nAccording to him, if the market is liberalised the naira will settle at its true value, which is higher than the current NAFEX rate.\nData collated from the black market implies a gap of N83 between the now official NAFEX rate and the parallel market rate.\nAlthough on the rise, the falling global crude price always reduces FX supply in Nigeria and affects the exchange rate like in 2016 and 2020."
  },
  {
    "headline": "World No Tobacco Day: Edo govt urges urgent measures to save over 16,000 lives lost annually to tobaccoC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has expressed concern over 16,100 Nigerians killed annually by tobacco, calling for urgent measures and partnerships among relevant stakeholders to check its consumption and reduce the health and other risks associated with tobacco use.\nPermanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa said this while briefing journalists in Benin City in commemoration of the World No Tobacco Day, marked by the World Health Organisation (WHO) and other organs to raise awareness and check the consumption of tobacco.\n“The Tobacco Atlas 2018 report for Nigeria, estimates more than 16,100 annual deaths from tobacco-related diseases.\n“Today as we observe World No Tobacco Day, I call on people of all ages, especially the young, to join the fight against the tobacco epidemic.\nI encourage youth groups to build a movement for a tobacco free generation."
  },
  {
    "headline": "Ize Iyamu Congratulates Gov Obaseki, pledges loyalty – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Candidate of the All Progressives Congress (APC) in the last Governorship election in Edo State, Mr. Osagie Ize-Iyamu on Monday congratulated the governor of Edo state, Mr. Godwin Obaseki over his victory at the Supreme Court which upheld his re-election.\nThis was contained in a letter addressed to the state governor and signed by Osagie Ize-Iyamu in Benin City, Edo state.\nIze-Iyamu said the judgement of the Supreme Court last Friday however put an end to the series of litigations over last year’s governorship elections in the state.\nOn our part, our party, the APC had only one case against Your Excellency and your party.\nOur appeal is that you consider paying them their entitlements since it is now late for them to return to their offices."
  },
  {
    "headline": "Obaseki, Shaibu, others to receive second jab of COVID-19 vaccine tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…as Edo flags off second dose vaccinationBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, his deputy, Rt.\nComrade Philip Shaibu and other political, religious and traditional leaders in the state will tomorrow, Tuesday, June 01, 2021, receive the second jab of the Oxford-Astrazeneca COVID-19 vaccine, as the state begins second dose vaccination in its efforts to contain the pandemic and protect citizens.\nThe Permanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa, who disclosed this to journalists in Benin City, urged eligible citizens to present themselves for the second dose vaccination to get full protection against the virus.\nAccording to him, “Obaseki and other dignitaries will be vaccinated with the second dose of the vaccine at the official flag-off ceremony coming up on Tuesday, June 01, 2021.\nIrowa further noted that the COVID-19 vaccines in the state are safe, effective and administered free of charge."
  },
  {
    "headline": "Edo market women hail Supreme Court verdict, say confidence in Obaseki was never misplaced – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Traders in Edo State have hailed the Supreme Court verdict dismissing the alleged certificate forgery suit against Governor Godwin Obaseki and affirming the governor’s victory at the September 19 governorship poll, adding that Edo people’s confidence in the governor was never misplaced.\nAnother trader, Mrs. Vivian Obi, while commending the verdict of the Supreme Court, said, “I never had any doubt about Governor Obaseki’s qualification for the number one seat in the state.\n“Obaseki has never disappointed the Edo people.\nI am happy with the verdict of the Supreme Court.\nThe Supreme Court’s five-man panel of justices on May 28, 2021 upheld the ruling of the Appeal Court, which dismissed the alleged certificate forgery suit filed by the APC against the Governor, during the 2020 governorship election."
  },
  {
    "headline": "One dead, 50 houses razed in Gombe communal conflict",
    "summarized_story": "ADVERTISEMENTGombe State government on Monday said a communal clash between Shongom and Filiya districts over farmland had resulted in the death of one person and the burning of over 50 houses.\nThe state’s Commissioner of Information and Culture, Julius Ishaya stated this at a briefing after a Security Council meeting in Gombe.\nHe stated that the clash, which took place on Saturday, May 29, left one woman dead and no fewer than 50 houses, food and other essential items burnt.\nPeace returnsAlso speaking, Adamu Dishi, the state’s Commissioner of Internal Security and Ethical Orientation, said the affected areas were now calm as peace had been restored.\nHe added that peace had been restored to the affected areas and his men were still patrolling the areas to ensure the maintenance of law and order."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun 2022: Group drums support for Oyetola’s re-election",
    "summarized_story": "The group enjoined the Oyetola to remain focused and concentrate on continuous delivery of the dividend of democracy to the people of the state so as to guarantee continuous victory for the party in all elections.\nOther members of the team at the meeting include Sen. Babajide Omoworare, Hon.\nAdeyinka Ajayi, Oluomo Sunday Akere, former Commissioner for Information and Strategy, RH.\nAkintunde Adegboye, Hon.\nSemiu Ayofe, Mr Segun Omoworare and Elder Tunde Adedeji."
  },
  {
    "headline": "Tributes as Abuja bids Joe Nwodo farewell",
    "summarized_story": "The night of tribute organized by friends and relations of the late constitutional lawyer attracted prominent heads from political and corporate community across the country.\nPrince Secondus said the brilliance exhibited by Late Nwodo in Port Harcourt at the defunct NRC Presidential Convention in the third republic electioneering could only come from an exceptional and uncommon talent.\nHe said that in Dr Joe Nwodo was that example of good heads being kept out of power noting that such action is responsible for the glaring leadership vacuum in our land today.\nAlhaji Idi Farouk who chaired the organizing Committee of the National Convention in question in 1993 where Joe Nwodo shone like star recalled the brilliance of the great icon whom he also described as a good man and an accommodating leader.\nThe wake keep ceremony will be at Dr Joe Nwodo’s Residence in Ukehe House, Igbo Etiti while the funeral mass is to hold at St.Peter’s Catholic Church,mUkehe on Saturday and on a Sunday outing servicing at Mother of Christ Parish, Ukwuaji, Ukehe."
  },
  {
    "headline": "NNPC to deduct N126bn from June remittance to FAAC amid rising subsidy payment",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), has given a notice to the Federation Account and Allocation Committee (FAAC) that it will deduct about N126 billion from its remittance to the Federation Account at the next meeting scheduled for June, amid rising subsidy payments.\nNNPC stated that its overall crude oil lifting for both export and domestic in March 2021, recorded 29 per cent decrease relative to the 10.79Mbbls lifted in February 2021.\nMCA is a financing agreement whereby the International Oil Companies (IOCs) advance loans to NNPC to invest in upstream projects.\nOn the analysis of receipts due in April, gross revenue from JV crude was N124.3 billion, JV gas was N26.1 billion, while N5.8 billion was received from miscellaneous sources, amounting to N156.3 billion.\nAfter deduction of royalty, JV cost recovery, profit before tax and taxes, receipts from JV crude came down to N5.5 billion, while that of JV gas stood at N7.8 billion."
  },
  {
    "headline": "Streets, markets deserted in Southeast, Asaba over IPOB’s sit-at-home order",
    "summarized_story": "Major markets and streets in Nigeria’s Southeast and Asaba, Delta State, South South, were deserted on Monday over a sit-at-home order issued by the Indigenous Peoples of Biafra (IPOB) in honour of those killed during the Nigeria-Biafra war.\nIn Abia State, streets were deserted and shops are under lock and key while in Anambra State, the situation is the same.\nThe inner streets were deserted with security men positioned at different locations.\nMany businesses in Delta State capital, Asaba were also shut as residents comply with the sit-at-home order.\nThe expressway leading to the head bridge was completely deserted while businesses along the expressway were also shut."
  },
  {
    "headline": "Buhari Directs Security Agents To Ensure Speedy Release Of Niger School Children",
    "summarized_story": "President Muhammadu Buhari has charged the nation’s security and intelligence agencies to expedite efforts towards the recovery of the 200 children kidnapped from an Islamic school in Niger State.\nAccording to a statement by presidential spokesman, Garba Shehu, the President, who received briefing on the latest incident of school kidnapping, condemned as unfortunate, the kidnapping of children from schools and urged all the agencies involved in the rescue operation to do their utmost in securing their immediate release.\nHe also directed that the concerned government agencies to extend possible support to the families of the kidnapped children."
  },
  {
    "headline": "Buhari Directs Security Agents To Ensure Speedy Release Of Niger School Children",
    "summarized_story": "President Muhammadu Buhari has charged the nation’s security and intelligence agencies to expedite efforts towards the recovery of the 200 children kidnapped from an Islamic school in Niger State.\nAccording to a statement by presidential spokesman, Garba Shehu, the President, who received briefing on the latest incident of school kidnapping, condemned as unfortunate, the kidnapping of children from schools and urged all the agencies involved in the rescue operation to do their utmost in securing their immediate release.\nHe also directed that the concerned government agencies to extend possible support to the families of the kidnapped children."
  },
  {
    "headline": "Buhari Appoints Omokaro As Pioneer DG Of National Senior Citizens Centre",
    "summarized_story": "President Muhammadu Buhari has approved the take-off of the National Senior Citizens Centre with the approval of the constitution of its 12-member Board with immediate effect.\nLEADERSHIP reports that the National Senior Citizens Centre Bill was passed into law as the National Senior Citizens Centre Act, 2017 to cater for the needs of senior citizens (70 and above) in the country.\nMuhammad (rtd) as the chairman of the Board with Mansur Kuliya, representing the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development; Dr Chris Osa Isokpunwu representing the Federal Ministry of Health; Mr Umar Abdullahi Utono representing the Federal Ministry of Works and Housing; and Dr John Olushola Magbadelo representing Federal Ministry of Labour and Productivity as members.\nOther members include Mrs Bulus Friya Kimde representing the Federal Ministry of Women Affairs; Mr Sani Ibrahim Mustapha representing the Pension Transitional Arrangement Directorate (PTAD); Professor Usman Ahmed representing the Geriatric Association of Nigeria; Arc.\nThe President also approved the appointment of Ahmed Mustapha Habib as the new Director-General of the National Emergency Management Agency (NEMA) to replace AVM Muhammad (rtd) who is now chairman of the National Senior Citizens Centre."
  },
  {
    "headline": "Buhari Appoints Omokaro As Pioneer DG Of National Senior Citizens Centre",
    "summarized_story": "President Muhammadu Buhari has approved the take-off of the National Senior Citizens Centre with the approval of the constitution of its 12-member Board with immediate effect.\nLEADERSHIP reports that the National Senior Citizens Centre Bill was passed into law as the National Senior Citizens Centre Act, 2017 to cater for the needs of senior citizens (70 and above) in the country.\nMuhammad (rtd) as the chairman of the Board with Mansur Kuliya, representing the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development; Dr Chris Osa Isokpunwu representing the Federal Ministry of Health; Mr Umar Abdullahi Utono representing the Federal Ministry of Works and Housing; and Dr John Olushola Magbadelo representing Federal Ministry of Labour and Productivity as members.\nOther members include Mrs Bulus Friya Kimde representing the Federal Ministry of Women Affairs; Mr Sani Ibrahim Mustapha representing the Pension Transitional Arrangement Directorate (PTAD); Professor Usman Ahmed representing the Geriatric Association of Nigeria; Arc.\nThe President also approved the appointment of Ahmed Mustapha Habib as the new Director-General of the National Emergency Management Agency (NEMA) to replace AVM Muhammad (rtd) who is now chairman of the National Senior Citizens Centre."
  },
  {
    "headline": "Buhari Appoints Kingibe As Special Envoy On Chad, Lake Chad Region",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Ambassador Babagana Kingibe, as his Special Envoy with cabinet rank status, to Chad and the Lake Chad Basin region.\nHe said the Special Envoy will amongst others: “Monitor developments in Chad and the Lake Chad Basin Region; aid reconciliation and seamless progress towards return to democratic rule at the end of the current Transitional Military Council’s rule.\n“ Promote any other initiative ancillary to the restoration of peace and security in Chad, the North East Nigeria and the Lake Chad Basin Region.\n“President Buhari has by this appointment demonstrated the determination of Nigeria to lead regional security efforts that will stabilize the Lake Chad Basin Region, bring peace to Chad and ultimately eliminate the Boko Haram Insurgency in the North East zone of Nigeria.\nKingibe is an accomplished multi-lingual diplomat, who had at various times served the nation as Federal Permanent Secretary, Secretary to the Constituent Assembly, Cabinet Minister and Secretary to the Government of the Federation."
  },
  {
    "headline": "Man recounts how Pastor told him to drink wife’s urine for 2yrs until the unexpected happened",
    "summarized_story": "A man has shared a bitter story of how his pastor had instructed him to drink his wife’s urine for two years because of wealth.\nMeanwhile, the fake pastor has been having an affair with his wife within this period and got her pregnant.\nDo you know I have been drinking my wife’s urine for 2 years now because I want to be rich and work in an oil company.\nMy pastor told me not to touch my wife but drink her urine every morning and wait for God to embarrass me with wealth.\nNo wonder when she took in I was surprised but was brainwashed by my pastor that the holy spirit was at work and with the connection of my wife’s urine she can get pregnant.”"
  },
  {
    "headline": "Mother of 6 dumps husband of 20 years to marry “holy spirit” spends honeymoon in Uganda",
    "summarized_story": "A Kenyan woman, Elizabeth Nalem last week shocked her countrymen by ending her 20-year-marriage to “marry” the Holy Spirit.\nThe mother of six from Makutano town in West Pokot County exchanged wedding vows with Holy Spirit on Tuesday, May 25, in a ‘lavish’ ceremony that attracted a multitude of people at the Chelang’a Gardens.\nHer husband, Joshua Nalem was said to be have been left in a quagmire not knowing what step to take next, after his wife left their matrimonial home to dedicate her life to the church.\nAlthough he says that he still loves Elizabeth, Joshua insists that he does not know the next course of action.\nAfter shocking the country by abandoning her family in West Pokot to marry the Holy Spirit, Elizabeth Nalem now says she is headed for her honeymoon in Uganda."
  },
  {
    "headline": "Kemi Olunloyo Reveals That Shmed Gulak Killed In Imo State Was Shot By Fulani Bandits",
    "summarized_story": "Nigerian journalist, Kemi Olunloyo has revealed that a former presidential aide, Ahmed Gulak killed in Imo state was shot by Fulani bandits.\nSee tweets by Kemi below:QuoteBREAKING Outspoken politician Ahmed Gulak has been SHOT DEAD assassination style in OWERRIFlag of Nigeria.\nKemitalksmediaAnyone suggesting that IPOB killed Ahmed Gulak is a slowpoke.\nHe took a Uber with two people and that Uber took a back road.\nHe took a Uber with two people and that Uber took a back road."
  },
  {
    "headline": "Marriage to Aishy makes me stronger, declares Musicbysire",
    "summarized_story": "By Mutiat AlliCouples don’t have to give up their passion because of marriage.\nInstead, marriage should be a catalyst that further inspires them to greater heights.\nSaid he: “We both are in the creative industry and neither of us has to give up his or her passion because of marriage.\nContinuing, he disclosed: “Quilavisuals and Aishy Productions are working together to bring creativity on a whole different level to your screen.\nYou all should be on the lookout for her movies coming soon.”Speaking about what the future holds for him and his young marriage, he reflected: “We are going to work at making our marriage stronger."
  },
  {
    "headline": "Media boycott crisis: Naomi Osaka withdraws from French Open",
    "summarized_story": "Naomi Osaka said Monday she was withdrawing from the French Open following the bitter fall-out from her decision to boycott all media activity at the Grand Slam event.\n“The best thing for the tournament, the other players and my well-being is that I withdraw so that everyone can get back to focusing on the tennis going on in Paris,” the world number two wrote on Twitter.\nThe 23-year-old Japanese star was fined $15,000 on Sunday and threatened with disqualification after she refused to carry out a mandatory news conference following her first round win.\n“I never wanted to be a distraction and I accept that my timing was not ideal and my message could have been clearer,” the four-time Grand Slam title winner said in her statement.\n“I announced it preemptively because I do feel like the rules are quite out-dated in parts and I wanted to highlight that.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Media boycott crisis: Naomi Osaka withdraws from French Open",
    "summarized_story": "Naomi Osaka said Monday she was withdrawing from the French Open following the bitter fall-out from her decision to boycott all media activity at the Grand Slam event.\n“The best thing for the tournament, the other players and my well-being is that I withdraw so that everyone can get back to focusing on the tennis going on in Paris,” the world number two wrote on Twitter.\nThe 23-year-old Japanese star was fined $15,000 on Sunday and threatened with disqualification after she refused to carry out a mandatory news conference following her first round win.\n“I never wanted to be a distraction and I accept that my timing was not ideal and my message could have been clearer,” the four-time Grand Slam title winner said in her statement.\n“I announced it preemptively because I do feel like the rules are quite out-dated in parts and I wanted to highlight that.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Tribute: Dr. Chinyere Aneziokoro – By KEN-CALEBS OLUMESE",
    "summarized_story": "It is my singular honour to perform this unpleasant duty of paying tribute to my young, pretty and precocious niece Dr. Chinyere Ofure Aneziokoro who died in the United States on May 31, 2006 from breast cancer at the unripe age of 40 years.\nI wish to thank her parents, Emeritus Professor of medicine, Anezi Okoro and Dr. (Mrs) Ese Aneziokoro who initiated, very wisely, the idea of establishing a foundation, the Dr. Chinyere Ofure Aneziokoro Foundation at the College of Medicine, University of Benin in her memory.\nThe relationship between a doctor and a patient is intriguing: The doctor asks the patient what is wrong with him (patient).\nSo when my niece chose Medicine I knew she chose mercy; I knew she chose humaneness; I knew she chose humanity.\nKen-Calebs Olumese, founder of NiteShift Coliseum, is an uncle to Dr. Chinyere AneziokoroShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Tribute: Dr. Chinyere Aneziokoro – By KEN-CALEBS OLUMESE",
    "summarized_story": "It is my singular honour to perform this unpleasant duty of paying tribute to my young, pretty and precocious niece Dr. Chinyere Ofure Aneziokoro who died in the United States on May 31, 2006 from breast cancer at the unripe age of 40 years.\nI wish to thank her parents, Emeritus Professor of medicine, Anezi Okoro and Dr. (Mrs) Ese Aneziokoro who initiated, very wisely, the idea of establishing a foundation, the Dr. Chinyere Ofure Aneziokoro Foundation at the College of Medicine, University of Benin in her memory.\nThe relationship between a doctor and a patient is intriguing: The doctor asks the patient what is wrong with him (patient).\nSo when my niece chose Medicine I knew she chose mercy; I knew she chose humaneness; I knew she chose humanity.\nKen-Calebs Olumese, founder of NiteShift Coliseum, is an uncle to Dr. Chinyere AneziokoroShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Breaking: COVID-19 strikes 28 Nigerians dead in 24-hour, cases soar again",
    "summarized_story": "By Kazeem UgbodagaThe dreaded COVID-19 pandemic has killed 28 Nigerians in the last 24 hours, with new cases soaring again to send fresh panic across the nation.\nFigures released by the Nigerian Centre for Disease Control, NCDC late Monday night revealed that 28 Nigerians were killed by the virus in one day.\nThe NCDC also reported 203 fresh cases, up from the 30 cases reported the previous day.\nA coronavirus surge has been experienced in Benue, which recorded 178 fresh infections out of the 203 new cases reported on Monday.\nWhile Lagos raked in 10 fresh cases, a drop from the 26 cases reported the previous day, Ondo recorded six cases; Kaduna, four and Plateau, one case."
  },
  {
    "headline": "I make ‘more money’ through social media trolls – Ubi Franklin",
    "summarized_story": "By Taiwo OkanlawonNigerian music manager, politician, and entrepreneur, Ubi Franklin has disclosed that he makes “more money” whenever he comes under fire.\nAccording to the entrepreneur in an interview with Ebuka Obi-Uchendu, host of Rubbin Minds, on Sunday, he has become immune to social media criticisms.\nQuizzed about the social media backlash that often trails controversies surrounding his relationships, Franklin said he used to cry until he realised that such call-outs often attract clients and wealth to him.\n“One thing I tell people is that money follows attention,” he said.\nBut one day I found out that each time I get a hit on social media, somebody new knows me somewhere."
  },
  {
    "headline": "Buhari makes urgent pronouncement on abducted 200 Islamiyya schoolchildren",
    "summarized_story": "By Kazeem UgbodagaPresident Muhammadu Buhari has ordered security and intelligence agencies to move very fast in ensuring that abducted 200 students of Islamiyya School at Tegina in Rafi Local Government Area of Niger State, are released.\nGunmen invaded Tegina on Sunday and abducted about 200 schoolchildren.\nThe President, who received briefing on the latest incident of school kidnapping, condemned as unfortunate, the kidnapping of children from schools.\nHe urged all the agencies involved in the rescue operation to do their utmost in securing their immediate release.\nBuhari also directed that the concerned government agencies to extend possible support to the families of the kidnapped children."
  },
  {
    "headline": "BREAKING: Fire Guts Mokland Hotel In Lagos",
    "summarized_story": "The Mokland Hotel, located at 3/9 Olakoleosho Street in Ikeja, Lagos, was gutted by fire on Monday evening, demolishing other buildings in the process.\nAccording to an eyewitness, the fire started around 7 p.m. on the topmost Penthouse floor of the building.\nLagos State Services fire crews are now struggling to put out the roaring flame.\nThe cause of the fire could not be determined as of press time.\nMr Amodu Shakiru, a spokesman for the state fire department, verified the occurrence, stating that the Lagos rescue team is preventing the fire from spreading to further levels and neighboring structures."
  },
  {
    "headline": "Nigeria is becoming a failed State – Ishaku",
    "summarized_story": "Governor Darius Ishaku of Taraba State has stated that Nigeria is becoming a failed state, insisting that the only solution is to establish state police.\nAccording to the governor, Nigeria is sliding into anarchy due to increased insecurity in the country.\nIshaku in an interview with newsmen in Jalingo noted that the increasing spate of insecurity across Nigeria and the inability of the military and other security agencies to address the situation were indications of anarchy.\nThe governor said, “Nigeria is sliding into a failed state, yes of course Nigeria is sliding into anarchy.\nIt is a disgrace if a country’s military cannot flush out insurgents within its territory.”He added, “we need a state police; we need the constitution to be amended."
  },
  {
    "headline": "BREAKING: Osun Residents Protest Over Insecurity, Bad Governance",
    "summarized_story": "In Osun state, civil society organizations thronged major avenues in Osogbo, the state capital, to protest insecurity and poor administration in Nigeria.\nAccording to the Convener, Comrade Waheed Lawal, the purpose of the demonstration is to raise awareness among inhabitants of the state about the need of speaking up against injustice and maladministration rather than dying in quiet.\nThe demonstrators marched from Old Garage’s popular Freedom Park to Station Road, where they spoke to store owners near Fagbewesa Junction on the importance of joining the fight for a better Nigeria.\nComrade Waheed Saka who spoke at the Fagbewesa junction said despite the human and natural resources the country is endowed with, poor leadership has put the country in the wrong direction leading to untold hardship among the masses."
  },
  {
    "headline": "Sowore Speaks After Been Shot By Police Officer In Abuja",
    "summarized_story": "The founder of Sahara Reporters, Omoyele Sowore has Spoken after he was reportedly been shot by a female police officer in Unity Of Fountain, Abuja.\nIn his tweet, he wrote: “Just been shit by a police officer, ACP Atine at the Unity Fountain in Abuja.\n#RevolutionNow Let the struggle continue even if they take my life!\n#BuhariMustGo”Just been shit by a police officer, ACP Atine at the Unity Fountain in Abuja.\n#BuhariMustGo pic.twitter.com/c9ui2UutXO — Omoyele Sowore (@YeleSowore) May 31, 2021NEWS DIRECT Earlier gathered that he sustained gunshots injuries and has been rushed to hospital for medical treatment."
  },
  {
    "headline": "24 hours after abduction of 200 pupils: Bandits kill MOPOL, 15 others in Niger community",
    "summarized_story": "Barely 24 hours after 200 school children were abducted by bandits in Niger, gunmen again attacked another community killing 15 villagers in Beri town in Bobi district of Mariga local government of the state Monday morning.\nIt was however gathered that the local vigilantes were able to kill 5 of the bandits in a gun duel.\nAlso this Monday, some bandits reportedly raided Ungwan Bako in the Kotonkoro district of Mariga local government, abducting many people, mostly women and children.\nThe mass abduction of the Islamic school students was the second in Rafi local government area in six months.\nAsides from the attack on schools, several residents across different local government areas of the state have been displaced after the invasion of bandits."
  },
  {
    "headline": "VIDEO: Streets deserted in Anambra, other South-east states as IPOB members march in Onitsha",
    "summarized_story": "PreviousUmahi takes second dose of Covid-19 vaccine says no side effect"
  },
  {
    "headline": "Breaking: Again, JAMB extends 2021 UTME registration, tells candidates what to do before deadline",
    "summarized_story": "Joint Admissions and Matriculation Board (JAMB) has given two given another two weeks extension to candidates to complete their registration for the 2021 Unified Tertiary Matriculation Examination (UTME).\nThe deadline for first registration extension was May 29, 2021.\nThis was disclosed in statement by JAMB’s head of information and protocol, Dr. Fabian Benjamin on Monday.\nAccording to the statement, candidates yet to register have between May 31 and June 15 to complete their registration if they were not able to by last Saturday because of NIN verification issues using a new guideline.\nThe statement reads: “All prospective candidates with genuine proof(s) of failed efforts to register before the closing date, are to, between Monday May 31 and June 15, 2021, visit any of the Joint Admissions and Matriculation Board offices (including JAMB-owned professional test centres, PTCs) across the nation to:“(I) obtain at no cost and complete a form which is being made available to candidates with genuine reasons for missing the registration;“(ii) submit (for the reading test and application), a certified bank draft of N4,000 in favour of the Joint Admissions and Matriculation Board (and obtain a signed duplicate copy from the office);“(iii) submit the completed form with a recent passport photograph at the same office of collection;“(iv) collect a copy of the reading test;“(v) await further directives through the registered phone number and public service announcement as soon as the screening is completed.”Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Evolve new strategy to win terror war, COAS tasks GOCs -NigPilot",
    "summarized_story": "He noted that the Nigerian Army must sit up and develop novel plans, processes, and strategies to meet the changing nature of the battlespace.\nGeneral Yahaya gave this charge while addressing General Officers Commanding (GOCs), field Commanders, and other frontline officers, during his maiden meeting with them at the Army Headquarters, Abuja.\nHe, however, pledged to rejig the Nigerian Army and lead the service to victory in all the ongoing operations across the country.\nThe COAS added, “We must return to the tenets of adhering strictly to customs and tradition and ethics of the Nigerian Army.\n“As your Chief of Army Staff, I hereby restate my commitment to lead you with sincerity, with transparency, and accountability at all times."
  },
  {
    "headline": "2023 elections: Group drums support for Osinbajo, Al-Mustapha aspiration -NigPilot",
    "summarized_story": "The group said that the success of the duo in 2023 would lead to economic prosperity, job creation, and sustainable development.\nThe leader of the group said it was backing Osinbajo’s presidential ambition for 2023 and was also calling on others to queue behind the VP.\nAccording to him, “Osinbajo and Al-Mustapha are vastly knowledgeable in the economy and security intelligence of rebuilding a better and United Nigeria.\n“We have realized that youths and women in the country are vital to ensuring Osinbajo and Al-Mustapha ticket, hence, the need to reach out to them.\n“For the APC, the unifying balm of Buhari will still play a vital role to salvage her mistakes and reposition a better Nigeria."
  },
  {
    "headline": "North-East stakeholders demand creation of Savannah State -NigPilot",
    "summarized_story": "In Bauchi centre, the people of Southern Borno comprising nine local government areas on Thursday disagreed with the position of the Borno State government and insisted on the creation of Savannah State.\n“We the people of Askira/Uba, Bayo, Biu, Chibok, Damboa, Gwoza, Hawul, Kwaya-Kusar and Shani Local Government Areas of Borno State wish to present our request for the creation of Savannah State out of the present Borno State.\nThe 2014 Conference report has again clearly shown that SAVANNAH state met all necessary criteria for the creation of the state in Nigeria.\n“The proposed Savannah State is richly endowed with Solid Minerals, agricultural products, tourism potentials and human resources that can be harnessed to lay a solid foundation for the transformation of the State.\n“It is an incontrovertible fact that greater part of both the human and material resources of the present Borno state come from the southern part."
  },
  {
    "headline": "Pan-Nigeria group commends Buhari’s choice of Farouk Yahaya as COAS -NigPilot",
    "summarized_story": "Nigeria First, a pan-Nigeria group, has applauded President Muhammadu Buhari’s choice of Major General Farouk Yahaya as late Lt Gen Ibrahim Attahiru’s successor for the position of Chief of Army Staff.\nAccording to the group, Maj Gen Yahaya’s appointment is another evidence of President Buhari’s commitment to the war against insurgency and insecurity across the nation.\nNigeria First, which made this known on Sunday at a press conference in Abuja, described the move as the right step in the right direction.\nIt also urged the new COAS to ensure that the Nigerian Army develops a versatile and proactive intelligence network that would greatly assist in nipping in the bid acts that undermine national security.\nThe group further tasked Yahaya to ensure that the Nigerian Army remains apolitical in its various operations across the country, and also put the interest of the country and the nation’s nascent democracy at the centre of all decision making."
  },
  {
    "headline": "IPOB Cannot Give Sit-At-Home Order In Rivers – Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike on Monday said the proscribed Indigenous People of Biafra (IPOB) cannot issue a sit-at-home order to the people of Rivers State.\nWike stated this on Channels Television’s Politics Today, adding that Rivers is a South-South state and not one of the South-Eastern states.\n“IPOB cannot make an order to say sit at home in Rivers State.\nI have said so clearly before because it does not exist in Rivers State,” he said.\nRivers State is South-South, we are in the Niger Delta."
  },
  {
    "headline": "Despite Attacks In South-East, INEC Vows To Conduct Anambra Gov Election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has vowed to conduct the Anambra governorship election despite the recent attacks on its facilities in the region.\nThe Anambra governorship election is scheduled to hold on November 6, 2021, but the South-East has been a hotbed of insecurity with gunmen attacking police facilities, burning INEC buildings, and destroying electoral materials.\nREAD ALSO: Anambra Election: Only 18 Parties Are Recognised, INEC Tells 74 OthersThis was disclosed by the National Commissioner of the Commission, Adekunle Ogunmola after a strategic meeting in Lagos, on Monday.\n﻿“For INEC, it won’t be a difficult thing to plan for the Anambra election.\nThe electoral body said it is working on a strategic plan and strategic program of action for 2022-2026."
  },
  {
    "headline": "Bandits Kill 15 People In Niger Community",
    "summarized_story": "No fewer than 15 villagers are reported to have been killed in Beri town in the Bobi district of Mariga Local Government of Niger State on Monday.\nChannels Television was told that the men of the local vigilante were able to kill five of the bandits.\nThe Niger State Emergency Management Agency (NSEMA) confirmed the incidents but did not give details.\nPolice Public Relations Officer Niger State Police Command Public Relations Officer DSP Wasiu Abiodun did not respond to calls made to his cell phones for comments on the developments.\nMeanwhile, the Niger State Government says it is taking measures to ensure the release of Islamic School children abducted by bandits in Tegina, Rafi Local Government."
  },
  {
    "headline": "Businesses Shut, Streets Deserted In South-East Amid IPOB’s Sit-At-Home Order",
    "summarized_story": "Businesses, schools, and other major economic hubs were shut.\nIn Abia State, streets were deserted and shops are under lock and key while in Anambra State, the situation is the same.\nThe inner streets were deserted with security men positioned at different locations.\nMany businesses in Delta State capital, Asaba were also shut as residents comply with the sit-at-home order.\nThe expressway leading to the head bridge was completely deserted while businesses along the expressway were also shut."
  },
  {
    "headline": "Exiled Ivory Coast Ex-Leader Gbagbo To Return June 17 – Party",
    "summarized_story": "Former president Laurent Gbagbo will return to Ivory Coast on June 17 after a decade following his acquittal of crimes against humanity during a civil war, a party official said Monday.\n“I am announcing the return of president Laurent Gbagbo on Ivorian soil on June 17,” said Assoa Adou, general secretary of the Ivorian Popular Front (FPI) party Gbagbo founded.\nHe was arrested in April 2011 and was held in northern Ivory Coast before being transferred to the ICC.\nHe became the first head of state to stand trial at the court, though both he and Ble Goude always insisted they were not guilty of crimes against humanity.\nIvory Coast, the world’s top cocoa producer, is divided between the Muslim-majority north and the Christian-dominated south."
  },
  {
    "headline": "Police Arrest 15 hoodlums recovers 3 Locally Made Guns, other weapons",
    "summarized_story": "Police in Zamfara says it has arrested fifteen Hoodlums’ during protest that almost turned bloody in Kaura Namoda local government area of the stateThe police also Recovers three Locally Made Guns and other weapons from the youthsConfirming the incidents to TVC NEWS, the spokesperson of the Zamfara state Police Command Supritendant Shehu Mohammed says the situation has been brought under controlAdvertisementAccording to him, the police will no longer tolerate any act of lawlessness in the guise of peaceful protestThe Command appeal to parents and guardians to control their children and wards against involvement in any act capable of undermining the peace of the state.\nYouths in Kaura Namoda and other surrounding communities today blocked Kaura – Gusau highway expressing their anger over rising insecurity in Kaura Namoda and other parts of the state."
  },
  {
    "headline": "Warrah Boat Mishap: NGF donates 50 million naira to bereaved families",
    "summarized_story": "The Nigerian Governors’ Forum (NGF), on Monday, donated a whopping sum of N50 million naira to the families of those who lost their lives in the recent boat mishap at Warrah, Ngaski Local Government, Kebbi State.\nFayemi was flanked by his Vice Chairman and Sokoto State Governor, Rt Hon.\nAminu Waziri Tambuwal, as well as the Chairman of the Northern Governor’s Forum and Plateau State Governor, Chief Simon Bako Lalong.\nAdvertisement” Everyone felt particularly sad at this development and we are here to condole you, the families and the people of Kebbi state .\nBagudu lamented the absence of a passengers’ manifest in the ill-fated boat, decrying that, this ugly development aggravated the unfortunate situation."
  },
  {
    "headline": "Naomi Osaka Withdraws from French Open after Refusing to Do News Conferences",
    "summarized_story": "World number two Naomi Osaka says she is withdrawing from the French Open as a result of controversy over her refusal to speak to the media during the tournament.\nOn Sunday a joint statement from Grand Slam organisers said Osaka could face expulsion from the tournament.\nIn a tweet, Osaka revealed she had “suffered long bouts of depression” since winning her first Grand Slam title in 2018.\nLater on Sunday, organisers of the four Grand Slams released a joint statement saying Osaka could face “more substantial fines and future Grand Slam suspensions” for her decision.\nAfter a “lack of engagement” from Osaka, the Grand Slam organisers wrote to her to offer support, as well as to “remind her of her obligations”."
  },
  {
    "headline": "Mary J. Blige Inducted into Apollo Walk of Fame and Bill Cosby’s Parole Petition Denied",
    "summarized_story": "Mary J. Blige has been inducted into the Apollo Theatre’s iconic Walk of Fame.\nShe joins other legends like Michael Jackson, Quincy Jones, Patti Labelle, Smokey Robinson, Ella Fitzgerald, the Temptations and many more.\nMeanwhile, American actor Bill Cosby won’t be paroled this year after refusing to participate in sex offender programs during his nearly three years in state prison in Pennsylvania.\nThe 83-year-old Cosby has long said he would resist the programs and refuse to acknowledge wrongdoing even if it means serving the full 10-year sentence.\nFinally, TIME has released the newest class of Next Generation Leaders and Nigeria-born Akwaeke Emezi, best-selling author of the critically acclaimed “Freshwater”, “PET” and “The Death of Vivek Oji”, made the list."
  },
  {
    "headline": "Death Toll in DR Congo Attack Rises to 50",
    "summarized_story": "The number of people killed in two attacks in the east of the Democratic Republic of Congo has risen to at least 50.\nThey are thought to have been carried out by gunmen from the Allied Democratic Forces or ADF – one of the dozens of armed groups operating in the region.\nThe area has however also seen violence between two ethnic groups.\nEyewitnesses said armed men on motorbikes targeted a camp for people who had been displaced by earlier violence.\nPresident Felix Tshisekedi gave extra powers to the military to address the insecurity which has seen numerous attacks every week despite the presence of thousands of UN peacekeepers"
  },
  {
    "headline": "Brazil Named New Hosts of Copa America 13 Days to Go after Colombia, Argentina Stripped of Hosting – Arise News",
    "summarized_story": "South American soccer body CONMEBOL has announced Brazil as the host of Copa America for the second consecutive time after Colombia and Argentina were stripped of hosting rights for the tournament.\nLike other continental tournaments, Copa America was initially scheduled for 2020, but the COVID-19 pandemic forced its postponement.\nThe 2020 version of Copa America was to introduce a new format with five teams based in each of the co-hosts, Colombia and Argentina.\nGroup A features Argentina, Bolivia, Chile, Paraguay and Uruguay while Group B includes Brazil, Colombia, Ecuador, Peru and Venezuela.\nIt would have been the first Copa America hosted by two countries."
  },
  {
    "headline": "China Explains Role in Blocking Taiwan from World Health Assembly",
    "summarized_story": "China has explained her role in the blockade of Taiwan from attending recently held World Health Assembly.\nZhang said the decision was taken by allies of China across the world who believe in a United China which include Taiwan.\nZhang, in the statement said: “I was caught by surprise to read in a local newspaper an article entitled “Taiwan’s exclusion from the World Health Assembly undermines global health” by Her Excellency Mary Beth Leonard, U.S.\nSince the outbreak of the pandemic, the Central Government of China has sent 260 notifications on COVID-19 to Taiwan region.\n“The WHO Secretariat briefed health experts in Taiwan region several times on pandemic information."
  }
]