[
  {
    "headline": "Basketballer Tristan Thompson accused of neglecting child with Maralee Nichols",
    "summarized_story": "American fitness model, Maralee Nichols, has revealed that basketball star, Tristan Thompson, “has done nothing” to support their two-month-old son.\nNichols’s publicist made this known in a statement to Page Six on Monday night, following a report that claimed Thompson could be paying $40,000 child support to each of his baby mamas: Khloé Kardashian, Jordan Craig and Nichols.\nThe statement, however, revealed that the Sacramento Kings player has not provided any financial assistance to his son’s mother.\nNichols’ rep, Harvey Englander, said, “Despite news reports stating otherwise, Tristan Thompson has done nothing to support his son.\nHowever, the basketball player confirmed last month that he had a child with Nichols and had tendered an open apology to Khloe."
  },
  {
    "headline": "JUPEB clears DELSU of involvement in exam malpractice",
    "summarized_story": "The Joint Universities Preliminary Examinations Board has cleared Delta State University, Abraka of involvement in malpractice, a management source in the University has said.\n“DELSU has been absolved”, he further stated explaining that “the institution (DELSU) is expecting JUPEB’s letter confirming the latest development this week”.\nSo the anxiety over DELSU JUPEB is cleared.\nIt read further, “Delta State University is one of the indicted universities hence, the Vice-Chancellor is hereby notified of the approval of JUPEB governing board.\n“The governing board of JUPEB is also displeased with this outcome of the event, which was due to poor conduct of examinations in the university."
  },
  {
    "headline": "BREAKING: Buhari sends 2022 supplementary budget to National Assembly",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), transmitted the 2022 Appropriation Act (Amendment) Bill to the National Assembly.\nSpeaker of the House of Representatives, Femi Gbajabiamila, announced transmission of the Federal Government’s supplementary budget at the opening of plenary on Tuesday.\nThe government had made a U-turn on its plan to end the subsidy regime in June.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Reps receive Buhari’s 2022 supplementary budget proposal",
    "summarized_story": "By Levinus NwabughioguHouse of Representatives, Tuesday, received 2022 supplementary budget proposal from President Muhammadu Buhari.\nSpeaker of the House, Rep. Femi Gbajabiamila read the communication to that effect at Tuesday plenary.\nREAD ALSO: Reps to hold public hearing on NYSC Trust Fund bill February 24It will be recalled that the House at the twilight of 2022 passed into law a total expenditure of N17.1 trillion against the N16.3 trillion proposed by the president.\nVanguard News Nigeria"
  },
  {
    "headline": "Insurance sector grows income by 22% to N630bn",
    "summarized_story": "By Rosemary IwunzeUnaudited Gross Premium Income, GPI, for the insurance industry has increased by 22.6 per cent to N630.4 billion in 2021 from the audited N514 billion recorded in 2020.\nA report released yesterday by the National Insurance Commission, NAICOM, also disclosed that the industry paid net claims of N238.1 billion in 2021 while total assets was N2.1 trillion.\nMusa noted that the industry claims payment on Endsars might get to the tune of N20 billion.\nAccording to a report released by NIA recently, insurance companies settled claims on 718 cases of vandalisation; 93 cases of looting; 113 cases of theft; and 136 cases of loss of cash.\nAlso 99 claims were settled on malicious damage; eight on business interruptions; 455 on burglary attacks; and 912 on fire and burnt sites."
  },
  {
    "headline": "Senate dismisses petition against NERC’s nominee",
    "summarized_story": "By Henry Umoru – AbujaThe Senate Committee on Power has dismissed a petition against a commissioner-nominee of the Nigerian Electricity Regulatory Commission (NERC), Dr Yusuf Ali (North Central) on grounds of lack of merit.\nWhile screening the 30-year old Kwara nominee who is a PhD holder, Suswam said “there is a petition against you.\n“The petition says you are not from Kwara.\nIn order words, you didn’t envisage that you were going to face the Senate when this was done.\n“I don’t know why we have become so conscientious about where someone comes from."
  },
  {
    "headline": "Two days in Gamboru: Zulum, Shettima share food, cash to 60,803 returnees",
    "summarized_story": "Zulum and Shettima (who represents Borno Central where Ngala is located) travelled by road from Maiduguri on Sunday and on their first day in Gamboru, a total of 55,253 persons from Gamboru and Ngala towns received food and non-food items.\nThe beneficiaries comprised 39,903 women who each got 5,000 naira cash and a wrapper each, and 15,350 men, some of them married to the women, who also received 25kg of rice and 25kg of maize each.\nOn the second day, another 5,560 IDPs recently resettled in Wulgo town also in Ngala LGA were supported.\nZulum and Shettima travelled with the Member of House of Representatives representing Ngala, Bama, Kala-Balge Federal Constituency, Dr. Zainab Gimba, Commissioners for Reconstruction, Rehabilitation and Resettlement (RRR), Engr.\n… Zulum tells Doctors Borno will match NGO payAside from coordinating humanitarian responses, Governor Zulum visited the General Hospital in Ngala town and a primary healthcare centre in Gamboru town."
  },
  {
    "headline": "Breaking: Buhari Writes Senate, sends N2.557trn supplementary budget for fuel subsidy",
    "summarized_story": "…Seeks review of Finance Act 2021By Henry UmoruPRESIDENT Muhammadu Buhari has written the Senate, seeking for the approval of a supplementary budget which contains N2.557trn meant to provide for subsidy on petroleum products from June to December 2022.\nPresident Buhari’s letter was read on Tuesday during plenary by the President of the Senate, Senator Ahmad Lawan.\nThe amount approved for subsidy on Petroleum products from January to June was N443 billion and with the present request, the total amount stands at N3 trillion.\nBuhari has also written the Senate, seeking for a review of the Finance Act 2021.\nDetails later…"
  },
  {
    "headline": "What Afenifere leader, Ayo Adebanjo said about Primate Ayodele",
    "summarized_story": "Chief Ayo Adebanjo, the acting leader of Yoruba socio-political organization, Afenifere, has described the Leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, as a leading prophet in Nigeria.\nAdebanjo made a surprise appearance at Primate Ayodele’s annual thanksgiving ceremony held yesterday at the church’s premises in Lagos.\nWhile speaking on his relationship with Primate Ayodele, Chief Adebanjo revealed that he has known the prophet for over 40 years though it’s been a while since they last saw him before yesterday.\nPrimate Ayodele is the number one prophet in Nigeria,” he said.\nReacting to the surprise appearance of Chief Adebanjo, Primate Ayodele expressed heartfelt gratitude to the nonagenarian for coming to celebrate him, while talking about how far their relationship has come."
  },
  {
    "headline": "Aregbesola: Reactions trail Monday attack in Osogbo",
    "summarized_story": "Reactions have started to trail the alleged exchange of gunshots on Monday between the security escort of Rauf Aregbesola, former governor of the state and current Minister of Interior, and armed thugs.\nHe revealed that as a result of the shootings which occurred in Osogbo on Monday evening, innocent individuals suffered.\nJare Ismail Tiamiyu, an Osogbo based media practitioner in his Facebook post stated that “Osun: It’s between Aregbesola and Tinubu.\nWhile the state government alleged that it has reports of cowards invading Osogbo, the state capital, the APC faction alleged that the attack on the convoy of the minister was intended to kill him.\nThe Osun State Police Command and the Osun State Command of the Nigerian Security and Civil Defence Corps (NSCDC) have also disagreed as to the origin of the shooting and for whom it was intended."
  },
  {
    "headline": "Buhari departs Abuja for EU-AU Summit in Belgium",
    "summarized_story": "All appears set for President Muhammadu Buhari to leave for Brussels, Belgium, where he would join European and other African leaders as well as heads of multilateral organisations at the 6th European Union-African Union Summit.\nA statement by his media aide, Garba Shehu, confirmed the journey to State House correspondents.\nIt also explained that the summit, which holds between February 17 – 18, 2022, will have the participants deliberate on themes currently affecting the world.\nOthers are education, culture and vocational training, migration and mobility; agriculture and sustainable development and health systems and vaccine production.\nThe National Security Adviser, Maj.Gen."
  },
  {
    "headline": "IPOB: Why ‘we are no longer taking orders from Nnamdi Kanu’ – Simon Ekpa",
    "summarized_story": "Simon Ekpa, a self-styled disciple of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has said some members of the group will no longer take orders from its leader.\nEkpa said the group would no longer take orders from Kanu because he is incarcerated.\nHe, however, noted that members would push for Kanu’s unconditional release.\nIn a series of tweets, Ekpa disclosed that agitators have entered the liberation phase of the Biafra nation.\nSo, the order of the liberation of Biafra and to secure his release can not be used against him.”"
  },
  {
    "headline": "Army denies reports of officers allegedly conniving with Edo Yahoo boys",
    "summarized_story": "The Nigerian Army on Tuesday dismissed reports that two officers connived with internet fraudsters, also called ‘Yahoo boys’, in Edo State and also collecting illegal returns from soldiers at checkpoints.\nThe reports further alleged that the aggrieved soldiers said that by allowing the two officers to continue to stay at the brigade without being investigated, they would pollute the Army and make the committed personnel also start cutting corners and be involved in unethical practices.\nReacting on Tuesday, Captain Yemi Sokoya, Asst.\nDirector Army Public Relations dismissed the report.\nAccording to the statement, the Brigade stated that the report is “bereft of truth and therefore entirely misleading, saying the report is nothing short of an attempt to spite the image of the Brigade and by extension the Nigerian Army."
  },
  {
    "headline": "Police, NSCDC differ over gunshots at Aregbesola’s roadshow",
    "summarized_story": "Police authorities and the Nigeria Security and Civil Defence Corps (NSCDC) have disagreed over the circumstances surrounding gunshots in the heart of Osogbo, the capital of Osun State on Monday during a roadshow by Minister of Interior, Rauf Aregbesola.\nThe Osun State Government condemned the shooting and warned that any action by any individual, no matter highly placed, will be checked legally.\nAt about 5:30 pm, Minister of Interior, Rauf Aregbesola was moving in a convoy of personnel of NSCDC, Correctional Service, Immigration, as well as some unidentified armed people, suspected to be political thugs along Orisumbare/MDS road, Osogbo.\n“Unknown hoodlums attacked the convoy of Minister, Federal Ministry of Interior Ogbeni Rauf Aregbesola at about 6:40pm around Old Garage area in Osogbo, the State Capital.\n“However, the security details of the Minister were able to disperse the hoodlums and bring normalcy to the area.”"
  },
  {
    "headline": "Trucker protest: Canada invokes first Emergencies Act in 50 years",
    "summarized_story": "Canadian Prime Minister Justin Trudeau has invoked the Emergencies Act for the first time in 50 years to quell the trucker protests in the country against coronavirus mandates.\nThe Police had arrested 11 people with a “cache of firearms” blocking a border crossing with the United States.\nThousands of protesters railing against vaccine mandates and other COVID-19 restrictions descended on the capital Ottawa last month, deliberately blocking traffic around Parliament Hill.\n- Advertisement -He said any formal requests for assistance from the City of Ottawa or Ontario will be considered.\nThe busiest US-Canada border crossing reopened last Sunday after protests against COVID-19 restrictions closed it for almost a week, the owner announced."
  },
  {
    "headline": "BREAKING: FG earmarks N2.55tr for subsidy in supplementary budget",
    "summarized_story": "President Muhammadu Buhari has earmarked N2.55trillion for fuel subsidy in the 2022 Supplementary Appropriation Bill transmitted to the National Assembly for consideration and approval.\nThe Federal Government had informed the subsidy regime will end in June 2022.\nFuel queues appeared since last week across the nation over rising import costs of the product.\nBut Buhari’s letter for the subsidy provision was read on the floor by Senate President Ahmad Lawan.\n- Advertisement -Buhari said while N106billion provided in the Supplementary Bill would be used as capital expenditure, N43.87billion would be spent on recurrent expenditures."
  },
  {
    "headline": "BREAKING: Buhari submits supplementary budget to NASS",
    "summarized_story": "President Muhammadu Buhari has transmitted a supplementary budget for consideration and approval by the National Assembly.\nBuhari’s letter was read on the floor by Senate President Ahmad Lawan.\nRead Also: Kogi Assembly okays over N30bn supplementary budget for 2021Buhari said while N106billion provided in the Supplementary Bill would be used as capital expenditure, N43.87billion would be spent on recurrent expenditures.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: Gunmen kill three policemen in Ebonyi",
    "summarized_story": "Three Policemen have been reportedly killed in Ebonyi State by gunmen.\nA reliable source confirmed that three cops were gunned down Monday night in front of a police station along the Enugu-Abakaliki highway.\nThe policemen, who were said to have mounted a roadblock in front of the station, were killed when the gunmen opened fire on them.\nThe source said the gunmen were in a hummer bus, which the policemen may have mistaken for a commercial vehicle.\nShe however said she cannot give details of casualty figures until after a visit to the scene of the incident."
  },
  {
    "headline": "BREAKING: Gunmen kill three policemen in Ebonyi",
    "summarized_story": "From Chijioke Agwu, AbakalikiThree policemen attached to Ezillo Police station in Ishielu local government area of Ebonyi state have been reportedly killed by gunmenDaily Sun gathered that the officers were gunned down Monday night at a check point in front of the Ezillo Police station.\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nThe officers were said to have mounted a roadblock in front of the station when the gunmen stormed the area and opened fire on them.\nReliable sources who pleaded anonymity confirmed the incident, adding that the remains of the three police victims have been deposited at a mortuary in Abakaliki."
  },
  {
    "headline": "Nigerians in Germany host Kalu, endorse him for president",
    "summarized_story": "Citing his national acceptance and governance expertise, Nigerians in Germany, under the aegis of Nigerian Union, on Sunday, declared their allegiance and support for Senate Chief Whip, Dr. Orji Uzor Kalu, as their candidate for the 2023 presidency.\nThe group made its declaration at a special dinner in Frankfurt Germany in honour of the former Abia state governor.\nIt also promised to galvanise and expand support both from home and abroad for Kalu.\nNigerians can now work and earn dollars DAILY from home.\nThe group said Kalu’s detribalised character would unite the nation and also foster peace and unity which the nation desperately needs."
  },
  {
    "headline": "APC chairmanship race narrows to Al-Makura, Adamu, Musa",
    "summarized_story": "The APC National Executive Council (NEC) had in June 2020 appointed Yobe State Governor, Mai Mala Buni, as acting national chairman, pending the holding of a national convention.\nSources told Daily Sun that the three favoured candidates are Alhaji Umaru Tanko Al-Makura, former governor of Nasarawa State and now senator representing Nasarawa South; Alhaji Abdullahi Adamu, ex-governor of Nasarawa State and senator representing Nasarawa West; and Alhaji Sani Musa, senator representing Niger East.\nIt was, however, learnt that governors in the APC, determined to maintain a grip on the party, favour Senator Adamu.\nThe third favoured aspirant, Senator Musa, has the backing of young elements in the APC.\nDaily Sun gathered that the three tendencies pushing for Al-Makura, Adamu and Musa are working hard, with intensive lobby, to carry the day."
  },
  {
    "headline": "Abba Kyari lands in NDLEA custody",
    "summarized_story": "The saga started on Friday, January 21, 2022, when DCP Kyari initiated a call to one of the NDLEA officers in Abuja, at 2:12 pm.\nHe asked the NDLEA officer to persuade men of the FCT Command, to play along as well.\nIn effect, he would be delivering $61, 400 to the NDLEA team.\nHe also brought with him the money from the sale of the 5kg share of the NDLEA team, a total of $61, 400.\nSo, we have a trove of intelligence, hard facts, from chats to photos and video and a detailed transcript of the communication between him and the NDLEA officer.”"
  },
  {
    "headline": "ASUU declares one-month nationwide strike",
    "summarized_story": "He said after the expiration of the four weeks strike, NEC would meet to take its next line of action.\nASUU opted for the industrial action following failure of the Federal Government to fully implement the union’s outstanding demands dating to 13 years, he said.\nSaid Osodeke: “NEC resolved to embark on a four-week roll-over total and comprehensive strike beginning from Monday, February 14, 2022.\nThe union said his promotion to that rank by the Federal University of Technology Owerri (FUTO) did not follow due process.\nWe have resolved to sanction ASUU members involved in his promotion and the VC of FUTO.”"
  },
  {
    "headline": "Buhari Transmits 2022 Supplementary Budget to House",
    "summarized_story": "Udora Orizu in AbujaPresident Muhammad Buhari has transmitted the 2022 Supplementary Budget to the House of Representatives for consideration and approval.\nThough Buhari signed the 2022 budget into law in December 2021, he raised reservations about some of its contents, particularly the ‘worrisome changes’ made by the lawmakers.\nThe lawmakers had approved a total expenditure of N17.1 trillion against the N16.3 trillion proposed by the president in October.\nThe six page letter, was read by the Speaker, Hon.\nFemi Gbajabiamila, at the commencement of plenary, Tuesday."
  },
  {
    "headline": "Subsidy: Buhari Transmits N3trn Supplementary Budget to National Assembly",
    "summarized_story": "Seeks review of Finance ActSunday Aborisade, AbujaPresident Muhammadu Buhari, on Tuesday, transmitted a supplementary budget of N3trn to the National Assembly for consideration and passage.\nThe amount included N2.557trn meant to provide subsidy on petroleum products from June to December 2022.\nThis is contained in a letter from the President and read on the floor at plenary by the Senate President, Ahmad Lawan.\nBuhari also requested the federal parliament to review the Finance Act 2021.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "2023: I am Not Aware of Okowa’s Pact with Ijaw, Says Edwin Clark",
    "summarized_story": "*Speaks on Otuaro’s emergence as deputy gov, Tompolo’s support for OkowaIjaw leader, Chief Edwin Clark, has said that he is not aware of any pact between Delta State Governor Ifeanyi Okowa and the Ijaw nation to hand over power to the Ijaw in Delta South at the end of his tenure in 2023.\nThe Ijaw leader’s statement is coming on the heels of reports claiming that Okowa, an Anioma man from Delta North, had a pact with the Ijaw of Delta South in 2015 to hand over power to an Ijaw in 2023.\nClark, who is the leader of Pan Niger Delta Forum (PANDEF) and Chairman, Board of Trustees, Ijaw National Congress (INC), said he was neither a party to such pact nor aware of its existence.\n“It was not a part of the arrangement when I decided to support Dr Ifeanyi Okowa in 2015.\n“The arrangement for Okowa to become PDP gubernatorial candidate in Delta State with Otuaro as his deputy was finally sealed in my house.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Emefiele: It is Buhari’s Prerogative to Plan His Succession",
    "summarized_story": "Emefiele also stressed that he remained focused on his job, even as he has pledged to continue supporting the Buhari-led federal government’s economic recovery drive.\nfrom the group known as ‘FRIENDS OF GODWIN EMEFIELE,’ who disclosed that they met with the CBN governor to clarify his position on the 2023 presidential race.\nIt pointed out that the negative attacks were being sponsored by those who see Emefiele as a major threat to their political ambition.\n“Only yesterday, as the speculation became widespread, a group of his friends under the aegis of FRIENDS OF GODWIN EMEFIELE met with him to clarify his position.\nEmefiele is focused on his unfinished job and should not be distracted,” the statement added."
  },
  {
    "headline": "Wanted ‘Super Cop,’ Abba Kyari, Four Others in NDLEA Custody over Drug Dealing",
    "summarized_story": "The saga started on Friday, January 21, 2022, when DCP Kyari initiated a call to one of the NDLEA officers in Abuja at 2:12 pm.\nIn effect, he would be delivering $61, 400 to the NDLEA team.\n“He also brought with him the money from the sale of the 5kg share of the NDLEA team, a total of $61,400.\nUp till this moment, he hasn’t responded.”The NDLEA spokesman said, “Kyari must be debriefed before the suspects are arraigned in court.\n“We are making this strong statement to those contemplating harmful action against NDLEA officers."
  },
  {
    "headline": "Cocaine Scandal: Heads To Roll As More Senior Police Officers To Be Arrested After DCP Abba Kyari",
    "summarized_story": "The latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilograms cocaine deal.\nThe arrest of Kyari dominated discussion at the Force Headquarters Abuja yesterday.\nOne of the officers said the arrest and subsequent handover of Kyari to NDLEA for probe had caused serious confusion in the force.\n“The drug thing happened while we are waiting to see how the Hushpuppi scandal will end,” the officer said.\nAnother police officer said the deal between Kyari and the NDLEA was not unusual."
  },
  {
    "headline": "Cocaine Scandal: Heads To Roll As More Senior Police Officers To Be Arrested After DCP Abba Kyari",
    "summarized_story": "The latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilograms cocaine deal.\nThe arrest of Kyari dominated discussion at the Force Headquarters Abuja yesterday.\nOne of the officers said the arrest and subsequent handover of Kyari to NDLEA for probe had caused serious confusion in the force.\n“The drug thing happened while we are waiting to see how the Hushpuppi scandal will end,” the officer said.\nAnother police officer said the deal between Kyari and the NDLEA was not unusual."
  },
  {
    "headline": "BREAKING: Nigerian Anti-drug Agency, NDLEA Declares Suspended Police Chief, Kyari Wanted For Drug Trafficking",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, wanted over suspected links with an international drug cartel.\nThis was made known by the spokesperson for the NDLEA, Femi Babafemi, during a press briefing held at the agency's headquarters.\nThe NDLEA said an investigation has revealed that Kyari is a member of a drug syndicate which operates across the globe.\nThe shocking revelation comes amid the police chief's controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe United States Attorney’s Office, Central District of California, had issued an arrest warrant against Kyari."
  },
  {
    "headline": "BREAKING: Nigerian Anti-drug Agency, NDLEA Declares Suspended Police Chief, Kyari Wanted For Drug Trafficking",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, wanted over suspected links with an international drug cartel.\nThis was made known by the spokesperson for the NDLEA, Femi Babafemi, during a press briefing held at the agency's headquarters.\nThe NDLEA said an investigation has revealed that Kyari is a member of a drug syndicate which operates across the globe.\nThe shocking revelation comes amid the police chief's controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe United States Attorney’s Office, Central District of California, had issued an arrest warrant against Kyari."
  },
  {
    "headline": "Terrorists Invade Sokoto Communities, Kill Three, Abduct Many Residents",
    "summarized_story": "Three persons have been killed and an unspecified number of others abducted in separate gun attacks on communities in three Local Government Areas of Sokoto State by terrorists, otherwise called bandits.\nThe affected local councils are Tureta, Dange/Shuni and Bodinga.\nThe attacks, according to the Nation, were launched by suspected bandits fleeing from Sokoto-East amid a joint security offensive tagged “Operation Sahara Storm.”Chairman Dange/Shuni council, Alhaji Umar Gidan Gara, who confirmed the incidents, said three persons were shot dead by the bandits, who also abducted 17 persons across the attacked communities.\nGidan Gara said negotiation for the release of the abductees was ongoing."
  },
  {
    "headline": "DCP Abba Kyari arrested over '25kg cocaine deal': Here’s what we know so far",
    "summarized_story": "On Monday, the National Drug Law Enforcement Agency (NDLEA) declared the super cop wanted “over his involvement in a 25kg cocaine deal”.\nThe 15kg cocaine taken out would be replaced with “dummies”.\nWhen the NDLEA was ready to play ball, Kyari said the 15kg cocaine had already been shared — informants took 7kg and Kyari’s “team” got 8kg.\nThe money would be delivered in dollars (at N570 black market exchange rate) and Kyari offered to deliver $61,400 to the NDLEA operative.\nAt 5:23pm on January 25, Kyari was back in Abuja for a rendezvous with the NDLEA operative."
  },
  {
    "headline": "DCP Abba Kyari arrested over '25kg cocaine deal': Here’s what we know so far",
    "summarized_story": "On Monday, the National Drug Law Enforcement Agency (NDLEA) declared the super cop wanted “over his involvement in a 25kg cocaine deal”.\nThe 15kg cocaine taken out would be replaced with “dummies”.\nWhen the NDLEA was ready to play ball, Kyari said the 15kg cocaine had already been shared — informants took 7kg and Kyari’s “team” got 8kg.\nThe money would be delivered in dollars (at N570 black market exchange rate) and Kyari offered to deliver $61,400 to the NDLEA operative.\nAt 5:23pm on January 25, Kyari was back in Abuja for a rendezvous with the NDLEA operative."
  },
  {
    "headline": "Nigeria’s inflation rate falls to 15.60%",
    "summarized_story": "The consumer price index, which measures the rate of increase in the price of goods and services, rose to 15.60 percent year-on-year in January 2022.\nThis is 0.87 percent points lower than the rate recorded in January 2021 (16.47) percent.\nThe National Bureau of Statistics (NBS) said this in its Consumer Price Index (CPI) report for January 2022 released on Tuesday.\nAccording to the report, increases were recorded in all COICOP divisions that yielded the headline index.\nAdvertisement“On month-on-month basis, the Headline index increased to 1.47 percent in January 2022, this is 0.34 percent points lower than 1.82 percent recorded in December 2021,” the report reads."
  },
  {
    "headline": "Nigeria’s inflation rate falls to 15.60%",
    "summarized_story": "The consumer price index, which measures the rate of increase in the price of goods and services, rose to 15.60 percent year-on-year in January 2022.\nThis is 0.87 percent points lower than the rate recorded in January 2021 (16.47) percent.\nThe National Bureau of Statistics (NBS) said this in its Consumer Price Index (CPI) report for January 2022 released on Tuesday.\nAccording to the report, increases were recorded in all COICOP divisions that yielded the headline index.\nAdvertisement“On month-on-month basis, the Headline index increased to 1.47 percent in January 2022, this is 0.34 percent points lower than 1.82 percent recorded in December 2021,” the report reads."
  },
  {
    "headline": "'He turned himself into a god' -- Aregbesola blames Tinubu for Osun APC crisis",
    "summarized_story": "Rauf Aregbesola, minister of interior, has taken a shot at Bola Tinubu, former governor of Lagos state.\nSpeaking in Oriade LGA of Osun on Monday, Aregbesola said Tinubu was exalted “beyond his status and he turned himself to a god over us”.\nThe relationship between Tinubu and Aregbesola, his long-time ally, has been frosty for a while now.\nThe dissolution of the two groups came after Aregbesola reorganised the Mandate Group without the endorsement of Tinubu.\nAdvertisementAlso the party’s national caretaker committee led by Mai Mala Buni, Yobe governor, only recognises the faction of Gboyega Oyetola, Osun governor."
  },
  {
    "headline": "Facebook under fire for poor treatment of African content moderators",
    "summarized_story": "Meta-owned Facebook has come under fire for the treatment of African content moderators according to a recent TIME article.\nTIME revealed that content moderators in Nairobi were subject to poor pay and working conditions by Sama, a company responsible for Facebook’s Sub-Saharan Africa content moderation since 2019.\nIt contracts the services of more than 15,000 content moderators globally, most of whom are employed by third-parties like Sama.\nAccording to TIME, at least two Sama content moderators resigned after being diagnosed with mental illnesses including post-traumatic stress disorder (PTSD), anxiety, and depression.\nAccording to several copies of Sama content moderators’ performance reviews, TIME revealed that the moderators were measured against target metrics for average time spent and quality."
  },
  {
    "headline": "YC’s backing of its first Namibian startup shows investors are paying attention to the country",
    "summarized_story": "The government had locked down the country without making adequate palliative plans to support its people during the period.\nJabu partnered with local and multinational suppliers to deliver their goods directly to informal retailers across Namibia.\nHeadquartered in Namibia, with operations in Zambia, Jabu is a data-driven e-commerce startup that helps small retailers with sourcing products and inventory management.\nThe funding makes Jabu the first Namibian startup to be backed by YC.\n“Our first challenge was getting investors to recognise the country,” Akinin said."
  },
  {
    "headline": "Airtel Africa poaches Bayo Adekanmbi from MTN to lead its global strategy",
    "summarized_story": "Airtel Africa has tapped Bayo Adekanmbi to lead its strategy, partnership, and sustainability roadmap.\nThe role is based in the company’s headquarters in the UK and Adekanmbi is now part of the company’s executive committee and reports directly to the the CEO Segun Ogunsanya.\nIn this role, according to the company’s website, Adekanmbi will be “responsible for leading strategic business-wide initiatives, including innovation, strategic investment, operational efficiencies, and partnerships.\nBefore joining Airtel Africa, he worked with MTN Nigeria and South Africa for 14 years, holding different senior roles, including Strategy Director (MTN Business Unit), Global Marketing Strategist, General Manager (Business Intelligence), and most recently Chief Transformation/Strategy Officer for MTN Nigeria.\nBesides building cutting-edge strategy, Adekanmbi is a data science professional who supports the development of talents in this space."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "How Healthdart is providing affordable and accessible healthcare in South Africa",
    "summarized_story": "In South Africa, one healthtech startup is helping South Africans access drugs and health advice using their phones.\nMission-driven entrepreneurshipIn the early 2000s, South Africa had an HIV crisis on its hands.\nBringing primary health care closer to the peopleHealthdart co-founders, L-R, Yauvan Hansraj (CTO), Njabulo Skhosana (CEO), and Tshwanelo Matsane (CPO).\nSource: HealthdartMost plans to improve healthcare in Africa are focused on secondary care, with primary healthcare often an afterthought.\nAdvertisementHis reply corresponds to a 2020 report from the Independent Communications Authority of South Africa (ICASA) that claims that the smartphone penetration in South Africa stands at ~91%."
  },
  {
    "headline": "Transtura’s journey to digital payments; from launch to acquisition",
    "summarized_story": "AdvertisementWe talked to Adeoba and discussed Transtura’s journey, its recent acquisition of fintech startup, Wàzó money, and the future.\nL-R: Vincent Adeyemo, Vincent Adeoba, and Olajide PhilipsIn 2017, Vincent Adeoba started a job as a Graduate Intern with PricewaterhouseCoopers (PwC).\nAccording to Adeoba, Transtura has received little funding from the outside world.\nFounded in 2021 by Stephen Ilori and Abudu Ridwan Olatunbosun, Wàzó is a payments service company that deals with bill payments.\nFrom what Adeoba told Techpoint Africa, this acquisition marks Transtura’s entry into the digital payments and eCommerce space."
  },
  {
    "headline": "Airtel Africa’s strategic hire, Connected finance in Africa, Digitising Nigerian pharmacies",
    "summarized_story": "Yes, you heard that right; Nigeria’s Ministry of Communications and the Digital Economy has entered a partnership with the European Union (EU) to aid Nigeria’s digital transformation.\nThey reportedly plan to invest in digital infrastructure, digitalisation of public services, digital entrepreneurship, digital skills, and digital governance.\nMoving on, Let’s talk about:Airtel’s strategic appointmentStitch’s plan to connect AfricaRemedial’s plan to digitise Nigerian pharmacies.\nAccording to Airtel, Adekanmbi will be “responsible for leading strategic business-wide initiatives, including innovation, strategic investment, operational efficiencies, and partnerships.\nConsequently, like other Nigerian telcos, Airtel has significant ground to make up if it plans to get close to MTN."
  },
  {
    "headline": "Geometric to power Aba as BPE hands over today",
    "summarized_story": "The lingering tussle over who owns the Aba ring-fenced area has finally been laid to rest as the Bureau of Public Enterprises (BPE) prepares to hand over the facility to Geometric Power by 12pm, February 15, 2022.\n“BPE will at noon today hand over Aba ring-fenced DisCo to Geometric electric.\nThe government, NEPA and APL executed a lease agreement on April 28, 2005, for the distribution of power to the ring-fenced residential and commercial consumers in Aba.\nBy the terms of the agreement, NEPA assigned its right to distribute electric power in the ring-fenced area of Owerri-nta, Osisisoma, Ogbor Hill, Factory road and Port Harcourt road in Aba and also leased its distribution facilities within the contract area to Aba Power Limited.\nA supplementary agreement was made on August 31, 2006, between the Federal Government, represented by the minister of power and steel, Transmission Company of Nigeria (TCN) and Enugu Distribution Company (EDC) and Geometric/Aba Power Limited."
  },
  {
    "headline": "First time for Nigeria, $100 oil price means nothing",
    "summarized_story": "Based on Organisation of Petroleum Exporting Countries’ (OPEC) data, the only time in history when average crude oil price reached $100 was in 2011 ($107), 2012 ($109.45) and 2013 ($105.87).\nOPEC data also show the highest price ever paid for crude oil was between June and July 2008, when a barrel of crude oil was sold around $130 to $147, although the average crude oil price in 2008 ended up being $94.45 per barrel.\n“Nigeria’s oil assets are facing rising existential risks which are compounded by wasteful expenditure,” Nwakwue says.\nThe highest price ever paid for crude oil was between June and July 2008, when a barrel of crude oil was sold around $130 to $147, although the average crude oil price in 2008 ended up being $94.45 per barrel.\n“Despite rising oil prices, Nigeria’s oil production is currently struggling at levels never seen before, but the regulators are ignoring the problem and disguising under OPEC’s quota,” Charles Akinbobola, energy analyst at Lagos-based Sofidam Capital, notes."
  },
  {
    "headline": "Cancellations worsen as 16 airports lack night facilities",
    "summarized_story": "Flight delays have continued to worsen as 16 airports across Nigeria do not have facilities for night operations, forcing airlines to cancel flights that cannot meet up with the 6.30 pm landing time.\nObiora Okonkwo, chairman, United Nigeria Airlines, laments that one of the major challenges of the daylight airport is that it forces airlines to limit their operations to those airports to 6:30 pm.\n“80 percent of Nigerian airports are daylight airports.\nYou might not believe that all the local airports here are on sunset operations, it has to be looked into.\n“One major solution to these is to allocate some of these airports as operational bases for the domestic airlines instead of their concentration in Lagos MMA."
  },
  {
    "headline": "Obaseki to connect NUJ Secretariat, EBS to Ossiomo Power, urges journalists to key into health insurance policy – Nigerian Observer",
    "summarized_story": "That led us to this arrangement of the Ossiomo power plant, which is working and we are enjoying it here in Government House.\n“I don’t see why we cannot connect you to that 24-hour power supply.\nWe will be extending the line towards Ikpoba Hill to Auchi Road and will be able to connect you.\n“We are going to have every agency of government to have a plan, have its own key performance indicators, and their score cards.\nEarlier in his address, Alenkhe reassured the governor of the collaboration of journalists in the state in ensuring the realization of the Making Edo Great Again (MEGA) Agenda."
  },
  {
    "headline": "Edo Poly hails Obaseki, Ogbeifun for Maritime Institute initiative – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The management of Edo State Polytechnic, Usen, has applauded the Edo State Governor, Mr. Godwin Obaseki and the Chief Executive Officer of Starz Maritime and Engineering Limited, Dr. Greg Ogbeifun, for the setting up of the Greg Ogbeifun Institute of Maritime Technology, (GOMIT) at the institution.\nHe also expressed appreciation to the Federal Ministry of Science and Technology as well as the state’s Ministry of Education for their support to the realisation of the institution.\nAccording to him, “The staff and management of Edo State Polytechnic, Usen, heartily appreciate the Governor of Edo State, Mr. Godwin Obaseki, the Chief Executive Officer, (CEO), Dr. Greg Ogbeifun and Commissioner for Education, Dr. Joan Osa Oviawe, for the endowment of the Greg Ogbeifun Institute of Maritime Technology (GOMIT) to our institution.\nWe are essentially training high-valued staff who will be highly sought after in the industry.\nHe said captains of ships and academics from the polytechnic have been drafted to deliver dual location training for the institute, adding that the institution is ready to roll out the training programmes."
  },
  {
    "headline": "Community Send SoS To Obaseki, Oba Ewuare II – Nigerian Observer",
    "summarized_story": "Odionwere of Ologbo central community, Pa Osaigbovo Ogieayevbona said , Johnson Atseleghe with some unknown soldiers, the DPO Ologbo Police division and his thugs erected a signboard in the boundary between Edo and Delta states.\nHe said,” the next day a task force came from Government House and pulled down the signboard.\n“After pulling down the oba’s signboard, they went into the community, beating up people and chasing traders away from the market which caused pandemonium in the community.\n“Also they went to the Edo State government revenue checking point, drove the collectors away and burnt down the post.\nCollaborating the statement of the Odionwere, a member of the revenue collectors, Peter Ase said the thugs came around 1.30 pm to attack them."
  },
  {
    "headline": "Edo govt inaugurates c’ttee to ease access to land for smallholder farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To address issues of lack of access to land among smallholder farmers in the state, the Edo State Governor, Mr. Godwin Obaseki, has inaugurated a 13-member committee to finetune policies and programmes relating to land management especially as it relates to agricultural development.\nHe charged the committee members to work assiduously towards ensuring that the state government’s Making Edo Great Again (MEGA) agenda is actualised.\nWe also want to ensure that smallholder farmers have a voice,” he said.\n“We need to find solutions to the issue of land in the state.\nEdo State should be known as a friendly state with respect to investments."
  },
  {
    "headline": "Nigeria’s inflation drops to 15.6% in January 2022",
    "summarized_story": "Nigeria’s consumer price index report, which measures inflation, dropped marginally to 15.6% in January 2022, down from 15.63% in December 2021.\nThis is according to the latest report released by the National Bureau of Statistics (NBS) on Monday.\nOn a month-on-month basis, the headline index increased to 1.47% in January 2022, this is 0.34% points lower than 1.82% recorded in December 2021.\nFood inflation, which accounts for all volatile agricultural produce decreased to 17.13% in the review month, from 17.37% recorded in the previous month.\nCore inflation, which excludes the prices of volatile agricultural produce stood flat at 13.87% in January 2022, the same as recorded in December 2021."
  },
  {
    "headline": "EFCC presents witness against Nolan, Goidel Resources, ICIL Limited In $9.6bn P&ID scam",
    "summarized_story": "Anti corruption agency, the Economic and Financial Crimes Commission (EFCC), has presented its first witness against James Richard Nolan, a Briton and others with respect to their involvement in the controversial contract awarded to Process and Industrial Development Limited (P&ID).\nMr Nolan alongside Goidel Resources and ICIL Limited are being prosecuted by the EFCC on a 32-count amended charge of money laundering linked to the alleged $9.6 P&ID contract scam.\nMr Agunbiade explained that signatories to the account “domiciled in GT Bank were James Nolan and Isaac Ebubeogu in respect of exhibit A, Goidel Resources.\nFor ICIL, we have James Nolan, Lloyd Quinn and Adam Quinn.\nThe witness also said that on February 1, 2016, the sum of $125,000 was transferred from Nolan James to Goidel Resources Ltd."
  },
  {
    "headline": "Nigeria lost over $3.5bn of revenue to crude oil theft in 2021 – Elumelu",
    "summarized_story": "“The brazen daylight theft that is bleeding our oil reserves makes me wonder if there is no larger involvement and protection of these criminals,” he said.\n“Two weeks ago, while addressing senior officers of the @DefenceHQNigeria, I raised the issue of oil theft in this country and the national emergency that it has become.\n“Last year alone, Nigeria lost over $3.5bn of its revenue to crude oil theft!\nWhile other oil producing countries are enjoying the benefits of the peak in crude oil prices, Nigeria’s FX reserves are not benefiting from this crude price increase.https://t.co/YkKrF8vKMO — Tony O. Elumelu, CON (@TonyOElumelu) February 15, 2022“I call on our Government to take a closer look at the theft of Nigeria’s oil production.\nIt requires urgent attention and action,” he said."
  },
  {
    "headline": "Osun Guber: Ogiyan, Alawo, other monarchs back Oyetola",
    "summarized_story": "The monarchs said they have already passed a resolution to work for his second term as there was no need changing a winning team.\nSpeaking in his palace, Ogiyan of Ejigbo, Oba Oyesosin, lauded the Governor for his remarkable achievements in the last three years.\nThe reverred monarch stated further, “Since I have been on earth, I have never seen a Governor like Oyetola.\nYour second term ambition is a walk over as long as Ejigbo, and by extension, Osun, is concerned.\nI can assure you with all sense of sincerity that your second term project is a done deal and a completed project."
  },
  {
    "headline": "Akwa Ibom Tasks NIS On Illegal Immigrants, Human Trafficking, Others",
    "summarized_story": "The Akwa Ibom State government has charged the Nigeria Immigration Service (NIS) to intensify surveillance on activities of illegal immigrants and human trafficking barons for enhanced safety and security of Nigerians.\nGiving the charge, the Commissioner for Information and Strategy, Comrade Ini Ememobong, while playing host to the Comptroller of the Akwa Ibom State Command of the Nigeria Immigration Service, CIS George Didel, over the weekend, said the task before the Service was enormous.\nComrade Ememobong who pledged the readiness of his ministry to partner the NIS for greater achievements in the state, said: “We will give you free airtime on our Radio and Television Update programmes to enable you enlighten the populace on the negative impact of illegal immigrants and human trafficking.\nYou will also be given a space in our publications – “Akwa Ibom Impact” magazine and “Explore Akwa Ibom” to get the people well informed on how to alert the authorities when they have information about these criminals”.\nThe Comptroller implored the Commissioner to assist State Command with adequate publicity on all state-owned media, with a view to educating all and sundry on the need to have valid travel documents, which could either be the regular Nigerian passport or the ECOWAS travel certificate."
  },
  {
    "headline": "2023: Abe May Become Wike’s Successor – APC Stalwart",
    "summarized_story": "A stalwart of the All Progressives Congress (APC) in Rivers State, Princewill Dike, has predicted that a frontline member of the party in the state, Senator Magnus Ngei Abe, may succeed Governor Nyesom Ezenwo Wike in 2023.\nThe APC stalwart said: “Senator Magnus Abe is openly reaching out, consulting.\nAside of his political wizardry, Rivers State is predominantly PDP.\n“Till now, the public doesn’t know the Rivers APC gubernatorial aspirants.\nBy now, Rivers APC gubernatorial aspirants should openly be consulting and reaching out, to be known by the public.”ADVERTISEMENTDike called on the Minister of Transportation, Rt."
  },
  {
    "headline": "Illicit Drug Deals: Police Finger NDLEA, Arrest Kyari, 4 Others",
    "summarized_story": "Following the declaration of DCP Abba Kyari wanted by the National Drug Law Enforcement Agency (NDLEA), for alleged drug peddling, the Nigeria Police Force has arrested him and four other police officers involved in what it called unprofessional conduct and tampering with exhibits.\nThe police said the suspects were arrested for their involvement in an alleged case of criminal conspiracy, discreditable, unethical, and unprofessional conduct, official corruption and tampering with exhibits in a case of illicit drug trafficking involving a perpetual transnational drug cartel.\nThe concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspr.\nA statement signed by Force spokesperson, CSP Olumuyiwa Adejobi, on Monday, said the arrest of the officers was sequel to pieces of information received from the leadership of the National Drug Law Enforcement Agency on February 10, 2022 and subsequent discreet investigation by the NPF.\n“The arrest led to the recovery of substantial quantity of powdery substance suspected to be cocaine from the two narcotic couriers."
  },
  {
    "headline": "Illicit Drug Deals: Police Finger NDLEA, Arrest Kyari, 4 Others",
    "summarized_story": "Following the declaration of DCP Abba Kyari wanted by the National Drug Law Enforcement Agency (NDLEA), for alleged drug peddling, the Nigeria Police Force has arrested him and four other police officers involved in what it called unprofessional conduct and tampering with exhibits.\nThe police said the suspects were arrested for their involvement in an alleged case of criminal conspiracy, discreditable, unethical, and unprofessional conduct, official corruption and tampering with exhibits in a case of illicit drug trafficking involving a perpetual transnational drug cartel.\nThe concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspr.\nA statement signed by Force spokesperson, CSP Olumuyiwa Adejobi, on Monday, said the arrest of the officers was sequel to pieces of information received from the leadership of the National Drug Law Enforcement Agency on February 10, 2022 and subsequent discreet investigation by the NPF.\n“The arrest led to the recovery of substantial quantity of powdery substance suspected to be cocaine from the two narcotic couriers."
  },
  {
    "headline": "Fani-Kayode’s Ex-Wife Docked Over Alleged Attempted Murder",
    "summarized_story": "The estranged wife of a former Minister of Aviation, Chief Femi Fani-Kayode, Precious Chikwendu, was on Monday docked at a Federal High Court (FHC) Abuja for the attempted murder of her former husband, Fani-Kayode.\nChikwendu was also alleged to have, through her Facebook page, referred to Fani-Kayode as “Mr.\nAlex Ejesieme, SAN, counsel to Fani-Kayode’s ex-wife (2nd defendant), urged the court to admit the defendants to bail based on the earlier administrative bail granted them by the police.\nHowever, an effort to talk to Ejesieme, lawyer to Precious Chikwendu, was unsuccessful as he refused to grant an interview.\nThe former minister had also alleged that Chikwendu stopped calling the children on the telephone for about seven months now contrary to her habit in the past."
  },
  {
    "headline": "Massive crowd as Tinubu hits Sokoto, visits Sultan (Video, photos)",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu was in Sokoto on Monday where he visited the Sultan of Sokoto, Muhammadu Sa’ad Abubakar.\nWatch video belowMassive crowd welcomed the former governor of Lagos State to Sokoto as he travelled across Nigeria for his presidential aspiration.\nHe had visited to sympathise with the family of the late monarch, the Magajin Garin Sokoto, Alhaji Hassan DanbabaVisiting in company of Senator Wamakko, he condoled with the family and also joined in prayers for the dearly departed."
  },
  {
    "headline": "FG ready to actualise Humanitarian's strategic roadmap",
    "summarized_story": "Osinbajo made the commitment at the official inauguration of the Strategic Roadmap in Abuja.\nAccording to the vice president, the Strategic Roadmap as formulated by the ministry is so important.\nThe vice president was represented by Mr Adeola Rahman -Ipaye, the Deputy Chief of Staff to the President.\nAccording to her, in formulating the seven key strategic focal points of the Strategic Roadmap, nine key priority areas of President Buhari’s agenda were thoroughly analysed.\nThey included the Economic Recovery and Growth Plan (ERGP), and the National Development Plan that was recently launched by President Buhari on Dec. 22, 2021."
  },
  {
    "headline": "BREAKING: Again, Aregbesola’s Men Attack Osun Residents In Okeijetu",
    "summarized_story": "For the second time in less than 24 hours, operatives attached to former Osun Governor, Ogbeni Rauf Aregbesola, on Tuesday, again opened fire on innocent and harmless citizens of Osun, around Okeijetu area of the State.\nDetails later…"
  },
  {
    "headline": "Improvised Explosives Planted By Boko Haram For Nigerian Governor Kill Two Security Personnel",
    "summarized_story": "Improvised Explosives Planted By Boko Haram For Nigerian Governor Kill Two Security PersonnelA roadside bomb planted by militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā’at Ahl as-Sunnah lid-Da’wah wa’l-Jihād has killed two civilian in Dikwa Local Government Area of Borno.\nSaharaReporters learnt that the terrorists planted the improvised explosive device (IED) on the road to ambush the convoy of Governor Babagana Zulum travelling to Gamboru.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nIn 2021, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "BREAKING:President Buhari Writes Senate, Sends N2.557trn Supplementary Budget For Fuel Subsidy",
    "summarized_story": "President Muhammadu Buhari has written to the Senate, requesting approval of a supplementary budget that includes N2.557 trillion for petroleum subsidies from June to December 2022.\nPresident Buhari’s letter was read on Tuesday during plenary by the President of the Senate, Senator Ahmad Lawan.\nThe amount approved for subsidy on Petroleum products from January to June was N443 billion and with the present request, the total amount stands at N3 trillion.\nBuhari has also written the Senate, seeking for a review of the Finance Act 2021."
  },
  {
    "headline": "JUST IN: Gunmen Kill Three Policemen At Checkpoint In Ebonyi",
    "summarized_story": "JUST IN: Gunmen Kill Three Policemen At Checkpoint In EbonyiUnknown gunmen are said to have killed three police officers in Ebonyi State on Monday.\nAccording to Nation, the victims were gunned down on Monday evening in front of Ezillo police station on the Enugu-Abakaliki expressway.\nThe policemen were said to have mounted a roadblock in front of the station before the gunmen opened fire on them.\nThe source said the gunmen were in a hummer bus, which the policemen might have mistaken for a commercial vehicle.\n“The remains of the three police victims have been deposited at a mortuary in Abakaliki after they were confirmed dead by doctors,” a source said."
  },
  {
    "headline": "[Breaking] 2022: Buhari sends additional N2.557trn fuel subsidy budget to Senate",
    "summarized_story": "The Federal Government has made additional provision of N2.557trillion for funding of fuel subsidy in the 2022 Fiscal year .\nThe new provision is to cover July to December 2022 which were not covered in the budget earlier passed by the National Assembly and signed by President Muhammadu Buhari in December 2021.\nIn the about to be amended budget , the sum of N443billion was provided for fuel subsidy funding from January to June this year .\nThe total money for fuel subsidy funding in the 2022 budget is now N3 trillion .\nThe amendments was sequel to suspension of Petroleum Industry Act ( PIA) implementation which seeks for stoppage of fuel subsidy funding through full deregulation of the Petroleum sector ."
  },
  {
    "headline": "Students drop threat as ASUU begins one-month warning strike",
    "summarized_story": "University teachers in Nigeria are to commence a four-week strike starting on Monday, the Academic Staff Union of Universities (ASUU) has said.\nWe call for the immediate release of the White Papers to address numerous lapses in the administration of Nigeria’s federal universities,” ASUU said.\nNANS warnsThe National Association of Nigerian Students (NANS) has rejected planned strike by ASUU.\nNigerian students have always been at the receiving end.\n“How many times has ASUU as a sister union called the Nigerian students to inform us that this is what is going on?"
  },
  {
    "headline": "As PSC awaits report on Hushpuppi: Super cop DCP Abba Kyari, 4 others in 25kg cocaine web",
    "summarized_story": "Kyari was suspended and came under investigation for an alleged fraudulent deal with Rahman Abbas otherwise known as Hushpuppi in the United States of America.\nJust recently, the Police Service Commission (PCS) ordered a new panel on the saga to turn in its report in two weeks.\n“The arrest led to the recovery of substantial quantity of powdery substance suspected to be cocaine from the two narcotic couriers.\n“It is to be emphasised that DCP Abba Kyari’s involvement in these allegations occurred while his suspension from service was subsisting.\n“The concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspector Simon Agrigba, and John Nuhu."
  },
  {
    "headline": "UPDATED: Buhari Earmarks N2.5tn For Subsidy In Supplementary Budget Proposal To NASS",
    "summarized_story": "President Muhammadu Buhari has submitted the 2022 Appropriation amendment proposal to the National Assembly.\nIn the amendment proposal, the President earmarked the sum of N2.557 trillion for fuel subsidy.\nThe amendment proposal is contained in a six-page letter sent to the House on Tuesday.\nAccordingly, President Muhammadu Buhari in the letter said it was imperative to remove all capital projects that were replicated on the 2022 Appropriation Act.\n“However, following the suspension of the PMS subsidy removal, the 2022 Budget Framework has been revised to fully provide for PMS subsidy (see Schedule V)."
  },
  {
    "headline": "Buhari Unwilling To Sign Electoral Bill, Says PDP Governors – Channels Television",
    "summarized_story": "The Peoples Democratic Party (PDP) governors on Monday said President Muhammadu Buhari is unwilling to sign the Electoral Act Amendment Bill.\nThe presidency had on February 10 said President Buhari is desirous to assent to the bill and is still consulting with critical stakeholders on whether to sign the electoral act amendment bill or not.\nBuh the PDP governors in a communique issued after their meeting which was held in Bayelsa State asked Buhari to sign the document.\nREAD ALSO: NASS Passes Harmonised Electoral Bill With Direct, Indirect, Consensus Modes Of Primaries“The PDP Governors urged Mr President to immediately sign the Electoral Act Amendment Bill into law,” the communique signed by the 11 governors read.\n“Waiting to run out the 30 days is yet another sign of unwillingness by Mr President to give Nigeria a reformed Electoral framework."
  },
  {
    "headline": "How Abba Kyari Proposed Sale Of 25kg Cocaine, Offered $61,400 To NDLEA Officers",
    "summarized_story": "A full briefing by the the National Drug Law Enforcement Agency has revealed how suspended police officer DCP Abba Kyari, proposed to sell about 25kg of cocaine and offered undercover NDLEA officers the sum of $61,400.\nHe asked the NDLEA officer to persuade men of the FCT Command, to play along as well.\nIn effect, he would be delivering $61, 400 to the NDLEA team.\nHe also indicated how to identify the remnant of the original cocaine that would be delivered to NDLEA, five original packages marked with red dots.\n“He also brought with him the money from the sale of the 5kg share of the NDLEA team, a total of $61, 400."
  },
  {
    "headline": "Police Arrest Abba Kyari, Four Other Officers",
    "summarized_story": "The police have arrested a suspended Deputy Commissioner of Police (DCP), Abba Kyari, and four other police officers.\nOthers arrested alongside Kyari include ACP Sunday Ubuah, ASP Bawa James, Inspector Simon Agrigba, and Inspector John Nuhu, while the fifth suspect, ASP John Umoru, is still at large.\nRELATEDWanted Abba Kyari, Four Others Now In Our Custody – NDLEANDLEA Declares Abba Kyari Wanted For Drug Trafficking“The arrest of the officers was sequel to pieces of information received from the leadership of the National Drug Law Enforcement Agency (NDLEA) on 10th February 2022,” said Adejobi who is a Chief Superintendent of Police.\n“It is to be emphasised that DCP Abba Kyari’s involvement in these allegations occurred while his suspension from service was subsisting.\n“The concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspr."
  },
  {
    "headline": "Taliban Top Sniper Appointed Mayor In Afghanistan",
    "summarized_story": "Strolling through the town of Maymana, the new mayor appears to inspire goodwill from war-weary constituents in the Afghan provincial capital.\nMowaffaq was made mayor of Maymana, capital of Faryab province in the far reaches of northwest Afghanistan, in November, three months after the Taliban ousted the Western-backed government and seized power.\nHis switch reflects the broader transformation that the Taliban are undergoing, as the insurgents grapple with administering the territory.\n“The new mayor is young, well-educated and, very importantly, from the city,” says his non-Taliban deputy, Sayed Ahmad Shah Gheyasi.\nA year earlier, the Afghan Analysts Network said Maymana was “practically under siege” owing to “an astonishingly widespread Taliban presence”."
  },
  {
    "headline": "Just In: Reps probe cause(s) of petrol scarcity",
    "summarized_story": "The House of Representatives has launched an investigation into the cause(s) of petrol scarcity across the country.\nThe importation of adulterated Premium Motor Spirits into the country has caused scarcity of the product across the with a litre sold between N250 and N300 in many places.\nAdvertisementMeanwhile, members of the house of representatives will vote on clause by clause amendment to 1999 Constitution on Wednesday.\nAlso, President Muhammadu Buhari has translitted the 2022 Supplementary Budget to House of representatives for consideration."
  },
  {
    "headline": "Zamfara CJ inaugurates 7-man committee to investigate deputy Gov -",
    "summarized_story": "Zamfara State Chief Judge, Kulu Aliyu has Inaugurated a seven man committee to Investigate allegations against the State Deputy Governor Mahdi Aliyu Gusau.\nThe Committee is chaired by retired Justice Halidu Tanko Soba.\nAdvertisementShe adds that the Committee members are of unquestionable integrity and not been members of any public service, legislative Houses or political party.\nThis Development is coming five days after the Zamfara state House of Assembly request the state chief judge to Set up a Committee to Investigate Deputy Governor Mahdi Aliyu Gusau.\nAdvertisementThe Zamfara State House of Assembly is accusing the deputy Governor of gross misconduct, abuse of office among other thingsAdvertisementIt is coming amidst move by the Zamfara State House of Assembly to Impeach the Mahdi Aliyu as the state Deputy GovernorAdvertisementA federal high court in Abuja had in November last year restrained the Zamfara State House of Assembly from from any move to impeach the deputy Governor."
  },
  {
    "headline": "Nigeria's problem needs immediate change in leadership",
    "summarized_story": "Presidential aspirant on the platform of the opposition People’s Democratic Party, Sam Ohuabunwa visited former military President Ibrahim Babangida in his hilltop residence in Minna, Niger State.\nSpeaking to journalists after the closed door meeting he said Nigeria’s problem needs immediate change in leadership.\nAdvertisementThis is why Mazi Sam Ohuabunwa is visiting former president Ibrahim Badamosi Babangida.\nThe state party chairman Tanko Beji while receiving the aspirant at the party secretariat pledged his support noting that the chapter is ready to support all aspirants to give them equal opportunities.\nAdvertisementWith so many people indicating interest to represent the party at the polls getting a nod from the stalwarts is becomes paramount for aspirants."
  },
  {
    "headline": "Tinubu visits Awujale, informs him of his presidential ambition",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has paid a courtesy visit to the Awujale of Ijebuland, Oba Sikiru Adetona in Ijebu Ode, Ogun State.\nAsiwaju Bola Tinubu said the essence of the visit is to officially inform the paramount ruler of Ijebu land his intention to run for the position of President of Nigeria in the 2023 Presidential election.\nAdvertisement"
  },
  {
    "headline": "Dangote Refinery Won’t Guarantee Nigeria Cheaper Petrol, Says Renowned Economist Rewane",
    "summarized_story": "Rewane said the most the Dangote refinery would guarantee was improved supply of petrol in Nigeria’s domestic market, but would not affect the foreign exchange position of Nigeria significantly.\nRewane said: “Nobody should expect that the Dangote Refinery is going to make petrol cheaper (in Nigeria).\n“Dangote Refinery technically and theoretically is outside Nigeria as it is situated at the export processing zone.\nAnother savings is because Dangote refinery is 45 percent more efficient than other refineries because of its cutting edge technology.\n“I think that it is quite clear that it will not solve all our foreign exchange problems because it does not change things much."
  },
  {
    "headline": "Nigeria: NNPC Completes Withdrawal of Dirty Fuel from Circulation",
    "summarized_story": "The Nigerian National Petroleum Company Ltd (NNPC) has withdrawn all the methanol blended petrol which was imported into the country about three weeks ago.\nThe NNPC also stated that cargoes of clean petrol are arriving daily into the country to bridge the gap created by the withdrawal of the methanol blended petrol.\nThe NNPC moved to halt the situation by ensuring that the methanol blended petrol do not get to the filling stations.\nIn addition, the NNPC intensified efforts at increasing the supply of petrol into the market in order to bridge any unforeseen supply gap.\n“What I think is the good news out of this whole thing that happened is that it was detected early enough, it was withdrawn within limited time and the fuel supply chain is gradually coming back to normal,” he said."
  },
  {
    "headline": "Nigeria: It’s Buhari’s Prerogative to Plan His Succession, Says Central Bank Chief Emefiele",
    "summarized_story": "Emefiele also stressed that he remained focused on his job, even as he has pledged to continue supporting the Buhari-led federal government’s economic recovery drive.\nfrom the group known as ‘FRIENDS OF GODWIN EMEFIELE,’ who disclosed that they met with the CBN governor to clarify his position on the 2023 presidential race.\nIt pointed out that the negative attacks were being sponsored by those who see Emefiele as a major threat to their political ambition.\n“There are many other measures announced by the CBN Governor which will be detailed in due course like the support to Technology, Digital innovation, the Creative Industries and the 15 Trillion Infrastructure corporation recently launched.\nEmefiele is focused on his unfinished job and should not be distracted,” the statement added."
  },
  {
    "headline": "World’s Richest Man Elon Musk Donated $5.7bn to Charity in November",
    "summarized_story": "Tesla chief executive Elon Musk donated a total of 5,044,000 shares in the world’s most valuable automaker to a charity from Nov. 19 to Nov. 29 last year, its filing with the U.S. Securities and Exchange Commission (SEC) showed on Monday.\nThe donation was worth $5.74 billion, based on the closing prices of Tesla shares on the five days that he donated the stock.\nAnalysts have said there would be a tax benefit for Musk potentially gifting Tesla stock, since shares donated to charity are not subject to capital gains tax, as they would be if sold.\nMUSK FOUNDATIONThe donation ranks Musk as America’s second-biggest donor after Bill Gates and Melinda French Gates last year, data from the Chronicle of Philanthropy shows.\nMusk is president of the Musk Foundation, offering grants for the “development of safe artificial intelligence to benefit humanity” among other causes, according to its website."
  },
  {
    "headline": "Unvaccinated Djokovic Could Skip French Open, Wimbledon",
    "summarized_story": "Novak Djokovic has said he would rather miss out on future tennis trophies than be forced to get a Covid vaccine.\nDjokovic was asked if he would sacrifice taking part in competitions such as Wimbledon and the French Open over his stance on the vaccine“Yes, that is the price that I’m willing to pay,” he said.\nDjokovic, who is the world’s number one men’s tennis player, said he had obtained a medical exemption to enter the country to play in the Australian Open as he had recently recovered from Covid-19.\nBut he also confirmed he was willing to forego the chance to become statistically the greatest male tennis player of all time because he felt so strongly.\nHe says he has an open mind, but as things stand, he will not get the jab."
  }
]