[
  {
    "headline": "Police storm Ede Poly over planned fee hike protest",
    "summarized_story": "Men of the Nigeria Police Force have, on Wednesday, stormed the gate of the Federal Polytechnic, Ede, Osun State, over a planned protest by the students of the institution against a recent fee hike.\nThe PUNCH had reported on May 6 that the Rector of the institution, Dr. John Adekolawole, confirmed an increment in fees to our correspondent in a telephone conversation.\nA former student of the school, Adejayan Gbenga, had also alleged being threatened to be arrested by the school’s management for criticising the fee hike.\nSources also said that some of the students had allegedly been arrested.\nEfforts to reach the Osun State Public Relations Officer, SP Opalola Olawoyin, for comments, proved abortive as she had not responded to calls."
  },
  {
    "headline": "Gunmen kill four in Ebonyi chairman’s residence",
    "summarized_story": "Gunmen, on Tuesday night, attacked the home of the Chairman of the Council Area, Steve Orogwu, in Ịkwo Local Government Area, and killed three of his relatives.\nThe PUNCH equally gathered that the gunmen killed a security guard on duty and burnt down Orugwu’s family house.\nIt was learnt that the council boss was not at home when the gunmen struck the area and unleashed the mayhem.\nA reliable source close to Mr. Orogwu told our correspondent that the hoodlums stormed the chairman’s home in Ekpaomaka, late on Tuesday night.\nTherefore, reasons for the attack could not be ascertained as of the time of filing this report on Wednesday morning."
  },
  {
    "headline": "Drug Abuse: Spirit willing to quit but flesh is weak — Owoeye",
    "summarized_story": "“To get out of it, you need expert intervention by coming to a place like our institution, Federal Neuro Psychiatric Hospital Yaba.\nWe have a robust program to help people quite drug abuse or smoking.”He encouraged the newly be focused, study hard and make sure they graduated with good grade.\nOur students can work in different places ranges from psychiatric hospital, orthopedic hospital among others.\n“Unlike other types of therapy, Occupational Therapists takes a holistic approach and deals with the whole person.\n“At the end of your Diploma Programme, you will have to go further and obtain your degrees and qualify as full-fledged occupational therapy practitioners."
  },
  {
    "headline": "Corps member sacrifices 10 months allowance as scholarship to student",
    "summarized_story": "Corps member Bright, Wealth Sokari and her parentsBy Ike Uchechukwu, CALABARA serving National Youth Service Corps, NYSC, Member in Rivers State, Bright Ekong, has sacrificed his 10-months allowance as a scholarship to 12-year-old, Wealth Sokari, a JSS3 student, in his Place of Primary Assignment, PPA.\nBright Ekong who is serving (teaching) at Community Secondary School Degema, also took philanthropy as his pet project in a bid to give back to society.\nEkong who hails from Akwa Ibom state and a graduate of Pure Chemistry from the University of Calabar (UNICAL), pledged to pay the pupil’s school fees from Junior Secondary School 1 (JSS1) to Senior Secondary School 3 (SSS 3).\nHe called on the government to make funding of schools and educational development in the country, a priority.\nResponding, Mrs Sokari, who is a widow and mother of the beneficiary of the scholarship, said words won’t be enough to express her joy."
  },
  {
    "headline": "2022 Hajj: Anyone above 65 years will not be allowed into Saudi Arabia, says board",
    "summarized_story": "The Katsina Pilgrims Board on Wednesday reminded intending pilgrims above the age of 65 year, that they would not be allowed into Saudi Arabia.\nThe board made this known during orientation for intending pilgrims and Islamic scholars in the state ahead of the 2022 Hajj operations.\nThe exercise, organised in Kankia and Dutsinma Zonal Centres, was aimed at enlightening the intending pilgrims on how to purify themselves ahead of the Hajj.\n”Saudi Arabia has indicated that people above 65 years must not be allowed to perform Hajj this year and also reminded all intending pilgrims that full COVID-19 vaccination is compulsory.\n”Saudi Arabia has indicated that anybody above 65 years must not be allowed to perform Hajj."
  },
  {
    "headline": "Breaking: Court strikes out FG’s amended charge against Nnamdi Kanu",
    "summarized_story": "Trial Justice Binta Nyako struck out the charge, after it was withdrawn by the Prosecution counsel, Mr. K. E. Kaswe.\nOzekhome, noted that the amended charge was served on him, barely 48 hours to the court proceeding.\nHe maintained that FG introduced fresh issues in the amended charge, including additional documents and proof of evidence that was not originally attached to the case.\nOwing to Ozekhome’s contention, FG’s lawyer, Kaswe, applied to withdraw the amended charge to enable the matter to proceed on trial.\nConsequently, Justice Nyako struck out the charge."
  },
  {
    "headline": "Secession: Your allegation against us fictitious monologue, Northern Elders reply Presidency",
    "summarized_story": "By Luminous Jannamike, AbujaThe Northern Elders Forum, on Wednesday, slammed the Presidency for what it described as ‘fictitious monologue’ by Malam Garba Shehu, the Special Assistant to the President on Media, over the allegation that it called for some sections of the country to secede.\nAccording to a statement signed by NEF’s Director, Publicity and Advocacy, Dr Hakeem Baba-Ahmed, the Northern elders insisted that they made no such call, and advised leaders to note the very sensitive times in the country.\n“Malam Garba Shehu’s Statement did not quote single word in the “Statement”, did not mention its signatory or its date.\nHis statement was entirely a monologue castigating the Forum over fiction which only he can understand.\n“Northern Elders Forum restates that it made no such release, and advises leaders to note the very sensitive times in which we live at the moment.”"
  },
  {
    "headline": "Ebonyi speaker condemns killing of Ikwo council chair’s three brothers",
    "summarized_story": "The Speaker of Ebonyi State House of Assembly, EBSHA, Mr Francis Nwifuru, on Wednesday condemned in totality the gruesome killing of the three brothers of Ikwo Council Chairman, Stephen Orogwu, and one other by unknown gunmen.\nHe described the alleged killings as unfortunate, adding that the killers may not be indigenes of the state.\n“I condole the Orogwu family and the entire people of Ikwo Local Government Area,” he stressed.\nInvestigation revealed that the killers had plans to apprehend the council chairman Orogwu, fortunately, he wasn’t around and they (gunmen) decided to kill his brothers and set his house ablaze.\nOrogwu who confirmed the killings said the unknown gunmen killed his elder brother, two of his sons and a security guard."
  },
  {
    "headline": "NANS begs Atiku, Tinubu, others to raise money for ASUU demands",
    "summarized_story": "The National Association of Nigerian Students (NANS) has appealed to all presidential aspirants, including the former Vice President Atiku Abubakar and Asiwaju Bola Ahmed Tinubu to come to the aid of Nigerian students.\nRecall that the Academic Staff Union of Universities (ASUU) had embarked on the strike action and vowed to continue extending the same until the Federal Government accedes to its demands.\n“All the Presidential aspirants, especially those from the ruling APC and the Peoples Democratic Party (PDP) must rise up and come to the rescue of Nigerian students.\n“Nigerian students hereby call on the presidential aspirant, in the spirit of patriotism and in the interest of development to rally around Nigerian students.\n“It is only by doing this, that Nigerian students and Nigerians, in general, will respect and show support for their ambitions”."
  },
  {
    "headline": "Abuja-Kaduna rail: Air Force will shoot – Amaechi gives update on train operation",
    "summarized_story": "The immediate past Minister of Transportation, Chibuike Amaechi has provided updates on the Abuja-Kaduna railway.\nDAILY POST recalls that the south end of the rail was destroyed recently by explosions occasioned by bandits and insurgents.\n“We have agreed with the Air Force that they will over-fly the trains so that anybody they see trying to compromise the tracks, they will shoot.\nMeanwhile, gunmen suspected to be terrorists, on Tuesday blocked Abuja-Kaduna road and kidnapped several travellers.\nEyewitnesses said the operation lasted for more than an hour without the presence of security operatives."
  },
  {
    "headline": "Biafra: Nnamdi Kanu’s lawyer reacts as court denies IPOB leader bail",
    "summarized_story": "Aloy Ejimakor, Special Counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has reacted as an Abuja Federal High Court denied the Biafra agitator bail.\nEjimakor said a recent court ruling by an Abia State High Court sitting in Umuahia would have an implication on Justice Binta Nyako’s ruling.\nRecall that Justice Nyako had denied Kanu’s bail application on Wednesday.\nThe judge said Kanu should explain his whereabouts when he jumped bail in 2017.\nIt’s the only basis upon which the new bail application can proceed.”"
  },
  {
    "headline": "Court strikes out FG’s amended charge against Kanu",
    "summarized_story": "Justice Binta Nyako of the Federal High Court, Abuja, on Wednesday struck out a six-count amended charge brought against the leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu.\nThe judge threw away the fresh charges following its withdrawal by counsel to the Federal Government, Adamu Kaatu.\nCiting the need for the government to open the trial of Kanu after years of delay, Kaatu opted to withdraw the new charges when it was discovered the trial cannot be opened when an amended charge is pending.\nJustice Nyako, in a brief ruling, struck out the amended charge to pave way for the Federal Government to open its case against Kanu.\nDAILY POST recalls that the Federal Government had amended charges against Kanu six times since the arraignment in 2015."
  },
  {
    "headline": "BREAKING: Court affirms Adeleke Osun PDP Gov candidate",
    "summarized_story": "Justice Nathaniel Emmanuel of the Federal High Court sitting in Osogbo has affirmed Senator Ademola Adeleke as the candidate of the Peoples Democratic Party (PDP) for Osun governorship election slated for July 16 2022.\nThe judge dismissed a suit filed by Prince Dotun Babayemi, seeking to be declared the candidate of PDP.\nHe nullified the primary election that produced Babayemi, which held at WOCDIF event center, Osogbo on March 8th 2022.\nThe judgement was delivered amidst heavy security and lasted for one hour 45 minutes.\nJustice Emmanuel affirmed Senator Ademola Adeleke as the valid elected PDP candidate for the poll."
  },
  {
    "headline": "BREAKING: Heavy security as Court rules on Adeleke Osun PDP gov bid",
    "summarized_story": "There was heavy security presence at the Federal High Court Osogbo on Wednesday as the presiding Judge, Justice Nathaniel Emmanuel is set to rule on the validity of Senator Ademola Adeleke as Osun Peoples Democratic Party(PDP) governorship aspirant.\nThe Nation observed heavy security presence at the entrance of the court premises with scores of policemen standing by the patrol vans as supporters of the two factional aspirants Dotun Babayemi and Senator Ademola Adeleke were standing around the premises to know their fate.\nPrince Dotun Babayemi had challenged the primary that produced Senator Adeleke through his lawyer, Yusuf Alli, SAN and Justice Emmanuel fixed May 18 to rule on legality of the primary election.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: Malami, Tallen return as FEC holds",
    "summarized_story": "Attorney-General and Minister of Justice, Abubakar Malami and Minister of Women Affairs, Pauline Tallen, who attended a valedictory session last Friday with President Muhammadu Buhari are attending this week’s virtual Federal Executive Council (FEC) meeting at the Presidential Villa, Abuja.\nThe Ministers with eight others, who indicated interests in contesting various offices in 2023 general elections, were asked to resign their appointments immediately by the President.\nWhile Malami was gunning for the governorship of his Kebbi home state, Tallen was going to attempt wrestling the Plateau South senatorial ticket with Governor Simon Lalong and others.\nBefore commencement of the Council Council meeting presided over by President Buhari, a minute silence was held in honour of former Minister of Communications under Gen. Ibrahim Babangida regime, Olawole Adeniji Ige, who died at 83.\nOthers are Minister of State for Health, Olorunimbe Mamora; Agric Mustapha Shehuri and Budget and National Planning, Clem Agba."
  },
  {
    "headline": "Fed Govt puts Facebook under watch over IPOB",
    "summarized_story": "FACEBOOK and other social media platforms have been cautioned against yielding their platforms to the members of the Indigenous People of Biafra (IPOB) to incite violence and instigate ethnic hatred in Nigeria.\nHe said: “We have always advocated a responsible use of social media, and consistently called on all stakeholders to join us in achieving this.\nSome have tagged our efforts as an attempt to stifle social media.\n“They are wrong, because we have no intention of preventing Nigerians from using social media responsibly.\nAll we have been advocating is a responsible use of social media,” the minister said."
  },
  {
    "headline": "2023: I will grow agriculture, revamp economy",
    "summarized_story": "An All Progressives Congress (APC) presidential aspirant, Chief Rotimi Amaechi, has promised to grow the nation’s economy by revamping the agricultural sector if he wins the primary and gets elected in 2023.\nAmaechi, the immediate past Minister of Transportation, in a statement, said one of the woes of the nation’s economy was the shift from agriculture by successive governments to service economy.\nHe spoke at a consultative meeting with delegates of the APC in Lafia, the Nasarawa State capital.\nHe also met with the State Governor Abdullahi Sule to inform him of his plans to succeed President Muhammadu Buhari.\nSo, we will depend on states like Nasarawa that have very high level of practice in agriculture, and that will change the face of Nasarawa State,” Amaechi said."
  },
  {
    "headline": "Breaking: Court rejects Nnamdi Kanu’s application for bail",
    "summarized_story": "Justice Binta Nyako who refused the bail application held that Kanu must explain the reason why he breached the previous bail that was given to him, before he could enjoy another favourable discretion from the court.\nKanu, told the court that he was severely tortured for eight days in Kenya, before he was repatriated back to Nigeria for continuation of his trial.\nThe IPOB leader told the court that he has “credible and reliable sureties”, pledging that he would not commit any offence while on bail.\nHe further drew attention of the court to the fact that he was previously released on bail on health ground.\nHowever, FG, urged the court to refuse the bail application, insisting that Kanu, having realized the gravity of the case against him, would run away from the country and not make himself available for trial."
  },
  {
    "headline": "Sit-at-home: Gunmen attack LG chairman in Ebonyi, kill four",
    "summarized_story": "From Chijioke Agwu, AbakalikiGunmen have reportedly attacked the Ikwo country home of the Chairman of Ikwo local government area of Ebonyi state, Mr. Steve Orogwu.\nSources who confirmed the incident told our correspondent that four persons were killed by the gunmen during the attack.\n“Three of the victims were brothers to the Chairman while one other victim was their neighbor.\nWe suspect they came in search of the Chairman but he was not around at the time” one of the sources who pleaded anonymity said.\nPolice Public Relations Officer for Ebonyi Command, Loveth Odah, could not be reached for comment as at the time of filling this report."
  },
  {
    "headline": "I was robbed of mandate Nigerians gave me in 2019 –Atiku",
    "summarized_story": "Addressing Kaduna PDP delegates at the party secretariat, yesterday, he begged them to give him their votes again like they did in 2018, assuring that he would not disappoint them.\nVP insists Nigeria needs president with experienceProf. Yemi Osinbajo on Monday addressed APC delegates and stakeholders in Ilorin, Kwara State, on Monday.\nSaraki banks on executive, legislative experienceFormer Senate president and PDP presidential aspirant, Bukola Saraki, promised to ensure the Federal Capital Territory (FCT), Abuja, gets a special status if elected president.\nSaraki, who said the country was in dire strait, made the promise at a consultative meeting with PDP delegates in the Federal Capital Territory ( FCT), in Abuja.\nHe spoke when Amaechi paid him a courtesy call on the sidelines of his consultative visit to APC delegates in Adamawa State on Monday."
  },
  {
    "headline": "We need president who believes in Nigeria’s unity – Wike",
    "summarized_story": "He pointed to the need why the country requires a president that would be in charge of things, including issues of security and the economy.\nHe said it was sad that Nigerian farmers could not go to farm conveniently or go about their trading activities because of insecurity.\n“We need a Nigerian who believes in the unity of this country.\nIf God gives us the opportunity, we’ll form a government of national unity where everybody will be involved.”Are you a Man 40 yrs and above?\nHe said people like him stayed back to build the party and make it once again formidable."
  },
  {
    "headline": "2023 presidency: Don’t give your ticket to aspirant who opposed LG autonomy, NULGE warns APC, PDP",
    "summarized_story": "President of the union, Akeem Ambali, said such aspirants would bring bad luck to their political parties if given the ticket.\nActivities by our electoral body and political parties leading to the general elections in 2023 are proceeding with full speed.\n•244 PDP aspirants jostle for 68 elective positions in LagosNo fewer than 244 aspirants are jostling for 68 elective positions in the Peoples Democratic Party (PDP) in Lagos State.\n•87 APC aspirants vie for 26 Osun Assembly seatsThe screening committee of APC said 87 aspirants have obtained forms to contest the 26 Osun State House of Assembly seats.\nIt also called on the Iyorchia Ayu-led National Working Committee to call to order the state chairman of the party."
  },
  {
    "headline": "People with Disabilities Victims of Sexual Abuse in Ekiti, Fayemi Laments",
    "summarized_story": "Mrs. Fayemi said the government has zealously been implementing the Gender-Based Violence Prohibition Laws (GBV) and other relevant laws in protecting the right of women, especially those living with disabilities.\nThe first lady stated this in Ado Ekiti yesterday at a sensitisation programme on GBV women organised for people living with disabilities in the state.\n“Apart from discrimination, the most urgent issues we are solving are lack of economic empowerment, education and training for the people living with disabilities.\nIt is devastating to be a woman and carrying disabilities; it is double jeopardy.\nViolence and discrimination are twin evils, which we must confront at all cost.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "ABCON Calls for Creation of BDCs’ Autonomous FX Trading Window",
    "summarized_story": "Nume EkegheThe President, of the Association of Bureaux De Change Operators of Nigeria (ABCON) Mr. Aminu Gwadabe has urged that Central Bank of Nigeria (CBN) to create a trading window in a bid to enhance dollar liquidity in Nigeria.\nAlso, ABCON announced that they have developed a roadmap campaign plan needed to save the naira from further decline and enhance exchange rate stability.\nGwadabe said there was an urgent need to enhance dollar liquidity in the market and ensure stability of prices in the economy.\nThe ABCON boss called for the creation of BDCs’ Autonomous Foreign Exchange Trading Window (BAFEX) with determined maximum daily limit for legible BDCs to access dollars from banks, autonomous market, and diaspora forex widow at the prevailing market prices.\nHe requested for enhancement of existing BDCs’ automation portals to file transaction returns on CBN/ABCON/NFIU/NIBSS portals for effective regulatory monitoring and supervisions."
  },
  {
    "headline": "At 26.61%, Banks Maximum Lending Rate Drops to 5-year Low",
    "summarized_story": "Kayode TokedeAmid rising inflation rate that is expected to hike operating cost and plud profitability, banks have reduced maximum lending rate to 26.61 per cent, an over five-year low, the latest data by the Central Bank of Nigeria (CBN) on banks’ deposit and lending interest rates has revealed.\nThe data on banks’ deposit and lending interest rates showed a 1.4 percentage points drop in the average maximum lending rate from 26.61 per cent in March 2022, as against 27.65 per cent in January 2022.\nExperts attribute the decline in maximum lending rate to excess liquidity in the banking sector.\nWhen the CBN should have ended that regime of five per cent lending rate, it extended it further.\n“For the month of March 2022, as the deposit rate increases, lending rate dropped."
  },
  {
    "headline": "FirstBank to Reward Customers in FirstMobile Cash-out Promo",
    "summarized_story": "In collaboration with Interswitch, FirstBank has launched a promo to reward users of the FirstMobile app, its industry-leading mobile banking application.\nThe bank in a statement said the promo tagged, “FirstMobile Cash-out Promo,” will run for 3 months.\nThe promo is open to new customers and existing users of the FirstMobile app.\nThe app provides convenient access to both financial and non-financial transactions by FirstBank account holders via their mobile devices.\n“To set up the FirstMobile app, customers with android phones should visit the Google Play store to download and install the FirstMobile app."
  },
  {
    "headline": "APC Convention: Osinbajo Fvoured to Clinch Presidential Ticket",
    "summarized_story": "A zone-by-zone analysis of delegates’ preferences, realignments of APC governors, President Buhari’s behind-the-scene moves and emerging voting patterns indicate that Vice President Yemi Osinbajo will likely emerge winner at the convention on June 1.\nOf the 20 aspirants or so in the field, only three – Osinbajo, Tinubu and Amaechi – are the serious contenders.\nWhile Chibuike Amaechi will take his home state of Rivers, Osinbajo will sweep Akwa Ibom, Cross River, Delta and Bayelsa.\nDavid Umahi and Hope Uzodinma would listen to Buhari’s persuasions and support Osinbajo with their delegates.\nOverall, Prof. Osinbajo will score between 70% and 75% of the total delegate votes at the Convention."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Arrests, Grills Ex-Speaker, Patricia Etteh Over Alleged Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission has arrested a former Speaker of the Nigerian House of Representatives, Patricia Etteh.\nEtteh is being grilled by EFCC’s special duties unit for her alleged involvement in a solar power electrification scam in Akwa Ibom State worth N240 million.\nThe former speaker was said to have received N130m through her personal account.\nEtteh, the only woman to have been elected into the position, was elected Speaker in 2007 but resigned only after a few months amid allegations of financial misappropriation.\nThe EFCC on Monday arrested the Accountant-General of the Federation (AGF), Ahmed Idris, over an N80 billion fraud."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Arrests, Grills Ex-Speaker, Patricia Etteh Over Alleged Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission has arrested a former Speaker of the Nigerian House of Representatives, Patricia Etteh.\nEtteh is being grilled by EFCC’s special duties unit for her alleged involvement in a solar power electrification scam in Akwa Ibom State worth N240 million.\nThe former speaker was said to have received N130m through her personal account.\nEtteh, the only woman to have been elected into the position, was elected Speaker in 2007 but resigned only after a few months amid allegations of financial misappropriation.\nThe EFCC on Monday arrested the Accountant-General of the Federation (AGF), Ahmed Idris, over an N80 billion fraud."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Arrests, Grills Ex-Speaker, Patricia Etteh Over Alleged Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission has arrested a former Speaker of the Nigerian House of Representatives, Patricia Etteh.\nEtteh is being grilled by EFCC’s special duties unit for her alleged involvement in a solar power electrification scam in Akwa Ibom State worth N240 million.\nThe former speaker was said to have received N130m through her personal account.\nEtteh, the only woman to have been elected into the position, was elected Speaker in 2007 but resigned only after a few months amid allegations of financial misappropriation.\nThe EFCC on Monday arrested the Accountant-General of the Federation (AGF), Ahmed Idris, over an N80 billion fraud."
  },
  {
    "headline": "BREAKING: Court Vacates Order Restraining Central Bank From Sacking Bank Governor, Emefiele, Over Presidential Ambition",
    "summarized_story": "A Delta State High Court sitting in Kwale has discharged an order restraining the Board of the Central Bank of Nigeria from removing Governor Godwin Emefiele over his 2023 political ambition with the ruling party, the All Progressives Congress.\nThe court ruled on Tuesday that the order of May 5 “is hereby deemed vacated and set aside.”SaharaReporters last week reported that Justice DC Maidoh of the court granted an order restraining the Board of Central Bank of Nigeria and Independent National Electoral Commission from stopping the CBN governor, Emefiele from seeking an elective post.\nBut on Tuesday in a fresh court judgment, the court set aside the judgment Emefiele relied on to perpetuate his stay in office.\nOdinkalu wrote, “#Breaking: The High Court of Delta State sitting in Kwale has discharged the order restraining the Board of @cenbank from firing the criminal & bandit, #EmefiOle, @GodwinIEmefiele, who has taken the #CBN hostage.\nHe had met with State House Correspondents after a closed-door meeting with President Muhammadu Buhari at the Presidential Villa in Abuja."
  },
  {
    "headline": "BREAKING: Court Vacates Order Restraining Central Bank From Sacking Bank Governor, Emefiele, Over Presidential Ambition",
    "summarized_story": "A Delta State High Court sitting in Kwale has discharged an order restraining the Board of the Central Bank of Nigeria from removing Governor Godwin Emefiele over his 2023 political ambition with the ruling party, the All Progressives Congress.\nThe court ruled on Tuesday that the order of May 5 “is hereby deemed vacated and set aside.”SaharaReporters last week reported that Justice DC Maidoh of the court granted an order restraining the Board of Central Bank of Nigeria and Independent National Electoral Commission from stopping the CBN governor, Emefiele from seeking an elective post.\nBut on Tuesday in a fresh court judgment, the court set aside the judgment Emefiele relied on to perpetuate his stay in office.\nOdinkalu wrote, “#Breaking: The High Court of Delta State sitting in Kwale has discharged the order restraining the Board of @cenbank from firing the criminal & bandit, #EmefiOle, @GodwinIEmefiele, who has taken the #CBN hostage.\nHe had met with State House Correspondents after a closed-door meeting with President Muhammadu Buhari at the Presidential Villa in Abuja."
  },
  {
    "headline": "FG lists Nnamdi Kanu's lawyers as accomplices -- but suddenly withdraws charge",
    "summarized_story": "In the amended charge, the federal government listed some lawyers representing the IPOB leader, including Ifeanyi Ejiofor and Maxwell Opara, as accomplices of the defendant.\nAdvertisementKanu who was re-arrested abroad and brought back to Nigeria was re-arraigned on a 15-count charge of treasonable felony charge preferred against him.\nResponding, K.E Kaswe, prosecution counsel, said the trial can go on pending when the amended charge is adopted.\nInterjecting, Ozekhome, said: “The new amended charge, they attached a lot of new pieces of evidence and documents.\nConsequently, the prosecution applied to withdraw the amended charge and it was struck out."
  },
  {
    "headline": "FG lists Nnamdi Kanu's lawyers as accomplices -- but suddenly withdraws charge",
    "summarized_story": "In the amended charge, the federal government listed some lawyers representing the IPOB leader, including Ifeanyi Ejiofor and Maxwell Opara, as accomplices of the defendant.\nAdvertisementKanu who was re-arrested abroad and brought back to Nigeria was re-arraigned on a 15-count charge of treasonable felony charge preferred against him.\nResponding, K.E Kaswe, prosecution counsel, said the trial can go on pending when the amended charge is adopted.\nInterjecting, Ozekhome, said: “The new amended charge, they attached a lot of new pieces of evidence and documents.\nConsequently, the prosecution applied to withdraw the amended charge and it was struck out."
  },
  {
    "headline": "Court refuses Nnamdi Kanu bail, asks him to explain why he fled Nigeria",
    "summarized_story": "A federal high in Abuja has refused to grant bail to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nHowever, on April 8, Binta Nyako, the judge, struck out eight out of the 15-count charge.\nRuling on the bail application on Wednesday, the judge held that “the application is premature and refused with liberty to refile and reapply”.\nNyako recalled that she granted the defendant bail in April 2017 after which he jumped bail.\nShe said until the defendant addresses the court on why he jumped bail for over four years, she will not grant any bail application."
  },
  {
    "headline": "Court refuses Nnamdi Kanu bail, asks him to explain why he fled Nigeria",
    "summarized_story": "A federal high in Abuja has refused to grant bail to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nHowever, on April 8, Binta Nyako, the judge, struck out eight out of the 15-count charge.\nRuling on the bail application on Wednesday, the judge held that “the application is premature and refused with liberty to refile and reapply”.\nNyako recalled that she granted the defendant bail in April 2017 after which he jumped bail.\nShe said until the defendant addresses the court on why he jumped bail for over four years, she will not grant any bail application."
  },
  {
    "headline": "'You asked me to rig'... 'it's a lie' -- Oshiomhole, Fayemi clash over 2018 APC primary",
    "summarized_story": "Adams Oshiomhole, senatorial hopeful, and Kayode Fayemi, governor of Ekiti state, have traded words over an allegation made by the former APC national chairman.\nIn an interview with Channels Television, Oshiomhole said Fayemi asked him to rig the party’s primary election in 2018 in favour of some unnamed people.\n“I told Governor Fayemi that it would be his portion, not me.\nYou want to use me for such a purpose?”But Fayemi dismissed the allegation, saying it is laughable.\n“For the avoidance of doubt, Governor Fayemi has no reason to approach Comrade Oshiomhole for favours for any election."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Disney+ launches in South Africa. Here’s how much it costs",
    "summarized_story": "Earlier in January, the Walt Disney Company confirmed the expansion of its streaming service, Disney+, to 42 new countries, including 6 African countries—Egypt, Morocco, Algeria, Libya, Tunisia, and South Africa.\nDisney+ South Africa’s arm offers users the Standard Plan, at R119 ($7.47)/month or R1,190 ($74.64)/annum.\nOn the service, South Africans will access original Disney content like the Star Wars series and Encanto; and features from the Marvel Cinematic Universe (MCU) like Moon Knight.\nWhile Netflix does have an affordable R49/month Mobile plan in South Africa, the plan only allows 1 user and 1 device.\nThe only Netflix plan similar to Disney+’s Standard R119 plan is Netflix’s Premium plan which costs R199 plan and allows Ultra HD streaming on up to 4 devices."
  },
  {
    "headline": "How Adora Nwodo is making a name for herself in the cloud",
    "summarized_story": "She currently works as a cloud engineer at Microsoft and is the author of Cloud Engineering for beginners.\nAdora Nwodo on cloud engineering and mixed realityKoromone Koroye: Hi Adora, thanks for agreeing to speak with me.\nAdora Nwodo: I am a software engineer currently building mixed reality on the cloud at Microsoft.\nCloud engineers literally do their engineering on the cloud, whether software engineering or DevOps engineering.\nAN: Before I talk about mixed reality, let me briefly explain the difference between augmented reality (AR) and virtual reality (VR)."
  },
  {
    "headline": "$10 million-funded micro-tech-enabled clinics",
    "summarized_story": "Share this article:Hello there,Today, May 18, the world observes World AIDS Vaccine Day or HIV Vaccine Awareness Day.\nIt is also an opportunity to educate communities on the significance of HIV vaccine research.\nWhat you should know about the two types of HIV vaccines: The Preventive HIV Vaccine is given to people who do not have HIV to prevent future HIV infections.\nAdvertisementHowever, while there is no cure to eradicate HIV, a therapeutic HIV vaccine would aid in infection control and disease progression.\nJoining Okhae is Jude Odum as Chief Operating Officer, Funmi Ogunleye as Chief Process Officer, John Okafor as Chief Procurement Officer, Chukwudi Anyawuocha as Chief Enterprise Business Officer, and Kenneth Nwanganga as Chief Technology Officer."
  },
  {
    "headline": "With its new leadership, GIGM, plans to build on its successes in the mobility industry",
    "summarized_story": "Share this article:Nigerian mobility company, GIG Mobility has announced a new leadership team with Enahoro Okhae as Chief Executive Officer.\nJoining Okhae are Jude Odum as Chief Operating Officer, Funmi Ogunleye as Chief Process Officer, John Okafor as Chief Procurement Officer, Chukwudi Anyawuocha as Chief Enterprise Business Officer, and Kenneth Nwanganga as Chief Technology Officer.\nAdvertisement“Enahoro brings unquantifiable experience to this role and will drive value for all stakeholders through his leadership and initiatives.\n“Technology has been pivotal in positioning GIGM as an industry leader, and technology will be the premise on which the company will continue to lead the industry.\nCommenting on GIGM’s mobility goals, Okhae shared that the company plans to embed more lifestyle features in its products."
  },
  {
    "headline": "Here’s all you missed at May’s Pitch Friday",
    "summarized_story": "Share this article:What do you get when you bring aspiring entrepreneurs, startup founders, and enthusiasts together?\nOn Friday, May 13, 2022, we had two entrepreneurs share their startups and their journeys with us.\nOriginally scheduled to start by 5 pm, we eventually began by 5:15 pm when one of the founders scheduled to pitch was held up by traffic.\nMaking life easy for laundry merchantsWhen people decide to start businesses, they rarely anticipate the operational challenges that will often take them away from doing the main tasks their businesses should be doing.\nThe next edition of Pitch Friday comes up Friday, June 11, 2022, and it promises to be an exciting time."
  },
  {
    "headline": "Traction Appoints Babatope Oni as Chief Technology Officer",
    "summarized_story": "This article is a Brand Press post.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Leading financial services platform, Traction has appointed Babatope Oni as Chief Technology Officer (CTO).\nI am excited to join the Traction team,” said the new Traction CTO, Babatope Oni.\nTo learn more about Traction, please visit https://tractionapps.co/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "TECNO Is Among the First to Make Android 13 Beta Available on Its Latest CAMON 19 Pro 5G to Launch",
    "summarized_story": "As a global pioneer in electronic technology, TECNO Mobile was amongst the first smartphone manufacturers to join the Android 13 Beta Program.\nIts latest product, the CAMON 19 Pro (5G), will run on Android 13 Beta, delivering both superior performance and privacy & security to users.\nThe TECNO CAMON 19 Pro (5G) with Android 13 Beta will definitely allow our users to be among the first to access new features and bring them pleasures.\nAndroid 13 has key optimizations including:Stricter Notification Permission – Privacy and user trust are core principles of Android products.\nFor more specific download steps please visit official website: https://spot.tecno.com/global/forum.php?mod=viewthread&tid=170154Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Nigeria stocks emerge Africa’s best performers",
    "summarized_story": "The NGX has also outperformed peers from the Johannesburg Exchange (6.1 percent) to the Egyptian Stock Exchange (-12.45 percent) and the Nairobi Securities Exchange (-15.91 percent).\nNigerian stocks have also outperformed emerging market peers, which are down 11 percent on average.\nThe bullish run by Nigerian stocks may however not be sustainable.\nFor Toriola, some undervalued stocks like banking stocks, GTCO, Access, UBA, Zenith as well as NASCON, Nestle and Lafarge still deserve investor interest.\nThere’s a feeling among market players that Nigerian stocks could be doing better if foreign investors were active in the market."
  },
  {
    "headline": "2023: I won’t contest for Nigeria’s president- Adesina",
    "summarized_story": "President of African Development Bank (AfDB) Akinwumi Adesina says he will not contest the presidency of Nigeria in the 2023 general elections.\nAdesina, in a statement on Tuesday, said he would rather focus on the mission of supporting accelerated development and economic integration of Africa.\n“The coalition groups of youth, women, farmers, physically challenged and well-meaning Nigerians that have done this have expressed their genuine free will.\nThere have been reports in some sections of the media that Adesina will join the 2023 presidential race.\nAdesina who previously served as Nigeria’s minister of agriculture and rural development in former President Goodluck Jonathan’s administration which ended in 2015, was first elected president of the AfDB in May 2015 for a five-tenure and re-elected unanimously for a second tenure in August 2020."
  },
  {
    "headline": "Nigeria stocks shed N101bn as profit taking continue",
    "summarized_story": "Nigeria’s equities market closed further in the red zone on Tuesday as investors continued to take profit after previous week’s rally.\nAlso, Champion Breweries made the top laggards list after its share price decreased from N3.94 to N3.70, losing 24kobo or 6.09percent.\nRead also: Stocks gain N6.3trn despite global headwindsMeanwhile, share price of PZ rose most on the Nigerian Exchange, from N12.05 to N13.25, adding N1.20 or 9.96percent.\nFCMB, Jaiz Bank, Transcorp, GTCO and International Breweries were actively traded stocks on the Nigerian Exchange Limited (NGX).\nThe Nigerian Exchange Limited All-Share Index (ASI) and Market Capitalisation decreased further by 0.36percent or N101billion on Tuesday to 52,756.62 points and N28.441trillion respectively, from 52,944.65points and N28.542trillion recorded the preceding day."
  },
  {
    "headline": "Humanitarian worries over security in Esan land – Nigerian Observer",
    "summarized_story": "“We are appealing to the government of Edo state for a solution to plight at hand.\n“What’s being done to the people of Esanland in Edo state is inhumane.\n” Esan people are mainly farmers and the land and the forest means a lot because that’s where we get our livelihood.\nShe said this act is becoming rampant hence this call to Save Esan Land.\n“We appeal to governor Godwin Obaseki to Save Esan Land, Save the people of Edo state from this hoodlums."
  },
  {
    "headline": "GSTC, Iyoba girls victorious as Patrelli secondary school (girls) competition begins in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Patrelli Secondary School (girls) Competition organised by the Edo State Cricket Association (ECA), began on Monday at the Iyoba Girls college Cricket pitch in Benin City, with the competition favourites, Ohonre Grammar school defeated by Government Science and Technical College (GSTC) on Day one.\nGSTC batted first and scored 59 runs in 10 overs with a loss of five wickets.\nOhonre Grammar school struggled in the second innings, scoring only 39 runs and losing six wickets at the end of 10 overs.\nThey took Iyoba’s total runs to 50 with 7 wickets to spare as Idia college chased 51 runs.\nThe second innings saw Idia college only managing 35 runs and losing all of her batters (wickets) in 9.3 overs."
  },
  {
    "headline": "We constructed gas conversion plant for Ossiomo Power Company not NGMC – Fabricators, welders – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State chapters of the Fitters Senior Staff Association of Nigeria (FISSAN) and the Nigeria Welders Association (NWA) have said the Ossiomo Gas Plant in Ologbo, Ikpoba-Okha Local Government Area of Edo State, is not owned by Nigeria Gas Marketing Company Limited (NGMC), a subsidiary of the Nigerian National Petroleum Company (NNPC).\nSpeaking to journalists in Benin City, the associations who are fabricators of the gas plant said the project is the brainchild of the Managing Director of Ossiomo Power Company, Dr. Uwa Igiehon.\nHe said, “We did the welding, fabrication and installation of the Ossiomo Gas Conversion Plant.\nDr. Uwa was the person who invited the two unions to join in the building of the gas plant.\nHe engaged us throughout the process of the fabrication and construction of the gas plant.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo State Government Pledges Partnership With Super 88.1 Fm – Nigerian Observer",
    "summarized_story": "Governor obaseki gave the assurance at the official commissioning of the SUPER FM 88.1 Station in Benin City recently.\nEarlier, the Chief Executive Officer (CEO) of Super FM 88.9 Mrs. Yemi Akiwunmi, said that SUPER FM is the brainchild of KCC Communication, adding that the parent company was established in 2019 and duly registered as legal business entity in Nigeria.\nShe said : “As as today (Friday, May 13, 2022) there are three branches of SUPER FM Radio station in Nigeria, including SUPER FM 88.1 FM that we are officially commissioning here today.\n“In the stable of KCC Communication, we also have SUPER 96.3 FM, Ijebu-Ode, Ogun State and SUPER 93.3 FM, Port-Harcourt, Rivers State.\nBy the grace of God, two more branches may join fast growing SUPER FM Radio family before the end of 2022."
  },
  {
    "headline": "Ƴan bindiga sun ƙona hedikwatar karamar hukumar Idemili ta Arewa a jihar Anambra",
    "summarized_story": ""
  },
  {
    "headline": "UMARNIN SALLAMA DA KUJERAR MINISTA: Pauline Tallen, Timiprr Sylva duk sun janye daga takara",
    "summarized_story": ""
  },
  {
    "headline": "Yadda EFCC ta damke Akanta Janar din Najeriya bisa zargin harkallar naira biliyan 80",
    "summarized_story": ""
  },
  {
    "headline": "Na koma PDP ne don in kawo karshen mulkin kama karyar da APC ke yi a Jigawa – Saminu Turaki",
    "summarized_story": ""
  },
  {
    "headline": "Gumi yayi kakkausar jan kunne ga waɗanda suka kashe Deborah, ya ce ba hurumin su bane yanke hukuncin kisa don an zagi Annabi SAW",
    "summarized_story": ""
  },
  {
    "headline": "‘We didn’t ask Igbo people to leave north’- Northern elders hit back at Presidency",
    "summarized_story": "The Northern Elders Forum (NEF) has criticized the presidency over what it described as ‘fictitious monologue’ by Malam Garba Shehu, the Special Assistant to the President on Media, over the allegation that it called for some sections of the country to secede.\nThe presidency had in a statement on Tuesday, accused the elders forum of asking the people of the southeast to leave the north over Biafra agitation.\nThe statement was titled “Statement By Northern Elders Forum on False Claim By the Presidency”It read, “The attention of Northern Elders Forum has been drawn to a Statement by Malam Garba Shehu, Special Assistant to the President on Media, claiming that the Forum has released a Statement instigating a section of Nigeria to leave the country.\n“Malam Garba Shehu’s Statement did not quote single word in the “Statement”, did not mention its signatory or its date.\n“Northern Elders Forum restates that it made no such release, and advises leaders to note the very sensitive times in which we live at the moment.”"
  },
  {
    "headline": "EFCC detains former reps speaker, Patricia Etteh over alleged fraud",
    "summarized_story": "Anti corruption agency, the Economic and Financial Crimes Commission (EFCC) has arrested and detained a former Speaker of the House of Representatives, Patricia Etteh over allegation of fraud involving a Niger Delta Development Commission (NDDC) contract.\nEtteh was arrested on Tuesday by the anti-graft agency in Abuja for questioning.\nEtteh was elected Speaker in 2007 but resigned only after a few months amid allegations of financial misappropriation.\nShe is the only woman in the country’s history to have been elected Speaker.\nIt remains unclear if the company is registered with Nigeria’s Corporate Affairs Commission."
  },
  {
    "headline": "APC has achieved more in 7 years than PDP in 16 years – Adamu",
    "summarized_story": "Abdullahi Adamu, the national chairman of All Progressives Congress (APC), says the party has accomplished more in its seven years of being in power that the People’s Democratic Party (PDP) managed in 16 years.\nThe APC chairman who was governor of Nasarawa State under the PDP spoke on Tuesday in Abuja at the inauguration of screening committees for State House of Assembly aspirants.\nThe party chairman, represented by the Deputy National Chairman (North), Senator Abubakar Kyari, stressed that he does not doubt that all the aspirants assembled at the International Conference Centre for screening will carry on with the party’s tradition of excellence.\nHe said, “We can beat our chest seven years after achieving what others have not been able to do.\nYou will face challenges, but you are there not to succumb to those challenges.”Kyari described the screening of the State House of Assembly as the foundation of all the primaries."
  },
  {
    "headline": "Dangote Cement ranked best performing stock – Nigerian Exchange",
    "summarized_story": "Dangote Cement Plc, Africa’s largest cement manufacturer, has emerged as the Best Performing Stock of the Year 2021 by the Nigeria Exchange Group (NGX).\n“As a responsible entity, known for aligning with best global practices, we recognize the importance of corporate governance and effective board leadership in driving sustainability on the business front.\nAigbogun expressed happiness that the Nigeria capital market has remained strong in the mix of the global realignment that is going on consequent upon the Ukrainian crisis.\nMr. Obu Oliver, the Group Financial Controller, Dangote Cement Plc.\nwho received the award thanked the organizers for the award and assured that the companies would not rest on its oars in sustaining the strategies that make the stock the best performing."
  },
  {
    "headline": "Ibrahim Shekarau, ex Kano governor dumps APC, joins Kwankwaso’s NNPP",
    "summarized_story": "Senator Ibrahim Shekarau, a former governor of Kano State has officially joined the New Nigeria Peoples Party (NNPP) from the ruling All Progressives Congress (APC).\nThe former DG of Asiwaju Bola Tinubu’s Support Group AbdulMumin Jibrin, who recently joined the NNPP made the disclosure via a tweet on his official Twitter page.\nThe tweet reads, “BREAKING- Sen Ibrahim Shekarau joins NNPP.\nDetails later.”NNPP is the party of Musa Kwankwaso, a former governor of the state who has since picked its presidential ticket for 2023."
  },
  {
    "headline": "IPAC Bemoans Death Of Deborah Samuel",
    "summarized_story": "Inter Party Advisory Council (IPAC) has bemoaned the killing of Miss Deborah Samuel Yakubu last Thursday, 12th of May, 2022 at the Shehu Shagari College of Education, Sokoto, saying that it came to Council as a jolting and troubling piece of news.\nThe national leadership of IPAC sent its heartfelt condolences to the parents and other members of the family of young, Miss Deborah Samuel Yakubu.\nThe statement reads in part, “Without going into the details in order not to tamper with frayed nerves, or, to exacerbate the smolders triggered by the unfortunate incident, IPAC will want to appeal to all concerned to exercise utmost restraint.\nWe implore our political, religious and traditional leaders to eschew the tendencies of making inflammatory utterances and statements that can inflame passions.\n“We also wish to register our appreciation and commendation to the Governor of Kaduna State, His Excellency, Mal."
  },
  {
    "headline": "Stakeholders Charge Journalists On Professionalism, Welfare",
    "summarized_story": "Stakeholders in the journalism profession have stressed the need for media practitioners to strictly abide by the rules and regulations governing the practice of the profession so as to curb fake news.\nThey also advocated for standard remunerations of working journalists in the country to safeguard their well-being, welfare and security while carrying out their legitimate responsibilities as provided for in the 1999 Constitution of the Federal Republic of Nigeria (as amended).\nThe stakeholders spoke at the launching of a book titled, “My Journey” written by the outgoing national secretary of the Nigeria Union of Journalists (NUJ), Shu’aibu Usman Leman who served as the union’s scribe for 19 consecutive years, held Monday at Hazibal Hotel and Suites, Bauchi.\nThe NUJ president observed that without a flourishing, responsive and responsible media industry, the unity of the country and Nigerian democracy is in peril, hence the media is the oxygen of a working democracy.\nHe charged journalists to ensure proper and adequate checks before stories are written and transmitted for public consumption, adding that criticisms should be done in an objective and constructive manner devoid of prejudices."
  },
  {
    "headline": "World Hypertension Day: 72% Of Nigerians Are Hypertensive – PSN – Leadership News",
    "summarized_story": "Chairman of the Abuja branch of the Pharmaceutical Society of Nigeria, Mr. Ifeanyi Ikebudu, has declared that 72 percent of Nigeria’s population is hypertensive.\nIkebudu stated this at a sensitisation outreach in Abuja yesterday to commemorate this year’s World Hypertension Day, which is marked every may 17.\n“According to a 2019 statistics report, 17.9 million people died from cardiovascular accidents globally.\nUnfortunately, 75% of deaths arising from cardiovascular accidents occur in low and middle-income countries of which Nigeria is one.\nWe visit orphanages and schools to empower people with knowledge and carry out health outreaches,” stated Bello."
  },
  {
    "headline": "World Hypertension Day: 72% Of Nigerians Are Hypertensive – PSN – Leadership News",
    "summarized_story": "Chairman of the Abuja branch of the Pharmaceutical Society of Nigeria, Mr. Ifeanyi Ikebudu, has declared that 72 percent of Nigeria’s population is hypertensive.\nIkebudu stated this at a sensitisation outreach in Abuja yesterday to commemorate this year’s World Hypertension Day, which is marked every may 17.\n“According to a 2019 statistics report, 17.9 million people died from cardiovascular accidents globally.\nUnfortunately, 75% of deaths arising from cardiovascular accidents occur in low and middle-income countries of which Nigeria is one.\nWe visit orphanages and schools to empower people with knowledge and carry out health outreaches,” stated Bello."
  },
  {
    "headline": "Emmanuel Meets Atiku, Hayatu-Deen, Canvasses United Front In PDP",
    "summarized_story": "Akwa Ibom State governor and presidential aspirant Udom Emmanuel, has advocated for a consensus strategy for the Peoples Democratic Party (PDP) to return to power in 2023.\nGovernor Emmanuel canvassed this position during a courtesy visit on him by former Vice President and co-aspirant Atiku Abubakar at the Government House, Uyo, the state capital.\nUdom expressed optimism that if Nigerians support the PDP to clinch power, the present economic downturn will be reversed, stressing that whoever emerges at the primaries to fly the party’s flag would get his maximum support.\nEarlier, Atiku, who had consulted the PDP hierarchy led by the chairman, Elder Aniekan Akpan and national delegates to the presidential primary, thanked Emmanuel for the warm reception accorded his team.\nAtiku said the party would queue behind any presidential aspirant who emerges at the party’s primaries, adding that PDP is united in its decision to offer the best to Nigerians."
  },
  {
    "headline": "Breaking: Court Rejects Nnamdi Kanu’s Application For Bail",
    "summarized_story": "Kanu must explain why he violated the prior bail granted to him, according to Trial Justice Binta Nyako, before the court may grant him another favorable discretion.\n“However, the defendant is at liberty to refile the application”, Justice Nyako held.\nKanu, told the court that he was severely tortured for eight days in Kenya, before he was repatriated back to Nigeria for continuation of his trial.\nThe IPOB leader told the court that he has “credible and reliable sureties”, pledging that he would not commit any offence while on bail.\nHe further drew attention of the court to the fact that he was previously released on bail on health ground."
  },
  {
    "headline": "BREAKING: Protest, Gunshots Rock Rivers APC Secretariat Over Screening",
    "summarized_story": "During screening on Wednesday morning, gunshots erupted amid protests near the All Progressives Congress secretariat on Woji Road, GRA, Port Harcourt, Rivers State.\nHundreds of APC loyalists loyal to Senator Magnus Abe, a former federal lawmaker, flocked to the venue, alleging a hijacking of state assembly aspirant screening and ward/state delegate selection.\nMembers of the aggrieved party claimed they arrived at the secretariat around 6:00 a.m. to find the gate locked and keyed.\nTrouble began when some of the youths tried to force open the gates, prompting police officers stationed inside the party secretariat to fire into the air.\nThe gunfire produced chaos in the neighborhood, with journalists covering the demonstrators and news crews fleeing for their lives."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu In Court For Bail Hearing",
    "summarized_story": "The leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu has arrived at the Federal High Court in Abuja for the ruling by the court on his request for bail.\nHe was brought to the courtroom by fully armed stern-looking operatives of the Department of the State Service, DSS, around 10:12 am.\nDressed in his designer Fendi attire, Kanu was welcomed into the courtroom by Mike Ozekhome (SAN) who is leading his legal team.\nThough, looking unruffled, one of his senior brothers wept after hugging him for close to a minute to exchange pleasantries.\nMeanwhile, Justice Binta Nyako is expected in the court to deliver a ruling on the bail request."
  },
  {
    "headline": "Aiyefele’s Fresh FM Ibadan: Police Arrest Suspected Robbers",
    "summarized_story": "Ayobami Erinfolamin, 35, has admitted to directing a heist operation at Fresh FM Ibadan with some of his gang members.\n“On 10th April, 2022, at about 2300hrs, several members of a renowned criminal gang who specialize in invading hotels, hospitals, and other public locations to attack unsuspecting members of the public, invaded FRESH FM Challenge area, Ibadan,” said State Commissioner of Police, CP Ngozi Onadeko.\nShe stated that armed bandits broke into the FM station’s studio, assaulted and robbed on-duty personnel of large sums of money, fancy cell phones, and an FM Radio Transmitter Laptop at gunpoint.\nHe said, “I’m not the owner of this gun, but it was used by my friend for the operation.\n“After we robbed Fresh FM, we also robbed at Delight Hospital at Ring Road that same night, I was given N20,000 as my share after we’ve sold all the looted items."
  },
  {
    "headline": "Breaking: Former Kano governor, Ibrahim Shekarau, dumps APC, joins NNPP (PICTURES)",
    "summarized_story": "A former Governor of Kano state and the current senator representing Kano Central, Ibrahim Shekarau, has dumped the ruling All Progressives Congress and defected to the New Nigeria Peoples Party.\nFormer House of Representatives member, Abdulmumin Jibrin, made this known via his twitter handle on Wednesday.\nAccording to him, “Game over!\nWelcome to NNPP, Sen Ibrahim Shekarau.”Share this: TwitterFacebook"
  },
  {
    "headline": "May 28/29 PDP National convention: Ortom lobbies Jonathan amid tension over 4000 delegates’ list",
    "summarized_story": "“The party wants to lobby Jonathan to attend the National Convention and work for PDP ahead and during the 2023 general elections,” another source said.\nMark, others okay venueMeanwhile, Chairman PDP National Convention Organising Committee and former President of the Senate David Mark, has inspected the Moshood Kashimawo Abiola (MKO) Stadium in Abuja, the planned venue of the convention.\nThe 96th National Executive Committee (NEC) of the PDP had agreed that the party’s 2023 National Convention should hold in Abuja.\nBlueprint gathered that the major reason for the shift of the primary/congresses was the unresolved controversy around the delegates list.\nA credible source who did not want his name mentioned in print, said “the major issue is the delegates’ list."
  },
  {
    "headline": "APC inaugurates 37 committees to screen 3,000 House of Assembly aspirants",
    "summarized_story": "The All Progressives Congress (APC) Tuesday inaugurated 37 screening committees to screen more than 3,000 of its members jostling for House of Assembly seats nationwide.\nThe leadership of the party constituted each committee per state and also for the Federal Capital Territory (FCT).\nEach committee has seven members per state, while the screening appeal committee has five members per state, including the FCT.\n“But the basic foundation is what you people are going to do, which is the election of local government and state delegates.\n“We are going to elect three (3) delegates from each of the 774 local governments who will elect the president."
  },
  {
    "headline": "Naira in free fall, now N600 to $1",
    "summarized_story": "By Our CorrespondentThe free fall of our national currency the Naira against major currencies continued yesterday as it weakened against the United States of America dollar to trade at N600 at the parallel market.\nThis non-stop depreciation of the Naira, which incidentally has been officially devalued thrice under this administration, is a pointer that the fiscal policies are not responding to market trends.\nAbubakar, a BDC operator in Ikorodu, told an online medium that buying and selling prices stood at N595 and N600 per dollar.\nA parallel market (street/black market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira."
  },
  {
    "headline": "Oil price hits $115 a barrel, highest in seven weeks",
    "summarized_story": "Oil prices rose on Tuesday amid an ongoing push by the European Union for the Russian oil imports ban.\nBrent crude climbed 1.04 per cent to $115.29 a barrel on Tuesday — the highest since March 28.\nOn Monday, EU foreign ministers failed in their effort to pressure Hungary to sign up to a proposed embargo on Russian oil.\nJeffrey Halley, analyst at brokerage OANDA, said: “Oil prices have remained near multi-week highs this week, supported by surging gasoline and distillate prices in the U.S., and fears around an EU ban on Russian oil imports remaining in play”.\nHigh oil prices, among other underlying factors, continue to affect Nigeria’s deregulated oil market."
  },
  {
    "headline": "TCN reconstructs vandalized transmission tower in Uyo",
    "summarized_story": "… Set to energise transmission line soonBy Onu OkorieTransmission Company of Nigeria TCN has disclossed that the reconstruction works on the vandalized transmission Tower Number 104 on Odukpani – Ikot Ekpene 330kV double-circuit transmission line in Akwa Ibom has been completed, while work is ongoing to fortify other towers minimally vandalized along the same line route, to enable the restringing and tensioning of the 330kV DC transmission line, before it is energized.\nThe Executive Director, Transmission Service Provider (TSP) at TCN, Engr.\nAdewumi, who briefed newsmen at the site, said the tower has been reconstructed and work has reached an advanced stage after three weeks, even with difficulties posed by the terrain.\nAdewumi appealed to the public to help TCN in the fight against the vandalism of power infrastructure, saying that such acts are detrimental to Nigerians and the expansion of power infrastructure in Nigeria.\nHe also assured residents of Cross River State and parts of Akwa Ibom State that the company was fast-tracking the completion and restoration process."
  },
  {
    "headline": "Mastercard Foundation subsidized loans will break barriers to MSMEs productivity in Nigeria – Mrs Edu",
    "summarized_story": "By Onu OkorieThe Managing Director, First City Monument Bank FCMB, Yemisi Edun has described the Mastercard Foundation subsidized loans to 100,000 Micro, Small, and Medium Enterprises MSMEs as a purpose-driven intervention that would further help break the barriers that limit MSMEs’ productivity and overall success in Nigeria.\nThe program, which is part of the Mastercard Foundation’s Young Africa Works strategy in Nigeria, aims to sustainably move Nigerian youth out of poverty.\nThe remaining 30 percent will be deployed to meet the funding needs of youth-owned enterprises and businesses run by vulnerable members within Nigeria.\nShe said, “The past few years have been very challenging for individuals, households, and businesses in Nigeria.\n“We are proud to partner with the Mastercard Foundation to rebuild businesses, drive recovery, and stimulate economic growth by providing the much-needed support to Nigerians to engage in productive activities."
  },
  {
    "headline": "ABCON unveils roadmap on ‘save naira’ campaign",
    "summarized_story": "By Kehinde Ibrahim, LagosAssociation of Bureaux De Change Operators of Nigeria (ABCON) has developed a roadmap campaign plan needed to save the naira from further decline and enhance exchange rate stability.\nThe ABCON National Executive Council said the move to save the naira was agreed by the body at the conclusion of its meeting in Lagos, where it unveiled strategies for save the local currency, bridge the exchange rate gaps and curb volatility in the forex market.\nThe naira exchanges at N596 to dollar at the parallel market and N415.83 to dollar at the official market creating a rate gap of N180.17 per dollar.\nGwadabe insisted that now is the time to break the current industry monopoly that puts the remittances market in the hands of few players depriving others from tapping into the plan.\nThe ABCON can also be recognized as self-regulatory organization to enable it operate effectively and sanction erring members,” he stated."
  },
  {
    "headline": "BREAKING: FG Withdraws Newly Amended Charges Against Nnamdi Kanu",
    "summarized_story": "The Federal Government has withdrawn the newly amended charge against the leader of the Indigenous People of Biafra, Nnamdi Kanu on Wednesday morning.\nEarlier, Kanu had been denied a bail application by Justice Binta Nyako of the Federal High Court in Abuja on the grounds that his absence in the past, since 2017, should be determined, before a bail application, would be entertained.\nUpon withdrawal of the newly amended charges by the FG, the Federal High Court struck out the charges preferred against Nnamdi KanuThis came after Mike Ozekhome complained to the court that the prosecution was trying to delay processes by continuous amendment of the charge against his client.\nOzekhome also told the court that this is the seventh time the Federal government was amending its charge.\nJustice Nyako agreed with Ozekhome’s submission stating that Kanu is not expected to take a plea on those newly amended charges immediately, as he needs time to digest them before doing so."
  },
  {
    "headline": "BREAKING: Court Declares Adeleke As Authentic PDP Candidate In Osun",
    "summarized_story": "The Federal High Court sitting in Osogbo has affirmed Senator Ademola Adeleke as the authentic candidate of the Peoples Democratic Party (PDP) in the July 16 governorship election in Osun State.\nJustice Nathaniel Emmanuel made the declaration on Wednesday while delivering a ruling in a suit filed by a factional candidate of the PDP, Prince Dotun Babayemi.\nAdeleke had been declared the winner of the governorship primary election of the Peoples Democratic Party, PDP, in Osun State, held at the Osogbo City Stadium.\nBayelsa State Deputy Governor, Senator Lawrence Ewurujakpo, who presided over the party’s National Congress Committee, announced Adeleke winner with 1,887 votes.\nREAD ALSO: Court Denies Nnamdi Kanu’s Bail ApplicationBabayemi went to court to be recognised as the authentic candidate of the Party following the parallel primaries."
  },
  {
    "headline": "FG Amends Charges Against Nnamdi Kanu, Lists Lawyers As Accomplices",
    "summarized_story": "The Federal Government is set to re-arraign the detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, on an amended six-count of treasonable felony.\nA member of Kanu’s legal team, who craved anonymity, says the FG had in the amended charge, listed some lawyers representing the embattled IPOB leader, including Misters Ifeanyi Ejiofor and Maxwell Opara, as accomplices of the defendant.\nIt is gathered that the FG alleged that the said lawyers, were constantly in contact with Kanu after he jumped bail and fled the country.\nREAD ALSO: Soludo Visits Nnamdi Kanu, Says Together Peace Will Be Restored In AnambraJustice Binta Nyako had on April 8, struck out eight out of the 15-count treasonable felony FG preferred against Kanu.\nScenes from the court showed Kanu, his lawyer Mike Ozekhome and supporters in triumphant celebration over the amendment."
  },
  {
    "headline": "Death Toll Rises To Nine In Kano Explosion",
    "summarized_story": "﻿At least nine persons have died after an explosion rocked Aba Road in Sabon Gari area of Kano, the Ministry of Humanitarian Affairs said on Tuesday.\nThe police earlier said the explosion was triggered by gas cylinder and not a bomb as being speculated.\nREAD ALSO: I Won’t Run For President –AfDB’s Adesina“It is not a bomb explosion, it is a gas explosion,” Commissioner of Police, Sama’ila Dikko, said in a voice recording.\n“A gas cylinder explosion.\n“Because there is a welder, just by the place, and he is the first victim in this situation.”Dikko added that the police, in collaboration with other security agencies, was also investigating what led to the gas cylinder explosion."
  },
  {
    "headline": "Mozambique Detects Polio Case After Malawi Outbreak",
    "summarized_story": "Mozambique has detected its first case of wild poliovirus in three decades, following an outbreak in neighbouring Malawi in February, the World Health Organization (WHO) announced Wednesday.\n“The detection of another case of wild poliovirus in Africa is greatly concerning, even if it’s unsurprising given the recent outbreak in Malawi,” WHO Africa chief Matshidiso Moeti said.\nAfrica was declared free of indigenous wild poliovirus in August 2020 after no polio cases had occurred on the continent for the previous four years.\nThe WHO said lab tests showed that the Mozambique case was linked to a strain that had circulated in Pakistan and led to the case reported in Malawi.\nThe outbreak in Malawi has prompted southern African countries to launch a vaccination blitz."
  },
  {
    "headline": "Adesina says AfDB duties will not allow Presidential run in 2023 -",
    "summarized_story": "President of The African Development Bank(AfDB) Dr Akinwumi Adesina has declared he was deeply honoured, humbled and grateful for all the goodwill, kindness, and confidence by those urging him to contest the 2023 presidency.\nHe regretted that his current responsibilities at the bank would not allow him contest for the presidency.\nI remain fully engaged and committed to the mission that Nigeria, Africa and all the non-African shareholders of the African Development Bank have given me for Africa’s development.\n“I remain fully focused on the mission of supporting the accelerated development and economic integration of Africa.\nMay God bless Africa.”A support group of Nigerians in the Diaspora bought and submitted the All Progressives Congress (APC) presidential nomination form for Adesina, which he has rejected."
  },
  {
    "headline": "Zamfara APC Lawmaker Returns to PDP",
    "summarized_story": "A federal lawmaker in Zamfara Suleiman Abubakar Gummi representing Gummi/Bukuyyum federal Constituency at the House of Representatives has left the ruling All Progressive Congress APC to return to the People’s Democratic Party PDPThe green chamber lawmaker said the party in Zamfara has not been honest and fair to it Members and necessitated his defection to the PDPhttps://www.tvcnews.tv/purplegold/post-new.php#Suleiman Gummi was elected Member of the House of representatives under the platform of the People’s Democratic Party in 2019 but defected to the APC alongside governor Bello Matawalle and other top Government Officials in June 2021Ten months later, the Green Chamber lawmaker defected back to the PDPhttps://www.tvcnews.tv/purplegold/post-new.php#This decision he said was as a result of the sharing of elected political offices by the state Governor Bello Matawalle and former Governor Abdul’azeez Yari among other top APC Bigwigs ahead of the 2023 General elections which has affected his seatSuleiman Gummi announced his move and his supporters to the PDP at Political Gathering in Gummi, Local Government area of Zamfara State.\n“We cannot Continue to remain in APC especially the way the party is going in Zamfara State.\nLet them use the money and build our bridge, equipt and supply drugs to our Hospitals etc” .\nHe advised the GovernorSuleiman Gummi appeal to his supporters to remain calm and peaceful and assured them of Victory at the polls.\nPeople’s Democratic Party according to him bounce back stronger in Zamfara."
  },
  {
    "headline": "Timipre Slyva withdraws from Presidential race -",
    "summarized_story": "Minister of State for Petroleum, Chief Timipre Sylva, has withdrawn from the presidential race in the All Progressives Congress and has returned to work.\nMr Sylva reportedly withdrew having considered the enormous work at hand at the ministry of Petroleum Resources.\nThe Northern Solidarity Group had on May 9, presented the APC’s Expression of Interest and Nomination forms to the minister to enable him to contest the party’s 2023 presidential primaries.\n“He believes that concentrating on his work will attract more investments for the oil and gas sector.\nMeanwhile, Mr Horatius Egua, Senior Adviser, Media and Communications to the minister, when contacted, confirmed to NAN that the minister was back to work."
  },
  {
    "headline": "2023: Wike visits Lagos, seeks support of PDP delegates",
    "summarized_story": "Governor of Rivers State and PDP presidential aspirant, Nyesom Wike, says he will end injustice in the country and initiate measures to fight poverty among Nigerians if elected president.\nMr. Wike stated this at a meeting with national delegates of the People’s Democratic Party in Lagos State.\nGovernor Wike highlighted his plans for the country, harping on the need to end insecurity and poverty bedevilling the nation.\nBut in a quick twist, the Rivers state Governor said if he doesn’t win the ticket, he would support anyone who wins to ensure that the party returns to power.\nThe PDP’s national convention to nominate its Presidential candidate for the 2023 general elections is slated for the 28 and 29 of May 2022."
  },
  {
    "headline": "China Eastern Plane Crash Likely Intentional, US Reports Say",
    "summarized_story": "All 132 passengers and crew on board the plane died in the crash.\nABC News, citing US officials, also reported that the crash was believed to have been caused by an intentional act.\nChina Eastern Airlines previously said the three pilots on board were qualified and in good health.\nThe airline separately told the Wall Street Journal that there was no indication that any of the pilots was in financial trouble.\nThe Civil Aviation Administration of China (CAAC), which is leading investigations into the crash, also did not immediately respond to a BBC request for comment."
  },
  {
    "headline": "Finland, Sweden Apply to Join NATO as Russia Pummels Ukraine",
    "summarized_story": "Finland and Sweden formally applied to join NATO on Wednesday, prompted by Russia’s invasion of Ukraine and triggering one of the most significant changes in Europe’s security architecture in decades.\nFinland and Sweden were both neutral throughout the Cold War and their decision to join NATO reflects the sweeping shift in public opinion in the Nordic region since Russia’s Feb. 24 invasion.\nFive arrived in the Russian-held town of Novoazovsk, where Moscow said wounded fighters would be treated.\nSeven buses carrying Ukrainian fighters from the Azovstal garrison arrived at a newly reopened prison in the Russian-controlled town of Olenivka near Donetsk, a Reuters witness said.\nRussia said at least 256 Ukrainian fighters had “laid down their arms and surrendered”, including 51 severely wounded."
  },
  {
    "headline": "APC Stalwart Tinubu Vows Not to Quit Politics, Presidential Race",
    "summarized_story": "National Leader of All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, has vowed not to retire from politics until he actualises his dream of becoming the President of Nigeria.\nTinubu, who said this on Tuesday in Makurdi, Benue State capital, while addressing delegates and party members, explained that he was in the presidential race to rekindle the hope of Nigerians.\nHowever, speaking further on his ambition, Tinubu was of the view that there was no contest between him and whoever would emerge as candidate of the opposition PDP.\nBut if elected, he said, “l will bring the experience of my leadership in Lagos State as a governor to bear on leadership style in Nigeria.\nThe lesson here is that the buy-in of all component segments of the nation is required to build the nation."
  },
  {
    "headline": "In Historic Deal, Afreximbank, African Oil Producers Sign Agreement to Float Energy Bank",
    "summarized_story": "Africa’s multilateral trade finance institution, the African Export-Import Bank (Afreximbank), has signed a deal with the African Petroleum Producers Organisation (APPO) for the creation of an energy bank.\nSylva said since western nations were scaling down funding for hydrocarbon exploration across the world and focusing on renewable energies, setting up an African energy bank remains a viable way to neutralise the threat.\nThe African Energy Chamber, (AEC) Q1 2022 report on the state of African energy, says that from the peak in 2014 at $60 billion, capital expenditure in Africa declined to $22.5 billion in 2020.\n“The African Energy Chamber has been pushing for the creation of an African Energy Bank, one that is African-based and Africa-focused, and I am proud to announce that the Afreximbank and APPO have taken the first steps towards its creation.\n“ The bank will be critical for Africa’s energy sector, serving as a catalyst – not a substitute – for private investment in African energy."
  },
  {
    "headline": "Current Visa Arrangement Frustrating Nigeria-US Trade, Says Lagos US Consul",
    "summarized_story": "The Head of Commercial Section/Commercial Counsellor, Lagos US Consulate, David Russell, on Tuesday, stated that the current visa environment between Nigeria and the United States of America was the biggest limiting factor hindering trade between both countries.\n“We have to get the risk profile to a level that is acceptable to US businesses.\nOur goal is to look to the bright sides and perceptions of risk within markets like Nigeria.\nThere are significant opportunities for both countries as we look to reopen for business,” said.\nHe said the US government was dedicated to increasing two way trade and mobilising investment inside Africa’s fast growing markets."
  }
]