[
  {
    "headline": "Court remands five youths who tortured lady in viral video",
    "summarized_story": "A Chief Magistrate Court sitting in Ilorin, Kwara State, has ordered the remand of five young men who allegedly tortured a lady in a viral video at the Federal Correctional facility in Mandala, Ilorin till August 1, 2022.\nThe five accused persons, Jimoh Abdulfatai, Olamide Babatunde, Afeez Ayomide, Agboola Abdulsamad, and Yakubu Mustapha, were slammed with a five-count charge.\nThey were alleged to have assaulted and tortured a young lady, Ayomide Afolayan, of Songa village, Shao in Moro Local Government Area of Kwara State on Monday, June 20, 2022.\nThe five accused persons pleaded not guilty to the charges before the Court.\nOne of the counsels for the accused persons, Toyin Onoolapo, prayed the court to grant the accused persons bail as the law presumes them to be innocent of the alleged crime until proven otherwise by the Court."
  },
  {
    "headline": "Saraki set for showdown with terminal operators over container deposit",
    "summarized_story": "Gbemisola Saraki…Renews fight against high cost of doing business at seaportsBy Godwin OritseTHE Minister of State for Transportation, Senator Gbemisola Saraki, has frowned at the high cost of doing business at the nation’s seaports, vowing to reverse the trend.\nSpeaking during an interactive meeting with maritime stakeholders including terminal operators, shipping companies, freight forwarders and others in Lagos, Saraki said she would put processes in place to ensure that shipping companies promptly refund container deposits paid by importers and agents.\nShe stated: “The maritime industry is a major engine room in our national economy and as such, we must ensure that infrastructure is adequate and that there’s synergy across the industry while providing access to all our stakeholders.\n“The enterprise architecture we plan on implementing will ensure that the communication is dynamic and not stagnant and integrate into the ministry’s plan.\nAt Federal Ministry of Transportation, we value all our stakeholders as partners in governance and business.”The stakeholders commended Saraki for convening the meeting and assured her of full cooperation to reposition the maritime industry for greater productivity."
  },
  {
    "headline": "IPOB: Why Nnamdi Kanu is yet to be granted bail -Buhari",
    "summarized_story": "Tells British PM, Johnson, he won’t seek another termBy Johnbosco AgbakwuruABUJA–PRESIDENT Muhammadu Buhari, has told the British Prime Minister, Boris Johnson that there have been apprehension in admitting on bail detained leader of the proscribed Indigenous people of Biafra, IPOB, Mazi Nnamdi Kanu because he jumped jumped bail the previous time he was granted bail.\nPresident Buhari stated this on Thursday, when he held a bilateral meeting with Prime Minister of Great Britain on the margins of the 26th Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda.\nThe President at the meeting reiterated his resolve to respect the maximum term limit in the Nigerian Constitution.\nThe PM, obviously not quite familiar with the maximum two terms limit, had asked if President Buhari would run for office again.\nIt’s a massive partnership for us, and we need to capitalize on it.”The Prime Minister offered condolences on some recent attacks in Nigeria, particularly on churches."
  },
  {
    "headline": "Hajj 2022: You’ll get your BTA in dollars soon, Lagos Commissioner assures pilgrims",
    "summarized_story": "Speaking at the Hajj camp, Murtala Mohammed International Airport (MMIA), Ikeja, Lagos,Elegushi explained that the State Government had paid the naira equivalent of the needed US dollars to Union Bank of Nigeria Plc.\nbut the bank was demanding for the e-passport of each intending pilgrim before releasing the dollars.\nWith the safe arrival of the fourth batch of 347 pilgrims, Lagos State now has 1,598 pilgrims already airlifted to the Kingdom of Saudi Arabia while efforts are still ongoing to airlift the remaining intending pilgrims in due course.\nGovernment functionaries at the airport to see off the pilgrims include, Special Adviser to the Governor on Islamic matters, Hon.\nAbdulWaheed Lolade Shonibare (Board member); Mr. Hakeem Kosoko (Secretary), South West Commissioner of NAHCON, Alhaja Basirat Akintunde, amongst others."
  },
  {
    "headline": "Kebbi NLC commends Bagudu over payments of gratuities to retired civil servants",
    "summarized_story": "By Haruna Aliyu, Birnin KebbiThe Nigeria Labour congress (NLC) on Thursday under the chairmanship of Comrade Umar Halidu Alhassan have commended the governor of Kebbi state Senator Atiku Bagudu for the payments of lump sum gratuities to Kebbi state retired civil servants across the state, local governments and local government education authorities.\nHe gave the commendation and commulative figure at the state secretariat of the Nigeria labour congress in Birnin Kebbi, Kebbi state.\nThe labour chief explained that, the huge sum covered retirees from 2016, 2017, 2018 balances of 2019 and full payments of 2020 and now approval of 2.981, 856, 465.48bn will pay full 2021 retirees in Kebbi state.\nHe noted that, the organised labour achieved the feat through holistic and peaceful engagements with Kebbi state government as they are part of the retirees screening and verifications committee under the leadership of the head of service Alhaji Sufiyanu Garba Bena.\nWhile urging the beneficiaries of the paid gratuities to use the monies judicously he call on workers in the state to be dedicated to their duties to justify their pay."
  },
  {
    "headline": "Train Attack: Relatives of abducted passengers contemplating suicide",
    "summarized_story": "By Ibrahim Hassan-WuyoLeaders of the relatives of the abducted Abuja-Kaduna train passengers, have raised alarm that thought of the harrowing experience of their loved ones in the kidnappers den had made some of their members to be thinking of committing suicide.\n” We cannot wait to see the end of this nightmare ,” he said.\nHe therfore appealed to the Federal Government to speed up the process of the release of the remaining 50 hostages who had spent 87 days in captivity.\nHe said the families thought the 22 women and children would have been set free in the first phase of those released by the terrorists.\n” Our joy will know no bounds if the remaining 50 hostages are set free by their captors in the shortest time possible,” he said."
  },
  {
    "headline": "P&ID scandal: Court convicts Nigerian company Marqott Limited, assets forfeited",
    "summarized_story": "Justice D. U. Okorowo of the Federal High Court in Abuja has convicted and wound up Marqott Nigeria Limited.\nThe firm is one of the thirty associated with the Process and Industrial Development Limited (P&ID) for alleged money laundering.\nThe EFCC said, in September 2014 in Abuja, they failed to submit to the Ministry of Industry, Trade and Investment, a declaration of activities of Marqott Nigeria Limited.\nEFCC also accused them of failure to combat money laundering and failure to designate at management level a compliance officer.\nJustice Okorowo found Marqott Nigeria Limited guilty of all charges and convicted it accordingly."
  },
  {
    "headline": "War: No safe place – Ukrainian army in Lysychansk lament",
    "summarized_story": "The Ukrainian army in the town of Lysychansk has cried out that no safe place is left in the area.\nSerhiy Haidai, head of the Luhansk region military administration of the Ukrainian army, said this on Thursday, as reported by CNN.\nMeanwhile, Russian cruise missiles targeted southern Ukraine on Thursday, according to the Ukrainian military’s operational command for that part of the country.\nIn Mykolaiv, three surface-to-air cruise missiles launched from occupied Kherson struck targets in the city.\nThe port city of Odessa was also targeted by two cruise missiles, the Ukrainian military said, adding that those missiles were shot down by the country’s air defenses."
  },
  {
    "headline": "Russia has taken over 55 per cent of Donetsk – Ukrainian military",
    "summarized_story": "Russia has taken over about 55 percent of the region of Donetsk with only 45 pe4cent still under the control of Ukrainian forces.\nKyrylenko is the head of the Donetsk region military administration.\nKyrylenko also spoke about a concentration of battalion tactical groups in Sloviansk and Lyman.\nUkrainian forces have “serious battles ahead,” he said.\nAccording to him, a continuation of shelling along the Bakhmut-Lysychansk highway is underway by the Russian forces to “cut off” Severodonetsk and Lysychansk from supplies."
  },
  {
    "headline": "War: Russia has improved – US officials",
    "summarized_story": "The US officials have said that Russian forces have learnt their lessons from mistakes they made during the earlier stages of their invasion of Ukraine.\nThe officials noted that Russia has improved in the areas of better coordinating air and ground attacks, logistics and supply lines.\nTwo US officials with direct knowledge of US intelligence assessments told CNN.\nThe US assessments paint a dismal image of the future of the war, with high personnel and equipment losses on both sides.\nUS officials believe that Russian forces plan to maintain intense attacks in the east, characterized by heavy artillery and missile strikes, with the intention of wearing down Ukrainian forces and NATO resolve over time."
  },
  {
    "headline": "Ekweremadu: Reputation of Nigerians at stake – Shehu Sani",
    "summarized_story": "Shehu Sani, former Kaduna lawmaker, says the reputation of Nigerians is at stake following the cases involving ex-Deputy Senate President, Ike Ekweremadu and his wife, Beatrice.\nDAILY POST had reported that Ekweremadu and the wife were arraigned before a UK court on Thursday over alleged organ trafficking.\nSani took to his Twitter page appealing to the court of public opinion to be patient with their judgement and keep watch of the UK legal proceedings.\nSani on his Twitter page wrote: “Senator Ike Ekwerenmadu: The court of public opinion should be patient and follow the UK legal proceedings.\nEkweremadu is said to have had £20,000 on him at the time of his arrest, according to prosecutors."
  },
  {
    "headline": "IPMAN accuses depot owners of profiteering from fuel scarcity The Nation Newspaper",
    "summarized_story": "Private depots are owned by members of the Depots and Petroleum Products Marketers Association, (DAPPMA).\nThe statement reads: “The government is doing nothing about the private depots that are violating the system by selling higher.\nRead Also: Petrol scarcity worsens“We aren’t saying there is non-availability of petroleum products, but what is available isn’t sufficient.\n“This non-availability has led to profiteering from the hands of Products Depots Operators along the coastal areas.\nThese products are being sold to private depots at government-approved rates, not above N148."
  },
  {
    "headline": "Organ Harvest: What Ekweremadu, wife told London court The Nation Newspaper",
    "summarized_story": "Going the record of a United Kingdom (UK) Magistrate’s Court, Senator Ike Ekweremadu and his wife Beatrice denied allegations of human trafficking levelled against them by the Metropolitan Police in London.\nThe report which trended on social media was titled: “What Ekweremadu’s lawyers said.”The report reads: “Mr Ekweremadu in his prepared statement denied allegations of human trafficking.\n“‘He said at no stage has he arranged transport for anyone with intention to exploit them.’Read Also: What you need to know about organ harvesting“His wife similarly denied the allegations in her prepared statement, the court heard.\n“Gavin Irwin, representing Ekweremadu, said: ‘There is no question this is a serious allegation.\n“Antonia Gray, for Mrs. Ekweremadu, said: ‘She has never been complicit or involved in any alleged illegal trafficking of any young person."
  },
  {
    "headline": "MTN, Mafab get NCC’s August 24 rollout deadline The Nation Newspaper",
    "summarized_story": "Spectrum franchise winners MTN and Mafab Communication were yesterday given an August 24 deadline deploy the fifth generation (5G) technology.\nThe rollout deadline was given by the Nigerian Communications Commission (NCC) in line with the information memorandum (IM) of the licensees.\nNCC’s Executive Vice Chairman/CEO, Prof Garba Danbatta gave the order in Lagos at the 90th edition of Telecom Consumer Parliament.\nBy June 2025, the operators are expected to have completed a pan Nigeria rollout of 5G.\nAllaying the fears of those who think 5G will disenfranchise them from the network, Wakil said the 5G network will co-exist with its predecessor generation of wireless networks."
  },
  {
    "headline": "70,000 ghost workers weeded out of federal civil service The Nation Newspaper",
    "summarized_story": "Seventy thousand ghost workers have been “eliminated” from the Federal Government payroll through the Integration Personnel and Payroll Information System (IPPIS).\nArabi also disclosed that the government saved N10 trillion following the introduction of the Single Treasury Account (TSA) 10 years ago.\n“We have been able to reduce more than N220 billion wastage through wrong management of IPPIS on payroll by MDAs.\n“We have succeeded in getting the Treasury Single Account deployed in all MDAs.\n“And the government, especially at the top is always able to see what has come into our Treasury Single Account today and what has gone out of that."
  },
  {
    "headline": "Lawyer dresses like god of rivers to Supreme Court The Nation Newspaper",
    "summarized_story": "It was an unusual sight yesterday at the Supreme Court in Abuja.\nHis lawyer colleagues and court workers were also taken abackMalcolm Omirhobo sat on the front row without shoes.\nExplaining his action, Omirhobo said: “I am very grateful to the Supreme Court.\nIn a split decision of five to two, a seven-member panel of the Supreme Court had in its majority judgment, dismissed the government appeal.\nJustice Emmanuel Agim wrote the minority lead decision which Justice Inyang Okoro agreed."
  },
  {
    "headline": "Tension deepens in APC over planned defection by lawmakers",
    "summarized_story": "Adamu, at the meeting with APC senate caucus had expressed worry over the wave of defections rocking the party in the National Assembly.\nThe current configuration of the Senate shows that the APC has 61 lawmakers; PDP, 38; NNPP, three;Young Progressives Party (YPP), two; Labour Party, one; while All Progressives Grand Alliance (APGA) has one.\nThere are three vacant seats, vacated by APC national chairman, Adamu and two other APC lawmakers.\nAt plenary last Tuesday, three APC senators defected to the PDP.\nAPC lawmakers are defecting."
  },
  {
    "headline": "Buhari rejects third term, says first person who tried didn’t end well",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has reiterated his resolve to respect the maximum term limit in the Nigerian Constitution, saying the first person that tried to go for a third term didn’t end well.\nFormer president, Olusegun Obasanjo, reportedly in 2006 planned to amend the constitution to extend his tenure.\nPresident Buhari reiterated his position yesterday while in a bilateral meeting with Prime Minister of Great Britain, Boris Johnson on the margins of the 26th Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda.\nA statement by Special Adviser on Media and Publicity, Femi Adesina, said, the PM, who obviously is not quite familiar with the maximum two terms limit, had asked if President Buhari would run for office again.\nHe described the relationship between the countries as “very strong attachment,” adding: “I just want to be sure that we are doing enough."
  },
  {
    "headline": "Impeachment: Oyo deputy gov replies House of Assembly",
    "summarized_story": "From Oluseye Ojo, IbadanOyo State Deputy Governor, Rauf Olaniyan, has responded to allegations levelled against him by Oyo State House of Assembly, following impeachment process initiated against him by the lawmakers.\nSpokesman for the Assembly, Kazeem Olayanju, stated this when he featured on a radio programme monitored in Ibadan, yesterday.\nThe Office of the Deputy Governor has, however, been moved to the Ministry of Environment, where he is expected to discharge his duties.\nSpeaker Adebo Ogundoyin said the petition met the two-third requirements to initiate the impeachment process against the deputy governor.\nHe said the lawmakers would give the deputy governor a seven-day ‘grace period’ to respond to the allegations, which would end on Wednesday June 22."
  },
  {
    "headline": "Hijab: Lawyer causes stir, appears at S’Court in traditional attire",
    "summarized_story": "From Godwin Tsa, AbujaA Lagos-based human rights lawyer, Malcom Omoirhobo, caused a stir at the Supreme Court yesterday when he appeared in the full traditional attire of an “Olokun priest” to attend court proceedings.\nThe Supreme Court had, last Friday, given approval to female Muslim students to wear hijab to school in Lagos State.\nFive out of the seven members of the court’s panel which sat on the case ruled in favour of hijab, while the two members dissented.\nThe lawyer, who gained entry into the court, was barefooted with feathers attached to his wig.\nMalcom, who addressed journalists, said: “I am very grateful to the Supreme Court; just last Friday, they made a very resounding decision that promotes Section 38 of the Constitution."
  },
  {
    "headline": "Bishop Onaga’ll decide my return, Mbaka tells followers",
    "summarized_story": "Ejike Mbaka, has told his followers that he would only return to the adoration ground on the orders of Catholic Bishop of Enugu Diocese, Rev.\nSpeaking on Wednesday when he made an unscheduled appearance at the adoration ground to address his followers, he pleaded with the faithful to stop attacking the bishop as any attack on the Bishop is also an attack on him.\nThousands of adoration faithful had gathered at the adoration ground despite a directive by the ministry that there would not be services till further notice.\n“I’m a priest of the Catholic Church and the Bishop is my father.\n“We appreciate our Bishop and henceforth, I want to order everybody here to stop Insulting the Bishop."
  },
  {
    "headline": "Don’t Sell Your Votes, Oyetola Begs Electorate – THISDAYLIVE",
    "summarized_story": "Yinka Kolawole in OsogboOsun State Governor, Gboyega Oyetola, has urged the people of the state to shun the act of selling their votes to politicians whom he said have been boasting to induce electorate with ‘dollars and pounds’.\nThe governor, who said the APC was not for ‘fire for fire’, said they were to uphold a good democratic system.\nIf they bring the money collect it but don’t vote for them.\nOsun State should not be used as a test of governance with all the challenges facing the state.\n“There will be adequate security for Osun State governorship election, so don’t be intimidated by anyone."
  },
  {
    "headline": "Lagos Launches Floating Clinic for Emergency, Outreach Services – THISDAYLIVE",
    "summarized_story": "The Lagos State Government has launched a ‘Floating Clinic Boat’ for swift medical interventions along inland waterways and riverine communities as part of efforts to enhance access to prompt, qualitative and efficient healthcare services across Lagos.\nUnveiling the floating clinic after inspection, the Permanent Secretary, Lagos State Ministry of Health, Dr. Olusegun Ogboye, explained that innovation was introduced to help provide first aid, medical emergency care and basic healthcare services at accident scenes on the inland waterways and riverine communities in Lagos State.\nAccording to him, residents in riverine communities can access the services of the floating clinic through the Lagos State Emergency Services numbers, saying “Once you contact the emergency numbers, the clinic will be deployed.\nIf there is a call about an emergency on the waterways, remote and riverine areas, the emergency process will be activated,” he said.\nGovernor, recognising this, directed that medical services be taken to these areas as part of the mandate to achieve universal health coverage."
  },
  {
    "headline": "NAHCON Condoles with Sokoto over Bandits’ Attack on Hajj Pilgrims – THISDAYLIVE",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Chairman National Hajj Commission of Nigeria (NAHCON) Alhaji Zikrullah Kunle Hassan has sent a condolence letter to the government and people of Sokoto State over bandits’ attack on pilgrims from Isa local government.\nThe pilgrims were said to be travelling to Sokoto on Monday for take-off to Saudi Arabia for the 2022 Hajj before they were attacked.\nThe condolence was contained in a statement issued yesterday by NAHCON spokes person, Fatima Sanda Usara.\nHe also cautioned other states of the federation to reinforce security around pilgrims’ camps and their movements.\nHe reminded state chief executives that safety of the pilgrims and their escorts are their primary responsibilities consequently it should be taken with extra dedication."
  },
  {
    "headline": "Man, 50, Jailed for Raping Four-year-old in Ekiti – THISDAYLIVE",
    "summarized_story": "Victor Ogunje in Ado EkitiAn Ekiti State High Court sitting in Ado Ekiti has sentenced a 50- year old man, Mr. Usman Tajudeen, to life imprisonment for raping a four- year old minor.\nUsman was arraigned before Justice Lekan Ogunmoye on one count charge of rape, contrary to Section 31 (2) of the child’s Right Law, Cap.C7 Laws of Ekiti State, 2012.\nWhen I inquired from her, she said it was Usman that put his something to where I was urinating.\nThe matter was reported at Ikere Ekiti Police Station.”To prove his case, the Prosecutor, K.S.\nAdeyemo, called five witnesses and tendered defendant’s statement, victim’s statement and medical report as exhibits."
  },
  {
    "headline": "FRSC Inaugurates Dangote Truck Driving School – THISDAYLIVE",
    "summarized_story": "Dangote Cement Plc yesterday launched the Dangote Articulated Truck Driving School in a move to inculcate safe driving culture in its drivers so as to stem the tide of road crashes.\nThe opening of the school in partnership with the Federal Road Safety Commission (FRSC), the company management reasoned that that would also make the drivers become better road users.\nThe new academy for truck drivers, according to the Corps Marshal, is a significant step forward that will benefit not only the Dangote Group but Nigeria in general.\nThe country’s road safety chief hailed President and Chief Executive of the Dangote Group, Alhaji Aliko Dangote, for taking ‘a big step’ towards reducing truck Road accidents.\nYusuf, said NBTE would partner the Dangote Cement Plc for a successful accreditation and takeoff of the new school."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, ICPC Uncovers Billions In Cash Meant For Arms, Ammunition To Fight Boko Haram In Abuja Home Of Ex-Chief Of Army Staff, Buratai",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) has recovered N1.85 billion from a house and office said to belong to former Chief of Army Staff, Tukur Buratai in Abuja, multiple sources told SaharaReporters.\nThe Chief of Army Staff (COAS), Lt General Yusuf Tukur Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, ICPC Uncovers Billions In Cash Meant For Arms, Ammunition To Fight Boko Haram In Abuja Home Of Ex-Chief Of Army Staff, Buratai",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) has recovered N1.85 billion from a house and office said to belong to former Chief of Army Staff, Tukur Buratai in Abuja, multiple sources told SaharaReporters.\nThe Chief of Army Staff (COAS), Lt General Yusuf Tukur Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Presidential Candidates, Atiku, Tinubu, With History Of Fraud Allegations Not Likely To Promise Anti-Corruption Fight During Campaign —Bloomberg Report",
    "summarized_story": "The presidential candidates of the ruling All Progressives Congress (APC) and opposition Peoples Democratic Party (PDP), Bola Tinubu and Atiku Abubakar, have been described as unfit to end corruption in the country.\nAccording to the report, the history of graft allegations surrounding the two candidates means neither is likely to curb corruption in the run-up to February’s vote.\nThe report noted that Nigeria’s next president will face a daunting challenge to turn around Africa’s largest economy.\nIn July 2005, Jefferson told a cooperating witness that Atiku Abubakar had also agreed to accept a bribe in exchange for his assistance, according to the Louisiana congressman’s indictment.\nBoth Tinubu and Atiku will focus on issues other than corruption while campaigning, said Hoffmann."
  },
  {
    "headline": "Presidential Candidates, Atiku, Tinubu, With History Of Fraud Allegations Not Likely To Promise Anti-Corruption Fight During Campaign —Bloomberg Report",
    "summarized_story": "The presidential candidates of the ruling All Progressives Congress (APC) and opposition Peoples Democratic Party (PDP), Bola Tinubu and Atiku Abubakar, have been described as unfit to end corruption in the country.\nAccording to the report, the history of graft allegations surrounding the two candidates means neither is likely to curb corruption in the run-up to February’s vote.\nThe report noted that Nigeria’s next president will face a daunting challenge to turn around Africa’s largest economy.\nIn July 2005, Jefferson told a cooperating witness that Atiku Abubakar had also agreed to accept a bribe in exchange for his assistance, according to the Louisiana congressman’s indictment.\nBoth Tinubu and Atiku will focus on issues other than corruption while campaigning, said Hoffmann."
  },
  {
    "headline": "Nigerian Army, Police Arrest South-East Youths, Elderly People, Detain Them Without Trial, Harvest Their Organs — IPOB Alleges",
    "summarized_story": "IPOB, in a statement by its spokesperson, Emma Powerful said majority of the atrocities are committed at Wawa military barracks at Kainji in Niger State.\nIPOB called on the international community to prevail upon the Nigerian government and its security agencies to release every Igbo person who is being detained without trial.\n\"The people were unlawfully abducted and moved to the military facilities in North and some of these people were killed and harvested their important organs in the military barracks camp.\n\"IPOB now watches with keen interest going forward on discriminatory treatment and crimes against Biafrans and Igbos in particular.\nNigeria military should dignify themselves by releasing the Igbos under incarceration in various confinement facilities including those in Wawa military detention centre in Niger State and other Northern states in Nigeria."
  },
  {
    "headline": "'Be careful' -- Adamu warns Machina over Yobe north senatorial ticket",
    "summarized_story": "Abdullahi Adamu, national chairman of the All Progressives Congress (APC), has warned Bashir Machina, a party member from Yobe north, over his comments on the party’s senatorial ticket for the district.\nThe APC Yobe north senatorial ticket sparked controversy after Machina, who won the primary, insisted that he would not step down for Senate President Ahmad Lawan.\nLawan had, in May, contested for the APC presidential ticket, but lost.\nAmid the controversy over the ticket, the senate president, who currently represents Yobe north district, was eventually listed as the APC senatorial candidate for the 2023 general election.\nAdvertisementIn his comment on how Lawan became listed as the party’s candidate, Adamu had said the senate president participated in a primary for the district."
  },
  {
    "headline": "'Be careful' -- Adamu warns Machina over Yobe north senatorial ticket",
    "summarized_story": "Abdullahi Adamu, national chairman of the All Progressives Congress (APC), has warned Bashir Machina, a party member from Yobe north, over his comments on the party’s senatorial ticket for the district.\nThe APC Yobe north senatorial ticket sparked controversy after Machina, who won the primary, insisted that he would not step down for Senate President Ahmad Lawan.\nLawan had, in May, contested for the APC presidential ticket, but lost.\nAmid the controversy over the ticket, the senate president, who currently represents Yobe north district, was eventually listed as the APC senatorial candidate for the 2023 general election.\nAdvertisementIn his comment on how Lawan became listed as the party’s candidate, Adamu had said the senate president participated in a primary for the district."
  },
  {
    "headline": "Buhari to Boris Johnson: No third term for me -- first person who tried didn't end well",
    "summarized_story": "President Muhammadu Buhari has told UK Prime Minister Boris Johnson that there is no possibility of him seeking a third term in office.\nThe president spoke on Thursday during a bilateral meeting with Johnson on the sideline of the 26th Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda.\nAccording to Femi Adesina, presidential spokesperson, the British prime minister had asked if Buhari would run for office again, and he responded by saying: “Another term for me?\nThe first person who tried it didn’t end very well.”The president also denied that Nnamdi Kanu, leader of the proscribed Indigenous Peoples of Biafra (IPOB), was not being allowed to see his lawyers.\nWe eventually got him when he stepped out of the United Kingdom, and we sent him to court,” Buhari said."
  },
  {
    "headline": "Buhari to Boris Johnson: No third term for me -- first person who tried didn't end well",
    "summarized_story": "President Muhammadu Buhari has told UK Prime Minister Boris Johnson that there is no possibility of him seeking a third term in office.\nThe president spoke on Thursday during a bilateral meeting with Johnson on the sideline of the 26th Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda.\nAccording to Femi Adesina, presidential spokesperson, the British prime minister had asked if Buhari would run for office again, and he responded by saying: “Another term for me?\nThe first person who tried it didn’t end very well.”The president also denied that Nnamdi Kanu, leader of the proscribed Indigenous Peoples of Biafra (IPOB), was not being allowed to see his lawyers.\nWe eventually got him when he stepped out of the United Kingdom, and we sent him to court,” Buhari said."
  },
  {
    "headline": "DOCUMENT: Ekweremadu informed UK high commission about daughter's kidney donor",
    "summarized_story": "Ike Ekweremadu, former deputy senate president, had in December 2021, written a letter to the British high commission about a kidney donation for his daughter.\nThis is according to a copy of a letter to the UK high commission, seen by TheCable on Thursday.\nIn the letter, the former deputy senate president said he was writing in support of a visa applicant who was scheduled for “medical investigations for a kidney donation to Ms Sonia Ekweremadu”.\nHe said the donor and his daughter “will be at the Royal Free Hospital London”, adding that he would “be providing the necessary funding”.\nThe couple appeared before Uxbridge magistrates’ court on Thursday, but were denied bail and remanded in custody."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Kune, the controversial Kenyan foodtech startup, has shut down",
    "summarized_story": "Kune, a Kenyan food tech startup that delivered ready-to-eat meals at affordable prices, is closing down today, the company’s founder and CEO Robin Reecht announced.\nThe announcement comes just 4 months after the startup began its commercial operations at established meal centers around Nairobi.\nAround that time, Kune leadership also declared its intentions to raise $3.5 million in its second round of funding.\nBut while Kune was well-liked by its customers, the startup’s journey wasn’t without its fair share of controversy.\nAddressing Kune’s investors, he said, “Not only did you invest in Kune but you gave us your time, brain-width, connections, and emotional support."
  },
  {
    "headline": "These founders are helping companies make decisions with data",
    "summarized_story": "It wasn’t their first time venturing into business together; only the previous year they’d tried building an aggregator to curate data from various African countries which multinational companies could use.\nRutakangwa understands why these costly business errors occur: the data the multinational companies rely on—often collected by market research firms—is assumed African countries to be monolithic and did not provide companies with enough detail with which to make market expansion decisions.\nSo, Rutakangwa and Sewankambo employed regular local consumers, called “mappers”, to collect the data from shops and households.\nWhen a mapper submits the data, Rwazi verifies the information by checking that the shop or household’s geocoordinates matches the mapper’s current location.\nBut Rutakangwa saw things differently: in principle, mapping data for hospitals and pharmacies was the same as mapping for beverage and liquor companies."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Lafarge Africa, Sanwo-Olu, others to examine real estate sector",
    "summarized_story": "Lafarge Africa Plc, a member of the Holcim Group, is set to hold its public policy thought-leadership series, Concrete Ideas 5.0.\nLafarge’s Concrete Ideas series, now in its fifth year, has become not only a platform for the discussion of construction and real estate sector policies but also deliberations on broader public policy problems, according to a statement.\nThe Concrete Ideas platform, according to the statement, embodies Lafarge Africa’s thought-leadership interventions and has become a catalyst for the attainment of sustainable change, continuous improvement and commercial success within the sector.\n“The Concrete Ideas series continues to attract key players within the public and private sectors.\nLafarge Africa, working with leading stakeholders in the built and construction industry has created a succinct and coherent policy blueprint from the public policy series."
  },
  {
    "headline": "Exchange rate volatility creates naira, dollar ecosystem in premium real estate",
    "summarized_story": "She added that top developers in the luxury real estate business have been sticking with the dollar economy in the past five years.\nIn the luxury real estate market, there are micro divisions that are sometimes referred to as affordable luxury real estate.\nDevelopers in this segment, according to Okonjo, frequently work in the luxury real estate naira-based sector.\nUnlike other house-types, the development of luxury real estate takes time which is why Okonjo said “desperation does not fit with luxury.” She said that developers of luxury real estate are willing to wait and collaborate with their intended/target audience.\nGrade A, B and other categories exist for office spaces, but at Fine and Country, we focus on Grade A office spaces,” Okonjo said."
  },
  {
    "headline": "Travellers’ summer fares double on airlines’ trapped funds",
    "summarized_story": "As the summer travel season is picking up, the air fares paid by travellers from Nigeria to other destinations have risen by 100 percent as foreign airlines’ trapped funds in Nigeria hit $450 million.\nForeign airlines operating in the country have blocked almost all low ticket inventories on their websites, making it difficult for passengers to buy affordable tickets.\nShe called on the Central Bank of Nigeria (CBN) to intervene in the issue by releasing the funds to the airlines.\nIn 2016, when airlines funds were trapped in Nigeria, many airlines reduced frequency into the country while United Airlines and Iberia Airlines suspended flights into Nigeria and till date, Iberia Airlines has not returned.\nIf airlines start to sell tickets in dollars, they won’t be having these issues but Nigeria’s regulations do not allow them to sell tickets in dollars."
  },
  {
    "headline": "AAU varsity resumption: Obaseki says suspension of union activities not a witch-hunt – Nigerian Observer",
    "summarized_story": "The decision followed the protest by students of Ambrose Alli University (AAU), Ekpoma, over the lingering strike by the Academic Staff Union of Universities (ASUU), after which the government directed all cadre of staff to report to their duty posts immediately.\nWe will not compromise education because we are who we are today because of the quality of education that we received.\n“If ASUU has a problem with the federal government, how is that our problem in Edo State?\nIf ASUU has a problem with the federal government, why should we suffer in Edo?” he queried.\nHe said, “No employer of labour in Africa will increase wages without negotiation but you have achieved this."
  },
  {
    "headline": "GIZ, Edojobs Empower 3,000 Edo Students with Entrepreneurship Skills – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A German development agency, Deutsche Geselschaft fur Internationale Zusammenarbeit (GIZ), in partnership with Edo State Skills Development Agency, also known as Edojobs, has equipped more than 3,000 secondary school students in Edo with entrepreneurial skills in the last three years.\nHead, Economic Education and Entrepreneurship of GIZ, Miss Oladoyin Olawaiye, disclosed this at the Edo Student Entrepreneurship Activity Hub (SEA-Hub) Exhibition and Competition 2022, held in Benin on Wednesday.\n“I am pleased to see the students display innovative works and products after we had trained them on entrepreneurship skills.\nIn her remarks, Managing Director of Edo State Skills Development Agency, Mrs Ukinebo Dare, congratulated the students for keying into the life-changing opportunity to become solution providers at young age.\nDare added that the state government would partner more with GIZ to ensure that the entrepreneurship initiative was extended to more schools in the state."
  },
  {
    "headline": "DCNS. Ayo Eguaveon at 82: Harvesting the joys of motherhood – Nigerian Observer",
    "summarized_story": "So when Benin City was painted red on Sunday for the eighty-two birthday bash of Dcns.\nDcns Ayo’s children all attributed their successes in life to the sacrifices of their mother whom they all described as “virtous woman”.\nAyo Eguaveon earned as a teenager remains the only educational qualification of her life that she never stops telling her children and grandchildren about.\nWhile paying tribute to her mother, Pastor (Mrs) Gladys Ohenzuwa who is the second child and first daughter of Dcns.\nDcns Eguaveon no doubt has the rare crown of a fufilled motherhood whose children are proud of."
  },
  {
    "headline": "Obaseki hails citizens’ support for improved security in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…charges elites on selflessness, community devtBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commended citizens of the state for their sustained collaboration and support for the state government’s efforts at ensuring improved security.\nObaseki, who noted that his administration has institutionalised intelligence-driven community policing architecture, said the support of residents has contributed to the success recorded in ridding the state of crime and criminals.\nThe foundation was set up by a former Inspector General of Police (IGP), Solomon Arase, who celebrated his 66th birthday.\nCommending the philanthropic gesture of former Inspector General of Police, Arase, the governor said, “We thank you for your support and leadership.\nI am glad you are now in the vanguard of pushing for citizens’ policing in the country,” he added."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Successful deployment of 5G services will depend on stakeholders collaboration, says Danbatta",
    "summarized_story": "The Executive Vice Chairman (EVC) of the Nigerian Communications Commission (NCC), Prof. Umar Garba Danbatta, has said that industry collaboration is essential to the successful deployment of 5G services in Nigeria.\nThe NCC boss said the policy framework for the deployment has come into place and will facilitate deployment of services by the recent winners of the 3.5GHz spectrum auction, MTN Nigeria Communications Ltd and MAFAB Communications Ltd.\nHe said the Commission has set out the regulatory instruments needed for fast deployment of the new versatile technology for the benefit of the consumers and the stakeholders.\nProf. Danbatta said the issues that should militate against or slow down the deployment of 5G technology are themselves opportunities that can potentially create new revenue streams or new subsectors in the industry.\n“We must conclude this Telecom Consumer Parliament with solutions to challenges that are associated with 5G deployment in countries that had deployed the services ahead of Nigeria."
  },
  {
    "headline": "Reuben Muoka replaces Ikechukwu Adinde as NCC’s director of public affairs",
    "summarized_story": "Reuben Muoka, an innovative journalist and consummate public relations practitioner has been appointed as Nigerian Communication Commission (NCC)’s new director of public affairs (DPA).\nMuoka takes over from Dr. Ikechukwu Adinde, who has assumed duties as the Director of Special Duties Department of the Commission.\nHe later rose from the rank of Principal Manager to the position of an Assistant Director in 2010, and by 2015, as a Deputy Director, appointed to head the re-engineered Public Relations Unit of PAD.\nIn 2017, he was redeployed to the Policy, Competition and Economic Analysis Department to head the Economic Analysis unit of department.\ndegree in Mass Communication from the University of Lagos, specialising in Public Relations and Advertising, where he had earlier successfully completed a Postgraduate Diploma (PGD) in the same field of Mass Communication."
  },
  {
    "headline": "Why Ekweremadu, wife needed child’s kidney",
    "summarized_story": "More details have emerged about the arrest earlier today of a former Deputy Senate President of Nigeria, Ike Ekweremadu and his wife, Beatrice by the Metropolitan Police over a plot to harvest the kidney of a 15-year-old boy.\nEkweremadu, 60, is said to have had £20,000 on him at the time of his arrest, according to prosecutors.\nEkweremadu and accountant wife Beatrice, 55, are charged with conspiracy to arrange or facilitate travel of another person with a view to exploitation, namely organ harvesting.\nMr Ekweremadu was held with Nwanneka Ekweremadu in Britain this month.\nHis wife, five years his junior, is an academic and doctor and also a major public figure in Nigeria."
  },
  {
    "headline": "Twitter’s board urges shareholders to approve Musk’s takeover bid",
    "summarized_story": "The board of directors Twitter on Tuesday again advised shareholders to approve Tesla CEO Elon Musk’s $44 billion bid to purchase the social media giant.\nThe board “unanimously recommends that you vote [for] the adoption of the merger agreement,” it urged in a new SEC filing.\nTwitter’s board previously recommended in May that shareholders vote to approve the acquisition.\nBut amid the ongoing drama over Musk’s attempts to pause the deal, Twitter executives instead dodged questions about the agreement.\nMusk on Tuesday added that his debt financing still needs to come together and shareholders also need to vote to approve the deal for his bid to go through."
  },
  {
    "headline": "Nigerians needed as Canada seeks to fill 1m job vacancies",
    "summarized_story": "BY EMEKA EJEREA record high labour shortage in Canada has prompted more than one million job vacancies currently, latest report by Statistics Canada has shown.\nAccording to Statistics Canada data, the number of job vacancies increased 2.7 per cent from the previous peak in the fourth quarter as the pool of unemployed workers shrunk to half the level in the first quarter of 2021.\nHelper and labourer job vacancies soared 97 per cent and vacant carpenter positions were up 149.1 per cent compared to the first quarter of 2020.\nJob vacancies were little changed in other provinces.\nStatistics Canada will release its latest reading on inflation Wednesday."
  },
  {
    "headline": "Kidnappers Contact Abducted Ekiti Retiree’s Family, Demand N40m Ransom",
    "summarized_story": "The abductors of a retiree, Mr. Israel Bamisaye, on Thursday, contacted his family and demanded N40million ransom to set him free.\nThe gunmen had on Wednesday kidnapped the retired Chief Pharmacist with the Ekiti Ministry of Health on his farm in Orin Ekiti.\nThe incident occurred along his farm located between Ero Dam and the Ekiti State Farm Settlement located at Orin Ekiti, in Ido-Osi local government area of the state.\nA source close to the victim’s family confided in journalists in Ado Ekiti that the gunmen contacted his relatives on Thursday morning, demanding for the ransom before they could release him.\n“Everyone is confused in the community at the moment because of the activities of the gunmen in the farm settlement."
  },
  {
    "headline": "Kidnappers Contact Abducted Ekiti Retiree’s Family, Demand N40m Ransom",
    "summarized_story": "The abductors of a retiree, Mr. Israel Bamisaye, on Thursday, contacted his family and demanded N40million ransom to set him free.\nThe gunmen had on Wednesday kidnapped the retired Chief Pharmacist with the Ekiti Ministry of Health on his farm in Orin Ekiti.\nThe incident occurred along his farm located between Ero Dam and the Ekiti State Farm Settlement located at Orin Ekiti, in Ido-Osi local government area of the state.\nA source close to the victim’s family confided in journalists in Ado Ekiti that the gunmen contacted his relatives on Thursday morning, demanding for the ransom before they could release him.\n“Everyone is confused in the community at the moment because of the activities of the gunmen in the farm settlement."
  },
  {
    "headline": "Army Tried 227 Personnel In 7 Months, Begins Trial Of 29 Others",
    "summarized_story": "The Theatre Commander made the disclosure on Thursday while inaugurating a special court-martial for the trial of another set of 29 officers and soldiers for crimes of various categories.\nMaj. Gen Musa added that 14 other cases were struck out while 107 other soldiers were recommended for summary trial.\nHe further said that the 29 officers and soldiers whose trial had just started were outstanding cases from the previous trials.\nGen. Musa said, “You will recall that three Court Martials were inaugurated on 9 October 2021 and the courts disposed about 227 cases.\nOut of which, 107 cases were recommended for summary trial while 120 cases have been concluded."
  },
  {
    "headline": "Army Tried 227 Personnel In 7 Months, Begins Trial Of 29 Others",
    "summarized_story": "The Theatre Commander made the disclosure on Thursday while inaugurating a special court-martial for the trial of another set of 29 officers and soldiers for crimes of various categories.\nMaj. Gen Musa added that 14 other cases were struck out while 107 other soldiers were recommended for summary trial.\nHe further said that the 29 officers and soldiers whose trial had just started were outstanding cases from the previous trials.\nGen. Musa said, “You will recall that three Court Martials were inaugurated on 9 October 2021 and the courts disposed about 227 cases.\nOut of which, 107 cases were recommended for summary trial while 120 cases have been concluded."
  },
  {
    "headline": "Again, Police Kill Terrorist, Recover AK49 Rifle, Motorcycle In Kaduna",
    "summarized_story": "The Kaduna State Police Command, on Thursday, said its operatives killed one terrorist and recovered weapons in Giwa local government area of the State.\nThe weapons recovered include an AK49 assault rifle, locally fabricated long range revolver with its 12 polymer cased cartridges and one operational motorcycle.\nEqually, a locally fabricated long range revolver with its 12 polymer cased cartridges was recovered when search of the area was conducted.\n“The Commissioner of police Kaduna Command applauded the character and commitment of the Officers aimed at the safety and security of the State.\nHe further tasked them to sustain the recent gains since victory is near where criminality will be a thing of the past.”"
  },
  {
    "headline": "Twist in Ekweremadu's UK case: Visa letter for organ donor emerges",
    "summarized_story": "A letter by Senator Ike Ekweremadu requesting British visa for a 15 year-old organ donor for his daughter, has emerged.\nThe letter written 28 December 2021 expressly stated that the boy will be donating kidney to his daughter Sonia.\n“David and Sonia will be at the Royal Free Hospital London and I will be providing the necessary funding”, the letter read.\nIdentity of Ekweremadu’s kidney donor revealed in visa letterSince the boy was admitted to the UK on the strength of the letter, it was clear the British High Commission was complicit in the whole matter.\nThey were on their way to Turkey and no longer the Royal Free Hospital London."
  },
  {
    "headline": "FCTA seals off Zodara Bar over violation of land use",
    "summarized_story": "By Salisu Sani-IdrisThe Federal Capital Territory Administration (FCTA), on Thursday sealed off a popular pub and event centre, Zodara Bar, on No.\nThe News Agency of Nigeria (NAN) reports that the operation was carried out by the FCTA Multi Departmental Operations, headed by the Abuja Metropolitan Management Council (AMMC).\n” First and foremost, the property that is in use now is constituting general environmental nuisance to the whole of the neighborhood.\nThe whole of the area is disturbed by the activities going on in this building.\nNAN reports that the illegal activities going on at the property include a restaurant, barbing saloon, club house, which is a violation of the original allocation of the plot meant for residential purpose."
  },
  {
    "headline": "Gov. Abiodun lied on defection of 5000 Ogun PDP members",
    "summarized_story": "According to him, the Governor and his supporters only made the assertion in their dreams.\nHe argued that the outrageous figures of defectors surpassed the actual number of party members in the wards of the local government, thus putting a lie to the claims by Abiodun and his handlers.\n“How could any rational person claim that 5,000 people decamped from just three wards in Iperu?\nWhat is the total number of all registered members of the party in the three wards?” Sodipo queried.\nHe added: “It is unfortunate that this is the kind of leadership that runs the affairs of a great state like Ogun."
  },
  {
    "headline": "Protesting Rivers Neighborhood corps members allege 15",
    "summarized_story": "By Okafor Ofiebor/Port HarcourtMembers of the Rivers Neighborhood Safety Corps, popularly called “Governor Wike Police” yesterday occupied the gate of the of Government House in Port Harcourt to protest the non-payment of their 15 months’ salary.\nScores of members of the Corps, who were fully kitted in their in official uniforms sang solidarity songs.\nDirector of Operations of the Corps, Matthew Iheanyi, during the protest, spoke of how members have been helping the Police.\nThey also said they provide credible information to security agencies in the various local government Council areas where they are deployed.\nIn reaction, Director-General of the Rivers State Neighborhood Safety Corps, retired Assistant Commissioner Police ACP, Dr. Uche Chukwuma, assured that a memo concerning payment of salary and the outstanding salary arrears has been sent to the state government and it is receiving the needed attention."
  },
  {
    "headline": "IPOB: Why Nnamdi Kanu Is Yet To Be Granted Bail — Buhari",
    "summarized_story": "PRESIDENT Muhammadu Buhari, has told the British Prime Minister, Boris Johnson that there have been apprehension in admitting on bail detained leader of the proscribed Indigenous people of Biafra, IPOB, Mazi Nnamdi Kanu because he jumped jumped bail the previous time he was granted bail.\nPresident Buhari stated this on Thursday, when he held a bilateral meeting with Prime Minister of Great Britain on the margins of the 26th Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda.\nThe President at the meeting reiterated his resolve to respect the maximum term limit in the Nigerian Constitution.\nThe PM, obviously not quite familiar with the maximum two terms limit, had asked if President Buhari would run for office again.\nIt’s a massive partnership for us, and we need to capitalize on it.”The Prime Minister offered condolences on some recent attacks in Nigeria, particularly on churches."
  },
  {
    "headline": "BREAKING: Osun declares Friday, July 24 work-free for PVC collection",
    "summarized_story": "Three weeks to the gubernatorial election in Osun, the state government has declared Friday, June 24, a work-free day to enable civil servants who are yet to collect their Permanent Voter Cards do so.\nThe government said in a statement on Thursday, that the development was to enable all public and civil servants pick their PVC to be able to perform their franchise in the July 16 governorship poll.\nThis was disclosed in a statement signed by the Secretary to the State Government, Prince Wole Oyebamiji.\nThe statement read in part: “The Government of Osun State acknowledges the importance of workers in the democratic process, and is aware that the only way workers can give life to their aspiration for a worker-friendly government is through their votes.\n“The government does not want anyone to miss out on the opportunity to exercise their constitutional right, especially as it affects their overall wellbeing and the security of their future, ” the statement read."
  },
  {
    "headline": "Yoruba actor, Baba Atoli is dead",
    "summarized_story": "Yoruba actor, Olaniyi Raji, also known as Baba Atoli, is dead.\nThe death of the veteran actor was announced by his colleague, Foluke Daramola in a post on Instagram on Thursday.\nDaramola shared the deceased photo with the caption: “Sad we lost Baba Atoli.\nSuch a shame.”Friends and family of Baba Atoli also took to social media to mourn him.\nBefore his death, Baba Atoli begged for financial support following an illness."
  },
  {
    "headline": "BREAKING: UK police charge two Nigerians for alleged organ harvesting plan",
    "summarized_story": "The United Kingdom Metropolitan Police have formally charged two Nigerians with conspiracy to facilitate travel of another person for organ harvesting.\nThe suspects were arrested and charged over their plan to bring a child into the country to allegedly harvest the said child’s organs.\nThe two arrested suspects were identified as Beatrice Nwanneka Ekweremadu, 55, and Ike Ekweremadu, 60, from Nigeria.\nThey are charged with conspiracy to harvest organs, according to The Guardian UK.\nAccording to The Guardian report, the charges involve arranging or facilitating travel of another person with a view to exploitation, namely organ harvesting, the Met said in a statement."
  },
  {
    "headline": "Osun July 16 governorship election: Sanwo-Olu, Ganduje, Akpabio, Amaechi, Saraki make 86-man campaign team",
    "summarized_story": "The election, slated for July 16th, will be coming up about a month after the APC coasted home to victory in Ekiti governorship election.\nThe 86-member campaign council is headed by Lagos state Governor Babajide Sanwo-Olu and co-chaired by Kano state Governor Abdullahi Umar Ganduje.\n“There’s no option to winning the national election and these state elections are like I said, forebears to the national election.\nWe agreed that all stakeholders in Osun state will come together and constitute into one single force in order to win this important election.\n“I am happy the secretary of our great party is from Osun state and I think he is very useful to this election in Osun state."
  },
  {
    "headline": "Pictures: Amotekun parade suspects linked to Owo church massacre",
    "summarized_story": "The Ondo state command of the Southwest security network, code-named Amotekun, says it has arrested some suspects linked to the attack on St Francis Catholic Church, Owo.\nGunmen had on June 5, 2022 attacked the church in Owo and murdered over 40 worshippers.\nOwo is the home town of the sitting governor of Ondo state, Arakunrin Rotimi Akeredolu.\nShare this: TwitterFacebook"
  },
  {
    "headline": "FirstBank: Developing different packages to support mortgage financing",
    "summarized_story": "First Bank of Nigeria Limited has developed two different packages to support the growth of mortgage subsector in the country.\nThe bank offered two different packages namely commercial mortgage and joint mortgage.\nThe interest rate for commercial mortgage loans is set daily and is available from your FirstBank loan officer.\nFirstBank offers up to 90 per cent Loan-to-Value financing for certain owner-occupied commercial mortgage loans.\nFirst Bank commercial mortgage loan is convenient means to finance working capital needs."
  },
  {
    "headline": "Access Bank to reward customers in South-South, South-East",
    "summarized_story": "Kehinde Ibrahim, LagosACCESS Bank Plc has said it would be rewarding its customers in the South-South and South-East regions with millions of naira and other attractive consolation prizes in its DiamondXtra regional draw.\nSpeaking to newsmen at the bank’s head office in Lagos recently, Group Head, Consumer Banking, Access Bank Plc, Adaeze Ume, explained that the motivation behind the regional draws in the new season of the reward scheme is the need to transform the lives of more Nigerians across the country.\nIn her words, “To deliver on our promise to continually reward our customers for their loyalty and continued savings with our bank, we have decided to take the DiamondXtra reward scheme draws even closer to them.\nWe intend to reward 38 lucky customers in the South-South, South- East region with juicy cash and consolation prizes in the LIVE draw taking place on the 29th of June 2022 in Owerri, Imo State.\n“We continue to evolve and reflect on the various offers within the DiamondXtra reward programme, and engage our customers on what they would prefer to have as a reward."
  },
  {
    "headline": "CFI, others win prizes at NCRIB maiden tennis competition",
    "summarized_story": "Kehinde Ibrahim, LagosTHE Commissioner for Insurance and Chief Executive Officer of the National Insurance Commission (NAICOM) Mr. Olorundare Sunday Thomas has been declared overall winner of the Nigerian Council of Registered Insurance Brokers (NCRIB) maiden tennis competition in Veteran categoryThe Competition held at the weekend at Lagos Lawn Tennis Club, Lagos.\nThe two days competition which was well attended by members of the Lagos Lawn Tennis Club, students of both Secondary and tertiary institutions and insurance industry became a platform for stakeholders to drum the beats of insurance importance to sport lovers.\nOur intention is to indirectly enforce, not only the government’s highlighted insurance policies, but all insurance products without compulsion.\nYou will recall that few days ago, we embarked on Insurance Awareness Walk from Moleye to Adekunle end of Lagos Third Mainland Bridge, where we shared flyers that narrate what insurance stands for.\nBefore the end of the year, we have plan to take the awareness walk campaign to market places, government circles."
  },
  {
    "headline": "PenCom kicks off online verification for MDAs’ retirees",
    "summarized_story": "Kehinde Ibrahim, LagosTHE National Pension Commission (PenCom) has started its online verification and enrolment for prospective retirees and retirees of Federal Government Treasury Funded Ministries, Departments and Agencies (MDAs), the Director-General, Mrs. Aisha Dahir-Umar has said.\nAnnouncing this, Mrs. Dahir-Umar, called on prospective retirees to ensure that they undergo the compulsory Data Recapture Exercise (DRE).\nShe stated that the exercise was aimed at validating the accrued pension liabilities of government for the retirees.\nShe said: “The accrued right is a component of the Retirement Savings Account (RSA) of the employee to be accessed upon retirement.\nHowever, following the experience of the COVID-19 pandemic in 2020, which restricted the movement of persons, PenCom designed and developed an online Enrolment Application with the capabilities to register, verify and enrol the prospective retirees."
  },
  {
    "headline": "NCDMB to set minimum benchmark for women in oil, gas sector",
    "summarized_story": "…to begin disbursement of $40m Women FundPalma IleyeNigerian Content Development and Monitoring Board, NCDMB, has announced plans to set a minimum percentage of females that must be included in any Human Capacity Development, HCD, programme or initiative that it will approve for the Nigerian Oil and Gas Industry.\nSimbi Kesiye Wabote, stated this at the 2nd Nigerian Women in Oil and Gas Conference.\nHe noted that women make up 48 percent of the global labour force, but they only account for 22 percent of the labour force in the oil and gas sector.\nThe Minister harped on the need to be deliberate in getting more girls into Science Technology Engineering and Mathematics, STEM, which was a pathway to careers in the oil and gas industry.\nHe also advised women in the Nigerian Oil and Gas industry to work together towards increasing participation of fellow women in the industry by engendering growth, building capacities and capabilities, identifying opportunities, mentoring and coaching."
  },
  {
    "headline": "Buhari: directed action to bring back kidnapped railway passengers home alive",
    "summarized_story": "Naomi DouglasPresident Muhammadu Buhari has directed increased efforts through kinetic and non-kinetic means to bring the case of the kidnapped railway passengers in Kaduna State to a closure.\nThe Senior Special Assistant to the President on Media and Publicity, Malam Garba Shehu, announced the president’s directive yesterday in a statement titled “President Buhari Directs Urgency in Dealing with Kidnapped Railway Passengers’ Case”.\nPassengers were abducted when bandits attacked a train plying Abuja-Kaduna route on March 28, 2022.\nShehu said upon the President’s approval, the government had continued on the two-lane approach, kinetic and non-kinetic, to secure the passengers’ safe release.\n“The setback notwithstanding, the Government is not leaving any stone unturned in the efforts to bring all of the hostages back."
  },
  {
    "headline": "Alleged Organ Trafficking: Trial Of Ekweremadu, Wife Adjourned Till July 7",
    "summarized_story": "﻿The trial of former Deputy Senate President, Ike Ekweremadu and his wife, Beatrice Ekweremadu has been adjourned to July 7.\nThe London Metropolitan Police earlier on Thursday said it had arrested and charged the duo for conspiring to bring a child to the UK for organ harvesting.\nAt the Uxbridge Magistrates’ Court, they pleaded not guilty to the charges, according to a Daily Mail report.\nThe source said a donor was gotten and sent to the UK for investigation with the aim of providing a kidney.\nHowever, according to the source, the donor refused to return to Nigeria and instead reported to the UK police to seek asylum."
  },
  {
    "headline": "2023: Person Who Tried Seeking Third Term Didn’t End Well, Buhari Tells UK Prime Minister",
    "summarized_story": "President Muhammadu Buhari on Thursday reiterated his resolve to respect the maximum term limit in the Nigerian Constitution, saying that the person that tried seeking a third term in office did not end well.\nIn a bilateral meeting with British Prime Minister, Boris Johnson, on the margins of the 26th Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda, Buhari was asked if he will seek another term in obvious.\nREAD ALSO: UK Police Arrest Ike Ekweremadu, Wife For Organ Harvesting“Another term for me?\nThe first person who tried it didn’t end very well,” a statement by presidential spokesman, Femi Adesina, said.\nThe Commander-in-Chief also reacted to the travails of the leader of the proscribed Indigenous Peoples of Biafra (IPOB), Nnamdi Kanu."
  },
  {
    "headline": "FG Reverses Ban On International Basketball",
    "summarized_story": "The Federal Government has rescinded its decision to suspend Nigeria’s basketball teams from all international competitions.\nThe Permanent Secretary Ministry of Youth and Sports Development Ismaila Abubakar disclosed this at a news conference in Abuja on Thursday.\nHe said the latest decision is based on a letter of appeal from the Nigeria Basketball Federation (NBBF), signed by Mister Musa Kida.\n“In securing this approval, of note is the caution that the laws of Nigeria cannot be subjugated to any other law, and every Nigerian entity must respect Nigerian laws and authority governing various sectors.\nBefore the reversal of the ban, FIBA had replaced the D’Tigress with Mali ahead of the FIBA Women’s World Cup to be held later in the year."
  },
  {
    "headline": "Amotekun Corps Arrest Persons In Connection With Owo Church Attack",
    "summarized_story": "The Amotekun Corps in Ondo State have arrested a number of persons in connection with the massacre of worshippers at St. Francis Catholic Church, Owo, Ondo State.\nAdeleye, however, did not give the actual figure of the suspects arrested, but the corps leader was optimistic that everyone who was involved in the Owo Attack would be brought to book.\nWhen contacted for confirmations, the Ondo State Police Command through its spokesperson, SP Funmilayo Odunlami, said the force is not aware of such and arrest.\nNevertheless, it is expected that the Amotekun Corps would hand the suspects over to the police for further investigations and onward prosecution.\nLet us show them that Nigerians will continue to cherish what we share while respecting each other’s differences."
  },
  {
    "headline": "EU Grants Candidate Status To Ukraine As US Ships Weapons",
    "summarized_story": "European Union leaders granted candidate status Thursday to Ukraine and Moldova in a strong show of support against Russia’s invasion, as the United States said it was sending Kyiv more high-precision rocket systems.\n“Ukraine’s future is within the EU,” said Zelensky, who had been working the phones for weeks.\nEuropean powers before the invasion had distanced themselves from US support for Ukraine’s NATO aspirations and EU membership is at least years away.\nUkraine acknowledged Thursday that it had lost control of two areas from where it was defending the cities, with Russian forces now closer to encircling the industrial hubs.\nIn the central city of Zaporizhzhia, women were training to use Kalashnikov assault rifles in urban combat as Russian forces edged nearer."
  },
  {
    "headline": "APC inaugurates Sanwo-Olu-led Osun Governorship Campaign Council -",
    "summarized_story": "The All Progressives Congress on Thursday inaugurated the Governor Babajide Sanwo-Olu-led Osun Campaign Committee with a charge to use whatever it takes within the ambit of the law to win the poll.\nNational Chairman of the party, Abdullahi Adamu, gave the mandate at the inauguration of an 86-member campaign council for Osun governorship election.\nChairman of the council, Babajide Sanwo-Olu, is to be assisted by Governor Abdullahi Ganduje of Kano, while Kebbi State Governor, Senator Abubakar Bagudu; Chairman of the Southwest Governors’ Forum and Governor of Ondo State, Arakunrin Oluwarotimi Akeredolu; Governor of Borno State, Babagana Zulum’ Governor Nasir El-Rufai of Kaduna State and 15 others were appointed as vice-chairmen.\nOther members of the council include: Former Minister of Transportation, Rotimi Amaechi; Minister of Communications and Digital Economy, Dr. Isa Ali Pantami; former Minister of State for Education, Emeka Nwajiuba; former Chief of Army Staff and Nigeria’s Ambassador to the Republic of Benin, General Tukur Buratai and former Attorney General of the Federation and Minister of Justice, Abubakar Malami."
  },
  {
    "headline": "Osun declares Friday Public holiday for PVC collection",
    "summarized_story": "Osun state government has declared Friday, 24th June, as Public holiday for all civil servants in the state to enable them collect Permanent Voter cards ahead of the July 16th governorship election.\nThe Independent National Electoral Commission has set a deadline for the collection of the Permanent Voter Cards in the state ahead of the July 16 governorship election.\nMore than ten political parties are expected to participate in the election predicted by political pundits to be a keenly contested poll between the governing All Progressives Congress Congress and the main opposition, People’s Democratic Party.\nIt is equally expected to be a repeat of the 2018 elections that saw the election running into the runoff after the first ballot failed to produce a clear winner.\nThe two leading candidates, Adegboyega Oyetola (APC) and the People’s Democratic Party, Ademola Adeleke were the two leading candidates in the 2018 election that eventially produced the incumbent (Oyetola) as winner."
  },
  {
    "headline": "Benue Youth Alliance urges APC Guber aspirants to resolve differences -",
    "summarized_story": "Benue Youth Alliances have called on all the Gubernatorial aspirants of the All Progressives Congress to resolve their differences and provide a consensus candidate.\nThey made the call after a rally on major roads in the state capital of Benue, Makurdi.\nThis rally is coming up weeks after the State chapter of the All Progressives Congress party produced Reverend father Hyacinth Alia as the winner of the gubernatorial primary re-election.\nMeanwhile, Some gubernatorial aspirants rejects the party’s re-election result, leading to the uncertainty of people understanding the party’s current conclusion.\nThe Benue Youth Alliances led by Owoicho Onyilo calls on the state party to assist gubernatorial candidates settle with one accepted candidate, as the delay may lead to breakouts."
  },
  {
    "headline": "2023: Get PVCs, ensure your votes count, scholars advise Nigerians -",
    "summarized_story": "The Abeokuta branch of the National Association of Seadogs has urged Nigerians to obtain their Permanent Voter Cards and ensure they troop out on election days to vote and monitor the ballots to prevent cultists and political thugs from hijacking ballot boxes from polling units.\nThe Acting President of the branch, Adeyemi Omitogun, gave this advice during the organisation’s Public Lecture on “Gangsterism, Hooliganism & Cultism in Nigeria : Role of the Family,” held at Gbonogun, Abeokuta.\nHe also admonished citizens to bury the idea of “votes don’t count,” which, according to him, will only embolden bad politicians to continue to manipulate electoral process.\nHe listed hooliganism, gangsterism, bad economy and poor parenting as part of reasons why cultism is increasing among youths in the country.\nHe pointed out economic sustainability and family role as major factors that could reduce the ills of cultism and gangsterism in the society, noting that parents are expected to inculcate morals in their children."
  },
  {
    "headline": "Nothing Good to Say About Rwanda – Bolaji Akinyemi – Arise News",
    "summarized_story": "Former Minister of Foreign Affairs, on Rwanda playing host to the 2022 Commonwealth Heads of Government Meeting despite surmounting concerns on human rights violations, emphasizing Rwanda is a misrepresentation of the concept of a commonwealth nation."
  },
  {
    "headline": "FIFA Clears 26-Man Squads for 2022 World Cup",
    "summarized_story": "FIFA has approved bigger 26-man squads for the World Cup in Qatar, deciding Thursday to extend football’s relaxation of rules that help coaches and players during the COVID-19 pandemic.\nAdding three players to the typical World Cup roster follows UEFA doing the same for the European Championship last year.\nWorld Cup teams can also now use five substitutes in the regulation 90 minutes instead of three.\nFIFA president Gianni Infantino is seeking a new four-year term to extend his leadership of football’s world body to 11 years.\nThat will fall in mid-November, days before the World Cup starts."
  },
  {
    "headline": "US Supreme Court Expands Gun Rights, Strikes Down New York Law",
    "summarized_story": "The 6-3 ruling, with the court’s conservative justices in the majority and liberal justices in dissent, struck down New York state’s limits on carrying concealed handguns outside the home.\nGun rights, held dear by many Americans and promised by the country’s 18th century founders, are a contentious issue in a nation with high levels of firearms violence including numerous mass shootings.\nThe justices overturned a lower court ruling throwing out a challenge to the law by two gun owners and the New York affiliate of the National Rifle Association (NRA), an influential gun rights group closely aligned with Republicans.\nThe decision represents the court’s most important statement on gun rights in more than a decade.\nThe ruling said that New York’s concealed firearm regime is at odds with the text and history of the Second Amendment and how gun rights were protected throughout U.S. history."
  },
  {
    "headline": "Ekweremadu Says Peter Obi Will Lose Election – Trending With Ojy Okpe – Arise News",
    "summarized_story": "Former Deputy Senate President, Ike Ekweremadu said that people from the South-East region of Nigeria will not vote for Labour Party presidential candidate Peter Obi but for Atiku Abubakar of the the People’s Democratic Party.\nWhile speaking to Journalists, The lawmaker from Enugu state acknowledged that Peter Obi is a credible candidate but that the South-East needs to be dynamic and should not waste their votes on Peter Obi because he can’t win the presidential election.\nIn another development, Hauwa Joseph and Mary Dauda two missing Chibok girls have recounted how they escaped from captivity, after being rescued by Troops of the Nigerian Army.\nSix students of Government Day Secondary School in Jalingo, Taraba state have been summarily expelled following a protest staged by students against the schools management over alleged corruption.\nThe protest was staged in front of the principals office and was said to have taken place last week Wednesday."
  },
  {
    "headline": "Nigerian Senator Ekweremadu, Wife Denied Bail in UK Over Organ Harvesting",
    "summarized_story": "Former deputy senate president of Nigeria, Ike Ekweremadu and his wife Beatrice, have been arrested and charged for bringing a child to the UK for organ harvesting.\nThe pair were charged to court on Thursday following an investigation by the police force’s specialist crime team.\n“Beatrice Nwanneka Ekweremadu, 55 (10.9.66) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting,” the statement reads.\n“Ike Ekweremadu, 60 (12.05.62) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting.\nThe senator and his wife have been denied bail and the case adjourned till July 7th."
  }
]