[
  {
    "headline": "Gunmen kidnap seven monarchs, families, kill two after DSS advisory",
    "summarized_story": "NO fewer than seven traditional rulers and their family members have been abducted in the past two weeks, Sunday PUNCH findings have revealed.\nWhile some were abducted and forced to part with huge ransoms to regain their freedom, others were killed by the criminals.\nThe DSS had on December 15 issued an advisory that Very Important Persons, especially lawmakers and holidaying workers, were prone to attacks during this period.\nIn Eha-Amufu in the Isi-Uzo Local Government Area of Enugu State, suspected herdsmen reportedly kidnapped seven holidaying workers on December 29.\n“And Lai Mohammed (Minister of Information and Culture) said the Buhari regime has recorded significant progress in the area of security."
  },
  {
    "headline": "NDLEA confiscates N120bn cash, assets from 11,341 traffickers, barons",
    "summarized_story": "THE National Drug Law Enforcement Agency confiscated cash, assets and drugs valued at N120bn from 11,341 traffickers and drug barons in 2021.\nThe agency also successfully prosecuted and jailed 1,111 out of the 11,341 traffickers arrested between January and November, 2021.\nHe stated, “Between January and November 2021, over 11,341 drug traffickers were arrested; 1,111 jailed and 7,066 drug users counselled and rehabilitated while a total of six drug barons were arrested with over N120bn in cash, assets and drugs seized from offenders within the same period.\nMeanwhile, the agency has observed that patients could not access controlled drugs such as opioid medication.\nIt sought improved access and appropriate use of controlled medicines in the country."
  },
  {
    "headline": "2022: expect more robust representation, actualization of bills others, Ereyitomi assures Constituents",
    "summarized_story": "EreyitomiAs the world crossed over into the year 2022, the Member Federal House of Representatives, representing Warri Federal Constituency, Hon.\nThomas Ereyitomi has promised to give more robust and quality representation as well attract what’s due to Warri federal constituency to it.\nEreyitomi gave the assurance in his year 2022 new year message to Warri federal constituency Saturday, January 1, 2022 in Warri as part of activities to kick start the year, Chief Ereyitomi reiterated his determination to continue delivering dividend of democracy to the three Warri LGAs for the betterment of the federal constituency.\nREAD ALSO:5 dead as gunmen invade Delta motor park, engage police in gun battleWhile acknowledging the support of the people of the federal constituency, Hon.\nEreyitomi assures of actualization of bills presented in their various stages into becoming law and assented to by Mr. President, he noted that more Bills, motions to give Warri South, Warri North and Warri South-West LGAs improve development and upliftment will be adequately sponsored and moved at the Green Chamber."
  },
  {
    "headline": "2022 shall be better for Akwa Ibom, Gov Emmanuel prays",
    "summarized_story": "Akwa Ibom Governor, Udom EmmanuelBy Chioma Onuegbu – UyoAkwa Ibom State Governor, Mr Udom Emmanuel, has urged Akwa Ibom people to remain hopeful and prayed that 2022 shall be a better year for the state and the country in general.\nEmmanuel who made the prayer on Saturday, during a New Year worship Service at Church of Nigeria, Anglican Communion Diocese of Uyo, expressed the optimism that the state and country would evade the challenges faced in the year 2021.\n“But this year shall be a year of that performance of what God has told me including my successor.\nIn his homily, the Bishop, Church of Nigeria Anglican Communion, Uyo Diocese, Rev.\nWhen you obey God you will prosper, through the dark tunnel of obedience, the light shall shine."
  },
  {
    "headline": "Boko Haram: Schools, market at Damasak in Borno reopened after 7 years as Army hosts WASA",
    "summarized_story": "The WASA is a Nigerian Army tradition, held annually and aimed at showcasing the rich cultural heritage of the tribes from different parts of the country where the personnel of the Nigerian Army come from.\nRecall that Damasak town was two weeks ago enveloped with jubilation when the Nigerian Army re-opened the major/international market that provides sources of living for thousands of the residents of the area who are mostly into farming and trading.\n“Additionally all NGOs and businesses that were closed have now reopened with new ones coming on board”, he said.\nReiterating that the Brigade has a lot to be grateful to God for, the Commander said the 5 Brigade Nigerian Army is holding the WASA in Damask following the restoration of normalcy to the area.\nThe WASA ended with the lightning of the Campfire by the Brigade Commander."
  },
  {
    "headline": "New Year: Only peace, unity can bring progress to Nigeria ― Gbajabiamila",
    "summarized_story": "GbajabiamilaBy Onozure DaniaSpeaker of the House of Representatives, Mr Femi Gbajabiamila, on Saturday, urged Nigerians to ensure the unity of Nigeria saying only peace and unity can bring progress and development to the country.\n“My message is very clear to Nigerians, peace and unity can only bring one thing and it is progress, no progress without unity.\n“Education must always take its rightful place in every developed society, education remains the bedrock of every society, the society cannot move forward without education.\n“My message is very clear to Nigerians, peace and unity can only bring one thing and it is progress, no progress without unity.\n“Education must always take its rightful place in every developed society, education remains the bedrock of every society, the society cannot move forward without education."
  },
  {
    "headline": "New Year Message: Again Uzodimma blames opposition for insecurity in Imo",
    "summarized_story": "Imo state governor, Hope UzodinmaBy Chinonso Alozie – OwerriThe Imo state governor, Hope Uzodimma, has continued to blame the opposition for being behind the insecurity experienced in the state.\nHe stated this in his New year message to the people of the state, on Saturday in Owerri.\nThe governor in his message, “Advocated for a renewed and collective effort by the people of Imo state to stamp out violence and other forms of criminality in the state this year.\nMy government will work in concert with the security agencies to ensure a safer Imo state in 2022 and beyond.\n“They should resolve this year to engage only in actions that would enhance the peace and stability of both Imo state and Nigeria."
  },
  {
    "headline": "New Year message: Nigeria, Ondo will surmount present challenges – Akeredolu",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu has assured the people of the state and Nigeria that the challenges in the state and in the country will be surmounted.\nWe will surely surmount these challenges.\nOur faith in one indivisible Nigeria must not be threatened by the actions of some marauders whose main purpose is to cause rift and rancor amongst us.\n“We must be unwavering, and deliberate in our quest to come together and salvage what belongs to us all.\nI assure you, with your support and prayer, I am positive that Nigeria will surmount the present challenges.”Akeredolu added that his administration will continue to stand by the side of the people and defend their rights and interests."
  },
  {
    "headline": "With right leaders in 2023, Nigeria will rise again – Mimiko",
    "summarized_story": "Former Governor of Ondo State, Olusegun Mimiko has stated that Nigeria will overcome the series of challenges it is currently going through.\nThe ex-governor and a leader of the Peoples Democratic Party, PDP, who expressed optimism on the potential greatness of the country, said the feat will be achieved with the right leaders come 2023.\nMimiko, in his new year message, issued by his Special Assistant on Media and Digital Communications, John Paul Akinduro 2021 was no doubt a turbulent one for Nigerians.\nIn the message, he called on Nigerians to do the needful come 2023 by choosing the right leaders at the polls.\nHe admonished the National Assembly and President Muhammadu Buhari to do the needful in ensuring that the amended electoral act becomes a reality."
  },
  {
    "headline": "Gov Wike bans nightclubs, prostitution in Port Harcourt",
    "summarized_story": "Rivers State Governor, Nyesom Wike has banned Nightclubs and prostitution in the state.\nWike gave the order in his New Yesr broadcast in Port Harcourt on Saturday, Wike banned nightclub activities including nighttime trading and street prostitution especially along Abacha road and surrounding streets particularly in the Casablanca area.\nWike further directed security agencies in the State to arrest and prosecute anyone attempting to violate the ban.\nHe said a taskforce would be set up to this effect.\nThe Governor Wike-led administration will come to an end after the general elections in 2023."
  },
  {
    "headline": "MFM’s Olukoya releases 2022 prophecies on sudden deaths, starvation, Christian persecution",
    "summarized_story": "Daniel Olukoya of the General Overseer of the Mountain of Fire and Miracles Ministries, has released prophecies for the year 2022.\nSpeaking during MFM’s crossover service, Olukoya said Nigerians should pray against strange deaths.\nAccording to Olukoya: “We need to pray against inflation and starvation.\n“We need to pray against strange deaths.\n“For any power that wants Nigeria to sink shall sink, and any power that wants Nigeria to die shall die; they will drink their own blood and eat their own flesh, until they are drunk with it.”"
  },
  {
    "headline": "Nigerian military eliminates bandit leaders, Kachalla, Auta in Zamfara",
    "summarized_story": "The Nigerian military neutralized bandit leaders, Kachalla Ruga and Alhaji Auta in a New Year eve operation.\nThey were targeted Friday night by a Nigerian Air Force (NAF) aircraft after intelligence identified them.\nKachalla, Auta and their footsoldiers died at Gusami Forest and Tsamre village in Birnin Magaji Local Government Area.\nSeveral bandits who converged at Auta’s residence for his burial were also struck by subsequent bombardment of the location.\nAn officer told PRNigeria that follow-up airstrikes hit fleeing gang members and those hiding under trees."
  },
  {
    "headline": "UNIABUJA gov council approves promotion of 118 staff",
    "summarized_story": "The Governing Council of University of Abuja has approved the promotion of 118 staffers comprising 43 lecturers and 75 non-teaching staffers.\nA statement by Head, Information and University Relations, Dr Habib Yakoob said the approval of the promotion was given at the 91st Regular meeting of Council held on 2nd and 3rd December 2021.\nVice- Chancellor of the university, Prof Abdul-Rasheed Na’Allah, said their promotion was a testimony to their continued dedication, hard work and discipline.\nAccording to Na’Allah, the University Management, with the support and guidance of the Council, is determined to ensure that no staff who merits promotion is ever denied such a privilege.\n“At the University of Abuja, hard work, integrity and dedication of members of staff to duty mean a lot to us."
  },
  {
    "headline": "NERC: 26,503,900mw injected into grid in nine months",
    "summarized_story": "- Advertisement -In the month, the NESI recorded 7.33% transmission loss factor and 8.05% MYTO assumed transmission loss factor.\nThe NESI recorded 7.41% transmission loss factor and 8.05% MYTO assumed transmission loss factor.\nIt recorded 7.50% transmission loss factor and 8.05% MYTO assumed transmission loss factor.\nThe NESI recorded 7.39% transmission loss factor and 8.05% MYTO assumed transmission loss factor.\nIn the period the NESI recorded 7.52% transmission loss factor and 8.05% MYTO assumed transmission loss factor."
  },
  {
    "headline": "Reps moves to outlaw strike in health sector",
    "summarized_story": "The House of Representatives will on resumption from its Christmas and New Year break, consider a bill that will outlaw strike for medical practitioners in the employment of the three tiers of government.\nThe law will however accelerate administrative and judicial proceedings in the determination of trade disputes involved in medical practitioners in the employment of government.\nSponsored by Rep Simon Chukwuemeka Atigwe (PDP, Enugu),the bill is listed on the House journal as House Bill (HB) 1618).\nIt seeks to amend the principal Act by amending Section 17 of the Trade Disputes Act Cap.\nT8 Laws of the Federation of Nigeria 2004 by creating a new sub section 2."
  },
  {
    "headline": "NLC to FG: We'll shut down Nigeria if fuel price increases",
    "summarized_story": "The Nigeria Labour Congress (NLC) is not about to back down on its objection to the plan by the federal government to hike petrol price and electricity tariff.\nLabour vowed yesterday to shut down the country should government proceed with the planned price hike in the new year.\n“The despair of our unfortunate Catch 22 situation is that government increases the pump price of petroleum products when the price of crude oil increases and falls in the international commodities market.\nThe explanation is that such increases automatically translate to increases in the price of refined petroleum products.\nThe subsidy removal will automatically result in an increase in petrol price and other costs of living."
  },
  {
    "headline": "Violence against women insults God, says Pope in New Year’s message",
    "summarized_story": "By Adekunle Jomoh, Ilorin, Kolade Adeyemi, Jos, Oyebola Owolabi, Adeola Ogunlade and Simon Utebor, YenagoaFrom Pope Francis yesterday came a warning to the world to ensure peace in 2022, even as he described violence against women as an insult to God.\n- Advertisement -“Let’s go home thinking peace, peace, peace.\n“Let us therefore live in love and unity, pursue peace and justice in all spheres and in all our engagements.\nHis words: “Nigeria is tremendously blessed and endowed with not only natural resources but good people who want to live in peace and pursue legitimate endeavours in peace, unity and tranquility.\nHe urged them to continue to “relate with one another as one people bound by a common destiny under God.”"
  },
  {
    "headline": "2022: Ohanaeze, YCE, ACF, others make demands from Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has said that notwithstanding the threat of insecurity in the country, his administration remains resolute to continue with its programmes and plans.\nHe said this in his New Year message to Nigerians as the country joins the rest of the world to welcome 2022.\nPresident Buhari noted that to win the war on insecurity, the hearts and minds of the affected citizens must be won.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nAs we welcome 2022, let us, with hope, envision a year of continued progress against our combined challenges arising from security and socio-economic issues."
  },
  {
    "headline": "New Year: Jonathan, Atiku, Kalu, Oyetola, Tinubu, Anyim, others preach hope, peace",
    "summarized_story": "“Across the world, there is a global demand for justice, peace, hope, security and sustainable development.\nAtiku tasks Nigerians on peace, unityFrom Ndubuisi Orji, AbujaFormer Vice President, Atiku Abubakar has charged Nigerians to commit themselves to the pursuit of peace and unity in the New Year.\nHe urged the people to continue to support his administration’s policies and programmes so as to achieve more desired development.\nIn his new year message, the former Senate President noted that 2022 offers us new hope and fresh opportunities.\n“From the ashes of 2021, I see hope for Nigerians in the New Year 2022."
  },
  {
    "headline": "Excitement in Abia North, as Kalu spreads joy to more constituents",
    "summarized_story": "By Kenneth UdehChief Whip of the Senate, Senator Orji Uzor Kalu on Friday extended distribution of empowerment materials to agricultural practitioners and artisans in his Abia North constituency.\nDuring the previous exercise, Kalu had distributed a set of 350 motorcycles, 200 sewing machines and other empowerment kits to Isuikwuato Local Government Area of Abia North Senatorial District.\nYesterday, the Senate Chief Whip extended the distribution of the self-reliance items to ward constituents in Bende Local Goverment area.\nThe benefiting wards include; Igbere A, Igbere B, Alayi, Item A, Item B, Item C, Ugwueke/Ezeukwu, Umuhu, Ozuitem, Bende, Nkpaumuimenyi, Uzuakoli and Itumbuzo.\nHe pointed out that the two remaining local governments in Abia North (Ohafia and Arochukwu) will adequately receive their own materials in due time."
  },
  {
    "headline": "Bayelsa: Pastor, six others die in New Year Eve boat mishap",
    "summarized_story": "From Femi Folaranmi YenagoaA New Year eve boat mishap has thrown Ogbinbiri community in the Southern Ijaw Local Government Area of Bayelsa state into mourning following the death of a 39-year- old pastor and six others.\nThe deceased pastor identified as Pastor Salvation Degemy, was the General Overseer of the Supernatural Church of God located in the community.\nThe other victims included a husband, his sick wife, two children and other relatives travelling to Yenagoa from the community.\n“Pastor Salvation Degemy was travelling with them to engage in prayer for the dying patient,” the source said.\nCommunity sources said the tragic event has disrupted the New Year celebration in the community as many people are mourning."
  },
  {
    "headline": "They slit her throat, stabbed her to death",
    "summarized_story": "She was allegedly killed by one Sikemi Olajiga, 31, daughter of Pastor Olajiga, a minister with the Redeemed Christian Church of God (RCCG) in Ado-Ekiti.\nPastor Olajiga came out of his house and he said ah, God will make you see her.\nBut I noticed something, in the morning when I was looking for Demilade, Pastor Olajiga was putting on a blue shirt when he came out.\nSo, immediately I dropped in front of Joy Estate, I sighted Pastor Olajiga.\nThey brought Pastor Olajiga and his wife out, I asked that what have I done to them to deserve this?"
  },
  {
    "headline": "As 2022 Rolls in, Buhari Preaches Unity, Hope, Resilience, Forgiveness",
    "summarized_story": "On the economy, he said his administration had shown a high level of resilience to record some significant achievements despite the turbulence that has characterised the nation’s economy and the global economy.\nAs we welcome 2022, let us, with hope, envision a year of continued progress against our combined challenges arising from security and socio-economic issues.\n“As it is said, the past is but a story told, the future will still be written in gold.\nLet us be united in our fight to keep our nation united against all odds and with gratitude, celebrate life in this new epoch.\nI wish you a very happy and prosperous New Year.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Lawan: Senate to Review Electoral Bill, 1999 Constitution January",
    "summarized_story": "*Says lawmakers will find way forward on direct primary clauseOur CorrespondentsThe President of the Senate, Ahmad Lawan yesterday announced that the Senate would review the rejected Electoral Act Amendment Bill and the 1999 Constitution immediately it resumes plenary on January 18.\nThe National Assembly transmitted the Bill to President Muhammadu Buhari on November 19, last year, with recommendations on electronic transmission of results and direct primaries for political parties, among others.\nIn a New Year statement he personally signed, titled “Let’s keep faith in Nigeria,” Lawan said the Electoral Act Amendment Bill was handled with the spirit of patriotism, even though it was rejected by the President.\nWe are determined to deliver an Electoral Act that stands the test of time in safeguarding democracy and the electoral process in Nigeria.\n“We are also looking forward to receiving the report of our Committee on the Review of the 1999 Constitution upon our resumption from recess."
  },
  {
    "headline": "Budget 2022: President Laments Alterations By N’Assembly, Signs Reluctantly",
    "summarized_story": "*Ready to submit amendment bill early 2022, assents to 2021 finance billDeji Elumoye in AbujaAfter expressing deep concern about changes effected on the 2022 budget by the National Assembly, President Muhammadu Buhari yesterday reluctantly signed the N17.127 trillion 2022 Appropriation Bill into law.\nBuhari said the lawmakers reduced the amount allocated to some projects, but added 6,576 projects of their own to the 2022 budget.\n‘‘It is in this regard that I must express my reservations about many of the changes that the National Assembly has made to the 2022 Executive Budget proposal.\nTo achieve the laudable objectives of the 2022 Budget, President Buhari pledged that the federal government would further intensify revenue mobilisation efforts.\n‘‘I count on the cooperation of the National Assembly for a quick consideration and approval of the Plan when submitted."
  },
  {
    "headline": "Brown Ebewele is Dead",
    "summarized_story": "A former Nigerian athlete and administrator, Brown Ebewele is dead.\nEbewele fondly called ‘Juju Man’ died on Friday afternoon at a private hospital in Warri, Delta State after a surgery.\nThe success of Team Nigeria at the 2003 African Games hosted by Nigeria in Abuja was partly due to the efforts of Ebewele.\nAt various times, he led such states as Delta, Kano, Borno and Edo to decent outings at the National Sports Festival.\nHis last outing was helping Team Edo to finish as runners up at the much postponed NSF which held last April in Benin City."
  },
  {
    "headline": "Breaking: FCT Minister Tests Positive for COVID-19",
    "summarized_story": "Olawale Ajimotokan in AbujaFCT Minister Muhammed Musa Bello has tested positive for COVID-19.\nThe minister said he decided to do a COVID-19 test on Thursday morning after feeling unwell from December 28.\nHe disclosed the test came out positive on Friday morning.\n“After feeling unwell from 28th December, I decided to do a COVID-19 test yesterday morning.\nHe also urged all those who have not been vaccinated against COVID-19 to do so."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Business Owners Lament Losses In Abuja Mall Fire, Blame Slow Response From Emergency Agencies For Destruction Of Multi-million Naira Items",
    "summarized_story": "The fire, which started around 9:00 am, razed the entire mall owned by a former governor of Anambra State, Peter Obi.\n“If those two agencies cannot respond immediately when there is an emergency, I do not see any reason why they exist.\n“There should be sanctions for agencies such as FFS and NEMA whenever they fail to respond quickly to an emergency.\nHow many times did we have fire outbreaks in Abuja this year that they responded immediately?\nIn July, another popular mall in Abuja – Ebeano Supermarket – was consumed by fire following an outbreak."
  },
  {
    "headline": "Autopsy establishes ‘chemical intoxication’ as cause of Oromoni’s death",
    "summarized_story": "AdvertisementOromoni’s father had alleged that his child was beaten and fed a liquid chemical.\nBut Dowen College had dismissed the claim, saying the boy sustained injuries while playing football with his colleagues.\nHakeem Odumosu, Lagos police commissioner, had ordered a probe while Dowen College was sealed off.\nAdvertisementHe also accused the Lagos police and the government of hoarding the second autopsy result of the corpse.\n“The Lagos state government has decided to go in favour of Dowen College Lagos and murderers involved,” he said."
  },
  {
    "headline": "Kaduna shuts Islamic school over ‘rape of 6-year-old girl’",
    "summarized_story": "The Kaduna State Schools Quality Assurance Authority (KSSQA) on Friday shut down two Islamiyah schools indefinitely over cases of alleged rape and impregnation of two girls.\nAdvertisementAccording to NAN, Madrasatul Ulumul Deeniya wa Tahfizul Qur’an, one of the schools located in Rigasa, was closed over the alleged rape of a six-year-old girl inside the school premises.\nThe other Islamiyah school, located at Tsohon Masallacin Juma’a in Kachia, was also closed following the alleged impregnation of a 12-year-old girl by a 50-year-old teacher at the school.\nIdris Aliyu, the overseer of the KSSQA, said the six-year-old girl was violated within the school premises.\nAdvertisementOn his part, the DPO confirmed receiving the case and equally aligned with the narrative of the headteacher of the Islamiyah school."
  },
  {
    "headline": "Two UNILORIN professors named among world’s top scientists",
    "summarized_story": "Elsevier B.V, the academic publishing company, has named two Nigerian professors among the most productive scientists globally.\nAdvertisementThe company publishes medical and scientific literature at Stanford University in the United States.\nKayode Oyewumi and Musa Yakubu, the professors named, are both from the University of Ilorin (UNILORIN).\nAdvertisement“While many ranking bodies are questionable and generally unacceptable, an emerging reputable and distinguished ranking body has named two UNILORIN dons, among the world’s top two scientists,’’ he said.\n“It is hoped that the next edition of the ranking will feature more scientists from UNILORIN and Nigeria.”AdvertisementCopyright 2022 TheCable."
  },
  {
    "headline": "Underage not required to submit COVID vaccination card for UTME, says JAMB",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) says candidates and visitors below 18 years of age are not required to submit COVID-19 vaccination cards before accessing its facilities.\nAdvertisementEarlier, the board had announced a “no vaccination card, no entry” policy for its facilities nationwide.\nBenjamin said those mandated to provide vaccination cards are persons covered under the Nigerian Centre for Disease Control (NCDC) vaccination policy.\nAdvertisementHe said JAMB discovered that many underage candidates are making frantic efforts to get vaccinated, with some falsifying their age to access services at the board’s facilities.\nAccording to Benjamin, the board would, however, require evidence of being underage to allow any underage individual access to its facilities."
  },
  {
    "headline": "Burna Boy blows hot as Shatta Wale accepts one-on-one challenge",
    "summarized_story": "Burna Boy, Nigerian singer, and Shatta Wale, his Ghanaian counterpart, have resumed their ongoing war of words on social media.\nBurna Boy had earlier condemned Wale’s rants while adding that he is open to one-on-one fight with him.\nAdvertisement“Oh @burnaboy says he want a one-on-one ..ok let’s do this Accra sports stadium… I just call shots…If you be man !!!!\n“I double dare you @burnaboy, Infact I 10x dare you ….This no be fight just lyrical … Like you go stop sing !!!!\n— SHATTA WALE (@shattawalegh) January 1, 2022 AdvertisementIn his response, Burna Boy insisted on engaging him in a fist like “real men do.”The Nigerian singer said he had been trying to set up the clash with Wale since January last year."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Techpoint Africa is 7! The next frontier",
    "summarized_story": "Techpoint Africa has been in business for exactly seven years!!\nThemed “The next frontier“, Techpoint Build promises to be, as always, the largest gathering of innovators, startup founders, thinkers, programmers, policymakers, and investors in West Africa.\nAs part of the activities for Techpoint Build, five of 15 shortlisted startups from across Africa will compete for $10,000 in equity-free grant money.\nTo receive an invite to the dinner, you have to purchase a VIP ticket to Techpoint Build.\nTechpoint Africa Membership ProgrammeIn October 2021, we activated our Membership Programme to zero fanfare."
  },
  {
    "headline": "10 memorable moments for African tech in 2021",
    "summarized_story": "As the year ends, we bring you a few memorable moments across the African tech ecosystem, some good and some bad.\nMore African investors throw their hats in the ringKola Aina, pioneer founder Ventures Platform fundFor so long, most of the investment into African startups came from foreign investors.\nHowever, more African investors are springing up and providing much-needed funding for African startups.\nFor so long, it has been argued that Nigerian startup founders need to be proactive in their interactions with the government and regulators.\nAs a result, some of the country’s most prominent founders and investors came together to work on the Nigerian Startup Bill."
  },
  {
    "headline": "Reviewing Nigerian fintech in 2021: Local investors are stepping up",
    "summarized_story": "Share this article:Between January and September 2021, African fintechs raised up to $1.4 billion, signalling an increasing investor appetite for Africa’s growing fintech space, and Nigeria has taken centre stage.\nAccording to data gathered by Intelligence by Techpoint, Nigerian fintech startups raised almost $800 million in 2021.\nBut, so far, there’ve been massive improvements in the fintech space beyond smartphone apps.\nIn January 2021, Olowe made some interesting predictions which, in the real sense, are educated guesses based on the trends from past years, and we created a little analysis.\n“I must admit that MTN would find it really tough to play in the financial space."
  },
  {
    "headline": "‘Edo APC’s call for state of emergency should be directed at FG’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – That the Edo State Chapter of the All Progressives Congress (APC) have the temerity to convene a press conference and raise issues about governance and development is not only a slap on the faces of citizens of Edo State, but a sign of selective amnesia.\nCan Edo APC not see that their call for a state of emergency should be more appropriately directed to a federal government, which they lead, that has reduced the value of Nigerian lives to near nothing?\nDoes the party want a state of emergency in a state where every flight, or bus coming into the state is fully booked with air carriers and road transporters jostling to keep up with the pressure of travellers trooping into the state?\nIt is rather shameful for old men – grandfathers, for that matter – to sit comfortably, look into the camera and tell bare-faced lies about the Edo State Judiciary, the state legislature, the newly reconstructed Government Science and Technical College (GSTC), street-lighting project, Edo Tech Park, Edo Innovation Hub, among others.\nThe PDP-led government in Edo State has and will continue to put the interest of the people over and above the interest of all others."
  },
  {
    "headline": "Edo to launch cluster farm initiatives, others to boost oil palm devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government plans to launch the state’s Oil Palm Development initiative and Cluster Farm initiative, as part of ongoing reforms in the agricultural sector to grow the state’s economy and achieve food security.\nThe governor, who spoke to journalists in Benin City, said his administration is committed to stimulating economic prosperity and improving ease of doing business to continuously attract private capital to engender sustainable development.\nAccording to him, “Motivated by the progress recorded with the Edo State Oil Palm Programme (ESOPP), we will be launching the Oil Palm Development initiative and Cluster Farm initiative, in furtherance of our aim of anchoring our economic growth on commercial agriculture while sustaining food security.”Noting that Edo, with the cultivation of 120,000 hectares, has the largest oil palm plantation under cultivation in the country, Obaseki added, “We have put under cultivation up to 250,000 hectares of land for oil palm under our ESOPP programme.\nToday, we are approaching about 120,000 hectares.\n“We are providing our people with an oasis of hope even with the harsh realities that confront us as a sub-national in a country that is confronted by a number of developmental challenges.”..."
  },
  {
    "headline": "Obaseki swears in seven SSAs, 25 SAs in Oredo LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in seven Senior Special Assistants (SSAs) and 25 Special Assistants (SAs), following harmonisation by leaders and members of the Peoples Democratic Party (PDP) in Oredo Local Government Area (LGA).\nThe governor said, “I had to wait, take my time and ensure harmonization of the party in the LGA before making this appointment.\nPolitics in Oredo LGA is very sensitive and the barometer through which Edo politics is judged.\nIf we fail to get Oredo right, it will be difficult and challenging to get Edo State politics right.\n“I have divided Oredo into 20 zones for development purposes as data are available for every household in Oredo."
  },
  {
    "headline": "Edo boosts security on waterways with eight new gun, speedboats – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… builds modern jetty, marine base, others for security personnelBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has procured additional four armoured gunboats and four speedboats to curb criminal activities along the state’s coastal areas and waterways.\nThe Chairman of EDSOGPADEC, Pastor Kennedy Osifo, who spoke to journalists, on behalf of other board members, immediately after inspecting the gun and speed boats, said the commission has now acquired eight gunboats and eight speed boats to strengthen security on its waterways and stop the activities of sea pirates.\nHe said the new armoured equipment will improve security in three oil and gas producing communities, including Ologbo in Ikpoba-Okha Local Government Area (LGA) and Gelegele, Ovia North East LGA of the state.\nOsifo revealed that the commission has completed the construction of a marine base at Ologbo River, as well as a modern jetty with a waiting lounge and other essential facilities for passengers and police officers in Ologbo Community in Ikpoba-Okha.\nThe EDSOGPADEC chair, who charged residents on protection of public facilities, said the commission will sustain efforts at improving the livelihoods of Edo people, which according to him, is a priority of the present administration of Governor Obaseki."
  },
  {
    "headline": "Nigerian born British undergraduate launches Climate Change NGO, Our Tomorrow",
    "summarized_story": "“Already, Africa is confronted by the twin challenge of insecurity and poverty, but climate change now threatens the continent’s very existence,” he said.\nNot long ago, the the Lagos State government unveiled a five-year Climate Action Plan (CAP) 2020-2025.\n“Agriculture, which remains heavily dependent on rainfall, is critical to Africa’s economic growth, thus, climate change could potentially destabilize local markets, increase food insecurity, limit economic growth, escalate insecurity and increase risk for agriculture sector investors.\n“My target is to mobilise the teeming populace of the youths in Africa to achieve a critical mass of climate change advocates, whose voices will resonate loudly and clearly and catalyse positive action.\n“Indeed, the prospects are exciting, I invite all African youths to this adventure.”"
  },
  {
    "headline": "For the Record: Text of President Muhammadu Buhari’s New Year Speech",
    "summarized_story": "There is no doubt that the issue of Security remains at the front burner of priority areas that this Administration has given utmost attention to.\nOn the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterized our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nAs it is said, the past is but a story told, the future will still be written in gold.\nLet us be united in our fight to keep our Nation united against all odds and with gratitude, celebrate life in this new epoch."
  },
  {
    "headline": "CBN adjusts forex rate, naira slides down to N435/$1 at official market",
    "summarized_story": "In what appears to be another devaluation of the naira, the Central Bank of Nigeria (CBN) on Friday, adjusted the country’s exchange rate on its website to N413.49/$1, causing the naira to tumble to N435 against the dollar at the official market.\nThe CBN had in May, devalued the naira from N379 to N411/$1 by adopting the (I&E) window.\nThe naira was quoted as high as N445.50 per dollar during the intra-day trading.\nThe apex bank has devalued the exchange rate multiple times since March 2020 as it tries to bridge the disparity between the official and parallel market rates.\nAt the parallel market, the local currency stabled at N570 to a dollar."
  },
  {
    "headline": "Oyetola urges Osun people to approach New Year with renewed hope, faith",
    "summarized_story": "He urged the people of the state to approach the new year with renewed hope and faith, just as he appreciated them for their patience, support, cooperation and construtive criticism, shown to his government.\nOyetola further said: “2022 is no doubt an election year for us in Osun.\n“Our goal is to achieve inclusive socio-economic growth that is rooted in our 10-Year Osun Development Plan (2019-2028).\nOur plan rests on four developmental pillars: Economic Development, Infrastructure Development, Human Capital Development and Security, and Environmental Sustainability.\nHowever, I enjoin our people to maintain the undying spirit and enter 2022 with renewed hope and faith."
  },
  {
    "headline": "Air Force Confirms Killing Of Wanted Bandit Leaders In Zamfara Forest",
    "summarized_story": "The Nigerian Air Force (NAF) has confirmed that its airstrike executed on Saturday, January 1, 2022, killed wanted bandit leaders, Alhaji Auta, and Kachalla Ruga, in a forest in Zamfara State.\nThe director of NAF Public Relations and Information, Air Cdre Edward Gabkwet, confirmed this to LEADERSHIP on Saturday.\nLEADERSHIP earlier reported the killing of the bandit leaders, citing security sources.\nThe notorious bandit leaders met their waterloo after a Nigerian Air Force (NAF) aircraft, under Operation Hadarin Daji, acting on credible intelligence bombarded their enclaves, at Gusami Forest and Tsamre Village in Birnin Magaji local government area of the State on Friday, December 31, 2021.\nADVERTISEMENTThe series of airstrikes also killed bandit fighters in the enclave."
  },
  {
    "headline": "JUST-IN: Military Raids Zamfara Forest, Kills Bandit Leaders, Others",
    "summarized_story": "Wanted bandit leaders, Alhaji Auta, and Kachalla Ruga, have been killed in an air raid of a forest in Zamfara State.\nAccording to PRNigeria, the notorious bandit leaders met their waterloo after a Nigerian Air Force (NAF) aircraft, under Operation Hadarin Daji, acted on credible intelligence, and bombarded their enclaves at Gusami Forest and Tsamre Village in Birnin Magaji local government area of the State on Friday night.\n“For now, the whereabouts of other notorious bandits like Alhaji Nashama, Shingi and Halilu who may either be incapacitated or on the run remain unknown,” the source added.\nIt further learnt from the military source, that aggressive bombardments by NAF aircraft, had in recent times been very precise and effective in hitting bandits’ enclaves, eliminating their leaderships and followers, in the process.\n“These operations have reassured citizens of the commitment and dedication of the military and other security agencies, towards bringing the threats posed by banditry under check, in no distant time."
  },
  {
    "headline": "Kwara CAN Chairman Dies At 60, Gov AbdulRazaq Mourns",
    "summarized_story": "The chairman of the Christian Association of Nigeria (CAN), Kwara State chapter, Most Reverend Paul Olawoore, is dead.\nMeanwhile, Kwara State governor, AbdulRahman AbdulRazaq, has commiserated with the Kwara Christian community on the death Olawoore.\nThe governor in a condolence message described the death of the CAN’s chairman as painful.\nADVERTISEMENT“It is indeed a painful exit of a prominent clergy who devoted his entire life to the service of God and humanity.\n“My profound condolences go to his immediate family, the Catholic family, and the entire Christendom in Kwara State on this sad loss."
  },
  {
    "headline": "Kwara CAN Chairman Dies At 60, Gov AbdulRazaq Mourns",
    "summarized_story": "The chairman of the Christian Association of Nigeria (CAN), Kwara State chapter, Most Reverend Paul Olawoore, is dead.\nMeanwhile, Kwara State governor, AbdulRahman AbdulRazaq, has commiserated with the Kwara Christian community on the death Olawoore.\nThe governor in a condolence message described the death of the CAN’s chairman as painful.\nADVERTISEMENT“It is indeed a painful exit of a prominent clergy who devoted his entire life to the service of God and humanity.\n“My profound condolences go to his immediate family, the Catholic family, and the entire Christendom in Kwara State on this sad loss."
  },
  {
    "headline": "2022: Make Your Voice Count, PRP Urges Nigerians",
    "summarized_story": "The People’s Redemption Party (PRP) has called on Nigerians to make their voice count and actions matter in the New Year.\nIn a statement made available to LEADERSHIP on Saturday in Abuja, to herald the New Year, and signed by the interim national chairman of the party, Comrade Adulmajid Yakubu Dauda, the party expressed the hope that 2022 will “hopefully, mark the beginning of a new life for Nigerians.”Dauda declared that from an era of uncontrolled inflation, insecurity, and COVID-19 worries, he said 2022 will be a year of peace, security, and relative prosperity for the country.\nADVERTISEMENTAccording to him, “Our resolve in this new year must be to stand up and be counted as free citizens in a free country who can decide their own destiny.\n“Let’s make our voices count, and our actions matter in our communities and across the country in our push for a better life.\nAnd let’s make 2022 our year of redemption.”ADVERTISEMENTHe, therefore, saluted the resilience of Nigerians and wished them a “Happy New Year.”"
  },
  {
    "headline": "Fuel price increase: We will shutdown Nigeria, NLC warns FG",
    "summarized_story": "Nigeria Labour Congress, NLC, has insisted that workers and masses will not accept any further increase in the pump price of fuel in the name of subsidy removal, urging workers and the citizens to prepare for total war against fuel price hike.\nFirst is our concern on the deceit and duplicity associated with the politics of “petrol price increase” by successive Nigerian governments.\n“All we hear from government are half-hearted media pronouncements on efforts to allocate funds for the rehabilitation of our public refineries.\nThere is no escaping the fact that our public refineries must be made to work.\nThis is why we believe that private investment in building petroleum refineries is not enough."
  },
  {
    "headline": "Fuel price increase: We will shutdown Nigeria, NLC warns FG",
    "summarized_story": "Nigeria Labour Congress, NLC, has insisted that workers and masses will not accept any further increase in the pump price of fuel in the name of subsidy removal, urging workers and the citizens to prepare for total war against fuel price hike.\nFirst is our concern on the deceit and duplicity associated with the politics of “petrol price increase” by successive Nigerian governments.\n“All we hear from government are half-hearted media pronouncements on efforts to allocate funds for the rehabilitation of our public refineries.\nThere is no escaping the fact that our public refineries must be made to work.\nThis is why we believe that private investment in building petroleum refineries is not enough."
  },
  {
    "headline": "CAN cries out: FG abandoned security, focusing on 2023 elections",
    "summarized_story": "The Christian Association of Nigeria, on Friday, warned that except by God’s intervention, the nation would become Sodom and Gomorrah.\nThe organisation regretted that despite pleas by the Federal Government to the international community, they neglected Nigeria and beamed attention on the COVID-19 pandemic.\nThe President of CAN, Dr. Samson Ayokunle, said these in his New Year Message titled, ‘Pray for God’s mercy over Nigeria – CAN’.\nHe said, “It gladdens my heart to say a resounding Happy New Year 2022 to all Nigerians irrespective of their religious, tribal and political persuasions.\nUtomi made this known on Friday in his New Year message, titled, ‘Arise and reclaim Nigeria before they kill it- a New Year message’."
  },
  {
    "headline": "CAN cries out: FG abandoned security, focusing on 2023 elections",
    "summarized_story": "The Christian Association of Nigeria, on Friday, warned that except by God’s intervention, the nation would become Sodom and Gomorrah.\nThe organisation regretted that despite pleas by the Federal Government to the international community, they neglected Nigeria and beamed attention on the COVID-19 pandemic.\nThe President of CAN, Dr. Samson Ayokunle, said these in his New Year Message titled, ‘Pray for God’s mercy over Nigeria – CAN’.\nHe said, “It gladdens my heart to say a resounding Happy New Year 2022 to all Nigerians irrespective of their religious, tribal and political persuasions.\nUtomi made this known on Friday in his New Year message, titled, ‘Arise and reclaim Nigeria before they kill it- a New Year message’."
  },
  {
    "headline": "2022: Don't listen to prophets of doom, Abiara tells Nigerians",
    "summarized_story": "The General Evangelist, Worldwide of the Christ Apostolic Church (CAC), Prophet Samuel Kayode Abiara on Saturday told Nigerians, especially the people of Lagos State to shun those he described as prophets of doom.\nProphet Abiara, at the Christian worship prayed for Lagos State Governor, Mr. Babajide Sanwo-Olu, his family, members of the State Executive Council and Lagos State.\nHe urged people not to listen to prophets of doom against Nigeria and her leaders at the national and state levels.\n“Don’t listen to prophets of doom against Nigeria, our nation and the leaders.\nDon’t listen to prophets of doom against Lagos State."
  },
  {
    "headline": "Comedian Isbae U show off new home in Lagos",
    "summarized_story": "Nigerian Instagram sensation and actor, Adebayo Ridwan, popularly known as Isbae U, has acquired a newly built house in an undisclosed location in Lagos.\nThe skit maker shared pictures of the property on his social media page on Saturday, January 1st, 2021, thanking people who have contributed to his success.\nHe wrote, “Alhamdullilahi 🏠 🔑“I am the most grateful and joyful man on Earth, I really cracked my head for a beautiful message to compose here cuz I really want to tell y’all my story, but all I end up coming up with is “Tor Alhamdullilahi “ in 2021 they were good and bad days, but Everyday Was Alhamdullilahi Day 🙏🏿 😇“I really wish my Mum was Alive to give me a pat on my back, pray for me and tell me how much she’s proud of me but I can only say Thank You 🙏🏿, Thank You God, I so grateful 😇 I wanted it and God made it possible, Yes I am the guy Who literally Bought a house with with all his last card 💰 😂 ( that is to say I don broke oo 😂, make una support me with money buy tv , couch and other stuffs oo 0118107047 gtb 😂)“I am so grateful to everyone who has supported and pushed me in getting to where I am today in one way or the other, I thank God for beautiful people like @oluwadolarz @mrmacaroni1 @sirbalocomedy_ @iamedemvictor @toyin_abraham @iyaboojofespris @mufasatundeednut @donjazzy, I thank God for my wonderful Woman @kemz_mama for her everlasting support and understanding, I thank God for @habyke_27 @sulahitony @oba__g @kira_taiwo @tessy_alayo @babayhermi @papijhay_ @victor_avo_ @macanthonyofficial I thank God for Everyone of you that have featured, watch and shared my skits, I thank God for my Strong, supportive and Amazing Dad 🙏🏿“Today I say a Big Alhamdullilahi as I enter a New year,2022 We go again for better, Insha Allah 🙏🏿❤️Many colleagues and friends including Oluwadolarz, Mr Macaroni, Sir Balo Comedy have also taken to their various social media pages to congratulate the singer.\nIsbea U who is currently making waves in the entertainment industry with his very comic skits is one of Nigeria’s distinctive comedy brands at the moment who has created a niche for himself.\nIsbea U is known to be in a relationship with colleague, Mummy Wa better known as Kemz Mama whose real name is Kemi Ikuseedun."
  },
  {
    "headline": "BREAKING: Fire Guts Three-Storey Building In Lagos On New Year’s Day",
    "summarized_story": "A three-storey building has been gutted by fire in the Surulere area of Lagos State on New Year’s Day.\nAs of the time of filing this report, details of the fire incident are sketchy.\nThis would be the second fire incident to be recorded in Nigeria on new year’s day.\nEarlier, a fire incident was reported at the Port Harcourt Refinery Company in Eleme Local Government Area of Rivers State.\nThe refinery which is currently undergoing repairs is the first and largest refinery in the country."
  },
  {
    "headline": "President Buhari Reacts To Deaths Of Datti Ahmed, Ado Gwaram.",
    "summarized_story": "On the late Ado Gwaram, the President described him as an extraordinary civil servant who “was at the forefront of many community service initiatives.\nOn account of these, he rightfully enjoyed the respect and patronage of every administration, military and civilian in the old and new Kano State.\nperfect-dating.comThe delegation was received in Kano by the Secretary to the State Government, Usman Alhaji, who received the President’s letter of condolence to the government and people of Kano State.\nOn behalf of the Governor, who was away, the SSG thanked the President for identifying with the state in their moment of grief.\nSpeaking through Aminu Babba Dan Agundi, Sarkin Dawaki Babba,the family of Ado Gwaram thanked the President for honoring them with the visit."
  },
  {
    "headline": "BREAKING: FCT Minister Tests Positive For COVID-19",
    "summarized_story": "Malam Muhammad Musa Bello, Minister of the Federal Capital Territory (FCT), has tested positive for the COVID-19 virus.\n“I tested positive for COVID-19,” he stated.\nAfter feeling unwell from 28th December, I decided to do a COVID-19 test yesterday morning.\nI pray for the quick recovery of all of us currently afflicted with COVID-19.\n“I have been informed by the experts that my case is mild because I took two shots of the COVID-19 vaccine."
  },
  {
    "headline": "BREAKING: FCT Minister Tests Positive For COVID-19",
    "summarized_story": "Minister of the Federal Capital Territory FCT, Malam Muhammad Musa Bello has tested positive for the COVID-19 virus.\nHe said; “I have tested positive for COVID-19.\nAfter feeling unwell from 28th December, I decided to do a COVID-19 test yesterday morning.\nI pray for the quick recovery of all of us currently afflicted with COVID-19.\n“I have been informed by the experts that my case is mild because I took two shots of the COVID-19 vaccine."
  },
  {
    "headline": "How I perfected kidnapping strategies by watching Nollywood – Suspect",
    "summarized_story": "A 23-year-old suspected kidnapper identified as Ayobamidele Kudus Ayodele has said he learnt how to abduct school children by watching Nollywood movies.\nHe particularly hinted that he understood kidnapping tricks via regular roles of a popular Nollywood actor, Zubby Michael.\nThe suspect made the shocking revelation after he was arrested by the operatives of the Force Intelligence Response Team (FIRT) in an operationAyodele was said to have been arrested after kidnapping a six-year-old pupil of Remson Group of schools in Ojo Alaba area of Lagos State.\nHe reportedly held the child captive for four days and wouldn’t allow him to go until his parents coughed up N550,000."
  },
  {
    "headline": "Breaking: 10-man Arsenal succumb to late Manchester City Premier League triumph",
    "summarized_story": "Rodri scored a stoppage-time winner as Manchester City beat 10-man Arsenal to move 11 points clear at the top of the Premier League with an 11th successive victory.\nThat advantage will be cut to some extent on Sunday when second-placed Chelsea host third-placed Liverpool, although no team has failed to win the Premier League title when beginning the new year with a lead as big as City’s.\nArsenal looked to have held out for a draw but Rodri steered in a loose ball in the 93rd-minute to help City maintain their dominant form.\nOne minute later Arsenal defender Gabriel Magalhaes was sent off for two yellow cards in quick succession, the first for trying to scuff up the spot and the second for a foul on Gabriel Jesus.\nArsenal, whose manager Mikel Arteta was forced to watch from home following a positive Covid test, remain fourth in the table."
  },
  {
    "headline": "Funeral: Eulogies, solemn atmosphere as Ramophosa, Bishops, others honour Archbishop Desmond Tutu in South Africa",
    "summarized_story": "The funeral mass for South African anti-apartheid campaigner Archbishop Desmond Tutu has taken place at the Anglican cathedral in Cape Town.\nTutu, a Nobel Peace Prize winner who helped end the racist regime in South Africa, died last Sunday aged 90.\nIn his eulogy, President Cyril Ramaphosa described Tutu as “the spiritual father of our new nation”.\nNot only in South Africa… but around the world as well”.\nTutu had requested that the only flowers in the cathedral should be a “bouquet of carnations from his family”, according to the Archbishop Tutu IP Trust and the Desmond and Leah Tutu Legacy Foundation."
  },
  {
    "headline": "Governors Preach Love, Tolerance In New Year Messages",
    "summarized_story": "He assured them that his administration would continue to implement policies, programmes, and projects that have a direct and positive impact on them.\nDespite witnessing two waves of COVID-19 in 2021, the mortality rate which we recorded in Edo State was far less than was projected.\nConsequently, the reform of our healthcare system is now a very high priority in our ongoing transformation of the entire governance structure of Edo State.\nThe physical and digital infrastructure we are laying across the state, including the proposed Airport in Edo North, will position Edo State as a major commercial hub in Nigeria and West Africa.\nI reassure the good people of Edo State that I will continue to strive to do only that which is in the best interest of Edo State and Edo people."
  },
  {
    "headline": "[EXCLUSIVE]: Bola Tinubu Contesting In 2023 A ‘Done Deal’ – Jibrin",
    "summarized_story": "Council, Abdulmumin Jibrin, has confirmed that former Governor of Lagos State and chieftain of the All Progressives Congress (APC), Bola Ahmed Tinubu, will indeed be contesting in the forthcoming 2023 Presidential election.\nBut the issue of Bola Tinubu contesting is a done deal.\nHe is going to contest the election; he’s going to be on the ballot paper,” Jibrin said in an exclusive interview with Channels Television on Saturday.\nRead Also: 2023 Presidency: About 2,500 Islamic Clerics Offer Prayers For Tinubu In KanoAccording to Jibrin, Tinubu has all it takes to defeat any other candidate in the election.\n“For me, the person who has an edge over all of them, that we can hand over the ticket to and perhaps go back home and sleep, is Asiwaju Bola Tinubu,” he said."
  },
  {
    "headline": "Happy New Year! Nigerians Usher In 2022",
    "summarized_story": "Religious bodies such as the Christian Association of Nigeria had earlier called on citizens to pray for God’s mercy in 2022.\nElsewhere across the world, 2022 was ushered in with scaled-back celebrations due to new restrictions aimed at slowing soaring Covid cases — although hope remained for a better new year.\nTrying TimesThe World Health Organization has warned of trying times ahead, saying Omicron could lead to “a tsunami of cases”.\nExperts and non-experts alike hope that 2022 may be remembered as a new, less deadly phase of the pandemic.\n“Hopefully 2022 is going to be better for everyone,” said 31-year-old reveller Oscar Ramirez in Sydney."
  },
  {
    "headline": "South Africa Bids Farewell To Tutu",
    "summarized_story": "South Africa said farewell on Saturday to Archbishop Desmond Tutu, the last great hero of the struggle against apartheid, in a funeral stripped of pomp but freighted with glowing tributes and showered with rain.\nTutu died last Sunday at the age of 90, triggering grief among South Africans and tributes from world leaders for a life spent fighting injustice.\nREAD ALSO: Key Dates In Late Bishop Desmond Tutu’s Life As Funeral Holds“We thank you for loving our father,” said Tutu’s daughter Mpho.\nWe remember him with a smile,” said Ramaphosa before handing South Africa’s multicoloured flag to the “chief mourner”, Tutu’s widow, Leah.\nHumourAfter apartheid was dismantled and South Africa ushered in the first free elections in 1994, Tutu chaired the Truth and Reconciliation Commission, which exposed the horrors of the past in grim detail."
  },
  {
    "headline": "2023 Presidency: About 2,500 Islamic Clerics Offer Prayers For Tinubu In Kano",
    "summarized_story": "About 2,500 Islamic clerics have offered prayers for Asiwaju Bola Tinubu in Kano as speculations continue to mount over the former Lagos State Governor’s plan to run for President in 2023.\n“We have about 2,500 ulamas from all over Kano that are all gathered; all were told that they are coming to pray for Asiwaju Bola Ahmed Tinubu because this is what we want,” he said.\nREAD ALSO: Bola Tinubu Contesting In 2023 A ‘Done Deal’ – Jibrin“And you see, these are real ulamas; some of them for a year, two years, do not go out of their domains.\nBut the issue of Bola Tinubu contesting is a done deal.\n“For me, the person who has an edge over all of them, that we can hand over the ticket to and perhaps go back home and sleep, is Asiwaju Bola Tinubu.”"
  },
  {
    "headline": "Gov. Ugwuanyi signs N186.64 billion 2022 budget into law",
    "summarized_story": "Enugu state Governor, Ifeanyi Ugwuanyi has assented to the 2022 appropriation bill of 186,64 billion naira recently passed by the State House of Assembly.\nPresenting the appropriation bill to Governor Ugwuanyi for assent, the Speaker of the State House of Assembly, Edward Ubosi disclosed that the budget proposal was a wonderful budget of international standard.\nUbosi explained that all the Ministries, Departments and Agencies (MDAs) appeared before the various committees to ensure they defended their budget estimates.\nAssenting to the appropriation bill, Governor Ugwuanyi expressed gratitude to God and the members of the State House of Assembly for their commitment and dedication to legislative duties as well as the development of Enugu State.\nHe expressed confidence that the budget would be implemented faithfully for the people of the state to enjoy more dividends of democracy."
  },
  {
    "headline": "Tinubu condoles with Gov Ganduje, Sharia Council over Sheikh Datti Ahmed's death -",
    "summarized_story": "The All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of elder-statesman and president of the council, Dr. Datti Ahmed.\nHe said throughout his life, Dr. Ahmed symbolised and fought for justice, equity and fairness adding that his demise was a loss not only to the Muslim community in Nigeria but to all Nigerians.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\n“My condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians as a whole."
  },
  {
    "headline": "Auditor General indicts NASS over alleged misappropriation of N9.4b -",
    "summarized_story": "The Office of the Auditor General for the Federation has indicted the management of the National Assembly and the National Assembly Service Commission for alleged unexplained expenditure amounting to N9.4 billion in the 2019 financial year.\nThe report said about N5.5 billion of such expenditure was credited to the House of Representatives in five different audit queries, N3.5 billion credited to the Senate in seven audit queries, while N307.6 million was credited to the National Assembly Service Commission in two audit queries.\nThe queries are contained in the Auditor General’s annual report on non-compliance and internal control weaknesses issues in Ministries, departments and agencies of the federal government for the year ended 31st December 2019.\nThe Report addressed to the Clerk to the National Assembly was signed by the Auditor General for the Federation, Adolphus Aghughu.\nThe report said N2.5 billion was granted to members of the House of Representatives as running costs between July and December 2019 without evidence to show what the funds were used for even as it was not retired."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "Uche Nwosu: Uzodinma is on a Vengeful Mission Against Rochas",
    "summarized_story": "Rochas Okorocha’s son-inlaw, Uche Nwosu says his arrest ordeal is part of Governor Uzodinma’s revenge mission against Rochas Okorocha"
  },
  {
    "headline": "Anthony Kila: Lai Muhammed’s List is like an Essay of an Average Student",
    "summarized_story": "Thursday, Lai Mohammed, Nigeria’s Minister of Information and Culture, listed 100 achievements of the Muhammadu Buhari administration in 2021, concluding that the government gave a good account of itself.\nMohammed said the many achievements were attained despite the challenges posed by widespread insecurity in the country and the COVID-19 pandemic.\nHowever, the question lingering on the minds of many Nigerians is whether the achievements presented by the minister had any meaningful impact on their lives and livelihoods.\nNow, joining us to assess the administration’s scorecard in 2021 and help us to separate facts from fiction, is Anthony Kila, a professor of strategy and development, and Director of the Centre for International Advanced & Professional Studies.\nGood morning Prof Kila and thank you for joining us…"
  },
  {
    "headline": "Ndubisi Nwokoma: No Hope That 2022 Budget Will Be Different From the Previous One",
    "summarized_story": "Today all eyes will be on President Muhammad Buhari to assent to the National Assembly transmitted 2022 budget.\nThe Clerk to the National Assembly, Amos Ojo, forwarded the letter to the president alongside a letter dated 24 December and titled “Appropriation Bill 2022”.\nHowever, before passing the budget, the lawmakers had increased the total expenditure from N16.3 trillion to N17.1 trillion – showing an increase of over N700 billion.\nIn the budget, statutory transfer was put at N869.6 billion, debt service at N3,88 trillion, recurrent (non-debt) expenditure at N6.9 trillion and capital expenditure at N5,46 trillion.\nJoining us now for an in-depth analysis of the transmitted 2022 Budget, is PROFESSOR NDUBISI NWOKOMA."
  },
  {
    "headline": "Several Dead in Stampede at Religious Shrine in Kashmir",
    "summarized_story": "At least 12 people have died and 13 injured in a stampede at a religious shrine in Indian-administered Kashmir.\nThe disaster happened around 3am (21:30 GMT) while it was still dark on the route to the Vaishno Devi shrine, one of the country’s most revered Hindu sites.\nThe Mata Vaishno Devi is one of the most revered Hindu shrines in northern India, with tens of thousands visiting to offer prayers every day.\nIn October 2013, a stampede in Madhya Pradesh state in central India killed more than 110 people, mostly women and children.\nTwo stampedes in as many months in India in 2008 left more than 370 Hindus dead."
  },
  {
    "headline": "WHO Chief Optimistic Covid Will Be Beaten in 2022",
    "summarized_story": "The World Health Organization (WHO) chief says he is optimistic that the coronavirus pandemic will be defeated in 2022, provided countries work together to contain its spread.\nDr Tedros Adhanom Ghebreyesu warned against “narrow nationalism and vaccine hoarding” in a new year statement.\nHis comments come two years since the WHO was first notified of cases of an unknown pneumonia strain in China.\n“If we end inequity, we end the pandemic,” he added.\nThe WHO has set a new goal for 2022: vaccinate 70% of people in all countries by July to end the pandemic."
  }
]