[
  {
    "headline": "Copa America: Bangladesh bans public display of Brazil, Argentina match",
    "summarized_story": "Police in a rural Bangladesh district have banned public display and gatherings for Sunday’s Copa America final between Brazil and Argentina following clashes between rival fans.\nIslam said police were now on alert for Sunday’s high-octane Copa America final in Rio de Janeiro, more than 15,000 kilometres away.\nCricket is Bangladesh’s main sport but the country of 168 million people becomes a hotbed of football fanaticism for the World Cup and Copa America.\nMillions of Brazil and Argentina fans hoist the flags of their favourite country on their homes and stage street processions wearing team shirts.\nDuring the 2018 World Cup a 12-year-old boy was electrocuted to death while putting a Brazil flag on a road pole."
  },
  {
    "headline": "How Oshoala’s influence made me bag first class from UNILAG -Sister",
    "summarized_story": "I am also inspired by my fastidious and devout late mother, my no-nonsense father, and my elder sister who is a pro-footballer.\nDid the success or fame of your sister has any influence on your academic prowess?\nI’d love to attain the heights of the Broadcasting profession.\nAs I mentioned earlier, I’d love to own a Broadcast outfit, that is, having acquired and to a reasonable extent, honed my skill in the field and working for renowned stations like the BBC.\nAnd then, I’d love to do some fashion influencing, by the side."
  },
  {
    "headline": "Emir of Lafiagi was an advocate of peace, Abdulrazaq mourns",
    "summarized_story": "Governor AbdulRahman AbdulRazaq of Kwara State has described the late Emir of Lafiagi, Alhaji Saadu Haliru as an advocate of peace and unity in diversity.\nIn a condolence message to the people of Lafiagi Emirate over the death of Haliru, AbdulRazaq described the reign of the late emir as peaceful and hugely significant for the socioeconomic status of the emerging industrial town.\n“I join the rest of our people, north, south, and central of Kwara, to mourn the long-reigning Emir of Lafiagi.\n“He was an advocate of peace and unity in diversity, and this largely explains the growth recorded under his reign.\n“I beseech Allah, the oft-forgiving and the Merciful, to grant the late monarch al-Jannah Firdaus and to comfort the people of Lafiagi,” he said."
  },
  {
    "headline": "AIB presents report on eight air mishaps",
    "summarized_story": "By Dirisu Yakubu & Fortune EromoseleThe Nigeria Accident Investigation Bureau, AIB, has released a report on eight airplane accidents in the country, detailing casual factors, contributory factors, and safety recommendations.\nSome of the reports given were “Report on the serious incident involving a B737-500 aircraft operated by Air Peace Limited with nationality and registration marks 5N-BRN, which occurred at Port Harcourt Airport, Omagwa, Rivers State On 22nd June 2019.\n“At 18:48 h, during cruise at Flight Level 280, N497AG established contact with Lagos and Port Harcourt ATC units.\nAt 18:55 h, the aircraft was released by Lagos to continue with Port Harcourt.\nPort Harcourt then cleared N497AG to descend FL210."
  },
  {
    "headline": "AIB presents report on eight air mishaps",
    "summarized_story": "By Dirisu Yakubu & Fortune EromoseleThe Nigeria Accident Investigation Bureau, AIB, has released a report on eight air plane accidents in the country, detailing casual factors, contributory factors and safety recommendations.\nHe however, enjoined the general public to check details of the report and more at the Bureau’s website www.aib.gov.ng.\n“At 18:48 h, during cruise at Flight Level 280, N497AG established contact with Lagos and Port Harcourt ATC units.\nAt 18:55 h, the aircraft was released by Lagos to continue with Port Harcourt.\nPort Harcourt then cleared N497AG to descend FL210."
  },
  {
    "headline": "BREAKING: ECOWAS court awards N30m against FG for ill-treating, torturing Agba Jalingo",
    "summarized_story": "ECOWAS court has awarded N30m against the Buhari administration for ill-treating and torturing journalist Agba Jalingo in Cross River state.\nThe judgment was delivered today following a suit brought by SERAP on Jalingo’s behalf.\nDetails later…"
  },
  {
    "headline": "NDLEA arrests 90-year-old, teenagers for selling drugs in Katsina, Ondo",
    "summarized_story": "By: Kingsley Omonobi – AbujaA 90-year-old man, Yusuf Yarkadir has been arrested by operatives of the National Drug Law Enforcement Agency, NDLEA, for selling drugs to the youths in his Yarkadir village in Rimi Local Government Area of Katsina State.\nIn the same vein, narcotic officers in the Ondo state command of the Agency according to the thedailynewsngr.com have arrested two teenage siblings along with other suspects for dealing in assorted illicit drugs in the state capital.\nA lady Maryam Musa, 35, was also arrested in Igbara-Oke, Ifedore local council area of the state with 5.5kilograms of cannabis, all same day.\nSimilarly, in Ondo state, following credible intelligence and surveillance, NDLEA operatives on Wednesday 7th July stormed the Ogbese market, in Akure North LGA, where Messrs Jalamia Ochonogor and Austin Uzoka were arrested with 63kilograms of cannabis.\nElsewhere in Bauchi state, at least seven persons have been arrested and 28.091kilograms of assorted drugs such as Diazepam, Exol-5, Rophynol, Tramadol, Codeine, and cannabis recovered from them."
  },
  {
    "headline": "Politicians of conscience should rise to save Nigeria now — Prophet Alao, C&S leader",
    "summarized_story": "By Adesina WahabThe Supreme Head, Cherubim & Seraphim Unification Church of Nigeria, His Eminence, Prophet Solomon Adegboyega Alao, has called on politicians with conscience and unquestionable integrity to come together and save Nigeria from disintegration.\nProphet Alao berated the government for arresting leaders of agitation for secession of Nigeria, noting that dialogue and improvement on the welfare of the citizens and good governance would end all agitations.\nProphet Alao also expressed displeasure at the defection of some governors from the opposition parties to the ruling APC, saying that their motives were not to deepen democracy but to escape justice after their tenure.\nHe told thedailynewsngr.com that It was sacrilegious for security agents to storm a church and arrest people because of their anti-Buhari posture.\n“I am not making case for them but I am concerned that they did not respect a sanctuary of God."
  },
  {
    "headline": "BREAKING: Bandits raid five communities in Zamfara, allegedly kill 42 residents",
    "summarized_story": "No fewer than four Forty-two persons have been killed as armed bandits invade communities in Maradun Local Government Area of Zamfara State.\nDAILY POST gathered that the incident occurred on Thursday night in an operation that lasted through to Friday morning.\nWhen contacted by DAILY POST, the state’s Police Public Relations Officer, PPRO, Mohammed Shehu confirmed the incident.\nAccording to him, the number of deaths cannot be ascertained at the moment“There was an attack but the death is not fourtytwo as the media is saying.\nJust give me ten minutes”, he stated."
  },
  {
    "headline": "Finance ministry should be renamed as foreign loans, debt accumulation ministry – HURIWA tells Buhari",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has called on President Muhammadu Buhari to change the name of the Ministry of Finance, Budget and National Planning to “Ministry of Foreign Loans Collection.”HURIWA made the call while lamenting the continuous loan applications by the ministry.\nThe frontline rights group, in a statement by its National Coordinator, Emmanuel Onwubiko said: “Vexed by the unrelenting applications by the Federal Ministry of Finance and Budget for foreign loans since the assumption of office of the President Muhammadu Buhari’s government in 2015, a call has gone to the President to rename the ministry of finance and Budget to Ministry for foreign loans collection.\n“We honestly think that the President should table before his weak Federal Executive Council the proposal for a change of name of the Federal Ministry of Finance, Budget and National planning to the Federal Ministry for Foreign Loans and Debts accumulation.\nHURIWA also dismissed as puerile and distasteful, the opinion credited to the Senate President, Ahmed Lawan for saying that Nigeria will continue to apply for foreign loans because the nation is poor.\nNigeria has high respect for China – Buhari"
  },
  {
    "headline": "How TB Joshua paid electricity bills of four local govts in Ondo",
    "summarized_story": "The Governor of Ondo State, Rotimi Akeredolu, on Friday disclosed some of the works late Prophet Temitope Balogun Joshua also known as TB Joshua did in the state.\nAkeredolu disclosed that TB Joshua aided the state in restoring electricity to some parts of Ondo State.\nThe governor recounted how the late founder of Synagogue Church of All Nation, SCOAN, paid the electricity bills and bought transformers for four local governments in the state.\nAkeredolu spoke during the internment service of TB Joshua at SCOAN in Lagos State.\nThe Senior Pastor of Christian Life Church, Jackson Senyonga had described TB Joshua as the “biggest witch in Africa.”Also, the Senior pastor of Divine Mercy Church, Olatobiloba Peters has revealed that Joshua was in hellfire"
  },
  {
    "headline": "T.B Joshua gave me, my wife money after I won election",
    "summarized_story": "The Governor of Ondo State, Rotimi Akeredu, has revealed what the Late Prophet T.B Joshua did for him when he won his first election to be Governor of Ondo State.\nThe Ondo Governor spoke during the funeral service of Prophet T,B Joshua at the Synagogue Church of All Nations, SCOAN, on Friday.\n“When I won election to be governor of Ondo State, T.B Joshua drove to Ondo State to wish me well and when he was leaving, he put money in my pocket and said, ‘as a governor, you’ll need money to entertain people.\n“He also gave me money to give to my wife.\nI must testify openly to what T.B Joshua did for me.”T.B Joshua: Profile of popular Nigerian prophet, controversies that surrounded his ministry"
  },
  {
    "headline": "NLC wants NNPC shares sold to Nigerians",
    "summarized_story": "The Nigeria Labour Congress, NLC, has opined that the Nigeria National Petroleum Corporation, NNPC, should be transformed into a public liability company where every Nigerian can own shares.\nThe NLC President, Comrade Ayuba Wabba who made this known during an interview with newsmen, urged the National Assembly to effectively see to the transformation of NNPC into a Public Liability Company.\n”We would like to draw the attention of the National Assembly to the need to handle with utmost care the very sensitive issue of splitting the Nigeria National Petroleum Corporation (NNPC).\n”Therefore, we urge the National Assembly during its conference to effectively see to the transformation of the Nigeria National Petroleum Corporation into a Public Liability Company.\n“This would project the democratic appeal of the PIB as a legal instrument that caters for the masses of Nigeria."
  },
  {
    "headline": "PHOTOS: Crowd, tight security as TB Joshua is laid to rest",
    "summarized_story": "Many studies have established that at least 1 out of 4 couples today struggle with one infertility problem or another,..."
  },
  {
    "headline": "Adekunle Gold releases new single, ‘Sinner’ ft Lucky Daye",
    "summarized_story": "By Ekaete BasseyAfrobeats singer and songwriter, Adekunle Gold has released a spanking new single titled “Sinner.”The record, “Sinner” features American singer, Lucky Daye who did justice to the instrumental.\nADVERTISEMENTThe “Jore” crooner talks about sin, as the cover of the record depicts a sinful display.\nIt displays Adekunle Gold with his sweetheart and singer wife, Simi locked in a tight embrace in a pool.\nProduced by Blaize Beatz, “Sinner” serves as AG Baby’s first official single 2021, following release of his previous single, “It Is What It Is” produced by Kali."
  },
  {
    "headline": "FG to establish Aerospace University to boost Aviation sector",
    "summarized_story": "Agency ReporterThe Federal Government will soon establish an Aerospace University to address the challenges of qualified and specialized manpower in the nation’s aviation sector.\n“So, civil aviation alone can actually run an economy, it depends on how you do it.\n“But we have seen that we are not producing anything out of civil aviation and all the aviation ventures in the country keep collapsing and that has compounded the problem.\n“So we are going to establish the institution in partnership with the International Civil Aviation Organization (ICAO), other friendly countries and some universities around the world.\nSo, what we are doing is first and foremost, to develop the infrastructure that will make civil aviation function."
  },
  {
    "headline": "NDLEA arrests 90-year-old, teenagers arrested for selling drugs in Katsina, Ondo",
    "summarized_story": "By Nicholas Kalu, AbujaA 90-year-old, Yusuf Yarkadir, has been arrested by operatives of the National Drug Law Enforcement Agency (NDLEA) for allegedly selling drugs to youths in Yarkadir village in Rimi Local Government Area of Katsina State.\nDirector, Media & Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi, made this known in a statement on Friday.\nBabafemi said narcotic officers in the Ondo state command of the Agency have also arrested two teenage siblings along with other suspects for dealing in assorted illicit drugs in the state capital, Akure.\nADVERTISEMENT“Elsewhere in Bauchi state, at least seven persons have been arrested and 28.091kilograms of assorted drugs such as Diazepam, Exol-5, Rophynol, Tramadol, Codeine, and cannabis recovered from them.\n“Meanwhile, different quantities of illicit drugs going to the United States, the United Kingdom and New Zealand have been intercepted and seized by narcotic officers of the Directorate of Operations and General Investigations, DOGI, attached to some courier companies in Lagos."
  },
  {
    "headline": "Business boom as Prophet TB Joshua laid to rest",
    "summarized_story": "By Job OsazuwaAt the moment, many people are making brisk business outside the premises of Synagogue Church of All Nations (SCOAN), and being patronised by thousands of worshipers and visitors.\nThe founder of the church, Prophet TB Joshua, who died June 5, is being buried today at his church in Ikotun area of Lagos.\nThe stretch of the median of Ikotun Egbe Street, where the church is located, was decorated with assorted materials engraved with the prophet’s picture.\nThere were hats of different sizes, identity cards, T- shirts, wrist bands, fez caps, key holders in large quantities.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "NCDC confirms Delta variant of COVID-19 now in Nigeria",
    "summarized_story": "From Juliana Taiwo-Obalonye and Fred Eze, AbujaThe Nigeria Center for Disease Control (NCDC) has confirmed detection of SARS-CoV-2 Delta variant, also known as lineage B.1.617.2 in the country.\nThe NCDC Director-General, Dr Chikwe Ihekweazu confirmed this Thursday evening, warning that given the high transmissibility of the Delta variant and following its detection in Nigeria, to ensure strict adherence to public health and social measures in place.\nThe Delta variant which has been detected in over 90 countries is recognised by the World Health Organization (WHO) as a variant of concern, given its increased transmissibility.\nAll data on variants from Nigeria have been published on GISAID, a global mechanism for sharing sequencing data.\nGiven the global risk of spread of the Delta variant, positive samples from international travelers to Nigeria are sequenced regularly,” he explained."
  },
  {
    "headline": "Nigeria democracy at risk –British govt warns",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaBritish Government has raised the alarm that the rising conflicts could destabilise Nigeria’s democracy in the run-up to the 2023 elections.\nThey both spoke at the launch of the Nigeria Governors’ Forum (NGF) Peace and Inclusive Security Initiative (PISI) in Abuja, yesterday.\n“The UK is engaged in supporting Nigeria to reduce violent conflict in a number of areas.\nHe said poverty was not the cause of violence in Nigeria, arguing that China has about 300 million unemployed.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Airlines’ owe FG agencies N37bn –Sirika",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaMinister of Aviation, Hadi Sirika, has disclosed that Nigerian airlines are owing federal agencies to the tune of N37 billion.\nThe Minister, however, vowed that the government would go after the airlines to make sure that they pay what they owe.\nSirika, who addressed the controversy over the disbursement of the N5 billion COVID-19 palliative to aviation stakeholders, said the point was made that airlines owing aviation parastatals should not benefit.\nI know they’re owing us about, N13 billion or N14 billion.\n“If you’re owing government, you are owing FAAN, the Bi-Courtney is owing about N14 billion as at the last count."
  },
  {
    "headline": "Nude video: Ohakim knows fate Sept 27",
    "summarized_story": "Ohakim is facing trial before the court alongside Chinedu Okpareke, over an allegation that he threatened to release a nude photograph of a nominal complainant, Mrs. Chinyere Amuchienwa.\nMeanwhile, there was a dramatic twist in the case as the police, yesterday, arrested Amuchinwa.\nWhen the matter resumed, yesterday, counsel to the respective parties adopted their written submissions for and against the request by the AGF to take over the case.\nWhile the lawyer from the office of the AGF, Bagudu, urged the court to grant the application, the prosecution counsel, Faith Dimka, and the defence counsel urged the court to refuse the application.\nJustice Taiwo, thereafter, adjourned the matter to September 27 for ruling."
  },
  {
    "headline": "Oba of Benin, Obaseki Set for Showdown over Looted Artefacts",
    "summarized_story": "However, Obaseki told THISDAY that he was working on a tripartite arrangement, involving the federal and state governments, the Oba of Benin and a private trust that would manage the artefacts on behalf of the palace and the people.\nHis plan, it is gathered, is to have the private trust build a museum of West African Arts in Benin, the state capital, where the artefacts would be kept and curated.\nLegacy Restoration Trust, a private entity, THISDAY learnt, has since emerged, parading itself as the authorised custodian of the artefacts.\n“That they are known as Benin Bronzes is already a confirmation of their source of origin (which is Benin),” Mohammed said.\nHe thanked Germany for taking the leadin the global efforts to repatriate all artefacts looted from Nigeria and the African continent."
  },
  {
    "headline": "Customs Collect N1tn Revenue in Six Months",
    "summarized_story": "James Emejo in AbujaThe Nigeria Customs Service (NCS) yesterday said it collected over N1 trillion between January and June 2021 as revenue for the federation.\nThe Customs Public Relations Officer (PRO), Mr. Joseph Attah, while addressing journalists in Abuja, said: “Hitting the trillion-naira mark within six months is unprecedented in the service”.\nHe stated that the agency will always be willing to break its records and to generate more revenue above the target under a favourable environment.\nOn its enforcement duties, Attah said the agency seized a total number of 2,333 assorted items, with duty paid value of N4.42 billion.\nHe said given the level of compliance, the deadline for the verification process had been further extended by 14 day."
  },
  {
    "headline": "FIRS Engages Banks to Recover N1.82tn from MultiChoice",
    "summarized_story": "*We are discussing with tax authorities, says companyJames Emejo in AbujaThe Federal Inland Revenue Service (FIRS) has commissioned some banks to recover N1.82 trillion from the accounts of MultiChoice Nigeria Limited (MCN) and MultiChoice Africa (MCA).\nBut in a swift response, MultiChoice Nigeria said it had the media statements made by the FIRS, but had not received any notification from the agency.\n“MultiChoice Nigeria respects and is comfortable that it complies with the tax laws of Nigeria.\nHe accused MultiChoice Nigeria of avoiding to give the FIRS accurate information on the number of its subscribers and income.\nNami said: “The level of non-compliance by MultiChoice Africa (MCA), the parent company of MultiChoice Nigeria (MCN) is very alarming."
  },
  {
    "headline": "Abdulsalami: Insecurity Has Set Education in the North Backward By 20years",
    "summarized_story": "….Buhari expresses sadness over killings in AdamawaDeji Elumoye in Abuja and Laleye Dipo in MinnaA former military Head of State General Abdulsalami Abubakar (rtd) has said that insecurity has set education in the northern part of the country backward by 20 years.\nThe former head of state noted that many children of school age can no longer go to school while those in schools are being kidnapped.\n“Insecurity has taken education in the north back 20 years.\nforgetting that they too have children“Will they be happy if their children are kidnapped and traumatised?” Abdulsalami queried.\nAbdulsalami also blamed the poor economic situation in the country on the effect of the COVID-19."
  },
  {
    "headline": "Nigeria Confirms First Case of Covid’s Delta Variant",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe Nigeria Centre for Disease Control (NCDC) has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2 in Nigeria.\n“Given the global risk of spread of the Delta variant, positive samples from international travelers to Nigeria are sequenced regularly,” it said.\nIt added, “Proven public health and social measures such as physical distancing, frequenthandwashing, and proper use of face masks, prevent infections and save lives.\nThe Delta variant is recognised by the World Health Organization (WHO) as a variant ofconcern, given its increased transmissibility.\nIt is veryimportant that this is strictly adhered to, to prevent a surge in COVID-19 cases in Nigeria."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "2023: How Buhari Undermined Tinubu Again, Continued To Weaken His Influence In All Progressives Congress Party",
    "summarized_story": "SaharaReporters gathered that the reluctance to announce national convention and choose national executives was to weaken the power and influence of Asiwaju in pushing for his candidates who would then begin more mobilisation for his yet-to-be-announced 2023 presidential ambition.\nThe development is already polarizing further the Buhari camp and the Tinubu camp in the APC, while other smaller camps have to take a stand between Buhari and Tinubu in the silent struggle.\n“The indefinite tenure exten­sion granted to the Caretaker/Extraordinary Convention Planning Committee of the APC is not going down well with us.\n“The president ap­proved the timetable for APC ward, local government and state congresses.\nWard con­gresses will hold 24th July, 2021 followed by local govern­ment congresses on 14th Au­gust, 2021 and state congresses on 18th September, 2021."
  },
  {
    "headline": "2023: How Buhari Undermined Tinubu Again, Continued To Weaken His Influence In All Progressives Congress Party",
    "summarized_story": "SaharaReporters gathered that the reluctance to announce national convention and choose national executives was to weaken the power and influence of Asiwaju in pushing for his candidates who would then begin more mobilisation for his yet-to-be-announced 2023 presidential ambition.\nThe development is already polarizing further the Buhari camp and the Tinubu camp in the APC, while other smaller camps have to take a stand between Buhari and Tinubu in the silent struggle.\n“The indefinite tenure exten­sion granted to the Caretaker/Extraordinary Convention Planning Committee of the APC is not going down well with us.\n“The president ap­proved the timetable for APC ward, local government and state congresses.\nWard con­gresses will hold 24th July, 2021 followed by local govern­ment congresses on 14th Au­gust, 2021 and state congresses on 18th September, 2021."
  },
  {
    "headline": "BREAKING: ECOWAS Court Awards N30Million Against Buhari Regime Over Torturing Of Journalist, Agba Jalingo",
    "summarized_story": "ECOWAS court in Abuja has awarded N30 million against the President Muhammadu Buhari-led administration for its treatment of journalist, Agba Jalingo.\nThe judgment was delivered on Friday following a suit filed by the Socio-Economic Rights and Accountability Project (SERAP), on behalf of Jalingo.\nFile PhotoJalingo is still facing four counts of treasonable felony, terrorism, cultism and attempt to overthrow the Governor Ben Ayade of Cross River and President Buhari.\nHowever, he was arrested by the police outside Cross River State four days before the scheduled date.\nHe was arrested in Lagos, blindfolded, tortured and taken to Cross River State by road where he was handcuffed to a refrigerator."
  },
  {
    "headline": "Know The Law: You could be fined N50k for giving alcohol to a police officer on duty",
    "summarized_story": "There have been several reports of police officers on duty acting against the tenets of their profession while under the influence of alcohol.\nAdvertisementMany of the police officers found to be intoxicated while on duty have been sanctioned based on police regulations.\nBut many of the citizens who facilitate the provision of alcohol to police officers are also acting in contrast with the law.\nAdvertisementIt is unlawful for a police officer to take alcohol and psychotropic substances like heroin and cocaine while on duty and if the officer is caught, he or she will be punished in line with the police disciplinary procedures.\nThe same punishment is stated for anyone one who gives spirits, liquors, psychotropic substances or stimulants to police officers to get them to “commit a breach of duty”."
  },
  {
    "headline": "Know The Law: You could be fined N50k for giving alcohol to a police officer on duty",
    "summarized_story": "There have been several reports of police officers on duty acting against the tenets of their profession while under the influence of alcohol.\nAdvertisementMany of the police officers found to be intoxicated while on duty have been sanctioned based on police regulations.\nBut many of the citizens who facilitate the provision of alcohol to police officers are also acting in contrast with the law.\nAdvertisementIt is unlawful for a police officer to take alcohol and psychotropic substances like heroin and cocaine while on duty and if the officer is caught, he or she will be punished in line with the police disciplinary procedures.\nThe same punishment is stated for anyone one who gives spirits, liquors, psychotropic substances or stimulants to police officers to get them to “commit a breach of duty”."
  },
  {
    "headline": "Abducted students, staff of Kaduna poly regain freedom -- after 28 days in captivity",
    "summarized_story": "Six students and two members of staff of Nuhu Bamalli Polytechnic, Zaria, Kaduna state, who were kidnapped by gunmen, have been released after 28 days in captivity.\nTheCable had reported how gunmen on June 11 invaded the main campus better known as “UPE” and kidnapped six students and staff.\nAdvertisementThe campus is located along an expressway just at the entrance of Zaria and it is less than 45 minutes’ drive to Kaduna metropolis.\nThe TV station quoted Abdullahi Shehu, public relations of the polytechnic, as saying the students and staff regained their freedom after negotiating a ransom.\nAdvertisementKaduna has recorded a spike in the abduction of residents in recent times."
  },
  {
    "headline": "Abducted students, staff of Kaduna poly regain freedom -- after 28 days in captivity",
    "summarized_story": "Six students and two members of staff of Nuhu Bamalli Polytechnic, Zaria, Kaduna state, who were kidnapped by gunmen, have been released after 28 days in captivity.\nTheCable had reported how gunmen on June 11 invaded the main campus better known as “UPE” and kidnapped six students and staff.\nAdvertisementThe campus is located along an expressway just at the entrance of Zaria and it is less than 45 minutes’ drive to Kaduna metropolis.\nThe TV station quoted Abdullahi Shehu, public relations of the polytechnic, as saying the students and staff regained their freedom after negotiating a ransom.\nAdvertisementKaduna has recorded a spike in the abduction of residents in recent times."
  },
  {
    "headline": "FACT CHECK: Seun Kuti claims there’s fuel tanker explosion every week in Nigeria; is this true?",
    "summarized_story": "On June 27, Seun Kuti, Afrobeat singer and son of the late music legend Fela Kuti, said Nigeria has witnessed at least one fuel tanker explosion every week in 2021.\nLet me just use the tanker explosions as an instance of how the press and professionals of Nigeria continue to fail the people.\nTheCable analysed media reports of fuel tanker explosions in Nigeria since the year began.\nJune 22 – Six tankers, five trucks, and two cars were destroyed in a fuel tanker explosion at Romona trailer park, Ogere axis of Lagos-Ibadan expressway.\nVERDICT: Kuti’s claim that fuel tanker explosions have occurred every week in 2021 is misleading."
  },
  {
    "headline": "Overworked staff, mass exits: The inside story of GTBank’s mobile app and USSD transaction failures",
    "summarized_story": "His orange branded Guaranty Trust Bank (GTB) app had not launched as he tried severally to make a transfer from his current account to the empty savings account linked to the debit card on his Uber app.\nI have not been able to access my GT Mobile App for days now.\nJust ask any GTB customer.\nIts mobile app also has over a million downloads on the Google play store alone.\nThe App development team is almost half of what it was at the beginning of the year."
  },
  {
    "headline": "Peter Njonjo wants to change the way food moves in Africa",
    "summarized_story": "Peter Njonjo started his first business in high school.\nHis name is Peter Njonjo and this is his life in tech.\nHe chose to attend the United States International University Africa (USIUA), a private university in Nairobi.\nThree years later, he would be in charge of Coca-Cola’s operations in six countries across East Africa: Kenya, Uganda, Tanzania, Ethiopia, Eritrea, and Mozambique.\nI’m the firstborn of four children.”That is how Peter Njonjo starts his story on our call."
  },
  {
    "headline": "MultiChoice’s bank accounts blocked in Nigeria over alleged ₦1.8 trillion tax fraud",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) on Thursday said it has directed commercial banks to freeze the accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA), in an attempt to recover ₦1.8 trillion in taxes from the companies.\nMultiChoice Group is a South African entertainment giant and owner of the popular DStv and GOtv services.\nParticularly, [MultiChoice Nigeria Limited] has avoided giving the FIRS accurate information on the number of its subscribers and income,” he said.\nAccording to the FIRS chair, Nigeria contributed 34% of total revenue for the group and the bulk of revenue for MultiChoice Africa.\nMultiChoice is the latest South African firm involved in a huge tax scandal in Nigeria."
  },
  {
    "headline": "Nigeria’s Daystar Power secures $20 million from IFC",
    "summarized_story": "Daystar Power, a provider of hybrid solar power solutions to businesses in West Africa, has secured a facility of $20 million from the International Finance Corporation (IFC) to fund its project pipeline in Nigeria.\nFounded in 2017 by Sunrah Ventures, Daystar Power is an off-grid power service provider whose solutions, “Solar-as-a-Service” and “Power-as-a-Service” provide clean and reliable power while significantly reducing overall power costs for clients.\nDaystar Power will receive a $10 million local currency loan from IFC, which will be provided to its Nigerian subsidiary, Daybreak Power Solutions.\nDaystar Power is working with the Canadian-funded IFC program, Energy2Equal, to close gender gaps and increase women’s participation in the renewable energy sector.\nDaystar Power has 29 megawatts (MW) of installed solar power capacity to date."
  },
  {
    "headline": "Nigeria’s crazy petrol consumption in five charts",
    "summarized_story": "An exclusive industry data seen by BusinessDay has explained why Nigeria’s curious petrol consumption has kept the country in a bleeding state, a pain point for a government struggling with one of the worst macroeconomic environments in its recent history.\nGlobally, energy consumption, most especially petrol, is an important indicator of the level of economic…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Explainer: Who is the NNPC frontier exploration fund for?",
    "summarized_story": "Explainer: Who is the NNPC frontier exploration fund for?\nAfter lawmakers passed the Petroleum Industry Bill (PIB), many Nigerians have expressed outrage at the provision in Part III, clause 9(4) relating to the creation of a Frontier Exploration Fund (FEF).\nThe FEF comprises 10 percent of rents on petroleum prospecting licences, 10 percent rent on petroleum mining leases, and 30 percent of NNPC Limited’s…"
  },
  {
    "headline": "3 Nigerian startups make Y Combinator’s S21 batch",
    "summarized_story": "One Autotech startup, a mom-and-pop company, and one fintech company are three of the successful Nigerian firms to be selected in the Y Combinator S21 batch accelerator program.\nMecho Autotech, which connects car users with mechanics and smart part vendors; Supplies, a B2B marketplace for mom and pop stores, and Lemonade Finance, a multi-currency payments…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "International Passport New Regime 2021 – Nigerian Observer",
    "summarized_story": "There is a new passport regime that is driven by technology.\nAregbesola has predicted that technology would play a major role in the future of the issuance of passport.\nAregbesola is considering the benefit from online passport application roll out.\nThe new date for the beginning of the new Passport Regime is now June 8.\nHowever, before the beginning of the new passport processing regime, a promise was made to Nigerians to clear all passport backlog."
  },
  {
    "headline": "Obaseki congratulates Okowa on 62nd birthday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated his Delta State counterpart, Dr. Ifeanyi Okowa, on his 62nd birthday.\nThe governor, in a statement, said, “I celebrate with you, my friend and brother, Dr. Ifeanyi Okowa, as you add another year today.\n“I wish you many more years of impactful service to the people of Delta State and Nigeria.”Governor Obaseki lauded Okowa for his far-reaching reforms and programmes undertaken in Delta State since his foray into public service, noting that his contribution to the development of the state was phenomenal."
  },
  {
    "headline": "Obaseki pledges improved collaboration with security agencies to enhance security on Benin-Auchi Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reassured that the government will sustain collaboration with the military, the Nigeria Police Force, members of the Edo State Community Vigilante Security Network and other security outfits in the state to tackle insecurity on the Benin-Auchi Expressway.\nThe governor gave the assurance when he received Student Union Government (SUG) leadership of the Ambrose Alli University, on a courtesy visit at the Government House in Benin City.\nOsaigbovo Iyoha, reaffirmed the government’s commitment to the security of lives and property of Edo citizens, noting that measures had been put in place to enhance security in the axis and other parts of the state.\nAccording to him, “the issue of insecurity on the highway is not peculiar to Edo State alone.\nOsamagbe Eghobamien, decried the level of insecurity on the Benin-Auchi Road, urging the government to expedite actions to ensure the safety of road users on the axis."
  },
  {
    "headline": "Edo govt restates citizens’ role in realisation of ‘MEGA’ agenda, urges participation in governance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has called for increased citizens’ participation in governance and decision making, urging for the support of all Edo people in the realization of the Governor Godwin Obaseki-led administration’s Making Edo Great Again (MEGA) Agenda.\nChief of Staff to the Governor, Hon.\nOsaigbovo Iyoha, gave the charge when he received the executives and members of the Immaculate Conception College Old Boys Association (ICCOBA), at the Government House, Benin City.\nIyoha, who is an alumnus of the Immaculate Conception College, noted, “We are proud of our heritage and where we come from.\nAt every opportunity, we will try and galvanize our people to make sure they participate in whatever the government is doing."
  },
  {
    "headline": "OBITUARY: The controversial life of Africa’s most influential preacher, T.B. Joshua",
    "summarized_story": "Desolate about his future, T.B Joshua switched to his first love- religion.\nThe use of white garments, in the early days, in the early days of SCOAN was apparent as T.B.\nA former disciple of the prophet, Bisola Johnson, wrote a book – (The T.B Joshua I know – Deception of the Age Unmasked) and granted several interviews where he accused T.B.\nT.B Joshua refused to attend the coroner’s inquest organised by the state government to reveal how the victims died, despite being invited multiple times.\nAfrica’s most influential preacherLike many evangelical preachers, T.B Joshua regularly foretold political events."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "U.S. Army Special Forces Conclude Training With Nigeria Navy Special Boat Service",
    "summarized_story": "Twenty-five officers of the Nigerian Navy Special Boat Service completed a five-week Joint Combined Exchange Training (JCET) alongside a team of U.S. Army Special Forces.\nThe exercise is part of a series of U.S. engagements with the Nigerian military that provide opportunities for Nigerian military and U.S. elite units to work together, learn from each other, and strengthen relationships.\nAccording to her, the JCET is part of a close and continuous military partnership between the United States and Nigeria spanning decades to strengthen defense ties and promote regional security.\nNigeria participates in multiple bilateral and multilateral military exercises with the United States, including African Lion, Flintlock, and Obangame Express.\nThe U.S. and Nigeria cooperate on maritime security, military professionalization including human rights, counterterrorism efforts against Boko Haram and ISIS-West Africa, defense trade, and strengthening governance."
  },
  {
    "headline": "Eight contestants seek viewers votes as FirstBank-sponsored The Voice Nigeria season 3 enters live shows",
    "summarized_story": "By Bolaji IsraelWith an electrifying mix of pulsating musical performances, music training, glamorous fashion and life enriching entertainment, the The Voice Nigeria 3 continues to dazzle to the very grand finale.\nThe fate of eight amazing music talents now lies with the viewers votes for a chance to fight for the grand prize as the world acclaimed music talents reality series, the Voice Nigeria 3 sponsored by FirstBank, Baba Ijebu and Airtel entered the much awaited Live Shows stage in Nigeria.\nAll four saved talents are now in need of a second chance as they are part of the eight that needs viewers votes again.\nAt the end, Naomi was saved by Falz, leaving Dapo and returnee Tamara to the viewers votes.\nWith an electrifying mix of pulsating musical performances, music training, glamorous fashion and life enriching entertainment, the The Voice Nigeria 3 continues to dazzle to the very grand finale."
  },
  {
    "headline": "Globacom Announces Commencement of Pre-paid Roaming, 4G Services in China",
    "summarized_story": "Leading telecommunications service provider, Globacom, has commenced pre-paid roaming, data roaming and 4G LTE services in China and the United Arab Emirates (UAE).\nIt noted that the expansion of its roaming service to prepaid customers in China and UAE is a part of efforts to continuously enrich the experience of subscribers to its network.\nFollowing this announcement, Glo customers visiting China and UAE will have unhindered access to super-fast 4G LTE and pre-paid roaming, in addition to all postpaid services which had been launched by Globacom many years ago.\nChina and United Arab Emirates, therefore, join other countries where Glo customers can enjoy its prepaid and postpaid services.\nOthers are Mongolia, Myanmar, Maldives, Philippines, Syria, Taiwan, Tajikistan and Vietnam also form the list of countries where Glo postpaid services are also available."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Again, protesting youths block highway as bandits abduct 14 in Kaduna",
    "summarized_story": "It was gathered that the bandits later released two nursing mothers and two hypertensive elderly patients when they noticed their conditions.\n“The nursing mothers were released because they took away their husbands.\nThe bandits released them to take care of their babies,” a resident said.\nAccording to her, the bandits who were in large numbers went away with her husband and five others within their vicinity.\nShe said, “They( bandits) came at 10pm."
  },
  {
    "headline": "Again, protesting youths block highway as bandits abduct 14 in Kaduna",
    "summarized_story": "It was gathered that the bandits later released two nursing mothers and two hypertensive elderly patients when they noticed their conditions.\n“The nursing mothers were released because they took away their husbands.\nThe bandits released them to take care of their babies,” a resident said.\nAccording to her, the bandits who were in large numbers went away with her husband and five others within their vicinity.\nShe said, “They( bandits) came at 10pm."
  },
  {
    "headline": "Five-year-old boy killed, scores escape as 3-storey building collapses in Lagos",
    "summarized_story": "Tragedy struck on Thursday when a 5-year-old boy died and scores narrowly escaped death following the partial collapse of a distressed three-storey building in Adeniji Adele axis of Lagos State.\nOther occupants at the time of the incident sustained different degrees of injuries and have been taken to the hospital for treatment.\n“Situation report had it that upon arrival at the scene, a room beam partially collapsed on a five-year-old boy, at the aforementioned address.\n“Unfortunately, a small boy lost his life to the incident scene”.\nAside from LASEMA, Lagos State Building Control Agency, LABSCA and the Lagos State Safety Commission were also present at the scene to conduct a proper assessment of the affected building."
  },
  {
    "headline": "Five-year-old boy killed, scores escape as 3-storey building collapses in Lagos",
    "summarized_story": "Tragedy struck on Thursday when a 5-year-old boy died and scores narrowly escaped death following the partial collapse of a distressed three-storey building in Adeniji Adele axis of Lagos State.\nOther occupants at the time of the incident sustained different degrees of injuries and have been taken to the hospital for treatment.\n“Situation report had it that upon arrival at the scene, a room beam partially collapsed on a five-year-old boy, at the aforementioned address.\n“Unfortunately, a small boy lost his life to the incident scene”.\nAside from LASEMA, Lagos State Building Control Agency, LABSCA and the Lagos State Safety Commission were also present at the scene to conduct a proper assessment of the affected building."
  },
  {
    "headline": "Aircraft crash report that killed Athahiru, others ready in one week – AIB",
    "summarized_story": "By Gabriel AgbejaCommissioner of Accident Investigation Bureau (AIB) Akin Olateru on Thursday in Abuja said the preliminary report on the recent Nigerian Air Force (NAF) aircraft crash in Kaduna would be ready in a week.\n“Unfortunately, I can’t speak for the military, we don’t have mandate to report outcome of accident or incidence relating to NAF aircraft.\n“Report on the serious incident involving HS-125- 700A aircraft operated by Associated Aviation Limited with nationality and registration marks 5N-BEX, which occurred at Benin Airport, Edo state, Nigeria on May 10, 2011.\nThe commissioner said there was also a report on the serious incident involving an Airbus 330-343 aircraft owned and operated by Turkish Airline Inc. with nationality and registration marks TC-LOL.\nHe said there was a report on the serious incident Boeing 737-300 aircraft owned and operated by Air Peace Limited with nationality and registration mark 5N-BUK."
  },
  {
    "headline": "90-year-old man Yarkadir busted for selling drugs to youths",
    "summarized_story": "Officials of the National Drug Law Enforcement Agency, NDLEA, have arrested a 90-year-old man, Yusuf Yarkadir for selling drugs to the youths in his Yarkadir village in Rimi Local Government Area of Katsina state.\nFull of regrets under interrogation, the nonagenarian confessed he has been selling cannabis sativa to the youths in his community for eight years due to their demand for the illegal substance.\nIn the same vein, narcotic officers in the Ondo state command of the Agency have arrested two teenage siblings along with other suspects for dealing in assorted illicit drugs in the state capital.\nElsewhere in Bauchi state, at least seven persons have been arrested and 28.091kilograms of assorted drugs such as Diazepam, Exol-5, Rophynol, Tramadol, Codeine, and cannabis recovered from them.\nThose arrested in two separate raids by operatives of the Bauchi state command of the Agency Include: Sunday Obi, Abba Abdullahi, Samuel John, Chijioke Agu, Sani Musa, Alhaji Alhaji Baffa, and Abubakar Saidu."
  },
  {
    "headline": "COVID-19 cases rising again in Nigeria, with 146 new cases",
    "summarized_story": "By Kazeem UgbodagaCOVID-19 cases are rising in Nigeria again, with 146 fresh cases confirmed on Thursday by the Nigerian Centre for Disease Control, NCDC.\nThe figures represent a rise from the 110 cases logged in on Wednesday and the 91 cases posted on Tuesday.\nLagos rakes in 74 percent of the fresh cases on Thursday, reporting 110 new cases of the deadly virus.\nLagos’ figures represent a rise from the 88 cases it reported on Wednesday.\nWith the new cases logged in on Thursday, total confirmed COVID-19 cases in Nigeria stands at 168,256 , with 164,415 survivors discharged and 2,122 deaths reported."
  },
  {
    "headline": "BREAKING: 42 Feared Killed As Bandits Attack Zamfara Communities",
    "summarized_story": "On Thursday evening, bandits killed 42 persons in five towns in the Faru sector of Zamfara State’s Maradun Local Government Area.\nMalam Buba Faru, an indigene of the area, said the criminals, who were riding over 100 motorcycles, invaded the hamlet a few kilometers east of Faru town.\nAccording to Buba, the bandits shot indiscriminately at the inhabitants and set fire to their homes and stores.\nIn a phone chat with The PUNCH, Mohammed Shehu, the state Police Command’s spokesperson, revealed that just 35 persons were slain in the five communities.\nShehu added that due to the road network, the police were unable to reach the impacted communities in a timely manner when they were told of the bandits’ attack."
  },
  {
    "headline": "Police Officers Protest Unpaid Allowance After 7 Months Of Deployment In Katsina [Video]",
    "summarized_story": "Men from the Nigerian Police Force’s Counter Terrorism Unit staged a peaceful protest in Katsina State, seeking to meet with Governor Aminu Bello Masari and the Commissioner of Police about their unpaid allowance and reluctance to redeploy for over seven months.\nA police officer, who requested anonymity, informed reporters that they were deployed to Kastina state in January and that the special duty was meant to last three months; nevertheless, it is now the seventh month and they have yet to get any compensation.\nAccording to the policeman, the officers live in various camps scattered throughout the woods.\nWatch video below:"
  },
  {
    "headline": "Group Calls For Facebook Ban In Nigeria (Video)",
    "summarized_story": "In a trending video, an unnamed party has sought for the permanent ban of Facebook in Nigeria.\nThe group filed a case with Nigeria’s Ministry of Justice in Abuja, the country’s Federal Capital Territory.\nAccording to the group’s head, who posted a video on his Facebook page, the request for Facebook’s ban is based on the company’s censoring of posts, restriction of free speech, and limitation of followership, among other things.\nThe organization announced that it would go to the Ministry of Information to substantiate the case and ensure that Facebook is permanently banned in Nigeria.\nThe group’s head claimed that Facebook is a threat to Nigeria’s democracy and that it should not be permitted to operate in the country."
  },
  {
    "headline": "Military Reinforcement Convoy In Terrible Crash In Borno (Video)",
    "summarized_story": "The viral video depicts how some troops who were apparently on a reinforcement assignment in Borno State were killed in a car accident.\nAccording to the footage, the cars transporting the soldiers were seen speeding through the streets while passers-by looked on, but regrettably, some of the vehicles collided and crashed.\nThe effect of the incident was visible in the emotions of onlookers.\nThe man behind the camera could be heard continuously shouting the word “Jesus.”Watch the video below:"
  },
  {
    "headline": "Breaking: After barely one month in bandits’ captivity, kidnapped Nuhu Bamali Polytechnic Kaduna students, staff freed",
    "summarized_story": "Bandits have now released six students and two staff members of Nuhu Bamali Polytechnic Zaria Kaduna State, who were kidnapped last month.\nThey were released on Thursday night at an undisclosed location in Kaduna, according to school official.\nThe Public Relations Officer of the Polytechnic, Abdullahi Shehu, who confirmed the development to said the kidnapped students and staff members regained their freedom after their parents and relatives negotiated with the bandits.\nThe school authorities will receive the students later in the day at a location where they were kept after their release, he added.\nBandits had attacked the polytechnic on June 11, 2021, kidnapping the victims from their hostels and staff quarters."
  },
  {
    "headline": "New COVID-19 variant, Delta, hits Nigeria",
    "summarized_story": "A new COVID-19 variant known as SARS-CoV-2 Delta variant, also known as lineage B.1.617.2 has been discovered in Nigeria, the Nigeria Centre for Disease Control (NCDC) has announced.\nThe NCDC via its Head of Communications, Dr Yahya Disu, on Thursday in a statement said the variant was detected in a traveller to Nigeria, following the routine travel test required of all international travellers and genomic sequencing at the NCDC National Reference Laboratory, Abuja.\nThe deadly Delta variant is recognised by the World Health Organisation (WHO) as a variant of concern, given its increased transmissibility.\nThe variant has been detected in over 90 countries and is expected to spread to more countries, according to the NCDC.\nRelatedNo tags for this post."
  },
  {
    "headline": "CDS Irabor on insurgency fight, others: We can’t use old tools to defeat new threats",
    "summarized_story": "Addressing the gathering, General Irabor said the involvement of military in containing asymmetric security threats in the past few years had highlighted the need to acquire new operational capability for the Armed Forces of Nigeria to deal with emergent threats.\nNigeria is currently contending with a number of asymmetric threats.\nThe most visible of these threats is the terrorism and insurgency by the Boko Haram in the North-East.\nThe source identified the deceased immigration officers as Sani Abubakar, who hailed from Dutse, Jigawa state, and Yusuf Adam, an indigene of Kano state.\nThe outlaws attacked the community at about 11: 30 p.m, killing the Immigration officers at their duty post."
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Kidnapped Nuhu Bamali Polytechnic Students, Staff Members Released",
    "summarized_story": "The six students and two staff members of Nuhu Bamali Polytechnic in Zaria Kaduna State, who were kidnapped by bandits have been released.\nThey were released on Thursday night at an undisclosed location in Kaduna.\nThe Public Relations Officer of the Polytechnic, Abdullahi Shehu, who confirmed the development to Channels TV, said the kidnapped students and staff members regained their freedom after their parents and relatives negotiated with the bandits.\nHe, however, did not say specifically if any ransom was paid or not."
  },
  {
    "headline": "U.S. Army Special Forces Train Nigerian Navy On IEDs",
    "summarized_story": "Twenty-five officers of the Nigerian Navy Special Boat Service on Thursday completed a five-week Joint Combined Exchange Training (JCET) alongside a team of U.S. Army Special Forces.\nThe exercise is part of a series of U.S. engagements with the Nigerian military that provides opportunities for the Nigerian military and U.S. elite units to work together, learn from each other, and strengthen their relationships, the United States Mission in Nigeria said in a statement.\nDuring the training, the American military trainers and the Nigerian Navyspecial operations forces trained together on a broad range of land-based skills and tactics, such as countering improvised explosive devices (IEDs).\n“The United States Mission to Nigeria is a steadfast partner — helping combat maritime crime in the Gulf of Guinea, counter violent extremists in the Northeast, and enforce the rule of law throughout the region,” Heaton said.\nNigeria participates in multiple bilateral and multilateral military exercises with the United States, including African Lion, Flintlock, and Obangame Express."
  },
  {
    "headline": "Pfizer Seeks Authorisation For 3rd COVID-19 Shot As Vaccine Efficacy Drops",
    "summarized_story": "Pfizer and BioNTech announced Thursday they would seek regulatory authorization for a third dose of their COVID-19 vaccine.\nIn addition, the companies expect that a third dose will perform similarly well against the highly transmissible Delta strain, which is quickly becoming globally dominant.\nOut of caution, the companies are also developing a Delta-specific vaccine, the first batch of which has been manufactured at BioNTech’s facility in Mainz, Germany.\nThe companies anticipate the clinical studies will begin in August, subject to regulatory approvals.\n“We are prepared for booster doses if and when the science demonstrates that they are needed.”"
  },
  {
    "headline": "NCDC Confirms Deadly Delta COVID-19 Variant In Nigeria",
    "summarized_story": "Nigeria has confirmed the detection of the Delta COVID-19 variant.\n“The Nigeria Centre for Disease Control (NCDC) has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2,” the health agency said in a statement on Thursday night.\n“The variant has also been linked to a surge in cases in countries where it is the dominant strain in circulation,” the NCDC explained.\n“The surge in cases in countries across the world and Africa is an important reminder of the risk we face,” he said.\nAs of the time of this report, over 160, 000 cases of the disease have been confirmed in Nigeria."
  },
  {
    "headline": "FG, Health Professionals Fail To Reach Consensus On Hazard Allowances",
    "summarized_story": "The Federal Government has failed to reach an agreement with medical doctors and other health professionals on a new hazard allowance for them.\nA meeting of the Presidential Committee on Hazard Allowance (comprising government officials and health professionals) on Thursday night ended without a consensus and was adjourned indefinitely to allow each side to harmonise their demands.\n“We are giving them that same ample opportunity to see if we can give they can meet and harmonise their positions.\nA quantum of money, ₦37.5billion, is what it comes to, so we are trying to within that realm of ₦37.5 billion.\nWe are journeying sine die for the government side to also look at those two positions and see whether we can do a middle-of-the-road.”"
  },
  {
    "headline": "Kinsmen, Akoko indigenes gather to watch TB Joshua’s burial programme",
    "summarized_story": "Kinsmen of the deceased popular televangelist, Pastor Temitope Joshua popularly known as TB Joshua joined the rest of the world to watch his live burial programme at Arigidi- Akoko.\nThey were joined by indigenes of three local government areas in Akoko axis to bid the founder of Synagogue Church of All Nations farewell.\nSchool children, family members, politicians among other dignitaries converged on a viewing centre to watch how the late prophet was buried.\nThey shunned downpour and watched his burial under the canopy.\nAdvertisementThe people also stressed the need for the deceased Prophet to be immortalised."
  },
  {
    "headline": "90-year-old, teenagers arrested for selling drugs in Katsina, Ondo",
    "summarized_story": "A 90-year-old Yusuf Yarkadir has been arrested by operatives of the National Drug Law Enforcement Agency, NDLEA, for selling drugs to the youths in his Yarkadir village in Rimi Local Government Area of Katsina state.\nFull of regrets under interrogation, the nonagenarian confessed he has been selling cannabis sativa to the youths in his community for eight years due to their demand for the illegal substance.\nIn the same vein, narcotic officers in the Ondo state command of the Agency have arrested two teenage siblings along with other suspects for dealing in assorted illicit drugs in the state capital.\nAdvertisementAlso in Ondo state, following credible intelligence and surveillance, NDLEA operatives on Wednesday 7th July stormed the Ogbese market, in Akure North LGA, where Messrs Jalamia Ochonogor and Austin Uzoka were arrested with 63kilograms of cannabis.\nElsewhere in Bauchi state, at least seven persons have been arrested and 28.091kilograms of assorted drugs such as Diazepam, Exol-5, Rophynol, Tramadol, Codeine, and cannabis recovered from them."
  },
  {
    "headline": "School feeding: FG trains enumerators to enroll more pupils in Sokoto State",
    "summarized_story": "The Federal Government has plan to enroll additional primary school pupils between class 1 to 3 into the National Home Grown School Feeding Programme (NHGSFP) in Sokoto State.\nShe saidthe ministry has begun the training of enumerators to obtain accurate population of beneficiaries in order to fast track pupils enrollment aimed at enhance nutritional values of children.\nSpeaking at the event the Sokoto State Programme Officer of NHGSFP, Musa Abubakar-Girkau, commended the Federal Government for the implementation of viable interventions in the state.\nHe said the NHGSFP had improved school enrollment, create employment opportunities and boosts the economic base of the state.\nHe also revealed that about 600, 000 pupils increased enrollment were recorded based on another statistic while some schools are not benefiting from the programme."
  },
  {
    "headline": "Death Toll at Bangladesh Factory Fire Rises Above 50",
    "summarized_story": "Police and witnesses said the fire broke out at Hashem Food and Beverage factory in Rupganj at about 5pm (11:00 GMT) on Thursday.\nPolice initially gave a toll of three dead but it rose dramatically as firefighters reached the upper floors and started bringing out dozens of bodies of trapped workers.\nIt was unclear how many people were trapped inside.\nMohammad Saiful, a factory worker who escaped the fire, said there were dozens of people inside when the blaze began.\nAs clouds of smoke billowed from the factory building, hundreds of distraught people gathered outside to find out updates of their kins."
  },
  {
    "headline": "Nigeria Demands Unconditional Repatriation of Artefacts from Germany",
    "summarized_story": "Nigeria’s federal government has urged Germany to ensure an unconditional return of the 1,130 Benin artefacts that were looted from Nigeria in the 19th century and domiciled in German museums.\n“That they are known as Benin Bronzes is already a confirmation of their source of origin (which is Benin),” Mohammed said.\nAt a separate meeting with Maas, the minister reiterated that no conditions should be attached to the return of the artefacts.\nHe thanked Germany for taking the leadin the global efforts to repatriate all artefacts looted from Nigeria and the African continent.\nOn his part, the Nigerian Ambassador to Germany, Mr. Yusuf Tuggar, said the issue of the repatriation of the Benin Bronzes should be seen as an opportunity to take the cooperation between Nigeria and Germany to a greater height."
  },
  {
    "headline": "Nigeria: Oba of Benin, Edo Governor Obaseki on Collision Course Over Looted Artefacts",
    "summarized_story": "Except a compromise is reached, the Oba of Benin, Oba Ewuare II, and Edo State Governor, Mr. Godwin Obaseki, are heading for a showdown over the impending return by Germany and the United Kingdom of artefacts stolen from the Benin Palace in 1897 during a raid by the colonial invaders.\nHis plan, it is gathered, is to have the private trust build a museum of West African Arts in Benin, the state capital, where the artefacts would be kept and curated.\nLegacy Restoration Trust, a private entity, THISDAY learnt, has since emerged, parading itself as the authorised custodian of the artefacts.\nObaseki said: “As I speak, the planners from Latin America are in Benin City, looking at work and doing the surveys.\nAnd that’s going to be refurbished, then we have the main Edo Museum of West African Arts."
  },
  {
    "headline": "Pfizer to Seek US Authorisation for 3rd Vaccine Dose",
    "summarized_story": "Pfizer is about to seek U.S. authorisation for a third dose of its COVID-19 vaccine, saying Thursday that another shot within 12 months could dramatically boost immunity and maybe help ward off the latest worrisome coronavirus mutant.\nIn August, Pfizer plans to ask the Food and Drug Administration for emergency authorization of a third dose, he said.\nWhy might that matter for fighting the delta variant?\nBut a single vaccine dose dramatically boosted their antibody levels — sparking cross-protection against the delta variant and two other mutants, the study found.\nResearchers in Britain found two doses of the Pfizer vaccine, for example, are 96% protective against hospitalization with the delta variant and 88% effective against symptomatic infection."
  },
  {
    "headline": "Foreign Hit Squad Killed Haiti’s President Moise, Police Say",
    "summarized_story": "A hit squad composed mostly of retired Colombian soldiers assassinated Haiti’s President Jovenel Moïse earlier this week, police say.\nMr Moïse was found lying on his back with 12 bullet wounds and died at the scene, according to authorities.\n“Foreigners came to our country to kill the president,” Mr Charles said.\nMr Joseph, the interim prime minister, told the BBC he was “puzzled” by Mr Henry’s statement.\nParliamentary elections should have been held in October 2019 but disputes delayed them, meaning Mr Moïse had been ruling by decree."
  }
]