[
  {
    "headline": "PDP ex-gov candidate hints at re-contesting Kaduna ticket",
    "summarized_story": "The governorship candidate of the Peoples Democratic Party in Kaduna State in 2019, Isa Ashiru, has said he is still vibrant to re-contest in 2023 to provide dividends of democracy to his constituents.\nHe stated this during an interactive breakfast meeting with some of his political associates in Kaduna on Thursday.\nAshiru, who claimed that he won the 2019 governorship election but was rigged out, said he would leave nothing to chance and follow due process to succeed in 2023.\nHe stressed that his aspiration to govern the state on the PDP platform was intact.\nAshiru served in the state House of Assembly for two terms and proceeded to the House of Representatives, where he also served another two terms."
  },
  {
    "headline": "Kwara, PDP disagree on takeover of state buildings over debt",
    "summarized_story": "Kwara State Government and the state chapter of the Peoples Democratic Party have disagreed over the takeover of property owned by the state to guarantee loans secured on behalf of Shonga Farms, an agricultural concern established for the state by the former administration led by Dr Bukola Saraki.\nWhile the government alleged that the state was scammed on the loan by previous administrations, the PDP said the present administration was lying on the status of the farm owned by the state.\nThe state Attorney-General and Commissioner for Justice, Salman Jawondo, SAN, spoke at a press conference.\n“It is not possible for the Kwara State Government to use any property as collateral for any form of loan.\n“AMCON’s lawyers in the new unethical practice that we now witness chose Kwara State as a soft target knowing that the people in charge of government are not only ignorant but they are also ever ready to play politics with any issue."
  },
  {
    "headline": "2023 Presidency: Sanwo-Olu mobilises APC leaders, communities for Tinubu",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos State.\n“So, I want to appeal to all leaders to do all that is required for our party to be stronger.\n“I want to urge all traditional leaders to work with the government at local and state levels.\nI want to encourage all other ethnic nationals – the Ndigbo Community, South-South Community and Arewa Community.\n“I want us to continue to live in tolerance, peace and harmony because it is only when we do this that more community development will come to this locality and community.”"
  },
  {
    "headline": "Kaduna 2023: Group roots for Shehu Sani",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Movement For Real Change ( MRC); a group in Kaduna, has described Senator Shehu Sani as the best candidate for the Sir Kashim Ibrahim House come 2023.\nThe group in a statement signed by the National Coordinator, Comrade Abdulganiyu Abdulkarim, stated: “We have studied the current development in the state and arrived at the conclusion that Kaduna needs a leader with the requisite experience and passion for overall development.”“The 2023 election is going to be about giving account and records of proven track records, performance, history of struggles for the liberation of the masses and ability to stand firm against injustices.”“These are our criteria for mobilizing votes for any credible candidate during the forthcoming 2023 election across all State of Nigeria.”“It is against this background that our research unit studied all potential politicians in Kaduna and came up with the name of former Senator, who represented Kaduna Central Senatorial, Comrade Shehu Sani as the Best option for Kaduna people come 2023 .”” We are urging Kaduna people regardless of religion, tribe and ethnicity to join MRC to support the call for Senator Shehu to aspire for the highly coveted seat of power at the Sir Kashim Ibrahim Government House.”“The only answer to development without pains, focused leadership with a human face and democratic administration with recourse to constitutional provisions as a panacea for conflict resolution is Senator Shehu Sani.\n:“We are urging the electorate to shun party affiliation and join hands together to vote the right leaders who can deliver dividends of democracy across all ramifications of human endeavours .”“It is not about APC, not about PDP or APGA, but about a leader who will give citizens value for their votes.”“We see these qualities in Senator Shehu Sani who was a leading figure in the struggle for the restoration of democracy in Nigeria.\nShehu was arrested and jailed by successive past military regimes in Nigeria for speaking out for the oppressed Nigerians.”Vanguard News Nigeria"
  },
  {
    "headline": "Marriott hotels in Nigeria set to deliver truly memorable valentine’s Experience",
    "summarized_story": "The Management of Lagos Marriott Hotel Ikeja, Sheraton Lagos & Sheraton Abuja Hotels have promised to make the Valentine celebration one their guests would remember for a lifetime.\nThe Cluster Director of Sales and Marketing for Marriot International Hotels in Nigeria, Noemi Delgado,, said with a selection of customized packages to suit everyone, Lagos Marriott Hotel Ikeja , Sheraton Lagos Hotel and Sheraton Abuja Hotel are ready to offer the most amazing Valentine’s Day deals.\n“Lagos Marriott Hotel Ikeja has a most romantic evening planned for lovers out there.\nAt Sheraton Lagos Hotel A special Valentine’s Day buffet on the 14th of February awaits all at the Pumpkin Leaf restaurant for families and friends who wish to have a hearty time.\nAt Marriott Hotels we create memories to ensure our customers keep coming back for more; our elevated Valentine’s packages are sure to leave a lifetime of memories for everyoneconcludes Noemi."
  },
  {
    "headline": "Nations measured by how most vulnerable citizens are treated – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo says a nation will be measured ultimately by how it treats its most vulnerable citizens.\nOsinbajo expressed this view in his special address at the At-Risk Children –Programme(ARC-P) Summit on Thursday at the State House Banquet Hall, Abuja.\n“At the heart of the At-Risk Children Programme is the idea that every Nigerian child counts.\nInuwa Yahaya of Gombe State, shared the state’s experience being the first state in the federation and the pilot carrying the implementation of the programme.\nShe said focus would be on Almajiri, out-of-school children, girls at work and adolescent girls in marriage, among other vulnerable children."
  },
  {
    "headline": "Chikaima seeks N6m for corrective heart surgery",
    "summarized_story": "At the Lagos State University Teaching Hospital, LASUTH, Chikaima was diagnosed with Ventricular Septal Defect, VSD, also known as a hole in the heart.\nShe requires urgent corrective surgery to close the hole between her left and right ventricles.\nThe hospital advised us to let her go for surgery at any centre with facilities for complex heart defects surgery.\nFurther, Pawar stated: “The complications of these heart defects, which include chronic hypoxaemia, meaning prolonged poor oxygen supply to the body cells and organs, have affected baby Chikaima’s growth and development.\n“Chikaima’s requires further cardiovascular evaluation and open-heart surgery to correct her heart defects in order to forestall irreversible and life-threatening complications,” the doctor noted."
  },
  {
    "headline": "Outstanding debts: 24 hours after plunging Oyo into darkness, IBEDC, Oyo govt resolve impasse",
    "summarized_story": "Oyo State Government and Ibadan Electricity Distribution Company (IBEDC) have resolved their disagreements.\nDAILY POST gathered that the two have been trading blames over alleged outstanding debts.\nIBEDC in its own argument, said that the Oyo State Government was owing the company the sum of four hundred and fifty million naira (N450m).\nThe state government then, went ahead to seal all the offices of the company in the state.\n“This is to notify the general public that the Oyo State Government and the IBEDC have resolved and agreed to work together in the interest of the public."
  },
  {
    "headline": "Ibadan bullion van attack: Identity of victim revealed",
    "summarized_story": "The identity of one of the victims of Thursday’s armed robbery attack in Ibadan, the Oyo State capital has been revealed.\nDAILY POST had earlier reported that some armed robbers had on Thursday afternoon attacked a bullion van.\nInvestigation by DAILY POST Thursday evening has revealed the identity of one of those who lost their lives.\nMay Allah have mercy on my brother and other deserving servants of Allah killed in this avoidable killings.\nOne of my very close friends, Mubarak Sulaiman Olabrewaju, was shot in the head during a robbery incident in Ibadan today."
  },
  {
    "headline": "Police arrest Lagos tricycle owners’ leader, others heading to fight NURTW",
    "summarized_story": "The Rapid Response Squad (RRS) of Lagos State Police Command has arrested a Tricycle Owners and Operators Association of Nigeria (TOOAN) leader, Azeez Abiola.\nPopularly known as Istijaba, he and others were on the verge of causing mayhem when they were apprehended.\nOthers are Yusuf Azeez a.k.a Araba (42), Kazeem Akinbo a.k.a Womi (43), Taofiq Odewale, a.k.a Omo Iya Agba (38), and Moses Abiodun a.k.a Orobo (34).\nThey were nabbed while leading supporters to NURTW headquarters in Agege, an action the authority believed would trigger violence across Lagos.\nCommissioner of Police, CP Abiodun Alabi, has ordered transfer of the suspects and the exhibit to the State Command for investigation."
  },
  {
    "headline": "Expect more fire outbreaks in Nigeria – Aregbesola",
    "summarized_story": "Minister of Interior, Ogbeni Rauf Aregbesola, has asked Nigerians to embrace the right firefighting attitudes as there are going to be more incidents of man-made fire outbreaks as the dry season sets in.\n“Under him, the service established six additional training schools totalling eight, one in each geopolitical zone.\nHe said: “I spent 17 years with the Niger State Fire Service before I was invited to start what is today known as the FCT Fire Service and I headed FCT Fire Service for 13 years.\nHe said the Federal Fire Service has received 2,845 fire calls in 2021 and has rescued 260 emergencies, saving 587 lives while 136 were lost.\n47 trillion and the estimated property lost is N3, 045.27 trillion and the major cause of the fire in 2021 is electrical equipment related.”"
  },
  {
    "headline": "Second Niger Bridge is named after Buhari, not Jonathan – Presidential aide",
    "summarized_story": "President Muhammadu Buhari’s Personal Assistant on New Media, Bashir Ahmad, has said the second Niger bridge is named after the president.\nAhmad said the Second Niger Bridge is named after Buhari and not the immediate past president, Goodluck Jonathan.\nAny other name doesn’t stand a chance.”@Greenaetion said, “It is not Muhammadu Buhari Bridge and it can never be.\nThat’s 2nd Niger Bridge or Southern Link Bridge.”Reacting, Ahmad insisted that the bridge will be named Buhari and not JonathanHe tweeted, “So, can we call it Goodluck Jonathan Bridge for sketching the bridge?\nThe bridge is to be called ‘Muhammadu Buhari Bridge’, read the name again and let it sink in your head.”The Second Niger Bridge, which links Onitsha and Asaba, started during Jonathan’s administration in 2014."
  },
  {
    "headline": "Judge’s absence stalls suit seeking to stop arrest, extradition of Abba Kyari",
    "summarized_story": "Justice Okorowo adjourned the matter till yesterday for hearing.\nNAN reports that the foundation, in a suit, sought to stop the police and the Attorney-General of the Federation (AGF) from arresting and extraditing Kyari.\nNAN reported that the matter came up for the first time before Justice Okorowo on January 12.\nThe case, which was earlier before Justice Ahmed Mohammed, was reassigned to Justice Okorowo.\nJustice Okorowo, in the last adjourned date, ordered that hearing notices be issued on the parties."
  },
  {
    "headline": "Lawan: why we are raising N25b for Yobe education",
    "summarized_story": "Lawan: why we are raising N25b for Yobe educationBy Sanni Onogu, Abuja and Gbenga OmokhunuThe Senate President Ahmad Lawan yesterday explained the rationale behind the N25 billion education appeal fund by the government of Yobe State.\nThe Senate President spoke at the Yobe State Education Fundraiser which was held in Abuja yesterday.\n- Advertisement -“In the Northeastern state before the former Borno State and currently Yobe State, we received support from the government for our education.\nIn fact, in different parts of the world but they are, of course, indigenous to Yobe,” Lawan said.\nBuni stated this at the Yobe State Education Fundraiser with the theme: “Revitalising Education in Yobe State,” held at Sheraton Hotel, in Abuja."
  },
  {
    "headline": "North owes Tinubu his presidential aspiration, says Northern Group",
    "summarized_story": "The group, Northern Region Supports Tinubu 2023, was emphatic that the North owes it as a duty to ensure that Asiwaju Tinubu becomes the next President.\nHe said: “In 2015, without Asiwaju Tinubu, Buhari would not have become President.\n“Asiwaju Tinubu is the type that when you come to him with focus and determination, he helps you,” Hammandikko said.\nReiterating his call on the North to support the APC National Leader, Hammandikko added: “It’s payback time by the North in favour of Asiwaju Tinubu.\nPresident Buhari and the North have to do sakayya for Asiwaju Tinubu and ensure that the former governor gets to power as President of Nigeria.”"
  },
  {
    "headline": "Ngige: Fed Govt working to fight poverty-induced crimes",
    "summarized_story": "Labour and Employment Minister Chris Ngige has said the Federal Government is working hard to cushion the adverse effect of job losses caused by the outbreak of COVID-19 pandemic.\nThe minister also said the government was working to reduce poverty-induced crimes across the country.\nHe said: “Inequality has been made worse by COVID-19 scourge, which has displaced many working persons, especially in the informal sector; those who earn their living by working daily.\n- Advertisement -“As a government, we are battling to make up for the job losses, and to cut poverty-induced crimes.\nBut, even as we do this, we also face a great youth bulge that has led many of them into crimes."
  },
  {
    "headline": "Lawmakers wrong to initiate Electoral Act amendment, says INEC",
    "summarized_story": "Neither the executive nor the legislature has the right to initiate amendments to Electoral Act, Independent National Electoral Commission (INEC) Chairman Prof Yakubu Mamood said yesterday.\nHe said the slow pace of work on the reworked Electoral Act Amendment Bill is beginning to take a toll on the commission’s preparation for the general election in February next year.\n- Advertisement -On who should initiate amendments to Electoral Act, he said the INEC, and neither the executive, nor the National Assembly, should initiate proposed amendments to the Electoral Act as it is being practiced in neighbouring Ghana.\nHe flayed what he described as a growing lack of sense of urgency on the executive and the legislature to complete work on the Electoral Bill.\nHe agreed with Omoworare that President Buhari will look favourably at the Electoral bill this time around and deliver it as a legacy to the Nigerian people."
  },
  {
    "headline": "Piracy has reduced in Nigeria’s waters- Admiral Gbassa",
    "summarized_story": "BY PHILIP NWOSUThe Nigerian Navy said the incidences of piracy within the Nigerian waters and the Gulf of Guinea has reduced considerably.\nThe outgoing Flag Officer Commanding (FOC) Western Naval Command Rear Admiral Jason Gbassa who gave the revelation yesterday said the reduction was as result of the continued presence of naval operatives at sea on policing duties.\nAccording to Admiral Gbassa who spoke during his farewell parade, to curb the incidences of piracy, the Western Naval Command under his watch, initiated series of operations to combat the menace of piracy, illegal oil bunkering, drug trafficking and other related crimes within the Command’s Area of Responsibility.\n“Further to this, the Command arrested several high-profile vessels and persons involved in drug trafficking.\nThe seizure,on 12 August 2021, of 4 tanker trucks and subsequent trailing and arrest of some of the kingpins,“Effectively restored sanity to the hitherto criminal hotspot."
  },
  {
    "headline": "Ibadan: 7 feared dead as armed robbers attack bullion van",
    "summarized_story": "From Oluseye Ojo, IbadanSeven persons have been feared dead as armed robbers attacked a bullion van at Idi-Ape in Ibadan, the Oyo State capital.\nThe armed robbers were said to have driven in an unmarked Toyota Sienna and were in police uniform.\nBizarre…as robbers wreak havoc in Ibadan pic.twitter.com/UFrCMxCi8O — The Sun Nigeria (@thesunnigeria) February 10, 2022The armed robbers, according to eyewitnesses, were three in number and they carried sophisticated weapons.\nBut the armed robbers were not successful in the operation as they could not hijack the bullion van before they fled.\nThe attacked bullion van has been tolled to an undisclosed location by security men from Idi-Ape."
  },
  {
    "headline": "Fuel queues persist in Lagos, Abuja",
    "summarized_story": "The development has equally led to a slight increase in the cost of Transportation.\nAlso, the assurance by the Independent Petroleum Marketers Association of Nigeria(IPMAN) to consumers that fuel would be available from yesterday(Wednesday) proved unrealistic as queues at both independent and major fuel outlets persisted, yesterday.\nSpeaking after the meeting of the Federal Executive Council (FEC) presided over by President Buhari at the presidential villa, Abuja, Sylva cautioned against drawing conclusions before the investigation is completed.\nMinister of Interior, Rauf Aregbesola, on his part said the council granted approval made by the Advisory Committee on Nigeria citizenship for 286 foreign nationals out of 600 applications received.\nHe said 208 of those approved were granted citizenship by Naturalisation, while 78 others were granted citizenship by registration."
  },
  {
    "headline": "14 govs, 13 ex-govs, 3 former senate presidents, others meet on state-of-the-nation",
    "summarized_story": "By Chukwudi NwejeAs the 2023 transition to a new administration approaches, a group, The 2022 Committee, comprising no fewer than 14 incumbent governors, 13 ex-governors, three former Senate Presidents and other prominent citizens, cut across various sectors, have met in Lagos on how the chart a way forward for the country.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nWe must have a secure, peaceful and united nation before we can have candidates for political offices.\n“The Committee believes that what Nigeria needs today is for all patriots to come together to rescue our nation from all political, economic and security threats, and promote the unity of Nigeria."
  },
  {
    "headline": "NNPC names MRS, Oando, Emadeb Consortium, Duke Oil as importers of methanol-blended petrol",
    "summarized_story": "The Nigerian National Petroleum Company Limited has named MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium, Oando and Duke Oil as importers of the methanol blended petrol into the country.\nHe said MRS imported the methanol-blended fuel through a vessel named MT Bow Pioneer, while Emadeb/Hyde/AY Maikifi/Brittania-U Consortium brought in the product through a vessel MT Tom Hilde.\nOando, he said, imported its product through a vessel, MT Elka Apollon, while Duke Oil brought its product through MT Nord Gainer vessel.\n“NNPC investigation revealed the presence of methanol in four (4) PMS cargoes imported by the following DSDP suppliers namely MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium, Oando and Duke Oil.\n“The allegation reported against the Company that MRS imported contaminated products, is therefore mischievous, false and untrue."
  },
  {
    "headline": "2022 Committee Mobilising Nigerians for Quality Leadership",
    "summarized_story": "•Building consensus for country’s rebirthEmmanuel AddehThe 2022 Committee has resolved to mobilise Nigerians across party lines and social strata for quality leadership of the country at all levels as the elections to choose new leaders in 2023 draw near.\nThe meeting, which held from February 4 to 6 under the aegis of “The 2022 Committee”, the conveners pointed out, remained non- partisan.\nThey said the retreat to chart a new consensus for national rebirth was attended by 14 incumbent governors, 13 former governors, and three former senate presidents.\n“The 2022 Committee” conveners stated, “Whilst the 2022 committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction.\nBut the coordinators of the meeting stated that although all the 100 leading lights of the 2022 committee had the capacity for national leadership, it should not be linked to the politics of 2023."
  },
  {
    "headline": "Adulterated Fuel: Kyari Names MRS, Emadeb-consortium, Oando, Duke Oil as Culprits",
    "summarized_story": "But the NNPC GMD’s explanation ran contrary to an earlier press statement released by MRS, where the company denied culpability.\nThe petroleum products delivered are usually equivalent in value to the crude oil received from NNPC subject to the general terms and conditions as advised.\nAccording to him, as soon as the vessels complete discharging and start pushing products to oil marketers, the fuel queues in Lagos should fully disappear by Friday.\nOther attendees at the meeting included top officials of NNPC, Major Oil Marketers Association of Nigeria (MOMAN), and members of the Depots and Petroleum Products Marketers Association of Nigeria (DAPPMAN).\nNARTO had threatened to stop haulage of petroleum products across the country over the hike in the price of diesel to N430 per litre and other operational challenges."
  },
  {
    "headline": "NNPC Rakes in N2.613trn from Petrol Sales in One Year",
    "summarized_story": "•Posts $224.29m Crude Oil RevenueEmmanuel Addeh in Abuja and Peter Uzoho in LagosThe Nigerian National Petroleum Company (NNPC) Limited yesterday announced that it made N2.613 trillion from the sale of petrol between August 2020 and August 2021.\nA breakdown of the figures captured in the August 2021 NNPC Monthly Financial and Operations Report (MFOR) indicated that export of crude oil amounted to $7.77 million.\nTotal crude oil and gas export receipt for the period of August 2020 to August 2021 stood at $1.84billion, the company revealed.\nNNPC said in the report, “A breakdown of the figure indicates that petrol accounted for 99 per cent of total sales, while Automotive Gas Oil (AGO), also known as diesel, accounted for the rest.\n“Total sale of white products for the period of August 2020 to August 2021 stood at 20.032 billion, with petrol accounting for 99.81 per cent."
  },
  {
    "headline": "JUST IN: Bandits Kill DPO, Soldier in Katsina",
    "summarized_story": "Injure army captainFrancis Sardauna in KatsinaThe Divisional Police Officer (DPO) of Jibia Local Government Area of Katsina State, DSP Abdulkadir Rano and one soldier have been killed in a gun battle between terrorists and security personnel at Magamar Jibia community.\nTHISDAY gathered that the terrorists who invaded the border community on Tuesday night, also shot an army captain on his lap and left many residents with varying degrees of injuries.\nA vigilante commandant in the community who pleaded anonymity, told THISDAY on Wednesday that the marauding terrorists abducted the wife of a businessman in the community.\nThe attack was said to be carried out by the terrorists under the groups of Dangote, Dan Karami and Turji.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "The 2022 Committee: Eminent Leaders Met to Build Consensus for National Rebirth",
    "summarized_story": "The meeting of 100 leading business, political, civil society and thought leaders in Lagos over the last weekend was to build consensus for national rebirth, the 2022 Committee has said.\nA statement issued Wednesday on behalf of the Conveners by the Chairman of THISDAY/Arise Media Group, Mr. Nduka Obaigbena, and former Presidential Liaison Officer to the Senate, Mr. Kashim Ibrahim-Imam, said the meeting which held from February 4 to 6 under the aegis of The 2022 Committee, in a non- partisan retreat to map a new consensus for national rebirth, was attended by 14 current governors, 13 former governors and three former Senate Presidents.\nParticipants, working in 3 Sub-Committees of National Security, The Economy and Nigeria in Transition, the statement said, “recognised that there is an urgent need to seek common ground and irreducible minimum actions to stabilise the polity at this critical time of transition.”The statement, coming on the heels of unfounded narratives on the purpose of the meeting, said ”whilst The 2022 Committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the Committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction – candidates are only chosen by political parties and we are not a political party.”Noting that all the 100 leading lights of the 2022 Committee have the capacity for national leadership, it said amongst the active participants in the work of the Committee were over seven persons, from three or more political parties, who had already publicly declared their aspirations to lead the country but were desirous of working with other patriots for non-partisan greater national goals.\n“We must have a secure, peaceful and united nation before we can have candidates for political offices,” it added.\nThe statement further said that The 2022 Committee believes that “what Nigeria needs today is for all patriots to come together to rescue our nation from all political, economic and security threats, and promote the unity of Nigeria.”It said the meetings will continue, “as we work with Federal and State Governments, current and future political leaders of all political persuasions, as well as other eminent patriotic citizens, for the greater good of the Nigerian people.”It therefore called on all patriotic volunteers, who are willing and able, to join this collective effort to stabilise the system so that a new Nigeria, that all can be proud of, could be builtShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Robbers Attack Bullion Van, Kill Two Policemen, Others In Oyo",
    "summarized_story": "Two mobile police officers were allegedly shot dead after robbers attacked a bullion van in Ibadan, Oyo State, on Thursday.\nSome residents were also feared killed in the attack.\nWitnesses said the incident occurred around the popular Iwo Road roundabout in the city.\nThe armed robbers, who had laid an ambush, opened fire on the bullion van and the escort van while heading towards Ife Road."
  },
  {
    "headline": "BREAKING: Robbers Attack Bullion Van, Kill Two Policemen, Others In Oyo",
    "summarized_story": "Two mobile police officers were allegedly shot dead after robbers attacked a bullion van in Ibadan, Oyo State, on Thursday.\nSome residents were also feared killed in the attack.\nWitnesses said the incident occurred around the popular Iwo Road roundabout in the city.\nThe armed robbers, who had laid an ambush, opened fire on the bullion van and the escort van while heading towards Ife Road."
  },
  {
    "headline": "ISIS Expanding In Nigeria, Other Africa Countries Despite Leader’s Death, United Nations Warns",
    "summarized_story": "The United Nations Office of Counter-Terrorism says the Islamic State of Iraq and Levant (ISIL or ISIS), a terrorist group, is expanding its affiliates and network beyond Syria and Iraq to Africa.\nISISThe under-secretary-general said that the terrorist activities were gaining ground in the Central and West Africa, which he said continues at an “unsettling” scale and pace.\nAccording to him, the terrorist activities intensifying in Central and West Africa – especially Nigeria, Burkina Faso, Cameroon, the Democratic Republic of Congo, Mali and Niger and attacks increasingly reported in the border area between Mozambique and Tanzania.\nHe added that a subsequent targeted attack reportedly resulted in the death of the ISIL/Da’esh leader, Amir Muhammad Sa’id Abdal-Rahman al-Salbi, widely known as Abu Ibrahim al-Hashimi al-Quraishi.\n“We have learned over the past two decades that counter-terrorism is a long-term game and that there are no quick fixes,” he stressed."
  },
  {
    "headline": "ISIS Expanding In Nigeria, Other Africa Countries Despite Leader’s Death, United Nations Warns",
    "summarized_story": "The United Nations Office of Counter-Terrorism says the Islamic State of Iraq and Levant (ISIL or ISIS), a terrorist group, is expanding its affiliates and network beyond Syria and Iraq to Africa.\nISISThe under-secretary-general said that the terrorist activities were gaining ground in the Central and West Africa, which he said continues at an “unsettling” scale and pace.\nAccording to him, the terrorist activities intensifying in Central and West Africa – especially Nigeria, Burkina Faso, Cameroon, the Democratic Republic of Congo, Mali and Niger and attacks increasingly reported in the border area between Mozambique and Tanzania.\nHe added that a subsequent targeted attack reportedly resulted in the death of the ISIL/Da’esh leader, Amir Muhammad Sa’id Abdal-Rahman al-Salbi, widely known as Abu Ibrahim al-Hashimi al-Quraishi.\n“We have learned over the past two decades that counter-terrorism is a long-term game and that there are no quick fixes,” he stressed."
  },
  {
    "headline": "ISIS Expanding In Nigeria, Other Africa Countries Despite Leader’s Death, United Nations Warns",
    "summarized_story": "The United Nations Office of Counter-Terrorism says the Islamic State of Iraq and Levant (ISIL or ISIS), a terrorist group, is expanding its affiliates and network beyond Syria and Iraq to Africa.\nISISThe under-secretary-general said that the terrorist activities were gaining ground in the Central and West Africa, which he said continues at an “unsettling” scale and pace.\nAccording to him, the terrorist activities intensifying in Central and West Africa – especially Nigeria, Burkina Faso, Cameroon, the Democratic Republic of Congo, Mali and Niger and attacks increasingly reported in the border area between Mozambique and Tanzania.\nHe added that a subsequent targeted attack reportedly resulted in the death of the ISIL/Da’esh leader, Amir Muhammad Sa’id Abdal-Rahman al-Salbi, widely known as Abu Ibrahim al-Hashimi al-Quraishi.\n“We have learned over the past two decades that counter-terrorism is a long-term game and that there are no quick fixes,” he stressed."
  },
  {
    "headline": "Unpaid bills: IBEDC, Oyo 'resolve' differences, agree to work together",
    "summarized_story": "The Oyo state government and the Ibadan Electricity Distribution Company (IBEDC) say they have resolved their disagreement.\nOn Wednesday, the state government sealed off IBEDC offices over alleged failure to pay mandatory bills and taxes.\nThe action was taken after IBEDC reportedly disconnected the electricity supply to the state secretariat.\nOlatunbosun said IBEDC also owes N139,440,000 in harmonised bills, N122,590,000 infrastructure bills, N116,516,111.41 tax audit bills and N22,000,000 signage bills.\n“This is to notify the general public that the Oyo State Government and the IBEDC have resolved and agreed to work together in the interest of the public,” the statement reads."
  },
  {
    "headline": "Unpaid bills: IBEDC, Oyo 'resolve' differences, agree to work together",
    "summarized_story": "The Oyo state government and the Ibadan Electricity Distribution Company (IBEDC) say they have resolved their disagreement.\nOn Wednesday, the state government sealed off IBEDC offices over alleged failure to pay mandatory bills and taxes.\nThe action was taken after IBEDC reportedly disconnected the electricity supply to the state secretariat.\nOlatunbosun said IBEDC also owes N139,440,000 in harmonised bills, N122,590,000 infrastructure bills, N116,516,111.41 tax audit bills and N22,000,000 signage bills.\n“This is to notify the general public that the Oyo State Government and the IBEDC have resolved and agreed to work together in the interest of the public,” the statement reads."
  },
  {
    "headline": "Buhari to diplomats: Stay within professional limits while monitoring 2023 elections",
    "summarized_story": "President Muhammadu Buhari has asked diplomats to stay within the limits of their profession as the country prepares for the 2023 elections.\nBuhari spoke on Thursday while receiving letters of credence from the ambassadors of Czech Republic, Spain Italy and Israel at the state house, Abuja.\nThe ambassadors are Zdenek Krejci of Czech Republic, Stephano De Leo of Italy, Juan Ignacio of Spain, and Michael Shual Freeman of Israel.\nAdvertisement“You are assuming your diplomatic responsibilities in Nigeria at a very interesting political period as Nigeria’s national elections are due in early 2023,” Buhari said.\n“Different factors that accounted for these challenges go beyond the abilities of any single country to effectively contain alone."
  },
  {
    "headline": "Buhari to diplomats: Stay within professional limits while monitoring 2023 elections",
    "summarized_story": "President Muhammadu Buhari has asked diplomats to stay within the limits of their profession as the country prepares for the 2023 elections.\nBuhari spoke on Thursday while receiving letters of credence from the ambassadors of Czech Republic, Spain Italy and Israel at the state house, Abuja.\nThe ambassadors are Zdenek Krejci of Czech Republic, Stephano De Leo of Italy, Juan Ignacio of Spain, and Michael Shual Freeman of Israel.\nAdvertisement“You are assuming your diplomatic responsibilities in Nigeria at a very interesting political period as Nigeria’s national elections are due in early 2023,” Buhari said.\n“Different factors that accounted for these challenges go beyond the abilities of any single country to effectively contain alone."
  },
  {
    "headline": "Ademola Lookman, England footballer, finally gets FIFA's nod to play for Nigeria",
    "summarized_story": "The Nigerian Football Federation (NFF) has confirmed that Ademola Lookman, former England youth player, has finally gotten approval to switch his allegiance to the Super Eagles.\nThe NFF boss added that he can’t wait for the 24-year-old to make his debut for the Super Eagles in the nearest future.\n“I’m also glad to announce that the work we’ve put in has ensured that on-loan Leicester City winger, Ademola Lookman’s application to change his nationality and represent Nigeria has been approved by FIFA,” he tweeted.\nHe might get his debut when the Super Eagles of Nigeria face Ghana at Qatar 2022 World Cup qualification play-off billed for next month.\nLookman had earlier indicated his interest to represent Nigeria."
  },
  {
    "headline": "This developer transitioned to blockchain development in order to solve Web2 problems",
    "summarized_story": "Akinyemi Akindele, 27, studied computer science at the University of Ibadan, where he trained as a Web2 software developer.\nEventually, he got to build a blockchain supply chain solution with his team, the first of its kind in the country, he said.\nAfter two years at Binance, Akindele joined EMTECH, a US blockchain company that builds digital currency for central banks across the world.\nBreaking into blockchain developmentAnother idea that endeared Akindele to blockchain engineering was that the blockchain was a melting point for a lot of things.\nHe also advised them to contribute to open source blockchain projects and look for ways to solve the problems that exist today in Web2 with Web3."
  },
  {
    "headline": "TechCabal’s Valentine’s Gift Guide",
    "summarized_story": "Price range: > $99We’ve labelled this a Series C-type gift because it’s a long-term investment beneficial to all involved.\nPrice range: $2 – $4 (for Individual plans)We’re labelling this a seed-type gift because, any way you dice it, you’re sowing seeds.\nWell, here’s how you can someday build up to that: get them video streaming subscriptions for Valentine’s Day.\nLog on to your MTN, Safaricom, Airtel, or Ethio Telecom services and gift your loved one gigabytes of data.\nFor Valentine’s, add to your loved one’s crypto stash and help them build their way into digital wealth."
  },
  {
    "headline": "Inside Bolt’s plans for Africa after raising mega funding",
    "summarized_story": "To understand Bolt’s overarching plans for Africa, its second-largest market after Europe, TechCabal spoke with its Africa Regional Director, Paddy Partridge.\n“At the moment, across Africa, women make up a very small share of our driver base.\nBut that hasn’t happened because, according to Patridge, South Africa and Kenya have the highest share of female drivers—which is an essential metric in rolling out the feature.\n“It was most feasible to get the category off the ground in South Africa.\nWe wanted to test what kind of traction the category could get, and South Africa is the most suitable pilot test."
  },
  {
    "headline": "The viral photographer that Afcon Cameroon made",
    "summarized_story": "As the African Cup of Nation (Afcon) fiesta rages in Cameroon, a young photographer is positioned to make a name for himself.\nIn a few minutes, he will be triggering his camera, producing incredible shots that will go viral and bring him fame.\nThe accreditation document gives journalists and photographers the right to access stadiums and venues where the Afcon takes place.\nEvery picture I was posting was going viral, it was amazing.”Amid the excitement of his work going viral, Lefa was still worried about his accreditation.\nImage source: Didier Lefa."
  },
  {
    "headline": "Explainer: Methanol is good in petrol, bad for engine when excess",
    "summarized_story": "The ‘dirty petrol’ currently in Nigeria, which the government has been trying to take out of circulation, has been noted to contain methanol.\nThe Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) had said a methanol quantity above Nigeria’s specification was discovered in the petrol supply chain.\n“Methanol is a regular additive in petrol and is usually blended in an acceptable quantity.\nRead also: Dirty petrol: Government to compensate owners of damaged carsThe current incidence of methanol in Nigeria’s petrol can be likened to something good being abused, and in the end, giving a bad outcome.\nMethanol with co-solvents has been commercially blended into gasoline (petrol) at various times and locations since the late 1970s."
  },
  {
    "headline": "Nigeria, the world’s most inefficient spender, now lives to pay creditors",
    "summarized_story": "The International Monetary Fund (IMF) is projecting Nigeria will spend 92 percent of its earnings paying creditors this year.\nIf these projections do happen, it will be by far the most any country pays as a percentage of revenue servicing debt.\nIn 2019, Nigeria spent N54 of every N100 it earned, more than half, servicing debt.\nThe country closest to Nigeria, Lebanon, was spending 50.8 percent of its revenues.\n“Then the government used borrowed money to pay for old borrowings and the debt service cost was usually the first line item on the expenditure side of the budget,” the economist said."
  },
  {
    "headline": "More pain for small businesses as diesel price rises by 24%",
    "summarized_story": "The price of diesel, which is not regulated by the government, has surged by over 24 percent on the back of the soaring price of Brent crude, dollar price, and the forces of demand and supply, sources said.\nCrude oil price accounts for a large chunk of the final cost of petroleum products such as diesel, kerosene, and such associated products.\nBrent crude, the benchmark for Nigeria’s crude oil has gained more than 28percennt to $91 on February 09, 2022.\nIt said states with the highest average price of diesel were States with the highest price Enugu (N349.29), Borno (N340.00), and Oyo (N326.25).\n“States with the lowest average price of diesel were Kebbi (N232.36), Yobe (N226.61), and Katsina (N225.00),” the NBS noted."
  },
  {
    "headline": "Obaseki mourns passing of Comrade Ogbeide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of Comrade Osarunmwense Ogbeide, who passed on January 25, 2022.\n“A kind, compassionate and loving gentleman, he was a good father, who loved deeply and warmed the hearts of friends and family around him.\n“Osarunmwense was good-natured and made sacrifices for the benefit of others, a trait which endeared him to all.\n“He will be remembered for his large heart, affable nature and commitment to his family.\n“I commiserate with the Ogbeide family, friends and associates of the deceased and pray that God will grant all the fortitude to bear this irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Kidnappers Rape Lawyer, Collect N12Million Ransom – Nigerian Observer",
    "summarized_story": "The lawyer, who was attached to a law firm for her National Youth Service Corps scheme was released with four other victims after payment of N12million ransom.\nAmid a staccato of gunshots, the victims were kidnapped by bandits at Ehor area of the Benin-Ekpoma-Auchi-Abuja Road.\nThey were traveling from Warri, Delta State to Sabongida Ora High Court in Edo State with their driver, when they were abducted.\nThe lady, who cannot be mentioned, was assisting senior solicitors in the conduct of legal matters as a youth corps member.\nAccording to official records, there have been more than 400 cases of reported kidnappings in Southwest Nigeria in the past three years."
  },
  {
    "headline": "Work for Edo’s devt, Obaseki charges new Commissioners, Special Adviser – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… warns against indiscipline in Edo PDPBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in eight new Commissioners and a Special Adviser with a charge to ensure effective service delivery to Edo people.\nThe Commissioners, who were sworn in include, Chris Nehikhare, Omololu Ojehomon, Afishetu Braimoh, and Stephen Idehenre.\nOur party, the PDP, is the party in power and wouldn’t condone opposition within the party.\nWe can’t tolerate indiscipline and disloyalty to the party.\nWe have been patient enough and want to know who the real opposition is and can’t tolerate disloyalty within the party."
  },
  {
    "headline": "ASSASSINATION: Unknown Gunmen In Army Uniform Shot Dead Owner of Osofem Oil And Gas company, Escaped With His Car At Ifo Area, Ogun State – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The owner of Osofem Oil and Gas company, Mr. Olowufemi James has been shot dead by unknown gunmen dressed in Army uniform at Ifo area of Ogun State last Sunday.\nThe father of three, it was learnt was about going home on Sunday January 6, after the sales for the day when the gunmen stormed the petrol station and ordered everyone to remained where they are or they would be killed.\n“He was chased down from his car and they demanded for his car key which he declined.\nI am also begging the State Governor Prince Dapo Abiodun to assist me because my husband was killed in his prime.\nWe are suspecting the manager and the security officer of the petrol station, because since the incident occurred will couldn’t found the two of them after the incident."
  },
  {
    "headline": "Gunmen kill five police officers, others in Enugu, Ibadan",
    "summarized_story": "Not less than five police officers were on Thursday killed by gunmen in separate incidents in Enugu and Ibadan, Oyo State.\nIn Enugu gunmen attacked a checkpoint in Enugu South LGA, killing three officers.\nThe gunmen were said to have shot sporadically in the area after killing the officers.\nCommissioner of Police Ngozi Onadeko, who visited the scene of the crime, confirmed that the slain officers were shot in the neck.\nMrs Onadeko also said that the officers killed one of the robbers but the corpse was taken away by the robbery gang."
  },
  {
    "headline": "Emadeb Energy rejects NNPC’s claim, says Brittania-U imported contaminated fuel",
    "summarized_story": "Emadeb Energy Services Limited, aNconsortium, has said it is not part of those responsible for the recent importation of off-spec petrol in the country.\nBut refuting NNPC’s claim in a statement on Thursday, three members of the consortium (Emadeb/Hyde/Ay Maikifi) said the importation was done solely by its fourth member — Brittania-U.\n“We hereby state that the said importation of the contaminated PMS was executed by a member of the consortium, to wit: Brittania-U,” the statement said.\n“Following the repeated refusal of Brittania-U to work with the Consortium, Brittania-U indemnified the other consortium members – ‘’Emadeb/Hyde/Ay Maikifi’’ and the resulting agreement was executed by their company on June 16, 2021,” the statement reads.\n“EMADEB/HYDE/AY MAIKIFI believe that these stated positions of ours have demonstrated that we are not the suppliers of the said contaminated PMS,” the statement adds."
  },
  {
    "headline": "CBN launches RT200 FX Programme to drive export, targets $200bn FX repatriation in 3-5 years",
    "summarized_story": "“After careful consideration of the available options and wide consultation with the Banking Community, the CBN is, effective immediately, announcing the Bankers’ Committee “RT200 FX Programme”, which stands for the “Race to US$200 billion in FX Repatriation,”” he said.\n“The RT200 FX Programme is a set of policies, plans and programmes for non-oil exports that will enable us attain our lofty yet attainable goal of US$200 billion in FX repatriation, exclusively from non-oil exports, over the next 3-5 years.”Emefiele explained that the RT200 Programme will have the five key anchors, including, Value-Adding Exports Facility, Non-Oil Commodities Expansion Facility, Non-Oil FX Rebate Scheme, Dedicated Non-Oil Export Terminal and Biannual Non-Oil Export Summit.\n“This is important because the export of primary unprocessed commodities does not yield much in foreign exchange.\n“If we are to reach our goal of US$200 billion in non-oil exports, then we can neither ignore nor wish away this problem.\nThat is why today we are announcing the introduction of a Biannual Non-Oil Export Summit, the first of which would be organized during the first week of April 2022."
  },
  {
    "headline": "CBN granted over N3trn in intervention loans to cushion Covid-19 impact – Emefiele",
    "summarized_story": "OBINNA EZUGWUThe Central Bank of Nigeria (CBN), working with Deposit Money Banks (DMBs) and participating financial institutions, granted over N3 trillion in intervention loans to business in the aftermath of Covid-19 pandemic, governor of the apex bank, Mr. Godwin Emefiele, has said.\nWe have also disbursed N1.452 trillion to 337 Large real sector projects in agriculture, manufacturing, services, and mining under our Real Sector Support Facility.\nThis intervention helped to support acquisition of 59 Magnetic Resonance Imaging (MRI) scanners, 42 Computer Tomography (CT) scanners, and 4 Oncology screening machines.\n“The Bank has also released N47.83 billion to 10 DisCos under the National Mass Metering Programme for the procurement of 858,026 electricity meters.\nIn effect, the concessionary interest rate of 5 percent on our intervention facilities would now be extended until March 1, 2023.”Facebook Notice for EU!"
  },
  {
    "headline": "Infernos: Minister Seeks Review Of Law Prohibiting Lazy Practice Of Bush Burning",
    "summarized_story": "The federal government has been advised to urgently review the law prohibiting the lazy practice of bush burning in the country in other to curb both the economic loss and environmental damage caused by the obnoxious practice.\nADVERTISEMENTAregbesola emphatically challenged state governments to invest more in firefighting, adding that the FFS was only complementing state government’s efforts.\nThe minister added that, “The FFS should and is only complementing state efforts, not to take over their responsibility.\nI am repeating the call for state governments to invest more in firefighting.\nEarlier, the acting Controller-general of FFS, Karebo Samson Pere, described Dr Liman Ibrahim as a grassroot fireman, a General not only in administration but also in operations."
  },
  {
    "headline": "Shonga Farms Sold With No Trace Of Remittance – Kwara Govt",
    "summarized_story": "Kwara State government has alleged that the state had been fraudulently negotiated into underwriting the debts incurred by the former administrations in the name of Shonga Farms in Edu local government area of the state.\nThe state government insisted that Shonga Farms anchored by the displaced white Zimbabwean farmers was funded 100% at inception with taxpayers money without any gains accruing to the people of the state under whatever guise.\nThe press briefing was jointly addressed by Attorney General and Commissioner of Justice, Salman Jawondo (SAN); Commissioner for Communication, Hon.\nIt said AMCON had to hold the state responsible because it is listed among the shareholders of Shonga Farms Holdings Ltd, even though its share is not anywhere commensurate with its huge investments in the project.\nBut rest assured that we will prosecute everyone involved when we get all the evidences,” Jawondo said."
  },
  {
    "headline": "JUST-IN: Unknown Gunmen Kill 3 Policemen In Enugu",
    "summarized_story": "There is palpable fear and apprehension in Enugu State on Thursday following the murder of three policemen by unknown gunmen.\nThe deceased policemen were carrying out a stop-and-search operations along Timber Junction close to the popular Cashew Bus Stop, Independence Layout in Enugu when the attackers struck.\nIt was gathered that the unknown gunmen shot sporadically in the air to scare away passers-by before killing the policemen.\nADVERTISEMENTIt was gathered that one of the policemen at the spot escaped when the hoodlums struck around 12 noon.\nWhen contacted, the spokesman of the Enugu State Police Command, Daniel Ndukwe, said: “Information surrounding the incident is still sketchy.”The PPRO, however, added that a “manhunt of the hoodlums have been initiated."
  },
  {
    "headline": "JUST-IN: Unknown Gunmen Kill 3 Policemen In Enugu",
    "summarized_story": "There is palpable fear and apprehension in Enugu State on Thursday following the murder of three policemen by unknown gunmen.\nThe deceased policemen were carrying out a stop-and-search operations along Timber Junction close to the popular Cashew Bus Stop, Independence Layout in Enugu when the attackers struck.\nIt was gathered that the unknown gunmen shot sporadically in the air to scare away passers-by before killing the policemen.\nADVERTISEMENTIt was gathered that one of the policemen at the spot escaped when the hoodlums struck around 12 noon.\nWhen contacted, the spokesman of the Enugu State Police Command, Daniel Ndukwe, said: “Information surrounding the incident is still sketchy.”The PPRO, however, added that a “manhunt of the hoodlums have been initiated."
  },
  {
    "headline": "Ondo: My Administration Won’t Touch Local Govt Funds – Akeredolu",
    "summarized_story": "Ondo State governor, Oluwarotimi Akeredolu, has assured local government chairmen in the State that his administration will never touch money meant for the local governments.\nRather, Akeredolu said his administration will continue to ensure that the local government funds are properly utilised.\nGovernor Akeredolu explained that the vehicles were bought and distributed to the local government chairmen to ensure smooth operations at the local government level.\nAkeredolu said the vehicles distributed were bought from money that was saved from the local government funds, particularly remaining funds gathered after the payment of workers.\nAugustine Oloruntogbe, who spoke on behalf of his colleagues, thanked Governor Akeredolu for always supporting the local council chairmen in the state."
  },
  {
    "headline": "Buhari breaks silence: Suppliers of adulterated fuel must be held accountable",
    "summarized_story": "President Muhammadu Buhari has ordered that producers and providers of consumable products be held accountable for substandard services and or products sold by them.\nThe President has also given directives to the relevant government agencies to take every step in line with the laws of the country to ensure the respect and protection of consumers against market abuses and social injustices.\nThe president spoke in reaction to the issue of petroleum product shortages linked to the inadvertent supply of products of foreign origin into the Nigerian market.\nBuhari, in a statement by his spokesman, Garba Shehy, said the protection of consumer interests is a priority of the present administration.\nHe aded that his administration was ready to take all necessary measures to protect consumers from hazardous products, loss or injuries from the consumption of substandard goods."
  },
  {
    "headline": "EU votes €150 Billion for investments in Africa",
    "summarized_story": "The European Union has earmarked over 150 billion euros ($170 billion) for investments in Africa under a global fund launched to offer an alternative to Chinese money, the European Commission said on Thursday.\nEuropean Commission President Ursula von der Leyen announced the regional plan at a news conference in Dakar with Senegalese President Macky Sall.\nAt the launch of the Gateway fund in December, the EU said the money would come in the form of grants, loans or guarantees from EU institutions, governments, EU financial institutions and national development banks.\nAn EU source said the 150 billion could come in payments of 20 billion per year, of which only 6 billion would come from EU funds and the rest from EU states and private investors.\nEU officials say the financing terms offered by Beijing are often unfavourable and opaque, and make some poorer countries, especially in Africa, dependent on China through debt."
  },
  {
    "headline": "JUST IN: U.S. orders Americans out of Ukraine immediately",
    "summarized_story": "The United States has urged Americans in Ukraine to leave immediately due to the “increased threats of Russian military action.”“Do not travel to Ukraine due to the increased threats of Russian military action and COVID-19; those in Ukraine should depart now via commercial or private means,” the U.S. State Department said in an advisory.\nRussia denies planning an attack on Ukraine but has amassed tens of thousands of troops on its border with Ukraine.\nThe advisory comes amid warning by British Prime Minister Boris Johnson that the Ukraine crisis has grown into “the most dangerous moment” for Europe in decades.\nNATO also has stepped up military deployments to bolster its eastern flank, with the U.S. sending troops to Poland and Romania.\nA British Royal Air Force jet carrying 350 troops landed Thursday in Poland in a move that followed London sending anti-tank missiles to Ukraine to help boost its defences."
  },
  {
    "headline": "BREAKING: SSS Arrests Media Activist, Arogundade, At Lagos Airport",
    "summarized_story": "Mr Lanre Arogundade, Executive Director of the International Press Institute in Lagos and former President of the National Association of Nigerian Students, has been arrested by State Security Service officers.\nOn Thursday, Arogundade was apprehended at the Murtala Muhammed International Airport.\n“In fact, Mr Arogundade conducted himself as a law-abiding citizen of Nigeria throughout his stay in The Gambia.\nEven though the State Security Service said that Mr Arogundade has no right to enter Nigeria, he has not been sent back to the Gambia or any other country that might have been adopted for him.\nSince the harassment of Mr Arogundade cannot be justified, we are compelled to demand his immediate and unconditional release from the illegal custody of the State Security Service.”"
  },
  {
    "headline": "UPDATE: Armed Robbers Attack Bullion Van, Kill 3 Policemen, Four Others In Ibadan (VIDEO)",
    "summarized_story": "ARMED robbers have attacked a bullion van transporting money to a bank at Idi-Ape in Ibadan North East Local Government area of Oyo state, killing three police officers and four others.\nVanguard reports that the armed robbers, who were said to have dressed in police uniform, trailed the van to Idi-Ape and, tried unsuccessfully to intercept the bullion van at the area.\nEyewitnesses, however, told Vanguard that the robbers allegedly fired several shots at the escort van in a bid to intercept the van and cart away the money.\nIt was further learnt that the police command launched a manhunt for the fleeing robbers, with the assurance that they would be arrested.\nWatch video below:VIDEO: Gunmen rob, demobilise bullion van in Ibadan pic.twitter.com/Cw1zconDF2 — The Nation Nigeria (@TheNationNews) February 10, 2022More details shortly…."
  },
  {
    "headline": "(BREAKING): Court Nullifies Elevation Of Ibadan Baales/Mogajis",
    "summarized_story": "Justice Munta Abimbola, the Chief Judge of Oyo State on Thursday ordered elevated Baales and Mogajis in Ibadan land to return to their original positions before the setting up of the Justice Boade Commission of inquiry.\nThe court further issued an order of Perpetual Injunction, restraining them from the status of elevation or wearing crowns or coronets.\nJustice Abimbola in his judgment said he finds no merit in their application before the court, dismissed it in its entirety and answered all their questions in the negative.\nHe further held that all government’s actions must be in compliance with the law of the land."
  },
  {
    "headline": "2023 Presidency: Northern Elders Blast Gov. Akeredolu",
    "summarized_story": "The Northern Elders Forum (NEF), has expressed dismay with the utterances of Governor of Ondo State, Rotimi Akeredolu, for saying a northern presidential candidate will lose the 2023 election if fielded by any political party.\nDr Hakeem Baba-Ahmed, the Director of Publicity and Advocacy of NEF said every northerner had the right to aspire for the presidential position in 2023.\nHe opined that the utterances of Gov.\nHe explained that all the threats, ultimatums and demands that were coming from politicians from the South would not help matters.\nHe observed that what was missing in Nigeria presently was an elite consensus of what it takes to get the country to survive between now and 2023 elections."
  },
  {
    "headline": "VIDEO: Pandemonium as gunmen invade Ibadan, kill policemen inside bullion van",
    "summarized_story": "Ibadan, Oyo state capital on Thursday witnessed ugly scenario when armed robbers rained bullets on a bullion van.\nBlueprint gathered that the incident led to the death of at least three policemen.\nPolice authorities are yet to react to the latest development.\nHowever, the incident has erupted panic within Ibadan."
  },
  {
    "headline": "Breaking: Super Eagles rise in latest FIFA ranking, 4 days after AFCON 2021 tourney",
    "summarized_story": "Despite dropping out of the just concluded Africa Cup of Nations in Cameroon, Nigeria’s Super Eagles have pushed up in latest February 2022 FIFA ranking.\nNigeria is currently placed third on the continent, and 32nd globally, according to ranking released Thursday morning, four days after AFCON 2021 ended in Cameroon.\nMorocco is now placed 2nd (Africa) and 24th (globally).\nEgypt (34th) and Tunisia (36th) in fourth and fifth positions respectively complete current top five in the continent.\nBelgium, Brazil and France are topping global ranking in the first, second and third places respectively."
  },
  {
    "headline": "Breaking: NNPC exposes companies responsible for importing adulterated fuel *See full list",
    "summarized_story": "The Nigeria National Petroleum Company Limited (NNPC) has disclosed that MRS, Duke Oil, OandO, and Emadeb imported the adulterated fuel that is responsible for the present fuel scarcity being experienced in Nigeria.\nIn a statement by NNPC spokesman, Mohammed Garba Deen, the GMD of NNPC, Mele Kyari, was quoted as explaining that after investigations, the Company discovered the presence of Methanol in four PMS cargoes imported by Direct-Sale-Direct-Purchase (DSDP) suppliers.\nHe noted that cargoes quality certificates issued at loadport (Antwerp-Belgium) by AmSpec Belgium indicated that the gasoline complied with Nigerian Specification.\n“The NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification,’’ he said.\nImporter Vessel Name Load Port1 MRS — MT Bow Pioneer — LITASCO Terminal, Antwerp-Belgium2 Emadeb/Hyde/AY Maikifi/Brittania-U Consortium —- MT Tom Hilde —- LITASCO Terminal, Antwerp-Belgium3 Oando — MT Elka Apollon — LITASCO Terminal, Antwerp-Belgium4 Duke Oil —– MT Nord Gainer —-LITASCO Terminal, Antwerp-Belgium"
  },
  {
    "headline": "Two Policemen Shot Dead As Robbers Attack Bullion Van In Ibadan",
    "summarized_story": "Two policemen have been shot dead as armed robbers attacked a bullion van at the Iwo Road area of Ibadan, Oyo State.\nThe attack which happened on Thursday, left people scampering for safety as the exchange of gunshots between the robbers and security agents attached to the bullion van lasted for some minutes.\nCommuters were forced to abandon their cars in the middle of the road as security operatives struggled to repel the attack.\nShe, however, said that one of the robbers was also shot dead during the attack but the robbers made away with his body.\nWhile describing the attack as a coordinated one, Onadeko said all exit points in Ibadan have been placed on red alert."
  },
  {
    "headline": "Troops Kill 120 Fighters, Arrest 50 BH/ISWAP Terrorists In Three Weeks",
    "summarized_story": "Troops of Operation Hadin Kai have neutralized 120 Boko Haram/Islamic State West Africa Province (ISWAP) fighters within the theatre of operation in Borno State.\nThis, according to the Defence Headquarters, was a feat attained with the last three weeks of operations within the region.\nOthers include Kukawa, Chibok as well as Sambisa Forest, KirtaWulgo in Marte Local Government of Borno State.\nAccording to him, five gun trucks, 50 assorted arms and 200 rounds of different calibers of ammunition were captured from the terrorists.\nHe highlighted that out of the 965 terrorists that surrendered within the period under review, 104 are from the ISWAP camp that surrendered to Nigerian troops at Marte."
  },
  {
    "headline": "Reps Ask NNPC To Suspend Companies That Imported Adulterated Fuel",
    "summarized_story": "Members of the House of Representatives have called on the Nigerian National Petroleum Company (NNPC) Limited to suspend the four companies which recently imported adulterated fuel into the country.\nThey asked that Nigerians whose vehicles and equipment were directly affected by the adulterated fuel be compensated.\nAdulterated Fuel and Long QueuesThere was anxiety in Lagos, Abuja, and some parts of the country on Tuesday when long fuel queues emerged due to the scarcity of the product.\nSome fuel stations were locked while a few which were opened had long queues of motorists waiting to buy fuel.\nThe Federal Government in reaction said the scarcity and panic buying of fuel was due to excess methanol in some fuel."
  },
  {
    "headline": "Restructuring: ‘No Justice’ In What Bayelsa Gets From Oil Revenues, Says Governor Diri",
    "summarized_story": "﻿Bayelsa State Governor Douye Diri on Thursday criticised the federal allocation revenue system as unfair to Bayelsa State and the Niger-Delta region.\n“And that’s why we are talking about restructuring, that’s why we are talking about the amendment of our country’s constitution.\nAnd anybody who bandies these figures, you are annoying the people of Bayelsa State, and indeed the people of the Niger-Delta.\nAnd nobody will be talking about Bayelsa State being insolvent or any other state in the Niger Delta for that matter.\n“A lot of people make a mistake and say we used cocoa money to developed oil, that’s not true."
  },
  {
    "headline": "EU Chief Unveils 150bn Euro Investment Plan For Africa",
    "summarized_story": "EU chief Ursula von der Leyen on Thursday unveiled plans to muster investment of more than 150 billion euros for Africa, proclaiming Europe to be the continent’s biggest and “most reliable” partner.\nSeen as a response to China’s Belt and Road initiative, the strategy will use funding from EU institutions and member countries to leverage private-sector investment.\nThe EU has set a target date of 2030 for the African funds under the plan, according to a document from the European Commission.\n“At the summit, investments will be at the heart of the discussions because they are the means of our shared ambition,” von der Leyen said.\nChina and RussiaSpeaking to AFP before arriving in Senegal, von der Leyen warned that foreign investment in Africa too often came with “hidden costs” attached."
  },
  {
    "headline": "FCT Council Polls: Ortom vows to resist any form of rigging",
    "summarized_story": "The Benue State Governor Samuel Ortom has vowed to resist any form of rigging or manipulation in Saturday’s Abuja territory elections.\nAdvertisementLast minute preparation for Saturday’s Abuja territory elections necessitated this gathering of critical stakeholders of the country’s main opposition party at the instance of the campaign council Chairman.\nHe quickly goes into the business of the day by setting the tone for the closed door session.\nAdvertisementAccording to him the ruling party has made their job pretty simple by its abysmal performance.\nThe meeting was attended by Governor’s of Benue ,Oyo, Bauchi and Rivers State as well as Senators, former Governor’s, former Senators and other party leaders."
  },
  {
    "headline": "Zamfara Assembly orders Chief judge to set up panel to investigate deputy Gov. -",
    "summarized_story": "The Zamfara State House of Assembly has directed the state Chief Justice to set up investigative panel on the alleged gross misconduct leveled against the state Deputy Governor Mahdi Aliyu Gusau.\nThe House during it’s 120 Plenary unanimously agreed that the Deputy Governor be investigated for breaching Sections 190 and 193 (1), (2) (a)(b)(c) of the Constitution of the Federal Republic of Nigeria.\nAdvertisementThis Development is coming barely twenty four hours after the House served all members with Notice of Impeachment of the Deputy GovernorEighteen out of the twenty two members of the House voted for in favour of the motionAdvertisementThe only PDP Lawmaker representing Zurmi East Salihu Usman was also not present at the plenaryThe Zamfara assembly is accusing the deputy of abuse of office, saying he has breached sections 190 and 193 (1), (2) (a)(b)(c) of the ConstitutionAdvertisementThe Zamfara State House of Assembly had on Monday through the Secretary to the state government served the deputy Governor an impeachment noticeA federal high court in Abuja had in November last year restrained the Zamfara Assembly from any move to impeach the deputy GovernorAdvertisementThe crisis between the Zamfara Assembly and deputy Governor started a few weeks after the formal Defection of Governor Bello Matawalle from the People’s Democratic Party to the ruling APC.\nAdvertisement"
  },
  {
    "headline": "Bagudu swears-in 21 LG chairmen, asks them to develop grassroot potential -",
    "summarized_story": "The newly elected chairmen and vice chairmen of the twenty one local government areas of Kebbi state have been advised to pay attention to the economic potential and other opportunities in their various domain.\nKebbi state governor, Atiku Bagudu gave the advised shortly after the elected council officials took their oath of office at a ceremony held at Birnin Kebbi.\nAdvertisementHe says the council executives should also be interested in how those economic potential can be developed and explore for the benefit of the nation and their immediate environment.\nThe governor said, with the oath of office administered on them, partisanship should be kept aside and work for the entirety of the people of the local government irrespective of political party affiliation.\nAdvertisementThe twenty one council chairmen and their vice chairmen are all of the All Progressives Congress APC and sixteen of the twenty and fifty five councillors elected across the twenty one.local government, sixteen of them are women."
  },
  {
    "headline": "Niger State APC adopts consensus to choose National Convention delegates -",
    "summarized_story": "The Niger state chapter of the All Progressives Congress says it will use consensus to choose a candidate to represent the state at the upcoming national chairmanship election.\nState Chairman of the party Haliru Jikantoro disclosed this while receiving reports of the reconciliation committee at the state party secretariat in Minna.\nThis led to the formation of factions running a parallel state Congress.\nBarely a week after the state APC chairmen were in inaugurated at the national office in Abuja, the reconciliation committee led by Bawa Bwari are in the Niger state office of the party to present the report of the committee to the state working committee.\nThere is Yet another problem up ahead with three aspirants contesting for the position of national chairman of the party from the state."
  },
  {
    "headline": "Nigeria: Gunmen Attack Bullion Van in Ibadan, Kill Policemen, Others",
    "summarized_story": "Armed robbers on Thursday attacked a billion van in Ibadan, the Oyo state capital, and allegedly killed two policemen and some civilians.\nIt was gathered that the two policemen allegedly killed during the attack were some of the officers that were accosting the bullion van.\nBlood stains were seen everywhere while the bullion van was riddled with bullets with its glasses shattered and tires burst.\nThe bullion van was attacked at the Idi-Ape junction, opposite Mary Hills.\nOne of the police men on escort with the bullion van shot dead one of the robbers and they carried the robber that was shot with them."
  },
  {
    "headline": "FIFA Clears Leicester’s Ademola Lookman to Represent Nigeria",
    "summarized_story": "The Nigeria Football Federation says it has received the decision of world football –governing body, FIFA, that Leicester City FC of England player Ademola Lookman can now represent Nigeria at international level.\nEmilio Garcia Silveiro, FIFA’s Chief Legal and Compliance Officer, on Thursday conveyed to the NFF the decision of the Single Judge of the Status Chamber of the Football Tribunal:“The request made by the NFF – Nigeria Football Federation for a change of association of the player Ademola Olajide Lookman is accepted.\n“We sent in the application on Wednesday night after putting all the necessary documentation together.\nWe are happy to receive the approval today.”Only in December 2021, FIFA also approved the NFF’s application for the switch in allegiance for Ashleigh Megan Plumptre to represent Nigeria internationally.\nBoth Lookman and Plumptre had represented England at various junior cadres."
  },
  {
    "headline": "AfCFTA Secretariat, Afreximbank Seal Deal on $10bn Fund to Boost African Economies – Arise News",
    "summarized_story": "Already, Afreximbank has committed $1 billion towards the ADF, which is made up of a base fund, a general fund and a credit fund.\nThe AfCFTA Secretariat and the Afreximbank stated that base fund would consist of contributions from state parties (which is AfCFTA member countries), grants and technical assistance funds to address tariff revenue losses as tariffs are progressively eliminated.\nThe base fund, according to the two continental institutions, would also support countries to implement various provisions of the AfCFTA agreement, its protocols and annexes while the general fund would mobilise concessional funding.\n“These are some of the initiatives that we are proud to implement in close collaboration with the AfCFTA Secretariat, setting the conditions that will undoubtedly lead to a smooth implementation of the AfCFTA.\nWe will be launching the general fund and credit fund very soon to address the needs of the private sector including the small and medium enterprises, women and youth."
  },
  {
    "headline": "P&ID: Court Revives Nigeria’s Bid in $10bn Award Feud",
    "summarized_story": "The appeals court vacated US District Judge, Paul A. Engelmayer’s late 2020 decision denying Nigeria’s petition to subpoena VR Advisory Services Limited for information the country hopes would bolster criminal proceedings in Nigeria.\nVR Advisory is a Manhattan asset manager that acquired a 25 per cent stake in P&ID in 2018.\nJudge Engelmayer had concluded in his decision that Nigeria’s petition appeared to be an attempt to avoid US DOJ scrutiny of its request.\nThe appeals court said neither the US Supreme Court nor any federal appellate court had previouslyconsidered whether a foreign sovereign that has a mutual legal assistance treaty with the U.S. circumvents that treaty by filing a Section 1782 application in the district court.\nVR Advisory was represented by Michael S. Kim, Zachary Rosenbaum, Josef M. Klazen and Darryl Stein of Kobre & Kim."
  },
  {
    "headline": "Africa’s GDP Declined by $165bn in 2020, Lowest in 20 Years, Says AfDB Chief Adesina – Arise News",
    "summarized_story": "President of the African Development Bank (AfDB), Dr. Akinwunmi Adesina, has painted a gloomy picture of Africa, saying dwindling economic fortunes in 2020 resulted in $165 billion decline in the continent’s Gross Domestic Product (GDP).\nAfrica witnessed a decline in GDP growth of 2.1 per cent in 2020, its lowest in 20 years.\nThe African Development Bank plans to invest $3 billion to support pharmaceutical and vaccines manufacturing capacity for Africa.\nHe added, “To enhance the security of Africa, the African Development Bank is currently developing Security Indexed Investment Bonds.\nTo boost financial support for the businesses of our youth, the African Development Bank Group is exploring with countries the establishment of Youth Entrepreneurship Investment Banks."
  }
]