[
  {
    "headline": "All not well at Maritime varsity, VC admits",
    "summarized_story": "The Vice-Chancellor declared, “On the issue of N3billion said to have been released by NIMASA, no such money was sent down here.\nYou see, the way funds are being monitored in the country today, you cannot misappropriate funds again.\nSo if I’ve diverted such huge funds, by now they would have come after me.\n“Permit me, therefore, to set the record straight that at no time was such money released for the settlement of allowances by NIMASA.\n“If such money had been released to this institution, I think I would be most excited and I’m sure everybody would have been smiling by now."
  },
  {
    "headline": "US sets global record, announces over one million COVID-19 cases in single day",
    "summarized_story": "The United States recorded more than one million Covid-19 cases on Monday, according to data from Johns Hopkins University, as the Omicron variant spread at a blistering pace.\nThere were 1,080,211 new cases in the country, a global record, with the number of cases doubling on the previous week.\nIt comes a day after top US pandemic advisor Anthony Fauci said the country was experiencing “almost a vertical increase” in Covid-19 cases, adding the peak may be only weeks away.\nWith 9,382 deaths over the past seven days, the nation’s death toll has fallen by 10 percent, week on week.\nThe US record during previous waves was 258,000 cases per day, for the week of January 5 to 11, 2021."
  },
  {
    "headline": "PDP condoles with Ozigbo over father’s death",
    "summarized_story": "The Peoples Democratic Party has condoled with the governorship candidate of the party in the November 6 Anambra State governorship election, Mr Valentine Ozigbo, over the death of his father.\nThe PDP described the news of the death of Ozigbo’s father as shocking, just as it prayed that God grants the entire Ozigbo family the fortitude to bear the loss.\nHe said that the entire members and leadership of PDP in Anambra State sympathise with Ozigbo and his family at their moment of grief.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Free train: The ‘promised change’ is here, Obidike praises President Buhari",
    "summarized_story": "Obidike said this feat is particularly impressive considering the comatose state of the railway system before the coming of the present administration.\nIn his words ‘’ President Buhari is implementing the promised change.\nThe federal government is issuing free transport tickets to Nigerians who are traveling for the festive season.\nObidike said that it was important to look back and take stock.\nHe said that the APC change is a prayer answered."
  },
  {
    "headline": "South-East Attacks: This madness must stop, IPOB warns security agents",
    "summarized_story": "By Arogbonlo IsraelThe Indigenous People of Biafra, IPOB, has warned those behind incessant attacks in the South-East, saying “they (criminal elements) have as usual resorted to lies and propaganda to deceive the gullible minds”.\nThe group claimed some criminal elements parading as security agents are the ones behind the incessant killings in a bid to demonise IPOB.\n“It is true that we criticise some traitors among our people including politicians, traditional rulers, and even fake religious leaders.\n“Some wicked people in collaboration with the security agents are the masterminds of the insecurity in our land.\n“Many buildings were burnt down in Umutanze, Amaifeke in Orlu and Orsu by compromised security agents in Imo."
  },
  {
    "headline": "[BREAKING] Naming Sponsors of Insecurity: Tension in Imo, as stakeholders arrive venue",
    "summarized_story": "By Chinonso Alozie, OwerriThe Imo state governor, Hope Uzodimma, has put tension in Imo state, as stakeholders throng to Owerri, to hear from him (Uzodimma) the names of those who have been sponsoring insecurity in Imo state.\nThe governor has announced he would announce the names of the alleged sponsors of the insecurity in Imo state today (Tuesday).\nAlso Read:At the time of filing this report, many stakeholders have started arriving at the venue of the event, the Sam Mbakwe Executive chamber in the government house in Owerri.\nFor now, some of the dignitaries present include; The president of Ohanaeze Ndigbo Worldwide, Professor George Obiozor, the former Senator who represented Imo North senatorial district, Matthew Nwagwu, the Imo State Commissioner for Police, Hussani Rabiu, former minister of Information, Walter Ofonagoro, speaker Imo state House of Assembly, Kennedy Ibeh, former deputy governor, Jude Agbaso.\nAlso, former Imo state House of Assembly, Speakers and Deputies, former and present members of the Imo state house of assemblies among others."
  },
  {
    "headline": "2023: PDP out to trounce APC in S-West, says Teslim Balogun",
    "summarized_story": "Balogun gave the hints at the weekend, while paying a courtesy visit to PDP leaders in southwest, Ambassador Taofeek Arapaja and Mr Soji Adagunodo, in Ibadan, Oyo state.\nHe said: “I came on solidarity visits to our leaders in the southwest with the assurances that our party, the PDP will reclaim the southwest, and trounce APC in Lagos in the next elections.\n“I want to also assure our leaders of my support in ensuring unity within the ranks of the party.\nI promise to make sure that peace reigns supreme in PDP family in Lagos.”Responding, Amb.\nAlso, Mr Adagunodo in his remarks, expressed appreciation at the visit, saying the party leaders would ensure that all aspirants of the party would have a free and fair primaries across the state."
  },
  {
    "headline": "Navy warns public against falling prey to fraudulent recruitment websites",
    "summarized_story": "The Nigerian Navy has alerted the public to be wary of fraudulent websites currently claiming to offer recruitment opportunities for unsuspecting applicants wishing to join the forceIt urged the public to ignore the fake websites and only link up with the authorized and authentic Nigerian Navy website for such exercise.\nA statement by Commodore Suleman Dahun, Director of Naval Information, said, “The attention of the Nigerian Navy (NN) has been drawn to the existence of fraudulent websites offering innocent and unsuspecting members of the public recruitment opportunities in the ongoing Nigerian Navy Basic Training School (NNBTS) Batch 33 recruitment exercise.\n“Against this background, it has become necessary to advise members of the public to only visit the official recruitment website, https://joinnigeriannavy.com/application-guidelines/ for the purpose of the online registration of the exercise.\n“The NN also reiterated that the online registration for the NNBTS Batch Recruitment Exercise has commenced on 3 January and will close on 13 February 2022.”Vanguard News Nigeria"
  },
  {
    "headline": "Zamfara bandit kingpin, Bello Turji releases over 70 kidnap victims",
    "summarized_story": "A suspected bandit leader, Bello Turji who has been on the security wanted list, has freed over 70 victims in his custody in Zamfara State.\nThe development was disclosed by the Co-Chairman of the state Committee on Finding Lasting Solutions to Banditry, Dr. Abdullahi Shinkafi on Tuesday.\nDr. Abdullahi told Channels Television that the victims were freed by the bandit kingpin unconditionally, stressing that the development was a sequel to a military air raid on bandit camps in the state.\nAccording to reports, 70 victims were released following dialogue between the assailants and some local authorities in the state.\nIt was also gathered that arrangements are being made to evacuate all freed victims to the state capital, Gusau, for profiling and medical treatment before they are released to their families."
  },
  {
    "headline": "Igbo monarchs, bishops to meet Uzodinma, others over Imo crisis",
    "summarized_story": "The South East Council of Traditional Rulers and Representative of Igbo Archbishops and Bishops have expressed concern about the heightened insecurity and political crisis in Imo State.\nThe Igbo leaders also resolved to intervene and meet with Imo Governor, Senator Hope Uzodinma; the former governorship candidates and elders of the state to find ways to tackle the insecurity and political crisis rocking the state.\nContinuing, the Igbo leaders pointed out that the state of affairs in Imo is largely blamed on a few politicians of the state and their cohorts which have constituted an assault on the dignity and well being of the people of Imo and the Igbo nation.\nAs such we call on all the political gladiators, requesting that they note that the ethos of ndigbo is stepped in ‘egbe belu Ugo ebelu’.\nWe know what fate is cast on the one that does not allow the other to perch”."
  },
  {
    "headline": "Bandits hide in caves while military bombards women, children, cows – Yobe traditional ruler",
    "summarized_story": "Tukur Mamu, a traditional title holder in Yobe State, has made a fresh revelation about bandits and military bombardments in the state.\nMamu, believed to be in the camp of Sheikh Ahmad Gumi, said bandits told them that they usually run into caves whenever they hear the sound of military aircraft.\nThe ‘Dan Iyan Fika’ in Yobe State said women, children, and cows are affected by air raids and not bandits.\nSpeaking with journalists yesterday, the traditional ruler, faulted the approach of security agents in fighting banditry and terrorism.\nThe traditional ruler charged the military to provide evidence that bandits’ camps were actually bombarded."
  },
  {
    "headline": "Bashir Tofa: We’ve lost key defender of our interests – NEF",
    "summarized_story": "The Northern Elders Forum (NEF) says the demise of June 12, 1993, National Republican Convention presidential election, Alhaji Bashir Othman Tofa, has denied the north an indefatigable defender of the region’s dignity and values.\nThe forum, in a condolence message issued by its Director of Publicity and Advocacy, Hakeem Baba-Ahmed, noted that the north lost a loyal founding member, a firm believer in responsible and visionary leadership.\nAccording to the statement, “Northern Elders Forum (NEF) and Nigerians are deeply saddened by the death of Alhaji Bashir Othman Tofa.”The statement explained that Nigeria has lost an illustrious son, a consummate politician who was denied the opportunity to provide leadership with the annulment of the Presidential elections In 1992.\nThe forum, however, condoled with the Supreme Council for Sharia in Nigeria, the people of Kano and Nigerian Muslims over the demise of Dr Datti Ahmad.\nIt also prayed that Allah (SWA) will reward him for his pioneering service to his community with Aljannah Firdausi."
  },
  {
    "headline": "COVID-19: NCDC confirms six deaths, more cases in 10 States, FCT",
    "summarized_story": "The Nigeria Center for Disease Control, NCDC, says about six persons have died in the last 24 hours following complications from the COVID-19 disease.\nThe health agency, while making the announcement on Tuesday morning, said 670 fresh cases were also recorded in 10 states and the Federal Capital Territory, Abuja.\nNCDC made this known in an updated post on its official Facebook page.\nThe development brings the total number of confirmed cases in the country to 244,120, with 216,180 recoveries, while about 3,045 patients have died following complications from the dreaded virus.\nThe post reads, “670 new cases of #COVID19Nigeria:Lagos-277Kaduna-199FCT-120Kwara-20Abia-14Rivers-11Gombe-9Katsina-9Bauchi-6Edo-3Cross River-2244,120 confirmed216,180 discharged3,045 deaths“A breakdown of cases by State can be found via http://covid19.ncdc.gov.ng“."
  },
  {
    "headline": "PHOTOS: Magodo residents protest presence of over 50 policemen",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "BREAKING: Magodo residents protest presence of over 50 policemen",
    "summarized_story": "Residents of Magodo Phase II Estate in Lagos are protesting the presence of over 50 armed policemen in their estate.\n- Advertisement -They queried the presence of the policemen who were said to have been in the estate since last month.\nSome of the inscriptions read: “Lagos Attorney-General prosecute those involved in illegal invasion of Magodo Phase 2 you promised”, “Magodo Phase 2 has been under siege of the IGP’s anti-riot police squad for three weeks”.\nSpeaking with our correspondent, the Chairman of Magodo Residents’ Association, Bajo Osinubi, said: “We called our people out to protest this morning.\nWe are supposed to be at work, but we want the whole world to know what’s happening at Magodo."
  },
  {
    "headline": "Akeredolu dares PDP: report me to EFCC",
    "summarized_story": "Ondo State Governor Oluwarotimi Akeredolu has dared the opposition Peoples Democratic Party (PDP) to report him to the Economic and Financial Crimes Commission (EFCC), over the alleged N500million spent on a concert tagged: ‘Countdown Show to Herald 2022’.\nSpokesman for the Ondo PDP, Kennedy Peretei, had in a statement alleged that N500millon was spent on the concert anchored by the governor’s son in-law, Michael Olatunde.\nAkeredolu, in a statement by Information and Orientation Commissioner Donald Ojogo, challenged the PDP to show proof that he registered 13 companies in 2017.\nHe urged the opposition party to publish the names of directors of the companies as well as the names of the companies.\nTherefore, the PDP must hurry to report this to the EFCC for investigation."
  },
  {
    "headline": "Southeast most qualified to produce Buhari’s successor, says Ikpeazu",
    "summarized_story": "Abia State Governor Victor Ikpeazu has said the Southeast is the most qualified zone to produce the next President in 2023.\nHe stated that all the Igbo were asking was to be given a chance to produce President Muhammadu Buhari’s successor.\n“In the Southeast and indeed across the country the credentials of Senator Anyim stand very tall,” Ikpeazu said.\nAlso on Sunday, Ikpeazu, and Wike restated the need for the PDP to forge a united front to rescue Nigeria.\nIkpeazu described Wike as a courageous and patriotic leader, who is committed to the unity of the nation."
  },
  {
    "headline": "Olubadan: Ibadan chiefs disagree over sucession",
    "summarized_story": "A strange succession crisis has hit Ibadanland, following the passage of the Olubadan, Oba Saliu Adetunji.\n- Advertisement -Lana, who is counsel to Ladoja in his suit against elevation of high chiefs to obas in 2017, warned Makinde against the ‘dangers’ of approving Balogun as the next Olubadan.\nHe stressed that approving Balogun while still holding on to the title of an oba, may create the ground for legal battles, which are alien to the Olubadan throne.\nShould Balogun be disqualified, Ladoja may be the next Olubadan as he is next-in-line on the Olubadan line, which is to produce the next Olubadan.\nThe Olubadan-in-Council said the elevation granted its members, who also serve as kingmakers, had not in anyway altered the age-long and enviable traditional succession plan to the Olubadan throne."
  },
  {
    "headline": "Lagos blue, red lines rail begins operation Q4, says Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Governor, Babajide Sanwo-Olu, yesterday, said the much-awaited blue and red lines trains are to commence operation before the fourth quarter of the year.\nHe stated this when he took a tour of the train project from Ikeja, where the red line begins to Yaba, Ebute Meta and finally to Marina where the blue line terminates.\n“Our promise on the blue and the red line is still on course.\nThe red and blue line rail is part of the intermodal transportation system of the Babajide Sanwo-Olu administration in reducing gridlock and ensuring interconnectivity in different parts of the state.\nAnd when completed, the 37 kilometres Red Line Rail Project will link Agbado to Marina, while the 27.5 kilometres Blue line Rail Project will run from Okokomaiko to Marina."
  },
  {
    "headline": "3 killed in Plateau, Lalong vows to sign death penalty for kidnappers – The Sun Nigeria",
    "summarized_story": "From Gyang Bere, JosNo fewer than three persons have been reportedly killed by gunmen at Rafin Bauna in Bassa Local Government Area of Plateau State.\nIt was gathered that the victims were ambushed and killed by their assailants.\nPlateau State Governor, Simon Lalong, in a press statement signed by Director of Press and Public Affairs, Makut Simon Macham, condemned the attack and urged security operatives to unmask the perpetrators.\nHe sympathised with the families of the victims and assured them that justice would be done.\nMeanwhile, he has warned kidnappers to leave the state as anyone who caught and convicted for kidnapping would face the death penalty."
  },
  {
    "headline": "Electoral bill: Nigeria not ripe for direct primary –IPAC",
    "summarized_story": "From Fred Ezeh, AbujaInter–Party Advisory Council (IPAC) has commended the decision of President Muhammadu Buhari to withhold assent to the amended Electoral Act Bill due to the inclusion of compulsory direct primary for political parties.\nIPAC said the president was right in rejecting the bill, stressing that at this stage of democratic journey, Nigeria does not appear to be sufficiently ripe and prepared for the direct primary model in the selection of political party standard bearers.\n“The only expressed grouse of the president was the mandatory use of direct primary in the selection of standard bearers of all the political parties.\n“This should not be a difficult task given that the two arms are, incidentally, controlled by the same political party, the All Progressives Congress.\nLawmakers should simply expunge the clauses regarding direct primary, thereby, saving the other provisions among which are the one on the mandatory electronic transmission of election results by INEC."
  },
  {
    "headline": "Buhari, Ganduje, Atiku, Kalu, Anyim, ACF, others mourn as Tofa is buried in Kano",
    "summarized_story": "The ruling party boss and Yobe State governor equally condoled with the government and people of Kano State.\nHe prayed Allah to grant him eternal rest in Aljannatur Firdausi and to grant his family, associates and the people of Kano State the fortitude to bear the loss.\nIn his reaction, former Abia State governor, Dr. Kalu, described the death of Tofa as a huge loss to the country.\nThe former governor conveyed his condolences to the government and people of Kano State, Emir of Kano and Kano Emirate Council over the irreplaceable loss.\n“We condole with his immediate family, the Kano business community, Kano ACF chapter, Kano State government for the loss of their eminent son, Tofa,” the group said in the statement."
  },
  {
    "headline": "2023: S’East most qualified to produce Buahri’s successor -Anyim – The Sun Nigeria",
    "summarized_story": "From Okey Sampson, Umuahia and Chijioke Agwu, AbakalikiFormer Senate president and former secretary to the government of the federation (SSG), Anyim Pius Anyim, yesterday, said South East is the most qualified zone to produce the next president of the country in 2023.\nIkpeazu assured Anyim of his support and the support of the party in the state, stressing that 2023 was indeed the turn of the South East.\nHe described Anyim as a man whose public service credentials and experience are good enough to be the president of Nigeria.\nHe said in the South East and, indeed, across the country today, “the credentials of Anyim stand very tall.”Meanwhile, Anyim would, on Thursday, formally brief leaders and stakeholders of the South East over his presidential ambition.\n“In October last year, I declared my interest to contest for presidency in 2023 under the auspices of the PDP."
  },
  {
    "headline": "No Controversy on Who Becomes Next Olubadan, Say Ibadan High Chiefs",
    "summarized_story": "Curiously, the Osi Olubadan, High Chief Rasheed Ladoja, and two other members of the council were absent at the meeting.\nSanwo-Olu said in the message, “On behalf of the government and people of Lagos, I commiserate with my brother, the Oyo State Governor, Engr.\n“The death of Oba Adetunji is a great loss to the people of Ibadan and he will be greatly missed.\n“Late Oba Adetunji was a patriotic Nigerian, who was deeply committed to the peace, unity and development of our country.\nHis nearly six years on the throne brought peace and great development to his kingdom and the entire Oyo State."
  },
  {
    "headline": "Buhari: Tofa, True and Irreplaceable Nationalist",
    "summarized_story": "Tofa died at Aminu Kano Teaching Hospital (AKTH), in Kano State, in the early hours of yesterday after a brief illness.\nThe Emir of Kano, Alhaji Aminu Ado Bayero, and former governor of Kano State, Mallam Ibrahim Shekarau, were among prominent Nigerians that attended the funeral prayer.\nApart from the president, Kano State Governor Abdullahi Ganduje, former Vice President Atiku Abubakar, and Yobe State Governor Mai Mala Buni were among those, who sent early tributes to the deceased.\nBuhari, while leading the nation in mourning Tofa, described him as a politician of note, who was also a promoter of Islamic culture and civilisation.\nThe president described Tofa as a true nationalist that would be difficult to replace."
  },
  {
    "headline": "FG Commences Collection of Income Tax on Bonds, Short-term Securities from Today",
    "summarized_story": "•Stockbrokers express divergent view over new policyKayode TokedeThe federal government will today commence the collection of income tax on bonds, short-term securities.\nThis followed the expiration of a 2012 gazette which exempted Companies Income Tax (CIT) from bonds and short-term securities in the past 10 years.\nThe proposed charges on fixed income securities should not discourage investors from the asset class.\n“However, it will be a function of the volume an investor is buying from the fixed income market.\nA Lagos-based analyst, Mr. Moses Ojo noted that the introduction of tax income on government securities would further reduce activities."
  },
  {
    "headline": "NFF to Deny Unvaccinated Journalists Access to Eagles Training",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Nigeria Football Federation (NFF) has made the possession of COVID-19 vaccination cards mandatory for journalists wishing to cover the Super Eagles training session at the Moshood Abiola National Stadium, Abuja.\n“We appreciate you for positively projecting our darling team, the Super Eagles.\n“There will be full media access to the team’s training today, 3rd January, 2022 from 5pm.\nThere will also be 15 minutes access to all players and officials after the training.\n“In strict adherence to COVID-19 protocols, everyone will present their COVID-19 vaccination cards or PCR Test result (72hrs maximum) at the gate,” the statement said."
  },
  {
    "headline": "Breaking: Bashir Tofa, Ex-presidential Candidate, is Dead",
    "summarized_story": "By Ibrahim Shuaibu in KanoAlhaji Bashir Othman Tofa, presidential candidate of the defunct National Republican Convention (NRC) in the June 12, 1993 election, is dead.\nTofa, according to family sources, died at the Aminu Kano Teaching Hospital (AKTH) in the early hours of Monday after a brief illness.\nConfirming his death, one of the deceased relations, said: “Alhaji Bashir Tofa died after a brief illness.”Tofa was the challenger of late Chief MKO Abiola, candidate of the defunct Social Democratic Party (SDP), winner of the June 12 election.\nThe result of the election, which was not fully released officially, was annulled by the military regime of President Ibrahim Babangida.\nBorn on June 20, 1947 in Kano, the late Tofa was also a businessman, oil trader and industrialist."
  },
  {
    "headline": "EXCLUSIVE: EFCC Operative Who Exposed How Nigeria’s Attorney-General, Malami, Ordered Unfreezing Of ‘Big Cases’ Bank Accounts Detained After Leaked Audio",
    "summarized_story": "He was arrested when the audio leaked to media and was published.\nHe is being detained at the EFCC in Abuja,” the source said.\n“Yes, Malami introduced you to Ameh, so it will not be possible to debrief him,” the EFCC official said.\nAlso, his account was recently unfrozen to enable him to quickly move out the money as advised by the EFCC operative.\nFollowing the leaked audio and dust in generated, the EFCC on December 23, 2021 announced that it was investigating the issue, adding that it frowned against acts of corruption."
  },
  {
    "headline": "EXCLUSIVE: EFCC Operative Who Exposed How Nigeria’s Attorney-General, Malami, Ordered Unfreezing Of ‘Big Cases’ Bank Accounts Detained After Leaked Audio",
    "summarized_story": "He was arrested when the audio leaked to media and was published.\nHe is being detained at the EFCC in Abuja,” the source said.\n“Yes, Malami introduced you to Ameh, so it will not be possible to debrief him,” the EFCC official said.\nAlso, his account was recently unfrozen to enable him to quickly move out the money as advised by the EFCC operative.\nFollowing the leaked audio and dust in generated, the EFCC on December 23, 2021 announced that it was investigating the issue, adding that it frowned against acts of corruption."
  },
  {
    "headline": "EXCLUSIVE: EFCC Operative Who Exposed How Nigeria’s Attorney-General, Malami, Ordered Unfreezing Of ‘Big Cases’ Bank Accounts Detained After Leaked Audio",
    "summarized_story": "He was arrested when the audio leaked to media and was published.\nHe is being detained at the EFCC in Abuja,” the source said.\n“Yes, Malami introduced you to Ameh, so it will not be possible to debrief him,” the EFCC official said.\nAlso, his account was recently unfrozen to enable him to quickly move out the money as advised by the EFCC operative.\nFollowing the leaked audio and dust in generated, the EFCC on December 23, 2021 announced that it was investigating the issue, adding that it frowned against acts of corruption."
  },
  {
    "headline": "BREAKING: Boko Haram Fighters Invade Borno Community, Burn Houses, Loot Shops",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād have attacked a community in Borno State, destroying buildings and looting shops.\nSaharaReporters learnt that the terrorists attacked Komdi village in the Damboa Local Government Area of the state on Monday night, razing many houses.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "BREAKING: Boko Haram Fighters Invade Borno Community, Burn Houses, Loot Shops",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād have attacked a community in Borno State, destroying buildings and looting shops.\nSaharaReporters learnt that the terrorists attacked Komdi village in the Damboa Local Government Area of the state on Monday night, razing many houses.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "Ashleigh Plumptre, England footballer, finally gets FIFA's nod to play for Nigeria",
    "summarized_story": "The Nigerian Football Federation (NFF) has confirmed that Ashleigh Plumptre, former England youth player, has finally gotten approval to switch her allegiance to the Super Falcons.\nHe also commended the 23-year-old defender for making the switch possible with her “commitment and dedication,” adding that she “personally approached the English FA” to get the needed clearance.\n“Ashleigh personally approached the English FA directly to get the required international clearance from that end.\n“Her professionalism and unflinching desire to play for Nigeria is honestly heart-warming.\nPlumptre might get her debut when the Falcons face Ivory Coast in the 2022 Africa Women’s Cup of Nations play-off in February."
  },
  {
    "headline": "Ashleigh Plumptre, England footballer, finally gets FIFA's nod to play for Nigeria",
    "summarized_story": "The Nigerian Football Federation (NFF) has confirmed that Ashleigh Plumptre, former England youth player, has finally gotten approval to switch her allegiance to the Super Falcons.\nHe also commended the 23-year-old defender for making the switch possible with her “commitment and dedication,” adding that she “personally approached the English FA” to get the needed clearance.\n“Ashleigh personally approached the English FA directly to get the required international clearance from that end.\n“Her professionalism and unflinching desire to play for Nigeria is honestly heart-warming.\nPlumptre might get her debut when the Falcons face Ivory Coast in the 2022 Africa Women’s Cup of Nations play-off in February."
  },
  {
    "headline": "TIMELINE: N143bn in 2017, N505bn in 2021... six times n'assembly increased the budget under Buhari",
    "summarized_story": "However, history and data show that it is not uncommon for the national assembly to raise proposed budget spendings.\n2017 BUDGET INCREASED BY N143 BILLIONBuhari presented a N7.298 trillion budget estimate for 2017 to the national assembly on December 14, 2016.\n2018 BUDGET UP BY N500 BILLIONThe presidency submitted the 2018 budget proposal of N8.612 trillion to the national assembly in November 2017.\nThe lawmakers also added N3 billion to the national assembly budget, increasing it from N125 billion to N128 billion.\nIn the proposed budget, a total of N128 billion was earmarked for the national assembly, but the lawmakers increased their budget to N134 billion."
  },
  {
    "headline": "TIMELINE: N143bn in 2017, N505bn in 2021... six times n'assembly increased the budget under Buhari",
    "summarized_story": "However, history and data show that it is not uncommon for the national assembly to raise proposed budget spendings.\n2017 BUDGET INCREASED BY N143 BILLIONBuhari presented a N7.298 trillion budget estimate for 2017 to the national assembly on December 14, 2016.\n2018 BUDGET UP BY N500 BILLIONThe presidency submitted the 2018 budget proposal of N8.612 trillion to the national assembly in November 2017.\nThe lawmakers also added N3 billion to the national assembly budget, increasing it from N125 billion to N128 billion.\nIn the proposed budget, a total of N128 billion was earmarked for the national assembly, but the lawmakers increased their budget to N134 billion."
  },
  {
    "headline": "PHOTOS: Magodo residents protest planned demolition, call on Sanwo-Olu for help",
    "summarized_story": "Residents of Magodo estate phase two in Lagos are protesting the planned demolition of houses in the estate.\nAdvertisementThe residents converged in front of the estate, demanding the intervention of the state government.\nThe protesters said they are expecting Babajide Sanwo-Olu, governor of Lagos state, to address them.\nBut members of the Magodo Residents’ Association (MRA) locked up the gates leading to the exit and entry points of the estate in a bid to resist what they described as “forceful takeover”.\nOnigbanjo, however, said the verdict of the supreme court only relates to “allocation” and not “possession” of any land."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "Nigerians defy insecurity, pandemic, travel for Yuletide",
    "summarized_story": "However, the advice to stay back in safer cities fell on deaf ears as more people travelled to celebrate the 2021 festive season despite the very exorbitant transport fares, though usual because of the Christmas rush.\n“We will pay back the loan on schedule because the business is good and we are already surpassing our target for the festive season,” he said.\nI was surprised at the smooth drive and few military checks as against what we were told and expected on our journey home this festive season.\nBode Alamutu, a lawyer and entrepreneur, attributed the huge travel last year, despite the economic hardship, to natural wanderlust among Nigerians.\nBut COVID-19 impacted our passion for travel and those who cannot travel because of the cost now had to head somewhere this Christmas,” he said."
  },
  {
    "headline": "Industrial real estate offers hope with 12% annual yield",
    "summarized_story": "Across key economies in West Africa, including Nigeria, Ghana and Cote d’Ivoire, the industrial subsector has the highest prime yield of about 12 percent, according to Yomi Olugbenro, West Africa tax leader at Deloitte.\nIn Nigeria, where the yield is between 4 and 5 percent for residential, commercial office space, 9 percent and retail 8 percent, industrial real estate offers 12 percent and that is the highest in the sub-region.\nIn that country, residential real estate offers 7.5 percent, office 8.30 percent while retail gives 7.5 percent.\nIn Cote d’Ivoire, the yield for residential real estate is 7.50 percent.\nHe noted that across the five sub-regions in Africa, West Africa ranks third with regards to infrastructure development."
  },
  {
    "headline": "Loan apps defy Google, Nigeria’s data and cyber laws to humiliate defaulters",
    "summarized_story": "The numbers stored on their phones and accessed by the loan apps, were the lenders’ insurance against any inability to repay.\nAfter the lender reached out to her phone contacts, to console herself, she said in a mixture of Pidgin and English; “Who no dey borrow?\nApart from violating the terms by Google playstore, the loan apps have also been alleged to contravene Nigeria’s data privacy law on one hand, and cyber security law on the other.\nMonths later, the action taken against Soko loan has not deterred other loan apps from similar practices.\nIt is yet to be seen how this committee will ensure loan apps continue operating, without abusing the privacy of users."
  },
  {
    "headline": "Edo sets up c’ttee to audit orphanages, threatens to shut down charity homes operating as businesses – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has disclosed plans to set up a committee to monitor and audit orphanage homes in the state, threatening to close down and prosecute orphanage homes operating as businesses as against their designation as charities.\n“They build orphanage homes with the intention to make a profit, rather than for charitable purposes.\nYou will understand that the issue of human trafficking has been a very strong challenge globally and at the state level, Governor Godwin Obaseki has made serious efforts to stamp out human trafficking in Edo State.\nIt then means we must reform every department that is within the purview of this ministry.\nIt is a charity and if you do not have the heart to do charity, you cannot be in the issue of managing orphanage homes."
  },
  {
    "headline": "Edo residents hail Obaseki on ‘most peaceful Yuletide season’ on back of security reforms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Bold and courageous reforms initiated by the Edo State Governor, Mr. Godwin Obaseki have been identified as being instrumental to the relatively peaceful yuletide celebration witnessed across Edo State.\nThe governor had in the last few months mobilized communities and security agencies in the state in activating a community policing model that involved local vigilantes, who collaborate with security agencies to provide intelligence and patrols.\nThis development had forestalled crime and criminality in major cities, towns and communities across the state.\nA cross-section of residents in Edo State hailed the state government for the peaceful atmosphere in which they marked the Yuletide festivities.\nHe made all this possible with the bold reforms in security management.”..."
  },
  {
    "headline": "EDSTMA: A Boost To Obaseki’s Administration – Nigerian Observer",
    "summarized_story": "Making this assertion shortly after being bestowed with an “Award of Excellence,” during the Edo State Traffic Control and Management Agency’s (EDSTMA) end of year party and parade which held at the EDSTMA Head office on January 2, 2022, Barr.\nOlayiwola Afolabi, a Benin based legal practitioner and advocate of social Justice praised EDSTMA for being a viable traffic agency whose display of professionalism has helped to restore faith and respect in the Governor Godwin Obaseki’s led administration.\nManaging Director EDSTMA, Dennis Oloriegbe speaking on achievements for year 2021, said, aside from carrying out its basic function, which is traffic management, the agency was able to reduce traffic menace to fifty percent (50%).\nIf they keep to the law, they would not be harassed or arrested.”As part of the end of year activities EDSTMA unveiled its maiden anthem.\nThe EDSTMA headquarters brigade clinched the first prize closely followed by zones 4 and 6."
  },
  {
    "headline": "Obaseki mourns death of ex-Edo sports commissioner, Brown Ebewele – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has mourned the passing of former Edo State Sports Commissioner, Brown Ebelewe.\nMr. Ebewele, whose death was reported at the weekend was an Olympian and former National Champion, and was part of the Edo delegation to the 20th edition of the National Sports Festival, which held in Benin.\nObaseki, who bemoaned the tragic loss, said Ebewele’s passing was painful, as he still had a lot to offer Edo State and the country in general.\nAccording to Obaseki, “I am saddened by the news of the passing of seasoned sportsman and sports administrator, who made indelible contributions to the development of sports in the old Bendel State and also in Edo State.\nObaseki extended his condolences to the Ebewele family, the sports community as well as friends and associates of the deceased, praying that God will grant all the fortitude to bear the irreplaceable loss."
  },
  {
    "headline": "Malami says Buhari govt hasn’t declared bandits as terrorists after court order because it follows global best practices",
    "summarized_story": "Nigeria’s Attorney and Minister of Justice, Mr. Abubakar Malami, has said the President Muhammadu Buhari government is yet to officially designate bandits as terrorists because the government is following international best practices.\nIn the case of IPOB, Malami was able to gazette the designation of IPOB as terrorists on the same day that Justice Abdu Kafarati gave the order on September 20, 2017.\n“With that in mind, Nigeria acted, first by proscribing IPOB, taking into consideration the threats to lives and properties they have caused in the nation.\nAnd that is how the idea of looking at the activities of the bandits, cattle rustlers, kidnappers come into being.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Uzodinma names Okorocha, Nwosu as sponsors of banditry, kidnapping in Imo",
    "summarized_story": "Imo State governor, Senator Hope Uzodimma has accused ex-Governor Rochas Okorocha and his son-in-law, Uche Nwosu of being the brains behind banditry and kidnapping in the state.\nThe governor’s chief press secretary, Mr Oguwike Nwachuku made the allegation in a statement on Tuesday.\nOkorocha had said at a press conference last week that, “It appears to me as though the misery behind unknown gunmen has been unravelled by recent happenings.\nAnd what is (sic) unknown gunmen?\nUnknown gunmen now are set of policemen from government house."
  },
  {
    "headline": "Al-Ghais to succeed Barkindo as OPEC Secretary-General",
    "summarized_story": "The Organization of the Petroleum Exporting Countries (OPEC) has appointed Kuwaiti’s Haitham Al-Ghais as its next Secretary-General.\nOPEC in a statement issued after its special video conference held yesterday, said the appointment takes effect on August 1st, and will last for three years.\n“These efforts are widely credited with helping to stabilize the global oil market since the unprecedented market downturn related to the COVID-19 pandemic, and providing a platform for recovery.\n“Before being appointed Secretary-General, Mr Barkindo held a number of key roles at OPEC between 1986 and 2010, including as Acting Secretary-General in 2006.\nHe also told a Saudi-owned TV channel that the OPEC+ alliance, which gathers OPEC and other crude producers, is important for the stability and balance of oil markets"
  },
  {
    "headline": "Sanwo-Olu says Lagos rail projects will be ready this year",
    "summarized_story": "Lagos State governor, Babajide Sanwo-Olu has said the Red and Blue line rail projects will be completed in the fourth quarter of 2022.\nThe governor gave the assurance while addressing journalists after inspection of the projects at Ikeja, Yaba, Ebute Metta and Marina stations.\nThe Red and Blue line rail is part of the intermodal transportation system of the Sanwo-Olu administration in reducing gridlock and ensuring interconnectivity in different parts of the state.\nWhen completed, the 37 kilometres Red Line Rail Project will link Agbado to Marina, while the 27.5 kilometres Blue line Rail Project will run from Okokomaiko to Marina.\n”Our promise on the blue and the red line is still on course."
  },
  {
    "headline": "2023: Group Condemns Campaign Of Calumny Against Kogi Gov",
    "summarized_story": "A political support group under the auspices of ‘Got Your Back Nigeria’, rooting for the 2023 presidential aspiration of the Kogi State governor, Yahaya Bello, has said that the governor is qualified and ready to run the presidential race.\nThe group also called out politicians whose agenda, it said, was purely to tarnish the image of Governor Bello because of his presidential ambition, to stop such campaign of calumny.\nThe national coordinator of the group,Prof Chris Mustapha Nwaokobia Jnr, in a press statement on Monday, expressed displeasure over what he called campaign of lies already flying against the Kogi governor.\nSo interesting they have made the phenomenal history maker called GYB, their politics.\n“Only Governor Yahaya Bello has clearly said that when he becomes President he will improve on the profound legacies of the incumbent President."
  },
  {
    "headline": "2023: Chart A Course For APC, Obahiagbon Tells Buhari, CECPC",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) and former Member, House of Representatives, Hon.\nPatrick Obahiagbon, has advised President Muhammadu Buhari and the party’s Caretaker and Extraordinary Convention Planning Committee (CECPC), to chart a pathway for the party ahead of the 2023 general election.\nObahiagbon gave the charge Monday in Abuja, in a letter of commendation to the chairman of CECPC and Yobe State governor, Hon.\nThe former lawmaker further cautioned that personal and selfish interests must not override the interest of the party.\n“The party interest is more paramount than parochial and self centered agitations from a microscopic few,” he said."
  },
  {
    "headline": "Group Chides FCT NUJ Over Journalist Arrest Allegation Against Masari",
    "summarized_story": "A community-based organisation (CBO), Grassroots Development Initiative (GDI) has berated the Nigeria Union of Journalists (NUJ), FCT Abuja Council, for wrongly accusing the Katsina State governor, Aminu Bello Masari, of masterminding the arrest of an Abuja-based journalist, Omonu Nelson.\nADVERTISEMENTMeanwhile, the FCT NUJ had since apologised to Governor Masari after realising that it was misled and that the governor was not responsible for Omonu’s arrest.\nBut GDI said the NUJ ought to know that such unfounded allegation was capable of portraying Governor Masari in bad light and as well pitching journalists in the country against him.\n“The apology not withstanding, the Abuja NUJ failed to do the right thing, that is due diligence before making the allegation against His Excellency, Governor Aminu Bello Masari of Katsina State.\nThis is unfair to Governor Aminu Bello Masari and peace-loving people of Katsina State,” Kemi said."
  },
  {
    "headline": "Group Chides FCT NUJ Over Journalist Arrest Allegation Against Masari",
    "summarized_story": "A community-based organisation (CBO), Grassroots Development Initiative (GDI) has berated the Nigeria Union of Journalists (NUJ), FCT Abuja Council, for wrongly accusing the Katsina State governor, Aminu Bello Masari, of masterminding the arrest of an Abuja-based journalist, Omonu Nelson.\nADVERTISEMENTMeanwhile, the FCT NUJ had since apologised to Governor Masari after realising that it was misled and that the governor was not responsible for Omonu’s arrest.\nBut GDI said the NUJ ought to know that such unfounded allegation was capable of portraying Governor Masari in bad light and as well pitching journalists in the country against him.\n“The apology not withstanding, the Abuja NUJ failed to do the right thing, that is due diligence before making the allegation against His Excellency, Governor Aminu Bello Masari of Katsina State.\nThis is unfair to Governor Aminu Bello Masari and peace-loving people of Katsina State,” Kemi said."
  },
  {
    "headline": "Nigeria Envoy To Sierra Leone Turbanned In Nasarawa",
    "summarized_story": "Paramount ruler of Doma and the Andoma of Doma in Nasarawa State, Alhaji Ahmadu Aliyi Ogah, has described Nigeria’s High Commissioner to Sierra Leone Henry Omaku as an outstanding son of the area and a true ambassador of Doma, the state and Nigeria.\nThe monarch spoke at the turbanning of Omaku as the Adagba Gi DomHe charged indigenes of Doma in prominent positions to emulate Omaku by supporting the community’s development.\nHe said Omaku apart from holding sensitive positions, has travelled widely and earned the respect of his people.\nThe state governor, Engineer Abdullahi Sule.\nin his speech, praised the envoy for being a true representative of the stateThe deputy governor, Dr Emmanuel Akabe, who represented the governor at the event, appealed to the people of Nasarawa State to support the administration of Governor Sule"
  },
  {
    "headline": "Mbaka gifts gospel singer Gozie Okeke new car",
    "summarized_story": "Ejike Mbaka, has gifted a new car to gospel singer, Gozie Okeke.\nThe gospel singer took to his Instagram page on Monday to share the video of himself inside the car.\nA voice in the video stated that the gift was from the popular reverend father to the singer.\nThe singer captioned the video, “All I have to say is thank you Jesus, My father in the Lord Rev Fr.\nEjike Mbaka."
  },
  {
    "headline": "Mbaka gifts gospel singer Gozie Okeke new car",
    "summarized_story": "Ejike Mbaka, has gifted a new car to gospel singer, Gozie Okeke.\nThe gospel singer took to his Instagram page on Monday to share the video of himself inside the car.\nA voice in the video stated that the gift was from the popular reverend father to the singer.\nThe singer captioned the video, “All I have to say is thank you Jesus, My father in the Lord Rev Fr.\nEjike Mbaka."
  },
  {
    "headline": "Again, one killed in attempted attack on Imo monarch’s palace",
    "summarized_story": "The Imo State Police Command yesterday repelled an attempt to set the palace of the Chairman of Traditional Rulers Council and Eze Amaifeke in Orlu Local Government Area of Imo, Eze Emmanuel Okeke on fire.\nThe hoodlums stormed the monarch’s palace yesterday at about 1:00 p.m. with arms and assorted weapons.\n“The hoodlums, in their numbers, besieged the palace of the traditional ruler armed with assorted weapons but were subdued by the superior fire-power of the Command’s tactical teams.\nIn the process, one of them was neutralised, while others fled into the bush with bullet injuries.\nHe said the command’s tactical teams are combing the bush for the fleeing members of the gang and to recover more arms and other dangerous weapons."
  },
  {
    "headline": "Again, one killed in attempted attack on Imo monarch’s palace",
    "summarized_story": "The Imo State Police Command yesterday repelled an attempt to set the palace of the Chairman of Traditional Rulers Council and Eze Amaifeke in Orlu Local Government Area of Imo, Eze Emmanuel Okeke on fire.\nThe hoodlums stormed the monarch’s palace yesterday at about 1:00 p.m. with arms and assorted weapons.\n“The hoodlums, in their numbers, besieged the palace of the traditional ruler armed with assorted weapons but were subdued by the superior fire-power of the Command’s tactical teams.\nIn the process, one of them was neutralised, while others fled into the bush with bullet injuries.\nHe said the command’s tactical teams are combing the bush for the fleeing members of the gang and to recover more arms and other dangerous weapons."
  },
  {
    "headline": "Buhari visitors to take COVID-19 rapid test",
    "summarized_story": "Visitors to the presidential villa in Abuja will henceforth be required to take rapid COVID tests before they are allowed entrance.\nHe said the new COVID-19 testing regime is not unusual, as it is the practice in government offices in other countries.\nShehu said all visitors, including state governors, are required to take the COVID-19 rapid test before entry into the presidential villa.\n“Yes, a new regime of COVID-19 regulation has been put in place for all visitors to the Villa, not for Governors alone.\n“Every visitor to the Villa, not just those seeing the president, is now required to do a rapid test at the gate."
  },
  {
    "headline": "Iheanacho, 8 others arrive Super Eagles camp 5 days to AFCON",
    "summarized_story": "The England-based trio of Kelechi Iheanacho, Alex Iwobi and Wilfred Ndidi were amongst nine players who arrived at the Super Eagles Bolton White Hotel camp in Abuja on Tuesday – with just five days to the commencement of the Africa Cup of Nations (AFCON) in Cameroon.\nThe other players who arrived in the early hours of Tuesday morning include three other English-based players, namely: Frank Onyeka (Brentford FC, England); William Ekong (Watford FC, England) and Oluwasemilogo Ajayi (West Bromwich Albion, England).\nOthers include; Kenneth Omeruo (CD Leganes, Spain); Olaoluwa Aina (Torino FC, Italy) and Kelechi Nwakali (SD Huesca, Spain).\nNo fewer than five players are still been expected including, Jamilu Collins (SC Padeborn 07, Germany); Tyrone Ebuehi (Venezia FC, Italy); Joseph Aribo (Glasgow Rangers, Scotland); Samuel Chukwueze (Villarreal FC, Spain) and Odion Ighalo (Al-Shabab Riyadh, Saudi Arabia).\nThe 33rd edition of the AFCON will hold in Cameroon from Jan. 9 to Feb. 6, 2022."
  },
  {
    "headline": "BREAKING: Boko Haram Terrorists Invade Borno Community, Burn Houses, Loot Shops",
    "summarized_story": "Militants from Boko Haram’s Islamic State-backed West Africa Province (ISWAP), formerly known as Jam’at Ahl as-Sunnah lid-Da’wah wa’l-Jihd, stormed a community in Borno State, demolishing buildings and stealing shops.\nTerrorists assaulted Komdi village in the Damboa Local Government Area of the state on Monday night, razing numerous homes, according to SaharaReporters.\nHe went on to say that the army defeated the terrorists in a gunfight and forced them to flee.\nThe Nigerian Army has stated that the insurgency has been mostly defeated on numerous occasions, while downplaying any losses.\nThe terror group has killed approximately 50,000 people and displaced millions of people, mostly in the states of Adamawa, Borno, and Yobe."
  },
  {
    "headline": "BREAKING: Okorocha, Nwosu, Sponsors Of Kidnapping, Banditry In Imo — Govt",
    "summarized_story": "Senator Rochas Okorocha, the former governor of Imo State, and his son-in-law, Chief Uche Nwosu, have been named as sponsors of kidnapping and banditry in the state by the Imo State Government.\nWhen he meets with Imo stakeholders today, Tuesday, January 4, 2021, incumbent Governor Hope Uzodimma promised to name those responsible for the state’s insecurity.\nThus, the current media frenzy by both Rochas Okorocha and Uche Nwosu appears to be strengthening the notion of their culpability.\nThey are also actively seeking to dent the image of the fine security officers attached to the Governor of Imo State.\n“The public must be informed that the entire report is false and a failed attempt to frustrate the Imo Stakeholders meeting taking place on Tuesday."
  },
  {
    "headline": "BREAKING: Magodo Residents Protest Presence Of Over 50 Policemen",
    "summarized_story": "Residents of Magodo Phase II Estate in Lagos are protesting the presence of over 50 armed policemen on their estate.\nSome of the inscriptions read: “Lagos Attorney-General prosecute those involved in illegal invasion of Magodo Phase 2 you promised”, “Magodo Phase 2 has been under siege of the IGP’s anti-riot police squad for three weeks”.\n“We’ve allowed people to go out, but we are protesting this morning to let the world know what’s going.\nWe are supposed to be at work, but we want the whole world to know what’s happening at Magodo.\nWe are supposed to be at work, but we want the whole world to know what’s happening at Magodo."
  },
  {
    "headline": "South-East Residents Cancel Sit-at-home As Police Kill ESN Member Attacking Imo Monarch’s Palace",
    "summarized_story": "This comes as the Imo State Police Command shot and killed a suspected member of the Eastern Security Network who was attempting to attack the palace of a traditional ruler.\nPeople were seen going about their daily routines across the states, as most shops, companies, and markets were open for business.\nThe major markets were not open because they were still closed for the New Year’s celebrations, as directed by their authorities.\nMarriage ceremonies and community events were held in various sections of Anambra State yesterday, indicating that residents had forgotten about the Monday sit-at-home.\nAccording to the Imo State Police Command, members of the ESN were injured while attempting to attack the palace of Eze Emmanuel Okeke, Chairman of the Imo State Traditional Rulers Council."
  },
  {
    "headline": "[Breaking] Insecurity: Imo state government names Okorocha, son-in-law as sponsors",
    "summarized_story": "Ahead of scheduled stakeholders’ meeting on Tuesday inside government house Owerri, the Imo state government has identified Senator Rochas Okorocha and his son-in-law Chief Uche Nwosu as sponsors of kidnapping and banditry in the state.\nA statement by the Chief Press Secretary/Media Adviser to the Governor, Oguwike Nwachuku, alleged that Okorocha and Nwosu have been mentioned by suspects currently in detention.\nPart of the statement reads, “For the avoidance of doubt, Okorocha and Nwosu have been specifically mentioned by suspects who are in the custody of security agents, as being sponsors of kidnapping and banditry in Imo State, using their relationship with former ex-militants to perpetrate the crimes.\n“Rather than clear their names, they appear bent on using both overt and covert means to blackmail the Police High Command, which legitimately arrested Uche Nwosu.\nThey are also actively seeking to dent the image of the fine security officers attached to the Governor of Imo state.”There have been heightened criminal activities in the state in recent times with killings, kidnappings and burning of highly-placed individuals’ houses as major insecurity issues."
  },
  {
    "headline": "APC Convention: Why February date is sacrosanct – PGF boss",
    "summarized_story": "The APC chieftain described as ‘illogical’ recommendation through a letter written by Senator Orji Uzor Kalu to the APC CECPC Chairman, Mai Mala Buni, dated December 13, 2021, calling for the postponement of the APC convention.\nIn an open letter to all the APC leaders Monday in Abuja, Lukman warned of the repeat of 2019 Zamfara experience if the needful was not done.\nThe APC chieftain said: “It is very difficult to excuse the CECPC from the campaign to postpone the February Convention.\nIf the CECPC is not interested in the postponement of the Convention from the agreed February 2022 date, why is it difficult to make formal announcement about the date and venue of the Convention?\nBut how united are party leaders behind the candidate will be a more determining factor."
  },
  {
    "headline": "Revealed! What ex-presidential candidate, Tofa, told youth two months before his demise",
    "summarized_story": "He said: “The late Tofa was noted for his untiring commitment to public enlightenment and was unafraid to speak the truth all the time that he lived.\n“Sen Anyim regrets that Alhaji Tofa died when his experience and elderly counsel would be most needed as the country battles with multiple challenges.\nAnyim deeply condoles with the late Alhaji Tofa’s family, the good people of Kano State and Alhaji Tofa’s many friends and associates all over Nigeria.\nIn another condolence message, Jigawa state Governor Muhammad Badaru lauded the late politician as a statesman, industrialist, politician and community leader.\n“The late Tofa was a passionate believer of the organic links between generations who was always available for young people."
  },
  {
    "headline": "Notorious Bandit Leader, Turji, Frees Over 50 Victims Amidst Military Offensive",
    "summarized_story": "A notorious bandit leader, Bello Turji, has freed over 50 kidnapped victims in his custody in Zamfara State, following military raids on neighboring bandit camps in Zamfara and Sokoto forests.\nCo-Chairman of the state Committee on Finding Lasting Solutions to Banditry, Dr. Abdullahi Shinkafi, confirmed the development to Channels Television in a telephone conversation on Tuesday.\nDr. Shinkafi noted that the released victims were about 70, adding that the notorious bandit kingpin released them ‘unconditionally’.\nTurji has been the mastermind of killings and kidnappings in Shinkafi, Sabon Birni, Isah in Zamfara and Sokoto states.\nLate last year, he was alleged to have written a letter to Shinkafi Emirate Council that he was ready to embrace peace and stop banditry."
  },
  {
    "headline": "Lagos Red And Blue Line Rail Projects Will Be Completed Q4 2022 – Sanwo-Olu",
    "summarized_story": "﻿Lagos State Governor, Babajide Sanwo-Olu has assured that the fourth quarter of 2022 completion time of the Red and Blue line rail projects in the State remains on course.\nThe governor gave this assurance on Monday during an inspection tour of Blue and Red Rail line projects at Ikeja, Yaba, Ebute Metta, and Marina Stations.\n“Our promise on the blue and the red line is still on course.\nThe Red and Blue line rail is part of the intermodal transportation system of the Babajide Sanwo-Olu administration in reducing gridlock and ensuring interconnectivity in different parts of the state.\nWhen completed, the 37 kilometres Red Line Rail Project will link Agbado to Marina, while the 27.5 kilometres Blue line Rail Project will run from Okokomaiko to Marina."
  },
  {
    "headline": "Name And Prosecute Terrorism Financiers, Ndume Tells FG",
    "summarized_story": "The Chairman, Senate Committee on Army, Senator Ali Ndume has asked the Federal Government to name and arrest those that finance terrorism in the country.\nSpeaking during an interview on Channels Television’s Political Paradigm, Ndume said he was prosecuted by the Federal Government for sponsoring Boko Haram.\n“Just because they were tracking my phone and they said a spokesman of Boko Haram called me, they went and arrested me.\nHe recalled that the then DSS spokesperson, Marilyn Ogar, briefed journalists where he was accused of sponsoring terrorism.\nThe senator also called on the government to rebuild the north-east that has been ravaged by the insurgency for over a decade."
  },
  {
    "headline": "Apple Becomes First US Company To Reach $3trn Valuation",
    "summarized_story": "Apple became the first US company to hit $3 trillion in market value, briefly reaching the landmark on Monday in the latest demonstration of the tech industry’s pandemic surge.\nThe iPhone maker scaled the record level near 1845 GMT, reaching $182.88 a share before slipping back slightly.\nWhile the top tier of US stock markets are dominated by Silicon Valley companies, Microsoft is the only other American company worth more than $2 trillion.\nIn October, Apple reported net income of $20.5 billion on revenue of $83.4 billion, a record high for the quarter ending in September.\nNear 1930 GMT, Apple shares were up 2.4 percent to $181.91."
  },
  {
    "headline": "Theranos Founder Elizabeth Holmes Guilty In Fraud Trial",
    "summarized_story": "Fallen US biotech star Elizabeth Holmes was convicted on Monday of defrauding investors in her blood-testing startup Theranos, in a high-profile case seen as an indictment of Silicon Valley culture.\nHer case shone a spotlight on the blurred line between the hustle that characterizes the industry and outright criminal dishonesty.\nHolmes made no comment as she left the court when asked if she intended to appeal.\nProsecutors spent 11 weeks presenting over two dozen witnesses, as they painstakingly laid out their argument that Holmes knew her technology fell short, and deliberately misled investors and patients.\nShe personally put the logos of pharma giants Pfizer and Schering-Plough onto Theranos reports hailing the company’s blood-testing technology, which were then shared with investors."
  },
  {
    "headline": "APC caretaker committee must ensure National Convention goes beyond just electing NWC",
    "summarized_story": "A chieftain of the All Progressives Congress and Director General Of the Progressives Governors Forum, Salihu Lukman, has appealed to the party’s Caretaker Extraordinary Convention Planning Committee, to ensure that the February 2022 Convention is not just about electing National Working Committee members.\nHe urged party leaders on recommendations from the Convention, which he says should guide the review process of the party’s manifesto and bring out some of the campaign agenda of the APC for the 2023 campaigns.\nSalihu Lukman says It is quite worrisome that speculations about the Convention are allowed to create strong doubts as to when the Convention will hold.\nThe major gap, however, is that no date or details of Committees, their membership and terms of reference, were given,a worrisome situation.\nGiven the roll out of political activities for the year, Mr Lukman advised the Caretaker Committee to set up relevant committee for the party’s national assembly, to rest speculations is some quarters that the convention will not hold in February."
  },
  {
    "headline": "Tinubu hails Prof. Bolaji Akinyemi at 80",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has poured encomiums on elder-statesman and former Foreign Affairs Minister, Prof. Bolaji Akinyemi, as he turns 80 on January 3, 2022.\nIn a statement by his Media Office signed by Mr. Tunde Rahman, Asiwaju, the former Lagos governor, said:“Warm congratulations to former Minister of Foreign Affairs, Prof. Bolaji Akinyemi, on attaining 80.\nErudite scholar, author, diplomat, pro-democracy activist and committed progressive, Prof. Akinyemi has done a lot for this country.\nEasily one of the best the country has produced in that office till date, his two years in office were significant as they represented some of the country’s best moments in international relations.\n“Rich in experience, wisdom and knowledge, Prof. Akinyemi is today an important elder-statesman."
  },
  {
    "headline": "Shekarau, Nanono mourn MKO Abiola's opponent Bashir Tofa",
    "summarized_story": "In this video, Senator Ibrahim Shekarau and former Minister of Agriculture, Nanono speak on the death of former Presidential candidate, Alhaji Bashir Tofa.\nMr Tofa, a former presidential candidate of the NRC in the 1993 Presidential Election, died Monday morning at the age of 76."
  },
  {
    "headline": "Buhari, Tinubu, others mourn late Olubadan, Saliu Adetunji",
    "summarized_story": "Tributes are pouring in for the late Olubadan of Ibadan, Oba Saliu Adetunji as President Muhammadu Buhari, Bola Ahmed Tinubu & others have sent their condolence messages.\nOba Adetunji died on Sunday at the University Teaching Hospital, Ibadan.\nHe was aged 93."
  },
  {
    "headline": "South Africa Parliament: Second Fire Contained, Suspect Due in Court",
    "summarized_story": "A new blaze at the complex housing South Africa’s Parliament in Cape Town has been contained, according to officials, as a suspect arrested in connection with the fire was due to appear in court.\n“Around midnight the fire was brought under control,” Cape Town city officials said in a statement on Tuesday.\n“To see the walls burning like this, it makes me very sad,” Danny, a Cape Town resident, told Al Jazeera.\nA 49-year-old man charged with arson and other offences including theft was expected to appear in court on Tuesday.\nThe elite Hawks police unit said on Monday the suspect was believed to have gained entry to the Parliament through an office window."
  },
  {
    "headline": "Mali Opposition Rejects Election Delay in New Transition Plan",
    "summarized_story": "A major coalition of political parties in Mali has rejected the military-dominated government’s plan to extend a transition period for up to five years before the country returns to democratic rule.\nThe transitional government had initially agreed to hold presidential and legislative elections in February 2022, amid pressure from the Economic Community of West African States (ECOWAS) regional bloc.\nForeign Minister Abdoulaye Diop submitted the new plans to ECOWAS on Saturday, following a national reform conference boycotted by political parties and social organisations.\nThe plans envisage a six-month to five-year prolongation of the transition period, starting on January 1 and reversing a pledge to have an 18-month transition government.\nUnder pressure from former colonial power France and Mali’s neighbours, Goita pledged Mali would return to civilian rule after holding presidential and legislative elections in February this year."
  },
  {
    "headline": "South Africa Parliament Fire Flares Up Again",
    "summarized_story": "A devastating fire which swept through South Africa’s parliament in Cape Town reignited just hours after it was said to be under control.\nThe fire first broke out on Sunday and completely destroyed the National Assembly, or lower chamber.\nThe chairperson of the upper chamber, Amos Masondo, said Sunday’s fire had led to the “complete burning down” of the National Assembly chamber.\nThe Houses of Parliament in Cape Town are made up of three sections, with the oldest dating back to 1884.\nCape Town Mayor Geordin Hill-Lewis said the city’s council chamber would be made available as an alternative place for parliament to meet."
  },
  {
    "headline": "Canadian Families Win $84m Compensation Over Jet Downed by Iran",
    "summarized_story": "A Canadian court has awarded C$107m (£62m; $84m), plus interest, to the families of six people who died when a plane was downed near Tehran in 2020.\nThe family members awarded compensation by Ontario’s Superior Court of Justice lost spouses, siblings, children, nieces and nephews.\nThe relatives had filed a civil lawsuit against Iran and other officials who they say were to blame for the incident.\nThis is the first time that compensation has been awarded to the families of the victims, CBC reports, adding that Iran did not defend itself in court.\nLast year a report by the Canadian government said Iran was “fully responsible” for the downing of the plane, and that it had been a result of “incompetence” and “recklessness”."
  },
  {
    "headline": "Former Theranos CEO Holmes Convicted of Fraud and Conspiracy",
    "summarized_story": "A jury convicted Holmes, who was CEO throughout the company’s turbulent 15-year history, on two counts of wire fraud and two counts of conspiracy to commit fraud after seven days of deliberation.\nThe 37-year-old was acquitted on four other counts of fraud and conspiracy that alleged she deceived patients who paid for Theranos blood tests, too.\nBalwani’s trial is scheduled to start next month in the same San Jose courtroom where Holmes’ legal saga unfolded.\nAlthough she was convicted of bamboozling investors, Holmes received a reprieve from the jury on the fraud accusations involving patients who submitted to inaccurate blood tests that could have endangered their health.\nEvidence presented at the trial also showed that Holmes lied about purported deals that Theranos had reached with big drug companies such as Pfizer and the U.S. military."
  }
]