[
  {
    "headline": "Petrol souvenir: Erelu Okin honours Lagos police invitation, apologises",
    "summarized_story": "The Erelu Okin, Pearl Ogbulu, host of the party where jerry cans filled with Petroleum Motor Spirit were shared as souvenirs in Lagos State, has honoured police invitation.\nSources in the Lagos State Police Command made this known to our correspondent on Tuesday.\nErelu Okin had shared petrol as a souvenir during her coronation party last weekend in the Oniru area of Eti-Osa Local Government, in Lagos State, leading to an outrage on social media.\nThe Lagos State Commissioner of Police, Abiodun Alabi, had ordered the arrest of people involved in the distribution of petrol as a souvenir at a party in the state.\n“Still concerned about the safety, and protection of lives and properties of citizens, the Lagos State Police Command once again appeals to citizens to avoid this kind of condemnable act in the name of generosity."
  },
  {
    "headline": "Film star Pasha Lee dies fighting Russian troops in Ukraine",
    "summarized_story": "Ukrainian actor turned soldier Pasha Lee was killed in battle against Russian in Ukraine, according to Odesa International Film Festival.\nLee, who served in Ukraine’s territorial defense unit, worked as an actor, TV host and composer.\nPasha Lee worked in a variety of roles and wasn’t just an actor.\nHe also served as a TV host and was a composer.\nPasha Lee’s works include “The Fight Rules” and “Shadows of Unforgotten Ancestors.”“He is an actor, TV presenter, my colleague and a good acquaintance,” Kasilova posted about Lee."
  },
  {
    "headline": "IWD22: Women can no longer be deprived, says Buhari",
    "summarized_story": "Stephen Angbulu, AbujaThe President, Major General Muhammadu Buhari (retd.\n), on Tuesday, extolled Nigerian women on the occasion of International Women’s Day, March 8, 2022.\nBuhari observed that women are not where they should be yet in different spheres of endeavour, but believed that they could no longer be deprived for too long, as they have consistently proved that they could hold their own on all fronts, and in all fields.\nHe applauded the contributions of women to the current administration as Ministers, Special Advisers, Senior Special Assistants, Executive Directors, Executive Secretaries, and many others, noting that they were pulling their weights, and making it impossible for anyone to downplay their essence.\nBuhari also rejoiced with women and mothers, around whom the tranquillity of homes and society revolves, praying God to grant them peace, joy and satisfaction, as they celebrate today and always."
  },
  {
    "headline": "BREAKING: Court sacks Gov Umahi, Deputy over defection to APC",
    "summarized_story": "By Ikechukwu Nnochiri, ABUJAThe Federal High Court sitting in Abuja, on Tuesday, sacked Governor David Umahi of Ebonyi State and his Deputy, Dr Eric Kelechi Igwe, following their defection from the Peoples Democratic Party, PDP, to the ruling All Progressive Congress, APC.\nAccording to the court, having defected to the APC, both Umahi and his deputy, not only jettisoned the PDP, but also the votes that belonged to it.\nIt held that going by the outcome of the governorship election, the office of the governor and deputy governor in Ebonyi state, “belong to the Plaintiff and no other politcal party”.\nThe court therefore ordered both Umahi and Igwe to immediately vacate their positions.\nThe court further restraining both Umahi and Igwe from further parading themselves as governor or deputy governor of Ebonyi state."
  },
  {
    "headline": "Plateau: 625 violent attacks recorded in 20 years — CMR",
    "summarized_story": "*seeks reconsideration of six rejected constitution amendment billsBy Luminous Jannamike, AbujaNo fewer than 625 militia attacks have been carried out by bandits in Plateau state since 2001, an advocacy group, the Coalition of Minority Rights (CMR) has said.\n“Five Bills simply sought to change or correct the names of seven LGAS in Nigeria.\nWhile 4 four bills for six name changes or corrections received the favour of almost all Senators present.\nHowever, 26 Senators from at least nine states voted against the change of Barkin Ladi’s name.\nHe urged the national assembly to reconsider their positions by passing the six rejected bills."
  },
  {
    "headline": "Defendant committed incest with his 7-year-old foster daughter – IPO tells court",
    "summarized_story": "An Investigating Officer, Geoffery Okwuigwe, told an FCT High Court, Kubwa that a 63-year-old man, Alhaji Danladi Sule committed incest with his seven-year-old foster daughter.\nOkwuigwe, a senior intelligence officer with the National Agency for the Prohibition of Trafficking in Persons (NAPTIP), made this known while being cross-examined by the defence counsel, Usman Nuhu.\nNAPTIP charged Sule with three counts bordering on incest, which he pleaded not guilty to.\nThe defence counsel read a paragraph of the medical report of the victim which stated that there were no sign of tears or bruises at the time of examination.\nThe Prosecution Counsel, Rose Ibekwe, alleged that the defendant sexually assaulted his seven-year-old foster daughter in 2020."
  },
  {
    "headline": "#JusticeForBamise: Military, police storm Gani Fawenhimi Park, stop planned youths’ protest",
    "summarized_story": "Some youth groups had planned to stage a protest at the park on Tuesday, against the gruesome murder of Oluwabamise Ayanwola, a 22-year-old fashion designer who was killed in Bus Rapid Transit, BRT, on Lagos Island.\nIn an earlier flier distributed, the youths had threatened to storm the state Secretariat in Alausa, Ikeja, and all BRT terminals in the state.\nMeanwhile, as of press time, 9.45 am, there was no presence of protesters at the proposed venues: Fawenhimi Park and Alausa Secretariat, Ikeja.\nHowever, Civil servants, motorists and residents were seen going about their normal business activities as security personnel assured of adequate safety of lives and property.\nRecall that the Lagos State Police Command had on Monday, confirmed the death of Bamise, who went missing after boarding a Bus Rapid Transport (BRT) service on February 26."
  },
  {
    "headline": "The Christian and responsibility (2)",
    "summarized_story": "But the word of God does not excuse Christians from this responsibility under any circumstance.\nWe are to submit to the nation’s laws and regulations if they do not conflict with the laws of God.\nWe also have a responsibility to pray for our leaders and others.\nHere is the evidence that God holds the church responsible for the peace, progress, and prosperity of the country.\nPreaching the gospel is every Christian’s calling and responsibility."
  },
  {
    "headline": "Orji Kalu identifies three key areas Osinbajo has supported Buhari",
    "summarized_story": "The Chief Whip of the Senate, Sen. Orji Kalu, has identified three key areas Vice President Yemi Osinbajo has supported President Muhammadu Buhari as he clocks 65 today.\nKalu said Osinbajo has continually supported President Buhari in building a united, indivisible and prosperous Nigeria.\nKalu said: ”On behalf of the people of Abia North Senatorial district, I felicitate with Vice President Yemi Osinbajo as he clocks 65.\n“Looking at the accomplishments of the vice president in all spheres of life, it is obvious that the celebrant has sustained his exemplary leadership attributes over the years.\n“The vice president has continually supported President Buhari in building a united, indivisible and prosperous Nigeria."
  },
  {
    "headline": "International Women’s Day: Mrs Ortom charges Benue women on unity",
    "summarized_story": "Benue State first lady, Dr Eunice Ortom, has felicitated with women in the state on the occasion of the 2022 International Women’s Day.\nThe first lady, in a message to Benue women on Tuesday, noted that March 8th was a day earmarked by the United Nations to be globally observed as International Women’s Day to celebrate women’s achievements in all spheres of life.\nShe said the day also marked a call to action for accelerating women’s equality.\nShe noted that “in Benue State, progress has been recorded in creating space for women in the private and public spheres.\n“I wish us all a happy International Women’s Day Celebration.”"
  },
  {
    "headline": "Senate constitutes seven-man conference committee on sexual harassment bill",
    "summarized_story": "Senate President Ahmad Lawan, on Tuesday, constituted a seven-man conference committee on the Sexual Harassment of Students in Tertiary Institutions Prohibition bill.\nThe bill was sponsored by the Deputy Senate President, Ovie Omo-Agege representing Delta Central District.\nLawan announced the membership of the conference committee at the start of plenary proceedings.\nSenator Micheal Opeyemi Bamidele (Ekiti Central) was named the Chairman of the conference committee.\nMembers of the conference committee are expected to meet with their counterparts in the House of Representatives to harmonise the two versions of the bill passed by both chambers."
  },
  {
    "headline": "Lagos party petrol souvenir: I have reported myself to police – Erelu Okin",
    "summarized_story": "Pearl Chidinma Ogbolu, the Erelu Okin of Orile Kemta, has announced that she turned herself in to Lagos police.\nThe command headquarters is probing the distribution of petrol as souvenir at her installation party last week.\nThe Lagos government already sealed Havilah Events Centre in Oniru for contravening public safety rules.\nI have come to regret my error“I intend to focus on safety and security and will put my energy on ensuring that my community works include safety and security,” she said.\nThe Erelu further disclosed that she personally delivered an apology letter to the office of Governor Babajide Sanwo-Olu."
  },
  {
    "headline": "US, 10 other countries condemn North Korea’s missile launch",
    "summarized_story": "The United States and 10 other countries have condemned North Korea’s renewed missile test over the weekend.\nThe 11 countries also criticized the UN Security Council itself, saying it “continues to remain silent’’ as North Korea escalates its destabilizing actions.\n“Each ballistic missile launch that results in inaction by the Council erodes the credibility of the UN Security Council itself in addressing the DPRK and undermines the global non-proliferation regime,’’ the joint statement read.\nThe UN’s most powerful body was recently unable to reach an agreement on a common stance on North Korea’s recent activities, in part due to resistance from Russia and China.\nAccording to its neighbours South Korea and Japan, Pyongyang, on Saturday, fired a ballistic missile towards the open sea, the ninth North Korean missile test since the beginning of the year."
  },
  {
    "headline": "BREAKING: House rescinds decision on three gender related bills",
    "summarized_story": "The House of Representatives on Tuesday rescinded its rejection of three gender related bills during voting on the constitutional amendment.\nOthers were are the bills on citizenship, indigeneship and 35 percent affirmative action for women.\nWomen groups have since the rejection of the bills besieged the gate to the National Assembly to protest the action.\nHowever at its resumed sitting on Tuesday, Speaker Femi Gbajabiamila said there was the need for the House to rescind the decision for the good of the country.\nChairman of the House Committee on Rules and Business Abubakar Hassan Fulata moved a motion to rescind the decision, which was seconded by the Deputy Minority Leader Toby Okechukwu."
  },
  {
    "headline": "BREAKING: Ukraine, Russia open corridor for Nigerian students, civilians to leave Sumy",
    "summarized_story": "Ukraine and Russia have opened a humanitarian corridor in the city of Sumy for the evacuation of Nigerian and other international students trapped in Sumy State University (SumDU).\nIt will allow civilians and all international students to flee through specified routes to the neighbouring state of Poltava.\nAbout 380 trapped Nigerian students were facing food and water shortages in Sumy as of last Friday, but several have managed to flee since then.\nRead Also: Ukraine loses star actor Pasha Lee to Russia invasionAirstrikes by Russian forces reportedly killed 20 people the city overnight.\n“A humanitarian corridor to evacuate civilians, including foreign students, from Sumy to Poltava has been agreed today."
  },
  {
    "headline": "Tinubu addresses APC Reps March 16 on 2023",
    "summarized_story": "All Progressives Congress (APC) presidential aspirant Asiwaju Bola Tinubu will address the APC caucus in the House of Representatives on March 16, 2022.\nThe Speaker said Leader of the House Alhassan Ado Doguwa will provide details of the meeting later.\nOne of the presidential aspirants of the People’s Democratic Party (PDP) Chief Mao Ohuanbuwa is also to meet members of the PDP Caucus in the House around 8.00pm on Tuesday.\nA notice of the meeting signed by the Minority Leader, Ndudi Elumelu and read by the Speaker showed the aspirant would sell his programme to members ahead of the convention to pick a candidate to fly the party flag.\nFormer Vice President, Atiku Abubakar already held a similar meeting with the caucus."
  },
  {
    "headline": "BREAKING: Senate challenges ruling on Electoral Act amendment",
    "summarized_story": "The Senate on Tuesday challenged a ruling by a Federal High Court in Abuja barring it from re-amending the Electoral Act 2022 recently signed by President Muhammadu Buhari.\nSenate President Ahmad Lawan, who made this assertion on the floor at plenary, said the judiciary cannot stop the National Assembly from performing its constitutionally assigned duties.\n“The judiciary, cannot stop the National Assembly from performing its duties,” Lawan said.\nOthers are; Deputy Senate President, Deputy Speaker, House of Representatives, Deputy Senate Leader and Deputy Leader of the House of Representatives.\nIPresident Muhammadu Buhari, before he signed the Electoral Act Amendment Bill 2022 into law, asked the National Assembly to expunge section 84 (12) of the Act, which he argued would disenfranchise serving political appointees."
  },
  {
    "headline": "Gender bills: Protesting women block NASS gate again",
    "summarized_story": "Various women groups on Tuesday again blocked the entrance of the National Assembly to protest alleged inequality against women.\nThe women, who blocked off the Federal Secretariat gate of the Parliament, protested the rejection of gender bills during the constitutional amendment last week.\nThey were not allowed access into the National Assembly again by security agents during the protest that coincides with the International Women’s Day.\nSome of them hung chains on their necks to symbolise how women have been caged in the polity.\nAt the time of filing this report the gates to the National Assembly was still blocked."
  },
  {
    "headline": "Confusion, anxiety reign in APC over leadership crisis",
    "summarized_story": "From Adetutu Folasade-Koyi, Romanus Ugwu, AbujaPalpable tension, confusion and anxiety reigned at the national secretariat of the All Progressives Congress (APC) in Abuja, yesterday, as contending forces fought over who was in charge of the leadership of the party.\nAnnouncing that the presence of the state chairmen that came for inauguration was responsible for the rowdy situation at the secretariat, Governor Bello claimed that he was just acting on Buni’s behalf.\n“The governors were angry when they heard that the CECPC secretary had been in charge in Buni’s absence.\nMeanwhile, the national leadership of the party had earlier dismissed the report of change in the leadership of the party, describing it as fake news.\nThe statement signed by the Secretary APC Caretaker Committee, Senator John James Akpanudoedehe, urged members and supporters of the party to remain calm."
  },
  {
    "headline": "Bamishe: Police confirm arrest of killer BRT driver in Lagos",
    "summarized_story": "By Christopher OjiFew hours after the body of murdered 22-year-old Oluwabamise Ayanwole, who was missing on transit in Bus Rapid Transit (BRT) was found, the Lagos State Police Command has arrested the driver of the bus.\nLagos State Police Public Relations Officer ( PPRO), CSP Adekunle Ajisebutu, confirmed that the dead body of the lady has also been found.\nThe body of Bamise who went missing on a Bus Rapid Transit vehicle (BRR), being managed by the Lagos Bus Service Limited, was found on the bridge of Ebute-Ero, Lagos Island, on Sunday.\nThe victim’s mother has urged the government and the police to track down the fleeing bus driver.\nThe CP said the suspect was arrested in Ososa Ogun State, in company with the man who was harbouring him."
  },
  {
    "headline": "Strike: Why renegotiation of agreement with ASUU, others lingered –FG",
    "summarized_story": "The government recalled that the re-negotiation of the 2009 agreements between the Federal Government and the University-based staff unions (ASUU, SSANU, NAAT & NASU) commenced on Monday, February 13, 2017.\nMinister of Education, Mallam Adamu Adamu, who spoke at the inauguration of reconstituted Federal Government renegotiation committee in Abuja, explained that COVID-19 pandemic and other unforeseen circumstances led to the prolonged renegotiation with ASUU and other unions.\nThe committee is chaired by the Pro-Chancellor, Alex Ekweme Federal University Ndufu-Alike, Emeritus Prof. Nimi Briggs.\nOther members are the Pro-Chancellor, Federal University, Wukari, Lawrence Ngbale who represents the North-East; and the Pro-Chancellor, Federal University, Birnin Kebbi, Prof. Funmi Togunu-Bickersteth, representing the South West.\nAlso in the team are the Pro-Chancellor, Federal University, Lokoja, Sen. Chris Adighije, representing South East; and the Pro-Chancellor, Federal University of Technology, Minna, Prof. Olu Obafemi from the North-Central."
  },
  {
    "headline": "Don’t tamper with Electoral Act 2022, court tells Buhari, AGF, Senate president, others",
    "summarized_story": "A Federal High Court sitting in Abuja has stopped President Muhammad Buhari, Attorney General of the Federation (AGF) and Senate president from tampering with the newly amended Electoral Act 2022.\nHe agreed with the plaintiff’s counsel, James Onoja (SAN) with Moses Ebute (SAN) that the Electoral Act has become a valid Law and cannot be tampered with without following due process of law.\nThe PDP had dragged President Muhammadu Buhari before the court challenging fresh move to tamper with the newly amended Electoral Act signed into law some days ago.\nBuhari was sued along with the AGF and Minister of Justice, Senate President, Speaker, House of Representatives, Clerk of National Assembly, Senate Leader, House of Representatives Leader and Independent National Electoral Commission (INEC).\nAlso joined as defendants in the suit marked FHC/ABJ/CS/247/2022 are deputy Senate president, deputy speaker, House of Representatives, deputy Senate leader and deputy House of Representatives leader."
  },
  {
    "headline": "Cocaine saga: Kyari, 3 others arrainged, deny charges – The Sun Nigeria",
    "summarized_story": "In the charge marked FHC/ABJ/CR/57/2022, NDLEA accused Kyari and the four other police officers of conspiracy, obstruction, and dealing in cocaine worth 17.55 kilograms.\nHowever, the lead defence counsel to Kyari and Ubia, Chief Kanu Agabi (SAN), informed that a bail application had been filed in respect of his clients.\nOther Senior Advocates of Nigeria who appeared with Agabi are Mahmud Magaji (SAN); Nureini Jimoh (SAN); James Onoja (SAN) and Moses Ebute (SAN) with eight other lawyers.\nBut, in opposition to the bail application, the prosecution counsel said he had filed a counter affidavit application before the court.\nHowever, Agabi informed the court he had filed a bail application for the first and second defendants."
  },
  {
    "headline": "NCDMB: Afreximbank Invested over $42bn in African Enterprises in Five Years",
    "summarized_story": "•Africa must address funding, technology, other limitations to achieve energy security, says SylvaPeter UzohoThe Nigerian Content Development and Monitoring Board (NCDMB) yesterday disclosed that the African Export-Import Bank (Afreximbank) had invested more than $42 billion in support of African businesses between 2016 and 2020.\nHe said, “In respect of African institutions, one bright spot is the African Export-Import Bank (Afrexim Bank), a pan-African multilateral financial institution mandated to finance and promote intra-and extra-African trade based in Cairo, Egypt.\nAccording to Wabote, AfDB has the African Development Fund (ADF), which became operational in 1974 and has cumulatively invested $45 billion over its 44 years of operation on the African continent.\nHe also said a $50-million Research and Development (R&D) Fund was also launched to enable research and development in the oil and gas industry.\n“This unfolding scenario is of huge concern to African leaders and policy makers in the oil and gas industry."
  },
  {
    "headline": "Bello Serves Notice for APC NEC Meeting, Moves to Stabilise Party",
    "summarized_story": "It was an interim leadership meant to usher in a new National Working Committee (NWC) of APC on Saturday, March 26.\nHowever, Bello, after meeting with members of CECPC at the national secretariat of the party, where he had his maiden interaction, served a notice of NEC, including the need to prune down the national convention sub-committees.\nAn APC source, who hinted at the purported notice for the NEC meeting noted that, “So, NEC would hold any time after the seven days notice.\nIn his first official assignment as acting caretaker chairman of the party, Bello inaugurated the APC state chairmen.\nWhen asked if he had taken charge of the party, Bello said, “Acting chairman?"
  },
  {
    "headline": "National Assembly Suspends Amendments Pending Legal Advice, after Court Order",
    "summarized_story": "However, the leadership of the nation’s apex legislative institution in an exclusive interview with THISDAY, yesterday, said the court order would stall the debate on the document, billed for deliberation today.\nAbaribe said, “Under the Nigerian constitution, no other arm of government can stop the National Assembly from doing their work.\n“We will await the court order and see whether any judge in Nigeria will issue an order to stop the legislature from performing their function.\nWe will debate and do anything that is in front of us in the National Assembly.\n“We just got the letter from the president asking us to consider an amendment to the Electoral Act 2022."
  },
  {
    "headline": "Beninese Govt Releases Sunday Ighoho from Custody",
    "summarized_story": "Segun JamesEight months after he was arrested in the Republic of Benin while trying to board a flight to Germany, Yoruba Nation Activist, Chief Sunday Adeyemi, popularly known as Sunday Igboho, has been released by the Beninese government.\nA press statement Monday by the Leader of the Yoruba Self-determination group, Ilana Omo Oodua Worldwide, Professor Banji Akintoye, and a French Language Expert/Deputy Alana of Ilana Omo Oodua Worldwide, Professor Wale Adeniran, said Igboho was released on Monday.\nIn the statement by the Communications Secretary to Ilana Omo Oodua Worldwide, Mr. Maxwell Adeleye, Akintoye described the release of Ighoho as a triumph of truth over darkness in Yoruba land.\nAlthough it could not be immediately confirmed why the release was hurriedly done given the fact he still has case before Beninese court, Igboho was said to be down with kidney and lung diseases contracted during his incarceration.\nHis lawyer, Yomi Alliyu said he was in hospital most of the time as he battled the ailments."
  },
  {
    "headline": "Breaking: Niger Gov Bello Arrives APC Secretariat, Meets Caretaker Committee Members",
    "summarized_story": "Adedayo Akinwale in AbujaThe Governor of Niger state, Abubakar Bello has arrived the national secretariat of the All Progressives Congress (APC) and already meeting with the members of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the partyThe meeting has nine out of the twelve members of the Caretaker Committee of the party in attendance.\nThe secretary of the party, Sen. John Akpanudoedehe, who had earlier denied a leadership change in the party is also at the meeting.\nTHISDAY had exclusively reported that President Muhammadu Buhari had approved the removal of the Yobe State Governor, Mai Mala Buni, as Chairman, Caretaker/Extraordinary Convention Planning Committee (CECPC) of the party and in his stead, appointed his Niger State counterpart, Abubakar Sani Bello.\nBello has taken over the affairs of the party as the ‘sole administrator’ of the party, it was gathered.\nHe said: “Our attention has been drawn to sponsored media reports on an imaginary leadership change in the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC)."
  },
  {
    "headline": "BREAKING: Court Grants Sowore’s Lawyer, Abubakar Marshal Bail After Illegal Arrest, Detention",
    "summarized_story": "An Upper Area Court sitting in Kabusa at the Federal High Court, Abuja, has granted human rights’ activist, Omoyele Sowore’s lawyer, Abubakar Marshal, bail.\nMarshal was released at 11:30am on Tuesday shortly after the release warrant was perfected by the court officials.\nSaharaReporters gathered that the judge had on Sunday ordered the release of the lawyer following condemnation of his action by Nigerians.\nAbubakar who was in high spirit described his arrest as gross violation of his fundamental rights and vowed not to be discouraged.\nHe was hurriedly arraigned before an Area Court in Kabusa before a judge who was hired by Ned Nwoko to do the hatchet job."
  },
  {
    "headline": "BREAKING: Court Grants Sowore’s Lawyer, Abubakar Marshal Bail After Illegal Arrest, Detention",
    "summarized_story": "An Upper Area Court sitting in Kabusa at the Federal High Court, Abuja, has granted human rights’ activist, Omoyele Sowore’s lawyer, Abubakar Marshal, bail.\nMarshal was released at 11:30am on Tuesday shortly after the release warrant was perfected by the court officials.\nSaharaReporters gathered that the judge had on Sunday ordered the release of the lawyer following condemnation of his action by Nigerians.\nAbubakar who was in high spirit described his arrest as gross violation of his fundamental rights and vowed not to be discouraged.\nHe was hurriedly arraigned before an Area Court in Kabusa before a judge who was hired by Ned Nwoko to do the hatchet job."
  },
  {
    "headline": "BREAKING: Court Grants Sowore’s Lawyer, Abubakar Marshal Bail After Illegal Arrest, Detention",
    "summarized_story": "An Upper Area Court sitting in Kabusa at the Federal High Court, Abuja, has granted human rights’ activist, Omoyele Sowore’s lawyer, Abubakar Marshal, bail.\nMarshal was released at 11:30am on Tuesday shortly after the release warrant was perfected by the court officials.\nSaharaReporters gathered that the judge had on Sunday ordered the release of the lawyer following condemnation of his action by Nigerians.\nAbubakar who was in high spirit described his arrest as gross violation of his fundamental rights and vowed not to be discouraged.\nHe was hurriedly arraigned before an Area Court in Kabusa before a judge who was hired by Ned Nwoko to do the hatchet job."
  },
  {
    "headline": "BREAKING: Sunday Igboho Released From Detention In Benin Republic",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo, otherwise known as Sunday Igboho, has been released from the detention of the Benin Republic government.\nThe umbrella body of Yoruba self-determination groups, Ilana Omo Oodua, confirmed this in a press release on Monday.\nSunday IgbohoIgboho was released to renowned Yoruba historian, Prof Banji Akintoye, the statement said.\nMore details later"
  },
  {
    "headline": "BREAKING: Sunday Igboho Released From Detention In Benin Republic",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo, otherwise known as Sunday Igboho, has been released from the detention of the Benin Republic government.\nThe umbrella body of Yoruba self-determination groups, Ilana Omo Oodua, confirmed this in a press release on Monday.\nSunday IgbohoIgboho was released to renowned Yoruba historian, Prof Banji Akintoye, the statement said.\nMore details later"
  },
  {
    "headline": "BREAKING: Reps rescind decision on three gender bills",
    "summarized_story": "The house of representatives has rescinded its decision on three ”gender bills” in the constitution amendment.\nThe bills are:1.\nBill to expand scope of citizenship by registration.\nProvision for criteria to be indigene of a state in Nigeria.\nThe lower legislative chamber rescinded its decision on the bills after Hassan Fulata, chairman house committee on business and rules, moved a motion."
  },
  {
    "headline": "BREAKING: Reps rescind decision on three gender bills",
    "summarized_story": "The house of representatives has rescinded its decision on three ”gender bills” in the constitution amendment.\nThe bills are:1.\nBill to expand scope of citizenship by registration.\nProvision for criteria to be indigene of a state in Nigeria.\nThe lower legislative chamber rescinded its decision on the bills after Hassan Fulata, chairman house committee on business and rules, moved a motion."
  },
  {
    "headline": "Lawan: Court can't stop n'assembly from deleting clause 'disenfranchising' appointees",
    "summarized_story": "Senate President Ahmad Lawan says the judiciary cannot stop the national assembly from carrying out its duties.\nLawan was reacting to an order of the Abuja federal high court temporarily restraining the national assembly from deleting section 84 (12) of the newly-amended electoral act.\nHe later sent a formal request to the national assembly for it to delete the clause.\nAdvertisement“The judiciary under no circumstance can stop the legislature, the national assembly from performing its legislative duties.\nI believe the members of the national assembly know their work, know their onions and would do that is right."
  },
  {
    "headline": "Lawan: Court can't stop n'assembly from deleting clause 'disenfranchising' appointees",
    "summarized_story": "Senate President Ahmad Lawan says the judiciary cannot stop the national assembly from carrying out its duties.\nLawan was reacting to an order of the Abuja federal high court temporarily restraining the national assembly from deleting section 84 (12) of the newly-amended electoral act.\nHe later sent a formal request to the national assembly for it to delete the clause.\nAdvertisement“The judiciary under no circumstance can stop the legislature, the national assembly from performing its legislative duties.\nI believe the members of the national assembly know their work, know their onions and would do that is right."
  },
  {
    "headline": "LIVE: Osun PDP holds governorship primary amid withdrawal of aspirants",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "Togolese inventor builds $12,000 mini tractors for the West African market",
    "summarized_story": "It’s a step out of the kitchen and into the field for this award-winning Togolese inventor.\nBetter known in Togo and the region as the “father of Foufoumix” Logou requires little introduction to those who keep an eye on the world of African invention.\nLogou tries to provide local solutions to local problems.\nThe prototype for the tractor, which retails for the local equivalent of $12,000, was built using salvaged parts, with the idea that doing so would help buyers easily access spare parts.\n“I can’t stay in recovery or recycling anymore and I am now manufacturing some of the spare parts of this machinery myself,” he explained."
  },
  {
    "headline": "Vault Hill is building a human-centric metaverse. What about it?",
    "summarized_story": "To differentiate itself from other virtual spaces and metaverse, Vault Hill City (Vault Hill’s Metaverse) has four different islands and each island has 7 human-themed districts: Play, Romance, Curiosity, Community, Idealism, Vitality, and Imagination.\nVault Hill is also partnering with Ready Player Me to build out avatars and incorporate digital wearables and limited-edition accessories.\nThat is, using one avatar across multiple metaverses instead of having to create one for Vault Hill, and another for Decentraland,” Vault Hill said.\nVault Hill Part is also partnering with Lingua54 to use machine learning to translate the speeches of avatars across different languages in real time.\nThe first glance of Vault Hill City will be up by Q2 2022 and by the end of the year, it will be fully running."
  },
  {
    "headline": "Two years and 3 million rides later, can SafeBoda keep its lead in Nigeria?",
    "summarized_story": "On Wednesday, Ibadan-based Ugandan bike hailing startup SafeBoda clocked two years of operating in the Nigerian market.\nAnd by the end of the year, while it was pausing its Kenyan operation, it celebrated half a million rides in Nigeria.\nFast forward to today, SafeBoda claims to have recorded over 3 million rides, more than 10,000 riders, over 100,000 users, and completed 50,000 deliveries.\nThe startup currently offers 3 services in Nigeria: rides, deliveries, and airtime purchase.\nSafeBoda riders are highly regarded and respected, not just because of the colour but because of their conduct,” said Clement Obaro, Growth Manager at SafeBoda."
  },
  {
    "headline": "Facebook content moderators in Kenya to receive 30-50% pay raise, following complaints",
    "summarized_story": "Facebook content moderators in Kenya will receive a 30-50% pay rise.\nAlthough the pay raise is welcomed by many of the content moderators, some still say it’s not enough.\nWhile the lowest starting salary of a Facebook content moderator at Sama is $2.20 per hour, outsourced content moderators for Facebook in the U.S. are paid a typical starting salary of $18 per hour.\nMeta, Facebook’s parent company also declined to comment on the announcement of the pay raise.\nThe announcement of the pay raise is seen as a win for the content moderators and validation of the power in employees speaking up."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, What comes to mind when you hear the term \"financial inclusion\"?\nI asked because it has become a..."
  },
  {
    "headline": "Univasa launches Verify and Pay Platform to digitise Public Transport Fare Payments",
    "summarized_story": "The platform was launched at the Lagos State Taxi Driver & Cab Operators Association (LSTDCOA) headquarters, Oshodi, Lagos.\nMr Otunba, the president of LSTDCOA, gave a breakdown of the journey so far for taxi drivers.\nHe said that he has been working on providing solutions to the issues affecting taxi drivers and their services.\nHe added that technology has to be embraced to prevent the extinction of yellow taxi cabs in Lagos state.\nSpeaking at the event, CEO of Univasa, Dr Ben Adeniyi, said, “The verify and pay platform initiative was born out of the need to be an “Enabler” to service providers and consumers."
  },
  {
    "headline": "Russia-Ukraine War: What $54m in crypto donations could mean for the global crypto market",
    "summarized_story": "While the war lingers, cryptocurrencies have become a significant theme in the conflict as crypto donations pour in to support Ukraine.\nAccording to CNBC, the crypto donations that have come in one week are valued at $54 million.\nBut what does this mean for the global crypto market, adoption, and regulation?\nUkraine requested crypto donationsSource: AljazeeraUkraine’s 31-year-old Deputy Prime Minister, Mykhailo Fedorov, made the call for crypto donations for Ukraine on Telegram and Twitter on Saturday, February 26, 2022.\nAdvertisementHow do crypto donations to Ukraine affect the crypto market, adoption, and regulation?"
  },
  {
    "headline": "These women have raised millions in a male-dominated startup space; Here’s how they did it",
    "summarized_story": "African startups raised approximately $5 billion in 2021, yet less than 1% of the money raised went to startups with a female founder or CEO.\nAdvertisementFortunately, it’s getting easier for women to raise money as more women launch venture capital funds targeted at them.\nSource: TechCrunchNelly Chatue-Diop, Founder and CEO of Ejara, a Cameroonian fintech startup, shares the same opinion but warns that simply going after women investors isn’t enough.\nMost of the women VCs that support women are very vocal about it.\nBecause when you’re raising money, the VCs are your customers, and you want to be customer-centric."
  },
  {
    "headline": "IWD: Nigerian women face uphill task of breaking bias",
    "summarized_story": "Nigerian women still have an uphill task of breaking the bias against them as the world celebrates the International Women’s Day today, few days after the National Assembly rejected some gender bills.\nHansatu said, “Nigerian women must arise and stand as one body with one voice, so that we can collectively break the bias for the sake of generations yet unborn.\n“When men and women are in equal numbers on decision-making bodies, this will help shift biased thinking in both men and women, as well as increase visibility and access for women in business, government and politics.”Read also: Nigerian Women get huge boost as U.K.\nAs women continue to face significant gender bias in Nigeria, another area of concern is in the agricultural sector, according to stakeholders.\nAnother important area of concern for Nigerian women is domestic violence."
  },
  {
    "headline": "Working mothers struggle with outsourcing childcare",
    "summarized_story": "Fresh concerns have emerged as an increasing number of working mothers in Nigeria are struggling with outsourcing childcare.\nSome commenters also queried why women increasingly seem to prioritise career over child support and family care, suggesting that women should forfeit working in their child-bearing years.\nA counter-argument also trailed the criticism as more women opened up on the burden that women face in their struggle to juggle paid employment with child raising and family care.\nAnd since the options of professional childcare provision are often unavailable at workplaces, some women contract their children’s care to crèches which sometimes fail.\nFinally, recognition of the economic contribution of unpaid care work requires measuring it.”"
  },
  {
    "headline": "The geopolitics, economics spurring oil rally to 13-year highs",
    "summarized_story": "Oil prices retreated after having hit more than $130 per barrel, a 13-year high, on Sunday evening as markets panicked over a possible embargo of Russian crude oil.\nMeanwhile, the concerns that contributed to sending oil prices above $90 a barrel in January are still present.\n“We estimate that 0.4 million bpd of crude oil production went offline in Libya in late December 2021.\nHe said, “The rise in crude oil prices is not something to celebrate.\nIt ships out 4 million to 5 million bpd of crude, along with 2 million to 3 million bpd of refined products."
  },
  {
    "headline": "ASUU Industrial Action and Public Education In Nigeria – Nigerian Observer",
    "summarized_story": "ASUU has further blamed the Federal Government of levity in handing education, rather than entrenching policy system that can prioritise all critical sectors in the country.\nLooking through the positions of both ASUU and the Federal Government, they appeared determined and positive towards the betterment of the Education system and resolving the present challenge in the country.\nGood Education system anywhere in the world is a knowledge fountain.\nThe roads, bridges, technology, interpersonal relations, science researches and methods of achieving designed objectives are all derivable from a well co-ordinated knowledge driven education system.\nIn the case of Nigeria we are always overwhelmed by lack of funds and lack of motivation as a result of rambling education and a pitiful policy system."
  },
  {
    "headline": "Vice President Yemi Osinbajo Seeks Constitutional Roles For Traditional Rulers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – In the face of rising insecurity across the country, Vice President Professor Yemi Osinbajo has called for constitutional roles for traditional rulers across the country in order to stem the ugly tide.\n“About three or four years ago, I and the Deputy Governor of Delta State, have been working assiduously in bringing down the insecurity we faced in the past.\nOsinbajo emphasized that, the nation’s desire was to see that security challenges in Delta State were brought to an end in most of the oil-producing communities.\n“We recognize, especially with security that very few administrations had been confronted with this plethora of security challenges that we have been confronted with.\nThe Vice President was in Delta State for the Thanksgiving ceremony of late Chief Patrick Ideh, aged 95, a nationalist lawyer since 1961."
  },
  {
    "headline": "Osinbajo now in charge – Buhari – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe President of the Federal Republic of Nigeria, Major General Muhammadu Buhari (retd.\nBuhari stated this when he fielded questions from State House correspondents shortly before departing the Presidential Wing of the Nnamdi Azikiwe International Airport, Abuja, for London on Sunday.\nAccording to the presidential aide, Femi Adesina, Buhari is expected to be in London for two weeks.\nThe Presidency had on Friday in Abuja said the President’s return to Abuja from Nairobi does not abort his earlier scheduled trip to the United Kingdom for a routine medical checkup.\nOn the London trip, Buhari said,”Well, I cannot claim to be doing the work alone."
  },
  {
    "headline": "I’m not leaving PDP for anyone; accept my leadership or leave – Obaseki to detractors – Nigerian Observer",
    "summarized_story": "I’m not leaving PDP for anyone; accept my leadership or leave – Obaseki to detractorsShare FacebookTwitterStumbleuponLinkedInPinterest… Edo sets for council polls, as PDP registers over 539,000 membersThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, said he has no plan of defecting from the Peoples Democratic Party (PDP), urging anyone who is uncomfortable with his leadership of the party to leave.\nHe noted, “There is no division in Edo PDP.\n“I heard that Chief Dan Orbih went around, saying there is no harmonization in Edo PDP.\nThe Chairman PDP Edo State, Anthony Aziegbemi, noted that “Edo State is the only state in the nation that has surpassed the 500,000 thresholds for e-registration of the party.”Others at the meeting include the Deputy Governor of Edo State, Rt.\nComrade Philip Shaibu; Speaker of Edo State House of Assembly (EDHA), Hon."
  },
  {
    "headline": "FIRS offers concession to taxpayers with outstanding forex tax liabilities",
    "summarized_story": "Federal Inland Revenue Service (FIRS) has given one-month grace period for those with outstanding foreign currency tax liabilities to settle these liabilities in Naira, with effect from the 1st of March, 2022, to 31st March, 2022,This is according to a Public Notice released by the Service and signed by the Executive Chairman, Muhammad Nami.\nThe FIRS stated that it had received requests and enquries from taxpayers on challenges being encountered in sourcing for foreign currencies to offset their outstanding tax liabilities.\nThe Service explained that this concession was a one-off window as the law has stated that the currency a taxpayer transacts in is the currency with which the tax is to be paid.\n“The extant provision is that the currency of the transaction should be the currency with which the tax is paid.\nThe Notice explained that the this window covers all such liabilities that have falling due for payment on or before 31st December, 2021, and for all taxes except the Petroleum Profit Tax."
  },
  {
    "headline": "Hope rises for Naira as CBN moves to weaken parallel market",
    "summarized_story": "The CBN had last week released implementation guidelines for its newly created RT200 Non-oil Export Proceeds Repatriation Rebate Scheme, highlighting its exporters responsibilities and benefits.\nEmefiele had said, The RT200 FX Programme is a set of policies, plans and programmes for non-oil exports that will enable us attain our lofty yet attainable goal of US$200 billion in FX repatriation, exclusively from non-oil exports, over the next 3-5 years.\nThe RT200 initiative is anchored on five key areas which are; value-adding export facility, non-oil commodity expansion facility, non-oil export rebate scheme, non-oil export terminal financing and bi-annual non-oil export summit.\n“The reality is that supply-side policies are even more critical and impactful than demand management interventions in the foreign exchange market.\nOver the last couple of years, the CBN has been fixated on managing the demand side of the foreign exchange market and the outcomes have been suboptimal,” he said."
  },
  {
    "headline": "Russia vs Ukraine: Time ticks for WW III",
    "summarized_story": "But World War III has never been closer.\nAnything that we do that results in killing Russians puts us into World War III.\nBut let me be clear: Our forces are not engaged and will not engage in the conflict with Russian forces in Ukraine.\nThe official said the war in Ukraine was far more dangerous than anything Europe has seen since the end of World War II, including the Balkan wars of the 1990s.\nAs horrible as that was, the official said, this is worse, with the potential of getting a real European war, or a world war very quickly."
  },
  {
    "headline": "2023: Emefiele’s alleged ambition rattles political parties",
    "summarized_story": "Indeed, only few individuals could have contemplated a possible power bid by the cool headed governor of the Central Bank of Nigeria (CBN) who has practically no experience in party politics.\n“The idea is that he (Emefiele) as president is unlikely to distort the order Buhari has established in the polity,” a source who preferred anonymity said.\nGroups Drum SupportMeanwhile, a number of groups have come out to demand that the CBN governor throws his hat in the ring.\nThis forum has come together to plead and beg Dr. Godwin Emefiele to run as president of Nigeria in 2023, Fapounda said.\nI can assure you that it’s not for nothing that top businesses owners like Dangote are part of the Emefiele presidential project,” he said."
  },
  {
    "headline": "Lawan Constitutes 7-man Conference C’ttee On Sexual Harassment Bill",
    "summarized_story": "President of the Senate, Ahmad Lawan, on Tuesday, constituted a seven-man conference committee on the Sexual Harassment of Students in Tertiary Institutions Prohibition Bill.\nThe Bill was sponsored by the Deputy Senate President, Senator Ovie Omo-Agege, representing Delta Central District.\nLawan announced the membership of the conference committee at the start of plenary proceedings on Tuesday.\nADVERTISEMENTSenator Micheal Opeyemi Bamidele (Ekiti Central), was named the chairman of the conference committee.\nOther members include: Senators Betty Apiafi, Stella Oduah, Abubakar Kyari, Suleiman Umar, Suleiman Abdu Kwari, and Kola Balogun."
  },
  {
    "headline": "International Women’s Day: Atiku Decries Decline Of Gender Equality Bill",
    "summarized_story": "Former vice president Atiku Abubakar yesterday said it is disheartening that national assembly rejected some proposals during the constitution review exercise that will give women some advantages.\nThe former vice president stated this while commemorating the International Women’s Day, however urged the civil society to keep lobbying to see those proposals come to live.\nThe theme of this year’s International Women’s Day is “Gender Equality Today, for A Sustainable Tomorrow.”In a statement he personally signed, Atiku also canvassed for education of the girl-child, stressing that it will better equip the next generation to confront many of the problems besetting them.\nSo, granting gender equality is not a want for our world.\nBut there are many Aisha Kande, whose daily stories of toil and labour to raise promising children have remained unsung."
  },
  {
    "headline": "2023: Women Group Urges PDP Leaders To End Crisis In Ogun Chapter",
    "summarized_story": "Some women members of the Peoples Democratic Party (PDP) under the auspices of PDP National Women Parliament have called on leaders of the party to close ranks or risk losing Ogun State again to the All Progressives Congress (APC) in next year’s general elections.\nThe group, in a statement signed jointly by the national coordinator Hon.\nInternal divisions, rancour, bickering, infighting and all, current PDP leaders continue to bicker and fight on faction bases to suit their personal interest.\nThe women group accused some past national leaders of PDP not resolving the crisis in the state but stocking the fire leaving the issues to fester, “instead of resolving these crises in Ogun State PDP, they have taken turn in milking the problems, turning it into a cash cow”.\nOur focus now is how we can collectivelyreclaim and redeem all our stolen mandates, especially the governorship and general election,” the group said."
  },
  {
    "headline": "Kwankwaso’s Group Adopts NNPP, Holds Convention March 30",
    "summarized_story": "The National Movement (TNM) convened by former governor of Kano State, Rabiu Musa Kwankwaso, has adopted the New Nigeria Peoples Party (NNPP) and fixed their national convention on 30 March, 2023.\nSpeaking after a meeting that started at Kwankwaso’s residence in Maitama around 2pm and ended in Gwarimpa in the night with all state coordinators and the national leaders in attendance, the NNPP interim national chairman, AVM John Ifeimeje (rtd) said they adopted the party because of the similarities they share.\n“It is appropriate at this point to inform Nigerians that the fusion of the two leading Nigerian patriotic fronts: the NNPP and the TNM has already been consummated.\nThe party also fixed its ward congresses for March 15, 2022; local government congresses, March 19, 2022; state congresses, March 21, 2022; zonal congresses, March 28, 2022 while the national convention is fixed for March 30, 2022.\nADVERTISEMENT"
  },
  {
    "headline": "Updated: Prof. Soyinka had nothing to do with Igboho's release",
    "summarized_story": "However, Aliyu on Monday night said Prof. Soyinka played a vital role in the turnaround of the matter.\n“Praises should be given to two prominent Yoruba personalities to wit Prof Wole Soyinka and Prof Akintoye for this turnaround in our client’s matter”.\nHowever, on Tuesday morning, Aliyu said Prof. Soyinka had nothing to do with Igboho’s release.\nThe lawyer made the U-turn via a statement titled “correction.”He said: “Prof Wale Adeniran was meant NOT Prof Wole Soyinka who had nothing to do with the release of Chief Sunday Adeyemo a.k.a Igboho Oosa.”Aliyu added that Igboho is also hale and healthy.\nHe said: “We will ever continue to appreciate the immense contributions of Prof Wale Adeniran for the laudable role he played in negotiating the conditional release of our client.”"
  },
  {
    "headline": "APC presidential candidate will be determined by cabals: Primate Ayodele",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has released statements regarding the next president of Nigeria which will be determined in 2023 after the presidential election.\nThe cleric said that the selection of APC Presidential candidates will not be a democratic process but will be determined by the ‘cabals’ in President Buhari’s camp.\nHe warned that the decision of the cabal to choose the presidential candidate of the party will lead to the breaking of the ruling party.\nHe revealed that Emefiele wants to resign in order to pursue a political ambition but warned that he seeks the face of God so he won’t make mistakes.\nHe also asked the Founder of FCMB, Subomi Balogun, Alex Dudu to pray for their health as he foresees a medical crisis."
  },
  {
    "headline": "PHOTOS: Sunday Igboho With Yoruba Nation Leader Prof Akintoye, Others After Release From Detention In Benin Republic",
    "summarized_story": "PHOTOS: Sunday Igboho With Yoruba Nation Leader Prof Akintoye, Others After Release From Detention In Benin RepublicSunday Adeyemo, a Yoruba Nation activist better known as Sunday Igboho, was released from detention and handed over to Prof Banji Akintoye, the leader of the Yoruba Nation groups, according to Ilana Omo Oodua Worldwide, a Yoruba self-determination organisation.\nIgboho’s release was corroborated by images taken by the organization, which showed him with Ilana Omo Oodua leaders Prof Banji Akintoye, Prof Wale Adeniran, and his Benin Republic-based lawyer, Prof Malik Falola.\nOn Monday, Igboho was joined by his wife and other supporters at his Benin Republic mansion.\nAfter being detained with Ropo, his wife, at Cardinal Bernardin International Airport in Cotonou while on his way to Germany in July 2021, Igboho was incarcerated in a jail facility in the Republic of Benin.\nMaxwell Adeleye, spokesperson for the Ilana Omo Oodua group wrote, ”Renowned Historian and Leader of Ilana Omo Oodua Worldwide, Professor Banji Akintoye, Yoruba Nation Activist, Chief Sunday Adeyemo Igboho, Igboho’s Lawyer in Benin Republic, Professor Malik Falola, Deputy Leader of Ilana Omo Oodua Worldwide, Professor Wale Adeniran, Igboho’s wife, Ropo, in a group photograph at Igboho’s Residence in Cotonou, Benin Republic today Monday 7th March, 2022.”"
  },
  {
    "headline": "APC crisis: Let bygones be bygones – Gov Bello tells party leaders",
    "summarized_story": "Governor Sani Abubakar Bello of Niger State has called on the stalwarts of the All Progressives Congress (APC) to ‘let bygones be bygones’.\nHe said the party leaders must sheath their swords and put their houses in order ahead of the 2023 elections.\nRecall that the governor declared himself the acting National Chairman of the APC on Monday.\nHe made the call to the APC leaders at a meeting where he addressed State chairmen of the party.\n“By the time you get back, you will unite the party in your various States,” Governor Bello said."
  },
  {
    "headline": "BREAKING: Sunday Igboho Released By Benin Republic Govt",
    "summarized_story": "The Government of the Republic of Benin has released Yoruba Nation Activist Chief Sunday Adeyemo, also known as Sunday Ighoho.\nProfessor Banji Akintoye, a Yoruba Leader and Leader of Ilana Omo Oodua Worldwide’s Umbrella Body of Yoruba Self-determination Groups, and Professor Wale Adeniran, a French Language Expert/Deputy Alana of Ilana Omo Oodua Worldwide, were given the Activist on Monday.\nMr. Maxwell Adeleye, the Communications Secretary to Ilana Omo Oodua Worldwide, praised the release of Ighoho as a Triumph of Truth over Darkness in Yoruba Land in a statement.\nDetails later…"
  },
  {
    "headline": "Russia vs Ukraine War: My January Prophecy Has Come To Pass – Pastor Adeboye",
    "summarized_story": "General Overseer of the Redeemed Christian Church of God, RCCG, Pastor E. A. Adeboye says he had predicted the humanitarian crisis currently rocking some European countries following the invasion of Ukraine by the Russian forces.\nThe clergy revealed that members of the church who reside in the warring country, Ukraine are all safe.\nHe said, “All our members in Ukraine are safe.\nThe Nigerian members have already left Ukraine, those who are natives from the report I got some hours ago are all safe and secure.\nAt that time nobody knew that Russia would attack Ukraine, that it was the Europeans who would be running away from their homes."
  },
  {
    "headline": "[Breaking] Electoral Act: Senate ignores court order, proceeds on amendment",
    "summarized_story": "The Senate Tuesday ignored ruling of a federal high court in Abuja , purportedly stopping it from amending the 2022 Electoral Act as requested for, by President Muhammadu Buhari .\nKicking against the Order during plenary Tuesday, the Senate first listed consideration of the Act for amendment on its order paper and read it for first reading .\nThe Senate President in his remarks ,said the court cannot stop the Senate and by extension, the National Assembly , from performing its Legislative duties .\nThough some Senators like former Deputy Senate President , Ike Ekweremadu, called for suspension of action on the amendment by citing order 52(5) of the Senate ; but Lawan insisted that the Court cannot stop National Assembly from its Legislative duties .\nThe Senate will surely go ahead with the amendment as requested for by the President,” he said."
  },
  {
    "headline": "APC leadership: Confusion as Sani-Bello takes over, Buni’s fate uncertain – Blueprint Newspapers Limited",
    "summarized_story": "However, National Secretary of the party’s CECPC, Senator John James Akpanudoedehe, in a statement Monday in Abuja, declared no change in party leadership.\nAnd as a further confirmation of his new status as acting chairman, Governor Bello inaugurated and conducted the swearing-in of party state chairmen elected 2021.\nBello said he had been acting for a while in the absence of the caretaker committee chairman, Governor Buni since travelling out.\nThe statement said: “Our attention has been drawn to sponsored media reports on an imaginary leadership change in the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC).\nBlueprint, however, learnt that Governor Buni and the CECPC secretary may resign today (Tuesday) from the APC National Caretaker Committee, leaving behind other members."
  },
  {
    "headline": "Lassa fever kills 98 in 2 months",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has said in its latest epidemiological report that Lassa fever has killed 98 Nigerians in 15 states in the last two months.\nThe report, which was obtained by NAN, revealed that since the beginning of the year, l40 confirmed cases of Lassa fever were reported from 21 states and 79 local government areas.\nThe states are Ondo, Edo, Bauchi, Benue, Taraba, Oyo, Ebonyi, Enugu, Kogi, Nasarawa, Plateau, Delta, Kaduna, Adamawa, Niger, Anambra, Katsina, FCT and Cross River.\nThese were reported from Ondo, Edo, Bauchi, Gombe, Kogi, Ebonyi, Taraba, Enugu, Oyo, Benue, Plateau States and the FCT.\n“In total for 2022, 21 States have recorded at least one confirmed case across 79 Local Government Areas."
  },
  {
    "headline": "BREAKING: House Of Reps Rescinds Its Decision On Three Rejected Women Bills",
    "summarized_story": "Members of the House of Representatives have rescinded their decision on three bills earlier rejected in the process of the 1999 constitution amendment.\nThe bills are on indigenship, citizenship, and 35% affirmative action for women.\nThe bills will be recommended for consideration and will be part of the second batch of the constitution amendment to be presented in a couple of months.\nThe decision to revisit the bill follows earlier disapproval by women who stormed the National Assembly lamenting rejection of women-related bills.\nThe women, under the aegis of Nigerian Women Groups last week protested against the action of the lawmakers after rejecting all bills relating to women."
  },
  {
    "headline": "[VIDEO] Bamise’s Murder: Police Parade BRT Driver, Expand Investigation",
    "summarized_story": "Police authorities in Lagos State have taken into custody the driver of the BRT Bus involved in the murder of 22-year-old fashion designer, Oluwabamise Ayanwole.\nThe driver, Andrew Nice Omininikoron, and another accomplice were arrested by DSS operatives in Ososa, Odogbolu area of Ogun State on Monday night.\nRELATED:Bamise’s Death: DSS Arrests BRT Driver, Two Others#Bamise: Outrage As Lady Who Boarded BRT In Lagos Is Found DeadThe CP assured the public and the family of the bereaved victim that justice will be served in the case.\nHe warned criminals in the state to desist from evil acts or face the wrath of the law.\nShe boarded a BRT bus with number 240257 going to Oshodi at about 7 p.m. at Chevron Bus-Stop."
  },
  {
    "headline": "Osun PDP Holds Governorship Primary Amid Litigations, Allegations Of Bias",
    "summarized_story": "By Dare IdowuThe Peoples Democratic Party PDP in Osun State is set to elect its candidate for the July 16 Governorship election in the state.\nAkin Ogunbiyi, Fatai Akinbade, Dele Adeleke, and Sanya Omirin have all withdrawn from participating in the primary.\nThe Osun PDP primary is coming as the party renews its bid to retake Osun state after 12 years of losing the governorship seat to the APC.\nIn 2018 the PDP candidate polled 254,698 votes while the APC flagbearer polled 254,345.\nWith a gap of 353, the exercise was declared inconclusive, the PDP eventually lost after a rerun election was conducted in some local governments."
  },
  {
    "headline": "IWD 2022: President Buhari Extols Nigerian Women",
    "summarized_story": "President Muhammadu Buhari has extolled Nigerian women in celebration of International Women’s Day, March 8, 2022.\nThe year’s celebration which is themed Gender Equality Today for a Sustainable Tomorrow is under the hashtag #BreaktheBias.\nIn a statement signed on Tuesday by presidential spokesperson Femi Adesina, President Buhari said the celebration is an opportunity to reflect on the vital roles women play in society, homes, governance, the professions, and in all walks of life.\n“The President rejoices with women and mothers, around whom the tranquility of homes and society revolves, praying God to grant them peace, joy and satisfaction, as they celebrate today and always,” the statement added.\nHe applauded the contributions of women to the current administration as Ministers, Special Advisers, Senior Special Assistants, Executive Directors, Executive Secretaries, and many others, noting that they are pulling their weights, and making it impossible for anyone to downplay their essence."
  },
  {
    "headline": "Senate Moves To Amend Electoral Act, Despite Court Ruling",
    "summarized_story": "The Senate has moved to amend the 2022 Electoral Act, disregarding a Federal High Court order restraining the National Assembly from tampering with the newly amended Act.\nLawan said this during the first reading of the amendment of the Electoral Act during the legislative proceedings.\n“The Judiciary under no circumstance can stop the legislature, the National Assembly from performing its legislative duties.\nI believe the members of the National Assembly know their work, know their onions, and would do what is right.\nThe court, in a ruling delivered by Justice Inyang Ekwo on Monday, March 7, specifically barred all the defendants in the suit from removing section 84 (12) of the Electoral Act or preventing it from being implemented for the purpose of the 2023 general elections."
  },
  {
    "headline": "Why I pulled out of Osun PDP Governorship Primary",
    "summarized_story": "One of the Governorship aspirants of the People’s Democratic Party in Osun state has withdrawn from the race.\nThe primary election of the party is slated for tomorrow at the Osogbo City stadium.\nThe party now has five Governorship aspirants in the race.\nMr Ogunbiyi added that the leadership of the PDP at the centre has decided to cede the governorship ticket to Senator Adeleke.\nThe Governorship election is slated for the 16th of July, 2022."
  },
  {
    "headline": "Invasion: Ghanaians urged to emulate Ukrainians' Patriotism",
    "summarized_story": "Ghanaians have been challenged to put patriotism first as Ukrainians have done in the face of the ongoing attacks by Russia.\nBishop of Lagos Central, the Methodist Church of Nigeria, Rt Reverend Samuel Nortey, stated this at the nation’s Independence service held in Lagos."
  },
  {
    "headline": "No Leadership Change in APC CECPC, its Fake News",
    "summarized_story": "The APC CECPC has described as sponsored media reports on an imaginary leadership change in the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC).\nThe media report is fake news and should be disregarded by all sundry.\nThe party according to Statement by its CECPC Secretary, Senator James Akpanudohedehe, is a progressive political party guided by rules and its Leadership changes are not announced by ‘sources’ through name dropping in the media.\nThe party urged its teeming supporters, members and indeed the general public to remain calm and support the Governor Mai Mala Buni-led APC CECPC to conduct a rancour-free and credible National Convention deserving of its status as a progressive Party."
  },
  {
    "headline": "APC crisis: Heavy security men deploy to national secretariat",
    "summarized_story": "Security operatives have taken over the national secretariat of the All Progressives Congress (APC) located at Blantyre street at Wuse 2, in Abuja.\nAlthough TVC News cannot independently ascertain reason for the deployment, there are reports that President Muhammadu Buhari has sacked Yobe State Governor, Mai Mala Buni, as Chairman of the APC Caretaker/Extraordinary Convention Planning Committee.\nIt was reported that the Niger state governor, Sani Bello, would take over the affairs of the party.\nThe governing party is billed to hold its national convention March 26."
  },
  {
    "headline": "Russia-Ukraine War: Civilians Flee Sumy as Safe Corridor Opens",
    "summarized_story": "The route people took Tuesday out of the eastern city of Sumy was one of five promised by the Russians to offer civilians a way to escape the fighting.\nVideo posted by the Ukrainian state communications agency showed people with bags boarding buses, but it was not clear how long the effort would last.“The Ukrainian city of Sumy was given a green corridor, the first stage of evacuation began,” the agency tweeted.\nSumy is just 50 kilometres from the Russian border.With the invasion well into its second week, Russian troops have made significant advances in southern Ukraine but stalled in some other regions.\nUkrainian soldiers and volunteers fortified the capital, Kyiv, with hundreds of checkpoints and barricades designed to thwart a takeover.\nThose to be evacuated include foreign students from India and China, she said.She reiterated that proposals to evacuate civilians to Russia and its ally Belarus, which was a launch pad for the invasion, were unacceptable."
  },
  {
    "headline": "‘Tough 24 Hours Ahead’ as Rains Drench Sydney, Forcing Snap Evacuations",
    "summarized_story": "Flood warnings stretched across Australia’s east coast on Tuesday and tens of thousands of Sydney residents fled their homes as torrential rains again pummelled the country’s largest city, flooding several big suburbs.\n“A tough 24 hours or even 48 hours ahead,” Narramore said during a media briefing on Tuesday as he forecast up to 120 mm (5 inches) of rains across Sydney over the next 24 hours, with the storm expected to clear by late Wednesday.\n“People make decisions based on past history and I think this event has shown that there is no past history similar to this event,” New South Wales Emergency Service Commissioner Carlene York told reporters.\nAuthorities fear even more rain will hamper relief efforts as emergency crews look to clear roads to deliver essential supplies.\nNew South Wales Premier Dominic Perrottet, on a tour of the flood-hit areas, took responsibility for his government’s shortcomings over rescue and relief measures."
  },
  {
    "headline": "War in Ukraine: Russia May Cut Gas Supplies to Europe If Oil Ban Goes Ahead",
    "summarized_story": "Russia has said it may close its main gas pipeline to Germany if the West goes ahead with a ban on Russian oil.\nThe US has been exploring a potential ban with allies as a way of punishing Russia for its invasion of Ukraine.\nThe EU gets about 40% of its gas and 30% of its oil from Russia, and has no easy substitutes if supplies are disrupted.\n“We have every right to take a matching decision and impose an embargo on gas pumping through the [existing] Nord Stream 1 gas pipeline,” he said.\nUkraine has implored the West to adopt an oil and gas ban, but there are concerns it would send prices soaring."
  },
  {
    "headline": "US Firm Kimberly-Clark Expands Investment in Nigeria to Over $100m",
    "summarized_story": "The United States has said it is proud to be one of the largest foreign investors in Nigeria as leading American brands expand their investment portfolio, providing job opportunities and supporting economic diversification objectives.\nPierangelo explained that the commissioning of the new facility showcases the commitment of the United States to deepen its trade and investment ties with Nigeria.\nShe commended Kimberly-Clark for its investment in Nigeria and the company’s contribution to improving hygiene and the health of the people of Nigeria.\nKimberly-Clark is an American brand with its headquarters in Texas, United States and has a presence around the world manufacturing hygiene and medical products.\nIt began operations in Nigeria in 2012, with the introduction of Huggies diapers into the Nigerian market in 2015 and Kotex® sanitary pads in 2019."
  },
  {
    "headline": "Nigeria: Parliament Suspends Amendment of Electoral Act Pending Legal Advice, Following Court Order",
    "summarized_story": "Nigeria’s National Assembly has put on hold further legislative action on the letter from President Muhammadu Buhari seeking amendment to Section 84(12) of the Electoral Act 2022.\nAbaribe said, “Under the Nigerian constitution, no other arm of government can stop the National Assembly from doing their work.\n“We will await the court order and see whether any judge in Nigeria will issue an order to stop the legislature from performing their function.\n“We just got the letter from the president asking us to consider an amendment to the Electoral Act 2022.\nThe PDP accordingly asked the court for an order of mandatory injunction compelling INEC to put into immediate effect the Electoral Act including the said Section 84 (12)."
  }
]