[
  {
    "headline": "Nigeria expecting 3.92million COVID-19 vaccine doses July",
    "summarized_story": "The Federal Government on Tuesday said it was expecting a shipment of 3.92 million doses of the Oxford/AstraZeneca vaccine by the end of July or early August.\nThe Executive Director, National Primary Healthcare Development Agency, Dr Faisal Shuaib, disclosed this at a press conference in Abuja.\nHe said, “We now have information that Nigeria will get 3.92 million doses of Oxford/Astrazeneca by the end of July or early August.\nHe added, “It is therefore comforting to know that the vaccine used in Nigeria can protect against this variant that causes high morbidity and mortality in India.\nAccording to Afrexim Bank’s President, Benedict Oramah, the bank has put down $2bn to facilitate the supply of the COVID-19 vaccine."
  },
  {
    "headline": "2011 post-election violence victims’ families get FG jobs",
    "summarized_story": "), has approved the automatic employment of 10 direct siblings of members of the National Youth Service Corps who were killed by suspected Islamic fundamentalists during the 2011 post-election violence in Bauchi State.\nThe Minister of Youth and Sports Development, Sunday Dare, announced this during the inauguration of the NYSC National Governing Board in Abuja on Tuesday.\nIt will, especially, serve as a sustainable source of providing start-up capital for the trained corps members to actualise their business plans and in turn employ more Nigerians.\nIt has become an integral part of our national development and unity architecture; Nigerian youths continue to benefit from this scheme.\n“As a sign of the Federal Government’s unflinching commitment to the NYSC, President Muhammadu Buhari has approved the automatic employment of 10 direct siblings of the deceased NYSC members, who lost their lives during the 2011 post-election violence in Bauchi State."
  },
  {
    "headline": "LIGHT UP YOUR LIVING ROOM WITH INTIMATE LIGHTINGS",
    "summarized_story": "Natural Light: If you’re blessed with a South-facing space, you’re going to need a lot less light for the daytime and perhaps won’t need to consider as much task lighting.\nTo create a more intimate atmosphere, bring lighting to a lower level via table lamps and short floor lamps.\nMood and Task Lighting: Extra task and mood lighting is often where design schemes fall short.\nHomeowners assume that the central light or wall lights are enough at full power, instead of thinking about the layering effect.\nLight Up the Candles: Candles are the last piece of the puzzle when creating a relaxing and intimate atmosphere."
  },
  {
    "headline": "LIGHT UP YOUR LIVING ROOM WITH INTIMATE LIGHTINGS",
    "summarized_story": "Natural Light: If you’re blessed with a South-facing space, you’re going to need a lot less light for the daytime and perhaps won’t need to consider as much task lighting.\nTo create a more intimate atmosphere, bring lighting to a lower level via table lamps and short floor lamps.\nMood and Task Lighting: Extra task and mood lighting is often where design schemes fall short.\nHomeowners assume that the central light or wall lights are enough at full power, instead of thinking about the layering effect.\nLight Up the Candles: Candles are the last piece of the puzzle when creating a relaxing and intimate atmosphere."
  },
  {
    "headline": "Style Stars on Instagram",
    "summarized_story": "By Yemisi SuleimanThe social media, particularly instagram, is the hub for style inspirations these days and style influencers, celebrities and bloggers, go all out to give inspirations to their followers.\nHowever, if you are not sure you are following the right crowd, take a look at our selection of the hottest style stars on Instagram and what makes them tick.\nFolake HuntoonKnown for her signature Afro hairstyle, Folake Huntoon with the brand name ‘Style Pantry’ on Instagram, has successfully earned a huge number of followers for her fashion and effortless style.\nCHIC AMANigerian born fashion blogger Chic Ama, who is based in the United States, is one of the top fashion Instagram influencers today.\nThe fashion consultant cum actor, through his style, encourages his followers to break style rules to find their own contemporary style."
  },
  {
    "headline": "Style Stars on Instagram",
    "summarized_story": "By Yemisi SuleimanThe social media, particularly instagram, is the hub for style inspirations these days and style influencers, celebrities and bloggers, go all out to give inspirations to their followers.\nHowever, if you are not sure you are following the right crowd, take a look at our selection of the hottest style stars on Instagram and what makes them tick.\nFolake HuntoonKnown for her signature Afro hairstyle, Folake Huntoon with the brand name ‘Style Pantry’ on Instagram, has successfully earned a huge number of followers for her fashion and effortless style.\nCHIC AMANigerian born fashion blogger Chic Ama, who is based in the United States, is one of the top fashion Instagram influencers today.\nThe fashion consultant cum actor, through his style, encourages his followers to break style rules to find their own contemporary style."
  },
  {
    "headline": "When journalists gathered to x-ray their role in eliminating violence against women, girls",
    "summarized_story": "This was the submission of participants at a four-day media dialogue and training to improve gender sensitivity in reportage and advocacy, to eliminate violence against women and girls in Lagos.\nAlkasim Abdulkadir, one of the facilitators, while presenting his paper titled: “Etiquette in Reporting Gender” noted that Gender-based violence (GBV) or violence against women and girls (VAWG), is a global pandemic that affects 1 in 3 women in their lifetime.\nOn her part, Aisha Salaudeen, another facilitator, who spoke on “Gender and child-sensitive reporting,” defined gender reporting simply as including all genders in our reporting.\n“Violence is rarely an isolated incident and the majority of children surveyed experienced violence in their home.\nIf we do not end violence against women, we can reduce it to the nearest minimum."
  },
  {
    "headline": "Alleged N114 million Wike's bribe for Rivers bye-election results recovered",
    "summarized_story": "Deputy Inspector General of Police (DIG), Joseph Egbonike, on Tuesday, said about N114,290 000 million out of N360 million bribe for the 2016 bye-election results allegedly offered by the Rivers State Governor, Nyesom Wike to 23 staff of the Independent National Electoral Commission (INEC) has been recovered.\nMeanwhile, the police report and other related documents which were obtained by DAILY POST on Tuesday after the Committee sitting, showed a recovery of the sum of N114 290,000 by the Nigeria Police, Rivers State Command out of N136 million from INEC staff.\n“Account Name: IGP Special Joint Investigation Panel on Rivers Re-run Election of 10/12/2016 with Remita Retrieval Reference number 3401-58076328.\nAppendix ‘C&C1-Summary of recovery from 23 INEC OfficialsC2-Payment slips into CBN Account Zenith Bank with Remita Retrieve reference number 3401-5807-6328.\nMeanwhile, a text message and calls made to the Special Adviser on Media to Rivers State governor, Mr. Kelvin Ebiri, not returned before filing this report."
  },
  {
    "headline": "NANS seeks pardon for expelled Bauchi varsity students",
    "summarized_story": "The National Association of Nigerian Students (NANS) on Tuesday, made a passionate plea with the authorities of the Bauchi State University, Gadau, to revisit their recent decision expelling some students of the institution and appealed for their reinstatement.\nThe body then made a case for continued support for the Bauchi State University, Gadau, by the state government.\n“We are against the pattern of our students in the institution that goes against the values and ethics of the institution.\nSani noted that the management of the university has been committed to the welfare its students, assuring that NANS shall continue adopt dialogue with the institution on students’ issues.\n“We equally commend the Bauchi State Government for its milestone achievements in the educational sector and we call for more adequate funding for Bauchi State University inline with global best practices,” Sani stated."
  },
  {
    "headline": "We’re being marginalised – Ogun West leaders slam Abiodun",
    "summarized_story": "Leaders of Ogun West Senatorial District have slammed the Ogun State Governor, Dapo Abiodun, over alleged marginalisation and underrepresentation of the region in the last two years.\nThe stakeholders’ forum, which comprises professionals, businessmen, technocrats and public servants from Ogun West (Yewa/Awori) expressed concern over the distribution of political appointments under Abiodun’s government.\nThe forum groaned that it is seriously concerned that Abiodun’s government has continued with the unwholesome tradition of underrepresentation of Ogun West in the distribution of political appointments.\nAccording to the letter, despite the efforts made by the government within the last two years in office, roads in Ogun West still remain the most deplorable in the State.\nOn political representation, the forum said, “We are seriously concerned that this government has continued with the unwholesome tradition of underrepresentation of Ogun West in the distribution of political appointments."
  },
  {
    "headline": "NSCDC gets new commandant in Plateau",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC) has appointed Mr. Alexander Barunde, as its new commandant in Plateau State.\nTaking over the leadership of the command on Tuesday in Jos, Barunde promised to build on the success recorded by his successor.\nHe also promised to partner other security agencies to tackle all forms of insecurity in the state.\nEweka replaces Kolawole as NSCDC Commandant in LagosBarunde called on the residents of the state to support and cooperate with the command in its bid to fight crime and criminality.\nHe said the command would do everything within its constitutional powers to secure public properties in the state."
  },
  {
    "headline": "Uzodinma to establish insurance policy for security operatives",
    "summarized_story": "Imo State Governor, Senator Hope Uzodinma, has revealed plans of establishing an insurance policy that will help boost the morale of security operatives serving in the state.\nThe Governor disclosed this when he paid a condolence visit to the Command on Tuesday, while expressing sadness over the murder of officers on duty by unknown gunmen.\n“Government will not let you do this work alone, we will support and supply all logistics and requirements needed because we want our people to sleep with their two eyes closed.\n“We will bring up an insurance policy in the State for all police officers in the State which will benefit their relations, this is to boost their morale in service delivery,” Uzodimma stated.\nEarlier in his address CP Aburu Yaro, Imo State Police Commissioner, poured encomiums on Gov."
  },
  {
    "headline": "I joined the Military 36 years ago - COAS",
    "summarized_story": "The new Army Chief is 55 years old this year and has put in 36 years into the service of the Nigerian Army.\nHe said; “I joined the military 36 years ago.\nSo I bring along with me, 36 years of military experience, having joined the Army in September 1985 as a member of course 37 at the NDA.\n“I believe I have the requisite requirements by the grace of God to now provide my services in this office of the chief of Army Staff if confirmed.\n“This job is collective and as it was captured in the vision of the late Chief of Army Staff and in my own Mission too."
  },
  {
    "headline": "VIDEO: VP Osinbajo drives made-in-Nigerian electric car at exhibition",
    "summarized_story": "Vice President, Prof. Yemi Osinbajo, SAN, was spotted driving a Nigerian-made electric car during the #MadeInNigeria exhibition event held at Eagle Square, the Federal Capital Territory, Abuja.\nA short video posted on the Nigerian Government’s verified Instagram page on Tuesday shows Osinbajo driving the car alongside the Director-General of the Nigeria Automotive Development Council, Jelani Aliyu, and Minister of Industry, Trade, and Investment, Otunba Niyi Adebayo.\n“Vice President Yemi Osinbajo driving Kona, Nigerian made electric car, a moment ago, at the #MadeInNigeria exhibition event at Eagle Square, Abuja.\n“With the Vice President is the Director-General of the Nigeria Automotive Development Council, Jelani Aliyu and Minister of Industry, Trade and Investment, Otunba Niyi Adebayo,” the post is captioned shared amongst 236 thousand followers of the page.\nWatch the video below:"
  },
  {
    "headline": "Twitter CEO, Dorsey, responsible for EndSARS losses – FG",
    "summarized_story": "The Federal Government says Twitter and its founder, Jack Dorsey, are vicariously liable for the losses the country suffered during the EndSARS protest.\nMohammed alleged that Dorsey raised funds through Bitcoins to sponsor the EndSARS protest while his platform, Twitter, was used to fuel the crisis.\nThe minister said the online publication confirmed that Dorsey retweeted some of the posts by some of the coalitions supporting the EndSARS protest.\nThe minister said Dorsey further launched Emoji to make the EndSARS protest visible on the microblogging site.\n“Every attempt to persuade Twitter to deny its platform to this separatist leader was not taken seriously,’’ he said."
  },
  {
    "headline": "Eight Yoruba actors/actresses who remarried",
    "summarized_story": "By Samuel OamenSome Yoruba Nollywood actors and actresses are not giving up on love after their first marriages crashed.\nHere are eight Yoruba Nollywood actors/actresses who remarried:1.\nThe producer and director got married to a Nollywood actor Adeniji Johnson in 2013.\nShe then remarried Femi Oduneye popularly known as Femi Egyptian in 2004.\nThe actress has since remarried and is happy with her latest husband, Kayode Salako."
  },
  {
    "headline": "I wish ladies have my type of husband – Angela Nwosu",
    "summarized_story": "A popular sex therapist, Angela Nwosu, on Monday disclosed that she wished every man can be as caring and supportive as her spouse.\nAngela, who described her hubby as a small god, vowed to perennially worship and adore him.\nWhile narrating the pains and discomfort that come with pregnancy, she emphasised that she couldn’t have gone through the phase alone if her partner hadn’t pampered and supported her all the way.\nAngela, who posted the emotional tribute on her Facebook page, expressed concerns that she is yet to decide on what gifts to buy him to further show her appreciation.\nSee post below;"
  },
  {
    "headline": "Uproar over plan to reopen grazing route",
    "summarized_story": "As far as the Northern Elders Forum (NEF) is concerned, reactivating open grazing routes may cause legal and security problems.\n“The reactivation of open grazing routes in southern part or any other parts of the country is problematic both in legal terms and security.\nThe Federal Government can actually sue governors that ban open grazing and the court will rule whether they are right or wrong.\nAt what time in our history did our founding fathers gather to designate specific routes from the north to the south as ‘grazing routes’?\nSince most governors in the country have outlawed open grazing in their respective states, on which land does the Federal Government want to ‘open’ or ‘re-open’ its vaunted grazing routes?"
  },
  {
    "headline": "Insecurity: Don’t abdicate your responsibility, Masari tells Buhari",
    "summarized_story": "From Agaju Madugba, KatsinaKatsina Governor, Aminu Bello Masari, has faulted President Muhammadu Buhari on reasons for worsening insecurity in the country.\nBut citing Constitutional provisions, Masari said it was wrong for anybody to blame states and local governments.\nWhen you look at the Constitution of the Federal Republic of Nigeria, the issue of security is under the Exclusive List.\n“From the local governments, we assist the police, the DSS, the NSDC.\nIf you devolve, states and local governments will have more financial independence."
  },
  {
    "headline": "Buhari, APC must address separatist agitations, not use of military –Odigie-Oyegun",
    "summarized_story": "From Romanus Ugwu, AbujaFormer national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun, has asked President Muhammadu Buhari and the ruling party to address the separatist agitations in the country through democratic means instead of deployment of military.\nHe said the fact that things are bad and people hungry and angry was not questionable, saying that these were worldwide phenomenon.\nHowever, Odigie-Oyegun decried the current security challenge in the country.\n“It is my hope that we will begin to get control of the security of this nation,” he said.\nThe executive of the party, the NWC, the Caucus, the NEC which is the highest organ of the party."
  },
  {
    "headline": "NRC begins Lagos-Ibadan service tomorrow",
    "summarized_story": "Nigerian Railway Corporation (NRC) says it will begin full operation of the standard gauge railway service from Lagos to Ibadan tomorrow.\nThe company stated this, yesterday, in a statement by its Lagos District Manager, Mr Jerry Oche, assuring that as from Tuesday (tomorrow) morning the Lagos – Ibadan train services will be available to the public.\n“Lagos to Ibadan takes off at 8am from Mobolaji Johnson Station at Alogomegi, Ebute Meta Lagos, while the train will depart Ibadan to Lagos at 8am from Obafemi Awolowo Station at Moniya.\nLagos to Ibadan ia at 4pm from Mobolaji Johnson Station Alagomji, while from Ibadan to Lagos is by 4pm from Obafemi Awolowo Station at Moniya.\nHe said the Alagomeji, Abeokuta, and Moniya remained the stop stations of the Lagos Ibadan train services."
  },
  {
    "headline": "Twitter ban: Govt officials, others switch to Indian app, Koo",
    "summarized_story": "By Lukman OlabiyiFollowing the ban on US microblogging platform, Twitter, the Federal Government, President Muhammadu Buhari, Vice President Yemi Osinbajo, and public office holders have switched to Indian App, Koo.\nApart from Federal Government officials that are already active on the new platform, some state governments officials have also discarded their Twitter accounts and switched to Koo.\nThe verified account of the Federal Government on the app is @Nigeriagov, and it has over 20 posts.\nPresident Buhari who also joined the new app in June already has 7, 374 followers and following none.\nAhmad, the president’s aide on new media, was already getting closer to hitting 10, 000 followers."
  },
  {
    "headline": "Inflation Drops to 17.93%",
    "summarized_story": "According to the CPI figures for May which was released by the statistical agency Tuesday, food inflation dropped to 22.28 per cent from 22.72 per cent in April.\nOn month-on-month basis, the food sub-index declined to 1.05 per cent in May from 0.99 per cent recorded in the preceding month.\nOn the other hand, core inflation, which excludes the prices of volatile agricultural produce rose to 13.15 per cent from 12.72 per cent in the review period.\nOthers are furniture and furnishing, carpet and other floor covering, motor cars, hospital services, fuels and lubricants for personal transport equipments, cleaning, repair and hire of clothing, other services in respect of personal transport equipments, gas, household textile and non durable household goods.\nSimilarly, food inflation was highest in Kogi 32.82 per cent, Kwara 26.02 per cent and Enugu 25.43 per cent, while Akwa Ibom 20.06 per cent, Bauchi 18.65 per cent and Abuja 16.91 per cent recorded the slowest rise in year on year inflation."
  },
  {
    "headline": "Clark Chastises President, Northern Elders for Silence over Jihadists’ Threat to Delta",
    "summarized_story": "He told reporters in Abuja that given their promptness in reacting to similar threats to herdsmen, he had expected Buhari and the Northern elders to condemn the threats to Delta State.\nThe group, on Sunday, had given Delta State a 72-hour ultimatum to review its ban on open grazing or risk an attack.\nClark, while condemning the silence of the federal government and Northern elders said open grazing was buried for good in all the 17 Southern states.\nBe warned!”However, the Delta State Police Command, in a statement by its spokesman, Mr.\nThe statement said the police were unwavering in their commitment to the security of lives and property of the people of Delta State."
  },
  {
    "headline": "Nigeria Must Decentralise Now or Risk Disintegration, Soyinka Warns",
    "summarized_story": "“If it (Nigeria) fails to decentralise, some people use the word reconstruction, some use whatever.\nBut if Nigeria fails to decentralise as fast as possible, manifestly, not as rhetoric, then Nigeria cannot stay together,” he warned, adding: “Again, it’s not Wole Soyinka saying this.\nOn how to make the system work again, he said: “It relates to what I was saying earlier.\nIf you study the constitution very carefully, you will find out that they have certain powers which they haven’t touched.\nI want to say this, it was a very instructive interview, and no doubt there was nothing new."
  },
  {
    "headline": "Despite Public Outcry, Nigeria to Borrow More for Railways Expansion",
    "summarized_story": "However, Amaechi said Nigeria had been fulfilling its loan obligations as it had never defaulted in the repayment of loans, especially for the railway projects.\nThe minister added that monthly revenue from the Abuja-Kaduna railway operation has increased from N70 million to N350 million as of May.\nHe also refuted the suggestion that some obnoxious clauses in the Chinese loan agreements may lead to mortgaging Nigeria’s assets in the case of default.\n“Under the regime of former President Goodluck Jonathan, the loan for Abuja – Kaduna was about $500 million.\nWe’ve not even commenced negotiation.”Amaechi said more Chinese loans would be needed to extend the railway services to other states."
  },
  {
    "headline": "Amaechi: Buhari’s Visit Has Shown Apapa Port’s Problem is Inefficiency",
    "summarized_story": "He also said that terminal operators must contribute to the total reconstruction and reorganisation of the Apapa Seaport.\nHe said: “What I’ve done, was to have a meeting with the terminal operators, and I told them that they have to contribute to the reconstruction of the Apapa Seaport.\nHe stressed that, “before we came, various contractors were contracted to provide security for oil companies in the water.\nSo, we are able to provide security in the coastal region, both on land and on the sea.\nThat’s the impact it will have when it comes to the Deep Blue project."
  },
  {
    "headline": "2023: Tinubu In France For Medical Checkup, His Health Deteriorating Due To Old Age",
    "summarized_story": "The National Leader of the All Progressives Congress and former Lagos State Governor, Bola Tinubu, is presently in Paris, the French capital, for a medical checkup as his health is fast deteriorating.\n“Tinubu is in Paris, France for a medical checkup.\nThough the former Lagos state governor has not openly declared his intention to run for president in 2023, it is an open secret that he intends to succeed President Muhammadu Buhari.\nNigeria's President, Buhari has spent over 200 days on medical leave in the United Kingdom since he assumed office in 2015.\nThe statement read, “President Muhammadu Buhari proceeds to London, the United Kingdom, Tuesday, March 30, 2021, for a routine medical check-up."
  },
  {
    "headline": "2023: Tinubu In France For Medical Checkup, His Health Deteriorating Due To Old Age",
    "summarized_story": "The National Leader of the All Progressives Congress and former Lagos State Governor, Bola Tinubu, is presently in Paris, the French capital, for a medical checkup as his health is fast deteriorating.\n“Tinubu is in Paris, France for a medical checkup.\nThough the former Lagos state governor has not openly declared his intention to run for president in 2023, it is an open secret that he intends to succeed President Muhammadu Buhari.\nNigeria's President, Buhari has spent over 200 days on medical leave in the United Kingdom since he assumed office in 2015.\nThe statement read, “President Muhammadu Buhari proceeds to London, the United Kingdom, Tuesday, March 30, 2021, for a routine medical check-up."
  },
  {
    "headline": "Factional Nigerian Students Association President, Asefon, Aides Risk Jail Terms For Abusing Naira Notes",
    "summarized_story": "The factional President of the National Association of Nigerian Students (NANS), Sunday Asefon and some of his aides have violated the Central Bank of Nigeria’s rule, which forbids anyone from abusing the naira by spraying and stepping on them in public.\nIn a video obtained by SaharaReporters, Asefon was seen being sprayed wads of cash at an event while he stepped on them.\nSunday AsefonSome students have expressed their reservations about the 19-second clip, calling on the Nigerian government to sanction Asefon.\nSome based their complaints on financial waste and others on disregard for the Central Bank of Nigeria’s (CBN) regulation against spraying or stepping on the naira.\nAccording to Section 21(3) of CBN Act 2007 “spraying of, dancing or matching on the Naira or any note issued by the Bank (CBN) during social occasions or otherwise howsoever shall constitute an abuse and defacing of the Naira or such note and shall be punishable under Sub-section 1 of this section.”The law, in Section 5 (i) goes further to define “Matching” to include “spreading, scattering or littering of any surface with any Naira notes or coins and stepping thereon, regardless of the value, volume, occasion or intent” while in 5(ii) “Spraying” includes adorning, decorating or spraying anything or any person or any part of any person or the person of another with Naira notes or coins or sprinkling or sticking of Naira notes or coins in a similar manner regardless of the amount, occasion or the intent.”WATCH: NANS President, Asefon, Aides Publicly Violate CBN Act Days After Receiving N70m From Nigerian Government, Yahaya Bello pic.twitter.com/TQLwL97eCb — Sahara Reporters (@SaharaReporters) June 15, 2021In Section 21(4), it is also a punishable offence for “any person to hawk, sell or otherwise trade in the Naira notes, coins or any other note issued by the Bank.”The stated offences above are punishable under Sub-section 21(1) which provides, among other things that, a person “shall on conviction be liable to imprisonment for a term not less than six months or to a fine not less than N50,000 or to both such fine and imprisonment.”"
  },
  {
    "headline": "Factional Nigerian Students Association President, Asefon, Aides Risk Jail Terms For Abusing Naira Notes",
    "summarized_story": "The factional President of the National Association of Nigerian Students (NANS), Sunday Asefon and some of his aides have violated the Central Bank of Nigeria’s rule, which forbids anyone from abusing the naira by spraying and stepping on them in public.\nIn a video obtained by SaharaReporters, Asefon was seen being sprayed wads of cash at an event while he stepped on them.\nSunday AsefonSome students have expressed their reservations about the 19-second clip, calling on the Nigerian government to sanction Asefon.\nSome based their complaints on financial waste and others on disregard for the Central Bank of Nigeria’s (CBN) regulation against spraying or stepping on the naira.\nAccording to Section 21(3) of CBN Act 2007 “spraying of, dancing or matching on the Naira or any note issued by the Bank (CBN) during social occasions or otherwise howsoever shall constitute an abuse and defacing of the Naira or such note and shall be punishable under Sub-section 1 of this section.”The law, in Section 5 (i) goes further to define “Matching” to include “spreading, scattering or littering of any surface with any Naira notes or coins and stepping thereon, regardless of the value, volume, occasion or intent” while in 5(ii) “Spraying” includes adorning, decorating or spraying anything or any person or any part of any person or the person of another with Naira notes or coins or sprinkling or sticking of Naira notes or coins in a similar manner regardless of the amount, occasion or the intent.”WATCH: NANS President, Asefon, Aides Publicly Violate CBN Act Days After Receiving N70m From Nigerian Government, Yahaya Bello pic.twitter.com/TQLwL97eCb — Sahara Reporters (@SaharaReporters) June 15, 2021In Section 21(4), it is also a punishable offence for “any person to hawk, sell or otherwise trade in the Naira notes, coins or any other note issued by the Bank.”The stated offences above are punishable under Sub-section 21(1) which provides, among other things that, a person “shall on conviction be liable to imprisonment for a term not less than six months or to a fine not less than N50,000 or to both such fine and imprisonment.”"
  },
  {
    "headline": "Panic As Dreaded Bakassi Boys Return To South-East After Years Of Redundancy",
    "summarized_story": "A deadly group of vigilantes in the South-East, Bakassi Boys, after years of redundancy, has returned to some areas of Awka, Anambra State capital, Daily Trust reports.\nTheir members were viewed in two moving vans, singing and warning criminals, but who brought them could not be ascertained.\nWhen contacted, the Police Public Relations Officer in the state, Ikenga Tochukwu, said he was not aware of the development.\nMeanwhile, a source said, “The boys came primarily for alleged cult groups which have taken over Awka town in recent time without any response from the police.\nLet’s see how things work out in the days and weeks to come.”The Bakassi Boys are usually armed with machetes and guns, with all manner of charms worn around their body."
  },
  {
    "headline": "NPHCDA: Nigeria to receive 3.9m doses of AstraZeneca COVID vaccine by August",
    "summarized_story": "The federal government says Nigeria is scheduled to receive 3.92 million doses of the Oxford/AstraZeneca COVID-19 vaccine by August.\nHe said 1,978,808 first doses and 680,345 second doses of the vaccine have been administered across Nigeria, adding that due to requests, vaccination of the first dose which had been closed has now been reopened.\nFor such persons, their second dose will be due in 12 weeks and by then we would have received the next consignment of vaccines.\n“We now have information that Nigeria will get 3.92 million doses of Oxford/Astrazeneca by end of July or early August.\n“It is therefore comforting to know that the vaccine used in Nigeria can protect against this variant that caused high morbidity and mortality in India,” he added."
  },
  {
    "headline": "NPHCDA: Nigeria to receive 3.9m doses of AstraZeneca COVID vaccine by August",
    "summarized_story": "The federal government says Nigeria is scheduled to receive 3.92 million doses of the Oxford/AstraZeneca COVID-19 vaccine by August.\nHe said 1,978,808 first doses and 680,345 second doses of the vaccine have been administered across Nigeria, adding that due to requests, vaccination of the first dose which had been closed has now been reopened.\nFor such persons, their second dose will be due in 12 weeks and by then we would have received the next consignment of vaccines.\n“We now have information that Nigeria will get 3.92 million doses of Oxford/Astrazeneca by end of July or early August.\n“It is therefore comforting to know that the vaccine used in Nigeria can protect against this variant that caused high morbidity and mortality in India,” he added."
  },
  {
    "headline": "REWIND: How Jonathan 'stalled NLNG Train 7' because of 'Bayelsa factor'",
    "summarized_story": "After a prolonged delay, President Muhammadu Buhari has finally flagged off construction work for the Nigeria Liquified Natural Gas (NLNG) Train 7 project in Bonny Island, Rivers state.\nAdvertisementIn his book, “From Storeroom to Boardroom: How Integrity and Courage Shape Global Business”, Babs Omotowa, former chief executive officer (CEO) of NLNG, narrated how the lack of political support from former President Goodluck Jonathan “deliberately stalled” the NLNG Train 7 project.\nAdvertisementHe said Jonathan and Dizeani saw the location of the NLNG Train 7 project in Bonny Island in Rivers as a competition to the proposed Brass LNG in Bayelsa.\n“As a result, Train 7 fell from favour and remained stuck due to the loss of government support, which is crucial for any LNG project.\nShale gas was adding competition, and a price decline was looming,” the former NLNG CEO said in the book."
  },
  {
    "headline": "REWIND: How Jonathan 'stalled NLNG Train 7' because of 'Bayelsa factor'",
    "summarized_story": "After a prolonged delay, President Muhammadu Buhari has finally flagged off construction work for the Nigeria Liquified Natural Gas (NLNG) Train 7 project in Bonny Island, Rivers state.\nAdvertisementIn his book, “From Storeroom to Boardroom: How Integrity and Courage Shape Global Business”, Babs Omotowa, former chief executive officer (CEO) of NLNG, narrated how the lack of political support from former President Goodluck Jonathan “deliberately stalled” the NLNG Train 7 project.\nAdvertisementHe said Jonathan and Dizeani saw the location of the NLNG Train 7 project in Bonny Island in Rivers as a competition to the proposed Brass LNG in Bayelsa.\n“As a result, Train 7 fell from favour and remained stuck due to the loss of government support, which is crucial for any LNG project.\nShale gas was adding competition, and a price decline was looming,” the former NLNG CEO said in the book."
  },
  {
    "headline": "Wike tackles Buhari: You can’t abandon security for governors... your mandate is beyond seeking loans",
    "summarized_story": "Nyesom Wike, governor of Rivers state, says it is wrong for President Muhammadu Buhari to abandon his constitutional responsibility of securing Nigerians for governors.\nBut while inaugurating a road project in Etche LGA of Rivers on Tuesday, Wike said Buhari cannot shift the responsibility of securing Nigerians to governors when he is the commander-in-chief of the armed forces.\n“Mr President, you’re the Commander- in-Chief of the Armed Forces of the Federal Republic of Nigeria.\nIt is not when things are going bad concerning security, and you say you’re not in charge, and it becomes governors’ responsibility.\nAdvertisement“Mr President should have come out openly and said, my APC governors, stop worrying me."
  },
  {
    "headline": "Disruption to telecoms services in Nigeria likely as union workers plan strike action from Wednesday",
    "summarized_story": "Nigeria’s sole trade union in the telecommunications industry, the Private Telecommunications and Communications Senior Staff Association of Nigeria (PTECSSAN), has threatened to go on a nationwide three-day warning strike over alleged violation of national labour laws by employers.\nThis could result in a disruption to cellular and data services, and potentially affect the broader economy.\nThe Nigerian government had to step in to avert a strike action planned by the union.\nIf embarked on, the planned industrial action would be the first nationwide strike by workers in the telecoms industry.\nAffiliated with the National Labour Congress, PTECSSAN is one of the largest trade associations in Nigeria being the only union in the telecommunications sector."
  },
  {
    "headline": "Egyptian e-commerce startup Fatura secures $3 million for service and market expansion",
    "summarized_story": "Fatura, a Cairo-based tech startup that connects wholesalers and manufacturers with retailers through a mobile application, on Monday said it has raised $3 million in pre-Series A funding.\nThe round was co-led by Sawari Ventures and Arzan Venture Capital with participation from Egypt Ventures, EFG-EV, Cairo Angels, and Khwarizmi Ventures.\nFatura sells inventory to grocery retailers using a network of manufacturers and wholesalers in different industries.\nCollectively, the digital B2B players in the FMCG space capture less than five percent of the market and there is a long way to go,” Hossam Ali said in an official press release announcing the latest funding.\nAfter recording significant success in the consumer goods sector, Fatura is now running a pilot in other industries."
  },
  {
    "headline": "Ethio Telecom 40% stake sale set to break up Ethiopia’s enduring telecoms monopoly",
    "summarized_story": "Ethiopia has announced a tender process for the sale of a 40% stake in state-owned telecommunications company, Ethio Telecom.\nThe proposed minority sale of Ethio Telecom – the sole mobile services provider in a country of over 100 million people – is part of a broader plan to liberalise the country’s monopolistic telecoms sector.\nIn May, the government awarded one of the two available private operating licences to break up Ethio Telecom’s monopoly on the sector.\nAccording to Brook Taye, a senior advisor at the finance ministry, the 40% in Ethio Telecom will be sold as a single stake to a single investor.\nFounded in November 2010, Ethio Telecom currently has around 53 million subscribers and has since December generated a revenue of around $600 million."
  },
  {
    "headline": "‘tribe naija’, new online conversation App debuts in Nigeria…available on Google App Store & IOS",
    "summarized_story": "A new online conversation App, tribe naija has berthed in the Nigerian online space.\nThe App is a community-based platform specifically developed for Nigerians to network and have conversations on issues of common interest.\nThe tribe naija App was launched in Abuja on June 12, 2021 during the Fireside Chat event held at the Sheu Musa Yar’Adua Centre in commemoration of Democracy Day.\nAbiola noted that the tribe naija App, developed and designed by Mewa international LLC, is expected to serve as a safe haven for Nigerians to talk and be heard.\nAlso speaking, the technical consultant, Tribe Naija, Mr. Fady Khatib explained that the app is unique considering the value it is bringing to the table for Nigerians."
  },
  {
    "headline": "Tips to help you stay safe online when transferring funds to & from Nigeria",
    "summarized_story": "Digital money transfer methods have made cross border financial transactions, and now, a process that could otherwise take days has been reduced to just a few minutes.\nThe uptake of digital financial services at home means that more Nigerians can send and receive money from across the world.\nGo the extra mile and make sure the money transfer service is committed to protecting your personal data.\nTrack your money transfer.\nLast year, WorldRemit launched a Transfer Tracker App which allows recipients of money transfers to track their funds."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Fatura’s pre-series A funding, Ethio Telecom’s partial privatisation, YouTube’s latest ad ban",
    "summarized_story": "Good day,Today, I’m discussing:Fatura’s latest funding roundEthio Telecom’s 40% stake saleYouTube’s latest ad banEgypt-based Fatura raises $3m pre-series AFatura Co-founders.\nOther investors in the round include Egypt Ventures, The Cairo Angels, Saudi Arabia-based VC, Khwarizmi Ventures, and fintech-focused accelerator, EFG-EV.\nIn July 2020, the startup raised an undisclosed seed round, and this is their second funding round since then.\nEthiopian government to sell 40% stake of Ethio TelecomThe Ethiopian Communications Authority (ECA) has launched a tender to aid the partial privatisation of state-owned telecommunication operator, Ethio Telecom.\nWith this in place, interested private investors can apply, and the chosen bidder will own a 40% stake in Ethio Telecom."
  },
  {
    "headline": "#WorldBloodDonorDay: 5 startups improving access to safe blood in Africa",
    "summarized_story": "AdvertisementThis is not sustainable as family and friends of accident victims, for example, may not be readily available to donate blood.\nIn 2016, Bime started Infiuss, a blood bank management system that connects hospitals with blood banks with hospitals without a blood bank.\nIt connects hospitals with blood banks or donors and assists in screening, tracking, storage, distribution, preparation of blood products, and inventory management.\nIt only provides information on which blood banks have the blood that is needed.\nWe can’t all build startups that save lives, but we can donate blood regularly and save lives in our little way."
  },
  {
    "headline": "5 online platforms to get collateral-free loans for your small business in Nigeria",
    "summarized_story": "As a small business owner, growing your business and meeting your customers’ needs should be your top priorities.\nI hear you, and I’ve received mail from small business owners with the same needs.\nCarbon’s SME loansCarbon’s SME loans is a product that allows you to “grow your small business with affordable, collateral-free loans.” SMEs can access up to ₦1,000,000 without collateral, guarantors, or paperwork.\nFastCreditFastCredit offers business loans to micro, small, and medium enterprises to support business growth.\nLearn more about how to launch, market and grow your business at SME Clinic 2021Are you a small business owner?"
  },
  {
    "headline": "With 6.3% NPLs, Nigerian banks show signs of stress",
    "summarized_story": "With some 6.3 percent Non-Performing Loans (NPLs) sitting in the balance sheets of Nigerian banks, the system is already showing signs of stress, the World Bank warned on Tuesday as it raised doubts on the country’s 1.8 percent economic growth projection for 2021.\n“Despite the harsh operating environment, the banking system has proven generally resilient,…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "For first time in 2yrs, Nigeria’s inflation rate slows for second straight month",
    "summarized_story": "For first time in 2yrs, Nigeria’s inflation rate slows for second straight monthNigeria’s inflation rate surprisingly slowed to 17.93% in May 2021 from 18.12% in April 2021 beating most analysts’ forecasts.\nThe slowdown however doesn’t provide much relief to Nigerians reeling from an inflation rate that remains double the Central Bank’s preferred level.\nAnalysts had projected that Nigeria’s inflation rate would resume its 21-month upward rise into…"
  },
  {
    "headline": "Surging inflation pushes 7m Nigerians into poverty",
    "summarized_story": "Nigeria’s surging inflation rate has pushed 7 million Nigerians into poverty, the World Bank said in its latest Nigeria Development Update report.\nAccording to the report, before inflation started rising steadily, there were 82.9 million poor Nigerians but the number has risen to 90.1 million as a result of the price shock.\nNigeria’s inflation jumped…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Youth Corpers Disagree With Authorities, Seek National Assembly Intervention – Nigerian Observer",
    "summarized_story": "Authoritative source revealed that the authority of the National Youth Service Corps ( NYSC) have denied applications for redeployment from the north tendered by some southern corps members, mainly doctors, nurses, pharmacists and other healthcare professionals.\nThe medical corps members are worried about their lives due to the insecurity in the northern region where cases of Boko Haram, herdsmen and banditry violence have worsened in recent times.\nHe also noted that there were hardly any provisions made for the corps members in terms of accommodation and security.\nThis is to the Director-General of NYSC; please allow all corps members to relocate or redeploy to their states of choice.\n“The accommodation they give corps members is not befitting."
  },
  {
    "headline": "Orhionmwon NULGE inaugurates new excos – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestORHIONMWON – The newly elected executives of Orhionmwon chapter of National Union of Local Government Employees (NULGE) were on Tuesday inaugurated at the council secretariat, Abudu, Edo State.\nSpeaking after their oath taking, the new Orhionmwon NULGE chairman, Osagie Kingsley called for unity among council staff, adding the time of election was over.\nHe assured the council management of continuous workers support “to build the local government and place it where it ought to be”.\nThe outgone chairman, Mathew Ighodaro spoke with our correspondent immediately after ceremony, wished the newly inaugurated executives well, praying they surpass his achievements.\nThe newly inaugurated excos include the Chairman, Osagie Kingsley, Vice chairman, Osazee Joseph, chairperson, Mrs Alenokhuorie Bridget, Secretary, Omoruyi Kelvin, others are Assistant secretary, James Paul, Treasurer, Mrs Ayeboze Osifo, Auditor, Harrison Onaghise."
  },
  {
    "headline": "Edo State Education Board Commends Philanthropist for School Donation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In recognition of the contributions to the development of education in the state and empowerment of students, the Edo State Universal Basic Education Board has commended philanthropist and “entrepreneur” Dennis AinabelIseghohimen.\nIt would be recalled that Mr. Iseghohimen had donated brush cutters to some government schools in Esan West Local Government Area (LGA) of Edo State in furtherance of efforts to ease the clearing of weeds and bushes within the premises of the schools.\nHe ascribed all the glory to God for his help and pledged to persist in seeking ways to contribute to the socio-economic development of Esan land and Edo State.\nMr. Iseghohimen called on other well-meaning individuals to support the government’s effort to improve the quality of life in communities across not just Esan West but also the whole Edo State.\nThe philanthropist had earlier renovated Eresoyen Primary School in Uhogua, Community in Edo State and is constantly looking for new options to give back to the community."
  },
  {
    "headline": "Aiteo Cup Tourney as EFA,Others Condemn Remo Attack – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The defending champions of Edo State FA/Aiteo Cup Bendel Insurance Football Club of Benin have been nominated to represent the state in this year’s Federation/Aiteo Cup competition.\n“We considered the psychological trauma and other physical injuries Insurance suffered in Remo attack and their capacity to give the rest of us in Edo football family, adequate representation during the competition before arriving at our decision.\nThe visitors who expressed disappointment over the attack, encouraged Insurance to be strong, assuring them of continued support.\n” We are visiting you after a week of the attack on you doesn’t mean we do not care about you.\nThe Barbaric act of Remo is capable of bringing Nigeria’s football to disrepute if not checked.”Abu reacted."
  },
  {
    "headline": "How I will address Nigeria’s security challenges – COAS Yahaya",
    "summarized_story": "The new Chief of Army Staff (COAS), Farouk Yahaya, says addressing security challenges in Nigeria required joint efforts of all.\nHe said he hopes to bring his 36 years experience in the army to bear and work with other chiefs to address security challenges in the country.\nMr Yahaya said he had all it takes to do the job to address security challenges in the country, given his wealth of experience.\nHe promised to work with members of the National Assembly and to leverage on their offices to get information from the grassroots to address security challenges in the country.\nEarlier, the Chairman, House Committee on Defence, Benson Babajimi (APC-Lagos), said the country was bedevilled by security challenges and secessionist agitations."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Kemi Adeosun launches ‘Dash Me’ Foundation",
    "summarized_story": "Adebayo ObajemuVice President Yemi Osinbajo has launched the Dash Me Store, an outfit of the Dash Me Foundation founded by the immediate past Minister of Finance, Mrs Kemi Adeosun.\nThe store is established to mobilise resources for onward distribution to vulnerable people in the society via grassroots charities.\n“What Kemi and her team have done is to bring the new notion of social enterprise to this project.\nIt is a unique model which does not just give to the needy in the conventional way of merely handing out donations.\nShe said the organisation would work closely with charitable organisations in the grassroots to ensure that funds and other materials donated via the Dash Me Store get to actual beneficiaries"
  },
  {
    "headline": "Southeast residents allege genocide, as Ohanaeze says Buhari govt has killed 513, disappeared 854 and arrested 2,436",
    "summarized_story": "In a statement signed on Tuesday by its Secretary-General, Okechukwu Isiguzoro, Ohanaeze condemned President Muhammadu Buhari’s dot-in-a circle comment targeted at Igbo people.\nHe had said IPOB is “just like a dot in a circle and they have nowhere to turn to.\nThe group stated that the silence of Northern leaders is proof that they are happy over the position of President Buhari on Southeastern Nigeria.\nRight now in 160 days, 513 Igbos had been killed, 2,436 arrested and 854 missing in the ongoing ‘imported’ insecurity challenges in the southeast.\n“They (security agents) are still arresting people here and there,” a resident told our correspondent on Monday."
  },
  {
    "headline": "Twitter ban has cost Nigeria N24.72bn in 10 days",
    "summarized_story": "Nigeria has lost N24.72bn ($60.14m) in 10 days to the Twitter ban that took effect on June 5.\nAccording to NetBlocks Cost of Shutdown Tool, Nigeria loses N102.9m ($250,600) every hour to the ban.\nThe Federal Government had on June 4, 2021 announced the suspension of Twitter in Nigeria.\nAccording to a report by Statista, Nigeria has about 33 million active social media users, with about 26 per cent on Twitter.\nConsequently, the Twitter ban will likely impact negatively and disrupt businesses especially Micro, Small and Medium Enterprises who rely on social media, such as Facebook, Instagram including Twitter to conduct business."
  },
  {
    "headline": "‘You can’t ban Twitter to satisfy your ego’ – PDP govs tell Buhari",
    "summarized_story": "Governors of Nigeria’s main opposition party, the Peoples Democratic Party (PDP), have kicked against the decision of President Muhammadu Buhari administration to indefinitely suspend Twitter in Nigeria.\nThe governors who registered their displeasure with ban in a communique issued after their meeting in Akwa Ibom on Monday, said the ban was only to satisfy the president’s ego, and will worsen the country’s unemployment crisis.\nIn the communique read by chairman of the PDP governors forum and Sokoto State governor, Aminu Tambuwal, the governors maintained that the ban was not in the interest of Nigeria.\n“The meeting examined the suspension of Twitter from operating in Nigeria, and condemned the personalised reasons given for the action,” the communique read.\n“Nigerian youths do not have adequate access to employment and a lot of Nigerians rely on Twitter for their livelihood, businesses and self-employment."
  },
  {
    "headline": "Shekau’s Loyalists Comfirm Boko Haram Leader’s Death, Denounce ISWAP",
    "summarized_story": "Terrorist-members of the Jama’atu Ahlussunnah Lidda’awati Wal Jihad (JAS) otherwise known as Boko Haram, on Tuesday, confirmed the death of their leader, Abubakar Shekau.\nThe Boko Haram leader was said to have killed himself with a bomb when he realised that the ISWAP fighters wanted to capture him alive.\nISWAP, which broke away from Shekau’s Boko Haram faction in 2016, said it disagreed with the late extremist leader over his excessive use of force, especially on Muslims in areas under his influence.\nAccording to ISWAP leader, Abu Musab Albarnawi, his fighters took their arms, travelled through the Sahara, went into Shekau’s enclave, and engaged in a gun battle with his followers.\nADVERTISEMENTSome of the weapons that can be spotted with the Boko Haram fighters in the video include AKM(S)/type 56 pattern rifles, Romanian PM me."
  },
  {
    "headline": "Shekau’s Loyalists Comfirm Boko Haram Leader’s Death, Denounce ISWAP",
    "summarized_story": "Terrorist-members of the Jama’atu Ahlussunnah Lidda’awati Wal Jihad (JAS) otherwise known as Boko Haram, on Tuesday, confirmed the death of their leader, Abubakar Shekau.\nThe Boko Haram leader was said to have killed himself with a bomb when he realised that the ISWAP fighters wanted to capture him alive.\nISWAP, which broke away from Shekau’s Boko Haram faction in 2016, said it disagreed with the late extremist leader over his excessive use of force, especially on Muslims in areas under his influence.\nAccording to ISWAP leader, Abu Musab Albarnawi, his fighters took their arms, travelled through the Sahara, went into Shekau’s enclave, and engaged in a gun battle with his followers.\nADVERTISEMENTSome of the weapons that can be spotted with the Boko Haram fighters in the video include AKM(S)/type 56 pattern rifles, Romanian PM me."
  },
  {
    "headline": "Insecurity: Igbo Leaders Disown IPOB, Rally Support For Buhari",
    "summarized_story": "Igbo elders and traditional rulers and under the aegis of Igbo Delegates Assembly (IDA) and the Association of the Eze Ndigbo in 19 northern states of the federation have rallied support for the President Muhammadu Buhari administration in the bid to combat insecurity, ensure peace and unity in the country.\nThe communiqué noted that after examining the current state of the nation critically, the Igbo leaders denounced the on-going killings, banditry, and kidnapping, destruction of government property, robbery and unlawful activities of herdsmen.\nThey also declared support for the rightful demand of the Igbos for a Nigerian president of Igbo extraction in 2023, notwithstanding the political party.\nThe communiqué noted that Ohanaeze Ndigbo Worldwide is the apex body and there should be no proliferation in any part of the North.\nThe Igbo leaders dissociated themselves from individuals or group of persons masquerading as Ohanaeze Ndigbo in the 19 northern states and the FCT, even as they affirmed the expulsion of one Eze Ibe Nwosu from the association."
  },
  {
    "headline": "Insecurity: Igbo Leaders Disown IPOB, Rally Support For Buhari",
    "summarized_story": "Igbo elders and traditional rulers and under the aegis of Igbo Delegates Assembly (IDA) and the Association of the Eze Ndigbo in 19 northern states of the federation have rallied support for the President Muhammadu Buhari administration in the bid to combat insecurity, ensure peace and unity in the country.\nThe communiqué noted that after examining the current state of the nation critically, the Igbo leaders denounced the on-going killings, banditry, and kidnapping, destruction of government property, robbery and unlawful activities of herdsmen.\nThey also declared support for the rightful demand of the Igbos for a Nigerian president of Igbo extraction in 2023, notwithstanding the political party.\nThe communiqué noted that Ohanaeze Ndigbo Worldwide is the apex body and there should be no proliferation in any part of the North.\nThe Igbo leaders dissociated themselves from individuals or group of persons masquerading as Ohanaeze Ndigbo in the 19 northern states and the FCT, even as they affirmed the expulsion of one Eze Ibe Nwosu from the association."
  },
  {
    "headline": "Nigeria Has Zero Tolerance For Violence Against Women, Girls – Tallen",
    "summarized_story": "The minister of Women Affairs, Dame Pauline Tallen, on Tuesday, said the federal and state governments of Nigeria, have pledged their support to end all forms of violence against women and girls in the country.\nThe minister said President Muhammadu Buhari and the 36 state governors have zero tolerance for issues of Gender Based Violence (GBV) in Nigeria, while adding that government was doing everything possible to ensure women and girls are protected.\nThe state government is trying to resettle women and girls out of the Internally Displaced Persons (IDP) camps, by constructing a massive house for them.\n“With this workshop, we will be able to have data, fact that will support our efforts to end violence against women and girls in Nigeria,” she added.\nI also urge all stakeholders to be involve in advocacy, and to ensure that the survivors are supported.”On issues of insecurity in Nigeria, Tallen urged Nigerian women to say no to all those who are clamouring for violence and secession."
  },
  {
    "headline": "Nigeria to receive 3.92m doses of AstraZeneca vaccines end of July – FG",
    "summarized_story": "Doosuur Iwambe, AbujaThe Federal Government disclosed on Tuesday that it has received confirmation that about 3.92 million doses of the Oxford-AstraZeneca COVID-19 vaccines will arrive Nigeria by the end of July or early August.\nGiving a detailed update on the COVID-19 vaccine exercise, Shuaib said, “We now have information that Nigeria will get 3.92m doses of Oxford/Astrazeneca by the end of July or early August.\n“As we receive additional information on the exact dates in August, we will provide an update regarding timelines and details of this.\n‘’COVAX will only communicate when the vaccines are secured and our partners have validated that the vaccines have been secured’’.\n“On the final day of the summit, leaders committed to delivering at least 1 billion coronavirus vaccine doses to the world over the next year."
  },
  {
    "headline": "Nigerian couple welcome twins after 21 years of marriage",
    "summarized_story": "A Nigerian man identified as Justice Ondaipe and his wife has welcomed a beautiful set of twins after 21 years of marriage.\nA family member, Faith Elvis Ovie shared the good news on Saturday, June 12, said Ondaipe’s wife gave birth to a boy and a girl.\nREAD ALSO: Oyo commence evacuation of beggars to Akinyele resettlement centre“Congratulations uncle, God is indeed wonderful.\nAfter 21 years of marriage, God has put a smile on ur face.\nTwins, a boy, and a girl.”"
  },
  {
    "headline": "‘Pastor’ arrested for defiling 19-month-old girl in Delta",
    "summarized_story": "Human Rights group, Centre For Basic Rights Protection And Accountability Campaign on Tuesday reports the case of one pastor who allegedly defiled a 19 months old girl.\nAccording to Cindy’s report, she returned from work only to find her 19 months old daughter bleeding.\nWe will proceed from there,” the Rights group noted while disclosing the condemnable act on its Facebook page earlier.\nSubsequently, the Rights group announced that the Delta Police Command has arrested Kalu Ijeoma, the accused who is said to be a Pastor of Deliverance Evangelical Church, Onitsha.\nCentre for Basic Rights calls for a thorough and unbiased investigation into the alleged defilement of 19 months old girl.”"
  },
  {
    "headline": "JUST IN: Reps screens Yahaya, new COAS — Daily Times Nigeria",
    "summarized_story": "Farouk Yahaya, the newly appointed chief of army staff, is now being vetted by the House of Representatives Joint Committee on Defense and the Army (COAS).\nSpeaker of the House Femi Gbajabiamila read a letter from President Muhammadu Buhari seeking confirmation of Yahaya as COAS during plenary session on Tuesday.\nThe exercise comes at a time when the country is facing numerous security difficulties, according to Babajimi Benson, chairman of the defense committee, who spoke at the screening on Tuesday.\nHe stated that Yahaya must do all necessary to put a stop to the insecurity.\nDetails Shortly…"
  },
  {
    "headline": "Nigeria to receive 3.92 million doses of COVID-19 vaccine in July",
    "summarized_story": "The Federal Government on Tuesday said it is expecting a shipment of 3.92 million doses of the Oxford-AstraZeneca vaccine by end of July or early August.\nThe Executive Director, National Primary Healthcare Development Agency, Dr Faisal Shuaib, disclosed this at a press conference in Abuja.\nHe said, “We now have information that Nigeria will get 3.92m doses of Oxford-Astrazeneca by end of July or early August.\nHe added, “It is therefore comforting to know that the vaccine used in Nigeria can protect against this variant that caused high morbidity and mortality in India.\n“However, it underscores the need for us to ramp up our vaccination to more Nigerians.”PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Nigeria to receive 3.92 million doses of COVID-19 vaccine in July",
    "summarized_story": "The Federal Government on Tuesday said it is expecting a shipment of 3.92 million doses of the Oxford-AstraZeneca vaccine by end of July or early August.\nThe Executive Director, National Primary Healthcare Development Agency, Dr Faisal Shuaib, disclosed this at a press conference in Abuja.\nHe said, “We now have information that Nigeria will get 3.92m doses of Oxford-Astrazeneca by end of July or early August.\nHe added, “It is therefore comforting to know that the vaccine used in Nigeria can protect against this variant that caused high morbidity and mortality in India.\n“However, it underscores the need for us to ramp up our vaccination to more Nigerians.”PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Twitter suspension: Lawyer drags Lai Mohammed, Malami to court",
    "summarized_story": "A human rights lawyer, Inibehe Effiong, has sued the Minister of Information and Culture, Lai Mohammed, the Attorney-General of the Federation, Abubakar Malami (SAN), and the Federal Government for suspending social media platform, Twitter.\nEffiong asked the court to declare as illegal the threat of criminal prosecution issued by Malami and Mohammed against Nigerians who ‘violate’ the suspension or ban of Twitter, despite the absence of any written law.\n), who is a Twitter user, tweeted a series of tweets in a thread in response to the agitations in the South East on his verified Twitter account with the handle @MBuhari with millions of followers.\nThe lawyer said Twitter subsequently deleted the President’s comment, a move that led to the suspension of Twitter days later.\nEffiong said it was a known fact that every Twitter user had agreed to abide by the rules of the platform before being allowed to use it."
  },
  {
    "headline": "Twitter suspension: Lawyer drags Lai Mohammed, Malami to court",
    "summarized_story": "A human rights lawyer, Inibehe Effiong, has sued the Minister of Information and Culture, Lai Mohammed, the Attorney-General of the Federation, Abubakar Malami (SAN), and the Federal Government for suspending social media platform, Twitter.\nEffiong asked the court to declare as illegal the threat of criminal prosecution issued by Malami and Mohammed against Nigerians who ‘violate’ the suspension or ban of Twitter, despite the absence of any written law.\n), who is a Twitter user, tweeted a series of tweets in a thread in response to the agitations in the South East on his verified Twitter account with the handle @MBuhari with millions of followers.\nThe lawyer said Twitter subsequently deleted the President’s comment, a move that led to the suspension of Twitter days later.\nEffiong said it was a known fact that every Twitter user had agreed to abide by the rules of the platform before being allowed to use it."
  },
  {
    "headline": "Fayemi’s chilling message to Buhari: Nigeria at the precipice",
    "summarized_story": "By AbankulaGovernor Kayode Fayemi of Ekiti sent a chilling message to President Muhammadu Buhari, warning that the nation is at the precipice, economically speaking.\nFayemi, who chairs the Nigeria Governors Forum spoke on Tuesday in Abuja at the presentation of a report on Nigeria by the World Bank.\nThe report, called Nigeria Development Update, a bi-annual publication of the bank on the economic outlook of Nigeria, has the theme: “Resilience Through Reforms”.\nNigeria is a strong country but we are almost on the precipice, it is almost midnight in our country.\nFayemi said that more collaboration was needed between the Federal Government and the states to convince Nigerians that subsidy is no longer sustainable."
  },
  {
    "headline": "Poverty increasing in Nigeria under Buhari watch: World Bank",
    "summarized_story": "By Abankula, with agency reportsPoverty, accentuated by the pandemic, is increasing in Nigeria, with 11 million more people joining the rank of the poor, the World Bank said on Tuesday.\nThe World Bank expects the Nigerian inflation rate in 2021 to be 16.5%.\nThe World Bank expects the Nigerian inflation rate in 2021 to be 16.5%.\nShubham Chaudhuri, World Bank Country Director for Nigeria saidsustaining reform momentum in Nigeria is critical to ensuring robust economic recovery beyond 2021.\n“So that is part of the restructuring or policy reforms in a number of areas."
  },
  {
    "headline": "Tinubu not dead, he’s hale and hearty",
    "summarized_story": "By Kazeem UgbodagaNational Leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu is not dead contrary to rumours flying around the country.\nSome fake online news platforms have been feasting on the story of the purported death of Tinubu.\nA top aide of the former governor of Lagos who craved anonymity said the purported death of Tinubu was fake news and should be disregarded.\nThe source said Tinubu travelled to Dubai and is on his way back.\nHe was said to have fallen on his two kneels and sustained injuries, which necessitated his travelling to Dubai for medical attention."
  },
  {
    "headline": "Industrialization: The Governor Udom Emmanuel magic formula",
    "summarized_story": "Industrialization, the development of industries on a broad scale, is one policy vigorously pursued and strategically implemented by the Deacon Udom Emmanuel led administration in Akwa Ibom State that has left many astonished.\nGovernor Udom Emmanuel saw when others were doubting that air transport’s influence on investment is key as good air transport links influence where companies choose to invest.\nOn March 26 2020, Ibom Air was forced to suspend operations due to the Covid19 pandemic that ravaged the world.\nIbom Air carries the collective pride of Akwa Ibom people and we should all celebrate it.\nIndeed, as Vice President Yemi Osinbajo once confessed, under the Udom Emmanuel led administration in the state, Akwa Ibom remains Nigeria’s best kept secret."
  },
  {
    "headline": "Don’t Abdicate Your Constitutional Roles To States, Wike Tells Buhari",
    "summarized_story": "Nyesom Wike, the governor of Rivers State, believes it is unlawful for President Muhammadu Buhari (retd.)\nto delegate his constitutional powers of protecting Nigerians’ lives and property to state governors.\nHow can people appointed by Mr. President be under me?”“It is not only to borrow money for Nigeria that you’re in charge.\nI, as the governor of Rivers under PDP, you’ll never find me there,” Wike said.\nThe Odufor-Akpoku-Umuoye Road is a project that will outlive everybody in this place."
  },
  {
    "headline": "Nigerians Now Proud To Use Made-in-Nigeria Products – FG",
    "summarized_story": "As a result, he added, Nigerians now proudly consume products labeled “Made in Nigeria,” adding that this would have an impact on the country’s Gross Domestic Product, the creation of jobs, and the cost of production.\nMustapha made the remarks while giving the keynote presentation at the opening of a Nigerian-made products show in Abuja.\nLocal production of hitherto imported products is beginning to gain grounds that I make bold to say that the materials produced locally can compete favorably with the imported ones.\nMustapha tasked regulatory bodies with ensuring that local products met international standards.\nHe said, “Manufacturing is part of the economic sector in Nigeria that contributes approximately 10 per cent of its Gross Domestic Product each year."
  },
  {
    "headline": "BREAKING: INEC Releases New Date For Osun Guber",
    "summarized_story": "The gubernatorial election in Osun State for 2022 will now take place on Saturday, July 16th, 2022.\nThis information was collected by NewsDirect from a timetable issued by the Independent National Electoral Commission (INEC).\nThe program of activities for the election will begin with the publication of the Notice of Election on February 1, 2022, according to a timetable issued by INEC Secretary Rose Oriaran-Anthony on July 10, 2021."
  },
  {
    "headline": "Niger gov’s angst on 150 kid-captives: Bandits’ informants in my government",
    "summarized_story": "Politicians within government corridors have been releasing strategic planning to bandits as informants in order to make money, Governor Abubakar Sani-Bello of Niger state has said.\nEven when we hold meetings, few moments later, the bandits will be saying the governor has said this and that.\nHe expressed concern that some people were eager to make money while children within ages three and 11years were in captivity.\nZakiri was known for leading other vigilantes in protecting his community and environs against invaders that killed and destroyed properties.\nGovernor Bello Mohammed Matawalle had last week, directed communities across the state to go on self-defence whenever bandits strike."
  },
  {
    "headline": "VIDEO: Watch what Youth and Sports Development Minister Sunday Dare told newly inaugurated AFN board",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Minister Dare swears in newly elected President, VPs, other Athletics Federation of Nigeria board members",
    "summarized_story": "PreviousRe: Presidentiak interview: A change in perception is necessary"
  },
  {
    "headline": "JUSUN commends Ita Enang for support during industrial action -NigPilot",
    "summarized_story": "Judicial Staff Union of Nigeria, JUSUN, has commended the Secretary, Presidential Implementation Committee for Autonomy of State Judiciary and Legislature, Senator Ita Enang, for his support during the period of their industrial action to press home their demands for a free, strong and independent judiciary in Nigeria.\n“The above mention Union write to appreciate your support during the period of her industrial action to press home her demands for free, strong and independent Judiciary in Nigeria.\n“The Union believes that if judiciary became free, the justice system would be better administered for the betterment of Nigerians.\n“While thanking you for your continuous support during and after the turbulent time of our great union, we assure you of our support always,” part of the letter read.\nSenator Enang is also the Senior Special Assistant to the President on Niger Delta Affairs."
  },
  {
    "headline": "Ita Enang urges State Govs to engage youths on insecurity -NigPilot",
    "summarized_story": "Senior Special Assistant to the President on Niger Delta, Senator Ita Enang, has called on State Governors to engage youths in their states to find ways of addressing the security challenges confronting the country.\n“We need to apologies to them and on my little part I apologies to them for the little we did not do at certain time and please let return back to the table.\nHe added that “when we were busy educating our children in the best of schools, what did we do for them, when we were busy thinking of the welfare of our children.\n“So we are collectively reaping the fruit of bad governance at the state level while President Buhari is now saddled with the responsibility to finding solution to the problem.\nBy God grace he is providing the solution,” he added."
  },
  {
    "headline": "Christian Aid advocates for domestication of Child Rights Act -NigPilot",
    "summarized_story": "An international non-governmental organization – Christian Aid Nigeria and other Civil Society Organisations (CSO) are advocating for the domestication of the Child Rights Act as part of activities lined up to commemorate the 2021 International Day of the African Child.\nThe group identified religious and cultural beliefs as the major factors militating against full domestication of the Child Rights Act in most national and sub-national authorities across Africa.\nThis is contained in opinions expressed during a Webinar organised by Christian Aid UK, Nigeria to discuss Child Rights.\nMr Martins Abantlehe, Programme Communications Volunteer, Christian Aid said that the International Day of the African Child was designated by the African Union on June 16th yearly to draw attention to the plights of the African child.\nHe further explained that in Nigeria, the Child Rights Act is the policy framework that exists to provide and protect the rights of a Nigerian child; and other related matters."
  },
  {
    "headline": "F.G blames Twitter for losses during #EndSARS -NigPilot",
    "summarized_story": "The minister stressed that it was unfair to conclude that the operation of Twitter was suspended indefinitely because it deleted President Muhammadu Buhari’s message.\n“If you ask people to donate money via bitcoins for EndSARS protesters then you are vicariously liable for whatever is the outcome of the protest.\nMohammed said among other conditions for Twitter to resume operation in Nigeria, there must be an agreement as to what contents it could post.\n“I can confirm that Twitter has written the Federal Government that they are ready to talk.\nAs we have always maintained, the door is not locked and we are open-minded but Twitter must work towards it,” he said."
  },
  {
    "headline": "FG Reopens First Dose COVID-19 Vaccination, Says Second Dose To End June 25",
    "summarized_story": "The Nigerian government has reopened the administration of the first dose of the Oxford/AstraZeneca COVID-19 vaccine in various parts of the country.\nShuaib called on all Nigerians who have received their first dose to check their vaccination cards for the date of their first dose.\nHe asked them to ensure that they receive the second dose between six and 12 weeks from the date they took the first dose, to gain full protection against the COVID-19 virus.\nThe NPHCDA boss stated that in some cases, the location of the second dose could be different from that of the first dose.\n“I, therefore, urge all Nigerians who have received their first dose at least six weeks ago to visit the nearest vaccination site to receive their second dose, for full protection against COVID-19 on or before June 25 when we shall close the administration of the second dose,” he pleaded."
  },
  {
    "headline": "Nigeria’s Headline Inflation Drops To 17.93%, But Food Prices Rise",
    "summarized_story": "Nigeria’s headline inflation dropped for the second consecutive month in May, but the prices of food have continued to surge.\nWhile this is 0.19 per cent points lower than the 18.12 per cent recorded in April, increases were recorded in all Classification of Individual Consumption by Purpose (COICOP) divisions that yielded the headline index.\nSimilarly, the urban inflation rate rose to 18.51 percent (year-on-year) in May from 18.68 per cent recorded in April, just as the rural inflation rate stood at 17.36 per cent in May from the 17.57 per cent previously reported.\nFood Prices On The RiseThe composite food index, on the other hand, rose by 22.28 per cent in May as against the 22.72 per cent reported in April.\nIt disclosed that the food sub-index increased by 1.05 per cent in May from the 0.99 per cent recorded in April, on a month-on-month basis."
  },
  {
    "headline": "Reps Screen Chief Of Army Staff",
    "summarized_story": "The House Of Representatives Joint Committees on Army and Defence has screened President Muhammadu Buhari’s nominee for the position of Chief of Army Staff, Major General Farouk Yahaya.\nThe screening took place on Tuesday behind closed doors in the National Assembly chambers in Abuja.\nSpeaking earlier, Major General Farouk Yahaya in his introductory remarks, stated that contrary to public perception, there has been synergy among security agencies to tackle insurgency, especially since the emergence of the new service chiefs.\nRead Also: Army Releases New Postings, Appointments Of Senior OfficersPresident Buhari appointed Major General Yahaya as the new Chief of Army Staff on May 27.\nThe appointment came days after the immediate past army chief, Lieutenant-General Ibrahim Attahiru died in an air crash in Kaduna along with 10 other military officials."
  },
  {
    "headline": "We Will Tame The Monster Of Corruption In Nigeria – EFCC Boss",
    "summarized_story": "Chairman of the Economic and Financial Crimes Commission (EFCC) Abdulrasheed Bawa says he is optimistic that the anti-graft agency will tame the monster of corruption in the country.\nBawa said this on Tuesday during an interview on Channels Television breakfast programme, Sunrise Daily, when he was asked if the scope of corruption overwhelms him.\nNo, because I am very optimistic we will succeed in taming the monster of corruption in this country.\n“We have already designed the manual for that.”Forty-year-old Bawa was appointed EFCC Boss by President Muhammadu Buhari on February 16.\nDuring his screening by the Senate, Bawa vowed that the constitution will guide his actions as the EFCC Chairman."
  },
  {
    "headline": "At Least Three Judges Sit In Lagos As Courts Resume Activities",
    "summarized_story": "At least three judges of the Lagos High Court in Ikeja sat to hear proceedings on Tuesday following the resumption of judicial activities in courts across the country.\nCourt staff, lawyers, and litigants arrived at the court premises, some as early as 8am while most of the courtrooms were open with parties seen moving in and out.\nThis was because the dates for hearings had been overtaken by the industrial action by members of the Judiciary Staff Union of Nigeria (JUSUN).\nElsewhere at the Federal High Court in Ikoyi, activities were on low-key with only one judge sitting when the crew monitored proceedings.\nJUSUN embarked on a nationwide strike on April 6 to demand the implementation of the financial autonomy of the judiciary."
  },
  {
    "headline": "Governor Uzodinma charges Policemen to take the fight to bandits, Others",
    "summarized_story": "Imo State Governor Hope Uzodimma has told the police not to close their eyes and allow bandits to murder them in cold blood.\nThe governor charged the officers and men to shoot the bandits first before they are killed.\nAdvertisementHe also charged the officers to up their game in tackling insecurity and restoring peace and stability in the state.\nWith the support of the Governor, we have done our best to restore normalcy and peace in the state.\nWe shall continue to do our best to maintain a safe state for citizens and residents of Imo State,” Yaro said."
  },
  {
    "headline": "BREAKING: APC National leader, Bola Tinubu returns from overseas trip",
    "summarized_story": "The national leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu, has returned to Nigeria from his overseas trip.\nThe former Lagos state governor arrived in the country at about 7pm local time."
  },
  {
    "headline": "Nasarawa Government Invokes No Work, No Pay Rule as industrial action continues",
    "summarized_story": "The Nasarawa State government has invoked the no-work-no-pay rule for striking civil servants in the state.\nThis is part of the resolutions taken at an emergency expanded security meeting held at the Government House, Lafia.\nThe emergency meeting was convened at the instance of Governor Abdullahi Sule, which is aimed at seeking for amicable resolution of the plight of the striking workers.\nThe state government expressed dismay over the indefinite strike action embarked upon by the organised labour.\nIt directed permanent secretaries at the various ministries, departments and agencies, to open attendance registers in order to actualise the no-work-no-pay rule."
  },
  {
    "headline": "Euro 2020: Ronaldo Makes History with 11th Goal as Portugal Thrash Hungary",
    "summarized_story": "Europeans champions Portugal kicked off their Euro 2020 title defence with a 3-0 win over Hungary on Tuesday as captain Cristiano Ronaldo made history at the Puskas Arena.\nBorussia Dortmund’s Raphael Guerreiro broke the deadlock after 84 minutes with a shot from the centre of the box, while Ronaldo scored from a penalty three minutes later.\nAmid a backdrop of around 60,000 fans at the Puskas Arena, Hungary held firm in a low-key first half that had little incident.\nBoosted by vociferous support at the Puskas Arena, Hungary threatened sporadically, with Adam Szalai causing Portugal the most problems.\nFirst Guerreiro broke the deadlock with a deflected finish, before Ronaldo took centre stage."
  },
  {
    "headline": "Fresh Covid-19 Spike in Rwanda as Government Mulls Lockdown",
    "summarized_story": "Rwanda is experiencing a sharp rise in Covid-19 cases and deaths despite ongoing vaccination efforts days after President Paul Kagame warned there could be a “new lockdown”.\nThe country’s health ministry is reporting that new infections have risen exponentially in the last seven days.\nNearly 390,000 people have so far been vaccinated – and most of those have had their second jabs.\nHealth Minister Daniel Ngamije says nearly five million more vaccines are expected and more have been ordered.\n“Our target is to reach 7.8 million people vaccinated early next year,” he told the state broadcaster."
  },
  {
    "headline": "Seven Million Nigerians Pushed Below Poverty Line in 2020, World Bank",
    "summarized_story": "About seven million Nigerians have been pushed below the poverty line in 2020 due to the rapid rise in prices of commodities.\nThe international financial institution said food prices accounted for over 60% of the total increase in inflation, with the rise in prices severely impacting Nigerian households.\nThe bank stated this in a press statement titled, “Critical reforms needed to reduce inflation and accelerate the recovery, says new World Bank report,” and released by the World Bank’s Senior External Affairs Officer of Nigeria, Mansir Nasir.\n“Although the economy started to grow again, prices are increasing rapidly, severely impacting Nigerian households.\nRising prices have pushed an estimated 7 million Nigerians below the poverty line in 2020 alone.”The World Bank Country Director for Nigeria, Shubham Chaudhuri was quoted to have noted that “Nigeria faces interlinked challenges in relation to inflation, limited job opportunities, and insecurity."
  },
  {
    "headline": "Mozambique on High Alert Over Growing Covid-19 Cases",
    "summarized_story": "Mozambique is on high alert as the country continues to witness an increase in the number of Covid-19 cases.\nThe Southern Africa country’s health ministry says cases had gone down from March till May but in the last 14 days, has recorded 773 new cases against 442 cases in the same period last month.\nMeanwhile, the second phase of the country’s vaccination campaign has started with the aim of vaccinating 23,000 people, including teachers, over the next two weeks.\n“In this second phase, the second dose will be administered to those who have already taken the first dose and the first dose to the new groups,” Dr Matsinhe said.\nThe health ministry has already immunised around 350,000 people – and intends to eventually vaccinate a total of 16 million people."
  },
  {
    "headline": "Zambia’s Founding President Kaunda Admitted to Hospital",
    "summarized_story": "Zambia’s founding president Kenneth Kaunda has been admitted to a hospital in the country’s capital, Lusaka for pneumonia, a close aide has said.\nA statement from his office says the 97-year old Kaunda has asked for prayers for his recovery.\nHe was addressing rumours that Mr Kaunda had coronavirus.\nMr Kaunda is said to be improving.\nThere has been growing concern about his health especially as Zambian President Edgar Lungu, along with South Africa’s leader Cyril Ramaphosa, had asked people to pray for Mr Kaunda."
  }
]