[
  {
    "headline": "BREAKING: National Assembly upgrades Adeyemi College of Education to varsity",
    "summarized_story": "The National Assembly on Wednesday passed a bill to upgrade Adeyemi College of Education to a full-fledged university.\nThe development followed the concurrence of the Senate to the House of Representatives Bill which was earlier passed at the Green Chamber.\nThe institution will now be known as Adeyemi Federal University of Education, Ondo after the Senate passed the bill for third reading.\nThe President of the Senate, Ahmad Lawan said the bill has repealed the Act that established Adeyemi College of Education and re-enacted a new one for the establishment of the Adeyemi Federal College of Education.\nThe Bill for the upgrade of the foremost college of Education was passed in the Eight National Assembly but the President, Major General Muhammadu Buhari (retd."
  },
  {
    "headline": "IMF raises Nigeria’s growth forecast by 0.1%",
    "summarized_story": "The International Monetary Fund has increased Nigeria’s growth prospect by 0.1 to 2.6 per cent in 2021 and 2.7 per cent in 2022, despite reducing the rate of global growth prospect due to the COVID-19 Delta variant.\nIn the July 2021 World Economic Outlook, the forecast for Nigeria was at 2.5 per cent in 2021 and 2.6 per cent in 2020.\nHowever, in view of the 3.7 per cent 2021 and 2022 growth forecast for Sub-Saharan Africa, Nigeria is 1.1 per cent behind in 2021 and 1 per cent behind in 2022.\nDespite the slight positive outlook for Nigeria, the IMF has slightly downgraded global growth projections for 2021.\nThe projection for 2021 was downgraded by 0.1 percentage points to 5.9 per cent, while the global growth forecast for 2022 remained unchanged at 4.9 per cent."
  },
  {
    "headline": "NNPC plans to rebuild roads under tax credit scheme",
    "summarized_story": "By Obas Esiedesa – AbujaThe Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mallam Mele Kyari has disclosed that the Corporation plans to rebuild key roads used in the transportation of petroleum products using Federal Government’s Tax Credit Scheme.\nKyari explained that stakeholders have agreed on a framework for NNPC’s intervention in critical road rehabilitation through the Federal Government Tax Credit Scheme.\nAccording to him, “Ware committed to utilising the Federal Government’s Tax Credit Scheme to rebuild some of the affected roads in line with Mr. President’s Executive Order 7.\nStakeholders also agreed to enforce mandatory installation of safety valves in all petroleum product trucks in the country effective February 1, 2022 with full commitment given by NARTO, NNPC added.\nNNPC noted that the meeting was a follow-up to its efforts in sustaining the current smooth supply and distribution of petroleum products nationwide within the festive period and beyond."
  },
  {
    "headline": "Passage of direct primary by Senate will increase costs of nomination — PDP",
    "summarized_story": "The Peoples Democratic Party (PDP) says the passage of direct primary for the nomination of candidates for elections in political parties by the Senate will increase the costs of nomination procedures.\nHe described the decision of the Senate as retrogressive, capable of wiping off all the gains achieved in Nigeria electoral practice since 1999.\nThe party said that hardly would there many political parties might not be able to raise the cost of conducting internal elections under a direct primary process.\n“The PDP, therefore, urges the Senate to immediately deploy its appropriate legislative instruments to reverse itself on the direct primary as it is not practicable,” he said.\nThe Senate on Tuesday, at its plenary, approved direct primaries for aspirants to all elective positions."
  },
  {
    "headline": "Court jails Poly student for impersonation",
    "summarized_story": "By Sola Isola – IbadanA federal high court, sitting in Ibadan the Oyo state capital, Tuesday sentenced one Shoneye Idowu to one year in imprisonment for impersonation.\nShoneye who said he is a student of marketing from Ogitech Polytechnic pleaded ‘guilty’ to one-count charge bordering on impersonation.\nThe prosecution counsel, Sanusi Galadanchi urged the court to convict and sentence Shoneye since he (Shoneye) had pleaded guilty to the charge.\nJustice Agomoh convicted and sentenced Shoneye to twelve months jail term and ordered him to refund Four Hundred and Seventy Five United States Dollars ($475).\nShoneye was also ordered to forfeit an iPhone 11Pro Max and one iPhone wrist watch to the federal government of Nigeria."
  },
  {
    "headline": "Borno Police Command parades 76 suspects for murder, kidnapping, other offences",
    "summarized_story": "By Ndahi Marama – MaiduguriThe Borno State Police Command on Wednesday paraded 76 suspects involved in armed robbery, kidnapping, theft and other offences.\nHe said, the suspects were arrested at various locations within the metropolis and other parts of Jere, Konduga and Mafa local government areas.\nThe command is working seriously in implementing the revolutionized policing introduced by the Inspector General of Police, Alkali Usman to curb all criminal acts in the state.\n“We called you to inform you that Borno State Police Command has arrested 76 suspects involved in armed robbery, kidnapping, theft and other offences.\n“Other suspects were involved in vandalization of electrical cables, boreholes and appliances, use of fake licence plate numbers, operating after curfew hours and use of tinted glasses without permission."
  },
  {
    "headline": "Court remands 25-year-old for cultivating cannabis",
    "summarized_story": "A Federal High Court on Wednesday ordered that a 25-year-oldman, Samuel Omolowo, who pleaded guilty to cultivating 3.69 hectares of cannabis, be remanded in a correction centre.\nOmolowo pleaded guilty to unlawful cultivation and dealing in narcotics.\nJustice Uche Agomoh ordered that Omolowo should be remanded in Agodi correctional centre, pending sentencing.\nEarlier, counsel to the National Drug Law Enforcement Agency, (NDLEA), Oyo State Command, Mr Raphael Himinkaiye informed the court that Omolowo was apprehended on the 3.69 hectares of land on May 27.\nThe News Agency of Nigeria (NAN) reports that the NDLEA act prescribes a maximum of life imprisonment for anyone found guilty of cultivating or dealing in Narcotics."
  },
  {
    "headline": "World Sight Day: 80 percent of visual problems avoidable – Optometrists",
    "summarized_story": "As the world marks World Sight Day, WSD, on Thursday, the Nigerian Optometric Association, NOA, Imo State chapter, has said 80 percent of eye problems are avoidable.\nThe association said a survey carried out in six communities in Imo State revealed that 39 percent of the population are visually impaired while 6.9 percent are completely blind.\nThe group explained that the WSD was an international day of awareness on avoidable blindness and visual impairment.\nThe optometrist association cautioned Nigerians against not taking proper care of their eyes considering the importance of the eye to mankind.\nIt advised people on the need to take proper care of their eyes and go for an eye examination as early detection saves the sight."
  },
  {
    "headline": "We’ll purchase armed drones to curb banditry in Zamfara – Gov Matawalle",
    "summarized_story": "The Zamfara State Governor, Hon.\nBello Mohammed Matawalle, has revealed that his administration has reached an agreement to purchase armed drones with high altitude that will assist in detecting bandits’ hideouts and gather intelligence that would lead to ending insurgency in the state.\n“The trip was to seek assistance in the matters of security, job creation, and invitation of foreign investors for socio-economic growth” he added.\n“Zamfara State has become the colony of banditry not only in the northern states but in Nigeria as a whole and the state has suffered from the destruction of socio-economic growth.\nNigerian govt can end banditry activities in Zamfara – Public commentator"
  },
  {
    "headline": "Tension in Bayelsa as gunmen ambush police patrol team, cart away rifle",
    "summarized_story": "Some yet-to-be-identified gunmen have attacked a police patrol team on Kolo-Ogbia road in Ogbia Local Government Area of Bayelsa State and injured an officer.\nAccording to him, a police inspector was injured during the attack and his rifle was seized.\n“Police officers who were conducting stop and search operations along Kolo-Ogbia Road were attacked by gunmen suspected to be cultists, on 11 October 2021, at about 2245hours.\n“A Police inspector was fatally injured and his rifle was carted away.\nAn investigation is ongoing to apprehend the gunmen and recover the stolen rifle”, the PPRO stated in a text forwarded to DAILY POST."
  },
  {
    "headline": "Northern youths knock Osinbajo for urging naira devaluation",
    "summarized_story": "The Coalition of Northern Youth Groups (CNYG) has completely disagreed with the position of Vice President, Prof. Yemi Osinbajo, that the Central Bank of Nigeria (CBN) should further devalue the naira for the economic benefit of the country.\n“In his presentation and opinion, he opined that the CBN should further devalue the Naira for an economic benefit we are yet to understand.\nThe forum advised President Buhari to encourage the position of the CBN governor not to devalue the naira, but instead create ways that will strengthen the currency.\nFurther devaluation of Naira means more poverty, more insecurity, more restiveness, and more death in the land.\nWe say NO to the devaluation of Naira,” the group emphasized."
  },
  {
    "headline": "Kwara assembly reacts to Madrasah Arabic school’s brutal punishment of students",
    "summarized_story": "The Kwara State House of Assembly has urged the state government to put all necessary machinery in place for the implementation of the Violence Against Persons Prohibition Law.\nThis was part of the resolution of the House on a matter of general public importance moved by Hon.\nAdetiba-Olanrewaju (Oke-Ero) on the brutal beating of students of Madrasah Arabic school, Ganmo area of Ifelodun Local Government Area of the state.\nThe House urged the state government to draw the attention of the concerned government agencies to take punitive measures against anybody or institution that still perpetrates the act in Kwara State.\nKwara school: Muslim students deserved punishment – MURIC"
  },
  {
    "headline": "E-transmission of election results: Senate removes condition, gives INEC power to decide",
    "summarized_story": "The decision of the Senate, followed the re-committal of some clauses of the Electoral Act 2010 to the Committee of the Whole.\nIn July, the Senate, rejected its committee’s report, which had approved electronic transmission of results by INEC.\nThe Senate, had in July, while rejecting the position of its Committee on INEC, opted for a position, which was outrightly rejected by Nigerians.\nManipulation of election results, ballot box snatching, violence, vote buying and selling are the bane of the nation’s electoral process.\nEkweremadu said the Senate’s action justified his assurances to Nigerians in July that all hope was not lost for electronic transmission of 2023 election results despite the initial setback."
  },
  {
    "headline": "The Sun awards great honour to us –Orji, Okafor",
    "summarized_story": "The Speaker, Abia State House of Assembly, Rt.\nHon Chinedum Orji and Chairman/CEO, Marco Polo Group of Companies, Chief Frank Okafor, have described The Sun awards as a great honour to them and their organisations.\nThe Sun Awards, Abia Speaker said, will spur him to further contribute more to the development of the state.\nOrji said he had declined several awards offered him by some organisations, but said he had to accept that of The Sun because of the credibility and reputation of the newspaper.\nThe Sun management seems to know me more than myself.” Earlier, Ukeh praised Orji and Okafor for excelling in their different areas of focus ."
  },
  {
    "headline": "Appointments of service chiefs should be representative –Gov Mohammed",
    "summarized_story": "Bauchi State Governor, Bala Mohammed, yesterday carpeted the All Progressives Congress (APC) over the spate of insecurity, poverty and unemployment in the country.\nThe governor who spoke at a book launch: “Scents of Power” written by Amanze Obi, in Abuja, said the flagrant marginalisation of some regions would continue to embolden agitations across the country.\nHe advised Nigerians to “collectively prioritise national security over sectional interests, in so far that by exercising such restraints, the requirements of justice are not sacrificed.\nSecond, we must sacrifice national survival over corporate profit and personal aggrandisement.\nProfit and individual comfort only exist where there is peace and security.”"
  },
  {
    "headline": "Third term: How Ita Giwa tried to lure me to support Obasanjo",
    "summarized_story": "By Henry AkubuiroFresh revelations have emerged on how former President, Olusegun Obasanjo, tried to tinker with the Nigerian Constitution to enable him run for a third term, contrary to denials by him.\nIn his new book, Standing Strong: Legislative Reforms, Third Term and Other Issues of the 5th Senate, former Senate president, Ken Nnamani (2005-2007) said the battle against the third term bid in 2006 was the most defining task of his tenure as senate president.\nHe wrote: “The bill to amend the 1999 Constitution was titled ‘Constitution of the Federal Republic of Nigeria, 1999 Amendment Bill, 2006.” It has 116 clauses.\nSenator Nnamani noted that Obasanjo, in his book, My Watch, struggled without success to rewrite history.\nHe said further that Obasanjo claimed that he never told anyone that he wanted a third term, but “that’s not exactly true, because ‘he discussed it with people quietly and privately."
  },
  {
    "headline": "We can’t fund 2022 budget because Nigerians hate paying taxes –FIRS",
    "summarized_story": "He said were Nigerians tax payers acted as envisaged, the country would have generated sufficient funds to execute the N16.9 trillion budget.\nWe do know that there are challenges in the oil sector, but that will open up in another discussion.\nWe have generated N3.3 trillion from non-oil taxes alone, and if all things were equal, the oil taxes used to account for over 55 to 60 per cent of the total taxes that FIRS used to collect in the past.\n“Above all, this is a confirmation of the fact that Nigerians do not like paying taxes.\nWhy did I say Nigerians are not paying taxes, and the other sector is not cooperating at a level that we ordinarily should be?"
  },
  {
    "headline": "19 Months to Go, Buhari Urges Ministers to Pace Up on Goals",
    "summarized_story": "She pointed out that Nigeria’s trade cost was equivalent of 306 per cent tariff, one and half times higher than the cost in high income countries.\n“Nigeria’s trade costs are too high.\nAccording to the World Bank-ESCAP trade costs for 2019, trade costs for African countries are on average equivalent of a 304% tariff and for Nigeria, it’s even slightly higher at 306 per cent.\n“These numbers are one and half times higher than trade cost in high income countries.\nSuch high costs are not conducive to forming regional value chain."
  },
  {
    "headline": "With e-Transmission, Direct Primaries, Senate Gives Power Back to the People",
    "summarized_story": "Also, despite appeals from different quarters, the upper chamber of the National Assembly, approved direct primaries for aspirants seeking election in all the registered political parties in the country.\nWith direct primaries, they have lost that vital influence.\nHe explained that the decision to subject the amended clauses of the bill to re-committal was reached after critical examination by the Senate Committee on INEC.\nAccording to him, the political parties may not have the financial capacity, because direct primaries will demand more money.\nSpeaking further on the amendment of the Electoral Act, Wike disagreed with the Senate that parties must conduct direct primaries."
  },
  {
    "headline": "Just In: Bandits Attack Catholic Seminary in Kaduna, Abduct 3 Students, Injure 6 Others",
    "summarized_story": "By John ShiklamThe Catholic Diocese of Kafanchan, Kaduna state has confirmed the abduction of three seminarians at the Christ the King Major Seminary, domiciled within St. Albert Institute, Fayit, Fadan Kagoma, Jama’a Local Government Area of Kaduna state.\nThe fourth year theology students, were said to have been abducted on Monday at about 7:26pm when bandits attacked the institution.\nIn a memo dated October 12, 2021, and addressed to the Metropolitan Catholic Archbishop of Kaduna Province, the Chancellor, Kafanchan Diocese, Rev.\nThe memo reads: “We announce with unease the kidnap of three major seminarians of the Christ the King Major Seminary, our diocesan Major Seminary is domiciled within the St. Albert Institute.\nThe Seminarians receive academic formation from the St. Albert Institute."
  },
  {
    "headline": "CJN Laments, Says Journey to Supreme Court in Commercial Dispute Could Last for 8 to 20years",
    "summarized_story": "Says timely dispensation of justice will enhance Nigeria’s financial stabilityBy Alex EnumahThe Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad on Tuesday, said that the timely dispensation of justice will enhance financial stability in Nigeria.\nHe made the remarks while declaring open a Two-Day Workshop for Judicial Officers on Recent Reforms of Banking and Financial Services Law and Practice.\nThe workshop was organized by the National Judicial Institute (NJI) in collaboration with Juris Law and the Central Bank of Nigeria (CBN).\nHe said, “The journey to the Supreme Court in a commercial dispute could last for as long as eight to twenty years.\n“It suffices therefore to say at this point, that timely dispensation of justice by the judiciary is a critical factor that will enhance financial stability in Nigeria”, he added."
  },
  {
    "headline": "Senate Bows to Pressure, Adopts Electronic Transfer of Election Results",
    "summarized_story": "Okays direct primaries for political partiesBy Deji Elumoye and Juliet AkojeThe Senate on Tuesday bowed to public pressure as it adopted electronic transfer of election results by the Independent National Electoral Commission (INEC).\nAlso at plenary, the Red Chamber okayed direct conduct of primaries by registered political parties in the country.\nThe Senate, at the Committee of the Whole chaired by Dr Ahmad Lawan, amended Clause 52(2) of the Electoral Act Amendment Bill to read: “Subject to section 63 of this Bill, voting at an election and transmission of results under this Bill shall be in accordance with the procedure determined by the Independent National Electoral Commission, which may include electronic voting.”Clause 87(1) of the Electoral Amendment Bill, which was also passed as recommended states: “A political party seeking to nominate candidates for elections under this Bill shall hold direct primaries for aspirants to all elective positions, which shall be monitored by the Independent National Electoral Commission.”The Senate had, in July during consideration of report on 2010 Electoral Act ( Amendment ) Bill 2021, submitted by its Commitee on INEC, amended clause 52(3) as recommended.\nWhile the clause as presented by the committee in the report says INEC can transmit election results electronically, where and when practicable, the Senate passed the amended version which says: “INEC can transmit election results electronically subject to confirmation of Nigerian Communication Commission (NCC) of adequacy and security of national network.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Planned Visit To Scotland For Climate Change Conference To 'Rest', Delegates Vice-President Osinbajo",
    "summarized_story": "According to presidential sources, Buhari has asked Vice-President Yemi Osinbajo to represent him.\nMultiple presidential sources, however, told SaharaReporters that Buhari had cancelled the trip after seeing the need for rest.\n“The Scotland trip is now for Vice President Osinbajo, the President won't go again.\nSaharaReporters had exclusively reported that Buhari would this weekend depart Abuja for Daura, Katsina State to take some rest.\nAccording to presidential sources, the President wants to go to his hometown, just to get some rest."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Planned Visit To Scotland For Climate Change Conference To 'Rest', Delegates Vice-President Osinbajo",
    "summarized_story": "According to presidential sources, Buhari has asked Vice-President Yemi Osinbajo to represent him.\nMultiple presidential sources, however, told SaharaReporters that Buhari had cancelled the trip after seeing the need for rest.\n“The Scotland trip is now for Vice President Osinbajo, the President won't go again.\nSaharaReporters had exclusively reported that Buhari would this weekend depart Abuja for Daura, Katsina State to take some rest.\nAccording to presidential sources, the President wants to go to his hometown, just to get some rest."
  },
  {
    "headline": "EXCLUSIVE: Following Recent UN General Assembly Trip, Other Activities, Buhari To Visit Daura For ‘Short Rest’",
    "summarized_story": "Between June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nOn February 5, 2017, he wrote to the National Assembly, seeking an extension of his London medical leave.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn May 7, 2017, Buhari embarked on a trip to London for another medical vacation.\nOn August 19, 2017, Buhari returned to Nigeria, and it took him a while to resume work because rats had purportedly damaged furniture in his office."
  },
  {
    "headline": "EXCLUSIVE: Following Recent UN General Assembly Trip, Other Activities, Buhari To Visit Daura For ‘Short Rest’",
    "summarized_story": "Between June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nOn February 5, 2017, he wrote to the National Assembly, seeking an extension of his London medical leave.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn May 7, 2017, Buhari embarked on a trip to London for another medical vacation.\nOn August 19, 2017, Buhari returned to Nigeria, and it took him a while to resume work because rats had purportedly damaged furniture in his office."
  },
  {
    "headline": "N4.6billion Fraud: Court Fines Discredited Ex-Minister, Fani-Kayode Over Absence In Trial",
    "summarized_story": "The Federal High Court in Lagos State on Wednesday awarded N200,000 cost against discredited former Minister of Aviation, Femi Fani-Kayode, for his absence from court to take his plea on an alleged N4.6 billion fraud.\nThe defendants' prosecution had commenced since 2016, before Justice Sule Muslim Hassan, who has been elevated to the Court of Appeal.\nAlso, midway to the defendants' trial, Justice Aikawa was transferred to another jurisdisction of the court; hence their case file was transferred to the new Judge, Justice Osiagor, for the matter to commence afresh.\nAjudua also told the court that the second defendant has been readily attending his trial since the matter commenced in 2016.\nHe apologised for Fani-Kayode’s absence, begged the court not to revoke his bail, and also asked for a short adjournment."
  },
  {
    "headline": "Kwara sets up 10-member panel to probe flogging of Arabic students",
    "summarized_story": "AbdulRahman AbdulRazaq, Kwara governor, has constituted a 10-member panel to investigate the infamous flogging of some Arabic school students in the state.\nAdvertisementRafiu Ajakaye, spokesperson to the governor, confirmed the development in a statement seen by TheCable Lifestyle on Tuesday.\nOn Sunday, a now-viral video had shown some students of Musbaudeen Al Islamy Arabic School, Ganmo in Ifelodun LGA, being subjected to intense beating.\nThe students were being punished after they attended a party and reportedly took alcohol during the outing.\nEarlier, Yunus Olarenwaju, father to one of the students who was brutally flogged, supported the school’s action."
  },
  {
    "headline": "202 Nigerian varsities, 11 female VCs — case for gender inclusion in HE headship",
    "summarized_story": "As of October 2021, Nigeria has at least 11 incumbent women VCs of the 202 federal, state, and private institutions.\nIn federal and state varsities, pioneer VCs are appointed by fiat by the visitor, usually the president or state governor respectively.\nAdvertisementFEMALE VCs IN NIGERIA AS OF OCTOBER 2021The database of the National University Commission (NUC) accounts for 54 state, 49 federal, and 99 private universities.\nSexism, misogyny, and a culture hostile to family commitments are some structural barriers aspiring female leaders in varsities go through.\nEditor’s note: This report was updated to include Adenike Kuku of Kings University, Odeomu, Osun state — bringing the captured number of female VCs to 11."
  },
  {
    "headline": "I support flogging of my daughter, says father of Kwara Islamic school student",
    "summarized_story": "Yunus Olarenwaju, father to the female student who was among those brutally flogged in Kwara state, says he supports the school’s action.\nAdvertisementOn Sunday, a video showing some students of Musbaudeen Al Islamy Arabic School, Ganmo in Ifelodun LGA, being subjected to intense beating had surfaced online.\nAdvertisementAmid the outrage, the state government had suspended the head of the Islamic school and ordered a probe of the incident.\nAdvertisement“I informed the school about the incident and I personally requested that they should give her the appropriate punishment.\nThe Islamic school had earlier justified the brutal flogging of the students while adding that their actions were un-Islamic."
  },
  {
    "headline": "Brutal flogging: Kwara suspends head of Islamic school, orders probe",
    "summarized_story": "The Kwara state government has suspended the head of Musbaudeen Al Islamy Arabic School, Ganmo in Ifelodun LGA over the brutal flogging of some of its students.\nAdvertisementSa’adatu Modibbo Kawu, the state commissioner for education and human capital development, broke the news in a statement on Sunday.\nThe commissioner said the government frowns at the treatment of the students, regardless of the explanations given by the school authority.\nAdvertisementKawu also said the government has taken the affected students to the hospital to ensure that they are properly treated.\n“The government has also taken the affected students to a public hospital for proper medical examination and treatment."
  },
  {
    "headline": "Squid Game becomes Netflix’s biggest ever series launch",
    "summarized_story": "Netflix, a US-based streamer, says the Korean TV series ‘Squid Game’ is now its biggest show ever.\nThis means ‘Squid Game’ was viewed by more people in its first month of release than ‘Bridgerton’, the previous number one holder, which Netflix said had been selected to watch by 82 million households in its first 28 days.\nAdvertisementSquid Game has officially reached 111 million fans — making it our biggest series launch ever!\npic.twitter.com/SW3FJ42Qsn — Netflix (@netflix) October 12, 2021AdvertisementWritten and directed by Hwang Dong-hyuk, ‘Squid Game’ features actors like Lee Jung-jae, Park Hae-soo, Wi Ha-joon, Jung Ho-yeon, O Yeong-su, Heo Sung-tae, Anupam Tripathi, and Kim Joo-ryoung.\nHwang conceived of the idea based on his economic struggles early in life and the class disparity in South Korea."
  },
  {
    "headline": "Kenya’s high court issues landmark ruling against Uber",
    "summarized_story": "Under this agreement, Uber Kenya Limited retained a 25% cut of overall profits from each ride.\nBecause of this, Uber Kenya Limited said they were not liable for the breach of contractual obligations.\nUber Kenya Limited acts as a subsidiary that contracts Uber drivers in Kenya.\nWhile Uber BV claimed it was a separate entity from Uber Kenya Limited, the High Court of Kenya concluded that there was an intricate link between both companies.\nThis, stated Milimani court justice, Francis Tuiyott, lifted the “corporate veil” off of the conglomerate, making Uber Kenya Limited and Uber BV liable to the plaintiffs."
  },
  {
    "headline": "China’s growing influence is transforming African tech",
    "summarized_story": "The African market offers Chinese companies and investors a growing young population expected to reach 1.7 billion by 2030.\nThese Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\n“Until African countries manufacture their own equipment, they’ll always be susceptible to international organisations having access to their data,” Tugendhat said.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "Pan-African venture capital firm, Savannah Fund wants to help African startups go global",
    "summarized_story": "In the nine years since its founding, Savannah Fund-backed startups have raised follow-on funding of over $200 million.\nHe helped source deals, incubate startups, and provide strategic directions for the venture’s portfolio companies.\nSo far, none of the firm’s portfolio companies has failed.\nBefore joining Sendy, she was a mentor at Savannah Fund, leading the firm’s investment in Nigerian logistics company, African Courier Express (ACE).\nDespite being Tanzanian, Savannah Fund has not funded any Tanzanian startup; Alliy hopes to change this soon."
  },
  {
    "headline": "Why Techpoint Africa is making all its past premium reports free",
    "summarized_story": "Share this article:In 2018, Techpoint Africa started the Nigerian Startup Funding Report (NSFR) as a detailed and comprehensive periodic account of the funding activities of the Nigerian Internet startup space.\nThese people are getting part of the credit for making the decade report available for free.\nBeyond making all our past reports available for free, most (if not all) of our subsequent reports will also be available for free as well.\nTo every brand and person mentioned above (and those not mentioned), we say thank you for believing in the Techpoint Africa dream once again.\nThe only change is that we will be releasing only a single annual edition of the Nigerian Startup Funding Report."
  },
  {
    "headline": "Healthtracka’s lab testing solution, Klasha’s Ghanaian expansion, Fawry’s investment in alsoug",
    "summarized_story": "She started healthtech startup, Healthtracka, following the avoidable death of her father from several illnesses.\nAdvertisementWhat Healthtracka does: Easing the process of conducting laboratory tests, the startup allows people to get tested without leaving their homes or offices.\nEgyptian payments company, Fawry has announced its investment in alsoug, Sudan’s largest online classifieds marketplace, to help build out the latter’s new fintech platform, Cashi.\nWhat does alsoug do?\nWith a population of 43.8 million, Sudan represents a large market for any startup to play in."
  },
  {
    "headline": "Meet five investors behind 2021 biggest funding in Nigerian startups",
    "summarized_story": "Five global investors are putting their money where their mouth is by championing bold ideas in Nigerian startups, a development that is expected to boost more innovations in Nigeria’s technology sector.\nA quest for resource deployment, a proliferation of fintech services across Africa and the opportunities that abound in the sector, among others are the reasons for these investments in Nigerian startups.\nAvenir Growth CapitalA New York-based private equity firm co-led the $170 million Series C round by Flutterwave in March.\nThe company started its journey in investing in African startups with Nigerian Kuda Bank leading the $25 million Series A in the fintech company in March, and a co-lead in the $55 million Series B funding in August.\n$25 million Series A round in March 2021 and the $55 million Series B in August."
  },
  {
    "headline": "Nigeria’s poor feel pain of soaring price of cooking gas",
    "summarized_story": "She has run the food business for over 25 years, alternating between firewood and cooking gas.\nShe told BusinessDay that the incessant increase in the price of Liquified Petroleum Gas (LPG) also called cooking gas, has made life more difficult for her.\n“I alternate between cooking gas and firewood because I have to factor my children’s school fees into the business.\nThe current rising price of cooking gas won’t allow me to consider it as an option,” Abbas said.\n“Many of us can’t buy cooking gas anymore; the government should do something about it."
  },
  {
    "headline": "2023: Credible elections in sight as Senate backs reforms",
    "summarized_story": "Nigerians on Tuesday were in a celebratory mood following the Senate’s approval of electronic transmission of results by the Independent National Electoral Commission (INEC) ahead of the 2023 general elections.\nThey expressed the optimism that the development would lead to credible elections in the country, henceforth.\n“This development would help to see that credible elections are conducted in Nigeria.\nAccording to Ubani, “It would minimise human interference in elections in Nigeria and restore voters’ confidence.\nElectronic transmission of results is a popular demand by Nigerians."
  },
  {
    "headline": "Edo Youth Parliament Speaker seeks public support for Edo Govt’s COVID-19 vaccination campaign – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Speaker of the Edo State Youth Parliament, Rt Hon.\nOsawemwenhio Uwagboe, has urged residents in Edo State to complement the state government effort to contain the third wave of the COVID-19 pandemic, by ensuring they take the COVID-19 vaccines.\nAddressing journalists in Benin City, the Speaker of Edo State Youth Parliament, said members of the Parliament have taken the vaccines to encourage youths and other residents in the state to go for the vaccines.\nIn her remarks, Deputy Speaker, Edo Youth Parliament, Hon.\nShe added that the parliament will also support the state government sensitisation campaign on waste management in the state."
  },
  {
    "headline": "Delta Police Arrest Man With A Gun Concealed In Garri Sack – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command said it has arrested a middle aged man with a locally madebarrel gun concealed in a bag of garri while traveling in a commercial bus.\nAccording to a press release signed by the Delta Police spokesperson, DSP Bright Edafe,“At about 1030 hrs,20/10/21, patrol team attached to Ovwian Aladja Division while on stop and search duty intercepted a commercial bus carrying some passengers, the operatives upon searching the passengers recovered one locally made single barrel gun concealed in a bag of Garri.\nThe suspect one Pigi Kelvin ‘m’ of Ututuoama town Ughelli South LGA age 42yrs was arrested.\nInvestigation is ongoing”.\n“Also, men of Ovwian Aladja Division raided criminal hideout/black spots in Ujvwu Community the suspects who gathered in a large number smoking Indian Hemp took to their heels on sighting the police, they were chased and two of them namely Godspower Alfred age 23yrs and Destiny Akwara 34yrs were arrested and upon search, a locally made cut to size gun and some wraps of weeds suspected to be Indian hemp were recovered from them."
  },
  {
    "headline": "Shun Corruption And Incivility To Members Of The Public, Delta CP Warns – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Commissioner, CP Ari Mohammed Ali, FCIA, Psc+, has warned officers and men of the Delta State Police Command against all forms of corruption and incivility to members of the public.\nGiving the warning at a well attended meeting with the Area commanders, DPO’S, Tactical commanders and other officers in the Command on 8th October 2021,the CP reiterated the fact that the command under his watch will not tolerate such, mercenaries have been put in place to check the activities of men posted and any erring officer will be dealt with accordingly, citing the two officers dismissed recently as an example to all.\nThe CP also ordered that stop and search should be intensified, while constant raiding of black spot/criminal hideout should be sustained."
  },
  {
    "headline": "Governor Okowa Gets Royal Commendation On Trans-Warri Ode-Itsekiri Project – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – THE Governor of Delta State, Dr. Ifeanyi Okowa has been commended for paying N8 billion out of the N9billionowed to Setraco Construction Company handling the Trans-Warri Ode-Itsekiri bridges and access road project to enable continuous work on the road.\n“I want to thank the Governor for his kind disposition towards us, we all know the existing economic situation.\nChief Adams Otimeyin, Special Project Director, Trans-Warri Ode-Itsekiri Bridges and Access Roads thanked the Olu of Warri for exhibiting uncommon leadership by visiting the site to ascertain the work done.\nOtimeyin also thanked Okowa for Keeping to his promise and paying the huge backlog owed the contractor.\nJose Cosme, Area Manager Setraco thanked the Olu of Warri and promised that with adequate funding the project will be completed before his first coronation anniversary."
  },
  {
    "headline": "ANALYSIS: Why Françafrique can no longer be used to explain France’s Africa policy",
    "summarized_story": "Senegalese president and poet Léopold Sédar Senghor used the term to describe the shared history of France and Africa.\nThe idea later acquired a negative connotation, leaving little room for fact-based analysis that provides a nuanced understanding of the complex links between France and African countries.\nThe term Françafrique is based on deeply rooted preconceived ideas about France’s relations with Africa: financial servitude, military interventionism, corruption of African leaders, and an over-estimation of France’s economic interest in the continent.\nAfrica needs more robust political analysis of countries’ internal dynamics and their relations with world powers.\nThe continued use of the notion of Françafrique shows a poor understanding of African countries’ foreign policies."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "2021 NMA Physician’s Week: Udom Inoyo, Others Chart Pathways to Improved Healthcare Delivery",
    "summarized_story": "The 2021 Physician’s Week of the Nigerian Medical Association (NMA) in the country has been declared open in Uyo by the Governor of Akwa Ibom State, Mr. Udom Gabriel Emmanuel, with a call for improved healthcare delivery systems across Nigeria.\nNigeria’s former President, Dr. Goodluck Ebele Jonathan, GCFR and the Chairman, Seplat Energy Plc, Dr. A.\n“To achieve good human resource management and health system strengthening in Nigeria, you as health managers must focus on delivering health benefits to everyone, especially the vulnerable.\nThe presentation of award to Mr. Inoyo was in recognition of his support towards improving healthcare delivery in Akwa Ibom State.\nAccording to the NMA Chairman, “If you go to Ibom Specialist Hospital, the PCR machine there was donated by Mr. Udom Inoyo and partners”."
  },
  {
    "headline": "NGX Group receives approval to list own shares on Friday",
    "summarized_story": "The Nigerian Exchange Group Plc (NGX Group) has received approval from the Nigerian Exchange Ltd (NGX) to list its shares on the main board of the NGX on Friday.\nThe NGX Group Chairman, Otunba Abimbola Ogunbanjo, said this in a statement issued on Wednesday in Lagos.\nHe said, “We are delighted to move ahead with the listing by introduction of NGX Group on the Main Board of NGX at this pivotal moment in the evolution of NGX Group.\nAlso speaking, the Group Managing Director/Chief Executive Officer, NGX Group, Mr Oscar Onyema, said the group was excited about the listing.\nThe Financial Advisers to NGX Group are Chapel Hill Denham Advisory Ltd and Rand Merchant Bank Nigeria Ltd; Aluko and Oyebode acted as Legal Adviser."
  },
  {
    "headline": "Eden Life secures $1.4m seed round to develop home services app",
    "summarized_story": "Launched in 2019 by three former Andelans, Eden Life was developed for busy Lagos professionals who are often time-poor due to long working hours and struggle to source and coordinate dependable, efficient, and trustworthy home services providers.\nCurrently, the average Eden Life user uses two services five times per week with first-time users typically starting off with food delivery, before picking up additional services.\nHaving launched with three core services – those most fundamental to making the home a sanctuary – Eden Life will be rolling out many more over the coming months to make the app a one-stop tool to manage household chores and personal life.\nNadayar Enegesi, Co-Founder at Eden Life and Co-founder at Andela said, “For many of our users, if they’re cooking or running errands, they’re not being productive; they don’t want distractions from their work, which is where Eden Life comes in.\nThe combination of this advantage with a core team who has proven experience building African tech to unrivaled levels sets Eden Life on an exciting path of growth.”"
  },
  {
    "headline": "AMCON says EFCC has recovered N1.6bn for it in 4years",
    "summarized_story": "The Assets Management Corporation of Nigeria (AMCON) says it has recovered the sum of N1,667,582,605.04 through the Economic and Financial Crimes Commission (EFCC) between 2017 and July 5, 2021.\nAMCON also revealed that the amount represented loan repayments recovered, which were credited to its Central Bank of Nigeria (CBN) account for the settlement of bond obligations.\nAMCON said remittances to the corporation in 2017 amounted to N1,178,764,500 for the credit of nine debtors.\nThey added they received a letter dated December 17, 2019 from the EFCC forwarding promissory notes on account of four debtors to the tune of N1,194,778,813.\n“The notes were returned to the EFCC through a letter dated October 28, 2019, as they were made out by the Debt Management Office."
  },
  {
    "headline": "Alleged Forgery: Court Fixes Dec 2 For Arraignment Of Anambra Varsity Don, Others",
    "summarized_story": "A Federal High Court in Abuja, on Tuesday, has fixed December 2, 2021 for arraignment of Prof. Obiajulu Obikeze and four others over allegations bordering on forgery.\nJustice Inyang Ekwo fixed the date due to the absence of the third defendant, Chief Israel Ezue, in court.\nProf. Obikeze (1st defendant), who works with Chukwuemeka Odumegwu Ojukwu University, formerly Anambra State University Igbariam in Anambra State, is charged alongside four others with 11 counts.\nThe arraignment was, however, stalled due to the absence of the 3rd defendant in court.\nCounsel to the defendants, Chief Okey Obikeze, informed the court that his clients were on administrative bail."
  },
  {
    "headline": "Alleged Forgery: Court Fixes Dec 2 For Arraignment Of Anambra Varsity Don, Others",
    "summarized_story": "A Federal High Court in Abuja, on Tuesday, has fixed December 2, 2021 for arraignment of Prof. Obiajulu Obikeze and four others over allegations bordering on forgery.\nJustice Inyang Ekwo fixed the date due to the absence of the third defendant, Chief Israel Ezue, in court.\nProf. Obikeze (1st defendant), who works with Chukwuemeka Odumegwu Ojukwu University, formerly Anambra State University Igbariam in Anambra State, is charged alongside four others with 11 counts.\nThe arraignment was, however, stalled due to the absence of the 3rd defendant in court.\nCounsel to the defendants, Chief Okey Obikeze, informed the court that his clients were on administrative bail."
  },
  {
    "headline": "Amaechi, Abe Loyalists Battle For APC Chairmanship Position In Rivers",
    "summarized_story": "Barely three days to the 2021 state congresses of the All Progressives Congress (APC) in Rivers State, three members of the party loyal to the camps of Minister of Transportation, Rt.\nChibuike Rotimi Amaechi, and Senator Magnus Ngei Abe, have begun the race to occupy the office of the state chairman of the party.\nTwo of the chairmanship aspirants, Chief Emeka Bekee, who is the immediate-past state secretary of the party, and Hon.\nSpeaking with LEADERSHIP in Port Harcourt on Monday, chairman of the Media and Publicity Committee of the APC state congress in the State, Hon.\nEli said: “We expect to have a very decent Congress where we will elect our new state working committee."
  },
  {
    "headline": "Amaechi, Abe Loyalists Battle For APC Chairmanship Position In Rivers",
    "summarized_story": "Barely three days to the 2021 state congresses of the All Progressives Congress (APC) in Rivers State, three members of the party loyal to the camps of Minister of Transportation, Rt.\nChibuike Rotimi Amaechi, and Senator Magnus Ngei Abe, have begun the race to occupy the office of the state chairman of the party.\nTwo of the chairmanship aspirants, Chief Emeka Bekee, who is the immediate-past state secretary of the party, and Hon.\nSpeaking with LEADERSHIP in Port Harcourt on Monday, chairman of the Media and Publicity Committee of the APC state congress in the State, Hon.\nEli said: “We expect to have a very decent Congress where we will elect our new state working committee."
  },
  {
    "headline": "Secondus’ Removal May Dash PDP’s Hope In 2023 – Ardo",
    "summarized_story": "Secondus’ travails began after his political relationship with his erstwhile ally and benefactor, Governor Nyesom Wike of Rivers State, crashed.\nHe has since gone to the Appeal Court to challenge his suspension.\nADVERTISEMENT“The variables don’t seem to add up for the simple fact that one cannot hope to win on injustice and illegitimacy because this is a logical social law!\nStill our latter-day PDP stakeholders, the old and new party oligarchs, seem to see that they can, forgetting that they’ve always in the past failed.\nIt’s not about the individuals involved, just as of now it’s not about Secondus."
  },
  {
    "headline": "Nigeria hunted by failure to invest in youths – Obi",
    "summarized_story": "The former governor of Anambra State and vice-presidential candidate of the Peoples Democratic Party in the 2019 elections, Mr Peter Obi, has said Nigeria is in crises in various sectors due to the failure of the country to invest in her youths.\nObi said this on Tuesday at the eight annual public lecture organised by the Foursquare Gospel Church in Nigeria themed, ‘National security challenges: Youth neglect?’ held in Yaba, Lagos.\n“These have created a pool of unemployed and underemployed youths which are the causes of the crises we are facing today.\nWe have more youths that are unemployed here than in South Africa because of our population and that is a crisis we are experiencing.\nHe said, “There have been no deliberate policies to neglect the youths."
  },
  {
    "headline": "Nigeria hunted by failure to invest in youths – Obi",
    "summarized_story": "The former governor of Anambra State and vice-presidential candidate of the Peoples Democratic Party in the 2019 elections, Mr Peter Obi, has said Nigeria is in crises in various sectors due to the failure of the country to invest in her youths.\nObi said this on Tuesday at the eight annual public lecture organised by the Foursquare Gospel Church in Nigeria themed, ‘National security challenges: Youth neglect?’ held in Yaba, Lagos.\n“These have created a pool of unemployed and underemployed youths which are the causes of the crises we are facing today.\nWe have more youths that are unemployed here than in South Africa because of our population and that is a crisis we are experiencing.\nHe said, “There have been no deliberate policies to neglect the youths."
  },
  {
    "headline": "Umahi: Ebonyi ordered radio presenter’s arrest for social media activities",
    "summarized_story": "The Ebonyi State Government has said it urged the police to arrest and prosecute a former Technical Assistant on Media to Governor David Umahi, Godffery Chikwere, owing to his activities on social media.\nCommissioner for Information and State Orientation, Uchenna Orji, stated this while addressing journalists in Abakaliki, on Tuesday.\nHe said Chikwere’s activities on social media were against the State Cybercrime Prohibition Law, 2021.\n“Godfrey Chikwere published on social media, among others things, that it is clear that the Nigeria Army is seriously losing respect from the public,” he said.\nHe noted that Chikwere, a former programme presenter at the Ebonyi State Broadcasting Corporation, also mentioned that politicians would kill the youths and still use the youths to ascend to power."
  },
  {
    "headline": "Umahi: Ebonyi ordered radio presenter’s arrest for social media activities",
    "summarized_story": "The Ebonyi State Government has said it urged the police to arrest and prosecute a former Technical Assistant on Media to Governor David Umahi, Godffery Chikwere, owing to his activities on social media.\nCommissioner for Information and State Orientation, Uchenna Orji, stated this while addressing journalists in Abakaliki, on Tuesday.\nHe said Chikwere’s activities on social media were against the State Cybercrime Prohibition Law, 2021.\n“Godfrey Chikwere published on social media, among others things, that it is clear that the Nigeria Army is seriously losing respect from the public,” he said.\nHe noted that Chikwere, a former programme presenter at the Ebonyi State Broadcasting Corporation, also mentioned that politicians would kill the youths and still use the youths to ascend to power."
  },
  {
    "headline": "UN told Nigeria's failure to deal with diversity root of Biafra crisis",
    "summarized_story": "The United Nations Security Council has been told that the failure of Nigerian leaders to deal with diversity was the root cause of the Biafran crisis.\nMbeki addressed the UN Security Council on Tuesday and listed African countries, apart from Nigeria, where the failure to deal with diversity was a root cause of conflict.\nHe blamed the current clashes in Ethiopia´s Tigray region, also on the failure to manage diversity.\n“The key message I wish to deliver today is that poor management of diversity is leading to grave threats to international peace and security,” Kenyatta said.\n“The result is a profound sense of grievance and bitterness that populists and demagogues can easily exploit,” Kenyatta said."
  },
  {
    "headline": "Deontay Wilder handed six-month ban, goes for surgery",
    "summarized_story": "Nevada State Athletic Commission has handed WBC failed title challenger Deontay Wilder a six-month medical ban till 8 April.\nThe ban comes as the Alabama-born American gets set for surgery in his broken hand, following his defeat by Tyson Fury.\n‘Deontay broke his right hand behind the third knuckle and he has to have that fixed next week,’ Finkel told The Sun.\n‘He has to have surgery, the knuckle is OK, it’s the bone behind the knuckle that broke.\n‘He’s healing and at this point, if everything is OK, after the hand surgery he’ll probably look to enter the ring mid next year, like April or May.’"
  },
  {
    "headline": "BREAKING: Sunday Igboho Diagnosed With Likely Kidney Problem In Beninise Prison – Lawyer",
    "summarized_story": "Sunday Igboho, a Yoruba Nation activist, has apparently been diagnosed with a renal or lung disease.\nIgboho is presently being held in a detention facility in Benin Republic, according to reports.\nIgboho was caught with his wife in Cotonou, Benin Republic, on July 16, 2021, while traveling to Germany, and has been detained since since.\n“Igboho was not diagnosed with this ailment when he was arrested in Cotonou,” the lawyer said, raising the alarm that Igboho required immediate medical attention.\nIgboho also sought an order of the court directing the respondents to return all the items seized from the house."
  },
  {
    "headline": "Sunday Igboho Down With Kidney, Lung Illness In Beninese Prison, Needs Urgent Medical Care — Lawyer, Alliyu",
    "summarized_story": "Yomi Alliyu, lawyer to Yoruba Nation activist, Sunday Adeyemo (Igboho) has again pleaded with the government of Benin Republic to immediately release the activist for urgent medical attention overseas.\nIn an interview with BBC Yoruba, Alliyu said the Beninese government needed to allow the activist to seek medical treatment due to ill health.\nAlliyu added that the sickness troubling Igboho was not of little measure and he needed both prayers and medical attention.\nMeanwhile, Igboho’s lawyer in the Benin Republic, Ibrahim Salami, confirmed Igboho got injured during the DSS raid.\nA statement by Koiki titled ‘On behalf of Chief Sunday Adeyemo, aka Igboho’, called on the government of Benin Republic to grant Igboho permission to receive urgent medical attention."
  },
  {
    "headline": "3 Kano Senators, 4 Reps move to take over APC from Ganduje",
    "summarized_story": "The members, led by the chairman House Committee on Security, Sha’aban Sharada (APC-Kano Municipal), are Tijjani Jobe (APC-Dawakin Tofa/Tofa/Rimingado); Haruna Dederi (APC-Karaye/Rogo) and; Nasiru Auduwa (APC-Gabasawa/Gezawa).\nThe three senators and four members met at on Tuesday at the Asokoro residence of Mr Shekarau.\nInsiders said the meeting borders on how the governor, Abdullahi Ganduje, cornered state resources and party affairs for himself and his family.\nA source who preferred not to be named said the senators and the House of Reps members also raised concerns on alleged corruption and mismanagement of public resources in the state.\nThere is also insinuations that Mr Ganduje’s political arch-enemy and former governor of the state, Rabiu Kwankwaso, may join the party."
  },
  {
    "headline": "Buhari’s Regime, A Huge Joke –PDP",
    "summarized_story": "THE PDP has claimed that the President’s regime, led by Major General Mohammadu Buhari (retd), has become a source of ridicule among Nigerians due to its phantom achievements.\nThe opposition party urged the President to take a trip out of Aso Rock to visit project sites in order to come face to face with reality.\nThis was contained in a statement titled “Stop Irritating Nigerians With False Performance Claims, PDP Tells Buhari, APC,“ signed by the National Publicity Secretary of the party, Kola Ologbondiyan, in Abuja, on Tuesday.\n“After the trip, President Buhari would know why he and his administration have become a butt of joke among Nigerians and why his administration has gone down in history as the worst in our nation.”Attempts to get a response from the All Progressives Congress were futile.\nMessages sent to the National Secretary of the party, Sen. John Akpanudoedehe, was yet to be responde"
  },
  {
    "headline": "Osinbajo washes hands off Naira devaluation – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo Tuesday denied calling for the devaluation of Naira as reported by a certain section of the media.\nOsinbajo is not calling for the devaluation of the Naira.\nHe has at all times argued against a willy-nilly devaluation of the Naira.\nIt is stopping this huge arbitrage of over N160 per dollar that the Vice President was talking about.\nOnly a more market reflective exchange rate would ameliorate this."
  },
  {
    "headline": "I never called for naira devaluation – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has denied calling for the devaluation of Naira as reported by a certain section of the media (Blueprint not inclusive).\n“We can’t get new dollars into the system, where the exchange rate is artificially low.\nMy position -VPReiterating his position, Vice President Osinbajo said he was never at any time a fan of naira devaluation.\nOsinbajo is not calling for the devaluation of the Naira.\nIt is stopping this huge arbitrage of over N160 per dollar that the Vice President was talking about."
  },
  {
    "headline": "Breaking: DSS frees detained popular Nollywood actor Chinwetalu Agu",
    "summarized_story": "The Department of State Services (DSS) has released actor, Chiwetalu Agu who was arrested by the service after he was released by Soldiers on October 8, 2021.\nThe National President of the Actors Guild of Nigeria, Ejezie Emeka Rollas confirmed his release in a statement on Tuesday evening.\nThe statement reads: “On behalf of the Guild, I was at the DSS office with my colleague, the Senior special Assistant on Military Affairs and Inter Governmental Relations to the AGN President Steve Eboh to receive Mr. Agu today.\n“The elated veteran Actor thanked God for surviving the ordeal and commended the leadership of the Actors Guild of Nigeria headed by Ejezie Emeka Rollas for their relentless efforts in securing his release from the detention.”Chinwetalu Agu’s ordeal began on October 7 when he was manhandled by soldiers at Upper Iweka area in Onitsha, Anambra state for wearing Biafra colour cloth."
  },
  {
    "headline": "Chairmanship aspirant calls for consensus in APC state congress -NigPilot",
    "summarized_story": "As the ruling All Progressives Congress, APC, is set to conduct its State Congress across the nation on Saturday, October 16, 2021, Lagos State, Nigeria’s commercial capital, is not left out in this all-important exercise.\nMrs. Beatrice Omotayo Tugbobo is strategically poised to take out the Tunde Balogun-led Exco to a higher level if elected as the state chairman of the party in the state.\nMrs. Tugbobo parades a rich and intimidating professional and politicalprofile; she was once the chairman of Mushin Local Government of the state.\n“I am bringing my wealth of expertise, experience, contacts, and motherly touch to further advance the political fortunes and causes of the Lagos State Chapter of our great party the APC, without leaving any member behind,” she said.\nShe is an advent believer in the consensus arrangement being preached by the Chairman of the Caretaker Committee and the present Governor of Yobe State H.E."
  },
  {
    "headline": "Crown University International Chartered Inc.’s outlines mode of operation -NigPilot",
    "summarized_story": "Crown University International Chartered Inc ., has outlined its mode of operation saying that it is a private, global research University in Santa Cruz Province, Argentina, South America.\nThe institution also noted that its affiliations are Research and Training in Africa, based in Asia and associates worldwide such as; Mother Theresa Women’s University in India, Ambrose Alli University, Edo State, Nigeria, University of Kara, Kara City, Republic of Togo (Government University in Togo), Afriford University Republic of Benin, Bharat University in India, Kaduna State University, Kaduna, Nigeria, CEPRES International University, Liberia and others worldwide.\n“The Crown University Int’l Chartered Inc. is an innovative University, notable for ‘Research and Training Initiatives, with many government and non-government universities worldwide.\nHe also added that Crown University has affiliations with various public, private and non-profit organizations including; Chartered World Institute for Encyclopedia of Books Inc., West Coast University, International Chartered World Learned Society, Chartered World Order of the Knights of Justice of Peace, International Centre for Eye Research and Education, the Prof. Sir Bashiru Aremu Intl.\nFoundation Inc., Africa International Institute for Professional Training and Research Intl Chartered, amongst others."
  },
  {
    "headline": "Poultry farmers lament high cost of eggs’ production -NigPilot",
    "summarized_story": "Poultry Farmers Association of Nigeria, PFAN in Kwara State has raised the alarm that the high cost of eggs production, particularly the raising of chicken, has discouraged a lot of poultry farmers from being in the business.\nSpeaking at an event to mark World Egg Day and the 20th anniversary of the global event, the state chairman of PFAN, Mr. Ojo Akinwumi Richard lamented that poultry farmers are presently running at loss.\nHe, therefore, appealed to the federal government to allow the importation of poultry feeds into the country, noting that Nigerian farmers cannot produce enough grains to meet poultry feeds production.\nThe chairman, however, assured at this year’s event, tagged: “Eat your egg today and every day” that the association would continue to do its best in making eggs available for Nigerians.\nSola-Ojo said: “Egg is highly nutritious with about 13 vitamins, except Vitamin C. It has Omega 3 Fatty Acids and all the essential Amino Acids."
  },
  {
    "headline": "2023: Adamu heads APC reconciliation cmttee, vows to excel where Tinubu, Akande failed -NigPilot",
    "summarized_story": "Ahead of the 2023 general elections, leadership of the ruling All Progressives Congress, APC, has inaugurated a national reconciliation committee to mend fences among different warring gladiators in the party.\nSpeaking Monday at the national secretariat of the APC after another National Reconciliation Committee was inaugurated, Senator Adamu, who was appointed to lead the new panel promised a great deal.\nWhen asked about what his committee can achieve compare to the two previous reconciliation panels, the former governor said: “Somehow, all the members of the National Reconciliation Committee that I have seen are positive.\n“Consult with larty leaders and concerned members as the committee deems necessary with a view to achieving peace therein.\n“Your report on resolution of these discrepancies would indicate our readiness as a united and strong family for the national convention."
  },
  {
    "headline": "Nigeria Determined To Target Assets Of Drug Cartels, Marwa Assures At UN",
    "summarized_story": "Gen. Mohamed Buba Marwa (Retd) has assured the international community of Nigeria’s preparedness and determination to go after the assets of drug barons and traffickers in any part of the country.\n“Our consistent targeting of Drug Trafficking Organizations has resulted in the arrest of 8, 634 suspected drug traffickers and the seizure of over 100 billion Naira in cash and drugs within the first eight months of this year.\nGeneral Marwa explained how one of the challenges of the pandemic is the proliferation of online sales of drug cookies and use of courier services to move illicit drugs.\nHe, however, stressed that the agency has been able to intercept, trace and dismantle most of the drug cells involved.\nPart of the successes of Nigeria’s drug war efforts, Marwa noted is the recent “first seizure of 74.119kg of Captagon brand of Amphetamine, presumably destined for use, to fuel insurgency and other violent crimes and criminalities, which Nigeria is currently grappling with.”"
  },
  {
    "headline": "Senate Bows To Pressure, Gives INEC Sole Power On Transmission Of Results",
    "summarized_story": "﻿Amid increased calls that election results should be transmitted electronically, the Senate on Tuesday bowed to pressure and gave the Independent National Electoral Commission (INEC) the sole power to determine the mode of transmission of results.\nThe Senate had earlier adopted during the amendment of the electoral act that parties should adopt either direct or indirect primaries.\nHowever, based on the observation by its INEC Committee, the lawmakers supported direct primaries while some others did not.\nHe added that indirect primaries are cheaper to conduct.\nAfter the debate, the majority of lawmakers voted in favour of direct primaries and it was adopted by the Senate."
  },
  {
    "headline": "Chidinma Pleads Not Guilty To Murder Of Super TV CEO Usifo Ataga",
    "summarized_story": "﻿Chidinma Ojukwu has pleaded not guilty to the murder of Super TV CEO, Usifo Ataga.\nBoth suspects pleaded not guilty to eight counts bordering on the offences of murder, forgery and stealing.\nI don’t know who must have come into the apartment.\nDefinitely, somebody did but I don’t know who the person is.\nI don’t know what happened when I left to buy food,” she said."
  },
  {
    "headline": "Gunmen Attack Catholic Seminary In Kaduna, Kidnap Students",
    "summarized_story": "Gunmen have attacked the Saint Albert the Great Institute of Philosophy, a Catholic church-owned seminary in Fayit community in Kagoma Chiefdom of Jama’a Local Government Area of Kaduna State.\nThey were said to have invaded the school on Monday night and started shooting sporadically, thereby, creating fear among the students and staff of the school.\nSpokesman of the Kaduna State Police Command, Mohammed Jalige, who confirmed the attack to Channels Television also noted that three students were abducted by the gunmen, while some others were injured.\nThey were said to have taken the students to an unknown destination before the arrival of local vigilantes who were able to prevent them from taking more students.\nRead Also: Six Women, Nine Children Escape From Boko Haram CaptivityAccording to Jalige, a combined team of police tactical and anti-kidnapping squad of the command have launched a manhunt of the gunmen with a view to arresting them and rescuing the victims."
  },
  {
    "headline": "Court Threatens To Revoke Fani Kayode’s Bail",
    "summarized_story": "The Federal High Court Sitting in Lagos has ordered a former Minister Of Aviation, Femi Fani-Kayode to pay a fine of N200,000 for being absent at his re-arraignment or stand the risk having his bail revoked.\nJustice Daniel Osaigor gave the order on Wednesday, saying that having gone through the court’s file, he observed five different letters seeking adjournment on the same medical grounds.\nThe EFCC preferred 17 counts of money laundering to the tune of N4.6 billion against them before Justice Mohammed Aikawa who was initially the trial judge until he was transferred out of the Lagos Jurisdiction.\nThey all, however, pleaded not guilty to the charges and were granted bail.\nThe case was subsequently, assigned to a new judge, Justice Osaigor, and the defendants were scheduled for re-arraignment on Wednesday (October 13)."
  },
  {
    "headline": "Former Vice President, Atiku Abubakar, commends NASS, INEC over Electoral Act -",
    "summarized_story": "Former Vice President of Nigeria and presidential candidate of the Peoples Democratic Party (PDP) in the 2019 election, Atiku Abubakar has commended the resolution of the disagreement between the National Assembly and the Independent National Electoral Commission (INEC) on electronic transmission of election results.\nA press statement by the media office of the former Vice President on Tuesday, said that the harmonization of positions between the two institutions is an indication that Nigeria’s democracy is growing and getting stronger.\nThe former Vice President also commended individuals and groups particularly the various pro-democracy advocacy groups that participated in the public discourse on the controversial issue, noting: “by this outcome, I am convinced that public institutions in Nigeria will continue to play their roles as guardians of public policy.”The statement further added that, “the civil societies are the watchdogs of public policies and the institutions.\nProbably, we would not have come to this path without the active engagement of the civil society agents.\nThis outcome should further encourage Nigerians and the civil society to do more in order to guarantee good governance in the country.”"
  },
  {
    "headline": "Zamfara Assembly suspends 2 members for involvement in Banditry -",
    "summarized_story": "Zamfara State House of Assembly have Suspended two lawmakers for alleged involvement in Banditry ActivitiesThe lawmakers are Yusuf Muhammad Representing Anka consultancy and Ibrahim Tukur representing Bakura constituencyThe members are also Alleged to be the brain behind the killing of Hon.\nMuhammad Ahmad Jangeru a member representing Shinkafi constituency who was killed by unknown gunmen in June while traveling to kano stateThe two House of Assembly members are suspended for three months pending the conclusion of investigationA press statement by the spokesperson of the House Ja’afaru Kaura says, the Suspended lawmakers will appear before the House Committee on ethics and privileges’ alongside security agenciesThe statement adds that the Suspended lawmakers were seen jubilating when the biological father of the speaker of the House and other family members were abducted on august fifth before he was killed by his Abductors after two months in captivityThey members were said to be the ones mediating negotiating with a notorious bandit leader Bello Turji on so many occasions to secure the release of late father of the speaker Mu’azu MagaryaThis Development is coming shortly after all members of the Zamfara state House of Assembly swore with the holy quaran to prove their innocence in the lingering security challenges in the state."
  },
  {
    "headline": "Veteran Actor, Chiwetalu Agu, regains freedom from DSS custody -",
    "summarized_story": "Veteran actor Chiwetalu Agu, who was arrested by the Department of State Services (DSS), has regained freedom.\nChiwetalu Agu was first arrested by the Army on October 7, 2021 around Upper Iweka in Onitsha, Anambra State for putting on an outfit allegedly promoting the proscribed separatist group IPOB while distributing bread and other items to the poor, before he was later picked up by the DSS in the evening of that day.\nThe National President of the Actors Guild of Nigeria, Ejezie Emeka Rollas, in a statement, said the association was able to secure the release of Actor Chiwetalu Agu from the custody of the DSS.\nEjezie, in company of a colleague, a senior special Assistant on Military Affairs and Inter-Governmental Relations to the AGN President Steve Eboh, received Agu at the DSS office, AbujaThe elated veteran actor, who was in the company of actress Monalisa Chinda and another colleague, thanked God for surviving the ordeal.\nHe commended AGN for its relentless efforts in securing his release from detention."
  },
  {
    "headline": "Governor El- Rufai presents N233 Billion budget estimates to lawmakers -",
    "summarized_story": "Governor of Kaduna State, Nasir El-Rufai on Tuesday presented the 2022 draft budget of 233 billion Naira to the state House of Assembly at the Lord Lugard Hall in the state.\nThe budget projects a capital expenditure of 146 billion Naira and recurrent spending of 87.6 billion Naira.\nWhile giving a breakdown of the budget estimate, the governor disclosed that it has a capital to recurrent ratio of 63% to 37%.\nHe explained that the priorities of the 2022 estimates will be on Education, Healthcare and Infrastructure, like previous budgets.\nGovernor Nasir El-rufai also pointed out that the allocations in the 2022 budget, reflect the political values and governance principles which have consistently guided the six previous budgets his government has presented since 2015."
  },
  {
    "headline": "Rebuffing Texas Governor, American Airlines, Southwest Airlines Stand By Vaccine Mandate",
    "summarized_story": "American Airlines and Southwest Airlines both say they’ll defy Texas’ new COVID-19 vaccine mandate ban and adhere to the federal mandate from President Biden, Bloomberg reports.\nAfter Texas Gov.\nGreg Abbott (R) on Monday issued a new executive order banning “any entity” from imposing COVID-19 vaccine mandates, American Airlines said, “We believe the federal vaccine mandate supersedes any conflicting state laws, and this does not change anything for American,” per Bloomberg.\nSimilarly, Southwest said, “We would be expected to comply with the president’s order to remain compliant as a federal contractor.” Both airlines have their headquarters in Texas and are requiring employees to get vaccinated against COVID-19.\nAmerican will require its workers to get vaccinated by Nov. 24, while Southwest workers have until Dec. 8."
  },
  {
    "headline": "Top UN Court Sides with Somalia in Sea Border Dispute with Kenya",
    "summarized_story": "The United Nations’ top court has awarded Somalia control of most of a potentially oil- and gas-rich chunk of the Indian Ocean after a bitter legal battle with neighbouring Kenya over their sea border.\nThe court rejected Kenya’s claim of the maritime boundary it sought, saying Kenya had not consistently maintained it.\nBut the court rejected Somalia’s pursuit of reparations after the country alleged that some of Kenya’s maritime activities had violated its sovereignty.\nSomalia filed the ICJ case over the countries’ maritime boundary in 2014, contributing to their strained relations.\nIt also found “no compelling evidence that Somalia has acquiesced” to Kenya’s claim of a maritime boundary along a parallel line of latitude."
  },
  {
    "headline": "Ronaldo Grabs Hattrick as Portugal Thump Luxemburg",
    "summarized_story": "Cristiano Ronaldo scored a hat-trick as Portugal recorded an emphatic World Cup qualifying win over Luxembourg at the Estadio Algarve.\nThe victory leaves Portugal second in Group A, a point behind Serbia who they host in their final game.\nRonaldo knocked in two penalties and rounded off the scoring with a header as he recorded his 58th hat-trick for club and country.\nFernandes superbly drove a low shot into the bottom-right corner as the hosts went 3-0 up inside 18 minutes.\nPortugal travel to the Republic of Ireland in their penultimate Group A match before facing Serbia."
  },
  {
    "headline": "Boeing Tells Workers They Must Get Covid Vaccine",
    "summarized_story": "The Boeing Co. has told employees they must be vaccinated against COVID-19 or possibly be fired.\nThe Seattle Times reports the deadline for workers at the aerospace giant is Dec. 8.\n“Compliance with these requirements is a condition of employment,” states a Boeing internal presentation from Tuesday viewed by the newspaper.\nBoeing has more than 5,000 employees in Texas.\nIt has about 32,000 more at facilities in Alabama, Arizona, Missouri, Oklahoma and South Carolina."
  },
  {
    "headline": "Access Bank Acquires 78.15% Stake in BancABC Botswana",
    "summarized_story": "Access Bank Plc on Tuesday announced on the Nigerian Exchange Limited (NGX) that it has acquired 78.15 per cent shareholding in African Banking Corporation of Botswana Limited (BancABC Botswana).\nCompany Secretary, Access Bank, Sunday Ekwochi, in a statement explained that BancABC Botswana is the fifth largest bank in Botswana as well as a well-capitalised franchise poised for growth in its local market.\n“It will also strengthen the quality of earnings through revenue diversification and growth in the corporate and SME banking segments for BancABC Botswana.\nThe bank’s subsidiaries include Access Bank (Gambia) Limited, Access Bank (Sierra Leone) Limited, Access Bank (Zambia) Limited, Access Bank (UK) Limited, Access Bank (Ghana) Limited, Access Bank (D.R.\nCongo), Access Bank (Rwanda) Limited, Access Bank (Guinea) Limited, Access Bank (Kenya) Limited and Access Bank (Mozambique) Limited."
  }
]