[
  {
    "headline": "Drug trafficking: NDLEA nabs pregnant woman, fake soldier, others",
    "summarized_story": "Attempts by a female passenger, Obehi Isesele, and one Emmanuel Omebere to export illicit drugs to Europe through the Murtala Mohammed International Airport, Lagos, and Nnamdi Azikiwe International Airport, Abuja have been thwarted by officers of the National Drug Law Enforcement Agency.\nThe agency said they were arrested shortly before they boarded their flights.\nMeanwhile, efforts by desperate traffickers to export varying sizes of consignments containing cocaine, heroin, and other illicit drugs through courier firms were also foiled.\n“Also, one Aliyu Saidu, suspected to be a fake soldier was arrested with 2.3kg of Cannabis Sativa in a commercial bus from Lagos to Makurdi, on Monday 13th of Sept at Aliade checkpoint, Benue State.\nIn Edo State, NDLEA operatives stormed remote forests in Ovia North East LGA between September 8 and 16 and destroyed over 14 hectares of cannabis farms and recovered 172.6kg of cannabis."
  },
  {
    "headline": "BREAKING: Gunmen kill three policemen, injure two in Anambra",
    "summarized_story": "Three policemen on duty in Onitsha Anambra State were on Sunday killed by gunmen.\nThe incident, it was gathered, happened around 9 am on the Ukaegbu /Ezeiweka road in Onitsha.\nTwo other cops were injured during the shooting incident at a security post mounted by the police operatives.\nA bystander said the gunmen may have been angered by the alleged extortion by the operatives at the security post.\n“Some people believe the gunmen are pro-Biafra agitators.”When contacted, the state Police Public Relations, Ikenga Tochukwu, confirmed the incident."
  },
  {
    "headline": "Why Nigeria needs Umahi as President in 2023 — Ebonyi Commissioner",
    "summarized_story": "“It is axiomatic that nobody has equalled Governor Umahi since Nigeria’s Independence, be it President or Governor.\nUpon the inception of his administration, Governor Umahi wasted no time in embarking on aggressive road construction in all the 13 local government areas of Ebonyi State.\n“Talking of road infrastructure, it is axiomatic that nobody has equalled Governor Umahi since Nigeria’s Independence, be it President or Governor.\nChief David Nweze Umahi as President in 2023 to fix the infrastructural deficit before it becomes irremediable.\nFor a nation to advance, there is no alternative to infrastructure development and there are no shortcuts to faster economic growth."
  },
  {
    "headline": "Kumuyi to hold 5-Day ‘Divine Solution Global Crusade’ in Abuja Sept 24-28",
    "summarized_story": "…as guest gospel singer, Nathaniel Bassey to minister alongsideBy Gabriel Ewepu, ABUJATHE Deeper Life Bible Church, Sunday, disclosed that the General Superintendent of Deeper Christian Life Ministry, DLCM, Pastor William Kumuyi, is set to hold a 5-day ‘Divine Solution Global Crusade’ in Abuja from September 24-28, 2021.\nAccording to the statement, 5-day ‘Divine Solution’ Global Crusade will be the fourth edition Pastor Kumuyi is holding such mega crusade in the nation’s capital as being led by the Holy Spirit.\nThe Statement reads in part, “The Deeper Life Bible Church is holding another mega Global Crusade in the Federal Capital Territory, FCT, with the theme, ‘Divine Solution Global Crusade’ which will be a 5-day Crusade and it will start from September 24-28, 2021, and the venue is at Papal Ground Kubwa, Abuja.\n“This ‘Divine Solution Global Crusade’ is divinely led by God himself by laying it in the heart of our Father in the Lord, Pastor (Dr) William Kumuyi, who will minister live at the Crusade for the five days.\n“We are using this medium to call on Abuja residents to attend the ‘Divine Solution Global Crusade’ because there is the solution for all kinds of problems that anybody will come with to the venue of the crusade."
  },
  {
    "headline": "Follow Buhari’s footsteps, accept Fani-Kayode — PGF DG charges APC members",
    "summarized_story": "Lukman said; “Almost every member of APC is angry that our leaders have brought someone like Mr. Fani-Kayode into our party.\n“What is very clear is that our leaders, especially President Buhari have forgiven Mr Fani-Kayode and embrace him as one of us.\nAs members of APC, our anger with Mr Fani-Kayode is that he has abused both the APC, President Buhari and virtually every leader of the party.\n“At this point, therefore, if with all these, our leaders can accept Mr Fani-Kayode into the party, APC members should not be more Catholic than the Pope.\nHe said what is required in the circumstance is for APC leaders to test the commitment of Mr. Fani-Kayode to reform himself."
  },
  {
    "headline": "Police arrest 2 suspects, recover N401,000 in Abuja",
    "summarized_story": "Police in the FCT say they have arrested two suspects in Abuja over “one chance’’ con trap, rescued a female victim and recovered N401,000.\nPolice Public Relations Officer in the FCT, DSP Josephine Adeh, made the disclosure in a statement issued in Abuja on Sunday.\n“One chance’’ is a crime in which assailants pose as cab drivers and passengers, take victims, particularly female commuters into their cabs and dispossess them of their valuables.\nShe said preliminary investigations by the police revealed that the two suspects posed as taxi driver and passenger waiting to pick other passengers.\n“In this instance, the suspects picked up the victim who had just closed from work."
  },
  {
    "headline": "NDLEA nabs Italy-bound pregnant woman, fake soldier for drug trafficking",
    "summarized_story": "“Curiously, a 38-year-old pregnant woman, Kate Ngozi Nwuju was arrested on Tuesday 14th Sept at her residence in Rumueme, Mile 4 area of Port Harcourt, Rivers state with 4.5kilograms of cannabis following intelligence that she sells drugs.\n“Also, one Aliyu Saidu, suspected to be a fake soldier was arrested with 2.3kg of Cannabis Sativa in a commercial bus from Lagos to Makurdi, on Monday 13th of Sept at Aliade checkpoint, Benue State.\n“Three female and male suspects were also arrested in raids across Owan East and Akoko Edo areas of the state.\n“Different quantities of cannabis and local mixtures called monkey tail were recovered from them.\nGen. Mohamed Buba Marwa (Retd)commended the officers and men of the Lagos airport, Abuja airport, Benue, Kano, Ogun, Rivers, Cross River and Edo commands as well as those of the Directorate of Operation and General Investigation, DOGI, of the Agency for maintaining the heat on drug dealers”."
  },
  {
    "headline": "Obadiah Mailafia, former CBN Deputy Gov is dead",
    "summarized_story": "Obadiah Mailafia, a former Deputy Governor of the Central Bank of Nigeria is dead.\nMailafia, the 64-year-old reportedly passed away on Sunday morning at the National Hospital Abuja.\nRecall that Obadiah Mailafia stirred controversy after he granted an interview accusing most top government officials of sponsoring terrorism in Nigeria.\nI was informed that he passed on this morning.\nHe was a great nationalist, a believer in Nigeria, a kind and gentle soul.”"
  },
  {
    "headline": "Gunmen kill three policemen in Anambra, set patrol van ablaze",
    "summarized_story": "Three policemen have been killed by gunmen in Onitsha, Anambra State, while two persons identified to be civilians sustained bullet wounds in the attack.\nA source in Onitsha said the attack occurred at Ezeiweka road in the commercial city, and that a patrol van belonging to the police was also set ablaze by the attacking gunmen.\n“The policemen were at a checkpoint in the area, where they always station their vehicle at the junction on daily basis as one of the security posts, when the attack happened,” the source said.\nThe State Police Command’s spokesperson, DSP Toochukwu Ikenga confirmed the incident, saying that he would react after gathering information about how the attack happened."
  },
  {
    "headline": "Anti-Open grazing: Ortom doesn’t hate Buhari, Fulanis – Benue Tiv Buharists",
    "summarized_story": "The Tiv National Volunteers for Buhari Worldwide and National Leader of Tiv Muslims Worldwide, has assured that the Benue State Governor, Samuel Ortom harbours no hatred for President Muhammadu Buhari and the Fulani tribe.\nAccording to Tyomanger: “It has become necessary to debunk the claims that His Excellency, Samuel Ortom, Executive Governor of Benue State hates Fulani ethnic nationals.\n“For the avoidance of doubt, I am Alhaji Sadiq Tyomanger, the National Leader of the famous Tiv National Volunteers for Buhari worldwide.\n“Tiv Buharists are therefore, standing with Governor Samuel Ortom, the government and people of Benue State on the state’s Anti Open-grazing Law and its implementation.\nThe cattle grazing routes will not be possible in Benue State for now.”He called on Buhari to exempt Benue State from the grazing route policies of the Federal Government."
  },
  {
    "headline": "Gunmen invade political meeting in Enugu, says no election on Biafra land [VIDEO]",
    "summarized_story": "Some gunmen have attacked a gathering of politicians in Enugu West, threatening that no election would hold on any part of “Biafra land”.\nIn a video that went viral on Sunday, the gunmen were seen shooting repeatedly as those at the political gathering fled for their lives.\nThey were beaten, molested and harassed amidst allegation that they were trying to “bring back Fulani” into Enugu West.\nIn the 4:50 minutes video, it could be seen that vehicles and motorbikes were smashed by the gunmen, who threatened to deal with anyone organising a political gathering on Biafra land.\nWhen asked what should be their punishment if they tried to organise another political gathering, one of the men said, “kill me.”“We’ve stopped the campaign on Biafra land."
  },
  {
    "headline": "Jubril of Sudan: Buhari’s Imo visit proved Nnamdi Kanu lied, he’s not cloned – Orji Kalu",
    "summarized_story": "Former Abia State Governor, Orji Uzor Kalu, on Sunday, said President Muhammadu Buhari’s visit to the Southeast has cleared all lies concerning his true identity.\nKalu, who is the Senate Chief Whip, said Buhari’s visit to Imo State has dismissed claims that he was dead and cloned.\nHe commended the President for his visit to the Southeast, stressing that it would reduce the agitations in the region.\n“I want to congratulate President Buhari for going to the south-east, he needs more of those visits.\nThe IPOB leader started the allegation during Buhari’s visit to the United Kingdom, UK, in 2017 when he spent 150 days."
  },
  {
    "headline": "Election for next Kontagora Emir holds Sunday",
    "summarized_story": "By Justina Asishana – Minna- Advertisement -Arrangements are in top gear for the election of the next Emir of Kontagora in Niger State with 47 aspirants for the throne.\nThe election of the seventh Emir of Kontagora begins by 9am on Sunday.\nBefore the election, the history of each candidate would be read in the present of the participants in the exercise.\nThe Nation learnt the six local government chairmen in the Emirate comprising Kontagora, Wushishi, Rijau, Mashegu, Magama and Mashegu would attend the election.\nHe called on the people to remain calm and pray that a trustworthy person who could continued with the good legacies left by the late Emir Alhaji Saidu Namska emerges as the next Emir."
  },
  {
    "headline": "Chamber to drive Halal businesses nationwide",
    "summarized_story": "- Advertisement -By Franca Ochigbo, AbujaThe Abuja Chamber of Commerce and Industry ACCI has set machinery in motion to drive Halal market activities round the country.\nRead Also: Businesses in dilemma over VAT collection, says LCCIAl-Mujtaba disclosed this at the Halal Expo 2021 in Abuja stating that the Chamber provides for its members through trade facilitation and the 2021 Halal Expo is one of such numerous initiatives.\nHalal businesses cover finance, manufacturing, hospitality, fashion and cosmetics, agribusiness and livestock and others.\nThe Halal Expo Nigeria, 2021 rides on four cardinal pillars, to create awareness about the Halal industry sub-sector in Nigeria.\nSpeaking, the Director General ACCI, Victoria Akai said the Halal business group will bring unique and significant contribution to business in Nigeria."
  },
  {
    "headline": "Crown Flour Mill joins global efforts to curb malnutrition",
    "summarized_story": "- Advertisement -Large-scale food fortification is an essential action to reduce micronutrient deficiencies in Africa.\nTo unlock the full potential of fortification, the private sector needs broader partnerships to foster investments in food processing technology and infrastructure as well as to drive consumer education.\nThis was the submission of Ashish Pande, the Managing Director of Crown Flour Mill (CFM) Limited, an Olam Group Company in Nigeria, during a virtual high-level consultation organised by the government of Côte d’Ivoire and the United Nations World Food Programme (WFP), through the Regional Centre of Excellence against Hunger and Malnutrition (CERFAM), on September 2 and 3, 2021.\nThe event aimed to collate and propose actionable interventions to governments and other key stakeholders to support the efforts of African countries to eliminate malnutrition from the continent.\nSpeaking about the roles of technological and financial partners in deepening the food fortification efforts in Africa, Pande said, “Acquiring the right food processing technology infrastructure as well as communicating and educating the importance of micronutrients and a healthy diet to key value chain players and especially, consumers will fast track the food fortification agenda on sub-regional and regional levels in Africa.”"
  },
  {
    "headline": "BREAKING: Former CBN Deputy Governor, Obadiah Mailafia dies at 64",
    "summarized_story": "From Uche Usim, AbujaFormer Deputy Governor, Central Bank of Nigeria (CBN), Dr. Obadiah Mailafia is dead.\nMailafia, a former columnist with The PUNCH newspapers reportedly died Saturday night at the National Hospital Abuja after a brief illness.\nThe former deputy governor, who was the Presidential candidate of the African Democratic Congress in the 2019 election, was a known government critic and was always getting under the skin of the government.\nHe later graduated top of his class at Ahmadu Bello University, Zaria, in 1978 with a B.Sc.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Defection: Why Northern oligarchy is pushing for Jonathan",
    "summarized_story": "He argued that a party like the APC battling image problem ought not to admit certain persons in its desperation to increasing membership base.\nThe chieftain alleged that the reason behind Northern oligarchy desperately wanting to lure former President Jonathan is just to satisfy the yearnings of the South for power rotation, explaining that with Jonathan, the South will only have a shot at power for just four years.\nCommenting on Fani-Kayode’s defection, the chieftain said: “Are you aware that Fani-Kayode is not joining from his ward in Osun State?\nYes, I am aware that he forced himself on APC, but this is the wrong time for him to join.\nThis move is purely a northern affair and they are not relenting about it regardless of the effect it will have on the party."
  },
  {
    "headline": "Coronavirus: Pain, anguish at Lagos isolation centre – The Sun Nigeria",
    "summarized_story": "Sister (Dr) Luciana Agba, who has been working with COVID-19 patients told our correspondent over the telephone.\nOne of the testing centres in Lagos is at the Nigerian Institute for Medical Research (NIMR), Yaba.\nPatients at Lagos facilityAs the epicenter of COVID-19, Lagos has rallied to erect various isolation centres where patients could receive treatment.\nAnother is at Infectious Disease Hospital (IDH), Yaba; then, there is one at Lagos State University (LASUTH), Ikeja, among others.\nPrivate hospitals participationOur correspondent gathered that there are a number of private outfits in Lagos that are also taking care of COVID-19 patients especially the rich."
  },
  {
    "headline": "I dreamt of becoming a queen from childhood –Yadera Nzimako,",
    "summarized_story": "By Agatha EmeadiMiss Yadera Nzimako was recently crowned Miss Bold and Beautiful Culture 2021 as the first runner-up at the Miss Bold and Beautiful Nigeria Pageant organised by Cherdah Republic.\nI contested in the Miss Bold and Beautiful Pageant, which is the biggest plus-size pageant in Nigeria.\nThere were three crowns given at the end of the show and they are Miss Bold and Beautiful Winner, Miss Bold and Beautiful Culture for the first runner-up and Miss Bold and Beautiful Elegance, second runner -up.\nI’m also open to becoming the face of big brands across the world as Miss Bold and Beautiful Culture queen.\nThat part will also shock people because the common language is nobody seeks the hand of plus-size ladies in marriage."
  },
  {
    "headline": "Kanu’s abduction is international brigandage –Muoma, SAN",
    "summarized_story": "From Ogbonnaya Ndukwe, AbaIchie Chuks Muoma, a Senior Advocate of Nigeria (SAN) is the chairman of Igbo Lawyers Association (ILA) based in Aba, Abia State.\nOur leaders, Igbo leaders, are suffering from poverty consciousness.\nAre Igbo leaders doing enough to get him out like the Yoruba are doing for Igboho?\nI mean sir, Igbo leaders are not speaking in Kanu’s favour, why?\nIt is true and the reason is that Igbo leaders are double-headed."
  },
  {
    "headline": "Just In: Two Abducted Katsina Children Die of Starvation, 20 Others Escape after Five Months in Captivity",
    "summarized_story": "Francis Sardauna in KatsinaTwo children who were among the 28 people that were abducted by bandits in Katoge village in Batsari Local Government Area of Katsina State have reportedly died of starvation while in captivity.\nThe victims were kidnapped in their ancestral home (Katoge) in April, 2021 and taken to a forest in Zamfara State by their abductors.\nOne of the victims, Mrs Sahura Haruna, who regained freedom after spending five months in bandits’ enclaves, told journalists in Katsina that the children died as a result of starvation.\nShe explained that six out of the 28 abducted victims were earlier released by the hoodlums after payment of ransom by their relatives, adding that the bandits abducted her when she was five months pregnant.\nShe said: “Last April, some bandits abducted 28 of us in Katoge village."
  },
  {
    "headline": "Atiku, Wike, Makinde, Others in Supremacy Battle for Control of PDP",
    "summarized_story": "The intrigues on who becomes the national chairman have continued as former governors of PDP and ex-ministers are said to have backed Oyinlola.\nAccording to a statement by the Director General of the PDP Governors Forum, Hon.\n“Governor Umahi sabotaged the PDP in 2019 elections in his quest to deliver 25 per cent to his APC benefactors.\nOn the issue of zoning, the PDP governors said, “we advise Governor Umahi to face his frustrations in APC and not drag PDP and her governors into it.\nAt the end of the day, decisions will be taken by each political party,” the PDP governors said."
  },
  {
    "headline": "Tomori, NMA, PSN Give Conditions for Local Production of COVID-19 Vaccines",
    "summarized_story": "In their separate interviews with THISDAY, Tomori, NMA, and PSN explained the challenges hindering Nigeria’s efforts to manufacture the vaccines locally.\nTomori said that the N10 billion budget approved since 2020 to secure the take-off of the vaccine manufacturing company has not been released.\nAccording to Tomori, many of the factors that are delaying the local manufacturing of vaccines in the country are man-made.\nTomori also bemoaned what he described as the government’s prolonged dependence on donations as a major source of acquiring COVID-19 vaccines to tackle the ravaging health emergency.\nThis has necessitated the need for Nigeria to sustain efforts in supporting the local capacity for COVID-19 vaccine production."
  },
  {
    "headline": "Second Batch of A-29 Super Tucano Fighter Jets Departs US for Nigeria",
    "summarized_story": "The United States Government had earlier promised that the six remaining A-29 Super Tucano fighter jets would arrive in Nigeria this month (September).\nThe A-29 Super Tucano, designed by the Sierra Nevada Corporation in Sparks, Nevada, are light attack aircraft to be deployed by the NAF in the fight against terrorism in the country.\nThe planes are a part of the United States’ security partnership with the Nigerian government.\nIt would be recalled that the first batch of A-29 Super Tucano aircraft arrived in Kano on July 22.\nThe first batch of fighter jets departed the United States on July 14, 2021."
  },
  {
    "headline": "Presidency Confirms 15 Major Projects to Be Financed with $4bn Loan",
    "summarized_story": "The president’s request to the Senate listed 15 proposed pipeline projects, the objectives, the implementation period, benefiting states, as well as the implementing Ministries, Departments, and Agencies (MDAs).\nOther projects to be financed by the World Bank are, the State Fiscal, Transparency, Accountability and Sustainability Programme for Results as well as the Agro-Processing, Productivity, Enhancement, and Livelihood Improvement Support Project.\nThe World Bank is also funding the Livestock Productivity and Resilience project in no fewer than 19 states and the Federal Capital Territory (FCT).\nThe French Development Agency will finance two projects, which include the National Digital Identity Management project and the Kaduna Bus Rapid Transport Project.\nThe digital identity project will be co-financed with World Bank and EIB."
  },
  {
    "headline": "Student Critic Of Lagos University Assassinated Amid Tussle With School, Another Shot Activist In A Coma",
    "summarized_story": "A student activist at the Lagos State University, Yusuf Nurudeen has been killed by unknown gunmen hours after appearing before the school's disciplinary committee over alleged admission racketeering and unlawful possession of university documents.\nSimilarly, a staff-activist in the school who had openly expressed support for Nurudeen was also shot in the back and said to be in a coma, Campus Trackers reports.\nSeveral organisations and unions, including the Socialist Workers’ League and the Lagos State University Student Union, condemned Nurudeen's arrest, describing it as excessive.\nNurudeen has been described as a passionate advocate against the anti-student\" and \"anti-worker\" policies of the school with the way he was not afraid to criticise the school management.\nHe was also said to have got married six months before his death, leaving behind a three-month-old child."
  },
  {
    "headline": "Student Critic Of Lagos University Assassinated Amid Tussle With School, Another Shot Activist In A Coma",
    "summarized_story": "A student activist at the Lagos State University, Yusuf Nurudeen has been killed by unknown gunmen hours after appearing before the school's disciplinary committee over alleged admission racketeering and unlawful possession of university documents.\nSimilarly, a staff-activist in the school who had openly expressed support for Nurudeen was also shot in the back and said to be in a coma, Campus Trackers reports.\nSeveral organisations and unions, including the Socialist Workers’ League and the Lagos State University Student Union, condemned Nurudeen's arrest, describing it as excessive.\nNurudeen has been described as a passionate advocate against the anti-student\" and \"anti-worker\" policies of the school with the way he was not afraid to criticise the school management.\nHe was also said to have got married six months before his death, leaving behind a three-month-old child."
  },
  {
    "headline": "Buhari Calls Police On Nigerian Protesters In London, Demonstrators Refuse To Back Down, Call President Terrorist",
    "summarized_story": "President Muhammadu Buhari has reportedly called police officers in London to prevent Nigerian protesters from gathering in front of the Nigeria House at Trafalgar Square in London, United Kingdom.\nAfter attending the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025, the Nigerian President stayed behind to see his doctors, even as resident doctors in his country have gone on strike.\nThe police officers were seen speaking with the Nigerian protesters, seemingly persuading them to stop protesting there.\nThere is no single healthcare in Nigeria, Buhari is still in government for over 6 years, he keeps borrowing, the economy is not good, there is rising inflation.\nBuhari, you are a wicked President, leave the government now, release Sowore, over two years now."
  },
  {
    "headline": "Buhari Calls Police On Nigerian Protesters In London, Demonstrators Refuse To Back Down, Call President Terrorist",
    "summarized_story": "President Muhammadu Buhari has reportedly called police officers in London to prevent Nigerian protesters from gathering in front of the Nigeria House at Trafalgar Square in London, United Kingdom.\nAfter attending the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025, the Nigerian President stayed behind to see his doctors, even as resident doctors in his country have gone on strike.\nThe police officers were seen speaking with the Nigerian protesters, seemingly persuading them to stop protesting there.\nThere is no single healthcare in Nigeria, Buhari is still in government for over 6 years, he keeps borrowing, the economy is not good, there is rising inflation.\nBuhari, you are a wicked President, leave the government now, release Sowore, over two years now."
  },
  {
    "headline": "Human Rights’ Activist, Sowore Gives 43 Reasons Why Nigerians Must Protest On October 1, Shun Independence Day",
    "summarized_story": "Human rights’ activist and Amnesty International-designated Prisoner of Conscience, Omoyele Sowore, has urged all Nigerians to join the planned nationwide protest on October 1 – Independence Day – in Nigeria.\nOmoyele SoworeThe protest is necessitated by nine demands, according to a statement by CORE’s co-convener, Baba Aye, and co-convener, Gbenga Komolafe.\nAmong their demands is the recognition of those who died during the #EndSARS protests as national heroes, with a national apology.\nDoctors are on strike; other health workers are warming up for a strike.\nSowore in a Facebook post on Saturday also lent his voice to the October 1 protest."
  },
  {
    "headline": "PHOTOS: Buhari departs Abuja for UN general assembly in New York",
    "summarized_story": "President Muhammadu Buhari departed Abuja on Sunday morning for the 76th session of the United Nations General Assembly (UNGA76) in New York in the United States.\nAdvertisementMuhammed Bello, FCT minister, was at Nnamdi Azikiwe International Airport alongside others to bid farewell to the president.\nSee pictures below:"
  },
  {
    "headline": "PHOTOS: Buhari departs Abuja for UN general assembly in New York",
    "summarized_story": "President Muhammadu Buhari departed Abuja on Sunday morning for the 76th session of the United Nations General Assembly (UNGA76) in New York in the United States.\nAdvertisementMuhammed Bello, FCT minister, was at Nnamdi Azikiwe International Airport alongside others to bid farewell to the president.\nSee pictures below:"
  },
  {
    "headline": "Obadiah Mailafia, ex-deputy governor of CBN, is dead",
    "summarized_story": "Obadiah Mailafia, former deputy governor of the Central Bank of Nigeria (CBN), is dead.\nBinniyat said Mailafia, who took refuge in Markudi, Benue state, following alleged persistent harassment by the Department of State Security Services (DSS), fell sick on Saturday and was rushed to an Abuja hospital.\nAdvertisement“You know, following his harassment by the DSS, he has been taking refuge from place to place.\nYesterday (Saturday), he took ill and he was rushed to the hospital that he normally attend in Abuja.\nAdvertisementMailafia was appointed deputy governor of CBN in 2005 from the African Development Bank (AfDB) where he served as the chief economist responsible for Strategic Planning and Corporate Reporting."
  },
  {
    "headline": "Obadiah Mailafia, ex-deputy governor of CBN, is dead",
    "summarized_story": "Obadiah Mailafia, former deputy governor of the Central Bank of Nigeria (CBN), is dead.\nBinniyat said Mailafia, who took refuge in Markudi, Benue state, following alleged persistent harassment by the Department of State Security Services (DSS), fell sick on Saturday and was rushed to an Abuja hospital.\nAdvertisement“You know, following his harassment by the DSS, he has been taking refuge from place to place.\nYesterday (Saturday), he took ill and he was rushed to the hospital that he normally attend in Abuja.\nAdvertisementMailafia was appointed deputy governor of CBN in 2005 from the African Development Bank (AfDB) where he served as the chief economist responsible for Strategic Planning and Corporate Reporting."
  },
  {
    "headline": "Orji Kalu: President's visit to south-east will clear lies that he is not Buhari",
    "summarized_story": "Orji Kalu, chief whip of the senate, says President Muhammadu Buhari’s visit to some parts of the south-east will dispel the rumour that he was dead and had been cloned.\nAdvertisementSpeaking on Sunday, the chief whip commended Buhari for his recent visit to the south-east, saying the visit will calm agitations in the region.\nAdvertisementAt a point, rumours were rife that Buhari had died and had been replaced by one Jubril from Sudan.\nAdvertisement“I want to congratulate President Buhari for going to the south-east, he needs more of those visits,” Kalu said.\nAdvertisement“This is because a lot of lies have been told that it is not Buhari living in the villa."
  },
  {
    "headline": "A backstory to the tussle between CBN and forex rates platform abokiFX",
    "summarized_story": "abokiFX, a popular mobile and web-based platform that collates the black market foreign exchange rates in Nigeria, on Friday announced it will temporarily suspend the publishing of rates on all its platforms, hours after receiving threats from the Central Bank of Nigeria (CBN).\nWhy Nigeria has different exchange ratesNigeria is Africa’s largest producer of oil, a commodity that brings in more than 90% of the country’s foreign exchange earnings.\nBut rather than an outright devaluation of the naira, the CBN adopted a multiple exchange-rate regime.\nThat left Nigeria with only two rates – the NAFEX rate and the parallel market rate – from almost five different rates as of early 2020.\n“All allegations against our director are yet to be confirmed but we at abokiFX DO NOT trade FX nor do we manipulate parallel market rates,” the statement reads."
  },
  {
    "headline": "Africell exits Ugandan telecom market due to fierce competition",
    "summarized_story": "The remaining 10% is split between three or four other nationwide operators including Africell and Uganda Telecom.\nIt appeared Africell was entering an untapped market and the company bet on data services to eat into the market share of incumbents.\nBut like its predecessors, the company struggled to make a notable impact in a mobile market reputedly hostile to new entrants.\nUganda has over 24 million mobile subscribers with MTN controlling 50% of the market while Airtel Uganda accounts for 43%.\nWhile it struggled to grow its market share, Africell also grappled with high operating costs and debt burden, part of which was inherited from Orange."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Obadiah Mailafia, former CBN deputy governor is dead",
    "summarized_story": "Obadiah Mailafia, a renowned Nigerian economist who served as deputy governor of the Central Bank of Nigeria (CBN) is died, BusinessDay learnt.\nMailafia, born on December 24, 1956 died on Sunday morning at the National Hospital, Abuja – the nation’s foremost public health facility.\nMailafia hailed from Randa in Christian-dominated Southern Kaduna, Kaduna State.\nMailafia, a critic of the President Buhari-led administration contested the 2019 presidential election under the African Democratic Congress (ADC).\nHe worked at the African Development Bank (AfDB) and served as CBN deputy governor between 2005 and 2007."
  },
  {
    "headline": "Nigeria’s curious case of rising debt profile amid worsening poverty",
    "summarized_story": "Since 2015 when the Muhammadu Buhari administration came to power, Nigeria’s debt stock has been on the upward trajectory.\nThe loan request has been condemned across the country including leaders of the ruling All Progressives Congress (APC) and some federal lawmakers.\nThe new loan request followed last April’s approval of external loans of $1.5 billion and €995 million for the Federal Government.\nSince assuming office in 2015 the borrowing profile of the Buhari’s administration has become increasingly worrisome to Nigerians.\nNever in the economic history has Nigeria been so intoxicated by debt and borrowing not even during the military regimes."
  },
  {
    "headline": "Presidency lists projects, states to benefit from external loans",
    "summarized_story": "The presidency on Saturday said a total of 15 projects spread across the six geo-political zones of the country, will be financed with the external loans which President Muhammadu Buhari is seeking.\nBuhari had requested the Senate to approve sovereign loans of $4.054bn and €710million as well as grant components of $125m for the proposed projects.\nThe Global Partnership for Education grant is expected to increase equitable access for out-of-school children and improve literacy in focus states.\nThe World Bank is also funding the Livestock Productivity and Resilience project in no fewer than 19 States and the Federal Capital Territory (FCT).\nThe digital identity project will be co-financed with World Bank and EIB."
  },
  {
    "headline": "Police to prosecute LASG staff for attempted suicide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLagos – Police timely intervention have saved the life of one Mr Akinlolu Ajayi, 54-years-old staff of Lagos State Government, who attempted to commit suicide by jumping into the lagoon.\nThe Lagos Police Spokesman, CSP Adekunle Ajisebutu, said in a statement on Saturday that the incident happened on Wednesday at about 9.25 a.m.\nHe said the man worked with Lagos State Development and Property Corporate (LSDPC), Town Planning, Ilupeju Lagos.\nThe spokesman said that the suspect had been transferred to the State Criminal Investigation Department for investigation and subsequent prosecution.\nHe further warns that such condemnable act is not only morally wrong but is also criminal,” Ajisebutu quoted the CP as saying."
  },
  {
    "headline": "COVID-19: Edo receives 50,000 more doses of AstraZeneca vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State at the weekend received 50,000 additional doses of the Oxford AstraZeneca vaccines from the federal government, to boost the state’s efforts at vaccinating more citizens to protect them from COVID-19.\nThe vaccines were received by the Executive Secretary, Edo State Primary Health Care Development Agency (EDSPHCDA), Dr. Mrs. Erhabor Julie, at the Benin Airport.\nSpeaking to journalists shortly after receiving the vaccines, Erhabor charged citizens to avail themselves the opportunity of the availability of the vaccines to get inoculated against the virus.\nAccording to her, “l am calling on all those who have not been inoculated to come and take the vaccines.\nEdo does not have any problem with the supply of vaccines."
  },
  {
    "headline": "Edo Roads Construction: Abudu wants general hospital, Ago-Ogbeide roads listed in next phase. – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Orhionmwon – The General Hospital, and Ago-Ogbeide roads in Abudu, Orhionmwon local government area of Edo state has become a source of worry to inhabitants and others using the routes to their farms and place of work.\nThe (now-abandoned) Nigeria Security and Civil Defence Corps (NSCDC) building, local government education authority office and staff quarters as well as General Hospital Abudu are located along the hospital road.\nThere’s a road we normally pass; that straight (general hospital) road is not passable”, Dr. Alimansuya Emmanuel, Medical Director of the General Hospital told our correspondent in a chatAccording to the inhabitants, the General Hospital and Ago-Ogbeide roads are major routes that link the administrative headquarters to Iru and adjoining communities, and also for those farming in the area.\nThey appealed to Governor Godwin Obaseki to extend his planned rehabilitation of roads across the state, to further fastrack socio-economic development of the area.\nRecall state government recently earmarked 91 roads for repairs and rehabilitation across the three senatorial districts, with none captured in Abudu or other parts of Orhionmwon."
  },
  {
    "headline": "Speak truth to power, Edo Dep Gov charges politicians – Nigerian Observer",
    "summarized_story": "Philip Shaibu has linked the spate of insecurity and banditry being witnessed in the country to refusal of politicians to speak the truth, urging them to be bold and speak truth to power irrespective of their political affiliations so as to make the nation better.\nIf we tell ourselves the truth, we will not have all these crises that are self-inflicted; we are the cause.\n“But I am happy that we now have a forum that we can use in telling ourselves the truth.\nWhen things are bad, say it’s bad and find a way to provide a solution.\nLet us collectively continue to speak truth to power."
  },
  {
    "headline": "Obadiah Mailafia, ex-CBN deputy governor, is dead",
    "summarized_story": "ADVERTISEMENTA former deputy governor of the Central Bank of Nigeria (CBN), Obadiah Mailafia, is dead.\nMr Mailafia, 64, died on Sunday morning from an undisclosed illness.\nAn associate of Mr Mailafia, John Hayab, confirmed his death to Leadership newspaper.\nMr Hayab is also the chairman of the Christian Association of Nigeria, Kaduna chapter.\nApart from being a former CBN deputy governor, Mr Mailafia was also a popular public commentator who was always willing to share his view on public affairs."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Anambra State govt mourns passing of Abdulazeez Chivuzor Ude",
    "summarized_story": "The government of Anambra State has expressed sadness over the passing of elder statesman, Alhaji Abdulazeez Chivuzor Ude.\n“There were many persons of Anambra State origin in top management of his enterprises like Gordon and Georgi Umunna who worked on Financial Post.\n“Unknown to most people because of his self-effacing nature, Chief Ude contributed significantly to the creation of Anambra, Enugu, Delta and Ebonyi states.\n“The Government and people of Anambra State truly mourn the transition of this great Igboman, pan Africanist, publisher and intellectual.\nWe mourn with the Ude family of Abor and the people and government of Enugu State."
  },
  {
    "headline": "The Osun Federal Government Road Construction Refunds: The True State Of Affairs, By Bola Oyebamiji",
    "summarized_story": "The total contract sum of all federal road projects embarked upon by the Osun State Government, as approved by the Federal Ministry of Works, is N38billion.\nThis review was duly communicated to the Osun State Government.\nAs at today, Gbongan – Akoda road project is at 36% completion stage, with 8.6km asphalted on both sides of the road.\nIt is a fact that Osun State remains one of the few states paying minimum wage of N30,000 in spite of our precarious and highly geared financial situation.\nBola Oyebamiji is theHonourable commissioner for Finance, Osun State"
  },
  {
    "headline": "Elder statesman, Abdulazeez Chibuzor Udeh is dead",
    "summarized_story": "OBINNA EZUGWUElder statesman and celebrated intellectual, Alhaji Abdulazeez Chibuzor Udeh has passed away, days before his 81th birthday.\nNoted for being a prominent Igbo leader of Muslim faith from Enugu State, Udeh passed away on Thursday after an illness and was subsequently buried on Friday in accordance with Islamic rites.\nBorn September 30, 1940, he was media guru and a distinguished alumnus of the esteemed College of Immaculate Conception (CIC), Enugu, who despite his towering accomplishments shunned the limelight.\nA man of impeccable character, Udeh was educated at Oxford in England and Columbia in the United States.\nAbdulazeez Ude founded Nok Publishers in the United States and Nigeria, undertaking to see radical books from Africa and the Global South in print."
  },
  {
    "headline": "Beyond Aboki: The Ifekaego foreign exchange tutorial, by Kingsley Moghalu",
    "summarized_story": "It’s those reserves, our main defense in a soccer analogy, that determines the value of the Naira.\nSpeculation also affects the naira value, as there are currency traders around the world for whom the weakness of a currency is their very good fortune.\nIf reserves are weak, and demand for dollars massively outstrips supply, currency devaluation is inevitable, and currency traders who mount speculative attacks profit from this devaluation.\nSuch traders will borrow the Naira from Nigerian banks, convert it to, say, dollars, then buy short-interest paying Nigerian bonds.\nThe first is that, because Nigeria has a big, profitable economy and market, dollars will likely swamp the market seeking profits for investors."
  },
  {
    "headline": "Kumuyi Set To Hold 5-day ‘Divine Solution Global Crusade’ In Abuja Sept",
    "summarized_story": "The General Superintendent of Deeper Christian Life Ministry (DLCM), Pastor William Kumuyi, is set to hold a 5-day ‘Divine Solution Global Crusade’ in Abuja from September 24-28, 2021.\nADVERTISEMENTThe statement reads in part, “The Deeper Life Bible Church is holding another mega Global Crusade in the Federal Capital Territory, FCT, with theme, ‘Divine Solution Global Crusade’ which will be a 5-day Crusade and it will start from September 24-28, 2021, and the venue is at Papal Ground Kubwa, Abuja.\n“This ‘Divine Solution Global Crusade’ is divinely led by God himself by laying it in the heart of our Father in the Lord, Pastor (Dr) William Kumuyi, who will minister live at the Crusade for the five days.\n“We are using this medium to call on Abuja residents to attend the ‘Divine Solution Global Crusade’ because there is solution for all kind of problems that anybody will come with to the venue of the crusade.\nIt added that a guest gospel singer, Nathaniel Bassey, will minister alongside the General Superintendent, Pastor Kumuyi, for the five days of the event."
  },
  {
    "headline": "Kumuyi Set To Hold 5-day ‘Divine Solution Global Crusade’ In Abuja Sept",
    "summarized_story": "The General Superintendent of Deeper Christian Life Ministry (DLCM), Pastor William Kumuyi, is set to hold a 5-day ‘Divine Solution Global Crusade’ in Abuja from September 24-28, 2021.\nADVERTISEMENTThe statement reads in part, “The Deeper Life Bible Church is holding another mega Global Crusade in the Federal Capital Territory, FCT, with theme, ‘Divine Solution Global Crusade’ which will be a 5-day Crusade and it will start from September 24-28, 2021, and the venue is at Papal Ground Kubwa, Abuja.\n“This ‘Divine Solution Global Crusade’ is divinely led by God himself by laying it in the heart of our Father in the Lord, Pastor (Dr) William Kumuyi, who will minister live at the Crusade for the five days.\n“We are using this medium to call on Abuja residents to attend the ‘Divine Solution Global Crusade’ because there is solution for all kind of problems that anybody will come with to the venue of the crusade.\nIt added that a guest gospel singer, Nathaniel Bassey, will minister alongside the General Superintendent, Pastor Kumuyi, for the five days of the event."
  },
  {
    "headline": "BREAKING: Ex-CBN Gov, Obadiah Mailafia, Is Dead",
    "summarized_story": "A former deputy governor of the Central Bank of Nigeria (CBN) from May 5, 2005 to March 26, 2007, Dr. Obadiah Mailafia, is dead.\nAged 64, Mailafia died after a brief illness at an undisclosed Abuja medical facility.\nA family member, Mr. Mike Kalla, in Jos, Plateau State, and associate, Rev.\nJohn Joseph Hayab, who is the chairman of the Kaduna State chapter of Christian Association of Nigeria (CAN), both confirmed Mailafia’s death on Sunday morning to LEADERSHIP.\nADVERTISEMENTBorn on December 24, 1956 in Randa village, Sanga local government area of Kaduna State, Mailafia was a popular development economist, international polymath, and Nigerian central banker."
  },
  {
    "headline": "BREAKING: Ex-CBN Gov, Obadiah Mailafia, Is Dead",
    "summarized_story": "A former deputy governor of the Central Bank of Nigeria (CBN) from May 5, 2005 to March 26, 2007, Dr. Obadiah Mailafia, is dead.\nAged 64, Mailafia died after a brief illness at an undisclosed Abuja medical facility.\nA family member, Mr. Mike Kalla, in Jos, Plateau State, and associate, Rev.\nJohn Joseph Hayab, who is the chairman of the Kaduna State chapter of Christian Association of Nigeria (CAN), both confirmed Mailafia’s death on Sunday morning to LEADERSHIP.\nADVERTISEMENTBorn on December 24, 1956 in Randa village, Sanga local government area of Kaduna State, Mailafia was a popular development economist, international polymath, and Nigerian central banker."
  },
  {
    "headline": "BREAKING: Ex-CBN Gov, Obadiah Mailafia, Is Dead",
    "summarized_story": "A former deputy governor of the Central Bank of Nigeria (CBN) from May 5, 2005 to March 26, 2007, Dr. Obadiah Mailafia, is dead.\nAged 64, Mailafia died after a brief illness at an undisclosed Abuja medical facility.\nA family member, Mr. Mike Kalla, in Jos, Plateau State, and associate, Rev.\nJohn Joseph Hayab, who is the chairman of the Kaduna State chapter of Christian Association of Nigeria (CAN), both confirmed Mailafia’s death on Sunday morning to LEADERSHIP.\nADVERTISEMENTCourt Dismisses Mailafia’s Application To Stop Police InvitationBorn on December 24, 1956 in Randa village, Sanga local government area of Kaduna State, Mailafia was a popular development economist, international polymath, and Nigerian central banker."
  },
  {
    "headline": "Gunmen abduct Abia varsity undergraduates, kill academy student",
    "summarized_story": "Suspected Fulani herdsmen on Saturday evening kidnapped students of Abia State University, Uturu, Abia State.\nThe suspects also shot and killed a student of Marist Comprehensive Academy, Uturu.\nThey also robbed motorists and passengers who were en route to Port Harcourt from Enugu and from Okigwe town to Enugu, respectively.\nThe statement read, “Some students from Marist Comprehensive Academy, Uturu, Abia State were attacked by armed bandits around Ihube road in Okigwe LGA on their way from a Final Religious Profession of some Marist Brothers.\nThey had also in April kidnapped a catholic priest, Izuchukwu Onyeocha, who is a professor of Sociology at Imo state University in Owerri."
  },
  {
    "headline": "Gunmen abduct Abia varsity undergraduates, kill academy student",
    "summarized_story": "Suspected Fulani herdsmen on Saturday evening kidnapped students of Abia State University, Uturu, Abia State.\nThe suspects also shot and killed a student of Marist Comprehensive Academy, Uturu.\nThey also robbed motorists and passengers who were en route to Port Harcourt from Enugu and from Okigwe town to Enugu, respectively.\nThe statement read, “Some students from Marist Comprehensive Academy, Uturu, Abia State were attacked by armed bandits around Ihube road in Okigwe LGA on their way from a Final Religious Profession of some Marist Brothers.\nThey had also in April kidnapped a catholic priest, Izuchukwu Onyeocha, who is a professor of Sociology at Imo state University in Owerri."
  },
  {
    "headline": "BBNaija6: Team Bitcoin wins $5000 worth of bitcoin in Patricia task",
    "summarized_story": "The Big Brother Naija Shine Ya Eye housemates participated in a challenge organised by Patricia and Team Bitcoin emerged victorious in the task.\nMembers of Team Bitcoin include Liquorose, Cross, Saskay, Queen, and Emmanuel and they won $5000 worth of bitcoin as their prize, as announced after their performance.\nPatricia task which took place on Saturday, day 56 of the show, involved several activities and the housemates were divided into two teams: Team Bitcoin and Team Ethereum.\nCrossword puzzles were the last and final round of the task as team members tried to form words.\nAccording to the announcement, Team Bitcoin emerged victorious as they had 70 points as their overall score."
  },
  {
    "headline": "BBNaija6: Team Bitcoin wins $5000 worth of bitcoin in Patricia task",
    "summarized_story": "The Big Brother Naija Shine Ya Eye housemates participated in a challenge organised by Patricia and Team Bitcoin emerged victorious in the task.\nMembers of Team Bitcoin include Liquorose, Cross, Saskay, Queen, and Emmanuel and they won $5000 worth of bitcoin as their prize, as announced after their performance.\nPatricia task which took place on Saturday, day 56 of the show, involved several activities and the housemates were divided into two teams: Team Bitcoin and Team Ethereum.\nCrossword puzzles were the last and final round of the task as team members tried to form words.\nAccording to the announcement, Team Bitcoin emerged victorious as they had 70 points as their overall score."
  },
  {
    "headline": "Breaking: Obadiah Mailafia, Buhari's critic dies likely of COVID-19",
    "summarized_story": "Obadiah Mailafia, a trenchant critic of Buhari administration and former Deputy Governor of the Central Bank of Nigeria (CBN), is dead.\nThe former CBN deputy governor said he had malaria and cattarh.\nMailafia worked at the African Development Bank (AFDB) and served as CBN deputy governor between 2005 and 2007.\nHis parents later transferred to Murya, Lafia, in Nasarawa State, where he grew up.\nMailafia got into the crosshairs of the DSS early in the year, when he alleged that a governor was the commander of Boko Haram."
  },
  {
    "headline": "I wanted to be a lawyer",
    "summarized_story": "Award-winning Nollywood actor, Lateef Adedimeji, has disclosed that his primary ambition was to become a lawyer before discovering his acting talent.\nHe said he found out that acting was his line when he joined an NGO that trained him in his early days.\n“I was lucky to be part of the trainees which passed information to people via dance, music and acting.\n“I always wanted to be a lawyer but I do a lot of silly things and people laugh.\nSo it was when I joined the NGO I found out that acting is my line,” he stated."
  },
  {
    "headline": "Gunmen Invade Political Meeting In Enugu, Says No Election On Biafra Land [VIDEO]",
    "summarized_story": "They were attacked, harassed, and groped on the grounds that they were attempting to “bring back Fulani” to Enugu West.\nVehicles and motorcycles were wrecked by the militants, who threatened to deal with anyone organizing a political rally on Biafra land, according to the 4:50 minute video.\nYou want to bring problem into Enugu West again.\nYou are the ones destroying Enugu West.\nWhen asked what should be their punishment if they tried to organise another political gathering, one of the men said, “kill me.”“We’ve stopped the campaign on Biafra land."
  },
  {
    "headline": "BREAKING: Former CBN Deputy Governor Obadiah Mailafia Dies At 64",
    "summarized_story": "Dr. Obadiah Mailafia, a former Deputy Governor of the Central Bank of Nigeria, died at the age of 64.\nMailafia, a columnist for The PUNCH, died after midnight following a brief illness, according to reports.\nThe former deputy governor, who was the African Democratic Congress’s presidential candidate in the 2019 election, was a well-known government critic who called for public-sector and exchange-rate changes.\nMailafia was born on December 24, 1956, in Kaduna State’s Sanga Local Government Area.\nregime when he claimed that a northern governor was a Boko Haram commander."
  },
  {
    "headline": "BREAKING: Gunmen Kill Three Policemen In Anambra, Set Patrol Van Ablaze",
    "summarized_story": "Three police officers were slain by gunmen in Onitsha, Anambra State, while two civilians were wounded in the attack.\nA source in Onitsha said the attack occurred at Ezeiweka road in the commercial city, and that a patrol van belonging to the police was also set ablaze by the attacking gunmen.\n“The policemen were at a checkpoint in the area, where they always station their vehicle at the junction on daily basis as one of the security posts, when the attack happened,” the source said.\nThe State Police Command’s spokesperson, DSP Toochukwu Ikenga confirmed the incident, saying that he would react after gathering information about how the attack happened."
  },
  {
    "headline": "Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, Hushpuppi",
    "summarized_story": "The Inspector-General of Police, Usman Alkali Baba, has queried the suspended commander of the IGP Intelligence Response Team (IRT), Abba Kyari, following an investigation into alleged infractions committed by the disgraced police officer.\nKyari had been accused by the US Federal Bureau of Investigation (FBI) of involvement in the fraudulent activities of suspected fraudster, Ramon Abbas, aka Hushpuppi.\nHe was indicted by a US court as a conspirator in a $1.1 million fraudulent deal against a Qatari businessperson by Hushpuppi.\nThe query was issued by the IGP based on the findings by the Special Investigation Panel (SIP), which investigated the alleged indictment of Kyari by the FBI.\n“The IGP has issued a query to Abba Kyari based on the findings of the panel."
  },
  {
    "headline": "RMAFC reveals factors that ‘ll determine proposed new revenue sharing formula",
    "summarized_story": "The Revenue Mobilisation Allocation and Fiscal Commission (RMAFC) has again reiterated that the proposed new revenue sharing formula will be fair, just, and equitable to the three tiers of government.\nThe RMAFC boss said revenue for the federal, state, and local governments as proposed by the commission is pegged at 52.6 per cent, 26.7 per cent, and 20.6 per cent respectively.\nAccording to MBA, the new revenue sharing formula is expected to be implemented by the end of 2021, before it would be submitted to President Muhammadu for onward transmission to the National Assembly.\nThe last revenue sharing formula was carried out 28 years ago.\nListed in the 1999 Constitution as one of the 14 Federal Executive Bodies, RMAFC was established to handle revenue allocation and fiscal matters on a continuous basis."
  },
  {
    "headline": "Irate youth attack Ngozi Okonjo-Iweala’s brother, kill one, set vehicles ablaze as monarch escapes death",
    "summarized_story": "The Obi of Ogwash-Uku, Ifechukwude Okonjo II, younger brother to Dr. Ngozi Okonjo-Iweala narrowly escaped death as irate youths of Otulu town attacked his convoy over fight for autonomous community.\nThe incident which took place on Friday at Otulu community under Ogwash-Uku kingdom in Aniocha south local government area of Delta state left one person dead while several others were injured.\nTwo vehicles were burnt while several vehicles were allegedly destroyed in the confusion even as the royal father and some of his chiefs narrowly escaped death.\nThis was said to have incensed the scene as the youths vented their anger on vehicles and those on the entourage.\nDSP Edafe said two vehicles were burnt, while a youth who was hit by stray bullet died."
  },
  {
    "headline": "JOHESU suspends nationwide strike, gives fresh ultimatum to FG",
    "summarized_story": "The Joint Health Sector Unions (JOHESU) has stepped down its proposed nationwide strike to commence scheduled to kickoff on Saturday September 18, 2021 following concrrns on the suffering of Nigerians.\nI“The emergency meeting of the expanded National Executive Council of the Joint Health Sector Unions (JOHESU) and Assembly of Healthcare Professional Associations (AHPA), took place today, Friday, 17th September, 2021.\nThe expanded NEC comprising of the Presidents and General Secretaries of affiliate unions and Professional Associations, NEC members of affiliate unions and JOHESU Chairmen and Secretaries at the State and Branch levels.\n“NEC-in-Session critically appraised the reports of JOHESU negotiation and conciliation meetings with Federal Government since the declaration of the trade dispute through the fifteen days strike notice issued on 2nd September, 2021.\n“Finally, NEC-in-Session unanimously adopts a resolution to step down the notice of strike action due to expire mid-night 17th September, 2021 and issue a fresh notice of fifteen days.”"
  },
  {
    "headline": "NAF hospital gets ISO 15189: 2012 accreditation Certificate -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) , said that the 661 Nigerian Air Force Hospital Laboratory (661 NAFH), Ikeja has again won the International Organization for Standardization (ISO) 15189:2012 accreditation certificate for quality management systems and excellent service delivery, for two consecutive times.\n“The facility was also the first in the entire military to key into ISO 15189 which, as we all know, is the hallmark of quality.\nThe accreditation also indicates that NAF is committed to doing the right thing even when no one is watching, this is commendable,” he said.\nIn his remarks, the CAS said that the NAF appreciates its collaboration with MLSCN especially in the standardization and improvement of NAF laboratories.\n“Very soon, the NAF School of Medical Sciences and Aviation Medicine will admit students for technician courses, including medical laboratory technicians."
  },
  {
    "headline": "JOHESU issues fresh strike notice, gives FG 15-day ultimatum to address demands -NigPilot",
    "summarized_story": "Joint Health Sector Unions, JOHESU , and the Assembly of Healthcare Professional Associations, AHPA, have issued a fresh notice of strike, with another 15-day ultimatum to the federal government to address their demands.\nIt could be recalled that JOHESU had, on September 2, given the federal government a 15-day ultimatum to address its demands.\nAfter deliberations, the federal government had reached an agreement with the unions, after a five-hour meeting on September 7.\nFollowing the expiration of the earlier ultimatum on Friday, JOHESU acting national secretary, Matthew O. Ajorutu, in a communique issued at the end of an expanded national executive council, NEC, emergency meeting, Friday, announced the fresh notice of strike.\nAjorutu said the fresh 15-day ultimatum commences on September 18, 2021, and urged the federal government to speed up efforts to address the demands of the health workers."
  },
  {
    "headline": "VAT war fueled by retrogressive politics – PGF DG -NigPilot",
    "summarized_story": "Lukman stated that if the reason behind the clamor for decentralized control of VAT collection is based on divisive, ethnocentric injustice, then it is retrogressive politics which is a complete departure from the progressive politics which the APC stands for.\nLukman boasted that the APC government led by president Muhammadu has tremendously increased VAT from N759.43 billion in 2015 to N1.531 trillion in 2020, an increase of more than hundred percent.\n“The reality however is that credit must go to the APC led federal government of President Buhari.\nBeing a leading member of PDP, what was responsible for the low VAT records in the country between 1999 and 2015?\nIt is not by accident that VAT collection in the country significantly increased under APC led federal government."
  },
  {
    "headline": "New speaker of Arewa Youth Assembly, Azare petitions DSS, Police, over impeached speaker on plot to attack federal govt institutions -NigPilot",
    "summarized_story": "Newly elected speaker of the Arewa Youth Assembly, Tahir Muhammad Azare has petitioned the president, the director-general of the State Security Service, SSS, and the Inspector General of Police over allegations that the impeached former speaker, Mohammed Salihu Danlami is still going about mobilising to cause mayhem at the headquarters of the Central Bank of Nigeria, CBN.\nIn a copy of the petition already submitted to the relevant institutions and seen by our reporter, Mr. Danlami is alleged to have been funded to mobilise to indefinitely disrupt all activities at the central bank with a goal to leading to a possible collapse of the Nigerian economy.\n“As a result, they are said to be planning to stage violent protests in Abuja to call attention to their unfounded statements about Mr. Emefiele and the Nigerian economy.\nTo achieve this, we further reliably learnt that some people will be moved into the nation’s capital to attack institutions such as the CBN building among others.”The petition called on security agencies to nip the situation in the bud.\n“We are by this letter calling on all relevant security agencies to nip this in the bud by calling Salihu Danlami for questioning with a view to identifying his sponsors and the extent of their plans to pull down the economy of the country,” the petition concluded."
  },
  {
    "headline": "BREAKING: Ex-CBN Deputy Governor, Mailafia Is Dead",
    "summarized_story": "A former Deputy Governor of the Central Bank of Nigeria, Dr. Obadiah Mailafia is dead.\nHe died at the age of 64.\nThe family lawyer, Mr Yakubu Bawa, who confirmed the news to Channels Television on Sunday morning said Dr Mailafia died in the early hours of the day at his residence in Jos, the Plateau State capital.\nRead Also: Angry Residents In Sokoto Community Set Ablaze Six Suspected BanditsAccording to Mr Bawa who is the Chairman of the Plateau State chapter of the Nigerian Bar Association, Dr. Mailafia’s death followed a brief illness.\nApart from working with the apex bank, Dr Mailafia was a renowned Public Affairs Analyst and he was the presidential candidate of the African Democratic Congress in the 2019 presidential election."
  },
  {
    "headline": "Angry Residents In Sokoto Community Set Ablaze Six Suspected Bandits",
    "summarized_story": "Some angry community members in Tangaza Local Government Area of Sokoto State have set ablaze six suspected armed bandits said to have been involved in an attack that took place on Friday.\nDuring the attack on Friday, the bandits were said to have killed two people and abducted four others.\nA source who pleaded anonymity told Channels Television in a telephone interview on Saturday that after the attack, members of the community chased the bandits and caught them in the nearby bushes.\nRead Also: 10 More Bethel Baptist Students Regain FreedomWhile the police were also on ground and planning to transport the suspects to the command headquarters in Sokoto, the angry community members overpowered them and forcefully snatched the suspects from the security personnel.\nThereafter, all the six bandits were set ablaze."
  },
  {
    "headline": "UPDATED: 10 More Bethel Baptist Students Regain Freedom",
    "summarized_story": "Ten more students abducted by bandits from the Bethel Baptist Secondary School in Kaduna State have been released.\nThe students regained their freedom on Saturday, after spending about 75 days in the custody of their abductors.\n21 Students In CaptivityA total of 121 students were forcefully taken away from their hostels when the school came under attack by the assailants.\nThereafter, 15 additional students regained freedom from the captivity of their abductors on August 22.\nMore students were later freed, and the release of the new batch of students on Saturday brings the total number of students who have regained freedom so far to 100."
  },
  {
    "headline": "Woman Who Gave Birth In Bandits’ Camp, 19 Other Victims Regain Freedom",
    "summarized_story": "At least 20 people abducted by bandits from Katoge village in Katsina State have regained their freedom.\nAmong those who spoke with reporters on Saturday at the Katsina Hajj Camp was a nursing mother, Sahura Haruna.\nHe explained that a jet of the Nigerian Air Force flew over the bandits’ camp on Friday night – a development that put the criminals in a panic state.\nFollowing their return, the Secretary to the Katsina State Government, Dr Mustapha Inuwa, handed them over to authorities of Batsari LGA.\nThe bandits later released the students in batches, but 21 others are still in the custody of the bandits."
  },
  {
    "headline": "Philippines’ Manny Pacquiao To Run For President In 2022",
    "summarized_story": "Philippine boxer-turned-politician Manny Pacquiao declared Sunday he will run for president in 2022, ending months of speculation about whether the legendary fighter would seek the country’s top job.\n“The time is now — we are ready to rise to the challenge of leadership,” said Pacquiao, as he accepted the nomination of a rival faction in President Rodrigo Duterte’s ruling party.\nHis boxing credentials along with fighting poverty and corruption are likely to be the key themes of his campaign.\n“For those asking what are my qualifications, have you ever experienced hunger?” Pacquiao asked the national assembly held by the anti-Duterte faction of PDP-Laban.\nThe Manny Pacquiao that is in front of you was moulded by poverty.”AFP"
  },
  {
    "headline": "Zamfara residents kick against extension of telecoms service suspension -",
    "summarized_story": "Residents of Zamfara state have expressed worry over the extension of the suspension of communication services in the state.\nThis follows the inability of the state and the federal governments to restore telecommunication services at the expiration of the two week suspension.\nZamfara state and the federal government through the Nigerian Communications commission NCC suspended telecommunication services in the state between third to seventeenth September 2021.\nBut some residents especially traders say the measure has pushed them into untold hardship as they have not been making sales.\nThey appealed to the authorities concerned to as a matter of urgency restore telecommunication services and open weekly markets in the state."
  },
  {
    "headline": "Adamawa SIEC shifts LG election to December 4 2021",
    "summarized_story": "Election of chairmen and councillors into the 21 local governments of Adamawa State has been shifted to December 4, 2021The election, initially scheduled for November 27, has been shifted forward by one week.\nThe Adamawa State Independent Electoral Commission (ADSIEC) announced the shift in a statement on Thursday.\n“The new date for the election has been scheduled for 04th December 2021 instead of 27th November 2021,” ADSIEC said in the statement.\n“At the meeting presided by ADSIEC Chairman, Mallam Isa Shettima, some crucial observations were made which neccesitated the shift of election date,” Zira stated.\nThe current chairmen and councillors were elected across Adamawa State on December 7, 2019."
  },
  {
    "headline": "Residents again Kill 7 Bandits in Tangaza, Sokoto State",
    "summarized_story": "Residents in Tangaza local government area of the northern Senatorial District of Sokoto state have again killed seven members of the suspected marauding bandits that earlier attacked the village and killing 2 persons and abducting another 4.\nThe source said the people later overpowered the security forces in the local council and lynched the suspected bandits in the process setting them ablaze.\nTangaza local government area has in the past experienced pockets of violence from the activities of armed bandits.\nIn one of the attacks by suspected bandits, the Divisional Police Officer of Tangaza was killed and two married women were abducted.\nSokoto state police command Public Relations Officer, Assistant Superintendent of Police Sanusi Abubakar had earlier confirmed the killing of six bandits in Tangaza, but was not available to confirm the killing of additional the 7 suspected bandit"
  },
  {
    "headline": "Italy-bound lady, pregnant woman, fake soldier arrested for drug trafficking -",
    "summarized_story": "In the same vein, efforts by desperate traffickers to export varying sizes of consignments containing cocaine, heroin and other illicit drugs through courier firms were also foiled.\nCuriously, a 38-year-old pregnant woman, Kate Ngozi Nwuju was arrested on Tuesday 14th Sept at her residence in Rumueme, Mile 4 area of Port Harcourt, Rivers state with 4.5kilograms of cannabis following intelligence that she sells drugs.\nAlso, one Aliyu Saidu, suspected to be a fake soldier was arrested with 2.3kg of Cannabis Sativa in a commercial bus from Lagos to Makurdi, on Monday 13th of Sept at Aliade checkpoint, Benue State.\nThree female and a male suspects were also arrested in raids across Owan East and Akoko Edo areas of the state.\nDifferent quantities of cannabis and local mixtures called monkey tail were recovered from them."
  },
  {
    "headline": "Nigeria: Former CBN Deputy Governor Mailafia Is Dead",
    "summarized_story": "A former Deputy Governor of Nigeria’s Central Bank, Dr. Obadiah Mailafia is dead.\nPresident of the Southern Kaduna People’s Union (SOKAPU) Jonathan Asake confirmed his death to ARISE News.\n“It’s true, he is dead and I am on my way to his house for visitation,” Mr Asake said on the phone.\nReports suggest Mailafia who hails from Southern Kaduna died aged 56 after protracted illness.\nDetails Later…"
  },
  {
    "headline": "Not Yet Time to Fully Relocate Refugees in Nigeria’s North East, insists UNHCR",
    "summarized_story": "The United Nations High Commissioner for Refugees (UNHCR) has said the time to fully relocate refugees and internally displaced persons (IDPs) back to their homeland in Borno State and the rest of the North East is not now going by the pockets of insurgency in the area.\nHe disclosed that in Borno, he discussed with the authorities, the traumatic IDPs situation and the return of refugees from Cameroon and other countries.\nMazou disclosed that there were 170,000 Nigerian refugees in Niger, and about 16,000 Nigerian refugees in Chad.\nHe however said the voluntary return of the refugees was depended on the conditions in Borno State, the epicentre of the Boko Haram crisis.\nHe disclosed that presently the UNHCR is engaging the Federal Government and the Borno State Government regarding the situation in Borno State."
  },
  {
    "headline": "Australia Says It Was ‘Upfront’ with France Over Submarine Deal as Crisis Continues",
    "summarized_story": "Australia was “upfront, open and honest” with France about its concerns over a deal for French submarines, its defence minister said on Sunday, as a new deal with the United States and Britain continued to fuel a multinational diplomatic crisis.\nThe move infuriated France, a NATO ally of the United States and Britain, prompting it to recall its ambassadors from Washington and Canberra, and riled China, the major rising power in the Indo-Pacific region.\nParis has called the cancellation a stab in the back, with Foreign Minister Jean-Yves Le Drian saying relations with the United States and Australia were in a “crisis”.\nFinance Minister Simon Birmingham said Australia had informed France of the deal but acknowledged on Sunday the negotiations had been secret, given the “enormous sensitivities”.\nDutton and Birmingham declined to reveal costs of the new pact, although Dutton said “it’s not going to be a cheap project”."
  },
  {
    "headline": "Apology Not Enough, Say Survivors of US Drone Attack in Kabul",
    "summarized_story": "A day after the United States military admitted that a drone attack in Afghanistan’s capital last month mistakenly killed 10 members of a family, including seven children, survivors have said Washington’s apology was not enough.\nAl Jazeera’s Osama Bin Javaid, who visited the site of the attack, said memorabilia of the children, including their toys, could be seen scattered.\nThey want justice for their family members and if possible those who have remained in this compound want to leave Afghanistan,” he said.\nA day after the attack, family members told Al Jazeera that the 10 people killed ranged in age from two to 40 years old.\nMcKenzie’s admission is a significant departure from the Department of Defense’s previous statements about the drone attack."
  },
  {
    "headline": "Mane Scores 100th Goal in Liverpool Win – Arise News",
    "summarized_story": "Liverpool remain unbeaten in the Premier League this season after Sadio Mane scored his 100th goal for the club in a victory against Crystal Palace.\nJurgen Klopp’s side created numerous chances against a resilient Palace before Mane pounced on a rebound at the back post in the first half.\nAnd it means they go top of the table with four wins from their opening five games, while visitors Palace remain outside the top 10.\nIt took his total to 13 against Palace in the Premier League – the most anyone has scored against them – and was the perfect way to notch up his 100th goal in all competitions for Liverpool.\nPalace had attacking threat of their own from Wilfried Zaha – making his 250th Premier League appearance – but he was dealt with by the physicality of Fabinho and debutant Ibrahima Konate."
  }
]