[
  {
    "headline": "Insecurity: FG should deploy drones, says security expert, Stan-Lebo",
    "summarized_story": "Former Army Intelligence Officer and security expert, Colonel Hassan Stan-Labo (rtd), has urged the Federal Government to deploy drones in the fight against insecurity in the country.\nThis is as he lamented that technology is not playing the needed role in the fight against insecurity especially in the North-East which is the worst-hit region.\nToday we have fantastic drones in the market that will carry out surveillance capabilities,” he said.\nBy now we should be engaging drones.”The security expert called for more lucrative salaries and welfare packages for servicemen, saying such would boost their morale.\n“Why are we still delaying whatever we need to do concerning the enhancement of manpower within the security sector?"
  },
  {
    "headline": "El-Rufai to spend N6bn on Kaduna general hospitals in 2022",
    "summarized_story": "Governor of Kaduna State, Nasir El-Rufai’s has earmarked N6 billion for upgrading and equipping general hospitals across Kaduna in the year 2022.\nThis was reflected in the 2022 budget of N278.6 billion signedinto law by the governor in December.\nThe Kaduna government also allocated N51.6 million to construct and renovate the standard Accident and Emergency Unit of the Kafanchan, Saminaka, Birnin Gwari and Hajiya Gambo Sawaba General Hospitals.\nIn the document, Barau Dikko Teaching Hospital got N4.3 billion, of which N1.7 billion was earmarked for capital expenditure and N2.6 billion for recurrent.\nSimilarly, the state government earmarked N661.3 million in 2022 for the College of Nursing and Midwifery, N269.4 million for capital projects, and N391.9 million for recurrent expenditure."
  },
  {
    "headline": "Electoral Act: Ask NASS to override Buhari — Aniagwu tells Nigerians",
    "summarized_story": "Aniagwu who spoke on African Independent Television, AIT, a live programme monitored by our Correspondent on Tuesday evening, told Nigerians to prevail on the National Assembly on the Electoral Act Amendment Bill.\nAniagwu said: “From the way we operate at the moment, it is possible for somebody to vote in Ekiti state and also move to Osun to vote in the direct primaries because the data is not there as it should.\n“So if indeed we need to have direct primaries which am not against, we need to first of all clean up the system.\nHe commended the Independent National Electoral Commission, INEC for the introduction of the Bimodal Voters Verification and Accreditation System (BVAS) which, according to him, had reduced thuggery, violence, ballot box snatching among other rigging practices.\nHe said: “The law is very clear if the President decides to veto a bill sent to him by the National Assembly after 30days NASS is free to recall that Bill and override his veto."
  },
  {
    "headline": "Research sector: Labour urges FG to end 11-week strike",
    "summarized_story": "By Victor Ahiuma-YoungOrganised Labour has pleaded with the Federal Government to find solutions to crisis in the research institutes and end the over 11-week industrial unrest in the sector.\nSpeaking to Vanguard, President of NASU, Dr. Makolo Hassan, lamented that “the research institutes’ sector is not immune to the industrial relations crisis in the public sector.\nPublic libraries offer services and products that level the intellectual playing fields.\nMoreover, public libraries provide a conducive environment for reading.\n“Unfortunately, State governments have neglected public libraries in the states through lack of adequate funding."
  },
  {
    "headline": "2023: Ndigbo must connect to politics at centre to realize President of Igbo extraction — Fmr Ebonyi PDP Chair",
    "summarized_story": "By Peter Okutu, AbakalikiTHE former State Chairman of the Peoples Democratic Party, PDP in Ebonyi State, Barr.\nOnyekachi Nwebonyi, Wednesday stated that Ndigbo must connect to the politics at the Centre to be able to realize their aspiration of producing the next Nigerian President of Igbo extraction.\nThe Ebonyi Commissioner who further added that Governor David Umahi was suitably qualified to run for the position of the President added that the Governor would bring about infrastructural development of the country if given the opportunity.\n“I want to advise beneficiaries to make judicious use of every opportunity that I have provided for them.\nBut, I discovered that there is a gap between the leaders and the led particularly the youths who are idle."
  },
  {
    "headline": "Elusive nation Nigeria: Christmas celebration by Shiite in Zaria commendable",
    "summarized_story": "In such times, the Igbo man would easily welcome his Hausa neighbour to share moments of sporting bliss.\nThis, perhaps, has accounted for seemingly rare moments of immense show of camaraderie between people with differing religious, political and ethnic affiliations.\nRecently, during the celebration of Christmas at a church in Zaria, Kaduna State, members of the renowned Shiite group attended and fellowshipped with Christians, and also presented gifts as a sign of love and solidarity.\nThere is hope for the nationThe inherent challenges in nation-building from multiple ethnic groups is one which most African nations such as Nigeria face today.\nThere is no doubt that the nation is plagued by a myriad of security challenges which has affected virtually every region."
  },
  {
    "headline": "FG planning to eliminate me — Igboho",
    "summarized_story": "By Sola Isola, IbadanYoruba nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, has alleged a plot by the Federal government of Nigeria to eliminate him in the Benin Republic.\nRecall that Igboho, 49, was arrested by operatives of Brigade Criminelle (Criminal Brigade) on July 19 in Cotonou.\nOlayomi Koiki, spokesman of Igboho, in a podcast on Tuesday evening, alleged that the Benin Republic President Patrice Talon was working with the Federal Government to extradite Igboho to Nigeria.\nAlso Read:“The enemies are trying to eliminate him (Igboho).\n“If you think the legal route is what will set Igboho free, then we are wasting our time."
  },
  {
    "headline": "Buhari’s spokesman, Garba Shehu gives update after testing positive for COVID-19",
    "summarized_story": "The Senior Special Assistant to President Muhammadu Buhari on Media and Publicity, Garba Shehu says he has recovered from COVID-19 infection.\nDAILY POST had reported that the presidential spokesman on Saturday, revealed that he tested positive for the virus.\nIn an update on his verified Facebook page on Wednesday, Mr Garba thanked “Almighty Allah for my speedy recovery” from the coronavirus.\nHe expressed gratitude to those who prayed and reached out to him when his COVID-19 status was disclosed in the media.\nThe post reads, “I thank Almighty Allah for my speedy recovery from COVID-19."
  },
  {
    "headline": "NAFDAC to reduce drugs importation to 30 percent by 2025 – DG",
    "summarized_story": "The National Agency for Food and Drug Administration and Control (NAFDAC) says it is working on reducing importation of drugs from its present 70 per cent to 30 per cent by 2025.\nNAFDAC Director-General, Prof. Mojisola Adeyeye, told the News Agency of Nigeria (NAN) on Wednesday in Lagos that this could be achieved through increased local manufacturing of drugs.\nAdeyeye said that increasing local drug manufacturing would help curb prevalence substandard drugs and ensure drug security in the country.\n“When I started my tenure, local manufacturing of medicine became my focus because when you increase local manufacturing you are not just giving more jobs or increasing the GDP.\n“So, we want to change the 70 per cent importation of drugs into the country to 30 per cent by 2025, so that as a nation we can say we have drug security because we don’t have that now."
  },
  {
    "headline": "Buhari govt planning to eliminate me, I can’t be freed legally – Sunday Igboho claims",
    "summarized_story": "Yoruba nation agitator, Sunday Igboho has accused the Nigerian Government of attempting to eliminate him in Benin Republic.\nIgboho explained that the Nigerian Government was planning to eliminate him to silence the Yoruba Nation agitation.\nHe said: “The enemies are trying to eliminate Igboho.\nHe lamented that diplomatic approach has failed, adding that the Benin Republic President, Talon has refused to set Igboho free.\nFrom issuing an ultimatum to Fulani herders in the Southwest, Igboho delved into agitation for Yoruba Nation."
  },
  {
    "headline": "Ishaku warns contractors against delay, threatens revocation",
    "summarized_story": "Contractors handling various projects in Taraba State have been urged to sit up or have their contracts revoked.\nThis was the directive of the State Governor, Arc.\nDarius Dickson Ishaku, who on Tuesday took his time to commission some projects not executed by him but by individuals in Kurmi Local Government Council of the State.\nIshaku, who also spoke on the ongoing marraraba /Baissa road project, said all the needed funds to complete the project have been set aside by his administration.\nThough works, as noticed by DAILY POST, are still ongoing on the road, the governor has set aside the second quarter of next year for the commissioning."
  },
  {
    "headline": "Niger boat mishap: NSEMA reveals how seven persons died, 2 survived",
    "summarized_story": "The Niger State Emergency Management Agency (NSEMA) on Wednesday, revealed that two persons, including a driver and a lady survived the boat mishap that occurred on Sunday at Zhigiri village, Shiroro Local Government Area of the State.\nDAILY POST had reported that a family of three lost their lives in the unfortunate mishap which occurred on Sunday.\nThe NSEMA boss said that the passengers of the boat were nine and they took off from Zhijigiri village to Dnaweto village, saying seven persons died in the unfortunate accident.\nHe said that the boat sailed on the water from the ongoing construction of the Zungeru hydro electric power dam.\nAccording to him, the body of the seven deceased passengers have been recovered and buried."
  },
  {
    "headline": "Garba Shehu: I’ve recovered from COVID-19",
    "summarized_story": "Senior Special Assistant to the President on Media and Publicity, Garba Shehu, on Wednesday said he has recovered from COVID-19.\nHe was among presidential aides who tested positive for coronavirus last week.\nShehu said in a post on his Facebook page: “I thank Almighty Allah for my speedy recovery from COVID-19.\n“My prayers and deepest respect are for all of you who prayed, called or texted expressing your concerns for me.\n- Advertisement -“May all of our countrymen and women still afflicted with the virus fight this scourge with all their might and get well soon.”"
  },
  {
    "headline": "Nwosu: I was accused of supplying arms to militants, causing insecurity in Imo",
    "summarized_story": "Nwosu was arrested during an outing service in honour of his late mother, Jemamah Nwosu, at St. Peter’s Anglican Church, Eziama-Obaire in Nkwerre Local Government Area of Imo State.\n- Advertisement -The incident led to a verbal altercation between the Senator representing Imo West in the National Assembly, Owelle Rochas Okorocha, and the Imo State Government.\nHe said: “They accused me of sponsoring insecurity in Imo state.\n“What is happening in Imo state is really unfortunate and the state is becoming a banana republic and everybody appears to be living in fear.\nOkorocha insisted that those that perpetrated the act were from the Imo State Government House."
  },
  {
    "headline": "18 years after, P-Square takes stock",
    "summarized_story": "Nigerian twin superstars, Peter and Paul Okoye aka P-Square have spoken about their impact in the African music space and the current global acceptance it enjoys.\nThe duo, which consist of Mr P and Rudeboy, at the peak of their career, had done collaborations with American stars such as Rickross and Akon among others.\nMr P, during a radio tour, said “We are proud of the industry, I will look at the concert, and not just the P-Square concert.\nI see it as an industry concert because it’s not just us, it’s a blend of all.\nSo, I just feel like it’s the industry concert not just P-Square because we did the concert with legends, people that were not even born when we started, It was an emotional rollercoaster for many."
  },
  {
    "headline": "JUST IN: Abductors of Plateau monarch demand N50m ransom",
    "summarized_story": "The abductors of the paramount ruler of Pyem Chiefdom, Charles Mato Dakat, have demanded N50million ransom to free him.\nA source in the traditional council, who pleaded not to be named, said the abductors spoke with some members through the monarch’s phone.\nIt was the paramount ruler who first called and spoke to us.\n“They told us that the paramount ruler is being treated well and is okay, and that they don’t have the intention of harming him.\nThe paramount ruler was abducted from his Palace in the earlier hours of Boxing Day by gunmen suspected to be bandits."
  },
  {
    "headline": "2021: Succession game ahead of next general elections",
    "summarized_story": "The succession games in the ruling All Progressives Congress (APC) and the opposition Peoples’ Democratic Party (PDP) shaped the polity in the outgoing year.\nThe ruling party was a beneficiary of such defections during the year, particularly from the main opposition party, the Peoples’ Democratic Party (PDP); as there have been some high-profile defections into the party.\nThey had been seeking to rebuild the party to regain power during the next general elections.\nThe ruling APC has not been able to find a solution to the insecurity in various parts of the country.\nOnochie is a card-carrying member of the ruling party."
  },
  {
    "headline": "Amaechi misleading Nigerians on money left behind by Jonathan –Chidoka",
    "summarized_story": "“Furthermore, the Jonathan administration left a total of $2.2 billion in the Excess Crude Account on May 29, 2015.\n“The Jonathan administration handed over a $550 billion economy (largest in Africa and 26th globally) and a diversified economy.\nOn May 29, 2015, President Jonathan left behind an economy with a stable currency, where the Naira exchanged for N199 to $1, and Nigeria had a single-digit inflation rate.\n“Under President Jonathan, the unemployment rate stood at 7.5 per cent (better than European Union) today.\n“2,406 days after, a clear 557 days (One year five months) more than President Jonathan governed Nigeria; this administration’s economic policies and heightened insecurity have left the country comatose."
  },
  {
    "headline": "Obasanjo hits Edwin Clark, insists oil belongs to Nigeria",
    "summarized_story": "From Laide Raheem, AbeokutaFormer president, Olusegun Obasanjo, yesterday, knocked leader of the Ijaw nation, Chief Edwin Clark, over his recent claim that oil in the Niger Delta belongs to the region.\nHowever, Obasanjo said the provision did not imply that resources found in any region belongs to the people there.\n“My dear chief, where in this constitutional provision is it said or implied that minerals located in any part of Nigeria belongs to that location?\nI have never shown any anger or distraught with Nigeria Delta Region nor with any part or Region of Nigeria Rather, I have always picked points on leadership performance or policies and I will continue to do so.\n“My records before, during and after the civil war in Nigeria Delta Region was without blemish and it was all goodwill to all the people of Nigeria and especially the people of the Niger Delta Region which was my theatre of operation during the Nigerian civil war."
  },
  {
    "headline": "Onpetu stool: High Court deposes Ogbomoso monarch",
    "summarized_story": "From Oluseye Ojo, IbadanControversy is currently trailing a judgment delivered by an Oyo State High Court in Ogbomoso, over the deposition of the occupant of the stool of Onpetu of Ijeru Kingdom, Oba Sunday Oladapo Oyediran Lagbami Osekun III, in Ogbomoso South Local Government of the State.\nThe Oyo State High Court, in the recent judgment, delivered in November 2021, but was obtained this week, ordered the monarch to, henceforth, stop parading himself as the paramount ruler of Ijeru Quarters, Ogbomoso.\nThe judgment followed a litigation instituted by Chief Popoola Olaniyi Elijah against Chief Oladapo, the Oyo State governor, and the Attorney General and Commissioner for Justice of Oyo State over the chieftaincy stool of Ijeru.\nThe chieftaincy stool of Ijeru had been a contention between the Ijeru and Onpetu Chieftaincy families of Ogbomoso for some decades.\nThe second and third defendants are, hereby, directed to recognise the claimant as the ruler of Ijeru Quarters, Ogbomoso.”The first defendant is perpetually restrained from parading himself or claiming or putting himself out as the paramount ruler of Ijeru Quarters, Ogbomoso township, Oyo State.”"
  },
  {
    "headline": "Bayelsa spill: Experts insist wellhead leak impossible without interference",
    "summarized_story": "The wing valve is a piece of flow-control equipment used in oil and gas operations and is part of a Christmas tree used to shut in flow from an oil well.\nWhere the spill came out from is from the wing valve.\n“The wing valve has been replaced now.\nSo, when the reservoir pressure is determined, the pressure that is going into the design for the well must be able to withstand the reservoir pressure.\n“There’s no way you have a reservoir pressure of 5,000 PSI and you design an equipment of 2,000 PSI."
  },
  {
    "headline": "Why Buhari withheld assent from electoral amendment act bill –Presidency",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidency, yesterday, gave reasons President Muhammadu Buhari withheld assent from Electoral Act Amendment Bill.\n“The president’s decision to withhold assent from the Electoral Act (Amendment) Bill 2021 has come under scrutiny from media and political circles.\n“It is this act which the new bill seeks to amend.\nOnly the richest of political parties.\n“Until then, the president will do whatever he can to protect this county’s democracy, and that includes withholding assent from this bill."
  },
  {
    "headline": "Obasanjo to Clark: Oil Belongs to Nigeria, Not Niger Delta",
    "summarized_story": "“All those who purchase crude oil from Nigeria enter into contractual relationship with Nigeria not with the Niger Delta.\nClark had in a protest letter alleged that for openly rebuking those advocating resource control for the Niger Delta at a public forum in Abuja, Obasanjo showed open hatred for the region.\nThe former president said all those, who purchased crude oil from Nigeria entered into contractual relationship with the country, and not the Niger Delta, affirming that the territory of Nigeria remains indivisible, inclusive of the resources found therein.\n“All those who purchase crude oil from Nigeria enter into contractual relationship with Nigeria not with the Niger Delta.\nObasanjo stated that on resumption of office as president of Nigeria in 1999, the first meeting he held out of Abuja was on the Niger Delta."
  },
  {
    "headline": "N’Assembly Transmits 2022 Appropriation Bill to Buhari",
    "summarized_story": "•Budget to be assented FridayDeji Elumoye in AbujaPresident Muhammadu Buhari has received the 2022 Appropriation Bill passed by the two chambers of the National Assembly last week.\nAnd all things being equal, Buhari is expected to sign the 2022 budget into law on Friday.\nThe 2022 Appropriation Bill was transmitted to the president last Friday by Clerk of the National Assembly, Ojo Amos, and it was acknowledged by the Office of the Chief of Staff to the President on Saturday.\nThe transmission letter, referenced NASS/CNA/37/Vol.1/35, addressed to President and Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria, and titled, “Appropriation Bill, 2022,” read, “In consonance with the Provisions of the Acts Authentication Act Cap.\nA2, Laws of the Federation of Nigeria, 2004, I wish, with due respect, to forward to Your Excellency, the authenticated copies of Appropriation Bill, 2022, for your consideration and assent."
  },
  {
    "headline": "Bayelsa Spill: Abrupt Wellhead Leak Impossible Without Interference, Experts Insist",
    "summarized_story": "The wing valve is a piece of flow-control equipment used in oil and gas operations and is part of a Christmas tree used to shut in flow from an oil well.\nWhere the spill came out from is from the wing valve.\n“The wing valve has been replaced now.\nSo, when the reservoir pressure is determined, the pressure that is going into the design for the well must be able to withstand the reservoir pressure.\n“There’s no way you have a reservoir pressure of 5,000 PSI and you design an equipment of 2000 PSI."
  },
  {
    "headline": "Obasanjo Replies Clark, Says Oil in Niger Delta Belongs to Nigeria",
    "summarized_story": "James Sowole in AbeokutaThe former President of Nigeria, Chief Olusegun Obasanjo Tuesday said that he never hated the Niger Delta Region contrary to the accusation of Chief Edwin Clark against him sequel to Obasanjo’s position on oil in the Niger Delta Region.\nClark, had accused Obasanjo of holding a deep seated disdain for the people of the oil producing region based on the former President’s assertion that oil found in the Niger Delta belong to Nigeria and not the region.\nHowever, in his open released Tuesday, Obasanjo insisted that he had never hated Niger Delta while reiterating his stance that oil found in the region belonged to the Nigerian federation.\nObasanjo said, “For me personally, I have never shown any anger or distraught with Nigeria nor with any part or region of Nigeria.\nI will rather pick points on leadership or policies and I will continue to do so.”The former president said that his records before and after the civil war in Niger Delta Region was without blemish and it was all goodness and goodwill to all the people of Nigeria and Niger Delta."
  },
  {
    "headline": "Buhari Gets 2022 Appropriation Bill from N’Assembly",
    "summarized_story": "To sign bill into law FridayDeji Elumoye in AbujaPresident Muhammadu Buhari has received the 2022 Appropriation Bill passed by the two chambers of the National Assembly last week.\nHe is therefore expected to sign the 2022 budget into law on Friday.\nThe 2022 Appropriation Bill was transmitted last Friday by the Clerk to the National Assembly,The transmission letter, with Reference Number NASS/CNA/37/Vol.1/35, addressed to the President and Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria and titled ‘APPROPRIATION BILL, 2022.’ read, “In consonance with the Provisions of the Acts Authentication Act Cap.\nA2, Laws of the Federation of Nigeria, 2004, I wish, with due respect, to forward to Your Excellency, the authenticated copies of Appropriation Bill, 2022, for your consideration and assent.\nHe responded to prodding via WhatsApp message: “Yes, it’s true the President will sign the 2022 budget by Friday”."
  },
  {
    "headline": "EXCLUSIVE: How Code Of Conduct Tribunal Engaged In N516million Illegal Contracts, Projects Without Documents – Audit Report",
    "summarized_story": "The Office of the Auditor-General of the Federation has sent queries to the Code of Conduct Tribunal in Abuja over the alleged award of illegal contracts and projects without documents totalling over N516million.\nThe audit report is titled, “Auditor-General for the Federation’s Annual Report on Non-Compliance/Internal Control Weaknesses Issues in Ministries, Departments and Agencies of the Federal Government of Nigeria for the Year Ended 31st December, 2019.”It partly reads, “CODE OF CONDUCT TRIBUNAL - At the Code of Conduct Tribunal (CCT), the following observations were made; i.\nThe Tribunal has fifteen (15) Motor Vehicles which were acquired between 2008 and 2018 for amounts totalling N1,029,269.22.\n“ISSUE 2: PAYMENTS FOR CAPITAL PROJECTS WITHOUT SUPPORTING DOCUMENTS (=N434,500,000.00) Audit observed that: i.\n“Recommendations; The Chief Registrar is requested to: i. Furnish reasons why payments for capital projects were made without supporting documents as required by extant regulations."
  },
  {
    "headline": "EXCLUSIVE: How Code Of Conduct Tribunal Engaged In N516million Illegal Contracts, Projects Without Documents – Audit Report",
    "summarized_story": "The Office of the Auditor-General of the Federation has sent queries to the Code of Conduct Tribunal in Abuja over the alleged award of illegal contracts and projects without documents totalling over N516million.\nThe audit report is titled, “Auditor-General for the Federation’s Annual Report on Non-Compliance/Internal Control Weaknesses Issues in Ministries, Departments and Agencies of the Federal Government of Nigeria for the Year Ended 31st December, 2019.”It partly reads, “CODE OF CONDUCT TRIBUNAL - At the Code of Conduct Tribunal (CCT), the following observations were made; i.\nThe Tribunal has fifteen (15) Motor Vehicles which were acquired between 2008 and 2018 for amounts totalling N1,029,269.22.\n“ISSUE 2: PAYMENTS FOR CAPITAL PROJECTS WITHOUT SUPPORTING DOCUMENTS (=N434,500,000.00) Audit observed that: i.\n“Recommendations; The Chief Registrar is requested to: i. Furnish reasons why payments for capital projects were made without supporting documents as required by extant regulations."
  },
  {
    "headline": "How Abuja Policemen Extorted N500,000 From Motivational Speaker After Labelling Him IPOB Member",
    "summarized_story": "A life coach and motivational speaker, Solomon Buchi, has narrated how men of the Federal Capital Territory Police Command extorted N500,000 from him.\nIn a Twitter post on Tuesday night, the relationship coach said he and his younger brother were assaulted and treated like criminals by the policemen.\nHe added that they were labelled as members of the Indigenous People of Biafra (IPOB).\nBuchi said, “I and my kid brother were kidnapped by the police in Abuja around Wuse 2 couple hours ago, after eating.\n“Long story short, they took our ATMs and withdrew N500,000 out of N617,000 that I had in my account."
  },
  {
    "headline": "How Abuja Policemen Extorted N500,000 From Motivational Speaker After Labelling Him IPOB Member",
    "summarized_story": "A life coach and motivational speaker, Solomon Buchi, has narrated how men of the Federal Capital Territory Police Command extorted N500,000 from him.\nIn a Twitter post on Tuesday night, the relationship coach said he and his younger brother were assaulted and treated like criminals by the policemen.\nHe added that they were labelled as members of the Indigenous People of Biafra (IPOB).\nBuchi said, “I and my kid brother were kidnapped by the police in Abuja around Wuse 2 couple hours ago, after eating.\n“Long story short, they took our ATMs and withdrew N500,000 out of N617,000 that I had in my account."
  },
  {
    "headline": "How Nigerian Army Invaded Enugu Churches, Disrupted Christmas Eve Services, Killed Two – Intersociety",
    "summarized_story": "According to the report sent to SaharaReporters on Wednesday, the group revealed that the soldiers during an operation on December 24, 2021, invaded some churches in the community and disrupted their Christmas Eve services.\nThe soldiers also shot and killed a yet-to-be middle-age man whose corpse was dumped at Obodo Nnemede Nwannaji near Onokolo Ode in the Community.\nBlessing Nnaji (nee Nnaji) from Ogonogo-Eji Ndiagu Akpugo Autonomous Community in Nkanu West Local Government Area of Enugu State.\nTherefore, the claims by the Nigerian Army highlighted above are circumstantially fallacious and trademark of the Nigerian security forces particularly the Nigerian Army with which they have framed, abducted and killed hundreds of defenceless and unarmed citizens of Southeast and South-south Nigeria especially between October 2020 and December 2021.\nThe Nigerian Army must also let the affected communities particularly Egudene-Ekpofu be and discontinue all forms of siege and associated brutalisation and riotous brigandage in the area.”"
  },
  {
    "headline": "Obasanjo to Edwin Clark: Oil belongs to Nigeria -- NOT Niger Delta",
    "summarized_story": "Former President Olusegun Obasanjo says the crude oil in the Niger Delta region belongs to Nigeria.\nIn a letter on Tuesday and addressed to Edwin Clark, Ijaw leader, Obasanjo said tribal allegiance must be suppressed for a state to emerge.\nClark had reportedly said Obasanjo’s “hatred against the Niger Delta people is disappointing”.\nAll those who purchase crude oil from Nigeria enter into contractual relationships with Nigeria not with the Niger Delta.\nAnd until the state emerges, Nigeria will not make the desired progress as tribesmen will always sacrifice state for tribe."
  },
  {
    "headline": "Obasanjo to Edwin Clark: Oil belongs to Nigeria -- NOT Niger Delta",
    "summarized_story": "Former President Olusegun Obasanjo says the crude oil in the Niger Delta region belongs to Nigeria.\nIn a letter on Tuesday and addressed to Edwin Clark, Ijaw leader, Obasanjo said tribal allegiance must be suppressed for a state to emerge.\nClark had reportedly said Obasanjo’s “hatred against the Niger Delta people is disappointing”.\nAll those who purchase crude oil from Nigeria enter into contractual relationships with Nigeria not with the Niger Delta.\nAnd until the state emerges, Nigeria will not make the desired progress as tribesmen will always sacrifice state for tribe."
  },
  {
    "headline": "'Illegal' Ikoyi weddings, COVID electric bulbs... how fake news shaped events in 2021",
    "summarized_story": "AdvertisementAs soon as such misleading content pierces through the walls of social media, it enjoys wide circulation and begins to look like facts.\nThe minister further claimed that the social media platform funded #EndSARS protesters during the demonstrations against police brutality in 2020.\nTheCable analysed the pictures shared by the former aviation minister and findings revealed that they were old pictures of other events, some of which did not happen in Nigeria.\nHowever, some social media users claimed that the pictures posted by the DSS were old images uploaded on Facebook in 2013.\nThe report credited to the newspaper was widely publicised on social media platforms and instant messengers."
  },
  {
    "headline": "'Illegal' Ikoyi weddings, COVID electric bulbs... how fake news shaped events in 2021",
    "summarized_story": "AdvertisementAs soon as such misleading content pierces through the walls of social media, it enjoys wide circulation and begins to look like facts.\nThe minister further claimed that the social media platform funded #EndSARS protesters during the demonstrations against police brutality in 2020.\nTheCable analysed the pictures shared by the former aviation minister and findings revealed that they were old pictures of other events, some of which did not happen in Nigeria.\nHowever, some social media users claimed that the pictures posted by the DSS were old images uploaded on Facebook in 2013.\nThe report credited to the newspaper was widely publicised on social media platforms and instant messengers."
  },
  {
    "headline": "REWIND: In 2020, supreme court judge said verdict on Imo guber would haunt Nigeria",
    "summarized_story": "Dissatisfied with the decision of the apex court, Ihedioha had filed an application asking the same court to review its decision and set it aside.\n“The finality of the supreme court is entrenched in the constitution.\n“The finality of the supreme court in civil cases is final.”AdvertisementHowever, Chima Nweze, one of the judges, disagreed with the ruling.\n“This decision of the supreme court will continue to haunt our electoral jurisprudence for a long time to come,” he said.\nAdvertisement“In my intimate reading of the January 14 judgment, the substance of Ihedioha’s matter was lost to time frame."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "GetEquity is changing startup investment in Africa. But how?",
    "summarized_story": "GetEquity, a Nigeria-based investment platform, came into the market with the mantra of “challenging the status quo of startup financing and venture capital” in Africa.\nInitially, the co-founders didn’t set out to democratise startup investment in Africa.\nOn GetEquity, startups get instant access to several angel investors, syndicates and institutional investors.\nApparently, GetEquity operates like every other VC: its team of diverse backgrounds—law, marketing, investment, business development—analyse the potential growth of a startup before onboarding them on their platform.\nIf that’s the case, one can chose to question the validity of the disruption the company promises to bring into startup investment."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "West African e-commerce platforms take local fashion makers global",
    "summarized_story": "The sheer size of the African Diaspora means there’s a large potential market for African fashion collections outside the continent.\nWhile in Paris, he discovered that the Africans he came across abroad were mostly interested in African fashion items but could not readily access them.\nThe company also recently launched ANKA, a SaaS e-commerce solution for African fashion designers and merchants, offering a single dashboard to manage multiple sales channels, inventory, and payments.\nPhoto credit: UmaiziWhether curators like Afrikrea or single-brand sites such as Ghana’s KIKI Clothing, platforms for African fashion tap into a growing global demand for African designer goods, riding on e-commerce.\nThat presents an opportunity for local retailers to promote African fashion globally, especially with consumers increasingly switching to online shopping amid the raging Covid-19 pandemic."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Web3: The Internet evolution to come in 2022 and beyond",
    "summarized_story": "Share this article:If you’ve come across the buzzword, non-fungible tokens (NFT) on the Internet, chances are you have also seen the latest buzzword — Web3.\nA decentralised World Wide Web owned by no one but run based on everyone’s decisions.\nHe envisioned the Web in three ways: a Web of documents (Web1), a Web of people (Web2) and a Web of data (Web3).\nThe same way Web3 is causing a stir now on the Internet, the coming of Web2 also did the same thing.\nLike Web2, Web3 wants to make the Internet more inclusive but, in contrast, take control away from big corporations like Facebook, Google, and Amazon."
  },
  {
    "headline": "Worried about your child’s online safety during holidays? Try these tools",
    "summarized_story": "Nearly all social media platforms have age restrictions of at least 13 years to use their platform.\nWith many divided on the move, China’s regulatory authority has implemented regulations requiring social media and gaming companies to disincentivise youth from spending too much time on social media.\nGiven the several reported cases of online abuse on the platform, online safety precautions need to be taken, especially for young people.\nTikTokPhoto by Solen Feyissa on UnsplashWith over 2.6 billion downloads, TikTok is one of the most used social media platforms globally.\nLike every other social media platform, it has its safety issues."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Obaseki charges Edo PDP on unity, inclusion, hosts party members in Oredo LGA – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge during a get-together for PDP members in Oredo Local Government Area (LGA), held in Benin City on Tuesday.\n“I am a digital governor; I work with data.\nIt will affect everything else, including the number of Senior Special Assistants (SSAs) and Special Assistants (SAs).\n“The vehicle that we are using, which is the PDP, is not the exclusive right of anybody.\nSo, we must work together to build the party,” he charged."
  },
  {
    "headline": "Edo govt parleys workers, seeks sustained collaboration to realize MEGA Agenda – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has called for the support of all stakeholders to sustain ongoing reforms across all sectors of the state, reassuring that the government is committed to realizing the Making Edo Great Again (MEGA) Agenda and achieving economic prosperity for Edo people.\nThe unions include the state’s chapters of the Nigeria Labour Congress (NLC), Trade Union Congress (TUC), National Union of Teachers (NUT) and Joint Negotiating Council (JNC), among others.\nReassuring the government’s commitment to improving the state’s civil and public service for effective and efficient service delivery, Okungbowa urged the unions to support the government’s drive at repositioning the service.\nOisamaye Godwin and the Secretary, Edo NLC, Comr.\nBarry Imade hailed Governor Obaseki for prioritizing the reform of the state’s civil and public service."
  },
  {
    "headline": "My govt belongs to all Edo people, Obaseki says, extends hand of friendship to APC youths leader, Tony Kabaka – Nigerian Observer",
    "summarized_story": "My govt belongs to all Edo people, Obaseki says, extends hand of friendship to APC youths leader, Tony KabakaShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, in the spirit of Christmas, extended a hand of friendship to the State’s Youth leader of the All Progressives Congress (APC), Tony Adun, also known as Tony Kabaka, noting that his government belongs to all Edo people, irrespective of religion, ideological differences or political affiliation.\nFollowing the Governor’s invitation, Kabaka was at the Government House, Benin City, to receive gift items to celebrate the festivities with his family.\nReceiving Tony Kabaka, Obaseki said despite belonging to a different political party, he is not an enemy but friends with Adun, adding, “I am governor to all Edo people, irrespective of political affiliation.”Obaseki, who was represented by his Chief of Staff, Osaigbovo Iyoha, said, “I welcome Tony Kabaka to Government House.\nIn the mood for Christmas and reconciliation, this cow and bags of rice are for you and your family to celebrate Christmas.\nWe are brothers and a family; irrespective of events of the past, we are still friends.”In his response, Adun thanked Governor Obaseki for his kind gesture and forgiving spirit."
  },
  {
    "headline": "Edo Govt Applauds Foundation for Charitable Works – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo Government has commended the Dennis Aikoriogie Foundation (DAF) for it’s commitment to the welfare of the needy in the state.\nSpeaking on Monday at the Christmas Party for Orphanage Children organized by the Foundation in collaboration with Edo Ministry of Social Development and Gender Issues in Benin City, the Honourable Commissioner, Hon.\nEdakor also commended the various orphanage homes for taking good care of children under their care.\nShe however said the Obaseki’s administration will clamp down on any orphanage homes operating below standards.\n“Today we are having fun here and I am impressed with the way the children from the various orphanage homes are looking."
  },
  {
    "headline": "AfDB approves €10.5m investment in startup fund",
    "summarized_story": "African Development Bank Group Board of Directors of the has approved an equity investment pool of €10.5 million to drive technological innovation across sub-Saharan Africa, the bank announced in a statement.\nTitled ‘African Development Bank Group Board approves €10.5m pooled investment in tech start-up fund to boost innovation across sub-Saharan Africa,’ the statement said , “The Board of Directors of the African Development Bank Group has approved an equity investment pool of €10.5m toward the first close of the Janngo Start-Up Fund, a pan-African tech start-up fund,” it said.\nAccording to the statement, the €10.5m pooled investment consists of €7m provided by the AfDB and a €3.5m contribution by the European Union and the Organization of African, the Caribbean, and the Pacific States.\nThe bank’s Director for Financial Sector Development, Stefan Nalletamby, said, “Africa is experiencing rapid mobile penetration with Android and other platforms.\n“The pooled investment advances the Boost Africa Program, a collaboration among the contributing partners and the European Investment Bank to back investment funds that target early-stage innovative enterprises across sub-Saharan Africa,” it added"
  },
  {
    "headline": "Lassa Fever kills 92 in Nigeria",
    "summarized_story": "Lassa fever has killed 92 Nigerians from January 2021 till date, with Bauchi and Ebonyi States recording new deaths.\nWhile Bauchi reported two new fatalities; Ebonyi recorded one new death from the disease.\nThe number of new confirmed cases, the agency stated, is the same as the figure reported in the previous week.\n“Of all confirmed cases, Edo has (43 per cent), Ondo (35 per cent), and Taraba (five per cent).\nThe male to female ratio for confirmed cases is 1:0.9."
  },
  {
    "headline": "NUPRC To Close 2020 Marginal Field Bid Round Programme",
    "summarized_story": "The Nigerian Upstream Petroleum Regulatory Commission (NUPRC) says it is set to close out the 2020 marginal field bid round programme.\nMr Gbenga Komolafe, the commission’s Chief executive officer who disclosed this in a statement issued on Tuesday notifying participants in the programme, said it has put in place all necessary machinery to progress the bid round exercise to conclusion in line with the Petroleum Industry Act 2021 (PIA).\nKomolafe indicated that an in-house work team has already been constituted to deal with outstanding issues, including distilling and addressing the concerns of awardees with a view to close out issues affecting multiple awardees per asset and formation of Special Purpose Vehicles (SPV) by awardees in line with the respective letters of award.\nConsequently, the Commission has enjoined awardees with the indicated issues to avail themselves of the resolution mechanism provided, in the overriding national interest.\nAccording to Komolafe, the Commission is collaborating with leaseholders to agree on transition mechanisms in line with the PIA and the aspirations of the government for the marginal field bid round exercise."
  },
  {
    "headline": "National Assembly sends 2022 budget to Buhari for assent",
    "summarized_story": "Nigeria’s National Assembly has transmitted the 2022 Appropriation Bill to President Muhammadu Buhari for assent.\nThe assembly also raised oil benchmark from the proposed $57 per barrel to $62.\nPresident of the Senate, Ahmad Lawan, had said the budget would be transmitted to Buhari by Thursday.\nA communication from the Clerk to the National Assembly, Ojo Amos, to the Presidency showed that the budget was transmitted on Friday and received by the Office of the Chief of Staff to the President on Saturday.\nA2, Laws of the Federation of Nigeria, 2004, I wish, with due respect, to forward to Your Excellency, the authenticated copies of Appropriation Bill, 2022, for your consideration and assent."
  },
  {
    "headline": "We ‘ll Help ‘Next Cash ‘N Carry’ Bounce Back Stronger – FCT Minister",
    "summarized_story": "The Minister of the Federal Capital Territory (FCT), Mallam Muhammad Bello, has promised to provide needed support for an Abuja shopping mall, NEXT Cash ‘N Carry, to bounce back stronger than it was before it was gutted by fire on Sunday.\n“This particular incident brought out what is good about us as residents, everybody united and supported them.\n“We will give them all the needed support so that they bounce back stronger than what they were before.\nWe look forward to seeing you back to business in no distant future,” the Minister said.\nThe minister also commended the managers and staff of NEXT Cash ‘N Carry for having and activating an internal fire fighting mechanism in place, which greatly helped in curtailing the Sunday inferno."
  },
  {
    "headline": "Direct Primaries Will Be Financial Burden To Parties, Presidency Insists",
    "summarized_story": "In a statement he issued yesterday, Shehu noted that the president’s decision to withhold assent from the bill has come under scrutiny from media and political circles.\nAccording to him, it is quite correct for only two parties to benefit from the process because it is a decision that will impact all Nigerians.\nOnly the richest of political parties.\nPresident Buhari had written back to the National Assembly leadership, saying he was averse to the clause which mandates all political parties to adopt direct primaries.\nADVERTISEMENTHe cited the high cost of conducting direct primaries, the security challenge of monitoring the election, violation of citizens’ rights and marginalisation of small political parties as reasons for rejecting the bill."
  },
  {
    "headline": "Shell Production Disruptions Shoot Crude Oil Prices To $80 Per Barrel",
    "summarized_story": "Force Majeure declared by oil major, Shell in Nigeria and production disruptions in two other countries have caused supply hiccups in the international oil market prompting prices to extend gains on Tuesday.\nLEADERSHIP reported that about 200,000 barrels of crude oil is currently stranded as oil major Shell Plc halted crude shipments from Nigeria’s Forcados export terminal.\nForce majeure is a clause that allows companies to skip contractual obligations following issues outside of their control.\nSince Shell announced the month-long force majeure at the Bonny site in October, only one ship has loaded a cargo from that terminal.\nADVERTISEMENTPresently, Nigeria, Libya and Ecuador have declared force majeures this month on part of their oil production because of maintenance issues and oilfield shutdowns."
  },
  {
    "headline": "Shell Production Disruptions Shoot Crude Oil Prices To $80 Per Barrel",
    "summarized_story": "Force Majeure declared by oil major, Shell in Nigeria and production disruptions in two other countries have caused supply hiccups in the international oil market prompting prices to extend gains on Tuesday.\nLEADERSHIP reported that about 200,000 barrels of crude oil is currently stranded as oil major Shell Plc halted crude shipments from Nigeria’s Forcados export terminal.\nForce majeure is a clause that allows companies to skip contractual obligations following issues outside of their control.\nSince Shell announced the month-long force majeure at the Bonny site in October, only one ship has loaded a cargo from that terminal.\nADVERTISEMENTPresently, Nigeria, Libya and Ecuador have declared force majeures this month on part of their oil production because of maintenance issues and oilfield shutdowns."
  },
  {
    "headline": "Buhari To Sign N17trn 2022 Budget Friday",
    "summarized_story": "President Muhammadu Buhari will sign into law, the N17trillion 2022 Appropriation Bill on Friday.\nThe passage followed the consideration of the report of the Appropriation Committees of both chambers on the 2022 Appropriations Bill.\nADVERTISEMENTChairman of the Senate Committee, Senator Barau Jibrin, said the revenue projection for the 2022 budget was predicated on the Medium Term Expenditure Framework/Fiscal Strategy Paper approved by the National Assembly.\nIn addition, the Federal Ministry of Industry, Trade and Investment received N17,966,745,438, Federal Ministry of Labour and Employment – N14,453,726,978, Federal Ministry of Science, Technology and Innovation – N49,683,523,165, Federal Ministry of Transport – N15,892,132,819, Federal Ministry of Aviation – N7,692,548,460, Federal Ministry of Power – N6,262,156,943, and Ministry of Petroleum Resources – N30,502,257, 191.\nOther Executive bodies such as the Federal Code of Conduct Bureau received N2,343,845,401, Code of Conduct Tribunal – N830,910,644, Federal Character Commission – N3,272,871,999, Federal Civil Service Commission – N1,217,473,478, Police Service Commission – N926,505,919, and Revenue Mobilization, Allocation, and Fiscal Commission – N2,337,230,632."
  },
  {
    "headline": "12 QUICK FACTS ABOUT OKEY OGUNJIOFOR’S AMINA, NOLLYWOOD LATEST BIG BUDGET FILM ON NETFLIX",
    "summarized_story": "By AZUH AMATUS1 Pioneer filmmaker, Okey Ogunjiofor is the producer cum executive producer of Amina, while Izu Ojukwu directed the big budget film.\n2 Over 1000 Northern artistes and 86 Southern crew members worked on the set of Amina, in Jos, Plateau State.\n3 Amina is a feature film made with collaborations that spanned three continents of Africa, Europeand America.\n4 Amina is the captivating and thrilling story of the life and times of Queen Amina of Zazzau.\n8 Amazingly, Amina which is currently enjoying global rave reviews from pundits and critics as a Netflix original film was released on November 4, 2021."
  },
  {
    "headline": "12 QUICK FACTS ABOUT OKEY OGUNJIOFOR’S AMINA, NOLLYWOOD LATEST BIG BUDGET FILM ON NETFLIX",
    "summarized_story": "By AZUH AMATUS1 Pioneer filmmaker, Okey Ogunjiofor is the producer cum executive producer of Amina, while Izu Ojukwu directed the big budget film.\n2 Over 1000 Northern artistes and 86 Southern crew members worked on the set of Amina, in Jos, Plateau State.\n3 Amina is a feature film made with collaborations that spanned three continents of Africa, Europeand America.\n4 Amina is the captivating and thrilling story of the life and times of Queen Amina of Zazzau.\n8 Amazingly, Amina which is currently enjoying global rave reviews from pundits and critics as a Netflix original film was released on November 4, 2021."
  },
  {
    "headline": "Fadeyi Oloro: Group seeks support for sick Nollywood veteran",
    "summarized_story": "The Coalition for A Better Nigeria has called on well-meaning Nigerians to rise to save the life of ailing Nollywood actor, Ojo Arowosafe, popularly known as Fadeyi Oloro.\nCoalition National Coordinator Bamiji Awa made the call in a statement he issued on Tuesday in Lagos.\nAwa said, “Our dear Super Nollywood Actor, Chief Ojo Arowosafe, popularly known as ‘Fadeyi Oloro’ is in dire need of the generous support of kind-hearted Nigerians concerning his failing health.\n“Veteran Yoruba actor, Fadeyi Oloro, has cried out to Nigerians, seeking financial assistance amidst health challenges,” he said.\nAccording to Awa, the ailing actor has said he has conducted a series of tests to ascertain the nature of his ailment but to no avail."
  },
  {
    "headline": "Fadeyi Oloro: Group seeks support for sick Nollywood veteran",
    "summarized_story": "The Coalition for A Better Nigeria has called on well-meaning Nigerians to rise to save the life of ailing Nollywood actor, Ojo Arowosafe, popularly known as Fadeyi Oloro.\nCoalition National Coordinator Bamiji Awa made the call in a statement he issued on Tuesday in Lagos.\nAwa said, “Our dear Super Nollywood Actor, Chief Ojo Arowosafe, popularly known as ‘Fadeyi Oloro’ is in dire need of the generous support of kind-hearted Nigerians concerning his failing health.\n“Veteran Yoruba actor, Fadeyi Oloro, has cried out to Nigerians, seeking financial assistance amidst health challenges,” he said.\nAccording to Awa, the ailing actor has said he has conducted a series of tests to ascertain the nature of his ailment but to no avail."
  },
  {
    "headline": "NAFDAC to Nigerians: Bacteria in hawked herbs will kill you",
    "summarized_story": "The NAFDAC boss said that any drug being hawked on the streets or in buses should be avoided because of the uncertainty of its source.\n“Even if the herbal concoction has some medicinal properties, the bacteria will kill the person first that is taking it,” she said.\nAdeyeye, however, said some of the herbal medicines work but consumers must ensure that they had passed NAFDAC’s safety and efficacy tests.\nThe DG particularly cautioned against the use of performance-enhancing drugs because of the danger it poses for many unsuspecting men.\n“Many men have died using performance-enhancing drugs because if they use them and they have heart problems or have ‘X’ type of ailment, it can easily kill,” she said."
  },
  {
    "headline": "Garba Shehu recovers from Covid-19",
    "summarized_story": "Senior Special Assistant to President Muhammadu Buhari on Media and Publicity, Garba Shehu has announced that he has recovered from Covid-19.\nHe made the announcement in a post on his Facebook page and thanked Allah for his speedy recovery.\n“I thank Almighty Allah for my speedy recovery from COVID-19.\nMy prayers and deepest respect are for all of you, who prayed, called or texted expressing your concerns for me.\nGarba had confirmed reports that he contracted COVID-19 and said he was self-isolating."
  },
  {
    "headline": "Buhari Govt Planning To Eliminate Me, I Can’t Be Freed Legally – Sunday Igboho Claims",
    "summarized_story": "Yoruba nation agitator, Sunday Igboho has accused the Nigerian Government of attempting to eliminate him in Benin Republic.\nIgboho explained that the Nigerian Government was planning to eliminate him to silence the Yoruba Nation agitation.\nHe said: “The enemies are trying to eliminate Igboho.\nHe bemoaned the diplomatic approach’s failure, noting that the President of the Benin Republic, Talon, had refused to release Igboho.\nFrom issuing an ultimatum to Fulani herders in the Southwest, Igboho delved into agitation for Yoruba Nation."
  },
  {
    "headline": "Federal Government Wants To Execute Me – Sunday Igboho",
    "summarized_story": "Sunday Adeyemo, also known as Sunday Igboho, a Yoruba nationalist, has claimed that the Nigerian government is plotting to assassinate him in Benin Republic.\nRecall that Igboho, 49, was arrested by operatives of Brigade Criminelle (Criminal Brigade) on July 19 in Cotonou.\nOlayomi Koiki, spokesman of Igboho, in a podcast on Tuesday evening, alleged that the Benin Republic President Patrice Talon was working with the Federal Government to extradite Igboho to Nigeria.\n“If you think the legal route is what will set Igboho free, then we are wasting our time.\n“Benin Republic judicial system is not working."
  },
  {
    "headline": "Gov. Uzodinma Is Behind Unknown Gunmen In Imo – Okorocha.",
    "summarized_story": "Senator Rochas Okorocha of Imo West has linked Governor Hope Uzodinma to unidentified gunmen in the state.\nOkorocha alleged that unknown gunmen in the State get their instructions from the Uzodinma-led government.\nSpeaking with Channels Television on Tuesday, the Senator claimed that the gunmen are rogue police officers working without the consent of the police authorities.\nAccording to Okorocha: “It appears to me as though the misery behind unknown gunmen has been unravelled by recent happenings.\nNwosu was arrested during a memorial service for his mother at the St. Peter’s Anglican Church, in Eziama-Obieri, Nkwerre Local Government Area of the State."
  },
  {
    "headline": "People With No Evidence Of Full Vaccination Won’t be Granted Entry To Our Facilit – JAMB",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has decided that no personnel or visitors will be permitted into its offices nationwide unless they have proof of complete immunization, as mandated by the Nigeria Centre for Disease Control (NCDC).\nIn line with this entry protocol, staff and visitors or clients are to present acceptable evidence which is: COVID-19 Vaccination Card, any identification card connecting the holder to the vaccination card, preferably the National Identity Card; Driver’s Licence or International Passport.\nJAMB in its bulletin said from available statistics from relevant agencies, the virus is spreading like wildfire, hence the clarion call for all to be vigilant, observe all protocols, and for institutions, be it public or private, to adopt relevant protocols to nip the spread of the virus in the bud.\n“As a proactive agency, the Board is adopting this protocol in the light of its heightened preparations for the commencement of the 2022 UTME/DE Registration exercise.\n“We implore all not to be lulled into a false sense of security as pertains to the COVID-19 pandemic as the increasingly dangerous dimension the virus is assuming should be a source of concern to all, especially with the emergence of a more-virulent Omicron variant.”"
  },
  {
    "headline": "Breaking: Arsenal ‘s Mikel Arteta tests positive for COVID-19, to miss Manchester City New Year day Premier League clash",
    "summarized_story": "Mikel Arteta will miss Arsenal’s New Year’s Day clash with Manchester City after testing positive for Covid, nearly two years on from first contracting the virus.\nThe Spaniard previously tested positive in March 2020, shortly before English football was shutdown as the country tried to get a grip of the pandemic.\nAnd Arsenal have confirmed that the manager will not be on the touchline for their game with the Premier League leaders at the Emirates Stadium having tested positive again.\nAn ’emergency meeting’ is set to be held on Friday among Premier League chiefs as football continues to battle with a surge of Covid outbreaks across the country.\nOmicron, the ultra-infectious new Covid variant, has wreaked havoc across the football calendar in recent weeks, with infections rising at alarming rates."
  },
  {
    "headline": "Breaking: 4 years after, John Terry returns to Chelsea",
    "summarized_story": "Chelsea have announced the return of club legend John Terry as the aspiring manager takes on a coaching consultancy role four years on from his Stamford Bridge exit, Dailysportsmail reports.\n“I’m delighted to announce that I’m coming home, and have taken up a consultancy role @ChelseaFC academy,’ he tweeted.\n‘It goes without saying that John’s experience in the game, both as a world-class player and more recently as an assistant coach in the Premier League, will be invaluable for everyone in the building.\nHe went onto make 717 appearances for the Blues, captaining them to five Premier League titles and a Champions League triumph in 2012.\nIt was reported earlier this week that Terry was interested in several Championship roles but was ‘politely let down’."
  },
  {
    "headline": "Obasanjo to Clark: Adjust, bad language does not show wisdom, maturity",
    "summarized_story": "Contrary to claims by Chief Edwin Clark, former President Olusegun Obasanjo said he never at any time sabotaged the interests of the Niger Delta region.\nAt the event, Obasanjo made utterances believed not be in the interest of the Niger Delta region on resource control.\nSpecifically, the former Nigerian leader said oil found in the Niger Delta region does not belong to the people of the Niger Delta.\nIn the letter entitled, ‘My disappointment over your unprovoked outburst against the people of the Niger Delta region,’ Clark said: “This is in spite of the environmental damages the region is suffering.\nYour Excellency’s disdain and insincerity for the Niger Delta region has not in any way reduced."
  },
  {
    "headline": "COVID-19: ‘Let’s Make Recovery Our Resolution,’ UN Chief Says In New Year Message",
    "summarized_story": "United Nations Secretary-General, Antonio Guterres, has appealed to countries across the globe to make recovery for people, the planet, and prosperity their resolution for 2022.\nHe made the appeal in his New Year message, stressing the need for countries to come together and make recovery for people and the planet their priority as the world continues to recuperate from the COVID-19 pandemic.\nAnd for an economic rescue, he stated that wealthier countries must support the developing world with “financing, investment and debt relief”.\nTo heal from mistrust and division, the UN chief affirmed that a new emphasis must be placed “on science, facts and reason”.\n“Together, let’s make recovery our resolution for 2022,” the Secretary-General concluded."
  },
  {
    "headline": "Seven Die In Niger State Boat Mishap",
    "summarized_story": "No fewer than seven persons have died in a boat mishap at Zhigiri village in Shiroro Local Government of Niger State.\nIt was also revealed that a man Muazu Babangida lost his two wives and a son in the incident.\n“Prior to the construction of Zungeru Dam, traveling between these two villages was by land and need not water transportation, as the terrain was majorly dry and motorable.\n“This is one of the social upheaval occasioned by the construction of the dam.\nAt the time of this report, one corpse is yet to be recovered from the water,” Salis Saba said."
  },
  {
    "headline": "Nwosu’s Arrest: The Mystery Of ‘Unknown Gunmen’ In Imo Is Now Unravelling – Okorocha",
    "summarized_story": "﻿Former Imo State Governor Rochas Okorocha on Tuesday suggested that elements described as ‘unknown gunmen’ in Imo State may soon be revealed after the arrest of Uche Nwosu.\nREAD ALSO: CAN Apologises To Anglican Church, Condemns Police InvasionThe Imo State Government has said Mr. Nwosu’s arrest was part of an independent police investigation and that Mr. Okorocha was attempting to politicise the issue.\nImo State is becoming a banana republic, where there is complete lawlessness and where people live in fear.\n“Most people have been wondering about the mystery of unknown gunmen.\nBut it appears to me now that unknown gunmen have finally been unraveled with the recent happenings."
  },
  {
    "headline": "Electoral Act: Buhari Is Protecting Nigeria’s Democracy, Says Garba Shehu",
    "summarized_story": "The Senior Special Assistant to President Muhammadu Buhari, Garba Shehu, has given further insight into the President’s decision to withhold assent from the Electoral Act (Amendment) Bill 2021.\nIt is the job of this government to protect Nigeria, her people and her democracy,” the statement read in part.\nRELATED:[Electoral Bill] Buhari’s Decision Not The End, Says AdesinaBuhari To Sign 2022 Budget On FridayPresident Buhari had last Tuesday declined assent to the Electoral Act Amendment Bill over the direct primaries clause.\nAfter careful review, the President’s Office has found that the opposite is true,” Mr Shehu reiterated in his statement on Tuesday.\nIn Amending The Electoral Act, The Nation First, Always First For Mr. PresidentThe President’s decision to withhold assent from the Electoral Act (Amendment) Bill 2021 has come under scrutiny from media and political circles."
  },
  {
    "headline": "Family Seeks Justice Over Alleged Ritual Killing Of 29-Year-Old By Boyfriend",
    "summarized_story": "Speaking to Channels Television, Elohor’s mother, Comfort Oniorosa, said her daughter left the house for her boyfriend’s place thinking that his illness would have gotten worse.\nREAD ALSO: Man Flees After Killing Girlfriend For Suspected Ritual In EdoHe thereafter led Channels Television to David’s apartment where the crime allegedly took place.\nThe landlord, Ifueko Ogieriakhi, who was invited by the police to give a statement, explained why he locked up the suspect’s apartment.\nHe noted that the reason he locked the suspect’s apartment was his properties were still there, hence the decision to prevent it from being burgled.\nBut the police authorities are ever determined to arrest the fleeing suspect and prosecute him if liable for the murder."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "How Police arrested Okorocha's son-in-law, Uche Nwosu during Church service -",
    "summarized_story": ""
  },
  {
    "headline": "Thugs Attack PDP Congress Venue, Destroy Vehicles, Chairs, Others -",
    "summarized_story": "Unknown thugs have attacked venue of the Zamfara State Peoples Democratic Party State CongressThe congress is to enable party members to Elect Officials that will steer the ship of the party in the next three yearsThis follows the recent Defection of the state Governor Bello Matawalle from the PDP to the ruling APCThe thugs attacked the venue of the congress and started pelting stones on some members of the party who were on ground before the commencement of the congressVehicles, Chairs, Canopies and other valuables at the venue were destroyed by unidentified political thugs who’s mission was to prevent the conduct of the congressAuthorities of the party says no amount of intimidation will prevent them from conducting their party Congresses which is their Constitutional rightThe Zamfara State PDP has relocated the congress to another venue which seems to be more saferThe Congress is ongoing in an undisclosed venueEfforts to speak to police in the state proves abortive as the spokesperson of the command is not responding to phone calls"
  },
  {
    "headline": "Respect Buhari, keep to February 5 national convention date, group tells Buni's CECPC -",
    "summarized_story": "A group within the governing All Progressives Congress (APC) under the umbrella of Progressive Mandate Movement (PMM) has challenged Mai Mala Buni-led Caretaker Extraordinary Convention Planning Committee (CECPC) to ensure that the party’s national convention does not fail to hold by 5th of February, 2022.\nThe group also demanded immediate release of processes leading to the national convention, adding that if nothing is done by January 5th 2022, the National Secretariat will be made ungovernable for the CECPC.\nThe statement claimed that President Muhammadu Buhari had wanted the APC National Convention to hold in December 2021 but due to appeal by the Buni’s CECPC, the presidency agreed to February 2022.\n“The delay in conducting the overdue APC national convention is already giving the opposition Peoples Democratic Party some advantages, making it look like nobody is in charge of the governing party.\n“We therefore call on Governor Mai Mala Buni-led National Caretaker Committee not to go beyond February 5 to hold our party’s National Convention."
  },
  {
    "headline": "Indonesia Lifts Ban on Boeing 737 Max after 2018 Lion Air Crash",
    "summarized_story": "Indonesia has lifted a ban on the Boeing 737 Max, more than three years after the Lion Air disaster that saw the loss of all 189 people on board.\nThe plane maker saw its best-selling aircraft grounded globally after a deadly crash in March 2019 involving an Ethiopian Airlines 737 Max.\nOn Monday, Ethiopian Airlines said it will resume such flights in February.\nMore than 180 countries now allow the use of the 737 Max, with Australia, Japan, India, Malaysia and Singapore lifting their bans this year.\nLess than five months later, Ethiopian Airlines Flight 302, a Boeing 737 Max on its way to Kenya, crashed six minutes after leaving Ethiopia’s capital Addis Ababa, killing all 157 people on board."
  },
  {
    "headline": "South Africa Court Blocks Shell’s Oil Exploration",
    "summarized_story": "A South African court has halted oil giant Shell’s seismic testing for oil and gas along the country’s eastern coastline, pending a final ruling.\nSouth Africa’s Energy Minister Gwede Mantashe had condemned the project’s critics, saying they wanted to deprive Africa of energy resources.\nIn his ruling, High Court Judge Gerald Bloem said that Shell’s right to explore the waters near the Wild Coast “was awarded on the basis of a substantially flawed consultation process”.\nCampaigners argued that many sea creatures – including whales, dolphins and seals – would be affected by the seismic testing.\nThe sound that returns reveals whether there is, for example, oil locked in the rock beneath."
  },
  {
    "headline": "Hong Kong Police Raid Pro-Democracy News Outlet, Force Closure after Senior Staff Arrested",
    "summarized_story": "One of the last pro-democracy media organisations in Hong Kong, Stand News, is shutting down after it was raided by police and senior staff were arrested.\nSix people, both current and former employees, were detained by Hong Kong police for “conspiracy to publish seditious publications”.\nHong Kong police said in a statement they were authorised to “search and seize relevant journalistic materials”.\nThe night before, Mr Chan had hosted the annual dinner of the Hong Kong Journalists Association (HKJA), of which he is chairperson.\nIn a speech, he referenced the closure of Apple Daily, saying that the incident had “shaken” Hong Kong."
  },
  {
    "headline": "Gambia Court Rejects Challenge to Barrow Election Victory",
    "summarized_story": "The Gambia’s Supreme Court has dismissed a plea by the country’s main opposition party to annul the outcome of the December 4 presidential election, in which incumbent Adama Barrow was announced the winner.\nOusainou Darboe, leader of the United Democratic Party (UDP), said the election campaign had been tainted by bribery and corruption.\nBarrow won the December 4 poll with 53 percent of the vote while Darboe, who was the Gambian vice president in Barrow’s administration, secured about 28 percent.\n“We have not lost anything because the petition was not dismissed based on merit but a mere technicality,” Darboe said.\nDarboe did not indicate whether he or his party would continue to challenge the election results."
  },
  {
    "headline": "At Least 38 Killed in Sudan Gold Mine Collapse",
    "summarized_story": "Dozens of people have been killed in the collapse of a defunct gold mine in Sudan’s West Kordofan province over the weekend, according to the country’s state-run mining company.\nIsmael Tissou, spokesperson for the Sudanese Mineral Resources Company, said on Wednesday at least 38 people were dead, raising an earlier toll of 31.\nOn Tuesday, Sudanese Mineral Resources Company Limited said in a statement posted on Facebook the closed, non-functioning mine was located in the village of Fuja, in En Nahud locality, some 700km (435 miles) south of the capital, Khartoum.\nThe mining company also posted images showing villagers gathering at the site as at least two dredgers worked to find possible survivors and bodies.\nCollapses are common in Sudan’s gold mines, where safety standards are not widely enforced."
  }
]