[
  {
    "headline": "Tinubu, Akande, others to break fast with Buhari at Villa Tuesday",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), will on Tuesday evening host several members of the All Progressives Congress leadership in an Iftar dinner at the State House, Abuja.\nAccording to an invitation letter sighted by The PUNCH, those invited for the meeting include former Lagos State Governor and Presidential aspirant, Bola Tinubu, former National Chairmen of the APC, Dr John Oyegun, and Adams Oshiomhole, former Adamawa state Governor, Murtala Nyako.\nOthers are former Ogun State Governor, Olusegun Osoba, first interim chairman of the APC, Bisi Akande, former Borno State Governor, Ali Modu-Sheriff, Former Zamfara State Governor, Ahmed Yarima, Former Sokoto State Governor, Aliyu Wamako, former Edo state Governor, Oserheimen Osunbor, former Yobe State Governor, Bukar Ibrahim, General Muhammed Magoro, Senators Lawal Shuaibu, Aba Aji, Tijjani Tumsah, Fati Bala, Abubakar Guru, and Nasiru Danu.\nThe leaders are to arrive at the Pilot Gate at 1630 hours for Rapid Covid-19 testing at the State House Conference Centre and be seated at the venue by 1800 hours.”Copyright PUNCH."
  },
  {
    "headline": "2023: It’s North-Central turn to produce president, says Saraki",
    "summarized_story": "As politicians jostle for the nation’s presidency in 2023, former Senate President Bukola Saraki has said that it was the turn of the North-Central geopolitical zone to lead the country.\nSaraki spoke on Tuesday in Jos when he addressed delegates from Plateau ahead of the Peoples Democratic Party (PDP) primary elections slated to hold in May.\n“You remember that before the national convention of our party, we held a meeting in Abuja with delegates of North-Central extraction.\nThe PDP Chairman in Plateau, Chris Hassan, told the delegates that Saraki stood with the state during its trying times.\nLar urged the presidential aspirant to ensure that women got their 35 per cent affirmation action when elected President come in 2023."
  },
  {
    "headline": "Kate Henshaw: Fighting for Women’s Rights",
    "summarized_story": "So we need good women, we need intelligent women, we need women in the community, we need women leaders, we need market women, we need women in religious societies who will continue to preach and advocate for a saner society and to banish all these traditional practices that are indeed harmful to their fellow women.\nWhat is your view on how your colleagues use the social media?\nShe can make the choice to go into the social media space knowing fully well that it’s a mixed world out there.\nSo, social media if it’s not used correctly can turn out to be harmful like, fake information, impersonation of people’s character, using of their images without permission.\nSo, we need to be more careful in the usage of social media in terms of disseminating information."
  },
  {
    "headline": "Kate Henshaw: Fighting for Women’s Rights",
    "summarized_story": "So we need good women, we need intelligent women, we need women in the community, we need women leaders, we need market women, we need women in religious societies who will continue to preach and advocate for a saner society and to banish all these traditional practices that are indeed harmful to their fellow women.\nWhat is your view on how your colleagues use the social media?\nShe can make the choice to go into the social media space knowing fully well that it’s a mixed world out there.\nSo, social media if it’s not used correctly can turn out to be harmful like, fake information, impersonation of people’s character, using of their images without permission.\nSo, we need to be more careful in the usage of social media in terms of disseminating information."
  },
  {
    "headline": "King Hakbal: Styling Royalties",
    "summarized_story": "What inspired the King Hakbal brand?\nThese are the major reasons that inspired the King Hakbal Royal Bespoke brand.\nWho is the perfect King Hakbal Lion Man?\nThe perfect King Hakbal Lion Man is one that is fearless in the pursuit of what sets his soul on fire.\nA King Hakbal Lion Man is also one that sees himself as a King at heart; a driven- man who puts his money where his mouth is."
  },
  {
    "headline": "King Hakbal: Styling Royalties",
    "summarized_story": "What inspired the King Hakbal brand?\nThese are the major reasons that inspired the King Hakbal Royal Bespoke brand.\nWho is the perfect King Hakbal Lion Man?\nThe perfect King Hakbal Lion Man is one that is fearless in the pursuit of what sets his soul on fire.\nA King Hakbal Lion Man is also one that sees himself as a King at heart; a driven- man who puts his money where his mouth is."
  },
  {
    "headline": "Aisha Gambo: In Pursuit of Sustainable Development",
    "summarized_story": "As president of Nowa, what major initiative have you embarked upon to improve the lives of members of your organisation?\nThere is always room for NOWA members in the NOWA organization.\nIn what ways do you cater to both the developmental and moral growth of women and children left behind by late officers?\nWe also give work opportunities when the chance arises.\nHow do you balance being at the head of a property development and interior decorating company at the same time?"
  },
  {
    "headline": "2023: We supported Buhari in 2015, risked our lives, history will judge him – Unongo",
    "summarized_story": "Former Minister of Steel, Wantaregh Paul Unongo, has expressed regret for spearheading President Muhammadu Buhari’s presidential campaign in 2015.\nUnongo said that he was among those who risked their lives to support Buhari’s presidential ambition seven years ago.\nThe former chairman of the Northern Elders Forum, NEF, however, expressed disappointment with the performance of the Buhari government so far, adding that history will judge him when he finally leaves office in 2023.\nIn a chat with journalists on Sunday evening in Jos, Unongo said: “Some of us that went for Buhari risked our lives.\nHistory will judge that he has total support from his people; some of them took a risk."
  },
  {
    "headline": "2023: Buhari, Sokoto Gov, Tambuwal meet in Aso Rock",
    "summarized_story": "Sokoto State Governor, Hon Aminu Tambuwal has just left the Presidential Villa Abuja, where he met President Muhammadu Buhari behind closed-doors.\nAlthough he declined to speak to State House reporters on his mission to the seat of power, Tambuwal is one of the front runners for the opposition Peoples Democratic Party’s (PDP) presidential ticket for the 2023 presidential election.\nThe meeting with President Buhari comes days after the PDP’s consensus arrangements structured for four northern presidential aspirants failed.\nThe PDP presidential aspirants involved in the arrangement included Governor Tambuwal, Governor Bala Mohammed of Bauchi, former President of the Senate, Bukola Saraki, former Managing Director of FSB International Bank, Mohammed Hayatu-Deen."
  },
  {
    "headline": "Malami asks court to dismiss NBA’s suit on Lawyers’ Rules of Professional Conduct",
    "summarized_story": "The AGF, in a reply to the NBA’s court action, maintained that he was constitutionally empowered to formulate and amend the Rules of Professional Conduct for legal practitioners in Nigeria.\nContrary to the NBA’s claim that he unilaterally amended the rules, Malami stated that members of the General Council of the NBA were invited and held a meeting with him on the issue.\nThe AGF, therefore, asked the court to dismiss the suit against him for being incompetent.\nThe Incorporated Trustees of the NBA had dragged the AGF before the court challenging the validity of the Rules of Professional Conduct for Legal Practitioners (Amendment) Rules 2021 (S.I.\nNBA prayed the court for an order setting aside or nullifying the purported Rules of Professional Conduct for legal practitioners as purportedly made unilaterally by the AGF on September 3, 2020."
  },
  {
    "headline": "War: Putin, Zelensky to meet UN Secretary-General for peace talk",
    "summarized_story": "After about two months since the start of the war in Ukraine, Russian President Vladimir Putin on Tuesday will receive UN Secretary-General António Guterres in Moscow.\nThe meeting is likely to focus on a greater diplomatic role for the United Nations in ending the war in Ukraine.\nAfterwards, Guterres plans to meet with Putin in the Kremlin.\nAfter the UN Chief’s visit to Russia, Guterres is due to travel via Poland to Ukraine, where he also plans to meet President Volodymyr Zelensky on Thursday.\nGuterres’s visit is following pressure on the UN to take a more active role in ending the war between Russia and Ukraine."
  },
  {
    "headline": "2023: ‘May thunder not strike you over ASUU, doctors’ – Omokri blasts Ngige",
    "summarized_story": "The Minister of Labour and Employment, Chris Ngige, has been criticized over his promises to Nigerians if elected President in 2023.\nCondemning Ngige, Reno Omokri, a former aide to ex-President Goodluck Jonathan, said may thunder not fire the longest-serving minister in Buhari’s cabinet.\nAccording to Omokri: “Ngige said if he becomes President, Nigeria will feel his impact in just 2 years.\nFor 7 years, Ngige has been Nigeria’s longest-serving labour minister.\nMay thunder not strike Ngige.”"
  },
  {
    "headline": "Left-handedness: Myth, misconceptions and facts",
    "summarized_story": "When a child is born and starts to use the left hand, many questions come up.\n“If a community detests the use of left hand to do certain things such as giving people things with left hand, one should observe.\nI remember being slapped for giving a woman, money with the left hand.\nIn his view, Oluwbukola Akanni, a journalist, who used her left hand initially and voluntarily changed to her right hand, says she was conscious of her decision.\n“Growing up I drew, I wrote with my left hand and luckily for me my parents didn’t try to change that."
  },
  {
    "headline": "DSS raises the alarm over bomb attacks on worship, relaxation centres",
    "summarized_story": "The Department of State Services (DSS) on Tuesday raised the alarm over plans by criminal elements to launch bomb attacks on soft and hard targets in parts of the country.\nHe said the objective is to achieve some self- serving interests as well as cause fear among the citizenry.\nThe Service, however, recalls its earlier warning that some groups and individuals were plotting to stoke violence in the country.\n“Following these, patrons, owners and managers of aforementioned public places are advised to be wary of this development and implement basic security measures to deter the threats.\n“Meanwhile, the DGSS, Alhaji Yusuf Magaji Bichi, fwc wishes all and sundry a hitch free Workers’ Day and Sallah celebrations.”"
  },
  {
    "headline": "Alleged assault: Court orders CCT Chair Umar to submit self for probe",
    "summarized_story": "A Federal High Court in Abuja has ordered the Chairman, Code of Conduct Tribunal (CCT) Danladi Yakubu Umar to submit himself for probe in relation to allegations of misconduct and assault being investigated by the Senate.\nThe judgment was on a suit marked: FHC/ABJ/CS/ 671/2021, filed by Umar, with the Senate, Senate President, Senate Committee on Ethics, Privileges and Public Petitions and the Attorney General of the Federation (AGF) as defendants.\nUmar was accused, in the petition, of assaulting Clement Sargwak, a 22-year old private security guard at Banex Plaza in Wuse 2, Abuja on March 29, 2021.\nJustice Ekwo held that sections 88 and 89 of the 1999 constitution under which the CCT boss sought to be protected by the court did not confer any protection or refuge on him.\nJustice Ekwo declined all the reliefs sought by Umar and proceeded to dismiss the suit for being without merit."
  },
  {
    "headline": "BREAKING: Buhari, Tambuwal in closed-door meeting",
    "summarized_story": "President Muhammadu Buhari and Sokoto Governor Aminu Tambuwal have met behind closed-door at the Presidential Villa, AbujaTambuwal is one of the front runners for the opposition People’s Democratic Party’s (PDP) presidential ticket.\nThe meeting with Buhari is coming days after the PDP’s consensus arrangement structured for four northern presidential aspirants hit the rocks.\nThe PDP presidential aspirants involved in the arrangement include Tambuwal; his Bauchi counterpart Governor Bala Mohammed; former Senate President Bukola Saraki and former Managing-Director of FsB International Bank, Mohammed Hayatu-Deen.\nDetails Shortly…"
  },
  {
    "headline": "JUST IN: Supreme Court voids Andy Uba’s participation in Anambra gov poll",
    "summarized_story": "The Supreme Court has voided the participation of Andy Uba in the last governorship election in Anambra State as the candidate of the All Progressives Congress (APC).\nA five-member panel of the court, held in a judgment on Tuesday, that the APC breach its guidelines for the conduct of primaries and thus, failed to conduct valid primary from which Uba emerged as the party’s candidate in the Anambra governorship election.\nThe Supreme Court affirmed the February 23, 2022 judgment of the Court of Appeal, which upheld the December 20,2021 judgment by Justice Inyang Ekwo of the Federal High Court, Abuja.\nThe apex court proceeded to dismiss the appeals filed by Andy Uba and the APC – marked: SC/CV/240/2022 and SC/CV/241/2022.\nIn the December 20, 2021 judgment, Justice Ekwo held among others that Uba was never a candidate in the election held on November 6, 2021 having emerged from an illegally conducted primary election held by the APC."
  },
  {
    "headline": "The Sun award, incentive for greater service –Gov Uzodimma",
    "summarized_story": "Imo State Governor, Sen. Hope Uzodimma, has expressed happiness over his nomination as Governor of the Year, saying the honour would spur him to offer greater service to the state and people.\nUzodimma and 25 others will receive The Sun awards on May 7, 2022 in Lagos.\nThe governor said: “I’m so excited to receive this award from a medium like yours.\nThe award is for the people of the state; without them I couldn’t have achieved anything.\nEarlier, The Sun MD said the choice of Uzodimma as Governor of the Year was based on what he has done in office in two years."
  },
  {
    "headline": "2023: It’ll be great injustice if I didn’t contest – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo, yesterday, said it would be injustice if he did not contest the 2023 election given the vast experience gained in his office in the last seven years.\nThe vice president hailed President Muhammadu Buhari’s open-mindedness in delegating him to serious tasks that had aided his experience.\nI am sure that everybody knows that I have formally declared my intention to run as president of the Federal Republic of Nigeria.\nI did so on Monday April 11, 2022 and I did so because, first of all there is nobody that can bear anything God does not decide that he would be, only God can make a person president, vice president, governor, anything whatsoever.\nPresident Muhammadu Buhari, just out of his open mindedness and his own generosity ensured that I was given very serious responsibilities as vice president and I also acted as president."
  },
  {
    "headline": "Tucano jets delay: Blame military not Kukah, NEF tells Presidency",
    "summarized_story": "But NEF’s Director of Publicity and Advocacy, Hakeem Baba-Ahmed, speaking on an AIT programme, yesterday, faulted the Presidency over the way it responds to criticisms.\nBut they need to improve the conduct of the Nigerian military, in the fight against the insurgency, against terrorists.\n“You know, the presidency spokespersons have a way of deflecting criticism by making it personal.\nPeople like Bishop Kukah and I are used to this.\n“So, whether it comes from Bishop Kukah or it comes from me, we made this point."
  },
  {
    "headline": "2023: Dollar scarcity hits banks",
    "summarized_story": "By Adewale SanyaoluThe race towards the 2023 election may have taken a negative toll on the foreign currency reserve base of banks as they currently battle Dollar scarcity.\nThe exchange rate between the naira and the US dollar closed at N419.5/$1 at the official Investors and Exporters (I&E) window last week.\nThe downturn in the market is following the drop in the amount of dollar supply in the market.\nHe however, said other customers were not as lucky as he was as they were turned down due to Dollar shortage.\nA visit by Daily Sun to some banks yesterday confirmed the claims of Olawoyin and most customers could not have access to Dollar."
  },
  {
    "headline": "Nigeria needs visionary leader to get out of current mess –Saraki",
    "summarized_story": "From Bamigbola Gbolagunte, Akure and Gyang Bere, JosFormer Senate President, Dr. Bukola Saraki and Peoples Democratic Party (PDP) presidential aspirant, has declared that Nigeria needs a visionary leader like him to overcome its current socio-economic crisis.\nHe said he would bring to an end the ravaging security challenges in Nigeria if elected president in 2023.\n“We can only get out of this mess if we have leadership that is visionary and one that understands the country.\n“The security situation in the country is very bad and you in Plateau have had the share of it.\n“Who is going to help us address the security situation, who better than one of us from the North Central?"
  },
  {
    "headline": "Elon Musk Reaches Agreement to Acquire Twitter for $44bn",
    "summarized_story": "•Over 40 million Nigerians on microblogging platformWorld’s richest man, billionaire Elon Musk has reached an agreement to acquire Twitter for approximately $44 billion, the company said.\n“Twitter has a purpose and relevance that impacts the entire world,” its CEO Parag Agrawal said in a tweet.\nMusk, a prolific Twitter user, has said it needs to be taken private to grow and become a genuine platform for free speech.\nMusk unveiled his intention to buy Twitter on April 14, and take it private via a financing package comprised of equity and debt.\nMusk did not provide any financing details when he first disclosed his offer for Twitter, making the market skeptical about its prospects."
  },
  {
    "headline": "Afenifere, Others Want Tinubu, Osinbajo, Southwest Aspirants to Withdraw from Presidential Race, Say It’s Turn of S’East",
    "summarized_story": "The call by the prominent socio-political groups reflects the sentiment in the country which increasingly favours the emergence of a president of Igbo extraction.\nAfenifere, PANDEF and Middle Belt Forum insisted the South East should produce the president of Nigeria in 2023 for equity, justice and fairness.\nAfenifere leader, Pa Ayo Adebanjo, while addressing the conference, said there was need for aspirants from the south, especially, the Igbo, to be united.\nAdebanjo said the decisions of presidential aspirants, like Minister of Transportation, Rt.\n“I told Bola (Tinubu) himself, not in the papers, face-to-face, ‘You believe this man (Buhari) will make you president?’ He said yes."
  },
  {
    "headline": "WHO: Malaria Killed over 602,000 People in Nigeria, Others in 2021",
    "summarized_story": "Moeti said the past year saw significant breakthroughs in malaria prevention and control, in spite of the COVID-19 pandemic.\nA statement yesterday, by US Embassy in Nigeria, stated that the US President’s Malaria Initiative (PMI) had partnered with Nigeria to fight malaria since 2011, contributing $768 million to date and $74 million in full year 2021.\nMarking its 20th year of malaria fight in Nigeria and in continuation of this legacy, the oil major has, however, announced its 2022 grant recipients.\n“This World Malaria Day, we mark ExxonMobil’s contributions over the past two decades that have helped equip and strengthen resilience within our communities to fight against malaria.\nThe governor made the call in commemoration of World Malaria Day, yesterday, to highlight the need for continued investment and sustained political commitment to malaria prevention and control."
  },
  {
    "headline": "Oil Theft: Navy Seizes 6 Million Litres of Stolen Crude from Illegal Refiners",
    "summarized_story": "The site also had five large pits holding approximately 700,000 litres of stolen crude oil.\nDuring the operation, 19 ovens, 26 metal storage tanks and two dugout pits laden with about 250,000 litres of suspected stolen crude oil and 50,000 litres of illegally refined AGO were destroyed.\nDuring the operation, 16 ovens, 31 metal storage tanks and seven large pits all filled with about 850,000 litres of stolen crude oil were equally deactivated.\n“The wooden boat was laden with 60,000Litres of illegally refined AGO together with over 100 sacks of same product.\nThe authorities have been struggling to curb the proliferation of illegal plants where stolen crude oil is refined."
  },
  {
    "headline": "NEF: We’re Not Involved in PDP Consensus Arrangement",
    "summarized_story": "“So, based on this, I didn’t go to Minna, and the decision that the two people are the Northern consensus candidate doesn’t in anyway reflect my wish, and should therefore not worry my supporters.\nWe met on Wednesday and we agreed to bury the issue of consensus candidate.\nYes, one consensus candidate has not emerged but they have initiated a process, which can help the party later on.\nRather, it was the group of presidential aspirants made up of Senator Bala Mohammed, RT Hon Aminu Tambuwal.\nSenator Bukola Saraki and Alhaji Mohammed Hayatu-Deen that collectively, freely and willingly approached Gen Babangida to help select from amongst themselves a Consensus Presidential Aspirant."
  },
  {
    "headline": "Terrorists Release Another Photograph Of Abducted Kaduna-Abuja Train Passengers",
    "summarized_story": "Terrorists who attacked an Abuja-Kaduna train about a month ago have released another picture showing some of their victims.\nThe gunmen had on March 28 ambushed the train heading for Kaduna from the nation’s capital city after bombing its rail track.\nAt least eight passengers were killed in the incident, while 168 others were kidnapped or declared missing.\nHassan, who was seen in a video released by the bandits, said he was freed on compassionate grounds.\nMeanwhile, the families of 22 of the passengers have declared them missing."
  },
  {
    "headline": "Terrorists Release Another Photograph Of Abducted Kaduna-Abuja Train Passengers",
    "summarized_story": "Terrorists who attacked an Abuja-Kaduna train about a month ago have released another picture showing some of their victims.\nThe gunmen had on March 28 ambushed the train heading for Kaduna from the nation’s capital city after bombing its rail track.\nAt least eight passengers were killed in the incident, while 168 others were kidnapped or declared missing.\nHassan, who was seen in a video released by the bandits, said he was freed on compassionate grounds.\nMeanwhile, the families of 22 of the passengers have declared them missing."
  },
  {
    "headline": "2023: Buhari Asked Tinubu, Osinbajo, Fayemi, Others To Contest In Order To Divide South-West – Afenifere Leader, Adebanjo",
    "summarized_story": "Ayo Adebanjo, Afenifere leader, says he warned the National Leader of the All Progressives Congress, Bola Tinubu, not to put his trust in President Buhari as the latter would never support his 2023 presidency ambition.\nAccording to Adebanjo, it is the turn of the South-East to produce the next president in the interest of fairness and equity.\nIt is not because they don’t know what is right.\nI said ‘he wants to make you President and yet he asked (Yemi) Osinbajo to contest?\nHe asked (Kayode) Fayemi to contest, he asked Amosun (Ibikunle) to contest?’ All in the West, why?"
  },
  {
    "headline": "2023: Buhari Asked Tinubu, Osinbajo, Fayemi, Others To Contest In Order To Divide South-West – Afenifere Leader, Adebanjo",
    "summarized_story": "Ayo Adebanjo, Afenifere leader, says he warned the National Leader of the All Progressives Congress, Bola Tinubu, not to put his trust in President Buhari as the latter would never support his 2023 presidency ambition.\nAccording to Adebanjo, it is the turn of the South-East to produce the next president in the interest of fairness and equity.\nIt is not because they don’t know what is right.\nI said ‘he wants to make you President and yet he asked (Yemi) Osinbajo to contest?\nHe asked (Kayode) Fayemi to contest, he asked Amosun (Ibikunle) to contest?’ All in the West, why?"
  },
  {
    "headline": "2023: Buhari Asked Tinubu, Osinbajo, Fayemi, Others To Contest In Order To Divide South-West – Afenifere Leader, Adebanjo",
    "summarized_story": "Ayo Adebanjo, Afenifere leader, says he warned the National Leader of the All Progressives Congress, Bola Tinubu, not to put his trust in President Buhari as the latter would never support his 2023 presidency ambition.\nAccording to Adebanjo, it is the turn of the South-East to produce the next president in the interest of fairness and equity.\nIt is not because they don’t know what is right.\nI said ‘he wants to make you President and yet he asked (Yemi) Osinbajo to contest?\nHe asked (Kayode) Fayemi to contest, he asked Amosun (Ibikunle) to contest?’ All in the West, why?"
  },
  {
    "headline": "Buhari, Tambuwal meet behind closed doors",
    "summarized_story": "President Muhammadu Buhari is currently in a closed-door meeting with Aminu Tambuwal, governor of Sokoto state.\nThe meeting is being held at the presidential villa in Abuja.\nOver the past months, Bukola Saraki, former senate president; Bala Mohammed, Bauchi governor; Tambuwal and Mohammed Hayatu-Deen, former managing director of the now-defunct FSB International Bank, held consultations across the country on consensus candidature.\nAdvertisementSaraki and Mohammed were announced as “northern consensus candidates” following a report released by Ango Abdullahi, elder statesman, last week.\nRaymond Dokpesi, PDP chieftain, distanced Atiku Abubakar, another presidential hopeful, from the arrangement."
  },
  {
    "headline": "Buhari, Tambuwal meet behind closed doors",
    "summarized_story": "President Muhammadu Buhari is currently in a closed-door meeting with Aminu Tambuwal, governor of Sokoto state.\nThe meeting is being held at the presidential villa in Abuja.\nOver the past months, Bukola Saraki, former senate president; Bala Mohammed, Bauchi governor; Tambuwal and Mohammed Hayatu-Deen, former managing director of the now-defunct FSB International Bank, held consultations across the country on consensus candidature.\nAdvertisementSaraki and Mohammed were announced as “northern consensus candidates” following a report released by Ango Abdullahi, elder statesman, last week.\nRaymond Dokpesi, PDP chieftain, distanced Atiku Abubakar, another presidential hopeful, from the arrangement."
  },
  {
    "headline": "Saraki: It's north-central's turn to lead... we've sacrificed for Nigeria",
    "summarized_story": "Bukola Saraki, former senate president, says it is the turn of the north-central to lead the country.\nSaraki, a presidential hopeful, spoke on Tuesday, in Jos when he addressed delegates of the Peoples Democratic Party (PDP) from Plateau.\n“You remember that before the national convention of our party, we held a meeting in Abuja with delegates of north-central extraction,” Saraki said.\n“The problem of insecurity in Nigeria is because there has been no accountability,” he added.\n“When I was senate president, we sat down with security agencies and drew a roadmap on how to address the issue of insecurity, but the report was abandoned."
  },
  {
    "headline": "Saraki: It's north-central's turn to lead... we've sacrificed for Nigeria",
    "summarized_story": "Bukola Saraki, former senate president, says it is the turn of the north-central to lead the country.\nSaraki, a presidential hopeful, spoke on Tuesday, in Jos when he addressed delegates of the Peoples Democratic Party (PDP) from Plateau.\n“You remember that before the national convention of our party, we held a meeting in Abuja with delegates of north-central extraction,” Saraki said.\n“The problem of insecurity in Nigeria is because there has been no accountability,” he added.\n“When I was senate president, we sat down with security agencies and drew a roadmap on how to address the issue of insecurity, but the report was abandoned."
  },
  {
    "headline": "Court asks senate to begin probe of CCT chairman for assaulting security guard",
    "summarized_story": "A federal high court in Abuja has refused to stop the senate from probing Danladi Umar, chairman of the Code of Conduct Tribunal (CCT), over his alleged misconduct.\nUmar in May 2021 instituted the suit against the senate, challenging the power of the upper legislative chamber to probe the assault allegation against him.\nAdvertisementThe senate committee on ethics had invited Umar over the incident, following a petition that was submitted to the committee.\nHe asked the court to determine if the assault case is a matter the senate is constitutionally empowered to investigate.\nThe four defendants in the matter are the senate, the senate president, the senate committee on ethics, privileges and public petitions, and the attorney-general of the federation."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Twitter accepts Elon Musk’s $44 billion offer to buy the company. Users are bracing for changes",
    "summarized_story": "Twitter has accepted Elon Musk’s offer to purchase the company for roughly $44 billion.\nThe social media platform disclosed in a press release today that Musk purchased the company at $54.20 a share, the same price named in his initial offer on April 14, 2022.\nIn the initial SEC filing, Musk expressed his plan to take the company private.\nParag Agrawal, Twitter’s CEO, appeared to support the move, saying in the press release that “Twitter has a purpose and relevance that impacts the entire world.\nLet’s see how the new owner of Twitter deal with fake accounts, spam bots and authenticating all human beings of this platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, It's the weekend again, and I've been looking forward to it!\nFirst off, thank you for sticking with me...."
  },
  {
    "headline": "How a search for infinite learning led Justin Irabor to the world of computer science",
    "summarized_story": "Full-stack engineer, TradeCoreHowever, despite the challenges and doubts about new ventures, he finds that he is fulfilled at the end of the day.\nFull-stack engineer, TradeCoreSoftware engineering called out to him when he was editor-in-chief at a startup, and every downtime had to be escalated to the technical team.\nI’m a full-stack engineer there.\nFull-stack engineer, TradeCoreAlthough Justin was sure about transitioning into software engineering, he didn’t escape the frustration that came with the move.\nBut Justin says his choice of Mogwai is to remind him to always take responsibility if he wants the best results."
  },
  {
    "headline": "Twitter may never be the same again",
    "summarized_story": "Nonetheless, I’m curious why he, a frequent Twitter user, would wake up one morning and say to himself, “I want to acquire Twitter.”I was kidding.\nAlso, he stated that he wants to combat trolls on Twitter and proposed changes to the Twitter Blue premium subscription service, such as lowering the price and banning advertising and adding Dogecoin as a payment option on Twitter.\nInterestingly, it appears he began considering the idea in 2017 when he declared his love for Twitter in a tweet.\nElon Musk takes over TwitterThe Twitter-Musk drama, which began with Tesla CEO, Elon Musk purchasing a 9.2 percent stake in Twitter, has seemingly ended.\nRecall that Twitter initially implemented a poison pill strategy that could thwart a takeover attempt by making it too expensive."
  },
  {
    "headline": "Why is Elon Musk buying Twitter?",
    "summarized_story": "Top on our list — surprise, surprise — is the Twitter sale.\nYesterday, April 25, 2022, Twitter’s board of directors announced that it had agreed to be acquired by an entity owned by Elon Musk, Tesla CEO, at approximately $44 billion.\nNot a bad return, considering the price hovered around $50 to $52 until trading on Twitter stock was stopped due to the impending sale.\nThis nicely segues into the upcoming Techpoint Africa Blockchain Summit holding on May 21, 2022, at Four Points by Sheraton.\nWhile you’re doing that, don’t forget to listen to all we discussed on Apple Podcasts, Google Podcasts, Spotify, or wherever you get your podcasts."
  },
  {
    "headline": "2023 Election: I can only contest if I am endorsed by the President-Jonathan – Nigerian Observer",
    "summarized_story": "The NIGERIAN OBSERVER gathered that Jonathan had informed some APC leaders that he would only join the presidential race if he was directly endorsed by the President, Major General Muhammadu Buhari (retd.).\nThe party chieftain stated, “I can tell you they are facing a tough task as far as Jonathan is concerned.\n“Another tough task the party may face is how it will convince other aspirants like Tinubu, Osinbajo, Amaechi, Umahi and Bello to step down.\nAnd for him to contest, he must have spent a year in the party and our primary will hold in the one month’s time.\nUntil he now proves to the whole world that he is a card-carrying member of the APC, it can’t be."
  },
  {
    "headline": "Falana condemns APC N100m nomination forms, As Party begins sale of forms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHuman rights Lawyer, Femi Falana, SAN, Sunday, condemned the APC for fixing the fees of its presidential nomination and expression of interest forms at N100m.\nHe, therefore, suggested that the APC and PDP should remove the “outrageous fees” and charge administrative fees of not more than N10,000 per aspirant.\nIn a statement he signed titled, ‘Illegality of outrageous nomination fees,’ he noted that the apparent endorsement of the controversial nomination fees by Buhari reeks of hypocrisy because, in 2014, he had told Nigerians that he had to borrow N27.5m to purchase his nomination form.\n“In this circumstance, political parties may only be permitted by law to charge administrative fees,” he said.\nConsequently, nomination forms for aspirants vying for the House of Assembly would be sold at the various state secretariats of the party nationwide while forms for other positions such as the House of Representatives, Senate, governorship and Presidency would be sold at the national secretariat, Abuja."
  },
  {
    "headline": "2023: Makinde invites PDP aspirants over party’s primary – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Governor of Oyo State, Seyi Makinde, has invited all aspirants who have the ambition to contest for different political positions in 2023.\nThe meeting which was scheduled to hold at the Oyo State Government House will commence at 11.am today.\nMakinde instructed all the aspirants to attend the meeting as all pending issues ahead of the 2023 primary of the party would be resolved.\nThe NIGERIAN OBSERVER gathered that the Governor invited the aspirants due to some discrepancies trailing the forthcoming primary of the party.\nIt was gathered that leaders and aspirants of the party in some constituencies are not in agreement with the candidates to flag the party’s flag due to some internal wrangling."
  },
  {
    "headline": "Obaseki pledges quality healthcare, as Edo begins free treatment, surgeries for heart, kidney, other ailments – Nigerian Observer",
    "summarized_story": "The beneficiaries during the five-day medical mission are to receive surgical interventions and treatments for heart, kidney, eye and other ailments.\n“The Nigerian professionals who are working with them are going to continue to be here; come for your follow-ups.\nThis mission is aimed at providing top of the range and critical medical services to the ordinary Edo citizens,” he added.\nThe governor further noted, “Nobody is going to come from anywhere in the world to treat us or give us care.\nWe have to do it ourselves and we’re lucky that some of the best people providing care for us around the world are our own children."
  },
  {
    "headline": "Police kill NSCDC officer in Imo, manhandle commandant",
    "summarized_story": "It was mayhem in Imo State on Monday when heavily armed policemen invaded the Imo State Command of the Nigeria Security and Civil Defence Corps (NSCDC), manhandled the state commandant and allegedly killed his orderly.\nThe NSCDC commandant was dragged out in his boxers and beat him several civil defeders were injured in the incident, Leadership reported.\nThe incident happened at the Imo State Command Headquarters, located at the very busy Okigwe Road, along Works Layout in Owerri.\n“On reaching the Corps office, while the commandant made to enter the command, the man blocked the NSCDC boss, brought out a pistol and announced that he was a police officer.\nIt was also gathered that the enraged MOPOL officers who threatened to shoot at the state commandant allegedly boasted that nothing will happen."
  },
  {
    "headline": "Tricycle operators decry multiple ticketing, appeal to govt to intervene [Videos]",
    "summarized_story": "Adebayo ObajemuThere were protests by tricycle operators Tuesday morning at Ile Epo, Abule Ẹgba, Ekoro and Àgbàdo parts of Lagos over what they called multiple ticketing by boys loyal to Alhaji Musiliu Akinsanya, alias MC Oluomo.\nSpeaking with this medium, the protesting tricycle operators decried what they called regime of double taxation in the hands of thugs allegedly brought from Oshodi by Akinsanya to double ticket them.\nThis development, according to them came about when Alhaji Akinsanya took over the parks in the areas mentioned early last week.\nIt was learnt that under Alhaji Abiola Istijabah, there was nothing like multiple ticketing.\n“In the old order, many a time we would approach Alhaji Istijabah for help concerning our children school fees, and he would gladly do so."
  },
  {
    "headline": "Nigerians now consume 74 million litres of petrol daily – NNPC",
    "summarized_story": "The quantity of premium motor spirit (PMS), popularly called petrol, consumed in Nigeria each day, has risen from 72.07 million litres a day in December 2021 to 74 million litres per day as at the week ended April 3, 2022.\nThis according the weekly National PMS Evacuation Report for the 21st of March-3rd of April 2022 released by the Nigerian National Petroleum Company (NNPC).\nThe report said 36 states along with the Federal Capital Territory, FCT, received a total of 1.03 billion litres of petrol in 14 days.\nIt also said the average national daily evacuation for the period stood at 73.5 million litres.\nFurther breakdown of the report shows that Lagos, Kano and Niger states topped the list of high demand states, with 170.4 litres, 83.612 litres and 82.271 litres respectively, while Yobe (4.2 million), Bauchi (2.4 million) and Jigawa (1.32 million) stay at the bottom as low demand states."
  },
  {
    "headline": "Nigerian Breweries shareholders approve N12.92bn dividends payout",
    "summarized_story": "Nigerian Breweries (NB) Plc shareholders have approved a dividend payout of N12.92 billion for the 2021 financial year.\nThis is the company’s management assured the shareholders of its commitment to continue to deliver maximum returns for the shareholders’ investments.\nShareholders who spoke at the meeting described the total dividend payout to shareholders as a step in the right direction following an impressive financial performance recorded by the company in the 2021 financial year.\nThe company secretary/Legal director, Nigerian Breweries, Uaboi Agbebaku, affirmed that the company’s management remains committed to consistently delivering superior value to shareholders and taking decisions in their best interest, expressing optimism that the company would continue to witness growth.\nAccording to the 2021 financial year result, marketing, distribution, and administrative expenses rose from N89.66 billion in the 2020 financial year to N123.14 billion in the 2021 financial year, representing a 37.3 per cent increase"
  },
  {
    "headline": "Farmers Applaud CBN’s Interventions In Grain Production, Urge Expansion Of ABP",
    "summarized_story": "Farmers in Nigeria have commended input and market linkage interventions of the CBN, calling on the Federal Government to spread the coverage of the Anchor Borrowers’ Programme (ABP) to every state of the country following good results in rice and maize production.\nAlthough the country is said to be deficient in the two commodities, production have increased significantly through the ABP.\nThe farmers lamented that seeds, fertiliser and other inputs for food crop production have become too expensive, and escalating assistance to them through the ABP scheme is not only desirable but also expedient for the country.\nThe farmers include grain, cereal, cassava, cocoa, yam and sweet potato farmers, among others.\nA maize breeder at the Institute of Agricultural Research and Training, Prof. Samuel Olakojo, said improved seeds and new production technologies would boost productivity of farmers and ensure closing the production gap."
  },
  {
    "headline": "EFCC Arrests Man, 30, For Allegedly Defrauding Kwara Monarch N33.3m",
    "summarized_story": "The victim, Alh Idris Sero Abubakar, is the Emir of Okuta in Baruten local government area of the state.\nThe Head, Media and Publicity of EFCC, Wilson Uwujaren, made the disclosure in a statement on Monday.\n“The monarch stated that the syndicate provided different accounts for him to pay ‘the money for the clearance of the goods’, one of which included that of Fidelis Poor.\n“He further stated that efforts to get the goods delivered or recoup his money had been unsuccessful, hence he petitioned the EFCC.\n“The Commission upon the receipt of the petition commenced discrete investigation into the matter, which led to his (Fidelis) arrest,” Uwujaren stated."
  },
  {
    "headline": "Security Operatives Begin Manhunt For Operators Of Illegal Refineries In Imo",
    "summarized_story": "Three days after over 100 persons lost their lives at an illegal refinery site, which exploded in Abaezi forest located in Ohaji/Egbema local government area of Imo State, security operatives have begun a manhunt for operators of illegal refineries in the State to avert a repeat of such tragedy.\nThe victims were burnt beyond recognition following fire outbreak on Friday night.\nAccording to him, fumigation will commence immediately after the mass burial of the victims.\n“Government has directed security agencies in the state to intensify their search for the owners of the illegal refineries and ensure their immediate arrest and trial.”Emelumba explained that government had directed security agencies to comb all parts of the state and rid it of any illegal refinery for the safety of citizens and economic growth of Nigeria.\nMeanwhile, an indigene of the community, Dr Declan Emetuche, during a phone-in programme on Hot FM Owerri, indicted the state government over illegal refineries, saying they ought to know all the activities in the state."
  },
  {
    "headline": "Security Operatives Begin Manhunt For Operators Of Illegal Refineries In Imo",
    "summarized_story": "Three days after over 100 persons lost their lives at an illegal refinery site, which exploded in Abaezi forest located in Ohaji/Egbema local government area of Imo State, security operatives have begun a manhunt for operators of illegal refineries in the State to avert a repeat of such tragedy.\nThe victims were burnt beyond recognition following fire outbreak on Friday night.\nAccording to him, fumigation will commence immediately after the mass burial of the victims.\n“Government has directed security agencies in the state to intensify their search for the owners of the illegal refineries and ensure their immediate arrest and trial.”Emelumba explained that government had directed security agencies to comb all parts of the state and rid it of any illegal refinery for the safety of citizens and economic growth of Nigeria.\nMeanwhile, an indigene of the community, Dr Declan Emetuche, during a phone-in programme on Hot FM Owerri, indicted the state government over illegal refineries, saying they ought to know all the activities in the state."
  },
  {
    "headline": "Extortion: Police Dismantle Illegal Checkpoints On Port Access Roads",
    "summarized_story": "Truck Owners operating at the Lagos Ports – Apapa and Tin Can Island – can now heave a sigh of relief as the Assistant Inspector General of Police (AIG), Zone 2 Command, Bode Adeyinka Adeleke, and his counterpart in the Maritime Police Command, Ibrahim Kaoje, have directed immediate dismantling of illegal checkpoints on the port access roads.\nThe NPA management, however, enlisted the support of the police high command in curbing the activities of extortionists and other forms of illegalities along the roads leading to Apapa and TinCan Island Port Complex.\nAlso, the managing director, NPA, Mohammed Bello Koko, while receiving Adeyinka and Kaoje, lamented the proliferation of illegal checkpoints along the port corridors.\nHe, however, enjoined the two AIGs to join the NPA management on a spot check of the port access roads to ascertain the reality on ground.\nBut, with the current partnership between the NPA and the two Police Commands whose jurisdictions cover the Lagos maritime logistics ring, it is expected that extortion will be a thing of the past."
  },
  {
    "headline": "S3x Video: Father Of Chrisland School Girl Finally Speaks On Her Apology Post",
    "summarized_story": "Punch Newspapers had reported that the pupil deleted her videos on her known Likee page where she had over 12400 fans.\nHowever, her father said it’s been two weeks since she touched a phone or used the Internet.\nThe father said, “My daughter has never touched the phone for the past two weeks.\nShe has never touched anything Internet; those accounts are fake and we have deleted them as of Friday, 87 fake accounts.\nI said which chatting, my daughter is with me now and doesn’t have any phone with her."
  },
  {
    "headline": "Alaafin’s wives can remarry only if – Oyo Ifa priest",
    "summarized_story": "Oloris’ fateIfayemi Elebuibon, an Ifa priest, in an exclusive interview with PREMIUM TIMES on Monday, spoke about the position of the Yoruba tradition regarding the fate of the late monarch’s wives.\nMr Elebuibon, based in Oyo State, said the queens could either remarry after the late king’s burial rites or remain in the palace where the new king would inherit them as his wives.\nHe explained that the wives of the Alaafin could only remarry after fulfilling traditional sacred rites of atonements and disassociating themselves from the palace.\nBurial rites, transition of powerThe Ifa priest also said the traditional burial ceremony and rites of the late monarch have since commenced.\n“It is the third day already, and every day comes with its traditional rites and rituals."
  },
  {
    "headline": "Gospel Singer, Osinachi’s Autopsy Report Out",
    "summarized_story": "The case of the late gospel singer of Dunamis International Gospel Centre, Osinachi Nwachukwu has been transferred to the Directorate of Public Prosecutions.\nWhile her husband, Peter, was arrested after the younger brother of the late singer reported the matter to the police.\nThe case was transferred from the Lugbe Police Division to the State Criminal Investigation Department the following day.\nHowever, the Federal Capital Territory Police Command, Public Relations Officer, Josephine Adeh, on Monday said that the autopsy report had been released.\nFollowing her death, Osinachi’s family was said to have demanded that an autopsy be carried out to ascertain the cause of death."
  },
  {
    "headline": "Buhari’s Acclaimed Praise Singer, Rarara Tackles President In New Song",
    "summarized_story": "President Muhammadu Buhari’s acclaimed praise singer, Dauda Kahutu, popularly known as Rarara, has spoken against what he perceived as the shortcoming of the current administration in a new song.\nRecall that angry youth in Katsina State attacked the musician while he was shooting a video for the president.\nThe aggrieved youths, upon seeing the singer, started shouting and condemning him in Hausa language.\nIn 2020, Rarara began a movement asking Nigerians to sponsor his next album (harp-song) with a token of N1000 each.\nThe singer said he wanted the public to sponsor a song that will highlight the achievement of the Buhari-led administration."
  },
  {
    "headline": "World Malaria Day: US pledges support as Nigeria ranks highest globally, loses 200,000 lives, spends N646bn annually to tackle scourge",
    "summarized_story": "The World Health Organisation (WHO) announced this figure Monday during the celebration of the World Malaria Day (WMD).\nMoeti further said the past year had witnessed significant breakthroughs in malaria prevention and control, despite of the COVID-19 pandemic.\n“Landmark recommendations on the use of the first vaccine against malaria, RTS,S were released by WHO late last year.\n“Nigeria accounts for about 31.9 per cent of the global malaria deaths; this is approximately 200,000 deaths in 2021.\n“Through PMI funding and programs, 58 million bed nets, 130 million fast acting medicines, and 82 million malaria test kits have been delivered to clinics and communities since 2011."
  },
  {
    "headline": "NEF to Presidency: Leave Kukah out of weapon-delivery delay",
    "summarized_story": "The Northern Elders Forum (NEF) Monday told the All Progressives Congress (APC)-led government to leave Catholic Bishop of Sokoto Diocese Matthew Hassan Kukah out of the issues around delay in delivery of weapons from the western countries.\nNEF Director of Publicity and Advocacy Hakeem Baba-Ahmed stated this during a television interview on the African Independent Television, AIT, monitored by Blueprint in Abuja.\nBaba-Ahmed said: “You know, the presidency spokespersons have a way of deflecting criticism by making it personal.\n“People like Bishop Kukah and I, are used to this.\n“So, whether it comes from Bishop Kukah, or it comes from me, we made this point."
  },
  {
    "headline": "Confusion, stampede as hoodlums invade Owerri at noon, residents scamper for safety",
    "summarized_story": "There was stampede in Owerri, the Imo state capital when sporadic gunshots were heard Monday afternoon.\nBlueprint reports that as soon as the sound reverberated, business outfits around popular Okigwe road, works layout and Imo State University (IMSU) junction stood still.\nIt was also gathered that security operatives at the Owerri Correctional Centre, close to the Government House, replied with gunshots, obviuosly to signal their readiness to ward off a possible attack.\nAs at the time of filing this report, no casualty was reported, and no statement had come from the Imo state Police command on what transpired or the cause of the shootout.\nShare this: TwitterFacebook"
  },
  {
    "headline": "A’Ibom govt. to use review of land administration law to tackle crime",
    "summarized_story": "By Emeka Samuel,UyoAkwa Ibom state government has said it would review its law of land administration to ensure speedy utilization of land allocations following the menace of hoodlums on abandoned government lands.\nEkong expressed regret that the necessary government implementation authorities and security agencies have not done enough to arrest the situation, hence the need for a review of the land administration law.\n“The power of land administration is with the government, if they have decided to allocate land for which ever purposes, that becomes law and it then becomes enforceable and whoever tries to play with the law will face judgement.\nThose are mainly the cases here, and encroachment on government owned land, selling of scraps and illegal motor parks by the Hausa people.\n“We have received reports about certain criminal acts going on around Nasarawa area."
  },
  {
    "headline": "Wema Bank debunks money laundering, bribery allegations",
    "summarized_story": "By Kehinde Ibrah9im, LagosWEMA Bank says its attention has been drawn to recent reports in the media regarding money laundering and bribery allegations on a customer’s transaction.\nIt said in a statement that the publication went ahead to mention the names of certain Wema Bank management staff who were allegedly involved in the said transaction.\nThe statement said, “The bank wishes to state categorically that there is no merit in the article, and it is a malicious publication against members of our staff and the bank’s customer.\nMIK/B/6/2022–Commissioner of Police vs. Adewole Isaac & Kingsley Ananwude, for alleged stealing and money laundering involving N1.7bn was struck out by Magistrate A.O.\nThe bank has already engaged its solicitors to institute appropriate legal action.”"
  },
  {
    "headline": "Works ministry concludes evaluation for the first phase of the VAC’s RFP Submissions",
    "summarized_story": "By Chioma NnodimFederal Ministry of Works and Housing has concluded evaluating proposals submitted for phase one of the Value-Added Concession, VAC, under the Highway Development and Management Initiative, HDMI.\nThe ﬁrst phase of the VAC under the HDMI seeks to concession 12 economically viable road corridors to technically and ﬁnancially capable private sector firms/consortia.\nThe 12 highways represent 1,963km or 5.6% of Nigeria’s 35,000km Federal Highway as follows:Benin-Asaba, Abuja-Lokoja, Kano-Katsina, Onitsha-Owerri-Aba, Sagamu-Benin and Abuja-Keffi-Akwanga Highways; the others are Kano-Maiduguri, Kano-Shuarin, Kano-Maiduguri, Potiskum-Damaturu, Lokoja-Benin, Enugu-Port Harcourt, Ilorin-Jebba, Lagos-Otta-Abeokuta and Lagos-Badagry-Seme Border.\nSpeaking, the Head, PPP Unit, FMWH, Abimbola Asein, disclosed that the Project Delivery Team, PDT, had concluded the evaluation of the Bidders’ technical and Financial proposals and proposed Preferred/Reserved Bidders had been identified.\nThe RFP documents were then issued out to the 18 prequalified bidders on October 29, 2021, through the HDMI portal."
  },
  {
    "headline": "PenCom approves Norrenberger’s acquisition of IEI-Anchor Pension",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE National Pension Commission on Tuesday approved Norrenberger’s acquisition of IEI-Anchor Pension.\nA statement from the firm on Sunday said by this move, Norrenberger through its acquisition of IEI Insurance, had become the largest shareholder of the Pension Fund Administrator.\nIt stated, “Norrenberger has obtained all necessary approvals from the Federal Competition and Consumer Protection Commission, the Securities and Exchange Commission, and the National Insurance Commission for the acquisition.\nIt would aggressively create and develop new opportunities for its stakeholders by utilising technology and other digital assets to revolutionise the pension and insurance markets.\n“We are looking forward to the exciting opportunities which this acquisition would provide.” Norrenberger is a leading, independent financial services group, the statement said."
  },
  {
    "headline": "Earnings: Unilever swings back to profitability",
    "summarized_story": "However, despite the challenges, Unilever Nigeria Plc, which has for considerable period seen losses in earnings, has, during the half year 2020 swung back to profitability.\nUnilever reported a loss after tax of N1.54 billion for the nine months ended September 30, 2020, against loss of N3 billion in 2019.\nUnilever Nigeria posted N714.780 million profit after tax for the half year ended June 30, 2021, against a loss after tax of N519.112 reported in 2020.\nUnilever Nigeria recorded a turnover of N58.7 billion in the third quarter of 2021, compared to N44.7 billion recorded in the corresponding period in 2020.\nThe firm saw a profit of N3.409 billion for the year against a loss of N3.965 billion recorded in 2020."
  },
  {
    "headline": "Alleged Assault: CCT Chairman, Danladi Umar Fails In Bid To Stop Senate Probe",
    "summarized_story": "A Federal High Court in Abuja says the Nigerian Senate has the power to investigate Chairman of the Code of Conduct Tribunal, Danladi Umar over the case of an alleged assault on a security guard at a shopping mall in Abuja.\nThe court subsequently dismissed the suit by Mr Umar seeking to stop his investigation by the Senate Committee Ethics, Privileges and Public Petitions, for lacking in merit.\nRead Also: Alleged N266.5m Fraud: Court Refuses Bail Application For Fake Army GeneralThe CCT Chairman had challenged among other things, the powers of the Senate to investigate him in an alleged assault perpetrated against a security guard at Banex Plaza in Abuja.\nAccording to Sargwak, the CCT boss assaulted him while undergoing his lawful activities after he informed him that his car was wrongly parked.\nThe victim, therefore, asked the Senate to ensure justice is done over his case."
  },
  {
    "headline": "Trump Rules Out Twitter Return As Musk Announces $44 Bn Purchase",
    "summarized_story": "Former US President Donald Trump vowed he would not be returning to Twitter if his account was reinstated following the purchase of the platform by tech billionaire Elon Musk, announced on Monday.\nThe Republican leader said he would be using his own site, Truth Social, although he appears only to have posted once since its launch in February.\n“I am not going on Twitter, I am going to stay on TRUTH,” Trump said, according to FoxNews.com, adding that Musk was a “good man” who would improve the service.\n“We’re taking in millions of people, and what we’re finding is that the response on TRUTH is much better than being on Twitter.\nLawmakers have called for the modification or repeal of a 1996 law shielding social media platforms from liability over their content moderation practices and for the postings of third parties."
  },
  {
    "headline": "2023: I’m Contesting In Order Not To Betray Nigerians – Osinbajo",
    "summarized_story": "﻿Vice-President Yemi Osinbajo on Monday said it will be a betrayal to Nigeria if he doesn’t contest the presidency in the 2023 general elections.\nSpeaking during a visit to Ondo State Governor, Rotimi Akeredolu and stakeholders of the All Progressives Congress (APC) in the state, Osinbajo said aside from his current position, having served as acting president for months has also given him the needed experience to lead Nigeria.\nREAD ALSO: 2023: Amaechi Visits Ondo Traditional Ruler, Pledges To Construct Railways If Elected President“Many people are dying for the country every day.\nI declare my intention based on the fact that I have served for over seven months as acting president.\nSince Osinbajo announced his intention to run for president on April 11, he has been travelling round the country to seek support for his ambition."
  },
  {
    "headline": "Alleged N266.5m Fraud: Court Refuses Bail Application For Fake Army General",
    "summarized_story": "Justice Oluwatoyin Taiwo of the Special Offences Court sitting in Ikeja, Lagos, has dismissed the bail application filed by a fake Army General, Bolarinwa Abiodun.\nJustice Taiwo had, on April 14, heard his bail application, which was moved by his counsel, Kayode Lawal.\nCounsel for the EFCC, Rotimi Oyedepo, however, opposed the bail application.\nAnd we assure my lordship that there will not be any delay.”Thereafter, Justice Taiwo had adjourned till April 25, to rule on the bail application.\n“Though the offences against the defendant are bailable, I am inclined to refuse the application for bail and order an accelerated hearing."
  },
  {
    "headline": "Nearly 5.3 Million Flee Ukraine War As Refugees – UN",
    "summarized_story": "Nearly 5.3 million Ukrainians have fled the country since Russia launched its invasion two months ago, the UN said Tuesday, warning that three million more were expected to follow this year.\nUNHCR spokeswoman Shabia Mantoo said the new projection of 8.3 million Ukrainian refugees was a planning figure, and that it was unclear when it would be reached amid a “highly dynamic” situation.\nBeyond the refugees, the IOM estimates more than 7.7 million people have been displaced within Ukraine.\nHere is a breakdown of how many Ukrainian refugees have fled to neighbouring countries, according to UNHCR:– Poland –Nearly six out of 10 Ukrainian refugees — 2,922,978 so far — have crossed into Poland, according to UNHCR numbers up to April 25.\nBefore the war, Poland was home to around 1.5 million Ukrainians, chiefly migrant workers."
  },
  {
    "headline": "I Will Betray Nigerians If I Don't Contest-Osinbajo -",
    "summarized_story": "Vice President Yemi Osinbajo on said that he would be betraying Nigerians if he failed to contest for president.\nOsinbajo stated this in Akure, the Ondo State capital when he visited Governor Oluwarotimi Akeredolu to expressed his intension to succeed President Muhammadu Buhari in 2023.\nHe admitted that he was given responsibilities by President Buhari to run the affairs of the nation as an acting president.\nThe vice president disclosed that President Buhari only charged him to be fair and just while in charge.\nAccording the vice president, “It’s an opportunity to be called to public service."
  },
  {
    "headline": "There's little or no difference between APC, PDP",
    "summarized_story": "Veteran Journalist, Babajide Kolade-Otitoju, has described the ruling All Progressives Congress and the People’s Democratic Party as inseparable couple whose ideologies are the same.\nHe made this disclosure while featuring on a live streaming show, #IssuesWithJide on Saturday.\nMr Kolade-Otitoju says there is little or no difference between the two parties."
  },
  {
    "headline": "2023: PDP row thickens as NEF disowns Bala, Saraki",
    "summarized_story": "The Northern Elders Forum (NEF) distancing itself from the purported consensus among some presidential aspirants within the People’s Democratic Party.\nThe quartet of Sokoto state Governor Aminu Waziri Tambuwal, Bauchi state Governor Abdulkadir Bala Mohammed, former Senate President Abubakar Bukola Saraki and renown economic expert and seasoned banker, Mohammed Hayatuo-Deen, had traversed the length and breadth of the country championing the consensus arrangement.\nBut the arrangement collapsed when the duo of Bala and Saraki from the North-east and North-central respectively, were announced by a committee of northern leaders and presidential aspirants within the party."
  },
  {
    "headline": "APC, PDP have monetised democracy in Nigeria",
    "summarized_story": "Veteran Journalist and Public Affairs Analyst, Babajide Kolade-Otitoju has accused the All Progressives Congress and the People’s Democratic Party of monitising democratic with their extravagant nomination form fees.\nHe made this known on Saturday while tearing on his show “Issues With Jide” an online programme that streams on TVC News Youtube Channel.\nThe Kogi-born journalists said the current fees released by the two parties for nomination forms clearly show democracy has been monitised in Nigeria."
  },
  {
    "headline": "Trump Held in Contempt, Fined $10,000 a Day Until He Complies with Probe",
    "summarized_story": "A New York judge on Monday held former President Donald Trump in contempt of court for not producing documents subpoenaed in the state attorney general’s civil probe of his business practices, and ordered Trump to be fined $10,000 per day until he complies.\nI hereby hold you in civil contempt,” the judge said, although Trump himself was not in the courtroom.\nTrump intends to appeal the contempt ruling, said his attorney Alina Habba.\nHabba told the judge that Trump did indeed comply with the subpoena, but that he did not have any documents responsive to James’ request.\nManhattan District Attorney Alvin Bragg said this month that probe is ongoing despite the departure of its two top lawyers."
  },
  {
    "headline": "In Escalation of Rhetoric, Russia Cites ‘Real’ Risk of Nuclear War",
    "summarized_story": "Moscow accused NATO of engaging in a proxy battle against Russia by arming Ukraine, saying this had created a serious and real risk of nuclear war.\n“NATO, in essence, is engaged in a war with Russia through a proxy and is arming that proxy.\n“Lavrov’s trademark over the course of 15 years or so that he has been the Russian foreign secretary has been that sort of bravado.\nIts defence ministry said it had destroyed six facilities powering railways used to deliver foreign weapons to Ukrainian forces.\nUkrainian forces have repelled five Russian attacks and killed just over 200 Russian servicemen, said the Ukrainian military command in the southern and eastern sectors."
  },
  {
    "headline": "UN Chief Embarks on Moscow Trip Amid Criticism",
    "summarized_story": "UN Secretary-General Antonio Guterres will start a difficult three-day trip to Russia and Ukraine on Tuesday amid criticism for the limited role played by the United Nations in the management of the crisis.\nBut the Secretary-General’s decision to kick off the first leg of his trip at the Kremlin has caused upset in Ukraine.\nlined diplomatically in the peace talks led by Turkey.\n“Mr Guterres is in a difficult position, because neither country is willing to hold peace talks,” said Rickli.\nAlthough China has called for peace talks, it has not condemned Russia’s actions in Ukraine."
  },
  {
    "headline": "Nigeria: OPEC Mourns Over 100 Persons Killed in Imo Explosion",
    "summarized_story": "The Organisation of Petroleum Exporting Countries (OPEC) on Monday commiserated with the people and government of Imo State, over last weekend’s fire which was reported to have consumed over 100 persons.\nRelatedStories No Content AvailableThese include the Nigerian National Petroleum Company (NNPC) Limited, the Nigerian Upstream Petroleum Regulatory Commission (NUPRC) and the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA).\nIllegal refining is attractive as in parts of the oil-rich Niger Delta as it is seen as being relatively easy to pull off, despite efforts to halt the practice.\nDozens of people were thought to have been working at the illegal refining plants when they were caught in the huge fire.\n“Please accept, Your Excellency, the renewed assurances of my highest consideration and esteem,” the Nigerian-born OPEC chief noted."
  },
  {
    "headline": "EFCC Moves Against Money Laundering in Nigeria’s Real Estate Sector",
    "summarized_story": "The Chairman of the Economic and Financial Crimes Commission, (EFCC), Mr. Abdulrasheed Bawa, on Monday said the Commission was determined to combat money laundering and terrorism financing in the real estate sector of the economy.\nHe spoke in Abuja, at a workshop organised by the Inter-Governmental Action Group against Money Laundering in West Africa (GIABA).\nHe said the Nigeria Evaluation Report showed that the real estate sector was the second most vulnerable sector to money laundering practices in Nigeria.\nBawa, who spoke through his Chief of Staff, Hadiza Gamawa Zubairu, stated that based on the existing realities of the real estate sector, the EFCC, “would leave no stone unturned in combating money laundering practices in the sector”.\n“This indeed has provided useful intelligence and goes to show the level of commitment that EFCC has in the real estate sector,” he said."
  }
]