[
  {
    "headline": "2023: Group unveils Rescue Nigeria Mission for Yahaya Bello in Kano",
    "summarized_story": "The Rescue Nigeria Mission, a movement mobilising for the emergence of Gov.\nYahaya Bello of Kogi as Nigeria’s next President, on Saturday, held a town hall meeting with women and youths in Kano.\nHe said: “If Bello can provide solution to numerous challenges confronting Kogi , we have no doubt that he can answer the questions of Nigeria.\nKogi is the only state that borders 10 states, including FCT, making the state a mini Nigeria.\n“Kogi used to be the nerve centre of security threat, that was before Bello took over the mantle of leadership."
  },
  {
    "headline": "AU expresses concern over security situation in Africa",
    "summarized_story": "Chairperson of the African Union (AU) Commission, Moussa Faki Mahamat, on Saturday, expressed concern over the security situation in the continent.\nAddressing the 35th Ordinary Session of the AU Assembly in Addis Ababa, Mahamat said “the security situation in the continent today is deeply marked by terrorism and the dangerous resurgence of unconstitutional changes of governments.”Chairperson of the pan-African bloc said terrorism and violent extremism was Africa’s security challenge in 2021, with international terror links embedded in east, west, and southern Africa.\n“The security situation on the continent now calls for a real new approach which should question our peace and security architecture and its correlation with the new destabilizing factors in Africa,” Mahamat said.\nThe chairperson further said financing the continent’s development through an energetic fight against illicit capital flows and establishment of African financial institutions remained a greater challenge to Africa.\n(Xinhua/NAN)"
  },
  {
    "headline": "NDDC now messier than when Buhari ordered forensic audit ― Agitators",
    "summarized_story": "As it stands now, Niger Deltans have lost confidence in the Minister of Niger Delta Affairs and the outcome of the forensic audit.\n“He has succeeded in running the NDDC aground by putting everybody in the Niger Delta in an autoroute mood of imminent violence and anarchy.\nIt is glaringly clear that somebody has succeeded in arm twisting Mr President to concede the supervision of the NDDC to himself, which is now administered as a private owned company.\n“Nigerians and Niger Deltans knows the truth and cannot be hoodwinked by the bogus, frivolous and politically motivated forensic audit that was done to muzzle Niger -Deltans under Akpabio’s political dominance.\n“The president should do the needful to avoid Niger Delta youths going back to the dark days of old,” the group warned."
  },
  {
    "headline": "Shonekan: Catalyst for stability, progress — Diya",
    "summarized_story": "Ernest ShonekanBy James Ogunnaike, ABEOKUTAA former Chief of General Staff, Lt. Gen. Oladipo Diya (rtd) has described the former Chairman of the Interim National Government, late Chief Ernest Adegunle Shonekan as a catalyst for stability and progress.\n“Then came in Chief Ernest Shonekan, The Abese of Egba land.\n“As the icon was laid to rest yesterday, February 4, it is instructive to note that Chief Ernest Shonekan was not new to stepping into turbulent situations to calm the tides.\n“Chief Ernest Shonekan and I were close.\n“For Chief shonekan: he came, he saw and he conquered."
  },
  {
    "headline": "Egbin fire: How we saved national grid from total collapse ― TCN",
    "summarized_story": "Explains load shedding in Lagos axisAs one unit of 180MW restoredBy Chris Ochayi – AbujaThe Transmission Company of Nigeria, TCN, has explained that the ongoing load shedding in Lagos axis was as a result of fire that gutted Egbin power station this week Wednesday.\nShe said with the shutdown of the units, a total of 630MW was removed from the grid.\n“With the shutdown of the units, a total of 630MW was removed from the grid.\n“Meanwhile, Egbin Power Station is working assiduously to ensure a full restoration of its generating units to the grid and until this happens, TCN will continue to do all it can to keep the grid stable.\n“TCN will continue the evacuation of generated power from Egbin Power Station as soon as the station resumes power generation”."
  },
  {
    "headline": "14 Edo Assembly members-elect seek Ayu’s intervention on exclusion from parliamentary duties",
    "summarized_story": "By Dirisu YakubuThe 14 Edo House of Assembly members-elect excluded from inauguration by Governor Godwin Obaseki a few years ago, have written to the national chairman of the Peoples Democratic Party, PDP, Senator Iyorchia Ayu to cause the governor and the deputy governor, Mr. Philip Shaibu to come to their aid.\nIn a petition dated 4th February 2022 and signed by Rt.\nVictor Sabor Edoror, on behalf of the 14 All Progressives Congress, APC members titled “Re unlawful exclusion of 14 elected APC members of Edo state house of Assembly from parliamentary duty” asked Ayu to use his good office to prevail on Obaseki and Shaibu to bring about their integration in to the Edo State House of Assembly.\nAlso Read:2023: Sanwo-Olu rejects PDP 2nd term offer“Representations were severally also made to the National Assembly and members recommended that a proper inauguration be done, but all these were ignored by Governor Obaseki.\n“The Edo Governor and his Deputy similarly did not comply with this advisory of the highest national legal authority, to integrate Edo House of Assembly members, as the law requires.”Vanguard News Nigeria"
  },
  {
    "headline": "Chinese President congratulates African countries, others on the opening of 35th African Union Summit",
    "summarized_story": "Chinese President Xi Jinping on Saturday warmly congratulated the African countries and people on the opening of the 35th African Union (AU) Summit.\nIn his congratulatory message to the AU Summit, Xi pointed out that this year marks the 20th anniversary of the AU’s founding, and that over the past 20 years, the AU has stayed committed to seeking strength through unity, actively explored a development path suited to Africa, facilitated important progress in regional integration and coordinated a concerted response from African countries to the COVID-19 pandemic.\nSuch efforts have proven effective in maintaining peace, stability and development in Africa, and have won Africa growing influence and stature in the world, Xi said.\nThe year of 2021 witnessed robust growth in China-Africa relations, Xi stressed.\nNoting that the Eighth Ministerial Conference of the Forum on China-Africa Cooperation (FOCAC) was successfully held in November last year, Xi said that he announced during the conference nine programs for cooperation with Africa in the next three years, and that he, together with African leaders, expressed their unanimous support for building a China-Africa community with a shared future in the new era."
  },
  {
    "headline": "Buhari in a hurry to develop Nigeria – Lawan",
    "summarized_story": "The President of the Senate, Ahmad Lawan has said that the government of President Muhammadu Buhari is in a hurry to develop Nigeria.\nLawan made the remarks on Saturday while on a visit to Kwara State to witness the launch of the 2022 Empowerment Programme of Senator Sadiq Suleiman Umar who is representing Kwara North.\nThe event was also witnessed by the State Governor, Abdulrahman Abdulrazaq held at the Kwara State Polytechnic.\n“The Federal Government of President Muhammadu Buhari is in a hurry.\nWe are in a hurry to develop Nigeria."
  },
  {
    "headline": "Yobe: Suspected criminal disguising as taxi driver in Damaturu – YOROTA warns residents",
    "summarized_story": "The management of the Yobe State Road Traffic Agency (YOROTA) has warned residents of Damaturu, the state capital, against boarding unregistered taxis at night.\nThe agency posted, “Report just reached us of a suspected criminal operating taxi service this night”.\nYOROTA gave the description of the vehicle that the suspect is using to rob his passengers.\nThe agency then warned the general public to desist from boarding any taxi without approved government specifications.\n“However, YOROTA Marshalls hare been deployed to strategic places to apprehend the suspect”, it posted."
  },
  {
    "headline": "Rail project will go beyond Daura before Buhari’s tenure ends – Amaechi",
    "summarized_story": "The Minister of Transportation, Chibuke Rotimi Amaechi, has announced that the ongoing rail project leading to Niger Republic will exceed Daura, Katsina State, before the end of President Muhammadu Buhari’s tenure.\nAmaechi, who arrived at the Katsina Government House in the company of the Minister of State for Labour & Productivity, Festus Keyamo among other prominent politicians, made the remark while on a courtesy call to the State Governor, Aminu Bello Masari.\nAmaechi was turbaned by the Emir of Daura as the “Dan Amanar Daura” (trusted son) in Katsina on Saturday.\nHe expressed gratitude for the gesture and confidence reposed on him by the Daura Emirate.\nResponding, Governor Masari, while congratulating him on the achievement noted that his “sincerity was what earned him the traditional title."
  },
  {
    "headline": "Ritual killers are Muslims, Christians – Traditionalists",
    "summarized_story": "Traditionalists in Ogun State have distanced themselves from various cases of ritual killings happening in the state, saying those behind the nefarious act are Muslims and Christians.\nThe idol worshippers said those killing fellow human beings for money rituals are Muslims and Christians, who they said have infiltrated them.\nBalogun opined that the names of those who have been arrested for ritual killings so far have shown that they are either Muslims or Christians.\nBalogun said: “There is a difference between a Babalawo and an idol worshipper.\nPeople from the borrowed religions are the ones doing all these ritual killings."
  },
  {
    "headline": "Constitution amendment: N’Assembly to create roles for traditional rulers",
    "summarized_story": "President of the Senate, Ahmad Lawan on Saturday said the National Assembly will make a case for official roles for the traditional rulers in the ongoing review of the Nigerian constitution.\nThe Senate President said the ninth National Assembly believed that the roles now being played by traditional rulers should be accorded recognition in the Constitution so that they could play the roles even better.\n“We believe that these roles must be reflected and properly captured in the Constitution of the Federal Republic of Nigeria.\n“The traditional Institutions have always been there and they are there longer than political Institutions…We face security issues.\n“That is where official participation of traditional Institutions in governance is very important and central."
  },
  {
    "headline": "Three feared dead in Onitsha market building collapse",
    "summarized_story": "Three persons were feared dead in a building collapse in Ochanja Central Market, Onitsha, Anambra State.\nThe structure, a two-storey building, reportedly collapsed around 5:45pm on Saturday.\nEye witnesses blamed the incident on further development on the already weak structure without necessary reinforcement.\nA group of traders at the market had on Friday, protested plans by leadership of the market to erect additional structures on the existing old and weak buildings in the market.\nThe traders, who took their protest to Awka the State capital, appealed to Governor Willie Obiano to prevail on the market leadership to forestall any calamity."
  },
  {
    "headline": "VIDEO: Amaechi rides a horse after turbaning as Dan Anamar Daura",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "How Al-Makura, Sheriff, Lalong, others missed Amaechi’s turbaning",
    "summarized_story": "Plateau Governor Simon Lalong, 21 Senators and 56 House of Representatives members on Saturday missed the turbaning of Minister of Transportation Rotimi Amaechi as Dan Amanar in Daura, Katsina State.\nOthers who missed the ceremony were leading All Progressive Congress (APC) chairmanship aspirants Senators Tanko Al-Makura and Ali Modu Sheriff.\n- Advertisement -The bad weather, which affected flight operations at Nnandi Azikiwe International Airport Abuja, left the dignitaries stranded at the airport.\nA source at the Nigerian Civil Aviation Authority (NCAA) blamed blamed poor weather for the flight disruption.\nDaura, the home town of President Mohammadu Buhari, led by the Emir Alhaji Umar Faruke Umar turbaned Amaechi as the Dan Amanar Daura (Trusted Son of Daura)."
  },
  {
    "headline": "Southern position on 2023 presidential election will shake Nigeria- Wike",
    "summarized_story": "Rivers Governor Nyesom Wike has said the South will soon take a position and make a declarative statement on the 2023 presidential election that will shock the country.\nWe believe in the unity of Nigeria and unity of Nigeria must continue,” he stressed.\nHe said the Peoples Democratic Party (PDP) would not give its presidential ticket to any candidate, who would serve only the interest of the wealthy few in Nigeria.\nThe Governor lambasted Rivers politicians serving in the President Muhammadu Buhari’s administration for their inability to attract Federal Government projects to the State.\nHe disclosed that if the finances of the State improved, his administration might award the next phase of the Trans Kalabari road before the expiration of his tenure."
  },
  {
    "headline": "FG promises more weapons for military operations",
    "summarized_story": "The Minister of Defence Major General Bashir Magashi (Rtd) has assured the Army of more armament to boost ongoing operations.\nThe Minister disclosed this at the 2021 Nigerian Army Headquarters Garrison West African Social Activities (WASA) in Abuja.\nMagashi noted that though the Nigerian Army has recorded significant success against the insurgents, “they must brace up for the year ahead” .\nworthy of note in the gallant performance and sacrifices of the Nigeria personnel in counterterrorism counter agencies and other operations across the country.\n“I wish to state that you must imbibe good maintenance culture so as to make these equipment readily available when needed for operations”."
  },
  {
    "headline": "Nigeria re-elected into AU peace and security council in Addis Ababa",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Republic of Nigeria has been re-elected into the African Union Peace and Security Council (AUPSC) for another three (3) year mandate (2022-2025), to represent the West African region.\nNigerian Ambassador to Ethiopia and Permanent Representative to the African Union, Victor A. Adeleke represents Nigeria in this important Council at the Permanent Representatives level.\nThis was contained in a statement by the Embassy of the Federal Republic of Nigeria and Permanent Mission to the African Union and UNECA, Addis Ababa, Ethiopia.\nThe election of the 15-member Council was held on February 3 during the 40th Ordinary Session of the Executive Council of the African Union (Ministers of Foreign Affairs) in Addis Ababa.\nThis is in recognition of Nigeria’s sterling contributions to the maintenance of peace and security in Africa and beyond."
  },
  {
    "headline": "FG under fire over terrorism sponsors",
    "summarized_story": "He had also said government had identified 26 bandits and seven co-conspirators linked to financing of terrorism in Nigeria, among others.\nGovt not showing sincerity – AfeniferePan Yoruba socio-political organisation, Afenifere, said the government has not shown adequate concern and sincerity in prosecuting the war against terrorism.\n“YCE backs FG over non-release of namesBut in a marked departure from positions held by others, the Yoruba Council of Elders (YCE) asked Nigerians not to criticise the Federal Government over the non-release of names of alleged sponsors.\nHe noted that the statement made by the Minister of Information, Alhaji Lai Mohammed, would have unsettled the sponsors, even without mentioning their names, adding that the FG must have been done further investigation on the matter.\nHe urged Nigerians to be patient with the government in its campaign against crimes, especially insurgency and terrorism."
  },
  {
    "headline": "I can never act nude for money –Caroline Igben",
    "summarized_story": "For black and beautiful Nollywood actress, Caroline Igben, there are certain roles she would not be caught playing irrespective of the amount of money involved.\nThe movie star in a recent encounter with Saturday Sun stated that her voice is her unique selling point aside from her knack for role interpretation.\n“My voice and the way I speak are my unique selling points, and I can never take a role on nudity regardless the pay.\nThe curvaceous Igben, who boasts of right curves in the right places, sees nothing wrong with her colleagues going under the knife to have her kind of body.\n“I know liposuction is the new trend, but I am never going to have my body done to look perfect."
  },
  {
    "headline": "Blackout looms in Lagos as fire guts Egbin Power Plant",
    "summarized_story": "By Adewale SanyaoluThe poor state of power supply is set to take a turn for the worse within Lagos and its environs, as the one of the largest power-generating plants in Sub-Saharan Africa, Egbin Power Plc, has been gutted by fire.\nEgbin is one of the operating entities of Sahara Power Group, which is an affiliate of Sahara Group.\nThe incident occurred at its power plant on Wednesday, February 2, at 4.20pm.\n“Egbin is also working with the Federal Fire Service, the Federal Ministry of Power and other stakeholders to review the incident.\n“As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with good health, safety and environmental standards,” the statement noted."
  },
  {
    "headline": "2023: Nigeria’s enemies against Igbo President –Ohanaeze",
    "summarized_story": "From Magnus Eze, EnuguThe most topical and popular issue in South East today is the actualization of a Nigerian President from the region.\nThough some people believe that restructuring of the federation is what the Igbo needs at the moment, there are those clamouring for Nigerian President of Igbo extraction.\nThe Ohanaeze leader declared that anybody working against the emergence of Igbo president does not wish Nigeria well because, according to him, only the Igbo can save the country at this critical period.\nWe don’t know why that conscience takes a flight when it comes to the South East.\nAccording to President General, Coalition of South East Youth Leaders (COSEYL), Goodluck Ibem, the zone will not accept the position of vice president."
  },
  {
    "headline": "Osinbajo: Shonekan Was a Man of Destiny Chosen for His Time",
    "summarized_story": "); former President Goodluck Jonathan; Secretary to the Government of the Federation, Boss Mustapha; Lagos State Governor, Babajide Sanwo-Olu; Ogun State Governor, Prince Dapo Abiodun; and Edo State Governor, Godwin Obaseki.\nBuhari said: “Chief Shonekan was a man I respect so much because of his passion for the development of Nigeria.\nNo man will offer himself as a sacrificial lamb in the manner of Chief Shonekan.\n“As a member of the Council of State, Chief Shonekan attended all meetings until his demise because of his passion to see Nigeria grow.\nHis brother, Chief Tunji Shonekan, described the deceased as a peacemaker, a family man and a core Egba man."
  },
  {
    "headline": "Power Generation Crashes By Alarming 630MW as Fire Outbreak Forces Lagos Egbin Plant to Suspend Operation",
    "summarized_story": "Peter UzohoNigeria’s daily power generation has fallen by an alarming 630 megawatts (MW) since Wednesday following a fire outbreak at Egbin Power Plant in Ikorodu, Lagos State and the resultant shut down of generation by the company.\nEgbin Power had, in a statement issued to its stakeholders and the general public yesterday, reported the fire incident at its power plant on Wednesday, February 2, 2022, at about 4.20pm, leading to blackout in Lagos State.\nEKEDC had also attributed the reduction in supply to the drop in power generation from an average of 3,700MW to 2,000MW.\nThe Disco said this was caused by gas limitations arising from vandalism and more recently an issue affecting the TCN line from the Egbin Power Plant.\n“As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with good health, safety and environmental standards,” she added."
  },
  {
    "headline": "US Identifies Bad Governance, Corruption as Motivations for Coups in Africa",
    "summarized_story": "This was disclosed by the Commander of the United States Africa Command, AFRICOM, General Stephen Townsend who while expressing surprise at the recent upsurge in spate of military coups in Africa, opined that bad governance and corruption may have been responsible for the putsches.\n“So I don’t know why all that is, but my guess is that it has to do with insufficient governance, a lack of good governance, and corruption.\nBut I think that corruption and a lack of good governance is probably behind much of that,” he explained.\nI don’t think they’re doing that, furthering that or promoting those.\nBut they also have a view to expand into Africa, particularly into West Africa and the Gulf of Guinea."
  },
  {
    "headline": "Buhari at AU Summit, Reiterates Commitment to Poverty Alleviation, Access to Education",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has given an assurance that his administration remains committed to lifting the poor and vulnerable Nigerians from poverty.\n“Today, the forum has presented its second peer review report on Nigeria.\nThis Second Peer Review of Nigeria came at a critical time in the history of the country.\nHe said: “Let me use this opportunity to commend the President of South Africa for his dedication to the Forum since his election as the Chairperson of the African Peer Review Forum.\n“I also recognise the distinguished Panel of Eminent Persons for their continued good work in steering the African Peer Review Mechanism process in all member countries."
  },
  {
    "headline": "Zamfara Lawmakers Move to Impeach Deputy Governor Over Alleged Corruption",
    "summarized_story": "Chuks Okocha in AbujaLawmakers in the Zamfara State House of Assembly yesterday commenced the process to impeach the deputy governor of the state, Mr. Mahdi Gusau.\nThis is despite a Federal High Court in Abuja that restrained the Zamfara State House of Assembly from impeaching the deputy governor.\nThe deputy governor is the son of the former National Security Adviser, Aliyu Gusau.\nTHISDAY gathered that members of the Assembly have accused the deputy governor of breach of the constitution, abuse of office, and financial fraud.\nA Federal High Court, Abuja, had in July 2021 restrained the Zamfara House of Assembly from impeaching the Deputy Governor of the state, Mahdi Gusau."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "Wike: Nigeria will shake when south takes position on 2023 presidential election",
    "summarized_story": "Nyesom Wike, governor of Rivers state, says the stakeholders in the southern region will soon take a position concerning the 2023 presidential election.\nWike spoke on Saturday at a reception organised in his honour by the Kalabari people.\n“The day the south will speak, Nigeria will shake,” the governor said.\nHe said some desperate politicians are already plotting for a candidate who would serve the interest of the affluent few.\nAlthough he is yet to announce his bid to run for the presidency, Wike said no candidate is more suitable than him."
  },
  {
    "headline": "Wike: Nigeria will shake when south takes position on 2023 presidential election",
    "summarized_story": "Nyesom Wike, governor of Rivers state, says the stakeholders in the southern region will soon take a position concerning the 2023 presidential election.\nWike spoke on Saturday at a reception organised in his honour by the Kalabari people.\n“The day the south will speak, Nigeria will shake,” the governor said.\nHe said some desperate politicians are already plotting for a candidate who would serve the interest of the affluent few.\nAlthough he is yet to announce his bid to run for the presidency, Wike said no candidate is more suitable than him."
  },
  {
    "headline": "Lawyer: Igboho will be freed soon -- and there'll be jubilation in Yoruba land",
    "summarized_story": "Pelumi Olajengbesi, a lawyer, says Sunday Adeyemo, the Yoruba nation agitator better known as Sunday Igboho, will soon regain his freedom.\nAdvertisementA Beninise court blocked the extradition of Igboho to Nigeria while ruling that the activist be remanded in prison pending further hearing.\nWriting on his Facebook page on Saturday, Olajengbesi described Igboho as a courageous man, claiming that he has it on good authority that the Yoruba nation agitator will soon be freed.\nHe wrote: “Chief Sunday Igboho will be out very soon and there will be massive jubilation across the entire Yoruba land.\nAdvertisement“He is no doubt a courageous man."
  },
  {
    "headline": "Lawyer: Igboho will be freed soon -- and there'll be jubilation in Yoruba land",
    "summarized_story": "Pelumi Olajengbesi, a lawyer, says Sunday Adeyemo, the Yoruba nation agitator better known as Sunday Igboho, will soon regain his freedom.\nAdvertisementA Beninise court blocked the extradition of Igboho to Nigeria while ruling that the activist be remanded in prison pending further hearing.\nWriting on his Facebook page on Saturday, Olajengbesi described Igboho as a courageous man, claiming that he has it on good authority that the Yoruba nation agitator will soon be freed.\nHe wrote: “Chief Sunday Igboho will be out very soon and there will be massive jubilation across the entire Yoruba land.\nAdvertisement“He is no doubt a courageous man."
  },
  {
    "headline": "Segun Oni dumps PDP -- days after losing Ekiti governorship primary election",
    "summarized_story": "Segun Oni, a former governor of Ekiti state, has resigned his membership of the Peoples Democratic Party (PDP).\nOn January 26, Oni lost the PDP governorship primary election in Ekiti to Bisi Kolawole, the preferred candidate of Ayodele Fayose, a former governor of the state.\nThe Segun Oni Campaign Organisation rejected the result of the PDP primary while alleging that members of the organisation were disenfranchised by the process.\nAdvertisementOni was the governor of Ekiti on the platform of the PDP between May 29, 2007 and October 15, 2010.\nIn 2014, he defected to the APC from PDP to support the second term bid of Fayemi, the incumbent governor of Ekiti."
  },
  {
    "headline": "Saudi Arabia: A new home for Nigerian startups?",
    "summarized_story": "The Startup Passport initiative, which will ultimately be between the 8-member DCO countries, rolled out initially in Saudi Arabia and Nigeria.\nThis announcement implies that Nigerian startups building products that primarily serve the Middle East and North Africa (MENA) region are invited to build their companies from Saudi Arabia with support from the government.\nFaris AlSaqabi, Saudi Deputy Minister for Future Jobs and Capabilities, explained that the bond between Saudi Arabia and Nigeria is fueled by the country’s movement to a digital economy.\nNigerian Minister of Communications and Digital Economy, Isa Ali Pantami in conversation with a representative of the Digital Cooperation Organization.\nThis new program is expected to transform Saudi Arabia into a leading digital entertainment and media production hub."
  },
  {
    "headline": "TechCabal is surging ahead in 2022 and beyond 🚀",
    "summarized_story": "This year, we are hyper-focused on fine-tuning our editorial standards and establishing TechCabal as one of Africa’s most reputable technology and media publication.\nHe was a senior staff writer at TechCabal for 1 year and 8 months.\nHe was a staff writer at TechCabal for almost 2 years.\nMLIT is a flagship launched by Kay Uguwede, a former TechCabal staff writer.\nDigital Nomads was launched and exclusively written by Olumuyiwa, a former senior staff writer at TechCabal."
  },
  {
    "headline": "Detty December: New data identifies Lekki Phase 1 as Lagos’s COVID-19 hotspot",
    "summarized_story": "Adaobi* is a 24-year-old software engineer living with her 49-year-old mother Oge* at Lekki Phase 1, in Lagos, Nigeria.\nWe noticed that customers in Lekki Phase 1 that would normally order 20 packs of antimalarial drugs for sale within 3–4 days were now ordering 60–70 packs every 1–2 days,” said Okwuada.\nA sore throat is not indicative of malaria but it is one of the major symptoms of COVID-19.\nAnother resident of Lekki Phase 1 jokingly said he suspects everybody in Lekki has the virus already.\nAccording to a Reuter data, COVID-19 infections are decreasing in Nigeria, with 94 new infections reported on average each day."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Afrobeats: “There are global moments, but the biggest opportunity is Nigeria.” — Obi Asika",
    "summarized_story": "Obi Asika, Founder of Storm 360 Records and Co-founder of Social Media Week LagosThere is no doubt that African music, especially Afrobeats — the melting pot of West African music styles blended with American Jazz — has gone global.\nThis was then fused with Western influences to create Afrobeats.\nBy the late 2000s, we had Myspace, then Facebook, followed by YouTube,” Asika noted.\nWhile Asika believes that several platforms played a significant role in making Afrobeats go global, the talents that create the music play the biggest part.\n“Once we see the Internet no longer becoming a barrier, we’re truly going to see how African music will blow up."
  },
  {
    "headline": "How changing customer attitudes will affect fintech business models in Africa",
    "summarized_story": "Nigeria alone has 144 fintech startups, per Statista.\nAn underdeveloped financial system, difficulty accessing credit, and a growing number of smartphone users present a huge opportunity for new and existing fintech players in Africa.\nAdvertisementPreparing for competitionOluwatobi Boshoro, CEO of Infinitetiks, believes that fintech startups can expect to see competition from startups on the fringes of the financial services sector.\nCurrently, most fintech startups in Africa are focused on one financial service.\nSo what does this mean for fintech startups?"
  },
  {
    "headline": "Building a sense of trust and providing insurance for more Africans",
    "summarized_story": "Today, I’m discussing:GIG Logistics’ crypto integrationLAMI’s acquisition to drive expansion in AfricaGIG Logistics’ crypto integrationRecently, the only constant for Bitcoin has been a downward spiral.\nThose who do not have an XPAD wallet can create one on GIGGO.\nDue to the traditional distribution of insurance policies by individual insurance agents, Africa has low insurance coverage.\nTo make insurance coverage available to more people in Africa on a larger scale, the company has acquired Bluewave Insurance Agency for an undisclosed sum.\nAdelaide Odhiambo, who now works as the head of commercial partnerships at Lami, founded Bluewave Insurance, another Kenyan startup."
  },
  {
    "headline": "Real estate trends to watch as sector recovers",
    "summarized_story": "Regulatory and compliance intensity, heightened risk of title uncertainty in high profile locations, resolute enforcement of city master plans, and innovative financing strategies top experts’ list of trends to watch in the real estate sector in 2022.\nThe experts, who spoke at an event hosted by the Nigerian-British Chamber of Commerce (NBCC) with the theme, ‘Nigerian economic outlook 2022: Intersection with the real estate sector –Top real estate trends to watch’ noted that despite the obvious effect of inflation, foreign exchange challenges, insecurity, and high unemployment rates, Nigeria’s economic fundamentals remain strong.\n“This year is going to be different as Lagos is going to tackle fraudulent activities in the real estate sector this year.\nAlso, Bisi Adeyemi, NBCC president and chairman of the council, observed that the real estate sector had become a major contributor to the country’s economic growth this year.\n“The major objective of this event is to examine the opportunities, challenges, and, indeed, the threats in the real estate sector in 2022."
  },
  {
    "headline": "How Nigerian music will beat 2021 records",
    "summarized_story": "Here we look at 2022, focusing on the Nigerian music industry and projections for the year.\nA retrospect of the Nigerian music industry in 2021Wizkid’s commercial success with “Made in Lagos” spilled over into 2021, setting new records for an afrobeat artiste.\nThe Nigerian music industry is shaping up against a healthy outlook for music sales globally.\nMore revenue on international performances:International concerts and music festivals will produce more revenue for the Nigerian music business than ever before.\nMore global award category recognition/nomination:Africa is dominating the Grammys’ Global Music category, with Wizkid, Tems, Burna Boy, Femi Kuti, and Made Kuti all receiving nominations."
  },
  {
    "headline": "Oil crosses $92, its highest level in over seven years",
    "summarized_story": "Oil crosses $92, its highest level in over seven yearsOil prices reached seven-year highs on Friday as geopolitical tensions and a winter storm in the US fuelled concerns over supply disruptions.\nRead also: OPEC+ to raise oil production by 400,000 in MarchOil markets have also gained support from tensions surrounding the Ukraine crisis, which have heightened concerns over oil supplies that are already tight.\n“The late-session recovery in oil prices was also aided by fresh evidence of OPEC’s struggle to raise output,” said Stephen Brennock of oil Broker PVM.\nIraq, Opec’s second-largest oil producer, pumped well below its Opec+ quota in January, data from state-owned marketer Somo showed on Thursday.\nCommerzbank has raised its oil price forecast for the first quarter of 2022 to $90 a barrel, up from $80 previously."
  },
  {
    "headline": "OLAYIWOLA AFOLABI UPLIFTS THE LEGAL PROFESSION – Nigerian Observer",
    "summarized_story": "For instance, he has an award scheme for honouring honest, disciplined and diligent junior staff of Edo State judiciary.\nIcons of the bench and bar have equally been honoured by Olayiwola Afolabi in one way or the other.\nIn 2018, Olayiwola Afolabi hosted the new executive members of NBA, Edo State Chapter to a dinner.\nIn 2020, Olayiwola Afolabi officially institutionalized this mentoring process with the establishment of AFOLABI ANNUAL LEGAL CLINIC AND COACHING LECTURE SERIES.\nAlso in line with his tradition of honouring icons in the judiciary, Olayiwola Afolabi has instituted Stephen Omonuwa Transparency Award."
  },
  {
    "headline": "Digital Broadcasting: Ministry of Communication and Orientation to Partner Edo State University, Uzairue – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUZAIRUE- – Edo State Ministry of Communication and Orientation will partner with Edo State University Uzairue in raising a new set of professionals that will drive the progress that Nigeria needs in the Broadcasting industry, just as the Ministry work towards having a new digital broadcasting sector.\nAndrew Adaze Emwanta during a facility tour of the Edo state University Uzairue, Etsako West Local Government area of Edo State.\nHe disclosed that the Ministry of Communication and Orientation is working towards having a new digital broadcasting sector to be controlled by the state.\nAccording to him, “Broadcasting has gone beyond analogue and the Ministry is working towards having a new digital broadcasting sector that we as a state can control.\n“The Nigeria University Commission, NUC ranking has placed Edo University 10th best in Nigeria, 2nd best in the state and the best in the South South region."
  },
  {
    "headline": "Edo Cricket Teams Win PWC National U-17 South-South Qualifiers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State male and female U-17 cricket teams, emerged champions respectively, at the PWC national cricket under 17 South-South zonal qualifiers, which took place in Benin City.\nIn the male category of the qualifiers, that took place at the Edo boys high school Cricket pitch, in Benin City, the Edo State defeated Akwa Ibom by 10 wickets.\nIn the first innings, the Edo State team had chased down their 51 runs target in the 15th over having run the Akwa Ibom team out for 50.\nEarlier in the qualifiers, the Edo State team defeated Delta state by 2 wickets in the preliminary round (Super Knockout) that took place yesterday.\nAt the Iyoba girls college where the female qualifiers took place, the Edo State team led by Coach Guobadia Esewi Peter also became champions."
  },
  {
    "headline": "NBBF: Kida vows to build solid,sustainable Domestic leagues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – After a successful elective Congress of the Nigeria Basketball Federation (NBBF) in Benin City, the leadership of the NBBF board led by Engr Musa Kida has expressed its determination to build a domestic league structure that will reflect the immense potentials that abound in Nigeria.\nThe reelected NBBF President Musa Kida gave the assurance while entertaining questions from Journalists in Benin.\nEngr Musa Kida who was unanimously returned as the NBBF’s president said the symbolic election heralds a new dawn with the domestic league at the front burner of the board’s plan.\n“We are hoping that all these stakeholders will come on board so that together we have a verile and enviable domestic league”.\nNigeria basketball election into its federation was conducted in the most democratic way with 27 states out of the 36 and the Federal Capital Territory present”."
  },
  {
    "headline": "Amaechi Turbaned as Dan Amanar Daura in Katsina",
    "summarized_story": "Mr. Rotimi Amaechi, Minister of Transportation, was on Saturday officially turbaned as the Dan Amanar Daura (the trusted one of Daura) at a ceremony held at the palace of the Emir of Daura, Umar Farouq Umar on Saturday.\nThe Daura Emir, prayed for Amaechi, whom he described as a an extraordinary individual destined to attain higher office.\nTherefore, It is binding on the Daura traditional emirate to acknowledge the kind gesture.\nAlso turbaned by Emir Faruk along with Amechi is another chieftain of the All Progressives Congress (APC), Nasiru Haladu Danu, a reputable businessman and two-time director general of his election campaigns.\nDanu was conferred with the title of “Tafida Baba” by the Daura Emir."
  },
  {
    "headline": "Despite Clampdown, Illegal Oil Refining Thrives In Rivers",
    "summarized_story": "Despite the clampdown by the Rivers State government and the 23 local government areas of the state, illegal refining and bunkering are going on in the state.\nIt was further observed that those involved in the illegal business work in connivance with security operatives who provide cover for them.\nHe said the state government would not hesitate to depose the King of Akpor kingdom if illegal oil bunkering continues in Rumuokparali and Ogbogoro communities.\nThe governor also frowned at the king of Omerelu community in Ikwerre local government area where illegal oil bunkering activities are thriving.\nThe governor said the state had also recovered government properties fraudulently acquired by retired civil servants."
  },
  {
    "headline": "APC Faction Seeks Redeployment Of CP Over Alleged Incompetence",
    "summarized_story": "Factional All Progressives Congress (APC) under the chairmanship of Hon.\nRasaq Salinsile has called on the Inspector General of Police, Usman Baba Alkali to urgently deploy Osun State Commissioner of Police Wale Olokode over alleged incompetence.\nAddressing newsmen over the Thursday attack on Oranmiyan House, Aregbesola’s campaign office in Osogbo on Friday, the Chairman, Hon.\nRasaq Salinsile catalogued reported attacks on his members with CP Olokode looking the other way.\nThe chairman who did not rule out reconciliation with the other faction of the party said they belong to APC and will definitely not want anything that will adversely affect it."
  },
  {
    "headline": "LG Demonstrates Futuristic Innovations At CES 2022",
    "summarized_story": "LG Electronics has reinstated its drive of continuous integration of technology and art elements to create a new experience that will engage more people across the world.\nAccording to the general manager, Home Appliances Division at LG Electronics West Africa, Mr. Jiung Park, LG is focused on delivering customer-centric solutions that will better the life of everyone.\nLG’s recently introduced Objet TV is a lifestyle product that aims to capture a slice of the luxury TV market.\nThe LG Objet TV has a changeable cloth cover that looks like a canvas and blends well with any room’s simple decor.\nLG’s gentle use of neutral hues is reflected in the Objet TV, which offers sophistication, visual harmony, and an engaging indoor watching experience."
  },
  {
    "headline": "LG Demonstrates Futuristic Innovations At CES 2022",
    "summarized_story": "LG Electronics has reinstated its drive of continuous integration of technology and art elements to create a new experience that will engage more people across the world.\nAccording to the general manager, Home Appliances Division at LG Electronics West Africa, Mr. Jiung Park, LG is focused on delivering customer-centric solutions that will better the life of everyone.\nLG’s recently introduced Objet TV is a lifestyle product that aims to capture a slice of the luxury TV market.\nThe LG Objet TV has a changeable cloth cover that looks like a canvas and blends well with any room’s simple decor.\nLG’s gentle use of neutral hues is reflected in the Objet TV, which offers sophistication, visual harmony, and an engaging indoor watching experience."
  },
  {
    "headline": "Judge Adjourns Fani-Kayode’s Forgery Trial, Warns Against Delay",
    "summarized_story": "The anti-graft agency had arraigned Fani-Kayode before the court on a 12-count charge of procurement of a “fabricated” medical report and use of the false document.\nADVERTISEMENTAccording to the EFCC, Femi Fani-Kayode on October 11, 2021, in Kubwa, Abuja, fraud connived with one Dr Ogieva Oziegbe to execute a document titled: Medical Report Olufemi Fani Kayode 60 YEARS/MALE/HOSP.\nAt the resumed hearing of the matter on Friday, the judge asked the EFCC counsel, Bilikisu Buhari about the update on the amended charge she promised to file.\nSubsequently, the judge also asked defence counsel, Wale Balogun if they have applied to obtain the proof of evidence.\nThe court adjourned to February 23 for commencement of trial."
  },
  {
    "headline": "Group petitions EFCC, alleges illegal collection of international passport issuance fees by Nigerian ambassador to Spain, Ademola Seriki",
    "summarized_story": "By JUMOKE SANNIA group, United Nigerians Forum, has written a petition to the executive chairman of EFCC, Mr. Abdulrasheed Bawa, alleging that the Nigerian ambassador to Spain, Mr. Ademola Seriki is engaged in the illegal collection of international passport issuance fees.\nFind below the full petition:4th February 2022The Executive ChairmanEconomic and Financial Crimes CommissionHeadquartersJabiAbujaDear Sir,PETITION AGAINST ILLEGAL COLLECTION OF INTERNATIONAL PASSPORT ISSUANCE FEES BY NIGERIAN AMBASSADOR TO SPAIN, ADEMOLA SERIKIWe are constrained to bring the attention of your office on the current happenings at the Nigerian Embassy, Madrid, Spain.\nAlso 500 euros (N260,000) is charged for the same day express service of passport issuance, all these going to Seriki’s purse.\nAlso of worry is why is ambassador Seriki paying the embassy staff from his pocket?\nRecalled Ambassador Seriki was a chronic debtor, AMCON had to auction his properties both in Abuja and Lagos to recoup over N1 billion owed by him."
  },
  {
    "headline": "Group petitions EFCC, alleges illegal collection of international passport issuance fees by Nigerian ambassador to Spain, Ademola Seriki",
    "summarized_story": "By JUMOKE SANNIA group, United Nigerians Forum, has written a petition to the executive chairman of EFCC, Mr. Abdulrasheed Bawa, alleging that the Nigerian ambassador to Spain, Mr. Ademola Seriki is engaged in the illegal collection of international passport issuance fees.\nFind below the full petition:4th February 2022The Executive ChairmanEconomic and Financial Crimes CommissionHeadquartersJabiAbujaDear Sir,PETITION AGAINST ILLEGAL COLLECTION OF INTERNATIONAL PASSPORT ISSUANCE FEES BY NIGERIAN AMBASSADOR TO SPAIN, ADEMOLA SERIKIWe are constrained to bring the attention of your office on the current happenings at the Nigerian Embassy, Madrid, Spain.\nAlso 500 euros (N260,000) is charged for the same day express service of passport issuance, all these going to Seriki’s purse.\nAlso of worry is why is ambassador Seriki paying the embassy staff from his pocket?\nRecalled Ambassador Seriki was a chronic debtor, AMCON had to auction his properties both in Abuja and Lagos to recoup over N1 billion owed by him."
  },
  {
    "headline": "42nd birthday: Don Jazzy, Toke Makinwa, others celebrate Tiwa Savage",
    "summarized_story": "The mother-of-one also shared birthday wishes from her fans and friends on her Instagram story.\nThe birthday party would include performances from disc jockeys like DJ Consequence, DJ Six7even, DJ Dotwine, DJ Phatt, and DJ Biosky with AK Smuth as the hype man.\nHappy birthday Tiwa Savage.”Media personality and author, Toke Makinwa, also celebrated Tiwa Savage on her Instagram story.\nLove you @tiwasavage, ” Makinwa wrote.\nOther celebrities who celebrated Tiwa Savage include actress Adesua Etomi-Wellington, reality TV stars Dorathy Bachor and Kim Oprah, singer Waje, and many others."
  },
  {
    "headline": "42nd birthday: Don Jazzy, Toke Makinwa, others celebrate Tiwa Savage",
    "summarized_story": "The mother-of-one also shared birthday wishes from her fans and friends on her Instagram story.\nThe birthday party would include performances from disc jockeys like DJ Consequence, DJ Six7even, DJ Dotwine, DJ Phatt, and DJ Biosky with AK Smuth as the hype man.\nHappy birthday Tiwa Savage.”Media personality and author, Toke Makinwa, also celebrated Tiwa Savage on her Instagram story.\nLove you @tiwasavage, ” Makinwa wrote.\nOther celebrities who celebrated Tiwa Savage include actress Adesua Etomi-Wellington, reality TV stars Dorathy Bachor and Kim Oprah, singer Waje, and many others."
  },
  {
    "headline": "Breaking: 5-year-old Moroccan boy Rayan is dead",
    "summarized_story": "Rayan, the five-year-old boy who was trapped in a well near Morocco’s Chefchaouen did not survive the trauma as his death has been announced by King Mohammed V1.\nMasses of people shared messages of compassion and condolences to the family of Rayan, also spelt as Rayane.\nThe Monarch expressed appreciation for the tireless efforts of all authorities and public forces to attempt to rescue Rayane’s life.\nThe Monarch also lauded the strong solidarity and broad support all Moroccan citizens shared with Rayane’s family.\nMany shared condolences and heartfelt messages to support the deceased’s family and people who worked without rest to save the boy’s life."
  },
  {
    "headline": "Anti-vaccine protests spread in Canada",
    "summarized_story": "Canadian cities, including the financial hub Toronto, faced disruptions on Saturday as protests against vaccine mandates spread from the capital of Ottawa.\nThe so-called “Freedom Convoy” began as a movement against a vaccine requirement for cross-border truckers, but has turned into a rallying point against public health measures and Prime Minister Justin Trudeau’s government.\nOne man rode through the area on horseback, carrying a Trump flag, social media videos showed.\nAbout 500 healthcare workers and supporters rallied in downtown Toronto, near the site of the planned trucker convoy demonstrations, according to a Reuters eyewitness.\nSeveral Toronto healthcare workers said they received advice from their hospitals to not wear hospital scrubs in public in light of the protest."
  },
  {
    "headline": "“Abba Kyari Showed me Hell’ – Evans Denies Kidnapping Businessman, Collecting $420,000 Ransom",
    "summarized_story": "Chukwudimeme Onwuamadike, alias Evans, the alleged kidnap kingpin, has stated that he witnessed hell in the hands of DCP Abba Kyari, the suspended Head of the Intelligence Response Team.\nEvans said this at an Ikeja Special Offences Court, while denying kidnapping a businessman, Sylvanus Ahamonu, and collecting a 420,000 dollar ransom from his family.\nNAN reports that Evans is standing trial alongside an ex-soldier, Victor Aduba, on a four-count charge of kidnapping and unlawful possession of firearms.\nEvans told the court that he was born on April 22, 1980, and hailed from Nnewi, Anambra State.\nWhen Sule noted that Ahamonu had identified him when he testified virtually (via the Zoom app) in court, Evans said he was easily identifiable."
  },
  {
    "headline": "Bethel Pupil Rejected Freedom, Ransom Bearer Abducted — CAN Chairman",
    "summarized_story": "Hayab, who is also the Vice Chairman of CAN in the northern states and Abuja, reportedly revealed that the remaining pupil, who is said to be the youngest of the abductees, turned down the militants’ offer of freedom.\nThe CAN leader, who spoke to Saturday PUNCH in Kaduna on Thursday, said, “Only one pupil of the Bethel Baptist High School is remaining with the terrorists.\nBut we also made findings and we don’t want to expose his parents to any noise but that is what he (the pupil) said.\nBut last week, they (terrorists) asked us to bring some money (ransom) to come and take him.\nThe man who has been helping us to deliver the money (ransom) all this while went to deliver the money to free this boy they were confusing and they kidnapped him."
  },
  {
    "headline": "Boko Haram, ISWAP Sponsors: Buhari’s Govt Accused Of Having ‘Skeletons In Cupboard’",
    "summarized_story": "President Muhammadu Buhari’s administration has been accused of withholding the names of Nigerians accused of funding Boko Haram, the Islamic State of West Africa Province (ISWAP), and other terrorist organisations in the country.\nNigerians have the right to know those who have made life very unfortunate for them for more than a decade.\n“The government has skeletons in its cupboard and that is why they keep violating the rights of Nigerians to know the sponsors of Boko Haram and other terrorist groups.\nThis is why they are after radio stations and other media platforms, trying to silence the voice of Nigerians.\nAccording to him, the FG should stop disturbing Nigerians with the news of discovery but should come up with the identities of the alleged sponsors."
  },
  {
    "headline": "14 Govs Backing Tinubu’s Presidential Bid-Jibrin",
    "summarized_story": "No fewer than 14 Governors are passionately supporting the presidential bid of the All Progressives Congress (APC) National Leader Asiwaju Bola Ahmed Tinubu, a former member of the House of Representatives Abdulmumin Jibrin has stated.\nFour additional Governors, he stated, are also in talks to join the presidential train.\nJibrin, who is the Director-General of the Bola Tinubu Support Group Council, further said 26 APC chairmen across the Federation have also confirmed their support for Asiwaju.\nHe tweeted: “14 Governors in and 4 in talks.\n“We are exercising our right of choice by promoting Alhaji Asiwaju Bola Ahmed Tinubu."
  },
  {
    "headline": "Ekiti 2022: Segun Oni abandons PDP, few days after losing governorship ticket",
    "summarized_story": "Few days after losing out on governorship ticket of the Peoples Democratic Party (PDP), former Governor of Ekiti State, Mr. Olusegun Oni, has left the opposition party.\nAccording to feelers, Oni, who is aspiring to govern the state for a second time, is apparently displeased with the outcome of the recent PDP governorship primary which left him in second place behind the flag bearer of the party, Mr. Bisi Kolawole.\nBlueprint gathered on Saturday that he will officially announce his next destination in the coming days.\nOni had joined PDP from All Progressives Congress (APC) after he couldn’t realise his governorship reelection quest about three years ago.\nBoth PDP and APC are currently experiencing turbulence shortly after their primary elections about a week ago, a situation that has left aggrieved aspirants seeking for alternatives."
  },
  {
    "headline": "Pictures: Minister Dare attends Daura emirate football tourney, bags award",
    "summarized_story": "The Minister of Youth and Sports Development, Sunday Dare, Friday, attended the grand finale of the Daura Emirate football competition held in honour of Emir of Daura, Alhaji Farouk Umar, in Daura, Katsina state.\nThe final which was played on the rehabilitated Daura township stadium featured Hadi Sirika FC and Gakuwa Pillars which ended in a penalty shoot-out, 5-4 in favour of Hadi Sirika FC.\nIn recognition of the efforts of the Minister to rehabilitate the Daura stadium, the Daura Emirate Soccer Coaching Society presented an Award of Excellence to Dare, lauding his commitment to sports development in the country.\nThe Daura stadium was rehabilitated under the Adopt-a-Pitch Public Private Partnership (PPP) initiative of the Minister.\nDignitaries that graced the Football competition finale include Emir of Daura, Alhaji Farouk Umar, Yusuf Muhammadu Buhari, son of President Muhammadu Buhari, Alhaji Nasiru Danu among others."
  },
  {
    "headline": "Pictures: Nigerian contingent on parade as Winter Olympics kicks off in China",
    "summarized_story": "The Nigerian contingent was not left out of the many other countries during the opening ceremony of the ongoing Winter Olympics in China which kicked off on Friday."
  },
  {
    "headline": "At Least 27 Killed In Zamfara Communities",
    "summarized_story": "At least 27 people have been killed by suspected terrorists in separate attacks on two communities in Zamfara State.\nThe attacked communities are Nasarawar Mai Fara in Tsafe local government area and Yar Katsina in Bungudu local government AreaNasarawar Mai Fara community was attacked on Thursday leaving 17 persons dead while 10 persons were killed in Yar Katsina communityREAD ALSO: 150 Suspected Terrorists, Kidnappers, Robbers Arrested In Imo – CPThe State Police Public Relations Officer , SP Muhammed Shehu confirmed the incidents to Channels Television via telephone conversation on Saturday“One village was attacked in Tsafe and one in Yar Katsina, Yar Katsina was attacked yesterday and the area is being manned by the military,” Shehu added.\n“Brigade Commander and the commissioner for Security Mamman Tsafe visited the village yesterday and accessed the existing security arrangement in the community and to build the confidence of the locals.”Sources told Channels Television that the attack on Nasarawar Mai Fara in Tsafe local government was due to the failure of the residents to pay a N40 million levy imposed by the bandits.\nThe levy was imposed by Ado Aleru, a notorious banditry kingpin operating in the area and the Faskari part of Katsina State.\nThe Police spokesperson said the command is not aware of any levy imposed on the community by bandits."
  },
  {
    "headline": "We Will Continue To Stand, Fight For Justice, Buhari Says At AU",
    "summarized_story": "President Muhammadu Buhari Saturday in Addis Ababa, Ethiopia, said Nigeria will continue to pursue peace and progress in Africa, and other parts of the world, by consistently pushing for justice, fairness, and inclusiveness in global affairs.\nThis was disclosed in a statement signed by his Special Adviser on Media and Publicity, Femi Adesina.\nThe President assured the Palestinian leader that Nigeria will be “consistent” in pushing for peace and progress, while upholding the tenets of justice.\nShtayyeh thanked President Buhari for his leadership role in the continent.\nPlease continue to stay well and healthy, because we need your wisdom,” he said."
  },
  {
    "headline": "Nigeria Records More Lassa Fever Deaths As Toll Rises To 40",
    "summarized_story": "Nigeria’s death toll from Lassa fever has risen to 40 after more infected patients lost the battle to the disease.\n“In Week 4, the number of new confirmed cases decreased from 74 in week 3, 2022 to 42 cases.\nOf all confirmed cases, 82 per cent are from Ondo (30 per cent), Edo (27 per cent), and Bauchi (25 per cent) States.\nIt explained that it has also sent Lassa fever alert letters to states, in addition to carrying out preparedness assessment for the 36 states and the Federal Capital Territory (FCT).\nAccording to the agency, the seven Lassa fever molecular laboratories in its network are working full capacity to ensure all samples are tested, and results are provided within the shortest turnaround time."
  },
  {
    "headline": "Why Every Politician, Civil Servant Should Go To Prison – Orji Kalu",
    "summarized_story": "Former Abia State Governor, Orji Uzor Kalu, believes it is necessary for politicians and civil servants in Nigeria to go to prison.\nKalu, a presidential aspirant and lawmaker representing Abia-North senatorial district, described the prison as a learning facility.\n“They put me in prison to the glory of God and Nigerian people should thank them because I am better off today being there.\n“The average Nigerian knows that I have committed no offence,” said Kalu who insisted that he is not corrupt.\n“It was a glorious thing; that is the best thing God has ever done to me, to be able to put me in the lowest end of the world."
  },
  {
    "headline": "Segun Oni Dumps PDP, To Announce Destination In Due Course",
    "summarized_story": "Former Governor of Ekiti State, Mr. Segun Oni has announced his exit from the Peoples Democratic Party (PDP).\nOni, who is aspiring to govern the state for a second time, is apparently displeased with the outcome of the recent PDP governorship primary which left him in second place behind the flag bearer of the party, Mr. Bisi Kolawole.\nREAD ALSO: PDP Warns Lawmakers Against Move To Impeach Zamfara Deputy GovernorSpokesperson for the Segun Oni movement Jackson Adebayo confirmed to Channels Television that the former governor has dumped the PDP with his supporters and will be announcing his destination in the days ahead.\nThere had been grumblings within Oni’s camp over the January 26 governorship primary alleged to be tailored to favour the camp of former governor Ayo Fayose."
  },
  {
    "headline": "Nigeria will continue to pursue peace, progress in Africa, World",
    "summarized_story": "Nigeria will continue to pursue peace and progress in Africa and the world at large by consistently seeking for justice, fairness and inclusiveness in global affairs.President Muhammadu Buhari stated this today at the ongoing African Union meetings in Addis Ababa, Ethiopia.\nAdvertisementHe assured the Palestinian leader that Nigeria will be “consistent” in pushing for peace and progress, while upholding the tenets of justice.\nThe Heads of State and Government of the African Union have elected President of the Republic of Senegal, Macky Sall, as the new Chairperson of the African Union for the year 2022.\nAdvertisementThe event took place during the ongoing thirty-Fifth Ordinary Session of the Assembly of the Union, holding at the AU Headquarters in Addis Ababa.\nAdvertisementIn his inaugural speech, President Sall said Africa is beset by a multitude of problems despite its commendable progress over the past few decades."
  },
  {
    "headline": "Proposed NSCDC bill misunderstood, says sponsor",
    "summarized_story": "The sponsor of the bill to absorb the Nigeria Security and Defence Corps, Shina Peller, from Oyo state says the proposed bill was misconstrued and misrepresented to Nigerians.\nAdvertisementHe said: “I shall weigh in and make certain clarifications about the proposed bill.\n“On Tuesday, the 1st of February 2022, the Nigeria Security and Civil Defence Corps (Repeal and Enactment) Bill that I sponsored was read for the first time in the House of Representatives.\nAdvertisement“The bill does not in any way seek to render people jobless rather the bill proposes the transfer of assets and personnel of the NSCDC to the Nigera Police.\nAdvertisementRecall that the bill generated a lot of controversies and also led to the withdrawal of NSCDC officials attached to the lawmaker which were later restored."
  },
  {
    "headline": "Zamfara speaker receives impeachment notice against deputy governor -",
    "summarized_story": "The Zamfara State House of Assembly has Commenced impeachment process against the state Deputy Governor, Mahdi Aliyu GusauRecall that the assembly had in November last year summoned the deputy governor for questioning over alleged gross misconductAdvertisementThe deputy speaker of the Zamfara State House of Assembly who doubles as the Chairman House committee on Public Accounts, Musa Bawa said the committee has concluded it’s investigation on the matterMusa Bawa submitted the notice of Impeachment of the State deputy Governor Mahadi Gusau to the speaker of the HouseAdvertisementReceiving the notice, the speaker of the House Nasiru Magarya commended the Committee for a job well-done and assures the Committee that the document will be treated according to the provisions of the constitution of the federal Republic of Nigeria 1999 as amended.\nThe Zamfara State House of Assembly is accusing the state deputy governor of breach of constitution, abuse of office, financial misconduct among other thingsAdvertisementThe House is expected to study the document after which the content would be made publicA Federal High Court in Abuja had on July 19 last year restrained the Zamfara State House of Assembly from taking steps to impeachment the state Deputy Governor Mahdi Aliyu Gusau.\nAdvertisement"
  },
  {
    "headline": "APC inaugurates 34 State chairmen amid unresolved factional crisis",
    "summarized_story": "The All Progressives Congress has inaugurated elected state chairmen in the 34 states of the country and the federal capital territory, Abuja.\nHowever, Kano and Sokoto states chairmen were not inaugurated.\nAdvertisementThis is coming on the heels of preparation for the national convention which has been fixed for February 26th, even as the party has confirmed the convention date to the Independent National Electoral Commission (INEC).\nMaking the announcement during inauguration, the secretary of the Caretaker Committee, James Akpanudoedehe said he has been directed to hand over their certificate of return to them"
  },
  {
    "headline": "Tanko Yakassai: Buhari Can Fight Insecurity By Setting Up a People’s Militia",
    "summarized_story": "Elder statesman, Tanko Yakassai, on ARISE Newsday, weighs in on the question of insecurity bedeviling the northern parts of Nigeria."
  },
  {
    "headline": "Amazon Gains Record $190bn in Value, One Day after Meta’s Record Plunge",
    "summarized_story": "A day after Facebook owner Meta Platforms (msuffered the deepest loss of stock market value in history for a U.S. company, Amazon logged the greatest ever one-day increase in value.\nThat beat Apple Inc’s record $181 billion one-day gain in stock market value on Jan. 28 following the iPhone maker’s own blockbuster quarterly report, according to Refinitiv data.\nWith Meta Platforms’ stock slipping 0.3% on Friday, its value stood at about $660 billion.\nThe size of the increase in Amazon’s value eclipsed the market capitalizations of companies including AT&T Inc, Morgan Stanley and Netflix Inc .\nAmazon’s stock price remains down around 15% from its record high close of $3,731.41 in July."
  },
  {
    "headline": "US Identifies Bad Governance, Corruption as Motivations for Coups in Africa",
    "summarized_story": "This was disclosed by the Commander of the United States Africa Command, AFRICOM, General Stephen Townsend who while expressing surprise at the recent upsurge in spate of military coups in Africa, opined that bad governance and corruption may have been responsible for the putsches.\n“So I don’t know why all that is, but my guess is that it has to do with insufficient governance, a lack of good governance, and corruption.\nBut I think that corruption and a lack of good governance is probably behind much of that,” he explained.\nI don’t think they’re doing that, furthering that or promoting those.\nBut they also have a view to expand into Africa, particularly into West Africa and the Gulf of Guinea."
  },
  {
    "headline": "Buhari Restates Commitment to Poverty Reduction, Access to Education at AU Summit",
    "summarized_story": "Nigeria President Muhammadu Buhari has given the assurance that his administration remains committed to lifting the poor and vulnerable Nigerians from poverty.\n“Today, the forum has presented its second peer review report on Nigeria.\nThis Second Peer Review of Nigeria came at a critical time in the history of the country.\nHe said: “Let me use this opportunity to commend the President of South Africa for his dedication to the Forum since his election as the Chairperson of the African Peer Review Forum.\n“I also recognise the distinguished Panel of Eminent Persons for their continued good work in steering the African Peer Review Mechanism process in all member countries."
  },
  {
    "headline": "Nigeria: Power Generation Plunges By 630MW as Fire Forces Lagos Plant to Suspend Operation",
    "summarized_story": "Nigeria’s daily power generation has fallen by an alarming 630 megawatts (MW) since Wednesday following a fire outbreak at Egbin Power Plant in Ikorodu, Lagos State and the resultant shut down of generation by the company.\nEgbin Power had, in a statement issued to its stakeholders and the general public friday, reported the fire incident at its power plant on Wednesday, February 2, 2022, at about 4.20pm, leading to blackout in Lagos State.\nEKEDC had also attributed the reduction in supply to the drop in power generation from an average of 3,700MW to 2,000MW.\nThe Disco said this was caused by gas limitations arising from vandalism and more recently an issue affecting the TCN line from the Egbin Power Plant.\n“As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with good health, safety and environmental standards,” she added."
  }
]