[
  {
    "headline": "Zelensky ignored warnings about Russian invasion, Biden says",
    "summarized_story": "United States President Joe Biden said Friday that his Ukrainian counterpart, Volodymyr Zelensky “didn’t want to hear” American warnings ahead of Russia’s invasion of his country.\n“I know a lot of people thought I was exaggerating,” Biden said at a fundraising reception in Los Angeles, referring to his forewarning of the possibility of a Russian attack.\n“(Russian President Vladimir Putin) was gonna go into the border.\nAnd there was no doubt, and Zelensky didn’t want to hear it, nor did a lot of people.\nBiden maintained that the warnings were met with disbelief and even veiled criticism from some European allies, who at the time felt the US was being too alarmist."
  },
  {
    "headline": "Eight Kebbi APC lawmakers defect to PDP",
    "summarized_story": "The Peoples Democratic Party in Kebbi State has gained eight new lawmakers from the ruling All Progressives Congress.\nThe new entrant lawmakers comprised five members of the federal legislature and three members from the state legislature.\nIn the federal legislature, the senator representing Kebbi Central Senatorial District, Adamu Aliero; Kebbi North Senatorial District, Yahaya Abdullahi; Senate leader, including a member of the House of Representatives, defected from the APC to PDP.\nAlso, members representing Aliero/Jega/Gwandu and Dandi/Arewa federal constituencies, Mohammed Jega and Abdullahi Zumbo, exited the APC for PDP.\nState Organising Secretary of the PDP in Kebbi State, Usaini Raha, confirmed the defection of the lawmakers to the party."
  },
  {
    "headline": "Plateau PDP gov candidate urges youths, others to get voter card",
    "summarized_story": "Mutfwang made the plea in Jos on his arrival from Abuja where he received the certificate of return as candidate of PDP in Plateau.\n“With your votes, the PDP will return to power and continue with the infrastructural development of former governor Jonah Jang’s administration.\n“I assure you that Plateau State will rise again and take its rightful position among states in Nigeria,” he said.\n“We are also grateful to the people of Plateau over their relentless effort in ensuring that the PDP returns to power in 2023,” he said.\nJang urged the youths to conduct themselves in a peaceful and orderly manner and also obtain their PVCs to vote in the PDP."
  },
  {
    "headline": "Lawan urges striking NASS workers to call off action, embrace dialogue",
    "summarized_story": "Senate President, Ahmad LawanThe President of the Senate, Ahmad Lawan has urged the striking workers of the National Assembly to call off their industrial action and instead, embrace dialogue for speedy resolution of the disputes.\nLawan made the appeal at a meeting which he summoned to find a way out of the lingering issues between the workers and the management of the National Assembly.\nIn attendance at the meeting were the Deputy Senate President, Ovie Omo-Agege, Senate Leader, Yahaya Abdullahi and the Senate Deputy Chief Whip, Sabi Abdullahi.\nThe NASS management was represented by the Clerk of the National Assembly, Arch.\nOjo Olatunde and Chairman, National Assembly Service Commission, Ahmed Amshi and some top officials of the National Assembly."
  },
  {
    "headline": "Owo massacre: We now know why it was carried out — Soyinka",
    "summarized_story": "Soyinka was in Akure, weekend on a condolence visit to the governor over the terror attack in which over 50 worshippers were gruesomely murdered during morning Mass.\nRead Also:Owo Massacre: NANNM President, Ondo Chapter donate cash to nurse who lost both legs in Owo attackOwo massacre: Nigerians bare hearts to FGOwo massacre: Federal Governments conclusion on ISWAP too hasty — Akeredolu“That is why I’m here.\nI want the Governor to know that we have received the message.\n“At a time we thought it was Boko Haram, we didn’t know that Fulani herdsmen were capitalising on the fundamentalist insurgency and brutality.\nMeanwhile, the state government has canceled this year’s June 12 celebration earlier slated for Sunday 12th June, 2022, consequent upon the terror attack on innocent worshipers at St. Francis Catholic Church, Owo, last week Sunday."
  },
  {
    "headline": "Owo killings: Let us secure our communities in traditional ways – Group",
    "summarized_story": "By Adesina WahabA group, the Ancient Religion Societies of African Descendants International Council, ARSADIC, has said it is now time to secure our communities in traditional ways to prevent a recurrence of last Sunday’s killings of some people in Owo, Ondo State.\nThe group also added that the ugly incident is a wake up call for all Nigerians to be firm and resolute regarding security matters.\n“Many traditional rulers, very prominent Nigerians and religious leaders, including the Prelate of the Methodist Church of Nigeria, Samuel Kanu-Uche, have been kidnapped and huge ransoms received from them before their release.\n“God will never come down to defend us from the sinister and prey of these evil-minded and blood-thirsty monsters.\nHe has endowed us with brain and knowledge of what to do to survive as a people in all situations."
  },
  {
    "headline": "Gunmen invade Plateau community, kill one, injured three",
    "summarized_story": "By Marie-Therese Nanlong – JosGunmen on Friday night attacked some residents of the Kuru community in Jos South local government area killing one and injuring three others.\nThe deceased is said to be a student of the Science Secondary School, Kuru.\nConflicting reports had emerged last night that gunmen had invaded the school while others say the students left the school to charge their phones in the host community when the gunmen stormed the area at about 8 pm.\n“On reaching the scene, the gunmen had fled leaving behind one person dead and three others injured.\nThe Commissioner of Police Plateau State Command, CP Bartholomew Onyeka, advised members of the public to go about their lawful business as normalcy has already been restored in the area."
  },
  {
    "headline": "Owo Massacre: NANNM President, Ondo Chapter donate cash to nurse who lost both legs in Owo attack",
    "summarized_story": "By Dayo Johnson AkureThe National President of National Association of Nigeria Nurses and Midwives (NANNM) Comrade Michael Nnachi, has donated cash to the nurse, Mrs Margaret Attah who lost both legs during the terrorists attack at the St Francis Catholic Church in Owo, Ondo State.\nThe association’s Secretary, Comrade Aina Emmanuel Oluwaseun, quoted Nnachi to have presented a medical financial assistance cheque to Nurse Margaret on behalf of National leadership of NANNM.\nOluwaseun said that the State Chairman of the Association, Comrade Kehinde Olomiye also presented an undisclosed amount in cheque on behalf of the Ondo State Council.\nOther valuable materials were also donated by the National leadership of NANNM to affected victims in the various ward also visited.\nThe leadership NANNM appreciated efforts of the Medical Director and Nursing community in Owo especially those at the Federal Medical Centre, FMC Owo in ensuring quick recovery of the victims."
  },
  {
    "headline": "Lagos okada ban: 50 arrested as hoodlums, riders attack policemen in Ikorodu",
    "summarized_story": "The affected LGAs are Apapa, Eti Osa, Ikeja, Lagos Island, Surulere, and Lagos Mainland.\nOn Saturday, Police Public Relations Officer, Benjamin Hundeyin narrated how policemen were, Friday night, attacked in Ikorodu.\nThe spokesman said the personnel were fought by hoodlums and riders who tried to stop them.\n“The riders and hoodlums attacked the Police.\n50 arrested, 14 motorcycles impounded.”The PRO further disclosed that the next action would be the crushing of the seized bikes."
  },
  {
    "headline": "Owo massacre: Nigerians should use traditional protection – Yoruba chief, Atanda",
    "summarized_story": "Nigerians should resort to the use of traditional protection, following the massacre in Owo, Ondo State.\nReacting, Chief Ifagbenusola Atanda, President of Ancient Religion Societies of African Descendants International Council (ARSADIC) charged Nigerians to wake up.\nAtanda declared that now is the time to step up security in various communities to keep intruders and aggressors at bay.\nThe chief told citizens it was clear that the government alone cannot secure their lives and property.\nHe urged the people and leaders to support traditionalists prepared to combat “these aggressive crooks the way our forefathers did to their forebears”."
  },
  {
    "headline": "Owo massacre: Ondo Govt cancels June 12 celebration",
    "summarized_story": "The Ondo State Government has cancelled this year’s June 12 celebration, which was originally scheduled for Sunday, June 12th, 2022.\nThe cancellation became necessary, according to the state government, due to a terror assault on innocent parishioners at St. Francis Catholic Church in Owo on Sunday, June 5, 2022.\nThe cancellation, according to the Governor’s Chief Press Secretary, is to allow the entire people of Ondo State to grieve their loved ones who died in the awful incident.\nGunmen had last Sunday rained terror on Owo when they stormed a church where worshipers had gathered for the Pentecost day.\nIn honour of the victims of the terror attack, Governor Oluwarotimi Akeredolu ordered that all flags in the state be flown at half-mast for seven days."
  },
  {
    "headline": "2023: Diaspora group cautions against alleged CVR marginalisation of Igbos in Lagos",
    "summarized_story": "A diaspora group, the Nigerian-American Coalition for Justice and Democracy (NACJD), has decried the alleged marginalisation and targeted disenfranchisement of Igbos in Lagos State as they attempted to register in the ongoing Continuous Voters Registration (CVR).\nThe United States of America based group said every Nigerian willing to obtain a Permanent Voter Card (PVC) in every part of Nigeria must be allowed, assisted and protected to perform their civic duty.\nThe group stated this in a release jointly signed by NACJD Chairman, Prof. Eddy Oparaoji and its Secretary, Chijike Ndukwu made available to DAILY POST on Saturday.\nReacting swiftly, the group said while we have not independently verified these videos, many Nigerians in Lagos have surprisingly re-echoed these allegations as being correct.\nNACJD equally reminded political leaders in Lagos State that violence is not an exclusive privilege of persons or groups of persons stressing that the wanton destruction of properties in Nigeria should have taught Nigerians that violence pays no one."
  },
  {
    "headline": "Soludo demolishes building used as kidnappers hideout, as security arrests more suspects",
    "summarized_story": "Anambra State Governor, Prof. Chukwuma Soludo on Friday demolished a building in Oba, Idemili South Local Government Area, which was used by kidnappers to house their victims.\nThe building, a dilapidated three rooms structure was, however, demolished on Friday, after a joint security team stormed it for more operation.\nSoludo commended the efforts of the State Joint Security Task Force, saying the demolition exercise would serve as a deterrent to other criminals.\nThat building demolished was being used as a den for criminal activities, and the government’s policy will not allow any criminality to reign in the state.\nHenceforth, criminals will have no place in any part of Anambra State."
  },
  {
    "headline": "Igweship throne tears Enugu community apart",
    "summarized_story": "The peaceful community of Emudo Nenwe in Aninri Local Government Area of Enugu State has been thrown into chaos following the death of its traditional rulers some years ago.\nUkegbu, while briefing newsmen on the security concerns in the community in Enugu, said that it had become necessary to speak out and seek government’s intervention following the succession crisis rocking Emudo Nenwe Community.\nHe said that the community had delicately been polarized due to the several interest groups which sprang up, claiming to be in charge of the town union administration.\n“Our traditional stool and town union administration have been in ruins since the death of our traditional ruler.\n“We are, therefore, calling on the Federal and state governments to come to our aid because Emudo Nenwe is at the verge of total breakdown and anarchy,” Ukegbu said."
  },
  {
    "headline": "Group canvasses El-Rufai’s deputy chief of staff as Sani’s running mate",
    "summarized_story": "A group known as APC Supporters Forum in Kaduna has asked the party governorship candidate, Sen. Uba Sani, to pick Governor Nasir El-Rufai’s Deputy Chief of Staff, Barrister James Kanyip as Deputy Governorship Candidate.\n“It is true that Kaduna State, from the inception of the APC administration, has run a merit-driven government.\nThis is the secret recipe to the success of the Malam Nasir el-Rufa’i’s Administration.\nThe first test of resolve in pursuit of excellence will be in the choice of his deputy….\n“Going through options that have been fronted for the position of the deputy governor, there is no better candidate that fits that bill like Barrister James Atung Kanyip, current Deputy Chief of Staff to the Governor in the Deputy Governors office,” the group said."
  },
  {
    "headline": "Alia wins Benue APC governorship primary rerun",
    "summarized_story": "Fr Hyacinth Iormem Alia, has won the governorship primary election rerun conducted by the All Progressives Congress, APC, in 12 Local Government Areas and 3 council wards in Buruku Local Government Area of Benue State.\nThe rerun was conducted in Ogbadibo, Ushongo, Konshisha, Oju, Apa, Kwande, Agatu, Ohimini, Ado, Obi, Okpokwu and Apa Local Government Areas.\nSecretary of the Committee, Emma Maji, described the rerun election as free, fair and credible.\nStephen Tsav, on behalf of the State Chairman, Comrade Austin Agada, presided over a congress that affirmed the outcome of the rerun gubernatorial primary election.\nThe Benue APC had conducted its governorship primary election on the 27th of May, 2022 with Alia as the winner."
  },
  {
    "headline": "Tinubu: The man who would be president",
    "summarized_story": "The emergence of former Lagos governor, Asiwaju Bola Ahmed Tinubu, proved political pundits, online and social media polls wrong.\n“It is not my victory that is important, it is the process and management of that election that gave it to President Muhammadu Buhari,” Tinubu said.\nThe President, in a letter to Progressive Governors’ Forum (PGF) chairman, Kebbi State Governor Atiku Bagudu, described Wednesday’s shadow poll as the most competitive and peaceful in national history.\nTinubu, reputed for his political shrewdness and unbeatable strategy, was the first in APC to openly declare his presidential interest.\nTinubu will slug it out with Atiku Abubakar (Peoples Democratic Party; Dumebi Kachikwu (African Democratic Congress); Prince Malik Ado-Ibrahim (Young Progressives Party); Rabiu Musa Kwankwaso (New Nigeria Peoples’ Party) and Peter Obi of the Labour Party (LP)."
  },
  {
    "headline": "2023 presidency: APC, PDP heighten search for running mates",
    "summarized_story": "Both candidates, party sources said yesterday, are laying emphasis on competence and ability by their would be running mates to attract votes.\n“The presidential candidate of our party is from the North East.\n“A committee has been set up to lead the way in the search for our Vice Presidential candidate.\n“I said what then should I tell Kaduna delegates?\nHe said, tell them to vote their conscience; they are representing 10 million people in Kaduna State."
  },
  {
    "headline": "APC: Northern govs push for Muslim-Muslim ticket",
    "summarized_story": "Saturday Sun gathered that northern governors are making overtures to Tinubu to pick one of them, which means the party would have a Muslim-Muslim ticket.\nIt was learnt that while the Muslim-Muslim ticket looks tempting, the Tinubu camp is looking at the implications.\n“Tinubu’s supporters know that although a Muslim-Muslim ticket could favour him, it would give the North something to refer to, if in future they decide to push for North-North ticket,” the source.\nYou see, where we can get a serious and reliable Christian as running mate should be in the North Central.\nAnd also, those who are planning a Muslim/Muslim ticket should find out the outcome of the MKO Abiola and Kingibe ticket in 1993”, warning that “if they try Muslim/Muslim ticket this time round, the outcome will be disastrous because our fault lines are very visible.”The fears among the promoters of the Muslim-Muslim ticket is that only a core northern Muslim would guarantee massive votes among the predominantly Muslim population in the North, which could be decisive during elections."
  },
  {
    "headline": "Running mates: Today’s Nigeria different from that of 1993, CAN tells Atiku, Tinubu",
    "summarized_story": "From Fred Ezeh, AbujaWith the strong rumours of planned Muslim/Muslim or Christian/Christian tickets by major political parties in Nigeria ahead of the 2023 presidential elections, Christian Association of Nigeria (CAN) has asked political parties to bury that idea, insisting that it won’t work in today Nigeria.\nCAN advised the APC presidential flag-bearer, Asiwaju Ahmed Tinubu, to pick a Christian running mate from the north, while the PDP flag-bearer, Atiku Abubakar, should pick a Christian running mate from the south.\nCAN also advised Peter Obi of the Labour Party to choose from among the Muslims from the North.\n“Anything contrary means that the leadership of these political parties do not bother about the unity of Nigeria.\nSo, if any political party wants to try Muslim/Muslim ticket, it’s at its own peril."
  },
  {
    "headline": "Peter Obi is authentic LP’s presidential candidate – Party’s scribe",
    "summarized_story": "From Sola OjoNational Secretary of the Labour Party, Umar Farouk Ibrahim has said that former Anambra State Governor, Peter Obi is the authentic presidential candidate of the party.\nDo not miss the Vital Information, it goes off in 2 days!\nHe disowned the factional chairman of the party, Calistus Okafor who had presented one Jude Ezenwafor as his presidential candidate, asserting that there is no faction in the party.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Bello Bodejo, Miyetti Allah leader: Like in Niger Delta, herdsmen need Ministry of Fulani Herders Affairs",
    "summarized_story": "We want the Federal Government to create Ministry of Fulani Herdsmen Affairs as you have the Ministry of Niger Delta to handle herdsmen affairs.\nPeople say that the Fulani herdsmen are the bandits.\nYou can’t call all the herdsmen bandits and you can’t say all herdsmen are terrorists.\nSo, how can anybody say herdsmen are bandits?\nYou are not the commissioner of police or a security agent, but you stay in your house and concluded that Fulani herdsmen carried out the attack."
  },
  {
    "headline": "2023: Atiku to unveil running mate next week",
    "summarized_story": "From Ndubuisi Orji, AbujaBarring any last minute change, the Peoples Democratic Party (PDP ) will unveil its presidential candidate for the 2023 general elections on Tuesday or Wednesday next week.\nAnd I can tell you that our vice presidential candidate will be named on Tuesday or Wednesday, next week,” the source stated.\nThe committee is expected to make its recommendation known to Atiku, before the vice presidential candidate will be unveiled to the public.\nSaturday Sun gathered that the panel is currently scruntizing probable running mates for its presidential candidate, Atiku Abubakar.\nNevertheless, the source said it is Atiku that will have the final say on the choice of his running mate."
  },
  {
    "headline": "Don’t Present Muslim Running Mates, CAN, Northern Christian Elders Warn Tinubu, Atiku",
    "summarized_story": "But Governor Nasir El-rufai of Kaduna State stressed yesterday that competence should determine his party’s choice of presidential running mate instead of religion.\n“We do not subscribe to Christian/Christian ticket or Muslim/Muslim ticket.\nThose who are planning Muslim/Muslim ticket should also find out what was the outcome of MKO Abiola and Kingibe ticket in 1993.\nIf they try Muslim/Muslim ticket this time around, the outcome will be worse because our fault lines are very visible.\n“Now, extending that consideration to the Muslim-Muslim ticket, I have lived among the Christians and I know that among the Christians, the question of a Muslim-Muslim ticket is a no-go area."
  },
  {
    "headline": "Alleged $50m Fraud/Sale of Assets: Wike Orders Trial of Amaechi, Cole",
    "summarized_story": "The Rivers State Governor had in 2015 set up a Judicial Panel of Inquiry to investigate the activities of the Amaechi administration and the panel thereafter indicted Amaechi, Cole and some others for corruption.\nHowever, analysts are of the view that the drive to prosecute Amaechi and Cole is aimed at making the APC governorship candidate unelectable.\n“Once Cole is put on trial, and obviously will be convicted, his drive to become Rivers State governor ends,” said the analysts.\nLuckily, you came at the right time when we had preferred criminal charges against the former governor (Amaechi), Sahara Energy’s Tonye Cole and the rest of them.\nWike, who spoke during a media parley in Abuja, said the judgement had vindicated the Rivers State Government."
  },
  {
    "headline": "Breaking: Killers of Olufunke Olakunri, Daughter of Afenifere Leader, Sentenced to Death by Hanging",
    "summarized_story": "Fidelis David in AkureAn Ondo State High Court sitting in Akure, the state capital on Friday sentenced killers of Olufunke Olakunri, daughter of Afenifere leader to death by hanging.\nThey include: Lawal Mazaje from Kogi Sate; Adamu Adamu from Adamawa State; Mohammed Usman from Sokoto State.\nThe defendants were arraigned on counts of armed robbery, conspiracy, conspiracy to commit felony, conspiracy to commit armed robbery, kidnapping, murder, aiding and abetting.\n1 Laws of Ondo State of Nigeria, 2006.\n“You could see that one of the defendants was discharged by the judgement of the court court."
  },
  {
    "headline": "Buhari: Tinubu Has Track Record to Lead Our Party to Victory in 2023",
    "summarized_story": "Buhari stated this in a letter to the returning officer of the APC presidential primary convention and governor of Kebbi State, Atiku Bagudu, commending the success of the exercise.\n“Your commitment in pursuit of equity and fairness speaks volumes in the cooperation displayed by APC governors.\n“The party primaries were peacefully conducted and the delegates have selected the candidate to carry the APC flag in the 2023 presidential election.\n“I look forward to working closely with APC governors to support Senator Bola Ahmed Tinubu and all our APC candidates to success in 2023.\nTinubu was at the villa to thank the president for his support and successful hosting of the APC presidential primary."
  },
  {
    "headline": "FG: We’ve Traced Owo Killings to ISWAP",
    "summarized_story": "Unfortunately, gunmen, again struck in Sabo area of Ondo town, in Ondo West Local Government Area of the state and have killed six men.\n“The council is quite concerned about the violent attack in Owo, Ondo State, and has been able to locate the perpetrators of that horrendous attack.\n“It is not an ethnoreligious thing, the animals in ISWAP wanting attention, recognition, are suspected to have launched that attack.\nHe said, “They came to our area (Sabo) on motorbikes and each was carrying three gunmen.\nIt was against these developments that Afenifere, yesterday, paid a condolence visit to Ondo State Governor, Mr Oluwarotimi Akeredolu (SAN), in Akure, the state capital."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "Protest In Nigerian Hospital, UNTH As Relatives Of Patient Brutalise Doctor On Duty",
    "summarized_story": "Medical doctors at the University of Nigeria Teaching Hospital, Enugu State, have protested against an attack on their colleague on duty by the relatives of a patient.\nSaharaReporters gathered on Saturday that relatives of the patient a few days ago attacked and wounded the doctor on duty at the hospital.\nHowever, the doctors who were under the aegis of Association of Resident Doctors (ARD), in a protest letter to the management of the hospital on Friday after an emergency meeting condemned the attack.\nThe letter partly read, “The President, Dr. Jide Uzoigwe constituted a security committee with Dr. Emmanuel Ogbu as the Chairman.\n“So far, our demands are being attended to by the hospital management within the timeline we gave."
  },
  {
    "headline": "ASUU president rejects Brekete Family's N50m intervention fund to end strike",
    "summarized_story": "Emmanuel Osodeke, president of the Academic Staff Union of Universities (ASUU), has turned down an intervention fund by Brekete Family, a reality television and radio programme focusing on human rights issues, to end the strike.\nASUU had on February 14 declared a one-month warning strike to protest the non-implementation of its demands by the federal government.\nThere have been concerns over the lingering strike with many prominent figures calling ASUU and the government to address the issue.\nImmediately the money was displayed, the ASUU president reportedly expressed displeasure, rejecting the offer.\nSome Nigerians who phoned in during the programme also reportedly described ASUU as ”insensitive”."
  },
  {
    "headline": "ASUU president rejects Brekete Family's N50m intervention fund to end strike",
    "summarized_story": "Emmanuel Osodeke, president of the Academic Staff Union of Universities (ASUU), has turned down an intervention fund by Brekete Family, a reality television and radio programme focusing on human rights issues, to end the strike.\nASUU had on February 14 declared a one-month warning strike to protest the non-implementation of its demands by the federal government.\nThere have been concerns over the lingering strike with many prominent figures calling ASUU and the government to address the issue.\nImmediately the money was displayed, the ASUU president reportedly expressed displeasure, rejecting the offer.\nSome Nigerians who phoned in during the programme also reportedly described ASUU as ”insensitive”."
  },
  {
    "headline": "Ondo cancels June 12 celebrations in honour of Owo attack victims",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo, says the state government has cancelled the June 12 celebrations in honour of the victims of the Owo attack.\nOn Thursday, the federal government claimed the attack was masterminded by the Islamic State in West Africa Province (ISWAP).\nIn a statement to honour the victims of the attack, Akeredolu said the June 12 celebrations will be cancelled.\n“In honour of the victims of the terror attack at St. Francis Catholic Church in Owo, the Ondo State Government has canceled this year’s June 12 celebration,” the governor wrote on Twitter.\nAdvertisement“The cancellation is to enable the people of Ondo State mourn their loved ones who lost their lives in the horrific attack.”"
  },
  {
    "headline": "Ondo cancels June 12 celebrations in honour of Owo attack victims",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo, says the state government has cancelled the June 12 celebrations in honour of the victims of the Owo attack.\nOn Thursday, the federal government claimed the attack was masterminded by the Islamic State in West Africa Province (ISWAP).\nIn a statement to honour the victims of the attack, Akeredolu said the June 12 celebrations will be cancelled.\n“In honour of the victims of the terror attack at St. Francis Catholic Church in Owo, the Ondo State Government has canceled this year’s June 12 celebration,” the governor wrote on Twitter.\nAdvertisement“The cancellation is to enable the people of Ondo State mourn their loved ones who lost their lives in the horrific attack.”"
  },
  {
    "headline": "INEC: No APC governorship primary conducted in Akwa Ibom",
    "summarized_story": "The Independent National Electoral Commission (INEC) says its officials didn’t monitor any primary organised by the All Progressives Congress (APC) in Akwa Ibom state.\n“We wish to report that the APC governorship primary scheduled to hold on Thursday, May 26, 2022, at the Sheergrace Arena, Nsikak Eduok Avenue, Uyo, did not hold because the APC primary election committee did not come to the venue and did not hold the primary in any other venue monitored by the commission,” the report reads.\nBy the time we woke up in the morning, they said at some location, they have done governorship primary.\nAfter hours of back-and-forth over which venue was the approved place for the exercise, the APC primary election panel was said to have eventually gone to one Obot street venue for the primary.\nMeanwhile, Akpanudoedehe, who had also sought the party’s governorship ticket, has dumped the APC and is now the governorship candidate of the New Nigeria Peoples Party (NNPP)."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Moroccan Chari acquires Ivorian B2B e-commerce startup Diago",
    "summarized_story": "Chari, a Moroccan B2B e-commerce and fintech startup, today announced that it has acquired a 100% stake in Diago, an Ivorian app that connects neighborhood shops to FMCG producers and importers.\nThe all-stock transaction was facilitated by AF Legal and RBB International firms, representing Chari, and Houda Law Firm, representing the Ivorian upstart.\nThis acquisition is coming only 3 months after Chari acquired Axa Credit, the credit arm of Axa Assurance Maroc, for $22 million.\nJust last month, a Nigerian autotech startup Autochek travelled up north to acquire Moroccan KIFAL Auto.\nNow, Chari is acquiring a West African startup."
  },
  {
    "headline": "Boomplay launches in Côte d'Ivoire",
    "summarized_story": "Boomplay, a Chinese-owned music streaming platform for African artists and songs, has launched in Côte d’Ivoire.\nToday, the platform opened the doors of its Ivorian offices in Abidjan to enhance music streaming, and help Ivorian artists reach a broader audience within and outside the continent.\nCote D’Ivoire marks the 6th African country with Boomplay’s presence after Nigeria, Tanzania, Kenya, Tanzania, Ghana and Cameroon.\nSpeaking about the launch, Boomplay Côte d’Ivoire General Manager, Paola Audrey Ndengue, said, “We’re particularly proud to establish a presence in Abidjan, a creative and cultural hub in the region.\nGuy-Constant Neza, an Ivorian label manager at Believe Digital told Lemonde that 80% of Ivorian artists’ income comes from live performances."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Edo takes ‘Operation Plan Edo’ to Ohoghobi community, as residents laud govt’s masterplan initiative – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commenced the Operation Plan Edo exercise in Ohoghobi Community, in Ikpoba-Okha Local Government Area of the state, as part of its ongoing efforts to generate a database to ensure development adheres to the state’s urban and regional development plans.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, while flagging off the exercise, said that the initiative would provide data to ensure equitable distribution of government projects across the state.\nThis is to help the Edo State Government in planning for the community’s needs.\nThis includes the number of schools, roads, access to potable water, electricity, and medical services, among others.\n“The data collected will be collated for the planning of Edo."
  },
  {
    "headline": "Obaseki, German govt move to bridge technical skill gap with exchange programmes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…plans job placements for Edo trainees in GermanyBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is concluding plans to establish technical and vocational centres in the state with one year of study in Nigeria and job placement opportunities with companies in Germany.\nThe governor, who disclosed this to journalists in Benin City, said the partnership is part of efforts to bridge the technical skill gap of youths in the state.\n“Already, we are in conversation with the German Confederation of Skilled Crafts to establish technical and vocational centres in Edo with one year of study in Nigeria.\nWe are also exploring opportunities of the training in Germany with the possibilities of returning or staying in Germany.”He added, “In our recent visit to the European country, we explored several opportunities for skill transfer, partnership and investments.\nWe met with leaders of the German government and those of the GIZ Migration and Diaspora Programme to deepen investment in Edo in pursuit of the drive to make the state the most competitive subnational in Africa."
  },
  {
    "headline": "Tinubu pays surprise visit to Osinbajo – Nigerian Observer",
    "summarized_story": "At the time Tinubu arrived, the VP was meeting with Senator Kabiru Gaya; former Defence Minister, Major General Dan Ali (retd), and other associates.\nThe VP received Tinubu alongside his other guests and they exchanged pleasantries.\nEarlier, The NIGERIAN OBSERVER reported that the Vice president, Prof. Yemi Osinbajo, has finally sent a congratulatory message to Asiwaju Bola Tinubu.\nRecall that at the APC presidential primary, which started on Tuesday and was rounded off on Wednesday, Tinubu got 1,271 votes to clinch the party’s presidential ticket.\nOther results were former Minister of Transportation, Rotimi Amaechi, got 316 votes; Osinbajo, 235 votes; a former Minister of State for Education, Chukwuemeka Nwajiuba, one vote; Senator Rochas Okorocha and Pastor Tunde Bakare got zero vote each."
  },
  {
    "headline": "2023 Presidency: Full list of all presidential candidates – Nigerian Observer",
    "summarized_story": "In the All Progressive Party, APC, the former Governor of Lagos State and National leader of the APC, Asiwaju Bola Tinubu emerged winner of the presidential primaries held at Eagles Square, Abuja.\nTinubu defeated his closest opponents and former Governor of Rivers State, Chibuike Amaechi and Vice President Yemi Osinbajo and was handed the party’s flag by President Muhammadu Buhari.\nEarlier, the Peoples Democratic Party, PDP, elected former Vice President, Alhaji Atiku Abubakar as its presidential candidate.\nThe Labour Party, LP, also has former Anambra State Governor, Dr. Peter Obi, as its candidate.\nThe list of all the presidential candidates so far conducted in the country include:Asiwaju Bola Tinubu (APC)Atiku Abubakar (PDP)Prince Malik Ado-Ibrahim (YPP)Rabiu Musa Kwankwaso (NNPP)Omoyele Sowore (AAC)Peter Obi (LP)Prince Adewole Adebayo (SDP)Kola Abiola (PRP)Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "FIRS announces plan to begin nationwide tax compliance monitoring",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) has announced plans to embark on a nationwide Value Added Tax (VAT) and Withholding Tax (WHT) compliance exercise from July, 2022.\nThe tax agency disclosed this in a public notice announcing the compliance monitoring exercise, and signed by the FIRS Executive Chairman, Muhammad Nami.\nThe VAT and Withholding Tax Compliance Monitoring exercise will involve teams of FIRS officers visiting selected taxpayers and taxable persons to review their VAT and Withholding Tax records.\n“The Federal Inland Revenue Service (FIRS) shall embark on a nationwide VAT and WHT compliance monitoring exercise with effect from July 1, 2022,” the notice reads.\nThe Service also called on all taxable persons and tax agents to immediately remit deductions of VAT and Withholding Tax they have made on its behalf."
  },
  {
    "headline": "Muslim-Musim Ticket: Competence should be placed above religion – el-Rufai",
    "summarized_story": "Nasir el-Rufai, Kaduna State governor, has argued that the opposition to Muslim-Muslim ticket in 2023 is not necessary, as according to him, competence, capacity and capability in terms of delivering good governance to Nigerians should be placed ahead of religion.\nMaintaining that he doesn’t believe that the business of governance has to do with religion, el-Rufai advised the nation to rather look for the best person for the job instead of placing religious sentiment ahead of competence.\nThe governor said he doesn’t look at people from the lens of being a Muslim or Christian.\nThis fixation of Nigerians with religion instead of competence, capacity and capability is quite sad and pathetic,” he added.\nWhen I get into a plane I don’t ask for the religion of the pilot, when I go to the hospital, I don’t ask for the religion of the doctor."
  },
  {
    "headline": "CBN to introduce USSD code to improve eNaira",
    "summarized_story": "The Central Bank of Nigeria (CBN), has announced plan to introduce the Unstructured Supplementary (USSD) code as part of steps to improve the Central Bank Digital Currency (CBDC).\nKingsley Obiora, CBN deputy governor made the disclosure at the IMF African Department Speakers Series held virtually on Friday, according to NAN.\nObiora said the introduction of the USSD code became necessary to improve financial inclusion in the country and to ensure people without smartphones could still transact on the eNaira platform.\nObiora said the value of the country’s digital payments grew from 324 billion dollars in 2008 to about 2.4 trillion dollars presently, adding that Nigerians were now used to digital payments.\nHe said that the CBDC had significant benefits for Nigeria, which was why the CBN decided to introduce it."
  },
  {
    "headline": "Presidential Primary: Igbo delegates betrayed Southeast – Group",
    "summarized_story": "An Igbo group, the Association of South East Town Unions (ASETU), has accused Igbo delegates of betraying the presidential aspiration of the South East geopolitical zone at the primaries of political parties.\nIt is only equitable, just and fair that the South-East produces the next President of Nigeria, which begins with all the political parties fielding Igbo presidential candidates.\nIt is important to mention that 39 out of the 40 votes came from Ebonyi State delegates.\nThe question is, who did the other Igbo delegates of the South East vote for?\n“It is for this patriotic reason that ASETU therefore thumbs up all the delegates from Ebonyi State for making the Igbo proud."
  },
  {
    "headline": "2023: Yahaya Bello donates presidential campaign office to Tinubu",
    "summarized_story": "Kogi State governor, Yahaya Bello, has donated his presidential campaign office to Bola Tinubu, candidate of the All Progressives Congress (APC).\nTinubu defeated Bello, among others to clinch the ruling party’s presidential ticket on Wednesday, after polling 1,271 votes, while Bello secured 47 votes to place 5th.\nThe Kogi governor announced his decision to donate the campaign office in a letter of congratulations addressed to the APC presidential candidate, and dated June 9, 2022.\nI say thank you very much for donating a befitting office for us to continue to struggle,” Tinubu said.\n“We will use our intellectual inquisitiveness, build a nation of sound minds, sound people, elevate our people, extract them from poverty"
  },
  {
    "headline": "APC Presidential Primary: How We Settled For Tinubu – El-Rufai",
    "summarized_story": "Kaduna State governor, Mallam Nasir el-Rufai, yesterday gave an insider account of how former Lagos State governor, Bola Ahmed Tinubu emerged as the presidential flag bearer of the All Progressives Congress.\nInstead, he said what Tinubu needed at the moment was the space to pick a vice presidential candidate.\nThe statement titled, ‘Christian Association of Nigeria Rejects Proposed Muslim/Muslim Presidential Ticket in 2023’, noted: “The Christian Association of Nigeria has once again warned the leading political parties to bury the thought of Christian/Christian or Muslim/Muslim presidential ticket in 2023.\nBello was one of the contestants defeated by Tinubu in the contest to clinch the APC’s presidential ticket.\nAlso, the presidential candidate last night paid a visit to another APC presidential aspirant, Amaechi, in Abuja."
  },
  {
    "headline": "Court Sentences Killers Of Fasoranti’s Daughter To Death By Hanging",
    "summarized_story": "An Ondo State High Court sitting in Akure yesterday sentenced three of the four persons that killed Olufunke Olakunri, daughter of Afenifere leader, Reuben Fasoranti, to death by hanging.\nThe convicts are Lawal Mazaje from Kogi State, Adamu Adamu from Adamawa State and Mohammed Usman from Sokoto State.\n1 Laws of Ondo State of Nigeria, 2006.\n“Conspiracy to commit armed robbery contrary to and punishable under Section 6(b) of the Robbery and Firearms (Special Provisions) Act, Cap R11, Vol.\nIt would be recalled that Olufunke was murdered on June 2019 at Oore in Odigbo local government of Ondo State after a visit to her father in Akure, Ondo State."
  },
  {
    "headline": "APC Ticket: We Lost The Battle, Not The War – Vice President",
    "summarized_story": "Despite the outcome of the results of the presidential primary of the All Progressives Congress (APC), Vice President Yemi Osinbajo has said he only lost the battle and not the war.\nAccording to the vice president, despite the result of the APC presidential primary, “the dream of a new country remains alive and well.\nThe word has been spoken; it cannot be taken back: it is time for a New Nigeria,” Osinbajo added.\nThe vice president lost the APC presidential ticket to his benefactor and former governor of Lagos, Bola Tinubu.\nThe former vice president, in a post on his Instagram page late on Friday, described the meeting as pleasant and refreshing."
  },
  {
    "headline": "The Most Expensive Restaurants In The World",
    "summarized_story": "Unlike a lot of other high-end restaurants, Aragawa offers an a la carte menu instead of a tasting menu.\nRESTAURANT DE L’HOTEL DE VILLE – CRISSIER, SWITZERLANDCost: $415 Per HeadComing in at number six on our list of the most expensive restaurants in the world is Restaurant De L’Hôtel De Ville.\nPER SE – NEW YORK, UNITED STATESCost: $680 Per HeadThe second most expensive restaurant in the world is Per Se, located in New York, United States.\nULTRAVIOLET – SHANGHAI, CHINACost: $570 – $900 Per HeadOne of the most elite and expensive restaurants in the world, Ultraviolet costs between $570 – $900 per head, excluding drinks and taxes.\nSUBLIMOTION – IBIZA, SPAINCost: $2,380 Per HeadSublimotion is the most expensive restaurant in the world, costing an eye-watering $2,380 per head."
  },
  {
    "headline": "My Goal Is To Make Young Women Financially Independent – Kitmwa",
    "summarized_story": "Bent on following their footstep, I established Awtik Beautifiers Centre where I train girls to be self sufficient and financially independent , hence, liberating them from the shackles of poverty.\nCAREERIt all started back then in the University of Jos where I developed myself to be financially different from my peers.\nACHIEVEMENTSSo far, I have trained 300 girls who are self sufficient and financially independent to take care of themselves and their siblings.\nThen I also struggle with the fear of losing my parents before making it in life, hence, motivation to being financially independent.\nFUTURE PLANLike I said earlier, I strive to grow and expand to the nooks and crannies of this country to motivate young ladies to be completely financially independent."
  },
  {
    "headline": "Mompha breaches bail terms, travels to Dubai with new passport",
    "summarized_story": "Ismaila Mustapha, also known as Mompha breached the terms of his bail by procuring a new passport and travelling to Dubai on 11 April, EFCC prosecuting counsel, Rotimi Oyedepo has told the Ikeja High Court.\nOyedepo made the startling information known on Friday to Justice Mojisola Dada, in whose court, Mompha, with his company Ismalob Global Investment Limited, was standing trial.\n“Armed with this passport, the information we have from our partners is that, on the 11th of April, 2022 via Emirates Airlines, the defendant flew from Ghana to Dubai.\nThe defendant, who was shown the soft copy in open court, however, denied it was his passport.\nJustice Dada granted the prayer of the defence and also released the defendant to the defence counsel."
  },
  {
    "headline": "President Buhari showers praises on Atiku",
    "summarized_story": "Atiku Bagudu of Kebbi for playing an extraordinary role in ensuring the successful conduct of the just-concluded APC Special National Convention.\nSarki said the commendation was contained in a letter by the president addressed to the Chairman, Progressives Governors’ Forum, on his role in the recently conducted APC national convention.\nHe said: “I was pleased to see how you were very professional and efficient in handling the sensitive political position of Chairman, Progressives Governors’ Forum.\n“Your commitment in pursuit of equity and fairness speaks volumes in the cooperation displayed by APC governors.\nThe president also said that he looked forward to working closely with APC governors to support Tinubu and all other APC candidates."
  },
  {
    "headline": "Sanwo-Olu has abandoned governance for Tinubu’s campaign -Adegboruwa",
    "summarized_story": "Adegboruwa, who was one of the members of the Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS-Related Abuses, warned the governor on spending the state’s resources on Tinubu’s campaign.\n“Since the declaration of the presidential aspiration of Asiwaju Bola Ahmed Tinubu, Governor Babajide Sanwoolu has abandoned governance in Lagos State.\nNine aspirants had earlier stepped down, eight of whom asked their supporters to vote for Tinubu, while one asked his supporters to vote for Osinbajo.\nThose who stepped down before voting began are Governor Abubakar Badaru of Jigawa, Robert Boroffice, Ken Nnamani, Ibikunle Amosun, Dimeji Bankole, Ekiti State Governor Kayode Fayemi and Godswill Akpabio.\nPastor Felix Nicholas, the United States of America-based aspirant also stepped down and asked his supporters to vote for Osinbajo."
  },
  {
    "headline": "BREAKING: Tinubu, Yahaha Bello in closed-door meeting",
    "summarized_story": "The presidential candidate of the All Progressives Congress and former Governor of Lagos State, Asiwaju Bola Tinubu, is currently in a closed-door meeting with Governor Yahaya Bello of Kogi State, in what political observers said was part of reconciliatory moves to pacify aggrieved aspirants of the APC presidential ticket.\nTinubu was accompanied to the meeting on Friday by Governors Babajide Sanwo-Olu (Lagos); Bello Matawalle (Zamfara); and Abdullahi Ganduje (Kano).\nA former governor of Edo State and former national chairman of the APC, Adams Oshiomhole, is also in the entourage.\nIt was, however, not clear if the issue of Tinubu’s running mate would be part of the agenda.\nNews Direct learnt that they would brief the press on the outcome of the meeting."
  },
  {
    "headline": "Atiku’s running mate: PDP raises panel as Wike, Okowa lobby for VP slot",
    "summarized_story": "On his part, the APC presidential candidate, Asiwaju Bola Tinubu, on Thursday, began the search for his running mate with a meeting with northern governors.\nA close source to Wike told The PUNCH that the governor was in Abuja lobbying to be named Atiku’s running mate.\nIt is not out of place if he is pushing to become the running mate of the PDP presidential candidate, Atiku Abubakar.\n“Don’t forget that he came second in the PDP presidential primary in Abuja, so that tells you his pedigree,” he stated.\nKelvin Ebiri, the Special Assistant on Media to Wike kept mum over the choice of running mate for Atiku."
  },
  {
    "headline": "BREAKING: Killers of Fasoranti’s daughter sentenced to death",
    "summarized_story": "BREAKING: Killers of Fasoranti’s daughter sentenced to deathThree persons involved in the killing of Olufunke Olakuri, daughter of Afenifere Leader, Pa Reuben Fasoranti, have been sentenced to death by hanging.\nThey were sentenced by an Ondo State High Court sitting in Akure.\nPresiding Judge, Justice William Olamide, however, discharged and acquitted the fourth suspect, Auwàla Abubakar, who is the spokesman of Miyetti Allah.\nOlufunke was shot dead in June, 2019 by gunmen in Ore, Odigbo Local Government Area of Ondo State.\nHer alleged killers were later arrested and arraigned six months after her death."
  },
  {
    "headline": "[Breaking] Owo massacre: Akeredolu cancels June 12 celebration in Ondo",
    "summarized_story": "Ondo state governor Rotimi Akeredolu has just announced the cancellation of June 12 celebration in Ondo state.\nAkeredolu who made the announcement via his social media handle on Saturday morning said the decision was to enable the people of the state mourn their loved ones who lost their lives during the attack.\nHe wrote, “In honour of the victims of the terror attack at St. Francis Catholic Church in Owo, the Ondo State Government has canceled this year’s June 12 celebration.\n“The cancelation is to enable the people of Ondo State mourn their loved ones who lost their lives in the horrific attack.”Gunmen had invade saint Francis Catholic church in Owo on Sunday June 5, 2022, pretending to be worshippers before killing many people.\nOn Thursday June 9, 2022, the federal government linked ISWAP as the group responsible for the attack."
  },
  {
    "headline": "Forgery’: AGF takes over trial of Anambra university professor, 4 others",
    "summarized_story": "The Attorney-General of the Federation (AGF), Abubakar Malami, on Friday, took over the suit filed against Prof. Obiajulu Obikeze and four others over allegations bordering on forgery of chieftaincy documents.\nCounsel for the AGF, Joe Agi, SAN, told Justice Inyang Ekwo shortly after the matter was called for trial commencement.\nUpon resumed hearing, Agi informed that he had been authorised by the AGF to take over the matter.\nThe News Agency of Nigeria (NAN) reports that the trial commencement, on May 23, suffered a setback.\nObikeze, who works with the Chukwuemeka Odumegwu Ojukwu University, formerly known as Anambra State University Igbariam in Anambra, was arraigned on Feb. 22 alongside others on 11 counts."
  },
  {
    "headline": "Breaking: William Troost-Ekong ruled out of Super Eagles vs Sao Tome & Principe AFCON 2023 qualifier",
    "summarized_story": "Watford FC player William Troost-Ekong has been ruled out of Sao Tome & Principe African Cup of Nations qualifier versus Super Eagles clash due to groin injury.\nTroost-Ekong was injured while featuring for Super Eagles against Sierra Leone in Abuja.\nBlueprint has now gathered that the Super Eagles Vice Captain has left camp to London to start treatment in preparation for the upcoming season.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "FIRS Pledges Collaboration with KW-IRS on Improved Revenue Generation",
    "summarized_story": "By Kayode AbdulazeezFederal Inland Revenue Service (FIRS) has pledged to collaborate with the Kwara State Internal Revenue Service (KW-IRS) to improve revenue generation in the state.\nThe FIRS official also said that the courtesy visit was aimed at strengthening the long-standing institutional relationship between FIRS and KW-IRS.\nAdama, who applauded the data-sharing liaison between both revenue agencies, pledged continual collaboration in ensuring eligible taxpayers in the State are adequately and appropriately captured into the tax net.\nThe team also discussed several areas of interest and concerns as they relate to revenue enhancement for Kwara State.\nAlso speaking, the Executive Chairman, KW-IRS, Shade Omoniyi, commended FIRS for the support towards achieving seamless tax administration."
  },
  {
    "headline": "NBC Celebrates DG Ilelah as he marks one year in office",
    "summarized_story": "By Friday ObandeAs he marks one year in office, the Management and Staff of National Broadcasting Commission, have felicitated with Director General of the commission, Mallam Balarabe Shehu Ilelah.\nIn a congratulatory message by the commission’s management, it said Ilelah, has on assumption in office, brought his wealth of experience into the running of the NBC.\nAlso, in the course of carrying out the commission’s regulatory functions, the management noted that the DG has continued to stress on professionalism on the part of broadcasters.\nThe Director General implored Broadcasters to engender the unity, peace and progress of our dear country,” they added.\nIlelah, a veteran international broadcaster, was appointed DG of the commission on June 7, 2021 by President Muhamadu Buhari."
  },
  {
    "headline": "Jos Disco urges BIRS to unseal office",
    "summarized_story": "By Sunday Ogli, MakurdiManagement of Jos Electricity Distribution, JED, Plc, has called on the Management of BIRS to swap its tax liability by deducting it from the state government’s indebtedness to the company.\nBenue State Government is indebted to Jos Disco as at 31st December, 2021 to the tune of ₦157,943,414.14 million while Jos Disco owes state’s tax agency; BIRS ₦156,515,414.47 million.\nHowever, BIRS, as a result of the debt, sealed off the operational office of Jos Disco in Gboko and Makurdi on Wednesday.\n“This could be gleaned from several correspondences and meetings to this effect”, the press release stated.\nDr Elijah further disclosed that to resolve the impasse, the two bodies had mandated their tax consultants to ascertain the true situation of things."
  },
  {
    "headline": "NACC urges Nigerian exporters to take advantage of AGOA",
    "summarized_story": "Nigerian American Chamber of Commerce (NACC) Abuja Chapter has called on all Shippers to take advantage of the window provided by the African Growth and Opportunity Act (AGOA) Programme to boost trade between Nigeria and the United States of AmericaThe Executive Secretary of NACC Abuja Chapter, Mr. Ayo Salaam disclosed that Nigerian companies have not taken advantage of the AGOA because they export mainly oil to the United States.\nThe AGOA forum is one of the key components of U.S African strategy that focuses on increasing the United States Trade and Investment in Africa as a mechanism for job creation within the continent.\n“The AGOA project initiated by the United States of America in 2000 was to help develop trade and facilitate exporting over 6000 goods into America with no tariff.\nSpeaking at the event, a diplomat, Ambassador Bayo Idowu, encouraged all shippers to leverage on the AGOA partnership.\n“We are readily available to provide assistance and advice on how Nigerian products can be accepted in the American market."
  },
  {
    "headline": "NDE uplifts 630 Anambra youths on vocational skills",
    "summarized_story": "Tony Oraeki, AwkaThe National Directorate of Employment, NDE, has commenced the training of 630 unemployed youths in Anambra state on various vocational skills.\nThe training would be on two categories which are Basic National Open Apprenticeship Scheme, B-NOAS, and Advanced National Open Apprenticeship Scheme, A-NOAS, with 420 and 210 beneficiaries respectively.\nAddressing the beneficiaries at the orientation ceremony in Awka yesterday, the NDE State Coordinator, Mrs. Chika Ufelle said that B-NOAS is a scheme through which the unemployed youths both male and female are recruited to acquire marketable vocational skills for decent job opportunities.\nShe also said the trainees under A-NOAS are designed for artisans who graduated from B-NOAS with an aim to upgrade their skills to higher levels of competence.\n” I very much appreciate the effort of NDE to avail me this opportunity to be trained in Computer Appreciation.” She said."
  },
  {
    "headline": "Owo Attack: FG’s Conclusion On ISWAP ‘Too Hasty’ – Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State says the Federal Government was “hasty” in blaming the Islamic State’s West African Province (ISWAP) for the Owo church attack.\nThe governor said this in a statement issued by his Chief Press Secretary, Richard Olatunde, on Friday.\nISWAP don’t hide their attacks,” the governor was quoted as saying during a virtual interaction with a Swiss-based Christian human rights Organisation, Christian Solidarity International (CSI) on Friday.\nWe are yet to know their identity and our security people are still on their trail.”RELATEDInsecurity: Gunmen Kill Four Persons In OndoISWAP Behind Owo Church Attack – National Security CouncilOwo Attack: Death Toll Rises To 40, Hospitals Discharge 26Owo Church Attack: Police Recover Three Unexploded IEDsAkeredolu, who described the attack that led to scores of death and several injuries, said the incident is a crime against humanity.\nHe said the attack, though horrific, will not deter the indomitable spirit of the people of the state in their quest to fight insecurity."
  },
  {
    "headline": "El-Rufai: How Buhari Refused To Tell Kaduna Delegates Who To Vote At APC Pres. Primary",
    "summarized_story": "﻿Kaduna State Governor, Nasir El-Rufai, has related how President Muhammadu Buhari refused to dictate how delegates from his state should vote at the All Progressives Congress’ presidential primaries.\nSpeaking on Channels Television’s Politics Today, El-Rufai said President Buhari told the delegates to “vote their conscience.”“In many of our states, the delegate votes were divided,” El-Rufai said.\n“I said, what then should I tell Kaduna delegates.\nHe said, tell them to vote their conscience; they are representing 10 million people in Kaduna state.\n“Now I don’t know how the Kaduna delegates voted, but the feedback I got after the voting is that most of them voted for Asiwaju, some voted for Amaechi and some voted for Professor Yemi Osinbajo.”"
  },
  {
    "headline": "INEC Records ‘Unprecedented Surge’ In PVC Registration, To Deploy More Machines",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Friday said it has recorded an unprecedented surge in the number of citizens seeking to registers as voters ahead of the 2023 elections.\n“The Independent National Electoral Commission (INEC) has received reports from our States indicating an unprecedented surge in the number of citizens that wish to register as voters and the challenges they face across the country.\nThe necessity to urgently deploy more voter enrolment machines to ease the congestion at the registration centres was identified as a priority.\n“Every step will be taken and all options will be explored to ensure that eligible Nigerians are given the opportunity to register as voters.\n“The sudden surge is an affirmation of the increasing confidence Nigerians have in our electoral process."
  },
  {
    "headline": "CSOs Call On INEC To Extend Deadline For Voter Registration",
    "summarized_story": "The Nigeria Civil Society Situation Room (Situation Room), a coalition of Civil Society Organisations, has called on the Independent National Electoral Commission (INEC), to extend the Continuous Voter Registration (CVR) exercise.\n“There have also been several appeals by Nigerians to INEC to extend the registration exercise to enable them register to obtain a PVC.\nIn Nnewi North Local Government, another report states that the sum of 1,000 Naira is being collected for voter registration.\n“Situation Room calls on INEC to check conduct of their staff nationwide, properly coordinate the ongoing voter registration exercise and restrain the chaotic situation in many registration centres nationwide.\nS 9(6) of the Electoral Act 2022 which allows for voter registration to go on till ninety days to the general elections means that INEC still has room to extend the CVR exercise."
  },
  {
    "headline": "Ondo Govt Cancels June 12 Celebrations Over Owo Attack",
    "summarized_story": "The Ondo State Government has canceled this year’s June 12 celebrations in the state following an attack on the St Francis Catholic Church in Owo.\nGovernor Rotimi Akeredolu of Ondo State said this in a tweet on his official handle on Saturday.\n“In honour of the victims of the terror attack at St. Francis Catholic Church in Owo, the Ondo State Government has canceled this year’s June 12 celebration,” the governor tweeted.\n“The cancelation is to enable the people of Ondo State to mourn their loved ones who lost their lives in the horrific attack.”In honour of the victims of the terror attack at St. Francis Catholic Church in Owo, the Ondo State Government has canceled this year’s June 12 celebration.\nThe cancelation is to enable the people of Ondo State mourn their loved ones who lost their lives in the horrific attack."
  },
  {
    "headline": "Ekitit 2022: Oyebanji, other candidates sue for peaceful election",
    "summarized_story": "The governorship candidate of All Progressives Congress (APC), Mr Biodun Abayomi Oyebanji and five candidates of other political parties have called for a peaceful conduct of the June 18 election in the state.\nOlusegun Oni of the Social Democratic Party (SDP), Bashorun Reuben Famuyibo of the Accord Party (AP) and Erelu Kemi Elebute-Halle of the Action Democratic Party, ADP.\nOthers are Hon Bisi Kolawole of the People’s Democratic Party (PDP) and Dr. Wole Oluyede of the African Democratic Congress (ADC).\nAt an early age I was involved in the drafting of the Master Plan for Ekiti State.\nSpeaking on the need for Ekiti people to ensure a peaceful election, Oyebanji said the exercise should not be a do or die affair, adding that he didn’t pray for shedding of blood of any Ekiti indigene as a result of election violence."
  },
  {
    "headline": "Politics is not about force, you must work hard, be diplomatic-Gov Sule",
    "summarized_story": "Politics is not about force; you cannot say, “I must have it, I must do that.” Instead, you must talk to people diplomatically, lobby for it, and work hard for it.\nThese were the words of Governor Abdullahi Sule of Nasarawa State while speaking on TVC’s News morning show, TVC Breakfast on Thursday.\nGovernor Sule noted that Bola Ahmed Tinubu, the APC Presidential Flagbearer, had worked extremely hard for this position and that people should credit him for it.\nGovernor Sule urged everyone to come together to rebuild the party adding that everyone will have their turn.\n“Who knows what will happen next, maybe the Southeast will win it, so that’s how politics works,” he said.https://www.tvcnews.tv/2022/06/father-alia-wins-benue-apc-governorship-re-run-primary-election/"
  },
  {
    "headline": "INEC declares end to nomination of candidates for 2023 Elections in Oyo -",
    "summarized_story": "The Independent National Electoral Commission has declared that all primaries into the nomination of candidates by political parties in Oyo state for the 2023 General Elections has ended.\nThe Oyo state Resident Electoral Commissioner Mutiu Agboke who disclosed this through a press release stated that as from Friday 10th June 2022 all political parties are required to submit their candidates list for National Elections on or before 17th of June.\nThe Resident Electoral Commissioner added that the list of candidates of the state election shall be uploaded between first and fifteenth of July.\nHe added that all political parties are also required to upload the details of their candidates for each constituency to the INEC Nomination Portal as it would be shut down on the 17th of June.\nOther parties like the African Democratic Congress, the New Nigerian Peoples Party, Africa Action Congress and Others have also taken advantage of the extension top conduct Presidential Primaries."
  },
  {
    "headline": "Father Alia Wins Benue Apc Governorship Re-run Primary Election -",
    "summarized_story": "Fr Hyacinth Iormem Alia, has won the Governorship primary election rerun conducted by the All Progressives Congress, APC, in 12 Local Government Areas and 3 council wards in Buruku Local Government in Benue State.\nThe rerun was conducted in Ogbadibo, Ushongo, Konshisha, Oju, Apa, Kwande, Agatu, Ohimini, Ado, Obi, Okpokwu and Apa Local Government Areas.\nSecretary of the Committee, Emma Maji, described the Rerun election as free, fair and credible.\nShortly after the declaration of results, State Deputy Chairman of the party, Stephen Tsav on behalf of the State Chairman, Comrade Austin Agada, presided over the congress that affirmed the outcome of the rerun gubernatorial primary election.\nThe Benue APC had conducted its Governorship primary election on the 27th of May, 2022 with Alia as the winner."
  },
  {
    "headline": "Atiku Must Pledge To Do One Term To Get Southeast Votes – Prof Obiora Okonkwo | Jacob Mark",
    "summarized_story": "RelatedStories No Content AvailableThe Peoples Democratic Party PDP have one last hurdle to scale before they can fully embark on a campaign to get the electorate on their side, and that is to select a running mate that compliments Atiku Abubarkar.\nAs part of consultations to enable him choose his running mate, the PDP presidential candidate on Wednesday met with all the party’s elected governors in Abuja.\nAtiku had on Monday met with the members of the party’s Board of Trustees in Abuja on same issue.\nThe consultation was to ensure that the person to be chosen as his running mate was acceptable to all stakeholders of the party.\nTo discuss the search for a running mate to compliment Atiku Abubarkar, is Professor OBIORA OKONKWO, a Member of the Peoples Democratic Party, and JACOB MARK, former National Legal adviser of the PDP."
  },
  {
    "headline": "‘Tinubu Needs a Muslim Running Mate to Capture Northern Votes’ – Cairo Ojougboh | Hillard Etta",
    "summarized_story": "APC National Vice Chairman, South South, Hillard Etta & Former Executive Director, Niger Delta Development Commission, Cairo Ojougboh, speak on the possibility of the position of the Running Mate of APC presidential candidate, Bola Tinubu, being a MuslimRelatedStories No Content Available"
  },
  {
    "headline": "US Inflation Hit 40-Year High of 8.6% in May",
    "summarized_story": "Much higher gas prices were to blame for most of that increase.\nSurveys show that Americans see high inflation as the nation’s top problem, and most disapprove of President Biden’s handling of the economy.\nInflation has remained high even as the sources of rising prices have shifted.\nEven so, rising gas prices are eroding the finances of millions of Americans.\nEconomists have pointed to that shift in spending from goods to services as a trend that should help lower inflation by year’s end."
  },
  {
    "headline": "Capitol Riot Hearings: Trump Accused of Coup Attempt",
    "summarized_story": "The congressional committee investigating the U.S. Capitol riots kicked off public hearings on Thursday with graphic video and chilling testimony from witnesses, laying out a case against former Republican President Donald Trump.\nThe Democratic-led committee presented videotaped testimony showing that close Trump allies, including his own daughter Ivanka, rejected his false 2020 election fraud claims.\nThe congressional committee investigating the U.S. Capitol riots kicked off public hearings on Thursday with graphic video and chilling testimony from witnesses, laying out a case against former Republican President Donald Trump.\nThe Democratic-led committee presented videotaped testimony showing that close Trump allies, including his own daughter Ivanka, rejected his false 2020 election fraud claims.\nShe described hours of grueling hand-to-hand combat with Trump supporters who barged into the Capitol that day."
  },
  {
    "headline": "‘I Have The Political Will to Lead The Country’ Says ADC Presidential Candidate Dumebi Kachikwu",
    "summarized_story": "ADC presidential candidate Dumebi Kachikwu speaks on his emergence as the flagbearer of the African democratic congress."
  }
]