[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "LIVE UPDATES: Osun governorship election",
    "summarized_story": "Welcome to our live coverage of Osun governorship electionOsun Election in numbersLGAs – 30Polling units – 3,763The frontline contestants in the election are Governor Adegboyega Oyetola of the All Progressives Congress; Ademola Adeleke of the Peoples Democratic Party; Lasun Yusuff of Labour Party; Akin Ogunbiyi of Accord Party; and Goke Omigbodun of Social Democratic Party among others.\nStart View Liveblog"
  },
  {
    "headline": "Osun poll: Why Aregbesola’s post was deleted -Aide",
    "summarized_story": "The PUNCH had reported the minister shared a post on social media after the defeat of Osun State Governor, Gboyega Oyetola, in the just-concluded Osun State Governorship election.\nThe victory came for Adeleke nearly four years after failing by a small margin in his bid to govern Osun State.\nBoth Oyetola and Adeleke contested for the Osun governorship seat in 2018, which Oyetola won after a rerun.\nWe are long-distance runners and will not abandon the ship of our party, in calm or stormy waters.”Why Aregbesola shunned Osun election -AideAregbesola did not partake in the Osun State Governorship election.\nHe also said the minister was not named in the Osun State campaign team by the All Progressives Congress."
  },
  {
    "headline": "2023: We’ll agitate, propagate, ensure Atiku emerges next president – Northern Youths",
    "summarized_story": "By Luminous Jannamike, AbujaYouths across the 19 Northern states have vowed to propagate the leadership qualities of the presidential candidate of the Peoples Democratic Party, Atiku Abubakar, as well as agitate and ensure he wins in the 2023 general election.\nThey made the vow at the inauguration of 19 State Coordinators of the ‘Northern Youth Coalition For Atiku and Okowa 2023’ in Abuja on Saturday.\n“Only one candidate has all these qualities and that candidate is Alhaji Atiku Abubakar, GCFR, (Wazirin Adamawa).\n“Atiku Abubakar is a man that would redirect our economy, he has the capability to tackle insecurity and corruption.\nWe have a vision and mission of making sure we contribute our quota towards the actualisation of their Excellencies, Atiku and Okowa as President and Vice President, respectively."
  },
  {
    "headline": "DGN inaugurates multi-purpose co-operative society, appoints executive members",
    "summarized_story": "By Sylvester KwentuaThe Directors Guild of Nigeria, DGN, on Friday, inaugurated their first multi-purpose co-operative society, in their head office in Lagos.\nSpeaking at the forum, the president of the DGN, Victor Okhai, explained why the guild decided to form a co-operative society.\nAlthough forming a co-operative society was a part of his campaign promises, Victor Okhai however insisted that joining the co-operative society would be at the discretion of members, stressing that the guild won’t force members to join the co-operative society.\nThe types of co-operative societies available for members of the public to join according to the Lagos State team, are; the co-operative thrift and credit society, the co-operative multi-purpose society, amongst others.\nThose chosen to lead the guild’s co-operative society are; Victor Okhai, who will be the president of the co-operative society, Kingsley Omoefe, who will be the secretary and Osita Okolie, who will act as the treasurer of the co-operative society."
  },
  {
    "headline": "Ikpeazu orders desilting of blocked drainages in Ariaria Market",
    "summarized_story": "By Ugochukwu Alaribe – UmuahiaAbia State Governor, Dr. Okezie Ikpeazu has directed the chairman of Ariaria International Market, Elder Emeka Igara to ensure that all the blocked drainages in the market were desilted within 7 days.\n“The governor wants to ensure that the work is completed before he leaves office with minimal disruption to trading activities.\n“He has therefore directed chairman of the Ariaria market, Elder Igara and his team to ensure that work starts on identified blocked drainages in the market.\n“Ariaria is on a low land and at the moment lower than Faulks Road and that is why water from Ariaria cannot flow into the gutter on Faulks road.\n“The idea of scooping the drainages is to bring a temporary relief to the issue of flood in Ariaria."
  },
  {
    "headline": "How Adeleke won Osun governorship election with a Christian-Christian ticket",
    "summarized_story": "By Biodun BusariAgainst criticisms and confrontations mounted before him for picking Christian deputy governorship candidate, Kola Adewusi, the governorship candidate of the Peoples Democratic Party (PDP), Senator Ademola Adeleke won the Osun State election on a Christian-Christian ticket.\nThe PDP’s members of the National Working Committee (NWC) were divided over the choice because both Adeleke and Adewusi are Christians.\nA Christian-Christian ticket cannot fly in Osun State.\nAdemola Adeleke and Kola Adewusi are both Christians.”Adeleke defeated Governor Oyetola of the All Progressives Congress (APC) on Saturday.\nThe Independent National Electoral Commission (INEC) Returning Officer for Osun State election, Prof Okuwatoyin Ogundipe declared Adeleke winner."
  },
  {
    "headline": "2023: Why I did not influence Tinubu’s emergence — Buhari",
    "summarized_story": "They went and elected Asiwaju Bola Ahmed Tinubu, and he picked his running mate, Sen. Kashim Ibrahim, in a process for the 2023 elections.\nThe President prayed that God would give him more strength and wisdom to protect the people and fulfill his promises.\nBuhari further said: “They say he who wants to serve should be ready for the responsibility of leadership.\nIf only we knew what other countries in Africa are passing through, we will be grateful to God, and protect our country.\n“As leaders, we are doing our best, and will keep doing our best to improve the situation."
  },
  {
    "headline": "Osun election: This is democracy – Buhari reacts to Adeleke’s victory",
    "summarized_story": "President Muhammadu Buhari has congratulated Senator Ademola Adeleke of the Peoples Democratic Party, PDP for winning the governorship race in Osun State.\nThe Independent National Electoral Commission, INEC on Sunday declared the former lawmaker winner of the just concluded election.\nAdeleke, emerged as the winner of the governorship election after polling 403,371 votes against his major opponent, Gboyega Oyetola who garnered 375,027 votes.\nHe wrote, “I congratulate Senator Ademola Adeleke, candidate of the Peoples Democratic Party (PDP), on his victory in the Osun gubernatorial election.\nThe people of Osun have expressed their will through the ballot."
  },
  {
    "headline": "Bishop Kukah calls for prayers of atonement, reparation in Sokoto",
    "summarized_story": "Matthew Kukah, the Catholic Bishop of Sokoto Diocese, has called for prayers of atonement and reparation over what he described as a sacrilegious act at St. Kevin’s Catholic Church, Gidan Dare of Sokoto State.\nThe Bishop in a statement titled, “A call for prayers of atonement and reparation”, recalled the events that happened in Sokoto town, following the killing of Deborah Yakubu over alleged blasphemy, in which Muslim protesters entered the premises of the church and desecrated the Sacred Species in the Chapel of Perpetual Adoration, the altar and the main church and destroyed other valuables.\nThe statement said the prayer of reparation would begin Monday, 18th July and end on Sunday, 24th July 2022 and called on faithful to join.\nThe spiritual exercise, according to him, was imperative in seeking God’s mercy on parishioners and the entire diocese in the state for forgiveness and purification.\nThe statement explained, “In response to this sacrilegious act carried out at St. Kevin’s Church, it has become imperative for us in the diocese to perform an act of reparation seeking for God’s mercy on the faithful of the parish and those of the entire diocese and forgiveness of the perpetrators of the heinous act.”He encouraged members of the Diocese to fast as they pray, and urged everyone to remain calm, expressing optimism that the church would “overcome this challenging moment.”"
  },
  {
    "headline": "Osun 2022: Group lauds INEC for free, fair election, hails governor-elect",
    "summarized_story": "The leadership of Patriotic Youth Alliance G40 has hailed the Independent National Electoral Commission (INEC) for ensuring an electoral process that assures transparency, competence and unbiasedness with the just concluded election of Osun State.\nThe leadership of the group also praised the security agencies for doing a wonderful job of ensuring eligible voters cast their votes in a free and conducive environment.\nThe group said such action has reignited the lost confidence of the Osun people and Nigerians to actively participate in the coming 2023 general elections in the country.\nIsah Abubakar, the National Coordinator of the group in a statement on Sunday in Kaduna and made available to DAILY POST said, “We wish to commend INEC for ensuring an electoral process that assured transparency, competence and unbiasedness in the elections of Osun State.\nThe leadership of Patriotic Youth Alliance G40, also congratulated the Governor-elect, Senator Ademola Adeleke for his landslide victory in the just concluded election in the state and called on him to be a servant leader by exhibiting exemplary leadership to the people."
  },
  {
    "headline": "Osun 2022: Remember that power resides with people- Makinde warns colleagues",
    "summarized_story": "Governor Seyi Makinde of Oyo State has enjoined politicians across the country to remember that power belongs to the people.\nThe governor who was reacting to the victory of Senator Ademola Adeleke in Saturday’s election in Osun State advised his colleagues to remember that it is the people that have the power.\nMakinde who is the only PDP governor in the South West region while reacting said what happened on Saturday was similar to what happened in Oyo State in 2019.\nMakinde used the opportunity to congratulate the governor-elect and also hailed the voters across the 30 local governments of Osun State for standing by PDP.\n“The power of the people will continue to triumph, the earlier politicians realise this fact, the better for our democracy.”"
  },
  {
    "headline": "Osun: Buhari’s minister, Aregbesola deletes post mocking Tinubu, Oyetola",
    "summarized_story": "The Minister of Interior, Rauf Aregbesola has pulled down posts he made on his social media handles mocking the All Progressives Congress, APC presidential candidate, Bola Tinubu.\nRecall that Tinubu had during the APC mega rally in Osun, boasted that the APC candidate and the incumbent Governor, Gboyega Oyetola would emerge the winner of the election no matter what.\nRecall also that there has been a face-off between Aregbesola and Tinubu, as the Minister who was the Governor of Osun State from 2010 to 2018, accused Asiwaju and ex-governor of Osun State, Bisi Akande, of forcing the current governor of the state, Gboyega Oyetola, on the people against popular will.\nInstead, the minister then asked the party members in Osun to support a former Secretary to the State Government, Moshood Adeoti, who was later defeated in the primary election.\nIn a fresh post on his Facebook page, Aregbesola explained that the earlier content was posted without his consent."
  },
  {
    "headline": "Jubilation erupts in Ikire over Adeleke's victory The Nation Newspaper",
    "summarized_story": "Scores of Peoples Democratic Party (PDP) supporters stormed major streets in Ikire town on Sunday to celebrate the victory of the party’s governorship candidate Senator Ademola Adeleke.\nAdeleke was defeated in the town with 4,022 votes but his fortunes in other local governments fetched him victory.\nThe Osun West senatorial candidate of the party Akogun Lere Oyewunmi hails from the town.\nScores of his supporters took to the streets Sunday morning in a convoy of cars over the victory and waving PDP flag.\nThe town has been generally calm and the election was peaceful."
  },
  {
    "headline": "Buhari congratulates Osun Governor-elect Adeleke The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has congratulated candidate of the People’s Democratic Party (PDP) in the just- concluded Osun governorship election, Senator Ademola Adeleke, over his election.\nIn a statement by his Special Adviser on Media and Publicity, Mr Femi Adesina, Buhari noted the outcome of the election had expressed their choice of whom they want to lead them.\nThe President further noted the successful conduct of the election was a testimonial to the maturity and commitment of all stakeholders.\n“President Muhammadu Buhari congratulates Senator Ademola Adeleke, candidate of the People’s Democratic Party (PDP), following victory of the party in Saturday’s gubernatorial election in Osun State.\n“The President reassures the nation that the commitment of this administration towards having credible elections remains unshaken,”, the statement reads."
  },
  {
    "headline": "In Nigeria, refining oil costs more than human lives (Part One) The Nation Newspaper",
    "summarized_story": "They had sought justice for their people who suffered the consequences of crude oil mining in Nigeria.\nIt was the first time compensation would be paid over an oil spill in Nigeria.\nMTBE is not a part of crude oil but an additive added to refined products at the refinery.\nThe thing about Nigeria’s crude oil is that the moment it came, it overrode the nation’s existing priority.\nThey pollute the water bodies while transporting stolen crude oil to the illegal refining sites where they ‘cook’ the oil and flare soots into the atmosphere in the process."
  },
  {
    "headline": "Makinde congratulates Adeleke, hails Osun voters The Nation Newspaper",
    "summarized_story": "Oyo Governor Seyi Makinde has congratulated Senator Ademola Adeleke, on his victory at the just-concluded Osun State governorship election.\nAccording to him, Adeleke’s victory was similar to what happened in Oyo State during the 2019 governorship election when the people exercised their franchise in support of an opposition party.\nMakinde said: “On behalf of the government and the good people of Oyo State, I congratulate the Osun State Governor-Elect, Senator Ademola Adeleke and the people of Osun State on this victory.\n“It is great to have a second PDP flag flying in the Southwest and this victory teaches all politicians an important lesson- that truly, power resides with the people.\n“The power of the people will continue to triumph, the earlier politicians realise this fact, the better for our democracy.”"
  },
  {
    "headline": "Adeleke’s win a good omen for PDP",
    "summarized_story": "Senator Dino Melaye has congratulated the candidate of the Peoples Democratic Party (PDP) Senator Ademola Adeleke on his victory at the just-concluded Osun governorship election.\nMelaye, in a statement in Abuja, said Adeleke’s victory was well-deserved.\nMelaye, who was a two-time member of the National Assembly, also rejoiced with the PDP presidential candidate in the 2023 elections, Atiku Abubakar, for the Osun victory, saying it was good omen for the party.\nAccording to the former Kogi West lawmaker: “This is a good omen for our party and signs of things to come in 2023.\nHe noted that the people of Osun State are the real winners as they have been able to freely choose their leader for the next four years."
  },
  {
    "headline": "Abia Guber: APP candidate Mascot Kalu picks university don as running mate",
    "summarized_story": "From Okey Sampson, UmuahiaAbia State governorship candidate of the Action People’s Party (APP) Mascot Uzor Kalu has picked a university don, Prof Osondu Akoma, as his running mate ahead of the 2023 general elections.\nSocio-political group, Ngwa United Alliance (NUA) hailed Prof Akoma’s emergence as running mate to Kalu.\nA statement from the party said the emergence of Prof Akoma who is from the Ukwa bloc of Abia South Senatorial District, as the running mate to Mascot Kalu shows a winning combination for APP in the 2023 Governorship election.\nMeanwhile, a socio-political group, Ngwa United Alliance (NUA), has hailed the emergence of Prof Akoma as running mate to Mascot Kalu.\nHe expressed confidence that APP’s choice of Prof Akoma as running mate to Mascot Kalu for the 2023 governorship election will ensure victory for the party."
  },
  {
    "headline": "#OsunDecides: Okowa congratulates Adeleke on election victory",
    "summarized_story": "From Paul Osuyi, AsabaDelta State Governor and Vice Presidential Candidate of the People’s Democratic Party (PDP), Dr Ifeanyi Okowa, has congratulated Senator Ademola Adeleke on his victory in Saturday’s governorship election in Osun State.\nOkowa noted that the election of Adeleke had signposted the reality of PDP’s determination to rescue Nigeria, saying “the mission has just begun”.\n“Let me congratulate my brother, Senator Ademola Adeleke, on his victory in the July 16 governorship election in Osun.\n“The most significant aspect of this victory is the peaceful outcome of the election as Osun people conducted themselves responsibly by ensuring that the election was devoid of violence,” he said.\n“On behalf of the government and people of Delta, I congratulate you my dear brother and friend, Senator Ademola Adeleke, on your successful election as Governor-elect of Osun."
  },
  {
    "headline": "Osun elections: ICPC arrests suspected vote buyers",
    "summarized_story": "From Adanna Nnamani, AbujaThe Independent Corrupt Practices and Other Related Offences Commission (ICPC) says its operatives on election monitoring duties have arrested 3 persons suspected of vote buying in the Osun State gubernatorial election.\n“At Egbedore Local Government, Osun West Senatorial District, precisely in Polling Unit 003, Ward 10, Osunbukola Junction, Kamorudeen Nafisat and Ojuade Musbau Olaniyi were arrested by another team for alleged vote buying.\nItems collected from the duo included one Android Phone and a notebook containing a list of names of voters.\nThe attack was at Polling Unit 1, Ward 7, opposite Polaris Bank, in front of Oba’s Palace, Esa-Oke, Ibokun Local Government Area.\nThe vote buyer was caught with a list containing names of 100 persons expecting to be paid N5000 each."
  },
  {
    "headline": "BREAKING: INEC declares Adeleke winner of Osun Guber election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared Senator Ademola Adeleke of the People’s Democratic Party (PDP) as winner of the Osun governorship election held on Saturday July 16, 2022.\nSenator Adeleke polled a total of 403, 371 votes and won 17 of the 30 local government areas in the state, while APC candidate and the incumbent governor Gboyega Oyetola a total of 375,927 and won 13 of the 30 local government area in the state."
  },
  {
    "headline": "Osun Decides; PDP wins 17 LGAs, APC tops in 13",
    "summarized_story": "From Oluseye Ojo, and Lateef Dada, OsogboSenator Ademola Adeleke, the Peoples Democratic Party (PDP) candidate for the Saturday July 16, 2022 governorship poll in Osun State has won in 17 of the 30 local government areas of the state.\nAlso, the state governor, Alhaji Gboyega Oyetola, the candidate of the All Progressives Congress (APC) won in 13 local government areas.\nAny moment from now the Vice Chancellor, University of Lagos, Prof. Oluwatoyin Ogundipe, who is the Returning Officer for the election will officially announce the winner of the election.\nBut from the declared results, the PDP has secured highest number of votes, and may be returned winner of the election."
  },
  {
    "headline": "Live Updates: Osun Governorship Election 2022 – THISDAYLIVE",
    "summarized_story": "7:20 AMBreaking: PDP’s Adeleke Wins Osun Guber ElectionPeoples Democratic Party Governorship candidate, Senator Ademola Adeleke, has won the Osun Governorship Election.\nMiss Asogwa Ngozika, the Presiding Officer of the polling unit, said they arrived at the polling unit at 6:30 am.\nBut Olatunji said there was a mixed up in the materials brought to the polling unit as a sticker of another polling unit close to the primary school was pasted on the materials.\n“Your colleagues did it successfully in Ekiti and l believe you will also do us proud here in Osun State.\nFor most of yesterday, tension remained very high across Osun State, with voters bitterly divided among the two leading candidates."
  },
  {
    "headline": "Osun People Have Spoken, Says Ayu – THISDAYLIVE",
    "summarized_story": "The National Chairman, Peoples Democratic Party (PDP), Sen. Iyorcha Ayu has congratulated the party’s candidate in Osun governorship election, Sen. Ademola Adeleke on his victory, saying the people of Osun has spoken.\nAyu said this in a statement on Sunday in Abuja, saying that the victory was attained in spite of numerous attempts by the State Government to frustrate the party.\nYou have done well.”He said that Osun election was a referendum and a prove that Nigerians wanted PDP back.\nOsun people have spoken.\nAyu lauded the PDP National Campaign Council for the Osun governorship election, headed by Gov."
  },
  {
    "headline": "Makinde Congratulates Adeleke, Osun Voters – THISDAYLIVE",
    "summarized_story": "Governor of Oyo State, ‘Seyi Makinde, on Sunday, congratulated Senator Nurudeen Ademola Adeleke, on his victory at the just-concluded Osun State governorship election, saying that the power of the people has again triumphed.\nAccording to him, Adeleke’s victory was similar to what happened in Oyo State during the 2019 governorship election, when the people exercised their franchise in support of an opposition party.\nMakinde, who hailed the teeming voters across the 30 local governments of Osun State for standing by the Peoples Democratic Party (PDP) and staying resolute to ensure that their votes counted, said: “it’s great to have a second PDP flag flying in the South-West.”A statement by the Chief Press Secretary to the governor, Mr. Taiwo Adisa, indicated that Governor Makinde equally lauded Senator Adeleke, PDP members and Osun State voters for remaining strong and unwavering throughout the electioneering period.\nHe said: “On behalf of the government and the good people of Oyo State, I congratulate the Osun State Governor-Elect, Senator Ademola Adeleke and the people of Osun State on this victory.\n“The power of the people will continue to triumph, the earlier politicians realise this fact, the better for our democracy.”"
  },
  {
    "headline": "Light Has Come to Osun, Says Atiku in Congratulatory Message to Adeleke – THISDAYLIVE",
    "summarized_story": "Peoples Democratic Party presidential candidate, Alhaji Atiku Abubakar, has congratulated Senator Ademola Adeleke on his victory in the Osun governorship electìon.\nAtiku also congratulated the people of the state for proving that power indeed belongs to the people.\nCongratulations, Sen. Ademola Adeleke, on a well-fought victory.\nMost importantly, congratulations to the great people of Osun State for proving that power indeed belongs to the people,” Atiku wrote.\nHe polled 403,371 votes to defeat the incumbent governor, Adegboyega Oyetola of the All Progressives Congress, who polled 375,927."
  },
  {
    "headline": "Breaking: PDP’s Adeleke Wins Osun Guber Election – THISDAYLIVE",
    "summarized_story": "Peoples Democratic Party Governorship candidate, Senator Ademola Adeleke, has won the Osun Governorship Election.\nHe polled 403,371 votes.\nAdeleke won in 17 of the 30 local government areas in the election conducted on Saturday.\nHis closest rival, Governor Adegboyega Oyetola of the Peoples Democratic Party, polled 375,927 votes.\nOyetola won in 13 local government areas..Adeleke was declared winner and returned elected by the State Returning Officer, , at 7.18am SundayDetails later…"
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "Buhari congratulates Adeleke, says victory shows respect for people's will",
    "summarized_story": "President Muhammmadu Buhari says the outcome of the Osun governorship election shows respect for the will of the electorate.\nBuhari said this on Sunday in a congratulatory message to Ademola Adeleke, the governor-elect, via his Twitter handle.\nI congratulate Senator Ademola Adeleke, candidate of the People’s Democratic Party (PDP), on his victory in the Osun gubernatorial election.\nAdvertisement — Muhammadu Buhari (@MBuhari) July 17, 2022“I congratulate senator Ademola Adeleke, candidate of the People’s Democratic Party (PDP), on his victory in the Osun gubernatorial election.\nAdvertisementThe PDP candidate won 17 LGAs while the incumbent governor secured victory in 13 LGAs."
  },
  {
    "headline": "Buhari congratulates Adeleke, says victory shows respect for people's will",
    "summarized_story": "President Muhammmadu Buhari says the outcome of the Osun governorship election shows respect for the will of the electorate.\nBuhari said this on Sunday in a congratulatory message to Ademola Adeleke, the governor-elect, via his Twitter handle.\nI congratulate Senator Ademola Adeleke, candidate of the People’s Democratic Party (PDP), on his victory in the Osun gubernatorial election.\nAdvertisement — Muhammadu Buhari (@MBuhari) July 17, 2022“I congratulate senator Ademola Adeleke, candidate of the People’s Democratic Party (PDP), on his victory in the Osun gubernatorial election.\nAdvertisementThe PDP candidate won 17 LGAs while the incumbent governor secured victory in 13 LGAs."
  },
  {
    "headline": "PDP supporter celebrating Adeleke's victory in Osun accidentally shoots self",
    "summarized_story": "A man identified as Sunday Akingbala, who is said to be a Peoples Democratic Party (PDP) supporter and member of Amotekun, has reportedly shot himself while celebrating the victory of Ademola Adeleke, governorship candidate of the party.\nThe shooting is said to have occured in Ile Ife on Sunday.\nThe man was taken to the Seventh Day Adventist Church hospital in Lagere, Ile Ife, but later referred to Obafemi Awolowo Teaching Hospital.\nAdeleke, Osun state governor-elect, polled 403,371 votes to defeat Gboyega Oyetola, governor and candidate of the All Progressives Congress (APC), who secured 375,027 votes.\nAdvertisementThe PDP candidates won 17 out of 30 LGAs in the state while the governor won 13."
  },
  {
    "headline": "PDP supporter celebrating Adeleke's victory in Osun accidentally shoots self",
    "summarized_story": "A man identified as Sunday Akingbala, who is said to be a Peoples Democratic Party (PDP) supporter and member of Amotekun, has reportedly shot himself while celebrating the victory of Ademola Adeleke, governorship candidate of the party.\nThe shooting is said to have occured in Ile Ife on Sunday.\nThe man was taken to the Seventh Day Adventist Church hospital in Lagere, Ile Ife, but later referred to Obafemi Awolowo Teaching Hospital.\nAdeleke, Osun state governor-elect, polled 403,371 votes to defeat Gboyega Oyetola, governor and candidate of the All Progressives Congress (APC), who secured 375,027 votes.\nAdvertisementThe PDP candidates won 17 out of 30 LGAs in the state while the governor won 13."
  },
  {
    "headline": "Aso Villa is PDP’s next destination, says Ayu on Adeleke’s election victory in Osun",
    "summarized_story": "Iyorchia Ayu, national chairman of the Peoples Democratic Party (PDP), has hailed the victory of Ademola Adeleke in the governorship election of Osun state.\nAdvertisementThe PDP candidate won 17 LGAs while the incumbent governor secured victory in 13 LGAs.\nIn a statement celebrating Adeleke’s victory, Ayu said with the PDP takeover of Osun, the presidential villa is next for the party.\nI congratulate the good people and residents of Osun state.\n“I thank the PDP National Campaign Council for the Osun State Governorship Election, headed by HE Gov."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Flutterwave, Eversend and other fintech African startups shut down virtual card service",
    "summarized_story": "Earlier on Friday, many African fintech startups offering virtual dollar card services sent emails to their customers stating that their virtual card service will be unavailable indefinitely starting Saturday, July 16, 2022.\nThis announcement by Flutterwave is bound to affect many other startups who use the company’s white-labeled virtual card service to issue virtual cards to their customers.\nOther fintech startups including crypto exchange Busha, Rwanda-headquartered Payday, and Ugandan Eversend also issued similar notices.\nIt’s not clear which “card partner” Flutterwave and the other fintech startups are referring to, but these platforms have issued virtual cards powered by MasterCard and Visa—two leading global card issuers.\n“It affects us in a big way because all our Facebook ads are connected to our Barter virtual card,” Douglas Kenydson CEO Selar said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Meet Burna Boy's monitor engineer, Precious Tawo as he takes us on his journey into sound engineering",
    "summarized_story": "Without further ado, let’s meet Precious Tawo, freelance sound engineer and production manager.\nOn the 20th day [of the Calabar festival], we were doing a sound check in the stadium for the band, and my boss was not on the stage.\nPrecious Tawo’s journey into sound engineeringPrecious TawoI didn’t choose the path; the path chose me.\nAnd in 2013, the Calabar Festival was very popular.\nWe tried everything and eventually had to plug my monitors into my boss’ equipment."
  },
  {
    "headline": "2023: Shaibu charges Nigerians to vote for credible, competent leaders – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Acting Governor, Rt.\nComrade Philip Shaibu, has urged Nigerians to ensure that only credible and competent leaders emerge in the forthcoming 2023 general elections.\nShaibu gave the charge during the 17th convocation ceremony of Benson Idahosa University (BIU), in Benin City, Edo State.\nThe acting governor, who was a special guest of honour at the convocation ceremony, urged citizens to pray for the country, noting that only competent leaders can help the nation overcome its many socio-economic challenges.\n“Governor Godwin Obaseki is doing his best to turn Edo State into the economic hub of the nation."
  },
  {
    "headline": "No report of mass violence, vote-buying in Osun guber poll -Police – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBy Kelecho Ogunleye The police say they have yet to receive reports of violence or vote-buying in Saturday’s Osun governorship election.\nMr Johnson Kokumo, the Deputy Inspector-General of Police (DIG) Force Criminal Investigation Department (FCID) said this after a visit to ward 5, unit 5 Salvation Army alekuwodo polling unit in Osogbo.\nThe News Agency of Nigeria (NAN) reports that the police deployed 21,000 personnel to ensure hitch-free conduct of the election.\nHe said that the NSCDC personnel were positioned to observe polling units and make arrests of suspected vote-buyers or persons with intentions to disrupt the election.\nHe expressed satisfaction with the large voter turnout at polling units."
  },
  {
    "headline": "Anti-corruption: Centre unveils whistleblowing platform for citizens’ action – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAnti-corruption stakeholders at the Launch of the Corruption Anonymous (CORA) whistleblowing platform in AbujaBy Angela AtaboAfrican Centre for Media and Information Literacy (AFRICMIL),with support from other partners on Thursday in Abuja, unveiled a whistleblowing platform to increase citizens’ participation in anti-corruption fight.\nThe coordinator observed that the whistleblowing policy, initially hailed as one of the most effective of all the anti-corruption strategies by the government, was virtually fizzling out.\n“It is against this backdrop that the CORA whistleblowing platform, the civil-society-driven public reporting option that we are launching today, serves as an invaluable tool.\nOnumah said that the CORA platform would complement government’s whistleblowing platform managed by the Presidential Initiative on Continuous Audit (PICA).\n“Legally and morally, we all have roles to play, and this is what the whistleblowing policy seeks to ensure,’’ he said."
  },
  {
    "headline": "Institutionalising apprenticeship panacea for tackling poverty, unemployment— ITF boss – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Director-General of the Industrial Training Fund (ITF), Mr Joseph Ari says institutionalising apprenticeship and traineeship will address the high rate of poverty and unemployment.\nAri said this on Thursday in Abuja at the Second National Skills programme with the theme, “Institutionalising Apprecenticiship and Traineeship for National Development”.\n“England in 2009 made concerted efforts to increase the number of apprenticeships to combat youth unemployment by creating National Apprenticeship Service.\nHe, however, expressed concern that the potential of apprenticeship in tackling unemployment and poverty had not been fully actualised in Nigeria.\n“In addition, it harmonised 444 existing In-company apprenticeship schemes of companies in line with the ITF National Apprenticeship scheme."
  },
  {
    "headline": "Light has come to Osun – Atiku revels in Adeleke’s victory",
    "summarized_story": "Alhaji Atiku Abubakar, former vice president and presidential candidate of the Peoples Democratic Party (PDP), has hailed Senator Ademola Adeleke on his victory in the Osun state governorship election, noting that light has come to the state.\nAdeleke, candidate of the PDP, was declared the winner of the Osun governorship election on Sunday morning.\nThe PDP candidate won 17 LGAs while the incumbent governor secured victory in 13 LGAs.\nReacting to the development in a tweet on Sunday, Atiku said the contest was well fought by Adeleke and that “light” has now come to the state.\n“The good people of Osun State have spoken loud & clear that politics is local,” he said."
  },
  {
    "headline": "David Nweze Umahi: The vituperation of a political opportunist",
    "summarized_story": "By Ebenezer OjiDavid Nweze Umahi, governor of Ebonyi State, a maximum ruler who brooks no opposition, loves to listen to himself talk even if he when he has nothing reasonable to say.\nUmahi is yet to recover from his political humiliation at the APC presidential convention.\nHe blamed politicians from other zones in Ebonyi state who dared to contest the 2023 Governorship elections.\nIn 1999, it was Dr. Sam Egwu vs Dr. Ogbonnaya Onu.\nFinally, in 2015, it was Engr David Umahi vs. Arch."
  },
  {
    "headline": "BREAKING: PDP’s Ademola Adeleke wins Osun governorship election",
    "summarized_story": "OBINNA EZUGWUSenator Ademola Adeleke, candidate of the People’s Democratic Party Party (PDP) has won Saturday’s governorship election in Osun State, beating his closet rival, the incumbent governor, Gboyega Oyetola to second place.\nAccording to him, Adeleke had satisfied the law and was, therefore, declared the winner.\n“That I, Prof. Oluwatoyin Ogundipe, hereby certified that I am the returning officer of the Osun 2022 Governorship Election held on July 16.\n“That Ademola Adeleke, the candidate of PDP, having satisfied the requirements of the law, is hereby declared the winner and returned,” Ogundipe declared.\nIn all, PDP won in 17 local government:1."
  },
  {
    "headline": "#OsunDecides: Adeleke takes early lead over Oyetola as counting continues",
    "summarized_story": "Ademola Adeleke, the governorship candidate of the Peoples Democratic Party (PDP), is taking an early lead in the ongoing Osun gubernatorial election.\nAccording to results posted on the portal of the Independent National Electoral Commission (INEC), Adeleke is leading the incumbent governor, Gboyega Oyetola of the All Progressives Congress (APC), with over 10,000 votes.\nSo far, Adeleke has polled 67,892 votes while Oyetola has 56,915 votes.\nCounting is still ongoing.\nThere are a total of 1,955,657 registered voters in the election which held across 3,763 polling units."
  },
  {
    "headline": "Osinbajo undergoes surgery over recurring leg pain",
    "summarized_story": "Professor Yemi Osinbajo, Nigeria’s vice president of, has undergone a surgical procedure on his leg.\nThe procedure is due to a recurrent pain in the leg, which is believed to have been sustained from injury while playing squash.\nOsinbajo’s spokesman, Laolu Akande, confirmed this in a statement on Saturday.\n“VP Osinbajo is in the hospital today for a surgical procedure on account of a recurrent pain in the leg possibly sustained from an injury while playing squash,” the statement said.\n“His doctors would give an update of the treatment later today."
  },
  {
    "headline": "Why Venezuela And Nigeria Should Establish Direct Flights – Envoy",
    "summarized_story": "What is the current level of bilateral relations between Nigeria and Venezuela?\nIn the human rights sector, the Ombudsman of Venezuela has interests to start relations with the National Human Right commission of Nigeria.\nYou talked about direct flights, can you throw more light on this?\nIf that is the case, why don’t we have direct flights and BASA agreement?\nWe have COMBIASA as our airlines and we are ready to negotiate with Nigeria to open direct flights from Caracas to Nigeria."
  },
  {
    "headline": "Why Venezuela And Nigeria Should Establish Direct Flights – Envoy",
    "summarized_story": "What is the current level of bilateral relations between Nigeria and Venezuela?\nIn the human rights sector, the Ombudsman of Venezuela has interests to start relations with the National Human Right commission of Nigeria.\nYou talked about direct flights, can you throw more light on this?\nIf that is the case, why don’t we have direct flights and BASA agreement?\nWe have COMBIASA as our airlines and we are ready to negotiate with Nigeria to open direct flights from Caracas to Nigeria."
  },
  {
    "headline": "Infracredit, AFD To Support Sub-National Projects In Nigeria",
    "summarized_story": "InfraCredit, a specialised infrastructure credit guarantee institution in Nigeria and the Agence Française de Développement (AFD) have signed a Technical Assistance Financing Agreement to support sub- national public -private projects in Nigeria.\nTechnical and legal assistance as well as feasibility studies for projects selected in agreement between InfraCredit and AFD will enable, among others, to support the development of infrastructure projects and job creation,” the statement said.\nInfraCredit’s Annuity PPP Guarantee was developed to facilitate the sustainable financing of new infrastructure projects alongside subnational governments in Nigeria.\nHe however, said that an increasing pipeline of sub-national infrastructure projects requires project preparatory support to deliver well-structured bankable projects that can access the debt capital markets.\nSpeaking on the Agreement with InfraCredit, Xavier Muron, Country Director of AFD in Nigeria, noted that “This €600,000 grant to Infracredit will finance studies and technical assistance for future infrastructure projects via public-private partnerships throughout Nigeria."
  },
  {
    "headline": "Infracredit, AFD To Support Sub-National Projects In Nigeria",
    "summarized_story": "InfraCredit, a specialised infrastructure credit guarantee institution in Nigeria and the Agence Française de Développement (AFD) have signed a Technical Assistance Financing Agreement to support sub- national public -private projects in Nigeria.\nTechnical and legal assistance as well as feasibility studies for projects selected in agreement between InfraCredit and AFD will enable, among others, to support the development of infrastructure projects and job creation,” the statement said.\nInfraCredit’s Annuity PPP Guarantee was developed to facilitate the sustainable financing of new infrastructure projects alongside subnational governments in Nigeria.\nHe however, said that an increasing pipeline of sub-national infrastructure projects requires project preparatory support to deliver well-structured bankable projects that can access the debt capital markets.\nSpeaking on the Agreement with InfraCredit, Xavier Muron, Country Director of AFD in Nigeria, noted that “This €600,000 grant to Infracredit will finance studies and technical assistance for future infrastructure projects via public-private partnerships throughout Nigeria."
  },
  {
    "headline": "China, Nigeria Sign Pact To Foster Peace, Development",
    "summarized_story": "The Embassy of the People’s Republic of China, on Tuesday, signed a Memorandum of Understanding (MOU) with the Institute for Peace and Conflict resolution (IPCR) to prevent insecurity, foster peace and development in Nigeria.\nChinese Ambassador to Nigeria, Mr. Cui Jianchun, in his remark, said that his country understands the value of peace and would share its experiences with Nigeria in the joint publication to ensure peace and sustainable development in Nigeria.\n“Here the Nigeria Institute for Peace and Conflict Resolution is a very important institute, not only for Nigeria.\n“Nigeria, we have serious problems, we have problems of insecurity, China also we have insecurity but mostly from external forces.\n“In other words, what we are doing, we are a security related agency, and we try to prevent insecurity before it becomes an issue."
  },
  {
    "headline": "Updated: Aregbesola deletes Facebook post gloating over Oyetola's loss",
    "summarized_story": "Minister of Interior Rauf Aregbesola has deleted the controversial Facebook post in which he appeared to gloat over the defeat of APC Governor Gboyega Oyetola by his PDP challenger, Ademola Adeleke.\nAregbesola made the post at about 8a.m on Sunday moments after the Independent National Electoral Commission declared Adeleke as the governor-elect of Osun State.\nBut after some backlash, Aregbesola deleted the post.\nCongratulations PDP,Congratulations, Senator AdelekeOjoye Samson Olugbenga: A house divided against itself can never stand.you have played your role in pulling down your own house, that all you can achieve.\nAfeez Omololu: The same PDP you supported will surely disgrace you and your follower."
  },
  {
    "headline": "Buhari congratulates Adeleke, says people's will must be respected",
    "summarized_story": "President Muhammadu Buhari has congratulated Sen. Ademola Adeleke, candidate of the Peoples Democratic Party (PDP), following victory of the party in Saturday’s governorship election in Osun.\nThe President’s congratulatory message was conveyed in a statement by his spokesman, Mr Femi Adesina, on Sunday in Abuja.\nThe president expressed conviction that with the election over, the people of Osun had expressed their will through the ballot, and the will of the people must always matters and must be respected in a democracy.\nOgundipe, who is the Vice-Chancellor of the University of Lagos, said that the Action Democratic Party (ADP) scored 10,104 to come third.\nHe also said that the Accord Party candidate scored 4,515 and came fourth."
  },
  {
    "headline": "BREAKING: Ademola Adeleke Wins Osun Governorship Election",
    "summarized_story": "The Peoples Democratic Party (PDP) candidate Ademola Adeleke has been announced the winner of the Osun governorship race.\nOn Sunday morning, Toyin Ogundipe, the state’s returning officer, declared the election’s outcome.\nIn order to defeat his closest rival, Gboyega Oyetola of the All Progressives Congress (APC), who received 375,027 votes, Adeleke received 403, 371 votes.\nWhile the incumbent governor prevailed in 13 LGAs, the PDP candidate won 17 LGAs.\nWith 10,104 votes, Kehinde Atanda of the Action Democratic Party (ADP) finished far behind Yusuf Lasun of the Labour Party (LP), who received 2729 votes."
  },
  {
    "headline": "JUST IN: Adeleke Clears Osogbo, Takes Early Lead In #OsunDecides2022",
    "summarized_story": "Out of the 54,997 votes cast in the Osogbo LGA, Mr. Adeleke received 30,401 votes, while Mr. Oyetola received 22,952 votes for the governing All Progressives Congress.\nIn Osogbo LGA, 55,942 votes were cast in total during the election on Saturday.\nMr Oyetola also cleared his polling unit in Iragbiji, Boripe LGA, shellacking Mr Adeleke there.\nWhile in PU 003, opposite Olomu Mosque in Osogbo, PDP agents were seen handing out between N2,000 and N5,000 to induce voters.\nEarly results from Ede, Osogbo and other parts of the state show Mr Adeleke leading, although most results are still being expected."
  },
  {
    "headline": "#OsunPoll: Tinubu Departs Osun State As INEC Begins Uploading Election Results",
    "summarized_story": "The presidential candidate of the ruling All Progressives Congress, Bola Tinubu, has left Osun State where a governorship election is holding.\nMeanwhile, the Independent National Electoral Commission, INEC, has commenced uploading of results for the Saturday governorship election into the commission’s results viewing portal.\nThe News Agency of Nigeria reports that the uploading of election results started shortly after the close of voting and sorting of votes in some polling units across the state.\nFor Olorunda LG, 74 out of 193 polling units results have been uploaded on the portal as well 72 out of 121 for Odo-Otin Local Government Area.\nFor Iwo LGA, 48 out of 170 polling units results have been uploaded, for Irepodun 52 out of 133, while 18 out of 62 polling units results for Ola-Oluwa LGA have also been uploaded."
  },
  {
    "headline": "JUST IN: Tinubu Leaves Osun, Meets APC Speakers In Abuja",
    "summarized_story": "According to information obtained by NEWS DIRECT, the APC National Leader met with the party’s House of Assembly Speakers on Saturday in Abuja.\nTinubu offered the speakers active positions in his campaigns leading up to the next election in 2023 during the conference.\nTinubu commended the Speakers for the earlier roles they played ahead of his emergence as the presidential candidate of the party.\nThe APC Speakers had visited Tinubu to congratulate him on his victory at the party’s recent special convention where he was elected candidate.\nWhile appreciating the Speakers, Tinubu, who noted the tasks ahead of 2023, assured them of roles to play in the campaign."
  },
  {
    "headline": "Happening now: Jubilation in Ede as Ademola Adeleke emerges Osun governor-elect (VIDEO)",
    "summarized_story": "There is wild jubilation in Ede, Osun State, moments after the Independent National Electoral Commission (INEC) declared Senator Ademola Adeleke, Sunday morning, as governor-elect after Saturday July 16, 2022 governorship election.\nAdeleke hails from the area.\nAdeleke of the Peoples Democratic Party (PDP) won 17 of the 30 Local Government Areas (LGAs) while incumbent Gboyega Oyetola of All Progressives Congress (APC) won in 13 LGAs.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "[Happening now] #OsunDecides2022: INEC confirmed election results from 30 LGAs in Osun… PDP 17, APC 13",
    "summarized_story": "The governorship candidate of the Peoples Democratic Party (PDP), Senator Ademola Adeleke, has won in 17 out of 30 Local Government Areas (LGAs) of Osun state.\nHe defeated incumbent governor Adegboyega Oyetola of the All Progressives Congress (APC) who won in 13 LGAs.\nResults as announced by INEC after Saturday’s July 16, 2022 governorship electionBoluwaduro LGAPC – 5,649PDP – 5,860Electoral Officer, Dr Kehinde BolarinwaILESA EASTAPC – 13,452PDP – 10,969Prof Adepoju TejumayeOSOGBO LGAPC – 22,952PDP – 30,401Prof Musa ObalolaILA LGAPC – 11,163PDP – 13,036Prod Aderonke AreATAKUMOSA WESTAPC – 6,601PDP – 7,750Dr. Adeola OloyedeIFELODUN LGAPC – 16,068PDP – 17,107Prof Oluyemi AkinloyeILESA WEST LGAPC – 10,777PDP – 13,769Dr Akeem KadirAYEDIRE LGAPC – 7,868PDP – 7,402Odo-Otin LGAPC – 13,482PDP – 14,003Awoyefa OlayinkaBORIPE LGAPC – 21,205PDP -7,595Dr. Mogbademu AdesanmiOBOKUN LGAPC 9,727PDP 13,575OROLU LGAPC 9,928PDP 10,282OLORUNDA LGAPC – 18,709PDP – 21,350Prof Akinsanya BamideleIFE NORTH LGAPC 9,964PDP 10,359IFEDAYO LGAPC 5,016PDP 4,730Prof Aderonke SamuelIFE CENTRALAPC 17,880PDP – 13,532Prof J.\nA. AdewaraIREPODUN LGAPC – 12,122PDP – 14,369Dr Omobolanle AdemiluaORIADE LGAPC – 14,189PDP – 15,947Prof Sunday AdebisiAYEDAADE.\nLGAPC – 14,527PDP – 13,380Dr Johnson AgunsoyeOLAOLUWA LGAPC – 9,123PDP – 7,205Prof Sunday OjoloIWO LGAPC – 17,421PDP – 16,914Prof Khalid AdekoyaEDE SOUTHAPC – 5,704PDP – 19,438Dr Olayinka AgunloyeISOKAN LGAPC – 10,833PDP – 10,777Dr Bamidele SamuelIREWOLE LGAPC – 18,198PDP – 14,216Pro Lukman AdamsEJIGBO LGAPC – 14,355PDP – 18,065EDE NORTHAPC – 9,603PDP – 23,931Prof Abayomi OkanlawonEGBEDORE LGAPC – 9,228PDP – 13,230Dr Babatunde AladeATAKUMOSA EASTAPC – 7,449PDP – 6,992Prof Oludiran AkinleyeIFE SOUTH LGAPC – 12,481PDP – 9,116Dr OluwafemiIFE EAST LGAPC – 19,353PDP – 18,071Pro AmudaShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "[Breaking] #OsunDecides2022: PDP’s Adeleke defeats incumbent governor Oyetola inside government house",
    "summarized_story": "Counting of votes has continued after Saturday’s governorship elections in Osun with results oozing out from polling units after voting officially endedAt a polling unit located around government in Osogbo, the candidate of Peoples Democratic Party (PDP) defeated the incumbent Governor of the State, Adegboyega Oyetola of the All Progressives Congress (APC)In the governorship election score sheet for Agowande/Oshogbo GRA/ Governor’s office polling unit in Olorunda Local Government prepared by Assistant Polling Officer (APO1), Nwachukwu Henrietta Chidinma, PDP scored 117 votes while APC got 106 votes.\nCollation of results polling units and wards levels are still ongoing as at the time of filling this report.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Rivers: Nirvana, Access Bank Donate Cartons of Food Items to Sickle Cell Disease Persons",
    "summarized_story": "A non governmental organisation, Nirvana Initiative and Hacey Health Initiative in partnership with Access Bank has lifted the lives of people living with sickle cell disease by donating cartons of food items to them and their relatives in Rivers State.\nNirvana Initiative through Sickle Cell Awareness and Health Foundation, held the sensitisation and food donation event at the University of Port Harcourt Teaching Hospital (UPTH) where many with sickle cell trait and their parents disclosed their challenges.\nA facilitator at the programme, Dabata Omubo-Pepple, Executive Director of Sickle Cell Awareness and Health Foundation, explained that the gesture by the NGO to reach out to people living with the disease was in commemoration the world sickle cell day, earlier celebrated in June.\nA way of reaching out with people living with sickle cell disease with a welfare package which has to do with food, reminding them that food is important in their day to day and also to support them”.\nMy parent realized that I am a sickler when I was about a year old and my mum was already pregnant with my little sister who also had sickle cell”."
  },
  {
    "headline": "X-raying reforms in SEC and uncanny zeal for investment space",
    "summarized_story": "Also, the Yuguda-led executive management team has been implementing capital market development goals set out in the Capital Market Master Plan (CMMP) (2015-2025) and successfully completed the review of CMMP to realign the initiatives/deliverables to prevailing market conditions and keep the document relevant in the dynamic capital market due to issues related to Fintech, sustainability and regional integration.\nThis is even as it processed six Schemes of Merger, seven Acquisitions, 21 Corporate Restructurings, and three Takeovers during the period.\nUnder his leadership, rules for the integrated West African Capital Market were developed and reviewed.\nOn human capital development, the Commission had in 2019 conducted an internal capacity assessment that outlined staffing deficits and needs.\nThe Commission has also secured counterpart funding of $450,000 from AfDB on its Nigeria Securities Market Surveillance System Project to support the deployment of a real-time market surveillance system for the Nigerian capital market."
  },
  {
    "headline": "TAJBank opens new branch to deepen financial inclusion",
    "summarized_story": "…as excited traders jostle to open accountBY Kehinde IbrahimTAJBank Ltd, a leading non-interest hank, has continued its service and financial inclusion drive with the opening of a new, technology-powered branch in Wuse 2, Abuja.\nThe opening of the new branch brings the lender’s growing branch network to 22 within its first two years of operation.\nJoda explained: “The opening of the new branch is to continue with our strategy of ensuring that we take the TAJBank brand to all the nooks and crannies of the Country with the aim of addressing the service needs of our teeming customers.\n“We understand that Customers want to do business and sometimes someone to give them that advisory service they yearn for which in turn will help to address their financial challenges”, he added.\nThe non-interest bank is also set to launch Nigeria’s first private sector Sukuk offering under a N100 billion programme."
  },
  {
    "headline": "NES28 to rally stakeholders for sustainable economic growth",
    "summarized_story": "While welcoming participants to the event, the chairman of the NESG, Mr Asue Ighodalo, said that the annual Nigerian Economic Summits had been sustained as a public-private dialogue platform by the NESG (representing the private sector) and the Federal Ministry of Finance, Budget and National Planning (representing the Federal Government of Nigeria).\nHe noted that the Summit is a foremost platform through which the federal and state governments engage with corporate leaders and discuss Nigeria’s national and sub-national economic realities to co-create reform strategies that are critical for the advancement and reform of the Nigerian economy.\nMr Ighodalo stated that the vision of a secure, developed, prosperous and macro-economically stable country where the rule of law prevails and no one is left oppressed appears dimmed with today’s considerable headwinds, but the current electoral cycle offers a unique opportunity to reflect and reset.\nHe noted that the challenge of non-inclusive economic growth reflects low productivity across employment-elastic sectors, which continues to weaken their capacity to create more job opportunities and decent employment.\n“Government has a pivotal role in jump-starting and addressing with utmost urgency six critical challenges including non-inclusive economic growth, macroeconomic instability, infrastructure deficit, human capital deficit and skills gap, national insecurity and weak economic competitiveness,” he stated."
  },
  {
    "headline": "Danger as Naira hits N620/$ at parallel market",
    "summarized_story": "Naira yesterday fell to N620 per dollar at the parallel market amid the lingering scarcity of the greenback.\nCurrency traders known as Bureaux De Change operators (BDCs) said there was increased demand for the dollar by importers at the street market.\nThe traders put the buying price of the dollar at N614 and the selling price at N620, leaving a profit margin of N6.\nAccording to the Central Bank of Nigeria (CBN), the parallel market is not a true reflection of the country’s exchange rate.\nOn Tuesday, the euro fell to parity against the dollar for the first time in almost 20 years."
  },
  {
    "headline": "Adeleke Defeats Incumbent Oyetola To Win Osun Governorship Election",
    "summarized_story": "On Saturday, he achieved a hard-fought victory over the state’s incumbent Governor, Gboyega Oyetola, of the All Progressives Congress (APC) in the state’s governorship election.\n﻿Saturday’s election featured 15 contestants with the rematch of Oyetola and Adeleke drawing the most attention.\nFollowing the initial poll held that year, Oyetola trailed Adeleke who had led by 353 votes going into the supplementary election which held in seven polling units.\nAccording to the final votes announced by the electoral umpire that year, Oyetola polled 255,505 votes while Adeleke scored 255,023 votes – a difference of 482 votes.\nCompared to his loss in the last election, Adeleke bounced back to defeat incumbent Governor Oyetola with a vote margin of 28,344."
  },
  {
    "headline": "Buhari Congratulates Adeleke, Reassures Nigerians Of Credible 2023 Elections",
    "summarized_story": "President Muhammadu Buhari on Sunday congratulated the governor-elect of Osun State, Senator Ademola Adeleke, following the victory of the candidate of the Peoples Democratic Party (PDP) in the just-concluded election.\nAdeleke had stunned the incumbent governor, Gboyega Oyetola, to win the election, reversing the outcome of a matchup between both men in 2018.\nHe secured 403,371 votes, 28,344 more than Oyetola of the All Progressives Congress (APC) who polled 375,027 votes, to emerge victorious.\nFollowing the initial poll held that year, Oyetola trailed Adeleke who had led by 353 votes going into the supplementary election which held in seven polling units.\nAccording to the final votes announced by the electoral umpire that year, Oyetola polled 255,505 votes while Adeleke scored 255,023 votes – a difference of 482 votes."
  },
  {
    "headline": "Atiku, PDP Governors Congratulate Adeleke On Osun Election Victory",
    "summarized_story": "The candidate of the Peoples Democratic Party (PDP), Ademola Adeleke, was on Sunday declared the winner of the Osun State governorship election to cheers from allies and supporters.\nIn a tweet to celebrate his victory, the governor-elect said, “I have brought light to Osun State.”I have brought light to Osun State.\nAmong them was the PDP presidential candidate and former vice president, Atiku Abubakar, who said Adeleke’s triumph was a well-fought victory.\nRead the tweets below:Well-Fought VictoryMost importantly, congratulations to the great people of Osun State for proving that power indeed belongs to the people.\n-AA #OsunDecides #ImoleOsun — Atiku Abubakar (@atiku) July 17, 2022Politics Is LocalThe good people of Osun State have spoken loud & clear that politics is local."
  },
  {
    "headline": "Yakubu Maikyau Elected New NBA President",
    "summarized_story": "A Senior Advocate of Nigeria (SAN), Yakubu Maikyau, has emerged as the 31st President of the Nigerian Bar Association (NBA).\nMaikyau was named the new NBA president following an election of the legal body which was held virtually.\nFollowing the declaration, Maikyau is expected to take over the leadership of the legal body from the outgoing NBA President, Olumide Akpata.\nOther national officers elected are Mrs Linda Bala – 1st Vice President, Mr Clement Ugo – 2nd Vice President, and Mrs Amanda Demechi-Asagba – 3rd Vice President.\nAlso elected are Mr Adesina Adegbite – General Secretary, Mr Daniel Kip Ka-Ayli – Assistant General Secretary, Ms Chinyere Obasi – National Welfare Secretary, Mr Habeeb Lawal – National Publicity Secretary, Mr Olawole Ajiboye – Assistant Publicity Secretary, and Anze-Bishop Ladidi – Treasurer."
  },
  {
    "headline": "Osun Election: Adeleke’s Victory Marks APC’s Exit In 2023 – PDP Reps Caucus",
    "summarized_story": "The Minority Leader of the House of Representatives, Ndudi Elumelu, has congratulated the Osun State Governor-Elect, Ademola Adeleke, on his victory at the just-concluded poll.\nIn a statement on Sunday, the lawmaker described Adeleke’s triumph over his co-contenders in the election as well-deserved.\nREAD ALSO: Adeleke Defeats Incumbent Oyetola To Win Osun Governorship ElectionElumelu believes the victory further reinforces the main opposition party’s popularity not only in Osun but also in the south-west region and Nigeria as a whole.\nHe added that the outcome of the election was an indication of the impending defeat of the All Progressives Congress (APC) in the forthcoming presidential election.\nThe lawmaker, however, advised Adeleke to use his goodwill and vision to further unite the people and commence preparations for a transparent, accountable, and development-oriented government."
  },
  {
    "headline": "BREAKING: PDP candidate, Adeleke wins Osun governorship election -",
    "summarized_story": "The candidate of the People’s Democratic Party, Ademola Adeleke has been declared winner of the July 16th governorship election in Osun state.\nSenator Adeleke obtained the highest number of votes from 17 of the 30 local governments in Osun State.\nAdvertisementAdvertisementThe results were officially declared by the Independent National Electoral Commission in the Saturday governorship election in Osun State.\nHis closest rival, Governor Gboyega Oyetola of All Progressives Congress won in 13 Local Government Areas.\nAdvertisementAdvertisementAdvertisementThe results showed that Adeleke obtained 403, 371 votes from 30 LGAs while Oyetola got 375, 027 votes."
  },
  {
    "headline": "Live Updates: Collation Of Osun Governorship Election Results -",
    "summarized_story": "The Independent National Electoral Commission, INEC has commenced the collation of results from the 30 local government areas in Osun stateBelow is a list of the result as announced by each of the Collation officers.\nAdvertisementAdvertisementBoluwaduro Local Government AreaAPC – 5,649AdvertisementAdvertisementAdvertisementPDP – 5,860LP – 09AdvertisementAdvertisementSDP – 03=============AdvertisementAdvertisementAdvertisementIlesa EastAPC 13,456AdvertisementAdvertisementLP – 33PDP -10,969AdvertisementAdvertisementAdvertisementSDP -32==============AdvertisementAdvertisementOsogbo LGAAPC – 22,952AdvertisementAdvertisementAdvertisementLP – 79PDP – 30,401AdvertisementAdvertisementSDP – 62=========AdvertisementAdvertisementAdvertisementIla LGAAPC – 11,163AdvertisementAdvertisementLP – 06PDP – 13,036AdvertisementAdvertisementAdvertisementSDP – 09===========AdvertisementAdvertisementAtakumosa West LGAAPC – 6,601AdvertisementAdvertisementAdvertisementLP – 13PDP – 7,750AdvertisementAdvertisementSDP – 11=========AdvertisementAdvertisementAdvertisementIfelodun LGAAPC – 16,068AdvertisementAdvertisementLP – 18PDP – 17,107AdvertisementAdvertisementAdvertisementSDP – 12===============AdvertisementAdvertisementIlesa West LGAAPC – 10777AdvertisementAdvertisementAdvertisementLP – 40PDP – 13769AdvertisementAdvertisementSDP – 21Ayedire LGAAdvertisementAdvertisementAdvertisementAPC – 7,868LP – 07AdvertisementAdvertisementPDP – 7,402SDP – 04AdvertisementAdvertisementAdvertisement=================Odo-Otin LGAAdvertisementAdvertisementAPC – 13,482LP – 19AdvertisementAdvertisementAdvertisementPDP – 14,003SDP – 14AdvertisementAdvertisement===============Boripe LGAAdvertisementAdvertisementAdvertisementAPC – 21,205LP – 04AdvertisementAdvertisementPDP – 7,595SDP – 09AdvertisementAdvertisementAdvertisement=============Obokun LGAAdvertisementAdvertisementAPC- 9,727LP – 11AdvertisementAdvertisementAdvertisementPDP – 13,575SDP – 04AdvertisementAdvertisement==============Orolu LGAAdvertisementAdvertisementAdvertisementAPC – 9,928LP – 32AdvertisementAdvertisementPDP – 10,282SDP – 09AdvertisementAdvertisementAdvertisement=================Olorunda LGAAdvertisementAdvertisementAPC – 18,709LP – 17AdvertisementAdvertisementAdvertisementPDP – 21,350SDP – 46AdvertisementAdvertisement======================Ife North LGAAdvertisementAdvertisementAdvertisementAPC – 9,964LP – 34AdvertisementAdvertisementPDP – 10,359SDP – 09AdvertisementAdvertisementAdvertisement================Ifedayo LGAAdvertisementAdvertisementAPC – 5016LP – 01AdvertisementAdvertisementAdvertisementPDP – 4730SDP – 00AdvertisementAdvertisement==============Ife Central LGAAdvertisementAdvertisementAdvertisementAPC – 17880LP – 134AdvertisementAdvertisementPDP – 13,532SDP – 50AdvertisementAdvertisementAdvertisement=============Irepodu LGAAdvertisementAdvertisementAPC – 12,122LP – 1886AdvertisementAdvertisementAdvertisementPDP – 14,369SDP – 06AdvertisementAdvertisement===========Oriade LGAAdvertisementAdvertisementAdvertisementAPC – 14189LP – 24AdvertisementAdvertisementPDP – 15947SDP – 21AdvertisementAdvertisementAdvertisement===================Aiyedaade LGAAdvertisementAdvertisementAPC – 14,527LP – 20AdvertisementAdvertisementAdvertisementPDP – 13,380SDP – 10AdvertisementAdvertisement===============Ola Oluwa LGAAdvertisementAdvertisementAdvertisementAPC – 9123LP – 12AdvertisementAdvertisementPDP – 7205SDP – 14AdvertisementAdvertisementAdvertisement=================Iwo LGAAdvertisementAdvertisementAPC – 17,421LP – 32AdvertisementAdvertisementAdvertisementPDP – 16,914SDP – 20AdvertisementAdvertisement================Ede South LGAAdvertisementAdvertisementAdvertisementAPC – 5704LP – 16AdvertisementAdvertisementPDP – 19,438SDP – 11AdvertisementAdvertisementAdvertisement=========================Isokan LGAAdvertisementAdvertisementAPC – 10833LP – 17AdvertisementAdvertisementAdvertisementPDP – 10,777SDP – 08AdvertisementAdvertisement==============Irewole LGAAdvertisementAdvertisementAdvertisementAPC – 18,189LP – 17AdvertisementAdvertisementPDP – 14218SDP -11AdvertisementAdvertisementAdvertisement====================Ejigbo LGAAdvertisementAdvertisementAPC – 14355LP – 30AdvertisementAdvertisementAdvertisementPDP – 18065SDP – 17AdvertisementAdvertisement=============Ede North LGAAdvertisementAdvertisementAdvertisementAPC – 9603LP – 15AdvertisementAdvertisementPDP – 23,931SDP – 14AdvertisementAdvertisementAdvertisement============Egbedore LGAAdvertisementAdvertisementAPC – 9228LP – 41AdvertisementAdvertisementAdvertisementPDP – 13,230SDP – 22AdvertisementAdvertisement=======Atakumosa East LGAAdvertisementAdvertisementAdvertisementAPC – 7449LP – 23AdvertisementAdvertisementPDP – 6992SDP – 14AdvertisementAdvertisementAdvertisement===========Ife South LGAAdvertisementAdvertisementAPC – 12481LP – 28AdvertisementAdvertisementAdvertisementPDP – 9116SDP – 14AdvertisementAdvertisement===========Ife East LGAAdvertisementAdvertisementAdvertisementAPC – 19353LP – 65AdvertisementAdvertisementPDP – 18071SDP –"
  },
  {
    "headline": "Asiwaju Tinubu receives APC Speakers, EU Delegation in Abuja -",
    "summarized_story": "AdvertisementAdvertisementThis was during a congratulatory visit to Asiwaju Tinubu in Abuja.\nThe presidential candidate of the APC, Asiwaju Bola Tinubu also received a delegation from the European Union in Abuja.\nAdvertisementAdvertisementAdvertisementAmbassador of the European Union to Nigeria, EU’S MANAGING DIRECTOR OF EUROPEAN EXTERNAL ACTION SERVICE FOR AFRICA and other members of the delegation entered into a closed door meeting with Asiwaju Tinubu.\nAdvertisementAdvertisementThe APC Presidential Candidate also had the Speakers of APC States led by Speaker of Lagos Assembly Mudashiru Obasa waiting to congratulate him.\nThe State Assembly Speakers also requested that they are fully incorporated into the campaign process which Asiwaju Tinubu assured them of inclusion."
  },
  {
    "headline": "Group alleges plan to truncate Osun governorship poll",
    "summarized_story": "Members of the Justice, Development and Peace Makers’ Centre, Osogbo have alleged that some party agents of attempting to truncate the smooth conduct of the Governorship Election by asking people to display their ballot papers.\nGiving a post election report in Osogbo, the Osun State capital, General Coordinator of JDPMC Osogbo said in some of the polling units visited, political thugs tried to disrupt the exercise but they were repelled by security operatives.\nAdvertisementAdvertisementHe commended INEC for the early kick off of the elections but called for improvement in future elections.\nAdvertisementAdvertisementAdvertisement"
  },
  {
    "headline": "Nigeria: Military Allays Fears of Impending Terror Attacks on Abuja",
    "summarized_story": "Following the attack on Kuje Correctional Centre by terrorists, Nigeria’s Defence Headquarters (DHQ) on Saturday allayed fears of alleged impending attacks on Abuja.\nThe Federal Capital Territory (FCT) Command of the Nigerian Security and Civil Defence Corps (NSCDC) had issued a security alert on planned terror attacks on churches, schools and public infrastructure in Abuja.\n“The board was set up because it happened within our area of responsibility,” he said.\nHe gave the assurance that with the measures in place presently, such an attack would be difficult to come by.\nThere is the tendency that no such further attack will be possible with the arrangements in place,” he explained."
  },
  {
    "headline": "Hold Buhari Responsible for Violence in Nigeria, Ortom Tells US",
    "summarized_story": "Benue State Governor, Dr. Samuel Ortom, has called on the United States and the rest of the international community to hold the administration of President Muhammadu Buhari accountable for the spate of violence in Nigeria.\nHe made the call Saturday at the State Department, Washington DC while interacting with its officials, according to a statement by his aide, Mr. Peter Ichull.\nGovernor Ortom also said President Buhari and his government should be held responsible if anything happens to him.\nThe Benue State governor stated that the federal government’s punitive neglect has led to an increasing number of internally displaced persons (IDPs) in Benue State, which now stands at 1.5 million.\nHe promised to make a case for the Benue IDPs and investigate other issues raised by Ortom."
  },
  {
    "headline": "With New Status, NNPC GMD’s Nomenclature Now Group CEO",
    "summarized_story": "The Corporate Affairs Commission on September 21, 2021, completed the incorporation of the NNPC Limited following the provisions of the PIA 2021.\nPresident Muhammadu Buhari would unveil the new NNPC Limited on July 19.\nGroup Managing Director of the NNPC Ltd, Mr Mele Kyari, recently explained: “On 1st of July, we crossed over to the NNPC Limited both technically and financially on every aspect.\nMr President will unveil the NNPC Limited to all of us on the 19th of July, and I’m inviting you.\nWith the drop from the 302.4 million barrels in the first half of 2020 to 220.016 million barrels in the first half of 2022, Nigeria lost 82 million barrels of production between 2020 and 2022."
  },
  {
    "headline": "Buhari: I was Given List of 30 Presidential Aspirants to Choose Successor But I Declined",
    "summarized_story": "For the first time, President Muhammadu Buhari on Saturday opened up on the intrigues preceding the presidential primary of the All Progressives Congress (APC), revealing that he was given a list of 30 aspirants to choose a successor but he declined.\nPresident Buhari admitted that APC stalwarts gave him a list of 30 presidential aspirants to choose a preferred successor but he declined and allowed the delegates to elect the candidate of their choice, hence the emergence of the former Lagos State governor.\n“I was given a list of 30 aspirants to pick from; most of them were my ministers and governors.\nSo, they elected Tinubu as APC presidential candidate.\n“As leaders, we are doing our best and will keep doing our best to improve the situation."
  },
  {
    "headline": "Osun Election: Finally, PDP’s Adeleke Overcomes APC’s Oyetola to Emerge Governor-Elect",
    "summarized_story": "In Ife North, Adeleke won with 10, 359 votes while Oyetola scored 9, 964 votes.\nIn Ilesa West, Adeleke won with 13,769 votes, while Oyetola scored 10,777 votes.\nIn Oriade LGA, Adeleke scored 15,947 votes while Oyetola came second with 14,189 votes.\nAdeleke polled 5,860 votes in Boluwaduro, while Oyetola scored 5,649 votesTo win Olorunda LGA, Adeleke polled 21, 350 votes while Oyetola was able to secure 18,709 votes.\nIn Atakunmosa East, Oyetola scored 7,449 votes while Adeleke scored 6, 992."
  }
]