[
  {
    "headline": "Electoral Act faces delay at National Assembly, harmonisation yet to start",
    "summarized_story": "The lawmakers consequently amended Section 87 of the Electoral Act, 2010, which is Clause 84 of the electoral bill, by inserting the indirect primary option.\nAfter the passage on Wednesday, the President of the Senate, Ahmad Lawan, had said the National Assembly would transmit the revised bill to Buhari for assent this week.\n“We are hearing that that law (direct primary) was intended for an individual.\nIn his reaction on the floor of the House, however, a furious Gbajabiamila lamented that some lawmakers were disparaging the National Assembly on television.\nI don’t care what anybody says, the things that were uttered by members of this National Assembly was a show of disgrace!"
  },
  {
    "headline": "Buhari recalls Kaduna bombing experience, El-Rufai demands N7bn reimbursement",
    "summarized_story": "Amidst tight security, the President, Major General Muhammadu Buhari (retd), on Thursday, inaugurated some projects executed by Governor Nasir El-Rufai as part of activities lined up for his two-day official visit to Kaduna State.\nBuhari said though he is from Daura in Katsina State, there was the likelihood of him living in Kaduna State after 2023 when he must have left office.\nBuhari stated this at the palace of the Emir of Jema’a, Alhaji Muhammadu Isa Muhammadu, shortly after inaugurating four township roads constructed by the Kaduna State Government under its urban renewal programme in Kafanchan.\nEl-Rufai introduced the Kaduna State Urban Renewal Programme in June 2019, which commenced in Kaduna before those of Kafanchan and Zaria started.\nThe governor stated, “The goal of the urban renewal programme is to regenerate Kaduna, Kafanchan and Zaria, the three major cities in the state."
  },
  {
    "headline": "Road transport: Lagos gridlock surmountable -Commissioner",
    "summarized_story": "Commissioner for Information and Strategy in Lagos State, Mr. Gbenga Omotoso, stated this at the maiden Lagos Traffic Radio 96.1FM and the Lagos State Traffic Management Authority, LASTMA, engagement forum, with the theme: ‘Repositioning of Traffic Information Agencies for Better Performance’, held at LTV ground, Agindigbi, Ikeja, Lagos.\nLagos is not in the rank of London, which has become “the most congested” as the world recovers from COVID-19.\nHe added that: “The theme of the engagement, ‘Repositioning of Traffic Information Agencies for Better Performances’ cannot, therefore, be more appropriate.\nHe said, arguably, both agencies formed one of the strongest partnerships in the Lagos State Public Service as at today.\nComptroller, LASTMA; Mr. Awotola Victor Olatunde and Mr. Ogunwale Adetoye Gbolahan, emerged winners."
  },
  {
    "headline": "There should be plan to sustain rice revolution – Onamade",
    "summarized_story": "On how Postharvest Loss can be handledAccording to a study, the main hotspots for post-harvest losses are harvesting and parboiling followed by losses occurring during milling.\nRice bran contains 10−23% bran oil.\nBran oil, once stabilized and extracted, is a high-quality vegetable oil for cooking or eating.\nThe conventional use of rice bran is as an ingredient for animal feeds, in particular ruminants and poultry.\nCommon products from rice husk are solid fuel (i.e., loose form, briquettes, and pellets), carbonized rice husk produced after burning, and the remaining rice husk ash after combustion."
  },
  {
    "headline": "Omo-Agege hails Nigeria’s oldest monarch at 105",
    "summarized_story": "In a statement, yesterday by his Special Adviser, Media, Yomi Odunuga, the Deputy President of the Senate who congratulated Nigeria’s oldest monarch, the Ohworode of the Olomu Kingdom in Delta State, His Royal Majesty, Ovie Richard Ogbon Ogoni-Oghoro 1, described him as a quintessential traditional ruler.\nSenator Omo-Agege prayed that the legacy of peace, harmony, prosperity and steadfast progress that the Olomu Kingdom has witnessed since the monarch’s reign would continue perpetually.\nBorn on January 20, 1917, the traditional ruler was installed on March 12, 1988, as the 12th Ohworode of Olomu Kingdom.\n“Without a doubt, you are a shining example to our youth and an enigma to behold.\n“I pray that the almighty God will grant you good health and long life to continue serving your people.”Vanguard News Nigeria"
  },
  {
    "headline": "Safety violation: Lagos seals 6 lounges, nightclubs",
    "summarized_story": "By Olasunkanmi AkoniZero Accident Campaign, ZAC, Lagos State Safety Commission has sealed six lounges and nightclubs in Ikeja.\nMojola added that the action on some bars, lounges and nightclubs became necessary due to their contravention to the state government’s regulations despite several efforts to ensure complaints.\nALSO READ: Boko Haram/ISWAP fighters sack Piyemi village of Chibok in BornoAccording to the DG, failure of these establishments to obtain safety compliance certificates, register with the safety commission through its portal, lack of fire extinguishers, poor hygiene, and housekeeping, lack of safety signages and also inadequate parking space thereby causing traffic gridlock and other safety infractions, led to their closure.\nHe stressed that similar enforcement exercises would take place across the state as the commission frowned at such an unwholesome act as it would continue to discharge her duties, especially when implementing the laws of the commission towards a safer Lagos for all.\nOmojola, therefore, urged all business entities to regularise their safety management documentation towards achieving safer public places across the state."
  },
  {
    "headline": "Be fair in assessing my government, Buhari tells Nigerians",
    "summarized_story": "He called on Nigerians to be fair in their assessment of what his government has, so far, achieved.\nBuhari spoke in Kafanchan while on a 2-day visit to Kaduna state to commission projects.\nOn security, he appealed that citizens should’ve confidence on the ability of the security agents to bring the situation to normalcy.\nThe Emir of Jema’a called for the establishment of a permanent base for the Air Force and the Mobile Police in his domain.\nEmir Muhammadu also requested for the restoration of the rail transport from Kafanchan to other places across the nation."
  },
  {
    "headline": "Alleged killing of Igbos: Intersociety supporting IPOB, ESN – Nigerian Army",
    "summarized_story": "The Nigerian Army (NA) says it has been notified of individuals and groups “masquerading” as civil rights organizations.\nThe military unit said their activities have “endorsed the mindless criminalities of proscribed Indigenous People of Biafra (IPOB) and its armed affiliate, Eastern Security Network (ESN).”Director of Army Public Relations, Brigadier General Onyema Nwachukwu says Intersociety’s latest report is an attempt to incite the public against the Army.\nIn a statement on Thursday, he noted that the organization had tacitly encouraged anarchy in the South-East through “spurious allegations”.\n“The report also alleged that security operatives killed 1150 innocent and defenceless ndigbos within the said period.\nNwachukwu said the NA conducts its operations in line with global best practices and would not be involved in the extra-judicial killings and abuse of fundamental human rights."
  },
  {
    "headline": "Yobe: Gov Buni mourns as 12 perish in fatal road crash",
    "summarized_story": "Yobe State Governor and Chairman APC Caretaker Extraordinary Convention Planning Committee, Mai Mala Buni has mourned the death of 12 persons involved in a fatal road accident along Buni-Yadi road on Wednesday.\n“On behalf of the government and the people of Yobe State, l condole the families of the deceased persons and pray to Allah to admit them into Aljannatur Firdaus.\n“We also pray Allah to grant their families, friends and relations the fortitude to bear the sad loss of their loved ones,” Governor Buni prayed.\nMeanwhile, Governor Mai Mala Buni has directed the hospital authorities to provide free treatment to those who sustained injuries in the accident.\nBuni, however, called on all road users to avoid over speeding, observe traffic laws and keep good maintenance of their vehicles to minimize road accidents."
  },
  {
    "headline": "EKEDP chairman Momoh steps down, Otubu appointed",
    "summarized_story": "Eko Electricity Distribution Plc (EKEDP), on Thursday, announced the appointment of Oritsedere Otubu, a pioneer board member, as new chairman.\nOtubu replaces Charles Momoh, the pioneer chairman, who is stepping down after 8 years.\nA statement by General Manager, Corporate Communications, Godwin Idemudia, says the company believes Otubu will lead EKEDP into a new phase of developmental journey.\nThe appointee is Chairman, Elektron Petroleum Energy and Mining Limited, owners of Alausa Power Limited; Chairman, Venture Garden Group.\nOtubu assured that the EKEDP would continue to chart the course for growth and contribute to both the power sector and Nigeria’s development."
  },
  {
    "headline": "Gov Ortom grants amnesty to 34 convicts sentenced to death, 16 others",
    "summarized_story": "Benue State Governor, Samuel Ortom, has granted amnesty to 50 convicts serving various jail terms across the country.\nThe signing of the warrant of amnesty by the Governor followed recommendations from the State Advisory Council on Prerogative of Mercy and is in compliance with section 212 of the Federal Republic of Nigeria as Amended.\nThe convicts, according to the Justice Commissioner, had appealed their death sentences but the appeals failed, stressing that they now have a second chance in life.\nHe stated that 15 convicts, who were on death sentence, also had their sentences commuted to life imprisonment, while a convict had his 21-year jail term reduced to 15 years.\nSome of the convicts granted amnesty are Benue indigenes while others are indigenes of other states who committed the offences in Benue state and were convicted before being moved to Jos Correctional Center to serve their jail terms."
  },
  {
    "headline": "Akwa Ibom Assembly approves N4.7bn loan request for Gov Emmanuel",
    "summarized_story": "The Akwa Ibom State House of Assembly, on Thursday, approved Governor Udom Emmanuel’s request to access a loan of N4.7billion from Zenith Bank.\nThe governor had approached the assembly on Tuesday, requesting for the approval of the said amount, which he said would be given to Mimshac Digital Automobile Assembly Plant, Ikot Ukap, Itu Local Government Area of the state.\nThe House of Assembly in its deliberations, noted that the Car Assembling Plant, when fully functional, will boost the economy of the state and create more jobs for the teeming unemployed youths.\nThe lawmakers assured that the House will continue to support Governor Emmanuel in his quest to leave the state better than he met it.\nAniekan Bassey, directed the Clerk to communicate the resolution of the House to the Executive Governor."
  },
  {
    "headline": "PHOTOS: Lagos acquires two speed trains from U.S. for city service",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "INEC warns parties against conducting primaries outside Ekiti, Osun",
    "summarized_story": "The Independent National Electoral Commission (INEC) has warned that governorship primaries conducted outside Ekiti and Osun states will not be accepted.\nINEC had raised concern that the parties participating in the governorship elections slated for June 18 and July 16 were yet to submit the list of aspirants.\nWe also made it clear to them that in the case of Ekiti and Osun governorship elections, any primary conducted outside the two states will not be monitored by the commission and their outcomes will not be accepted.\nRead Also: INEC trains visually impaired voters ahead of FCT council poll- Advertisement -“Party primaries for the Ekiti State governorship election are scheduled for January 4 to 29.\nFor the Osun State governorship election, primaries will hold from February 16 to March 12."
  },
  {
    "headline": "Why would you take me off?!’ – Ronaldo fumes after Rangnick subs him",
    "summarized_story": "!’ – Ronaldo fumes after Rangnick subs himManchester United star player Cristiano Ronaldo was furious on Wednesday night after coach Ralf Rangnick substituted him on the second half.\nGoals from Anthony Elanga, Mason Greenwood and Marcus Rashford were enough to see United through at Brentford Community Stadium and ended a run of two Premier League games without a win.\nBut Ronaldo was not happy with Ralf Rangnick’s decision to take him off and made his feelings known on the bench.\nHis frustration continued as he sat alone on a step, before Rangnick came over to offer some apparent words of comfort to his vexed star.\nSince returning to United Ronaldo has made his presence felt mostly in the Champions League, where a remarkable run of six goals in five games led the Reds to first place in their group."
  },
  {
    "headline": "Iheanacho cried hard when he was dropped for last AFCON",
    "summarized_story": "Iheanacho cried hard when he was dropped for last AFCON – John OguFormer international John Ogu has revealed how Super Eagles striker Kelechi Iheanacho cried hard when the latter was dropped in the last Africa Cup of Nations (AFCON).\nIn Nigeria’s first game of the AFCON 2021, a superb first-half strike from Iheanacho secured an important 1-0 win for Nigeria in their crunch clash with Egypt in Garoua.\nI remember the last Afcon he was dropped.\n- Advertisement -“He was crying so hard and didn’t want to really talk to anyone.\nI’m so happy for him Today @67Kelechi”He further said: “Last Afcon we went to, the 3 players who were dropped are buzzing real good in the present Squad – @SemiAjayi, @67Kelechi, @Simon27Moses ."
  },
  {
    "headline": "New texts for English, other languages in 2022 UTME",
    "summarized_story": "New texts for English, other languages in 2022 UTMECandidates preparing to write any of the three major Nigerian languages as well as Arabic and Literature-in-English in the 2022 Unified Tertiary Matriculation Examination (UTME) are to use new literature textbooks for the examination.\nThe Joint Admissions and Matriculation Board (JAMB) listed the new books, numbering 21, in its Monday Bulletin.\nThe board said the text books would be used for this year’s examination.\nThe publication reads: “These changes would take effect from the 2022 Unified Tertiary Matriculation Examination (UTME).”The board is yet to open registration for the examination.\n- Advertisement -With six textbooks, Arabic has the highest number of books among the subjects, followed by Literature-in-English and Yoruba, which have five each."
  },
  {
    "headline": "Soldiers kill, arrest 123 terrorists, rescue 27 kidnap victims in 2 weeks as another 864 terrorists surrender",
    "summarized_story": "OPERATION HADIN KAIIn Operation HADIN KAI, troops conducted various land and air operations in different locations of the theatre with renewed vigour that recorded significant results in the last 2 weeks.\nNotably, ground troops with the support of the Air Component aggressively foiled terrorists’ attempted infiltration into Biu town in Borno State.\nOther locations were; Wasagu town in Danko-Wasagu LGA of Kebbi State and Kara Kalmalo village in Ilella LGA of Sokoto State.\nOPERATION SAFE HAVENWithin the last 2 weeks, troops of Operation SAFE HAVEN carried out several operational activities at different locations of the theatre that yielded significant results.\nAlso, troops recovered 5 arms and 69 different calibres of ammunition among other items of security concern in the course of their operations."
  },
  {
    "headline": "ICRC, Shippers Council to revive moribund inland container depots",
    "summarized_story": "From Uche Usim, AbujaFollowing years of inactivity of the concessioned six Inland Container Depots (ICDs) located in each geo-political zone of Nigeria, the Infrastructure Concession Regulatory Commission (ICRC) on Wednesday, held a meeting with the Nigerian Shippers’ Council (NSC) who are the owners of the project and the concessionaires.\nAlso at the meeting was Dr Jobson Ewalefoh, ICRC’s Director of Contract Compliance Department and his team.\n“We hope to commission this project before the end of the second quarter and the ports will become functional immediately.\nAhmed Rabiu, Managing Director of the Dala Inland Dry Port Limited, concessionaires of the Kano Inland Port also hinted that the construction of the container depot was already nearing completion.\nHe assured that the company was working assiduously to ensure project completion and take off before the end of March 2022."
  },
  {
    "headline": "Breaking: Gunmen Launch Full Scale War On Niger Communities, Kill Scores, Many Abducted, Houses Set Ablaze",
    "summarized_story": "On Tuesday night, the people of Ukuru village in Bobi, Mariga local government area were woken up by the gunmen killing unspecified number of people and Houses, food barns, including other properties were destroyed.\nScores of people, including women and children were abducted during the attack.\nThe Tuesday night attacks is coming barely 48 hours after the gunmen ambushed Joint Security Team in Kwanan Dutse, killing three policemen and two vigilantes while a number of the gunmen were also neutralized.\nEqually in Shiroro local government area, the gunmen also on Tuesday morning went haywire, sacking over 30 villages and displaced over 3,000 people.\nWomen were also said to have been raped in Ajatai in Kwaki community by the gunmen who stormed these communities at about 8:00am on Tuesday."
  },
  {
    "headline": "Kanu: Court awards N1bn damages, orders FG to apologise",
    "summarized_story": "In the suit marked HIH/FR14/2021, Kanu asked the court to compel the respondents to pay him N5 billion in damages as monetary compensation for the “physical, mental, emotional, psychological and other damages” suffered as a result of the alleged infringement on his fundamental rights.\nThe suit also sought an order of injunction restraining the Federal Government from taking any further step in the prosecution of Nnamdi Kanu in Charge No: FHC/ABJ/CR/383/2015 (Federal Republic of Nigeria v. Nnamdi Kanu) pursuant to his unlawful expulsion from Kenya to Nigeria.\nIn a judgment that lasted for an hour, the judge said his court lacked jurisdiction to adjudicate in the applicant’s reliefs Nos.\nJustice Anya said the court was not vested with the powers to adjudicate on matters that took place in a foreign land, far away outside its jurisdiction.\nThe court, therefore, ordered the Federal Government to apologise to Nnamdi Kanu for infringing on his human rights and awarded N1billion as exemplary damages."
  },
  {
    "headline": "2023: South East presidency overdue- Orji Kalu",
    "summarized_story": "From Fred Itua and Kenneth Udeh, AbujaFormer governor of Abia State and Chief Whip of the Senate, Orji Uzor Kalu, yesterday, said the All Progressives Congress (APC) zoning the presidency to the South East in 2023 was overdue.\nAddressing National Assembly correspondents in Abuja, he revealed that the president’s body language supports a power shift to the South East in 2023.\nI told you the only two zones that have not tasted the presidency are the South East and the North East.\nIf they zone it to the South East, I have everything it takes to make a good president.”On the forthcoming convention of APC, Kalu said: “I am expecting very a good convention and a very good atmosphere.\nGovernor of Ebonyi State, Dave Umahi had also met with Buhari to declare his ambition to take over from him in 2023."
  },
  {
    "headline": "Tinubu Visits IBB, Seeks Ex-Military Leader’s Blessing for Presidential Bid",
    "summarized_story": "By Laleye DipoAll Progressives Congress National Leader and former Lagos State Governor Asiwaju Bola Ahmed Tinubu Thursday visited former military president, General Ibrahim Badamasi Babangida, to “get his blessing”.l for his presidential bid.\nTinubu after the parley told newsmen that he was in IBB’s residence to seek his blessing, saying ” there is no way I will visit Niger state without visiting IBB and receive his prayers.\n“I cannot come to Niger state and not stop by to pay a courtesy call on the enigma, General Ibrahim Badamasi Babangida”, Tinubu said.\nGenerally, I came to Niger state to commiserate with the Governor and the people of Niger state.\nThe presidential aspirant had earlier paid a courtesy call on Governor Bello, who spoke glowingly of his contributions to the development of Lagos State."
  },
  {
    "headline": "Buhari: How I Cheated Death in 2014",
    "summarized_story": "Inaugurates flyover, other projects in KadunaDeji Elumoye in AbujaPresident Muhammadu Buhari has gone down memory lane to recollect how he cheated death in Kawo, Kaduna State in 2014.\nSpeaking Thursday while inaugurating the 800-metre long flyover in Kawo, Kaduna State, the President recounted how he narrowly escaped a targeted bomb attack in the vicinity in 2014.\nReminiscing on the unfortunate incident, which claimed the lives of many innocent Nigerians, President Buhari thanked God for sparing his life on that fateful day along Ali Akilu road, Kawo-Kaduna.\nAccording to him: ”For many years, I always plied this route and I cannot recount how many times I crossed it.\nAt the Murtala Square, the new city centre of Kaduna State, President Buhari while admiring the remodelled edifice, recalled that he was constrained by family challenges to relocate from Daura to Kaduna after he was released from detention as a former military Head of State."
  },
  {
    "headline": "Tight Security as Buhari Inaugurates Projects in Kaduna",
    "summarized_story": "John Shiklam in KadunaPresident Muhammadu Buhari on Thursday inaugurated some projects initiated by the Kaduna State Government amid tight security.\nBuhari, who was received by Governor Nasir El-Rufai and top government officials, commenced his activities in Kafanchan, where he inaugurated some road projects under the Urban Renewal Programme before returning to Kaduna at about 11:45am.\nBuhari commended Governor El-Rufai for his achievements, saying he was impressed with the transformation that had taken place in Kaduna.\nYou are writing your history in letters of gold,” Buhari told the governor at the inauguration of the remodelled Murtala Square in Kaduna city.\nThe president is expected to be in Zaria on Friday to inaugurate more road projects under the Urban Renewal Programme."
  },
  {
    "headline": "NEC: Final Decision on Petrol Subsidy will Be Taken in June",
    "summarized_story": "Deji Elumoye in AbujaThe National Economic Council (NEC) has disclosed that a final decision on the removal of subsidy on petroleum will be taken in June when the provision for its payment in the 2022 budget would have lapsed.\nThe Council chaired by Vice-President Yemi Osinbajo held its maiden meeting in 2022 at the State House, Abuja on Thursday.\nAccording to him, any decision on the removal of subsidy will be taken after the budget provision runs its course in June.\nHe stressed that even though NEC had before now set up a committee on the issue of fuel subsidy, it was yet to take a position on it.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "News in Photographs: Osinbajo at APC Women Conference Dinner",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "Pictures Of Northern Governors Posing With Associate Of Bandits’ Leader, Turji Raise Suspicion",
    "summarized_story": "Some photographs taken in the recent past showing two governors and an associate of notorious bandits’ kingpin, Bello Turji, standing together have raised dusts.\nIn the picture with the suspect, Musa Kamarawa, who has confessed to working with Turji, are the governors of Zamfara and Sokoto, Bello Matawalle and Aminu Tambuwal, and the deputy governor of Sokoto, Mannir Dan Iyya.\nZamfara and Sokoto are two of the North-west states under attacks by bandits in which hundreds of people have been killed and thousands displaced.\nKamarawa was among those first contacted by Mr Matawalle after he was declared governor in 2019, to facilitate a peace accord with bandits, Premium Times reports.\n“Though Bello Turji didn’t accept the peace accord, there were a lot of bandits who turned in their guns and ammunition through Musa (Kamarawa)."
  },
  {
    "headline": "Pictures Of Northern Governors Posing With Associate Of Bandits’ Leader, Turji Raise Suspicion",
    "summarized_story": "Some photographs taken in the recent past showing two governors and an associate of notorious bandits’ kingpin, Bello Turji, standing together have raised dusts.\nIn the picture with the suspect, Musa Kamarawa, who has confessed to working with Turji, are the governors of Zamfara and Sokoto, Bello Matawalle and Aminu Tambuwal, and the deputy governor of Sokoto, Mannir Dan Iyya.\nZamfara and Sokoto are two of the North-west states under attacks by bandits in which hundreds of people have been killed and thousands displaced.\nKamarawa was among those first contacted by Mr Matawalle after he was declared governor in 2019, to facilitate a peace accord with bandits, Premium Times reports.\n“Though Bello Turji didn’t accept the peace accord, there were a lot of bandits who turned in their guns and ammunition through Musa (Kamarawa)."
  },
  {
    "headline": "Kano police arrest teacher for 'killing five-year-old pupil after demanding N6m ransom'",
    "summarized_story": "Abdulmalik Tanko, a teacher in Kano, has been arrested over his alleged involvement in the kidnap and death of Hanifa Abubakar, a five-year-old pupil.\nThe pupil was said to have been kidnapped in December and her abductors had demanded N6 million ransom.\nIn a statement on Thursday, Abdullahi Kiyawa, police spokesperson in Kano, said Tanko killed his pupil when he found that she had recognised him.\n“On investigation, Abdulmalik confessed that, the victim, Hanifa, is his student at a private school in Kwanar Dakata, Nassarawa LGA, Kano State.\nThe corpse was exhumed and taken to the Mohammed Abdullahi Wase Specialist Hospital Kano where she was confirmed dead."
  },
  {
    "headline": "Kano police arrest teacher for 'killing five-year-old pupil after demanding N6m ransom'",
    "summarized_story": "Abdulmalik Tanko, a teacher in Kano, has been arrested over his alleged involvement in the kidnap and death of Hanifa Abubakar, a five-year-old pupil.\nThe pupil was said to have been kidnapped in December and her abductors had demanded N6 million ransom.\nIn a statement on Thursday, Abdullahi Kiyawa, police spokesperson in Kano, said Tanko killed his pupil when he found that she had recognised him.\n“On investigation, Abdulmalik confessed that, the victim, Hanifa, is his student at a private school in Kwanar Dakata, Nassarawa LGA, Kano State.\nThe corpse was exhumed and taken to the Mohammed Abdullahi Wase Specialist Hospital Kano where she was confirmed dead."
  },
  {
    "headline": "FULL FIXTURES: Nigeria to face Tunisia in AFCON round of 16",
    "summarized_story": "The Super Eagles of Nigeria will face the Carthage Eagles of Tunisia in the ongoing African Cup of Nations (AFCON) round of 16 fixtures.\nAdvertisementIt is also a reunion for Austin Eguavoen, Super Eagles interim coach, who faced Tunisia at the quarter-finals stage at AFCON 2006 also in Egypt.\nIn other pairings, Cameroon, AFCON hosts, will face Comoros, tournament debutants, while Burkina Faso will play the Gambia, another debutant nation.\nAdvertisementThe round of 16 ties will begin on Sunday, January 23, with Nigeria’s tie against Tunisia one of two matches for the day.\nAFCON ROUND OF 16 FIXTURES"
  },
  {
    "headline": "FULL FIXTURES: Nigeria to face Tunisia in AFCON round of 16",
    "summarized_story": "The Super Eagles of Nigeria will face the Carthage Eagles of Tunisia in the ongoing African Cup of Nations (AFCON) round of 16 fixtures.\nAdvertisementIt is also a reunion for Austin Eguavoen, Super Eagles interim coach, who faced Tunisia at the quarter-finals stage at AFCON 2006 also in Egypt.\nIn other pairings, Cameroon, AFCON hosts, will face Comoros, tournament debutants, while Burkina Faso will play the Gambia, another debutant nation.\nAdvertisementThe round of 16 ties will begin on Sunday, January 23, with Nigeria’s tie against Tunisia one of two matches for the day.\nAFCON ROUND OF 16 FIXTURES"
  },
  {
    "headline": "NLC: Workers are suffering... planned petrol price hike will send many to early graves",
    "summarized_story": "Ayuba Wabba, president of the Nigeria Labour Congress (NLC), says the planned increase in the price of petrol will send many Nigerians to “early graves”.\nThe announcement stirred up reactions among Nigerians, with the NLC threatening to embark on strike if the federal government goes ahead with the plan.\nAdvertisementSpeaking on the development on Thursday, Ayuba, in an interview on Channels Television, insisted that labour unions will resist the proposed hike.\nMany workers have lost their jobs, those on fixed wages their salaries cannot take them home — that is the reality.\n“In this complex issue, if we compound it with the price hike of PMS, it then means that many people will go to their graves early."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How Moni Africa leverages social trust to finance mobile money agents",
    "summarized_story": "Get the best African tech newsletters in your inboxFollowing a conversation in November 2020 with a cluster of mobile money agents in the Shapati community in Lekki-Ajah, Lagos, one thing was clear to Iromini: liquidity is a major challenge plaguing the mobile money ecosystem.\nThe startup instead leverages an algorithm developed around social trust and social underwriting that’s seen the platform achieve a highly impressive repayment rate.\nMoni Africa claims its revenue has grown 50% month-on-month so far and most of its agents, about 70% of which are women, have grown their businesses by 3x.\nIts 0.1% default rate, according to the CEO, can be attributed to the platform’s community-based model and interest rate which supports the unit economics of a mobile money agent.\nIn the long run, the startup plans to expand its community-finance model beyond mobile money agents to different SMEs across Africa."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "Nigeria’s new deal with Twitter is not a win for the government or citizens",
    "summarized_story": "Nigeria’s new deal with Twitter is its government’s most recent effort to control social media.\nAccording to Twitter’s Transparency Report—a report that gives insights into information and removal requests from around the world, by country—Nigeria has made zero removal requests and just 7 information requests, at the time of reporting.\nHowever, India has made 12,435 legal removal requests, 67 court orders, and 12,368 other legal demands, representing 6% of global removal requests.\nIn February last year, India’s government enacted a fresh social media rule that made social media companies like Facebook, WhatsApp, Twitter, and others more accountable to legal requests.\nBut Sesan says Nigeria’s internet restriction tactics are miles behind India’s because the latter drew up regulations; Twitter will only respond to legal requests backed by legislation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Meet the judges of Techpoint Awards 2021",
    "summarized_story": "Share this article:On October 21, 2021, Techpoint called for preliminary nominations for the latest edition of Techpoint Awards, our annual event to celebrate the activities of players in Nigeria’s tech space.\nThe finalists in the nomination-only and Techpoint Editorial Choice categories were asked to submit relevant stats for judging by the external judges and Techpoint Editorial team, respectively.\nThe firm has backed and supported 36 African tech startups in Nigeria, Kenya, Rwanda, and Ghana.\nWinners to be announcedThe award winners will be announced on Sunday, January 23rd, 2022, at the Techpoint award dinner ceremony.\nThis award will feature all VIP ticket holders, award nominees, award judges, Pitchstorm judges, Techpoint Build speakers, Pitchstorm finalists, and other distinguished guests."
  },
  {
    "headline": "With its API infrastructure and agent network, Insurpass wants to increase insurance adoption in Nigeria",
    "summarized_story": "AdvertisementHowever, he admits that with the present state of things in Nigeria, technology alone isn’t enough to solve the issue of low insurance penetration.\nAdvertisementA balanced approachInsurpass runs a functional web application as a product where customers can go directly to purchase their insurance packages.\nBecause it’s the Insurpass API that powers this web application.”BimaCred makes money like the conventional broker agency.\nIt gets a brokerage commission for every insurance product sold on the platform, as negotiated with the Insurance company.\nMeanwhile, the Nigeria Inter-Bank Settlement System (NIBSS), Unified Payments, First Bank, WEMA Bank, TeamApt, and Transtura are considering using Insurpass’ services."
  },
  {
    "headline": "How we choose the winners of Techpoint Awards",
    "summarized_story": "Share this article:On Sunday, January 23, 2022, Techpoint Africa will be hosting Techpoint Awards 2021, the second edition of the Awards.\nBefore highlighting and breaking down the Awards processes, let’s highlight the three categories:Nomination-only: Awards in this category are judged by an independent team of external judges.\nAdvertisementEditorial Choice: Awards in this category are judged by the Techpoint editorial team.\nThe external judges only grade startups in the nomination-only categories, while the Techpoint editorial team grades the Editorial Choice categories.\nAnnounce winnersThe final stage of the Awards process is announcing the winners, which usually happens as part of Techpoint Africa’s flagship event, Techpoint Build."
  },
  {
    "headline": "Ghana Plots to become West Africa’s Gas Hub in threat to Nigeria",
    "summarized_story": "Ghana Plots to become West Africa’s Gas Hub in threat to NigeriaGhana’s state-owned oil company is progressing with plans to sell liquefied natural gas throughout West Africa in a move that will test Nigeria’s dominance and her failure to better position the country’s energy credentials.\nGNPC will buy the LNG from Tema and sell it onward.\nGNPC is working with partners interested in building infrastructure to sell LNG to domestic users and those within the sub-region looking to boost power, Ussif said.\nCredit in West Africa’s second-biggest economy expanded at about 6.7percent in the first 10 months of 2021, the slowest pace in three years as the pandemic decimated demand.\nLenders must desist from accepting debt securities issued by their local or international affiliates, the regulator said."
  },
  {
    "headline": "Nigeria’s taxman turns attention to digital space",
    "summarized_story": "The Federal Inland Revenue Service (FIRS), Nigeria’s tax collection agency, has disclosed plans to focus more on generating revenues from the digital space as the country ramps up efforts to boost its low tax take.\nMuhammad Nami, executive chairman, FIRS, said this while speaking as the special guest at the Pedabo 2022 Annual Public Private Sector Engagement.\n“In 2022, the Service will give priority to the collection of taxes from the digital economy,” Nami said.\n“The Service has deployed a digital service interface, the Digital Economic Compliance (DEC) Tool, to facilitate the implementation of the Regime.\nAs a percentage of GDP, Nigeria only generates 7 percent in tax revenue, less than half of the frontier market average of 15 percent."
  },
  {
    "headline": "Fuel Subsidy: NEC to consider N302/litre new pump price",
    "summarized_story": "The National Economic Council (NEC) has begun meeting in Abuja to consider reports of its adhoc committee which recommended a N302 per litre price for Premium Motor Spirit (PMS) popularly known as petrol.\nThe meeting which is currently ongoing, is being chaired by Vice President Yemi Osinbajo.\nThe Governors who have expressed their displeasure over the continued funding of fuel subsidy projected at N150bn monthly, see such expenditure as a drain on the federation accounts.\nThe NEC adhoc committee which is headed by Vice President Yemi Osinbjo had received and reviewed the report recommending N302 /liter , as against the current N162/N165/ liter, at a virtual meeting of the adhoc committee, in preparations to the full NEC meeting during the week.\nIt was gathered that although a sub committee of the National Economic Council NEC, had made a recommendation that the new fuel pump price be pegged at N302 per liter."
  },
  {
    "headline": "Don Urges FG To Create A Favourable Environment For The Green Manufacturing Technology – Nigerian Observer",
    "summarized_story": "Vincent Aizebeoje Balogun have called on the Federal Government to create a favourable environment for the green manufacturing technology sector to thrive.\nAnd to develop the green manufacturing technology through the use of its local content technology for the production of goods in the manufacturing sector.\n“Rather, we need to employ and develop our green manufacturing sector so that we can create more jobs and take our citizens out of the streets” he said.\nHe urged manufacturers operating in the country to key into the green manufacturing technology for the manufacturing of their products.\n“For green manufacturing to thrive, there has to be an understanding and advocacy on the modus operandi towards green mechanical machining processes."
  },
  {
    "headline": "Tipper drivers protest killing of colleague by security personnel in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Angry tipper drivers protested the killing of their colleague by security personnel alleged to be operative of the Department of State Services (DSS) in Benin City.\n“And before a blink of eye, the DSS operatives opened fire which resulted in the death of a tipper driver.\nThe development caused heavy gridlock in the Benin metropolis as other drivers protested the death of their colleague.\nThe source said the hoodlums, upon sighting the DSS operatives, pounced on them with guns and various dangerous weapons.\nThe DSS source said its operatives sustained varying degrees of injuries during the attack while their vehicles were also damaged."
  },
  {
    "headline": "Diaspora group lite up Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – As part of efforts to contribute to the development of Abudu, a group under the aegis of Abudu in Diaspora Group has commenced installation of about 250 solar streetlights in the community.\n“We (Abudu in diaspora group) are responsible for the Abudu lighting up project; our motive was to help our people back home at Abudu.\n“When we use to stay in Abudu, people come from outside the state to come and stay in Abudu.\nWe have other projects, and we hope at least we should be able to do one project every year in the community.\nthe solar streetlights project is just a starting point for things to come”."
  },
  {
    "headline": "Nation Blue Economy: Vice President Seeks Stakeholders Participation, Inaugurates Expanded Committee – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Vice President, Prof Yemi Osinbajo has sought for wider participation of relevant stakeholders in the blue economy project to deepen participation and benefits of Nigerians from the country’s marine resources.\nOsinbajo made the call at the inaugural meeting of an Expanded Committee on Sustainable Blue Economy in Nigeria in the Presidential Villa recently.\nAccording to him, a viable blue economy project will offer vista of opportunities not only for littoral states where there are bodies of waters but for the entire country.\n“Countries have to define the scope of their blue economy based on their priorities.\nIn his opening remark, Transportation Minister, Rotimi Amaechi said the blue economy is capable of improving government revenue, create employments and grow the gross domestic product of Nigeria."
  },
  {
    "headline": "Teacher abducts Kano school girl for ransom, kills her after she recognized him",
    "summarized_story": "A 34-year-old teacher, Abdulmalik Tanko, have been arrested by the police for abducting and killing a 5-year-old Kano pupil, Hanifa Abubakar.\nFamily sources said he was among the first set of people who came to console her parents after the abduction.\nA statement by the police on Thursday confirmed that Abdulmalik was the one who abducted the little girl.\nThe suspect led a combine Team of Operatives of DSS Kano State, Kano State Police Command’s Medical Team and Team of Operation Puff Adder to the scene.\nThe suspect, according to the police, will be charged to court upon completion of investigation."
  },
  {
    "headline": "NASS to further empower SEC to sanction unregistered schemes, others",
    "summarized_story": "In a bid to combat the menace of Ponzi schemes and ensure that the apex regulator of the capital market is well equipped to stem the tide, the National Assembly is proposing a Bill that will empower the Securities and Exchange Commission to impose stiffer punishment on promoters of Ponzi schemes and other unregistered investment schemes.\nThis is part of an amendment to the Investment and Securities Act 2007, being proposed by the House of Representatives.\nThe Second reading of the Bill was done on Thursday at the House of Representatives by Hon.\nUnder the proposed law, ‘A bill to repeal the Investment and Securities Act 2007 and to enact the Investments and Securities Act, 2021’ which passed the second reading at the floor of the House of Representatives yesterday, SEC will be empowered to address the challenges of Ponzi schemes.\nThe capital market has to be dynamic in today’s world in a bid to contribute its quota to national development and that is one of the reasons why we are pushing this."
  },
  {
    "headline": "Retirees unite in Osun to demand fair deal from govt",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Osun State retirees under the contributory Pensioners have resolved their differences just as they have agreed to work together under a singular leadership.\nThe pensioners emphasized the need among them, noting that the leadership tussle it had over the years been enmeshed in was over.\nSpeaking after the peace meeting, Senior Assistant Secretary, Nigerian Union of Pensioners, Bunmi Ogunbolade thanked the leadership of the NUP for allowing peace to reign after years of imbroglio.\n“We expect the state government to pay all our entitlement because when you look at the situation of things now, it’s not palatable in Osun State.\n“Many of our people are have died because of lack of money to take good care of themselves.”"
  },
  {
    "headline": "NEC to decide on fuel subsidy removal in June",
    "summarized_story": "The National Economic Council (NEC) has that decision on the removal of subsidy on petroleum will be made in June when the provision for its payment in the 2022 budget expires.\nAccording to the council, though conservation on subsidy removal has been going on it was yet to take a position on it.\nHe explained that any decision on the removal of subsidy will be taken after the budget provision runs its course in June.\nAlso speaking while responding to questions, Governor Obaseki pointed out that Premium Motor Spirit (PMS), which sells for N162-165 per liter in Nigeria, sells a hundred percent higher in other countries.\nHe said the federal government was spending about N2 trillion on petroleum subsidy, which according to him, could have been used for other purposes."
  },
  {
    "headline": "Convention: APC Denies Zoning National Chairmanship, Others",
    "summarized_story": "The All Progressives Congress (APC) has refuted report in the media suggesting that it has zoned the party’s national chairmanship to the North Central.\nThe party’s Caretaker/Extraordinary Convention Planning Committee (CECPC) denied releasing zoning arrangement for the national convention slated for February 26, 2022.\nThe committee, after its 19th regular meeting, which lasted for two days, released the timetable and schedule of activities for the convention of the party.\nAddressing journalists after Wednesday’s meeting held at the party’s national secretariat, the secretary of the caretaker committee, Senator John James Akpanudoedehe, said at no time did the committee discuss the zoning arrangement for the National Convention.\nWe are yet to meet on the issue of zoning."
  },
  {
    "headline": "INEC Tackles Tinubu, Says PVCs Don’t Expire",
    "summarized_story": "The Independent National Electoral Commission (INEC) has reacted to claims by a national leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu, on the validity of the Permanent Voter’s Cards (PVCs), saying the current PVCs have not expired.\nTinubu while hosting some of his supporters, had claimed that there had been a decline in the number of eligible voters in recent times because PVCs have expired.\nOyekanmi stressed that double registration is an offence under the electoral law.\nHe said, “In fact, double registration is an offence under our laws.\nOnce a name appears on the National Register of Voters, it stays there permanently."
  },
  {
    "headline": "FedPoly Ohodo ‘ll Drive Industrial Dev’t In South-East – Council Chair",
    "summarized_story": "The chairman, Governing Council of Federal Polytechnic, Ohodo, EnuguState, Silva Ameh, has said that the newly established higher institution will drive industrial development in the southeast region.\nHe said the institution is an entrepreneurial polytechnic and will beactive in applied teaching and learning, theory and research that areessential to the future society, business and industry.\n“The polytechnic must become an engine for the southeast regionaleconomic development.\nADVERTISEMENT“I dare say that the establishment of the Ohodo Polytechnic is anopportunity for the South-eastern Region to become an Economic andIndustrial Hub, especially for agricultural equipment and alliedimplements.\nWhile congratulating other members of the council and principalofficers of the polytechnic, he charged them to remain focus on thegoal of the institution to promote economic growth and technologicaldevelopment."
  },
  {
    "headline": "FedPoly Ohodo ‘ll Drive Industrial Dev’t In South-East – Council Chair",
    "summarized_story": "The chairman, Governing Council of Federal Polytechnic, Ohodo, EnuguState, Silva Ameh, has said that the newly established higher institution will drive industrial development in the southeast region.\nHe said the institution is an entrepreneurial polytechnic and will beactive in applied teaching and learning, theory and research that areessential to the future society, business and industry.\n“The polytechnic must become an engine for the southeast regionaleconomic development.\nADVERTISEMENT“I dare say that the establishment of the Ohodo Polytechnic is anopportunity for the South-eastern Region to become an Economic andIndustrial Hub, especially for agricultural equipment and alliedimplements.\nWhile congratulating other members of the council and principalofficers of the polytechnic, he charged them to remain focus on thegoal of the institution to promote economic growth and technologicaldevelopment."
  },
  {
    "headline": "EFCC Arrests 8 For Internet Fraud In Benue",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission (EFCC), have arrested eight suspects for alleged involvement in computer-related fraud in Markudi, Benue State.\nThe suspects are: Okoha Chinedu Charles, Chibuizor Philip Nnake, Emmanuela Odeh Eneokpe, Ushir Terhile John, Okoro Ossico Osaro, Ejiofor Chibuizor, Wandoo Juliet Baru and Tarbee Destines.\nEFCC spokesperson, Wilson Uwujaren, who confirmed the arrest, said the suspects were arrested on Wednesday, January 19, 2022 during an operation by operatives of the Commission in the State capital.\nHe also said the suspects will be charged to Court as soon as investigations were concluded.\nAfter carrying out this fraudulent act, the defendant absconded from his duty post to Plateau State where he was eventually arrested by operatives of the Commission."
  },
  {
    "headline": "Senator Na’Allah alleges: Direct primary was Gbajabiamila’s idea to favour someone",
    "summarized_story": "The lawmaker representing Kebbi South Senatorial District, Senator Bala Ibn Na’Allah, says the inclusion of mandatory direct primary in the Electoral Act Amendment Bill was the idea of the Speaker of the House of Representatives, Femi Gbajabiamila.\n“We are hearing that that law (direct primary) was intended for an individual.\nNa’Allah said that during the discussions at the committee level, the issue of direct primaries was never brought up.\nThe senator said it was when the bill was to be passed before the House that Gbajabiamila included the clause.\nHe added, “The issue of direct primary came at the dying minute on the floor of the House of Representatives when they were considering the report of the committee of electoral matters."
  },
  {
    "headline": "Senator Na’Allah alleges: Direct primary was Gbajabiamila’s idea to favour someone",
    "summarized_story": "The lawmaker representing Kebbi South Senatorial District, Senator Bala Ibn Na’Allah, says the inclusion of mandatory direct primary in the Electoral Act Amendment Bill was the idea of the Speaker of the House of Representatives, Femi Gbajabiamila.\n“We are hearing that that law (direct primary) was intended for an individual.\nNa’Allah said that during the discussions at the committee level, the issue of direct primaries was never brought up.\nThe senator said it was when the bill was to be passed before the House that Gbajabiamila included the clause.\nHe added, “The issue of direct primary came at the dying minute on the floor of the House of Representatives when they were considering the report of the committee of electoral matters."
  },
  {
    "headline": "United States, Nigeria Sign Historic Agreement to Protect Nigerian Cultural Heritage",
    "summarized_story": "By AZUH AMATUSOn January 20, the United States and Nigeria signed a historic Memorandum of Understanding that launches a Cultural Property Agreement between both nations.\nThe agreement will facilitate continued cooperation with Nigerian law enforcement agencies and support efforts to identify, intercept, repatriate, and protect cultural property and related heritage.\nThe agreement will also promote the exchange of archaeological materials for scientific, cultural, and educational purposes with the aim of increasing public awareness for Nigerian cultural heritage.\nThese bilateral agreements support U.S. government efforts across different agencies and organizations to protect and preserve cultural heritage in host countries.\nThe U.S. has signed Cultural Property Agreements with several countries in Africa including Egypt, Libya, Mali, and Morocco."
  },
  {
    "headline": "United States, Nigeria Sign Historic Agreement to Protect Nigerian Cultural Heritage",
    "summarized_story": "By AZUH AMATUSOn January 20, the United States and Nigeria signed a historic Memorandum of Understanding that launches a Cultural Property Agreement between both nations.\nThe agreement will facilitate continued cooperation with Nigerian law enforcement agencies and support efforts to identify, intercept, repatriate, and protect cultural property and related heritage.\nThe agreement will also promote the exchange of archaeological materials for scientific, cultural, and educational purposes with the aim of increasing public awareness for Nigerian cultural heritage.\nThese bilateral agreements support U.S. government efforts across different agencies and organizations to protect and preserve cultural heritage in host countries.\nThe U.S. has signed Cultural Property Agreements with several countries in Africa including Egypt, Libya, Mali, and Morocco."
  },
  {
    "headline": "Niger governor Sani Bello endorses Tinubu",
    "summarized_story": "By Aminu Garko/MinnaGovernor of Niger State, Abubakar Sani Bello has openly endorsed the presidential aspirations of Bola Ahmed Tinubu, the National Leader of the ruling All Progressives congress party ( APC).\nHe even gave him an assignment on his expectations in a Tinubu presidency, asking Tinubu to replicate for Nigeria, what he did in Lagos.\n” Lagos is a country within a country and we saw the foundation you laid there.\nWe are looking forward to seeing you replicate it for Nigeria ”Sani Bello thanked the former Lagos state governor for sympathising with Niger State and its people over the incessant banditry and terrorism.\nThe Former Lagos state Governor was accompanied by Senator Abu Fari from Katsina and two members of the House of Representatives, Ibrahim Abdullahi from Niger State and James Falake from Ikeja Federal constituency of Lagos State."
  },
  {
    "headline": "Big explosion in Ghana destroys 500 homes, kills many",
    "summarized_story": "A big explosion in Ghana’s rural Western Region on Thursday razed hundreds of buildings and killed a yet-to-be ascertained number of residents.\nIt happened when a truck carrying explosives to a gold mine collided with a motorcycle.\nSeji Saji Amedonu, deputy director general of the National Disaster Management Organisation, said 500 buildings had been destroyed.\nThe police initially said the explosives were heading from the Tarkwa gold mine run by Johannesburg-based Gold Fields.\nGhana President Nana Akufo-Addo tweeted he had been informed of the incident and confirmed there had been deaths."
  },
  {
    "headline": "Drama As Security Operatives Clash During Buhari’s Visit To Kaduna",
    "summarized_story": "Security operatives clashed on Thursday during the visit of the President, Major General Muhammadu Buhari (retd.\n), to Kaduna State.\nIt was learnt the clash occurred while Buhari was inaugurating Kawo Fly-over Bridge within the Kaduna metropolis.\nAccording to reports, the security operatives exchanged blows before normalcy returned.\nThe blockage by the DSS operatives was said to affect other vehicles, including those of the Kaduna State Governor, dignitaries, and other state officials."
  },
  {
    "headline": "Many Feared Dead As Terrorists Attack Niger Community",
    "summarized_story": "Terrorists are claimed to have attacked Ukuru Village in Niger State’s Bobi District, Mariga Local Government Area, on Wednesday, killing an unknown number of people and setting fire to their homes.\nDuring their assault, the terrorists also set fire to vehicles and shops, according to our source.\nThe attackers are also claimed to have kidnapped a huge number of villagers.\nAccording to reports, the gunmen attacked the community in huge numbers, riding motorcycles and wielding AK-47 weapons.\nAs of the time of this report, no details about the attack were available."
  },
  {
    "headline": "PHOTOS: Tinubu Meets IBB Over 2023",
    "summarized_story": "The National Leader of the All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu has met with former Military President, General Ibrahim Babangida at his Uphill Residence in Minna Niger State.\nThe meeting, which lasted for about one hour, also had Niger Governor Abubakar Sani Bello in attendance.\nTinubu visited the Uphill residence of Babangida after he left the Niger State Government House where he donated N50 million to Internally Displaced Persons (IDPs) in Niger.\nSpeaking to newsmen after the closed-door meeting, Tinubu said that he visited General Babangida as part of the consultation for his presidential bid.\nSo, he gave me his prayers.”Tinubu stated that he cannot come to Niger state without paying a visit to IBB."
  },
  {
    "headline": "BREAKING: Reps Pass Electoral Bill Without Compulsory Direct Primary Clause",
    "summarized_story": "The Electoral Act (Amendment) Bill was passed by the House of Representatives on Thursday.\nThe mandatory direct primary clause, on the other hand, was changed by the legislators.\nAfter the repeal of clause (84) forcing political parties to only select candidates through direct primaries, the measure was passed.\nCompulsory direct primaries were removed from the bill by both chambers of the National Assembly, the Senate and the House of Representatives.\nLast year, Buhari vetoed the electoral bill and sent it back to the National Assembly because it barred political parties from holding direct primaries."
  },
  {
    "headline": "Pictures: Obasanjo decorates son as Brigadier General",
    "summarized_story": "Former President Olusegun Obasanjo has decorated his son, Adeboye Obasanjo, as Brigadier-General in the Nigerian Army, following his recent promotion in the military.\nObasanjo, a former Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria, was accorded a rare privilege by the military authorities on Wednesday to decorate his son with his newly acquired promotion of a Brigadier-General at the Nigerian Engineering Corp at the Bonny Camp, Lagos.\nThe two-term civilian President and former Military Head of State, who is also a retired Army General was accompanied by Towulade of Akinale Kingdom of Egbaland, Oba Olufemi Ogunleye to the occasion.\nThe decorated Obasanjo, of the Engineering Corp who holds two Master Degrees and other professional qualifications has passed through the military mills both in Nigeria, and in various foreign formations."
  },
  {
    "headline": "I can hardly find my way home in Kaduna – Buhari",
    "summarized_story": "President Muhammadu Buhari has commended Governor Nasir el-Rufai for the urban renewal infrastructural development across the state, noting that he can hardly find his way home within the Kaduna city.\nSpeaking while commissioning the redesigned and redeveloped Murtala Mohammed Square Kaduna, President Buhari said he was constrained to move Daura to Kaduna but with the new infrastructural developments, the governor has done what was expected of him and Kaduna state has become a state of choice.\nThe entire Murtala Mohammed Square has been rebuilt, and redeveloped.\nThis would be the new city center of Kaduna,” el-Rufai said.\nPresident Buhari later commissioned the Kawo Bridge that was redesigned with three roundabouts and extended to ease traffic at that junction, which connects Kaduna city center to Mando Nnamdi Azikiwe Way and Zaria town."
  },
  {
    "headline": "Breaking: Unknown tennis player sends Andy Murray out of Australian Open",
    "summarized_story": "Britain’s former world number one Andy Murray produced a subdued display as he was beaten by Japan’s Taro Daniel in the Australian Open second round.\nMurray lost 6-4 6-4 6-4 to qualifier Daniel – ranked below him at 120 in the world – on John Cain Arena.\nMurray had never previously lost a Grand Slam match to an opponent ranked as low as 28-year-old Daniel.\nFor Daniel, victory meant he reached the third round of a major for the first time in his career.\nMurray shot a disconsolate look towards his box after Daniel clinched victory with a crisp backhand volley on his first match point."
  },
  {
    "headline": "Removing Fuel Subsidy Will Push More Nigerians Into Poverty – Abdulsalami",
    "summarized_story": "﻿Former Head of State Abdulsalami Abubakar on Thursday raised concerns over the removal of fuel subsidy.\nGeneral Abdulsalami, who was speaking at the 19th Daily Trust Summit in Abuja, said the country is facing challenges on multiple fronts and a fuel subsidy removal will only compound the situation.\nThe Federal Government has said it plans to discontinue the payment of fuel subsidy by June but the move has been rejected by several stakeholders, including the Nigeria Labour Congress.\nREAD ALSO: Buhari Never Directed Removal Of Petrol Subsidy, Says Lawan“Unemployment or underemployment remain at record levels,” General Abdulsalami said.\n“On top of all these, fuel prices are expected to rise significantly in the coming months as announced last November by the NNPC."
  },
  {
    "headline": "President Buhari Commissions Bridge Where He Was Almost Killed In 2014 By Boko Haram",
    "summarized_story": "﻿President Muhammadu Buhari has commissioned a bridge in Kaduna in an area where he was almost killed by Boko Haram terrorists.\nThe President, at the time an aspirant, was caught in an explosion at the busy Kawu market area.\nDuring the commissioning of the Kawu Bridge on Thursday, Governor Nasir El-Rufai recalled the incident.\nMr President will recall this bridge very well because it was just under this bridge that Boko Haram tried to kill you,” the governor said at the event.\nI would not recall how much I crossed it and you told me how there was an attempt on my life on this route,” Buhari added."
  },
  {
    "headline": "Electoral Act Amendment: NGF Commends Senate, Asks Reps To Include Consensus Option",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) has commended the Senate for re-amending the Electoral Act Amendment Bill giving room for direct, indirect, and consensus options for nominating candidates for the various political parties in the country.\nThey commended the Senate for amending clause 84 regarding the mode of candidate selection in the Electoral Act Amendment Bill.\nThe state governors also discussed issues as regards the nation’s security challenges, health, food security, among others.\nGovernors at the meeting include the NGF Chairman and Ekiti State Governor, Kayode Fayemi; Kano State Governor Abdullahi Ganduje; Nasarawa Governor Abdullahi Sule; Anambra Governor Willie Obiano; Oyo State Governor Seyi Makinde and Osun State Governor Gboyeba Oyetola.\nHowever, unlike their counterparts in the Senate, the Reps adopted direct and indirect primaries but expunged the option of consensus candidature."
  },
  {
    "headline": "Army Neutralizes 37 Terrorists In Northeast",
    "summarized_story": "Troops of Operation Hadin Kai have neutralized a total of thirty-seven (37) terrorist elements in the northeast, with seventeen (17) said to have been arrested.\nTwenty-One (21) assorted arms as well as one hundred and seventeen rounds of different calibres of ammunition, and four gun trucks were captured from the terrorists.\nAdditionally, troops rescued a total of 16 abducted civilians within the period.\nThe surrendered terrorists have been properly profiled and handed over to appropriate authorities for necessary actions,” Major General Onyeuko stated.\n“Additionally, troops rescued 2 kidnapped civilians and recovered 2 motorcycles, while large quantities of Cannabis Sativa were impounded in the course of the operations within the same period”."
  },
  {
    "headline": "Benue Govt Raises Fine For Impounded Animals From N2,000 To N50,000",
    "summarized_story": "The Benue State government has raised the fine for impounded animals from N2,000 to N50,000, with an additional N20,000 daily quarantine fee in the amended Open Grazing Prohibition and Ranches Establishment Law of 2022.\nGovernor Samuel Ortom who disclosed this on Thursday while signing the amended law said failure to claim the animals after seven days empowers the state Ministry of Agriculture to auction the animals, in line with the law.\nHe added that while other portions of the law remained as they were, another amended area covered the seven days period of grace during which the confiscated livestock must be claimed by their owners or risk being unction.\nIf you don’t pay within seven days, the law permits us to auction it,” Ortom said.\n“The House of Assembly has approved that for every cow arrested by our livestock guard, the owners should pay the sum of N50,000 instead of the meagre N2,000."
  },
  {
    "headline": "APC national chairmanship: I won't join issues with any aspirant",
    "summarized_story": "A former governor of Zamfara state and one of the aspirant for the Chairmanship position in the All Progressives Congress Party, Abdulaziz Yari, said he will not join issues with any other aspirants for the position.\nAdvertisementMr Shinkafi says Abdulaziz Yari was not captured in the revalidation and registration exercise carried out by the party in Zamfara State.\nReacting to the allegations, Abdulaziz Yari says he’s a duly registered member of the All Progressives Congress Party.\nAdvertisementHe also accused Sani shinkafi of formenting trouble with the APC in the state given his antecedent from the All Progressives Grand Alliance (APGA).\nHe called on the Caretaker Committee to disregard Sani Shinkafi describing him as a “noise maker” and means no good for the party."
  },
  {
    "headline": "Tinubu donates N50m to Niger Govt to fight insecurity",
    "summarized_story": "National Leader of the All Progressives Congress, Asiwaju Bola Tinubu has donated N50 Million to the Niger State Government to tackle insecurity, banditry and other security challenges.\nHe made the donation during a condolence visit to the State governor in Minna on Thursday.\nAdvertisementGovernor Bello recently said more than 200 people have been killed in attacks in over 300 communities in the State this year.\nAdvertisement"
  },
  {
    "headline": "Asiwaju Tinubu charges Nigerians to collect PVC's",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu received APC women leaders across the country including the Federal Capital territory where he charged them to unite and go all out to collect their PVCs for them to be able to exercise their civic right during the forthcoming election.\nThe women say the visit was to affirm their support for Bola Tinubu’s 2023 Presidential ambition.\nAdvertisement"
  },
  {
    "headline": "APC Sets February 26th for its National Convention -",
    "summarized_story": "Nigeria’s governing party, the All Progressives Congress, has set 26th of February as the date to hold it’s National Convention.\nThe National Chairman of the APC Caretaker Extraordinary Convention Planning Committee, Governor Mai Mala Buni stated this in his speech at the Progressives Women’s Conference holding Abuja, Nigeria."
  },
  {
    "headline": "Tinubu Goofs Again, Says Current PVCs Have Expired – Trending with Ojy Okpe",
    "summarized_story": "Meanwhile, the Governor of Lagos State, Babajide Sanwo-Olu on Tuesday, acquired new sets of 10-car Intracity trains for the Lagos Red Line rail project.\nThe red line, a 37-kilometer rail project started by the Governor, when completed, will have 11 stations and will be the first operational metro system in West Africa.\nThe Governor has specifically promised Lagosians that first phase of the Red Line will begin by the last quarter of 2022 or first quarter of 2023, with a capacity of 500,000 passengers daily.\nFinally, Nyesom Wike, the Governor of Rivers State on Wednesday, requested for police protection for local government chairpersons clamping down on illegal refining sites in the state.\nThis is coming on the heels of an investigation of a Divisional Police Officer who is alleged to own an illegal refinery in the State."
  },
  {
    "headline": "First Aid Flights Arrive in Tonga after Big Volcano Eruption",
    "summarized_story": "The first flights carrying fresh water and other aid to Tonga finally arrived Thursday after the Pacific nation’s main airport runway was cleared of ash left by a huge volcanic eruption.\nNew Zealand and Australia each sent military transport planes that were carrying water containers, kits for temporary shelters, generators, hygiene supplies and communications equipment.\nThe deliveries were dropped off without the military personnel coming in contact with people at the airport in Tonga.\nCommunications with Tonga remain limited after Saturday’s eruption and tsunami appeared to have broken the single fiber-optic cable that connects Tonga with the rest of the world.\nAnother New Zealand navy ship carrying 250,000 liters (66,000 gallons) of water is on its way."
  },
  {
    "headline": "UK Lifts Covid Restrictions, Says Omicron Wave ‘Has Peaked’",
    "summarized_story": "The government is no longer advising people to work from home, and compulsory face masks will be scrapped in secondary school classrooms starting Thursday.\nFace masks will no longer be legally required anywhere in England as of that day.\nJohnson said Wednesday that more than 90% of those over age 60 in the U.K. have had booster shots.\nOfficial figures showed that COVID-19 infections have dropped in most parts of the U.K. for the first time since early December.\nScotland and Wales, which set their own public health rules, have also announced similar easing of restrictions."
  },
  {
    "headline": "Fuel Subsidy Removal: I Will Get Clarity from Relevant Agencies on FG’s Position, Says Lai Mohammed",
    "summarized_story": "The Minister of Information and Culture, Alhaji Lai Mohammed, has said he would need to consult with relevant agencies to know the exact position of government on whether or not fuel subsidy would be stopped this year.\nWhen asked to clarify the issue since the 2022 budget had no subsidy provision beyond June, 2022, the minister said he needed to consult with the relevant government agencies to determine the exact position of the subsidy removal question.\n“As for the removal of fuel subsidy, I think you will give me time to consult with relevant departments and ministries and I will get back to you,” the minister.\nMany of us are very concerned with the recent agitations, protests, and many citizens were so concerned, our constituents across the country are very concerned that the federal government will remove the petroleum subsidy.\nAnd for us, as parliamentarians, as legislators representing the people of Nigeria, this must be of interest to us.”Deji Elumoye in Abuja"
  },
  {
    "headline": "Lagos Acquires High-Speed Intracity Trains for Red Line Rail Project",
    "summarized_story": "In line with his administration’s commitment to traffic management and transportation, Lagos State Governor, Mr. Babajide Sanwo-Olu, has acquired two sets of 10-car new Talgo 330kmph speed trains for the Lagos Red Line rail project.\nThe trains would be heading to Lagos, Nigeria for the Red Line, a 37 km track rail project started by Governor Babajide Sanwo-Olu.\nThe red line would have 11 stations and when completed would be the first operational metro system in West Africa, the statement explained.\nLagos State Government had last November announced traffic diversion at Kayode Ogunmokun road in Mushin for a period of six weeks in continuation of the first phase of the Lagos Red Line Rail Mass Transit project from Oyingbo to Agbado.\n“Coincidentally, the rail line is called Red Line and you can see they have given us the colour."
  }
]