[
  {
    "headline": "Nigerian Consulate in New York to issue 10-year validity passport",
    "summarized_story": "The Consulate-General of Nigeria in New York has announced that the Consulate will start the issuance of passports with 10-year validity to its nationals.\nThe Consul-General, Ambassador Lot Egopija, who disclosed this at a virtual 4th Town Hall for Nigerian nationals within the New York jurisdiction, said the headquarters (Federal Ministry of Foreign Affairs) had communicated the development to the Consulate.\n“Last month (January) we were informed that 10 years passport will be brought to New York.\nRead Also Nigerian consulate in New York suspends passport processingA Nigerian community leader, Francis James, who anchored the meeting, commended the Consul-General for his achievements.\nSome Nigerians also raised issues on passport issuance, timely collection of passports, renewal of passports, Emergency Travel Certificate, among others."
  },
  {
    "headline": "Russia-Ukraine crisis: 20 latest developments you should know",
    "summarized_story": "Here are the latest developments in Russia’s attack on Ukraine:Russia orders big pushRussia orders its troops to advance “from all directions” as it pounds the Ukrainian military with cruise missiles.\nBattle for KyivUkrainian soldiers beat back a Russian attack in the capital Kyiv only hours after Zelensky warns Moscow would attempt to take the city before dawn.\nCivilians against tanksCivilians – some of whom have never held a gun before – hunker down to battle with Russian tanks.\n198 civilians deadUkraine’s health minister says 198 civilians, including three children, have been killed and 1,115 wounded since Russia invaded.\nUS military aidThe United States says it is providing Ukraine with $350 million in additional military assistance to fight off the Russian invasion."
  },
  {
    "headline": "APC wins Imo bye-election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared Amajirionwu Blyden Okanni of the All Progressives Congress (APC) the winner of the just-concluded state assembly by-election into the Ngor-Okpala constituency of Imo State.\nHe said that the APC candidate of polled 9 248 to defeat Jeff Nwachukwu of the PDP who polled 7 071 votes.\nHe further stated that the number of total votes cast was 17 862 and the total number of valid votes was 17 280 with rejected votes being 582.\nThe parties included the Peoples Democratic Party (PDP), All Progressives Congress (APC), All Progressives Grand Alliance (APGA), the African Democratic Congress (ADC) and Labour Party (LP).\nOthers were the Young Progressives Party (YPP), Zenith Labour Party (ZLP), National Rescue Movement (NRM), New Nigeria Peoples Party (NNPP), Allied People’s Movement (APM), Action Democratic Party (ADP) and the Social Democratic Party (SDP)."
  },
  {
    "headline": "DELTA 2023:I am under pressure to succeed Okowa — Edevbie",
    "summarized_story": "Edevbie was Delta State Commissioner for Finance three times (1999-2003, 2003-2005 and 2015-2019) and Chief of Staff to the Governor (2019-2021).\nIn this interview, Edevbie speaks on why he may be the one to succeed Governor Ifeanyi Okowa of Delta State.\nYou are a frontline aspirant of the PDP for the 2023 governorship ticket in Delta State.\nIn Delta Central where I am from, I am old enough to know that it was once the industrial hub of Delta State.\nFirst of all, you must understand that the gas resources we have here do not belong to Delta State."
  },
  {
    "headline": "2023: Presidential aspirant, Ayom, urges APC to zone Presidency to Middle Belt",
    "summarized_story": "…Congratulates Buhari on assent to Electoral ActBy Dirisu YakubuPresidential aspirant on the platform of the All Progressives Congress, APC, Moses Ayom has called on the leadership of the party to cede its 2023 Presidential ticket to the Middle Belt region.\n“This will also prove to Nigerians that Buhari does not just preach justice, equity and fairness but practices it.\n“Nigerians will recall that since independence, no Middle Belter has emerged as democratically elected President nor Vice President,” he added.\nAyom noted that the Middle Belt remains an important of the country that must not be taken for granted, saying, “We in the Middle Belt are tired of being mere passengers and on lookers in this vehicle called Nigeria.\nThe impression is being created that political power at the highest echelon is a ping pong game between the far North and the South while the Middle Belt is a mere net to be used in scoring points.”"
  },
  {
    "headline": "2023: Nigerian businessmen to procure APC Presidential Form for Osinbajo",
    "summarized_story": "At an inaugural dinner Wednesday night in Abuja, the Businessmen for Osinbajo BFO said Nigeria as presently constituted does not need a trial and error president.\nAs a professor of law, the vice president knows what the law says.\n“Until now, the business community, with all its great contributions, has only remained on the fringes of political relevance.\n“As the right leader for the business community, he has demonstrated passion for strengthening the economy by improving the ease of doing business at all levels”.\n“We have seen, from his esteemed role as Vice President, in the administration of President Muhammadu Buhari, how he has strongly stood for the business community."
  },
  {
    "headline": "2023: Bury your ambitions, support Ndigbo, groups tell Atiku, Tinubu",
    "summarized_story": "This was as the groups hailed the emergence of several Igbo sons on the political scene, seeking to take a shot at the presidency in 2023.\n“We are further motivated and delighted that our vigorous campaign for Nigeria’s president of South East Extraction has inspired some eminent sons of South East divide to signify interest to contest for the office of the President of Nigeria in 2023.\nThey also urged the All Progressives Congress APC and the Peoples Democratic Party PDP go some their presidnetial ticket to the South East.\nThey said; “Nigeria is now at crossroads and needs a strong leader who has integrity, competence, national visibility and acceptability.\n“We will not end without advising and appealing to his Excellency Alhaji Atiku Abubakar to forget his perennial presidential ambition and support the South East that have supported him."
  },
  {
    "headline": "2023: Parties must do more to improve voters turnout – Toyo",
    "summarized_story": "Nigeria’s former ambassador to Ethiopia and the African Union, Nkoyo Toyo, has called on Nigerian political parties to work more on the electorate to improve their turnout at the general election next year.\nThe stalwart of the Peoples Democratic Party and Cross River State governorship hopeful in 2023 spoke after the bye-elections result in the state on Saturday.\nAmbassador Toyo revealed that the outcome of the election results is a reflection of the evolution of politics in the state.\nToyo also expressed confidence in the outcome of the bye-elections in the northern and southern districts of the state which ended yesterday.\nShe said parties should enlighten political stakeholders on efforts needed to emerge victorious come 2023."
  },
  {
    "headline": "NCC sets pace in FG’s indigenous tech development policy",
    "summarized_story": "The Nigerian Communications Commission (NCC) said it has given concrete expression to the Federal Government’s drive to promote indigenous innovative technologies in Nigeria’s telecommunication sector.\nHe tasked the mobile network operators (MNOs) to work with NCC to support indigenous technology development to solve national challenges in future.\nThe Minister commended the Commission’s Board and Management for facilitating the delivery of the lofty policy targets contained in the National Policy for the Promotion of Indigenous Content (NPPIC) 2021.\nHe also thanked the recipients of the Commission’s grants for the display of already developed prototypes for the knowledge of the industry stakeholders.\nThe EVC reiterated the significance of building the indigenous technological capacities of Nigerians through partnerships with relevant stakeholders."
  },
  {
    "headline": "Security votes misuse: Buhari sued for failing to probe serving, ex-governors",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has sued President Muhammadu Buhari over the government’s “failure” to probe security votes’ “mismanagement” by serving and former governors.\nThe rights group said pervasive tendency by public officers to use security votes as their personal entitlement was antithetical to the constitution and international standards.\nSERAP made reference to a Transparency International (TI) report which found that a chunk of security votes was spent on political activities, mismanaged or stolen.\n“It is estimated that security votes add up to over N241.2billion every year.\nOn top of appropriated security votes, state governments also receive millions of dollars yearly as international security assistance."
  },
  {
    "headline": "‘Putin is Smart’ – Donald Trump blames NATO, Biden for Ukraine war",
    "summarized_story": "Donald Trump has blamed US President, Joe Biden and North Atlantic Treaty Organization, NATO, over the Russia’s invasion of Ukraine.\nTrump speaking at the annual Conservative Political Action Conference in Orlando, Florida, blamed Putin’s invasion on Biden’s “weakness”.\nHe hailed President Vladimir Putin’s intellect, describing him as smart and not the real problem.\n“As everyone understands, this horrific disaster would never have happened if our election was not rigged,” Trump said.\nTrump blasted NATO for hitting Russia with sanctions rather than hitting them psychologically."
  },
  {
    "headline": "‘This one na Yahoo boy’ – Lagos Police CP’s team detains NYSC member, demands bribe",
    "summarized_story": "The Police in Lagos State arrested Olamilekan Daniel, a National Youths Service Corps (NYSC) member, Thursday night.\nA police team picked the intern after complaining about his hairstyle, labelling him a ‘Yahoo boy’ (internet fraudster).\nThe personnel have been identified as CP Strike Team, Anti-Cultism and Anti-Kidnapping Unit (Ikorodu annex).\n“Daniel is a corps member serving in Lagos, his family are based outside the State.\nThe source said an officer called the Strike Team to convey Alabi’s order for Daniel’s immediate release."
  },
  {
    "headline": "PDP’s Agah wins Jos North Bassa bye-election",
    "summarized_story": "Hon.Musa Agah of the People’s Democratic Party (PDP) has been declared winner of the Jos North/Bassa Federal constituency by-election by the Independent National Electoral Commission (INEC) on Sunday.\nThe returning officer Dr Oyeyinka Oyerinda announced Agah scored 40, 343 to beat the PRP candidate Hon.\nAbbey Aku of the ruling All Progresives Congress (APC) polled 26,111 votes.\nSenator Istifanus Gyang of Plateau North congratulated Agah for the victory.\nHe said the victory signals good things to come."
  },
  {
    "headline": "Ohanaeze raises the alarm over killings in Igboland",
    "summarized_story": "The apex Igbo socio-cultural organization, Ohanaeze Ndigbo, has raised the alarm over incessant attacks and killings in the region by gunmenThe group declared that the recent Enugu killing and the ones ongoing in Anambra State are giving it sleepless nights, adding that “enough is enough “.\nThe group spoke through Ohanaeze Ndigbo Youth Council Worldwide, OYC,led by Mazi Okwu Nnabuike.\nGunmen have killed tens of people in Enugu, Imo and Anambra States in the last one week.\nHowever the Ohanaeze Youth leader said the killings were totally condemnable.\n“We have had enough bloodshed in Igbo States and we say that “enough is enough,” he said."
  },
  {
    "headline": "Cleric: Sit-at-home won’t end in South East until…",
    "summarized_story": "The Monday sit-at-home will not stop in Igbo land until leader of the indigenous people of Biafra (IPOB) Nnamdi Kanu is released.\nSo it has been revealed to me.”The Bishop said his spirit had continually remained pained each time sit-at-home order was declared in the South East.\n“Federal Government is not considering the plight of the poor masses in the South East.\n“Nothing is working again in the South East.\nThe people of South East are made to suffer extraordinary hardship whereas Ndigbo are known for enterprenuership, ” the Cleric said."
  },
  {
    "headline": "APC, PDP share wins in C’River by-elections",
    "summarized_story": "The All Progressive Congress and the Peoples Democratic Party (PDP) secured victories in Cross Rivers by-elections on Saturday.\nCandidate of the APC for the Ogoja /Yala Federal Constituency, Mr. Jude Ngaji won with 22,778 votes ahead candidate of the PDP, Mr. Mike Usibe who scored 20,590.\nIn the contest for Akpabuyo State Constituency, the candidate for the Peoples Democratic Party(PDP) Ekeng Effiom Edet won with 5866 over the APC candidate who scored 5363.\nAnnouncing the result for the Ogoja/Yala Federal Constituency, the returning officer, Dr. Edor John Edor said number of registered voters the federal constituency was 193,618 out of which 45,877 was accredited.\nThe total vote cast was 45,356 out of which 43828 were valid and 1,528 rejected."
  },
  {
    "headline": "FG, ECOWAS, others to reach 50 million women financially",
    "summarized_story": "The Federal Government in collaboration with the Economic Community for West African States (ECOWAS) is determined to reach 50 million women financially.\nThe FG, through the Director, Economic Development, Federal Ministry of Women Affairs, Alhaji Idris Muhammed, said the project is through the 50 Million African Women Speak Platform Project (50MAWSP).\nMuhammed, who was represented by the Assistant Director, Social Welfare of the ministry, Emilia Oti, said, “I am delighted to inform you of the achievements of the Federal Ministry of Women Affairs through the 50 Million African Women Speak Platform Project (50MAWSP).\nIn his remark, the Director, Monitoring and Evaluation, Federal Ministry of Finance, Budget and National Planning, Dr Zakari Lawal, said FG has prioritised women empowerment in its Medium-Term National Development Plan.\nIn line with that, the government put in place the Medium-Term National Development Plan which covers its operations within the period of 2021-2025.”"
  },
  {
    "headline": "Gunmen on rampage in Niger communities, kill eight, injure two",
    "summarized_story": "From John Adams, MinnaGunmen numbering well over 100 on Saturday invaded some communities in Lavun local government area of Niger state, killing eight people and injured several others.\nThe attack which last all through to Sunday morning, saw the gunmen overran about eight communities, leaving over 5,000 Displaced.\nCommunities that were ransacked by the gunmen includes Egbako, Ndaruka, Ebbo, Ndagbegi, Tshogi, Gogata and Ndakogitu, all in Lavun local government.\nAccording to source close one of the communities, the gunmen were said to have Killed one person each at Ebbo, Tsonfadagabi, Tsogi and Kanko.\nAccording to another source close to Akere community, the gunmen are currently stranded at the point of crossing with the cattle as the animals refused to enter river."
  },
  {
    "headline": "NCC alerts of malware that steals banking app login details on Android devices",
    "summarized_story": "From Adanna Nnamani, AbujaThe Nigerian Communications Commission (NCC) has warned the public of a newly-hatched malicious software that steals users’ banking app login credentials on Android devices.\nIn reality, however, the app is only a means by which the Xenomorph Trojan could be propagated easily and efficiently.\n‘The CSIRT said the malware also steals victims’ banking credentials by overlaying fake login pages on top of legitimate ones.\nThe Fast Cleaner app has now been removed from the Play Store but not before it garnered 50,000+ downloads,” the CSIRT security advisory asserted,’ NCC said.\nConsumers and other stakeholders are also instructed to always update banking applications to their most recent versions."
  },
  {
    "headline": "Bandits kill 8, abduct 57 in Kaduna",
    "summarized_story": "The statement noted that three other people escaped with mild wounds, while, 57 people were equally abducted.\n‘Today(Saturday) around 10:00 am a final year student of Science Secondary School Birnin-Gwari escaped with bullet wounds on his shoulder while on his way for JAMB -UMTE registration in Kaduna.\n‘The dreadful armed bandits spray bullets on the vehicle conveying the student and others at Manini village after Kuriga along Birnin-Gwari Kaduna Highway.\n‘The student is awaiting surgery for the removal of the bullet on his shoulder at Jibrin Maigwari General Hospital in Birnin-Gwari.\n‘Similarly, armed bandits killed seven people at Unguwar Bula, Unguwar Dafillo and Ijinga in Randagi district, Birnin-Gwari on Saturday."
  },
  {
    "headline": "2023 presidency : Atiku dares youths to contest with him",
    "summarized_story": "From Laide Raheem, AbeokutaFormer Vice President Atiku Abubakar yesterday paid a visit to his former boss, ex-President Olusegun Obasanjo.\nAtiku who arrived at the Pent House residence of Obasanjo inside the Olusegun Obasanjo Presidential Library (OOPL) Abeokuta, around 10:00a.m, went straight into a closed door meeting with the former president.\nAsked if he was confident of getting the presidential ticket of the Peoples Democratic Party (PDP), Atiku stated that he had won the ticket before, noting that he was not afraid to throw his hat into the ring again.\nThe 2019 presidential candidate of the PDP also visited the palace of the Alake and paramount ruler of Egbaland, Oba Adedotun Aremu Gbadebo.\nAddressing the monarch and the chiefs, Atiku, who was silent on his intention to vie for presidency, disclosed that he would declare his presidential aspiration at the right time."
  },
  {
    "headline": "Over 14 feared killed in Anambra cult war",
    "summarized_story": "While a source pegged the number at 14, another source from the area said they were 16 or more.\n“The guy they were doing his burial today is called Ozo.\nThey killed him in Amansea on 30th January this year.\nNormally, the town union leadership was supposed to have been informed so that we prepare for unforeseen events.\nThe Police Public Relations Officer in the state, DSP Tochukwu Ikenga, also confirmed the ugly incident, saying that it was a cult related killing."
  },
  {
    "headline": "Primaries Now April 4 to June 3 Ahead of Presidential Poll of Feb 25, 2023",
    "summarized_story": "Under the new timetable for the 2023 general election, INEC has shifted the presidential and National Assembly elections from February 18 to February 25, 2023, while the governorship elections will hold on March 11, 2023.\n“Accordingly, the presidential and National Assembly elections will now hold on Saturday, February 25, 2023, while the governorship and state Houses of Assembly elections will hold two weeks later on Saturday, March 11, 2023.\nWith this adjustment, the 2023 general election is now 363 days away,” he explained.\nThen, he said, the Act was repealed and re-enacted as the Electoral Act 2002 which was in turn repealed and re-enacted in 2006, 2010 and now we have the 2022 Electoral Act.\nHe said the 2023 general election was initially scheduled to commence on February 18, 2023, with the presidential and National Assembly elections, followed by the governorship and state Houses of Assembly elections on March 4, 2023."
  },
  {
    "headline": "In Line with CBN’s Directive, Banks Expose Clients with Suspicious Dollar Transactions",
    "summarized_story": "These customers can beat regulations by presenting false travel documents, prompting the apex bank to direct banks to notify their customers of an impending crackdown on saboteurs in the forex market.\nHowever, a report by Bloomberg yesterday revealed that some banks have begun to implement the CBN’s directives by publishing the names of clients found to have filed suspicious claims for forex transactions on their websites last week.\nThe list of banks that complied also included the United Bank for Africa Plc.\nThe apex bank had directed banks to identify such customers and ensure they refund the hard currency.\n“As reported in the February 11, 2022 edition of our CWR, we observed that money moved out of T-bills securities to Local Money Market Securities (LMMS), especially bank placements,” the report stated."
  },
  {
    "headline": "Purported Endorsement of Consensus Chairman Divides APC Governors",
    "summarized_story": "Chuks Okocha in AbujaThe purported endorsement of a former Governor of Nasarawa State, Senator Abdullahi Adamu, as the consensus National Chairman of the All Progressives Congress (APC) by President Muhammadu Buhari has further divided the governors elected on the platform of the ruling party, THISDAY has learnt.\nSources privy to the meeting, who spoke to THISDAY, said that the meeting had a one-item agenda, which explained its brief nature.\nThe source told THISDAY that three governors from the North-west, one governor from the South-west, another governor from the South-east and a minister from the South-south were behind the purported adoption of a consensus candidate.\nBoth Al-Makura and Musa had in newspaper advertorial rejected the purported nomination of Adamu.\nEfforts to get the Secretary of the National Caretaker Committee of APC, Senator John Akpanudoedehe to clarify the adoption of Adamu as a consensus national chairman proved abortive as he did not pick his calls."
  },
  {
    "headline": "Seplat Explains Acquisition of ExxonMobil Assets",
    "summarized_story": "He added that Seplat already set up a subsidiary called Seplat Energy offshore limited that would be acquiring the business of MPNU.\nHe noted that Seplat would continue the “excellent performance” of the Mobil business, adding that the new entity has a slightly different plan in terms of cost-efficiency.\nAnd again over the last 10 years, we’ve seen a reduction in costs and losses in Seplat.\nWe have pillar one, which is our upstream oil and gas, business and pillar two business is the midstream gas business, going down into gas power.\n“ We made a decision before to look at the power opportunities and then our new energy, the bridge into renewable energy."
  },
  {
    "headline": "Breaking: INEC Changes 2023 Election Dates, Releases Adjusted Timetable",
    "summarized_story": "* Presidential and National Assembly elections hold Feb 25* Says all 774 local govt areas have telecom coverage* Urges political parties to adhere strictly to new guidelinesChuks Okocha in AbujaWith the signing of the new electoral law by President Muhammadu Buhari Friday, the Independent National Electoral Commission (INEC), Saturday released new dates and time table for the presidential and general election in 2023.\nAddressing a press conference Saturday, the INEC chaìrman, Prof. Mahmood Yakubu, said that the presidential election will now hold on February 25 next year instead of the earlier announced date of February 18.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Government Afraid I'll Soon Declare For Presidency, To Charge Me Afresh For Treasonable Felony —Sowore",
    "summarized_story": "Human rights activist, Omoyele Sowore on Sunday said the Nigerian government will on Tuesday charge him afresh for treasonable felony.\nSowore said on Monday, he would likely face charges over \"criminal defamation of one of Nigeria's biggest crooks, Ned Nwoko\".\nOmoyele SoworeAccording to the activist, the fresh charges are being filed by the Muhammadu Buhari-led government over its fear that he will soon declare to run for President.\n\"On Monday I will likely face charges over 'Criminal Defamation of one of Nigeria’s biggest crooks, Ned Nwoko' and on March 1st the Nigerian govt will charge me afresh for 'Treasonable Felony,'\" he said on Sunday.\nSee Also Breaking News BREAKING: Nigerian Security Operatives Again Arrest Human Rights Activist, Omoyele SoworeHe was taken to the disbanded Special Anti-Robbery Squad (SARS) unit, otherwise known as Abattoir, located at Guzape."
  },
  {
    "headline": "Buhari Government Afraid I'll Soon Declare For Presidency, To Charge Me Afresh For Treasonable Felony —Sowore",
    "summarized_story": "Human rights activist, Omoyele Sowore on Sunday said the Nigerian government will on Tuesday charge him afresh for treasonable felony.\nSowore said on Monday, he would likely face charges over \"criminal defamation of one of Nigeria's biggest crooks, Ned Nwoko\".\nOmoyele SoworeAccording to the activist, the fresh charges are being filed by the Muhammadu Buhari-led government over its fear that he will soon declare to run for President.\n\"On Monday I will likely face charges over 'Criminal Defamation of one of Nigeria’s biggest crooks, Ned Nwoko' and on March 1st the Nigerian govt will charge me afresh for 'Treasonable Felony,'\" he said on Sunday.\nSee Also Breaking News BREAKING: Nigerian Security Operatives Again Arrest Human Rights Activist, Omoyele SoworeHe was taken to the disbanded Special Anti-Robbery Squad (SARS) unit, otherwise known as Abattoir, located at Guzape."
  },
  {
    "headline": "BREAKING: Boko Haram Terrorists Currently Attacking Damboa-Biu Road In Borno To Abduct Commuters",
    "summarized_story": "Boko Haram insurgents are currently attacking Damboa-Biu Road in Borno Road in a bid to abduct some commuters, SaharaReporters has learnt.\n“Boko Haram/ISWAP have staged a snapshot road block along Damboa-Bu Road right now.\nRecently, it appointed Wali Sani Shuwaram, a 45-year-old as the new leader of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno and Yobe states."
  },
  {
    "headline": "BREAKING: Boko Haram Terrorists Currently Attacking Damboa-Biu Road In Borno To Abduct Commuters",
    "summarized_story": "Boko Haram insurgents are currently attacking Damboa-Biu Road in Borno Road in a bid to abduct some commuters, SaharaReporters has learnt.\n“Boko Haram/ISWAP have staged a snapshot road block along Damboa-Bu Road right now.\nRecently, it appointed Wali Sani Shuwaram, a 45-year-old as the new leader of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno and Yobe states."
  },
  {
    "headline": "Russian Delegates Arrive In Belarus For Peace Talks, Ukraine Rejects Choice, Lists Alternatives",
    "summarized_story": "President Volodymyr Zelenskyy says Ukraine is ready for peace talks with Russia but not in neighbouring Belarus, an ally of Moscow which used it as a staging ground for its multipronged invasion.\nZelenskyy gave Russia a list of other options where the talks could hold, Al Jazeera reports.\nHe said other locations were also possible but stressed Ukraine does not accept Russia’s selection of Belarus.\nEarlier, the Kremlin said a Russian delegation had arrived in the Belarusian city of Gomel for talks and was waiting for the Ukrainian officials.\nBut Zelenskyy’s adviser Mykhailo Podolyak said Ukraine wants only “real” negotiations, calling Russia’s decision to send the delegation to Belarus for talks “propaganda”."
  },
  {
    "headline": "Boko Haram kills eight, razes village in Borno",
    "summarized_story": "At least eight persons were killed in attacks by Islamic State in West Africa Province (ISWAP) insurgents in Biu LGA of Borno state.\nTheCable learnt the insurgents invaded Mandaragirau and Ghuma villages in the LGA on Saturday night, killed eight residents and wounded a number of persons.\nMilitary sources said troops had thwarted an attack by ISWAP terrorists along Mandaragarau road in the early hours of Saturday.\nAdvertisementBut the troops stormed the scene and tackled the insurgents.\nSources said the insurgents attempted to attack a military formation along Bama Road, when they met a stiff resilience by the troops in the location."
  },
  {
    "headline": "Boko Haram kills eight, razes village in Borno",
    "summarized_story": "At least eight persons were killed in attacks by Islamic State in West Africa Province (ISWAP) insurgents in Biu LGA of Borno state.\nTheCable learnt the insurgents invaded Mandaragirau and Ghuma villages in the LGA on Saturday night, killed eight residents and wounded a number of persons.\nMilitary sources said troops had thwarted an attack by ISWAP terrorists along Mandaragarau road in the early hours of Saturday.\nAdvertisementBut the troops stormed the scene and tackled the insurgents.\nSources said the insurgents attempted to attack a military formation along Bama Road, when they met a stiff resilience by the troops in the location."
  },
  {
    "headline": "Osita Chidoka: Jonathan shouldn't be lured into presidential race -- he'll run if he wants to",
    "summarized_story": "Osita Chidoka, former minister of aviation, says former President Goodluck Jonathan should not be lured into the race for the presidency in 2023.\nSpeaking on Arise Television on Saturday, Chidoka said if Jonathan wants to run for president, he will do so.\nThe Peoples Democratic Party (PDP) member said the former president will determine his own political future.\n“As for President Goodluck Jonathan, I have not discussed ‘GEJ is coming’ with him.\n“I don’t think former President Jonathan would be in that position where he is being called to come and be president."
  },
  {
    "headline": "Osita Chidoka: Jonathan shouldn't be lured into presidential race -- he'll run if he wants to",
    "summarized_story": "Osita Chidoka, former minister of aviation, says former President Goodluck Jonathan should not be lured into the race for the presidency in 2023.\nSpeaking on Arise Television on Saturday, Chidoka said if Jonathan wants to run for president, he will do so.\nThe Peoples Democratic Party (PDP) member said the former president will determine his own political future.\n“As for President Goodluck Jonathan, I have not discussed ‘GEJ is coming’ with him.\n“I don’t think former President Jonathan would be in that position where he is being called to come and be president."
  },
  {
    "headline": "Gunmen raid Kaduna communities, 'kill seven, abduct 57'",
    "summarized_story": "At least seven people have been reportedly killed and 57 abducted following separate attacks by bandits in Birnin-Gwari LGA of Kaduna state.\nThe assailants reportedly attacked a vehicle at Kuriga, along the Birnin Gwari-Kaduna highway on Saturday.\n“The dreadful armed bandits spray bullets on the vehicle conveying the student and others at Manini village after Kuriga along Birnin-Gwari Kaduna Highway.\n“The student is awaiting surgery for the removal of the bullet on his shoulder at Jibrin Maigwari General Hospital in Birnin-Gwari.\nAdvertisement“Similarly, armed bandits killed seven people at Unguwar Bula, Unguwar Dafillo and Ijinga in Randagi district, Birnin-Gwari on Saturday."
  },
  {
    "headline": "Development finance institutions are looking to Africa’s digital frontier for impact and returns",
    "summarized_story": "Development finance institutions have long funded traditional finance and infrastructure projects in Africa; now they’re increasingly backing Africa’s digital future.\nIt can mean more opportunities unlocked as DFI money de-risks investment in high risk but critical business models.\nAfrica’s telecoms infrastructure, the backbone of its digital growth today, is an example of DFI money doing good while making returns.\nIn a perfect world, DFI and MFB activity in Africa’s fairly young venture space should be led (not nominally) by African development finance institutions.\nThat should help these institutions gain more financial clout and firepower to direct African technology to the areas of greatest need."
  },
  {
    "headline": "Payroll tech heats up in Africa, on the heels of a booming fintech sector",
    "summarized_story": "Amid the fintech boom, new frontiers are being explored by African entrepreneurs in the sector, one of which is payroll and corporate benefits management.\nThrough web portals or mobile self-service apps, companies can track time, process a locally compliant payroll, and pay their employees.\nZuberi is a Ghana-based earned wage access platform.\nIt’s easy to see why investors are backing payroll fintechs or broadly tech startups digitising the administrative stack for companies.\nAnd to increase chances of repayment, Bento Africa requires employees that apply for its loans to take unemployment and health insurance covers."
  },
  {
    "headline": "Kenyan influencers were paid $10 to $15 to discredit controversial bills on Twitter",
    "summarized_story": "The bills are the Reproductive Healthcare Bill and the Assisted Reproductive Technology Bill, also known as the Surrogacy Bill.\nThe Mozilla report reveals that CitizenGO paid the owner of these accounts or “disinformation influencers” around $10 to $15 to make tailored tweets that discredited the bills.\nIn response to this report, Twitter has permanently suspended 240 accounts connected to this disinformation campaign for violating its platform manipulation and spam policy.\nHeightening Twitter Trend’s criticismTwitter’s Trends section helps users identify the most discussed topics on the platform and also help them find popular information or discussion.\nLast year, a Buzzfeed investigation revealed that Nigerian influencers paid to tweet in a coordinated manner successfully manipulated Twitter Trends in order to sway public opinion and court judgement in favour of Venezuelan politician, Alex Saab."
  },
  {
    "headline": "Meet the 19 year old Nigerian building his own blockchain empire",
    "summarized_story": "Born to an engineer father and a school teacher mother, Njoku was a mathematics whiz.\nThis, his engineer father could live with.\nIn April 2020, a month after he started working at Kwivar, he got another offer as a blockchain developer at Project Hydro, a blockchain company based in the British Virgin Islands.\nAt Xend Finance, he had to step in when the lead blockchain engineer was unavailable, and that accelerated his blockchain knowledge.\nNjoku isn’t Zukerberg and may never be, but he’s building his own empire in the blockchain world."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "What Flutterwave’s fintech as a service means for the African tech ecosystem",
    "summarized_story": "In addition to its payment infrastructure, the startup unveiled the addition of Apple and Google Pay, Grow (its SME financing service), and fintech as a service (FaaS).\nAkurateco, a Dutch software provider, defines fintech as a service as offering financial technology as a service.\nAdvertisementFlutterwave founder and CEO, Olugbenga AgboolaAfrican API fintech startups have gained more attention in recent years, but they often focus on a few services.\nBy enabling other companies to integrate financial services to existing offerings, they allow the businesses to expand already existing offers.\nOutsourcing the provision of their fintech services could, therefore, leave startups at the mercy of the service provider as they often lose control over the quality and security of their fintech service."
  },
  {
    "headline": "Can Russia-Ukraine tensions spark World War III?",
    "summarized_story": "While tensions between Russia and Ukraine, a former Soviet republic, had existed for some time, the situation began to spiral out of control in early 2021.\nAdvertisementUkrainian president, Volodymyr Zelenskyy, urged US president, Joe Biden, to allow Ukraine to join NATO in January of last year.\nSadly, 14,000 people have died in Ukraine since 2014; I’m sure many more will perish if caution is not exercised.\nPlus, I think this conflict has the potential to spark World War III.\nAccording to CoinGlass data, $462.91 million in cryptocurrency has been ‘rekt’ – financially lost – since two nights ago, Wednesday, February 23, 2022."
  },
  {
    "headline": "Space Universe Africa launches new technology-enabled R&D lab to power next layers of human advancements from Africa",
    "summarized_story": "Also, a significant product of Space Universe Africa known as the School of Ground Truth embodies this principle.\nSpace Universe Africa is solving problems on many fronts, and here are some of their products that are doing just that.\nWith Awamaridi, Space Universe Africa plans to take a bold step into space and chart the unknown to make life better for humans while creating a healthy environment.\nCurrently serving companies across verticals like media and gaming, the company is furthering its vision to build the continent of our dreams through its innovative Space Universe Africa R&D lab.\nTo learn more about this lab and what Space Universe Africa represents, visit https://spaceuniverse.africa/."
  },
  {
    "headline": "Petrol to noodles: How Russia-Ukraine crisis affects Nigeria",
    "summarized_story": "More than any other country, Nigeria relies on crude oil for most of its foreign exchange and two-third of government revenue.\nFindings show Nigeria spent a total of N270.83 billion to cater for the cost of petroleum shortfall in December 2021.\nIn Nigeria, wheat is one of the most consumed grains in the world for the production of noodles, pasta, cakes and other confectioneries.\nAccording to Nigeria’s data agency, the National Bureau of Statistics (NBS), Nigeria imported N898.2 billion worth of wheat in nine months that ended September 2021.\nThe top origins of wheat into Nigeria in 2021 included USA, N194.2 billion; Canada, N136.4 billion, Russia, N124 billion, Lithuania, N122.3 billion, and Latvia, N115.9 billion."
  },
  {
    "headline": "Petrol to noodles: How Russia-Ukraine crisis affects Nigeria",
    "summarized_story": "More than any other country, Nigeria relies on crude oil for most of its foreign exchange and two-third of government revenue.\nFindings show Nigeria spent a total of N270.83 billion to cater for the cost of petroleum shortfall in December 2021.\nIn Nigeria, wheat is one of the most consumed grains in the world for the production of noodles, pasta, cakes and other confectioneries.\nAccording to Nigeria’s data agency, the National Bureau of Statistics (NBS), Nigeria imported N898.2 billion worth of wheat in nine months that ended September 2021.\nThe top origins of wheat into Nigeria in 2021 included USA, N194.2 billion; Canada, N136.4 billion, Russia, N124 billion, Lithuania, N122.3 billion, and Latvia, N115.9 billion."
  },
  {
    "headline": "Russia – Ukraine conflict: What you need to know",
    "summarized_story": "Russia – Ukraine conflict: What you need to knowAfter President Vladimir Putin authorised a demilitarisation operation in Ukraine, Russian forces targeted locations across the country, sparking threats of further “serious sanctions” and sending global markets falling.\nAccording to Bloomberg, Ukraine’s border guard reported shelling from five different directions, including Crimea in the south and Belarus in the north.\nCNN reported that Belarus joined Russia in the invasion of Ukraine and that both Russian and Belarusian troops invaded Ukraine from staging grounds in Belarus.\nRussia vs Ukraine conflict and the marketsThe Russian rubles is currently in shambles.\nNigeria also needs the oil price to rise and, in the worst-case scenario, remain stable at any price above its revised budget benchmark of $62 per barrel in order to carry out its 2022 budget."
  },
  {
    "headline": "High hopes as Obaseki sends Disability Bill to EDHA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – After several years of advocacy by disability community in Edo State for the domestication of Disability act, governor Godwin Obaseki on Wednesday sent Disability Rights Bill to the state house of assembly.\nOther Bills sent are Electricity Commission and Agency Bill, Criminal Law Bill of Edo State, Edo Property Development Agency (EDPA) Bill, and the Justice Reform Bill.\nObaseki had jettisoned a similar Bill sent to the house by previous administration, citing inconsistencies in the documents.\n“Sir, the disability community in Edo State is super excited about the prospect of having a law that will safeguard their interests and unlock their potentials.\n“While hoping that the 7th Edo State House of Assembly will give expeditious consideration and passage to the executive Bill before them."
  },
  {
    "headline": "Edo awards, funds micro-infrastructure projects in 16 communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has approved the execution of micro-infrastructure projects in 16 communities drawn from 11 local councils in the state.\nThe projects are to be financed by the state through the Nigeria COVID-19 Action Recovery and Economic Stimulus Programme (NG CARES) in Edo State.\nAlufohai said Edo State is delighted to be rendering support to communities and vulnerable groups in the wake of the adverse impact of the COVID-19 pandemic, which is now in its third wave.\n“The NG-CARES domesticated in Edo State and codenamed Edo-CARES Programme is an Emergency Relief World Bank Funded Programme set up to ameliorate the adverse effect of COVID-19 pandemic in Nigeria.\nHe said, “This is a great experience; it has never happened like this before in Edo State."
  },
  {
    "headline": "Edo varsity VC, Usen Poly rector, other stakeholders hail Obaseki on new education policy – Nigerian Observer",
    "summarized_story": "Speaking to journalists at the weekend, Prof. Falodun commended the state governor for the move of formulating a new education policy.\nAccording to him, “With the new policy, tertiary institutions across the state have been given the mandate by Governor Obaseki to restructure and reposition their curriculum in line with the expanded EdoBEST 2.0.\nThe document will also help tertiary education in the state to come out with dynamic policies,” the rector added.\nOn his part, Edo Varsity VC hailed Governor Obaseki for the laudable initiative, noting that the new policy will transform the education system.\nIts impact on the state’s education system cannot be overemphasized.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Gunmen Abduct another Plateau Monarch – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestJOS – Mangu Local Government Area of Plateau State was yesterday thrown into confusion following the abduction of a traditional ruler, Diket Gupiya, by gunmen.\nPushit District, where Gupiya is the traditional ruler is the country home of the State Deputy Governor, Sonny Tyoden.\nGupiya’s abduction is coming barely two months after Charles Mato, the Sum Pyem, and traditional ruler in the neighbouring Gindiri District was kidnapped and later released after ransom was reportedly paid.\nThe Nigerian OBSERVER gathered that the Monarch was abducted at his palace in Pushit on Thursday night.\nAccording to the report, the district head was in his palace watching television around 9pm when the gunmen attacked his house and whisked him away to an unknown destination."
  },
  {
    "headline": "APGA rejects Enugu LG election results, accuses PDP of massive rigging",
    "summarized_story": "TUESDAY OLOKODEThe Enugu State chapter of the All Progressive Grand Alliance (APGA), has rejected the outcome of last week’s local government election held in the state in which the People’s Democratic Party (PDP) won all contested seats.\nAPGA which rejected the outcome of the election in a statement signed by its state chairman, Ndubuisi Enechionyia and secretary, Hon.\nDickson Ani and issued after its extraordinary meeting held on 26th February 2022, accused the Enugu State Independent Electoral Commission (ENSIEC) of conniving with the state authorities to manipulate the polls.\n“The party decries the activities and actions of the Mr Ajogwu led Enugu State Independent Electoral Commission which reneged on their statutory oaths and betrayed the mandate reposed on them.\n“Once again, the state leadership of APGA commends our candidates and supporters for embarking on the journey of re-writing the political history of Enugu State."
  },
  {
    "headline": "Dele Momodu visits Gbongan, mother’s hometown to kickstart presidential campaign",
    "summarized_story": "On his arrival in the town, Momodu visited the graveside of his mother and prayed for the repose of her soul.\nA large number of people ( comprising of residents and supporters) thronged the palace of the Olufi to receive Dele Momodu when he went to the palace to pay homage to the king.\nSpeaking at the palace, Momodu said he joined the main opposition party, the People’s Democratic Party so as to play an active role in saving the nation from the unpleasant grip of the All Progressives Congress (APC).\nI have also worked with President Muhammad Buhari before things started turning upside down,” he saidSpeaking, the Olufi of Gbongan showered encomium on the presidential aspirant, promising to support his presidential ambition.\nHowever, Momodu recently registered his commitment to the PDP as well as his determination to stick to his ambition through to the end."
  },
  {
    "headline": "Gunmen invade burial event in Anambra, kill 16, injure scores",
    "summarized_story": "There was mayhem at Ebenebe, Awka North Local Government Area of Anambra State on Saturday as gunmen suspected to be cultists stormed the venue of a burial ceremony and opened fire on mourners, killing at least 16 of them while many others were injured.\nThe gunmen were also said to have seized the corpse of 34-year-old Ozor Chibuike Joseph Chukwuka being prepared for burial and shot it several times over before driving away.\nThe Anambra State Police command confirmed the incident to PUNCH, stating that it was a case of cult rivalry.\nA burial was going on when some people suspected to be cultists invaded the area and started shooting.\n“For now, the Commissioner of Police, CP Echeng Echeng, has despatched tactical squads comprising of various units to the area to maintain calm.”Facebook Notice for EU!"
  },
  {
    "headline": "Unknown assailants set Elliot Uko’s poultry farm ablaze in Enugu",
    "summarized_story": "A poultry farm belonging to Evangelist Elliot Ugochukwu-Uko, founder of Igbo Youth Movement, was on Friday night set ablaze by unknown assailants in what appears to be a targeted attack.\nThe incident is the latest in series attacks on Uko’s farm in Enugu State by unknown persons who appear to be on a mission to hurt his businesses over his positions key national issues.\n“Last night, unknown persons set the main office block of my poultry farm in Enugu ablaze,” he said.\n“False narratives and cooked up allegations to blackmail me, won’t change my position.\n“The plots against me won’t change anything.”Facebook Notice for EU!"
  },
  {
    "headline": "COVID 19: 103.7m Nigerians Not Fully Vaccinated",
    "summarized_story": "Two years after the first case of COVID -19 was detected in Nigeria, 103,745,586 out of the 111,776,503 eligible population targeted for COVID-19 vaccination to reach herd immunity against the disease have not been fully vaccinated.\nThough vaccination against COVID-19 commenced about a year after, the huge gap between eligible Nigerians and those vaccinated shows that Nigerians are not willing to be vaccinated.\n“Government should ensure that the COVID-19 vaccine is enough to go round.\nA few days ago, the minister of health, Dr. Osagie Ehanire, said the proportion of fully vaccinated Nigerians was still very low.\nI call on all eligible persons that are yet to receive their vaccination to go to the nearest COVID-19 vaccination site and get vaccinated."
  },
  {
    "headline": "234 Express Unveils Nigeria Heritage Series",
    "summarized_story": "The independent educational publishing company, +234Express Communications has unveiled the first 21 books of its flagship series which was developed to support the recently-introduced curriculum for History at the basic education level.\nWe can rekindle values like tolerance, integrity, self-reliance, dignity and others using history as a tool.\nThis is the vision of the Nigeria Heritage Series,” he said.\nHe identified primary education as the bedrock for all other levels of education, and urged the government through the ministry of education to redirect attention accordingly.\nThe special guest of honour, the minister for education, Mallam Adamu Adamu, stated that the Nigeria Heritage Series was quite an interesting project because it serves as a strategic supplement to the History curriculum at the basic education level."
  },
  {
    "headline": "Gunmen Kill Gov Ishaku’s Aide, Attack Mourners In Anambra",
    "summarized_story": "Gunmen early yesterday killed Hon.\nLevi Gbashi, an aide of Taraba State Governor Darius Ishaku in Donga local government area of the state.\n“We refused to comply as we wanted to buy time to attract the attention of people who were still around.\nPolice in Anambra State yesterday confirmed a violent attack at a funeral at Ebenebe community in Awka North local government area by suspected cultists.\nPolice spokesman in Anambra, DSP Tochukwu Ikenga, who confirmed the incident told newsmen that “a burial was going on when some people suspected to be cultists invaded the area and started shooting."
  },
  {
    "headline": "Abiodun Vows Tough Measures Against Ritual Killings",
    "summarized_story": "Ogun State Governor Dapo Abiodun has condemned the rise in killings and dismembering of human beings for ritual purposes.\nWhile expressing concern over the involvement of young ones in the act, the governor vowed to deal decisively with anyone caught in the crime in accordance with the relevant laws.\n“We won’t be identified by this notoriety.\nWe have emplaced security measures in schools and all the villages, hamlets and towns to ensure zero-tolerance for ritualists.\nWe will trail them, apprehend them, investigate them and make them serve as examples for those harbouring such sinister routes to wealth,” he said."
  },
  {
    "headline": "IGP Appoints Senchi As DIG Operations, Redeploys AIG Ciroma",
    "summarized_story": "The inspector-general of police, IGP Usman Baba, has ordered the posting of assistant inspector-general of police, AIG Bala Zama Senchi, as Ag.\nDIG department of operations, force headquarters, Abuja and DIG representing North-West Geo-political zone.\nThe IGP has equally ordered the redeployment of AIG Aji Ali Janga, AIG Bala Ciroma, and AIG Ndatsu Aliyu Mohammed to AIG Police Mobile Force (PMF), AIG federal operations (FEDOPS), and AIG Zone 7 Abuja, respectively.\nThe acting Force PRO, CSP Muyiwa Adejobi, said the posting/redeployment of the senior officers was due to the recent vacuum occasioned by the retirement of DIG Zaki Ahmed, the DIG representing the North-West Geo-political zone and immediate past DIG in-charge of Operations, and AIG John Abang, AIG PMF, after the completion of their statutory years of service.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Buhari dragged to court over failure to probe misuse of security votes by governors",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari over his failure to promptly probe allegations of systemic mismanagement of security votes by state governors since 1999, and to ensure the prosecution of those suspected to be responsible.\nIt is estimated that security votes add up to over N241.2 billion every year.\n“On top of appropriated security votes, state governments also receive millions of dollars yearly as international security assistance.\n“While sitting state governors may enjoy immunity from arrest and prosecution, they do not enjoy immunity from investigation.\nAny allegations of mismanagement of security votes against sitting governors can and should be investigated pending the time they leave office and lose immunity.”No date has been fixed for the hearing of the suit."
  },
  {
    "headline": "Electoral Act: VON DG Okechukwu hails Buhari",
    "summarized_story": "Mr Osita Okechukwu, the Director-General, Voice of Nigeria (VON) commended President Muhammadu Buhari, for his profound assent to the Electoral Act amendment bill.\nOkechukwu said the Electoral Act 2022 marks a significant turning point in Nigeria’s journey toward electoral reforms, reinforced democratic rights, higher voters turn out and consolidation of democracy.\nAccording to him, the President has given lovers of democracy a booster shot of Vote-Rigging-Vaccine (VRV) by signing the bill into law.\nOkechukwu, who is also a founding member of All Progressives Congress (APC), said through the strokes of his signature-pen on the bill, President Buhari has bequeathed to Nigerians an Electoral Act that empowers the deployment of the Smart Card Reader, Biometric Voter Accreditation System (BVAS) and other technological devices for electoral fidelity.\n“Under the Electoral Act 2022, the VRV offers electronic accreditation and electronic transmission of results."
  },
  {
    "headline": "JUST IN: FG Lists Borders For Nigerians Fleeing Ukraine To Poland",
    "summarized_story": "JUST IN: FG Lists Borders For Nigerians Fleeing Ukraine To PolandOn Saturday, the Federal Government published a list of the borders through which Nigerians escaping the Ukraine-Russian conflict can enter Poland.\nSince the war began, Russian troops have entered Ukraine’s capital, Kyiv, killing dozens of people.\nThe Chairman of the Nigerians in Diaspora Commission, Abike Dabire-Erawa, revealed this and proposed boundaries for Nigerians fleeing the situation.\nAbike assured that “Nigerian volunteer groups, as well as staff of Nigerian Embassy, will be at the border to pick Nigerians.”The federal government announced earlier Saturday that it has made the required arrangements to transport trapped Nigerians in Ukraine to Poland.\nIn a public notification, the Nigerian Embassy in Warsaw, Poland, stated that officials and volunteers will be stationed at the Polish-Ukrainian border to pick up Nigerians."
  },
  {
    "headline": "BREAKING: INEC Shifts 2023 Elections Over Late Signing Of Electoral Act",
    "summarized_story": "Following the late signature of the Electoral Act by President Muhammadu Buhari, the Independent National Electoral Commission has moved the 2023 Presidential election from February 18 to February 25, 2023.\nThe presidential and National Assembly elections will now take place on Saturday, February 25, 2023, while gubernatorial and state house of assembly elections will take place on March 11, 2023, according to him.\nThe new date was set to comply with the stipulations of the Electoral Laws, which require that election notices be published at least 260 days before the elections.\nThe INEC chairman also stated that the electoral instructions will be released in due time.\nThe new Act mandates that INEC publish the election notice at least 360 days before the election."
  },
  {
    "headline": "Explosion Rocks Niger State As Boko Haram Launches Attacks",
    "summarized_story": "Galadima Kogo, Shiroro Local Government Area, Niger State, was hit by an improvised explosive device.\nSani Abubakar Yusuf Kokki, co-convener of the Concerned Shiroro Youths of Niger State, verified this in a statement on Friday.\nThe detonation occurred just a few days after the world’s first bombing, which occurred at the same Galadima Kogo on Monday.\nThe number of casualties has yet to be determined, according to the statement, because the impacted areas are not yet accessible due to the threat of more explosions.\nHowever, preliminary findings do not indicate any loss, according to Kokki."
  },
  {
    "headline": "JUST IN: “Withdraw Your Troops From Ukraine” — Buhari Govt Orders Russia",
    "summarized_story": "The Federal Government has called on the Russian government to withdraw its troops in Ukraine and stop the approach of aggression in the country.\nHe said Nigeria does not condone the approach of aggression by Russia, calling on Russia to pull back.\nWe support every effort being made to stop the aggression and Russian troops to return to Russia,” Onyeama said.\nSpeaking to journalists after the closed-door meeting, German Ambassador to Nigeria, Birgitt Ory, who is also chair of the G7 Group, appreciated the African Union on its statement on the situation.\nThe German envoy commended Nigeria for putting in its weight, said Nigeria is a very important voice that the world needed to hear."
  },
  {
    "headline": "Breaking: Russian airlines ‘banned from EU airspace’ as more sanctions beckon over Ukraine invasion",
    "summarized_story": "Russian airlines have reportedly been banned from EU airspace as Europe unites over the invasion of Ukraine.\nGermany’s transport minister is in favour of closing Germany’s airspace to Russian aeroplanes.\nEarlier Saturday evening German airline Lufthansa said it will cancel all flights to Russia and will cease using Russian airspace for the coming week, citing the “emerging regulatory situation”.\n“Flights that are in Russian airspace will leave it again shortly,” a spokesperson for the company said.\nIt will also cease to use Russian airspace for the coming seven days, it said in a statement"
  },
  {
    "headline": "Shake-up as IGP appoints new DIG, redeploys AIG Ciroma, others",
    "summarized_story": "“Until his recent promotion/posting, he was the AIG in-charge of Community Policing, Force Headquarters, Abuja,” he said.\n“He has served as the AIG in-charge of Zone-10 Sokoto; Commissioner, Police Mobile Force, Federal Operations and the Kogi command, among others.\n“Until his recent posting as the AIG in-charge, Police Mobile Force, he was the AIG in-charge of the Department of ICT, Force Headquarters, Abuja,” he said.\n“Prior to his posting as AIG FEDOPS, Ciroma, who is a member of Certified Fraud Examiners, was the AIG Zone 7, Abuja.\n“Until his recent posting as the AIG Zone 7, Abuja, he was the AIG in-charge of FEDOPS, Force Headquarters, Abuja,” Adejobi said."
  },
  {
    "headline": "[Breaking] 2022 Electoral Act: INEC reveals new dates for 2023 general elections",
    "summarized_story": "After an extraordinary meeting with relevant stakeholders, the Independent National Electoral Commission (INEC) has announced a shift in date for general elections in 2023.\nThe Nigeria’s electoral umpire said presidential election formerly scheduled for February 18 2023 will hold on February 25, 2023.\nIt also declared that governorship and state assembly elections will hold on March 11, 2023.\nDetails loading…"
  },
  {
    "headline": "Bandits Kill 10, Kidnap Several Others In Kaduna State",
    "summarized_story": "At least ten persons have been killed by suspected bandits during separate attacks in Birnin Gwari Local Government Area of Kaduna State.\nThe bandits also kidnapped an unspecified number of people, mainly women, from the communities during the operation that lasted for several hours.\nREAD ALSO: Kaduna Govt Arraigns Suspected Killers Of Senator Na’Allah’s SonIn retaliation, the bandits were said to have returned to the villages on Saturday morning and killed ten people, including six local vigilante members and four villagers.\nThey also kidnapped an unspecified number of people during the operation.\nSimilarly, bandits also blocked the Kaduna- Birnin-Gwari Road at about 10 am on Saturday morning and attacked motorists."
  },
  {
    "headline": "SERAP Sues Buhari Over ‘Failure To Probe Alleged Misuse Of Security Votes By Governors’",
    "summarized_story": "Ending impunity for allegations of corruption in the spending of security votes and recovering any mismanaged public funds are matters of public interest”.\n“Security votes should be used for improving the security situation in the states or returned to the public treasury,” it added.\n“As revealed by a recent report by Transparency International (TI), most of the funds appropriated as security votes are spent on political activities, mismanaged or simply stolen.\nIt is estimated that security votes add up to over N241.2 billion every year.\nOn top of appropriated security votes, state governments also receive millions of dollars yearly as international security assistance."
  },
  {
    "headline": "Zelensky Ready To Talk With Putin, But Not In Belarus",
    "summarized_story": "Ukraine’s President Volodymyr Zelensky said Sunday that he was ready for talks with Russia, but rejected Moscow’s push to stage them in Belarus as it was a launchpad for invading forces.\n“And any other city in a country from whose territory missiles do not fly would suit us,” the 44-year-old president said.\n“We will be ready to begin these talks in Gomel,” Peskov said.\nRussian President Vladimir Putin on Thursday launched a full-scale invasion of Ukraine that has already cost some 200 civilian lives and drawn global condemnation.\nPutin on Sunday congratulated members of special forces, saying they fought “heroically” in Ukraine."
  },
  {
    "headline": "INEC Declares Winners Of Bye-Elections In Ondo, Imo And Cross River",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared the winners of the bye-elections conducted in Ondo, Imo, and Cross River states.\nThis followed the verdict by the electorates in the different state and federal constituencies in the three states.\nAt a similar exercise in Imo State, Blyden Amajurionwu of the APC was declared winner of the Ngor-Okpala State Constituency bye-election.\nFor the bye-election that took place on Saturday in Cross River State, INEC declared Jude Ngaji of the APC the winner of the Ogoja/ Yala Federal Constituency.\nNgaji raked in a total vote of 22,778 votes to defeat his closest opponent of the PDP who scored a total of 20,590."
  },
  {
    "headline": "Zamfara Residents Lament As Power Outage Cripples Economic Activities",
    "summarized_story": "Residents of Birnin-Waje, Dangurumfa, Dargaje, and Matseri, all in Bukkuyum Local Government Area of Zamfara State, have lamented the total power outage in their communities, which according to them, is hampering economic activities.\nThe residents in a statement issued on Sunday by the Secretary of the Birnin-Waje Community Development Association, Mr Sani Umar Waje, said these communities have continued to remain in darkness and economic activities at standstill, due to total power blackout for the past three months.\nThe statement explained that as a business hub and considering the security challenges bedeviling the entire Bukkuyum Local Government Area, most of these communities are in a sorry state in terms of power supplies, which has crippled the economy.\n“This committee has played an important role in understanding the situation.\nThe committee travelled as far as Talata-Mafara to meet with officials on this issue but all the efforts have not yielded success."
  },
  {
    "headline": "APC wins Ngor Okpala by-election in Imo State",
    "summarized_story": "The Independent National Electoral Commission has declared Blyden Okanni Amajirionwu of the APC winner of Saturday’s Ngor Okpala, Imo State Assembly by-election.\nThe election, which began in the early hours of Saturday, February 26th, was quiet, with minimal distortions regulated by security officers on duty.\nAdvertisementMr. Amajirionwu polled 9,248 number of votes as against his closest rival from the People’s Democratic Party (PDP) who got 7,161 number of votes.\nHaving fulfilled the requirements as stipulated by law, the Returning Officer declared the All Progressives Congress (APC) candidate winner and returned him elected."
  },
  {
    "headline": "APC wins Akure North/ South Federal Constituency by-election",
    "summarized_story": "The Independent National Electoral Commission has declared Mr Mayokun Lawson Alade of the All Progressives Congress, APC as the winner of Akure North and South federal constituency by-election.Mr Alade polled 26,379 to beat his closest rival, Mr Olumuyiwa Adu of the People’s Democratic Party, PDP who polled 24,201 votes.\nOther contestants, Oluwawemimo Fadeke of the African Democratic Party, had 465 votes, Joseph Ajayi of the All People’s Party polled 125 votes, Olaniyi Olufemi of the National Redemption movement , 76 votes , Opawole Tajudeen of the Social Democratic Party, 68 votes while Olawale of the Accord Party polled 41 votes.\nThe election held in two local governments of Akure North/ Akure South was conducted under a peaceful atmosphere.\nAdvertisementThe by-election became necessary following the death of the lawmaker representing the constituency, Mr Adedayo Omolafe in August, 2021.\nFINAL RESULT FOR AKURE NORTH/SOUTH FEDERAL CONSTITUENCY BY-ELECTION;Akure North LGA:APC – 8,291PDP – 5,830AdvertisementAkure South LGA:APC – 16,996PDP – 17,645TOTALAPC – 25,287PDP – 23,475AdvertisementDifference = 1,812"
  },
  {
    "headline": "Jos North/Bassa by-election: INEC, electorate commended for peaceful conduct -",
    "summarized_story": "Residents in the Jos North and Bassa Federal Constituency have been commended for their peaceful conduct during the by-election for the Jos North, Bassa Federal House of representatives.\nTVC News crew in Jos went round some of the polling units within the affected areas also confirmed the peaceful and orderly conduct of the exercise.\nAdvertisementParty agents, civil society organisations, observers, as well as the officials of INEC, monitoring the polls expressed satisfaction with the peaceful conducts of the electorate.\nOfficials of the electoral body conducting the polls have also been applauded for a free fair and credible exercise at the moment.\nAdvertisement"
  },
  {
    "headline": "By-Election: INEC confirms abduction of its personnel in Imo",
    "summarized_story": "The Independent National Electoral Commission has confirmed the outbreak violence and abduction of its personnel during the by-election in Imo.\nAddressing Journalists in Owerri, the Resident Electoral commissioner Francis Ezeonu said results manufactured from those areas will not be accepted by the commission.\nAdvertisement"
  },
  {
    "headline": "Russian Troops Enter Ukraine’s 2nd Largest City Kharkiv as Invasion Continues",
    "summarized_story": "Ukrainian forces engaged them, according to Oleh Sinehubov, the head of the Kharkiv regional administration.\nHuge explosions lit up the sky early Sunday near the capital, Kyiv, where people hunkered down in homes, underground garages and subway stations in anticipation of a full-scale assault by Russian forces.\nZelenskyy’s office also said Russian forces blew up a gas pipeline in Kharkiv, prompting the government to warn people to protect themselves from the smoke by covering their windows with damp cloth or gauze.\nHe said the Russian forces also have taken control of an air base near Kherson and the city of Henichesk on the Azov Sea.\nUkraine’s president said his country was ready for peace talks with Russia but not in Belarus given the Russian ally’s role in the invasion."
  },
  {
    "headline": "Emir of Kano, Air Peace Row Deepens as Monarch’s Camp Demands Airline Apologise Over Missed Flight",
    "summarized_story": "Isa Bayero, cousin of the Emir of Kano, Alhaji Aminu Ado Bayero, has given Air Peace airline a 72-hour ultimatum to offer an apology for allegedly ‘disrespecting’ the Emir, Aminu Ado-Bayero, and causing a delay to his flight.\nBayero had written a petition to the Nigerian Civil Aviation Authority (NCAA), seeking punitive actions against Air Peace Airline for what he tagged “disrespect to the emir and the people of Kano State.”But Air Peace denied the allegation.\nKano people not to fly Air Peace anymore because the airline insulted their emir and refused to apologise?\n“After all, Air Peace has been in business before coming to Kano and Kano people have been flying across the world without Air Peace.\nI have flown five Heads of State besides being a prince of Kano, and I am a personal friend to the Chairman of Air Peace, Mr. Onyema.”Ibrahim Shuaib in Kano"
  },
  {
    "headline": "ASUU Strike: Nigeria Government, University Lecturers to Reconvene for Talks Tuesday",
    "summarized_story": "Nigeria’s federal government negotiating team will meet again with the striking members of the Academic Staff Union of Universities (ASUU) on Tuesday.\nThe meeting, which is a follow-up to an earlier one held last week, will report the progress made in the implementation of the agreement reached with the union.\nWhen asked to comment on the progress made in negotiations since the declaration of the one-month roll-over strike, Osodeke said that nothing has happened.\nNo one has reached out to us, except the notice that we will be reconvening on Tuesday for talks,” he said.\nReacting to the statement credited to the Minister of Labour and Employment, Senator Chris Ngige, that it would not be expedient for government to embark on wholesome salary review for the university lecturers, the ASUU president said that the federal government was not sincere."
  },
  {
    "headline": "Seplat Explains Acquisition of ExxonMobil Assets",
    "summarized_story": "Seplat Energy has defended its acquisition of oil assets belonging to Mobil Producing Nigeria Unlimited (MPNU), in the face of global resistance to fossil fuels, explaining that it would require returns from fossil fuel investments to push its plan for renewable energy.\nHe added that Seplat already set up a subsidiary called Seplat Energy offshore limited that would be acquiring the business of MPNU.\nHe noted that Seplat would continue the “excellent performance” of the Mobil business, adding that the new entity has a slightly different plan in terms of cost-efficiency.\nAnd again over the last 10 years, we’ve seen a reduction in costs and losses in Seplat.\nWe have pillar one, which is our upstream oil and gas, business and pillar two business is the midstream gas business, going down into gas power."
  },
  {
    "headline": "Nigeria: Purported Endorsement of Consensus Chairman Divides APC Governors",
    "summarized_story": "The purported endorsement of a former Governor of Nasarawa State, Senator Abdullahi Adamu, as the consensus National Chairman of the All Progressives Congress (APC) by President Muhammadu Buhari has further divided the governors elected on the platform of the ruling party, THISDAY has learnt.\nSources privy to the meeting, who spoke to THISDAY, said that the meeting had a one-item agenda, which explained its brief nature.\nThe source told THISDAY that three governors from the North-west, one governor from the South-west, another governor from the South-east and a minister from the South-south were behind the purported adoption of a consensus candidate.\nBoth Al-Makura and Musa had in newspaper advertorial rejected the purported nomination of Adamu.\nEfforts to get the Secretary of the National Caretaker Committee of APC, Senator John Akpanudoedehe to clarify the adoption of Adamu as a consensus national chairman proved abortive as he did not pick his calls."
  }
]