[
  {
    "headline": "Top pastors absent, eminent Nigerians, traders, others bid TB Joshua farewell",
    "summarized_story": "Tears flowed as eminent Nigerians, family, friends and benefactors gathered at the Synagogue Church of All Nations, Ikotun Egbe, Lagos, to bid its founder, the late Prophet T.B.\nThe late Joshua was buried around 2.53pm on Friday on the church’s premises in the presence of his wife, Evelyn Joshua, his children, officiating ministers and senior members of the church.\nThe late evangelist, who hailed from Arigidi Akoko in Ondo State, died on June 5 at the age of 57.\nPresent at the ceremony were the Ondo State Governor, Rotimi Akeredolu (SAN); the Governor of Lagos State, Babajide Sanwo-Olu, who was represented by the Commissioner for Home Affairs, Prince Anofiu Elegusi; and representatives of the Delta State Governor, Dr Ifeanyi Okowa; and the Deputy Senate President, Ovie Omo-Agege.\nCritics wondered why CAN would commiserate with others but wait for a long time before making a statement on Prophet T. B. Joshua."
  },
  {
    "headline": "FG, G7 launch N59.9bn N’East hunger prevention programme",
    "summarized_story": "The Federal Government, in collaboration with the World Bank and the G7 countries, on Thursday, launched the famine prevention programme for the North-East.\nThe G7 countries, comprising Canada, France, Germany, Italy, Japan, the United Kingdom, and the United States, are supporting the Famine Prevention and Humanitarian Compact with $382m (about N59.9bn), to prevent hunger occasioned by the Boko Haram insurgency in the North-East.\nThe envoy said the G7 was concerned by the scale of the crisis in the North-East, Nigeria and the huge number of people inaccessible to humanitarian aid.\nShe called on the international community to act immediately, with no regrets, to prevent further decline.\n‘’They also committed to work collectively to promote respect for and abidance to International Humanitarian Law and the protection of civilians."
  },
  {
    "headline": "Lagos-Ikotun stands still for TB Joshua",
    "summarized_story": "The hustling and bustling town of Ikotun, Lagos, on Friday stood still as the remains of Founder of Synagogue Church of All Nations (SCOAN), Prophet Temitope Balogun Joshua, aka TB.\nAlhaji Wash Lawal, an Ikotun community leader, said that the man TB Joshua deserved more than whatever respect the community had accorded him.\nIt’s a mark of respect for a community that has lost one of its best,” Lawal said.\nAccording to him, the man brought the once rural Ikotun community to world recognition and in the process attracted investments that employed many of the youths.\nJames Peters, a member of SCOAN, said that the clemency of the weather despite being in the heart of the rainy season depicted TB."
  },
  {
    "headline": "Court jails 2 University students over love scam",
    "summarized_story": "A Kwara State High Court sitting in Ilorin on Friday, sentenced two students to Correctional Centre for love scam.\nThe two Convict are; Adeyemi Kehinde, final-year student of Ekiti State University, (EKSU) Ado Ekiti, and Oladosu Olalekan of Kwara State University, (KWASU),Molete.\nSimilarly, the court sentenced Olalekan to one year imprisonment, each, on count one and count two, which is to run concurrently, with option of fine, of N100,000 each, on the two counts.\nAdeyemi, alias (Queen Elizabeth) was charged on one count charge while Oladosu was prosecuted on three counts by the anti-graft agency.\n“Knowingly pretended and represented yourself to be a white lady called, Queen Elizabeth Toha, who was in love with him."
  },
  {
    "headline": "NAF graduates 27 officers trained for effective administrative duties",
    "summarized_story": "The Nigerian Air Force Institute of Administrative Management (NAFIAM) on Friday in Kaduna graduated 27 officers who undertook a three-month young officers course on efficient and effective administrative duties.\nIn his address, the Chief of Air Staff (CAS), Air Marshal Oladayo Amao, said the current state of Nigeria’s security necessitated the training of its personnel on administrative and other duties.\nEdafe Onobrakpeya, said the young officers course 15/2021 intended to develop the skills of participants and position them to function effectively in staff and field appointments.\nOnobrakpeya thanked the leadership of the Commanding Officers of Air and Ground Training for creating an enabling environment and mentorship for the institute and its training activities.\nThe News Agency of Nigeria (NAN), reports that the event featured presentation of awards to best graduating officers in order of merit."
  },
  {
    "headline": "El-Rufai condems killings in 3 LGAs, disappearance of 5 youths",
    "summarized_story": "Governor Nasir El-Rufai, of Kaduna State has condemned the killings and disappearance of some citizens in Zangon Kataf, Igabi, Chikun and Jema’a Local Government Areas (LGAs) of the state.\nGovernor of Kaduna State, Nasir El-Rufai.\n“Security Agencies had previously reported killings of citizens in Kibori, Katsit and Afana in Zangon Kataf Local Government Areas (LGA), and Amana Kasuwa of Igabi LGA.\n”This is before reporting the killing of nine persons on Friday 9th July, at Warkan village of Zangon Kataf LGA, and one person at Kakkau area of Chikun LGA.\n“The disappearance of five youths in Kafanchan town of Jema’a LGA was also reported by the security agencies on Friday,” he added."
  },
  {
    "headline": "Kebbi secures N1.7bn loan to boost livestock production, dairy — Bagudu",
    "summarized_story": "Governor Atiku Bagudu of KebbiGovernor Atiku Bagudu of Kebbi State on Friday disclosed that the state government had secured a N1.7 billion bank loan to boost livestock production and dairy in the state.\nBagudu stated this at the commissioning of the new Kara ultramodern livestock market in Jega Local Government Area of the state towards boosting socio-economic activities.\nHe said the ultramodern livestock market comprised six sections including; a police unit for providing security, a mosque and toilets.\nBagudu for the construction and commissioning of this modern livestock market in Jega, the commercial nerve centre of the state, Jega.\nOn his part, the Sarkin Kabin Jega, Alhaji Arzika Bawa-Jega described the project as invaluable to the people of Jega, lauding Gov."
  },
  {
    "headline": "Youths own the future but less equipped",
    "summarized_story": "The founder of Deeper Life Bible Church who doubles as the Chancellor, Anchor University, Lagos, Pastor William Kumuyi, has lamented that youths who are projected as future leaders are not equipped academically to enable them unveil their potentials.\nThe renowned gospel preacher stated this on Friday during the maiden convocation ceremony and awards of first degrees and prizes at the institution in Lagos State Nigeria.\nHe said the major aim of establishing the university was to train the African youths as a means of empowering them to face their future as expected of them.\nDeeper Life Pastor, Kumuyi warns against calls for Nigeria’s breakupAccording to the man of God, millions of young people had their visions crashed through wrong and early marriage and its consequences, stressing that the university was aimed at tackling the menace of drug abuse and immortal lifestyle common amongst youths.\n“According to the UN’s demographic projection, the median age in Africa for 102 is pegged at 19.8“Beyond Africa, young people are very important demography of the world, they own the future but are less equipped for the future”."
  },
  {
    "headline": "Police increase patrols in Lagos, officers move in unmarked vehicles",
    "summarized_story": "The Police in Lagos State are carrying out daily patrols in unofficial vehicles as the spate of insecurity in the state unsettle many residents.\nSources in locations within the metropolis told DAILY POST they noticed Police personnel drive pass in commercial/private cars or buses.\nIt was gathered that the intelligence unit of the state command suggested discreet patrols to curtail violence, robberies and kidnappings.\nScores of operatives have been seen on the Lekki – Ajah – Epe axis, Ikorodu road, Yaba, Ikeja, Maryland, Apapa – Oshodi expressway, Okota – Festac, Mile-2 Badagry highway, Ojota – Berger road, Ikorodu, among others.\nThe Lagos Command had vowed not to allow activities that could lead to the kind of carnage that was witnessed during the End SARS protest in October 2020."
  },
  {
    "headline": "100 million Nigerians will be out of poverty in 10 years",
    "summarized_story": "Vice President Yemi Osinbajo on Friday reiterated the Buhari administration’s plan to lift 100 million Nigerians out of poverty in ten years.\nProf. Osinbajo spoke in Abuja on Friday at the inaugural meeting of the National Poverty Reduction with Growth Strategy Steering Committee held at the Presidential Villa.\nOsinbajo, Tinubu insist on Nigeria’s unityOsinbajo said the government would adopt a different and more effective approach in actualizing the objective of eradicating poverty.\nHe assured that efforts will be made to focus attention on creating opportunities for Nigerians to earn decent livelihoods.\nEkiti Governor Kayode Fayemi, the Nigeria Governors Forum Chairman; Borno Governor Babagana Zulum, and Nasarawa Governor Abdullahi Sule attended."
  },
  {
    "headline": "Reps would resolve overlapping mandates of security agencies",
    "summarized_story": "He explained that the interventions by the House were necessary because finding solutions to the challenges was a collective responsibility.\nGbajabiamila was speaking in Lagos on Friday where he declared open a two-day National Security Legislative Reform retreat.\nOn the essence of the collaboration, the Resident Representative of Konrad-Adenauer Stiftung, Dr Vladimir Kreck, said inter-agency collaboration and overlapping mandates were not strange developments.\n“To overcome rivalry between agencies and to induce synergies, a regulatory framework is necessary, defining the modes of collaboration.\n“It is against this backdrop that in 2020, our organisation commissioned a survey on overlapping mandates of security, intelligence and law enforcement agencies in Nigeria."
  },
  {
    "headline": "INEC: Buhari told to arrest, withdraw Onochie’s nomination immediately",
    "summarized_story": "Lauretta Onochie, who was nominated as one of the Independent National Electoral Commission, INEC Commissioners by President Muhammadu Buhari, has been accused of lying under oath.\nAmadi called on President Buhari to.order the arrest of Onochie, saying such action should not be without consequences.\nHe also asked the President to, without further delay, withdraw Onochie’s nomination, adding that the electoral umpire is too critical to be subjected to such partisan nomination.\nHe pointed out that facts at the National Assembly and INEC has it that Agbamuche-Mbu was nominated by Buhari in 2016 for confirmation as INEC Commissioner from Delta State.\nAccording to him, two serving lawmakers from Delta State in the persons of Ovie Omo-Agege and James Manager endorsed Agbamuche-Mbu’s nomination as their daughter and nominee for Delta State in 2016."
  },
  {
    "headline": "Court ruling has vindicated me, says ex-Finance Minister Adeosun",
    "summarized_story": "A former Minister of Finance Mrs. Kemi Adeosun said she has been vindicated by a Federal High Court in Abuja.\nShe said the judgement of Justice Taiwo Taiwo was not only a personal victory for her but for all Nigerians in the Diaspora.\nThe court on Wednesday said the ex-Minister ought not to present herself for NYSC scheme in the first instance.\nJustice Taiwo Taiwo said NYSC certificate was not relevant to her appointment as a minister.\nHe said her appointment was not illegal or not unconstitutional without NYSC certificate."
  },
  {
    "headline": "We did not arrest ‘Buhari–Must-Go’ protesters – Dunamis",
    "summarized_story": "Dunamis International Gospel Centre has disproved claims it handed over five ‘Buhari-Must-Go’ protesters to the Department of State Service (DSS) during last Sunday’s church service.\nThe protesters were arrested last Sunday at the Dunamis church’s glorious doom along the Airport road, Abuja.\nDunamis said the protesters were arrested outside the church, adding that they had no hand in the arrest of the youths.\n“The live-streaming had the caption, “Buhari-Must-Go protest hits Dunamis Church in Abuja.”The statement condemned the protesters by stating the church was not a protest ground.\n“The church has no right to arrest and detain people and has no detention custody."
  },
  {
    "headline": "PHOTOS: Actress Rosy Meurer shares moments of bonding with son.",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "VIDEO: Nick Canon says he had his kids on purpose",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "Female dognappers arrested in Texas, puppy worth $10,000",
    "summarized_story": "Two dognappers have been arrested by police after trying to steal a very expensive puppy.\nThe women were arrested on Monday, July 5, after allegedly stealing a French bulldog puppy worth $10,000 from a Texas pet store.\n“French bulldogs are very highly sought after and, as a result, it is what people are attempting to steal.”This is not the first time in recent memory that French bulldogs have been kidnapped.\nIn February this year, robbers shot a dog walker working for Lady Gaga and took two of the singer’s French bulldogs in Los Angeles.\nRyan Fischer, the dog walker, has since recovered."
  },
  {
    "headline": "Detained protesters: Call police to order, rights groups, lawyers tell Sanwo-Olu",
    "summarized_story": "The police had on July 5 taken the detainees to the State Magistrates’ Court to secure an order to further detained them in its custody pending investigation.\nDifferent rights groups and lawyers have also called on Governor Babajide Sanwo-Olu and the state Attorney General and Commissioner for Justice, Mr. Moyosore Onigbanjo SAN, to call the police to order and not to undermine the constitution of the country.\nKunle Adegoke, SAN, was among the lawyers who condemned the detention of the protesters, saying the action of the police amounted to violation of human rights and breach of the constitutional right of the protesters.\nA Yoruba self-determination group, Yoruba Ko’ya Liberation Movement (YKLM), also shared same view with various stakeholders who condemned the action of the police.\nThe group, in a statement issued by its Director of Media and Publicity, Mr. Femi Oluwajuyitan, also called for the release of the detained protesters."
  },
  {
    "headline": "2023: Rotational presidency, zoning unconstitutional –Gov Bello",
    "summarized_story": "By Chinelo ObogoGovernor Yahaya Bello of Kogi State has described zoning of the presidency as unconstitutional, insisting that the country’s 1999 constitution, as amended, does not make any provision for it.\n“As at the time the late Musa Yaradua was President, the problems of the north would have been solved.\nWhen former President Goodluck Jonathan was president, all of the problems of the Niger Delta would have been solved.\nWe need someone who will unify this country and build on the legacy of President Buhari.\nAll over the world, the younger generation are taking charge and Nigeria cannot be left behind,” Bello said."
  },
  {
    "headline": "Kanu: Igbo groups mobilise lawyers for IPOB leader",
    "summarized_story": "This is as some leading Igbo groups, including the Nzuko Umunna, Alaigbo Development Foundation (ADF), Imeobi Igbo Forum (IIF) and Igbo Lawyers Association (ILA) are already mobilising legal practitioners of Igbo origin to defend the detained self-determination agitator.\nADF urged the Igbo not to abandon the IPOB leader because the struggle he had championed for the self-determination of the Igbo.\n“We in ADF had called on Igbo lawyers to rally round Nnamdi Kanu to secure his freedom.\n“We reiterate our position and maintain that it is not a question of Kanu as a person, it is the Igbo Nation that is being held to ransom.\n“The Nigerian authorities are toying with the aspirations of the ethnic nationalities held up in the crisis-ridden federation."
  },
  {
    "headline": "Police confirm killing of 35 in Zamfara communities",
    "summarized_story": "From Mohammed Munirat Nasir, GusauThe Zamfara state Police Command has confirmed the killing of 35 people in five different communities of Faru district in Maradun local government area of Zamfara StateThe Command’s Police Public Relation Officer (PPRO) SP Mohammed Shehu said joint task force comprising of Police, Army and other security agencies have been deployed to the affected areas.\n“About 35 people were killed but normalcy has been restored following the deployment of security personnel to the affected communities,” he said.\n“As at this time that I am talking to you over 37 dead bodies have being discovered in the five communities,” he said.\nHe added that the bandits also set ablaze houses and food stuff stores in the affected communities.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Tears as TB Joshua is interred",
    "summarized_story": "It was tears, sorrow and deep anguish at the Synagogue Church of All Nations (SCOA) as the remains of renowned televangelist and founder of the Church, Prophet Temitope Balogun Joshua, was interred in the church premises in the Ikotun area of Lagos State.\nOndo State Governor, Rotimi Akeredolu; Wife of the Ooni of Ife, Olori Naomi Adeyeye; and other guests were in attendance at the interment service.\nHe hailed from Arigidi Akoko, in Ondo State, and founded the Synagogue Church in 1987.\nEarlier the Ondo State governor, Rotimi Akeredolu, while paying tribute to the late Prophet said the death of Prophet Temitope Joshua, popularly called TB Joshua, is a loss to the entire world.\nHe recalled how the late pastor reached out to him after his election victory, adding that Pastor RB Joshua really touched lives in Ondo state."
  },
  {
    "headline": "Oba of Benin, Obaseki Set for Showdown over Looted Artefacts",
    "summarized_story": "However, Obaseki told THISDAY that he was working on a tripartite arrangement, involving the federal and state governments, the Oba of Benin and a private trust that would manage the artefacts on behalf of the palace and the people.\nHis plan, it is gathered, is to have the private trust build a museum of West African Arts in Benin, the state capital, where the artefacts would be kept and curated.\nLegacy Restoration Trust, a private entity, THISDAY learnt, has since emerged, parading itself as the authorised custodian of the artefacts.\n“That they are known as Benin Bronzes is already a confirmation of their source of origin (which is Benin),” Mohammed said.\nHe thanked Germany for taking the leadin the global efforts to repatriate all artefacts looted from Nigeria and the African continent."
  },
  {
    "headline": "Customs Collect N1tn Revenue in Six Months",
    "summarized_story": "James Emejo in AbujaThe Nigeria Customs Service (NCS) yesterday said it collected over N1 trillion between January and June 2021 as revenue for the federation.\nThe Customs Public Relations Officer (PRO), Mr. Joseph Attah, while addressing journalists in Abuja, said: “Hitting the trillion-naira mark within six months is unprecedented in the service”.\nHe stated that the agency will always be willing to break its records and to generate more revenue above the target under a favourable environment.\nOn its enforcement duties, Attah said the agency seized a total number of 2,333 assorted items, with duty paid value of N4.42 billion.\nHe said given the level of compliance, the deadline for the verification process had been further extended by 14 day."
  },
  {
    "headline": "FIRS Engages Banks to Recover N1.82tn from MultiChoice",
    "summarized_story": "*We are discussing with tax authorities, says companyJames Emejo in AbujaThe Federal Inland Revenue Service (FIRS) has commissioned some banks to recover N1.82 trillion from the accounts of MultiChoice Nigeria Limited (MCN) and MultiChoice Africa (MCA).\nBut in a swift response, MultiChoice Nigeria said it had the media statements made by the FIRS, but had not received any notification from the agency.\n“MultiChoice Nigeria respects and is comfortable that it complies with the tax laws of Nigeria.\nHe accused MultiChoice Nigeria of avoiding to give the FIRS accurate information on the number of its subscribers and income.\nNami said: “The level of non-compliance by MultiChoice Africa (MCA), the parent company of MultiChoice Nigeria (MCN) is very alarming."
  },
  {
    "headline": "Abdulsalami: Insecurity Has Set Education in the North Backward By 20years",
    "summarized_story": "….Buhari expresses sadness over killings in AdamawaDeji Elumoye in Abuja and Laleye Dipo in MinnaA former military Head of State General Abdulsalami Abubakar (rtd) has said that insecurity has set education in the northern part of the country backward by 20 years.\nThe former head of state noted that many children of school age can no longer go to school while those in schools are being kidnapped.\n“Insecurity has taken education in the north back 20 years.\nforgetting that they too have children“Will they be happy if their children are kidnapped and traumatised?” Abdulsalami queried.\nAbdulsalami also blamed the poor economic situation in the country on the effect of the COVID-19."
  },
  {
    "headline": "Nigeria Confirms First Case of Covid’s Delta Variant",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe Nigeria Centre for Disease Control (NCDC) has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2 in Nigeria.\n“Given the global risk of spread of the Delta variant, positive samples from international travelers to Nigeria are sequenced regularly,” it said.\nIt added, “Proven public health and social measures such as physical distancing, frequenthandwashing, and proper use of face masks, prevent infections and save lives.\nThe Delta variant is recognised by the World Health Organization (WHO) as a variant ofconcern, given its increased transmissibility.\nIt is veryimportant that this is strictly adhered to, to prevent a surge in COVID-19 cases in Nigeria."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "2023: How Buhari Undermined Tinubu Again, Continued To Weaken His Influence In All Progressives Congress Party",
    "summarized_story": "SaharaReporters gathered that the reluctance to announce national convention and choose national executives was to weaken the power and influence of Asiwaju in pushing for his candidates who would then begin more mobilisation for his yet-to-be-announced 2023 presidential ambition.\nThe development is already polarizing further the Buhari camp and the Tinubu camp in the APC, while other smaller camps have to take a stand between Buhari and Tinubu in the silent struggle.\n“The indefinite tenure exten­sion granted to the Caretaker/Extraordinary Convention Planning Committee of the APC is not going down well with us.\n“The president ap­proved the timetable for APC ward, local government and state congresses.\nWard con­gresses will hold 24th July, 2021 followed by local govern­ment congresses on 14th Au­gust, 2021 and state congresses on 18th September, 2021."
  },
  {
    "headline": "2023: How Buhari Undermined Tinubu Again, Continued To Weaken His Influence In All Progressives Congress Party",
    "summarized_story": "SaharaReporters gathered that the reluctance to announce national convention and choose national executives was to weaken the power and influence of Asiwaju in pushing for his candidates who would then begin more mobilisation for his yet-to-be-announced 2023 presidential ambition.\nThe development is already polarizing further the Buhari camp and the Tinubu camp in the APC, while other smaller camps have to take a stand between Buhari and Tinubu in the silent struggle.\n“The indefinite tenure exten­sion granted to the Caretaker/Extraordinary Convention Planning Committee of the APC is not going down well with us.\n“The president ap­proved the timetable for APC ward, local government and state congresses.\nWard con­gresses will hold 24th July, 2021 followed by local govern­ment congresses on 14th Au­gust, 2021 and state congresses on 18th September, 2021."
  },
  {
    "headline": "Zuma’s Woes And Waste Of Mandela's Legacy, By Chido Nwangwu",
    "summarized_story": "South Africa is, by most reasonable assessments, among the most endowed and beautiful countries of the world.\nI have been to post-apartheid South Africa twice.\nDuring this period, the late, great Nelson Mandela was the president of South Africa.\nI explore these issues in more detail and context in my forthcoming 2021 book, MLK, Mandela & Achebe: Power, Leadership and Identity.\nPost-apartheid South Africa had so much promise and hopes for a people and a continent in need of genuine heroes and success stories."
  },
  {
    "headline": "35 killed as gunmen attack Zamfara communities",
    "summarized_story": "At least 35 people have been killed following an attack by gunmen in five communities in Maradun LGA of Zamfara state.\nAdvertisementThe gunmen were said to have invaded the communities — Gudan-Maidawa, Tsauni, Gudan-Baushi, Gidan-Adamu, and Wari — on Thursday evening.\nThe attackers, who reportedly arrived the communities on over 90 motorcycles, were also said to have set houses ablaze.\nMuhammad Shehu, police spokesperson in Zamfara, confirmed the incident on Friday.\nAdvertisementThe latest incident comes weeks after an unconfirmed number of people were killed in Kadawa village in the state."
  },
  {
    "headline": "35 killed as gunmen attack Zamfara communities",
    "summarized_story": "At least 35 people have been killed following an attack by gunmen in five communities in Maradun LGA of Zamfara state.\nAdvertisementThe gunmen were said to have invaded the communities — Gudan-Maidawa, Tsauni, Gudan-Baushi, Gidan-Adamu, and Wari — on Thursday evening.\nThe attackers, who reportedly arrived the communities on over 90 motorcycles, were also said to have set houses ablaze.\nMuhammad Shehu, police spokesperson in Zamfara, confirmed the incident on Friday.\nAdvertisementThe latest incident comes weeks after an unconfirmed number of people were killed in Kadawa village in the state."
  },
  {
    "headline": "Yahaya Bello: Zoning is unconstitutional -- let the best candidate be president in 2023",
    "summarized_story": "Yahaya Bello, governor of Kogi state, says zoning of presidency is not compulsory since it isn’t recognised in the country’s constitution.\nThe governor said in 2023, the best candidate should be someone who will unite the country.\n“Zoning is not recognised in the 1999 Constitution; it’s absolutely unconstitutional.\n“In the 2023 presidential election, let the best candidate emerge who will unify and solve the problems of this country we are facing today — who will build on the legacies of Mr. President.\nI have always led from the front based on equity, fairness and justice.”AdvertisementBello noted that only the north-central and south-east zones have not produced a president."
  },
  {
    "headline": "Yahaya Bello: Zoning is unconstitutional -- let the best candidate be president in 2023",
    "summarized_story": "Yahaya Bello, governor of Kogi state, says zoning of presidency is not compulsory since it isn’t recognised in the country’s constitution.\nThe governor said in 2023, the best candidate should be someone who will unite the country.\n“Zoning is not recognised in the 1999 Constitution; it’s absolutely unconstitutional.\n“In the 2023 presidential election, let the best candidate emerge who will unify and solve the problems of this country we are facing today — who will build on the legacies of Mr. President.\nI have always led from the front based on equity, fairness and justice.”AdvertisementBello noted that only the north-central and south-east zones have not produced a president."
  },
  {
    "headline": "Osinbajo: Buhari will use commonsense strategy to lift 100m Nigerians out of poverty",
    "summarized_story": "Vice-President Yemi Osinbajo says President Muhammadu Buhari will use a simple, commonsense strategy to lift 100 million Nigerians out of poverty.\nThree weeks ago, President Muhammadu Buhari set up a national poverty reduction with growth strategy (NPRGS) steering committee, following the approval of the federal executive council (FEC) in April.\nSpeaking at the inaugural meeting of the steering committee in Abuja, Osinbajo said the committee would improve the adoption of commonsensical approaches in achieving its objectives.\nHe also added that the private sector must also collaborate with the government to reduce unemployment and lift Nigerians out of poverty.\nAdvertisement“I just want to emphasise that it is a national strategy as opposed to a federal strategy which is why the steering committee is made up of federal as well as state officials,” he said."
  },
  {
    "headline": "Overworked staff, mass exits: The inside story of GTBank’s mobile app and USSD transaction failures",
    "summarized_story": "His orange branded Guaranty Trust Bank (GTB) app had not launched as he tried severally to make a transfer from his current account to the empty savings account linked to the debit card on his Uber app.\nI have not been able to access my GT Mobile App for days now.\nJust ask any GTB customer.\nIts mobile app also has over a million downloads on the Google play store alone.\nThe App development team is almost half of what it was at the beginning of the year."
  },
  {
    "headline": "Peter Njonjo wants to change the way food moves in Africa",
    "summarized_story": "Peter Njonjo started his first business in high school.\nHis name is Peter Njonjo and this is his life in tech.\nHe chose to attend the United States International University Africa (USIUA), a private university in Nairobi.\nThree years later, he would be in charge of Coca-Cola’s operations in six countries across East Africa: Kenya, Uganda, Tanzania, Ethiopia, Eritrea, and Mozambique.\nI’m the firstborn of four children.”That is how Peter Njonjo starts his story on our call."
  },
  {
    "headline": "MultiChoice’s bank accounts blocked in Nigeria over alleged ₦1.8 trillion tax fraud",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) on Thursday said it has directed commercial banks to freeze the accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA), in an attempt to recover ₦1.8 trillion in taxes from the companies.\nMultiChoice Group is a South African entertainment giant and owner of the popular DStv and GOtv services.\nParticularly, [MultiChoice Nigeria Limited] has avoided giving the FIRS accurate information on the number of its subscribers and income,” he said.\nAccording to the FIRS chair, Nigeria contributed 34% of total revenue for the group and the bulk of revenue for MultiChoice Africa.\nMultiChoice is the latest South African firm involved in a huge tax scandal in Nigeria."
  },
  {
    "headline": "Nigeria’s Daystar Power secures $20 million from IFC",
    "summarized_story": "Daystar Power, a provider of hybrid solar power solutions to businesses in West Africa, has secured a facility of $20 million from the International Finance Corporation (IFC) to fund its project pipeline in Nigeria.\nFounded in 2017 by Sunrah Ventures, Daystar Power is an off-grid power service provider whose solutions, “Solar-as-a-Service” and “Power-as-a-Service” provide clean and reliable power while significantly reducing overall power costs for clients.\nDaystar Power will receive a $10 million local currency loan from IFC, which will be provided to its Nigerian subsidiary, Daybreak Power Solutions.\nDaystar Power is working with the Canadian-funded IFC program, Energy2Equal, to close gender gaps and increase women’s participation in the renewable energy sector.\nDaystar Power has 29 megawatts (MW) of installed solar power capacity to date."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Smile Identity’s $7m Series A, Safaricom increases cost of airtime, MarketForce’s $2m pre-Series A, Nigeria attempts blocking MultiChoice accounts",
    "summarized_story": "Safaricom increases the cost of airtimeKenyan President, Uhuru Kenyatta, has accepted the Kenyan Parliamentary Committee’s additional taxes proposal.\nKenyan B2B retail platform, MarketForce, has raised $2 million pre-Series A to focus on its business-to-business (B2B) retail marketplace, RajeRaje.\nNigeria to block MultiChoice Nigeria and MultiChoice Africa’s accountsDStv dish.\nYesterday, Thursday, July 8, 2021, Nigeria’s Federal Inland Revenue Service (FIRS) announced that it had directed commercial banks to freeze the accounts of MultiChoice Nigeria Limited (MCN) and MultiChoice Africa (MCA) in an attempt to recover ₦1.8 trillion in taxes from the companies.\nSo, the banks that handle business for MultiChoice Africa and MultiChoice Nigeria were instructed to perform a balanced search on their accounts before undertaking any other transaction on their behalf."
  },
  {
    "headline": "Nigeria’s tax authority queries Multichoice over possible ₦1.8 trillion tax fraud",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) has directed some commercial banks to freeze and recover ₦1.8 trillion ($4.4 billion) from MultiChoice Nigeria (MCN) and MultiChoice Africa’s accounts.\nThe firms are subsidiaries of South Africa-based MultiChoice Group, which provides television and other entertainment services across Africa like DStv, GOtv, and video-on-demand platform, Showmax.\nIn the statement, FIRS said that it discovered that the companies have persistently breached all agreements and undertakings with the Service.\nIt also added that the group’s performance did not reflect in their tax obligations and compliance level in the country.\nAccording to Reuters, MultiChoice Group makes a third of its business elsewhere on the continent outside South Africa."
  },
  {
    "headline": "Kenyan B2B retail platform, MarketForce, raises $2m pre-Series A to scale its B2B e-commerce marketplace for merchants",
    "summarized_story": "End-to-end retail distribution platform, MarketForce, was founded in 2018 by Tesh Mbaabu and Mesongo Sibuti, Chief Executive Officer (CEO) and Chief Technology Officer (CTO), respectively.\nThese stores also help customers access various forms of financial services such as payments, savings, remittances, and insurance.\nPer TechCrunch, the retail startup got into Y Combinator because they utilise FMCG distribution networks.\nRejaReja model, a B2B e-commerce marketplace for merchants, was launched in 2020 to assist informal retail merchants purchase and sell FMCGs and digital financial services.\nAlthough retail distribution is a core business, the CEO stated that finding the right talent and individuals willing to innovate and revolutionise the space has been an interesting challenge."
  },
  {
    "headline": "NLNG Board appoints Philip Mshelbila as CEO",
    "summarized_story": "The board of Nigeria LNG (NLNG) has announced the appointment of Philip Mshelbila as the successor of the firm’s current managing director and chief executive officer, Tony Attah.\nMshelbila is currently rounding up his tenure as CEO, Atlantic LNG Company of Trinidad & Tobago.\nHe was previously the general manager of gas for Shell Nigeria and a director of Shell Petroleum Development Co. (SPDC).\nRead Also: Buhari flags off NLNG Train 7 projectHe was also a former regional communications manager for Shell in West Africa and general manager for community relations at Shell Nigeria.\nRonald Adams, who comes from Shell Trinidad and Tobago, will replace Mshelbila at Atlantic LNG."
  },
  {
    "headline": "Why rising oil price fails to boost Nigeria’s foreign reserves",
    "summarized_story": "The recent spat between Saudi Arabia and UAE which pushed oil prices to historic heights is having little or no effects on Nigeria’s external reserves, a development that questions the various Central Bank of Nigeria (CBN) interventions to stabilise the exchange rate.\nIntrinsically, one might think that the recent rally in crude oil prices of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s crazy petrol consumption in five charts",
    "summarized_story": "An exclusive industry data seen by BusinessDay has explained why Nigeria’s curious petrol consumption has kept the country in a bleeding state, a pain point for a government struggling with one of the worst macroeconomic environments in its recent history.\nGlobally, energy consumption, most especially petrol, is an important indicator of the level of economic…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Petrol Tanker Crushes 10 School Children To Death In Delta – Nigerian Observer",
    "summarized_story": "Although, as at press time actual number of the dead was not yet certain, but efforts were on to ascertain the number of bodies trapped beneath the tanker which fell down on its side .\nDPO had to order the evacuation of the dead students to nearby mortuary while efforts to salvage the tanker continued as part of an effort to rescue the victims or recover more bodies.\nPolice Public Relations Officer (PPRO) DSP Edafe Bright, said do far the police can only confirmed that six students that died have been taking to mortuary.\nHe however did not rule out the possibility of having more dead bodies trapped under the fallen tanker.\nHe said the police still making efforts to track down the driver of the tanker who ran away immediately the incident occurred."
  },
  {
    "headline": "Edo govt, GIZ SEDIN train over 350 entrepreneurs in Edo South, Central on business digitalization – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Skills Development Agency (EdoJobs) and the Edo State Investment Promotion Office (ESIPO), in collaboration with the German Development Office-Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ SEDIN) have completed training for over 350 business owners on digital marketing.\nManaging Director, Edo State Skills Development Agency (EdoJobs), Ukinebo Dare, said the training was held at the Edo Innovates Hub, in Benin City and Uromi.\nShe said similar training will also be organized for business owners in Edo North, noting “The business digitalization programme at Edo South and Central witnessed huge numbers of testimonies from entrepreneurs that participated in the programme.\n“The success stories of beneficiaries from Edo South and Central fast-tracked the need to extend the training to entrepreneurs in Edo North.\nThe training in Edo North targets 50 entrepreneurs.”According to her, “the business digitalization programme is an intensive three (3) days digital marketing training session aimed at enlightening business owners on the importance of acquiring digital skills to boost online presence and improve sales."
  },
  {
    "headline": "FG, Obaseki, Royal Palace in Germany, conclude arrangement on return of Benin artefacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Federal Government, Edo State Government and the Benin Royal Family have concluded meeting in Germany towards the return of stolen artefacts to Edo State.\nThe Benin Royal Palace was represented by the Crown Prince of Benin Kingdom, Prince Ezelekhae Ewuare.\nAt the meeting, Lai Mohammed insisted on a full and unconditional return of the 1,130 Benin artefacts domiciled in German museums, adding that the return should be whole rather than substantial.\nThe governor said he was attending the talks to demonstrate the strong partnership involving the Federal Government of Nigeria, the (Benin) Royal family and the people of Edo State.\nOther people on the Nigerian delegation were the Nigerian Ambassador to Germany, Mr. Yusuf Tuggar and Director-General of the National Commission for Museums and Monument (NCMM), Prof. Abba Tijani."
  },
  {
    "headline": "Inclusive Education: Group calls for more attention, funding – Nigerian Observer",
    "summarized_story": "Omosah who lauded the developmental strides of governor Godwin Obaseki in the educational sector maintained that special schools in the state have inadequate staff and specialists to serve the students population.\nAccording to him, the exclusion of children with disabilities from school has an adverse economic impact on the family, community and the nation at large.\nThe keynote speaker, prof Julius Ademokoya of the University of Ibadan said special education is capital intensive, hence the state government must be willing to fund it adequately to reap expected results of inclusiveness.\nProf Ademokoya harp on the need for legal backing, involvement and the engagement of relevant stakeholders of inclusive education in the state to making the programme sustainable.\nOkungbowa, represented by the director of investment and revenue, ministry of finance, Emofonmwan Akhere added that inclusive education develop and maximise learning competencies of learners with special needs to making them useful to the society."
  },
  {
    "headline": "Thousands sign petition to stop Nigerians from eating dogs",
    "summarized_story": "ADVERTISEMENTOver 9,948 persons, as of press time, have signed an online petition urging the Nigerian government and President Muhammadu Buhari to ban the sale of dog meat in Nigeria.\nDog meat is a delicacy relished in the south-eastern part of the country.\nThe campaign, which is hosted on Chage.org is titled ‘‘Stop Nigeria’s Barbaric Dog Meat Industry’’.\nMs Choolun, who also said that dog owners are scared of their pet’s safety, is also advocating a ban on ‘‘The Dog Cat Wildlife Meat Trade & Wet markets’’ worldwide.\nDogs and cats are companion animals and not food items.”The pleaShe urged President Buhari to implement policies that can protect the lives and safety of dogs."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NLNG Board appoints Philip Mshelbila CEO as Tony Attah ends tenure in August",
    "summarized_story": "The Nigeria LNG Limited (NLNG) board has announced the appointment of Dr. Philip Mshelbila as new Managing Director and Chief Executive Officer to succeed Engr.\nTony Attah.\nAttah who was appointed Chief Executive Officer by the NLNG Board in July 2016, will return to his parent company, Shell, on August 30, 2021, at the expiration of his five-year tenure at the helm of affairs.\nDr. Mshelbila, who is rounding up his tenure as Chief Executive Officer, Atlantic LNG Company of Trinidad & Tobago, will be taking over from Engr.\nAttah on 31st August 2021, the NLNG announced on Friday."
  },
  {
    "headline": "Customs generates N1trn in six months",
    "summarized_story": "The Nigeria Customs Service (NCS) has generated over N1 trillion between January and June 2021 as revenue for the federation, representing an increase of N290.\n20 billion compared to the N713.54 billion it recorded within the same period last year.\nJoseph Attah, public relations officers of NCS, disclosed this on Thursday, while addressing journalists in Abuja.\nAccording to him, attaining the N1trn mark within six months is unprecedented in the service.\nAttah said the agency seized a total number of 2,333 assorted items, with a duty paid value of N4.42 billion."
  },
  {
    "headline": "U.S. Army Special Forces Conclude Training With Nigeria Navy Special Boat Service",
    "summarized_story": "Twenty-five officers of the Nigerian Navy Special Boat Service completed a five-week Joint Combined Exchange Training (JCET) alongside a team of U.S. Army Special Forces.\nThe exercise is part of a series of U.S. engagements with the Nigerian military that provide opportunities for Nigerian military and U.S. elite units to work together, learn from each other, and strengthen relationships.\nAccording to her, the JCET is part of a close and continuous military partnership between the United States and Nigeria spanning decades to strengthen defense ties and promote regional security.\nNigeria participates in multiple bilateral and multilateral military exercises with the United States, including African Lion, Flintlock, and Obangame Express.\nThe U.S. and Nigeria cooperate on maritime security, military professionalization including human rights, counterterrorism efforts against Boko Haram and ISIS-West Africa, defense trade, and strengthening governance."
  },
  {
    "headline": "Eight contestants seek viewers votes as FirstBank-sponsored The Voice Nigeria season 3 enters live shows",
    "summarized_story": "By Bolaji IsraelWith an electrifying mix of pulsating musical performances, music training, glamorous fashion and life enriching entertainment, the The Voice Nigeria 3 continues to dazzle to the very grand finale.\nThe fate of eight amazing music talents now lies with the viewers votes for a chance to fight for the grand prize as the world acclaimed music talents reality series, the Voice Nigeria 3 sponsored by FirstBank, Baba Ijebu and Airtel entered the much awaited Live Shows stage in Nigeria.\nAll four saved talents are now in need of a second chance as they are part of the eight that needs viewers votes again.\nAt the end, Naomi was saved by Falz, leaving Dapo and returnee Tamara to the viewers votes.\nWith an electrifying mix of pulsating musical performances, music training, glamorous fashion and life enriching entertainment, the The Voice Nigeria 3 continues to dazzle to the very grand finale."
  },
  {
    "headline": "No Fatality In Troops’ Convoy Accident In Borno – Army",
    "summarized_story": "The Nigerian Army has said that there was no fatality in the convoy accident involving troops of Operation Hadin Kai in the North-East.\nThe director, Army Public Relations, Brig Gen Onyema Nwachukwu, said the nine soldiers involved were receiving treatment at a medical facility.\nThe Army spokesman stated this while conveying the Chief of Army Staff (COAS), Lt Gen Faruk Yahaya’s commiseration to the troops.\nHe said the troops were involved in a road accident on Thursday, July 8, 2021, at Garin Kuturu, along Maiduguri- Damaturu Road, while responding to a distress call.\n“Nine personnel who sustained varying degrees of injury in the accident have been evacuated and are currently receiving medical attention in a military medical facility."
  },
  {
    "headline": "No Fatality In Troops’ Convoy Accident In Borno – Army",
    "summarized_story": "The Nigerian Army has said that there was no fatality in the convoy accident involving troops of Operation Hadin Kai in the North-East.\nThe director, Army Public Relations, Brig Gen Onyema Nwachukwu, said the nine soldiers involved were receiving treatment at a medical facility.\nThe Army spokesman stated this while conveying the Chief of Army Staff (COAS), Lt Gen Faruk Yahaya’s commiseration to the troops.\nHe said the troops were involved in a road accident on Thursday, July 8, 2021, at Garin Kuturu, along Maiduguri- Damaturu Road, while responding to a distress call.\n“Nine personnel who sustained varying degrees of injury in the accident have been evacuated and are currently receiving medical attention in a military medical facility."
  },
  {
    "headline": "Police Commission Reinstates 21 Dismissed Officers",
    "summarized_story": "The Police Service Commission (PSC) has approved the reinstatement of 21 police officers and lifted the suspension of Mohammed Iya Musa, a Superintendent of Police serving in the Yobe State Police Command, who was demobilised from the Special Protection Unit, Base 2, Lagos.\nSP Musa, who was earlier on suspension, was recalled by the Commission and awarded a punishment of severe reprimand.\nHe, however, recalled his encounter with the aides of a former IGP and his detention at the Maitama Police Station without any known offence.\nThe Commission also approved that some of the reinstated officers be promoted and their arrears paid.\nPSC spokesperson, Ikechukwu Ani, said the decisions were taking at the 12th plenary meeting of the Commission held in Abuja and presided over by Commission chairman, Musiliu Smith."
  },
  {
    "headline": "Police Commission Reinstates 21 Dismissed Officers",
    "summarized_story": "The Police Service Commission (PSC) has approved the reinstatement of 21 police officers and lifted the suspension of Mohammed Iya Musa, a Superintendent of Police serving in the Yobe State Police Command, who was demobilised from the Special Protection Unit, Base 2, Lagos.\nSP Musa, who was earlier on suspension, was recalled by the Commission and awarded a punishment of severe reprimand.\nHe, however, recalled his encounter with the aides of a former IGP and his detention at the Maitama Police Station without any known offence.\nThe Commission also approved that some of the reinstated officers be promoted and their arrears paid.\nPSC spokesperson, Ikechukwu Ani, said the decisions were taking at the 12th plenary meeting of the Commission held in Abuja and presided over by Commission chairman, Musiliu Smith."
  },
  {
    "headline": "Ortom: Police Arraign Journalist For Alleged Defamation, Incitement",
    "summarized_story": "A Chief Magistrate Court presided over by Justice Vincent Kor on Friday granted bail to a journalist, Sunday Egena Ode.\nOkpale Ojikpa observed an ambiguity in the First Information Report (FIR) on whether the offences are against Governor Ortom or the state government.\nMoving his oral application for bail, Barr.\nAccording to Okpale, ”my client has shown evidence of a citizen who would not run away from trial or interfer with Police investigation.\nAsked by the presiding Magistrate if the defendant was re-arrested on different charges, Gbako could not explain."
  },
  {
    "headline": "Anambra poll: 22 parties besiege INEC office, protest exclusion",
    "summarized_story": "Not less than 22 political parties besieged the Independent National Electoral Commission (INEC) headquarters in Abuja on Friday to submit names and particulars of candidates for the November 6 Anambra governorship election.\nThe parties, which were part of the 74 parties deregistered by INEC last year, insisted they must be on the ballot papers.\nADVERTISEMENTThe Nation reports the parties on March 18 submitted letters of notice for governorship primaries for the Anambra poll.\n“By refusing to relist these 22 political parties to participate in the scheduled election as Ordered by the Court of Appeal in APPEAL NO.\nOthers are: Peoples Coalition Party (PCP); Progressive Peoples Alliance (PPA); People for Democratic Change (PDC); Young Democratic Party (YDP); Re-Build Nigeria Party (RBNP); Save Nigeria Congress (SNC); Socialist Party of Nigeria, (SPN); United Democratic Party (UDP); United Patriots (UP) and We The People of Nigeria (WTP)."
  },
  {
    "headline": "Anambra poll: 22 parties besiege INEC office, protest exclusion",
    "summarized_story": "Not less than 22 political parties besieged the Independent National Electoral Commission (INEC) headquarters in Abuja on Friday to submit names and particulars of candidates for the November 6 Anambra governorship election.\nThe parties, which were part of the 74 parties deregistered by INEC last year, insisted they must be on the ballot papers.\nADVERTISEMENTThe Nation reports the parties on March 18 submitted letters of notice for governorship primaries for the Anambra poll.\n“By refusing to relist these 22 political parties to participate in the scheduled election as Ordered by the Court of Appeal in APPEAL NO.\nOthers are: Peoples Coalition Party (PCP); Progressive Peoples Alliance (PPA); People for Democratic Change (PDC); Young Democratic Party (YDP); Re-Build Nigeria Party (RBNP); Save Nigeria Congress (SNC); Socialist Party of Nigeria, (SPN); United Democratic Party (UDP); United Patriots (UP) and We The People of Nigeria (WTP)."
  },
  {
    "headline": "FG to resident doctors, others: Withdraw your strike notices now",
    "summarized_story": "FG to resident doctors, others: Withdraw your strike notices nowFG to resident doctors, others: Withdraw your strike notices nowThe Federal Government has directed the National Association of Resident Doctors and the Joint Health Sector Unions to withdraw their strike notices immediately.\nHe said that the Federal Government was recently issued notice of trade disputes by NARD and JOHESU.\nSo, we expect them to withdraw those notices they gave.\n”They have nothing to do with this discussion on fixing a new hazard allowance for health professionals and workers,” he said.\nThe minister said that the Federal Government would take the final decision on the new hazard allowance for health workers."
  },
  {
    "headline": "FG to resident doctors, others: Withdraw your strike notices now",
    "summarized_story": "FG to resident doctors, others: Withdraw your strike notices nowFG to resident doctors, others: Withdraw your strike notices nowThe Federal Government has directed the National Association of Resident Doctors and the Joint Health Sector Unions to withdraw their strike notices immediately.\nHe said that the Federal Government was recently issued notice of trade disputes by NARD and JOHESU.\nSo, we expect them to withdraw those notices they gave.\n”They have nothing to do with this discussion on fixing a new hazard allowance for health professionals and workers,” he said.\nThe minister said that the Federal Government would take the final decision on the new hazard allowance for health workers."
  },
  {
    "headline": "How 100 bandits on motorcycles massacred 35 people in Zamfara",
    "summarized_story": "It was a black day for five communities in Maradun Local Government Area of Zamfara State, as 100 bandits riding on motorcycles invaded them and shot 35 people dead.\nZamfara Police Command’s spokesman, Mohammed Shehu said the police were unable to access the communities to confront the bandits because of poor road network.\nReports said the bandits on arriving the communities opened fire on villagers and set their houses ablaze.\nHundreds of people have so far been killed in Zamfara as bandits stepped up attack on hapless villages without access roads.\nThey often sneaked into the forest before the police or the military would arrive."
  },
  {
    "headline": "Photo News: TB Joshua laid to rest amid tears",
    "summarized_story": "By Taiwo OkanlawonThousands of mourners gathered as Prophet Temitope Balogun Joshua, the founder of the Synagogue Church of All Nation (SCOAN) was buried at the church’s premises after a farewell service.\nThe televangelist was laid to rest at exactly 2:52 pm at the church premises in the presence of his family and selected guests.\nJoshua died after a church service at SCOAN on June 5 , few days to his 58 birthday anniversary.\nHis Ondo State counterpart, Governor Rotimi Akeredolu, his deputy, Lucky Orimisan Aiyedatiwa, Ondo State Speaker of the House of Assembly, Bamidele Oleyelogun, among others.\nCheck photos from the laying to rest service below;"
  },
  {
    "headline": "Oko Iyabo: TAMPAN suspends Yomi Fabiyi indefinitely",
    "summarized_story": "By Nimot SulaimonThe Theatre Arts and Motion Picture Producers Association of Nigeria (TAMPAN) has suspended Yomi Fabiyi for gross misconduct, and unethical practices on his new movie ‘Oko Iyabo’.\nThe suspension announced on TAMPAN’s Instagram page on Friday after summoning the actor and his co-director, Mr Dele Matti to a meeting.\nWhile Yomi Fabiyi was suspended indefinitely, his co-director, Matti was suspended for three months.\n“Having listened to the detailed defence of Mr Yomi Fabiyi, who is the Producer/Director of the controversial film ‘Oko Iyabo’ and his Co-Director, Mr Dele Matti, the Ethic, Conflict and Resolution Committee hereby found them guilty of professional misconduct and unethical practices.\n“That the story, plot, theme, title, dialogue, names and general content of the film ‘Oko Iyabo’ is a factual presentation that may give rise to prejudice since the matter is already in court."
  },
  {
    "headline": "100 Million Nigerians Will Be Out Of Poverty In 10 years – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo restated President Muhammadu Buhari’s ambition to bring 100 million Nigerians out of poverty in ten years on Friday.\nAccording to Osinbajo, the government and stakeholders must be very deliberate about their goals and how they will be achieved.\nProf. Osinbajo spoke in Abuja on Friday at the inaugural meeting of the National Poverty Reduction with Growth Strategy Steering Committee held at the Presidential Villa.\nOsinbajo said the government would adopt a different and more effective approach in actualizing the objective of eradicating poverty.\nEkiti Governor Kayode Fayemi, the Nigeria Governors Forum Chairman; Borno Governor Babagana Zulum, and Nasarawa Governor Abdullahi Sule attended."
  },
  {
    "headline": "El-Rufai Governing Kaduna With Lies, Propaganda – CAN",
    "summarized_story": "John Joseph Hayab, Kaduna State Chairman, Christian Association of Nigeria, CAN, has exacerbated the state’s security concerns.\nSpeaking at an organised prayer session for God’s intervention to release the abducted students of Bethel Baptist High school, Damishi, Kaduna on Friday, Rev.\n“Instead of the governor to confront the enemies, he chooses to confront the people and the enemies think the governor is on their side that is why they (enemies) are having a field day in the state.”He noted that in Kaduna State, the governor has been governing the people with lies, stressing, “the people of Kaduna state cannot be guaranteed security because the government keep on telling lies.\nThe state chairman of CAN noted that the governor has been Governing the state with propaganda, adding that he said what he cannot do.\nDr Adolani Israel Akanji said governor Nasir El-Rufai has assured him that he would do all he could to ensure the safe return of all the kidnapped students of Bethel Baptist High school, Damishi, Kaduna."
  },
  {
    "headline": "Forgive Igboho, He Has Suffered,Ready To Drop Agitations – Oluwo Begs Buhari",
    "summarized_story": "Oba Abdulrasheed Akanbi, the Oluwo of Iwo, has pleaded with President Muhammadu Buhari to pardon Sunday Adeyemo Igboho, the self-styled Yoruba independence fighter, for his attempts to break up Nigeria.\nOluwo said Sunday Igboho, who was declared wanted after his house was raided last week by the DSS, has suffered a lot.\nThe traditional ruler said Igboho will drop his agitations, adding that he would take him on a visit to Buhari.\nIn a letter to the President on Friday, the Oluwo said Sunday Igboho earned his popularity as an activist whose joy is to liberate the cheated.\nI promise your Excellency that Igboho will mind his steps henceforth."
  },
  {
    "headline": "SCOAN: Top Nigerian Pastors Fail To Attend TB Joshua’s Funeral",
    "summarized_story": "When Temitope Balogun Joshua, aka TB Joshua, the senior Prophet of the Synagogue Church of All Nations, SCOAN, was buried on Friday, major pastors, church owners, and religious leaders in Nigeria were noticeably absent.\nThe pastor was claimed to have died on Saturday after closing a presentation at the Synagogue Church Of All Nations, shocking his congregation and onlookers.\nGovernment officials, SCOAN members, and Christians from all over the world attended the funeral service, which was conducted at the Church in Lagos, Nigeria.\nPoliticians, friends, and well-wishers, as well as those who appeared to dislike the ministry in the past, have expressed their condolences and sympathies to the departed family and the SCOAN church through various channels.\nThe Lagos Governor, Babajide Sanwo-Olu, was also present during the funeral, as were other prominent politicians, national and international organizations."
  },
  {
    "headline": "Tears, testimonies as Akeredolu, Sanwo-Olu, others attend Prophet T.B Joshua’s final burial",
    "summarized_story": "Ondo state Governor, Rotimi Akeredolu, and his Lagos counterpart Babajide Sanwo-Olu on Friday attended the final burial of the founder of the Synagogue Church of All Nations Prophet T.B Joshua held in Lagos state.\nSanwoolu in his speech said Joshua lived with the common man and played the role of a father to many orphans.\nThe Lagos governor urged others to emulate the late Prophet’s style.\nThe governor said his impact is worldwide saying it explained why a “world congregation” had come to witness his burial.\n“Pastor TB Joshua when I won election within hours drove to Owo my hometown, and something went wrong with his vehicles in Akure."
  },
  {
    "headline": "Gale of defections: Thin hope for PDP as fortunes plummet",
    "summarized_story": "ABDULRAHMAN ZAKARIYAU and BODE OLAGOKE in this report x-ray the party’s National Working Committee (NWC) and the dark clouds over the leading opposition party.\nNot long ago, the senator representing Delta North Federal Constituency, Peter Nwaoboshi, defected from the leading opposition party to the APC.\nIn Cross River state, thousands of PDP members in Abi local government area, which is the constituency of former Governor Liyel Imoke, defected to the APC.\nI have never seen where you have an economic crisis, insecurity crisis, then the ruling party poaching governors.\n“Today, there is a twist in the narration as opposition members of the PDP are moving massively into the fold of the ruling APC."
  },
  {
    "headline": "Pictures: Prophet T.B Joshua buried in Lagos amidst tears",
    "summarized_story": "PreviousHappening now: Burial of 39 victims killed by bandits in Zamfara (PICTURES)"
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "UPDATED: Bandits Kill 35 In Attack On Five Zamfara Communities",
    "summarized_story": "Bandits have killed 35 persons after an assault on five communities of Faru district located in Maradun Local Government Area of Zamfara State.\nGudan-Baushi, Gidan-Adamu,Gudan-Maidawa, Tsauni, and Wari communities woke up to the marauders’ invasion in the late hours of Thursday morning on motorcycles numbering over 100.\nHe however stated that efforts to reach the affected communities on time proved abortive due to the poor road network.\n“The police personnel tried their best to reach the affected communities on receiving the information that the bandits were there but unfortunately they could not reach the places because of the bad roads,” he said.\nDosara noted that the Zamfara State government has spent the sum of N970 million on payment of ransom to bandits to secure the release of kidnapped victims since 2011."
  },
  {
    "headline": "Six Reportedly Killed As Bandits Attack Another Zamfara Community",
    "summarized_story": "No fewer than six persons have been reportedly killed by suspected armed bandits in Gora Namaye community under Maradun Local Government area of Zamfara State.\nA source told Channels Television that the bandits invaded the community between 3:00 and 4:00 pm on Friday and started shooting sporadically, killing six persons, injuring several others and setting a vehicle ablaze.\nEfforts to reach the police at the time of filing this report were not successful.\nRead Also: Bandits Kill 35 In Attack On Five Zamfara CommunitiesThis comes barely 24 hours after some communities under Maradun Local government were attacked by armed bandits on resulting in the killing of over 35 persons.\nMaradun Local Government is the home town of the state Governor, Bello Matawalle."
  },
  {
    "headline": "Bandits Kill At Least 10 In Kaduna Communities",
    "summarized_story": "At least nine people have been killed at Warkan village in Zangon Kataf local government area of Kaduna State following an attack on the community by bandits on Friday.\nSecurity agencies equally reported that some other persons lost their lives after another set of bandits attacked Kibori, Katsit and Afana all in Zangon Kataf local government area, and Amana Kasuwa of Igabi local government within the week.\nRead Also: Kaduna Abduction: School Management Confirms 125 Students In Custody Of BanditsAruwan also disclosed that five youths from Kafanchan town of Jema’a local government area are missing with their whereabouts unknown.\nHe condoled with families who have lost their loved ones and wished those who sustained injuries speedy recovery.\nGovernor El-rufai has also directed the Kaduna State Emergency Management Agency to urgently assess damages at Warkan village and provide relief materials to the affected residents, while also appealing to the affected families to remain calm, saying security agencies are investigating the incidents."
  },
  {
    "headline": "Prophet T.B Joshua Buried Amid Tears And Tributes",
    "summarized_story": "Prophet Temitope Joshua, better known as T. B Joshua has been buried amid tears and tributes from his teeming followers and public figures.\n﻿While paying tribute to the Ondo-born televangelist who rose to prominence in the 1990s, Akeredolu described TB Joshua’s death as a loss to humanity.\n“Indeed, it was and is being globally acknowledged today by all of us.”READ ALSO: Prophet TB Joshua Dies At 57Mega-Pastors Shun EventFriday’s burial was the culmination of a week-long funeral rites that attracted hoards of people across the globe.\nBut many mega-pastors in Africa’s most populous nation shunned the ceremony, signaling their cold relationship with T.B Joshua.\nREAD ALSO: TB Joshua Was A Blessing To Humanity, Says AkeredoluREAD ALSO: TB Joshua Will Be Missed For His Spiritual Contributions, Philanthropic Gestures – BuhariT.B Joshua died on June 5th in Lagos after holding a church service."
  },
  {
    "headline": "Osubi Airport Reopens For Operations",
    "summarized_story": "The Federal Government has reopened commercial flights at the Osubi Airport in Delta State.\nAt the reopening ceremony of the Airport in Okpe Local Government Area on Friday the Airport Manager, Mr Wilson Egwato, said that the routes would be expanded very soon.\nThe airport was shut down last year after the private managers said they could no longer maintain it.\nBut the Federal Airport Authority of Nigeria (FAAN) is now the new manager.\nOsubi is a connecting airport to most oilfields in the Delta."
  },
  {
    "headline": "COAS Commiserates with troops involved in Borno road accident",
    "summarized_story": "The Chief of Army Staff (COAS) Lt Gen Faruk Yahaya has commiserated with troops who were involved in a road traffic accident on Thursday 8 July 2021, at Garin Kuturu, along Maiduguri- Damaturu road, while responding to a distress call.\nOne of the Gun trucks conveying the troops according to a Statement by Army Spokesman, Brigadier General Onyema Nwachukwu, skidded off the road and rammed into a road shoulder, causing the vehicle to somersault.\nNine personnel who were in the truck and sustained varying degrees of injury in the accident have been evacuated and are currently receiving medical attention in a military medical facility.\nNo fatality was recorded in the accident.\nLieutenant General Faruk Yahaya according to the Statement commended the troops for their swift response and urged them to be more circumspect during emergency operational responses."
  },
  {
    "headline": "Blasphemy: Tambuwal Calls for Calm, says suspect under investigation",
    "summarized_story": "Sokoto state government has appealed to the people of the state to remain calm as the state government in collaboration with the security agencies and other relevant stakeholders are taking necessary steps to ensure the suspects accused of blasphemy against the persons of the Holy Prophet Muhammad (PBUH) is brought to Justice.\nThe government in a press conference addressed by the state commissioner for information Isa Bajini Galandachi on behalf of the state governor Aminu Tambuwal condemned in strongest term the unholy behaviour of the the suspect .\nThe commissioner said the state governor Aminu Tambuwal cautioned against politicizing the issue and appealed to the people to come together in matters such as this.\nHe said the government would not condone such acts against Prophet Muhammad (PBUH) or any other Prophet of God or His Scriptures.\nAccording to the Commissioner, the suspect has since been apprehended and investigations are ongoing, consequent upon which the suspect will be brought before a competent court of law to face justice."
  },
  {
    "headline": "2 Chinese, Others Plead Not-Guilty to 7 Count vandalism charge",
    "summarized_story": "Two Chinese Nationals and Twenty-Seven Other suspects arraigned at the Federal High Court Lafia, in Nasarawa state for railway vandalism have pleaded Not-Guity to the seven count charges against them.\nThe Suspects were charged by the Nigeria Police in the state for conspiracy, economic sabotage, terrorism among others.\nAfter taking the pleas, the presiding judge, Justice Nehizena Afolabi of the Federal High Court, Lafia, adjourned the case till Tuesday, July 13 for hearing."
  },
  {
    "headline": "Fury vs Wilder III: Fight Called Off Following 10 Covid Cases in Briton’s Camp – Arise News",
    "summarized_story": "Reports in the US also suggest that at least 10 people in Fury’s Vegas gym have caught Covid-19.\nPromoter Eddie Hearn revealed Dillian Whyte is prepared to step in as a late replacement and fight Wilder instead.\nIt is understood Fury has had his first coronavirus vaccination but not his second jab.\nBoxing insider Teddy Atlas said: “It looks like Fury actually has Covid.\nWilder and his team do not believe Fury really has Covid and think he is lying."
  },
  {
    "headline": "Mozambique’s Largest Hospital Lacking Space For Covid Patients – Arise News",
    "summarized_story": "Health authorities in Mozambique have declared that “there is no longer any space to admit patients with Covid-19 at the Maputo Central Hospital,” the country’s largest facility.\nFárida Ursi, clinical director of the Maputo Central Hospital or HCM, said the infirmary had space for 40 patients, but there were currently 53 needing treatment.\nThe hospital was now trying to transfer people to different facilities “so that the patients have a decent hospitalisation, without having patients on the floor”, Dr Usi said.\nThe Covid-19 situation in the country – in particular in the capital Maputo – is going from bad to worse, with more and more people needing hospital treatment.\nHe said the “shortage” means that “in a week we will have blood problems, which could cause some patients with acute and severe anaemia to lose their lives”."
  },
  {
    "headline": "130,000 Nigerian Refugees Set to Return From Niger By December – Arise News",
    "summarized_story": "Niger republic and Borno state in neighbouring Nigeria have struck a deal for the return of more than 130,000 Nigerian refugees.\nNiger’s president Mohamed Bazoum told reporters on the sidelines of a G5 Sahel summit in Paris on Friday that a deadline has been set for their return.\n“We have set a deadline of the month of November-December for all the refugees from Nigeria who are in the Diffa region (of southeast Niger) to return home, it’s more than 130,000 people,” he said.\nIts authorities are already trying, with limited success, to encourage internally displaced people in Borno to return to their homes.\nThe Diffa region is home to 300,000 Nigerian refugees and displaced people, according to the UN."
  },
  {
    "headline": "Buhari’s Aide Under Fire After Denying APC Membership Despite Evidence – Trending with Ojy Okpe",
    "summarized_story": "Lauretta Onochie, President Muhammadu Buhari’s aide on new media has come under intense criticism on social media, after it appeared that she made false claims about her membership of the All Progressive’s Congress.\nNiger Delta University has announced the indefinite closure of the institution amid protests by students over the introduction of uniforms.\nOver 9,000 people around the world have signed a petition launched on Change.org to stop Nigerians from eating dogs."
  },
  {
    "headline": "Nigeria: It’s Unconstitutional, Northcentral Kogi Governor Kicks Against Rotational Presidency",
    "summarized_story": "Nigeria’s northcentral Kogi state governor Yahaya Bello on Friday kicked against any form of zoning arrangement for the office of the country’s President, describing it as unconstitutional.\n“Nigeria deserves the best.\nNigeria is a ship or a flight that requires the best captain to steer or lead the affairs to the desired destination,” he said.\n“It’s unconstitutional, not in our own party the APC and it’s not in the constitution if the federal republic of Nigeria.\n“If we should go by that, then the Northcentral has been largely shortchanged, then let’s focus our attention on north central."
  }
]