[
  {
    "headline": "Amaechi’s courage, energy make him best candidate for APC presidential ticket – Princewill",
    "summarized_story": "THE courage and energy of the Minister of Transportation, Rotimi Amaechi make him the preferred candidate to clinch the Presidential ticket of the All Progressives Congress ahead of the 2023 election, a former governorship candidate in Rivers State, Tonye Princewill has stated.\nSpeaking during an interactive meeting with select journalists in Port Harcourt on Saturday, Princewill said it would take a politician of Amaechi’s pedigree to to tackle the myriads of problems confronting the nation.\nHe further said the former Rivers State Governor is the only credible person that has what it takes to move the country to the next level.\nHe goes for results and he has always gotten results in anything he sets his eyes on.\nHe may not remember friendship when he becomes President because he needs results that would make Nigerians happy."
  },
  {
    "headline": "Contest 2023 presidency, N’Central youths urge Bello",
    "summarized_story": "A political group under the aegis of Rescue Nigeria Mission, has called on the governor of Kogi State, Yahaya Bello, to contest for the President in 2023.\nSpeaking on Saturday in Lafia at a one-day induction and training programme for supporters of Yahaya Bello, the North-Central Coordinator of the group, Tauhid Haruna, explained that members of the group converged from the six states and the Federal Capital Territory to call on the Kogi governor to run for the 2023 presidency because of his leadership qualities.\nHaruna said the group, which comprised youths and women, decided that it was time for a youthful and energetic president to emerge in 2023 in order to tackle the numerous problems confronting the nation.\n“We have mobilized thousands of youths across the North-Central zone and we are making efforts to get more people to join us because we believe that Yahaya Bello is the solution to the problems of Nigeria”.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Bolt ripping us off, drivers lament",
    "summarized_story": "SOME operators of Bolt, an e-hailing service provider, have accused the company of ripping them off.\nSome drivers who spoke in separate interviews with our correspondent on Friday said the company has increased its charges from 20 to 25 per cent.\nA driver who simply gave his name as Charles said the company should have considered the drivers while implementing their new price regime.\nThen it was 20 per cent on each trip they charged as commission on Bolt.\nShe said, “What have drivers done to bolt?"
  },
  {
    "headline": "Agreements with Twitter not censorship – FG",
    "summarized_story": "The Federal Government says the agreements it reached with Twitter to resume operations in the country were not meant to censor the microblogging site and other social media platforms in general.\nHe reiterated the resolve of the government to regulate the social media in a manner that would not stifle the freedom of speech and expression, as well as strangulate the media.\n“We are going to regulate the social media not because we want to stifle the media or we want to violate the right of expression.\n“Similarly, the partner support portal provides a direct channel for government to engage Twitter staff to manage prohibited contents,” he said.\nHe reiterated that relevant laws and the broadcasting code would be amended to ensure that the agreement reached with Twitter would be applicable to other social media platforms."
  },
  {
    "headline": "Security outfits launch manhunt for 70-yr-old rapist in Bauchi",
    "summarized_story": "By Charly Agwam – BauchiA 70-year-old man is currently on the run for allegedly raping a 17-year-old SSS2 student as the police in Bogoro local government area of Bauchi state has intensified search for him.\nThe man popularly known as ‘Zimbabwe’ fled Kurmin Boi village of Bogoro local government area after the story of rape spread across the area.\nAccording to a personnel of the JTF in the area, Kabir Garba, “Zimbabwe is now at large after he committed the offence and being aware that the Police and other security operatives are now after him.\n“We have also received reports that the same man had impregnated a disabled girl and run away.\nBy the grace of God we will arrest him soon.”Worried by the development, Executive Chairman of Bogoro LGC, Hon Iliya Habila has directed security agents to ensure that they trail and arrest ‘Zimbabwe’ and make sure that they prosecute him according to the law."
  },
  {
    "headline": "Wike berates Ayade, police over attempt to thwart PDP rally",
    "summarized_story": "Rivers state governor, Nyesom Ezenwo Wike has berated his Cross River counterpart, Prof Ben Ayade and the police for attempting to thwart the Peoples Democratic Party, PDP, rally in Calabar on Saturday.\nAddressing teeming PDP faithful at the venue of the rally in Calabar, Governor Wike described as disgusting attempt by Governor Ayade and the police to prevent PDP from holding its rally for the Ogoja/Yala Federal Constituency and Akpabuyo State constituency bye elections.\nI told your leader that if you did not hold this rally today, then that would have been the end of PDP.\n“I don’t understand how a governor would for ordinary federal constituency election, ordinary state election, you’re stopping them to hold rally.\n“Mobilise our people for the state constituency election and the federal constituency election."
  },
  {
    "headline": "2023: Buhari, Jonathan tip Anyim for higher responsibilities",
    "summarized_story": "“And I want to thank you (Anyim), for the wealth of experience and the depth of knowledge that we have.\nLike Buhari, Jonathan described Anyim as a unique leader who never allowed the trappings of office to get into his head.\n“The first day I became President, Anyim Pius Anyim wanted to be chairman of PDP and he came to me with a lot of dreams and we spoke.\nThey had many competent people but let me say that it’s like a lot it fell on Anyim Pius Anyim and we made him the Secretary to the Government.\nI didn’t receive too many complaints about Anyim Pius Anyim,” he added."
  },
  {
    "headline": "Enugu Guber: Okwesilieze Nwodo, Sen. Utazi make case for Isi-Uzo",
    "summarized_story": "Former Governor of Enugu State, Dr. Okwesilieze Nwodo, has made case for Isi-Uzo Local Area of the state to produce the successor of Governor Ifeanyi Ugwuanyi in 2023.\nThis came on day the Senator representing Enugu North senatorial zone, Senator Chuka Utazi, spoke in the same line, saying Enugu North zone where the incumbent governor comes from deserved another eight consecutive years.\nThe last governor from Enugu East senatorial zone, which is making strong case to produce Ugwuanyi’s successor.\nThe other LGAs in the zone are Nkanu West, Nkanu East, Enugu East, Enugu South, and Enugu North LGAs.\nAttempts to get reactions from PDP leaders in Enugu East zone, have however proved abortive."
  },
  {
    "headline": "Anyim reacts to killing of northerners, cows in Abia",
    "summarized_story": "Former President of the Senate, Anyim Pius Anyim, has reacted to the killing of about eight northern cattle dealers and slaughtering of several cows in Abia State.\nRecall that hoodlums on Tuesday night, February 16, 2022, attacked the new Abia cattle market in Omuma Uzo, Ukwa West council area, killed traders, mostly northerners and slaughtered their cows.\nReacting to the development, Anyim who spoke at his 61st birthday celebration in Abuja on Saturday, condemned the killing of the cattle dealers.\nAnyim, who called for a minute of silence in honour of the victims, described the killing as “dastardly and condemnable”, urging all Nigerians to live in peace with one another.\nIt is a commitment that all of us irrespective of your religion, irrespective of your geographical location, irrespective of your party affiliation."
  },
  {
    "headline": "EPL: Harry Kane’s brace throws title race wide open as Spurs stun Man City",
    "summarized_story": "Harry Kane netted twice as Tottenham Hotspur defeated Manchester City 3-2 in the Premier League on Saturday.\nThe champions came into the home game looking to stretch their lead at the top of the table to nine points.\nHowever, Spurs took the lead through Kulusevski in the fourth minute of the game.\nKane finished off a Heung-Min Son pass as Antonio Conte’s men retook the lead, but Riyad Mahrez fired home a stoppage-time penalty.\nPep Guardiola’s men are now only six points ahead of second-placed Liverpool, who have a game in hand."
  },
  {
    "headline": "BREAKING: Herdsmen kill three relatives of Gov Ortom in Benue",
    "summarized_story": "Three kinsmen of Benue State Governor, Dr Samuel Ortom, have been killed by gunmen suspected to be Fulani herdsmen.\nThe victims were riding on a motorcycle when they were ambushed and shot dead by the killer herdsmen who have taken over parts of the local government bordering Nasarawa State.\nSecurity agencies, who recovered the bodies, said those who were shot died on the spot from gunshot wounds while the other was brutally macheted to death.\nSoldiers attached to Operation Whirl Stroke recovered the bodies and deposited the corpses at Gbajimba general hospital.\nA statement by the Chief Press Secretary to Governor Ortom, Mr Nat Ikyur, Saturday night, said, “this has been the plight of Benue indigenes in the hands of Fulani herdsmen who have invaded the state in a bid to take over our ancestral lands”."
  },
  {
    "headline": "What I did when bandits blocked road on our way to Kebbi – Shehu Sani",
    "summarized_story": "Senator Shehu Sani, a governorship aspirant in Kaduna State, says some armed bandits blocked their way when they were travelling to Kebbi State for a wedding.\nThe tweet reads, “We were heading to Kebbi for a wedding, we were informed that bandits have blocked the road.\n“Some said we should pray and move on, I’ve joined those who prayed and moved back home”.\nDAILY POST reports that there have been cases of attacks in many parts of the state by the bloodthirsty bandits who have continued to launch attacks on unsuspecting residents.\nA month ago, about 16 people were confirmed killed in an attack on some communities in the Danko Wasagu Local Government Area of the state."
  },
  {
    "headline": "Pantami’s professorial rank legal – Don faults ASUU",
    "summarized_story": "On Monday, ASUU National Executive Committee (NEC) declared its opposition to the rank awarded by the Federal University of Technology, Owerri (FUTO).\nIn a position paper titled ‘University autonomy, meddlesomeness of ASUU and war against Prof Pantami’, Abugu cautioned the body against usurp.\n“As a registered trade union under the Trade Union Act, its Rule book neither contains any clause conferring powers of certification of academic titles nor the power to declare one illegal,” he stressed.\nOn whether Pantami was qualified for the appointment while serving as minister, Abugu called such argument “watery” and based on ignorance.\nThe don listed Ndi Okereke-Onyuike, Ngozi Osarenren, Olakunle Abdul-Rasheed Lawal, Ige Bolodeoku, Musibau Babatunde as prominent citizens who became professors while in government."
  },
  {
    "headline": "Electoral bill: CSOs protest delay of presidential assent",
    "summarized_story": "The civil society community has declared February 22, 2022 as a National Day of Protest to demand immediate assent to the reworked Electoral Bill by President Muhammadu Buhari.\nCivil society networks said they would organise a peaceful public direct-action activities to further the demand to assent the bill.\nIt would be recalled that on the 31st of January 2022, the National Assembly transmitted the Electoral Bill 2022 to the President for assent after reworking the bill.\n“Further aware, the bill, when signed, requires INEC to issue Notice of Election not later than 360 days before the day appointed for an election.\nTherefore, the President has to give assent to the bill on or before 22nd February 2022 if the dates announced for the 2023 elections are to be maintained.”"
  },
  {
    "headline": "UK returns Benin bronze cockerel, Oba head worth £2.5 million",
    "summarized_story": "The Oba of Benin, Omo N’Oba N’Edo Uku Akpolokpolo, Oba Ewuare II, yesterday received during a colourful ceremony at his palace in the Edo State capital, two stolen artifacts: Cockerel (Okpa) and Uhunwun Elao (Oba head) from Europe, worth £2.5 million.\nIshola disclosed that the two artifacts were preserved in their original forms, while the value of the Cockerel today was put at £2 million, with the Oba head valued at £500,000.\nThe high commissioner stated that he was directed by President Buhari to hand over the artifacts to the Oba of Benin.\nHe said: “I have on many occasions met the holders (of the artifacts) and told them that the Benin artifacts were not artworks, but life arts and part of the history of Benin people, not works for commercial value or aesthetics.\nIt was thought that the kingdom (Benin), totally decimated and in ruins in the aftermath of the war, would not rise again."
  },
  {
    "headline": "FCT minister hails corps members on success of area council poll",
    "summarized_story": "Minister of the Federal Capital Territory, Muhammad Bello, has commended the roles played by corps members in the just concluded Area Council Elections.\nThe minister gave the commendation during the passing out Parade of the 2021 Batch ‘A’ Stream I corps members deployed to the FCT.\nBello, who was represented by Mandate Secretary, Social Development Secretariat and Chairman NYSC FCT Governing Board, Hadiza Kabir, added that the corps members displayed commitment and hard work towards the socio-economic development of the FCT.\nNYSC FCT Coordinator, Suleman Abdul, called on the general public to join the clarion call for the establishment of the NYSC Trust Fund which has passed second reading at the National Assembly.\n55 corps members are also to be sanctioned for non-conformity to the NYSC bye-laws."
  },
  {
    "headline": "PDP defies Police in Calabar, flags-off by-election campaign",
    "summarized_story": "The Peoples Democratic Party (PDP) in Cross River State has defied the Police in Calabar, the state capital as it flagged-off campaign for the by-elections to fill the vacant seats in the Ogoja/Yala Federal constituency and the Akpabuyo State Constituency.\n“Be rest assured that I will give the PDP in the state my full support to ensure you win in the by-election and in 2023 elections.\nIf they had succeeded in stopping us from holding the rally, that would have been the end of the party in Cross River ,but we are very resilient people.\nSpeaking earlier the Chairman of PDP in Cross River, Venatius Ikem Esq, expressed satisfaction over the patience by party stalwarts adding that they tried to stop them but it did not work.\nThe rally was attended by all the three senators in the state who are all of the PDP, former Governor Liyel Imoke, members of the House of Representatives from the PDP and numerous party leaders."
  },
  {
    "headline": "Nigeria needs more rebels to move forward – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has said that Nigeria requires honest people as rebels to move her forward.\nObasanjo said people who live life of honesty and integrity have to also be rebels, explaining that life of honesty and integrity embolden one to speak truth to power, not caring a hoot whose ox is gored.\nAccording to Obasanjo, having honest people as rebels remained one of the greatest assets for rebuilding a nation.\nOur country, Nigeria, needs more rebels.\nThose who would look at things straight in the face and say ‘this is not good for Nigeria,” Obasanjo said."
  },
  {
    "headline": "CAN endorses Sanwo-Olu for second term, says performance outstanding",
    "summarized_story": "For the giant strides recorded in Lagos State in the last three years, the Body of Christ in the state has publicly thrown its weight behind Governor Babajide Sanwo-Olu, endorsing the governor for a second term.\nFor this reason, the Body of Christ in Lagos wants Sanwo-Olu to return for a second term.\n“Given the governor’s outstanding performance, the Body of Christ in Lagos State is saying unequivocally that one good turn deserves another.\nHe also praised the First Lady, Dr. Ibijoke Sanwo-Olu, and wife of the Deputy Governor for supporting their husbands with various projects.\nIndeed, we appreciate the support and prayers of the Christian body.”"
  },
  {
    "headline": "Oba of Benin receives £2.5 million worth of looted artifacts",
    "summarized_story": "The two artifacts were among thousands of works of art looted from the Oba Palace during the 1897 British invasion of Benin.\nPresenting the returned artifacts to the monarch at his Palace in Benin City, Amb.\nTunji Ishola, said they were at the palace on the express mandate of President Muhammadu Buhari to personally present the items to the Oba of Benin.\nMy assignment is very simple, to directly bring these objects to Oba of Benin Kingdom.\nHe said he has constantly reminded those holding unto the looted artifacts that the artifacts represent the culture and heritage of the Benin Kingdom and not just artifacts and so, they should return them to their original owners."
  },
  {
    "headline": "Osun APC Primary: Aregbesola absent as Oyetola floors Minister in Ilesa ward",
    "summarized_story": "From Lateef Dada, OsogboThe former governor of Osun State and Minister of Interior, Rauf Aregbesola, was absent at the governorship primary of the All Progressives Congress (APC) held in the state on Saturday.\nReasons for the absence of the Minister could not be ascertained.\nNigerians can now work and earn dollars DAILY from home.\nAt his ward in Ifofin, Ilesa ward 8, Governor Adegboyega Oyetola scored 309 while Moshood Adeoti scored 146.\nMembers of the faction led by Aregbesola, The Osun Progressives (TOP), said the absence of the Minister affected their poor performance, alleging that doctored register was used."
  },
  {
    "headline": "Tension in Osun as APC holds governorship primary election",
    "summarized_story": "From Bamigbola Gbolagunte, OsogboThere was tension in most parts of Osogbo, the Osun State capital and other major towns in the state on Saturday as the All Progressives Congress (APC) held its governorship primary election.\nHowever, security was beef up in many parts of the state, especially Osogbo, Iwo, Ede, Ilesa, Ikirun and Ila-Orangun, hometown of the pioneer national Chairman of the party, Chief Adebisi Akande.\nIt was gathered that the electoral officers who presided over the election in Ede were confronted by some voters who challenged them of being serving councilors in the current administration led by Governor Oyetola who is also contesting the election.\nSurvey by Sunday Sun revealed that the primary election paralyzed commerical and social activities in many parts of the state as there was apprehension among the residents who were afraid of possible violence.\nThere had been rumours of violence and crisis before the election and this made many to lock their shops, while several people stayed indoor during the period of the election."
  },
  {
    "headline": "Cocaine deal: Kyari, 4 others know fate Monday",
    "summarized_story": "The NDLEA has filed multiple applications before the court bordering on the incident preparatory to charging them to court.\nOthers to be charged alongside Kyari are ACP Sunday J. Ubua; ASP Bawa James; Inspector Simon Agirgba and Inspector John Nuhu.\nThey are currently in the custody of the NDLEA where they are being investigated on allegations on involvement in a drug deal.\nThe NDLEA had on Monday February 14, declared Kyari wanted for aiding and abetting drug pushing and running his own cartel.\nThe application by the agency for a detention warrant of the suspects is to make their detention beyond the constitutional period legal."
  },
  {
    "headline": "News in Photographs: Osinbajo in Bayelsa",
    "summarized_story": "Vice President Yemi Osinbajo was in Bayelsa on Saturday, where he flagged off the construction of the Angiama-Oporoma bridge.\nHe was hosted by Bayelsa Governor Douye Diri, and also paid visits to traditional rulers in the state.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "News in Photographs: Buhari Back in Abuja from Belgium",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Saturday returned to the nation’s capital Abuja, Abuja, after a three-day stay in Brussels, the capital of Belgium to attend the 6th EU – Africa Summit.\nOther issues discussed at the Summit included Education, Culture and Vocational Training, Migration and Mobility; Agriculture and Sustainable Development and Health Systems and Vaccine Production.\nThe President also used the opportunity to attend some bilateral engagements with regards to various issues of interest to Nigeria.\nHe was accompanied on the trip by the Minister of Foreign Affairs, Geoffrey Onyeama, Minister of Health, Dr Osagie Ehanire, Minister of State for the Environment, Sharon Ikeazor.\nThe National Security Adviser, Maj.Gen."
  },
  {
    "headline": "War in Osun as Oyetola, Adeoti, Battle for APC’s Guber Ticket Today",
    "summarized_story": "The Osun State Governor and Aregbesola have been at loggerheads for almost three years, over the control of the state and the party.\nOyetola is seeking the party’s ticket to run for a second term while Aregbesola and his political movement, The Osun Progressives (TOP) are backing erstwhile Secretary to the Osun State Government, Moshood Adeoti to unseat Oyetola.\nAregbesola: Oyetola Waging War against MeOn the other hand, Aregbesola alleged that Oyetola had been waging a war against him since becoming the governor.\n“Since Oyetola assumed office, he has waged a war against me as if I once harmed him.\nReceiving the Governor in his palace, the Ataoja of Osogbo, Oba Jimoh Olanipekun, threw his weight behind Governor Oyetola whom he described as a promise keeper."
  },
  {
    "headline": "APC Set to Postpone National Convention by Two Weeks",
    "summarized_story": "Caretaker Committee to meet President for approvalBy Adedayo AkinwaleThe National Convention of the All Progressives Congress (APC) scheduled for February 26 may not be held on that day after all.\nTHISDAY can authoritatively confirm that the convention will be postponed by two weeks.\nEfforts to speak to the Chairman, Caretaker/Extraordinary Convention Planning Committee (CECPC) of the party, who is also the Governor of Yobe State, Mai Mala Buni, on this latest development proved abortive.\nThe source who preferred anonymity said, “The convention has been postponed by two weeks but it is not official yet.\n“So, they have to know whom; they have to know which zone he is from before they can now zone the remaining offices based on that."
  },
  {
    "headline": "WHO Names Nigeria among Six African Countries to Receive Technology for Production of COVID-19 Vaccine",
    "summarized_story": "Ghebreyesus who announced this yesterday at the European Union – African Union summit in Brussels said the countries all applied and were selected as recipients.\nThe mRNA vaccines are different from most vaccines which contain a weakened or inactive piece of the target virus which triggers the production of antibodies.\nThis technology is used in the production of Pfizer and Moderna COVID vaccines.\nHe expressed delight at receiving the news of the selection of Nigeria among recipients of mRNA Vaccine technology transfer.\nAlso French President, Emmanuel Macron said: “Improved public health benefits, supporting African health sovereignty and economic development are the principal goals of strengthening local production in Africa."
  },
  {
    "headline": "EXCLUSIVE: Oba Of Benin In Modern Slavery Scandal, Uses Influence To Detain Palace Aide Who Served Him From Age 15 In Prison For Months, Denies Him Bail Over Allegation Of Stealing",
    "summarized_story": "\"Some time ago, Nelson tried to run away from the palace because of the maltreatment and hardship he had endured.\nSaharaReporters learnt that Oghogho and the other were accused of stealing N200 million cash from the palace.\n\"Initially, he (Oba of Benin) said it was $20,000, then, he said N10 million, when he saw that he wasn’t getting as much solidarity.\n\"I don't understand the case you are talking about, the case is in court, do you want Omo n'Oba (Oba of Benin) to react to that?\nOba of Benin in Modern Slavery Scandal, Uses Influence to Detain Palace Aide Who Served Him From Age 15 in... by Sahara Reporters on Scribd"
  },
  {
    "headline": "EXCLUSIVE: Oba Of Benin In Modern Slavery Scandal, Uses Influence To Detain Palace Aide Who Served Him From Age 15 In Prison For Months, Denies Him Bail Over Allegation Of Stealing",
    "summarized_story": "\"Some time ago, Nelson tried to run away from the palace because of the maltreatment and hardship he had endured.\nSaharaReporters learnt that Oghogho and the other were accused of stealing N200 million cash from the palace.\n\"Initially, he (Oba of Benin) said it was $20,000, then, he said N10 million, when he saw that he wasn’t getting as much solidarity.\n\"I don't understand the case you are talking about, the case is in court, do you want Omo n'Oba (Oba of Benin) to react to that?\nOba of Benin in Modern Slavery Scandal, Uses Influence to Detain Palace Aide Who Served Him From Age 15 in... by Sahara Reporters on Scribd"
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "LIVE: Allegations of voter disenfranchisement mar Osun APC guber primary",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "LIVE: Allegations of voter disenfranchisement mar Osun APC guber primary",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "Great job, Marwa, but watch your back",
    "summarized_story": "I must at this point admit that I am by no means surprised that Marwa has raised the bar — yet again — in public service.\nAdvertisementBorno residents started sleeping well, further helped by the fact that Marwa also did quite some job in education, agriculture and infrastructure.\nMarwa soon travelled abroad on military posting as defence attaché at the Nigerian permanent mission to the UN.\nIn 1996, he resurfaced in Nigeria when he was appointed the military administrator of Lagos state by Gen Sani Abacha, then head of state.\nMarwa introduced Operation Sweep, a joint military patrol, and the pervasive insecurity was quickly brought under control."
  },
  {
    "headline": "Great job, Marwa, but watch your back",
    "summarized_story": "I must at this point admit that I am by no means surprised that Marwa has raised the bar — yet again — in public service.\nAdvertisementBorno residents started sleeping well, further helped by the fact that Marwa also did quite some job in education, agriculture and infrastructure.\nMarwa soon travelled abroad on military posting as defence attaché at the Nigerian permanent mission to the UN.\nIn 1996, he resurfaced in Nigeria when he was appointed the military administrator of Lagos state by Gen Sani Abacha, then head of state.\nMarwa introduced Operation Sweep, a joint military patrol, and the pervasive insecurity was quickly brought under control."
  },
  {
    "headline": "Air Peace, Arik Air increase base fare for economy flights to N50,000",
    "summarized_story": "Nigerian airlines have increased the cost of economy flight tickets for domestic routes from about N35,000 to a base fare of N50000, TheCable understands.\nThe airlines include Azman Air, Max Air, Ibom Air, Arik Air, Air Peace and Dana Air.\nIbom Air for the day costs N53,000 while Arik Air, Air Peace and Dana Air fixed above N50,000 for an economy seat.\nOn the other hand, flights from Lagos to Port Harcourt is pegged at N50, 750 for United Nigeria, Air Peace N50,000 and Arik Air at N50,250.\nAdvertisementAllen Onyema, vice-president of AON and chairman/CEO of Air Peace, did not answer his calls."
  },
  {
    "headline": "Flutterwave launches SME lending, fintech-as-a-service in vision 3.0",
    "summarized_story": "Led by founder and CEO Olugbenga Agboola, the company facilitates cross-border payments transactions of small-to-large businesses in Africa via one API.\nGet the best African tech newsletters in your inboxFlutterwave Capital, the new SME loans product, is offered in partnership with the company’s lending partners—CashConnect Microfinance Bank, MoneyWise Microfinance Bank, Wema Bank, Zenith Bank, Stanbic IBTC Bank, and Sterling Bank.\n“With Flutterwave Capital, we’re making it easier for business owners to access the funds they require to grow their businesses.\nFlutterwave also helps businesses outside Africa expand their operations on the continent with an international clientele that includes Booking.com, Flywire, and Uber.\nThe latest financing thus brings its total investments secured since launched in 2016 to $475 million (plus a $35 million Series B in 2020 and a $20 million Series A in 2018)."
  },
  {
    "headline": "Crypto crime grows to $14 billion as crypto popularity increases",
    "summarized_story": "In 2021, crypto criminals made a killing, as illicit crypto transactions hit $14 billion, a 79% jump from the $7.8 billion recorded in 2020, according to a report by US-based blockchain analytics company, Chainalysis.\nThe growth in illicit crypto transactions is attributed to a 567% jump in overall transaction volume in 2021.\nGiven that overall crypto transactions grew to $15.8 trillion in 2021, it is not surprising that cybercriminals are increasingly using crypto.\nDespite the increase in the total volume of illicit transactions, illicit transactions represented just 0.15% of the total cryptocurrency transaction volume in 2021—its lowest ever.\nWhat this means is that legitimate crypto transactions far outstrip illegal transactions."
  },
  {
    "headline": "Inside Ckrowd’s plan to help African creators monetise their content",
    "summarized_story": "This means African creators are still struggling to earn much from their craft, compared to their global counterparts.\nAt KAM Africa, Adebayo started an initiative that would help creative professionals like musicians and actors understand the business part of their craft.\nThink of a marriage between OnlyFans, Patreon, and YouTube—in fact, a combination of all the streaming platforms out there—but now for African content.\nOn Ckrowd, creators can livestream their content like uduX live and upload on-demand contents like on Netflix.\nThe platform pays 70% of total income on content to creators, which we believe is the highest pay-out on digital content to African creators,” said Adebayo."
  },
  {
    "headline": "From telecoms to tech: MTN changes logo to look the part",
    "summarized_story": "Africa’s biggest telecom company MTN is preparing for a brand refresh that’ll position it as a technology company, rather than a telecommunications company.\nThe brand refresh includes forgoing the white, yellow and red lettering in favour of a black lettered MTN logo surrounded by an oval, similar in shape to a rugby ball.\nThe new look is “aligned to our evolution from a telecommunications company to a technology company underpinned by one simple and consistent yet striking brand”, Morafo said.\nCurrent MTN logoNew MTN LogoMTN’s expansion drive to become a fully-fledged technology services company also means that it’s on a hiring drive to hire 150 digital experts in South Africa.\nThis rebrand will help shift public perception of the MTN brand and also influence its market valuation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "It’s all about seed rounds ￼",
    "summarized_story": "For example, some freight companies in Africa still manage their shipments using outdated methods like spreadsheets, phone calls, and emails.\nAnd this company has announced $4 million in seed funding to expand across the country and into neighbouring regions.\nIt also saw participation from XYZ Ventures, Village Global, Musha Ventures, Ventures Platform, Voltron Capital, and Paystack CEO Shola Akinlade.\nNonso Onwuzulike officially launched the company in January 2022 to improve employees’ financial well-being.\nWhat’s more, the company will use the seed funding to speed up the development of its platform to serve large enterprise employers."
  },
  {
    "headline": "Learning the VC game, Flutterwave’s $3bn valuation and CrowdForce’s $3.6m raise",
    "summarized_story": "AdvertisementToday, we’re discussing:Why female founders should learn the venture capital gameFlutterwave’s $3bn valuationCrowdForce’s $3.6m pre-Series AWomen should play the VC gameIn 2021, women got less than 1% of startup funding.\nAccording to her, women need to learn the rules of the VC game and know what works and what doesn’t.\nIn her chat with Chimgozirim, she detailed the rules and tactics that could mean better odds for women in winning the venture capital game.\nRead all about it here: Female founders need to learn how to play the venture capital game– Sarah DusekFlutterwave’s $3bn valuationFlutterwave has come a long way since it was founded in 2016.\nAway from fintech: Flutterwave also displayed interest in the creator economy with the acquisition of Disha, a platform that allows creators to curate content and receive payment."
  },
  {
    "headline": "Female founders need to learn how to play the venture capital game — Sarah Dusek",
    "summarized_story": "Share this article:A cursory look at the venture capital landscape in Africa will reveal an impressive number of deals and the triumph of innovation over regulation.\nAccording to Sarah Dusek, Managing General Partner at Enygma Ventures, who spoke to Techpoint Africa on Zoom, a second reason is that most women don’t know how to play the venture capital game.\nWith venture capital a novel concept in Africa, not too many people, regardless of gender, understand how it works.\nThat decision birthed Enygma Ventures, a sector-agnostic firm providing women with the capital required to scale and grow their businesses.\nVenture capital is, in many ways, a numbers game, and the more women there are building companies that investors like, the higher the chances of women receiving investments."
  },
  {
    "headline": "Aregbesola alleges fraud in APC guber primary",
    "summarized_story": "Rauf Aregbesola, minister of Interior and a former governor of Osun State, has described as a sham the gubernatorial primary election of the All Progressives Congress (APC) that took place Saturday.\nHe urged his supporters to remain calm and not agitated, while he studies the reports of the election.\nWhen Adeoti’s defeat in the election became clear, Aregbesola asked his supporters not to be downcast by the outcome, but to rather hold their heads high.\nAdeoti lost to Oyetola, who was solidly supported by Bola Ahmed Tinubu, a national leader of the ruling party.\nWe have heard of how party registration cards were being hawked this morning to the supporters of the state governor."
  },
  {
    "headline": "What CBN’s non-oil FX plans means for Nigeria",
    "summarized_story": "The “RT200 FX Programme” stands for “Race to $200 billion in FX repatriation.” With oil receipts – the major source of Nigeria’s FX earnings under pressure due to evacuation challenges in Nigeria’s oil sector, Emefiele sees the RT200 as a major route to raising non-oil FX earnings.\nThe RT200 programme has five key anchors, which include value-adding exports facility, non-oil commodities expansion facility, non-oil FX rebate scheme, dedicated non-oil export terminal and bi-annual non-oil export summit.\nWith the majority of current non-oil commodity exports being unprocessed, processing should increase Nigeria’s FX earnings.\n(I)The third anchor, the non-oil FX rebate scheme, aims to reward non-oil exporters that repatriate FX earnings back into the I&E window to boost liquidity in the market.\nThe final anchor is a biannual non-oil export summit with its inaugural event scheduled for the first week of April 22."
  },
  {
    "headline": "Aregbesola loses ward to Oyetola as gov wins ward in Osun APC guber primary",
    "summarized_story": "BusinessDay reports that Governor Gboyega Oyetola won his Ward at Iragbiji in Boripe Local Government Area of the state.\nOyebade stated that 2,053 party members were accredited for the exercise and 1,612 party members cast their votes for the governor, while 441 didn’t vote.\nSpeaking after he cast his ballot at his Iragbiji ward, Governor Oyetola noted that the exercise was a family affair as he urged party members to brace up for the challenges ahead.\nHe said APC members had trooped out in large numbers to show appreciation to Governor Gboyega Oyetola for executing life-changing projects in the area.\nOyebamiji, who appreciated the security arrangement for the poll, also lauded the comportment of the party members during the primary."
  },
  {
    "headline": "SERMON: THIS DRUNKENNESS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest1 “ Wine is a mocker strong drink is raging and whosoever is deceived thereby is not wise” Prov.\nNow therefore, beware, I pray thee and drink not wine or strong drink, and eat not any Maclean thing.” Judges 13:3-4 she obeyed God.\nMany have been deceived into alcohol because they see Priests and Pastors who drink alcohol.\nWhat you have to do now if you still drink alcohol, is to come truly to Christ and surrender your life to him and ask for a new life.\nRemember that all that God would use would be filled with the Holy Spiritand not with alcohol or strong drink."
  },
  {
    "headline": "Presidency faults reports by IMF, others on Nigeria debt profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Presidency on Tuesday faulted the recent reports by International monetary fund (IMF) and Agusto and CO. on the growth of Nigeria’s debt service and debt levels over the years.\nA press statement emanating from the office of the Debt management office, Abuja and made available to the Nigerian OBSERVER in Benin City yesterday Stated that the author of the alleged evil reports have failed to consider the challenges experienced by Nigeria in recent times as a result of two recessions, sharp drop in Revenues and security challenges.\nThe presidency further noted that the analysis as reported do not acknowledged the improvements in infrastructure which have been achieved through borrowing as well as the strong measures by the Government to grow revenues.\nAccording to the Presidency, “The DMO reiterated the fact that the Government is already implementing policies towards increasing revenues and developing infrastructure through Public Private Partnership arrangements both of which improve debt sustainability”.\nContinuing, the DMO also noted that the Government has active and regular engagements with the IMF on borrowing and debt management, adding that with this case the reports have fail to consider the challenges experienced by Nigeria in recent times."
  },
  {
    "headline": "Industrialisation: 2,500bpd modular refinery, 5MW power plant, others set to go live in Edo next month – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Barring any last-minute changes, a 2,500 barrel per day (bpd) modular refinery, five megawatts power plant, 40-million-scf gas processing facility, and a data centre, among others, will come on stream in Edo State in March, 2022, after necessary regulatory certifications from the Nigerian Midstream and Downstream Regulatory Authority (NMDRA).\nThe company plans to develop the park in phases, with the first phase comprising a 10,000 barrel per day refinery, 60-million-scf gas processing facility, 10-million-scf compressed natural gas (CNG) facility, 50 megawatts power plant and a data centre.\nThe project is financed by the First City Monument Bank (FCMB), Nigerian Content Development & Monitoring Board (NCDMB), among others.\nChief Executive Officer of the DMCL, Dr. Akintoye Akindele, during an inspection of the facility, said the plant will be ready by the end of March.\nIn that way, we will be able to utilize assets optimally, avoid wastage, look after the environment and create jobs,” he said."
  },
  {
    "headline": "Revamped Edo College of Education kicks off academic activities Q3 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the newly revamped multi-campus Edo College of Education with sites in Igueben, Abudu and Afuze, will begin academic activities before the end of 2022.\nThe government, however, said the academic calendar of the defunct College of Education in Igueben will not be truncated, promising that students of the defunct college will graduate as and when due.\n“Edo College of Education is yet to take off but the College of Education, Igueben no longer exists.\nIgueben is the main campus and it will focus on training secondary school as well as technical and vocational education teachers.\nAbudu is one of the campuses focusing on training early childhood and basic education teachers."
  },
  {
    "headline": "Osun APC Primary: Aregbesola’s camp kicks as Gov. Oyetola, Alabi, Oyebamiji express satisfaction",
    "summarized_story": "By Sunday Oguntuyi, OsogboGovernor of Osun State, Mr. Adegboyega Oyetola, has expressed satisfaction with the conduct of the state All Progressive Congress (APC) governorship primary election in the state, just as the camp of a former governor of the state, Rauf Aregbesola has alleged that there is widespread irregularities in the exercise.\nThe fact is that there is only one candidate that is contesting the primary in Osun and that’s the incumbent governor.\nBola Oyebamiji expressed happiness at how people of his Community showed appreciation to good governance delivered by Governor Oyetola.\nOyebamiji appreciated the security architecture and the comportment of the people, noting that the exercise was being held under peaceful and conducive environment.\nMeanwhile, the chairman of Aregbesola’s splinter group in the party, The Osun Progressives , Mr. Rasaq Salinsile has faulted the primary election , saying it’s effort in futility."
  },
  {
    "headline": "Tension in Osun as APC holds governorship primary today",
    "summarized_story": "By Olusesan LaoyeThe political atmosphere in Osun State, is intense Saturday morning, as the ruling party in the state, the All Progressive Congress (APC), holds its governorship primary election amid escalating rift between the incumbent governor of the state, Gboyega Oyetola and his predecessor, Rauf Aregbesola.\nAcross Osogbo, the state capital, there is presence of the security personnel at every corner, signaling that they are ready to deal with any one who forments trouble, but their mere presence has made residents apprehensive.\nSecurity men, including the Police, the Army, Civil Defence, DSS, among others, are seen patrolling the streets Osogbo and other major cities in the state.\nAregbesola is supporting the former Secretary to the government during his tenure, Moshood Adeoti against Oyetola who wants the ticket of the party for a second term.\nThe feud between the duo also heightened the frosty relationship which has been existing between Tinubu and Aregbesola."
  },
  {
    "headline": "Osun PDP faction rejects appointment of Sunday Bisi as acting chairman",
    "summarized_story": "By Sunday Oguntuyi, OsogboA faction of the Osun State Chapter of the Peoples Democratic Party, has frowned at a letter “purportedly communicating” a decision of the National Working Committee of the party to appoint Mr Sunday Bisi as the acting chairman of the party.\nThe members, including the acting chairman of the faction, Wale Ojo, maintained that they were the authentic Exco of the PDP in the state.\n“Let me say to you in clear terms, this is about constitionality and in the face of the law I remain the valid and legally recognized State Acting Chairman of Osun PDP.\nHe should desist from walking on the same path as the erstwhile occupant of that office, Prince Uche Secondus did.”A former Chairman of the Party in Osun, Barr.\nOjo Williams, said “the Peoples’ Democratic Party which you all know is a democratic and law abiding party."
  },
  {
    "headline": "9PSB CEO Seeks Targeted Content to Accelerate Nigeria’s Financial Inclusion",
    "summarized_story": "Mracajac made this assertion, while presenting a keynote address, themed “Content Creation and Financial Inclusion; The Future of Digital Banking” at the Tech Summit Ogun 2022, which held at the Olusegun Obasanjo Presidential Library Abeokuta, Ogun State on Thursday February 17, 2022.\nAccording to her, while there are ongoing efforts to support the country’s financial inclusion drive, a lot more rest on formulating tailored strategies that address specific needs.\nShe added that, developing content that speaks only to the already banked and mirroring the digital financial habits of those who are fully included and heavily banked, will not help to keep the newly on-boarded in the system long-term.\nThe second one, she stated, is needed for sustainable Financial inclusion: delivery of digital banking services that are a reflection of the lifestyle of the currently unbanked and underserved population.\nShe called on all stakeholders within the financial ecosystem, including content creators to work collectively to develop and implement a digital content strategy for the unbanked to move the financial inclusion needle and ultimately advance the economy, society and improve life of every Nigerian."
  },
  {
    "headline": "2023: Northern Muslim League Calls For Igbo Presidency",
    "summarized_story": "A religious group under the aegis of United Muslim Ummah League (UMUL) has thrown its weight behind the clamour for Igbo presidency come 2023.\nThe Muslim group also said it was high time the other five geo-political zones agree to support the Igbos for the seat of the President of Nigeria in the interest of equity, fairness and justice.\n“From our records, we discovered that it is only Enugu State that the Governor has deliberately worked assiduously to ensure that Christians and Muslims live in peace.\nWe have discovered too that our Northern brothers in Enugu are protected each time there were threats of breach of peace in the east,” they said.\n“We also strongly believe that Governor Ifeanyi Ugwunayi if elected will replicate the steps taken in Enugu State to promoting peace, security, national unity and good governance.”"
  },
  {
    "headline": "MAAUN Names Road After Niger Republic’s Higher Education Minister",
    "summarized_story": "The event which took place on Wednesday, February 16, was graced by the Kano State Commissioner for Higher Education, Dr Mariya Bunkure and top management staff of MAAUN.\nSpeaking at the occasion, the Minister, Dr Mamoudou Djibo, thanked Prof. Gwarzo and the Management of the university for the honour.\nMeanwhile, Governor Abdullahi Ganduje has called for greater cooperation through strengthening of students exchange programmes and other related issues on collaborations between tertiary institutions in Niger Republic and Kano State.\nHe thanked the delegation from Niger Republic for the visit and assured them of cooperation.\nIn his remarks, the Minister said many years back, students from Niger Republic used to come to Nigeria particularly Kano to study in various tertiary institutions."
  },
  {
    "headline": "Gabon, Equatorial Guinea Take Mbañe Island Dispute To Next Level",
    "summarized_story": "It has been a bone of contention for Gabon and Equatorial Guinea for decades.\nLocated on the Atlantic Ocean, it borders Cameroon, Equatorial Guinea, and the Republic of Congo.\nADVERTISEMENTThe situation looks less and less positive for Equatorial Guinea, as Gabon is backed a powerful global player, the former colonial power.\nThe resource curse that affects both countries makes the small island of Mbañe a tasty morsel for Equatorial Guinea and Gabon.\nThe case seems lost on the part of Equatorial Guinea and the loss of another oil-rich area will definitely hit hard on the undiversified economy of Equatorial Guinea."
  },
  {
    "headline": "Gabon, Equatorial Guinea Take Mbañe Island Dispute To Next Level",
    "summarized_story": "It has been a bone of contention for Gabon and Equatorial Guinea for decades.\nLocated on the Atlantic Ocean, it borders Cameroon, Equatorial Guinea, and the Republic of Congo.\nADVERTISEMENTThe situation looks less and less positive for Equatorial Guinea, as Gabon is backed a powerful global player, the former colonial power.\nThe resource curse that affects both countries makes the small island of Mbañe a tasty morsel for Equatorial Guinea and Gabon.\nThe case seems lost on the part of Equatorial Guinea and the loss of another oil-rich area will definitely hit hard on the undiversified economy of Equatorial Guinea."
  },
  {
    "headline": "Osinbajo Seeks Award Of Severe Costs For Justice Delay",
    "summarized_story": "He said addressing delays in the administration of justice should involve imposing sanctions by a more intentional regime for the award of adverse and wasted costs.\n“Adverse costs are paid to the successful party in a civil case and wasted costs are directed against legal practitioners for poor professional standards in the conduct of a case.\n“Severe costs should attend adjournments, there is no greater waste of taxpayer’s funds than for a scheduled case to have to be adjourned.\n“The notions of justice that would meet public expectations of fairness and equity are those that promote substance over form.\nThe observance of technicality over merit will always alienate the system of justice from the people it is meant to serve,” he said."
  },
  {
    "headline": "BUK first class graduate Sule Matthew shot dead in Anambra",
    "summarized_story": "Sule Matthew, a first-class graduate of Information and Media Studies of Faculty of Communication, Bayero University Kano (BUK) has been shot dead while traveling to Anambra State.\nMatthew was killed with other passengers at Ekwulobia, one of the largest cities in Anambra State, according to PR Nigeria.\n“Prior to this sad news, I kept calling him on phone but couldn’t reach him then suddenly we heard this sad news.\nI am so shocked,” Binta Musawa, Mr Sule’s course mate stated.\nMr Mathew hails from Ayangaba Kogi State."
  },
  {
    "headline": "2023 presidency: Bayelsa traditional rulers root for Osinbajo",
    "summarized_story": "By Chijioke OkoronkwoThe Bayelsa Traditional Rulers Council on Saturday said Vice President Yemi Osinbajo has the potential to be a good president.\nKing Malla Sasime, Vice Chairman, Bayelsa Traditional Rulers Council, expressed this view while receiving Osinbajo who paid a courtesy call on traditional rulers at the Bayelsa Traditional Rulers Council Secretariat on Saturday in Yenagoa.\nThe traditional ruler thanked Osinbajo for the visit and implored him to maintain the cordial relationship with the state.\nHe said sure desires could only be achieved if everyone works together, the federal, state, local governments working together.\nOsinbajo was earlier presented with a traditional gift — a walking stick — to match the Ijaw traditional attire he adorned."
  },
  {
    "headline": "Expose Tinubu Secrets Now, Before He Destroy You – Reno Tells Aregbesola",
    "summarized_story": "Reno Omokri, a former Presidential adviser, has urged Minister of Interior Rauf Aregbesola to reveal the mystery behind the All Progressives Congress’s (APC) National Leader Bola Tinubu’s wealth.\nIn a post on his official Facebook page, Omokri urged Buhari’s Minister to expose the real age and other secrets Tinubu, a 2023 presidential candidate, may have been keeping from Nigerians.\nHe said, “See how you have been disgraced by Tinubu and Oyetola in Osun.\nBecause if you remain silent now, Oyetola and Tinubu will only grow politically stronger.\nImagine how miserable your life will be with Tinubu in Aso Rock and Oyetola in Osogbo."
  },
  {
    "headline": "APC: Aspirants Write Planning Committee, Want National Convention Postponed",
    "summarized_story": "Read the full text of the open letter:“Forum of Aspirants for 2022 National ConventionHis ExcellencyMai Mala BuniExecutive Governor of Yobe State/ChairmanAPC Caretaker/Extraordinary Convention Planning CommitteeDear Governor Mai Mala Buni,Please Call off the National Convention Now!\nThis advisory is hinged on the facts before us regarding the suitability of holding the party’s national convention on the proposed date.\nHowever, it is our opinion that it would spell doom for the party should the party go ahead with the national convention now.\nIt is common sense that the party is not in the proper position to hold a national convention any time soon.\nThe truth remains that the February 26 date for the party’s national convention is not realistic."
  },
  {
    "headline": "Bandits Abduct Monarch’s Son, Seven Others In Taraba",
    "summarized_story": "Bandits Abduct Monarch’s Son, Seven Others In TarabaGunmen kidnapped eight people, including the son of the district head of Zip town, Alhaji Uba, at Illela Village in Taraba State’s Karim Lamido Local Government Area, according to the Daily Trust.\nDauda Suleiman, a hamlet resident, claimed that the bandits had taken control of the area and were freely moving with firearms at all hours of the day and night.\nSuleiman claimed that security agents were not present because numerous people, including ladies, were robbed and kidnapped.\n“The bandits have taken over the neighborhood and caused many residents to flee,” he explained.\nThe abductors had sought a ransom of N70 million, according to the district head, who verified that his son was among the abductees."
  },
  {
    "headline": "Presidency: Tinubu Will Use ‘Magic’ To Fix Nigeria — Sanwo-Olu",
    "summarized_story": "If elected in 2023, Lagos State Governor Babajide Sanwo-Olu claims Bola Tinubu, an All Progressives Congress (APC) presidential candidate, will use a “magic wand” to solve Nigeria’s problems.\nAccording to Sanwo-Olu, Tinubu is aware of the country’s problems and, as a result, has a solution.\nHe encouraged Lagos State lawmakers to try to ensure Tinubu’s election as Nigeria’s next president.\nHe said, “Tinubu knows the issues plaguing our nation like the back of his hands and he has the magic wand to fix it.\n“So, because of our Apex leader, Asiwaju Bola Ahmed Tinubu, it is time for us to take Lagos to Nigeria’s agenda."
  },
  {
    "headline": "Amended Electoral bill hangs as Buhari returns from EU-AU summit",
    "summarized_story": "President Muhammadu Buhari on Saturday returned to Abuja after attending the sixth Europe-Africa Summit in Brussels, Belgium.\nBefore his departure, the President did not sign the much-debated Electoral bill amended by the National Assembly.\nNAN reports that Buhari departed the country on February 16, to join other African and European leaders to discuss issues of mutual concerns to both continents.\nDuring the G4 meeting, the leaders resolved to strengthen the platform for the resolution of the various issues confronting the African continent.\nHe equally stressed the need to nip the root causes of extremism, conflicts and tensions in Africa."
  },
  {
    "headline": "Police to the rescue as man nails teenager on tree",
    "summarized_story": "In Kenya, Police are investigating a matter where a teenager was nailed on a tree for suspected theft.\nThe 19-year-old identified as Collins Sambaya is said to have been assaulted by one Elvis Irime by nailing him on a tree on the allegation that he had stolen his radio.\nThe matter was reported by the area chief Evans Endesha by phone.\n“It was reported by North Izava location chief namely Evans Endesha by phone that he received a report that a person had been nailed on a tree by some people,” part of the police report read.\nAfter the reports, the police immediately swung into action and visited the scene where they confirmed that the teenager had been nailed on a tree."
  },
  {
    "headline": "Osun APC governorship primary: Again, Aregbesola cries foul as Oyetola leads",
    "summarized_story": "The result of Saturday’s governorship primary of the All Progressives Congress (APC) in Osun state is about now being collated with incumbent governor Gboyega Oyetola reportedly leading.\nThough, official results from wards are yet to be announced, immediate past governor Rauf Aregbesola is already crying foul.\nIn a statement by his media adviser Sola Fasure, Aregbesola alleged that careful study of various reports he has received so far, the primary was characterised by vote-buying, absence of result sheets, absence of INEC officials, and disenfranchisement.\nBoth Aregbesola and Oyetola who was his Chief of Staff when he was governor have been at political loggerhead, a situation that has led to palpable tension within the state.\nAregbesola, though not contesting, has his anointed candidate, Moshood Adeoti, in the primary."
  },
  {
    "headline": "Nigeria Needs More Rebels To Speak Truth To Power, Says Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria needs more rebels who will speak truth to power not minding whose ox is gored.\n“Our country, Nigeria, needs more rebels,” he said in his brief remarks while addressing an audience at the event.\n“Those who would look at things straight in the face and say, ‘This is not right!\n“Looking at the title of the book, I ask myself, why would someone call himself a rebel?” Obasanjo queried.\nThe truth is that if you have to live a life of honesty and integrity, you have to become a rebel."
  },
  {
    "headline": "Oba Of Benin Takes Delivery Of Looted ‘Okpa,’ ‘Ilahor’ Returned From UK",
    "summarized_story": "﻿The Bronze cockerel known as ‘Okpa’ and the Oba head bronze known as ‘Ilahor’ have been returned to the palace of the Oba in Benin City, Edo State capital.\nThe artefacts were returned in a ceremony held on Saturday at the Oba Palace.\nThe bronzes were accompanied by the Nigerian High Commissioner to the United Kingdom Sarafa Tunji Ishola and other officials from the UK.\nAlso in October 2021, the University of Aberdeen handed over a Benin Bronze to Nigeria after over 100 years since it was looted by British forces.\nThe sculpture, which depicts the head of an Oba (king), is one of the thousands of religious and cultural artefacts looted by British forces in 1897 during the destruction of Benin City in present-day Nigeria by a British military expedition."
  },
  {
    "headline": "Osun APC Governorship Primary Lacks Credibility, Fairness – Aregbesola Faction",
    "summarized_story": "﻿A faction of the All Progressives Congress (APC) loyal to former Governor Rauf Aregbesola has condemned the party’s governorship primary election in Osun State.\nIn a statement by its spokesman, Abiodun Agboola, the faction alleged widespread irregularities in the exercise conducted by the Osun APC Primary Election Committee led by Governor Abdulrahman Abdulrasaq of Kwara State.\n“The Governor Abdulrahman Abdulrasaq led Osun APC Primary Election Committee should know that the primary lacks credibility and fairness,” it said.\n“It is necessary and important to inform the general public and Governor Abdulrahman Abdulrasaq led Osun APC Primary Election Committee of the ongoing irregularities in the conduct of the primary election of the All Progressives Congress (APC) in the State of Osun.\n“We strongly condemned the conduct of the primary election because it is nothing but a sham with a fraudulent process to favour Governor Adegboyega Oyetola."
  },
  {
    "headline": "Oyetola Wins Ward In Osun APC Governorship Primary",
    "summarized_story": "﻿Osun State Governor, Adegboyega Oyetola, has won the contest at his ward in the governorship primary election of the All Progressives Congress (APC) in the state.\nThe APC conducted the primary using the direct mode across the wards in the state.\nREAD ALSO: Shun Violence In Osun APC Governorship Primary, Aregbesola Tells SupportersAccording to the result announced in Oyetola’s ward, the governor has 1,612 votes from party faithful while his two co-contenders recorded zero votes.\nIn his reaction, Governor Oyetola commended the process which he described as free and fair.\nIn the build-up to Saturday’s primary, there has been a division within the ruling party in the state following a disagreement between incumbent Governor Oyetola and his predecessor, Mr Rauf Aregbesola."
  },
  {
    "headline": "Germany, Ukraine Push Back Against US Warnings",
    "summarized_story": "Germany’s foreign minister warned Saturday against trying to guess or assume Russia’s decisions on Ukraine, toning down the rhetoric after Washington’s fierce warnings of an imminent invasion.\n“Pull your troops back, avoid damage to Russia and Ukraine and let us talk,” Baerbock said in an appeal to Putin.\nBut the message of unity was slightly undermined by Baerbock’s refusal to echo US claims that Russia could invade Ukraine any moment now.\nSpeaking on the main stage in Munich, Zelensky said it was “difficult for me to judge” the US intelligence behind the warnings, but “I trust Ukrainian intelligence, who understand what’s going on along our borders”.\n“Every indication indicates that Russia is planning a full-fledged attack against Ukraine,” Stoltenberg said."
  },
  {
    "headline": "Nigeria needs more rebels to speak truth to power- Obasanjo",
    "summarized_story": "A former President, Olusegun Obasanjo said Nigeria “needs more rebels” who would speak the truth to power not minding whose ox is gored.\nThis, he said, remains one of the greatest steps towards rebuilding Nigeria.\nAdvertisementHe made this known in Abeokuta, while unveiling the autobiography of the Babanla Adinni of Egbaland, Tayo Sowunmi, titled “Footprints Of A Rebel.”He noted that for Nigeria to move forward, it requires “more rebels” who stand and speak for the truth.\nAdvertisementHe added that whoever must leave a life of honesty and integrity has to be a rebel."
  },
  {
    "headline": "Osun APC members vote to elect party's governorship candidate -",
    "summarized_story": "Members of the ruling All Progressives Congress in Osun State are filling out at their various wards to vote to candidate of their choice.\nAt ward one in Osogbo local Government the party faithful had started arriving by 8 in the morning and are being accredited.\nAt Ward three also in Osogbo local Government, the exercise is going on smoothly as accreditation is underway.\nThe accreditation exercise is to be rounded off at noon after which voting will commence immediately and end at 2pm through option A4.\nAdvertisementThe state Commissioner for Special Duties and regional integration commended the peaceful conduct of members."
  },
  {
    "headline": "Zamfara APC Factions in War of Words over invasion of Court by Thugs -",
    "summarized_story": "The All Progressives Congress loyal to Senator Kabiru Marafa in Zamfara State is accusing the Matawalle Faction of sponsoring hoodlums to attack its Members and lawyers at the state high court in GusauThe Marafa faction says they were attacked shortly after a court sitting on the Ward, Local Government and State Congresses which held in the state in November 2021AdvertisementThey want security agencies to Investigate the incident and arrest perpetratorsAdvertisementAdvertisementThe Crisis between the Senator Kabiru Marafa faction of the APC and that of Governor Bello Matawalle started a few days after the formal Defection of Governor Bello Matawalle from the PDP to the Ruling APCThis time around, the Marafa faction is accusing the Zamfara state APC of Sponsoring thugs to attack its Lawyers and party members at the state high courtAdvertisementSpokesperson for the Marafa faction, Bello Bakyaswa says the attack was targeted at eliminating himHe calls on the security agencies to Investigate the incident and arrest perpetrators of the attackAdvertisementResponding to the allegations, Spokesperson of the Matawalle faction Yusuf Idris Gusau denies sponsoring thugs to attack the court, describing the allegations as false, baseless and is a sign of failure on the side of the accusersYusuf Idris insists that the party under Governor Bello Matawalle will not fold it’s hands and watch hoodlums disrupt the peace in the stateAdvertisementHe warns Politicians against using Politics to set the state on fire."
  },
  {
    "headline": "Alao-Akala will be missed for his magnanimity and compassion- Osinbajo -",
    "summarized_story": "Vice President Yemi Osinbajo has described the former governor of Oyo state Adebayo Alao-Akala as an open minded politician who would be missed for his magnanimity and compassion.\nHe said the late governor served the interest of his people when he was in power and gave quality counsel to those who were around him.\nAdvertisementThe Vice President said this while speaking at the final burial ceremony of the former Governor of Oyo state in his Ogbomoso home.\nAccording to him, he was responsible and respectful to the views of individuals and will be missed for his counsel and compassion.\nAdvertisementIn his remarks, Governor of Oyo state, Seyi Makinde Eulogised the former governor, describing him as one who loved everyone regardless of their political differences."
  },
  {
    "headline": "Charles Aniagwu: Governor Ifeanyi Okowa Has Changed the Face of Delta State For Better",
    "summarized_story": "Delta State Commissioner for Information, Charles Aniagwu, highlights the developmental efforts of the Okowa administration in Delta State."
  },
  {
    "headline": "Radio Monitoring Pangolins, The World’s Most Trafficked Mammal",
    "summarized_story": "Over the last decade, Nigeria has garnered a reputation as a central hub for Africa’s illegal wildlife trade.\nWith limited data on pangolins, scientists fear the extinction of the species could be near.\nARISE Correspondent, Laila Johnson-Salami speaks to Dr. Mark Ofua, Founder of Saint Marks Animal Hospital & Shelter in Lagos & Charles Emogor, PhD Researcher at Cambridge University & NatGeo Explorer about the systems being established to track the pangolin species, to provide more data to help preserve them and share more details on the illegal wildlife trade in Nigeria."
  },
  {
    "headline": "Nigerian Sprinter Blessing Okagbare Banned 10 Years for Doping",
    "summarized_story": "Nigeria’s 2008 long jump silver medalist Blessing Okagbare has been banned for 10 years for doping, the Athletics Integrity Unit announced on Friday.\nThe 33-year-old, who is also a sprinter, was expelled from the Tokyo Olympics last year before the women’s 100m semi-finals after testing positive for human growth hormone at an out-of-competition test in Slovakia on July 19.\nRelatedStories No Content Available“The Disciplinary Tribunal has banned Nigerian sprinter Blessing Okagbare for a total of 10 years,” read an AIU statement.\nA copy of the judgment read in part, “For the reasons set out, The Tribunal:“Finds the ADRVs contrary to Rules 2.1 and 2.2 ADR proved;“Imposes a period of Ineligibility of five years concurrently on each of the Rule 2.1 and Rule 2.2 ADRVs;“Finds that the Athlete failed to comply with the Demand and cooperate with the AIU investigation in breach of Rules 5.7.3 and 5.7.7 ADRV and imposes a consecutive period of Ineligibility of five years; and“Therefore, imposes a total period of Ineligibility of ten years which commences on 31 July 2021.\n“The Tribunal also orders that the Athlete’s results from and including 20 June 2021 are disqualified with all resulting consequences including forfeiture of any medals, titles, ranking points, and prize and appearance money.”"
  },
  {
    "headline": "Biden Now ‘Convinced’ Russia Will Launch Invasion of Ukraine",
    "summarized_story": "Biden reiterated his threat of crushing economic and diplomatic sanctions against Russia if it does invade, and pressed Putin to reconsider.\nHe said the U.S. and its Western allies were more united than ever to ensure Russia pays a steep price for any invasion.\nImmediate worries focused on eastern Ukraine, where Ukrainian forces have been fighting pro-Russia rebels since 2014 in a conflict that has killed some 14,000 people.\nShelling and shooting are common along the line that separates Ukrainian forces and the rebels, but targeted violence is unusual in rebel-held cities.\nAround the volatile line of contact, a United Nations humanitarian convoy came under rebel shelling in the Luhansk region, Ukraine’s military chief said."
  },
  {
    "headline": "Canada: Police Arrest 100 in Ottawa after 3-week Protest",
    "summarized_story": "One officer had a minor injury, but no protesters were hurt, interim Ottawa Police Chief Steve Bell said.\nOttawa police made their first move to end the occupation late Thursday with the arrest of two key protest leaders.\nThe emergency act enabled law enforcement authorities to compel tow truck companies to assist.\nOttawa police said earlier that they couldn’t find tow truck drivers willing to help because they either sympathized with the movement or feared retaliation.\nAs police worked to dismantle the siege, Pat King, one of the protest leaders, told truckers, “Please stay peaceful,” while also threatening the livelihoods of the tow truck operators."
  }
]