[
  {
    "headline": "INEC declares Anambra gov election inconclusive, fixes Nov 9 for supplementary poll in Ihiala",
    "summarized_story": "The Returning Officer of the Anambra State governorship election, Professor Florence Obi, has said that a supplementary election will hold in 362 polling units in Ihiala Local Government Area on Tuesday, November 9.\nCiting the constitution, Prof. Obi noted that election had to take place in those polling units for the election to be conclusive.\nShe noted that election did not take place in Ihiala because there were reports of insecurity in the area.\n“As the Electoral Officer, I hereby announce the suspension of results until elections are held in all the polling units in Ihiala.\nShe also stated that the APGA candidate also won in Njikoka, Orumba South, Onitsha North, Idemili North, Ekwusigo, Aguata, Orumba North and Nnewi South local government areas."
  },
  {
    "headline": "Drama as six Imo lawmakers remove Speaker",
    "summarized_story": "There was mild drama at the Imo State House of Assembly on Monday after six lawmakers led by the removed Deputy Speaker, Amara Iwuanyanwu, invaded the house and removed the Speaker, Paul Emeziem.\nThe minority lawmakers immediately elected a ranking member, Kennedy Ibeh, as the new Speaker.\nRead AlsoThe new Speaker was one out of the 18 lawmakers whose names appeared to have signed a resolution, removing the ex-deputy speaker.\nThe new speaker, Ibeh, told our correspondent in a telephone conversation that he would carry every lawmaker along.\nAmara Iwuanyanwu stands impeached.”Copyright PUNCH."
  },
  {
    "headline": "Pantami’s professorship: ASUU panel grills FUTO registrar, recommends litigation",
    "summarized_story": "The panel, therefore, urged the university management to take appropriate actions, including legal action, against those who deliberately tried to drag the image and reputation of FUTO in the mud.\nHe was given a temporary appointment as Professor of Cybersecurity in the Cybersecurity Department, for which he accepted in writing.\nThe Committee discussed the issue and recommended same for approval by the FUTO Council.\nThe external assessment returned positive and the Council at its meeting of 20th August, 2021 approved his appointment as a Professor of Cybersecurity.\nHe was given a tenure appointment as a Professor of Cybersecurity following his appointment by the FUTO Governing Council."
  },
  {
    "headline": "Anambra Decide: CUPP mocks INEC over inconclusive election",
    "summarized_story": "Questions Commission’s capacity to handle future electionsBy Chris Ochayi, ABUJAThe Coalition of United Political Parties, CUPP, has expressed concerns over the failure of the Independent National Electoral Commission, INEC, to conduct a hitch-free, off-season gubernatorial election in Anambra State.\nThe CUPP noted that the massive and fundamental failure of BVAS machines deployed by INEC has clearly shown that the Commission lacks the capacity and or competence to conduct future elections in Nigeria.\n“Having extended the scheduled election to a future date, the cost implications of such extension on Security agencies and Stakeholders especially political parties, cannot be overemphasized and currently hangs on a balance.\nMahmood Yakubu led INEC has furthermore, exposed a disturbing level of lack of sincerity and trust in the Chairman of INEC despite several assurances from him, of a credible election in Anambra State.\n“The effect of this wrongful exclusion of some political parties by Prof. Mahmood Yakubu and his disobedience to subsisting Court of Appeal Judgement has dealt a huge blow to and voided the entire exercise in Anambra State."
  },
  {
    "headline": "APM Terminals Apapa invests over N50m in employee growth in 2021",
    "summarized_story": "By Godwin OritseNigeria’s biggest container terminal, APM Terminals Apapa has invested over N50 million in employee development programs since the start of 2021.\nOver 100 employees have benefited from over 18 different training programs spread across various professional skills.\nMore employee development programs are planned for the latter part of 2021 and 2022.\nIn a statement by the Terminal Manager, Steen Knudsen said continuous investment into employee development and upskilling is the key to success for APM Terminals Apapa.\nAPM Terminals Apapa employee development programs cut across all levels of employees – from the top management to mid-level managers and to junior workers."
  },
  {
    "headline": "36 African countries have health human resources crisis,says WAPCMLS",
    "summarized_story": "“This acute shortage of skilled health workers means that most countries are unable to avail appropriately skilled health workers in the right quantity where they are needed,”he said.\nRecall also that the 62nd Session of the World Health Organisation Afro-Regional Committee at a meeting on 20th November 2012, in Luanda, Angola adopted the Road map on Human Resources for Health.\nHe said:”The Regional Committee unanimously adopted the Road Map for scaling up the human resources for health to improve health service delivery in Africa.\nThe 2021 scientific conference of the West African Postgraduate College of Medical Laboratory Science has the theme: Improving Global Health by Strengthening Medical Laboratory Capacity in Africa.\n“Our College Fellows from all over West Africa and Cameroun would be in attendance at the three-day conference,’he said."
  },
  {
    "headline": "FCFMT discloses remedy for depression in Undergraduates",
    "summarized_story": "According to her, depression among students has led to many youths committing suicide over trivial issues that could easily be resolved if urgently attended to by teachers or parents.\nREAD ALSO:Liberation Set: Chief Olusegun Osoba, other classmates celebrate 60 years of graduation schoolAdebola who represented the Provost, Dr Onuoha, P.C.\n”Lecturers are pivotal to helping the depressed students because they are the people students see and relate to face to face.\nIf the student is passing through depression while on campus, the lecturers will know if they are observant.””To the students passing through depression, she urged them to share their problems with the lecturers, adding that, a problem shared is half solved.\nAdebola said: ”Once the burden of the student with depression is lifted, the mind of the student will be able to think about other options instead of suicide."
  },
  {
    "headline": "PTAD reiterates commitment to sustaining its pensioners’ welfare",
    "summarized_story": "*Launches ‘I am alive” software for S’SouthBy Chioma Onuegbu, UyoTHE Pension Transitional Arrangement Directorate, PTAD, has reiterated its commitment towards ensuring that the welfare of its pensioners was sustained.\nEjikeme explained that the online applicationdesigned to enable PTAD pensioners easily confirm their aliveness from the comfort of their homes or neighbourhood using either smartphone or a computer system.\nToday we have just launched “I am Alive” Confirmation Solution.\nAlhassan Rumrum thanked PTAD leadership for introducing laudable initiatives into the country’s Pension administration .\nI commend the leadership of PTAD for especially leveraging on technology to make sure that we are globally competitive in our pension administration”, He stressed."
  },
  {
    "headline": "2022 Budget defence: Reps condemn spillover of navy projects",
    "summarized_story": "The House of Representatives Committee on the Nigerian Navy has condemned the spillover of projects by some contractors handling its projects.\nGagdi said that such projects were neither handed over to the Nigerian Navy nor was there any work in progress by the contractors.\nHe said that this was against the noted enormous problems of the Nigerian Navy, adding that there was a need for open and legal recommendations for doors and more windows.\nGambo called for more equipment for the Nigerian Navy, adding that although the Federal Government had boosted the morale of the Nigerian Navy with more platforms, more were, however, needed.\nHe listed the priority projects for 2022 appropriation to include fleet renewal, capital development, personnel welfare, among others."
  },
  {
    "headline": "It’ll take Nigeria 120 years to meet medical demands – Minister",
    "summarized_story": "Malam Adamu Adamu, Minister of Education, has declared that it would take the country about 120 years to have the number of medical doctors needed in Nigeria’s health sector.\nThe Minister spoke at the weekend during the maiden matriculation of the Federal University of Health Sciences (FUHSO) held at its temporary site, Otada in Otukpo Benue State.\nAdamu also noted that the university would bridge the huge gap in Nigeria’s need for medical doctors across the country.\nRepresented by Arc.\nSunny Echono, the Permanent Secretary in the Federal Ministry of Education, Adamu further said, “based on the existing production rate, it will take Nigeria about 120 years to have the number of doctors she needs, assuming all our doctors remain in the country.”According to him, the university “will act as a catalyst, through training, research and innovation for the effective utilisation, exploitation, and conservation of Nigeria’s natural, economic and human resources.”"
  },
  {
    "headline": "N21bn Presidential Clinic: You’ll still travel abroad for treatment – Shehu Sani mocks Buhari",
    "summarized_story": "Senator Shehu Sani, who represented Kaduna Central in the eighth assembly, has subtly mocked the President Muhammadu Buhari administration over the construction of a State House Clinic, Presidential Wing.\n“No matter how much is spent to upgrade and equip the Presidential Clinic, it will never change their obsession with foreign doctors and foreign clinics,” he wrote on his verified Twitter handle on Monday.\nRecall that Buhari’s Chief of Staff, Ibrahim Gambari had recently flagged off the construction and equipping of a 14-bed space Presidential Clinic at a cost of N21 billion.\nIn fact, President Muhammadu Buhari has gone on medical vacation at least five times, covering a period of no fewer than 170 days.\nNigeria’s Presidential clinic to gulp N21bn – State House Perm Sec, Tijjani"
  },
  {
    "headline": "Bandits kill six, abduct women, children in Zamfara",
    "summarized_story": "An unspecified number of gunmen have unleashed terror on Rijiya village in Gusau, Zamfara State capital, killing six persons and injuring many.\nSome women and children were also kidnapped in the attack.\n“We were taken unaware when the bandits stormed the community and started house to house search for women.\nThose who were kidnapped were mostly married women and children, including nursing babies.\nAccording to the source, the bandits penetrated the Rijiya community through the Tsafe Local Government Area of the state when some of the villagers were already on their farms."
  },
  {
    "headline": "Former CJ, CNG express dismay over drug abuse in north",
    "summarized_story": "A former Chief Justice of the Federal Capital Territory, Ishaq Usman Bello, has frowned at the prevalence of drug and substance abuse in northern Nigeria.\nJustice Bello, who was the grand patron at the graduation ceremony of medical students of Community Auxiliary School and Training Centre, Zaria, noted with dismay that the situation is so bad that everyone must become a stakeholder and a committed actor in the struggle to free the region and the country of the hazardous and debilitating problem.\nHe opined that the strategies should consist of enlightenment, education, interdiction, arrest, confiscation, arraignment, rehabilitation, development of alternative and more positive lifestyles, provision of recreational facilities and development of activities for the youth, and a variety of other proactive measures to stem the tide and reverse the inordinate impact of the problem on society.\nOn its part, the Coalition of Northern Groups (CNG) said that the increase in drug addiction and substance abuse in the North recently been driven by outside forces and players particularly southern traders and “pharmacists”, is a matter that requires closer scrutiny.\nThe CNG spokesman, Abdul-Azeez Suleiman, alleged that all over the north, traders are the main sources of the substances and drugs that are being brought into the region and abused by the Northern youths, adding that the proliferation of the trade provides proof of its profitability to these people."
  },
  {
    "headline": "Imo lawmakers reinstate Iwuanyanwu as Deputy Speaker",
    "summarized_story": "Imo lawmakers have reinstated Amara Chyna Iwuanyanwu as Deputy Speaker of the Assembly.\nIwuanyanwu was impeached by 18 out of the 27 lawmakers last Tuesday.\nThe former Speaker Paul Emeziem, who presided over the plenary, okayed the impeachment of Iwuanyanwu without reading the content of the resolution."
  },
  {
    "headline": "UPDATED: Confusion as 19 lawmakers impeach Imo Speaker",
    "summarized_story": "Imo lawmakers on Monday morning impeached Speaker Paul Emeziem.\nEmeziem of APC- Onuimo State Constituency was impeached on following resolution signed by 19 out of the 27 during a special sitting.\nMember representing Ọrụ East State constituency, Hon.\nKennedy Ibeh of Obowo State Constituency was elected to replace him.\nIt was learnt that the purportedly impeached Deputy Speaker, Amara Iwuanyanwu, who stormed the Assembly premises with six lawmakers and some security personnel to impeach the Speaker, was later reinstated."
  },
  {
    "headline": "Indian police officer kills four, injures three",
    "summarized_story": "An officer with the Indian Central Reserve Police Force (CRPF) on Monday opened fire on his colleagues in the central state of Chhattisgarh, killing four of them and injuring three others.\nIndian NDTV broadcaster said the incident took place in the camp of the CRPF 50th battalion in Linganpalli village under Maraiguda police station at 3:15 a.m. local time (21:45 GMT on Monday).\nREAD ALSO: Indian tanker driver charged with vandalising Dangote Refinery cablesAccording to preliminary information, constable Reetesh Ranjan, fired at his colleagues with his service weapon, an AK-47 rifle; the shooter was later arrested.\nNDTV said an investigation had been launched into the shooting to establish its motive.\n(Sputnik/NAN)"
  },
  {
    "headline": "JAMB defends remittance of operating surplus",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has vowed to continue its practice of remitting its operating surpluses to government, saying that the remittances were in line with global best practice, Dr Fabian Benjamin, Head, Public Affairs of JAMB has said.\nAccording to him, it is a known fact that all unutilised funds by Ministries, Departments and Agencies (MDAs) should be returned to the public treasury.\n“The board reiterates that it is not within the powers of MDAs to determine the uses for which the remitted funds are put to.\nHe added: “ It would be recalled that the humongous remittances are the first in the history of the four-decade-old agency.\n“For instance, a huge chunk of these surpluses are ploughed back to the tertiary institutions through the National Tertiary Admissions Performance Merit Award and other platforms."
  },
  {
    "headline": "Drama as Imo lawmakers impeach Speaker",
    "summarized_story": "The Speaker of the Imo State House of Assembly, Rt.\nPaul Emeziem has been impeached as the Speaker during the House plenary session today following several allegations of gross misconduct and abuse of office.\nThe former Speaker was impeached following the unanimous decision of the 19 members out of 27 lawmakers in a signed letter read on the floor of the house which accused the former Speaker of gross misconduct and abuse of office.\nKennedy Ibeh who is the member representing Obowo State Constituency has been sworn in immediately as the Speaker of the Imo State House of Assembly.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "BREAKING: Why INEC declared Anambra election “inconclusive”",
    "summarized_story": "The Independent National Electora Electoral Commission (INEC) has suspended the announcement of result and subsequent declaration of a winner in the Anambra Governorship election, pending the determination of election in Ihiala Local Government area.\nThe election in Ihiala LGA has been fixed for Tuesday November 9, 2021, the election was initially suspended due crisis in that area.\nMEANWHILE the candidate of the All Progressives Grand Alliance, APGA, Prof. Chukwuma Soludo, is leading in the Anambra governorship election held on Saturday.\nFrom the 19 local governments’ results so far declared by the Independent National Electoral Commission on Sunday, the former Central Bank of Nigeria’s governor won in 17.\nClick here ."
  },
  {
    "headline": "FG moves to reduce illegal importation of rice through land borders",
    "summarized_story": "In line with its diversification policy, the Federal Government has pledged continue to strategise and collaborate with security agencies to reduce the illegal importation of rice through land borders.\nMinister of Agriculture and Rural Development, Dr. Mohammed Abubakar, made the declaration at a meeting of the Steering Committee of the National Taskforce on the illegal importation of rice through land borders in Abuja.\nAbubakar, in a statement by a media aide in the ministry, Mabel Mbosire, said the ban on rice importation had brought about a significant increase in local rice production and unlocked economic opportunities for rice investors in the country.\n“The resumed smuggling of foreign rice, especially through the land borders, is constituting a serious threat to these achievements.\nChairman, Presidential Committee on Trade Malpractice, Alhaji Dahiru Ado, commended the ministry, the Nigerian Customs Service and other partners in their sustained efforts in tackling the menace of illegal rice importation through the land borders into the country."
  },
  {
    "headline": "Anambra guber: APGA clears 18 LGAs as PDP, YPP grab 1 each",
    "summarized_story": "The All Progressives Grand Alliance (APGA) has cleared 18 local government areas in the results announced so far by the Independent National Electoral Commission (INEC).\nThe Peoples Democratic Party (PDP) and the Young Democratic Party (YPP) claimed won in one each.\nThe LGAs won by APGA were: Anaocha, Awka North, Awka South, Ayamelum, Dunukofia, Njikoka, Oyi, Idemili South, Onitsha South, Orumba South, Onitsha North, Aguata, Idemili North, Ekwusigo, Nnewi South, Anambra West, Orunba North and Anambra East.\nPDP and YPP won Ogbaru and Nnewi North respectively while election did not hold in Orumba North and Ihiala LGAs according to their collation officers.\nHe accused the Electoral Officer, Comfort Omoringe, who he worked with of playing double standards."
  },
  {
    "headline": "Nigeria needs peace at home, respect abroad to make progress, says Anyim",
    "summarized_story": "By Chukwudi NwejeFormer Senate president, Anyim Pius Anyim, has said the only way Nigeria would progress is when it has peace at home and respect abroad.\n“For Nigeria to survive and thrive, we must have peace at home and respect abroad.\nThey must be visionary and ready to keep pace with contemporary social, economic and technological challenges.\nFor that we need leadership that understands the challenges, the imperatives and concomitant of the 4th Industrial Revolution.\nWe need leaders that must connect and engage with the people especially the youth."
  },
  {
    "headline": "Soludo in Apparent Victory in Anambra Poll, Election to Hold in Ihiala Tomorrow",
    "summarized_story": "Nseobong Okon-Ekong, Chuks Okocha, Onyebuchi Ezigbo and David-Chyddy ElekeThe Independent National Electoral Commission (INEC), has declared Anambra election inconclusive, following the failure of the exercise to hold in Ihiala Local Government Area.\nReturning officer in the election, Prof. Florence Obi, has however said the Ihiala election would now hold tomorrow, Tuesday, November 9, to complement the 20 local government areas election results, already announced.\nSo, we have to conclude the election in Ihiala to be able to conclude the process.\nThat was why the commission declared the election inconclusive to enable it hold supplementary election in Ihiala, and also other polling units, where elections did not hold or were marred by incidences.\nMeanwhile, the Civil Society Situation Room, has hailed the general conduct of the election, describing it as peaceful."
  },
  {
    "headline": "Soludo’s Imminent Victory: How Anambra Voted",
    "summarized_story": "In 2017, outgoing Governor Willie Obiano, a member of APGA, won all the 21 local government areas in the state in what is today popularly referred to as “21 over 21” by the party.\nBut, yesterday, from the results announced by the Independent National Electoral Commission (INEC), APGA failed to clear all 21 local government areas.\nYet, it put up an impressive showing by winning 18 out of the 20 local government areas, whose results were announced.\nOthers are Njikoka, Orumba South, Onitsha North, Aguata, Idemili North, NNewi South, Awka North, and Anambra West.\nExcept for Nnewi North, where Ubah won overwhelmingly, and Ogbaru, where the PDP won, all other local government areas were taken by APGA."
  },
  {
    "headline": "CBN: Foreign Currency Inflows Dropped to $1.83bn in 2020, Year of COVID",
    "summarized_story": "According to the annual report by the apex bank’s Currency Operations Department (COD) which was posted on its website, the CBN also slashed its expenditure on currency printing from N75.52 billion in 2019 to N58.61 billion in 2020.\nThe central bank explained that this was used to fund Bureaux De Change (BDC) operations, payment of estacode and Personal Travel Allowances (PTA) to Ministries, Departments and Agencies (MDAs).\nThe CBN stated that receipt and authentication of foreign currency deposits by Deposit Money Banks (DMBs) reduced significantly due to the downturn in global trade in 2020.\nAccording to the central bank, currency printing gulped N64.04 billion in 2018.\nThe bank explained that the income generated was largely, from penal charges on unsorted banknotes deposited by Deposit Money Bank (DMBs) and charges for authentication of foreign currency deposits with the central bank."
  },
  {
    "headline": "Breaking: INEC Declares Anambra Election Inconclusive, Poll Holds in Ihiala Tuesday",
    "summarized_story": "By David-Chyddy Eleke in AwkaThe Independent National Electoral Commission, INEC has declared the Anambra governorship election inconclusive.\nThis is because of the inability of the commission to deploy staff and materials to Ihiala local government area, as a result of security threat.\nReturning officer in the election, Prof. Florence Obi said the election would now hold on November 9, to complement the 20 local government areas election result, already announced.\nSo we have to conclude the election in Ihiala to be able to conclude the process.\nThe election for Ihiala will hold on November 9.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "2021 Anambra Governorship Election Result As Announced By INEC",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Buhari Government Spends N92million As ‘Parking Fee’ On Faulty Presidential Jet Taken To Germany For Repairs",
    "summarized_story": "A Boeing Business Jet (Boeing 737-700) marked 5N-FGT owned by the Nigerian government has incurred parking charges of at least N95 million since it was taken to Germany for repairs.\nSaharaReporters had reported how the presidential jet developed a fault while the President and his entourage were returning to Abuja from the UN General Assembly in the US on Saturday, September 25.\nSee Also Exclusive EXCLUSIVE: Buhari Escapes Air Crash As Presidential Jet Develops Fault, Aircraft Taken To Germany For Repairs At N2.4Million Per Night For Parking“The Presidential Boeing Business Jet registration number 5N-FGT developed a fault during his trip from New York.\nIn 2017, the cost of maintenance of the presidential aircraft rose to N4.37 billion (19.6 per cent).\nBut in 2021, the budget for the presidential fleet saw its sharpest Buhari-era jump to N12.550 billion (243.6 per cent)."
  },
  {
    "headline": "Buhari Government Spends N92million As ‘Parking Fee’ On Faulty Presidential Jet Taken To Germany For Repairs",
    "summarized_story": "A Boeing Business Jet (Boeing 737-700) marked 5N-FGT owned by the Nigerian government has incurred parking charges of at least N95 million since it was taken to Germany for repairs.\nSaharaReporters had reported how the presidential jet developed a fault while the President and his entourage were returning to Abuja from the UN General Assembly in the US on Saturday, September 25.\nSee Also Exclusive EXCLUSIVE: Buhari Escapes Air Crash As Presidential Jet Develops Fault, Aircraft Taken To Germany For Repairs At N2.4Million Per Night For Parking“The Presidential Boeing Business Jet registration number 5N-FGT developed a fault during his trip from New York.\nIn 2017, the cost of maintenance of the presidential aircraft rose to N4.37 billion (19.6 per cent).\nBut in 2021, the budget for the presidential fleet saw its sharpest Buhari-era jump to N12.550 billion (243.6 per cent)."
  },
  {
    "headline": "Buhari Government Spends N92million As ‘Parking Fee’ On Faulty Presidential Jet Taken To Germany For Repairs",
    "summarized_story": "A Boeing Business Jet (Boeing 737-700) marked 5N-FGT owned by the Nigerian government has incurred parking charges of at least N95 million since it was taken to Germany for repairs.\nSaharaReporters had reported how the presidential jet developed a fault while the President and his entourage were returning to Abuja from the UN General Assembly in the US on Saturday, September 25.\nSee Also Exclusive EXCLUSIVE: Buhari Escapes Air Crash As Presidential Jet Develops Fault, Aircraft Taken To Germany For Repairs At N2.4Million Per Night For Parking“The Presidential Boeing Business Jet registration number 5N-FGT developed a fault during his trip from New York.\nIn 2017, the cost of maintenance of the presidential aircraft rose to N4.37 billion (19.6 per cent).\nBut in 2021, the budget for the presidential fleet saw its sharpest Buhari-era jump to N12.550 billion (243.6 per cent)."
  },
  {
    "headline": "#AnambraDecides2021: Electoral Commission, INEC Suspends Results Collation, Announces Date For Supplementary Election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has fixed a date for a supplementary election in one local government area of Anambra State where the governorship poll did not hold at the weekend.\nShe, however, said the declaration would be made after the supplementary election has been conducted in the remaining local government area, Ihiala.\nShe announced that the supplementary election would be conducted in the 326 polling units across Ihiala on Tuesday, November 9.\nThe outstanding results are for Ihiala Local Government Area where for various reasons, the commission could not deploy materials yesterday (Saturday).\n\"I have conferred with the commission, being the body that fixes the date for the election, and the commission has decided that the supplementary election will take place on Tuesday, 9th November 2021."
  },
  {
    "headline": "#AnambraDecides2021: Electoral Commission, INEC Suspends Results Collation, Announces Date For Supplementary Election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has fixed a date for a supplementary election in one local government area of Anambra State where the governorship poll did not hold at the weekend.\nShe, however, said the declaration would be made after the supplementary election has been conducted in the remaining local government area, Ihiala.\nShe announced that the supplementary election would be conducted in the 326 polling units across Ihiala on Tuesday, November 9.\nThe outstanding results are for Ihiala Local Government Area where for various reasons, the commission could not deploy materials yesterday (Saturday).\n\"I have conferred with the commission, being the body that fixes the date for the election, and the commission has decided that the supplementary election will take place on Tuesday, 9th November 2021."
  },
  {
    "headline": "Imo speaker impeached -- six days after removal of deputy",
    "summarized_story": "Paul Emeziem, speaker of Imo state house of assembly, has been impeached.\nAdvertisementEmeziem was impeached on Monday following a petition signed by 19 lawmakers out of the 27 lawmakers in the state.\nAdvertisementHowever, the suspension of the deputy speaker had reportedly caused a disagreement among the lawmakers.\nFour out of the six suspended lawmakers, including Ibeh, who were recalled by the assembly, had disassociated themselves from the suspension of the former deputy speaker.\nThe four lawmakers had alleged that their signatures were forged on the petition signed against the deputy speaker."
  },
  {
    "headline": "Imo speaker impeached -- six days after removal of deputy",
    "summarized_story": "Paul Emeziem, speaker of Imo state house of assembly, has been impeached.\nAdvertisementEmeziem was impeached on Monday following a petition signed by 19 lawmakers out of the 27 lawmakers in the state.\nAdvertisementHowever, the suspension of the deputy speaker had reportedly caused a disagreement among the lawmakers.\nFour out of the six suspended lawmakers, including Ibeh, who were recalled by the assembly, had disassociated themselves from the suspension of the former deputy speaker.\nThe four lawmakers had alleged that their signatures were forged on the petition signed against the deputy speaker."
  },
  {
    "headline": "EXPLAINER: 25% rural presence, can't grant loans... what to know about payment service banks",
    "summarized_story": "Last week, the Central Bank of Nigeria (CBN) granted approval-in-principle (AIP) to MTN Nigeria and Airtel Africa towards the process of commencing payment service banks (PSBs).\nAdvertisementAirtel and MTN Nigeria will join Globacom and 9mobile which are already operating in the financial space with their services.\nIn this explainer, TheCable sheds light on PSBs and their impact on the financial services industry.\nOthers are mobile money operators (MMOs), switching companies; financial technology companies (Fintech); financial holding companies; and any other entity on the merit of its application subject to the approval of the CBN.\nThe CBN specified that every PSB must use the words “Payment Service Bank” in its name to differentiate it from other banks."
  },
  {
    "headline": "EXPLAINER: 25% rural presence, can't grant loans... what to know about payment service banks",
    "summarized_story": "Last week, the Central Bank of Nigeria (CBN) granted approval-in-principle (AIP) to MTN Nigeria and Airtel Africa towards the process of commencing payment service banks (PSBs).\nAdvertisementAirtel and MTN Nigeria will join Globacom and 9mobile which are already operating in the financial space with their services.\nIn this explainer, TheCable sheds light on PSBs and their impact on the financial services industry.\nOthers are mobile money operators (MMOs), switching companies; financial technology companies (Fintech); financial holding companies; and any other entity on the merit of its application subject to the approval of the CBN.\nThe CBN specified that every PSB must use the words “Payment Service Bank” in its name to differentiate it from other banks."
  },
  {
    "headline": "Soldiers, Boko Haram in gun battle in Borno",
    "summarized_story": "Troops of the Nigerian Army are currently in a gunfight with Boko Haram insurgents at Tamsukawu village in Kaga LGA of Borno state.\nAdvertisementA military source told TheCable that soldiers and insurgents are currently engaged in a heavy gun battle.\nThe federal government had recently said it was winning the war against insurgency in the north-east.\nLai Mohammed, minister of information and culture, in an interview, had said the surrendering of Boko Haram insurgents shows that peace is returning to the war-ravaged region.\nAdvertisementHe added that the military has heightened the “assaults and attacks” on the insurgents which have enabled it to reclaim more territories."
  },
  {
    "headline": "MTN Group to sell $245m-worth shares of Nigerian subsidiary",
    "summarized_story": "South Africa-based MTN Group has announced plans to sell 575 million shares of its most profitable subsidiary MTN Nigeria, which went public in Lagos in 2019.\nThe offer is expected to close in December 2021.”The transaction will see MTN Group rake in proceeds of about ₦101 billion ($245 million), based on MTN Nigeria’s (MTNN) current share price of ₦175.60.\nA Bit of HistoryThe planned sell-off is part of a broader intention, announced by MTN Group earlier, to sell down 14% of its current shareholding in the Nigerian unit.\nLast year, the Johannesburg-based group was unable to repatriate its $280 million dividend from its Nigerian subsidiary due to the challenges of securing foreign currency, amid the country’s forex liquidity crisis.\nDespite the domestic challenges, MTN Nigeria has shown resilience."
  },
  {
    "headline": "A surge in African fintech's intra-continental expansion to target SMEs",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango/birdSupport for small businesses keen to trade across the continent’s single market is being eyed as a potentially lucrative market by more and more African fintech startups.\nSurge in intra-continental expansionIn the last month alone, a number of startups have either raised growth funds, acquired another player present in regional markets within the same vertical, or tapped top talent in the telecoms industry.\nTheir intention appears to be the targeting of small industries and traders seeking cross-border opportunities in new African markets.\nThe program comes barely a month after Tala raised 145 million dollars in equity, hinting that part of the growth funds would go toward supporting its geographical expansion.\nUntil recently, a lack of local knowledge and access to trade and market information has been linked to low trade volumes and value."
  },
  {
    "headline": "African founders lead Payhippo’s $3m seed investment",
    "summarized_story": "There’s a new exciting trend in the African tech ecosystem: African founders backing fellow founders especially in pre-seed and seed funding, which is an indication that the African tech ecosystem is maturing.\nCapital is a lifeline of businessThere are over 40 million small and medium businesses (SMEs) in Nigeria.\nBut only a few of these businesses have access to capital, mostly due to heavy collateral requirements and long time of loan processing.\nFounded by Zach Bijesse, CEO, Chioma Okotcha, COO, and Uche Nnadi, CTO, Payhippo provides small businesses with short-term working capital with average loan amounts of $1300.\n“Access to credit is a critical necessity for small businesses to manage their daily challenges."
  },
  {
    "headline": "Chipper Cash valued at $2 billion after investment from FTX",
    "summarized_story": "With a valuation of over $2 billion, Chipper Cash has now attained a unicorn status.\nChipper Cash is FTX’s first investment in Africa.\nChipper Cash boasts of having over 4 million users across the world.\nThe investment will see FTX partner with Chipper Cash to make money transfer as simple as a text message and accelerate the adoption of crypto within Africa and beyond.\nAs a result of this partnership, FTX will increase its footprint in Africa and Chipper Cash will be integrated into the FTX product so that African users can fund their crypto wallet through Chipper Cash."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "What does MTN and Airtel’s PSB approval in principle licence mean for financial inclusion in Nigeria?",
    "summarized_story": "As expected, the announcements were greeted with support by Nigerians and hailed as an essential step in deepening financial inclusion in the country.\nSo what does this mean for financial inclusion in Nigeria?\nSince 2012, an often-stated goal of the CBN has been to deepen financial inclusion in the country.\nThe World Bank defines financial inclusion as access to valuable and affordable financial products and services delivered responsibly and sustainably.\nThere is no doubt that granting these telcos a PSB licence would boost the CBN’s financial inclusion goals."
  },
  {
    "headline": "Pitchstorm 3.0 is here; apply for a chance to win $10,000 for your startup",
    "summarized_story": "This saw us suspend all Pitchstorm-related activities for Techpoint Africa’s third annual Techpoint Build event, Techpoint Build 2020.\nWith the flagship event here again in 2021, we are happy to announce applications for Pitchstorm, with entries from all African countries.\nTechpoint Africa Pitchstorm is a pan-African startup competition focused on amplifying the work of startups pushing the envelope with world-class solutions.\nAdvertisementAlignment with Techpoint Build 2021 themeFollowing the theme of Techpoint Build 2021, The next frontier, Pitchstorm 3.0 will aim to identify one startup that best “illustrates” and “executes” on futuristic goals of its industry.\nPrize moneyIn typical fashion, the prize money for Pitchstorm 3.0 is $10,000."
  },
  {
    "headline": "Financial inclusion on steroids? Lagos and buildings, MTN offloads shares",
    "summarized_story": "Two of Nigeria’s biggest telecommunication companies MTN and Airtel, have been granted Approval-in-Principle for their proposed payment service banks (PSBs), Momo Payment Service Bank Limited and Smartcash Payment Service Bank Limited, respectively.\nA payment service bank is a bank licenced by the CBN to operate in mostly rural areas, targeted at financially excluded persons.\nMTN Nigeria to sell 14% shareholdingPhoto Credit: <a href=”https://www.flickr.com/photos/121302193@N07/17666012786/”>USAID Digital Development</a> Flickr via <a href=”http://compfight.com”>Compfight</a> <a href=”https://creativecommons.org/licenses/by/2.0/”>cc</a>What’s the news?\nAt MTN Nigeria’s current stock price — ₦175.6 per share — this move could make the company profit upwards of ₦100.9 billion ($245 million).\nInterestingly, MTN Nigeria, although one of the group’s most significant subsidiaries, has been a considerable source of headache."
  },
  {
    "headline": "Afrobeats pays Nigerian artistes as the world listens",
    "summarized_story": "The year 2020 was particularly a defining moment for the Nigerian music industry in terms of announcing itself on the global stage.\nIt had 25 million streams on YouTube; 50.2 million on Audiomack; 34.5 million on Spotify; 18.4 million on Music Africa; 31 million on Music World, and Boomplay 10.5 million.\nOn the global music boards, Twice as Tall topped various charts, peaking at No 1 in the World Albums category on Billboard charts.\nThe Billboard Hot 100 is the music industry standard rating in the United States for songs published weekly by Billboard Magazine.\nSmartphone penetration is also at 46 percent, which means millions of Nigerians are not able to join the music afrobeat party or experience the growing strength of afrobeats artistes around the world."
  },
  {
    "headline": "Afrobeats pays Nigerian artistes as the world listens",
    "summarized_story": "The year 2020 was particularly a defining moment for the Nigerian music industry in terms of announcing itself on the global stage.\nIt had 25 million streams on YouTube; 50.2 million on Audiomack; 34.5 million on Spotify; 18.4 million on Music Africa; 31 million on Music World, and Boomplay 10.5 million.\nOn the global music boards, Twice as Tall topped various charts, peaking at No 1 in the World Albums category on Billboard charts.\nThe Billboard Hot 100 is the music industry standard rating in the United States for songs published weekly by Billboard Magazine.\nSmartphone penetration is also at 46 percent, which means millions of Nigerians are not able to join the music afrobeat party or experience the growing strength of afrobeats artistes around the world."
  },
  {
    "headline": "Streaming market keeps Nigerian artistes afloat amid constraints",
    "summarized_story": "The global music streaming market has been a gold discovery for many Nigerian music artists as it presents limitless opportunities to reach a world they would have never thought possible.\nAn expert in one of the streaming services who pleaded anonymity said streaming music started when a new group of artists that called themselves Alté Kids came on the scene.\nThis proved to be a major turning point in music distribution and the streaming market which saw increased adoption.\nExperts have also noted the impact of the COVID-19 pandemic on the growth in the streaming market.\nFor many music artists in Nigeria music streaming is the best thing that happened to the industry and could be the future."
  },
  {
    "headline": "Anambra: Unique Political Behavior – Nigerian Observer",
    "summarized_story": "After reading the piece over and over again , I found an illumination into the other side of Anambra political behavior which combines with identity preservation I had talked about , to make the state a unique one in the politics of South East.\nAnambra is the proud circumference or orbit of the richest men in the South East and of experienced and tested politicians.\nParadoxically, these men of immense financial means and intimidating political background are not in control of the voting behavior of Anambra people.\nAnother angle to Anambra politics is what I have christened identity preservation of “ Igboism” as the ideological ramification that underpins the people’s electoral choices.\nAdditionally, Anambra remains the only State in the South East that nourishes Ojukwu’s confederal proposition at Aburi."
  },
  {
    "headline": "Anambra guber: INEC suspends result collation for supplementary poll in Ihiala LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAwka – The Independent National Electoral Commission (INEC) has suspended collation of results of the Nov. 6 governorship election in Anambra pending the conduct of the election in Ihiala Local Government Area.\nObi said that Soludo won in 18 out of the 20 Local Government Areas of the State already declared.\nObi listed the areas where Soludo won to include; Dunukofia, Awka South, Oyi, Anaocha, Ayamelum, Anambra East, Idemili South and Onitsha South.\nShe also stated that the APGA candidate also won in Njikoka, Orumba South, Onitsha North, Idemili North, Ekwusigo, Aguata, Orumba North and Nnewi South Local Government Areas.\nShe said that the final result will be announced after completing the election in Ihiala."
  },
  {
    "headline": "Corruption : Ndume calls on President Buhari to sign Unexplained Wealth Order – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIbadan – Sen Ali Ndume has called on President Mohammadu Buhari, to urgently sign or issue an Unexplained Wealth Order, as a way to strengthen the fight against corruption.\n“Our crusade against this monster (corruption) should start from politicians, top public servants, civil servants down to local governments’ staff.\nNdume further said that the fight against corruption was a fight for the nation and must start from the top to the bottom.\nHe said that the whistle blower policy must be revisited; stressing motivation for whistle blowers shouldn’t just be the reward, but patriotism.\nSen. Ndume used the opportunity of the event to announced the donation of N1million as scholarship to assist some indigent students of the institution."
  },
  {
    "headline": "Buhari’s double-barrelled mission to Scotland to attract trillion dollars investments – Nigerian Observer",
    "summarized_story": "According to Nigerian leader, over 1.5 trillion dollars is needed by Nigeria over a 10-year period, to achieve an appreciable level of the National Infrastructure Stock.\n‘‘For Nigeria, climate change is not about the perils of tomorrow but what is happening today.\nThe Nigerian leader said it was noteworthy that the meeting was tailored towards ameliorating the problems of land degradation, desertification, depletion of the forest ecosystems and biodiversity in Africa.\nBezos described the commitment of the Nigerian leader to restore 4 million hectares as exemplary.\nThe president had also hosted the national leader of the All Progressives Congress (APC), Sen. Bola Tinubu, at his official residence, State House, Abuja, on Oct. 31."
  },
  {
    "headline": "UBA to terminate $500 million Eurobond early ahead of fresh debt offering",
    "summarized_story": "United Bank for Africa (UBA) will invite interests from holders of its $500 million Eurobond due for maturity in 2022 for redemption ahead of time through a cash tender offer before issuing a new similar note, the lender announced Monday.\nTowards issuing the fresh dollar-denominated note, UBA has commissioned five managers – Standard Chartered Bank, Citigroup Global Markets Limited, Renaissance Securities (Cyprus) Limited, United Capital Plc and Mashreqbank psc – to convene a call for global investors linked to a number of other meeting starting on Monday.\nShares in UBA jumped 0.59 per cent, trading at N8.45 per share at 12:25 WAT on Monday following the news.\nThe offer is fixed rate and “subject to market conditions,” a note to the Nigerian Exchange and seen by PREMIUM TIMES says.\nFor the nine-month period to September, UBA upped profit by 36 per cent to N105 billion, bucking the trend of little or marginal profit growth among its other Big 5 banks’ peers."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Unity Bank Plc reports N36.18bn as Gross Earnings, PAT rises by 23.06% in Q3",
    "summarized_story": "Adebayo ObajemuUnity Bank Plc in its published third quarter report for the period ended 30 September 2021 achieved year on year growth in its topline and bottom line figures.\nThe Bank reported Gross Earnings of N36.178 billion for the nine months period, up by 6.75% from N33.892 billion reported the previous year.\nProfit after tax grew year on year by 23.06% to N1.937 billion from N1.574 billion reported in Q3 2020.\nEarnings per share of the Bank grew by 23.06% to 17 kobo from the EPS of 13 kobo reported the previous year.\nAt the share price of 55 kobo, the PE ratio of Unity Bank stands at 3.32x with earnings yield of 30.13%."
  },
  {
    "headline": "Osun 2022: PRP elects new executives in Osun, vows to unseat Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State chapter of People’s Redemption Party (PRP), over the weekend held its state congress and elected executives that will lead it for the next four years.\nThe party at the state congress unanimously re-elected all the state executives that have been piloting the affairs of the party in the last four years in the state.\nHe added that his party is ready to chase Oyetola out of office come 2022 gubernatorial election.\nOthers are: Lawal Muskrat, Financial Secretary; Olajiire Gbolahan, Publicity secretary; Adejumo Adepoju, Treasurer; Wale Oyelami, Legal Adviser; Aminu Isiaka Kayode, Assistant Publicity Secretary.\nAlso returned are: Aliyu Dodo, Assistant Financial Secretary; Shaibu Ahmed, Assistant Organising Secretary; Oluwafunminiyi Ago, Assistant secretary; Alade Wahab, Youth Leader; Ajiboye Niyi, Assistant Legal Adviser and Adeyemi Abass, Assistant Youth Leader."
  },
  {
    "headline": "Nothing is working in Osun under APC administration – Sunday Bisi",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Chairman of the Peoples Democratic Party (PDP) in Osun State, Hon.\n“There’s nothing like peace in Osun State under this APC administration if we have to tell ourselves the truth.\n“All issues concerning Osun PDP have been settled by the grace of God and decisions taken at the national convention.\n“I can tell you for free that Osun PDP is now one big family.\n“Oyetola was there as one of those who bastardized Osun State in all the years of APC misrule."
  },
  {
    "headline": "Chukwuma Soludo: The man who will be governor",
    "summarized_story": "That is the story of the last but one governor of the Central Bank of Nigeria (CBN).\nSoludo currently serves as a member of the Economic Advisory Council (EAC) appointed by President Mohammadu Buhari, to replace the Economic Management Team of the federal government.\nAn eminent patriot, Soludo has continued to contribute to nation building, taking positions on issues of serious national importance and proffering solutions to economic problems.\nArguing that the structures to support the lockdown in most African countries do not exist, he maintained that African leaders cannot continue to shut in citizens without food.\nEven many years after leaving office, Soludo is still recognized as one of the 100 most influential Africans."
  },
  {
    "headline": "Withdraw Petition Against Biniyat, SOKAPU Youths Beg el-Rufai’s Commissioner",
    "summarized_story": "The youth wing of the Southern Kaduna People’s Union (SOKAPU), have begged the Kaduna State Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan, to withdraw a petition against the group’s spokesperson, Luka Biniyat, who is currently in Police detention.\nIn this publication, Mr Binniyat quoted Senator Danjuma Laah of the Southern Kaduna Senatorial District, asstating that I am being used to cover up a genocide against Christians in Southern Kaduna.\n“I have alerted the national leadership of Nigeria Union of Journalists, as well as the Union’s Kaduna State Council as a mark of respect.\n“Southern Kaduna at this time is faced with existential threats and therefore needs all hands on deck not behindbars,” he added.\nIt is not the first time Mr Binniyat has had an issue involving the Kaduna State government officials."
  },
  {
    "headline": "Withdraw Petition Against Biniyat, SOKAPU Youths Beg el-Rufai’s Commissioner",
    "summarized_story": "The youth wing of the Southern Kaduna People’s Union (SOKAPU), have begged the Kaduna State Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan, to withdraw a petition against the group’s spokesperson, Luka Biniyat, who is currently in Police detention.\nIn this publication, Mr Binniyat quoted Senator Danjuma Laah of the Southern Kaduna Senatorial District, asstating that I am being used to cover up a genocide against Christians in Southern Kaduna.\n“I have alerted the national leadership of Nigeria Union of Journalists, as well as the Union’s Kaduna State Council as a mark of respect.\n“Southern Kaduna at this time is faced with existential threats and therefore needs all hands on deck not behindbars,” he added.\nIt is not the first time Mr Binniyat has had an issue involving the Kaduna State government officials."
  },
  {
    "headline": "Anambra Guber: Why APC Is Declining In South-East – Nwosu",
    "summarized_story": "A Chieftain of the All Progressives Congress (APC) and a former governorship candidate in Imo State, Uche Nwosu, has attributed the declining fortune of the party in the South-East region to a poor reward system that undermined efforts of founding fathers and old members of the party in preference for new entrants.\nAccording to Nwosu, APC leadership abandoned those that planted and nurtured the party in the South-East and instead handed over the structure of the party to defectors from other parties that never knew how APC was founded.\nADVERTISEMENT“The party leadership can’t ignore those that worked so hard and invested their resources and time and expect to continue to win elections.\n“The party can’t gloss over the fact that all is not well, but all hope is not lost if it can reconcile the aggrieved leaders.\nWhat happened in the Anambra State governorship election is a confirmation of the fact that the party vied off the original plan but all that can be remedied,” Nwosu stated."
  },
  {
    "headline": "Anambra Guber: Why APC Is Declining In South-East – Nwosu",
    "summarized_story": "A Chieftain of the All Progressives Congress (APC) and a former governorship candidate in Imo State, Uche Nwosu, has attributed the declining fortune of the party in the South-East region to a poor reward system that undermined efforts of founding fathers and old members of the party in preference for new entrants.\nAccording to Nwosu, APC leadership abandoned those that planted and nurtured the party in the South-East and instead handed over the structure of the party to defectors from other parties that never knew how APC was founded.\nADVERTISEMENT“The party leadership can’t ignore those that worked so hard and invested their resources and time and expect to continue to win elections.\n“The party can’t gloss over the fact that all is not well, but all hope is not lost if it can reconcile the aggrieved leaders.\nWhat happened in the Anambra State governorship election is a confirmation of the fact that the party vied off the original plan but all that can be remedied,” Nwosu stated."
  },
  {
    "headline": "2020 Zik Prize: I’m Motivated To Do More For My Country – Anyim",
    "summarized_story": "Former President of the Senate, Senator Anyim Pius Anyim, has expressed his readiness to do more for Nigeria and Nigerians in his lifetime.\nThe former Secretary to the Government of the Federation (SGF) disclosed this to journalists at the venue of the 26th edition of the prestigious Zik Prize where he received the 2020 Zik Award in Political Leadership category in Lagos on Sunday.\n“I am delighted to be singled out from amongst African leaders for this great honour and recognition of my legacies in building the Nigerian State.\n“I specially thank the advisory board of the PPRC and the members of the committee for this 26th edition of the Zik Prize,” Anyim said.\nMele Kyari, received the Year 2020 Zik Prize in Leadership and the Director-General of the Nigerian Maritime and Safety Agency (NIMASA), Dr Bashir Jamoh, was honoured for the achievements in Public Service."
  },
  {
    "headline": "Anambra poll: INEC blames IPOB for low voter turnout",
    "summarized_story": "The Independent National Electoral Commission has blamed the Indigenous People of Biafra for the low turnout of voters during the Anambra governorship election held on Saturday.\n“We have had a problem with extremely low voter turnout.\nThe voter turnout, I think, if you are scientific in terms of what we are seeing in many local governments, you are actually dealing with less than 25 per cent voter turnout, and this is not really good for our democracy,” he said.\nOn Monday, INEC declared the Anambra governorship election inconclusive until a supplementary election is held in 362 polling units in Ihiala Local Government Area on Tuesday, November 9.\nDespite technical glitches, logistics, and uncertainties over security, the governorship election was conducted in 20 of Anambra’s 21 LGAs."
  },
  {
    "headline": "Anambra poll: INEC blames IPOB for low voter turnout",
    "summarized_story": "The Independent National Electoral Commission has blamed the Indigenous People of Biafra for the low turnout of voters during the Anambra governorship election held on Saturday.\n“We have had a problem with extremely low voter turnout.\nThe voter turnout, I think, if you are scientific in terms of what we are seeing in many local governments, you are actually dealing with less than 25 per cent voter turnout, and this is not really good for our democracy,” he said.\nOn Monday, INEC declared the Anambra governorship election inconclusive until a supplementary election is held in 362 polling units in Ihiala Local Government Area on Tuesday, November 9.\nDespite technical glitches, logistics, and uncertainties over security, the governorship election was conducted in 20 of Anambra’s 21 LGAs."
  },
  {
    "headline": "VIDEO: IKOYI BUILDING: WIFE, BROTHERS OF LATE OSIBONA FIGHT DIRTY OVER MONEY, LUXURY CARS, OTHER ASSETS",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: IKOYI BUILDING: WIFE, BROTHERS OF LATE OSIBONA FIGHT DIRTY OVER MONEY, LUXURY CARS, OTHER ASSETS",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Updated: INEC suspends declaration of Anambra Governorship election results",
    "summarized_story": "The Independent National Electoral Commission, INEC, has suspended the declaration of the Anambra governorship election results.\nHowever, Prof. Charles Soludo of the All Progressives Grand Alliance (APGA) has won 18 of the 20 Local Governments election results so far declared by INEC.\nThe APGA governorship candidate won 18 of the 20 Local Governments declared by INEC so far.\nHe also scored big in Anambra East where he polled 9,746 votes to defeat Uba, who posted 2,034 votes and Ozigbo, garnering 1,380 votes.\nAnambra Governorship election results at a Glance"
  },
  {
    "headline": "Police officer shoots 4 colleagues dead, injures 3",
    "summarized_story": "An officer with the Indian Central Reserve Police Force (CRPF) on Monday opened fire on his colleagues in the central state of Chhattisgarh, killing four of them and injuring three others.\nIndian NDTV broadcaster said the incident took place in the camp of the CRPF 50th battalion in Linganpalli village under Maraiguda police station at 3:15 a.m. local time (21:45 GMT on Monday).\nAccording to preliminary information, constable Reetesh Ranjan, fired at his colleagues with his service weapon, an AK-47 rifle; the shooter was later arrested.\nNDTV said an investigation had been launched into the shooting to establish its motive.\n(Sputnik/NAN)"
  },
  {
    "headline": "DBN holds first Techprenuer Summit",
    "summarized_story": "The Development Bank of Nigeria Plc as part of its commitment to alleviating financial constraints and improving the capacity of SMEs in Nigeria recently held the first edition of its Techpreneur Summit in Lagos.\nShe emphasized that the Techpreneur Summit underscores the ambition of the Bank since it commenced operations in 2017.\n“For DBN, I say this Summit is the coming-out party in the tech space.\nThis is the first DBN Techpreneur Summit, and I know that we will continue this every year.\nThis shows that DBN is ready to be such a partner to all Techpreneurs in the country,” he said."
  },
  {
    "headline": "6 die, 15 injured in Bauchi road crash",
    "summarized_story": "By Olaide AyindeNo fewer than six people lost their lives in a lone road crash that occurred in Bauchi on Sunday, Yusuf Abdullahi the Sector Commander, Federal Road Safety Corps (FRSC) in the state revealed.\nAbdullahi said this in an interview on Monday noting that 15 others were seriously injured as a result of the mishap.\n“There was a crash yesterday involving a Kano line commercial vehicle and six people lost their lives to the crash.\n“Among the 15 injured persons were four males, eight females, one male child and two female children,” the commander added.\nAbdullahi urged motorists to always be conscious of road traffic rules and regulations as well as the weather condition at all times."
  },
  {
    "headline": "Nigeria’s Existence In 2023 Is Unsure — Pastor Enoch Adeboye",
    "summarized_story": "Pastor Enoch Adeboye, the General Overseer of the Redeemed Christian Church of God (RCCG), believes no one knows what the future holds for Nigeria or the 2023 elections.\nAdeboye questioned politicians who are already planning for the 2023 elections, emphasizing that the future is in God’s hands.\nAdeboye said, “This is 2021, some people are already getting ready to kill themselves over 2023.\nThey don’t even know whether there will be 2023, they don’t even know whether they will still be around.\n“Someone said to me, sir, who do you think will be president in 2023, I said the president of where?"
  },
  {
    "headline": "BREAKING: Imo Speaker Impeached As Plot Thickens To Reinstate Iwuanyanwu As House Deputy Speaker",
    "summarized_story": "Kennedy Ibeh, the member representing the Obowo State Constituency, was sworn in as Speaker of the Imo State House of Assembly immediately.\nThe development comes amid growing efforts to restore Amarachi Chyna Iwuanyanwu, the impeached Deputy Speaker.\nAccording to SaharaReporters, Iwuanyanwu invaded the House on Monday with some security agents to guarantee the Speaker, Emeziem, was impeached.\nThe Impeached Deputy Speaker, Iwuanyanwu and some security operatives stormed the House“Only 8 lawmakers removed the Speaker in a House of 27 lawmakers.\nAnd that was why the security operatives were even with the deputy speaker, and stormed the House together with him."
  },
  {
    "headline": "Ikoyi Building Collapse: Death Toll Rises To 43",
    "summarized_story": "Another body has been discovered beneath the rubble at the site of a 21-story building that collapsed in Lagos’ Ikoyi neighborhood last Monday, bringing the total number of those killed to 43.\nThis was revealed in a statement published by Gbenga Omotoso, the Lagos State Commissioner of Information and Strategy, on Sunday.\nThe body was recovered from the rubble on Saturday night, after the government announced the recovery of six more survivors.\nHe wrote, ”One more body has been recovered from the site of the collapsed 21-storey building in Ikoyi, Lagos.\nThe body, which was recovered on Saturday, has brought the number of bodies retrieved from the rubble to 43."
  },
  {
    "headline": "BREAKING: Explosion As Tanker Catches Fire On Lagos-Ibadan Expressway",
    "summarized_story": "A tanker laden with 50,000 AGO has just gutted with heavy fire that has caused disruption of traffic.\nMotorists along Lagos Ibadan Expressway have been urged to exercise utmost restraints and patience due to heavy traffic that will results from the obstruction of traffic flow around Sagamu Interchange.\nAccording to reports, NEMA has contacted Ogun State and Federal Fire Services to file out to the scene.\nNEMA urges motorists not to resort in taking unsecured route while trying to seek alternative access at this time."
  },
  {
    "headline": "Breaking: Fresh crisis hits Imo Assembly as lawmakers remove speaker",
    "summarized_story": "The Imo State House of Assembly has impeached its Speaker, Rt.\nPaul Emeziem, during the House plenary session on Monday morning.\nBlueprint gathered that his impeachment followed allegations of gross misconduct and abuse of office.\nUp to 19 serving lawmakers were said to have impeached the speaker.\nKennedy Ibeh, the member representing Obowo State Constituency as the new speaker."
  },
  {
    "headline": "It’s official: INEC declares Anambra governorship election inconclusive",
    "summarized_story": "The returning of the Independent National Electoral Commission (INEC) for the Anambra governorship election, Prof. Florence Obi, has suspension of collation of results after the November 6 governorship election pending the conduct of the election in Ihiala Local Government Area (LGA).\nObi, the Vice Chancellor of the University of Calabar, Cross River, announced Tuesday, November 9, 2021 as when the election will take place there.\nSen. Andy Uba, the All Progressives Congress (APC) candidate got a total of 42,942 votes to be placed the third position so far.\nObi said that Soludo won in 18 out of the 20 LGAs of those already declared.\nNot Declared)(20) Awka North LGAAPC 755APGA 1908PDP 840YPP 381(21) Anambra West LGAAPC 1233APGA 1918PDP 1401YPP 357"
  },
  {
    "headline": "Latest on Anambra governorship election results: Soludo set to clinch victory as heavyweights lose LGAs",
    "summarized_story": "Soludo won in Anambra East, Ayamelum, Oyi, Dunukofia, Anaocha, Awka South, Idemili South, Onitsha South, Njikoka, Orumba South, Awka North, Anambra West, Nnewi South, Ekwusigo, Idemili North, Onitsha North, and Onitsha South LGAs.\nPolice thumb up electorateMeanwhile, Anambra state Commissioner of Police Echeng Echeng has commended the people of the state for the peaceful conduct of Saturday’s governorship election.\nThe police boss said the peaceful conduct of the election had proven that Anambra was one of the most peaceful states in the country.\nMr Umeh said he was at INEC state headquarters for the collation of election results, adding that the party was thankful to Anambra people for believing in her.\nNot declared)(20) Awka North LGAAPC 755APGA 1908PDP 840YPP 381(21) Anambra West LGAAPC 1233APGA 1918PDP 1401YPP 357"
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Amotekun: Arrest, parade of Northerners dangerous to Nigeria’s unity –Group -NigPilot",
    "summarized_story": "A socio-political group, the Northern Conscience for 2023, NCfor2023, has described the arrest and parade of some youths believed to have been Northerners by the South West Security Network code-named Amotekun , as dangerous for the unity of Nigeria.\nThe security outfit had arrested 18 youths accused of hiding under bags of beans in a trailer, who were all paraded yesterday.\n“It is even more disturbing when one considers that he claims to be a Senior Advocate of Nigeria (SAN) who should have sound knowledge of the law and the constitution; and the fact that Ametokun is not recognized by the Constitution as a law enforcement agency with powers to parade suspects,” he added.\nThe group’s leader, who maintained that the North remains committed to the unity of Nigeria and the invisibility of the country, warned of grave consequences if the region retaliates the treatment meted it in recent times, by other parts of the country.\nThe country cannot afford to endure the carnage and lawlessness spreading within its borders like wildfire,” Gololo further cautioned."
  },
  {
    "headline": "Impeachment saga: Civil society condemns attack on Gov Lalong -NigPilot",
    "summarized_story": "*Preaches peace to embattled SpeakerThe coalition of Civil Society for Good Governance, CCSGG, has condemned in strong terms tirades and attacks against the Plateau State governor, Barrister Simon Bako Lalong by the impeached Speaker of the State House of Assembly, Rt.\n“Gentlemen of the press, we are aware that Plateau State House of Assembly was the first out of 36 States of the Federation to enjoy legislative and judicial autonomy, even when Hon.\n“The lawmakers decided to impeach their leader based on reasons best known to them and elected Hon.\nYakubu Sanda as new Speaker, which we consider as democracy in action, hence, peace should be allowed to reign at all cost,” the convener stressed.\nIt, however, commended Governor Lalong for his maturity and leadership that has ensured peace and tranquility as well as socio-economic and infrastructural development of the state, while calling on the citizens, particularly the youths not to allow themselves to be used."
  },
  {
    "headline": "East-West Road has gulped N359bn- Akpabio -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio has disclosed that over N359billion has so far been expended on the 657km dual carriage East-West Road stretching from Calabar in Cross River State, to Effurun in Delta State since it was initiated in 2006.\nAkpabio said bearing in mind the objectives of President Muhammadu Buhari on the completion of ongoing projects, the Niger Delta Ministry was considering raising funds from other sources to ensure the completion of section I-IV of the road before the end 2023.\nThe minister made this statement during the Ministry’s 2021 Budget Performance Review and 2022 Proposed Budget Consideration to the House of Representative Committee on Niger Delta Affairs on Tuesday in Abuja.\nSpeaking earlier, during the budget presentation the Chairman House of Representative Committee on Ministry of Niger Delta Affairs Hon.\nEssien Ekpeyong, assured that the Legislature is committed to the security of lives and investment in the Niger Delta region and for economic and social activities to strive."
  },
  {
    "headline": "I don’t need god-father to be APC national Chairman – Moniedafe",
    "summarized_story": "One of the prominent contenders for the national chairmanship position of the ruling All Progressives Congress, APC, Chief Sunny Sylvester Moniedafe, on Monday canvassed for the abolition of the concept of godfatherism in Nigerian politics saying it can not last any longer.\nHe said, “This thing is all about I need god-father, and this is what I want us to completely forget about.\nSunny Moniedafe, who threw his hat into the ring for the party’s national chairmanship office in March, 2021 belonged to the ACN bloc and was the Abuja chairman of the party.\nHe was Secretary of ACN in the FCT before the formation of the mega APC.\nHowever, unlike some of the aspirants in the APC national chairmanship race who are publicly backed by one or more prominent figures in the party, Mr Moniedafe at the moment has only his campaign promises."
  },
  {
    "headline": "JUST IN: Lawmakers Impeach Imo State House Of Assembly Speaker",
    "summarized_story": "Lawmakers in the Imo State House of Assembly have impeached the Speaker, Paul Emeziem.\nHe was impeached on Monday during a plenary session at the State House of Assembly in Owerri, the Imo State capital by 19 lawmakers.\nThe 19 lawmakers out of the total 27 lawmakers signed a letter which was read on the floor of the house.\nThe member representing Obowo constituency, Kennedy Ibe, has been elected as the new Speaker of the House.\nPaul Emeziem, a member representing Onuimo Local Government Area was immediately elected as then as the new Speaker of the House."
  },
  {
    "headline": "INEC Suspends Collation Of Results For Anambra Governorship Election",
    "summarized_story": "﻿The Independent National Electoral Commission (INEC) has suspended the collation of results for the Anambra State governorship election.\nINEC’s Chief Returning Officer for the election, Professor Florence Obi, announced this on Monday at the commission’s head office in Awka.\nShe added, “The outstanding results are for Ihiala Local Government Area where for various reasons, the commission could not deploy materials yesterday (Saturday).\n“I have conferred with the commission, being the body that fixes the date for the election, and the commission has decided that the supplementary election will take place on Tuesday, 9th November 2021.\nSee the breakdown of the results announced so far before collation was suspended:"
  },
  {
    "headline": "Anambra Poll: Supplementary Election To Take Place In Ihiala LGA On Tuesday",
    "summarized_story": "﻿The Independent National Electoral Commission (INEC) has fixed Tuesday, November 9 for a supplementary election in Ihiala Local Government Area of Anambra State.\nThe decision to hold supplementary elections in Ihiala LGA follows the failure of INEC to conduct elections there on Saturday.\nAccording to Professor Obi, this failure was due to security challenges which made it impossible for the electoral body to deploy materials and personnel in the LGA.\n“The outstanding results are for Ihiala Local Government Area where for various reasons, the commission could not deploy materials yesterday (Saturday).\n“I have conferred with the commission, being the body that fixes the date for the election, and the commission has decided that the supplementary election will take place on Tuesday, 9th November 2021."
  },
  {
    "headline": "Anambra Election: Soludo Wins 18 Out Of 20 LGAs Declared",
    "summarized_story": "The candidate of the All Progressives Grand Alliance (APGA), Charles Soludo, on Sunday opened and maintained the lead in the Anambra State governorship election.\nSoludo, a former governor of the Central Bank of Nigeria (CBN), won 18 of the 20 local government areas for which results were declared by the Independent National Electoral Commission (INEC).\nElections were not held in Ihiala Local Government Area and a supplementary election has been scheduled to take place on Tuesday, November 9.\nThe results from the 20 LGAs showed that Soludo polled a total of 103,946 votes, more than twice that of his closest opponent, PDP’s Valentine Ozigbo who got 51,322 votes.\nThe table below highlights the results collated from the 20 local governments so far:"
  },
  {
    "headline": "Lagos Outlines Mass COVID-19 Vaccination Plans",
    "summarized_story": "The Lagos State Government says a robust vaccination strategy has been established to ensure four million residents of the state are fully vaccinated before the end of December 2021.\n“With this approach, we intend to ramp up our vaccination strategy using the existing public facilities as well as the inclusion of some private facilities.\n“The decision to leverage the private sector is based solely on our resolve to include private health facilities and corporate institutions as additional sites for the COVID-19 vaccination administration.\nThose that require their vaccination at any of the public facilities should visit the national platform at https://publicreg.vaccination.gov.ng to register and schedule their vaccination or register on arrival at any of the 206 public sites.\nThose requiring vaccination at any selected private facilities should please, in addition, visit https://lagosvaccine.com to book and pay for their vaccination, either before or after registering on the national platform."
  },
  {
    "headline": "INEC to hold supplementary election on Tuesday November 9th -",
    "summarized_story": "State Returning Officer, Florence Obi announces Suspension of collation and announcement of a winner in the Anambra State Governorship Election until Supplementary election for Ihiala Local Government Area is held and concluded.\nThe supplementary polls will hold in 326 Polling Units in Ihiala on Tuesday the 9th of November, 2021.\nThe Returning Officer explained that election did not hold in Ihiala Local Government Area because the commission was unable to deploy officials and materials due to security threats on the 6th of November 2021.\nShe added that INEC is required by the constitution to conduct election in the affected area before proceeding to announce a winner."
  },
  {
    "headline": "INEC Declares Anambra Governorship Election inconclusive",
    "summarized_story": "The supplementary election will be held on Tuesday the 9th of November 2021.\nShe declared that the election process remains suspended until after a supplementary election is held in all the polling units of Ihiala Local Government.\nShe said the failure to conduct the election in Ihiala Local Government on election day has made it impossible to reach a definite conclusion under the Electoral Act on the result of the election.\nThe Returning Officer of the Anambra State Governorship Election, Professor Florence Obi, has declared the election inconclusive.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided."
  },
  {
    "headline": "Bandits kill 2 of abducted Anglican Worshippers",
    "summarized_story": "At least two persons were reportedly killed and several other worshippers abducted when armed bandit attacked Emmanuel Baptist Church In Kaduna state on the 31st of October 2021.\nThe Baptist church is located in Kakau Daji community in Chikun local government area of the State.\nAs at the time of filling this report, the Kaduna state government and Police command in the State were yet to confirm the actual number of persons abducted in that attack.\n121 students were abducted and two military personnel killed in the process.\nMeanwhile 117 abducted students were released in batches after ransom was paid by their parents but 4 students are still in the bandits custody after 128 days."
  },
  {
    "headline": "Group wants Asiwaju Tinubu to declare his intention for 2023 Presidency -",
    "summarized_story": "Nigerians have been urged to exercise their franchise and participate actively in determining those that will steer the ship of the country in the coming 2023 General Election.\nDirector general of a pro Tinubu group, Coalition of Support Groups for Asiwaju Bola Tinubu Akin Babatunde made the call at an inauguration of its members held recently in Ibadan the Oyo state capital.\nHe appealed to various interest groups in the country, especially the youths and women groups to queue behind and support candidates that have genuine interest of the masses at heart.\nThe DG also declared the group’s support for a chieftain and leader of the All Progressives Congress Asiwaju Bola Ahmed Tinubu to run for the forthcoming 2023 general election.\nHe said in solidarity for Asiwaju Tinubu, a One million Man march would be done, asking the APC leader to declare his intention to contest for the post of presidency in the 2023 election."
  },
  {
    "headline": "At ART X Lagos 2021 (Watch)",
    "summarized_story": "ART X Lagos returned to its physical venue at the Federal Palace Hotel in a show of resilience in the face of the pandemic.\nThe annual event designed as a platform for the best and most innovative contemporary art from the African continent features presentation from various galleries, talk programs and specially curated Art Projects that could be appreciated in person and also virtually.\nARISE Correspondent Seyitan Atigarin brings us the details…"
  },
  {
    "headline": "Coup Leader Burhan Says He Will Not Be Part of Sudan Government after Transition",
    "summarized_story": "Nationwide anti-coup protests have taken place since the October 25 power grab by the army, but have been met by a deadly crackdown.\n“The Sudanese army does not kill citizens, and there are investigation committees to reveal what happened,” he said.\n“The Sudanese people have rejected the military coup,” the SPA said, vowing “no negotiation, no partnership”.\nHundreds of anti-coup protesters rallied in Khartoum, as well as in its twin city of Omdurman, Wad Madni to the south, and the northern city of Atbara.\nAl-Burhan insists it “was not a coup” but a move to “rectify the course of the transition”."
  },
  {
    "headline": "F1: Max Verstappen Extends Title Lead Over Lewis Hamilton with Mexico City Win",
    "summarized_story": "Red Bull’s Max Verstappen took a dominant victory in the Mexico City Grand Prix to strengthen his chances of a first World Championship.\nVerstappen’s title rival Lewis Hamilton was second, the Mercedes driver holding off a charge from Verstappen’s team-mate Sergio Perez in the closing laps.\nVerstappen’s ninth win in 2021 gives him a 19-point lead with four races and a total of 107 points remaining.\nHamilton’s team-mate Valtteri Bottas deprived the Dutchman of the point for fastest lap on the final tour.\nMercedes stopped Hamilton on that lap because he was beginning to come under threat from Perez and they wanted to ‘bank’ track position."
  },
  {
    "headline": "Afghans Facing ‘Hell on Earth’ as Winter Looms",
    "summarized_story": "The flour was provided by the World Food Programme.\nTaliban soldiers kept the crowd reasonably quiet, but people who were told they weren’t eligible for a hand-out were angry and frightened.\n“Ninety-five percent of the people don’t have enough food, and now we’re looking at 23 million people marching towards starvation,” he added.\nNow the snow is beginning to settle on the nearby mountain-tops and there is a new sharpness in the air.\nThe winter will very soon be here, and huge numbers of people like Fatema and her family will be on the very brink of catastrophe."
  },
  {
    "headline": "COP26: Fossil Fuel Industry Has Largest Delegation at Climate Summit",
    "summarized_story": "There are more delegates at COP26 associated with the fossil fuel industry than from any single country, analysis shared with the BBC shows.\nThey found that 503 people with links to fossil fuel interests had been accredited for the climate summit.\nIts agenda is driven by fossil fuel companies and serves the interests of fossil fuel companies,” Mr Worthy said.\nMembers include fossil fuel companies but also a range of other businesses.\n“If we’re serious about raising ambition, then fossil fuel lobbyists should be shut out of the talks.”BBC"
  }
]