[
  {
    "headline": "JUST IN: Fire guts CBN office in Benue",
    "summarized_story": "There was a fire incident at the Makurdi branch of the Central Bank of Nigeria in Benue State.\nEyewitnesses said that they noticed the fire at the back of the bank which is located in the Old GRA area, Makurdi, Benue State capital.\n“It was around 7:00 am this morning that we noticed the fire at the premises of the bank,” Stanley said.\nWhen contacted, the Director of Benue State Fire Service, Donald Ikyaaza, confirmed the report and said that he received a distress call about the fire incident and promptly deployed his men to the scene.\nEverywhere is calm now.”At the time our correspondent visited the area, around 10:45 am, security men had barricaded the area."
  },
  {
    "headline": "Come without phones, Aisha Buhari invites presidential aspirants to dinner",
    "summarized_story": "All Presidential aspirants from various political parties will converge on the State House Conference Centre at 06:30 pm on Saturday, April 23, 2022, for a Ramadan Iftar dinner with the First Lady, Aisha Buhari.\nHowever, this directive will not apply to Vice President Yemi Osinbajo and governors and ministers who are expected to be at the meeting; The PUNCH learnt.\nI“f they are coming for an event, this is supposed to be DSS enforced when the president is having an event or the Vice President is having an event or the first lady is having an event.\n“That does not apply to the Vice President.\nHow can you expect that to apply to the Vice President or even to ministers?”Copyright PUNCH."
  },
  {
    "headline": "Chrisland: Ensure proactive regulation, affordable quality education, not shutting schools — Lagos PDP blasts govt",
    "summarized_story": "The People Democratic, PDP, Lagos State, has faulted government on the shutting down of Chrisland Schools in the state in the wake of the viral video of its students engaging in sexual activities.\nIn fact, PDP blamed the APC-led state government for worsening the collapse of the social institutions.\nA video had emerged on the social media showing students of Chrisland Schools engaging in sexual activities.\n“They should look more at regulations and providing good schools that are affordable for all, inrespective of class or financial status.\n“It must be noted that the Chrisland incidence is also as a result of APC government failing the masses.”"
  },
  {
    "headline": "Sex scandal: Prof Opefeyitimi has case to answer —OAU",
    "summarized_story": "It also dismissed insinuations that the university is attempting to shield a professor accused of alleged sexual assault against a student in the school.\n“Procedurally, after the receipt of the formal complaints, the first step was that the departmental committee sat on the matter and, after a thorough investigation, Professor Opefeyitimi was found prima facie liable.\nThe committee, which also sat and clinically deliberated on this same matter, recommended appropriate disciplinary actions against Professor Ayo Opefeyitimi to the University Management.\n“The present University Management does not condone sexual rascality of any form, under any guise against any member of the University community from anybody.\nWe also pledge to continue to protect our students, particularly the female ones, against any sexual predator, no matter how highly placed.”Vanguard News Nigeria"
  },
  {
    "headline": "Boko Haram razes Technical College Gaidam, kills one",
    "summarized_story": "By Ndahi MaramaArmed members of terrorists suspected to ISWAP group on Wednesday evening invaded Gaidam local Government area of Yobe state and razed down a Technical College in the town.\nOne died on the spot and the other is still responding to treatment at an undisclosed hospital.\nThis attack which took place at about 9pm is coming barely one year when the town was attacked by terrorists, killing several residents.\nSources revealed that the insurgents came on foot from different directions and wrecked havoc on Wednesday with setting ablaze the Technical college.\nGaidam is the home town of the immediate past governor, now Senator Ibrahim Geidam located north of Yobe state."
  },
  {
    "headline": "Power sector recovery back on track — FG",
    "summarized_story": "By Obas EsiedesaABUJA—THE Federal Government said, yesterday, that the effort to improve power supply across the country was back on track, after about two months of challenges that led to the collapse of the national grid thrice within a month.\nThe government said it expected the grid to deliver a minimum of 4,500 Megawatts of power daily.\nALSO READ:Speaking at a Power Sector Recovery Programme, PSRP, workshop for journalists in Abuja, Chairman of the Nigerian Electricity Regulatory Commission, NERC, Sanusi Garba, said consumers would soon begin to see changes in electricity supply.\n“Notwithstanding the electric power supply industry is now private sector driven, its relevance to economic growth and industrial development will require strategic government interventions.\nThis is the minimum level of supply necessary for grid stability and the reduction of system outage.”."
  },
  {
    "headline": "Boko Haram: You can’t kill innocent people, shout Allah Akba —Buhari",
    "summarized_story": "By Johnbosco Agbakwuru, AbujaPresident Muhammadu Buhari, yesterday, said Boko Haram insurgency has neither religious nor ethnic underpinning.\nAccording to him, with adequate education, majority of Nigerians now know the truth.\nYou can’t kill innocent people, and shout; Allah Akbar (God is great).\nIt’s either you don’t know that God at all, or you are simply being stupid.\n“To say Western education is unacceptable (Haram) is very fraudulent."
  },
  {
    "headline": "Nigeria’s insecurity worsening, it’s time for State Police – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo says the growing spate of insecurity in Nigeria would be curtailed by State Police, not community policing.\nObasanjo made the suggestion when the leadership of the National Association of Ex-local Government Chairmen in Nigeria visited him in Abeokuta.\nObasanjo commended the formation of the body, noting that some local chairmen in the country were better than some top elected leaders.\nObasanjo advocated the strengthening of the traditional system and local government administration which he prepared during the Murtala/Obasanjo administration.\nObasanjo added that the experience of the ex-chairmen in local government administration was enough to aspire for higher posts."
  },
  {
    "headline": "2023: It’s failure – Arewa youths speak on Osinbajo’s Presidential ambition, betraying Tinubu",
    "summarized_story": "The Arewa Youths Consultative Forum, AYCF, on Thursday, faulted the decision of the Vice President, Yemi Osinbajo, to run for the 2023 Presidency.\nNational President of AYCF, Yerima Shettima, said Nigeria would continue on the path of failure if Osinbajo succeeds President Muhammadu Buhari in 2023.\nSpeaking exclusively with DAILY POST, Shettima faulted Osinbajo’s declaration to continue the legacies of Buhari’s administration if elected in 2023.\nThe AYCF National President wondered if it’s the policy of alleged corruption, nepotism, or retrogression of the Buhari administration that Osinbajo intends to continue.\nHe wondered why Osinbajo declared for the Presidency after he vowed never to contest against his acclaimed ‘godfather’ Tinubu."
  },
  {
    "headline": "Interim govt invitation to anarchy – Shinkafi on Afe Babalola’s comment",
    "summarized_story": "Abdullahi Sani Shinkafi, a chieftain of the All Progressives Congress (APC), has said the constitution of a national interim government is an invitation to chaos and anarchy.\nHe was responding to calls made by Chief Afe Babalola (SAN) for a national interim government after the expiration of President Muhammadu Buhari’s administration to pave way for a new constitution in Nigeria.\nHe faulted Babalola for advocating for the constitution of the interim national government, saying that it would cause a constitutional crisis and political disorder in the country.\n“Those making that call do not mean well for the Nigerians and her teeming population which could be termed as invitation to anarchy and political disorder,” he added.\nShinkafi further called on President Muhammadu Buhari to tighten his belt in order to address the teething security challenges currently bedevilling the country."
  },
  {
    "headline": "Osinachi’s death: Real reason Ekwueme singer refused to divorce her husband revealed",
    "summarized_story": "A brother of late gospel singer, Osinachi Nwachukwu, Chiemerie, has disclosed why the late singer refused to divorce her husband, Peter Nwachukwu.\nChiemerie said the Ekwueme singer opted to stay in the abusive marriage due to how her followers would perceive her.\nShe was going through all these and she refused to tell me because I would have known what to do.\nThe gospel singer gave up the ghost on April 8 at the National Hospital in Abuja, where she was being treated for alleged throat cancer.\nHowever, there are claims that Osinachi died as a result of lingering domestic violence she suffered from her husband."
  },
  {
    "headline": "Parents should take larger blame for children’s behaviour – Private school owners on Chrisland sex video",
    "summarized_story": "The National Association of Proprietors of Private Schools (NAPPS) has reacted to the leaked sex video involving some juveniles of Chrisland School, Lagos, who were in a competition of World School Games held in Dubai recently.\nNAPPS noted that parents are to take greater blame for their children’s behaviour in shaping them to become responsible in society.\n“Most studies show that parents are to take the larger portion of the blame for children’s behaviour, hence parents must take a greater role in shaping their children’s future by inculcating morally acceptable behaviour in them.\n“They must bear in mind that children’s moral development begins at home.\n“Technological devices used by students in schools must be restricted to ensure students are limited to educational sites only."
  },
  {
    "headline": "BREAKING: Buhari meets Service Chiefs, Ministers",
    "summarized_story": "By Bolaji Ogundele, AbujaPresident Muhammadu Buhari is presiding over a meeting with the some Ministers and Heads of security establishments at the Presidential Villa, Abuja.\nThe meeting, which started at 10am, is sequel to the recommendations by the Council of State over insecurity across the nation.\nThe Ministers of Defence Bashir Magashi; Interior, Rauf Aregbesola; and Foreign Affairs, Geoffrey Onyeama are also at the meeting.\nThe Chief of Army Staff Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao are also in attendance.\nThe Chief of Defense Staff, General Lucky Irabor was represented."
  },
  {
    "headline": "Strike: ASUU tackles Fed Govt over N4trn fuel subsidy budget",
    "summarized_story": "By Frank Ikpefan, AbujaThe Academic Staff Union of Universities (ASUU) has taken a swipe at the Federal Government for allocating N4trn to subsidise petroleum products for Nigerians.\nThe union accused the government of failing to prioritise the development of university education in the country.\nASUU President, Prof Emmanuel Osodeke, said this during his appearance on Sunrise Daily, a breakfast programme on Channels Television on Wednesday.\nOthers are deployment of the University Transparency and Accountability Solution (UTAS) for the payment of salaries and allowances of university lecturers.\nFollowing the expiration of the initial four weeks of the warning strike, ASUU had gone ahead to declare another eight weeks strike, saying that it was giving the government more time to meet its demands."
  },
  {
    "headline": "Abductors demand N100m ransom for popular Akwa Ibom cleric",
    "summarized_story": "By BASSEY ANTHONY, UyoAbductors of a popular pastor in Akwa Ibom State, Apostle John Okoriko, are demanding N100million ransom before he could be released from their captivity.\nAn eyewitness said the hoodlums jumped through the fence and forced their way into the cleric’s living room.\nAccording to the source, the gunmen opened fire indiscriminately to scare away people and dragged the octogenarian preacher into the nearby bush.\nThe source said the police were immediately contacted while some youths joined to comb the bush to search for the pastor.\nConfirming the incident, Akwa Ibom Police spokesman, SP Odiko Macdon, said the abduction occurred on Tuesday around 5 pm at the cleric’s residence in Mkpat Enin."
  },
  {
    "headline": "BREAKING: APC presidential form to go for N100m",
    "summarized_story": "BREAKING: APC presidential form to go for N100mGet real time updates directly on you device, subscribe now.\nBy Samuel OamenThe All Progressives Congress (APC) has stated it would begin selling nomination and expression of interest forms for various electoral offices from Saturday, April 23, 2022.\nHe also said the party has pegged its presidential nomination and expression of interest forms at N100 million.\nThe nomination form would go for N70 million while expression of interest forms would go for N30 million.\nOpposing an earlier announcement by the party’s national women leader, Betta Edu, that the women will get free forms, Morka said women are entitled to free nomination forms but will pay for their expression of interest forms."
  },
  {
    "headline": "Many killed, houses burnt as Ilaje, Ibeno clash in Akwa Ibom",
    "summarized_story": "By BASSEY ANTHONY, UyoAn ethnic clash between Ibeno indigenes in Akwa ibom state and the Ilaje residents, mostly fishermen, have left many people dead and houses razed.\nThe Nation earnt the clash erupted on Wednesday after weeks of ethnic tension.\nThe Ilaje residents have reportedly started fleeing the community through bush paths while their houses and tents are being looted and destroyed by hoodlums.\nAn Ilaje living in Akwa Ibom state Barr.\nI also want to call on the Governor of Akwa Ibom State as well as Head of all security agencies in the state to intervene in the matter immediately in order to stem down this waves of violence."
  },
  {
    "headline": "2023: Osinbajo, Obi top list of Nigeria’s presidential hopefuls – polls",
    "summarized_story": "Assessing the responses from a geopolitical dimension, the presidential preference for respondents from southern Nigeria were Peter Obi (51.2 percent) and Yemi Osinbajo (26.6 percent).\nFor the position of Vice President, these same respondents preferred Aminu Tambuwal (30.2 percent), Peter Obi (16.6 percent) and Musa Kwankwaso (16.6 percent).\nThe presidential preferences for respondents from northern Nigeria were Yemi Osinbajo (34.2 percent), Peter Obi (20 percent), and Musa Kwankwaso (13.2 percent).\nThe respondents’ preferences for the vice presidency were Musa Kwankwaso (32.9 percent), Aminu Tambuwal (17.1 percent) and Peter Obi (14.4 percent).\nObi and Osinbajo were the most preferred candidates, while Tinubu and Malami were the least preferred candidates."
  },
  {
    "headline": "JUST IN: Central Bank of Nigeria, Makurdi Branch, Benue state on fire",
    "summarized_story": "From Rose Ejembi, MakurdiAn early morning fire, on Thursday, engulfed part of the Makurdi office of the Central Bank of Nigeria (CBN) situated at the Old GRA area of the Benue State capital.\nThe fire which reportedly started from the fuel dome of the bank quickly became ferocious thus drawing the attention of some workers who immediately raised alarm.\nStaff of the bank and members of the community quickly rushed to the scene and called in fire service before the fire could spread to the main building.\nWhen contacted, the Director of Benue State Fire Service, Engr.\nDonald Ikyaaza who confirmed the report said he received a call informing him about the fire and he immediately drafted his men to the scene."
  },
  {
    "headline": "2023: 2 Igbere businessmen set to sign N200m cheque for Lawan, Orji Kalu’s presidential forms",
    "summarized_story": "The businessmen, Ukaegbu James and Nnanna Kalu, made the announcement on Wednesday evening in Abuja, noting that both Lawan and Kalu are competent leaders to succeed President Muhammadu Buhari in 2023.\nThe duo noted that APC needed a unifier and committed leader with a good knowledge of Nigeria to succeed President Muhammadu Buhari in 2023.\nThey said: “If we must get it right in 2023, we need a result-oriented leaders, like Kalu and Lawan, to succeed President Muhammadu Buhari in 2023.\nIt is time to present our best hands because there won’t be any room for writing of fake results.\n“We are ready to make N200 million available by weekend to purchase their nomination forms."
  },
  {
    "headline": "Boko Haram attacks Yobe town",
    "summarized_story": "From Timothy Olanrewaju MaiduguriGeidam, a town in northeast Yobe State came under Boko Haram/ISWAP attack late Wednesday, leaving about 10 people dead according to residents and security sources.\nSome residents said the terrorists sneaked into a joint at Angwar Kweri on foot and ambushed over a dozen of people.\n“They killed 10 people and fled before the arrival of soldiers,” a source told The Sun.\nGeidam is located southeast of Yobe and has witnessed more than five attacks by Boko Haram in the decade-long insurgency in the ares."
  },
  {
    "headline": "Insecurity: Buhari blows hot, promises harsh measures",
    "summarized_story": "He said the major challenges have remained in the North Central and North West vowing: “We are going to be very tough.\nOur main problem now is in the North West and North Central.\nThe president urged party members to be mindful of the pitfalls that led to the ouster of the PDP in 2015.\n“The PDP thought that only time could remove them, and the time actually came.\nI call on all party members to abide by all extant laws, rules, and regulations and to leaders of our party to avoid imposition of candidates that cannot win popular elections."
  },
  {
    "headline": "Rethink Your Policy on Fuel Subsidy, World Bank Tells Nigeria",
    "summarized_story": "The President, had in a letter to the Legislature dated 10th February, 2022, sought an additional N2.557 trillion to fund subsidy payments from July to December, 2022.\nThe Lead Economist, Nigeria Country office of the World Bank, Marco Antonio Hernandez, had painted a gloomy picture of Nigeria if the country decides to continue with the controversial fuel subsidy.\n“So, we encourage that when there is need for subsidy, either food or for fuel, that it should be carefully targeted at those most in need of it.\nAnd so, we have encouraged Nigeria to rethink its subsidy effort,” he said.\nShe noted: “To address debt, countries need domestic policies that can help bring their budgets back on track, while providing targeted assistance to the most vulnerable."
  },
  {
    "headline": "At Close of Nomination, 17 PDP Presidential Aspirants Beat Deadline",
    "summarized_story": "The party realised N640 million from the 16 male presidential aspirants and N6 million from the only female presidential aspirant, Diana, making the revenue generated N646 million.\nNational Organising Secretary of PDP, Bature Umar, in a statement, said the screening of presidential aspirants would commence April 27, while the governorship aspirants would be screened on April 26.\nAppeals from governorship aspirants would be addressed on April 29, and the presidential appeal committee would hear appeals from dissatisfied presidential aspirants on April 30, the statement said.\nYesterday, also, the Akwa Ibom State governor addressed the party’s NWC on his presidential aspiration, likening the 2023 presidential election to a war, and required an experienced politician to carry the APC presidential ticket.\nAyu advised the PDP presidential aspirants to take their campaigns to the delegates, as their votes would decide the 2023 presidential candidate of the party."
  },
  {
    "headline": "Breaking: APC Pegs Presidential Forms at N100m",
    "summarized_story": "Adedayo AkinwaleThe All Progressives Congress (APC) has resolved to sell its presidential form at the cost of 100 million.\nWhile the Expression of Interest form is fixed at the cost of N30 million, the nomination form cost N70 million.\nThis was part of the decision ratified at the emergency National Executive Council (NEC) meeting held on Wednesday in Abuja.\nThe sale of forms of the ruling party will commence on April 22, 2022.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: With Advancement in Technology, No One Can Claim Millions of Votes Again",
    "summarized_story": "Specifically on the 2023 elections, the president affirmed that being beneficiary of free, fair and credible elections, the introduction of technology and the Permanent Voters Card (PVCs), would make it impossible for anyone to claim millions of votes again in the country.\nKaduna and other states in the North are sick security-wise and it is affecting other parts of the country.\nNigeria is very close to the Thomas Hobbes’ ‘state of nature’ where life is described as nasty, brutish and short.\nIn a related development, Diri was decorated as an ambassador against drug abuse by the state command of the National Drug Law Enforcement Agency (NDLEA).\nLagos State government had yesterday shut Chrisland School over alleged sex scandal involving a 10-year-old female pupil during a trip to Dubai."
  },
  {
    "headline": "Soyinka to Buhari: Pardoning Dariye, Nyame Means ‘It Is Finished’",
    "summarized_story": "In a similar vein, the National Association of Seadogs (Pyrates Confraternity) yesterday condemned the presidential pardon granted to the two former governors convicted for corruption.\nThe NAS Capoon, Mr. Abiola Owoaje, in a statement titled, “Presidential Pardon for Corrupt Ex-governors: Buhari’s death knell for the anti-graft war,” and made available to THISDAY in Yenagoa, said the intention of presidential pardon ought not to be for the likes of Nyame and Dariye.\nOwoaje pointed out that the presidential pardon was inconsistent with Sections 15(5), 17(a) and 42 of the 1999 Constitution, as amended.\nSadly, the presidential pardon has made mockery of the war against corruption.\nIn granting state pardon to corrupt individuals, President Buhari has conferred on himself the status of the Chief Undertaker that sounded the death knell for his administrations’ anti-graft war.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Aisha Buhari Invites Osinbajo, Tinubu, Wike, Atiku, Peter Obi, Others For Ramadan Dinner, Warns Them Against Coming With Phones",
    "summarized_story": "The First Lady, Aisha Buhari, has sent out invitations to aspirants gunning for the presidency of the country in the different political parties to show up for a Ramadan dinner with her on Saturday, April 23.\nAccording to the invitation card, the presidential aspirants are expected to present their invitation cards at the gate of the venue otherwise they may be turned back.\nThe presidential aspirants were also instructed to leave their phones behind when coming for the dinner.\nThe ruling All Progressives Congress (APC) currently has about 8 presidential aspirants.\nThe Governor of Ebonyi State, Dave Umahi, followed suit, and in a similar fashion, visited Buhari to inform him of his intention to run for the coveted number one position in the country."
  },
  {
    "headline": "Aisha Buhari Invites Osinbajo, Tinubu, Wike, Atiku, Peter Obi, Others For Ramadan Dinner, Warns Them Against Coming With Phones",
    "summarized_story": "The First Lady, Aisha Buhari, has sent out invitations to aspirants gunning for the presidency of the country in the different political parties to show up for a Ramadan dinner with her on Saturday, April 23.\nAccording to the invitation card, the presidential aspirants are expected to present their invitation cards at the gate of the venue otherwise they may be turned back.\nThe presidential aspirants were also instructed to leave their phones behind when coming for the dinner.\nThe ruling All Progressives Congress (APC) currently has about 8 presidential aspirants.\nThe Governor of Ebonyi State, Dave Umahi, followed suit, and in a similar fashion, visited Buhari to inform him of his intention to run for the coveted number one position in the country."
  },
  {
    "headline": "Top Nigerian University, OAU Recommends Disciplinary Sanctions Against Professor Accused Of Sexually Assaulting Student In Office",
    "summarized_story": "The departmental committee which sat on the matter recommended that appropriate disciplinary sanctions should be taken against Opefeyitimi.\n“Procedurally, after the receipt of the formal complaints, the first step was that the departmental committee sat on the matter and, after thorough investigation, Professor Opefeyitimi was found prima facie liable.\nThe committee, which also sat and clinically deliberated on this same matter, recommended appropriate disciplinary actions against Professor Ayo Opefeyitimi to the university management.\nShe said Opefeyitimi sexually molested her during a visit to his office on March 18, 2022.\n“Professor Opefeyitimi teaches a class that I currently take, and he has the power to fail me or give me any grade that he pleases."
  },
  {
    "headline": "Top Nigerian University, OAU Recommends Disciplinary Sanctions Against Professor Accused Of Sexually Assaulting Student In Office",
    "summarized_story": "The departmental committee which sat on the matter recommended that appropriate disciplinary sanctions should be taken against Opefeyitimi.\n“Procedurally, after the receipt of the formal complaints, the first step was that the departmental committee sat on the matter and, after thorough investigation, Professor Opefeyitimi was found prima facie liable.\nThe committee, which also sat and clinically deliberated on this same matter, recommended appropriate disciplinary actions against Professor Ayo Opefeyitimi to the university management.\nShe said Opefeyitimi sexually molested her during a visit to his office on March 18, 2022.\n“Professor Opefeyitimi teaches a class that I currently take, and he has the power to fail me or give me any grade that he pleases."
  },
  {
    "headline": "Is Buhari a reluctant political godfather?",
    "summarized_story": "Buhari has unremittingly warned members of his party – the All Progressives Congress – who are running for political office to desist from merchandising his name in their campaigns.\nThe president said he would not interfere or diddle with the electoral process to secure political advantage for anyone.\nBuhari is very reluctant about becoming a political godfather – even when it seems political knights-errant need him to be one.\nThat was the only person he named for a position in the APC national working committee (NWC).\nOn political matters, Buhari has really lived up to his 2015 pledge: ‘’I belong to everybody and I belong to nobody.’’By Fredrick Nwabufo; Nwabufo aka Mr OneNigeria is a writer and journalist."
  },
  {
    "headline": "Is Buhari a reluctant political godfather?",
    "summarized_story": "Buhari has unremittingly warned members of his party – the All Progressives Congress – who are running for political office to desist from merchandising his name in their campaigns.\nThe president said he would not interfere or diddle with the electoral process to secure political advantage for anyone.\nBuhari is very reluctant about becoming a political godfather – even when it seems political knights-errant need him to be one.\nThat was the only person he named for a position in the APC national working committee (NWC).\nOn political matters, Buhari has really lived up to his 2015 pledge: ‘’I belong to everybody and I belong to nobody.’’By Fredrick Nwabufo; Nwabufo aka Mr OneNigeria is a writer and journalist."
  },
  {
    "headline": "Lawmaker representing Buhari’s senatorial district defects from APC to PDP",
    "summarized_story": "Ahmed Babba Kaita, senator representing Katsina north senatorial district, has resigned his membership of the All Progressives Congress (APC).\nPresident Muhammad Buhari is from Daura, one of the LGAs in the senatorial district.\nAccording to a statement released on Wednesday, Abdulkadir Lawal, the senator’s aide, said Kaita has joined the Peoples Democratic Party (PDP).\nLawal said the PDP represents the “ideals” of the senator as a representative of the people.\nAdvertisement“A clear stock-taking of where Katsina state stands today, is already enough burden on good conscience."
  },
  {
    "headline": "Lawmaker representing Buhari’s senatorial district defects from APC to PDP",
    "summarized_story": "Ahmed Babba Kaita, senator representing Katsina north senatorial district, has resigned his membership of the All Progressives Congress (APC).\nPresident Muhammad Buhari is from Daura, one of the LGAs in the senatorial district.\nAccording to a statement released on Wednesday, Abdulkadir Lawal, the senator’s aide, said Kaita has joined the Peoples Democratic Party (PDP).\nLawal said the PDP represents the “ideals” of the senator as a representative of the people.\nAdvertisement“A clear stock-taking of where Katsina state stands today, is already enough burden on good conscience."
  },
  {
    "headline": "Any youth who can't raise N50m shouldn't be running for president, says Betta Edu",
    "summarized_story": "Betta Edu, national women leader of the All Progressives Congress (APC), says any youth aspiring to become the president of Nigeria in 2023 should have access to at least N50 million.\nThe ruling party had, on Wednesday, announced the price of the nomination forms for various political positions.\nThe party’s presidential hopefuls are expected to pay N100 million to buy the nomination forms, while the governorship hopefuls will pay N50 million.\nThere are many ways young people can generate funds to run for whatever elections they have.\nIf you don’t even have access to N50 million and you want to run for the presidency, then there is a problem already."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "After losing 200,000 subscribers, Netflix considers ad-supported plans and cracking down on password sharing",
    "summarized_story": "For the first time in the past decade, Netflix announced that it lost subscribers in a quarter.\nNetflix previously told shareholders it’s expected to add 2.5 million net subscribers during the first quarter.\nIn the wake of its loss of subscribers, Netflix wants to maximise revenue from existing subscribers and viewers.\nThe company has already started testing ways to prevent sharing passwords.\nTo curb the loss of subscribers Netflix is now planning to introduce lower-priced, ad-supported plans."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, There are four types of people in this world.\nThe first are those who understand times and seasons, the..."
  },
  {
    "headline": "Blockchain-powered insurance: Meet the decentralised insurance protocol, Etherisc, insuring Kenyan farms against bad climate",
    "summarized_story": "Share this article:The concept of decentralised insurance became a theoretical possibility with the emergence of decentralised finance (DeFi).\nWhile DeFi platforms continue to offer borrowing, lending, and staking services, Etherisc, an open-source, decentralised insurance protocol, brings affordable insurance to African farmers away from the complex DeFi protocols.\nFrom traditional insurance to decentralised insuranceEtherisc team with Keyan localsBerende has been in the insurance space since the early 2000s.\nAccording to the Africa Insurance Pulse 2022, insurance penetration in Africa stood at 2.78%, a decline from 2.98% in the previous year.\nHowever, satellite data is not as precise as data obtained from the ground when measuring precipitation."
  },
  {
    "headline": "Concordium Foundation chairman spreads the message of compliance in blockchain technology",
    "summarized_story": "Share this article:Lars Seier Christensen, Chairman, Concordium Foundation and founder of Seier Capital, met with some stakeholders in the blockchain, financial, and tech space in an exclusive event held at Four Points by Sheraton on Thursday, April 14.\nLars Seier Christensen gave a lecture touching on the blockchain, the internet, Concordium blockchain, and investing, among others.\nHis talk stressed that the Concordium blockchain is big on compliance and working with regulators because he believes that blockchain technology regulation is inevitable.\nThe important thing about blockchain is blockchain.\nThe use cases for blockchain are immense, and one of the use cases of a well-built blockchain is the preservation of data."
  },
  {
    "headline": "Kenyan entrepreneurs welcome Google’s product development centre but could struggle to hold on to talent",
    "summarized_story": "Share this article:On Monday, April 19, 2022, Google announced the opening of its first product development centre in Nairobi, the Kenyan capital.\nAs the global battle for tech talent heats up, African tech talents have been thrust into the spotlight.\nAdvertisementHowever, while this development bodes well for local talents, it affects the ability of local startups or businesses to hire suitable talents.\nAdvertisement“It’s great for the local ecosystem; more talent and hubs will lead to better software products and development across the country.\n“The recent launch by these global companies will certainly make the talent market a bit more competitive."
  },
  {
    "headline": "Insecurity: Buhari summons Service Chiefs, others",
    "summarized_story": "President Muhammadu Buhari has again summoned the Service Chiefs and other major stakeholders in the country’s security architecture to a meeting over the nation’s intractable security challenges.\nThe meeting which is taking place inside the Council Chambers of the Presidential Villa, Abuja, BusinessDay gathered is a fallout of the last week’s Council of State meeting, which deliberated on the insecurity ravaging the country.\nThis is as the Federal government is said to have intensified, behind the scenes moves to rescue the about 68 passengers abducted inside the Abuja-Kaduna train.\nIt was reliably gathered that the meeting is expected to review the progress on the rescue plansRecall that Jigawa Governor, Abubakar Badaru had hinted that the President will meet with the security Chiefs, but could not provide further details.\nThe crash which is the fifth to have taken place within one year had taken place in Kaduna, whose airport was recently invaded by bandits, shortly after the attacks on a train that was heading to Kaduna from Abuja."
  },
  {
    "headline": "Mid-sized firms tap commercial papers for over N140bn",
    "summarized_story": "Others are Babban Gona Farmers Services Nigeria Limited (N15 billion); Coleman Technical Industries Limited (N20 billion); NECIT Nigeria Limited (N20 billion); Skymark Partners Limited (N5 billion); Veritasi Homes & Properties Limited (N10 billion); and Prima Corporation Limited (N30 billion).\nIn January, FMDQ Exchange approved the registration of the Babban Gona Farmers Services Nigeria N15 billion CP Programme on its platform.\n“We expect funds raised under this CP programme to enable us to expand our investment opportunities,” Egie Akpata, the chairman of the company, said.\nEarly this month, the registration of Veritasi Homes & Properties N10billion CP Programme was approved.\nThe Exchange has also welcomed on its platform the quotation of the Prima Corporation Limited N7.02 billion Series 2 CP under its N30 billion CP Programme."
  },
  {
    "headline": "Trading trumps research in Nigerian pharmaceutical firms",
    "summarized_story": "Pharmaceutical companies in Nigeria are more interested in trading than investing in research and development of drugs, therapies, and treatments, a BusinessDay analysis has shown.\nIts parent company in the UK spent £4.8 billion on research and development focused on the immune system, human genetics, and advanced technologies.\nThe result in revenue was growth from $24.3 billion in 2019 to $26.6 billion in 2020 and $37.4 billion in 2020.\nModerna increased its research and development budget from $496 million in 2019 to $1.4 billion in 2020 and approximately $2 billion in 2021.\nIts revenue surged from $60 million in 2019 to $680 million in 2020 and $18.5 billion in 2021."
  },
  {
    "headline": "Dr. Nosa Aigbe Leberty: A Doctor with a Difference – Nigerian Observer",
    "summarized_story": "Hearing Dr Nosa speak about his passion and dreams for the African man especially his place of birth (Edo State), one will begin to wonder.\nDr Nosa has an evidence based holistic approach and training in urgent care, primary care and specialized addiction Medicine.\nThe goal according to Dr. Nosa is to inspire the people.\nAnd the reason according to Dr. Nosa is because of maintenance to keep the place going.\nAnything that will help make Edo State shine out to the world is what brings joy to the governor and people of the state, Edo state is going to be great again."
  },
  {
    "headline": "Police officer slumps, dies on duty in Bayelsa – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Police Command in Bayelsa has been thrown into mourning, following the sudden death of an Assistant Commissioner of Police, Emmanuel Asufi.\nSources at the police headquarters in Yenagoa said that Asufi, who was in charge of administration, slumped and died at his duty post on Tuesday afternoon.\nSpokesman of the command, SP Asinim Butswat, who confirmed the demise of the senior police officer, said it was a sad day for the command.\n“Oga Asufi was an exemplary officer who did not spare any effort at putting smiles on the faces of all who came across him.\nAsufi, who, until his demise, was a student of Nigerian Law School in Yenagoa, had also served as Chief Security Officer at the Bayelsa Government House and Commander of the State Security Outfit, Operation Door Akpor."
  },
  {
    "headline": "Gunmen invade FCT community, kidnap 4 family members – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestGunmen, suspected to be kidnappers, at the early hours of Wednesday, invaded and kidnapped four family members in Shadadi community in Kuje Area Council, Federal Capital Territory (FCT).\nSome residents of the community told the News Agency of Nigeria (NAN) on Wednesday in Abuja that the incident happened at about 1a.m.\nafter the suspected kidnappers had shot sporadically into the air.\nMrs Joy Adogo, a resident of the community and a neighbour to the abductees, expressed shock over the incident.\nAdogo called for improved security patrol, adding that the recent incident was the third within six months in the community."
  },
  {
    "headline": "Edo moves to tackle neonatal mortality, offers free medical services to over 4000 residents – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Government is launching a new initiative tagged ‘Help Baby Survive’ to tackle high maternal and child mortality in the state.\nThe Commissioner for Health, Prof. Obehi Akoria, disclosed this while briefing journalists after the weekly Edo State Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, in Benin City.\nAkoria said the state is bringing over 65 specialists and healthcare professionals from America to provide free healthcare services to over 4000 persons in the state, in partnership with over 230 local healthcare professionals in Edo.\nAlso, we would have about 3,000 reading glasses or glasses for other purposes distributed for free to Edo citizens as a result of the medical mission.\nWe will also roll out telemedicine services in the state as the services will continue after the end of the medical mission,” the commissioner added."
  },
  {
    "headline": "2023: Group gives Jonathan one week ultimatum to declare for president",
    "summarized_story": "The Nigerian Young Professionals in Diaspora (NYPD), a United States based youth group, has given Goodluck Jonathan, former president of Nigeria, one-week ultimatum to declare interest to contest for president in 2023.\nAkande said under Jonathan, Nigeria was Africa’s number one destination for foreign investments.\n“We recall very fondly how President Jonathan made Nigeria Africa’s number one destination for foreign investment with over US$10.70 billion worth of foreign investments in the first six months of 2014,” he said.\n“President Jonathan has cemented himself as a true diplomat and African statesman through his various interventions in conflicts and election monitoring across the African continent.\nThis experience will be invaluable in bringing peace and political stability in the country when he becomes President,” he said."
  },
  {
    "headline": "Manchester United appoints Ajax coach Erik ten Hag, as new manager",
    "summarized_story": "Premier League top side, Manchester United, has announced the appointment of Erik ten Hag, Ajax coach, as its new manager.\nThe appointment comes in the wake of a number of poor results by the club under its German interim manager, Ralf Rangnick.\n“Manchester United is delighted to announce the appointment of Erik ten Hag as Men’s First Team Manager, subject to work visa requirements, from the end of this season until June 2025, with the option to extend for a further year,” the statement said.\n“We wish Erik the best of luck as he focuses on achieving a successful end to the season at Ajax and look forward to welcoming him to Manchester United this summer.”Erik ten Hag said: “It is a great honour to be appointed manager of Manchester United and I am hugely excited by the challenge ahead.\n“It will be difficult to leave Ajax after these incredible years, and I can assure our fans of my complete commitment and focus on bringing this season to a successful conclusion before I move to Manchester United.”"
  },
  {
    "headline": "JUST IN: CBN office in Benue State gutted by fire",
    "summarized_story": "Fire has gutted the Benue State branch of the Central Bank of Nigeria (CBN), located in Makurdi, the state capital.\nThe fire started around 7am on Thursday while several staff members were yet to resume work.\nIt was gathered that no one was allowed into the building as it was surrounded by policemen who were there to maintain law and order.\nThe Benue state fire service was also on ground to put out the fire.\nThe cause of the incident could not be ascertained as at the time of filing this report and there hasn’t been an official statement in this regard."
  },
  {
    "headline": "OAU vows punishment for randy professor who ‘sexually assaulted’ female student",
    "summarized_story": "Management of the Obafemi Awolowo University (OAU), Ile Ife, Osun State, has vowed to prosecute a professor who was alleged to have sexually assaulted a female student in his office.\nThe assurance came following allegations in some quarters that the management was foot- dragging in sanctioning the erring lecturer.\nPrevious cases of this nature have not evaded the disciplinary hammer of the University administration,” the statement said.\n“Procedurally, after the receipt of the formal complaints, the first step was that the departmental committee sat on the matter and, after a thorough investigation, Professor Opefeyitimi was found prima facie liable.\nThe committee, which also sat and clinically deliberated on this same matter, recommended appropriate disciplinary actions against Professor Ayo Opefeyitimi to the university management."
  },
  {
    "headline": "Troops Kill 25 Terrorists, Rescue 6 Captives In Lake Chad",
    "summarized_story": "Troops of the Multinational Joint Task Force (MNJTF) Nigeria and Niger Republics have neutralised over 25 terrorists and rescued six kidnapped victims during clearance operations into insurgents enclaves in the North-East.\n“Sadly, one soldier paid supreme sacrifice and few others were wounded in action, currently receiving treatment at a military hospital,” he said.\nFurthermore, he said troops of MNJTF Sector 1 (Cameroon) encountered terrorists in the vicinity of Toumbuma, Kerenua, and Chikingudu where they neutralizsd two Boko Haram criminals and maintained dominance in the area.\nADVERTISEMENT“At the end of the earlier battle engagement around Tunbun Fulani and Tunbun Rago, six traumatised female BHTs hostages managed to escape and were found by own troops who then assisted them and brought them to own troop’s location,” he added.\nOthers are: Martha Malu, aged 25 years, kidnapped at Damboa road on December 1, 2020, and Malakalya Dambade, aged 37 years, kidnapped at Mainok along Maiduguri highway on February 25 2021."
  },
  {
    "headline": "2023: Buhari Warns APC Against Imposing Unpopular Candidates",
    "summarized_story": "President Muhammadu Buhari Wednesday in Abuja warned the ruling All Progressives Congress (APC) members to be more mindful of the pitfalls that led to the ouster of the Peoples Democratic Party (PDP) in 2015.\nFurthermore I am pleading with all litigants to withdraw cases against the Party and put faith in party mechanisms.’’President Buhari also advised party leaders against imposing unpopular candidates on the APC.\nI call on all party members to abide by all extant laws, rules, and regulations and to leaders of our party to avoid imposition of candidates that cannot win popular elections.\nPresident Buhari also congratulated the new National Chairman of APC, Sen. Abdullahi Adamu, and the entire NWC members.\nPresident Buhari felicitated with party leaders and members for successfully conducting the Ward, Local Government, State Congresses, and the National Convention, in compliance with the Party Constitution."
  },
  {
    "headline": "Train Attack: el-Rufai Gives Families Of Deceased Passengers N2m Each",
    "summarized_story": "Kaduna State governor, Malam Nasir el-Rufai, has given the sum of N2million each to families of nine deceased passengers of an Abuja-Kaduna Train, which was attacked by terrorists on Monday, March, 28, 2022.\nThe executive secretary (ES) of Kaduna State Emergency Management Agency (KAD-SEMA), Mohammed Muazu Mukkadas, made the disclosure while making the presentations of the cash.\n“When we got the call, we secured ambulances and buses for evacuation, we evacuated the those killed and few severely wounded victims and one who escaped and deposited them at 44 Army Reference Hospital and Saint Gerard Hospital.\nADVERTISEMENT“We (SEMA) immediately set up a crisis centre which availed families of the victims to call for enquires and also provide relevant information about their kids and relatives.\n“And yesterday, Tuesday 19th April, 2022, Governor Nasir el-Rufai compassionately approved the disbursement of funds (N2m each) to next of kin of the 9 deceased persons, and 250,000 each to the 22 severely wounded victims which is a succour meant to ameliorate their sufferings,” he stated."
  },
  {
    "headline": "Train Attack: el-Rufai Gives Families Of Deceased Passengers N2m Each",
    "summarized_story": "Kaduna State governor, Malam Nasir el-Rufai, has given the sum of N2million each to families of nine deceased passengers of an Abuja-Kaduna Train, which was attacked by terrorists on Monday, March, 28, 2022.\nThe executive secretary (ES) of Kaduna State Emergency Management Agency (KAD-SEMA), Mohammed Muazu Mukkadas, made the disclosure while making the presentations of the cash.\n“When we got the call, we secured ambulances and buses for evacuation, we evacuated the those killed and few severely wounded victims and one who escaped and deposited them at 44 Army Reference Hospital and Saint Gerard Hospital.\nADVERTISEMENT“We (SEMA) immediately set up a crisis centre which availed families of the victims to call for enquires and also provide relevant information about their kids and relatives.\n“And yesterday, Tuesday 19th April, 2022, Governor Nasir el-Rufai compassionately approved the disbursement of funds (N2m each) to next of kin of the 9 deceased persons, and 250,000 each to the 22 severely wounded victims which is a succour meant to ameliorate their sufferings,” he stated."
  },
  {
    "headline": "JUST-IN: 43,008 Nigerian Pilgrims To Perform 2022 Hajj",
    "summarized_story": "After two years of no-hajj exercise for the Nigerian Muslims community due to COVID-19 restrictions put in place by the authorities of Saudi Arabia, a meager 43,008 Nigerian pilgrims are expected to perform the 2022 hajj ritual in the Kingdom of Saudi Arabia.\nThe 43008 pilgrims from Nigeria would be among the one million pilgrims approved by the Saudi’s authorities for the 2022 Hajj exercise, including foreigners and residents of the Kingdom.\nThe 43,008 slots allocated to Nigeria for the 2022 Hajj is far below the 95,000 quota granted Nigeria for 2017, 2018 and 2019 Hajj exercises respectively.\nThe 43,008 quota will definitely put NAHCON, State Muslim Pilgrims Welfare Boards and private tour operators under immense pressure to select 43,008 Nigerian pilgrims on the order of merit for the 2022 Hajj.\nTherefore the approved total one million pilgrims for the 2022 Hajj is far less than 50 per cent of the number of pilgrims that performed the 2019 Hajj rites."
  },
  {
    "headline": "Boko Haram Terrorists Attack IGP Alkali-Baba’s Hometown In Yobe, Kill Nine, Raze School",
    "summarized_story": "The Islamic State West Africa Province (ISWAP), formerly known as Jam’at Ahl as-Sunnah lid-Da’wah wa’l-Jihd, an Islamic State-backed Boko Haram group, invaded Geidam community in Yobe state on Wednesday night.\nWitnesses and security officials reported nine locals were slain, and the village’s Government Technical Secondary School was destroyed.\n“They came into the community unawares as there was no gun battle, executed their mission and left,” a resident said.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused the death of tens of thousands of people and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "BREAKING: Buhari meets Service Chiefs, Ministers",
    "summarized_story": "President Muhammadu Buhari is currently presiding over a meeting with some ministers and heads of security establishments at the Presidential Villa, Abuja on Thursday morning.\nThe meeting, which started at 10 am was a sequel to the recommendations by the Council of State over the security challenge in the country.\nAmong the ministers at the meeting were those of Defence, Bashir Magashi; Interior, Rauf Aregbesola, and Foreign Affairs, Geoffrey Onyeama.\nThe Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao are also in attendance, while the Chief of Defence Staff, General Lucky Irabor was represented.\nAlso in attendance were the Inspector-General of Police, Alkali Baba Usman; the Director-General of the Department of State Service (DSS), Yusuf Bichi, and the Director-General of the National Intelligence Agency (NIA), Ahmed Rufai Abubakar."
  },
  {
    "headline": "2023 Presidency: No Consensus S’East Candidate Yet, Says Anyim",
    "summarized_story": "Ex-Senate President Anyim Pius Anyim insists the South East has yet to agree on a consensus candidate for the 2023 presidential election.\nThe former Secretary to the Government of the Federation said although the South East presidential aspirants met recently and pledged to cooperate with one another, they did not take any decision on a consensus candidacy.\nAnyim said: “Aspirants from the South East met.\nThe issue on the table now is not who becomes the candidate of the party (PDP) but where the presidential candidate should come from.\nThe aspirants said the South East has always supported other zones and now expects them to reciprocate the gesture."
  },
  {
    "headline": "Zamfara sends 97 clerics to Lesser Hajj to pray against banditry",
    "summarized_story": "Zamfara State Government sent 97 clerics on Lesser Hajj to Saudi Arabia on Wednesday to go and pray for a stoppage of banditry.\nIt is part of its decision to diversify strategies to restore peace and security in the state.\nAddressing the clerics before their departure, the state’s deputy governor, Sen. Hassan Nasiha, admonished them to consider the state and its people in their prayers.\nDelivering a sermon at the departure, a cleric, Dr Atiku Balarabe, briefed the pilgrims on how best to concentrate on their worship and prayers in Saudi Arabia.\nEarlier in the month, Zamfara distributed more than 200 Cadillac 2019 model to traditional rulers in the state."
  },
  {
    "headline": "SIFAX group trains 101 staff in Q1",
    "summarized_story": "By Kehinde Ibrahim, LagosIN fulfillment of its human capacity programme, a total of 101 staff from various subsidiaries of SIFAX Group have undergone different trainings in the first quarter of 2022.\nThe trainings focused on bespoke needs of the staff, including leadership competence, operations management, terminal traffic management, health, safety and environment, security, digital marketing and corporate governance.\nSelected traffic managers from Ports and Cargo Handling Services (PCHS) were trained on terminal traffic management.\nDockworkers were trained on industrial health, safety and environmental (HSE) management.\nSecurity staff from different subsidiaries also completed a 3-day basic security course that was designed to provide critical understanding of their roles in achieving the company’s objectives."
  },
  {
    "headline": "DG, stakeholders calls on FG to return SON to seaports",
    "summarized_story": "Salim made the call at a stakeholders sensitisation forum organised by the agency in Apapa, Lagos, with the theme “Standards Save Lives, Grow Economy”.\nHe also flayed unpatriotic importers who out of greed importing substandard products into the country to maximise profits.\nFarinto like other stakeholders, called on the Federal Government and managers of the economy to bring SON back to the nation’s seaports, adding that it is the best and surest way to stop substandard goods from coming into the country.\nHowever, the increase in the imports of sub-standard goods and the effort of some freethinker have shown that there is need to reverse this executive decision inorder to win the war against importation of sub-standard goods in Nigeria.\nDealing in fake and substandard products is a crime to humanity and poses great danger for the nation’s economy, as a result of this, we must collaborate with SON to collectively fight this battle against a substandard goods."
  },
  {
    "headline": "NIMASA committed to Maritime varsity development –Jamoh",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE Director General of the Nigerian Maritime Administration and Safety Agency (NIMASA), Dr. Bashir Jamoh, has restated the Agency’s commitment to development of the Nigerian Maritime University,(NMU) Okerenkoko, Delta State.\nHe stated this when a delegation from the University paid a visit to NIMASA Management in Lagos.\nHe said that despite handing over the university to the National University Commission,(NUC) the agency is committed to supporting NMU by completing projects it initiated in the University.\n“Nigeria Maritime University can conveniently bridge the gap in terms of human capacity deficiency in the Nigerian Maritime sector.\nAll you need to do as management is to seek collaboration with similar specialized institutions and ensure that NMU certificates enjoy global recognition."
  },
  {
    "headline": "BVN database rises by 2.3m in three months",
    "summarized_story": "Checks revealed that the BVN database grew by six million in the year.\nAccording to NIBSS, BVN gives bank account owners a unique identity that can be verified across the Nigerian banking industry, while it ensures that customers’ bank accounts are protected from nauthorised access.\nTo have many more Nigerians on the BVN database, CBN had in December 2019 announced the commencement of the classification BVN 2.0 plan that allows both the rich and poor in rural areas to access financial services.\nHowever, some people are currently financially excluded, like people in our rural communities that carry phones but do not have financial services.\nWith the collaboration of NCC, we are putting this BVN arrangement to allow them to conduct minimal financial services."
  },
  {
    "headline": "FG seeks to balance Oil global market with interest of Nigerians",
    "summarized_story": "By Onu OkorieMinister of State for Petroleum Resources, Timipre Sylva, has advised regulatory agencies and other stakeholders in the oil and gas industry to design regulations that would balance the interests of Nigeria and the global market.\nHe said it is by doing so that the country can continue to be relevant on the global stage.\nHe said the enactment of the PIA is expected to open up opportunities in the oil and gas sector of the economy.\nThe eventual assent by Mr. President signalled a new era in the oil and gas sector of the economy after almost two decades of unsuccessful efforts to have the law passed in the country.”He said the enactment of the PIA would usher in new investment opportunities in the Nigerian Petroleum Industry with massive opportunities for every industry player.\nHe said he was hopeful that the regulations when fully implemented will help in no small measure in the smooth take-off of the day-to-day operations of the NUPRC."
  },
  {
    "headline": "Terrorists Attack Yobe Community, Kill Nine",
    "summarized_story": "Exactly one year after suspected Boko Haram insurgents displaced residents of Geidam community in Yobe state, the insurgents onWednesday night launched another attack.\nThe locals further explained the attackers took the residents and the military base at Geidam unaware as there was no gun battle.\nAccording to their accounts, the terrorists silently sneaked into the town, executed their mission and left.\nREAD ALSO: Troops Kill Over 27 Boko Haram/ISWAP Terrorists, Rescue Six Female HostagesAlthough the military on receiving the information responded swiftly the attackers had already fled into bush.\nAs at time of filing-in this report, security authorities were yet to confirm the attack."
  },
  {
    "headline": "Insecurity: State Police Now A Better Option – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has disclosed that amid growing insecurity in the country, the creation of state police would be a better option than community policing.\nAyantoye Adekunle ( State Chairman, Osun State), Hon Tajudeen Oke (State Chairman, Oyo State), Hon.\nAkinwunmi Sowore (State Chairman, Ondo State), Hon Ogidi Akindele (State Chairman, Ekiti State) and Hon Nicholas Akinbiola ( Ondo State).\nAdeniyi Fasanmi ( National Asst Fin Secretary), Hon Isikilu Makinde (Ogun State), Hon Gafar Balogun (Ogun State), Hon.\nTajudeen Salako (State Secretary, Ogun State)."
  },
  {
    "headline": "Insecurity: President Buhari Meets Service Chiefs, Ministers In Abuja",
    "summarized_story": "President Muhammadu Buhari on Thursday met with heads of security establishments and some Ministers at the State House in Abuja.\nThe meeting comes after recommendations by the National Council of State over the security challenges in the country.\nPhysically in attendance were the Vice President Yemi Osinbajo, Secretary to the Government of the Federation, Boss Mustapha, the Chief of Staff to the President, Ibrahim Gambari and the National Security Adviser (NSA), Major Gen. Babagana Monguno.\nThe Chief of Army Staff, Lt General Farouk Yahaya, Chief of Naval Staff, Vice Admiral Awwal Gambo, and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao were also in attendance.\nThe Chief of Defense Staff, General Lucky Irabor was represented."
  },
  {
    "headline": "No Decision Has Been Taken Yet On Zoning, Mode Of Primaries – APC Spokesman",
    "summarized_story": "﻿The National Publicity Secretary of the All Progressives Congress (APC), Felix Morka, has said the party is yet to take a decision on zoning, as well as the mode of primaries it will adopt ahead of the 2023 Presidential Election.\nMorka said this on Channels Television’s Politics Today on Wednesday, hours after reports suggested that the party may have decided on the indirect mode of primaries.\nRead Also: APC May Settle For Indirect Primary, Says BaguduReports of the APC adopting the Indirect mode of primaries surfaced earlier in the day following the party’s 11th National Executive Committee meeting which took place at the Transcorp Hotel in Abuja.\n“There was no explicit discussion about the mode of primary but the timetable seems to suggest it is indirect primaries,” Governor Atiku Bagudu of Kebbi State had said after the meeting.\n“The party came to a decision that the value placed on these forms are justified”."
  },
  {
    "headline": "Three Confirmed Dead As Lassa Fever Outbreak Hits Kogi Community",
    "summarized_story": "The Ibaji Local Government Area of Kogi State has been hit by Lassa fever with three patients reportedly dead.\nAlso no fewer than 20 patients are currently being treated at the Iruah Teaching Hospital in neighbouring Edo State.\nA former Chairman, Ibaji Local Government Council, David Ogwu, and one-time member, Kogi State House of Assembly, said, “It is real that there is an incidence of Lassa fever in Aya and neighbouring communities in Ibaji Local Government of Kogi State.\nAfter that, others who manifested similar symptoms were taken to Iruah Specialist Hospital, in Edo State.\nHe said about nine persons had been diagnosed with the disease in Iruah."
  },
  {
    "headline": "Fmr Slovak PM, Róbert Fico, allies charged with organised crime",
    "summarized_story": "Former three-time Prime Minister Róbert Fico and former Interior Minister Róbert Kaliák, who have dominated Slovakian politics for the past 15 years, were on Wednesday charged with organised crime offenses.\nFico, who is still a member of parliament for the opposition Smer party, cannot be arrested without the legislature’s permission.\nFico was accused of being the leader of a “criminal organization” that includes former police director Tibor Gapár and Slovak oligarch Norbert Bodor, according to the indictment.\nHe stood for president in 2014, while serving his second term as Prime Minister of Slovakia, but was defeated by Kiska by nearly 20 percentage points.\nFico accused Kiska of “making his money from usury on impoverished people,” “misusing his charity for political goals,” and having “close ties to Scientology” during an exceptionally acrimonious campaign."
  },
  {
    "headline": "BREAKING: Lagos GAC okays Sanwo-Olu for second term",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu has secured the consent of the Governance Advisory Council (GAC) to run for a second term in office.\nThe GAC, the apex body within the state ruling political class of All Progressives Congress (APC) approved second term for Sanwo-Olu at its meeting this afternoon at State House, Marina.\nWith the APC governorship election primaries slated for May 27, the speculation on whether Sanwo-Olu will get a second term has become rife among the business and political elites in the state, especially members of the APC."
  },
  {
    "headline": "Akeredolu backs wife's senatorial ambition In Imo",
    "summarized_story": "Ondo state governor, Oluwarotimi Akeredolu has declared support for his wife’s Senatorial ambition.\nThe governor’s declaration was contained in a statement he personally signed.\nOndo First Lady, Betty Anyanwu- Akeredolu has shown interest to run for Imo East Senatorial SeatRecall that the state opposition People’s Democratic Party had on Sunday alleged that the governor was using the state fund to sponsor the wife’s Senatorial ambition in Imo state.\nBut in a subtle response, Akeredolu, in the statement, said he believed in the mission of the First Lady to emancipate women from the shackles of all forms of oppression.\nHe described her as a fiercely independent personality who is never afraid to voice her dissent on any issue."
  },
  {
    "headline": "Why brilliant people like Moghalu may never get chance to rule Nigeria -",
    "summarized_story": "Veteran Journalist and Public Affairs Analyst, Babajide Kolade-Otitoju says he longs for the day the current ruling class will fade out and the rein of leadership will be held by young, bright energetic minds like Kingsley Moghalu.\nHe however shares reasons why his wish may not come to pass."
  },
  {
    "headline": "Betta Edu: APC Expression of Interest Is In The Right Order",
    "summarized_story": "According to the APC National Women Leader, Dr Betta Edu, President Muhammadu Buhari would work in concert with its National Chairman, Senator Abdullahi Adamu, and other organs of the party to come up with acceptable candidates for next year’s general election.\nDr. Edu also stated that the party would not cede its presidential ticket to any aspirant known to be a male chauvinist.\nIn addition, the party fixed the expression of interest and nomination forms for its presidential ticket at N100m.\nWhile female aspirants will get free nomination forms but will have to pay for their expression of interest forms.\nTo discuss the latest developments in the ruling All Progressives Congress – the APC, is the National Women Leader, Dr Betta Edu."
  },
  {
    "headline": "Macron Cements French Presidential Frontrunner Status with Combative Debate Performance",
    "summarized_story": "Still, during the debate Macron failed to dispel an image of haughtiness that has taken root during his presidency.\nHe interrupted his rival repeatedly with lines like “Mrs Le Pen is much more disciplined than five years ago”, and “Stop mixing everything up”.\n“Mr Macron, stop lecturing me,” Le Pen retorted.\n“I am not a climate sceptic, but you’re a bit of a climate hypocrite,” Le Pen quipped.\nAnd Marine Le Pen remains scary for half of them.”Reuters"
  },
  {
    "headline": "Putin Tells Forces Not to Storm Ukraine Holdout in Mariupol",
    "summarized_story": "The findings added to thousands of civilians reported killed by Russian forces, who have been accused of wholesale abuses of Ukrainians.\nOn the battlefield, Ukraine said Moscow continued to mount assaults across the east, probing for weak points in Ukrainian defensive lines.\nDetaching it from the rest of Ukraine would give Putin a badly needed victory two months into the war, after the botched attempt to storm the capital, Kyiv.\nEarlier this week, Ukraine said the Russians dropped heavy bombs to flatten what was left of the Azovstal steel plant .\nIt will “make those who, in the heat of frantic, aggressive rhetoric, try to threaten our country think twice,” Putin said."
  },
  {
    "headline": "Over 15m Passengers Passed Through Nigeria’s Airports in 2021",
    "summarized_story": "The National Bureau of Statistics (NBS) has stated that a total of 15,225,627 travellers passed through Nigeria’s airports in 2021.\nThe details showed that the total number of international passengers who passed through Nigerian airports was 2,219,146, as against 1,408,026 passengers in 2020.\nSimilarly, the total number of international passengers who passed through Nigerian airports were 2,219,146 in 2021 as against 1,408,026 passengers in 2020.\nA total of 4,758,843 passengers passed through the domestic terminal of the Nnamdi Azikiwe International Airport, Abuja, while 4,093,712 passengers passed through the domestic terminals of the Murtala Muhammed Airport, Lagos.\nThe domestic terminals of Port Harcourt International Airport had 900,728 passengers, Mallam Aminu Kano International Airport (545,749) and Akanu Ibiam International Airport (508,513)."
  },
  {
    "headline": "Ex-NNPC GM Says Nigeria Could Have Saved $20bn by Deploying Technology to Tackle Oil Theft",
    "summarized_story": "Making his views known in a treatise, the ex-NNPC top shot estimated that Nigeria would have saved as much as $20 billion if it had deployed technology when the problem started years ago.\nHe expressed surprise that Nigeria has just woken up from what he described as its heavy inertia to know that the country is losing substantial volume of crude oil to oil theft and bunkering, insisting that the activities of the criminals are as old as the oil industry.\nObaigbena noted that Nigeria cannot claim ignorance of the astronomical volume of oil theft for the past 50 years, maintaining that it deliberately “let loose the baby tiger into the wild” which has now matured to a monstrous size and sophistication to evade being caught or detected.\nIf that technology was deployed at that material time, the country would have saved more than $20 billion or more to date.\n“This 1995 technology has advanced to modern and faster technology with many adds ons (e.g."
  }
]