[
  {
    "headline": "You’re being watched, EFCC warns internet fraudsters, shady leaders",
    "summarized_story": "The Economic and Financial Crimes Commission has issued a stern warning to Internet fraudsters, popularly known as Yahoo boys, and “shady leaders,” telling the mentioned parties that they are being monitored and will face due punishment.\n“This na for the shady leaders wey dey carry our money go Overseas.\nThis na for the Yahoo Yahoo boys wey dey spoil our Country name Overseas.\nThe PUNCH reported on July 18 that the Kano Zonal Office of the Economic and Financial Crimes Commission arrested 20 suspected internet fraudsters in Dutsinma Local Government Area of Katsina State.\nOn July 5, The PUNCH likewise reported the arrested of six suspected internet fraudsters in Enugu by the Enugu zonal officials of EFCC."
  },
  {
    "headline": "Pastors’ sack: No room for laziness, Fatoyinbo backs Oyedepo",
    "summarized_story": "The Senior Pastor of the Commonwealth of Zion Assembly, Biodun Fatoyinbo, has backed Bishop David Oyedepo of the Living Faith Church International aka Winners’ Chapel on the sack of pastors from the church.\nThe news of the sacking of pastors from the Winners Chapel broke the internet earlier this week when one Pastor Godwin, claimed that he and 40 other pastors were sacked for failing to generate enough income.\nAddressing the issue while speaking to his congregation, Oyedepo described the sacked pastors as ‘unfruitful, blatant failure’.\nUnfruitful!\nWe have no patience with failure here.”Backing the Bishop, Fatoyinbo took to his Instagram to back Oyedepo’s stance, stating that there is no room for laziness and fruitfulness."
  },
  {
    "headline": "Cry of hunger as food shortage hits Nasarawa IDPs camps",
    "summarized_story": "Many down with severe illness without medical attentionWe’re unaware of situation in camp – Nasarawa officialBy David OdamaTHESE are indeed tough times for internally-displaced persons in Nasarawa State following reports of several severe challenges confronting them.\nArewa Voice was able to confirm this during a visit to one of the camps in Keana Local Government Area of the state.\nIt was indeed quite evident that food shortage and absence of basic medical facilities represent the major problems confronting the internally displaced persons.\nNarrating their ordeals, John Tavershima, who acts as the ‘Secretary’ for the IDPs, told Arewa Voice that the IDPs were facing hard times due to shortage of food, relief materials and medical facilities.\nIn a swift reaction, the Executive Secretary of Nasarawa State Emergency Management Agency, Zakari Allumaga said the state government was not aware of the challenges in the IDPs and Thomas’ situation."
  },
  {
    "headline": "200-year-old Taraba Culture resurfaces; steals show at Sallah",
    "summarized_story": "The 200-year-old festival, which is a source of pride to the Jibu Chiefdom, is indigenous to Bali Local Government Area of the state, which plays host to various tribes within and outside the state.\nBut because of its allure and panache, attendance was not limited to the Jibu people, but admirers of the Jibu Culture from the Tiv, Wurbo, Mumuye, Fulani, and Yoruba, among other tribes, were actively present.\n“We are a peaceful people and the significance of this event is to further cement our relationship with other tribes.\nWe are also grateful to Governor Darius Ishaku who has been a custodian of peaceful coexistence across the state.\n“It is evident that the atmosphere of peace is what we are enjoying in Bali LGA and we want this to continue,” the royal father saidVanguard News Nigeria"
  },
  {
    "headline": "Drug abuse spike: Groups take ‘Say No’ to drug campaign to Plateau school children",
    "summarized_story": "By Marie-Therese NanlongAS the problem of drug abuse escalates across the country, a group, Young African Leaders Initiative, YALI, has taken a campaign to dissuade children from consuming illicit drugs to schools in Jos, the Plateau State capital.\nIt will be recalled that illicit drug consumption has fuelled a series of criminalities in Plateau communities, while some members of cult groups such as the dreaded ‘Sara Suka gang’ are often caught with illicit drugs.\nSuch cultists have also recruited children as young as eight years as members and exposed them into drug consumption not minding the dire consequences.\nShe further taught the students the many forms of drug abuse and how it affects the body physically and psychologically and advised them to abstain from it.\nOther speakers, including Manasseh Dati, a lecturer with Plateau State University, counselled the students on career choice and how addiction to drug abuse could affect their dreams in life."
  },
  {
    "headline": "Succour as Ortom’s wife gives wheelchairs to 120 physically-challenged persons",
    "summarized_story": "Eunice OrtomBy Peter DuruAfter many years of suffering, succour has finally come the way of no fewer than 120 physically-challenged men and women with the donation of wheelchairs by the wife of the Governor of Benue State, Dr. Eunice Ortom and a Jos-based non-governmental organisaton, Beautiful Gate Handicapped People’s Centre.\nMrs. Ortom procured the items of succour for the handicapped persons through her pet project- Eunice Spring of Life Foundation in partnership with the Beautiful Gate Handicapped People’s Centre.\nIt was one of series of interventions by the ESLF that have changed lives and given hope to the hopeless as well as provided relief for the needy.\nMaking the presentation at the Chapel of Grace, Benue State Government House, Dr. Ortom disclosed that the wheelchairs were donated by Beautiful Gate Handicapped People’s Centre, Jos, one of the Foundation’s partners.\nThe Otukpo Chairman also pledged his sustained support towards the realisation of the mission, vision and set objectives of the Foundation."
  },
  {
    "headline": "Lekki Gardens begins work at Osborne Foreshore Estate despite court order",
    "summarized_story": "By Innocent AnabaThe Lekki Gardens Estate Ltd and Foreshore Waters Ltd have defies court order which restrain them from constructing, developing, building or any similar activity in Osborne Foreshore Estate II, Ikoyi, Lagos.\nIn the said letter with Lekki Gardens inscription at the heading, one project manager, Eng Kayode Dawodu had instructed all contractors to immediately resume work.\nThe letter reads:Dear Sirs,IMMEDIATE RESUMPTION OF WORKS AT OSBORNE FORESHORE ESTATE 2Above Subject Matter refers.\nJustice Nicholas Oweibo made the order following an application by the Registered Trustees of Osborne and Foreshore Residents Association through their counsel, Mr Kemi Pinheiro SAN.\nOthers are Signature One on Royal Palm Drive, Signature Two, Le Chateau, Insignia and Foreshore Towers on Acacia Road within the Estate or any other property currently being developed by the Respondents all within Osborne Foreshore Estate II."
  },
  {
    "headline": "Nnamdi Kanu: IPOB closes bank account",
    "summarized_story": "The Nnamdi Kanu-led Indigenous People of Biafra, IPOB, has announced the closure of its bank account domiciled in the United States of America.\nThe account was closed over suspected fraudulent activities by “some unknown persons”.\nEdoziem said the group decided to shut down the account after it received a report from the bank that some “yet to be identified persons” accused it of fraudulently operating the account.\n“That the leader of the Indigenous People of Biafra worldwide, Nnamdi Kanu, authorised the opening of the IPOB USA, families were instructed to pay in their monthly contributions,” the statement reads.\n“That this same USA national account was also designated by our leader as the account for ESN (Eastern Security Network) worldwide contributions."
  },
  {
    "headline": "Biodun Fatoyinbo backs Oyedepo on sacking pastors",
    "summarized_story": "Biodun Fatoyinbo, Senior Pastor, Commonwealth of Zion Assembly, COZA, has supported Bishop David Oyedepo’s decision to sack some pastors of the church.\nOyedepo maintained that the pastors were sacked because they were unfruitful.\nHe described as nonsense, an allegation that he sacked some pastors for not generating enough income in their branches.\nReacting on Instagram, Fatoyinbo said there is no room for laziness and unfruitfulness in the house of God.\n“The only thing Christ punished for being fruitless was a tree” – Daddy Freeze to Pastor Oyedepo"
  },
  {
    "headline": "Biafra: Betrayal runs in Edwin Clark’s DNA, he sabotaged Jonathan – IPOB",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Friday, lambasted an elder statesman, Edwin Clark, for saying Niger Delta was not part of Biafra.\nIPOB said betrayal runs in Clark’s DNA because he allegedly worked against Igbos during the Biafran war in 1967 and worked against former President Goodluck Jonathan.\nWe are disappointed by such a statement coming from a supposed elder statesman like Edwin Clark.\n“The likes of Edwin Clark are the reason Biafra is being treated as slaves in their own domain today.\nA man at the age of Edwin Clark is supposed not to be economical with the truth or deceive the young generation because of parochial interest."
  },
  {
    "headline": "Sunday Igboho: Full list of Yoruba leaders assembled by Ooni of Ife",
    "summarized_story": "The Ooni of Ife, Oba Enitan Ogunwusi, on Thursday formed a committee to look into the Sunday Igboho situation.\nThey will monitor Igboho’s arraignment in Benin Republic, the moves to extradite him to Nigeria and likely prosecution.\nThe team is expected to provide updates to the Ooni as events unfold, offer counsels, mediate with the Yoruba Nation agitator’s legal team and interface with Nigerian and Beninese authorities.\nProfessor Akin OsuntokunSunday Igboho will return to the Cour De’appal De Cotonou in Benin Republic on Monday.\nHe risks 21 years imprisonment over the “doctored” Beninese passport he tendered to Immigration officials while trying to flee via the country to Germany."
  },
  {
    "headline": "No bombing, killing during Sallah, insecurity ending soon – Presidency",
    "summarized_story": "The Presidency has claimed that there was no killing and bombing by terrorists or bandits during the just concluded 2021 Eid-el-Kabir celebration.\nSpecial Adviser to President Muhammadu Buhari on Media and Publicity, Femi Adesina made the claim in a statement titled “MAY GOD BLESS OUR TROOPS”.\nAccording to the statement, Adesina expressed optimism that the current security challenges ravaging the entire country would soon be a thing of the past.\nDid you hear of any bombing and killing that used to attend festive periods this Sallah?\nAdesina urged Nigerians to pray for the military who are in battle against bandits, terrorists and other criminal elements across the country."
  },
  {
    "headline": "Centre for Control of Small Arms, not recruiting, NSA cautions Nigerians",
    "summarized_story": "By Okodili Ndidi, AbujaThe Office of the National Security Adviser (NSA), has cautioned against activities of fraudsters who are impersonating the National Centre for the Control of Small Arms and Light Weapons (NCCSALW), with the intent of defrauding unsuspecting members of the public.\nIt also warned the criminal elements have floated fake websites and are also involved in illegal recruitment and fraudulent inducement.\nThe Centre headed by Major General AM Dikko (rtd) is directly under the Office of the NSA.\nADVERTISEMENT“The National Centre for the Control of Small Arms and Light Weapons is currently not recruiting and has not engaged the services of any individual or recruitment agents to recruit on its behalf.\nFor the avoidance of doubt, the information on recruitment circulating on social media is fake and did not emanate from the Centre."
  },
  {
    "headline": "Navy releases seized vessel in Delta",
    "summarized_story": "By Elo Edremoda, WarriThe Nigerian Navy Ship (NNS) has released a seized vessel, MV Platform Care I, to its owner at the Naval Base in Warri, Delta state.\nADVERTISEMENTThe vessel was seized in February 2020 for not having regular documents of the Nigerian Maritime Administration and Safety Agency (NIMASA) and the Department of Petroleum Resources (DPR).\nCommander Levi Deyin, executive officer of NNS Delta, signed the release on behalf of the Chief of Naval Staff, Vice Admiral Awwal Gambo as well as the Commander NNS Delta, Commodore Abdulhamid Baba-Inna.\nRead Also: Police arrest 64 in Delta brothel raidsHe emphasised the need for operators to acquire relevant documents during operations.\n“You are warned to always obtain necessary documents for your activities,” Commander Deyin stated."
  },
  {
    "headline": "VIDEO: Olympic teams heading towards game village for opening ceremony",
    "summarized_story": "Patricia Technologies Limited is proud to announce that we have moved our operations to the Republic of Estonia, with our..."
  },
  {
    "headline": "VIDEO: Nigeria’s Basketball female team arrives Olympic game village",
    "summarized_story": "Patricia Technologies Limited is proud to announce that we have moved our operations to the Republic of Estonia, with our..."
  },
  {
    "headline": "Igboho: Cotouno court shifts extradition trial to Friday",
    "summarized_story": "From Godwin Tsa, AbujaHearing in the extradition trial of detained Yoruba Nation agitator, Sunday Adeyemo, also known as Igboho has been shifted to Friday by Court D’Appeal in Cotouno, Republic of Benin.\nThe development came as the Federal Ministry of Justice on Thursday said it has no information about the planned arraignment and trial.\nIt was reported that Igboho, who was arrested alongside his German wife, Ropo, where taken to court for a scheduled extradition trial.\nIgboho was arrested in Cotonou with his German wife, Ropo, while trying to travel out of the country.\nHowever, according to agency report, the Igboho’s who were taken to court earlier today, were however returned to to cell in Benin Republic, after court proceedings were adjourned to Friday, July 23."
  },
  {
    "headline": "Igboho: Move to fasttrack his extradition suffers set back?",
    "summarized_story": "From Oluseye Ojo, IbadanThe efforts by the Federal Government of Nigeria to fast track the extradition of Yoruba nation activist, Chief Sunday Adeyemo, fondly called Sunday Igboho, may have suffered a setback.\nThis came as indications have emerged that the government of Benin Republic has resolved to in the first instance try Igboho in court allegedly obtaining a fake Beninoise international passport in Cotonou.\nReports from Benin Republic said Igboho and his wife, who were arrested on Monday night on their way to Germany at Cadjèhoun Airport, Cotonou, were taken to court on Thursday.\nSources said the the Beninoise government said it would not handle a request for Igboho’s extradition, until he has been tried for the local offense he was arrested for on the Beninoise international passport.\nA Beninoise lawyer, identified as Rafael Huvehnou, was said to have been hired to defend Igboho in the court."
  },
  {
    "headline": "BREAKING: First batch of Super Tucano aircraft arrives",
    "summarized_story": "The first batch of A-29 Super Tucano aircraft has arrived in Kano, sunnewsonline.com can report authoritatively.\nThe aircraft arrived Nigerian Air Force base in Kano on Thursday July 22, 2021 at about 12.34 pm.\nAir Commodore Edward Gabkwet, NAF Director of Public Relations and Information confirmed the arrival of the fighter aircraft in a statement.\nMinister of Defence, Major General Bashir Magashi (Rtd), Chief of Army Staff, Lieutenant General Faruk Yahaya and Chief of Air Staff, Air Marshal Oladayo Amao”, he said.\nDetails shortly…Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Igboho arrives court in Cotonou",
    "summarized_story": ""
  },
  {
    "headline": "9 die, 16 injured on Lagos-Ibadan expressway accident",
    "summarized_story": "Federal Road Safety Corps (FRSC) in Ogun State has confirmed the death of nine people in an accident involving two vehicles on the Lagos-Ibadan expressway, yesterday.\nFRSC Sector Commander in the state, Ahmed Umar, said 16 other persons sustained varying degrees of injuries.\nThe sector commander further said the accident involved 25 persons, with nine killed and 16 injured.\nUmar said the cause of the accident could be traced to speed violation and overloading on the part of the commercial bus driver.\nHe said the commercial bus lost control due to excessive speeding and rammed into the truck."
  },
  {
    "headline": "Nigerian Senator Captured Kneeling Before Ex-convict, Ibori",
    "summarized_story": "The Senator representing Delta South Senatorial District in the Red Chamber of the National Assembly, Senator James Manager, has been captured in a picture on his knees before a former Delta State Governor, Chief Onanefe James Ibori, most likely in his Oghara residence.\nThe 61-year-old senator who has been representing his constituency since 2003, in the picture, appeared to be begging Ibori, who is an ex-convict.\nSaharaReporters gathered that Senator Manager is one of the candidates that Ijaw people are planning to push to be the state governor in 2023.\nAmori disclosed that he had been in politics for long, saying he was the General Overseer of the James Ibori political family.\nHowever, weeks after Amori's comment, Senator Manager was seen on his knees at Ibori's house."
  },
  {
    "headline": "Nigerian Senator Captured Kneeling Before Ex-convict, Ibori",
    "summarized_story": "The Senator representing Delta South Senatorial District in the Red Chamber of the National Assembly, Senator James Manager, has been captured in a picture on his knees before a former Delta State Governor, Chief Onanefe James Ibori, most likely in his Oghara residence.\nThe 61-year-old senator who has been representing his constituency since 2003, in the picture, appeared to be begging Ibori, who is an ex-convict.\nSaharaReporters gathered that Senator Manager is one of the candidates that Ijaw people are planning to push to be the state governor in 2023.\nAmori disclosed that he had been in politics for long, saying he was the General Overseer of the James Ibori political family.\nHowever, weeks after Amori's comment, Senator Manager was seen on his knees at Ibori's house."
  },
  {
    "headline": "EXCLUSIVE: Why Sunday Igboho Was Returned To Police Custody After Six-Hour Trial",
    "summarized_story": "Sunday Igboho“That was why he was returned to the police custody and not remanded in the prison.\n“So, he was returned to the police custody so that the extradition hearing could continue on Friday (today) or possibly Monday.\nIf he were a criminal suspect in Benin Republic, he would have been remanded in prison,” the official said.\nSee Also Breaking News BREAKING: Beninese Court Releases Sunday Igboho’s Wife, Orders Igboho To Remain In CustodySaharaReporters had learnt from court officials that the court ruled that Igboho should be returned to custody.\nSaharaReporters had reported that Sunday Igboho was awaiting his fate at the Cour D'appel De Cotonou, Benin Republic, following his arraignment by the authorities of the country."
  },
  {
    "headline": "EXCLUSIVE: Why Sunday Igboho Was Returned To Police Custody After Six-Hour Trial",
    "summarized_story": "Sunday Igboho“That was why he was returned to the police custody and not remanded in the prison.\n“So, he was returned to the police custody so that the extradition hearing could continue on Friday (today) or possibly Monday.\nIf he were a criminal suspect in Benin Republic, he would have been remanded in prison,” the official said.\nSee Also Breaking News BREAKING: Beninese Court Releases Sunday Igboho’s Wife, Orders Igboho To Remain In CustodySaharaReporters had learnt from court officials that the court ruled that Igboho should be returned to custody.\nSaharaReporters had reported that Sunday Igboho was awaiting his fate at the Cour D'appel De Cotonou, Benin Republic, following his arraignment by the authorities of the country."
  },
  {
    "headline": "Buhari Can't Command Crowds Of Supporters Like Igboho Even By Paying Them—Afenifere Leader",
    "summarized_story": "He also said President Muhammadu Buhari cannot command the kind of crowd Igboho commands even though the Nigerian leader hires crowds of people to make him seem popular.\nHe described Igboho as a “political prisoner”, and said the Nigerian government has “no right” to seek his extradition.\nThe 93-year-old Afenifere leader said Nigerian authorities are only terrified of Igboho’s popularity, saying “the-power-that-be wants to kill him because he’s leading a popular revolt”.\n“When they see the crowd that Igboho is pulling at every meeting, that is what is terrifying them.\nBut I tell you, Buhari may depend on chariots and everything, but we have God."
  },
  {
    "headline": "Dispute between Oba Ewuare II, Obaseki 'may delay' return of looted Benin artefacts",
    "summarized_story": "A dispute between Godwin Obaseki, governor of Edo state, and Ewuare II, Oba of Benin, could jeopardise the return of the stolen Benin artefacts to Nigeria.\nBut Ewuare II and Obaseki have been at loggerheads over who will house the artefacts.\nObaseki had said “a transformational museum is to be built in Benin City, to house the artefacts upon their return, as part of a new cultural district in the city”.\nAdvertisementThe dispute between the leaders may, however, jeopardise the return of the artefacts.\nBut the federal government has said it will take possession of the repatriated Benin artefacts and will take into “cognizance the culture that produced the art works”."
  },
  {
    "headline": "Dispute between Oba Ewuare II, Obaseki 'may delay' return of looted Benin artefacts",
    "summarized_story": "A dispute between Godwin Obaseki, governor of Edo state, and Ewuare II, Oba of Benin, could jeopardise the return of the stolen Benin artefacts to Nigeria.\nBut Ewuare II and Obaseki have been at loggerheads over who will house the artefacts.\nObaseki had said “a transformational museum is to be built in Benin City, to house the artefacts upon their return, as part of a new cultural district in the city”.\nAdvertisementThe dispute between the leaders may, however, jeopardise the return of the artefacts.\nBut the federal government has said it will take possession of the repatriated Benin artefacts and will take into “cognizance the culture that produced the art works”."
  },
  {
    "headline": "UK freezes assets of Alex Saab, Venezuelan envoy, over 'serious corruption'",
    "summarized_story": "The Venezuelan envoy is currently detained in Cape Verde and facing extradition to the United States for corruption charges.\nAdvertisementAccording to Dominic Raab, UK foreign secretary, the individuals were sanctioned under the UK’s global anti-corruption sanctions regime.\nRaab said the sanctions target cases of serious corruption which have deprived developing countries of vital resources and individuals who have lined their own pockets at the expense of their citizens.\n“The new sanctions announced today target five individuals involved in serious corruption in Equatorial Guinea, Zimbabwe, Venezuela and Iraq.\n“These measures follow the first tranche of UK sanctions under the Global Anti-Corruption sanctions regime in April, which targeted 22 individuals involved in serious corruption cases in Russia, South Africa, South Sudan and Latin America,” he said."
  },
  {
    "headline": "UK freezes assets of Alex Saab, Venezuelan envoy, over 'serious corruption'",
    "summarized_story": "The Venezuelan envoy is currently detained in Cape Verde and facing extradition to the United States for corruption charges.\nAdvertisementAccording to Dominic Raab, UK foreign secretary, the individuals were sanctioned under the UK’s global anti-corruption sanctions regime.\nRaab said the sanctions target cases of serious corruption which have deprived developing countries of vital resources and individuals who have lined their own pockets at the expense of their citizens.\n“The new sanctions announced today target five individuals involved in serious corruption in Equatorial Guinea, Zimbabwe, Venezuela and Iraq.\n“These measures follow the first tranche of UK sanctions under the Global Anti-Corruption sanctions regime in April, which targeted 22 individuals involved in serious corruption cases in Russia, South Africa, South Sudan and Latin America,” he said."
  },
  {
    "headline": "Judge orders DSS to produce detained Igboho supporters in court",
    "summarized_story": "A federal high court in Abuja has ordered the Department of State Services (DSS) to produce supporters of Sunday Igboho who were arrested in Oyo state.\nPeter Afunanya, DSS spokesman, said the security agency recovered illegal arms — including seven AK-47 rifles — and thousands of ammunition from Igboho’s house.\nThe agency also paraded 12 supporters of the activist, who allegedly attacked DSS operatives during the raid.\nAdvertisementThe supporters were subsequently moved to the federal capital territory (FCT) where they have been in detention.\nConsequently, the judge granted all the orders sought and asked the DSS to produce the applicants in court on July 29."
  },
  {
    "headline": "CBN regulations holding back mobile money revolution in Nigeria",
    "summarized_story": "In Ghana, it would be an “anomaly” for a supermarket, small store, or business merchant to not use a mobile money service for transactions.\nNew agent and electronic money guidelines were released in 2014, allowing network operators to run mobile money services, with supervision from the banking regulator.\nUptake in mobile money services and financial inclusion have equally increased across the country.\nThe regulatory framework is one of the core reasons why mobile money uptake has been relatively slow in Nigeria.\n“The CBN recognises the importance of Mobile Network Operators in the operations of mobile money services and appreciates the criticality of the infrastructure they provide."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October..."
  },
  {
    "headline": "Twitter’s downvote button, Cellulant’s licence approval, Convergence Partners’ $120m round",
    "summarized_story": "Today, I’m discussing:Twitter’s shiny new downvote buttonConvergence’ Partners’ $120m roundCellulant’s licence approval in TanzaniaTwitter is testing out a downvote buttonPhoto by Claudio Schwarz | @purzlbaum on UnsplashWhat happened?\nTwitter says while the downvote button will be visible, only the reply owner can know the exact number received.\nHowever, according to Twitter, this is not a dislike button and while it bears some resemblance to Reddit’s downvote button, it will not affect the order of replies.\nCellulant’s new approval will allow it connect to banks, online merchants, payment processors, merchants, state governments, and customers to meet their digital payment demands in Tanzania.\nConvergence Partners raises $120 millionSouth African tech investment firm, Convergence Partners, has raised $120 million to drive inclusion in Africa."
  },
  {
    "headline": "Google x Maliyo Games, Instagram and YouTube’s new features, and Clubhouse leaves beta",
    "summarized_story": "Mobile gaming: Per Business Wire, the mobile gaming market was worth $98 billion globally in 2020 and is expected to grow to $272 billion by 2030.\nAccording to Kevuru games, 59.9% of games were played on mobile in 2020, while 28.70% and 16.11% were played on PC and console, respectively.\nOn July 20, 2021, the company announced in a blog post that it was launching Sensitive Content Control.\nAccording to Instagram, sensitive content isn’t content that breaks the rules but could upset some users.\nOn July 20, 2021, YouTube announced it is rolling out a beta version of its new feature, Super Thanks."
  },
  {
    "headline": "Google partners Maliyo Games to train 500 African mobile game developers",
    "summarized_story": "Share this article:As Google’s interest in Africa’s tech talent pool deepens, the tech giant has partnered with Nigerian-founded game development studio, Maliyo Games, to open applications for a mobile game developer training program.\nAccording to the founder, this is one of the qualities that attracted Google to the project, aside from the fact that Maliyo Games has published some Africa-themed games on the Google Play Store.\nIn addition to that, Google will also provide support for app store success, which includes successful publishing of content on Google Play Store.\nMaliyo Games’ fitAs is typical of content from many indigenous companies, Maliyo Games studio ensures that its content reflects the African scene.\nIn his opinion, in the past 9 years of running Maliyo Games, opportunities that exist now are thinning out the effects of these challenges."
  },
  {
    "headline": "Nigeria napping as $173trn energy transition opportunity opens",
    "summarized_story": "The world will need to invest $173 trillion in energy transition systems to achieve net-zero carbon emissions by 2050, opening up new opportunities for the energies of the future, a new study has found.\nBloombergNEF’s (BNEF) New Energy Outlook for 2021, which published the study, relied on long-term scenario analysis on the future of the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Oil gains as markets tighten on robust global demand",
    "summarized_story": "There is yet brighter prospects for Nigeria’s fiscal position as oil closed higher Thursday amid expectations that recovering demand from the U.S. to India and Europe will further tighten global crude markets.\nIn London Brent rose to $73.75 a barrel while futures in New York climbed as much as 1.9% on Thursday after posting the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Lagos Agberos collect more cash than IGR of 35 states",
    "summarized_story": "Lagos Agberos collect more cash than IGR of 35 statesAs many states struggle to generate revenue, Agberos in Lagos state generate N123 billion yearly in Nigeria, more cash than 35 states in Nigeria generate yearly, according to a research by International Centre for Investigative Reporting (ICIR).\nExcluding Lagos which generated N418.9 billion in 2020, this amount is bigger than the Internally Generated Revenue (IGR)…"
  },
  {
    "headline": "Obaseki pledges increased support, partnership with security agencies to combat crime in Edo – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the Edo State Commandant of NSCDC, Mr. Aniekan Udoeyup, who was on a courtesy visit at the Government House, Benin City.\n“I want to assure you that we will continue to work with your command.\nI still have to pay salaries, so it will be very challenging for us to bear the burden of other federal security agencies in totality,” Obaseki added.\nEarlier, Udoeyup commended the governor for his support towards the command, adding that they would continue to provide security for all in the state.\nThe commandant, however, appealed to the governor to support the command with logistics to enable them to combat crimes on the highway."
  },
  {
    "headline": "Shaibu hails Edo Beads as state’s basketball team qualifies for national league after 23 years – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Deputy Governor, Rt.\nPhilip Shaibu, has congratulated the state’s basketball team, the Edo Beads, for the team’s qualification for the National Premier League after 23 years.\nShaibu, who received the team led by its coach, Victor Umoru, at the Government House in Benin City, saluted the Edo Beads for making the state proud.\nThe Deputy Governor further reassured the commitment of the state government towards the development of sports, noting that the state is determined to reclaim its lost glory in sports in the country.\nNarrating the team’s success story, the coach noted that for the past 23 years the basketball team has not been in any of the national leagues."
  },
  {
    "headline": "Eid-El-Kabir: Edo govt hails residents on peaceful celebration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commended residents, especially Muslims, on the peaceful Eid-El-Kabir celebration across the state.\nChief of Staff to Edo State Governor, Hon.\nOsaigbovo Iyoha, said the peaceful celebration of Eid-El-Kabir across the state reaffirms the peaceful disposition of Edo people, noting that Governor Godwin Obaseki-led administration will continue to implement policies that foster religious harmony among members of different religious groups.\nHe noted that Muslims in Edo State constitute major stakeholders for sustainable peace and progress in their different endeavours, adding, “Muslims in Edo State have always upheld the import of the Prophet’s teachings.\nIyoha expressed appreciation to Muslims for supporting the Obaseki-led administration MEGA agenda, adding, “The spirit of the Eid-El-Kabir celebration should guide us to live in peace and accommodate one another in building strong coalitions that will entrench development and progress in our state.”..."
  },
  {
    "headline": "Mischief makers pass off 2015 A’Ibom PDP Pry election video as Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe desperation of detractors of Edo State Governor, Mr. Godwin Obaseki, is manifest, yet again, with the circulation of an old video of a primary election in Akwa Ibom State and mischievously captioning and passing it off as an altercation involving the governor.\nIt must be stated that the intent of the purveyors of the video is patently malicious as it is obvious that the man who is wrongly identified as Governor Obaseki in the said video bears no resemblance with the governor.\nFindings have revealed that the video captured two prominent members of the Peoples Democratic Party (PDP) in a hot exchange at the Godswill Akpabio Stadium during the PDP Primary Election in 2015.\nThis development once again points to the grave consequences of fake news and alternative facts, which mischief makers exploit to cause misinformation and public apathy.\nOsaigbovo IyohaChief of Staff to Edo State Governor..."
  },
  {
    "headline": "Man beats wife to death in Adamawa over N1,000",
    "summarized_story": "ADVERTISEMENTBarely one week after the police in Adamawa apprehended a man for beating his wife to death, a similar incident has re-occurred in the state.\nHammawa Usman, 41, of Jada Ward, Ganye town in Ganye Local Government Area is currently in police net for killing his 36-years-old wife, Rabiyatu Usman, in a dispute involving N1,000.\nSulaiman Nguroje, Police spokesman, confirmed the incident in a statement he issued on Thursday in Yola.\nMr Nguroje said the suspect engaged Rabiyatu in a fight when she demanded the refund of her N1,000.\nOn the16 July, a similar incident occurred when a 40-year-old man from Bodere Village in Fufore Local Government Area was arrested for beating his pregnant wife to death, over a dispute involving N1,000."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Benin court frees Sunday Igboho’s wife, shifts his trial till Monday as Nigeria fails to file charges",
    "summarized_story": "The Cour De’appal De Cotonou, Benin Republic, has adjourned the hearing of the case of Yoruba Nation activist, Sunday Adeyemo, alias Sunday Igboho till Monday, July 26.\nThe umbrella body of the Yoruba self-determination group, Ilana Omo Oodua confirmed this in a statement on Friday.\n“That Nigeria has not been able to come up with charges that could lead the court to order lgboho’s extradition to Nigeria.\nThe court, however, ruled that Igboho be remanded in police custody till the next date of adjournment.\nThis comes as the Department of State Services declared Igboho wanted for allegedly stockpiling arms, an allegation he has denied."
  },
  {
    "headline": "How N10m WINNER WILL EMERGE FROM FIRST BANK SPONSORED THE VOICE NIGERIA 3",
    "summarized_story": "By Bolaji IsraelUN1TY Limited and Livespot360, producers of the global talents reality series, have emphasised that public voting has become very crucial at this stage to keep vocalists fighting for the grand prize on the voice Nigeria 3 series, sponsored by FirstBank, Baba Ijebu and Airtel.\nTo keep their favourite vocalists on the show, viewers have to dial *894*7*talent’s code#.\nThe voting code of your preferred contestant to win the competition is in the embedded Instagram post below:The International talents reality series designed to discover and harness music talents in Nigeria is in its third season in Nigeria.\nScores of vocalists have performed on the highly competitive show but dropped out going through the Auditions, Blinds, Knockouts, Battles and Live Shows stages.\nWith an electrifying mix of pulsating musical performances, music training, glamorous fashion and life enriching entertainment, the The Voice Nigeria 3 continues to glitter to the very grand finaleVoting opens on Saturday at 9:00pm and closes at 11:59pm on Thursdays."
  },
  {
    "headline": "CBN to launch pilot digital currency on October 1",
    "summarized_story": "Nigeria’s apex bank, the Central Bank of Nigeria (CBN) says it will launch the pilot scheme of its digital currency by October 1, 2021.\nThe bank’s information technology director, Rakiya Mohammed who announced this during a webinar on Thursday as it presented its digital currency initiative to stakeholders, the bank had been researching since 2017 to develop and adopt the digital currency.\nAccording to Mohammed, the CBN might conduct a proof of concept before the end of this year.\nDuring the presentation, the CBN stated that about 80 per cent of central banks worldwide were currently entertaining the possibility of issuing “central bank digital currency” (CBDC), and Nigeria could not be left behind.\nThe financial regulatory institution maintained that the digital currency’s launch would include and allow macro-management and growth and cross-border trade facilitation."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Arms Control Centre Not Recruiting, ONSA Warns",
    "summarized_story": "The Office of the National Security Adviser (ONSA) has warned applicants against fraudulent inducement for illegal recruitment into the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nUsman, said the newly established NCCSALW is not recruiting and has not engaged the services of any recruitment agent for same purpose.\nHe said the purported recruitment websites linked to the Centre are fake and urged job seekers to disregard them.\nADVERTISEMENT“The National Centre for the Control of Small Arms and Light Weapons is currently not recruiting and has not engaged the services of any individual or recruitment agents to recruit on its behalf.\n“For the avoidance of doubt, the information on recruitment circulating on social media is fake and did not emanate from the Centre."
  },
  {
    "headline": "Arms Control Centre Not Recruiting, ONSA Warns",
    "summarized_story": "The Office of the National Security Adviser (ONSA) has warned applicants against fraudulent inducement for illegal recruitment into the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nUsman, said the newly established NCCSALW is not recruiting and has not engaged the services of any recruitment agent for same purpose.\nHe said the purported recruitment websites linked to the Centre are fake and urged job seekers to disregard them.\nADVERTISEMENT“The National Centre for the Control of Small Arms and Light Weapons is currently not recruiting and has not engaged the services of any individual or recruitment agents to recruit on its behalf.\n“For the avoidance of doubt, the information on recruitment circulating on social media is fake and did not emanate from the Centre."
  },
  {
    "headline": "Kidnappers Of Maritime Workers Demand N90m Ransom",
    "summarized_story": "Abductors of five members of the Maritime Workers Union of Nigeria (MWUN) and four others along the Kula-Abonnema waterways in Rivers State have established contact with their families and are demanding the sum of N90 million as ransom for their release.\nThere is no way they can pay ransom to them.\n“They have been asking for ransom but I told them to release them unconditionally.\nI have tried to talk to their relatives, brothers, sisters and so on.\n“Knowing what the situation is right now, they cannot even raise up to N10,000 for their relatives to be released."
  },
  {
    "headline": "Kidnappers Of Maritime Workers Demand N90m Ransom",
    "summarized_story": "Abductors of five members of the Maritime Workers Union of Nigeria (MWUN) and four others along the Kula-Abonnema waterways in Rivers State have established contact with their families and are demanding the sum of N90 million as ransom for their release.\nThere is no way they can pay ransom to them.\n“They have been asking for ransom but I told them to release them unconditionally.\nI have tried to talk to their relatives, brothers, sisters and so on.\n“Knowing what the situation is right now, they cannot even raise up to N10,000 for their relatives to be released."
  },
  {
    "headline": "We Have No Connection With Killer-Herdsmen, Bandits – Miyetti Allah",
    "summarized_story": "A socio-cultural groups of all Fulani in Nigeria, the Miyetti Allah Kauta Hore, has said that the group has no relationship with killer-herdsmen, bandits and kidnappers.\nMiyetti Allah said it should not be linked to such criminal groups, adding that it does not to complain whenever such people are killed.\nSpeaking to LEADERSHIP last night, national secretary of Miyetti Allah Kauta Hore, Sele Alhassan, said their group does not cry whenever bandits are killed.\n“We don’t have relationship with bandits.\nMiddle Belt of what?"
  },
  {
    "headline": "20 million Nigerians to benefit from UNICEF youth initiative",
    "summarized_story": "The United Nations International Children’s Emergency Fund, on Tuesday, disclosed its plan to launch a multi-sector partnership to support 20 million youths in Nigeria between 2021 and 2030.\nThe Country Representative, UNICEF, Peter Hawkins, said this in an interview with our correspondent.\nHe said “Nigeria is the largest African economy and it has one of the largest young populations in the world; with youth unemployment at 37 per cent, representing an extraordinary opportunity for development and growth.\nThey include digital connectivity, also called ‘Naija Connect’, with emphasis on GIGA (connecting every school and learner to the Internet) and digital skills development.\nThe UNICEF representative also spoke on youth engagement and participation, which according to him, give young people their voices."
  },
  {
    "headline": "20 million Nigerians to benefit from UNICEF youth initiative",
    "summarized_story": "The United Nations International Children’s Emergency Fund, on Tuesday, disclosed its plan to launch a multi-sector partnership to support 20 million youths in Nigeria between 2021 and 2030.\nThe Country Representative, UNICEF, Peter Hawkins, said this in an interview with our correspondent.\nHe said “Nigeria is the largest African economy and it has one of the largest young populations in the world; with youth unemployment at 37 per cent, representing an extraordinary opportunity for development and growth.\nThey include digital connectivity, also called ‘Naija Connect’, with emphasis on GIGA (connecting every school and learner to the Internet) and digital skills development.\nThe UNICEF representative also spoke on youth engagement and participation, which according to him, give young people their voices."
  },
  {
    "headline": "Olu of Warri crisis gets messier as Ologbotsere vows coronation exercise will be futile – Daylight",
    "summarized_story": "Olu of Warri crisis gets messier as Ologbotsere vows coronation exercise will be futileOlu of Warri crisis gets messier as Ologbotsere vows coronation exercise will be futileThe Ologbotsere of Warri Kingdom, Chief Ayirimi Emami, has cautioned the Ginuwa I Ruling House and kingmakers of the Warri Kingdom against going ahead with plans to crown Prince Tola Emiko as the 21st Olu of Warri next month.\nAnother judge, Justice Agboje O, adjourned Emami’s suit challenging the succession to the throne of the Olu of Warri to August 3.\nThis was amid heavy security around the premises of the Delta State High Court in Warri.\nSome litigants who appeared improperly dressed were denied access until the matter in Court 4 was adjourned.\nThat is all for now.”A lawyer in the matter, Robinson Ariyo, confirmed that the matter was adjourned for mention on August 3."
  },
  {
    "headline": "Olu of Warri crisis gets messier as Ologbotsere vows coronation exercise will be futile – Daylight",
    "summarized_story": "Olu of Warri crisis gets messier as Ologbotsere vows coronation exercise will be futileOlu of Warri crisis gets messier as Ologbotsere vows coronation exercise will be futileThe Ologbotsere of Warri Kingdom, Chief Ayirimi Emami, has cautioned the Ginuwa I Ruling House and kingmakers of the Warri Kingdom against going ahead with plans to crown Prince Tola Emiko as the 21st Olu of Warri next month.\nAnother judge, Justice Agboje O, adjourned Emami’s suit challenging the succession to the throne of the Olu of Warri to August 3.\nThis was amid heavy security around the premises of the Delta State High Court in Warri.\nSome litigants who appeared improperly dressed were denied access until the matter in Court 4 was adjourned.\nThat is all for now.”A lawyer in the matter, Robinson Ariyo, confirmed that the matter was adjourned for mention on August 3."
  },
  {
    "headline": "Court orders DSS to produce detained Igboho’s aides",
    "summarized_story": "A Federal High Court, Abuja, on Friday, ordered the Department of State Services (DSS) to produce the 12 detained associates of Yoruba nation activist, Sunday Adeyemo, a.k.a Sunday Igboho, before it on July 29.\nThe DSS said it arrested 13 associates of Igboho at a press conference on 1 July in Abuja.\nThe associates were arrested in an assault on Igboho’s residence in the Soka area of Ibadan, the Oyo State capital.\nThe DSS also said it killed two of the activist’s associates during a “gun duel” during which Igboho narrowly escaped.\nIgboho had denied his men shot at the DSS operatives and that, on the contrary, the DSS began shooting from the gate."
  },
  {
    "headline": "Son Heung-min extends contract with Tottenham",
    "summarized_story": "By Muhaimin OlowoporokuTottenham’s forward Son Heung-min has signed a new four-year contract at the club, keeping him in London until 2025.\nThe club announced the contract extension in a statement on the club’s official website on Friday.\n“We are delighted to announce that Heung-Min Son has signed a new four-year contract with the Club, which will run until 2025, the statement read.\nSon while reacting to his contract extension said he is happy in the club and described it as an honour to play for Tottenham over the past years.\n“It was already a big honour to play here for six years, the club have showed me massive, massive respect and obviously I’m very happy to be here."
  },
  {
    "headline": "JUST IN: Igboho’s case adjourned again",
    "summarized_story": "By AbankulaYoruba Nation agitator, Sunday Igboho has had his case at the Cour De’appal De Cotonou adjourned till Monday.\nHearing was adjourned till today on Thursday when he faced a charge of using a forged Beninese passport.\nHe said the adjournment was to enable the Buhari Government bring up whatever evidence it has to justify Igboho’s extradition to Nigeria.\nThe Lawyers handling the case reported after the proceedings that Chief Sunday Adeyemo lgboho cannot be extradited to Nigeria for two principal reasons:1.\nLastly, the case has been adjourned till Monday 26th July to allow the Nigerian Government bring up whatever evidence they may have, and Mr. lgboho has been taken back to the police custody."
  },
  {
    "headline": "Fatoyinbo Defends Oyedepo Over Sacking of 40 Winners’ Pastors For Generating Low Income",
    "summarized_story": "According to Politics Nigeria, in a video that went popular on social media, one Pastor Peter Godwin said that the Oyedepo-led denomination fired him and other pastors for not generating enough money in their various branches.\n“When I got there, I saw other pastors too, over 40 of them, so I joined them.\nI opened the content of the letter to see what was there and I saw that it was a sack letter.\nI learnt some fellows said, “you know, they are not bringing income, that is why they asked them to go,” he said.\n“When we employed 7,000 people at a time, social media was dead."
  },
  {
    "headline": "“I’ve Done My Best,” Buhari Says Amid Rising Insecurity, Poverty",
    "summarized_story": "As he met with some of his party members on Thursday, President Muhammadu Buhari insisted that he had done everything possible to salvage Nigeria’s dire position, despite mounting poverty and insecurity across the country.\nMr Buhari made the claim, according to the president’s media assistant Garba Shehu, when he received certain governors from the All Progressives Congress (APC) at his country home in Daura.\nThings were worse, according to the former military ruler, when he took office as a democratically elected president.\nMr Buhari also said the country’s security situation had improved compared to the instability in the North-East before 2015 when parts of the region were directly under terrorists’ control.\n”Intellectuals and historians should be fair to us so that those who are looking for leadership positions will not exploit the political ignorance or lack of knowledge of the people,’’ Mr Buhari further stated."
  },
  {
    "headline": "JUST IN: Sunday Igboho’s case adjourned again",
    "summarized_story": "Yoruba Nation agitator, Sunday Igboho has had his case at the Cour De’appal De Cotonou adjourned till Monday.\nHearing was adjourned till today on Thursday when he faced a charge of using a forged Beninese passport.\nHe said the adjournment was to enable the Buhari Government bring up whatever evidence it has to justify Igboho’s extradition to Nigeria.\nThe Lawyers handling the case reported after the proceedings that Chief Sunday Adeyemo lgboho cannot be extradited to Nigeria for two principal reasons:1.\nLastly, the case has been adjourned till Monday 26th July to allow the Nigerian Government bring up whatever evidence they may have, and Mr. lgboho has been taken back to the police custody."
  },
  {
    "headline": "BREAKING: Court Orders DSS To Produce Igboho’s Aides",
    "summarized_story": "The appeals of the 12 detained aides of Sunday Adeyemo, popularly known as Sunday Igboho, were granted by the Federal High Court in Abuja on Friday.\nIn his judgement on the ex parte application before the court, Justice Obiora Egwuatu ordered the Department of State Service to produce Sunday Igboho’s jailed aides in court on the next adjourned date.\nThe DSS was also instructed by Justice Egwuatu to show reason why the petitioners should not be granted bail.\nThe case was rescheduled until July 29 to coincide with the court’s summer break.\nRemember that Sunday Adeyemo, nicknamed Sunday Igboho, and his 12 jailed associates filed a lawsuit against the Department of State Services and its Director-General, Yusuf Bichi."
  },
  {
    "headline": "VIDEO: Athletes, officials head to Olympics opening ceremony venue in Tokyo",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Produce detained Sunday Igboho’s aides, Court tells DSS",
    "summarized_story": "In Abuja, the Department of States Services (DSS) has been ordered by the federal high court to produce the detained aides of Yoruba nation agitator, Sunday Igboho, on July 29, the next day of adjournment.\nThe DSS had raided the residence of Igboho in Ibadan on July 1 and arrested 13 of his aides.\nLawyer to the detainees O. Pelumi, on Friday, filed an application that it was against the agitators’ fundamental human rights to be held incommunicado by the DSS without arraigning them in court.\nResponding, Justice Obiora Egwatu, ordered the DSS to produced them in court and show cause why they are being detained and why they should not be granted bail.\nDetails loading…"
  },
  {
    "headline": "PIB: 3% Host Communities’ equity recipe for Niger Delta crisis – Dickson",
    "summarized_story": "The dust raised by the 3% Host Communities Trust Fund approved by both chambers of the National Assembly in the recently passed Petroleum Industry Bill ( PIB) remained unsettled, with Senator Seriake Dickson ( PDP Bayelsa West) raising the fear the proposal may lead to unrest in the Niger Delta region.\nHe specifically declared that the PIB passed with 3% for Host Communities Fund won’t in anyway, help Nigeria and investors in the oil and gas sectors.\nMere reliance on numbers without fairness, equity and justice is inimical to Nation building,” the lawmaker said.\nOn the controversial amendment made by the Senate on Clause 52(3) of the Electoral Act (Amendment) 2021, Dickson said the backlash being received by Senate over the amendment was not unexpected.\n“Fortunately, a window of striking out that amendment is already provided by the House of Representatives which adopted the clause as originally proposed."
  },
  {
    "headline": "Action Alliance urges FG to improve on security, economy, power -NigPilot",
    "summarized_story": "Action Alliance, AA, has urged the federal government to tackle insecurity, improve the economy and power so as to move the country forward.\n“Inflation has done beyond an acceptable level, the current administration should direct efforts towards ensuring a vibrant economy.\nWe urge the current government to find solutions to Nigeria’s power supply challenges,” he said.\nOn the Independent National Electoral Commission INEC, Omo-Aje commended its Chairman, Prof. Mahmood Yakubu for the electoral reforms initiated.\nBy doing so, they give the electorate more reasons to have confidence in the electoral system,” Omo-Aje said."
  },
  {
    "headline": "Action Alliance urges FG to improve on security, economy, power -NigPilot",
    "summarized_story": "Action Alliance, AA, has urged the federal government to tackle insecurity, improve the economy and power so as to move the country forward.\n“Inflation has done beyond an acceptable level, the current administration should direct efforts towards ensuring a vibrant economy.\nWe urge the current government to find solutions to Nigeria’s power supply challenges,” he said.\nOn the Independent National Electoral Commission INEC, Omo-Aje commended its Chairman, Prof. Mahmood Yakubu for the electoral reforms initiated.\nBy doing so, they give the electorate more reasons to have confidence in the electoral system,” Omo-Aje said."
  },
  {
    "headline": "Lawyers lament non-payment of judgment debts by FG -NigPilot",
    "summarized_story": "Attorneys involved in several litigations won against the federal government agencies over the years have cried out for payment of judgment debts incurred by the government.\nIn a statement issued by the Director of Legal Services, Centre for Civic Education , Barrister Agomuo Chimaobi on behalf of the lawyers, said the unpaid judgment debts are affecting them economically having used their personal resources to prosecute some of the cases on behalf of their clients.\nThe debts, according to them, are incurred by the federal government from judicial pronouncements to that effect from the High Courts to Appeal and Supreme Courts.\n“The debts are judgments which emanated from the Federal High court of Nigeria.\nThe Court of Appeal of Nigeria and the Supreme Court of Nigeria“These judgment debts are compiled at the office of the Honourable Attorney General of the Federation and the Minister of Justice."
  },
  {
    "headline": "Lawyers lament non-payment of judgment debts by FG -NigPilot",
    "summarized_story": "Attorneys involved in several litigations won against the federal government agencies over the years have cried out for payment of judgment debts incurred by the government.\nIn a statement issued by the Director of Legal Services, Centre for Civic Education , Barrister Agomuo Chimaobi on behalf of the lawyers, said the unpaid judgment debts are affecting them economically having used their personal resources to prosecute some of the cases on behalf of their clients.\nThe debts, according to them, are incurred by the federal government from judicial pronouncements to that effect from the High Courts to Appeal and Supreme Courts.\n“The debts are judgments which emanated from the Federal High court of Nigeria.\nThe Court of Appeal of Nigeria and the Supreme Court of Nigeria“These judgment debts are compiled at the office of the Honourable Attorney General of the Federation and the Minister of Justice."
  },
  {
    "headline": "2023: Buhari may be plotting self-succession -NigPilot",
    "summarized_story": "… Challenges Presidency to come out cleanOpposition Peoples Democratic Party, PDP , on Tuesday said the assertion by the Buhari Presidency that Nigerians will be waiting for President Muhammadu Buhari “to show the way in 2023” has further heightened public apprehensions of self-succession plot by the cabal in the Presidency.\nReacting to comments by Buhari’s aide, the PDP Spokesman, Kola Ologbondiyan said Nigerians were jolted when President Buhari’s spokesman, Shehu Garba, publicly announced in Daura, Mr. President’s hometown, that President Buhari “constitutes a political obstacle” which those who seek to succeed him, come 2023 “cannot dismantle”.\n“Shehu Garba should be bold enough to announce that President Buhari will be on the ballot for another term in 2023 and watch how Nigerians will respond.\n“The 1999 Constitution (as amended) is clear on the tenure of office of the President and such cannot be extended under any guise or conditions whatsoever.\n“It is imperative for Shehu Garba to note that Nigerians have been subjected to the worst forms of hardship under the Buhari-led All Progressives Congress (APC) administration and will never allow anything that will keep this administration in office a day beyond May 29, 2023.”"
  },
  {
    "headline": "Court Orders DSS To Produce Igboho’s Associates",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has ordered the Department of State Service (DSS) to produce the 12 aides of Sunday Adeyemo, also known as Sunday Igboho, who have been in their custody since the second of July, 2021.\nREAD ALSO: Sunday Igboho Arrested In Benin RepublicThey also claimed that their arrest and subsequent detention were unlawful.\nEarlier, Igbohos aides had sought an order of the court, through their counsel, Pelumi Olajenbasi, compelling the DSS to produce them before the court and to show why they shouldn’t be granted bail in accordance with the provision of section 32 of the criminal justice act 2015.\nTheir counsel told the court that his clients have remained underground for the past 20 days, and were denied freedom.\nHe added that they were Nigerian citizens and have inherent rights, just like others, and the world is watching how the judiciary, would vitalize the consciousness of Nigerians."
  },
  {
    "headline": "Bandits Invade Zamfara Community, Kill 3 Persons, Abduct 7",
    "summarized_story": "Bandits have again attacked the Dansadau community within Maru Local Government Area of Zamfara State, killing 3 persons and abducting 7 others.\nA source in the community told Channels TV that the armed bandits attacked the community around 2:30am and the siege lasted for about 4 hours, ending in the early hours of Friday morning.\nHe also confirmed that armoured personnel carrier belonging to the Nigerian military was also set ablaze by the bandits.\nAs of the time of filing this report, the state police command was yet to confirm the latest attack, though the public relations officer promised to get back to our correspondent with more information.\nDansadau community is about ninety-nine kilometers from Gusau the Zamfara State capital and is one of the hottest zones in terms of banditry, kidnappings, and other related crimes in the state."
  },
  {
    "headline": "Nigeria Confirms 973 COVID Cases In Five Days As China Disputes Origin Probe",
    "summarized_story": "Nigeria confirmed 973 COVID-19 cases in five days, as Chinese authorities rejected a planned relaunch of a probe into the origins of the deadly disease.\nFigures released by the Nigeria Centre for Disease Control (NCDC) showed that the country recorded one of its highest number of cases in months on Wednesday – 238.\nAs of Friday morning, there were 170,306 confirmed coronavirus cases, 164,772 recoveries, and 2,130 deaths in Nigeria.\nBut the vice minister of the National Health Commission (NHC), Zeng Yixin, told reporters that China will not allow such a probe.\nHe maintained that Chinese authorities could not share some data publicly due to privacy issues."
  },
  {
    "headline": "Military Will Resist Violence In Form Of Agitations And Secession, CDS Warns",
    "summarized_story": "General Irabor made the remark when he met with retired senior military officers in the Southeast in Owerri, the Imo State capital on Thursday.\n“The military will resist any attempt by anybody, group or individual wanting to use the instrument of violence against the state, that we will not allow,” the CDS noted but added that the military is not against peaceful agitations.\nHe said the officers, having served the nation, have a crucial role to play in quelling agitations and stamping out crime in Nigeria.\n“What is wrong in canvassing for self-determination so long as such agitation is devoid of violence?” the pan-Yoruba group, Afenifere asked following the raid on Igboho’s house.\n“The constitution the country is running guarantees the right of every Nigerian to express an opinion and even carry out rallies as long as such is done without violence.”"
  },
  {
    "headline": "Super Eagles Captain Musa Quits Kano Pillars For Turkish Club",
    "summarized_story": "Super Eagles captain Ahmed Musa has teamed up with Turkish club side Fatih Karagumruk from Kano Pillars.\nThe Super Lig team confirmed the signing of the 28-year-old on their Instagram handle on Thursday evening.\nDuring his career, he played for clubs such as VVV Venlo, CSKA Moscow and Leicester City,” the club wrote but did not give details about the contractual agreements.\n“He scored 15 goals in 87 matches for the Nigerian National Team.\nWe wish success to Ahmed Musa under the Karagümrük jersey, signed by our Vice President Serkan Hurma and our Sporting Director Murat Akın.”View this post on Instagram A post shared by VavaCars Fatih Karagümrük SK (@karagumruk_sk)"
  },
  {
    "headline": "Anambra election: AA presents certificate of return to Maduka Arisa",
    "summarized_story": "Mr. Omoaje, who was joined by other party national executives, said that the AA is the party to beat in the state’s upcoming governorship election.\nHe said that the AA will bring solutions to all of the state’s problems, and that the people of Anambra State deserved a woman like Maduka-Arisa to ensure good governance and administration.\nThe AA national chairman urged the people of the state to vote widely for the party in the forthcoming election, assuring that the party’s flag bearer will fulfill all the manifesto of the party.\nAdvertisementSpeaking, the party’s flag bearer, Mrs. Maduka-Arisa assured that she would serve the people of the state through an all inclusive government if given the opportunity to rule the state.\nShe expressed her gratitude to the AA leadership for allowing her to represent the party, and she promised not to compromise her and the party’s positions."
  },
  {
    "headline": "Zulum visits Wulgo, Lake Chad shores, offers cash to resettled residents, instructs rehabilitation of schools",
    "summarized_story": "The Governor also interacted with all residents to identify and address their problems.\nZulum inspected educational and health facilities, and gave instructions for the rehabilitation of two primary schools as well as a primary healthcare centre, to address the needs of the community.\nHe later interacted with officers and soldiers of the Multinational Joint Taskforce (MNJTF) Command in Wulgo.\nAdvertisementLt. Col. Njock John, the Cameroonian component officer who is the MNJTF’s operations commander in Wulgo, was on hand to greet the Governor.\nThe Cameroonian component officer, noted that Zulum’s regular support to the command has enhanced their operational capacity in the counter-terrorism war."
  },
  {
    "headline": "Makinde receives the NASS Joint Committee on Aviation, urges FG to uplift Ibadan Airport",
    "summarized_story": "Oyo State Governor, Seyi Makinde has asked the Federal Government to take necessary steps to uplift the standard of the Ibadan Airport.\nHe noted that the Ibadan Airport should readily serve as the alternate airport to Lagos, adding that instead of diverting international flights to Accra, Ghana, Ibadan would rather serve Nigeria better.\nAdvertisementWhile enumerating possible benefits of the Ibadan airport if upgraded, Governor Makinde explained various efforts of his administration aimed at improving the standards of the airport, including the rehabilitation of adjoining roads as well as provision of basic facilities at the airport.\nHe called on the Federal Government to do more by collaborating with the state in its resolve to uplift the airport.\nAccording to him, an upgraded Ibadan airport would not only impact on the state’s economy by expanding its business districts, the country would also benefit as the nation grapples to grow its non-oil economy."
  },
  {
    "headline": "Covid Vaccine: Eight-week Gap Seen as Sweet Spot for Pfizer Jab Antibodies",
    "summarized_story": "A longer gap between first and second doses of the Pfizer-BioNTech Covid vaccine makes the body’s immune system produce more infection-fighting antibodies, UK researchers have found.\nExperts say the findings support the UK’s decision on extending dosing intervals from the initial recommendation of three weeks.\nAn eight-week gap seems to be the sweet spot for tackling the Delta variant.\nThe UK initially extended the dosing gap to 12 weeks at the end of 2020.\nAntibody levels in their blood were measured a month after the second vaccine dose."
  },
  {
    "headline": "In Boost to War on Terrorism, Nigeria Receives Six A-29 Super Tucano Fighter Planes",
    "summarized_story": "The Nigerian Air Force Thursday announced the arrival of A-29 Super Tucano fighter planes from the United States.\n“The first batch of A-29 Super Tucano aircraft have arrived Kano, today, (yesterday) July 22, 2021 at about 12.34pm.\nA delegation of the House of Representatives had some weeks ago visited the United States to ascertain the state of the fighter jets.\nThe first batch of 6 A-29 Super Tucano aircraft departed the United States of America on Wednesday, 14 July 2021 enroute Nigeria.\nIt was further gathered that the path taken by the fighter jets was designed to avoid the Atlantic Ocean route, a distance not usually flown by fighter aircraft."
  },
  {
    "headline": "Kanye West Unveils New Album, Jay-Z Track at Listening Event",
    "summarized_story": "Kanye West barely said a word during his album listening session Thursday night, but the mercurial rapper still had most attendees standing on their feet while hanging on every word of his new project.\nWest unveiled his 10th studio album, “Donda” in front of a packed crowd at the Mercedes-Benz Stadium in Atlanta.\nThe crowd appeared surprise to hear when Jay-Z began rapping on the final song of the listening session.\nLast year, West announced on Twitter — with colorful cover art and a track list — that he would release his latest album.\nIt’s not the first time Kanye has hosted a listening event for an upcoming album."
  },
  {
    "headline": "Olympics Like No Other Officially Underway Friday in Tokyo",
    "summarized_story": "The Tokyo Olympic Games are upon us.\nOn Friday, 19 new cases of Covid-19 were reported, bringing the total of cases related to Games personnel to 106.\nThere have been 11 positive cases among athletes in Tokyo.\nSome 48.8% of athletes competing at the Tokyo Olympics are women – a record figure.\nOnly eight new competition venues have been built from scratch, while much of the energy powering Tokyo 2020 comes from renewable sources."
  },
  {
    "headline": "Raging Pandemic in Indonesia Offers Fertile Ground for New Variants",
    "summarized_story": "Last week Indonesia surpassed India and Brazil to become the country reporting the world’s highest number of daily cases.\n“New variants always appear in regions or countries that cannot control outbreaks,” said Dicky Budiman, an Indonesian epidemiologist researching coronavirus variants at Australia’s Griffith University.\nIn Indonesia, it’s been higher than 10 percent for 16 months at the start of the pandemic.\nGlobally, there are four variants of concern: the so-called Alpha variant, first identified in the UK; the Beta variant, first identified in South Africa, the Delta variant, first identified in India; and the Gamma variant, first identified in Brazil.\nJameel says the situation in Indonesia is now “very similar” to India’s second wave due to “poor rates” of vaccination."
  }
]