[
  {
    "headline": "Return recovered $40.379m to NNPC, order Reps",
    "summarized_story": "The acting Chairman of the committee, Sada Soli, made the call at an investigative hearing in Abuja on Tuesday.\nAccording the committee, the money was recovered from Keystone Bank and deposited into the Federal Government Recovery Account domiciled with Central Bank of Nigeria.\nIn his presentation, AMCON’s Head of Enforcement, Mr. Usman Abubakar, noted that the two promissory notes were wrongfully issued in favour of EFCC and was rejected.\nHe, however, noted that EFCC returned the promissory notes to DMO, which acceded to issue fresh promissory notes in favour of AMCON, in the sums of N328m and N866m.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Northern coalition attacks southern govs, says Lagos resolutions conspiracy",
    "summarized_story": "The Coalition of Northern Groups on Tuesday responded to the issues raised by the Southern Governors Forum during their Monday meeting in Lagos.\nAccording to him, the insistence by the southern governors on the anti-grazing law “aims to selectively imperil the business of cattle rearing and threaten the legitimate presence of pastoral communities in the south.\n“This conspiracy is actively perpetrated with the connivance of some northerners and accommodated by the personal ambition of a few of those that present themselves as northern political leaders.\n“Inevitably, the immediate trigger to the Lagos pronouncements was the collaborative assurances by the former Borno State Governor, Kashim Shettima and the Kaduna State Governor Nasir Elrufai given just two days earlier,” the statement added.\nOn anti-grazing law, the group called on the Federal Government to ensure that herders’ rights to freedom of movement was not impeded by any legislation."
  },
  {
    "headline": "Insecurity: Sule pledges to support NSCDC, other security agencies",
    "summarized_story": "Abdullahi Sule of Nasarawa State has pledged to support the Nigeria Security and Civil Defence Corps (NSCDC) and other security agencies to fight crime and criminality in the state.\nSule made the promise when he hosted the new Commandant of the NSCDC in the state, Mr Abbas Bappa, at the Government House, Lafia on Tuesday.\n“I will continue to employ the services of NSCDC and other security outfits toward fortifying the security of the state,” he said.\nThe governor, while welcoming the new commandant of the NSCDC to the state, urged him to sustain the good works of his predecessor, Mr Mahmood Fari.\nResponding, the governor assured the authorities of the Correctional Services of his administration’s continued support."
  },
  {
    "headline": "Bribery video: Court orders Ganduje to pay N800k to Ja’afar Ja’afar",
    "summarized_story": "Governor Abdullahi Umar Ganduje of Kano State.\nBy Bashir Bello, KanoA Kano State High Court has on Tuesday ordered Kano State Governor Abdullahi Umar Ganduje to pay the sum of N800,000 to the Publisher of Daily Nigerian, Ja’afar Ja’afar as cost for expenses incurred in the court case of the controversial dollar bribery video.\nRecall that the Publisher, Ja’afar Ja’afar had released a video clip allegedly showing the Governor stuffing his pockets with bundles of dollars suspected to be kickbacks of awarded projects from contractors although the state government had since denied the videos.\nThe Presiding Judge, Justice Suleiman Na-mallam in his ruling granted the sum of N400,000 each to Ja’afar Ja’afar and his company, Penlight Media Limited (Daily Nigerian).\nThe defendant counsel also demanded for an apology to be published in national dailies and a pre-action letter."
  },
  {
    "headline": "Police rescue 4 kidnap victims in Osun",
    "summarized_story": "The Police Command in Osun on Tuesday said that it had rescued four commuters reportedly kidnapped on Tafida Imesi-Ile and Ilare/Esa-Odo Roads on Sunday and Monday respectively.\nThe command’s Spokesperson, SP Yemisi Opalola, in a statement in Osogbo said that a combined team of policemen and local security outfits carried out the rescue operation.\nOpalola, however, said one of the local security operatives lost his life during a gun duel with the kidnappers, while another sustained injury from gunshots.\n“The victims were rescued just about 3:05 p.m. today (Tuesday) on Erin-Ijesa, Ibokun road sequel to the pressure mounted on the abductors by the police and other security agencies.\n“No ransom was paid, however, we lost one of the local security operatives."
  },
  {
    "headline": "Ekiti 2022: Fayose won’t leave his PDP house for political rodents — PDP LG Chairmen",
    "summarized_story": "The chairmen emphasized that; “It’s PDP or nothing for Fayose and his political family.\n“For supporting Bisi Kolawole as PDP governorship candidate, he has no apologies.\nThis is more so that opponents of Bisi Kolawole also know that he is the aspirant to beat.\n“Also, for Fayose, PDP remains the bigger picture that must be protected.\n“Most importantly, Fayose that we know has shown resilience in adversity so it is too late to abandon his political house, the PDP for rodents.”"
  },
  {
    "headline": "South-West govs, Senators, Reps insist on 5% for host communities",
    "summarized_story": "At the meeting, the governors and lawmakers resolved that both chambers must approve 5% of the actual annual operating expenditure of the preceding financial year in the upstream petroleum operations affecting the host communities for funding of the Host Communities Trust Fund in the new PIB.\nHowever, a source at the meeting told Vanguard that at the meeting the governors and the lawmakers agreed to throw their weights behind the members of House of Representatives on 5% for host communities.\nAkeredolu said: “South-West governors held a meeting with members of the House of Representatives and Senators from South West.\nThe committee is made of up senators led by the caucus chairman and House of Representatives caucus chairman and attorneys of the south west states.\nThe meeting had the newly passed PIB and the Electoral Act Amendment Bill as the agenda."
  },
  {
    "headline": "Detained Sunday Igboho’s aides denied access to lawyers – Spokesman alleges",
    "summarized_story": "The 11 men and a woman arrested in Sunday Igboho’s Ibadan residence on Thursday are being denied access to their lawyers.\nThe spokesman to Sunday Igboho, Olayomi Koiki, said this in a statement on Tuesday.\nAccording to Koiki, the 12 detainees “have since been held underground under lock and key, and remain incommunicado from their lawyers and families.”Koiki alleged that “all attempts by their legal representatives to meet with them as prisoners of conscience at the DSS Headquarters, Three Arms Zone, Abuja yesterday the 5th of July 2021, and also today the 6th July of 2021, have been rebuffed, refused and thwarted by the Department of State Security on mere whims.”Sunday Igboho’s spokesman claims DSS hid millions of Naira taken from activist’s house (Video)He revealed that an official letter submitted by members of the legal team, requesting for visitation rights with the detainees had been discountenanced by men of the DSS.\nThe spokesman explained that two of the detained individuals are in need of urgent medical attention, particularly the woman among them; stating that “although the DSS are very much aware of her health condition which requires urgent care, they have refused to act on same.”“It goes without gain-saying that we will hold the DSS and its entire hierarchy liable should any harm befall these detainees,” Koiki declared.\nSunday Igboho has pump action gun – Spokesman [VIDEO]"
  },
  {
    "headline": "Cross River Police Command rescue Gov Ayade’s aide from kidnappers",
    "summarized_story": "The Cross River State Commissioner of Police, CP Sikiru Kayode Akande, has said that his men have rescued one of the Gov Shade’ aides.\nSpeaking in Calabar on Tuesday, CP said his men rescued Mr Oscar Ofuka, Special Adviser to Governor Ayade on Cocoa Development, who was abducted Tuesday at the premises of CRBC (Cross River Broadcasting Corporation).\nAkande said, “We have succeeded in rescuing Mr Ofuka a few hours after he was allegedly kidnapped.\nNow is the time to commend us.\nOur men are up and able”."
  },
  {
    "headline": "Edo govt revokes road project, orders contractor’s arrest after viral video",
    "summarized_story": "Edo State Government has stopped the Lawani Crescent Federal Constituency road project in Akoko-Edo Local Government Area.\nA viral video by a citizen exposed the poorly executed construction.\nOn Tuesday, Deputy Governor Philip Shaibu undertook an inspection of the location and announced that the contract stands revoked.\nThe government added that the National Assembly allocated N360million for constituency projects in Akoko-Edo federal constituency in 2021.\nThe Governor Godwin Obaseki administration vowed to investigate “to ensure we have value for money”."
  },
  {
    "headline": "Abducted Bethel Baptist students doing well",
    "summarized_story": "The bandits who abducted the students of Bethel Baptist High School, Kaduna, on Monday, July 5, 2021, have called to inform the school management that the students are all doing well and fine.\nThe President, Kaduna Baptist Conference and proprietor of Bethel Baptist High school, Kaduna, Rev.\nYahaya Adamu Jangado, in a statement said, “Today, by the grace of God, we had a call from the bandits and they assured us that our children are well and doing okay.\nYahaya Jangado explained that the total number of students we recovered in the school on Monday is 28 students that were not abducted.\nBethel abduction: Buhari issues directive to security agenciesAccording to him, “l want to thank God because the parents are understanding."
  },
  {
    "headline": "N22bn Paris Refund: Matter still in court, awaiting EFCC investigation",
    "summarized_story": "The Abia State Government has replied Alex Otti, a renowned economist and a chieftain of the All Progressives Congress (APC), for dragging Governor Okezie Ikpeazu-led administration on the management of the N22bn Paris Club Refund.\n“As already available in the public domain, we received three tranches of Paris Club Refund of N10.6bn N5.7bn and N5.7bn.\nAccording to Mr Oriaku, “the Paris Refund came in three trenches of N10.6bn, N5.7bn and N5.7bn.\nAll these funds except N1.7bn were used exclusively for payments of arrears owed Abia State workers partly before the Ikpeazu administration.\nIt’s therefore not our duty to re-litigate a matter that’s before the courts and the EFCC."
  },
  {
    "headline": "Commission of inquiry to probe NLC strike in Kaduna",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaThe Kaduna State government has established a Judicial Commission of Inquiry into the Nigerian Labour Congress (NLC) strike of May 2021, with Justice Ishaq Bello, a retired Judge as chairman.\nA statement issued by the Special Adviser on Media and Communication to Governor Nasir El-Rufai, Mr Muyiwa Adekeye yesterday mentioned former Attorney-General of Cross River State Eyo Ekpo and Mrs Joan Jatau-Kadiya, ex-Attorney-General of Kaduna State as members.\nAccording to the statement, former Assistant Secretary-General of NLC and Deputy National Secretary of Nigerian Union of Journalists (NUJ) Chom Bagu is also a member of the Commission.\nAdekeye listed other members of the commission to include AVM Rabiu Dabo, Dr Nasirudeen Usman and Malam Mohammed Isah Aliyu.\nThe statement pointed out that “Section Seven of the Commissions of Inquiry Law grants the Judicial Commission of Inquiry the power to summon any person in Nigeria to give evidence and to issue a warrant to compel the attendance of anyone so summoned.”"
  },
  {
    "headline": "Ortom backs Southern governors on anti-open grazing laws",
    "summarized_story": "By Uja Emmanuel, MakurdiBenue State Governor Samuel Ortom has described the decision of Southern Governors’ Forum to enact laws to ban open grazing of livestock in the region as a bold and patriotic move that will bring to an end the lingering crisis caused by armed herdsmen.\nIn a statement signed by his media aide Terver Akase on Tuesday and made available to reporters, the governor also commended his counterparts in Southern Nigeria for backing their May 11 Asaba declaration against open-grazing with the resolve to legally prohibit nomadic cattle rearing; a resolution which conforms with the global best practice of animal husbandry.\nHe commended the Southern Governors’ Forum for their position on the rotation of the Presidency between the North and South, beginning from 2023.\nGovernor Ortom said only equity, fairness and justice can strengthen the unity of Nigeria, give all citizens a sense of belonging and reduce tensions across the country.\nThe Governor re-echoes his call on the Federal Government to respect 1999 Constitution (as amended) regarding fundamental human rights, the rule of law and Federal Character."
  },
  {
    "headline": "UniAbuja seeks funds for perimeter fencing",
    "summarized_story": "The Vice-Chancellor of the university, Prof. Abdul-Rasheed Na’Allah said this on Thursday in Abuja at a briefing to celebrate two years in office.\nHe said the university has been able to raise close to a billion naira for the parameter fencing project.\nThe V-C said: “We are constructing a fence on this campus not only to beautify the university but because of security.\nThe Federal Government has given us money to do this and we want a situation whereby people are free to move.\n“We have spent a lot of money on the security fencing but it is not enough yet because what we need is billions to do the fence but we have gotten close to a billion."
  },
  {
    "headline": "Army organises medical outreach for Damaturu residents",
    "summarized_story": "By Duku Joel, DamaturuHundreds of Damaturu residents on Tuesday trooped out to benefit from the free medical services and outreach organised by Sector 2 of Operation Handin Kai, Nigeria Army, Damaturu, Yobe State.\nADVERTISEMENT“The theme for this year’s Nigerian Army Day Celebration is to have a professional and ready Nigerian Army, a prerequisite for a successful operation.\nThis is not too far from the Chief of Army Staff’s vision which is to have a professional Nigerian Army ready to accomplish the assigned mission within a joint environment in defence of Nigeria.\nHe assured that the Nigerian Army will continue to work hard towards ensuring peaceful co-existence.\nSome of the beneficiaries who spoke with our correspondent were grateful to the Army for the free medical services obtained."
  },
  {
    "headline": "Kaduna: Your children are in safe hands, bandits tell parents",
    "summarized_story": "From Noah Ebije KadunaRev Yahaya Adamu Jangado, the Proprietor of Bethel Baptist High School, Kaduna, where students were abducted on Monday, disclosed on Tuesday that the bandits called to say that the students are in safe hands.\nSpeaking with reporters, the proprietor stated: ‘The bandits called us to say that our children are there with them, they are doing well, they are sound, we spoke with a few of them, that is the information for now.\nWe came to the school and recovered 28 students, some of them hid in many places.\n‘We called the parents to appreciate them for their patience, understanding and calmness and also solicit for their support in this trying moment.\nFor now we do not know what the bandits will say."
  },
  {
    "headline": "Anambra guber: Okonkwo asks supporters to await next line of action",
    "summarized_story": "First runner up at the primary election of the Peoples Democratic Party (PDP) held in Awka, Dr Obiora Okonkwo, has expressed his reservations about the poll.\nHe asked his teaming supporters to wait for the next line of action which would be disclosed to them soonest.\n“Obviously, there were a number of serious issues and irregularities regarding the primary election.\nEven with that, the list of the super delegates kept changing such that voting was unduly delayed after the first round of accreditation where 179 super delegates had been accredited.\n“The second round of accreditation, done after the list had been changed again and many super delegates removed from the initial list, and many new ones added, turned in 218 super delegates."
  },
  {
    "headline": "Passed PIB satanic, unjust, embarrassing -Clark",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaLeader of Pan-Niger Delta Forum (PANDEF), Chief Edwin Clark, has described the newly passed Petroleum Industry Bill (PIB) as satanic, unjust, embarrassing and dashing the hopes of Niger Delta people.\nThe two chambers of the National Assembly last week Thursday passed the PIB which seeks to introduce far-reaching reforms in the oil and gas industry, after about 13 years of legislative fireworks.\nThe bill was first sent to the National Assembly in 2008 by President Umaru Yar’Adua, now deceased, without translating into an Act.\nClark demanded that the bill as passed be reversed else the Niger Delta would take their destinies in their hands and deny International Oil Companies (IOCs) operations into the region.\n“We want to warn seriously, that the people of the Niger Delta have had enough of this colonial and oppressive mentality of our Northern brothers and friends."
  },
  {
    "headline": "Obasanjo denies forming new party ahead 2023",
    "summarized_story": "From Laide Raheem, AbeokutaFormer President Olusegun Obasanjo has denied the report that he was planning to form a new political party ahead of the 2023 general elections.\nThe statement indicated that Obasanjo was in Kabul, Afghanistan when the event attributed to him was reported.\nThe one who reported that may need to visit Yaba Left.\n“If anything, Chief Obasanjo’s political party today is the party of Nigerians facing insecurity, unemployment, hunger, poverty, and various other challenging issues.\nIt is the party of Nigeria that must be saved, kept wholesomely united in peace, security, equity, development and progress."
  },
  {
    "headline": "Ugwuanyi promotes sports development in rural areas",
    "summarized_story": "Ugwuanyi, represented by his Special Adviser on Project Development and Implementation (PDI), Engr.\nGovernor Ugwuanyi commended his Special Adviser on PDI, Engr.\nHe equally thanked the Chairman of Igbo-Eze North LGA, Engr.\nIn his speech, the Chairman of Igbo-Eze North LGA, Engr.\nItodo who reeled out the socio-economic and health benefits of the facility to the people of Igbo-Eze North LGA, stressed that governor’s decision to promote sporting activities in the rural areas is a welcome development."
  },
  {
    "headline": "Gowon, Obasanjo, Shonekan, Jonathan Mourn Emily Aig-Imoukhuede",
    "summarized_story": "Former Head of State, General Yakubu Gowon; former President, Chief Olusegun Obasanjo; former Head of Interim National Government, Chief Ernest Shonekan; and former President Goodluck Jonathan have condoled with the Aig-Imoukhuede family over the death of their matriarch, Pastor Emily Aig-Imoukhuede.\nEmily Imoukhude, former Secretary of State (Minister) for States and Local Government Affairs died on June 8, 2021.\nNoting that the late Emily Aig-Imoukhuede served the nation loyally and with distinction, the former President said her enormous contributions to the nation in particular earned her an eminent position in the nation’s gallery of unforgettable public servants.\n“Emily and my wife, Margaret began their lifelong friendship as contemporaries at the University College lbadan, in 1951.\nFormer President Jonathan’s letter read: “I learned with deep compassion, the news of the passing on of your dear mother, Mrs. Emily Oheren Aig-Imoukhuede, to eternal glory."
  },
  {
    "headline": "South West Governors, National Assembly Members Meet Tuesday over PIB, Electoral Act",
    "summarized_story": "By Deji ElumoyeThe six governors of the South West geo-political zone will on Tuesday evening meet with the federal legislators from the zone in Abuja.\nThe meeting billed for 7pm at Osun Hall of Transcorp Hilton is expected to discuss issues arising from the recently passed Petroleum Industry Bill (PIB) and the report of the Electoral Act Amendment Bill.\nAll the 18 Senators as well as House of Representatives members across party line from the six South western states are expected to attend the meeting to be presided over by the Chairman of South West Governors Forum and Governor of Ondo state, Rotimi Akeredolu.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ortom Backs Southern Govs on Open Grazing, Rotational Presidency",
    "summarized_story": "By George OkohBenue State Governor, Mr. Samuel Ortom, has described the decision of Southern Governors Forum to enact laws to ban open grazing of livestock in the region as a bold and patriotic move that will bring an end to the lingering crisis caused by armed herdsmen.\nGovernor Ortom said this in a statement by his Chief Press Secretary, Mr. Terver Akase on Tuesday.\nIn the statement, the governor also lauded his counterparts in Southern Nigeria for backing their May 11 Asaba declaration against open grazing with the resolve to legally prohibit nomadic cattle rearing; a resolution which he said conforms with the global best practices of animal husbandry.\nHe also commended the Southern Governors for their position on rotation of the Presidency between the north and south, beginning from 2023.\nGovernor Ortom said he believes that only equity, fairness and justice can strengthen the unity of Nigeria, give all citizens a sense of belonging and reduce tensions across the country."
  },
  {
    "headline": "CSOs Protest at N’Assembly, Demand INEC Independence, Inclusion of E-voting in Electoral Act",
    "summarized_story": "By Udora OrizuA Coalition of CSOs under the aegis of Alliance of Civil Society Organizations for Expression of Electoral and Democratic Space, has stormed the National Assembly, protesting exclusion of some provisions, such as electronic voting, financial autonomy for INEC, and protection of people with disabilities, in the new Electoral Act.\nThe aggrieved protesters were armed with placards, with inscriptions such as, “SaveOurElections #NigeriansDeserveFreeAndFairElection and so on.\nThe concerns raised by the CSOs followed the sudden emergence of a strange Section 50(2) in the new draft of the Bill, which completely outlaws transmission of votes by electronic means.\nThe Bill is expected to be passed this week by both Chambers of the National Assembly.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Afenifere, Ohanaeze, PANDEF Back Southern Govs’ Demand for Presidency",
    "summarized_story": "Rising from its second meeting held yesterday at the Lagos State Government House in Ikeja, the southern governors resolved that the next President of Nigeria should come from the southern region.\nThe southern governors also kicked against the proposed 30 per cent share of profit for the exploration of oil and gas in the basins.\nMeanwhile, the Yoruba Ronu Leadership Forum has thrown its weight behind yesterday’s resolutions of the southern governors.\nAfenifere, Ohanaeze Back Govs’ DemandsReacting to the governors’ demands, Afenifere, yesterday said since the North would have ruled consecutively for eight years by 2023, the next president would come from the South.\nKen Robinson, in a reaction, expressed happiness that the Southern governors met again, less than two months, after their historic Asaba meeting, to further accentuate the wishes and aspirations of the people of Southern Nigeria."
  },
  {
    "headline": "BREAKING: Again, Bandits Attack President Buhari’s Home State, Kill 21 Persons, Rustle 35 Cows",
    "summarized_story": "At least 21 persons have been killed by gunmen suspected to be bandits in separate attacks on communities in the Batsari Local Government Area of Katsina state.\nResidents said the bandits stormed Tsauwa village around 11.30 pm on Monday and operated till the early hours of Tuesday, killing 19 villagers.\n“Over 19 persons were killed and they have all been buried this morning (Tuesday) while the wounded have been taken to hospital for treatment,” a resident said.\nKatsina, despite being the home state of President Muhammadu Buhari, has witnessed sporadic attacks by bandits and kidnappers that have claimed the lives of many.\nAlso on December 19, 84 Islamiyya students of Hizburrahim Islamiyya in Mahuta village, Dandume Local Government Area of the state were abducted but rescued shortly after."
  },
  {
    "headline": "BREAKING: Again, Bandits Attack President Buhari’s Home State, Kill 21 Persons, Rustle 35 Cows",
    "summarized_story": "At least 21 persons have been killed by gunmen suspected to be bandits in separate attacks on communities in the Batsari Local Government Area of Katsina state.\nResidents said the bandits stormed Tsauwa village around 11.30 pm on Monday and operated till the early hours of Tuesday, killing 19 villagers.\n“Over 19 persons were killed and they have all been buried this morning (Tuesday) while the wounded have been taken to hospital for treatment,” a resident said.\nKatsina, despite being the home state of President Muhammadu Buhari, has witnessed sporadic attacks by bandits and kidnappers that have claimed the lives of many.\nAlso on December 19, 84 Islamiyya students of Hizburrahim Islamiyya in Mahuta village, Dandume Local Government Area of the state were abducted but rescued shortly after."
  },
  {
    "headline": "BREAKING: Again, Bandits Attack President Buhari’s Home State, Kill 21 Persons, Rustle 35 Cows",
    "summarized_story": "At least 21 persons have been killed by gunmen suspected to be bandits in separate attacks on communities in the Batsari Local Government Area of Katsina state.\nResidents said the bandits stormed Tsauwa village around 11.30 pm on Monday and operated till the early hours of Tuesday, killing 19 villagers.\n“Over 19 persons were killed and they have all been buried this morning (Tuesday) while the wounded have been taken to hospital for treatment,” a resident said.\nKatsina, despite being the home state of President Muhammadu Buhari, has witnessed sporadic attacks by bandits and kidnappers that have claimed the lives of many.\nAlso on December 19, 84 Islamiyya students of Hizburrahim Islamiyya in Mahuta village, Dandume Local Government Area of the state were abducted but rescued shortly after."
  },
  {
    "headline": "BREAKING: Nigerian Legislature Approves Bill To Create State Police, Security Outfits",
    "summarized_story": "The House of Representatives has passed for second reading, a bill seeking to amend the 1999 Constitution to allow creation of state police and legalise regional security outfits.\nThe current police system will be decentralised by moving police from the Exclusive Legislative List to the Concurrent List.\nThe bill especially proposes an amendment to Section 197(1) by inserting new Paragraphs ‘e’ and ‘f’ to provide for ‘State Police Council’ and ‘State Police Service Commission,’ respectively.\n“The federal structuring of our security does not encourage community policing or localisation of policing.\n“The Constitution envisages Nigeria as a federal state."
  },
  {
    "headline": "BREAKING: Nigerian Legislature Approves Bill To Create State Police, Security Outfits",
    "summarized_story": "The House of Representatives has passed for second reading, a bill seeking to amend the 1999 Constitution to allow creation of state police and legalise regional security outfits.\nThe current police system will be decentralised by moving police from the Exclusive Legislative List to the Concurrent List.\nThe bill especially proposes an amendment to Section 197(1) by inserting new Paragraphs ‘e’ and ‘f’ to provide for ‘State Police Council’ and ‘State Police Service Commission,’ respectively.\n“The federal structuring of our security does not encourage community policing or localisation of policing.\n“The Constitution envisages Nigeria as a federal state."
  },
  {
    "headline": "UK parliament to debate Nnamdi Kanu’s repatriation to Nigeria",
    "summarized_story": "The United Kingdom parliament says it will discuss issues surrounding the repatriation of Nnamdi Kanu, leader of Indigenous People of Biafra (IPOB).\nAdvertisementKanu, who is also a British citizen, was arrested on Sunday and extradited to Nigeria to face trial for alleged treason.\nAbubakar Malami, attorney-general of the federation (AGF), said on Tuesday that the IPOB leader was “intercepted through the collaborative efforts of Nigerian intelligence and security services”.\nIn a schedule posted on its website, the UK parliament said it will discuss “the circumstances surrounding the transfer of Mr Kanu to Nigeria against his will”, among other issues.\nAccording to the document, Lord Alton of Liverpool will be raising the issue at the House of Lords and will ask the British government on Kanu’s repatriation to Nigeria."
  },
  {
    "headline": "UK parliament to debate Nnamdi Kanu’s repatriation to Nigeria",
    "summarized_story": "The United Kingdom parliament says it will discuss issues surrounding the repatriation of Nnamdi Kanu, leader of Indigenous People of Biafra (IPOB).\nAdvertisementKanu, who is also a British citizen, was arrested on Sunday and extradited to Nigeria to face trial for alleged treason.\nAbubakar Malami, attorney-general of the federation (AGF), said on Tuesday that the IPOB leader was “intercepted through the collaborative efforts of Nigerian intelligence and security services”.\nIn a schedule posted on its website, the UK parliament said it will discuss “the circumstances surrounding the transfer of Mr Kanu to Nigeria against his will”, among other issues.\nAccording to the document, Lord Alton of Liverpool will be raising the issue at the House of Lords and will ask the British government on Kanu’s repatriation to Nigeria."
  },
  {
    "headline": "Kaduna Baptist Conference: Bandits abducted 121 students from our school",
    "summarized_story": "The Baptist Conference in Kaduna says 121 students were abducted by bandits from Bethel Baptist High School in Damishi, Chikun LGA of the state.\nAdvertisementThe students were kidnapped when gunmen attacked the school in the early hours of Monday.\nSpeaking with journalists on Tuesday after a meeting with parents of the abducted students, Ishaya Jangadi, president of the Baptist Conference in the state, said 28 students were rescued Monday after a duel between security agents and the bandits.\nAdvertisementJangadi said the school was able to confirm that 121 of the students are still in captivity because they “had the privilege of speaking with a few of them”.\nThey [the students] counted themselves in the jungle and they gave us information that they are 121 with the bandits,” Jangadi said."
  },
  {
    "headline": "Kaduna Baptist Conference: Bandits abducted 121 students from our school",
    "summarized_story": "The Baptist Conference in Kaduna says 121 students were abducted by bandits from Bethel Baptist High School in Damishi, Chikun LGA of the state.\nAdvertisementThe students were kidnapped when gunmen attacked the school in the early hours of Monday.\nSpeaking with journalists on Tuesday after a meeting with parents of the abducted students, Ishaya Jangadi, president of the Baptist Conference in the state, said 28 students were rescued Monday after a duel between security agents and the bandits.\nAdvertisementJangadi said the school was able to confirm that 121 of the students are still in captivity because they “had the privilege of speaking with a few of them”.\nThey [the students] counted themselves in the jungle and they gave us information that they are 121 with the bandits,” Jangadi said."
  },
  {
    "headline": "Dollar video: Court orders Ganduje to pay N800,000 to Ja'afar Ja'afar, Daily Nigerian",
    "summarized_story": "A Kano state high court has ordered Abdullahi Ganduje, governor of Kano, to pay N800,000 to Ja’afar Ja’afar, publisher of Daily Nigerian, an online newspaper, over a dollar bribery video.\nHe had also gone to the court in the attempt to clear his name, while asking the publisher to pay N3 billion in damages.\nAdvertisementOn June 28, the governor filed an application at the court through his counsel, Offiong Offiong, seeking to discontinue the case.\nDuring the hearing of the case, on Tuesday, Utum Eteng, counsel to Ja’afar, and M.B.\nAdvertisementIn his ruling, Suleiman Na-mallam, the presiding judge, granted the sum of N400,000 each to Ja’afar and his company."
  },
  {
    "headline": "From iPhone shortages to price surges: The global chip scarcity is affecting Africa",
    "summarized_story": "Months into the shortage, effects from the ongoing global chip scarcity have spread far and wide, across industries and the globe.\nThe automobile industry is one of the hardest hit by the semiconductor shortage with carmakers across the world forced to slash production.\nIn fact, Taiwan is one of the four countries in Asia behind nearly three-quarters of global semiconductor manufacturing capacity.\nThe global semiconductor scarcity affects a staggering 169 industries in some way, according to Goldman Sachs.\nSo the global chip shortage has naturally led to price increases and there’s not so much local players can do about it."
  },
  {
    "headline": "What telcos and banks look for in fintech partnerships",
    "summarized_story": "Fintech is growing in Africa thanks to strategic partnerships between startups, banks and diverse categories of global companies.\nIn a distribution model, a digital-only bank (say Kuda) partners with traditional banks to offer in-branch deposits, ATM withdrawals and card issuance.\nBut partnerships don’t automatically work just because two parties have good intentions or similar ambitions.\nAs CEO of Sterling Bank, Suleiman receives partnership offers regularly and believes himself open to having many conversations.\nAnd so he wishes to encourage an approach that frames partnerships in terms of capabilities, not institutions."
  },
  {
    "headline": "Tolu Michaels on how digital entrepreneurs create and sell intangible products online",
    "summarized_story": "Your business can either deal with offering physical products for sale online or providing a service online.\nI didn’t have the capital to sell physical products so I needed something I could provide people in whatever location I am,” she tells me on our Google Meet call.\nLeveraging knowledge commerceDigital products are basically online products that can’t be held, touched, or tasted.\nThis will allow the right people and the right opportunities to be attracted to you.”In the initial stage of her digital career, Michaels picked up new skills including a degree on Disruptive Strategy from Harvard Business school.\nOne would think LinkedIn could have been at the forefront of this process but, she says, in selling digital products, entrepreneurs should have their profiles on all social media platforms and utilise each platform fully."
  },
  {
    "headline": "Product partnership managers are obsessed with a product’s life cycle",
    "summarized_story": "While product managers are responsible for hand holding a product from conception to maturity, product and partnership managers go a step further by exposing the product to valuable collaborations.\nIn your years of experience working as a product partnership manager, have you ever experienced the death of a product?\nProdpad is a great resource for aspiring product partnership managers — they have a great blog and also offer online courses.\nProduct partnership managers have to be extremely patient people.\nWhat are some of the challenges product partnership managers face on the job?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "VC firm, MAGIC Fund raises $30m to support early-stage startups globally",
    "summarized_story": "MAGIC Fund, an early-stage venture firm, has announced a $30 million Fund II raise to scale its global founders-backing-founders initiative.\nAnnounced on Tuesday, July 6, 2021, this raise will support early-stage startups globally, across all sectors, with funding between $100,000 and $300,000.\nThe venture firm also aims to provide them with partners that have experience and expertise.\nSome of these founders joined MAGIC Fund as partners for this raise when their companies exited.\nAlso, MAGIC Fund has created a cohort specifically to invest in companies founded by women, led by Alison Cheung and Tito Ovia."
  },
  {
    "headline": "MaxAB Series A funding, Facebook’s fibre in DRC, Nigeria’s #TwitterBan losses?",
    "summarized_story": "Good day,Today, I’m discussing:MaxAB’s $40m Series ALiquid Intelligence Technologies’ partnership with FacebookNigeria’s #TwitterBan: Any economic costs?\nGiven the long wait for sustainable Internet infrastructure in Africa, this partnership aims to improve Internet access.\nTogether they plan to meet the growing demand for connectivity across Central Africa by providing Internet infrastructure that cuts across the East and West African coasts and Europe.\nDespite questions about their intentions, the resultant effects of these partnerships might speed up the improvement of Internet infrastructure in Africa.\nThis might be somewhat puzzling as many reports state that Nigeria has 40 million Twitter users."
  },
  {
    "headline": "Facebook partners with Liquid Intelligent Technologies to build metro fibre network in Democratic Republic of Congo",
    "summarized_story": "Pan-African technology group, Liquid Intelligent Technologies, is partnering with Facebook to build a long haul and metro fibre network in the Democratic Republic of Congo (DRC).\nAnnounced Monday, July 5 2021, the build will be funded by Facebook but owned and operated by Liquid Intelligent Technologies.\nThe fibre network is expected to improve Internet quality for 30 million people and provide regional connectivity for Central Africa.\nDescribed as a digital corridor by Liquid Intelligence Technologies, the network will connect DRC to neighbouring African countries including Angola, Zambia, Uganda, Congo, Rwanda, and Tanzania.\nWhile Facebook’s partnership with Liquid Intelligence Technologies could help DRC’s Internet connectivity and affordability, its impact might not be as significant as expected."
  },
  {
    "headline": "Banks’ FX charges hit 12-month high of $37.76m in December",
    "summarized_story": "Foreign exchange charges by Nigeria’s Deposit Money Banks (DMBs) hit a year high of $37.76 million in December 2020 compared with $1.65 million in December 2019, latest data from the Central Bank of Nigeria (CBN) show.\nThe increase in the bank charges seemed surprising as the net foreign exchange flow through the Nigerian economy fell…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Why OPEC+ talks collapse could push oil price to $80",
    "summarized_story": "Why OPEC+ talks collapse could push oil price to $80Some of the world’s biggest investment and energy intelligence firms are predicting oil prices could hit $80 after talks collapsed among ministers from OPEC+ — consisting of the Organisation of the Petroleum Exporting Countries (OPEC) and allies.\nOn Tuesday, Brent crude climbed 62 cents, to $77.78 a barrel — highest since October 2018, while the…"
  },
  {
    "headline": "Barkindo takes swipe at ambitious plans to accelerate the end of oil",
    "summarized_story": "Barkindo takes swipe at ambitious plans to accelerate the end of oilMohammed Barkindo, the secretary general of OPEC has said that calls to discontinue the investment in oil and gas due to climate concerns are dangerous and unrealistic.\nIn a keynote address at the 20th edition of the Nigerian OIl and Gas Conference 2021, held in Abuja on Tuesday, Barkindo said that while the unpredictability and…"
  },
  {
    "headline": "Screening of political appointees: Committee reviews petitions from 18 Edo LGAs – Nigerian Observer",
    "summarized_story": "Chairman of the committee, Prof. Dennis Agbonlahor, while speaking to journalists in Benin City, reassured that the committee will be fair to all nominees.\nAccording to him, “We are looking at all the petitions from the various local government areas of Edo state.\nWe want to be sure that the leaders from the various local government areas have done justice to the process; there will be no dictatorial tendency.\n“We will look at Special Assistants from each ward; there are three nominees for this position; a female and two males.\nOthers are Osayamwanbor Agbons; Matthew Iduoriyekemwen; Dr. (Mrs.) Bob Osazee; Prof Maureen Isoken Ebomoyi; Prof. Ahmed Uwubamwen; Hillary Otsu and Pastor Osagiede Joseph."
  },
  {
    "headline": "I never promised to solve all the problems of Rivers State – Gov. Wike – Nigerian Observer",
    "summarized_story": "I never promised to solve all the problems of Rivers State – Gov.\nWikeShare FacebookTwitterStumbleuponLinkedInPinterestPORT HARCOURT – The governor of Rivers State, Nyesom Ezenwo Wike says he never promised to solve all the socio-economic and infrastructural problems of the State during his tenure.\nGovernor Wike made this assertion during the inauguration of the ultramodern National Union of Rivers State Students, (NURSS) national secretariat built by his administration at the Rivers state University on Monday night.\n” I never said I will finish the whole work in Rivers State.\nEven if you keep me here for 40 years, I cannot finish the work in Rivers State."
  },
  {
    "headline": "EFA Calls For Memoranda As NFF Review Football Statutes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn compliance with the directive of the Nigeria Football Federation mandating all State Football Associations across the country to review their status, Edo State Football Association has called for submission of memoranda from football stakeholders in the state.\nAccording to the chairman of the review committee, the memorandum should reach the Edo State Football Association Secretariat not later than Tuesday, July 13,2021.#NNL Offers Dynamite Force Football Club President Temporary Lift From Ban.\nThe Nigeria National League (NNL) has provisionally lifted the sanction slammed on the proprietor and President of Dynamite Force Football of Iyahmo,Edo State Mr.Bernard Joman.\nMr.Joman had earlier been banned from all NNL football matches and related activities over a misconduct.\nHowever,the NNL warned Mr.Joman that only a satisfactory conduct now and in the future will earn him a permanent lift of the ban."
  },
  {
    "headline": "Vice Chancellors now appointed to rig elections for APC – Wike – Nigerian Observer",
    "summarized_story": "Governor Wike said it is worrisome that Nigeria has degenerated to the point where politicians now influence who becomes a Vice Chancellor of a federal government for the purposes of rigging elections.\n“Let me warn, not one person will dare to rig election in Rivers State.\nGovernor Wike warned that any Vice Chancellor that allows himself to be used to rig election in Rivers State, should be prepared for the consequences of such hideous act.\nThe Acting Vice Chancellor of University of Port Harcourt, Professor Stephen Okodudu commended Governor Wike for consistently identifying with the ideals and aspiration of the university.\nHe declared that history will be kind to Governor Wike because he has deliberately worked conscientiously for public good."
  },
  {
    "headline": "Dollar Video: Court orders Ganduje to pay Jaafar, Daily Nigerian N800,000",
    "summarized_story": "ADVERTISEMENTThe Kano State High Court on Tuesday ordered Governor Abdullahi Ganduje to pay N800,000 to the Publisher of Daily Nigerian, Ja’afar Ja’afar, as cost for expenses incurred in a court case the governor instituted over the controversial dollar bribery video.\nMr Ganduje had sued Mr Ja’afar and Daily Nigerian newspaper for releasing the video clips showing the governor stuffing his pockets with wads of dollars suspected to be a kickback from a contractor.\nThe governor through his counsel demanded Mr Jaafar pay him N3 billion for defamation of character.\nHe, however, filed an application through his counsel, Offiong Offiong, on June 28 seeking to discontinue the court case.\nThe judge, Suleiman Na-mallam, in his ruling granted N400,000 each to Mr Ja’afar and his company, Penlight Media Limited, publishers of Daily Nigerian newspaper."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Gunmen Kill 21 In Fresh Katsina Attack",
    "summarized_story": "No fewer than 21 persons have been killed in a fresh banditry attack in Tsauwa village of Batsari local government area of Katsina State.\nThe bandits stormed the village on Monday evening at about 5:30pm, riding on motorcycles with sophisticated weapons, attacking the villagers.\nThey also burnt down the entire village and went away with several domestic animals.\nHe further disclosed that before the attack, the villagers alerted the security operatives in the area, but they were unable to respond as the bandits carried out nefarious act unchallenged.\nADVERTISEMENTThe lawmaker representing Batsari constituency in the Katsina State House of Assembly, Jabiru Yusuf Yau’Yau, also confirmed the incident, saying several people were killed, which he can’t ascertain the exact figure."
  },
  {
    "headline": "Gunmen Kill 21 In Fresh Katsina Attack",
    "summarized_story": "No fewer than 21 persons have been killed in a fresh banditry attack in Tsauwa village of Batsari local government area of Katsina State.\nThe bandits stormed the village on Monday evening at about 5:30pm, riding on motorcycles with sophisticated weapons, attacking the villagers.\nThey also burnt down the entire village and went away with several domestic animals.\nHe further disclosed that before the attack, the villagers alerted the security operatives in the area, but they were unable to respond as the bandits carried out nefarious act unchallenged.\nADVERTISEMENTThe lawmaker representing Batsari constituency in the Katsina State House of Assembly, Jabiru Yusuf Yau’Yau, also confirmed the incident, saying several people were killed, which he can’t ascertain the exact figure."
  },
  {
    "headline": "PIB: Jackrich Lauds Senate, Seeks Review Of 3% Fund For Host Communities",
    "summarized_story": "Political activist and leader, Network for the Defense of Democracy and Good Governance (NDDGG), Ambassador Sobomabo Jackrich, has commended the 9th Senate for passing the Petroleum Industry Bill (PIB) into law.\nJackrich, who made the commendation during a grand reception held in his honour by the people of Ogbogoro community in Obio/Akpor local government area of Rivers State, however called on the Senate to reconsider an upward review of the 3% equity participation to host communities in the legislation.\nHe also urged Rivers people to resist imposition of candidates by those whom he alleged had plundered the collective resources of the state.\nAlso speaking, the political leader of Ogbogoro ward 6, Professor Lawson Ihwgiwe, applauded the NDDGG leader for achieving a feat other well to do citizens of the community could not do.\nSobomabo Jackrich."
  },
  {
    "headline": "PIB: Jackrich Lauds Senate, Seeks Review Of 3% Fund For Host Communities",
    "summarized_story": "Political activist and leader, Network for the Defense of Democracy and Good Governance (NDDGG), Ambassador Sobomabo Jackrich, has commended the 9th Senate for passing the Petroleum Industry Bill (PIB) into law.\nJackrich, who made the commendation during a grand reception held in his honour by the people of Ogbogoro community in Obio/Akpor local government area of Rivers State, however called on the Senate to reconsider an upward review of the 3% equity participation to host communities in the legislation.\nHe also urged Rivers people to resist imposition of candidates by those whom he alleged had plundered the collective resources of the state.\nAlso speaking, the political leader of Ogbogoro ward 6, Professor Lawson Ihwgiwe, applauded the NDDGG leader for achieving a feat other well to do citizens of the community could not do.\nSobomabo Jackrich."
  },
  {
    "headline": "CVR: INEC Receives 203,497 Fresh Requests In 1 Week",
    "summarized_story": "The Independent National Electoral Commission (INEC), said it has received about 203,497 fresh requests from Nigerians in the ongoing Continuous Voter Registration (CVR).\nINEC national commissioner and chairman of its Information and Voter Education Committee, Festus Okoye, disclosed this in a statement in Abuja on Tuesday.\nHe said the physical or in-person registration was scheduled to commence in all INEC state and local government offices nationwide on Monday, July 19, 2021.\n“Eligible Nigerians who wish to register physically and those who have scheduled their appointments to complete their online pre-registration will have the opportunity to do so.\nBoth online pre-registration and the physical registration will go on simultaneously throughout the duration of the CVR,” the statement added."
  },
  {
    "headline": "Gunmen kidnap four farmers in Ekiti, demand N50m ransom",
    "summarized_story": "Some suspected gunmen have kidnapped four farmers in a farm located in Ekiti, demanding N50 million ransom to secure their release.\nThe Police Command in the state on Tuesday confirmed the kidnapping of the four farmers but denied knowledge of the N50 million ransom.\nSources said the latest victims, the farmers, were kidnapped on Monday evening in Ikosu Farm Settlement in Ikosu-Ekiti, Moba Local Government area.\nCommenting, Mr Olawumi Ayodeji, Manager of the farm, told newsmen in Ado-Ekiti on Tuesday, that the abductors had made calls, demanding N50 million ransom.\n“We are not aware of any ransom being demanded from the family, rather, our men are in the bush working hard to rescue the farmers."
  },
  {
    "headline": "Gunmen kidnap four farmers in Ekiti, demand N50m ransom",
    "summarized_story": "Some suspected gunmen have kidnapped four farmers in a farm located in Ekiti, demanding N50 million ransom to secure their release.\nThe Police Command in the state on Tuesday confirmed the kidnapping of the four farmers but denied knowledge of the N50 million ransom.\nSources said the latest victims, the farmers, were kidnapped on Monday evening in Ikosu Farm Settlement in Ikosu-Ekiti, Moba Local Government area.\nCommenting, Mr Olawumi Ayodeji, Manager of the farm, told newsmen in Ado-Ekiti on Tuesday, that the abductors had made calls, demanding N50 million ransom.\n“We are not aware of any ransom being demanded from the family, rather, our men are in the bush working hard to rescue the farmers."
  },
  {
    "headline": "Ex-Ashaka Cement Staff Convicted of Stealing in Gombe",
    "summarized_story": "By JUMOKE SANNIA Gombe State High Court presided over by Justice Fatima Musa on Monday July 5, 2021 convicted and sentenced one Bala Bello, a former employee of Ashaka Cement, Bajoga, Gombe State to one year imprisonment on two separate one-count charge of stealing brought against him by the Gombe Zonal Office of the Economic and Financial Crimes Commission, EFCC .\nThe offence is contrary to Section 320 and punishable under Section 322 of the Penal Code.\nThe defendant pleaded guilty to the two separate charges and was consequently convicted.\nThe judge however gave the convict option of N50, 000 and N30, 000 fines, amounting to N80, 000.\nShe further ordered the convict to restitute the sums of N780, 000 (Seven Hundred and Eighty Naira) to his first victim, Alhaji Shadi Manu and N400, 000 (Four Hundred Naira) to Sa’ad Abdulhamid."
  },
  {
    "headline": "Ex-Ashaka Cement Staff Convicted of Stealing in Gombe",
    "summarized_story": "By JUMOKE SANNIA Gombe State High Court presided over by Justice Fatima Musa on Monday July 5, 2021 convicted and sentenced one Bala Bello, a former employee of Ashaka Cement, Bajoga, Gombe State to one year imprisonment on two separate one-count charge of stealing brought against him by the Gombe Zonal Office of the Economic and Financial Crimes Commission, EFCC .\nThe offence is contrary to Section 320 and punishable under Section 322 of the Penal Code.\nThe defendant pleaded guilty to the two separate charges and was consequently convicted.\nThe judge however gave the convict option of N50, 000 and N30, 000 fines, amounting to N80, 000.\nShe further ordered the convict to restitute the sums of N780, 000 (Seven Hundred and Eighty Naira) to his first victim, Alhaji Shadi Manu and N400, 000 (Four Hundred Naira) to Sa’ad Abdulhamid."
  },
  {
    "headline": "Breaking: Italy beat Spain on penalties to reach Euro 2020 final",
    "summarized_story": "By Kazeem UgbodagaItaly have qualified for Euro 2020 final after defeating Spain 4-2 on penalty shootouts in Wembley.\nPenalty has to decide the encounter and Alvaro Morata missed Spain’s crucial kick, as Italy triumph to reach the final.\nAfter Alvaro Morata’s penalty was saved, Jorginho strolled up to score and set up a final with either England or Denmark in London on Sunday.\nMorata’s penalty miss was the third he had failed to score in Euro 2020.\nHe pounced on a loose ball inside the box and beats the goalkeeper with a shot inside the right post."
  },
  {
    "headline": "Fraudulent Habiba Abubakar jailed seven years",
    "summarized_story": "The convict fraudulently sold a plot of land to the complainant with fake documents.\nAccording to the complainant, the convict sometime in November 2016 offered to sell to him a plot of land located at Rijiyar Zaki, Kano.\nShe claimed that she put the land for sale in order to raise funds to carter for the needs of her seven children who had lost their father.\nDaggard subsequently sentenced her to seven years imprisonment on each of the two counts.\nThe convict was also ordered to restitute the sum of N2, 900,000 to the victim."
  },
  {
    "headline": "TB Joshua: In the eyes of his daughters, son-in-law",
    "summarized_story": "By Taiwo OkanlawonThe only three daughters of Prophet TB Joshua, the founder of the Synagogue Church of All Nations, have paid tributes to their late father, describing him as loving and caring father.\nDad lived a fulfilling and enigmatic life – SerahIn her own tribute, Serah, the first daughter of the late prophet said he lived a fulfilled life.\nGrowing up as a biological daughter to a man like Prophet TB Joshua, he made me understand that he was on a mission in this world.\nWhen that day came, June 5, my father Prophet TB Joshua departed this world to go and join his father in heaven and it has not been the same for me then.\n“His memory will not only carry on in my heart but in the heart of everyone lucky enough to have known Prophet TB Joshua,” she added."
  },
  {
    "headline": "Buhari Hails Operations Against Nnamdi Kanu, Sunday Igboho",
    "summarized_story": "President Muhammadu Buhari praised the security agencies’ cooperation in the operations against Nnamdi Kanu and Sunday Igboho.\nKanu and the Indigenous People of Biafra (IPOB) leaders are known for violent deeds and toxic messaging, according to Shehu.\nHe acknowledged that Kanu was handed up to the National Intelligence Agency (NIA) and then repatriated after the “international operation” against him.\nShehu added that his seditious utterances and antics, publicly expressed, have overtime morphed into very hateful and vile laden speeches.\nPresident’s directives to Security Services regarding anyone seen to be carrying arms, particularly AK-47 are clear and require no further illumination."
  },
  {
    "headline": "BREAKING: Wike Lifts Curfew After 2 Months In Rivers",
    "summarized_story": "Nyesom Wike, the governor of Rivers State, has lifted the two-month curfew that had been imposed on the whole state following attacks on security officers and formations in the state by unknown gunmen.\nThe governor announced that the curfew will be lifted on Wednesday, July 7, 2021.\n“We have decided to lift the existing curfew on the entire state from tomorrow 7th July 2021,” the statement said.\nWhile praising people for their patience and cooperation throughout the curfew, Wike asked them to be vigilant and report any suspicious situations to the appropriate security services.\nThe governor commended residents of the state for their support, prayer and solidarity even as the government continues to work tirelessly to keep Rivers State safe and secure for all."
  },
  {
    "headline": "Herdsmen Allegedly Destroy Crops Worth ₦1 Billion In Communities In Plateau",
    "summarized_story": "The alleged damage of farmlands by suspected Fulani herders has caused tension in the Kwi and Jol communities in Plateau State’s Riyom Local Government Area.\nGyang Moses, a Jol village resident whose maize plot was damaged, sobbed uncontrollably as he saw his crops being torn down by the herders.\nMoses said, “This is heartless, how can people use cutlass to cut down maize that will feed the entire nation?\nOur people need help, government must be swift in taking action to assist these poor communities to avert impending famine”, he decried.\nHe said “Two days back, Fulani militia invaded my constituency and destroyed farmlands with crops, this has been the reason why we have had crises in the past."
  },
  {
    "headline": "In Enugu, Masked Gunmen Attack Supermarket, Cart Away Goods",
    "summarized_story": "Gun-wielding criminals raided Uzorbest Super-market Limited, a prominent supermarket in Enugu’s Onu Asata Junction, carrying away products worth over N1 million.\nThe burglars took 18 bags of 50kg foreign and local rice, 10 bags of 10kg rice, 30 boxes of noodles, and five bags of 20kg semolina, according to reports.\nFour massive cooking gas cylinders were also stolen from a nearby shop and delivered to the Supermarket by the armed thieves.\nThe bandits arrived at the Supermarket in three Hilux jeeps in commando-style at about 6 p.m. on Monday, according to a NAN correspondent who visited the Uzorbest Super-market Limited on Tuesday.\n“The Command will establish contact with the DPO in the area and get full details of the incident."
  },
  {
    "headline": "Breaking: Multiple goods, other valuables burn as fire engulfs Abuja market",
    "summarized_story": "It was a dark Tuesday evening as popular market in Karmo, a suburb of Abuja Municipal Area Council, got burnt with goods worth millions.\nMr Joseph Agi, who was an eye witness, told Blueprint that it was due to electrical fault.\nDetails loading…"
  },
  {
    "headline": "Breaking: Chelsea ‘s Jorginho nets decisive shot as Italy down Spain, land in Euro 2020 final",
    "summarized_story": "Italy beat Spain on penalties to reach the Euro 2020 final after an enthralling semi-final at a noisy Wembley.\nAfter Alvaro Morata’s penalty was saved, Jorginho strolled up to score and set up a final with either England or Denmark in London on Sunday.\nBut Morata stepped off the bench to slot an equaliser with 10 minutes to go after a one-two with Dani Olmo.\nHowever, the Juventus forward’s penalty miss in the shootout proved costly as Spain lost a semi-final for the first time in their history.\nThey had a couple of chances to wrap the game up, but Domenico Berardi shot straight at Simon both times before Morata equalised."
  },
  {
    "headline": "Breaking: Goods, property lost as fire engulfs popular Abuja market in Karimo (PICTURES)",
    "summarized_story": "PreviousPictures: Expectations heighten as first batch of team Nigeria head to Tokyo, ready for 2020 Olympics battle"
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Buhari Praises Security Agencies For Dealing With Nnamdi Kanu, Igboho",
    "summarized_story": "President Muhammadu Buhari on Tuesday commended the nation’s security and intelligence agencies for their work in arresting secessionist Nnamdi Kanu and raiding the home of ‘Yoruba Nation’ activist Sunday Igboho.\nAccording to the statement, President Buhari said the security agencies demonstrated “significant deftness, guile and secrecy in carrying out these missions.\nAssault weapons are not tools of peace loving people and as such, regardless of who they are and where they are from, the Security Agencies should treat them all the same.\nThe successes of our Security Agencies must be commended as they have demonstrated significant deftness, guile and secrecy in carrying out these missions.\nThe nation recognizes their efforts and sacrifice."
  },
  {
    "headline": "North-East Governors Urge Military To Sustain Fight Against Insurgency",
    "summarized_story": "﻿ ﻿Governors of the northeast region have asked the military to sustain its momentum in the fight against insurgency in the region by taking advantage of the current division among the insurgents.\nThe governors made the call on Tuesday at the 5th edition of the North East Governors’ Forum held at the Taraba State Government House in Jalingo.\nSpeaking further, they called on the Federal Government to extend the exploration of oil to the Chad Basins so as to put the northeast states on the list of oil-rich states.\nRead Also: Taraba Gov Asks FG To Speed Up Oil Exploration In North-EastMeanwhile, the Governor of Borno State who doubles as chairman of the forum, Professor Babagana Zulum and the host Governor, Darius Ishaku, harped on the need for more infrastructural development in the northeast, including electricity supply.\nThe meeting has now gone into a closed-door session for further discussion with a communiqué expected to be issued afterward."
  },
  {
    "headline": "Bill To Allow Creation Of State Police Passes Second Reading",
    "summarized_story": "A bill to alter the constitution to allow for the creation of state police and other state government security services has scaled second reading in the House of Representatives.\nSee the full content of the Bill below…CONSTITUTION OF THE FEDERAL REPUBLIC OF NIGERIA (FIFTH ALTERATION) BILL, 2020Arrangement of ClausesClause:1.\nCONSTITUTION OF THE FEDERAL REPUBLIC OF NIGERIA (FIFTH ALTERATION) BILL, 2020A BillForAn Act to alter the Constitution of the Federal Republic of Nigeria, Cap.\nA House of Assembly may make laws for the establishment of State Police and other state government security services.”4.\nA State Police Council shall comprise the following members:(a) the Governor, who shall be the Chairman;(b) the Chairman of the State Police Service Commission; and(c) State Commissioner of Police."
  },
  {
    "headline": "Senate Condemns Unlawful Arrest Of Nigerians By Benin Republic Authorities",
    "summarized_story": "The Senate has condemned the unlawful encroachment and arrest of Nigerians by the authorities of the Republic of Benin.\nThe lawmaker drew the attention of lawmakers to reports of encroachments into Nigeria’s territory by authorities of the Republic of Benin.\nThe Ogun State government in response called on the Federal Government to immediately secure the release of the Nigerian citizen.\nIn a press statement, Governor Dapo Abiodun called on the national boundary commission to step up action to demarcate Nigeria’s border with the Republic of Benin.\nHe also called on Nigerian security agents to promptly ensure the security of border communities from external invasion."
  },
  {
    "headline": "Emefiele Calls For More Collaboration Between Universities And Key Industry Players",
    "summarized_story": "In his presentation Mr Emefiele said: “enhanced collaboration between universities and players in key sectors of our economy such as agriculture, manufacturing and ICT are necessary to enable implementation of sound ideas generated from our universities.\nFor instance, universities in most developing countries have little or no formal linkages to industry.\nMr Emefiele maintained that “the current economic situation in Nigeria requires an accelerated adoption of knowledge to drive our developmental goals.\nOther programmes of the bank include the SME Credit Guarantee Scheme (SMECGS), Micro, Small and Medium Enterprises Development Programme (YEDP); Agribusiness/Small and Medium Enterprises Investment Scheme (AGSMEIS).\nSmall and Medium Enterprises Development Fund is another scheme through which Mr Emefiele said the CBN is channelling low-interest wholesale funds to the MSME segment."
  },
  {
    "headline": "Edo to upgrade school of nursing to college of nursing sciences",
    "summarized_story": "The Edo State Governor, Mr. Godwin Obaseki, has said his administration will establish a college of nursing sciences in the state, as part of the government’s plan to reposition the state into Nigeria’s medical hub.\nThe governor said the state will begin the process for upgrading the School of Nursing and Midwifery in the state to a College of Nursing Sciences.\nSo, I agree with you; if we decide to run a college system, we must withdraw the bill in the House of Assembly.\n“In the new nursing school, I am not going to accept any staff who joined to ruin the old system.\nAdvertisementAbubakar, however, suggested that the governor upgrade the state’s School of Nursing and Midwifery to Edo State College of Nursing Sciences, as part of the federal government’s educational reforms."
  },
  {
    "headline": "FG restates commitment to promote Energy efficiency, Security for All",
    "summarized_story": "President Muhammadu Buhari has restated the commitment of his administration towards promoting energy efficiency and ensuring energy security to all Nigerians.\nThe President stated this at the official commissioning of the 1.52 MWp/2.28 MWh Solar Microgrid System built by the Federal Ministry of Works and Housing.\nThe President explained that the Solar Microgrid System is part of Nigeria’s commitment to the Paris Climate Change Agreement which he signed on behalf of the country to reduce carbon emission globally.\n“I express our appreciation to members of the Federal Executive Council who voted to entrust our Ministry with this project,” he said.\nThe impressive event also received goodwill messages from the Honourable Minister of Environment, Dr. Mohammad Abubakar and the Deputy Secretary General of United Nations, Hajiya Amina Mohammed."
  },
  {
    "headline": "Presidency commends agencies on arrest of Kanu, operation on Igboho",
    "summarized_story": "The Presidency has hailed the enhanced collaboration of the Nigerian Law Enforcement Agencies which led to the execution of synchronized arrests of individuals who had inflicted pain and hardships on fellow citizens.\nThe international operation according to the Presidency was executed in a closely coordinated fashion following which he was handed over to the National Intelligence Agency, and then returned to Nigeria to face the Law.\nThe violence inspired by IPOB has led to hundreds of fatalities, particularly targeted at Government assets and Law Enforcement Agents.\nHe added that the Security Services success in addressing the seditious utterances and antics, of Sunday Adeyemo also known as Igboho which he is known to have publicly expressed, have overtime morphed into very hateful and vile laden speeches.\nHe concluded that Mr. President’s directives to Security Services regarding anyone seen to be carrying arms, particularly AK-47 are clear and require no further illumination."
  },
  {
    "headline": "Pentagon Cancels Disputed Microsoft Cloud Contract Worth $10bn",
    "summarized_story": "The Pentagon said Tuesday it is canceling a cloud-computing contract with Microsoft that could eventually have been worth $10 billion and will instead pursue a deal with both Microsoft and Amazon.\n“With the shifting technology environment, it has become clear that the JEDI Cloud contract, which has long been delayed, no longer meets the requirements to fill the DoD’s capability gaps,” the Pentagon said in a statement.\nThe statement did not directly mention that the Pentagon faced extended legal challenges by Amazon to the original $1 million contract awarded to Microsoft.\nAmazon Web Services, a market leader in providing cloud computing services, had long been considered a leading candidate to run the Pentagon’s Joint Enterprise Defense Infrastructure project, known as JEDI.\nThe JEDI contract became mired in legal challenges almost as soon as it was awarded to Microsoft in October 2019."
  },
  {
    "headline": "Nigeria Senate Announces Committee to Harmonise PIB With House of Reps, Presidential Assent Expected Next Week",
    "summarized_story": "The Nigerian Senate has announced a seven-member committee to harmonise the different versions of the Petroleum Industry Bill passed by both chambers of the National Assembly last week.\nPresident of the Senate, Ahmad Lawan disclosed this on Tuesday during plenary noting that the Senate Leader, Yahaya Abdullahi (APC, Kebbi North) would lead the conference committee.\nThe selected members are expected to meet with their counterparts in the House of Representatives as early as possible to reconcile the differences in the two versions passed.\nMr Lawan directed that the conference committee commence sitting immediately so as to enable the National Assembly transmit the harmonised bill to Nigeria’s President Muhammadu Buhari for assent.\nAccording to the Senate President, he expects this action to be executed as early as next week."
  },
  {
    "headline": "UN: Deadly Violence in Eswatini ‘Deeply Concerning’",
    "summarized_story": "The UN says it’s “deeply concerned” by the deadly violence that followed pro-democracy protests in Eswatini.\nThe UN human rights agency in a statement said security forces deployed unnecessary use of force and live rounds in suppressing last weeks protests.\nIt noted that even as the situation had become calm now, “we remain concerned at the potential for further unrest”.\nIt urged the authorities to adhere to the rule of law and human rights principles in managing the protests.\nIt also called for prompt and transparent investigations into human rights violations as well as the opening up of a forum for a long-term dialogue to address the concerns of the public."
  },
  {
    "headline": "Nigeria: Authentic Electoral Bill Report Not Altered, House Speaker Gbajabiamila Says",
    "summarized_story": "Speaker of Nigeria’s Parliament, Femi Gbajabiamila has dismissed reports that the leadership of the National Assembly altered the report on the Electoral Act (amendment) Bill 2020 that is still awaiting consideration by the Legislature.\nMr Gbajabiamila on Tuesday while reacting to the claims said the thought only existed in the “realm of speculation.”Gbajabiamila clarified that nothing had happened to the authentic report on the bill, adding that the House would pass it in the next few days.\nHowever, addressing a point of privilege raised on the floor on Tuesday on the allegation, the speaker said it was mere speculation and urged Nigerians to discountenance it.\nGbajabiamila expressed surprise that anyone would accuse the leadership of altering the report of a bill still in the custody of the Committee on Electoral Matters.\n“Only the authentic report of the committee will be submitted for consideration."
  },
  {
    "headline": "Seven Nigerians Jailed in First Togo Pirate Trial",
    "summarized_story": "Seven Nigerians have been sentenced to jail by a court in Lome, the Togolese capital for an attempt to hijack a ship in the country’s waters in May 2019.\nA total of 10 pirates, including seven Nigerians, two Togolese and one Ghanaian, were on trial for “maritime piracy, wilful violence and groups of criminals”.\nThe Ghanian, who is on the run and facing an international arrest warrant, was sentenced on Monday night to 20 years in prison.\nOne Togolese national was acquitted while the other eight pirates were given sentences from 12 to 15 years.\nThe Gulf of Guinea, which stretches along 5,700 kilometres of coastline, accounted for 130 of the 135 kidnappings of seafarers recorded worldwide last year, according to a recent report by the International Maritime Bureau."
  }
]