[
  {
    "headline": "PDP crisis deepens, Secondus pursues suit as party plans convention",
    "summarized_story": "On August 23, 2021, some interested members of the party had instituted a suit marked PHC/2183/CS/2021 at the High Court of Rivers State, Port Harcourt Judicial Division, with Secondus and the PDP as defendants.\nOn September 10, 2021, the court delivered its judgment and restrained Secondus from performing the functions of the national chairman of the PDP.\nHowever, the PDP has continued to insist that its convention will hold as scheduled, while also negotiating with Secondus to drop the suit.\nBut the National Publicity Secretary of the PDP, Kola Ologbondiyan, said the party’s plan to hold its national convention on October 30 and 31 was on course.\nAll the plans have been set out for the national convention.”Speaking on preparations for the national convention, he stated, “The preparation for the national convention is in place, and as far as the party is concerned, the dates for the convention remain October 30 and 31."
  },
  {
    "headline": "$148m consultants’ pay: Buhari, govs meet, Oct revenue sharing suspended",
    "summarized_story": "There were strong indications on Monday that state governors would soon meet with the President, Major General Muhammadu Buhari (retd.\nSome consultants claimed that a percentage of the refund as payment for services they said they rendered to the states and local government councils.\nOlofu disclosed that the commencement of deductions forced FAAC to suspend the revenue distribution for the month of October indefinitely.\nOlofu stated, “We went to the FAAC meeting for the month of October and noticed that the Paris Club deductions had commenced.\nIt is not at our level that the issue can be handled; we are only representing the governors at FAAC."
  },
  {
    "headline": "Pensioners plan legal action against South-West governors over increment",
    "summarized_story": "The Nigeria Union of Pensioners, South-West Zonal Council, says it will take legal action against the governors in the region over non-compliance with the constitutional provision on pension increment.\n“The South-West leadership of Nigeria Union of Pensioners, at its meeting at Ado-Ekiti on Sept. 16, 2021, observed that these provisions of the constitution have always been held in breach by governors in Nigeria.\n“This infraction has resulted in poverty, debilitating diseases and even deaths among scores of our pensioners,” the union said.\nIt said that only Lagos and Ondo State Governments in the South-West region had implemented the 33.4 per cent pension increase of 2010, while Oyo, Osun, Ekiti and Ogun had not.\n“Up till this moment, no action or word has come from the governors indicating that they want to implement the increase."
  },
  {
    "headline": "Physical activities reduce impact of COVID-19 on patients — Experts",
    "summarized_story": "By Chioma ObinnaHealth experts have said that physical activities could reduce the impact of COVID-19 infection on patients, even as they warned of an increasing Lung COVID-19 cases in Nigeria.\nThey maintained that physical activities were required right from prevention, onset of the disease to the management of the disease at the chronic stages.\nAccording to them, the debilitating lung COVID also known as Viral Post-COVID Syndrome which is gradually increasing in numbers in Nigeria, can be prevented with physical activities.\nSpeaking, the National President, ACAPN, Dr. Chris Okafor, noted that with adequate care and exercise, the rate of COVID-19 infection can be minimised by introduction of physical activities by physiotherapists.\n“And only physical activities an reduce the impact and prevent patient from having lung COVID or get into lung collapse.”Also, speaking, immediate past acting Vice Chancellor of the College of Medicine, University of Lagos, CMUL, Prof Folashade Ogunsola, decried the debilitating impact of lung COVID."
  },
  {
    "headline": "WHO, TransfatfreeNigeria coalition advocate gazette of Trans-fat Regulation",
    "summarized_story": "The coalition made the call at a briefing “No More Delay on Transfats Regulation” in Abuja to commemorate the World Food Day.\nThe coalition urged the Nigerian government to expedite actions to gazette the draft trans-fat regulation and its swift implementation to safeguard the lives of the citizens.\nWorld Food Day is celebrated yearly on October 16, to raise awareness about food security, sustainable food systems and healthy diets for all.\nThe World Food Day draws our attention and beams light on crucial issues that affect the food we eat.\nThe theme for World Food Day 2021 is “Our actions are our future."
  },
  {
    "headline": "Ronaldo ‘mocking’ Ole Gunnar Solskjaer after Liverpool mauling",
    "summarized_story": "Cristiano Ronaldo could be seen furiously ‘mocking’ someone, likely Ole Gunnar Solskjaer following one of Mo Salah’s goals in Liverpool’s demolition of Manchester United.\nThe Portuguese superstar cut a frustrated figure throughout Sunday’s match which saw his United side humiliated by fierce rivals Liverpool in a 5-0 rout.\nVideo footage has now emerged showing that following one of Salah’s strikes, five-time Ballon d’Or winner Ronaldo gesticulated in a mocking manner.\nIn response to Salah finding the net for Liverpool, Ronaldo could be seen standing with his shoulders slumped before flailing his arms around and furiously pointing in all directions.\nSome have speculated that the Portuguese winger may have been referring to his manager’s tactics after Ole Gunnar Solskjaer opted to press Jurgen Klopp’s side."
  },
  {
    "headline": "13,800 passports abandoned at Lagos offices",
    "summarized_story": "The Passport Controller, Lagos Passport Command, Mrs Milka Musa, Controller of Immigration, CIS, on Monday, said that about 13,800 passports remained uncollected at the Lagos Passport offices.\nMusa told newsmen in Lagos that about 12,300 were uncollected at Ikoyi passport office, while 1500 were at the Festac office, adding that a-yet-to-be ascertained number of passports, also remained uncollected at the Ikeja passport office.\nThe passport controller appealed to applicants, who had applied in any of the passport offices before September, to check their respective office of application for collection.\nREAD ALSO: Ikoyi Passport Office now works 7 days weekly says Control Officer“However, based on the volume of the uncollected passports, I believe the applicants had forgotten they applied for a passport.\n“The Nigerian Immigration Service, NIS, is appealing to these applicants to come and collect their passports,” she said."
  },
  {
    "headline": "Abolongo jailbreak: NSCDC arrests fleeing inmate [PHOTO]",
    "summarized_story": "Operatives of Oyo State command of Nigeria Security and Civil Defence Corps (NSCDC) have arrested one of the fleeing inmates who escaped from Abolongo correctional center.\nThe state command of NSCDC has however said that it has arrested one of the fleeing inmates.\nThe command noted that the inmate was recaptured at Kara Market, Oluwole area of Iseyin.\nafter interrogation and profiling, the suspect was taken to Correctional office at Agodi for confirmation.\n“Thereafter, proper handing over was done at NSCDC State command Headquarters Agodi Ibadan”."
  },
  {
    "headline": "Amnesty International condemns UAE arbitrary detention, deportation of Black Africans",
    "summarized_story": "Amnesty International (AI) has condemned the United Arab Emirates (UAE) treatment of Black Africans in strong terms.\nIn a statement, AI said on the night of June 22 and 25, police in Abu Dhabi broke into the homes of hundreds of migrant workers as they slept, targeting Black Africans in racially motivated arrests.\nAI noted that the arrests and subsequent interrogations presented a consistent pattern of racially motivated, arbitrary arrests followed by incommunicado detention for weeks on end in inhumane, overcrowded and unsanitary conditions, followed by arbitrary deportation.\nThe rights organizations stressed that racially driven raids and mass detentions are not in line with global agreement on human rights protection.\nAmnesty International added that all those interviewed described the same pattern of racial targeting in the apprehensions."
  },
  {
    "headline": "CBN releases guidelines for eNaira",
    "summarized_story": "“The eNaira stock wallet belongs solely to the CBN and it shall warehouse all minted eNaira” the guideline stated.\nIt said that financial institutions were expected to maintain one treasury eNaira wallet to warehouse eNaira received from the CBN eNaira stock wallet.\n“The eNaira branch subwallet shall be funded from the treasury eNaira wallet.\n“eNaira Merchant speed wallets shall be used solely for receiving and making eNaira payments for goods and services.\neNaira speed wallets shall be available for end users to transact on the eNaira platform.”To ensure security of funds, the enaira is expected to have two-factor authentication and other measures."
  },
  {
    "headline": "Anambra election: ‘IPOB is a big force, take Nnamdi Kanu seriously’ – Ifeanyi Ubah warns FG",
    "summarized_story": "The Senator representing Anambra South, Ifeanyi Ubah, has warned the federal government against underrating Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB).\nUbah also explained why he’s seeking a court order to visit the IPOB leader in DSS detention.\nThe proposed sit-at-home protest would affect the election in Anambra which is billed for November 6.\n“You must understand that Nnamdi Kanu has a lot of followers in the south-east.\nBecause the election is constitutional, and if really anybody loves our people, they shouldn’t be saying there’ll be no election."
  },
  {
    "headline": "Teachers protest at venue of NBA conference in Port Harcourt over unpaid salaries",
    "summarized_story": "Teachers of demonstration primary and secondary schools in Rivers State alongside the Rivers civil society organization on Monday, staged a protest at the venue of Nigeria Bar Association conference at the Yakubu Gowon Stadium in Port Harcourt.\nThe teachers are demanding the payment of their five years salaries.\nThe attendance of the Rivers State Governor Nyesom Wike at the event may have prompted the teachers to stage the protest at the NBA conference venue.\nSome of the aggrieved teachers regretted that the state government has ignored their plights despite a series of protests over the issue.\nAccording to him “the office of the Rivers State Governor is a creation of law and if a court of competent jurisdiction has given an order, for goodness sake everybody must obey."
  },
  {
    "headline": "PDP flays Gombe over N100 billion loan",
    "summarized_story": "The Gombe State People’s Democratic Party (PDP) has faulted the borrowing of N100 billion by the state government, describing it as a bad omen for All Progressive Congress (APC)- led administration of Governor Inuwa Yahaya.\n- Advertisement -According to Kwaskebe, the Yahaya-led administration has already heaped over N100 billion debt on the state in less than three years of its holding forth.\nKwaskebe said the way and manner the APC administration is carelessly acquiring debts will gravely endangers the future of the state.\n- Advertisement -- Advertisement -The PDP Chairman vowed that the opposition party and the people of Gombe State would not fold their arms, watching the APC administration mortgaging the future of the state without commensurate achievements.\nBut, the Director General, Press Affairs to Governor Yahaya said there was nothing wrong in obtaining loan, especially if such loan is budgeted for and tied to a project."
  },
  {
    "headline": "PDP deputy chair: Governors reject Oyinlola’s bid",
    "summarized_story": "Peoples Democratic Party (PDP) governors may have rejected the ambition of former Osun State Governor Olagunsoye Oyinlola to serve as the next deputy national chairman (South) of the opposition party, it was learnt yesterday.\nThe governors have resolved to back the National Vice Chairman (Southwest), Alhaji Taofeek Arapaja, who is eyeing the slot, a source said.\nThe Deputy National Chairman (South) has been micro-zoned to the Southwest, which only produced the lone PDP governor, Seyi Makinde, during the 2019 elections.\nIf he steps down, the Deputy National Chairman (South) may automatically succeed him as national chairman.\n“The current PDP leaders are also looking at discipline."
  },
  {
    "headline": "Tiwa Savage should’ve sold sex tape to porn company – Dencia",
    "summarized_story": "Cameroonian-born singer Reprudencia Sonkey aka Dencia has opened up on Tiwa Savage’s leaked sex tape.\nDencia argued the pop star with her PR team and blackmailer weren’t smart enough in the way they handled the leaked sex tape.\n- Advertisement -She argued they are at the losing end because the sex tape has gone viral and free for all to watch.\n- Advertisement -“Tiwa Savage and her blackmailer weren’t smart biz people.\nHer body her choice, should have sold the tape herself to a Porn company or blackmailer should have sold it too."
  },
  {
    "headline": "Pupils battery: Committee recommends regulation of Islamic schools",
    "summarized_story": "The 11-person committee set up by the Kwara State Government to investigate the corporal punishment meted to some Arabic students in Ganmo, Irepodun local government area of the state has recommended the regulation of Arabic and Islamic schools in the State.\nThe committee urged Government to immediately set up the Arabic board in the State.\n- Advertisement -Chairman of the committee and former Grand Kadi of the state Justice Idris Haroon said this on Monday while presenting the report to Governor AbdulRaman Abdulrazaq in Ilorin, the state capital.\n“One of the most important recommendations which the committee wants Your Excellency to pay attention to is the reconstitution of the Arabic Education Board as the immediate solution to most of the problems confronting Arabic Schools in the state,” he said.\n- Advertisement -He said the government will study and implement the report for the benefits of the society, including the setting up of the Arabic Board."
  },
  {
    "headline": "Niger: Gunmen kill 18 in mosque, abduct 7 others",
    "summarized_story": "From John Adams, MinnaGunmen have killed no fewer than 18 people at a Mazakuka mosque in Mashegu Local Government Council, Niger State.\nThe gunmen were said to have stormed the mosque in the early hours of Monday when the victims were performing their early morning prayers (Subhi), attacking and killing 18 on the spot after shooting indiscriminately at them.\nThe attackers were also said to have used other dangerous weapons, including machetes and sharp objects, on their victims.\nThe gunmen invaded the community in motorcycles and made their way straight to the mosque where the people had gathered for prayers, the report said.\nThere was pandemonium in the community as people scrambled for their safety as the gunmen unleashed terror on their victims."
  },
  {
    "headline": "33 banks, 2,000 customers onboarded, N500m minted as Buhari unveils eNaira",
    "summarized_story": "From Uche Usim Abuja and Juliana Taiwo-Obalonye, AbujaBarely hours after the long-awaited Central Bank Digital Currency (CBDC) also called eNaira was unveiled by President Muhammadu Buhari at the Presidential villa, Abuja, 33 banks have been fully integrated on the eNaira platform, just as 2,000 customers have been onboarded and 120 merchants registered on the portal.\nAlready, N500 million has been successfully minted by the apex bank and N200 million issued to financial institutions.\nThis, in my view, is the best and most sustainable way to address the Naira’s value – whether in hard currency or digital eNaira – through production, production and more production”, Emefiele explained.\nThe President added that a handful of countries including China, Bahamas, and Cambodia have already issued their own Central Bank Digital Currencies (or CBDCs).\n“It is on the basis of this that the Central Bank of Nigeria (CBN) sought and received my approval to explore issuing Nigeria’s own Central Bank Digital Currency, named the eNaira."
  },
  {
    "headline": "Jail attacks: FG talks tough, says enough is enough",
    "summarized_story": "From Oluseye Ojo, IbadanThe Federal Government, yesterday, warned it would no longer tolorate the attacks on custodial facilities across the country saying enough is enough.\nThe warning came against the backdrop of last Friday’s attack on the Medium Security Custodial Centre in Abolongo, Oyo State and previous attacks on custodial faciliteis in Owerri, Benin and Kabba in Imo, Edo and Kogi states respectively.\nMinister of Interior, Rauf Aregbesola, who deplored the attacks when he visited the Abolongo custodial centre, yesterday, said they were not just random happenings but premeditated, planned and coordinated crimes designed to make Nigeria unsafe and ridicule the government.\nGovernor Seyi Makinde of Oyo State; Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III and 5the state Commissioner of Police, Ngozi Onadeko had also visited the facility.\nHe said the suspected serial killer of Akinyele Local Government Area of the state, Sunday Sodipe was not also held at the facility."
  },
  {
    "headline": "Nnamdi Kanu: We’re taking steps to secure consular access –UK",
    "summarized_story": "But the British High Commission, Abuja, however, said it was taking steps to secure consular access to Kanu.\nHead of Communications, British High Commission, Abuja, Dean Hurlock, disclosed the development to Daily Sun in Abuja.\nResponding to Daily Sun’s enquiry regarding the ongoing trial of Kanu, he said the UK government does not comment on ongoing legal proceedings.\nHurlock further said the British High Commission was in contact with the Federal Government, Kanu’s family and his legal team.\nWe are taking steps to secure consular access.”Kanu was extradited to the country on June 27 in continuation of his trial at an Abuja High Court."
  },
  {
    "headline": "Rescuing Nigeria from abandoned road projects",
    "summarized_story": "Dilapidated and abandoned, the crater-infested federal roads litter every region of Nigeria.\nBesides, Kabir said the Federal Ministry of Works and Housing allocated only N280 billion to road infrastructure in the 2022 budget.\nMost times, a road contractor contends with party patronage, bribing ministry officials and settling communities before embarking on road projects.\nRecently, the Federal Road Safety Commission (FRSC) said 5,320 road crashes and 2,471 deaths were recorded nationwide between January and June 2021 alone.\nNiger State’s 2,263km of federal roads is the longest of the national federal road network of 36,000km."
  },
  {
    "headline": "Buhari Swears in Two INEC National Commissioners",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has sworn in two National Commissioners of the Independent National Electoral Commission (INEC).\nThe swearing-in took place on Monday at the Conference Hall of the First Lady’s office at the State House, Abuja, before the official launch of the eNaira and 2022 Armed Forces Remembrance Day emblem.\nThe new National Commissioners are Prof. Muhammad Sani Kallah (Katsina State) and Prof. Kunle Cornelius Ajayi (Ekiti State).\nThe duo are part of the six INEC commissioners cleared by the Senate in July this year.\nPresident Buhari had on September 15, 2021, sworn in three of the cleared National Commissioners."
  },
  {
    "headline": "Buhari: Peace Now Returning to Troubled Areas in Nigeria",
    "summarized_story": "Wants Nigerians to celebrate gallantry of nation’s troopsBy Deji ElumoyePresident Muhammadu Buhari has disclosed that peace has started to return to troubled areas which in the past faced terrorism and banditry attacks across the country.\n”The exploits of our Armed Forces to maintain peace as well as their disposition to the unity of Nigeria have contributed in no small measure to our stability.\nOur faith in our Armed Forces remains unshaken and as a government we will do all within our powers to ensure that our Armed Forces are motivated to perform optimally.\n“The same call goes to all visitors and friends of Nigeria as well as corporate bodies operating in Nigeria,” he said.\n”I have the pleasure to acknowledge the contributions of retired officers and men of the Nigerian Armed Forces to the ongoing war on insurgency."
  },
  {
    "headline": "Breaking: Gunmen Kill Worshipers in Niger Mosque",
    "summarized_story": "By Laleye DipoAbout 18 worshipers have been killed by armed gunmen in Mashegu town of Mashegu local government area of Niger state.\nThe gunmen reportedly rounded up the worshipers who assembled for the 5.30am prayer on Monday killing them in cold blood.\nThe attackers who stormed the mosque shot sporadically at their victims, leaving several of them injured.\nWhen contacted, the Niger State Police Commissioner Mr Monday Bala Kuyars confirmed the incident, which he described as sad and unfortunate.\nHe said reinforcement of armed security men had been dispatched to the area to restore law and order."
  },
  {
    "headline": "Buhari: With Digital Currency, Nigeria’s GDP Projected to Rise by $29bn in 10 Years",
    "summarized_story": "The President, who spoke at the State House, Abuja at the official launch of Nigeria’s Digital Currency, the eNaira, emphasised that apart from digital innovations, Central Bank Digital Currencies (CBDCs) can foster economic growth through better economic activities.\nWhile expressing delight to launch the Central Bank of Nigeria Digital Currency, called the eNaira, President Buhari added that “we have become the first country in Africa, and one of the first in the world to introduce a Digital Currency to her citizens”.\nThe President, who assured Nigerians of the safety and scalability of the CBDC system, said the journey to create a digital currency for Nigeria began sometime in 2017.\nPresident Buhari also explained why he approved the use of the digital currency sayingin recent times, the use of physical cash in conducting business and making payments has been on the decline.\n”It is on the basis of this that the Central Bank of Nigeria (CBN) sought and received my approval to explore issuing Nigeria’s own Central Bank Digital Currency, named the eNaira,’’ he said."
  },
  {
    "headline": "Sudan’s PM, Other Civilian Leaders Arrested Amid Coup Reports",
    "summarized_story": "Members of Sudan’s transitional government and other civilian leaders have been arrested amid reports of a military coup.\nPrime Minister Abdallah Hamdok is among those reported to have been put under house arrest by unidentified soldiers.\nMilitary and civilian leaders have been at odds since long-time ruler Omar al-Bashir was overthrown two years ago and the transitional government set up.\nThe UK’s special envoy for Sudan and South Sudan, Robert Fairweather, tweeted that military arrests of civilian leaders would be “a betrayal of the revolution, the transition and the Sudanese people”.\nSudan’s main pro-democracy group has called on its supporters to resist any military coup."
  },
  {
    "headline": "EXCLUSIVE: Fresh Law Suits Loom For Nigerian Billionaire, Michael Adenuga After Refusing To Pay Multi-million Dollar Companies’ Debts",
    "summarized_story": "With this personal fortune, Adenuga Jr is very unlikely to be hurting for cash.\nIn 2016, ConOil was pursued by creditors for a debt of over $140.5 million owed to two foreign companies and one local company.\nIt also mentioned that it will seek court orders to seize assets including corporate and private bank accounts.\nIn September, Nigeria’s tax authority FIRs sealed off the offices of ConOil at the Mid Adenuga Towers building over non-payment of taxes.\nSee Also Sports How Otunba Mike Adenuga Impoverished Conoil PensionersLittle has happened since then to restore the confidence of the regulators or international partners in ConOil and Adenuga."
  },
  {
    "headline": "EXCLUSIVE: Fresh Law Suits Loom For Nigerian Billionaire, Michael Adenuga After Refusing To Pay Multi-million Dollar Companies’ Debts",
    "summarized_story": "With this personal fortune, Adenuga Jr is very unlikely to be hurting for cash.\nIn 2016, ConOil was pursued by creditors for a debt of over $140.5 million owed to two foreign companies and one local company.\nIt also mentioned that it will seek court orders to seize assets including corporate and private bank accounts.\nIn September, Nigeria’s tax authority FIRs sealed off the offices of ConOil at the Mid Adenuga Towers building over non-payment of taxes.\nSee Also Sports How Otunba Mike Adenuga Impoverished Conoil PensionersLittle has happened since then to restore the confidence of the regulators or international partners in ConOil and Adenuga."
  },
  {
    "headline": "EXCLUSIVE Boko Haram Terrorists Kill Six Soldiers, Injure Army General, Capture Military Vehicles, Arms In Borno",
    "summarized_story": "A source said about six Nigerian soldiers were killed, while others including the Brigadier General in-charge of the camp, were injured.\nThe attack comes a few weeks after the insurgents killed over 25 soldiers who were also on patrol in Monguno area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nAt least 33 soldiers were killed early in the year when two vehicles loaded with explosives rammed into a military convoy in Wulgo.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents."
  },
  {
    "headline": "EXCLUSIVE Boko Haram Terrorists Kill Six Soldiers, Injure Army General, Capture Military Vehicles, Arms In Borno",
    "summarized_story": "A source said about six Nigerian soldiers were killed, while others including the Brigadier General in-charge of the camp, were injured.\nThe attack comes a few weeks after the insurgents killed over 25 soldiers who were also on patrol in Monguno area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nAt least 33 soldiers were killed early in the year when two vehicles loaded with explosives rammed into a military convoy in Wulgo.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents."
  },
  {
    "headline": "EXCLUSIVE: Buhari To Visit Saudi Arabia, Europe On Tuesday To Attend Lesser Hajj, Undergo Medical Checkup",
    "summarized_story": "President Muhammadu Buhari will on Tuesday leave the country for Saudi Arabia and later proceed to France and Scotland where he is expected to begin a fresh round of medical checkup, SaharaReporters has learnt.\nSaharaReporters gathered that Buhari will spend up to two weeks on his medical tour but his first point of call is Saudi Arabia for Umrah, otherwise known as the Lesser Hajj.\nFile Photo: Buhari medical tourismSaharaReporters learnt that the President after performing the Umrah will then go to Europe for his medical examinations.\n“Baba (Buhari) is going to Saudi Arabia, France and Glasgow from Tuesday.\nThe trip will not exceed two weeks but the first stop is Saudi Arabia."
  },
  {
    "headline": "PDP acting chairman: Zoning not Nigeria's problem — we need president who can tackle hunger",
    "summarized_story": "Yemi Akinwonmi, acting national chairman of the Peoples Democratic Party (PDP), says zoning the presidency is not Nigeria’s current problem.\nAdvertisementOver the past few months, the debate on the zoning of the presidency ahead of the 2023 elections has heightened, especially among political party stakeholders.\nSpeaking on Monday in an interview on Channels Television, Akinwonmi said Nigeria needs a president who will show commitment to tackling the country’s problems.\n“Zoning is not the problem of Nigeria, particularly at this hour of the day.\nYou remember that in Nigerian history, there was a zoning that gave Muslim-Muslim ticket and we all unanimously voted for that."
  },
  {
    "headline": "PDP acting chairman: Zoning not Nigeria's problem — we need president who can tackle hunger",
    "summarized_story": "Yemi Akinwonmi, acting national chairman of the Peoples Democratic Party (PDP), says zoning the presidency is not Nigeria’s current problem.\nAdvertisementOver the past few months, the debate on the zoning of the presidency ahead of the 2023 elections has heightened, especially among political party stakeholders.\nSpeaking on Monday in an interview on Channels Television, Akinwonmi said Nigeria needs a president who will show commitment to tackling the country’s problems.\n“Zoning is not the problem of Nigeria, particularly at this hour of the day.\nYou remember that in Nigerian history, there was a zoning that gave Muslim-Muslim ticket and we all unanimously voted for that."
  },
  {
    "headline": "CBN launches new policy to financially support 100 companies every 100 days",
    "summarized_story": "The Central Bank of Nigeria (CBN) has launched a new policy to financially support 100 targeted private sector companies in 100 days.\nAdvertisementGodwin Emefiele, CBN governor, said this on Monday in Abuja during the launching of the eNaira project.\nThe financial instrument titled “The 100 for 100 PPP – Policy on Production and Productivity,” Emefiele said the CBN would advertise, screen, scrutinise and financially support 100 targeted private sector companies in 100 days, beginning from 01 November 2021.\nAdvertisement“Under this policy, the CBN will advertise, screen, scrutinise and financially support 100 targeted private sector companies in 100 days, beginning from 01 November 2021, and rolling over every 100 days with new set of 100 companies, whose names will be published in National Dailies for Nigerians to verify and confirm.”Emefiele further stated that the apex bank would work with banks to deliver the financial instrument to customers to boost production and productivity.\nAdvertisement“This, in my view, is the best and most sustainable way to address the Naira’s value – whether in hard currency or digital eNaira – through production, production and more production.”The CBN governor assured Nigerians that there is no cause for alarm over foreign exchange reserves."
  },
  {
    "headline": "CBN launches new policy to financially support 100 companies every 100 days",
    "summarized_story": "The Central Bank of Nigeria (CBN) has launched a new policy to financially support 100 targeted private sector companies in 100 days.\nAdvertisementGodwin Emefiele, CBN governor, said this on Monday in Abuja during the launching of the eNaira project.\nThe financial instrument titled “The 100 for 100 PPP – Policy on Production and Productivity,” Emefiele said the CBN would advertise, screen, scrutinise and financially support 100 targeted private sector companies in 100 days, beginning from 01 November 2021.\nAdvertisement“Under this policy, the CBN will advertise, screen, scrutinise and financially support 100 targeted private sector companies in 100 days, beginning from 01 November 2021, and rolling over every 100 days with new set of 100 companies, whose names will be published in National Dailies for Nigerians to verify and confirm.”Emefiele further stated that the apex bank would work with banks to deliver the financial instrument to customers to boost production and productivity.\nAdvertisement“This, in my view, is the best and most sustainable way to address the Naira’s value – whether in hard currency or digital eNaira – through production, production and more production.”The CBN governor assured Nigerians that there is no cause for alarm over foreign exchange reserves."
  },
  {
    "headline": "NLC president: Nigeria's asset management system is rotten",
    "summarized_story": "Ayuba Wabba, president of the Nigerian Labour Congress (NLC) says the system of managing assets in Nigeria is “rotten”.\nAll the reforms are anchored around government facilities — the airways and the power sector.\nThey (Ethiopia) taxed each Ethiopian and they were able to raise money over what they needed to build the power sector.\nNow, they have built the power sector, they are selling to neighbouring countries.\nNot to say that a public system cannot run effectively."
  },
  {
    "headline": "How Koa is helping Kenyans build and manage wealth",
    "summarized_story": "After doing that for a while, she joined MEST Africa.\nAfter leaving MEST Africa, the duo forayed into different businesses but kept in touch and would always meet up whenever they were in the same city.\nSo, Koa is killing two birds with one stone by holding its users’ money in a money market through a partnership with Britam, an asset manager in the Kenyan market.\nOn Koa, users earn up to 10% interest on their money annually, depending on market conditions.\nSo are Koa users aware that their money is being invested in a money market?"
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "eNaira launch: CBN highlights relief funds, cross-border payments, and unknown risks",
    "summarized_story": "According to the design paper, one of the benefits of the eNaira is the possibility of direct welfare disbursement to citizens.\nThe design paper says that the eNaira will speed up cross-border payments but doesn’t state how fast it will be.\nThis will be possible because of the eNaira’s interoperability, one of the design elements mentioned in the design paper.\nAdvertisementIn a recent article, we explored how private or permissioned blockchains, such as the Hyperledger Fabric being used by the CBN, work and the amount of control it gives it.\nMeanwhile, the eNaira website indicates that the speed wallet app that will facilitate eNaira transactions is available for download."
  },
  {
    "headline": "How to support us",
    "summarized_story": "Shut Techpoint Africa upWhat would a day in the African tech space be like without Techpoint Africa?\nWell, it is not lost on us that there are a number of anti-Techpointers who really wish we would stop existing.\nIn the famous words of Pablo Escobar, “Everyone has a price, the important thing is to find out what it is.” He was right; ours is ₦10,000,000/$20,000 per day.\nYes, for just ₦10,000,000 or $20,000, you can shut down the Techpoint Africa website for one day of your choosing.\nThat is 24 full hours without one Techpoint Africa publication, be it an article, newsletter or social media post."
  },
  {
    "headline": "eNaira launches today, What stuttering truly is, crypto thefts in 2020",
    "summarized_story": "Share this article:Good day,Today I’m discussing:International Stuttering Awareness DayeNaira’s launch todayCrypto thefts in 2020eNaira launches at lastFollowing a false start at the beginning of the month, The Nigerian government is set to launch Nigeria’s central bank digital currency, the eNaira, today, Monday, October 25, 2021.\nWhat stuttering truly isSeveral myths about stuttering exist across the world.\nOur Sub-editor, Precious Mogoli — after a long hiatus from the writing world — put finger to keyboard to help spark awareness about stuttering.\nYou’ll find it here: Technology is awesome, but it’s yet to conquer stutteringTop 10 crypto thefts in 2020In recent times, crypto adoption in Africa has increased.\nCryptocurrency crime is a concern for Africans, especially with countries like Nigeria, Togo, South Africa, Tanzania, and Ghana among the top 20 countries in the 2021 Global Cryptocurrency Adoption IndexContained in the infograph above are the top 10 cryptocurrency thefts of 2020."
  },
  {
    "headline": "IHS Towers: How a bad bet on GSM became a $7bn company",
    "summarized_story": "Darwish, 27 years old at the time, and his company Motophone were again shortlisted among the seven contenders for the new licensing regime.\nThe making of IHS TowersPrior to the emergence of IHS Towers, telecoms services in Nigeria under NITEL had suffered due to scarcity of base stations.\nRunning IHS TowersIn the beginning, IHS Towers was building towers from scratch and operating them for telecom operators.\nIn 2014, IHS acquired a total of 10,966 towers out of which 4,154 came from MTN Nigeria and 2,116 towers from 9Mobile.\n“We’re pleased with the successful listing of IHS Towers, the fourth largest tower company globally."
  },
  {
    "headline": "IHS Towers: How a bad bet on GSM became a $7bn company",
    "summarized_story": "Darwish, 27 years old at the time, and his company Motophone were again shortlisted among the seven contenders for the new licensing regime.\nThe making of IHS TowersPrior to the emergence of IHS Towers, telecoms services in Nigeria under NITEL had suffered due to scarcity of base stations.\nRunning IHS TowersIn the beginning, IHS Towers was building towers from scratch and operating them for telecom operators.\nIn 2014, IHS acquired a total of 10,966 towers out of which 4,154 came from MTN Nigeria and 2,116 towers from 9Mobile.\n“We’re pleased with the successful listing of IHS Towers, the fourth largest tower company globally."
  },
  {
    "headline": "The business case for telecom towers",
    "summarized_story": "The horizons of Nigeria’s towns and villages have transformed dramatically over the past 20 years with the appearance and expansion of telecom towers; 30 to 70-meter-high structures that inundate peaks and heights across the country.\nThe record growth of the Nigerian telecom industry cannot be divorced from a robust telecom tower infrastructure which has played a pivotal role in bridging the digital divide and facilitating pervasive mobile connectivity.\nShavik Ghosh, writing for the ‘Mint’ noted, “…telecom towers are a lot like real estate, everything depends on the location.\nFounded in Nigeria in 2001, IHS Towers’ business model is relatively straightforward: The company buys mobile towers from telecom companies, or builds them itself, then leases them back to the operators.\nTo expedite the creation of robust telecom infrastructure and to fulfil, it is important that ease of doing business is treated as a priority."
  },
  {
    "headline": "Obaseki education reforms get kudos, as Sanwo-Olu commends, urges states to embrace EdoBEST – Nigerian Observer",
    "summarized_story": "Hailing Obaseki for the ingenuity of starting EdoBEST, Sanwo-Olu described the programme as a model for across-the-board basic education reform.\n“I usually concede and acknowledge Governor Obaseki because I copied something from him,” Governor Sanwo-Olu said at the recently concluded Ekiti State Fountain Summit, while speaking about EdoBEST.\nWe’ve copied that (EdoBEST) from Edo and it is working well in Lagos and we will scale it up,” Governor Sanwo-Olu said.\nOn his part, Obaseki stated, “Education is the foundation in which every other thing rests particularly the use of ICT.\nFor the future, we need to see how we now use technology to recast basic education."
  },
  {
    "headline": "Obaseki Health Reforms: Nursing, Midwifery Council accredits Edo College of Nursing SciencesNursing, Midwifery Council accredits Edo College of Nursing Sciences – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nursing and Midwifery Council of Nigeria (NMCN) has approved the establishment of the Edo State College of Nursing Sciences, Benin City to commence the training of nurses and midwives in the state from October 2021.\nThe approval followed the weekend visit of the NMCN accreditation team to the remodeled state-owned tertiary institution, which had lost its accreditation since 2012.\nThe letter reads: “the Board of the Nursing and Midwifery Council of Nigeria pursuant to Section 14 (Sub-section 1 and 2) of the Act 143, Laws of the Federal Republic of Nigeria (2004), has approved the establishment of the Edo State College of Nursing Sciences, Benin City, Edo State.\n“In the light of that, I wish to convey the Board’s approval to commence training of Nurses and Midwives at the Edo State College of Nursing Sciences, Benin City, Edo State.\nThe approvals are as follows:“General Nursing Programme-Provisional Accreditation Status of one hundred (100) Students’ intake with effect from October 2021."
  },
  {
    "headline": "Obaseki assures of sustained reforms, policies to guarantee sustainable devt in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his administration will sustain policies and programmes to guarantee the growth and development of the state, ensuring better livelihoods for Edo citizens.\nObaseki gave the assurance when he received the executive members of the Nigerian Veterinary Medical Association (NVMA), led by its Chairman, Dr. Ibrahim Ado, who were on a courtesy visit at the Government House, Benin City.\nObaseki said, “Growing up in Benin City, the veterinary clinic was a place to visit to see veterinary doctors treat animals.\nWe thank God for an association like yours, which is on the ground to change the narrative.\nVeterinary services are needed; it is a means for generating income for Edo State, as we work to increase our Internally Generated Revenue (IGR).”He added, “We have embarked on a lot of reforms in the state."
  },
  {
    "headline": "Oba Ewuare II Commends President Buhari On Reparation Of Benin Artefacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Benin Monarch, His Royal Majesty ,Omo N Oba N’Edo Uku Akpolokpolo Ewuare II has appreciated President Mohammed Buhari on his efforts and support in the reparation of the Benin artefacts.\nOba Ewuare II in the same vien appreciated the Minister of Information and Culture Alhaji Lai Mohammed, the DG of National Commission for Museum and Monuments as well as all well meaning Nigerians for their efforts and support in the reparation of the Benin artefacts.\nThe Oba made the appreciation when the founder of DAAR Communications, Chief Executive Officer of Raypower and African Independents Television (AIT) High Chief Raymond Dokpesi paid him a courtesy visit at the Palace recently.\nThe Oba then prayed to God and ancestors to continue to protect high Chief Dokpesi and family out of harms way.\nThe highpoint of the visit was a special presentation of the Red Book to the founder of DAAR Communication by the Oba."
  },
  {
    "headline": "Why FG abandoned PPP arrangements on Second Niger Bridge, Lagos-Ibadan expressway – Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has said the current administration abandoned the Public Private Partnership (PPP) on major infrastructure projects, including the Second Niger Bridge, and the Lagos-Ibadan expressway because investors could not secure needed funding from banks.\nMr Fashola, a former Lagos State governor, called for the audit of the existing concession agreements between the federal government and investors.\nThis disclosure by Mr Fashola is coming in the wake of the planned concessioning of major highways in the country.\nThe second Niger bridge was conceived as a PPP.\nThe Lagos-Ibadan expressway in 2006 and the second Niger bridge in 2010, nothing significantly happened on those projects until 2016."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Tesla momentarily hits $1 trillion market cap after Hertz says it will buy 100,000 electric vehicles",
    "summarized_story": "Electric car maker, Tesla briefly hit a $1 trillion market cap on Monday following news that Hertz is ordering 100,000 vehicles to build out its electric vehicle rental fleet by the end of 2022.\nNews of the deal brought Tesla’s stock to more than $998 midday, a new record-high one trading day after shares hit $900.\nThe deal, which will bring in a reported $4.2 billion for Tesla, is the largest ever purchase of electric vehicles, CNBC quoted Bloomberg to have said in a report.\nThe deal comes more than a year after Hertz filed for bankruptcy protection during the height of the pandemic, as demand for travel and rental vehicles waned.\nThis year, investors from Knighthead Capital Management and Certares Management said they would take over the company."
  },
  {
    "headline": "E-naira may add $29bn to Nigeria’s GDP ― Buhari",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has expressed optimism that the adoption of the Central Bank Digital Currency (CBDC) and its underlying blockchain technology, can increase Nigeria’s GDP by $29 billion over the next 10 years.\nPresident Buhari, who assured Nigerians of the safety and scalability of the CBDC system, said the journey to create a digital currency for Nigeria began sometime in 2017.\nWhile explaining how he approved the use of digital currency, President Buhari stated: ”In recent times, the use of physical cash in conducting business and making payments has been on the decline.\n“It is on the basis of this that the Central Bank of Nigeria (CBN) sought and received my approval to explore issuing Nigeria’s own Central Bank Digital Currency, named the e-Naira,’’ he said.\nIn his remarks, the CBN Governor explained that e-Naira is Nigeria’s CBDC and it is the digital equivalent of the physical Naira."
  },
  {
    "headline": "Anambra 2021: APGA battles to save Ojukwu’s legacy",
    "summarized_story": "It’s a possibility not lost on the APGA candidate, Soludo himself.\nIndeed, for many, a free and fair contest will largely be a two-horse race between APGA and the PDP.\n“If there is an election, APGA or PDP will win.\nWith Ojukwu, APGA, in many people’s reckoning, filled a void in the Igbo political consciousness which the PDP despite being the dominant political party in the Igbo country, could not fill.\n“Don’t forget that after I produced Chief Odumegwu Ojukwu as presidential candidate, APGA never produced any other presidential candidate of Igbo extraction from that time till now."
  },
  {
    "headline": "First Bank: Billionaires scramble for the honey pot",
    "summarized_story": "BY EMEKA EJEREThe board of FBN Holdings Plc (FBNH) may soon witness an adjustment to reflect a major change in the ownership structure of the holding company for First Bank of Nigeria Limited (FBN).\nIt had said, “The attention of FBN Holdings Plc has been drawn to media reports today (Friday) that a certain individual has acquired significant shareholding interest in FBN Holdings Plc.\n“As a listed company, the shares of FBN Holdings are publicly traded, and sale and acquisition of shares is expected in the normal course of business.\nAccording to the 2020 FY report of the bank, 40 shareholders owned 31.03% of the bank while no individual shareholder held more than 5% of the bank.\n“He wasted no time in taking advantage of the leadership crisis that rocked First Bank not too long ago leading to the Central Bank of Nigeria sacking both the chairman of the bank, Ibukun Awosika and Obafemi Otudeko, the chairman of FBN Holdings."
  },
  {
    "headline": "Nigeria Ready To Recoup Over N600bn Spent On Medical Tourism Annually, Says Vice President",
    "summarized_story": "With the newly built 100-suits state-of-the-art health facility, Duchess International Hospital in Lagos state, Nigeria, the vice president of Nigeria, Prof. Yemi Osinbajo said it will help the country recoup the over N600 billion spent on medical tourism annually.\nRather than travel abroad for medical healthcare, Osinbajo urged Nigerians seeking quality care to visit the Duchess International Hospital, as it is affordable.\nThe chief executive officer, Duchess International Hospital, Dr. Adetokunbo Shitta-Bey said the Duchess International Hospital was put in place to reverse medical tourism.\nADVERTISEMENT“For us to build that trust in the Nigerian healthcare system, the Duchess International Hospital was set up.\nGovernor of Lagos state, Babajide Sanwo-Olu while commending the Reddington Hospital Group, said he is excited that the Duchess International Hospital is domiciled in Lagos which increases access to care in the state."
  },
  {
    "headline": "Nigeria Ready To Recoup Over N600bn Spent On Medical Tourism Annually, Says Vice President",
    "summarized_story": "With the newly built 100-suits state-of-the-art health facility, Duchess International Hospital in Lagos state, Nigeria, the vice president of Nigeria, Prof. Yemi Osinbajo said it will help the country recoup the over N600 billion spent on medical tourism annually.\nRather than travel abroad for medical healthcare, Osinbajo urged Nigerians seeking quality care to visit the Duchess International Hospital, as it is affordable.\nThe chief executive officer, Duchess International Hospital, Dr. Adetokunbo Shitta-Bey said the Duchess International Hospital was put in place to reverse medical tourism.\nADVERTISEMENT“For us to build that trust in the Nigerian healthcare system, the Duchess International Hospital was set up.\nGovernor of Lagos state, Babajide Sanwo-Olu while commending the Reddington Hospital Group, said he is excited that the Duchess International Hospital is domiciled in Lagos which increases access to care in the state."
  },
  {
    "headline": "JUST-IN: Gunmen Attack Mosque, Kill 18 Worshipers In Niger",
    "summarized_story": "Gunmen have allegedly attacked a mosque in Maza-Kuka village in Mashegu local government area of Niger State, killing 18 worshipers.\nSecretary to the Niger State government, Ahmed Ibrahim-Matane, confirmed the attack.\nHe said that 16 people were killed in the mosque while one other was killed at Kaboji village by the gunmen.\nThe chairman of Mashegu local government area, Alhassan Isa Maza-Kuka, also confirmed the incident, describing it as very devastating one.\nADVERTISEMENTHe said that the attack was uncalled for especially as the people were in the mosque for prayers."
  },
  {
    "headline": "JUST-IN: Gunmen Attack Mosque, Kill 18 Worshipers In Niger",
    "summarized_story": "Gunmen have allegedly attacked a mosque in Maza-Kuka village in Mashegu local government area of Niger State, killing 18 worshipers.\nSecretary to the Niger State government, Ahmed Ibrahim-Matane, confirmed the attack.\nHe said that 16 people were killed in the mosque while one other was killed at Kaboji village by the gunmen.\nThe chairman of Mashegu local government area, Alhassan Isa Maza-Kuka, also confirmed the incident, describing it as very devastating one.\nADVERTISEMENTHe said that the attack was uncalled for especially as the people were in the mosque for prayers."
  },
  {
    "headline": "JAMB Registrar, INEC Commissioner Seek More Space For Women In Govt",
    "summarized_story": "Registrar, Joint Admissions and Matriculation Board (JAMB), Prof Is-haq Oloyede and the Independent National Electoral Commission (INEC) Resident Electoral Commissioner (REC), Kwara State, Alh Attahiru Madami, have made case for more space for women participation in the Nigerian polity.\nThe lecture is entitled, “Patriarchy and Female Participation in Politics in Nigeria.”The INEC commissioner urged all political parties in the country toreview their constitutions to allow 30 per cent women participation inelective positions.\nFor his part, the JAMB registrar, Prof. Oloyede said: “The adoption of gender politics by the governmentshould encourage more women participation in politics.\n“Creating more room for women participation in politics requireslegal, social and political intervention.\nSocially, there may be need for men to be more receptive to the ideaof women attending political meetings especially those that hold inthe day."
  },
  {
    "headline": "Gunmen kill many worshipers at Niger mosque, abduct seven others",
    "summarized_story": "Gunmen kill many worshipers at Niger mosque, abduct seven othersGunmen kill many worshipers at Niger mosque, abduct seven othersThe Police Command in Niger said gunmen had killed an unspecified number of people while observing early morning prayers at a Mosque at Mazakuka village in Mashegu Local Government Area of the state.\nThe Commissioner of Police in the state,Mr Monday Kuryas, who disclosed this to Newsmen in Minna on Monday, said the hoodlums also abducted seven other worshipers at the mosque.\nKuryas said the incident occurred on Oct. 25 at about 0530 hours when the gunmen attacked the village.\nHe said the gunmen later destroyed property worth millions of Naira belonging to one Alhaji Abubakar Maigandus in the village.\nHe said that already additional armed security personnel had since been deployed to the area to ensure the arrest of the gunmen and all other miscreants undermining the peaceful coexistence among residents."
  },
  {
    "headline": "Gunmen kill many worshipers at Niger mosque, abduct seven others",
    "summarized_story": "Gunmen kill many worshipers at Niger mosque, abduct seven othersGunmen kill many worshipers at Niger mosque, abduct seven othersThe Police Command in Niger said gunmen had killed an unspecified number of people while observing early morning prayers at a Mosque at Mazakuka village in Mashegu Local Government Area of the state.\nThe Commissioner of Police in the state,Mr Monday Kuryas, who disclosed this to Newsmen in Minna on Monday, said the hoodlums also abducted seven other worshipers at the mosque.\nKuryas said the incident occurred on Oct. 25 at about 0530 hours when the gunmen attacked the village.\nHe said the gunmen later destroyed property worth millions of Naira belonging to one Alhaji Abubakar Maigandus in the village.\nHe said that already additional armed security personnel had since been deployed to the area to ensure the arrest of the gunmen and all other miscreants undermining the peaceful coexistence among residents."
  },
  {
    "headline": "Editors Conference Says Insecurity Posting Negative Development Indices",
    "summarized_story": "‘’The problem of insecurity confronting the country is taking a huge toll on societal life and posting negative development indices in several areas.\nThat the insecurity crises stem from leadership failure that has bedevilled the country for many years’’, the communique stated.\n‘’There are fears in some quarters that editors and media professionals seem to have taken sides in the raging crises.\n‘’The conference called for an end to raging insecurity so that citizens can conduct their normal lives in an atmosphere of peace and concord.\nThat there’s need for healthy and harmonious collaboration between the media and the security agencies in the fight against insecurity."
  },
  {
    "headline": "Editors Conference Says Insecurity Posting Negative Development Indices",
    "summarized_story": "‘’The problem of insecurity confronting the country is taking a huge toll on societal life and posting negative development indices in several areas.\nThat the insecurity crises stem from leadership failure that has bedevilled the country for many years’’, the communique stated.\n‘’There are fears in some quarters that editors and media professionals seem to have taken sides in the raging crises.\n‘’The conference called for an end to raging insecurity so that citizens can conduct their normal lives in an atmosphere of peace and concord.\nThat there’s need for healthy and harmonious collaboration between the media and the security agencies in the fight against insecurity."
  },
  {
    "headline": "Again, four killed, three injured as locals , herders clash in Kaduna",
    "summarized_story": "Again, four killed, three injured as locals , herders clash in KadunaAgain, four killed, three injured as locals , herders clash in KadunaFour people have been killed and three others injured during a clash between locals and some herders in Jankasa, Zangon Kataf Local Government Area of Kaduna State.\nAfter the clash, the four people confirmed killed were identified as: Luka Nelson,Timothy Koni ,Pasi Peter and George Frances.\nAlso, security agencies reported that unknown gunmen attacked some settled herders at Manchok, Kaura LGA.\nThe security agencies reported that this was an apparent reprisal to the initial clash.\nThe Governor wished all those injured a quick recovery, and tasked security agencies to ensure diligent investigations into the attacks."
  },
  {
    "headline": "Gunmen shoot 18 people dead, abduct seven others inside mosque in Niger",
    "summarized_story": "By Aminu GarkoGunmen have attacked a mosque in Niger State, killing 18 people and abducting seven others during prayer.\nThe gunmen reportedly stormed a mosque at Mazakuka village in Mashegu Local Government Area of the state on Monday morning and attacked the worshippers.\nMonday Kuryas, State Commissioner of Police, disclosed that the hoodlums also abducted seven other worshipers at the mosque and killed several others.\nKuryas said the incident occurred on Monday at about 5:30am when the gunmen attacked the village.\nHe said the gunmen later destroyed property worth millions of Naira belonging to one Alhaji Abubakar Maigandus in the village."
  },
  {
    "headline": "Buhari advises foreign envoys on Nigeria's 2023 election",
    "summarized_story": "President Muhammadu Buhari has urged foreign envoys in Nigeria to be guided by diplomatic practices to ensure that their activities remain within the limits of their profession in their reaction to political issues in the country as the 2023 general elections draws near.\nFemi Adesina, the spokesperson for the President in a statement quoted Buhari as telling the envoys that they were assuming diplomatic responsibilities in Nigeria at a very interesting political period.\nThe momentum for enhanced political activities is therefore expected to commence soon.\nThe President told the newly accredited envoys that he looked forward to a more robust relationship with each of their countries.\nOn security, President Buhari told the ambassadors that more partnerships were needed to fully overcome daunting challenges in the country."
  },
  {
    "headline": "eNaira Can Increase Nigeria’s GDP By $29bn In 10 Years — President Buhari",
    "summarized_story": "has stated that the Central Bank Digital Currency, eNaira, and its underlying blockchain technology can boost Nigeria’s GDP by $29 billion over the next ten years.\nBuhari said this on Monday in Abuja during the official launch of the eNaira.\nAccording to the president, these realities prompted the Central Bank of Nigeria to explore issuing Nigeria’s own Central Bank Digital Currency, named the eNaira.\nIndeed, some estimates indicate that the adoption of CBDC and its underlying technology, called blockchain, can increase Nigeria’s GDP by US$29 billion over the next 10 years,” he asserted.\nBuhari, therefore, commended the Governor of the Central Bank, Godwin Emefiele, his Deputies and the entire team of staff who worked towards the launch of the eNaira."
  },
  {
    "headline": "Stop Holding Press Conferences, Bring Evidence Against Kanu To Court —IPOB Lawyer Slams Buhari’s Minister, Malami",
    "summarized_story": "The IPOB leader’s lawyer also said Malami, being a legal practitioner should bring any evidence he has against Kanu to the court of law, instead of holding press conferences that are biased against the IPOB leader.\nEjimakor disclosed that Kanu’s legal team was studying the contents of the press conference to decide if to take legal actions against Malami.\nHe said, “You have asked me about the press conference done by the Attorney-General on Friday.\nAnd there was nothing from any of these commissions of enquiry that returned an indictment of Mazi Nnamdi Kanu or IPOB in the aftermath of the EndSARS protest.\nThe committee is headed by Malami, who announced the alleged atrocities at a press conference last Friday."
  },
  {
    "headline": "Biafra: Igbo Lawyers Request To Join Suit Seeking Exit Of Southeast From Nigeria.",
    "summarized_story": "The lawyers say the application is based on the agitations of the proscribed Indigenous People of Biafran (IPOB) and Nnamdi Kanu.\nAlthough the Igbos are not joined in the suit, the Igbo Lawyers claim they have an interest to protect in the suit, hence, their request to be made a set of defendants in the case.\n“That the Igbo Lawyers Association represented by the applicants are an Indigenous association of lawyers from the south-east of Nigeria and other Indigenous Igbo speaking tribes in Nigeria.\n“That the Igbo Lawyers Association and its objective is to represent the interest of the Igbo people which said people are Indigenous in the south-east of Nigeria.\n“The Constitution of the Federal Republic of Nigeria can be further amended at any time after the question of self-determination must have been resolved by Nigerians.”"
  },
  {
    "headline": "INEC Chairman, Yakubu Holding Secret Meetings With Senate President Lawan, Ruling APC Party Leaders Ahead Of Elections",
    "summarized_story": "Mahmood Yakubu, the Chairman of the Independent National Electoral Commission (INEC), has been holding secret talks with top APC leaders, according to NEWS DIRECT.\nSources explained that the INEC chair, who is supposed to be neutral and non-partisan has been holding frequent meetings with Ahmad Lawan, Senate President and Mai Mala Buni, Caretaker Chairman of the ruling APC and governor of Yobe State.\nIt was gathered that the trio had a meeting last Friday, October 22 at a guest house belonging to the Senate President between 10 pm and 1 am.\nOne of the sources stated: “INEC chairman is frequently having private meetings with the duo of the Senate President and Buni at a private guest house owned by the Senate President in Maitama, Abuja.\nIt was between the Senate President, INEC chairman and Buni."
  },
  {
    "headline": "Buhari reveals how eNaira will boost Nigeria’s economy",
    "summarized_story": "The adoption of the Central Bank Digital Currency (CBDC) and its underlying technology, called block chain, can increase Nigeria’s GDP by $29billion over the next 10 years, President Muhammadu Buhari said Monday in Abuja at the official launch of the eNaira.\nThis trend has been exacerbated by the onset of the COVID-19 pandemic and the resurgence of a new Digital Economy.\n”It is on the basis of this that the Central Bank of Nigeria (CBN) sought and received my approval to explore issuing Nigeria’s own Central Bank Digital Currency, named the eNaira,’’ he said.\nIn his remarks, the Governor of Central Bank of Nigeria (CBN) Mr Godwin Emefiele explained that eNaira is Nigeria’s CBDC and it is the digital equivalent of the physical Naira.\nThe eNaira and Naira will have the same value and will always be exchanged at 1 naira to 1 eNaira,” he said."
  },
  {
    "headline": "4 killed, 3 injured in fresh Kaduna clash",
    "summarized_story": "“The military and police authorities have reported to the Kaduna state government that four people have been killed and three others injured during a clash between locals and some herders in Jankasa, Zangon Kataf local government area.\n“After the clash, the four people confirmed killed were identified as: Luka Nelson, Timothy Koni, Pasi Peter and George Frances.\n“Further to this, security agencies reported that unknown gunmen attacked some settled herders at Manchok, Kaura LGA.\nThe security agencies reported that this was an apparent reprisal to the initial clash.\nThe Governor wished all those injured a quick recovery, and tasked security agencies to ensure diligent investigations into the attacks,” he said."
  },
  {
    "headline": "Breaking: Big blow as Ministry postpones NBBF election indefinitely",
    "summarized_story": "The federal Ministry of Youth and Sports development has postponed election into the leadership of the Nigeria Basketball Federation (NBBF) scheduled for October 30, 2021 in Benin City, Edo state capital.\nThe postponement followed numerous crises rocking NBBF leadership.\nThis was disclosed via a press statement issued by the permanent secretary of the ministry Ismaila Abubakar on Monday.\n“This decision is necessary to avert further deterioration of the leadership crisis and towards finding a workable solution to the current disagreements within the Federation.\nThe rancour-free Development of Basketball in Nigeria is of utmost importance."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Desist from admitting National Diploma, part-time, JAMB warns institutions -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB has said that all applications for admissions to First Degree, National Diploma, National Innovation Diploma, and the Nigeria Certificate in Education into Full-Time, Distance Learning, Part-Time, Outreach, Sandwich, and others must be processed only through it.\nThe advisory warned institutions that are still involved in advertising or selling “application forms” for admissions into the programs listed above were advised to desist forthwith.\nIt, therefore, enjoined institutions to advise their candidates to apply to them through the Joint Admissions and Matriculation Board, adding that duplication of application forms is also NOT allowed.\n“ JAMB and the three Regulatory Agencies: (National Universities Commission (NUC), National Board for Technical Education (NBTE), and National Commission for Colleges of Education (NCCE) will ensure that all Tertiary Institutions comply with this policy directive.\nOther Professional Regulatory Agencies are also expected to play critical roles in sanitizing the process,” it said."
  },
  {
    "headline": "FG begins implementation of Ogoni cleanup, other projets to tackle environmental challenges -NigPilot",
    "summarized_story": "The Federal Ministry of Environment has said it is accelerating the implementation of various projects to address environmental challenges in the country.\nThe Minister of Environment, Sharon Ikeazor disclosed this at the meeting of the 15th National Council on Environment, NCE, held in Abuja, weekend.\nIkeazor said for Nigeria to realize the environment of her dream, it is imperative to consistently tackle environmental challenges such as climate change, deforestation, desert encroachment, loss of biodiversity, flood and erosion, environmental pollution amongst others.\nAnother strategy is the Implementation of a comprehensive program on the domestic use of Liquefied Petroleum Gas.\nThe Minister, therefore, urged National Council to critically appraise the emerging challenges faced by the environment while also acknowledging the opportunities that are inherent to be able to balance our actions towards achieving a sustainable environment."
  },
  {
    "headline": "FG selects six Universities for production of experts in procurement, others -NigPilot",
    "summarized_story": "Federal Government has selected six federal universities to host the Sustainable Procurement, Environmental and Social Standards Centres of Excellence , SPESSCEs, for the implementation.\nSPESSE also aims to establish strategic partnerships with leading international research funding, research performing and international capacity building organisations and top-performing institutions.\nThe Universities were: Abubakar Tafawa Balewa University, (ATBU), Bauchi; Ahmadu Bello University (ABU), Zaria; the Federal University of Agriculture, Makurdi (FUAM); the Federal University of Technology, Owerri (FUTO); University of Benin (UNIBEN) and University of Lagos (UNILAG).\nAccording to him, by developing curricula aligned with international standards, setting up the Centres of Excellence and supplying qualified professionals, SPESSE will improve, significantly, Nigeria’s capacity for procurement, environmental and social standards.\nRasheed commended the Vice-Chancellors of the selected universities for the key roles they played in developing the winning proposals and urged them to continue to support the Centres for the benefit of their universities, the Nigerian University System (NUS) and the country in general."
  },
  {
    "headline": "Niger Delta Ministry seeks inclusion of East-West road to SUKUK programme to hasten completion -NigPilot",
    "summarized_story": "Ministry of Niger Delta Affairs has proposed an extra-budgetary intervention for inclusion of the East-West Road Sections I-IV in the 2021 SUKUK Issuance Programme of the Ministry of Finance, Budget and National Planning and the Debt Management Office, DMO.\nAccording to Akpabio, the move for SUKUK intervention was part of the efforts made by the ministry to access adequate funding for the completion of the East-West road project.\nHe said that the appeals for extra-budgetary funding intervention for the project were yielding fruits, as the Minister of Finance has graciously directed the DMO to include the project in the SUKUK issuance of 2021.\n“lt is well known that Section IIIA, covering Eleme Junction to Onne junction was not part of the contract initially awarded in 2006 because it was in good condition having been dualized earlier.\nHe further urged Ogoni youths, relevant stakeholders, and Niger Deltans “to exercise patience as the Ministry is committed to bringing succor to the People of the Niger Delta”."
  },
  {
    "headline": "Buhari: eNaira Will Increase Nigeria’s GDP By $29bn",
    "summarized_story": "President Muhammadu Buhari has said Nigeria’s new digital currency, eNaira, will increase the country’s Gross Domestic Product by $29 billion over the next 10 years.\nAccording to the President, the launch of eNaira makes Nigeria the first country in Africa and one of the first few countries globally to introduce a digital currency.\nThe President also used the occasion of the unveiling of the eNaira to explain why he approved the use of the digital currency.\nThis trend has been exacerbated by the onset of the COVID-19 pandemic and the resurgence of a new Digital Economy,” he said.\n”It is on the basis of this that the Central Bank of Nigeria (CBN) sought and received my approval to explore issuing Nigeria’s own Central Bank Digital Currency, named the eNaira.”"
  },
  {
    "headline": "Gunmen Kill 17 Locals, Abduct Several In Attack On Niger Villages",
    "summarized_story": "No fewer than 17 people have been killed after a group of armed men attacked two villages in Niger State.\nThe Secretary to the State Government (SSG), Ahmed Matane, confirmed the incident to Channels Television on Monday.\nThe affected villages – MazaKuka and Kulhu villages – are located in Mashegu Local Government Area (LGA) of the state.\nMatane explained that the gunmen killed 16 people in a mosque in MazaKuka and another one person in Kaboji village.\nChairman of Mashegu LGA, Alhassan MazaKuka, on his part, described the attack as devastating."
  },
  {
    "headline": "Nigeria Launches Digital Currency eNaira",
    "summarized_story": "President Muhammadu Buhari has launched the country’s digital currency, eNaira.\nDuring the launch, President Buhari said the adoption of new CBN digital currency is estimated to increase Nigeria’s GDP by $29 billion over the next 10 years.\n﻿Other countries like China, Bahamas, and Cambodia have also launched digital currencies.\nREAD ALSO: eNaira Will Open New World Of Innovations – ExpertThe digital currency has two applications – eNaira speed wallet and eNaira merchant wallet, which were launched on the Google Playstore and Apple Store on Monday at the State House, Abuja.\n“eNaira is a Central Bank of Nigeria-issued digital currency that provides a unique form of money denominated in Naira."
  },
  {
    "headline": "Journalists Storm Police HQ, Protest Over Missing Colleague Tordue Salem",
    "summarized_story": "﻿Journalists on Monday stormed the police headquarters in Abuja to protest over the continued disappearance of their colleague Tordue Salem, a journalist with Vanguard Newspapers.\nMr. Salem, who is a native of Tiv, Benue State, covers the House of Representatives.\nThe NUJ chapter in Abuja had earlier raised an alarm over his sudden disappearance.\nThey asked the police and DSS to help unravel the mystery surrounding Mr. Salem’s whereabouts.\nREAD ALSO: NUJ Asks Security Agencies To Locate ‘Missing’ Journalist“For all us journalists in Abuja, we have been on edge these past few days over the mysterious disappearance of our colleague and friend, Mr. Tordue Salem,” the statement, signed by the union’s Chairman, Emmanuel Ogbeche and Secretary, Ochiaka Ugwu, said."
  },
  {
    "headline": "Soldiers Open Fire On Protesters In Sudan After Military Coup",
    "summarized_story": "Crowds protested into the night in Sudan Monday to denounce a military coup, with chaos engulfing the capital Khartoum after soldiers opened fire on demonstrators and reportedly killed three people.\nClashes erupted in the capital Khartoum after his speech, with the information ministry saying that soldiers had “fired live bullets on protesters rejecting the military coup outside the army headquarters”.\nThree protesters were killed and about 80 people wounded when soldiers opened fire, according to the independent Central Committee of Sudan Doctors.\nUN Secretary-General Antonio Guterres said in a statement the detention of the civilian leaders was “unlawful” and condemned “the ongoing military coup d’etat”.\n“We will not accept military rule, and we are ready to give our lives for the democratic transition in Sudan,” said one demonstrator, Haitham Mohamed."
  },
  {
    "headline": "Marwa charges NDLEA strike force corps to be ruthless with drug barons, cartels -",
    "summarized_story": "Chairman of the National Drug Law Enforcement Agency, NDLEA, Brig.\nGen. Buba Marwa (Retd) has charged officers and men of the Agency’s Strike Force Corps to go all out and root out drug barons and cartels from their hideouts across the country.\nWe’re conscious of our job to block and prevent availability of narcotic drugs, and that necessitated the formation of the Strike Force to enhance our capability for complex operations.\nThe Strike Force is the tip of our spear in our interdiction efforts and as such we must keep the tip sharpened and always ready to strike because we need to be two steps ahead of drug barons and cartels operating in the country.\nIn his remarks, Commandant, Nigerian Army School of Infantry, Maj. Gen. Ali, commended Marwa for repositioning NDLEA for efficiency and relevance within the country’s security architecture."
  },
  {
    "headline": "Judge's leave stalls hearing of police officer who allegedly killed Monsurat Ojuade -",
    "summarized_story": "A Magistrate Court in Yaba, Lagos has adjourned the hearing on the dismissed police sergeant, Samuel Philips who reportedly shot teenager, Monsurat Ojuade, at the Surulere area of Lagos.\nTVC News gathered on Monday, the initial adjourned date that hearing was adjourned to December 14 because the Chief magistrate, Adeola Adedayo was on a six-week leave.\nMr Philips was arrested by the police for allegedly shooting Ms Ojuade at her residence at Mogaji street, Surulere, on September 11.\nThe incident happened while the police went on a raid at the area around 10:30 p.m.\nBut the police claimed that the deceased was hit by a stray bullet, adding that the “erring police officer”, a sergeant, has been dismissed and detained, but the family through their lawyer, Mr Mbaebie insisted that the victim was shot at close range."
  },
  {
    "headline": "Gov. Ortom arrests four Illegal revenue operators at checkpoint",
    "summarized_story": "Benue State Governor, Samuel Ortom has clamped down on some illegal revenue collectors around Abinsi, along Gboko-Makurdi Road.\nThe governor’s attention was drawn to the activities of the illegal revenue operators when he noticed the harassments of heavy duty vehicles that were detained at the checkpoint on his way from Kwande Local Government.\nAfter discovering during an interaction with drivers of the vehicles that the checkpoint operators were collecting money from motorists without issuing them receipts.\nHe vowed to sanction the management of the Board of Internal Revenue Service, BIRS for failure to supervise and ensure the right thing was done.\nGovernor Ortom said he will henceforth, personally carry out surprise checks on the activities of checkpoint operators in the state."
  },
  {
    "headline": "French Govt to invest $70m to boost renewable energy projects in Nigeria",
    "summarized_story": "The French government has announced that it will spend $70 million in renewable energy projects in Nigeria through the French Development Agency/Agence Francaise de Development (AFD).\nAccording to the report, Mr Chukwudumije Igwe, Member, Project and Structured Finance, Sub Sahara Africa, Access Bank, made this known at the Sustainable Use of Natural Resources and Energy Finance (SUNREF) Nigeria programme investor conference in Lagos.\nMr Javier Betancourt, Team Lead, SUNREF Nigeria, stated that the 70 million US dollars was not nearly enough, but it was a start because what Nigeria needed was in the billions, adding that over 80 million Nigerians were completely without electricity, while the remaining 100 million were partially electrified.\n“The investment needed is enormous and $70 million does not even begin to cover it, but it does help start things.\n“This fund we are bringing in will be longer terms with minimum of five years and these are concessional lending rates which would help to finance these projects,” he said."
  },
  {
    "headline": "Rep Says Tinubu Should Be President Because He ‘Fought Corruption’ in Lagos – Trending With Ojy Okpe",
    "summarized_story": "In the aftermath of the recent police brutality witnessed during the one year anniversary of the #EndSARS protests, victims are towing the legal route to get justice.\nIn another development, a video making the rounds captured actor and comedian Debo Adedayo popularly known as Mr. Macaroni confronting police officers over an alleged extortion of a motorist.\nIn the video, the motorist said he was made to transfer N30,000 to an account by the officers.\nWhile many are debating who will become Nigeria’s next President, supporters of the National Leader of the All Progressives Congress Asiwaju Bola Ahmed Tinubu and Nigeria’s Vice President Professor Yemi Osibanjo have been seen to be pushing their agenda.\nJames Faleke, a member of the house of representatives, over the weekend called on the national leader to formally announce his presidential aspiration, while insisting that he is the right man for the job because he fought corruption with technology and native intelligence in Lagos State."
  },
  {
    "headline": "Buhari Departs Abuja for Saudi Arabia Monday, to Return Friday",
    "summarized_story": "President Muhammadu Buhari will on Monday depart for Riyadh, Saudi Arabia, to participate in a three-day investment conference organised by the Future Investment Initiative Institute.\nDuring his stay in Saudi Arabia, the president is also expected to perform the lesser Hajj before returning to Abuja, the nation’s capital, on Friday.\nThe three-day event, with the theme, “Investment in Humanity,” would host global executives and asset managers.\nIt would deliberate on progress and prosperity with energy; true final frontiers in investments; science in action; and impact of climate change on communities among others.\nBuhari would perform the lesser Hajj in Madina & Makka before returning to the country on Friday."
  },
  {
    "headline": "US Urges North Korea to Stop Missile Tests and Return to Talks",
    "summarized_story": "A senior U.S. diplomat on Sunday urged North Korea to refrain from additional missile tests and resume nuclear diplomacy, days after the North fired off its first underwater-launched ballistic missile in two years.\nSung Kim, the U.S. envoy on North Korea, spoke after meeting with South Korean officials to discuss North Korea’s recent missile tests while nuclear negotiations between Washington and Pyongyang remain stalled.\nLast Tuesday, North Korea fired a newly developed ballistic missile from a submarine in its fifth round of weapons tests in recent weeks.\nMissiles fired from submarines are harder to detect in advance and would provide North Korea with a secondary, retaliatory attack capability.\nThe Biden administration has repeatedly said it’s ready to meet North Korea “anywhere and at any time” without preconditions."
  },
  {
    "headline": "Nigeria: EFCC Grills Ex-Senate President, Anyim Pius Anyim – Arise News",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Sunday commenced the interrogation of a former Senate President, Senator Anyim Pius Anyim, in an alleged case of corruption and diversion of public funds.\nAnyim, who arrived the headquarters of the anti-graft agency in Jabi, Abuja at about 3pm Sunday, was still undergoing interrogation by a team of operatives as at the time of filling this report.\nPart of the rehabilitation funds to the tune of N780 million were allegedly traced to a company in which Senator Anyim has interest.\nWhen contacted, EFCC Spokesman, Mr. Wilson Uwujaren, said he was yet to be briefed.\nKingsley Nwezeh in Abuja"
  },
  {
    "headline": "Nigeria Will Meet Three Million Barrels Per Day OPEC Quota, Says Deputy Oil Minister Sylva",
    "summarized_story": "Minister of State for Petroleum Resources, Chief Timipre Sylva, has assured that Nigeria would meet the three million barrels per day quota allocated to the country by the Organisation of Petroleum Exporting Countries (OPEC).\nSylva said though the country currently produced about 1.3 million barrels per day, concerted efforts were being made to increase production to meet the OPEC quota.\nSylva gave the assurance at the weekend, during the 2021 graduation ceremony of Petroleum Training Institute (PTI), Effurun, Delta State.\nSylva stated, “Some of the strides of the petroleum ministry, one of which is the mandate to increase crude oil production to three million barrels per day.\nToday, we are producing about 1.3 million barrels per day."
  }
]