[
  {
    "headline": "Mamora hails Tinubu over APC presidential ticket victory",
    "summarized_story": "The former Minister of State for Health, Senator Adeleke Mamora, on Thursday, congratulated the National Leader of All Progressives Congress, Bola Tinubu, over his emergence as the presidential flag bearer of the party.\nMamora’s congratulatory message was contained in a letter personally addressed to the former governor of Lagos State.\nTinubu defeated Vice President Yemi Osinbajo, former Minister of Transportation, Rotimi Amaechi and 12 other presidential aspirants to clinch the APC ticket.\nWhile describing him as standing tall among his peers, Mamora disclosed that his victory at the convention was well deserved.\n“You have led from the front as a leader and have come thus far to the glory of God."
  },
  {
    "headline": "Tinubu: Don’t opt for Muslim-Muslim ticket, Babachir warns APC",
    "summarized_story": "According to him, Tinubu would have been running mate to the President, Major General Muhammadu Buhari (retd.\n), when the latter became the candidate of the APC in 2014 but for the discouragement of a Muslim-Muslim ticket.\nThere are concerns that Tinubu, a Muslim, might be forced to pick a Muslim running mate from the North where Christians are the minority.\n“Now, extending that consideration to the Muslim-Muslim ticket, I have lived among the Christians and I know that among the Christians, the question of a Muslim-Muslim ticket is a no-go area.\nBuhari himself, even at that time, had to drop this present presidential candidate (Tinubu) because of the tension of a Muslim-Muslim ticket."
  },
  {
    "headline": "JUST IN: Ondo court sentences three to death over killing of Fasoranti’s daughter",
    "summarized_story": "The Ondo State High Court, Akure, on Friday, sentenced three persons to death for killing Mrs Funke Olakunrin, the daughter of the Afenifere leader, Chief Reuben Fasoranti.\nThe deceased was killed by the convicts along Benin-Ore-Shagamu Expressway in the Ore Odigbo Local Government Area of the state in June 2019, on her way to Lagos State.\nThe convicts are Awalu Abubakar, Muhammed Shehu and Adamu Adamu.\nJustice Williams Olamide found the trio guilty of involving in murder, kidnapping and armed robbery and sentenced them to death.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "2022 Hajj: Only 3 carriers shortlisted to airlift pilgrims from Nigeria",
    "summarized_story": "By Prince OkaforNo fewer than three airline have been listed as major carriers to airlift pilgrims from Nigeria by the Federal Airports Authority of Nigeria, FAAN.\nThis came as the agency assured pilgrims and the general public of her readiness to seamlessly conduct the 2022 hajj operations.\nRead Also:He said: “Pilgrims should get to the airport early to avoid missing their flights“Every requirement aimed at ensuring the safety, security and comfortability of pilgrims have been met already.\n“We are confidence that the hajj operations will be successful, as he wished all pilgrims a successful pilgrimage.\n“FAAN remain committed to her core values of Safety, Security and Comfort.”"
  },
  {
    "headline": "Air travel continues on recovery trend, passenger traffic surge 116%",
    "summarized_story": "Capacity rose 233.5 per cent and load factor climbed 33.7 percentage points to 79.4 percent.\nCapacity rose 88.6 per cent and the load factor was up 34.6 percentage points to 66.8 per cent, still the lowest among regions.\nApril capacity rose 101.0 per cent versus the year-ago period, and load factor climbed 32.2 percentage points to 71.7 per cent.\nFor North American carriers’ April traffic rose 230.2 per cent versus the 2021 period, slightly above the 227.9 per cent rise in March 2022 compared to March 2021.\nCapacity rose 98.5 per cent, and load factor climbed 31.6 percentage points to 79.3 per cent."
  },
  {
    "headline": "Killers of Fasoranti’s daughter to die by hanging",
    "summarized_story": "Dayo Johnson – AkureAn Ondo State High Court has sentenced three out of four suspected killers of the 58 year old daughter of the national leader of the Pan Yoruba Socio- Political Group, Mrs Funke Olakunri to death by hanging.\nThey include Muhammed Shehu Usman, Adamu Adamu,and Lawal Mazaje.\nRead Also:Murder of Fasoranti’s daughter: Five more suspects arrested by Police SWATThis is not Nigeria of our dream ― Fasoranti at 94We pulled strings before my daughter’s murder was investigated — Pa FasorantiThe three Suspects were convicted by Justice Williams Olamide for conspiracy to murder, kidnapping and armed robbery.\nThe court, however discharged and acquitted the fourth defendant, Auwalu Abubakar, 25 for conspiracy.\nRecall that the police also alleged that the suspects also murdered one Ogunbiyi Matthew aged 65 and also kidnapped one Gerald Igboayaka the same day Funke Olakunri was murdered along Ore/ ljebu Ode Expressway on July 12th, 2019."
  },
  {
    "headline": "AEDC boosts power supply to Bida with new substation",
    "summarized_story": "By Obas Esiedesa, AbujaAbuja Electricity Distribution Company, AEDC, yesterday assured consumers in Bida, Niger State, of improved power supply following the commissioning of a new 1x15MVA/33/11Kv Injection Substation.\nRather than having the low voltage electricity that Bida and its environs are used to, they will now have improved supply with high voltage.\nThe monarch who was represented by Alhaji Yahaya Mayaki noted that improved power supply would boost local businesses and work of artisans who could not afford power generating sets.\nOn his part, Rep. Faruk expressed hope that improved power supply to the area would lead to increased business activities and more jobs for the people.\nKassim Abdulahi Burkullu said it would bring quality supply closer to customers in the Bida area."
  },
  {
    "headline": "With Tinubu on ballot, PDP ‘ll have uphill task regaining power in 2023 – Nkire",
    "summarized_story": "By Levinus Nwabughiogu-AbujaA chieftain of the ruling All Progressives Congress, APC, Chief Sam Nkire has said that with Asiwaju Bola Tinubu on the ballot paper in 2023 general elections, the main opposition Peoples Democratic Party, PDP will have an uphill task regaining power at the center.\nNkire who’s the pioneer leader of the caucus in Abia State also said that Tinubu deserved to win the party’s presidential primary election considering his unequaled service to APC.\nThe APC chieftain who is also a pioneer member of the party said he was confident that Senator Bola Ahmed Tinubu would be a good President, giving his track record when he served as Governor of Lagos State.\nHe urged the APC Presidential candidate for the 2023 general elections to be magnanimous in victory, especially to the Southeast zone which has been crying out loud against marginalization for a long time.\nNkire said he had no doubt in his mind that the opposition, the People’s Democratic Party PDP, would have an uphill task regaining power from the APC come 2023, “with a juggernaut like the ‘Jagaban’, Bola Tinubu on the ballot for the APC”."
  },
  {
    "headline": "Buhari unveils e-government mechanism, inaugurates presidential council",
    "summarized_story": "Moves to strengthen the use of technology in government activities have seen President Muhammadu Buhari inaugurate the Presidential Council on Digital Economy and E-government.\nIn unveiling the council officially on Friday, Buhari pledged that his administration will continue to take advantage of digital technologies to transform every sector of the economy.\nOwing to his busy schedule, he directed the Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim Pantami to chair the Council on his behalf and give regular updates.\nAlso in the committee are Mr. Oswald Osaretin Guobadia, Senior Special Assistant, (Digital Transformation) to the President; Engr Olufemi Olufeko, Director, e-Government Dept, Federal Ministry Of Communications and Digital Economy; A.B.\nMinister of Communication & Digital Economy and Abubakar A. Dahiru, Special Assistant (Cyber Security & Digital Identity) to the Minister are also members of the Committee."
  },
  {
    "headline": "Zamfara’s oldest Emir dies at 93",
    "summarized_story": "The longest-serving Zamfara monarch, the Emir of Kwatarkwashi in Bungudu Local Government Area of the state, Alh.\nAhmad Umar, on Thursday 9th June, 2022, joined his ancestorsIn a press statement signed and issued to newsmen in Gusau, the state capital, by Alh.\nKabiru Balarabe, Umar, who was the eldest emir died in his palace after a prolonged illness.\nRecall that Alhaji Ahmad Umar Mai Kwatarwas was crowned by Sultan Abubakar III on March 17, 1961, and he had been on the throne for 61 years.\nIn March 2021, he celebrated his 60th year on the throne in a grand style which was graced by prominent traditional leaders in the northern part of Nigeria including the Sultan of Sokoto, Alhaji Sa’ad Abubakar III."
  },
  {
    "headline": "UNTH Resident Doctors decry attack by patients’ relatives, make demands",
    "summarized_story": "The Association of Resident Doctors, ARD, University of Nigeria Teaching Hospital has condemned the renewed attack on doctors on duty by patients’ relatives.\nThis is coming amidst a reported attack on a doctor by a patient’s relative, who is now at large.\nIn an update provided to journalists after an emergency meeting of the Association, the doctors said the recurrent attack on their members who are on legitimate duty would no longer be tolerated.\nThe UNTH ARD led by Dr. Jide Uzoigwe said it had “observed with dismay the recurrent cases of assault of our members while on duty inside the hospital by patients’ relatives.”The security update signed by Dr Chinazom Ekwueme, the Secretary, ARD UNTH Security Committee said measures were now being put in place to forestall such an occurrence in the future.\nAccording to her, “the President, Dr. Jide Uzoigwe constituted a security committee with Dr. Emmanuel Ogbu as the Chairman."
  },
  {
    "headline": "2023 elections shouldn’t be our topic – Nnamdi Kanu’s lawyer on terrorists attacking Southern Kaduna",
    "summarized_story": "Aloy Ejimakor, a Special Counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has reacted to the terrorist attack in Southern Kaduna.\nEjimakor said the terrorist attack in Nigeria should be the current topic and not the 2023 elections.\nHe stated this while sharing a report of terrorists attacking Southern Kaduna with a helicopter on his Twitter handle.\n“Terrorists in Nigeria’s airspace should be the dominant topic, not 2023 elections.\nDAILY POST gathered that the assailants who invaded the Ungwan Gamu, Dogon Noma, Ungwan Sarki and Maikori communities allegedly with helicopters also burnt several houses."
  },
  {
    "headline": "Scores of ISWAP terrorists blocking Maiduguri-Damaturu road neutralised",
    "summarized_story": "Scores of suspected members of the Islamic State of West Africa (ISWAP) terrorist group have been neutralised by the Nigerian military after they blocked the Maiduguri-Damaturu road wreaking havoc on commuters on Thursday.\nIt took massive air support from the Nigeria Airforce to neutralise the terrorists who fled the scene where they took siege of Lawan Mainari village about 30 km from Mainoc.\nThey actually gained entrance to the main road by filling the trenches around unknown to the residents.\n3 Gun trucks were recovered with lots of weapons.\nISWAP had since claimed responsibility for the attack even as the three policemen that died in the ambush have since been buried."
  },
  {
    "headline": "BREAKING: Killers of Fasoranti’s daughter sentenced to death",
    "summarized_story": "BREAKING: Killers of Fasoranti’s daughter sentenced to deathThree persons involved in the killing of Olufunke Olakuri, daughter of Afenifere Leader, Pa Reuben Fasoranti, have been sentenced to death by hanging.\nThey were sentenced by an Ondo State High Court sitting in Akure.\nPresiding Judge, Justice William Olamide, however, discharged and acquitted the fourth suspect, Auwàla Abubakar, who is the spokesman of Miyetti Allah.\nOlufunke was shot dead in June, 2019 by gunmen in Ore, Odigbo Local Government Area of Ondo State.\nHer alleged killers were later arrested and arraignedsix months after her death."
  },
  {
    "headline": "UK promises £1million support to NDLEA",
    "summarized_story": "The United Kingdom has said it will provide £1million worth of support to enhance the operations of the National Drug Law Enforcement Agency (NDLEA) in 2022 with additional provision over a period of three years.\nHe said the agency has been able to play a significant role by intercepting loads of illicit drugs going to the UK.\nHe assured that his office is now well positioned to share intelligence with NDLEA.\nMarwa expressed appreciation to the visiting UK team and the British government for past support to NDLEA.\nHe said with the expansion of the operations, commands structure and staff strength of the Agency, he would need more support and collaboration from the UK government."
  },
  {
    "headline": "Tinubu charges APC NWC to be united, vigilant ahead of polls",
    "summarized_story": "Sen. Bola Tinubu, the All Progressives Congress (APC),M 2023 Presidential Candidate, has charged the party’s National Working Committee (NWC), to stand strong, united and vigilant ahead of the elections.\nMorka said the team was at Tinubu’s Abuja residence, to congratulate him for emerging as the party’s 2023 Presidential Candidate.\nHe congratulated the NWC, APC members, and Nigerians, for the remarkably successful conduct of the party’s National Convention that saw his emergence as its presidential candidate.\nTinubu expressed confidence in the APC NWC, and its leadership to ensure victory in the coming elections.\nTinubu, who contested the party’s presidential ticket with 13 other aspirants, polled 1,271 votes at the election to pick the ticket."
  },
  {
    "headline": "VIDEO: Supporters welcome dancing Bakare at airport, say presidency still possible.",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Twists, turns and myths of APC convention",
    "summarized_story": "The just concluded special convention of the All Progressives Party (APC) to pick its presidential candidate was like no other in the ruling party’s seven-year-old history.\nTellingly, APC officially declared its presidential candidate just a few hours to the June 9, deadline for parties to hold their primaries.\nIts Presidential Primary election did not end until well after 2 p.m. on June 8.\nAnd the intrigues under which former President Goodluck Jonathan was going to be drafted in as the ultimate consensus candidate?\nSome people continued to protest with placards, demanding that he be given the ticket as consensus candidate."
  },
  {
    "headline": "Peter Obi is authentic LP’s presidential candidate – Party’s scribe reiterates",
    "summarized_story": "The party’s scribe who spoke while featuring on a Kaduna-based FM radio station described Okafor and his co-travellers as “tools in the hands of those who do not wish Nigeria well”.\n“Those who think money can be used to buy everyone, but realised that the Labour Party is accepted by the majority of Nigerians who crave credible political leadership and see it as the only credible alternative to give Nigerians the President they desperate need to salvage the country”.\nIbrahim called on Nigerians, especially the citizens in the South-East not to be distracted by Okafor and his sponsors, urging them to mobilize support for Peter Obi, and utilise the Labour Party in his quest to liberate Nigeria from the shackles of money bags and godfatherism.\nAccording to Ibrahim, “the leadership and members of the Nigerian Labor Congress (NLC) recognized and endorsed the candidacy of Obi”.\nHe however reiterated that no faction exists in Labour Party, but in the “imagination of those who are foot soldiers of enemies of Nigeria and Nigerians”."
  },
  {
    "headline": "Tension in APC, PDP over Tinubu, Atiku’s running mates",
    "summarized_story": "In the last one week, Atiku has held series of consultations with PDP governors and other stakeholders on the choice of running mate.\nMultiple sources told Daily Sun that the APC was in a fix on who to pick as Tinubu’s running mate.\nLeader of the House of Representatives, Alhassan Ado-Doguwa said Tinubu’s running mate may come from the North-East.\nHe also listed some possible names that are being considered by the party, to present as Tinubu’s running mate.\nThere are also moves to allow President Buhari to pick Tinubu’s running mate since his endorsed candidate didn’t win the primaries."
  },
  {
    "headline": "ISWAP linked to Owo church attack –FG",
    "summarized_story": "From Juliana Taiwo-Obalonye, Abuja, Sunday Ani, Chukwudi Nweje and Oluseye Ojo, IbadanThe Federal Government has disclosed that last Sunday’s attack on St. Francis Catholic Church, Owo, Ondo State, by gunmen, leading to the death of worshippers, have been linked to Islamic State of West African Province (ISWAP).\nHe said the imprint of ISWAP was found at the scene of the attack, vowing that they will be brought to Justice.\nHe said: “The Council is quite concerned about the violent attack in Owo, Ondo State.\nAlso, the Yoruba self determination group, Ilana Omo Oodua Worldwide said the attack has vindicated its earlier position that Fulani terrorists were behind the dastardly act.\n“We, therefore, reinstate our earlier position that the government of Ondo state should declare an emergency on the activities of Fulani herdsmen in Ondo state."
  },
  {
    "headline": "INEC issues APC, PDP, others one week deadline to submit names of presidential candidates, running mates",
    "summarized_story": "From Romanus Ugwu, AbujaIndependent National Electoral Commission (INEC) has issued Friday June 17 deadline to the political parties to submit names of their presidential candidates and running mates to the commission.\nYakubu also revealed that a nomination centre has been set up at the commission’s headquarters to receive and process all nominations the political parties submitted online in a dedicated INEC Candidate Nomination Portal (ICNP).\n“All political parties are required to upload the details of their candidates for each constituency to the INEC ICNP.\nSimilarly, the list of all presidential and governorship candidates must be accompanied by the names of their running mates (i.e.\nvice presidential and deputy governorship candidates) without which the nomination is invalid."
  },
  {
    "headline": "Ex-Lagos gov unfolds agenda for Nigerians",
    "summarized_story": "Tinubu said as president he would launch a new National Industrial Policy focused on special intervention to reinvigorate specific strategic industries.\nThe presidential aspirant also promised to formulate a new national policy on agriculture to boost food production.\nMy administration will establish a National Strategic Reserve for Petroleum Products to stabilise supply during unexpected shortages or surplus periods.\nThe APC presidential candidate promised to increase the funding for health care in the annual budget to 10 per cent.\nAccording to him, the National Health Insurance Scheme would be relaunched to grant health insurance cover to most Nigerians."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "2023: Tinubu will defeat Atiku in Adamawa, says Babachir Lawal",
    "summarized_story": "Babachir Lawal, former secretary to the government of the federation (SGF), says Bola Tinubu will defeat Atiku Abubakar in Adamawa in the 2023 presidential election.\nTinubu, presidential candidate of the All Progressives Congress (APC), and Atiku, the Peoples Democratic Party (PDP) flagbearer, are the frontrunners in the election.\nAtiku who hails from Adamawa is expected to easily secure victory in his state — but the former SGF believes otherwise.\nIn an interview aired on Channels TV, Lawal said the APC has its tentacles all over the state, therefore, Atiku will be defeated in 2023.\n“We have our tentacles all over the state; it is our state, and we know our tendencies, Bola Tinubu will win Adamawa state."
  },
  {
    "headline": "2023: Tinubu will defeat Atiku in Adamawa, says Babachir Lawal",
    "summarized_story": "Babachir Lawal, former secretary to the government of the federation (SGF), says Bola Tinubu will defeat Atiku Abubakar in Adamawa in the 2023 presidential election.\nTinubu, presidential candidate of the All Progressives Congress (APC), and Atiku, the Peoples Democratic Party (PDP) flagbearer, are the frontrunners in the election.\nAtiku who hails from Adamawa is expected to easily secure victory in his state — but the former SGF believes otherwise.\nIn an interview aired on Channels TV, Lawal said the APC has its tentacles all over the state, therefore, Atiku will be defeated in 2023.\n“We have our tentacles all over the state; it is our state, and we know our tendencies, Bola Tinubu will win Adamawa state."
  },
  {
    "headline": "'It's in my pocketbook' -- Tinubu speaks on choice for running mate",
    "summarized_story": "Bola Tinubu, the presidential candidate of the All Progressives Congress (APC), says his choice for a running mate is in his pocketbook.\nFollowing his victory in the APC presidential primary election, speculation has been rife about the identity of the vice-presidential candidate of the party.\nSeveral APC governors are believed to be in contention for the position, but there has been no official decision yet.\nSpeaking after meeting with President Muhammadu Buhari at the state house on Thursday, Tinubu was asked to divulge where he was leaning towards.\n“All APC party members should celebrate in a limited manner."
  },
  {
    "headline": "'It's in my pocketbook' -- Tinubu speaks on choice for running mate",
    "summarized_story": "Bola Tinubu, the presidential candidate of the All Progressives Congress (APC), says his choice for a running mate is in his pocketbook.\nFollowing his victory in the APC presidential primary election, speculation has been rife about the identity of the vice-presidential candidate of the party.\nSeveral APC governors are believed to be in contention for the position, but there has been no official decision yet.\nSpeaking after meeting with President Muhammadu Buhari at the state house on Thursday, Tinubu was asked to divulge where he was leaning towards.\n“All APC party members should celebrate in a limited manner."
  },
  {
    "headline": "INSIDE STORY: Nigerian women battling to keep traditional cloth weaving from extinction",
    "summarized_story": "For most households in Iseyin where traditional cloth weaving is the major source of livelihood, they all disembarked from the wooden loom.\nAccording to her, the height of the COVID-19 pandemic was the toughest period she has ever experienced over two decades of making aso-ofi.\nYears back, in a typical Nigerian ceremony beaming with colours and glam, aso-ofi used to be the centre of attraction.\nDespite the toll of the COVID-19 pandemic on small-scale businesses, they have decided to keep the craft alive and boost their family income.\n“Aso-ofi textile products are being exported to United States, United Kingdom, Brazil, Canada, Trinidad and Tobago, among others."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Moroccan Chari acquires Ivorian B2B e-commerce startup Diago",
    "summarized_story": "Chari, a Moroccan B2B e-commerce and fintech startup, today announced that it has acquired a 100% stake in Diago, an Ivorian app that connects neighborhood shops to FMCG producers and importers.\nThe all-stock transaction was facilitated by AF Legal and RBB International firms, representing Chari, and Houda Law Firm, representing the Ivorian upstart.\nThis acquisition is coming only 3 months after Chari acquired Axa Credit, the credit arm of Axa Assurance Maroc, for $22 million.\nJust last month, a Nigerian autotech startup Autochek travelled up north to acquire Moroccan KIFAL Auto.\nNow, Chari is acquiring a West African startup."
  },
  {
    "headline": "Boomplay launches in Côte d'Ivoire",
    "summarized_story": "Boomplay, a Chinese-owned music streaming platform for African artists and songs, has launched in Côte d’Ivoire.\nToday, the platform opened the doors of its Ivorian offices in Abidjan to enhance music streaming, and help Ivorian artists reach a broader audience within and outside the continent.\nCote D’Ivoire marks the 6th African country with Boomplay’s presence after Nigeria, Tanzania, Kenya, Tanzania, Ghana and Cameroon.\nSpeaking about the launch, Boomplay Côte d’Ivoire General Manager, Paola Audrey Ndengue, said, “We’re particularly proud to establish a presence in Abidjan, a creative and cultural hub in the region.\nGuy-Constant Neza, an Ivorian label manager at Believe Digital told Lemonde that 80% of Ivorian artists’ income comes from live performances."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Stakeholders advocate for domestication of FOI law in Edo State – Nigerian Observer",
    "summarized_story": "The Program manager of ANEEJ, Mr. Innocent Edemhanria said the media round table was organized to discuss past efforts made towards domesticating the FOI law in Edo and how to revive the advocacy for the actualization of the old draft presented to the government.\n“It is important that Edo State domesticate the FOI law because of its impressive relationship with the Open Governance Partnership, OGP.\nStakeholders, Civil society organizations, lawyers and journalists should call for the resuscitation of the FOI bill in the state.\n“Let us refresh our minds and take a common position to advance the demand of FOI law in Edo,” he added.\nThe ANEEJ program manager gave an overview of the FOI Act, duties and obligations of public institutions under the FOI Act, previous efforts and the way forward and tips for making FOI requestsShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "NBM Holds 43rd National Convention In Benin, Expresses Readiness To Partner FG On Cyber Crime, Others – Nigerian Observer",
    "summarized_story": "He said the theme for the convention was “The fight against cybercrime, fraud, and insecurity: The pivotal role of NBM of Africa.\n“Every member of the NBM of Africa should act and preach peace.\nThree million apostles of peace and a crime-free society is indeed the best and better way to fight cybercrime and insecurity in our society.\n“I strongly believe our society will be a better place with less crime if NBM of Africa pursues vigorously its set programs to check the menace of cybercrime and insecurity.\nIn doing this, NBM of Africa will partner with various security agencies namely, the Nigerian Police Force, EFCC, ICPC, and Civil Defence in the fight against crimes and insecurity”."
  },
  {
    "headline": "Woman Drags Mopol to CP Over Alleged Threat To Life – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – An Auchi-based woman in Etsako West local government area of Edo State Mrs Queen Okojie has dragged a Mobile Police Officer Inspector Monday Aidomoh to the Edo State Commissioner of Police, alleging threat to her life, assault and illegal seizure of personal property by the officer.\n“The relationship between Netty Abu and our client has been so strained because of constant quarrels between them always caused by Netty Abu.\nHe expressed his disappointment when he referred the Commissioner of Police to his client’s initial petition on the same case.\nHowever, copies of the said initial petition were sent to the Squadron Commander, Mopol 60, Iyamoh, Edo State, the Managing Director, Hartland Nig.\nLtd, Imeke-Uzairue, Edo State, and the Coordinator, Edo State Civil Society Organisation of Nigeria, Auchi Branch, Edo State."
  },
  {
    "headline": "Edo Govt orders AAU to resume – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…suspends ASUU, othersBENIN CITY – The Edo State Government at its State Executive Council meeting, Wednesday, has suspended all union activities across all state-owned institutions of higher learning following the protest by students of Ambrose Alli University, Ekpoma, over the lingering strike by the Academic Staff Union of Universities.\nIn a statement made available to journalists by Crusoe Osagie, the Special Adviser on Media Projects to the Edo State Governor, Godwin Obaseki, it was gathered that the Secretary to the State Government, Osarodion Ogie, said the affected unions include ASUU, Non-Academic Staff of Universities, Senior Staff Association of Nigeria Universities, Academic Staff Union of Polytechnics, Non-Academic Staff Union of Polytechnics, and all allied unions operating across all state-owned tertiary institutions.\nOgie stated, “By this notice, academic activities are to resume in all state-owned institutions and all cadre of staff are directed to report to their duty posts immediately.\n“Students across all state-owned tertiary institutions are expected to resume for lectures as necessary measures have been taken to ensure resumption of academic and non-academic activities.”He added, “Management of the affected institutions have been mandated to pay all outstanding salaries immediately.\n“The management of Ambrose Alli University, Ekpoma, is hereby directed to implement a no-work-no-pay policy, declare vacant and advertise the position of any staff that refuses to resume work in line with this directive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Court sentences killers of Pa Fasoranti’s daughter to death by hanging",
    "summarized_story": "An Ondo State High Court has sentenced three of four suspected killers of 58-year-old daughter of Pa Reuben Fasoranti, Mrs Funke Olakunri to death by hanging.\nThe suspects, Muhammed Shehu Usman, Adamu Adamu,and Lawal Mazaje, were convicted by Justice Williams Olamide for conspiracy to murder, kidnapping and armed robbery.\nThe court, however discharged and acquitted the fourth defendant, Auwalu Abubakar, 25 for conspiracy.\nThe police also alleged that the suspects also murdered one Ogunbiyi Matthew aged 65 and also kidnapped one Gerald Igboayaka the same day Funke Olakunri was murdered along Ore/ ljebu Ode Expressway on July 12th, 2019."
  },
  {
    "headline": "After withdrawal from presidential race, Akpabio wins Akwa Ibom NorthWest senatorial ticket",
    "summarized_story": "Former minister of Niger Delta, Godswill Akpabio, has cliched Akwa Ibom North West All Progressives Congress (APC) senatorial ticket.\nThe first party primary conducted on May 28, 2022, for the senatorial district was cancelled following security infractions during the exercise.\nHe said: “I thank the Akwa Ibom North West senatorial district for finding me worthy to be given another opportunity to contest for senatorial seat in the Senate.\nThe aspirants are Sir Joseph Akpan, DIG Ekpo Udom, Obong Emem Ekperikpe Ekpo, and Senator Godswill Akpabio,” Ntukekpo said.\nThe person is Senator Godswill Obot Akpabio."
  },
  {
    "headline": "2023: Tinubu will beat Atiku in Adamawa State – Babachir Lawal",
    "summarized_story": "Former secretary to the government of the federation, Babachir Lawal, has said Bola Tinubu, presidential candidate of the All Progressives Congress (APC) will defeat Atiku Abubakar, candidate of the People’s Democratic Party (PDP) in his home state of Adamawa.\nThe former SGF who is also from Adamawa, in an interview aired on Channels TV, said the APC has its tentacles all over the state, therefore, Atiku will be defeated in 2023.\nAccording to him, “We are there, and we are the ones from Adamawa who will deliver Bola Tinubu in the same way that we delivered Buhari while Atiku was contesting, in the same way, Adamawa delivered Goodluck Jonathan while Atiku was contesting, so it is not a new thing.”“We have our tentacles all over the state; it is our state, and we know our tendencies, Bola Tinubu will win Adamawa state.\n“Whether Tinubu makes it or not, only God knows, but we will work towards it and we believe that we have the instruments, we have the resources – both material and intellectual – to deliver Bola Tinubu as the president.\n“Tinubu is a very good man."
  },
  {
    "headline": "Don’t be deceived by white man’s culture, my blessings doubled after I married 2nd wife – Yul Edochie",
    "summarized_story": "Nollywood producer and actor, Yul Edochie has said he’s been witnessing breakthroughs since he married a second wife, while advising his fans not to be deceived by the culture of white people which promotes monogamy.\nYul wrote “God works in mysterious ways Marrying a 2nd wife has brought me blessings and also elevated my two lovely wives.\nDon’t be deceived by the white man’s culture.\n“Many great men in the bible had one wife, many great men in the same bible also had more than one wife.\n“If God gives you more than one wife it will come with blessings and elevation."
  },
  {
    "headline": "Son out Ronaldo, Mane, Salah in PFA team of the season",
    "summarized_story": "The PFA team of the year results have been unveiled for the Premier League, Championship, League One, League Two and the Women’s Super League.\nIn League One, players from nine different clubs make up the team of the season.\nChampions Forest Green Rovers dominate the League Two team of the season, with five players included in the best XI.\nThree players from Northampton Town – who finished fourth – make the line-up, while Exeter, Tranmere and Newport County have one representative each.\nLeague Two team of the yearLiam Roberts (Northampton Town), Kane Wilson (Forest Green Rovers), Fraser Horsfall (Northampton Town), Peter Clarke (Tranmere Rovers), Jon Guthrie (Northampton Town), Ebrima Adams (Forest Green Rovers), Matt Jay (Exeter City), Nicky Cadden (Forest Green Rovers), Dominic Telford (Newport County), Matt Stevens (Forest Green Rovers), Jamille Matt (Forest Green Rovers)."
  },
  {
    "headline": "BREAKING: Killers of Fasoranti’s daughter sentenced to death",
    "summarized_story": "BREAKING: Killers of Fasoranti’s daughter sentenced to deathThree persons involved in the killing of Olufunke Olakuri, daughter of Afenifere Leader, Pa Reuben Fasoranti, have been sentenced to death by hanging.\nThey were sentenced by an Ondo State High Court sitting in Akure.\nPresiding Judge, Justice William Olamide, however, discharged and acquitted the fourth suspect, Auwàla Abubakar, who is the spokesman of Miyetti Allah.\nOlufunke was shot dead in June, 2019 by gunmen in Ore, Odigbo Local Government Area of Ondo State.\nHer alleged killers were later arrested and arraigned six months after her death."
  },
  {
    "headline": "How Northern Governors Dumped Amaechi For Tinubu",
    "summarized_story": "The ruling All Progressives Congress (APC) chose Bola Tinubu, a former Lagos State governor, as its presidential candidate after weeks of intrigue and uncertainty.\nTinubu, Osinbajo, and Rotimi Amaechi, the former Minister of Transportation, were neck and neck a few weeks before the national convention, despite the odds favoring Tinubu.\nGovernors Simon Lalong of Plateau State, Nasir El-rufai of Kaduna, and Abubakar Badaru of Jigawa State were among those who publicly backed Amaechi.\nThe governors, however, had closed ranks and allied with the former Lagos State governor three days before the poll.\nAccording to an insider, after President Muhammadu Buhari declared that governors should support him in choosing a candidate, the governors met multiple times, but it became evident that more governors preferred Tinubu."
  },
  {
    "headline": "Tinubu Pays Surprise Visit To Osinbajo",
    "summarized_story": "Asiwaju Bola Tinubu, the All Progressives Congress presidential candidate, paid a visit to Vice President Yemi Osinbajo on Thursday.\nAsiwaju had already paid a visit to the President at the Presidential Villa and then decided to pay a surprise visit to the Vice President.\nAsiwaju was meeting with Senator Kabiru Gaya, former Defence Minister Major General Dan Ali (retd), and other allies when he arrived.\nTinubu was greeted by the VP along with his other visitors, and the two exchanged pleasantries.\nTinubu received 1,271 votes in the APC presidential primary, which began on Tuesday and ended on Wednesday, to secure the party’s presidential ticket."
  },
  {
    "headline": "Eight names tipped as Tinubu’s running mate",
    "summarized_story": "Various caucuses in the party are reportedly behind the push for eight names as likely preferred choice as running mate.\nThe eight names that have so far emerged included a leading critic of the APC federal administration.\n“The only drawback for Kashim Shettima is that he’s not Hausa/Fulani and that it will be the first time Hausa/ Fulani will not be represented in government.\n“Lalong is neither Hausa nor Fulani stock, so the majority Hausa Fulani may not accept him.\nThose pushing for el-Rufai to become running mate claimed that it was the key demand of delegates when Tinubu visited Kaduna to lobby them."
  },
  {
    "headline": "2023: Be mindful of Nigeria’s diversity, Northern Christian Elders caution Atiku, Tinubu, Obi, others on choice of running mate",
    "summarized_story": "The Northern Christian Elders Forum (NOSCEF) has once again, sounded a note of warning that the country’s diversity should be taken into consideration while choosing their running mates.\n“A new era and government devoid of politics of exclusion, discrimination and injustice,” NOSCEF said.\nNOSCEF said they have watched with keen interest, particularly the emergence of various Presidential candidates on the platform of various parties for the 2023 general elections in Nigeria.\nWe do not expect any patriot to, by so doing, again open the wounds for our past bitter religious divides.\n“We need, as a nation, a united front to forge a new Nigeria, that will bring people together across religious divides because we do not lack quality across the religious and regional divides,” it insisted."
  },
  {
    "headline": "Tinubu pays surprise visit to Osinbajo, day after APC presidential primary",
    "summarized_story": "The presidential candidate of the All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu Thursday night paid a surprise visit to Vice President Yemi Osinbajo at his Aguda House Residence, Presidential Villa, Abuja.\nTinubu was accompanied by Governor Babajide Sanwo-Olu of Lagos Lagos.\nHe was received by the Vice President and the Senator representing Kano South Senatorial District Mr Kabir Gaya, among others.\nShare this: TwitterFacebook"
  },
  {
    "headline": "As INEC sets June 17 deadline on running mate, NASS: APC northern governors meet Tinubu, mull Muslim-Muslim ticket",
    "summarized_story": "“All political parties are required to upload the details of their candidates for each constituency to the INEC Candidate Nomination Portal (ICNP).\nSimilarly, the list of all Presidential and Governorship candidates must be accompanied by the names of their running mates (i.e.\nTinubu/APCAnd in the APC camp for instance, there is seeming disquiet over the choice of running mate.\nBy the party’s zoning arrangement, the North-east is expected to produce the running mate to the party’s flag bearer.\nThis is our project and by God’s grace, we will succeed,’’ the APC national chairman said."
  },
  {
    "headline": "Jos Disco urges BIRS to unseal office",
    "summarized_story": "By Sunday Ogli, MakurdiManagement of Jos Electricity Distribution, JED, Plc, has called on the Management of BIRS to swap its tax liability by deducting it from the state government’s indebtedness to the company.\nBenue State Government is indebted to Jos Disco as at 31st December, 2021 to the tune of ₦157,943,414.14 million while Jos Disco owes state’s tax agency; BIRS ₦156,515,414.47 million.\nHowever, BIRS, as a result of the debt, sealed off the operational office of Jos Disco in Gboko and Makurdi on Wednesday.\n“This could be gleaned from several correspondences and meetings to this effect”, the press release stated.\nDr Elijah further disclosed that to resolve the impasse, the two bodies had mandated their tax consultants to ascertain the true situation of things."
  },
  {
    "headline": "NACC urges Nigerian exporters to take advantage of AGOA",
    "summarized_story": "Nigerian American Chamber of Commerce (NACC) Abuja Chapter has called on all Shippers to take advantage of the window provided by the African Growth and Opportunity Act (AGOA) Programme to boost trade between Nigeria and the United States of AmericaThe Executive Secretary of NACC Abuja Chapter, Mr. Ayo Salaam disclosed that Nigerian companies have not taken advantage of the AGOA because they export mainly oil to the United States.\nThe AGOA forum is one of the key components of U.S African strategy that focuses on increasing the United States Trade and Investment in Africa as a mechanism for job creation within the continent.\n“The AGOA project initiated by the United States of America in 2000 was to help develop trade and facilitate exporting over 6000 goods into America with no tariff.\nSpeaking at the event, a diplomat, Ambassador Bayo Idowu, encouraged all shippers to leverage on the AGOA partnership.\n“We are readily available to provide assistance and advice on how Nigerian products can be accepted in the American market."
  },
  {
    "headline": "NDE uplifts 630 Anambra youths on vocational skills",
    "summarized_story": "Tony Oraeki, AwkaThe National Directorate of Employment, NDE, has commenced the training of 630 unemployed youths in Anambra state on various vocational skills.\nThe training would be on two categories which are Basic National Open Apprenticeship Scheme, B-NOAS, and Advanced National Open Apprenticeship Scheme, A-NOAS, with 420 and 210 beneficiaries respectively.\nAddressing the beneficiaries at the orientation ceremony in Awka yesterday, the NDE State Coordinator, Mrs. Chika Ufelle said that B-NOAS is a scheme through which the unemployed youths both male and female are recruited to acquire marketable vocational skills for decent job opportunities.\nShe also said the trainees under A-NOAS are designed for artisans who graduated from B-NOAS with an aim to upgrade their skills to higher levels of competence.\n” I very much appreciate the effort of NDE to avail me this opportunity to be trained in Computer Appreciation.” She said."
  },
  {
    "headline": "Buhari appoints Ogbobe as PRODA DG",
    "summarized_story": "Eunice OrikePresident Muhammadu Buhari has approved the appointment of Dr. Peter Okwudilichukwu Ogbobe as the substantive director-general of the Projects Development Institute PRODA,Enugu, with effect from 20th May 2020.\nAccording to the statement, the appointment of Ogbobe takes effect immediately and is a non-renewable five-year tenure.\nUntil his appointment, Ogbobe was the director, information communication technology ICT, National Board for Technology Incubation NBTI.\nOgbobe is a member of the Council for the Regulation of Engineering in Nigeria COREN,Nigeria Society of Engineers NSE,American Society of Mechanical Engineers ASME, among others.\nAfter the civil war, it was renamed PRODA and enlisted as one of the agencies under the Federal Ministry of Science, Technology and Innovation FMSTI."
  },
  {
    "headline": "AEDC, EFCC resolve rift – Mgt",
    "summarized_story": "Onu OkorieAbuja Electricity Distribution Company AEDC has disclossed that the recent rift between them and the Economic and Financial Crimes Commission EFCC has been resolved.\nThis was made known in a statement made available to the media yesterday in Abuja.\nAEDC recently alleged that a team of EFCC staff visited the premises of AEDC without notice or any warrants and violated the rights of law-abiding citizens of this country.\nAnd that several staff of the company were physically assaulted, unlawfully arrested and arbitrarily detained without cause or justificationHowever, in a twist of event, the Abuja Disco said that the two organisations have resolved the matter amicably.\nIn the light of this development our company AEDC shall not be seeking legal redress.”“We wish to also make clear that as a responsible corporate citizen AEDC will continue to collaborate and cooperate with the EFCC and other law enforcement agencies, in their activities and operations when required to do so.”"
  },
  {
    "headline": "Court Sentences Three To Death For Killing Funke Olakuri",
    "summarized_story": "An Ondo State High Court sitting in Akure, the state capital, has sentenced three persons to death for killing Olufunke Olakuri, the daughter of Afenifere leader, Pa Reuben Fasoranti.\nWhile four persons were accused of the crime, the trial judge, Justice William Olamide on Friday, discharged and acquitted one of them.\nOlufunke Olakuri, the daughter of Afenifere leader, Reuben Fasoranti, was shot dead on July 12 2019 while traveling between Kajola and Ore, along Ondo/Ore Highway.\nMore to follow…"
  },
  {
    "headline": "INEC Gives Atiku, Obi, Tinubu And Others One Week To Name Running Mates",
    "summarized_story": "The Independent National Electoral Commission (INEC) has set a June 17th, 2022 deadline for presidential candidates to name their running mates.\n“Similarly, the list of all Presidential and Governorship candidates must be accompanied by the names of their running mates (i.e.\nOne of those against a Muslim-Muslim presidential ticket is Babachir Lawal.\nSo, we must bear in mind that the vice (presidential candidate) is going to contribute to winning that election,” he said on Channels Television’s Politics Today on Thursday.\n“Extending that consideration to the Muslim-Muslim ticket, I live among the Christians, and I know that among the Christians, the question of Muslim-Muslim ticket is a no-go area; it is dead on arrival."
  },
  {
    "headline": "2023 Presidency: Muslim-Muslim Ticket Is Dead On Arrival – Babachir Lawal",
    "summarized_story": "﻿ ﻿The consideration of a Muslim president and a Muslim vice president in the country in 2023 is dead on arrival, Mr Babachir Lawal has said.\nLawal, a former Secretary to the Government of the Federation (SGF), stated this on Thursday during his appearance on Channels Television’s Politics Today.\n“You can have the best ticket but if you don’t win the election, it’s a waste of time,” Lawal declared.\n“So, we must bear in mind that the vice (presidential candidate) is going to contribute to winning that election.”“Extending that consideration to the Muslim-Muslim ticket, I live among the Christians, and I know that among the Christians, the question of Muslim-Muslim ticket is a no-go area; it is dead on arrival.\nHe stressed the need for the party to make the necessary considerations before choosing its vice president ahead of the coming polls."
  },
  {
    "headline": "ISWAP Behind Owo Church Attack – National Security Council",
    "summarized_story": "﻿The National security Council has blamed the Islamic State West Africa Province (ISWAP) for the attack on St. Francis Catholic Church, Owo, that led to the death of about 38 persons on June 5.\nThe Minister of Interior, Rauf Aregbesola, said this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nHe disclosed that security agencies, particularly the police, have been directed to apprehend the perpetrators.\nThe former governor said the attack has no ethnic-religious connection, affirming that the group’s activity has nothing to do with religion.\n“The figure I have now shows that 127 persons were involved and that the number of death now is 40."
  },
  {
    "headline": "Suspected Case Of Monkeypox Reported In Zamfara",
    "summarized_story": "One suspected case of monkeypox has been reportedly in Zamfara State.\nThis is according to the Zamfara State Government, noting that health personnel is currently examining the situation to ascertain if it is a confirmed case.\nThe State Commissioner for Health, Aliyu Abubakar said though there is no confirmed case of monkeypox in the State, the ministry has put in place measures to prevent the outbreak of the disease.\nAccording to him, the government’s plans are underway to acquire drones that will help in the delivery of medical consumables to Hospitals in troubled areas.\nHe further added that Insecurity is one of the major challenges in ensuring full health coverage in the state."
  },
  {
    "headline": "Father Alia Wins Benue Apc Governorship Re-run Primary Election -",
    "summarized_story": "Fr Hyacinth Iormem Alia, has won the Governorship primary election rerun conducted by the All Progressives Congress, APC, in 12 Local Government Areas and 3 council wards in Buruku Local Government in Benue State.\nThe rerun was conducted in Ogbadibo, Ushongo, Konshisha, Oju, Apa, Kwande, Agatu, Ohimini, Ado, Obi, Okpokwu and Apa Local Government Areas.\nSecretary of the Committee, Emma Maji, described the Rerun election as free, fair and credible.\nShortly after the declaration of results, State Deputy Chairman of the party, Stephen Tsav on behalf of the State Chairman, Comrade Austin Agada, presided over the congress that affirmed the outcome of the rerun gubernatorial primary election.\nThe Benue APC had conducted its Governorship primary election on the 27th of May, 2022 with Alia as the winner."
  },
  {
    "headline": "Governor Ortom denies conspiring with aspirants against APC -",
    "summarized_story": "Benue State Governor Samuel Ortom has dismissed allegation of the All Progressives Congress (APC) in accusing him of conspiring with some aspirants of the party to stop it from fielding a governorship candidate for the 2023 elections.\nHe added that it was Governor Ortom’s fault that APC could not conduct a transparent and credible governorship election in Benue https://www.tvcnews.tv/purplegold/post.php?post=199307&action=edit#State.\n“Was the Governor responsible for the petitions that aggrieved aspirants of the party filed before the appeal panel against the governorship primary election?\nWas APC expecting PDP to fold its arms and watch the party conduct a flawed election and produce a candidate through fraudulent means?\n“Governor Samuel Ortom and the entire PDP family in Benue place premium on internal democracy and due process of the law; hence will not be distracted by the baseless accusations from APC."
  },
  {
    "headline": "Ohanaeze Denies Describing Tinubu’s Emergence As ‘Calamity’",
    "summarized_story": "The Ohanaeze Ndigbo, has disclaimed a report circulating in some sections of the media, claiming that it described the election of Asiwaju Ahmed Bola Tinubu as the presidential candidate of the APC as a ‘national calamity.\nThe apex igbo socio cultural organization dissociated itself from the publication, said it did not emanate from the group.\nOhanaeze, in a statement by its national publicity secretary, Dr Alex Ogbonnia, said the group have no hands in the contents, context, comprehension and delivery of the unfounded statement.\nIt described the statement as unfortunate, saddened with its contents, especially the attacks on the person and health status of Asiwaju Bola Ahmed Tinubu.\nDr Ogbonnia said, “The secretary general of Ohanaeze Ndigbo Worldwide is H.E Amb."
  },
  {
    "headline": "VP Osinbajo congratulates Asiwaju on victory at APC Presidential primary",
    "summarized_story": "Vice President Yemi Osinbajo, SAN, congratulated Asiwaju Bola Ahmed Tinubu on his victory in the ruling All Progressives Congress Presidential Primaries held on Wednesday.\nIn a statement he personally signed, the VP said;“I congratulate Asiwaju Bola Ahmed Tinubu on his victory at our party primaries and his emergence as the Presidential Candidate and Flagbearer of our great party, the APC for the forthcoming 2023 Presidential Elections.\n“I also congratulate President Muhammadu Buhari and all leaders of the APC for a successful Special Convention and Presidential Primary.\nHis wealth of experience will certainly be critical in our party’s continued efforts to attain a more secure and prosperous Nigeria.\nOsinbajo added that all members of the APC, regardless of who voted who, everyone must now unite behind the Presidential Candidate and Flagbearer to ensure victory in the 2023 elections."
  },
  {
    "headline": "Nigeria: Al-Mustapha Emerges Action Alliance Presidential Candidate – Arise News",
    "summarized_story": "Hamza Al -Mustapha, former Chief Security Officer to the late military ruler Sani Abacha has emerged the presidential flag bearer of the Action Alliance for the 2023 presidential elections.\nArise Correspondent, Mary Chinda, monitored the party’s primary and reports."
  },
  {
    "headline": "Yunusu Tanko: Peter Obi Remains The Legitimate Presidential Candidate of the Labour Party",
    "summarized_story": "Yunusu Tanko, Spokesperson National Consultative Forum, Labour Party, denies any faction in the Labour Party, establishing that any person claiming to be a factional chairman is being fraudulent."
  },
  {
    "headline": "Nigeria VP Osinbajo Congratulates Tinubu, Says Sterling Contributions to Democracy Stand Him Out",
    "summarized_story": "Nigeria’s Vice President Yemi Osinbajo congratulated Bola Tinubu on his emergence as presidential candidate of the ruling All Progressives Congress (APC), stressing that his contributions to Nigeria’s democracy and its progress stand him out.\nI also congratulate President Muhammadu Buhari and all leaders of the APC for a successful Special Convention and Presidential Primary.\n“For many decades, our flag bearer has shown passion, patriotism, courage and determination in the cause of nation building.\nHis sterling contributions to our democracy and its progress stand him out.\nHis wealth of experience will certainly be critical in our party’s continued efforts to attain a more secure and prosperous Nigeria."
  },
  {
    "headline": "APC Chair Adamu Pledges to Work Hard for Tinubu, Northern Governors Visit Flagbearer",
    "summarized_story": "Our book will not be complete until you have delivered me as president.”Tinubu described the APC national chairman as a straightforward, focused, and courageous man, whom he had worked together with as a fellow-governor in 1999.\nOthers were National Vice Chairman (South-west), Dr Isaac Kekemeke; National Vice Chairman (South-south), Chief Hon.\nNorthern APC Governors Visit Tinubu, as Search for Running Mate BeginsMeanwhile, some members of the All Progressives Congress (APC) in the Northern States Governors Forum, on Thursday, paid a visit to the presidential candidate of the party, Senator Bola Tinubu, in Asokoro, Abuja.\nThe northern governors, who visited Tinubu, included governor of Kebbi State and Chairman of Progressive Governors’ Forum (PGF), Abubakar Atiku Bagudu; Governor of Kastina State, Aminu Masari; Kano State Governor, Abdulahi Ganduje; Gombe State Governor, Inuwa Yahaya; Plateau State Governor, Simon Lanlong; and Niger State Governor, Abubakar Bello.\n“Himself (Tinubu) and the party leadership, you can rest assured that they will bring the best vice presidential candidate that will best serve the interest of Nigeria."
  },
  {
    "headline": "Tinubu Has Track Record to Lead APC to Victory in 2023, Buhari Says",
    "summarized_story": "The president, who later hosted Tinubu, said the APC presidential primary was one of the most competitive and peaceful in the history of Nigeria’s democracy.\nThe president stated that the party’s standard-bearer had the capacity, commitment, and particularly enviable track record of leading APC to electoral victory.\n“Your commitment in pursuit of equity and fairness speaks volumes in the cooperation displayed by APC governors.\n“I look forward to working closely with APC governors to support Senator Bola Ahmed Tinubu and all our APC candidates to success in 2023.\nTinubu was at the villa to thank the president for his support and successful hosting of the APC presidential primary."
  }
]