[
  {
    "headline": "Full letter: How I knew Buhari had no preferred presidential aspirant, Tinubu writes",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, has commended the President, Major General Muhammadu Buhari (retd.\nTinubu scored 1,271 votes to clinch the APC presidential ticket for the 2023 general election.\nMr. President, as the night of 6 June turned to morning of 7 June, I fully understood and appreciated your stance.\nI have taken note of the message you sent to all Presidential Candidates in your Democracy Day speech to the nation on the 12th June, 2022.\nAsiwaju Ahmed Bola TinubuAPC Presidential Candidate"
  },
  {
    "headline": "Army promises continued training of personnel for combat readiness",
    "summarized_story": "By Steve OkoThe Nigeria Army has promised to continue to train and re-train its personnel to enhance their combat-readiness.\nGen. Everest Okoro, said that the Army would continue to prioritise training and professionalism.\n“Therefore, the just concluded competition is not only timely but key in improving the combat readiness of our Warrant Officers and Senior Non Commissioned Officers in 82 Division.\nThe Golden spoon award for the best Brigade from the rear was collected by 44 Engineer Brigade Enugu.\n82 Division Garrison Brigade Enugu came first in weapon handling while 44 Engineer Brigade emerged best in navigation."
  },
  {
    "headline": "Our religion poisoned by toxic politics – Bishop Kukah",
    "summarized_story": "….charges Christians on barking dogBy Providence AyanfeoluwaThe Catholic Bishop of Diocese of Sokoto, Matthew Kukah, yesterday, said that toxic politics has poisoned religion in Nigeria, while charging Christians to walk towards the barking dog.\nKukah said Nigeria now ranked as 9th worst country for Christians to live in the world.\nHis words: “Now Nigeria is being ranked as 9th worst country for Christians to live in.\nToxic politics has now poisoned our religion.\nAniagwu said: “There is a way forward if we allow through democracy to prevail and elect the right people."
  },
  {
    "headline": "Police arrest killer of woman in a hotel in Kebbi",
    "summarized_story": "By Haruna Aiyu, Birnin KebbiThe Kebbi state police command Saturday arrested alleged killer of a 30 year-old Jennifer Goje, who was murdered in her hotel room at river side hotel in Zuru local government area of the state.\nConfirming the arrest of the suspect Kebbi state police image maker SP Nafiu Abubakar said that, the suspect one Bashir Muhammed allegedly murdered Jennifer Goje in her hotel room in Zuru on June 3rd2022 and ran away.\nHowever, following intensive search the suspect was apprehended in Kano where he has been hiding since he committed the crime."
  },
  {
    "headline": "Hijab Ban: MSSN Lagos applauds Supreme Court judgment, urges compliance",
    "summarized_story": "By Miftaudeen RajiThe Muslim Students Society of Nigeria (MSSN), Lagos State chapter has applauded the judgment of the Supreme Court upholding the use of hijab in Lagos schools.\nThe apex court dismissed an appeal by the Lagos State Government and upheld the use of hijab in Lagos schools.\nIn his reaction to the judgment, Friday, the Amir (President) of MSSN Lagos, Miftahudeen Thanni, said with the judgment, students in public primary and secondary schools in Lagos State can now wear hijab to school without harassment.\nHe said, “The judgement simply means that though hijab is not mandatory in Lagos schools, Muslim students who wish to wear it are free to do so and legally allowed.\nThe case, CA/L/135/15, is between the Lagos State Government, Miss Asiyat AbdulKareem (through her father), Miss Moriam Oyeniyi and the Muslim Students’ Society of Nigeria."
  },
  {
    "headline": "Ekiti election results: APC’s Oyebanji nears victory",
    "summarized_story": "Following the results announced so far by the Independent National Electoral Commission (INEC) on Sunday, the All Progressive Congress (APC) candidate, Biodun Oyebanji nears victory as the governor-elect of Ekit state.\nOyebanji is presently ahead in the race among the three leading candidates, who included PDP’s Bisi Kolawole and SDP’s Engineer Olusegun Oni, a former governor.\nINEC has announced 10 out of the 16 Local Government Areas in the state, with Oyebanji scoring 107,913 aggregate votes as Oni garnered 42,122 votes while Kolawole of the PDP polled 40,838.\nSee a breakdown of results according to wards (Click here ):"
  },
  {
    "headline": "Yobe govt talks tough against illegal mining, vows to sanction unlicensed miners",
    "summarized_story": "Yobe State Government has urged miners operating in the state without license to obtain one from the relevant authorities or risk being sanctioned accordingly.\nKarasuwa added that registered miners must also inform emirate council(s) where the mineral resource is available and that emirate(s) must also convey the message down to District, Village as well as Ward heads respectively.\nThe committee was also at Pataskum and Tikau emirate councils where the same message was delivered to them by the Committee’s Chairman, Hon.\nSidi Yakubu Karasuwa.\nBoth Emirs have agreed in principles to wholeheartedly support the initiative aimed at reducing to barest minimum indiscriminate mining which they believed is harmful to the environment."
  },
  {
    "headline": "Ekiti governorship election: Live results from Local Government Areas",
    "summarized_story": "More results are coming in from Local Governments in the ongoing governorship election in Ekiti State.\nINEC officials have concluded the voting exercise in most Polling Units and have sent results to local government headquarters.\nDAILY POST reports that the Ekiti State governorship polls was keenly contested between candidates of the All Progressives Congress, APC, the Social Democratic Party, SDP, and the Peoples Democratic Party, PDP.\nThe All Progressives Congress (APC), candidate Biodun Oyebanji, has already scored the highest number of votes in Emure Local Government Area in Saturday’s Ekiti State governorship election.\nEFON LGAA- 06AAC-04ADC-17ADP-77APC-4012APGA-11APM-05APP-11LP-09NNPP-04NRM-16PDP-6303PRP-20SDP-339YPP-7ZLP-2TOTAL VALID VOTES – 10839REJECTED VOTES- 204TOTAL VOTES CASTED -11043RESULTSLGA: IREPODUN/IFELODUNAPC: 13,125PDP: 4712SDP: 5010A: 5AAC: 33ADC: 141ADP: 191APGA: 16APM: 20APP: 112LP: 9NNPP: 29NRM: 20PRP: 33YPP: 44ZLP: 15FINAL RESULT OF EFON LGAADP-77APC-4012PDP-6303PRP-20SDP-339"
  },
  {
    "headline": "Kano Gov, Ganduje visits Hajj House, Abuja",
    "summarized_story": "According to the Kano state governor, he was in the Hajj House to make a request and to exchange pleasantries.\nThe governor was accompanied in the visit by the Executive Secretary, Kano State Pilgrims’ Welfare Board, Alhaji Muhammad Abba Dambatta, Alhaji Idris Abdullahi Dawakin Tofa, the Permanent Secretary, Protocol Directorate; and S. AbdulHadi, Liaison Officer, Kano State Government House, Abuja.\nFinally, Alhaji Umar Ganduje requested for additional slots for his state if by chance there is any available.\nAlhaji Hassan also described Kano as important to NAHCON promising to assist Kano with its requests out of respect for the state.\nRegarding halting of the hotel building, the NAHCON Chairman blamed financial constraints for the stoppage."
  },
  {
    "headline": "Shehu Sani reacts to ban of Catholics from Mbaka’s Adoration Ministry",
    "summarized_story": "Shehu Sani, a former Kaduna Central Senator has reacted to the decision asking Catholic faithful to stay away from the Adoration Ministry led by Rev.\nThe Catholic Bishop of Enugu Diocese, Bishop Calistus Onaga had imposed a ban on Mbaka’s Adoration Ministry.\nDAILY POST reports that this is coming on the heels of Mbaka’s outburst against the presidential candidate of the Labour Party, Peter Obi.\nReacting, Sani likened Mbaka’s situation to that of the removal of Sheikh Khalid as Imam of Apo Juma’at mosque.\nHe noted that like Khalid Mbaka was removed due to their views."
  },
  {
    "headline": "Fr. Mbaka obeys Bishop’s order, shuts down Adoration Ministry",
    "summarized_story": "Ejike Mbaka has complied with the order of the Bishop of the Diocese banning his Adoration Ministry.\nDAILY POST had reported that following Mbaka’s utterances against Mr. Peter Obi, his Adoration Ministry, Enugu, was shut down by Bishop Callistus Onaga of the Enugu Catholic Diocese.\nThe statement posted on the official Facebook page of the Ministry reads:“Dear Adorers, There will be no program starting from tomorrow being 19th June 2022 at Adoration Ministry Enugu Nigeria Amen, Umuchigbo Emene, Enugu State.\n“God bless Adoration Ministry Enugu Nigeria Amen and God Bless Our Spiritual Director, Rev Fr, Ejike Mbaka.\n“Keep praying for Our Daddy and may God Bless you all.”"
  },
  {
    "headline": "Oyebanji trounces Oni in his local government The Nation Newspaper",
    "summarized_story": "The governorship candidate of the ruling All Progressive Congress, (APC) Biodun Oyebanji won in the Ido/Osi council area of the Ekiti State, where his counterpart in the Social Democratic Party, Segun Oni hails from.\nAPC garnered a total of 10321 votes to defeat SDP to distant second of 9, 489 votes.\nThe result was declared by the Collation Officer for the local governmen at the INEC State collation office in Ado-Ekiti"
  },
  {
    "headline": "Ekiti 2022: APC's Oyebanji leads in four LGAs The Nation Newspaper",
    "summarized_story": "Ekiti 2022: APC’s Oyebanji leads in four LGAsThe All Progressive Congress candidate in the Saturday’s governorship election, Mr. Biodun Oyebanji has won four local government areas.\nIn Ijero LGA, the APC polled 13, 754 votes while SDP scored 5006 votes and PDP garnered 4,897 votes.\nThe results in Emure showed that APC scored 7728 against SDP’s 3446.\nIn Ekiti Southwest LGA, APC got 9679 votes, while SDP scored 4577 votes and PDP polled 4475 votes.\nIn Ikere LGA , the APC candidate got 12,089 botes, while his SDP counterpart got 1947 votes and PDP polled 3789 votes."
  },
  {
    "headline": "Vote buying mars Ekiti governorship poll The Nation Newspaper",
    "summarized_story": "There was a massive turnout of voters during the Saturday’s governorship poll in Ekiti State as electorates trooped out as early as 6:45am.\nThe INEC officials and materials arrived almost polling units early before the official time for the commencement of voting.\nEarlier, the SDP governorship candidate, Segun had made allegations of vote buying while speaking with newsmen after casting vote at his Ward 2, unit 6, Ifaki Ekiti.\nSome political party agents present at the polling unit said officials of the Nigeria Security and Civil Defence Corps were on routine patrol when they stormed the polling unit.\nHon Afuye said he had voted at his polling unit and had to monitor the election around his vicinity."
  },
  {
    "headline": "Tinubu praises Ganduje as Kano Gov becomes Aare Fiwajoye of Ibadan land The Nation Newspaper",
    "summarized_story": "Presidential flag bearer of the ruling All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu on Saturday attended the conferment of a chieftaincy title of Aare Fiwajoye of Ibadan Land on Kano Governor Abdullahi Ganduje.\nGanduje”s wife Prof Hafsat Ganduje was conferred with the title of Yeye Aare Fiwajore of Ibadan Land.\nChief Imam of Ibadan Land, Sheikh AndulGaniyu Abubakar (Agbolomokekere), conferred another title of Alaudeen of Yorubawa (Aladdin of Yoruba) on Governor Ganduje.\nMany Commissioners, top government functionaries, party leaders and elders were on the governor’s entourage who attended the conferment ceremony.\nA statement by Chief Press Secretary to the Governor of Kano State, Abba Anwar added that all Emirs from Kano state, led by the Emir of Kano, Alhaji Aminu Ado Bayero were in attendance."
  },
  {
    "headline": "Ex-Gov Fayose delivers ward for PDP's Kolawole The Nation Newspaper",
    "summarized_story": "Former Governor Ayodele Fayose won his Afao ward in Ifelodun/ Irepodun local government Areas of Ekiti State for the governorship flagbearer of the Peoples Democratic Party, Otunba Bisi Kolawole.\nAccording to the results obtained on the INEC official result portals by our reporter, the PDP won six out of the eight wards in the governorship election with a wide margin.\nThe PDP polled a total of 776 votes while the APC garnered 571 votes and SDP garnered 232 votes.\nThe results are:St. David primary School, maternity Area, Afao ward, unit 01APC–106PDP–163SDP–29Egbira Farm settlement, Afao wardAPC–57PDP–100SDP–45Front of Maternity, Afao wardAPC–68PDP–133SDP–23Adeosun compound, Afao ward IIAPC–83PDP–113SDP–75Adeosun compound, Afao ward IAPC–104PDP–157SDP–036Open Space at Olorunfemi Area, Afao wardAPC–018PDP–035SDP–009Open Space at Temidire Area, Afao wardAPC–21PDP–14SDP–05Front of Oba’s Palace, Araromi Obo, Afao WardAPC–114PDP–61SDP–10"
  },
  {
    "headline": "Ekiti guber: APC’s Oyebanji in early lead",
    "summarized_story": "The results that have been obtained as at 7:30p.m on Saturday showed that the APC candidate, Biodun Oyebanji, was in early lead, while the SDP candidate, Segun Oni, was closely following behind.\nFigures obtained in some of the polling units showed that APC was in early lead while SDP maintained a close contest.\nIn Ijero, Oke-Iroko, APC led with 74 votes, SDP had 33 votes and PDP got 31 votes.\nAs early as 7:30 a.m, many electorate were sighted at different polling units in Ado-Ekiti, even before the arrival of officials of the Independent National Electoral Commission (INEC).\n“A major trending item was the purported withdrawal letter of the SDP candidate Segun Oni, and his endorsement of the PDP candidate, which circulated across social media."
  },
  {
    "headline": "Obi: Mixed reactions trail ban of Fr. Mbaka’s Adoration Ministry",
    "summarized_story": "From Magnus Eze, Geoffrey Anayanwu, Jude Chinedu (Enugu), Felix Ikem (Nsukka) and Chijioke Agwu (Abakaliki)The Catholic Bishop of Enugu Diocese, Calistus Onaga, has shutdown Rev.\nEjike Mbaka’s Adoration Ministry of Enugu, Nigeria (AMEN) over the Spiritual Director’s recent outburst against the Labour Party presidential candidate, Mr Peter Obi.\nAs the dust raised by the Mbaka outburst is yet to settle, Bishop Onaga shutdown his Adoration Ministry in Enugu.\nIn a letter addressed to ‘All the Clergy, Religious and Lay faithful in the Catholic Diocese of Enugu’, the bishop banned Catholic faithful from having anything to do with the Adoration Ministry.\nCommenting on the ban, Ofo Daniels cautioned that “antichrist members may likely hide under the guise as Peter Obi’s supporters to destroy the Adoration Ministry facilities or possibly take human lives."
  },
  {
    "headline": "How my life changed after becoming beauty queen –Ifeoma Okenwa – The Sun Nigeria",
    "summarized_story": "By Daniel KanuBeauty queen, Ifeoma Anisha Okenwa, has a lofty mission.\nOkenwa beat 26 other contestants from across the country to emerge winner of the National Queen Nigeria 2021 beauty pageant, organised by Sanj BornStar Entertainment.\nHere are excerpts:How has it been since you emerged winner of the National Queen beauty pageant?\nOne is the deputy governor of my state, Abia State, His Excellency, Ude Oko Chukwu.\nThey should associate with the National Queen Nigeria to help build their modeling dreams and careers."
  },
  {
    "headline": "2023: Obi, Kwankwaso, others in merger talks",
    "summarized_story": "From Okwe Obi, AbujaThe presidential candidate of the New Nigeria Peoples Party (NNPP), Senator Rabiu Kwankwaso, has said that his party is in talks with the presidential candidate of the Labour Party, Peter Obi, for a possible alliance in next year’s poll.\nKwankwaso made this know in an interview with BBC Hausa Service yesterday.\nWe hope for good results that will give Nigeria a chance to be alive, once again,” the tweet read.\n“Before now, there had been calls for presidential candidates, Rabiu Kwankwaso and Peter Obi to work together in the coming election.\nKwankwaso and Obi were chieftains of the People’s Democratic Party (PDP), until earlier in the year when they dumped the party for NNPP and LP."
  },
  {
    "headline": "Abia North: Orji Kalu’s legislative scorecard",
    "summarized_story": "A Bill For An Act To Amend The Administration Of Criminal Justice Act 2015 And Other Related Matters Bill 2020.\n13.Federal University Of Medical Sciences And Biomedical Technology, Umunna, Bende LGA, Abia State Establishment Bill, 2022.\nUrgent Need To Conduct A Viable And Independent Stress Test On The Generation, Distribution And Transmission Capacities Of The Power Sector.\nUrgent Need For Banking Infrastructure At Abia North Senatorial District Of Abia State.\nUrgent Need To Relist Management Sciences Programmes Of Michael Okpara University Umudike, Abia State In The JAMB Admissions Brochure."
  },
  {
    "headline": "EKITI GOVERNORSHIP ELECTION RESULTS 2022 (As announced by INEC)",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Live Updates: Ekiti Governorship Election 2022",
    "summarized_story": "The minister said that he would not have lost the 2003 election, if the election had been credible like the ongoing governorship election in the state.\nOyebanji spoke in Ikogosi Ekiti, Ekiti West Local Government Area of Ekiti State after voting at Okelele ward 06 unit 003 in the town.\n*At Ward 13, unit 01, Itanla beside delight hotel, Ilawe road, Ado Ekiti there is confusion as to whether their polling unit has been moved.\nIn some units in Ado Ekiti, Ilawe, Igede and Iyin Ekiti, voters were being accredited with the aide of Bimodal Voter Authentication System(BVAS) and given the ballots to vote.\nThe influence of Segun Oni’s Deputy, Ladi Owolabi in Ado Ekiti is also enormous."
  },
  {
    "headline": "Breaking: APC Wins Ekiti South-west",
    "summarized_story": "The Ekiti State All Progressives Congress Governorship candidate, Biodun Abayomi Oyebanji, has won the electon in Ekiti South-west Local Government, polling 9,679 votes.According to the result announced by iNEC, Oyebanjo defeated his closest rival, Segun Adebayo Oni of the Social Democratic Party, who scored 4,577 votes.Bisi Kolawole of the Peoples Democratic Party scored 4,474 votes to emerge thirdShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ekiti Decides: Oyebanji, Oni, Kolawole in Three-Horse Race",
    "summarized_story": "The electoral umpire had earlier revealed that 988,923 voters captured in the Commission’s register would decide who becomes the new Ekiti State Governor.\nOyebanji and Kolawole are from Ekiti Central Senatorial District, comprising five local government areas – Ado, Irepodun/Ifelodun, Efon, Ijero and Ekiti West.\nThe influence of Segun Oni’s Deputy, Ladi Owolabi in Ado Ekiti is also enormous.\nVictory for APC Ekiti Central may be by a narrow margin.\nAPC won the five councils in Ekiti North in the last election, but Oni was still in the ruling party then."
  },
  {
    "headline": "Owo Killings: Akeredolu Weeps at Burial, Laments Failure to Protect Citizens",
    "summarized_story": "Fidelis David in AkureGovernor Rotimi Akeredolu of Ondo State yesterday blamed himself and government at all levels for failing to defend the victims of June 5 attack on St Francis Catholic Church, Owo, which claimed 40 lives.\nAkeredolu made the declaration during the funeral Mass for 18 of the victims, held at the Mydas Resort and Hotel, Owo.\nAkeredolu, who wept during his speech, said the government failed to protect the victims of the terror attack.\nResponding, the Bishop of Ondo Catholic Diocese, Dr. Jude Arogundade declared that Akeredolu had not failed in protecting his people.\n“Indeed, the event catapulted Ondo State, the Catholic Diocese of Ondo and Nigeria into the limelight of world attention, unfortunately, for the wrong reason."
  },
  {
    "headline": "LIVE UPDATE: Ekiti State Governorship Election",
    "summarized_story": "LIVE UPDATE: Ekiti State Governorship ElectionHere, we'll give you a blow-by-blow account of how proceedings are unfolding in all 2,445 polling units where voting will take place."
  },
  {
    "headline": "LIVE UPDATE: Ekiti State Governorship Election",
    "summarized_story": "LIVE UPDATE: Ekiti State Governorship ElectionHere, we'll give you a blow-by-blow account of how proceedings are unfolding in all 2,445 polling units where voting will take place."
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "LIVE: INEC set to announce winner of Ekiti governorship election",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "LIVE: INEC set to announce winner of Ekiti governorship election",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "Oyebanji takes early lead in Ekiti guber, wins Segun Oni's LGA",
    "summarized_story": "Biodun Oyebanji, the candidate of the All Progressives Congress (APC), has taken an early lead in the governorship election of Ekiti state.\nOyebanji secured 13,125 votes in Irepodun/Ifelodun to defeat Kolawole who polled 4,712, while Segun Oni of the Social Democratic Party (SDP) had 5,010 votes.\nIn Ekiti West, Oyebanji secured 15,322 votes to defeat Kolawole who had 3,386 and Oni who polled 3,863 votes.\nAdvertisementSimilarly, Oyebanji had the most votes in Gbonyin LGA, polling 11,247 votes to beat Oni who scored 4,059 and Kolawole who secured 3,947 votes.\nA total of 29,481 valid votes were recorded in Ikole LGA."
  },
  {
    "headline": "Oyebanji takes early lead in Ekiti guber, wins Segun Oni's LGA",
    "summarized_story": "Biodun Oyebanji, the candidate of the All Progressives Congress (APC), has taken an early lead in the governorship election of Ekiti state.\nOyebanji secured 13,125 votes in Irepodun/Ifelodun to defeat Kolawole who polled 4,712, while Segun Oni of the Social Democratic Party (SDP) had 5,010 votes.\nIn Ekiti West, Oyebanji secured 15,322 votes to defeat Kolawole who had 3,386 and Oni who polled 3,863 votes.\nAdvertisementSimilarly, Oyebanji had the most votes in Gbonyin LGA, polling 11,247 votes to beat Oni who scored 4,059 and Kolawole who secured 3,947 votes.\nA total of 29,481 valid votes were recorded in Ikole LGA."
  },
  {
    "headline": "Ladipo Johnson named Kwankwaso’s running mate",
    "summarized_story": "Ladipo Johnson, a lawyer, has been named as the running mate to Rabiu Kwankwaso, presidential candidate of the New Nigeria Peoples Party (NNPP).\nAn official of the party, who didn’t want to be named, confirmed the development on Saturday.\n“Barrister Ladipo Johnson is standing in as our vice-presidential candidate and his name has been submitted to the Independent National Electoral Commission,” the official said.\nMeanwhile, earlier on Saturday, the NNPP had confirmed that talks were ongoing on the coalition.\nWe hope for good results that will give Nigeria a chance to be alive, once again,” the party had said."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Abena, a voice assistant wants to preserve African languages",
    "summarized_story": "But these voice technologies support only Western languages and are unavailable in African languages because of the low-revenue opportunities in African markets.\n“Working on voice tech for African languages has been a completely different ball game.\nHe spent 6 years building Abena AI, and released it in the Google Play Store this April as a Mobobi product.\nAbena AI works with smart lights, smart plugs, and other smart home devices.\n“The feedback from a few people who tried Abena AI out before it was released kept us going."
  },
  {
    "headline": "Meet 11 female founders making strides in Africa",
    "summarized_story": "This article aims to recognize some African female founders making great strides across various industries and sectors on the continent.\nMeet 11 African female founders we are rooting:Sethebe Manake – Botswana 🇧🇼Image source: Sethebe ManakeMy name is Sethebe Manake (she/her) and I am a real-estate expert turned tech entrepreneur who enjoys dancing and game nights.\nLinkedIn: Neema IyerTao Laine Boyle – South Africa 🇿🇦Image source: Tao BoyleMy name is Tao Boyle (she/her).\nThato Schermer – South Africa 🇿🇦Image source: Thato SchermerMy Name is Thato Schermer (she/her) and I’m the Founder of Zoie Health Technologies.\nI graduated from the University of Cape Town (South Africa) and the University of California (Los Angeles) with a triple major in computer science, genetics, and biochemistry."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Tinubu’s arrival: Lagos to experience traffic jam Sunday (See routes to avoid)",
    "summarized_story": "Traffic authorities in Lagos, the economic capital of Nigeria are warning that there will likely be traffic jam in some parts of the state Sunday.\nAccording to a traffic advisory statement seen by Businessday, the unusually heavy traffic will be due to the arrival of Bola Tinubu, the All Progressives Congress (APC) presidential candidate, to the state.\nRead also: Truckers write Lagos govt, decry harassment by traffic agencies“Please avoid roads leading to the Presidential Wing of Muritala Muhammed Airport, Ikeja, Lagos on Sunday June 19, 2022.\nHis arrival time is 12noon, so traffic could build up from 10am.”The statement also indicated that roads leading to APC Presidential Candidate Reception venue, Teslim Balogun Stadium, Surulere, Lagos, should be avoided.\nLet’s ensure advisory compliance due to the anticipated heavy vehicular movement and traffic gridlock on Sunday June 19, 2022.”"
  },
  {
    "headline": "CBN’s printing of money harming Nigeria’s economy say World Bank, EIU",
    "summarized_story": "At a time when central banks around the world are mounting desperate battles to contain inflation, in Nigeria it could be a case of the country’s central bank fanning embers of spiralling inflation, according to the Economist Intelligence Unit, EIU and economists at the World Bank.\nThe EIU in particular said the central bank might have been breaking the law which stipulates a limit beyond which it shall lend to government.\nNigeria’s central bank tightened monetary policy with a 150-basis point hike last month, supposedly to attain its 9% inflation target, but the same central bank has continued to directly finance government deficit in an unbridled manner, the economists say.\nWhen central banks around the world tighten monetary policy the primary goal is to curtail money supply, but there is a curious case in Nigeria where the central bank is tightening monetary policy and at the same time pumping more money into the system by deficit financing and by its development finance initiatives says the World Bank.\nThe continued printing of money at the same time as tightening policy would prevent effective control of the price level,” the EIU said."
  },
  {
    "headline": "What Tinubu and Obi’s ‘dummy candidates‘ mean for 2023 elections",
    "summarized_story": "The All Progressive Congress (APC) Presidential candidate, Bola Tinubu nominated Ibrahim Masari, a renowned Katsina politician, as the party’s place holding or dummy candidate, for his yet to be named running mate so as to meet up with INEC deadline.\nBusinessDay checks show that the concept of ‘ dummy or place holding candidates’ was evolved by the political parties as a temporary measures, where there are disputes over the choice of running mates.\nSimilarly, the Commission also gave the parties up to August 12 for the withdrawal and replacement of withdrawn candidates by the political parties.\nAn Abuja based Lawyer, Francis Obalim, told BusinessDay that the parties“ will not have issues substituting such candidates since they did not participate in any primary election”.\nAccording to Obalim, “running mates cannot refuse to step down, because they did not pass through any formal process of election”."
  },
  {
    "headline": "Papal Awards: Obaseki celebrates Justice Elumeze on investiture as Dame …hails contribution to devt of society – Nigerian Observer",
    "summarized_story": "Justice Elumeze is among the 15 distinguished citizens of Delta State honoured by Pope Francis with the prestigious Papal Knights and Dames of St. Gregory and St. Sylvester, for contributing immensely to the growth of the church and society.\nObaseki, who spoke to journalists shortly after the investiture at St. Paul Cathedral, Isele-Uku, in Delta State, hailed the legal luminary for her service to humanity through the church.\nThis is what we are taught to do and this is why we enjoy His grace.\nAtiku Abubakar, the governor said politics and democracy are about the will of the majority.\nObaseki noted, “At the end of the day, politics is all about the will of the majority and the majority of the party members have spoken.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Over 90,000 pupils sit for primary six exams in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Government said over 90,000 pupils from private and public schools sat for the 2022 Primary Six Examination held across the state at the weekend.\nThe Edo State Commissioner for Education, Dr. Joan Osa Oviawe, spoke to journalists at Olua Primary School after monitoring the exams in five Local Government Areas (LGAs) in Edo South Senatorial District of Edo State.\n“For this year’s primary six exams, we have about 445 exam centres across the 18 local government areas of Edo State and over 90,000 pupils in public and private schools, who are writing the exams.\nOur goal is that by August 2022, primary six certificates will be out.”Schools monitored include Itohan Girls Grammar School and Uwa Primary School both in Oredo LGA; Eresoyen Primary School at Oluku in Ovia North East; Uwa Model Demonstration School, Uhunmwode LGA, and Olua Primary School.\nEgor LGA of Edo State."
  },
  {
    "headline": "Group empowers PWDs with start-up equipments, grants in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – A non-governmental organization, under the aegis of Network for the Advancement of Persons with Visible Disabilities (NAPVID) have presented start-up grants, equipments and production items to physically challenged individuals drawn from across Edo state.\nThe event which took place on Tuesday in Benin City saw the presentation of electricity generating sets, industrial machines, refrigerators, stabilizers, washing machine for laundry services to beneficiaries under the group’s empowerment and skill acquisition programme.\nAccording to NAPVID’s executive director, Melody Omosah, the group is partnering with the state government to push an agenda for inclusion hence the programme to ensure improved standard of living for the physically challenged.\n“They will be able to contribute, not just to their immediate family, but to the larger society”, Omosah remarkedThe recipients who could not hide their joy expressed appreciation to NAPVID and the state government for the empowerment programme.\nHighpoint of the event was presentation of cash cheques and equipments to the beneficiaries by focal person, State Social Investment Programme (SIP), Osayuwamen Aladeshelu and official from ministry of social development and gender issues, Eruaga Esther."
  },
  {
    "headline": "Ex-parte orders: Code of Conduct Bureau set to prosecute Justice Ekwo over abuse of office – Nigerian Observer",
    "summarized_story": "Justice l.E Ekwo, of the Federal High Court, Abuja.\n” One result from the Edo State PDP supervised by the National office of the PDP and another result from Chief Dan Orbih faction backed by Barr.\nNyesom Wike and endorsed by Justice Ekwo.\nEven though there was an earlier order from the Edo State High Court validating the result of the PDP Ward congresses across the State.\n” His Lordship Order was in contradiction to the earlier order of the Edo State High Court on the same subject matter and also operated as appeal against the earlier Order of the Edo State High Court”, he said."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Ekiti Decides: APC, SDP go head to head- Results so far",
    "summarized_story": "Segun Oni, former Ekiti governor and SDP candidate for today’s governorship election in the state, has won his polling unit in Ward 2, Ido-Osi.\nMeanwhile, suspected thugs have disrupted the election at polling unit 01 of Ilasa, in Ekiti East Local Government Area.\nAPC: 119PDP: 21SDP: 3RESULT: PU 08, Oye II, Oye LGAAPC: 72PDP: 12SDP: 46ADP: 3APP: 1ADC: 2PRP: 1RESULT: PU 12, Oye II, Oye LG.\nAPC: 154PDP: 4SDP: 3RESULT: PU 011, Oye II, Oye LGAAPC: 62PDP: 25SDP: 53RESULT: PU006 Oye II, Oye LG.\nAPC: 96PDP: 23SDP: 42RESULT: PU004, Oye II, Oye LGAAPC: 36PDP: 28SDP: 38RESULT: PU 001, Oye II, Oye LGAAPC: 63PDP 16SDP: 77RESULT: PU04, Ward 06, Okeyinmi, Ado-Ekiti."
  },
  {
    "headline": "Full List: APC submits names of senatorial candidates to INEC",
    "summarized_story": "Nigeria’s ruling party, the All Progressives Congress (APC) on Friday submitted the list of all senatorial candidates in the party to the Independent National Electoral Commission (INEC).\nThere were controversies around some names of candidates who contested the presidential elections like the Senate President, Ahmed Lawan, the Governor of Ebonyi State, David Umahi, and the former Niger Delta Affairs Minister, Godswill Akpabio, whose names resurfaced on the senatorial list they didn’t contest for.\nThe Yobe North senatorial candidate of the APC, Bahir Machina, has threatened to seek redress in the court as he claimed to have been illegally delisted by the party.\nBlessing Nwagba (Abia South)ADAMAWA STATEAbdulaziz Nyako (Adamawa Central)Elisha Cliff Ishaku (Adamawa North)Adamu Ismaila (Adamawa South)AKWA IBOM STATEEmaeyak Ukpong (Akwa Ibom North East)Sen. Godswill Obot Akpabio (Akwa Ibom North West)Martins Udo-Inyang (Akwa Ibom South)ANAMBRA STATEOkelekwe E. Boniface (Anambra Central)Ify E. Anaozuonwu (Anambra North)Hon.\nEmmanuel Udende (Benue North East)Titus Zam (Benue North West)Daniel Onjeh (Benue South)BORNO STATEKashim Shettima (Borno Central)Mohammed Tahir Monguno (Borno North)Mohammed Ali Ndume (Borno South)CROSS-RIVER STATEHon."
  },
  {
    "headline": "‘I’m definitely an Igbo man, no doubt about that’ – Okowa",
    "summarized_story": "Dr Ifeanyi Okowa, vice presidential candidate of the People’s Democratic Party (PDP), has said he is Igbo and that his ethnic identity is certain.\nI’m definitely an Igbo man.\nI’m from Delta State in the South-South, but if you’re looking at the Igbos across the country, I’m an Igbo man, I can’t be counted out and that is the true situation,” he said.\nBeing from the South-South I am also an Igbo man and to that extent, I fit into all the divides, because my brother from the South-East, I’m part of them.\nHe described the selection process of the party’s presidential and vice presidential candidates as a good step in the right direction."
  },
  {
    "headline": "Atiku’s running mate: I didn’t betray south – Okowa to South, Middle Belt leaders",
    "summarized_story": "Dr. Ifeanyi Okowa, governor of Delta State and vice presidential candidate of the People’s Democratic Party (PDP), has said that he did not betray southern Nigeria by accepting to be Atiku Abubakar’s running mate.\nOkowa, who spoke on Arise Television on Friday night, said he would not join issues with any group on the issue, especially the Southern and Middle Belt Leaders’ Forum (SMBLF) “because they are leaders I hold in high esteem”.\n“We are not expecting that he would be the candidate from the North and also have a vice presidential candidate from the North.\nOkowa said that he had a very clear understanding of what the issues in the polity were and how to navigate through them.\nOn unifying the party, Okowa said that he had started reaching out to his colleagues and other leaders of the party and that he was encouraged by the response so far."
  },
  {
    "headline": "Financial Inclusion: Experts identify gaps in CBN’s set target",
    "summarized_story": "“As some of us will remember, the CBN initiated the National Financial Inclusion Programme in year 2012 that is, about a decade ago.\nOgubunka, pointed that the above situations were identified to have negative/adverse consequences/implications for the financial system and the economy, especially as almost half of the financial resources in the country were in the hands of people operating outside the formal financial system.\nThus, it floated the Financial Inclusion programme and supported it with a Strategy Document tagged ”National Financial Inclusion Strategy” that encapsulated, among many othethings, the Strategy Objectives, Strategy Stakeholders and their Interests, and Key Financial Inclusion Targets.\nHe bemoaned the sustained lack of considerations for the disabled in the Nigerian financial system through different kinds of neglect and rights denials.\nHe admonished prevailing attitudes of the financial systems against the disabled, describing it as major institutional barrier to financial inclusion"
  },
  {
    "headline": "Kungiyar Jaruman Nollywood Ta Dakatar Da Moses Armstrong Kan Zargin Yi Wa Yarinya Fyade",
    "summarized_story": ""
  },
  {
    "headline": "‘Yan Siyasa Sun Yi Ruwan Naira A Ekiti Wurin Saye Masu Kada Kuri’a Da Jami’an Tsaro",
    "summarized_story": ""
  },
  {
    "headline": "2023: Kwankwaso Ya Zabi Ladipo Johnson Matsayin Mataimakinsa",
    "summarized_story": ""
  },
  {
    "headline": "Jawabin Xi Jinping Ya Kara Azama Kan Aiwatar Da Shawarar Bunkasa Duniya",
    "summarized_story": ""
  },
  {
    "headline": "Shugaban Zimbabwe Ya Kaddamar Da Aikin Gyara Wurin Hakar Sinadarin Lithium Da Kamfanin Sin Zai Aiwatar",
    "summarized_story": ""
  },
  {
    "headline": "How Oyebanji beat them all: Ekiti poll results at a glance",
    "summarized_story": "The candidate of the All Progressives Congress Biodun Oyebanji has built up an unassailable lead as results from 12 out of the 16 local governments in Ekiti became available on Saturday night.\nSo far, Oyebanji has won 11 of the 12 councils declared.\nIn contrast, Oyebanji narrowly won Ido-Osi Local government, the base of SDP candidate, Engineer Olusegun Oni.\nIn all, Oyebanji has polled 126,636 votes, more than the combined votes of his two major rivals, Oni and Kolawole.\nThe results at a glance:Ido-Osi Local GovtAPC: 10,321 WINNERPDP: 2,871SDP: 9,489Oye LGA Final result:APC 13,396 WINNERPDP 4,122SDP 5,391Efon Alaye LGA final result:APC-4012PDP-6303 WINNERSDP-339Emure Local Govt Final result:APC: 7,728 WINNERPDP: 2,610SDP: 3,445Ijero LGA final result:APC: 13,754 WINNERPDP: 4,897SDP: 5,006Ekiti South-West Local GovtAPC: 9,679 WINNERPDP: 4,474SDP: 4,577Moba Local GovtAPC: 11,609 WINNERPDP: 3,530SDP: 4,904Ilejemeje local governmentAPC: 4,357 WINNERPDP: 1,157SDP: 2,344Ikere LGA ResultAPC: 12,086 WINNERPDP: 3,789SDP: 1,943Ekiti-West Local GovtAPC: 15,322 WINNERPDP: 3,386SDP: 3,863Irepodun/Ifelodun Local GovtAPC: 13,125PDP: 4,712SDP: 5,010Gbonyin LGA:APC: 11,247PDP: 3,947SDP: 4,059"
  },
  {
    "headline": "ICYMI: Bill Gates says cryptocurrencies based on 'greater fool theory'",
    "summarized_story": "Microsoft founder Bill Gates said that cryptocurrencies and non-fungible tokens (NFTs) are “100 percent based on greater fool theory.”The theory means that people can make money by purchasing assets that are overvalued and later selling them at a profit.\nVarious celebrities have also offered celebrity endorsements for cryptocurrencies and a number of them, including former first lady Melania Trump, have entered into the world of NFTs.\nGates’s comments come after bitcoin plunged nearly 23 percent over the weekend, hitting its lowest point since late last year.\nOn Saturday, Bitcoin tumbled more than 13% at one point, crashing below the closely watched $20,000 level to its weakest level in 18 months.\nIts extended slide coincides with investor worries about growing troubles in the industry and the general pull-back from riskier assets."
  },
  {
    "headline": "Zamfara Govt Declares Work-free Week For PVC Registration",
    "summarized_story": "Zamfara Governor Bello Matawalle has given a week off for public and civil personnel to register and receive permanent voter cards.\nIbrahim Dosara, the state’s Commissioner for Information, made the announcement on Saturday in Gusau.\n“This is to inform the general public that His Excellency, the Executive Governor of Zamfara State, Bello Matawalle has declared next week, Monday to Friday June 20 to 24, as work-free week.\n“This is to enable the state public and civil servants to go to their respective localities to register and obtain their Permanent Voter Cards (PVCs).\nCommunity leaders, he said, are responsible for ensuring that eligible voters in their wards and local government regions register and obtain PVCs."
  },
  {
    "headline": "BREAKING: Peter Obi Returns To Nigeria After 3-day Visit To Egypt",
    "summarized_story": "Peter Obi, the Labour Party’s presidential candidate, returned to Nigeria on Saturday following a three-day vacation to Egypt.\nRecall that Obi declared on his verified Twitter handle in the early hours of Tuesday that he was leaving for Egypt on a three-day visit to see, among other things, the Egyptian Power Sector, Education, Planning, and Finance Sectors.\nMore details later…"
  },
  {
    "headline": "BREAKING: Fr. Mbaka Obeys Bishop’s Order, Shuts Down Adoration Ministry",
    "summarized_story": "Ejike Mbaka, an Enugu Catholic priest, has complied with the Bishop of the Diocese’s order banning his Adoration Ministry.\nMbaka’s Adoration Ministry, Enugu, was shut down by Bishop Callistus Onaga of the Enugu Catholic Diocese following his statements against Mr. Peter Obi, according to NEWS DIRECT.\nThe statement posted on the official Facebook page of the Ministry reads:“Dear Adorers, There will be no program starting from tomorrow being 19th June 2022 at Adoration Ministry Enugu Nigeria Amen, Umuchigbo Emene, Enugu State.\n“God bless Adoration Ministry Enugu Nigeria Amen and God Bless Our Spiritual Director, Rev Fr, Ejike Mbaka.\n“Keep praying for Our Daddy and may God Bless you all.”"
  },
  {
    "headline": "BREAKING: APC Wins First Polling Unit In Ekiti Election",
    "summarized_story": "In the ongoing governorship election in Ekiti State, the ruling All Progressives Congress (APC) has won its first Polling Unit.\nAt polling unit 10, ward 10, Afao/Kajola, Abiodun Oyebanji, the APC won.\nThe APC’s governorship candidate, Bisi Kolawole, received 20 votes, defeating the Peoples Democratic Party (PDP), who received only two votes.\nIn the polling unit, the Social Democratic Party (SDP) and the other parties did not receive a single vote."
  },
  {
    "headline": "#Live #EkitiDecides2022: INEC announces results in Ekiti *See full declaration",
    "summarized_story": "So far, the Independent National Electoral Commission (INEC) has declared the results from 10 out of 16 local government area after over 700, 000 voters trooped out and exercised their rights on Saturday June 18, 2022.\nAlready, the All Progressive Congress (APC) candidate, Biodun Oyebanji is comfortably leading and will mostly going to be declared winnerOyebanji is ahead in the race among the three leading candidates, who included PDP’s Bisi Kolawole and SDP’s Engineer Olusegun Oni, a former governor.\nWith Oyebanji scoring 107,913 aggregate votes, Oni so far garnered 42,122 votes while Kolawole of the PDP has 40,838.\nFINAL RESULT OF EFON LGAADP-77APC-4012PDP-6303PRP-20SDP-339IREPODUN/IFELODUN LGAAPC: 13,125PDP: 4712SDP: 5010A: 5AAC: 33ADC: 141ADP: 191APGA: 16APM: 20APP: 112LP: 9NNPP: 29NRM: 20PRP: 33YPP: 44ZLP: 15APC – 7728SDP 3445PDP 2610ADP 92ADC 81YPP 41APP 70AAC 15A 4APM 16APGA 14LP 13NNPP 13NRM 19PRP 24ZLP 12Share this: TwitterFacebook"
  },
  {
    "headline": "For ‘raping’ minor, actors guild slams ban on popular Nollywood figure",
    "summarized_story": "Popular Nollywood actor, Moses Armstrong, has been slammed suspension by the Actors Guild of Nigeria (AGN) for allegedly raping minor.\nAGN President, Emeka Rollas, disclosed this on Saturday in a statement signed by its Director of Communications and veteran actress, Monalisa Chinda.\n“The National President, Ejezie Emeka Rollas, said it is a sad development but nobody is above the law, especially on r*pe and abuse of women.\n“Though it is our duty to protect our members when it comes to serious allegations, the law will have to take its course.\n“While on suspension the actor is not expected to participate in any film production or Guild activities."
  },
  {
    "headline": "Five dead as gunmen, IPOB clash in Anambra",
    "summarized_story": "About five persons suspected to be members of unknown gunmen were killed on Friday during a confrontation with people suspected to be Proscribed Indigenous People of Biafra (IPOB).\nAccording to a viral video, the incident occured along Onitsha/Owerri road by Akwa village, Ihiala, Ihiala Local Government Area (LGA) of Anambra State.\n“For some time, the gunmen have been disrupting burials and demanding to be settled before any ceremony is organised.\n“On June 17, IPOB swooped on the gunmen in their camp and five people were killed during the shootout.\n“The argument of the gunmen was that Ebubeagu people ought not to enter Anambra State when there are people controlling the area."
  },
  {
    "headline": "ACCI Appoints Former NNPC, DPR Executive, Chairperson Women-in-Business Trade Group",
    "summarized_story": "Abuja Chamber of Commerce and Industry (ACCI) has appointed former Nigerian National Petroleum Corporation (NNPC) and the Department of Petroleum Resources (DPR) Executive, Mrs Chioma Nonyerem Njoku, as the Chairperson of the Women-in-Business Trade Group of the Chamber.\nIn a letter signed by the Director General ACCI, Victoria Akai on Tuesday, the DG stated that the Trade Group is one of the working organs of the Chamber and its roles include promoting activities of Women in Business by providing necessary support, activities and opportunities for members in the Trade Group to succeed in their ventures.\nMrs Njoku, an oil industry expert who would bring to bear over 40 years of experience of working in the oil sector to the Women – in – Business Trade Group, before this appointment has held several positions at the NNPC and DPR, including as Acting Director of Petroleum Resources.\nShe had served as the Senior Special Assistant/Adviser on Petroleum, to the Imo State Governor and as the Secretary of the Bureau of Oil and Gas Matters.\nFurthermore, she attended various Executive Management Courses including the prestigious Harvard Business School program for Leadership and General Management."
  },
  {
    "headline": "NIHOTOUR to unveil mobile training kitchens",
    "summarized_story": "… As key players gear up for 2022 Sustainable Gastronomy Day CelebrationBy Palma IleyeNational Institute for Hospitality and Tourism, NIHOTOUR, has stated that it was set to unveil mobile training kitchens at the 2022 World Sustainable Gastronomy Day Celebration which is expected to attract high level attendance by critical stakeholders of the industry at the event which opens on Saturday, 18th June 2022 at the International Conference Centre, Abuja.\nDisclosing this to newsmen at the headquarters of the Institute in Abuja, Director General and Chief Executive Officer of NIHOTOUR, Nura Sani Kangiwa, said the institute has acquired the mobile kitchens in order to up its skill acquisition and training outreach programs to Nigerian youths in the nooks and crannies of the country.\nKangiwa noted that the Sustainable Gastronomy Day celebration for this year recognizes the practices and principles associated with sustainable food consumption combined with the art of collecting, preparing and consuming the food we eat, stating further that the observances of the day acknowledges the social, cultural and artistic expression related to gastronomy that defines the three dimensions of sustainable development which are; people, planet and profit (benefits).\nHe noted that gastronomy was a cultural expression of nations through their food choices, sources of ingredients and types of cuisines which thrives in culturally rich destinations and Nigeria being one of the most competitive Gastronomy tourist destination in Africa because of its corresponding unique foods culture and enticing cuisines of international repute.\nThe NIHOTUR boss also noted that the occasion will also feature the presentation of a paper to mark the observance Day to be delivered by Olufemi Falebita titled ‘Marketing Nigerian Foods Abroad’The United Nations General Assembly proclaimed World Sustainable Gastronomy Day in December, 2016 and first celebrated it in 2017."
  },
  {
    "headline": "PenCom says only five states, Kaduna, Lagos, Delta 2 others pay pensions",
    "summarized_story": "It has been reported that only five states are paying pensions under the Contributory Pension Scheme as more workers retired by the end of the first quarter of 2022, findings have revealed.\nPenCom listed the states that were funding the accrued rights of the retirees and paying pensions under the CPS to be Lagos, FCT, Osun, Kaduna and Delta.\nData obtained from PenCom on ‘Status of implementation of the CPS by states’ showed that 25 states had enacted laws on the CPS and that out of them, 15 had pension bureaux and boards in line with the CPS.\nThe data revealed that the 25 states are Lagos, FCT, Osun, Kaduna, Delta, Ekiti, Ondo, Edo, Benue, Kebbi, Niger, Rivers, Ogun, Bayelsa, Kogi, Anambra, Abia, Taraba, Imo, Sokoto, Adamawa, Ebonyi, Nasarawa, Enugu and Oyo.\nPenCom data showed that states with other pension schemes were Jigawa, Kano, Gombe and Zanfara."
  },
  {
    "headline": "Adegbite woos investors with huge gold, lead-zinc, iron-ore deposits",
    "summarized_story": "By Palma IleyeIn continued efforts to grow the economy through the mining sector, the Minister of Mines and Steel Development, Arc Olamilekan Adegbite, Thursday, has wooed investors abroad with huge gold, lead-zinc, iron-ore and barite deposits in Nigeria.\n“Target minerals under the first phase include Gold, Lead-Zinc, Iron Ore, and the Battery Minerals, among others.\n“These include Thor Exploration Limited’s Segilola Gold Mine Project, in Osun State, which has an initial production capacity of 80,000 ounces of gold annually, representing the first large-scale Gold Mine in Nigeria.In June last year, we commissioned the Dukia Gold & Precious Metals Refinery, DGPMR, Project.\nIts potential impact on the gold sector is nothing short of revolutionary.\n“From the revenue drive perspective, the Nigerian Mining Sector has demonstrated a marked improvement despite the challenges of the pandemic."
  },
  {
    "headline": "Safety Engineers call for establishment of Safety Commission",
    "summarized_story": "Emeka Samuel,UYOThe National Chairman of the Nigerian Institution of Safety Engineers (NISafetyE), Engr.\nAkaninyene Ekong has called on the States’ Houses of Assembly to enact a law for the establishment of Safety Commissions across all states in Nigeria.\nEkong made this call yesterday during the 2022 Annual Public Lecture on “Advancing Safety Engineering for Sustainable Development” organized for the Investiture of Engr.\nThe chairman tasked Safety practitioners and professional bodies to woo and lobby the political class in order to engender a robust and better safety culture in Nigeria through legislation in line wiith ILO guidelines.\nThe chairman called for synergy with the practitioners and developers in the building and environment industry, the political class and particularly, the legislators for the rebirth of a serene safety culture in Nigeria through the use of qualified Engineers in projects and the establishment of a safety regulatory agency, otherwise known as Safety Commission."
  },
  {
    "headline": "You Truly Belong To Everybody And Nobody, Tinubu Tells Buhari",
    "summarized_story": "He congratulated the president for the successful conclusion of the convention and assured him of an issue focused campaign leading to the 2023 general elections.\nI have met most of them in the past few days and will continue these engagements as we plan for the general elections.\nMr. President, APC is united and will remain united as we move towards the general elections.\nI have taken note of the message you sent to all Presidential Candidates in your Democracy Day speech to the nation on the 12th June, 2022.\nAsiwaju Ahmed Bola TinubuAPC Presidential Candidate"
  },
  {
    "headline": "We Are In Talks With Peter Obi, Says Kwankwaso",
    "summarized_story": "The presidential aspirant of the New Nigeria Peoples Party, Rabiu Kwankwaso, has revealed that his camp is in talks with Peter Obi and members of the Labour Party over a possible alliance.\nThere have been speculations of a “third force” to challenge the APC-PDP duopoly and Kwankwaso and Obi are reportedly exploring the possibility of creating an alliance in the 2023 elections.\n“We are really talking to Peter Obi, or at least saying that the committee is working to look into the matter (and cooperate with him), and friends and family are coming to talk to us about it, ” he said.\n“We wish to inform Nigerians that, our discussions with Peter Obi and the Labour Party are still ongoing.\n“We hope for good results that will give Nigeria a chance to be alive, once again.”"
  },
  {
    "headline": "Ekiti Election: EFCC Arrests Persons Engaged In Vote Buying",
    "summarized_story": "﻿The Economic and Financial Crimes Commission (EFCC) has arrested persons alleged to have engaged in vote buying in the Ekiti governorship election.\nThe EFCC is part of security agencies deployed to monitor the election.\nParading some of the suspects at the Oke Ori Omi Area Division of the Nigerian Police Force, the suspects were said to have been caught with monies allegedly used to induce voters, an act the EFCC officials say were carried out surreptitiously.\nThe EFCC thereafter proceeded to burst another residence where some persons were caught with a book containing details of voters of certain voting area."
  },
  {
    "headline": "2022 Ekiti Elections: Channels Television, YIAGA Africa Launch Election Results Analysis Dashboard",
    "summarized_story": "Channels Television and Yiaga Africa have launched an Election Results Analysis Dashboard (ERAD) to promote transparency of election results.\nThe dashboard is based on official results uploaded on the INEC’s Results Viewing Portal (IReV).\nThe real-time publishing of polling unit-level results and transmission of results using the IReV demonstrates INEC’s commitment to transparency in results management.\nThis commitment is backed by the Electoral Act 2022, which confers INEC with powers to transmit election results electronically.\nTo achieve this goal, the Election Results Analysis Dashboard will be embedded within the election-day broadcast of Channels Television."
  },
  {
    "headline": "Ekiti Governorship Election: Live Collation of Final Results -",
    "summarized_story": "The collation and announcement of results from the sixteen local government areas is set to begin at the State Collation Centre in Ado-Ekiti.\n=================================================================Ado-Ekiti LGARegistration Area – 13Registered – 179,088Accredited – 50,596APC – 23,831PDP – 7,575SDP – 15,214================================Ikere LGARegistration Areas – 11Registered voters – 65,661Accredited voters – 24,109ADC – 3,763APC – 12,086SDP – 1, 946PDP – 3,789=============================Oye LGARegistration Areas – 12Registered Voters – 65,170Accredited Voters -24,925APC – 13,396PDP – 4,122SDP – 5,391================================Gbonyin LGARegistration Areas – 10Registered Voters – 53,788Accredited Voters – 20,308APC – 11,247PDP – 3,947SDP – 4,059==============================Efon LGARegistration Area – 10Registered Voters –Accredited Voters 11046APC – 4,012PDP – 6,303SDP – 339=============================Ekiti East LG=============================Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577=============================Ekiti West LGARegistration Areas – 11Registered Voters – 59,270Accredited Voters – 23,750APC – 15,322PDP – 3,386SDP – 3,863============================Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445=====================================Ido-Osi LGARegistration Area – 11Registered Voters – 57,780Accredited Voters – 23,848APC – 10,321PDP – 2,871SDP – 9,489=====================================Ijero LGA12 Registration AreasRegistered voters- 65,328Accredited voters- 25,103ADC- 96ADP-201APC – 13,754PDP – 4,897SDP – 5006=============================Ikole LGARegistration Areas – 10Registered Voters – 71,690Accredited Voters – 30,403APC – 16,417PDP – 6,266SDP – 5,736==============================Ilejemeje LGARegistered Voters -18791Accredited Voters – 8439APC – 4357PDP – 1,157SDP – 2,344=============================Irepodun/Ifelodun LGARegistration Areas – 11Registered Voters – 70,467Accredited Voters – 24,123APC – 13,125PDP – 4,712SDP – 5,010==============================Ise/Orun LGARegistration Area – 10Registered voters – 46,712Accredited voters – 17,534APC – 8,074PDP – 2,588SDP – 5,909=========================Moba LGARegistration – 11Registered Voters – 53,527Accredited Voters – 20,743APC -11,069PDP – 3,530SDP – 4,904"
  },
  {
    "headline": "Zamfara declares one week public holiday for civil servants to obtain PVC -",
    "summarized_story": "Zamfara State Government has declared Monday to Friday next week 20th – 21st June, as work free week to allow civil servants travel to their localities and register in the ongoing permanent voter card registration.\nThe state Commissioner for Information, Ibrahim Dosara in press state made available to Newsmen in Gusau, Confirmed the developmentHe says, Commissioners, Special advisers, Tradition rulers and other Political Party Officials are expected to monitor the exercise in their respective areas.\n“By this announcement, all Commissioners, Special Advisers, Permanent Secretaries, other public office holders, party officials and traditional rulers are here by directed to monitor and supervise the on going Voter Registration exercise to ensure that all eligible voters within their wards and local governments register and obtain their Permanent Voter Cards to enable them exercise their fundamental rights and civic responsibilities in the Coming Elections” The statement read."
  },
  {
    "headline": "Saraki's ex-aide, Makanjuola emerges Kwara PDP deputy guber candidate -",
    "summarized_story": "A former member of the house of representatives, Mr Gbenga Makanjuola has been picked as the deputy governorship candidate of the People’s Democratic Party in Kwara state for 2023 election.\nMr Makanjuola also served as one of the aides of Senator Bukola Saraki when he was the senate president.\nThe governorship candidate, Shuaib Yahman Abdullahi while unveiling his running mate assure that the party is prepared to clinch power next year.\nThe PDP gubernatorial candidate called on members to unite and collectively win the APC across the states and at the federal level come 2023."
  },
  {
    "headline": "DIG Kokumo inspects Security arrangements as Election continues -",
    "summarized_story": "The Deputy Inspector General of Police, Johnson Kokumo, who is the overall coordinator of Security operations for the Governorship Election in Ekiti State has continued to go round to ensure Security arrangements are not complacent as the residents and Citizens of Ekiti State exercise their franchise to elect a new governor for the State.\nMr Kokumo Who went round some parts of the State also inspected polling units and the readiness of Security operatives manning them."
  },
  {
    "headline": "Migrants Due for Removal from the UK Could Be Electronically Tagged",
    "summarized_story": "Some asylum claimants who arrived in the UK in small boats or in the back of lorries could be electronically tagged under a new Home Office trial.\nThe first to be tagged will likely be people who successfully challenged their removal to Rwanda this week.\nThe pilot comes days after the first flight taking asylum seekers from the UK to Rwanda was cancelled following a last-minute intervention by the European Court of Human Rights (ECHR).\nIt is unclear exactly how decisions will be made on who to tag, but Home Office guidance says it will not include children or pregnant women.\nThe Rwanda plan, announced by the government in April, intends to give some migrants who cross the Channel to the UK a one-way ticket to Rwanda to claim asylum there instead."
  },
  {
    "headline": "Remains of British Journalist Found in Amazon, Police Name New Suspect",
    "summarized_story": "A forensic exam carried out on human remains found in the Amazon rainforest confirmed on Friday that they belonged to British journalist Dom Phillips, Brazil’s federal police said, adding that a search was underway for a man suspected of involvement in his killing.\nPereira and Phillips vanished on June 5 in the remote Javari Valley bordering Peru and Colombia.\nHe is the third suspect named by police after Oliveira and his brother, Oseney da Costa, who was taken into custody this week.\n“We all know that violence in the Javari Valley is linked to a wide chain of organized crime,” it said in a separate statement.\nPolice said they were still searching for the boat Phillips and Pereira were traveling in when they were last seen alive."
  },
  {
    "headline": "I’m from Delta State and Definitely an Igbo Man, Says PDP Vice Presidential Candidate Okowa",
    "summarized_story": "Delta State Governor, Ifeanyi Okowa, has said he regards himself as an Igbo man from the South-south geopolitical zone of the country and that even though it did not come as a surprise to him, he was lucky to have been chosen to be the running mate to the Presidential candidate of the Peoples Democratic Party (PDP), Alhaji Atiku Abubarkar.\nOkowa said he was lucky to have gotten the position of Vice Presidential candidate, because there were other equally qualified people in the party.\nAccording to Okowa, the PDP had to throw open its presidential contest because the time was too short to adhere to an understanding that the next president of Nigeria should come from the Southern region.\nWithin the PDP, we felt that the time was rather too short with regard to zoning to a particular part of the country.\nOkowa said he was not unmindful of the fact that some of his colleagues would have been able to get the ticket but that at the end of the day, he was the lucky one."
  },
  {
    "headline": "Owo Massacre: Ondo Governor Akeredolu Weeps at Burial, Laments Failure to Protect Citizens",
    "summarized_story": "Akeredolu made the declaration during the funeral Mass for 18 of the victims, held at the Mydas Resort and Hotel, Owo.\nAkeredolu, who wept during his speech, said the government failed to protect the victims of the terror attack.\nBut as at the last count, these animals came to the church and murdered 40 people.” governor Akeredolu said.\nResponding, the Bishop of Ondo Catholic Diocese, Dr. Jude Arogundade declared that Akeredolu had not failed in protecting his people.\n“Indeed, the event catapulted Ondo State, the Catholic Diocese of Ondo and Nigeria into the limelight of world attention, unfortunately, for the wrong reason."
  },
  {
    "headline": "Nigeria: Oyebanji, Oni, Kolawole in Three-Horse Race to Succeed Fayemi as Ekiti Governor",
    "summarized_story": "Thousands of voters will on Saturday file out in Ekiti State to elect a new governor that will succeed Kayode Fayemi who is at the tail end of his second four-year tenure.\nThe electoral umpire had earlier revealed that 988,923 voters captured in the Commission’s register would decide who becomes the new Ekiti State Governor.\nAs strong as Oni is in Ekiti North, he will meet a match in Fayemi, who is from the area.\nThe Director General, Biodun Oyebanji campaign council, Cyril Fasuyi, is also from Ekiti North.\nBut Segun Oni still has visible and electrifying presence in Ido/Osi, Moba and IlejemejeAPC also has influential politicians in Ekiti North."
  }
]