[
  {
    "headline": "Buhari swears in new five permanent secretaries",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), on Wednesday, inaugurated five new permanent secretaries at the Presidential Villa, Abuja.\nThose inaugurated are Ibrahim Yusuf (Katsina), Olusesan Adebiyi (Ekiti), Maryanne Onwudiwe (Enugu), Marcus Ogunbiyi (Lagos), and Ibrahim Abubakar Kana (Nasarawa).\nThe permanent secretaries were sworn in shortly before the commencement of the weekly meeting of the Federal Executive Council.\nMinisters were also physically in attendance at the meeting while the remaining council cabinet members participated online from their respective offices."
  },
  {
    "headline": "BREAKING: Messi agrees five-year Barcelona contract, accepts wage cut",
    "summarized_story": "Lionel Messi and Barcelona have reached an agreement for the forward to sign a new five-year deal with the Catalan club, sources have confirmed to ESPN.\nHowever, with the return of Joan Laporta as president in March, Messi grew more open to staying at Camp Nou.\nHe will link up with Ronald Koeman’s squad later in the summer, with Barca’s league campaign kicking off on Aug. 15 against Real Sociedad at Camp Nou.\nHe was Barca’s president when Messi made his first-team debut and when he signed his first professional contract with the club.\nMessi first joined Barca’s academy in 2000 and has gone on to play 778 games for the club, breaking Xavi Hernandez’s appearance record last season."
  },
  {
    "headline": "Lalong signs law on judiciary, legislative autonomy",
    "summarized_story": "The Governor of Plateau State, Simon Lalong, on Wednesday, signed four bills into law including those that will pave way for the implementation of legislative and judiciary autonomy respectively.\nThe four bills signed into law by the Governor were the State Legislative Funds Management Law, Plateau State Judiciary Funds Management Law, Plateau State Property and Land Use Charge Law and the Plateau Geographic Services Law.\n“While signing the bills into law, Governor Lalong said the new Funds Management Law for the Judiciary and Legislature will guide the implementation of the recently granted autonomy for the two arms of Government particularly in terms of financial management.\n“According to Governor Lalong, the laws will guide the Judiciary and Legislature on the implementation of autonomy with regards to funds disbursement, approvals and expenditure in line with extant financial regulations.\nHe said, “As we sign the law on autonomy, there is greater demand for resources which must be sourced locally."
  },
  {
    "headline": "Flood sweeps away chairman of Okada riders, another motorcyclist in Ondo",
    "summarized_story": "Dayo Johnson – AkureThe chairman of Amalgamated Commercial Motorcycle Riders of Nigeria (ACOMORON) in the Ondo West council area of Ondo state and one other motorcyclist have reportedly been swept away by the flood.\nVanguard gathered that the chairman identified as Aderemi, was the chairman of ACOMORAN in Ayeyemi area, Ondo, and while the other victim was yet to be identified.\nThe two commercial motorcyclists are also known as Okada riders were victims of a flood occasioned by a torrential downpour which lasted over three hours in the town on Monday.\nHe claimed the deceased persons were riding through the bad portion of the bridge already covered by flood when they fell into it and got drowned.\nLorim said the late okada riders could not have noticed the bad portion because of the flood."
  },
  {
    "headline": "Navy Recruitment: Reps allege non-compliance with federal character, demand details of recruitments from 2014 till date",
    "summarized_story": "…direct institution to suspend the pre-screening exercise of shortlisted candidatesBy Levinus NwabughioguHouse of Representatives, Wednesday, fingered lopsidedness in the Nigerian Navy recruitment and directed the institution to suspend forthwith the forthcoming pre-screening exercise for the shortlisted candidates.\nThe House also asked the Navy to provide details of all recruitment from 2014 to date showing the geographical spread.\nThe parliament said the essence was to help strengthen the federal character law as well as to ensure better and more vigorous enforcement and implementation.\nHe said: “Section 14(3) of the 1999 Constitution provides that all appointments must reflect Federal Character.\n“Adequate observance and implementation of the federal character principle will in no small measure allay fears of domination and denial by the ethnic minorities, and invariably foster national unity”, Igbakpa said."
  },
  {
    "headline": "INEC Job: Please, don’t renominate Lauretta Onochie, 70 CSOs beg Buhari",
    "summarized_story": "The CSOs, in a statement on Wednesday, noted that President Buhari persistently forwarded Magu’s name to the Senate for confirmation, even after his nomination was rejected twice.\n“We hope that the Presidency will listen to the voice of the people this time by not renominating Ms Lauretta Onochie again to be confirmed as INEC Commissioner.\nThe President can make her a Minister or give her any other appointment, but not as INEC Commissioner.\n“There are many qualified people from Delta State that can be nominated into the position”, Situation Room stated.\n“Situation Room calls on President Buhari to nominate a qualified and non-partisan woman to replace the nomination of Ms. Lauretta Onochie as soon as possible, as the vacancies of INEC National Commissioners still exist."
  },
  {
    "headline": "BREAKING: More suspects arrested over Super TV CEO’s murder",
    "summarized_story": "The members of the Nigerian Police have arrested more suspects over the death of Super TV CEO, Usifo Ataga.\nLate Mr Ataga was murdered June 15 as alleged lead suspect, Chidinma Ojukwu, has gone from admitting to the crime to recently retracting her initial statement.\nThe House of Representatives had, less than 24 hours ago, asked the Inspector General of Police to stop parading Chidinma for interviews, stressing that she must not die in custody.\nVanguard News Nigeria"
  },
  {
    "headline": "Reps receive reports on electoral Amendment Bill",
    "summarized_story": "May consider clauses Thursday before proceeding on annual vacationBy Levinus NwabughioguHouse of Representatives, Wednesday, received the report of the electoral amendment bill.\nThe report was laid before the House at the plenary by the Chairman of the Committee on Electoral Matters, Hon Aisha Dukku from Gombe State.\nMoving the motion, she said: “That the House do receive the Report of the Committee on Electoral Matters on a Bill for an Act to Repeal the Electoral Act No.\n6, 2010 and Enact the Electoral Act 2021, to Regulate the Conduct of Federal, State and Area Councils in the Federal Capital Territory Elections; and for Related Matters(HB.\nMeanwhile, Vanguard gathered that the clause-by-clause consideration of the bill would be done tomorrow (Thursday) by the House."
  },
  {
    "headline": "Court rejects EFCC’s video evidence against former NNPC boss, Yakubu",
    "summarized_story": "DAILY POST reports that Justice Mohammed had, on June 30, fixed July 14 for ruling on the EFCC’s application.\nThe Judge also deferred the EFCC’s fresh application to recall two prosecution witnesses (PWs) for a re-examination pending when Yakubu’s cross-examination is completed.\nMohammed noted that Yakubu, who had been in the witness box as DW1 (first defence witness) since July 8, 2020, had already given his evidence before the court.\nHe, however, adjourned the case until July 29 for the continuation of the cross-examination of Yakubu.\nRecall that Yakubu was arraigned on March 16, 2017, on six counts but the trial court struck out counts five and six."
  },
  {
    "headline": "Suspended Anti Corruption boss, Muhuyi absent at Assembly probe sitting in Kano",
    "summarized_story": "The suspended Chairman, Kano Anti-corruption Commission, Muhuyi Magaji-Rimingadoon Wednesday failed to appear before the House of Assembly Committee probing his activities.\nUmar Usman Fari, Counsel to suspended Anti-corruption Agency boss said his client was absent at Assembly on health grounds.\n”Barrister Fari disclosed that his client is ready to honour the invitation and meet with the Assembly as soon as relevant documents were made available to them.\nHe said they were ready to embrace appropriate legal action to force compliance in event of failure to respond to their request.\nAbdullahi AbdulSalam, Deputy Director, Legal, Kano state House of Assembly, and Secretary, Ad hoc Committee said letters from Rimingado’s lawyer has forced the Committee to suspend sitting for now."
  },
  {
    "headline": "Stop requesting classified information",
    "summarized_story": "The Nigerian Financial Intelligence Unit (NFIU) has condemned attempts and inordinate requests for information from the establishment by politicians.\nHe told such government officials and politicians that intelligence institutions of government are apolitical, operating within fixed and tailored mandate.\nThe laws and standards, he noted, permit the agency to share information with only Law enforcement, Regulatory, Defence and Security and corresponding agencies in over 170 countries.\n“We do not release information for administrative, civil and business reasons or requests”, Dikko reiterated.\nThe statement added that any officer, whose conduct does not meet best practices, will be published."
  },
  {
    "headline": "Kidnappers taking over Edo",
    "summarized_story": "The recent spate of kidnap cases in Edo State has been described as alarming even as the government has claimed to be doing enough that would yield positive results.\nLeftist Osazee Edigin, the immediate past Public Relations Officer, Edo Civil Society Organization, EDOCSO, in a statement sent to DAILYPOST in Benin City, the state capital, alleged that with the recent kidnapping incident involving a sienna bus in Edo Central, kidnappers are having a field day in the state.\nA full load of Sienna passengers kidnapped some days ago have all been killed after collection of ransom from family members.\nThe primary responsibility of the government is the protection of lives and property, either way, we slip into the state of nature.\n“Can we not pool funds together to achieve what it takes to protect our lives and property hence it appears the government has left us to our fate."
  },
  {
    "headline": "We won’t allow usage of humans for rituals – Ogun Assembly tells Obas, traditionalists",
    "summarized_story": "The Ogun State House of Assembly has told traditional rulers in the state that it will not allow the use of human beings for rituals during the installation or burial of a monarch.\nThe Speaker of the Assembly, Olakunle Oluomo, said this on Wednesday while declaring open, a public hearing on the traditional council law of Ogun State 2021 at the Assembly Complex, Oke- Mosan, Abeokuta.\nOluomo stated that the lawmakers are not against traditional rites for installation and burial of Obas in the state, saying, however, that the use of humans for the purpose is barbaric and no longer allowed.\nThe speaker clarified that the bill does not set out to specifically tinker with the burial rites as being speculated.\nIt has been the new norm of short-changing the original inhabitants of the area in the selection of monarchs to the advantage of strangers which must stop."
  },
  {
    "headline": "Yomi Fabiyi gloats, claims ‘Oko Iyabo’ hits 1m views",
    "summarized_story": "By Ekaete BasseyActor and movie producer Yomi Fabiyi has celebrated the amassing of one million views by his latest movie ‘Oko Iyabo’ on YouTube.\nADVERTISEMENT‘Oko Iyabo’ also got him suspended indefinitely from Theatre Arts and Motion Practitioners Association of Nigeria (TAMPAN).\nHowever, taking to his Instagram on Tuesday, the filmmaker announced the controversial movie had hit 1million views as he expressed gratitude to fans, views and critics without whom he said such feat would not have be achieved.\nSharing a post that held same words as the caption; he wrote: “OKO IYABO MOVIE now hit 1,000,000 views!\n(1 MILLION VIEWS)."
  },
  {
    "headline": "Police not aware of killing, eating of five farmers corpses in Ebonyi – PPRO",
    "summarized_story": "Agency ReporterThe Police Command in Ebonyi on Wednesday said it was not aware of the killing and eating of five bodies of cassava harvesters in the state.\nThe News Agency of Nigeria (NAN) recalls that several media have on Wednesday reported that no fewer than five indigenes of Ali Ugwelu village, in Ekoli-Edda community, Afikpo South Local Government Area of the state were killed by assailants on Monday.\nThe reports added that the assailants, who were from Cross Rivers State allegedly attacked, killed and ate up the five lifeless bodies in their farmland.\nADVERTISEMENTReacting to the development, DSP Loveth Odah, Spokesperson of Police Command in Ebonyi said the command was not aware of the incident.\nAccording to Odah, “I am not aware of such a report.”NAN recalls that Ali Ugwelu village, Ekoli-Edda community in Ebonyi and Erei Community in the Biasa LGA of Cross River have been having a disagreement over the control and ownership of a palm tree plantation located in the area."
  },
  {
    "headline": "Court rejects EFCC’s plea to play video against ex-NNPC GMD",
    "summarized_story": "The court had marked the documents tendered as Exhibits “M,” “N” and “N1.”While Exhibits “M” and “N” were compact discs, Exhibit “N1” was a memory card.\nRaji had argued that Yakubu was not a maker of the exhibits which in the eyes of law were documented.\nRuling, the judge noted that Yakubu, who had been in the witness box as DW1 (first defence witness) since July 8, 2020, had already given his evidence before the court.\nMohammed held that it would be unfair to keep the defendant in the witness box for over a year and grant such prayer when the cross-examination was yet to be completed.\nYakubu was, however, arraigned on March 16, 2017, on six counts but the trial court struck out counts five and six."
  },
  {
    "headline": "Another PDP Rep decamps to APC",
    "summarized_story": "By Tony Akowe, AbujaAnother member of the People’s Democratic Party(PDP) in the House of Representatives, Kabiru Ahmadu, has defected to the All Progressives Congress (APC), citing crisis within the PDP in Zamfara state for his action.\nThe lawmaker’s letter of defection was read by Speaker Femi Gbajabiamila amidst protest by the Minority leadership.\nMinority Leader of the House, Ndudi Elumelu, alleged Ahmadu was being economical with the truth as there was no crisis in Zamfara PDP.\nSpeaker, there is no crisis in the PDP in Zamfara state.\nSection 68 of the Constitution and the House rules require that any member who defects to another party should lose his job."
  },
  {
    "headline": "Plateau: Herdsmen kill two as youths protest in Riyom",
    "summarized_story": "From Gyang Bere, JosTwo people are reported to have died in a bloody attack suspected to have been carried out by Fulani herdsmen in Kum village of Riyom Local Government Area of Plateau State.\nDaily Sun gathered that the incident which occurred at about 9 pm Tuesday, left one Mr Titus John and Iliya Dalyop dead.\nA lawmaker representing Riyom Constituency in the Plateau State House of Assembly, Hon Timothy Dantong, confirmed the incident and said the deceased persons were ambushed and killed.\n‘It is true that two persons were killed on Tuesday night in Kum village of Riyom LGA by gunmen.\nThe youths blocked the major Abuja-Jos express route which tempered with the smooth flow of vehicles into Jos, the state capital."
  },
  {
    "headline": "Ataga: Chidimma must not die in custody, Reps warn police",
    "summarized_story": "From Ndubuisi Orji, AbujaThe House of Representatives, yesterday, cautioned the Nigeria Police to ensure that Ms Chidimma Ojukwu, who is being held in connection with the death of late Usifo Ataga, does not die in their custody.\nThe House also urged the police to conduct a thorough investigation into the murder incident and refrain from parading “Ms.\nChidinma around to grant interviews” on a matter under investigation.\nThis followed the adoption of a motion by Tolu Akande-Sadipe, calling for compliance of the police force with extant laws in the investigation into the death of late Ataga.\nThe lawmaker noted that since her arrest, the suspect has been paraded around, granting interviews to several news platforms, including the Nigerian Television Authority (NTA)."
  },
  {
    "headline": "INEC: PDP, Arewa group, CTA hail rejection of Onochie’s nomination",
    "summarized_story": "The nomination of Onochie by the Presidency was trailed by controversy, which reached a climax, yesterday, as the Senate rejected the nomination.\nDelta State where Onochie hails from has a serving national commissioner in INEC.\nThe PDP said the rejection of Onochie has saved the country from a serious crisis and salvaged INEC and the entire Nigerian electoral process.\nThe CTA, in a statement by its Executive Director, Faith Nwadishi, said Onochie’s rejection would augur well for Nigeria’s democracy.\n“We admonish the leaders of the National Assembly to continue to put Nigeria’s democracy first above party/individual sentiments,” he said."
  },
  {
    "headline": "Nigeria lucky to remain united despite challenges –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has said Nigerians should congratulate themselves for remaining one despite ongoing challenges that could have torn us apart.\nThe report was submitted by a team of House members led by Speaker Femi Gbajabiamila.\nPeople wonder why Nigerians accept me, despite not being rich.\n“There are several recommendations; we’ve agreed to establish zonal commissions in all the zones like the North East Development Commission.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Throw media bills away –NUJ, NGE, PDP, Ezeife, Okorie others",
    "summarized_story": "By Chinelo Obogo, Sunday Ani, Chukwudi Nweje and Doris ObinnaNigerians have told the National Assembly to throw out the controversial Nigerian Press Council (NPC) and the Nigeria Broadcasting Commission (NBC) Acts amendment in its entirety.\nThis followed the disclosure by its sponsor, Olusegun Odebunmi, yesterday, that legislative process on it has been suspended.\n“What we want is outright dropping of the bill, not suspension.\nSpeaking to Daily Sun, spokesperson of the party, Kola Ologbodiyan, said it did not come as a surprise that the Senate suspended further deliberations on the bill.\n“Though the Senate said the bill is intended to regulate the media, the real intention is to gag the media."
  },
  {
    "headline": "Emefiele: N15tn Infrastructure Company to Take off Third Quarter",
    "summarized_story": "Ndubuisi FrancisThe N15 trillion Infrastructure Company Limited (InfraCo), created by the federal government to bridge the nation’s huge infrastructure gap is to take off in the third quarter of the year, the Governor of Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, has said.\nInvestors in the N15 trillion InfraCo include the CBN, Nigeria Sovereign Investment Authority (NSIA) and Africa Finance Corporation (AFC).\nHe stated that for Nigeria to attain meaningful growth, there must be huge investments in key sectors of the economy, including infrastructure such as rail and power, among others.\n“The sustenance of these measures have also helped to support growth of 0.51 per cent during the first quarter of 2021.\nHe stated that about N500 billion is expected to be contributed into the federal government coffers from the privatisation proceeds this year."
  },
  {
    "headline": "INEC Pledges to Use Technology to Deepen Democracy",
    "summarized_story": "• Says 542,576 Nigerians have completed online voter registrationChuks OkochaThe Chairman of the Independent National Electoral Commission (INEC), Prof. Mahmood Yakubu, yesterday expressed the determination of the commission to deepen democracy through the use of technology.\nAlso, the third quarter of the physical registration will start from January 3, 2022, to April 1, 2022, and the fourth quarter will kick off on April 11 to June 30, 2022.\n“Out of 542,576 online registrants so far, 356,777 (or 66 per cent) are young people between the ages of 18 and 34 years.\nAccording to him, the commission is aware that not all Nigerians have access to computers, smart phones or internet connectivity to register online.\nEven the online registrants will have to complete their registration physically at those centres."
  },
  {
    "headline": "222 Killed, 774 Abducted by Kaduna Bandits in Three Months",
    "summarized_story": "By John ShiklamA total of 222 people have been killed while 774 others have been kidnapped by bandits in Kaduna state in the past three months.\nIn the first quarter report, present in April, a total of 323 persons were killed while 949 others were kidnapped by bandits across Kaduna State.\nAccording to him, 159 of the deaths, were recorded in Kaduna Central Senatorial District while Southern Kaduna Senatorial District and Northern Senatorial District recorded 54 and nine deaths respectively.\nThe commissioner said of the 774 people kidnapped, Kaduna Central SenatorialDistrict topped the list with 555 people abducted.\nHe said, “Southern Kaduna Senatorial District recorded 164 kidnapped persons, with Kachia LGA reporting the highest number of 111."
  },
  {
    "headline": "Buhari: Nigeria is Lucky to Remain as One Entity Despite Security Challenges",
    "summarized_story": "*Says people should be free to choose leaders of their choice irrespective of party, religionDeji ElumoyePresident Muhammadu Buhari has disclosed that Nigeria is lucky to have remained as one indivisible entity notwithstanding the myriad of problems incuding security challenges facing the nation.\nThis is just as he also canvassed for the citizens right to choose a leader of their choice at elections irrespective of party affiliation or religion.\nThe President made this disclosure Tuesday at the State House, Abuja while receiving the report of the National Security Summit of the House of Representatives from the Speaker, Hon.\n“Thank you Mr President for what you have done so far to douse tension and for Nigeria to remain one.\nAnd Nigeria will work, by the grace of God”, the Speaker further said."
  },
  {
    "headline": "Breaking: Senate Bows to Pressure, Rejects Onochie as INEC Commissioner",
    "summarized_story": "By Deji Elumoye and Juliet AkojeThe Senate on Tuesday bowed to public pressure and rejected the nomination of Presidential aide, Lauretta Onochie, as Independent National Electoral Commission (INEC) National Commissioner.\nThe upper chamber at plenary described Onochie as ineligible for the position of National Commissioner of the Independent National Electoral Commission based on the report of its committee on INEC.\nPresenting the report, Chairman of the Senate Committee on INEC, Senator Kabiru Gaya, said Onochie’s nomination contravenes the principle of Federal Character Commission as enshrined in the 1999 Constitution.l (As Amended).\nGaya recalled that Delta state which Onochie was supposed to represent had been adequately represented by May Agbamuche-Mbu, INEC’s current National Commissioner, who incidentally is from Delta state as Onochie.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Kaduna University Prepares Letter For Students To Waive Rights To Protest Against School Fees Hike",
    "summarized_story": "Kaduna State University has released a letter of undertaking to compel students from protesting against any increment of school fees.\nHowever, the letter also makes the parents pledge that their \"son/daughter/ward should be expelled without warning if he/she engages in any demonstration/protest against the increment in tuition fees or any contrary activities of the university's rules and regulation\".\nStudents of Kaduna State University on Tuesday, June 1st took to the streets to protest the hike in tuition by the state government.\nAlso for social sciences, indigenes will pay N170,000, non-indigenes will pay N200,000.\nIndigenes admitted to study medicine will pay N300,000 while non-indigenes will pay N400,000."
  },
  {
    "headline": "Kaduna University Prepares Letter For Students To Waive Rights To Protest Against School Fees Hike",
    "summarized_story": "Kaduna State University has released a letter of undertaking to compel students from protesting against any increment of school fees.\nHowever, the letter also makes the parents pledge that their \"son/daughter/ward should be expelled without warning if he/she engages in any demonstration/protest against the increment in tuition fees or any contrary activities of the university's rules and regulation\".\nStudents of Kaduna State University on Tuesday, June 1st took to the streets to protest the hike in tuition by the state government.\nAlso for social sciences, indigenes will pay N170,000, non-indigenes will pay N200,000.\nIndigenes admitted to study medicine will pay N300,000 while non-indigenes will pay N400,000."
  },
  {
    "headline": "Ondo Varsity Lecturers Sell Students Expensive Handouts For Marks To Survive Nonpayment Of Salaries",
    "summarized_story": "Some students of the Adekunle Ajasin University, Akungba-Akoko, Ondo State, have cried out over the unending expensive handouts they are forced to buy from lecturers every semester.\nSaharaReporters learnt that buying of handouts attracts good marks in some of the courses so students, therefore, pay through their nose to obtain them.\nOnce you get one, the man promised to give you 15 marks,” the course representative told the students.\nBut things have gone upside down in Ondo State; workers are owed salaries, pensions are not forthcoming.\nThe university is handicapped; it is when salaries are regular that you can maintain standards and give rules to your lecturers."
  },
  {
    "headline": "Ondo Varsity Lecturers Sell Students Expensive Handouts For Marks To Survive Nonpayment Of Salaries",
    "summarized_story": "Some students of the Adekunle Ajasin University, Akungba-Akoko, Ondo State, have cried out over the unending expensive handouts they are forced to buy from lecturers every semester.\nSaharaReporters learnt that buying of handouts attracts good marks in some of the courses so students, therefore, pay through their nose to obtain them.\nOnce you get one, the man promised to give you 15 marks,” the course representative told the students.\nBut things have gone upside down in Ondo State; workers are owed salaries, pensions are not forthcoming.\nThe university is handicapped; it is when salaries are regular that you can maintain standards and give rules to your lecturers."
  },
  {
    "headline": "Rivers Varsity Suspends Lecturer Demanding N70,000 To Write Projects For Students",
    "summarized_story": "Olai Godwin, a lecturer in the Department of Management, Ignatius Ajuru University of Education, Port Harcourt, Rivers State, has been placed on a three-month suspension by the management of the institution for demanding money from final year students in order to help them write their project works.\nThe suspension took place following the audio recordings that surfaced in which some of his students alleged that he demanded N70,000 for the projects.\nThe students were reportedly final year students of his department assigned to him for the supervision of their projects.\nThe Vice Chancellor of the institution, Professor Ozo-mekuri Ndimele, stated that Godwin had promised in the audio, to help complete the entire projects, type it and bind them, without any contributions from the students.\nHe disclosed this on his Facebook page on Tuesday adding that the lecturer’s case has been transferred to the Staff Disciplinary Committee of the institution for further investigation."
  },
  {
    "headline": "Police arrest more suspects in Super TV CEO’s murder",
    "summarized_story": "The Lagos police say it has arrested more suspects in connection with the murder of Usifo Ataga, the late Super TV CEO.\nAdvertisementHakeem Odumosu, Lagos commissioner of police, broke the news on Wednesday while parading the suspects at the command headquarters in Ikeja.\n“We have established a case of conspiracy in the murder and we have arrested more suspects,” the CP said.\nAdvertisementThe development comes a few days after Chidinma Ojukwu, a student of the University of Lagos who is the prime suspect in the case, had denied killing Ataga.\nAdvertisementBut in a recent interview that surfaced on Monday, Chidinma said she admitted to killing Ataga at the time because of pressure and the fact that nobody believed her."
  },
  {
    "headline": "Police arrest more suspects in Super TV CEO’s murder",
    "summarized_story": "The Lagos police say it has arrested more suspects in connection with the murder of Usifo Ataga, the late Super TV CEO.\nAdvertisementHakeem Odumosu, Lagos commissioner of police, broke the news on Wednesday while parading the suspects at the command headquarters in Ikeja.\n“We have established a case of conspiracy in the murder and we have arrested more suspects,” the CP said.\nAdvertisementThe development comes a few days after Chidinma Ojukwu, a student of the University of Lagos who is the prime suspect in the case, had denied killing Ataga.\nAdvertisementBut in a recent interview that surfaced on Monday, Chidinma said she admitted to killing Ataga at the time because of pressure and the fact that nobody believed her."
  },
  {
    "headline": "IPOB killed two soldiers in Enugu, says army spokesman",
    "summarized_story": "The Eastern Security Network (ESN), the militia of the Indigenous People of Biafra (IPOB), have allegedly killed two soldiers in Enugu.\nAdvertisementAccording to Onyema Nwachukwu, army spokesman, the soldiers were killed on Tuesday at a checkpoint in Uzo-Uwani local government area (LGA) of the state.\nHe said members of ESN had engaged the troops in a gun duel which led to the death of the soldiers.\n“We assure the general public of our commitment to provide adequate security in the general area in collaboration with other security agencies.\nThe attacks ceased after Nnamdi Kanu, leader of IPOB, was arrested and extradited to Nigeria."
  },
  {
    "headline": "IPOB killed two soldiers in Enugu, says army spokesman",
    "summarized_story": "The Eastern Security Network (ESN), the militia of the Indigenous People of Biafra (IPOB), have allegedly killed two soldiers in Enugu.\nAdvertisementAccording to Onyema Nwachukwu, army spokesman, the soldiers were killed on Tuesday at a checkpoint in Uzo-Uwani local government area (LGA) of the state.\nHe said members of ESN had engaged the troops in a gun duel which led to the death of the soldiers.\n“We assure the general public of our commitment to provide adequate security in the general area in collaboration with other security agencies.\nThe attacks ceased after Nnamdi Kanu, leader of IPOB, was arrested and extradited to Nigeria."
  },
  {
    "headline": "'We'll consider it' -- ICC responds as Igboho files petition against Buhari",
    "summarized_story": "Sunday Adeyemo, a youth leader better known as Sunday Igboho; Banji Akintoye, leader of Ilana Omo Oodua, and 49 other Yoruba self-determination groups have filed a petition against key officers of the federal government at the International Criminal Court (ICC).\nAdvertisement“In Nigeria, there are ongoing violations of Human Rights, as expressed specifically in the Rome Statute, being perpetrated against the Yoruba People, particularly genocide under Article 6, and Crimes Against Humanity under Article 7, of the Rome Statute,” the petition read in part.\nAdvertisement“This communication has been duly entered in the Communications Register of the Office,” Dilon said in a letter to the petitioners’ lawyer.\n“We will give consideration to this communication, as appropriate, in accordance with the provisions of the Rome Statute of the International Criminal Court.\n“As soon as a decision is reached to formally commence investigation into this petition, we will inform you, in writing, and provide you, with reasons for this decision.”"
  },
  {
    "headline": "Safaricom to pay blind man $56,000 for refusing to hire him",
    "summarized_story": "A High Court in Kenya has ordered Safaricom to pay a blind man KSh6 million ($56,000) for failing to hire him after he had gone through the entire recruitment process.\nWilson Macharia sued the network operator to seek compensation because his rights were violated, BusinessDaily reported.\nHe told Justice James Makau that Safaricom declined to employ him as a customer care executive on grounds that it did not have specialised software to help him with his work.\nAlong with other persons living with disabilities, Macharia was shortlisted for the job, went through the oral interview and medical test, after which he was invited to sign the contract in July 2017.\nThere’s a long history of discrimination and exclusion of persons with disabilities around the world."
  },
  {
    "headline": "Visa launches first card payment service in Somalia",
    "summarized_story": "Visa has partnered with the International Bank of Somalia (IBS Bank) to launch Somalia’s first Visa card payment service.\n“For Visa to come to Somalia, it means that we are on the right path of growth and progress.\nSomalia, a country that had no formal banking or financial system since the collapse of its government in 1991, has been making serious headways in reawakening the pulse of its financial entities.\nAccording to Somalia’s Central Bank Governor, Abdirahman Mohamed Abdullahi, the Visa partnership will connect Somalia to the global financial system and show the growing confidence in the country’s banking and finance sector.\nThe presence of both Mastercard and Visa in Somalia will help position its market as arable land ready to receive seed and produce a bounty harvest."
  },
  {
    "headline": "Central bank digital currencies differ from crypto. Here’s how they work",
    "summarized_story": "With cryptocurrencies like Bitcoin becoming increasingly popular, central banks across the world have been working towards developing digital currencies of their own.\nOnly two countries have officially launched digital fiat currency.\nNigeria and Ghana plan to pilot an official digital currency (e-naira and e-cedi respectively) later this year.\nA Central Bank Digital Currency (CBDC) is a country’s official currency in digital form.\nWith their values pegged, a digital currency will fall and rise in line with general swings in the value of the national currency."
  },
  {
    "headline": "Flutterwave lands Visa and MTN veteran to lead government and regulatory affairs",
    "summarized_story": "Before IHS, he spent 10 years at MTN in various government and regulatory advisory roles, and four years representing VISA in conversations with West African regulators.\nIn appointing a regulatory lead with broad industry experience, Flutterwave expresses an enthusiasm for deeper engagement with African governments.\nFlutterwave’s payments processing business is live in 33 African countries.\nThat spread commands a regulatory burden similar to what multinational financial services companies and telecommunications networks have to contend with.\nIt may have figured in their selection process for a regulatory lead, choosing someone with experience spanning these sectors."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Spazio Ideale designs iconic workspaces for tech companies like Paystack, uLesson, others",
    "summarized_story": "The acceptance of space design in Nigeria coincided with the coming of interior design startups like Spazio Ideale — an Italian expression loosely translated as ‘Ideal Space’.\nTomi Bamgbelu, Founder and Creative Director of Spazio Ideale, has always had a flair for architecture and computers.\nSpazio Ideale team.\nThat’s the only way we can add value.”Bamgbelu gives her take on why people reach out to Spazio Ideale.\nAlthough uncommon at that time, the founder decided to do something different with the office space design."
  },
  {
    "headline": "Flutterwave’s regulatory officer, VerifyMe digital address system, Mobile app downloads skyrocket",
    "summarized_story": "Good day,Today I’m discussing:Flutterwave’s new appointmentVerifyMe’s VeriFind launchMobile app downloads skyrocketFlutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations OfficerFlutterwave’s new Chief Regulatory and Government Relations Officer, Oluwabankole Falade.\nThe story: Nigerian fintech unicorn, Flutterwave, has announced Oluwabankole Falade as its Chief Regulatory and Government Relations Officer.\nFor more context: Flutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations Officer.\nWell, VerifyMe Nigeria, an identity verification startup, wants to change that with its geotagging solution, VeriFind.\nNigeria leads mobile app downloads in AfricaSmartphone userMobile app installs in Nigeria grew by 43% between Q1 2020 and Q1 2021, according to a report by Appflyer and Google."
  },
  {
    "headline": "Flutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations Officer",
    "summarized_story": "Online payments solution platform, Flutterwave has appointed former MTN and Visa executive, Oluwabankole Falade as its new Chief Regulatory and Government Relations Officer.\nFalade, who has worked in similar roles in companies like MTN and Visa, brings a wealth of legal, regulatory, business development, and government relations experience from a 16-year stint in the financial and telecoms industries.\nFalade’s regulatory experience with global giants like MTN and Visa should serve as good reference points in his new role.\nA trend that has seen Chaka bag the Securities Exchange Commissions’ (SEC) first digital stock trading licence.\nDo you think we will see more appointments like this in fintech companies?"
  },
  {
    "headline": "50 years after, OPEC gains still evade Nigeria",
    "summarized_story": "A country celebrating 50 years of its Organisation of Petroleum Exporting Countries (OPEC) membership, Nigeria is a clear example that a natural resource such as oil is not necessarily a blessing.\nEndowed with some of the world’s biggest oil reserves, plenty of arable lands, Nigeria had the potential to break onto the global stage by…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Fintech attraction: Investors find benefits outweigh costs in Nigeria",
    "summarized_story": "Nigeria’s financial technology (Fintech) companies have increasingly become a top investment destination for foreign investors.\nTo have a piece of the industry’s cake, investors are queuing and waiting for a window of entry.\nConsidered a ‘goldmine’, the opportunities foreign investors see in Nigeria’s Fintech industry has forced them to turn a blind eye to the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "NEITI reveals revenue leakages in Nigeria’s extractive sector",
    "summarized_story": "The Nigerian Extractive Industries Transparency Initiative (NEITI), a transparency watchdog, has published its 2019 report on Nigeria’s extractive sector showing a disturbing pattern of poor practices fostering revenue leakage to the Federation.\nNEITI observed that some companies reported crude losses due to metering error, theft and sabotage that were higher than the volume of production…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Igbinedion Celebrates Victor Uwaifo @ 80 Amid Fanfare – Nigerian Observer",
    "summarized_story": "He described the veteran musician cum academic scholar as a great man whose life experiences should be reference point to members of the public.\nEsama informed that he was out of the country when Uwaifo, a Professor of Visual Arts, turned 80 but considered it worthy to celebrate him, Uwaifo, being a “great man”.\n“You are a great man, one of the greatest human beings in life.\nHe commended Esama for celebrating the highlife musician, adding that Igbinedion and Uwaifo should be celebrated at all times owing to their contributions to societal development.\nIf you go through the crucible of life, then you will know the value of life, you must add principles”."
  },
  {
    "headline": "Navy Alerts On A Fake Sectional Supplementary List Of Successful Candidates In Recruitment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Nigerian Navy (NN) has alerted unsuspecting Nigerians on a fake sectional supplementary list of successful candidates in its recruitment exercise.\nThe Naval Director of Information (DINFO), Commodore Suleman Dahun told newsmen that the attention of the Nigerian was drawn to a purported sectional list of supplementary candidates in the Nigerian Navy recruitment exercise trending online and amplified by an online newspaper of questionable integrity.\n“For the avoidance of doubt, the list is fake and did not emanate from the Naval Headquarters.\nThe public is therefore advised to treat the list as a pitiable ploy of mischief makers and idle minds intent on creating ill feelings amongst the Nigerian public thereby stoking sectional and religion sensibilities.\nThe NN is currently exploring legal means of seeking redress over this mischievous story“Additionally, members of the public are advised to visit www.joinnigeriannavy.com for authentic information on NN recruitment exercises”, he added."
  },
  {
    "headline": "Senate rejects Lauretta Onochie as INEC Commissioner – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Senate Tuesday, rejected the nomination of Ms Lauretta Onochie as a National Commissioner of the Independent National Electoral Commission (INEC).\nThis was made known during Tuesday’s plenary when the Chairman of the Committee, Kabiru Gaya, submitted his report.\nAccording to the chairman, Mrs. Onochie did not satisfy the provisions of the Federal Character Principles.\nThe Senate at the committee of the whole subsequently voted against her nomination.\nOnochie, however, claimed to have resigned from APC when she appeared for screening before the Senate last week."
  },
  {
    "headline": "Oil palm production: Edo govt collaborates with IDH to regain top position – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Leveraging on the investment friendly environment in Edo State, an international organisation, Initiatief Duurzame Handel (IDH), a Sustainable Trade Initiative has collaborated with the state government to initiate a Multi-Stakeholders Platform (MSP) to bring together, stakeholders on oil palm production for a quality action plan that would ensure that the state regains its leading position in oil palm production.\nMSP facilitator from IDH, Mrs Ngozi Unuigbe was on a courtesy visit to the Permanent Secretary, Ministry of Communication and Orientation, Mr. Joses Isede to brief him on the project.\nAccording to her, IDH was supporting Edo State Edo State government to improve oil palm production by small holder farmers, “Not just improvement, but in a sustainable way that is environmental friendly.\nRecalling that Bendel State, by implication Edo State occupied prime position in oil palm production globally in the past, he said that government was always ready to collaborate with international bodies that key into what it is doing to make the state great.\nHe assured that the ministry would do its part through orientation and education on the project."
  },
  {
    "headline": "Taraba flood victims narrate ordeal, call for government intervention",
    "summarized_story": "Some of the worst hit areas are Mayo Gwoi, Abuja Phase 2, Nukkai, Barade and part of Abuja Phase 1.\nThough no life was lost in the disaster, Dauda Sani, a community leader in Abuja Phase 2, said the flood destroyed many houses in his area.\nThe governor accused the federal government of abandoning the state to its fate in and failing to assist with relief materials for the flood victims.\nALSO READ: Tears as flood wreaks havoc in TarabaThe governor also urged those residing in riverine areas to vacate the areas.\nSpeaking during the distribution, Mr Abubakar said, “the governor has promised to assist you more after this immediate intervention."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "I got 900 text messages in a day over alleged tampering with electoral act – Lawan",
    "summarized_story": "Nigeria’s Senate President, Ahmad Lawan, has said that he received over 900 text messages in one day over allegations of tampering with the report of the Electoral Act.\nHe described those accusing the leaders of the National Assembly of removing electronic transmission of results from the report as mischievous and rabble-rousers.\nLawan who stated this shortly after the Chairman of the committee on Independent National Electoral Commission (INEC), Senator Kabiru Gaya, submitted a report of the committee, explained that this is the first time the committee is submitting its report on the Electoral Act to the Senate.\n“There are various accusations and insinuations that leaders of the National Assembly have tempered with the report of the INEC committee.\nIn one day, I received 900 text messages,” he said."
  },
  {
    "headline": "Osun: Oyetola swears in 69 newly-appointed LGA, LCDA caretaker chairmen",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Adegboyega Oyetola, on Monday swore in newly-appointed Local Government Caretaker Committees in all the Local Government Areas, Local Council Development Areas, Area Councils and Administrative Offices, in the State.\n“You will recall that since our assumption of office, we have run an Administration that is transparent, inclusive, purposeful and absolutely pro-people.\nGovernor was able to bring out 69 out of millions of people of the State to serve.\nDon’t disappoint Mr Governor.\nSamuel Abiodun Idowu, hailed the Governor for counting them worthy to serve their people just as he promised their commitment to deliver."
  },
  {
    "headline": "Ifelodun North LCDA Boss, Olaniyan promises all-inclusive government, appreciates Oyetola, others",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe newly sworn in caretaker chairman of Ifelodun North Local Council Development Area in Ikinrun, Prince Adeniyi Olaniyan, has assured the people of the council area that he will run an all-inclusive government, just as he said, his intention is to build a local government that everyone will all be proud of.\nPrince Olaniyan gave the assurance at the council secretariat, Eweta, Ikinrun during the swearing in ceremony of other caretaker members of the local council.\nAccording to him, “it is important to emphasis the importance of local government, not only because it is the third tier of government in our dear country, but due to the fact that it is the closest to the people, hence, it plays a very strategic and pivotal role in the implementation of programmes and policies that are relevant to the socioeconomic and political development of our people.”He implored the party leaders, members of APC and people of Ifelodun North L.C.D.A.\nto let the ingenuity of their hands, the sweat of their labour and the compassion that resides in the hearts be committed to the common goal of building a formidable and united party structure that is capable of delivering peoples mandate, for Governor Adegboyegba Oyetola’s second term.\nThe council boss also enjoined all the caretaker members to work as a team in delivering divideds of democracy to the people of the council area."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Appointments: Gov Makinde Fair To Oyo Muslims – NSCIA",
    "summarized_story": "“As far as we are concerned in the Nigerian Supreme Council for Islamic Affairs, Oyo State, we have gone into the archives to search into what actually used to transpire in government in Oyo State.\nSo, in a nutshell, they are not representing the interest of Muslims in Oyo State.\nIn fact, we have been at the vanguard of telling the public that Governor Makinde has been fair to Muslims.\nSimilarly, the Grand Mufti of NSCIA, Oyo State, Alh.\n“Muslims should, therefore, continue to pray for the success of this administration and Oyo state at large,” AbdulAzeez said."
  },
  {
    "headline": "Appointments: Gov Makinde Fair To Oyo Muslims – NSCIA",
    "summarized_story": "“As far as we are concerned in the Nigerian Supreme Council for Islamic Affairs, Oyo State, we have gone into the archives to search into what actually used to transpire in government in Oyo State.\nSo, in a nutshell, they are not representing the interest of Muslims in Oyo State.\nIn fact, we have been at the vanguard of telling the public that Governor Makinde has been fair to Muslims.\nSimilarly, the Grand Mufti of NSCIA, Oyo State, Alh.\n“Muslims should, therefore, continue to pray for the success of this administration and Oyo state at large,” AbdulAzeez said."
  },
  {
    "headline": "Buhari Swears In 5 Permanent Secretaries",
    "summarized_story": "President Muhammadu Buhari has sworn in five new Permanent Secretaries at the Presidential Villa, Abuja, on Wednesday.\nThe News Agency of Nigeria (NAN) reports that the affected permanent secretaries included Ibrahim Yusuf from Katsina State, Olusesan Adebiyi (Ekiti), Maryanne Onwudiwe (Enugu State), Marcus Ogunbiyi (Lagos State) and Ibrahim Abubakar Kana from Nasarawa State.\nNAN reports that the permanent secretaries were sworn in shortly before the commencement of the meeting of the Federal Executive Council (FEC).\nThe meeting, presided over by the president, was attended by the Vice President, Prof. Yemi Osinbajo, Secretary to the Government of the Federation, Boss Mustapha and the Chief of staff to the President, Ibrahim Gambari.\nMinisters were also physically in attendance at the meeting while the remaining council cabinet members participated online from their respective offices."
  },
  {
    "headline": "Buhari Swears In 5 Permanent Secretaries",
    "summarized_story": "President Muhammadu Buhari has sworn in five new Permanent Secretaries at the Presidential Villa, Abuja, on Wednesday.\nThe News Agency of Nigeria (NAN) reports that the affected permanent secretaries included Ibrahim Yusuf from Katsina State, Olusesan Adebiyi (Ekiti), Maryanne Onwudiwe (Enugu State), Marcus Ogunbiyi (Lagos State) and Ibrahim Abubakar Kana from Nasarawa State.\nNAN reports that the permanent secretaries were sworn in shortly before the commencement of the meeting of the Federal Executive Council (FEC).\nThe meeting, presided over by the president, was attended by the Vice President, Prof. Yemi Osinbajo, Secretary to the Government of the Federation, Boss Mustapha and the Chief of staff to the President, Ibrahim Gambari.\nMinisters were also physically in attendance at the meeting while the remaining council cabinet members participated online from their respective offices."
  },
  {
    "headline": "Group Hails Air Force For Neutralising 120 Bandits In Zamfara",
    "summarized_story": "A rights group, Conference of Civil Society for Peace, Security and National Development has commended Nigeria Air Force for killing at least 120 armed bandits in multiple airstrikes carried out by its personel at Sububu Forest in Zamfara State.\nThe CSO also commended the citizens for offering information about the activities of the bandits to security operatives saying the war on bandits and other criminals will be effectively won if citizens cooperate with security agencies.\nNAF Fighter Jets Neutralise 120 Bandits In Zamfara Forest“We received with excitement the airstrikes that resulted to the killing of over 120 bandits in Zamfara state on Monday.\nWhat the security agencies can achieved depends to a reasonable extent the support they receive from the general public”, the group noted.\nNigerian troops under Operation Hadarin Daji, comprising operatives of the Nigerian military, security and intelligences services, are jointly involved in fight against bandits in North-West."
  },
  {
    "headline": "Panic as gunmen kill three policemen, two others in Anambra",
    "summarized_story": "Panic as gunmen kill three policemen, two others in AnambraPanic as gunmen kill three policemen, two others in AnambraGunmen have killed five persons, three of them policemen in Anambra.\nThe assailants, who stormed Abatete in Idemili North Local Government Area, also set three vehicles ablaze on Tuesday night.\nThey abducted one unidentified young man from Uke after several shots fired at him failed to penetrate.\nHe was dumped in the trunk of the vehicle and whisked away to an unknown destination, it was gathered.\nAnambra Police spokesman, Ikenga Tochukwu, said he had not received any information on the incident."
  },
  {
    "headline": "Panic as gunmen kill three policemen, two others in Anambra",
    "summarized_story": "Panic as gunmen kill three policemen, two others in AnambraPanic as gunmen kill three policemen, two others in AnambraGunmen have killed five persons, three of them policemen in Anambra.\nThe assailants, who stormed Abatete in Idemili North Local Government Area, also set three vehicles ablaze on Tuesday night.\nThey abducted one unidentified young man from Uke after several shots fired at him failed to penetrate.\nHe was dumped in the trunk of the vehicle and whisked away to an unknown destination, it was gathered.\nAnambra Police spokesman, Ikenga Tochukwu, said he had not received any information on the incident."
  },
  {
    "headline": "Stakeholders differ on UTME 16-year minimum age",
    "summarized_story": "“It is not ideal for any child to go and take the UTME or school certificate exam under 16 years.\n“When you rush a child too early, the child rushes out too early without learning.\nPeople pick up educationally at different times, as such, there should be no age limit to education,” he stated.\nSimilarly, President, NPTAN, Mr Haruna Danjuma, said writing the UTME at an early age would be of no benefit to students.\nThey should stick to it because allowing a child to write the UTME at an early age will not be of benefit to the child."
  },
  {
    "headline": "Stakeholders differ on UTME 16-year minimum age",
    "summarized_story": "“It is not ideal for any child to go and take the UTME or school certificate exam under 16 years.\n“When you rush a child too early, the child rushes out too early without learning.\nPeople pick up educationally at different times, as such, there should be no age limit to education,” he stated.\nSimilarly, President, NPTAN, Mr Haruna Danjuma, said writing the UTME at an early age would be of no benefit to students.\nThey should stick to it because allowing a child to write the UTME at an early age will not be of benefit to the child."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "Breaking: Gunmen kidnap Ekiti monarch David Oyewumi",
    "summarized_story": "By Ariwodola Idowu/Ado EkitiAn Ekiti monarch, Oba David Oyewumi, the Obadu of Ilemeso in Oye Local Government Area (LGA) of the state, has been kidnapped by gunmen, the police said.\n“Yes, the incident happened yesterday, (Thursday night) at the Oba’s palace.\nThey said the incident happened at about 8.30 p.m. on Thursday night when the chiefs who visited the place had left.\nIlemeso is a neighbouring town to Isan Ekiti, country home of Gov.\nOba Adetutu Ajayi, the Elewu of Ewu Ekiti, narrowly escaped kidnap at Isan Ekiti, last week on the Ewu-Ayetoro road."
  },
  {
    "headline": "BREAKING: Police Arrests More Suspects Over Super TV CEO’s Murder",
    "summarized_story": "According to Lagos Police Commissioner Hakeem Odumosu, more suspects have been arrested in the assassination of late SuperTV chairman Usifo Ataga.\nDuring a briefing and parade of over 1,000 suspects at the Command headquarters in Ikeja, the police chief revealed this.\nOdumosu said the case was moving and the police would never compromise on it, while not disclosing the number of suspects apprehended or their relation to the crime.\n“We have developed a case of murder conspiracy, and we have apprehended other suspects,” Odumosu stated.\nAtaga, 50, was assassinated on June 15 while spending the weekend with his partner, Ojokwu, in a short-let apartment."
  },
  {
    "headline": "Details Of Buhari’s Meeting With Senators, Reps At Aso Villa Emerge",
    "summarized_story": "President Muhammadu Buhari received members of the National Assembly to supper in Aso Villa, Abuja, on Tuesday night at 8 p.m.\nThe President informed the parliamentarians that his administration is prepared to deploy all available resources to eradicate insecurity in Nigeria and bring criminals to justice.\nBuhari’s communications assistant, Femi Adesina, revealed this in a statement.\n“Some of the people who perpetrate these various manifestations of insecurity do so for profit, others, in the name of discredited ideologies.\n“In the circumstances, we must do everything within our power, without consideration of distractions, to put an end to their activities and bring them to book."
  },
  {
    "headline": "BREAKING: Two Nigerian Army Soldiers Killed By Unknown Gunmen In Enugu",
    "summarized_story": "Two Nigerian Army troops were slain by unidentified gun men in Enugu State.\nPart of the statement read: ” Sadly, during the fire fight that ensued, two soldiers paid the supreme price.\n”Nwachukwu urged the public to provide useful information on the fleeing gunmen to the force.\n“We assure the general public of our commitment to provide adequate security in the general area in collaboration with other security agencies.\n“We also urge members of the public to complement the effort of the security agencies by remaining law abiding and provide useful information on the fleeing gunmen,” the statement added."
  },
  {
    "headline": "BREAKING: ICC Acknowledges Sunday Igboho, Akintoye’s Petition Against Buhari, Malami, Others",
    "summarized_story": "A petition made by Yoruba Nation agitators has been accepted by the International Criminal Court (ICC).\nChief Sunday Adeyemo alias Sunday Igboho, Leader of Ilana Omo Oodua, Emeritus Professor Banji Akintoye, Chief Simisade Kuku, Leader of Yoruba Strategy, Imam of Yoruba in Ilorin, Kwara State, Shielk Raheem Aduranigba, and more than 40 other Yoruba nation groups filed a 27-page petition accusing Nigerian authorities of crimes against humanity andPresident Muhammadu Buhari, AGF Abubakar Malami, IGPs Mohammed Adamu and Ibrahim Idris, Ex-COAS Tukur Buratai, Comptroller General of Customs, Hammed Alli; Chief of Army Staff, Farouk Yahaya, Inspector General of Police, Alkali Baba, former Chief of Airforce, Sadiq Abubakar; former Commandant-General of NSCDC, Ahmed Abubakar Audi; Comptroller-General of the Nigerian Immigration Services, Mohammed Babandede and the Commandant-General of NSCDC, Abdulahi Gana Muhammadu.\nThe ICC’s Head of Information and Evidence Unit of the Office of the Prosecutor, Mr. Mark P. Dilon, stated “This communication has been duly entered in the Communications Register of the Office.\nWe will give consideration to this communication, as appropriate, in accordance with the provisions of the Rome Statute of the International Criminal Court.”“As soon as a decision is reached to formally commence investigation into this petition, we will inform you, in writing, and provide you, with reasons for this decision.”"
  },
  {
    "headline": "VIDEO: Nigeria’s female basketball team, D’Tigresses, in special display ahead USA exhibition match enroute Tokyo Olympics",
    "summarized_story": "PreviousINEC: Why we threw out Buhari’s nominee Onochie – Senate"
  },
  {
    "headline": "VIDEO – En route to Tokyo: Olympic-bound Taekwondo athlete, officials share flight experience",
    "summarized_story": ""
  },
  {
    "headline": "Buhari transmits N13.98trn 2022 budget estimates to NASS",
    "summarized_story": "Blueprint reports that a major highlight of the request is the budget proposal of N13.98trillion for the 2022 fiscal year.\nAt the beginning of plenary, Senate President Ahmad Lawan read a letter from President Buhari detailing the request.\nUpon secondment of the motion by Senate Minority Leader Enyinnaya Abaribe (PDP Abia ), Senate President Lawan put it to voice votes with the Ayes having it.\nThe council also authorised the funding of a N5.26 trillion budget deficit through borrowings.\n“The budget deficit that is projected for 2022 is 5.62 trillion, up from 5.60 trillion in 2021."
  },
  {
    "headline": "Why police officers now fight over cases -NigPilot",
    "summarized_story": "My experience with the police has been very bad since they see cases reported to them as opportunities to make wealth from them.\nI thank God for the success made so far, knowing how difficult and expensive it is to get justice in this country.\nThis same issue was reported to the National Human Rights Commission’s office in Abuja, but nothing reasonable was done to ensure that justice is served.\nHuman Rights exist only by name, and so other agencies of government because they are not doing anything reasonable, they collect money from the government.\nIf these agencies of government are working, can people be calling an ordinary person to report cases to him?"
  },
  {
    "headline": "Why police officers now fight over cases -NigPilot",
    "summarized_story": "My experience with the police has been very bad since they see cases reported to them as opportunities to make wealth from them.\nI thank God for the success made so far, knowing how difficult and expensive it is to get justice in this country.\nThis same issue was reported to the National Human Rights Commission’s office in Abuja, but nothing reasonable was done to ensure that justice is served.\nHuman Rights exist only by name, and so other agencies of government because they are not doing anything reasonable, they collect money from the government.\nIf these agencies of government are working, can people be calling an ordinary person to report cases to him?"
  },
  {
    "headline": "Judge denies Britney Spears request to remove father as conservator -NigPilot",
    "summarized_story": "In court filings, Ms. Spears said she wanted private wealth management firm the Bessemer Trust appointed as “sole conservator”.\nEarlier, Mr. Spears, 68, filed court documents of his own, denying he was responsible for the restrictions apparently placed on his daughter’s private life.\nMr. Spears was replaced as conservator of Ms. Spears’s person on a temporary basis by Jodi Montgomery, the singer’s caregiver.\nIn a court filing, lawyers for Mr. Spears said he was “concerned” by Mr. Ingham’s request to make Ms. Montgomery’s position permanent.\nIt said:“Based on her statements to the court, Mr. Spears is concerned that the petition to appoint Jodi Montgomery filed by Ms. Spears’ court-appointed counsel Samuel D Ingham III does not reflect her wishes."
  },
  {
    "headline": "Judge denies Britney Spears request to remove father as conservator -NigPilot",
    "summarized_story": "In court filings, Ms. Spears said she wanted private wealth management firm the Bessemer Trust appointed as “sole conservator”.\nEarlier, Mr. Spears, 68, filed court documents of his own, denying he was responsible for the restrictions apparently placed on his daughter’s private life.\nMr. Spears was replaced as conservator of Ms. Spears’s person on a temporary basis by Jodi Montgomery, the singer’s caregiver.\nIn a court filing, lawyers for Mr. Spears said he was “concerned” by Mr. Ingham’s request to make Ms. Montgomery’s position permanent.\nIt said:“Based on her statements to the court, Mr. Spears is concerned that the petition to appoint Jodi Montgomery filed by Ms. Spears’ court-appointed counsel Samuel D Ingham III does not reflect her wishes."
  },
  {
    "headline": "Iyabo Ojo tenders apology to TAMPAN -NigPilot",
    "summarized_story": "Nollywood actress, Iyabo Ojo has in the latest post, tendered a public apology to the Theater Arts and Motion Picture Producers Association of Nigeria TAMPAN, an association in Nollywood.\nIn her latest statement, via her official Instagram page, Iyabo Ojo wrote; “I would like to say a very big thank you to @esabodofficialpage … God bless you ma, Agba yin a dale … I so much appreciate you, mama, & Love you… First & foremost I want to say a very BIG thank you to my God almighty, all mercifully, I love you Lord & I thank you for your constant protection, provision, and guidance over me & my family.\nI’m forever grateful… I will also want to use this opportunity to say a very BIG thank you to all my darling fans and loved ones for your constant love & support … Honestly, I’m so overwhelmed & humbled, I will never take it for granted.\n“To an able & ever-humble president of Tampan… @mrlatin1510 thank you very much, sir… “Our big daddies @adebayo.salami @princejidekosoko @realyinkaquadri on behalf of @nkechiblessingsunday my darling aburo & my humble self, we apologize to you sir we’re sorry for getting you upset, you’re our elders & leaders, we respect you, we’re humbled before you, we will forever appreciate you & honor you… it’s all Peace & Love.”Recall that TAMPAN, in a statement, had blacklisted Iyabo Ojo and her colleague, Nkechi Blessing, and had threatened to work against them for dragging the name of the association in the mud over issues that had to do with allegations made against actor Baba Ijesha"
  },
  {
    "headline": "Supreme Court Orders FG To Refrain From Ceding Oil Wells To Imo",
    "summarized_story": "The Supreme Court has granted an order of injunction refraining the Federal Government and its agencies from ceding oil wells at Akri and Mbede communities, to Imo State.\nThe order was granted on Wednesday to stop a purported implementation of the ceding of about 17 oil wells to Imo State, pending the determination of a suit brought before the court by the Rivers State Government.\nIn the ruling, the Supreme Court restrained the Attorney General of the Federation and the Attorney General of Imo State, from taking further action on the ownership of the Oil Wells, till the disputes surrounding them are resolved.\nMore to follow."
  },
  {
    "headline": "Nigeria Confirms 154 More COVID-19 Cases As Third Wave Fears Rise",
    "summarized_story": "COVID-19 cases have continued to soar in Nigeria as 154 more infections were confirmed in the country on Tuesday, raising further concerns about the third wave of the pandemic which was first detected in the West African nation in February 2020.\nNigeria Centre for Disease Control (NCDC), the agency spearheading the fight against the pandemic, announced the latest figures in its daily update late Tuesday.\nOf the number of confirmed infections for the day under review, Lagos State had 119 new cases, while Akwa Ibom followed with 11 more persons contracting the disease.\nAs of the time of this report, Nigeria has confirmed 168,867 cases while 164,623 have been discharged.\nDespite fears over the spike in cases and the confirmation of the highly contagious Delta strain, many Nigerians have abandoned safety protocols recommended by health authorities."
  },
  {
    "headline": "Two Soldiers Killed As Troops Repel ESN Attack In Enugu",
    "summarized_story": "Two soldiers were killed during a firefight between troops of the Nigerian Army and Eastern Security Network (ESN) members at Adani community of Uzo-Uwani Local Government Area of Enugu State.\nThis was contained in a statement signed on Wednesday by Director Army Public Relations, Brigadier General Onyema Nwachukwu.\nThe incident occurred when the troops were trying to repel an attack by the ESN on troops’ location at Iggah/Asaba checkpoint.\nTroops are currently on the trail of the criminals,” Nwachukwu said in the statement.\nThe Nigeria Army, therefore, assured the general public of its commitment to provide adequate security in the general area in collaboration with other security agencies."
  },
  {
    "headline": "Wife Of Former LGA Chairman Kidnapped In Jigawa",
    "summarized_story": "Gunmen have abducted the wife of the former chairman of Kaugama Local Government Area, Alhaji Ahmed Yahaya Marke.\nThe gunmen numbering about 10 were said to have stormed the residence of the former local council in Marke town, Jigawa around 1:00 am on Wednesday.\nThe victim identified as Hajiya Fatima is the first wife of the former LGA chairman.\nOne of the children of the kidnapped victim, Aliyu Ahmad, who confirmed the incident to Channels Television, said the gunmen came in motorcycles.\nThe police public relations officer in the state, ASP Lawan Shisu also confirmed the incident to Channels Television."
  },
  {
    "headline": "Jigawa Assembly Approves N21.7bn Supplementary Budget",
    "summarized_story": "Jigawa State House of Assembly has approved a supplementary budget of the sum of N21.7 billion submitted by the state executive council.\nThe state Commissioner of Finance, Babangida Umar Gantsa, while addressing journalists after the approval said the state deems it necessary to seek the supplementary budget to finance some critical projects included in the 2021 budget.\nREAD ALSO: Electoral Act Amendment: Senate Committee Presents Report On BillThe Commissioner added that the 2021 budget was proposed on 11.9% inflation rate and now it is 17.9%, while $40 per barrel of crude now sold at $69.\nThe Chairman House Committee on Constituency project Haruna Aliyu Danyatin said, the executive submitted N18.99 billion as proposed supplementary budget but the House increased it to N21.7 billion.\nHe added that the supplementary budget approved by the House will be used to fund projects in Education, Health, Electrification, and Roads projects as contained in the letter sent to the house by the executive."
  },
  {
    "headline": "Dozens dead as unrest continues in South Africa over jailing of Zuma",
    "summarized_story": "Protests sparked by ex-president Jacob Zuma’s arrest in South Africa last week for failing to appear at a corruption investigation have devolved into looting and an outpouring of widespread outrage over the misery and injustice that linger 27 years after apartheid ended.\nOn Wednesday, crowds in South Africa ransacked shops and offices, ignoring government demands to end a week of violence that claimed the lives of more than 70 people and destroyed hundreds of businesses.\nShopping malls and warehouses have been destroyed or set ablaze in a number of towns, primarily in Zuma’s home province of KwaZulu-Natal, as well as Johannesburg and the adjacent Gauteng province.\nThe protests, the worst in years in South Africa, hampered hospitals that were dealing with a third wave of COVID-19 and prompted a refinery to close.\nSoldiers have been deployed to the streets to assist outmanned police in containing the turmoil, and order was being restored in some areas on Wednesday, including the Alexandra township in northern Johannesburg, according to local television."
  },
  {
    "headline": "No hiding place for financial criminals – EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission has launched a mobile application to enhance the reporting of economic and financial crimes.\nChairman of the commission Abudlrasheed Bawa revealed that the application eliminates the direct person to person interference in the reporting process and guarantees anonymity which is important in efficient whistle blower policy.\nThe application known as Eagle Eye is available on App Store and Google play for free.\nThe application will allow Nigerians and other whistleblowers report financial criminals without fear of revealing their identity, and become possible target of attacks or persecution.\nThe application according to the Chairman of the EFCC, Abdulrasheed Bawa, will ensure their is no hiding place for financial criminals."
  },
  {
    "headline": "Minority leadership takes on House Leadership over defections",
    "summarized_story": "The Peoples Democratic Party has lost another member to the ruling All Progressives Congress.\nKabiru Ahmodu from Zamfara state joins five other colleagues in the state to move to the APC.\nDeputy Minority Leader, Toby Okechukwu, incurred the wrath of the House when he accused the Speaker of flagrantly flouting the constitution, which posits that any member who leaves a political party stands to lose his seat.\nSpeaker Femi Gbajabiamila took exception to the comment and was supported by the House Leader.\nAttempts by the Minority Leader and Nicholas Ossai to wade into the matter was turned down by the Speaker who ruled them out of order."
  },
  {
    "headline": "Burna Boy, Tiwa Savage, Ed Sheeran, Others to Perform in Global Citizen Concert to Unite the World, Defeat Poverty",
    "summarized_story": "Nigerian grammy award winning Burna Boy alongside Ed Sheeran will lead a group of artistes to perform at the Global Citizen live concert aimed at uniting the world, defending the planet and defeating poverty.\nGlobal Citizen Live is powered by citizens around the world who are taking action together with governments, corporations and philanthropists to make change.\nSpace can wait!”“I am very excited to perform at the Global Citizen Live concert this year.\nAccess Bank, will also support the Global Citizen Live campaign as a partner in Nigeria.\nSince March 2020, Global Citizen has mobilized $2 billion in cash grants to fund global pandemic relief efforts, and over 26 million COVID-19 vaccine doses."
  },
  {
    "headline": "Pope Francis Returns to Vatican 10 days after Surgery",
    "summarized_story": "Pope Francis was discharged from a Rome hospital and returned home to the Vatican on Wednesday, 10 days after undergoing surgery to remove half his colon.\nAfter the brief stop, Francis’ small motorcade approached a side entrance to the Vatican.\nFrancis had half of his colon removed for a severe narrowing of his large intestine on July 4, his first major surgery since he became pope in 2013.\nThe Vatican spokesman, Matteo Bruni, confirmed Francis’ return from the hospital and visit to the Rome basilica.\nThe Vatican had originally said Francis could be discharged last weekend, but later said he would stay a few days extra for further recovery and rehabilitation therapy."
  },
  {
    "headline": "Unrest in South Africa Could Impact Entire Region, African Union Warns – Arise News",
    "summarized_story": "More than 1 200 people have been arrested for public violence and economic sabotage.\nZuma is serving a 15-month sentence for contempt of a Constitutional Court order.\nHe said failure to resolve the crisis would have “grave impacts” on the country and the region.\n“The chairperson extends his deepest condolences to the families of the victims and wishes a rapid and full recovery to the wounded,” the statement read.\n“The chairperson calls for an urgent restoration of order, peace and stability in the country in full respect of the rule of law,” the statement added."
  },
  {
    "headline": "About 3,000 on Singapore Cruise Ship Confined to Cabins after Suspected Covid Case",
    "summarized_story": "A Genting Cruise Lines’ ship on a “cruise to nowhere” has returned to Singapore after a passenger was suspected of having contracted COVID-19 and the nearly 3,000 passengers and crew on board have been confined to their cabins.\nA 40-year-old passenger tested positive to a Polymerase Chain Reaction (PCR) test onboard and had been conveyed to hospital for further testing after the ship docked early on Wednesday, the Singapore Tourism Board said.\nThe guest suspected of having COVID-19 had tested negative in a mandatory, pre-departure antigen rapid test before the ship set sail for a three-night cruise on Sunday.\nOnly essential service crew with personal protective equipment were being allowed limited movement within the ship, Dream Cruises said.\nIn December, passengers on Royal Caribbean’s Quantum of the Seas vessel were held in their cabins for more than 16 hours in Singapore after a suspected COVID-19 case on board."
  },
  {
    "headline": "Jill Biden to attend Tokyo Olympics Opening Ceremony",
    "summarized_story": "First lady Jill Biden will attend the opening ceremony of the summer Olympics in Tokyo, the White House announced Tuesday, even as the city has entered a new state of emergency over a rise in coronavirus cases.\nBiden will attend the July 23 opening ceremony on her first solo trip abroad as first lady.\nShe also accompanied President George W. Bush to Beijing for the opening ceremonies of the 2008 Summer Olympics in China.\nMichelle Obama led a delegation to the 2012 Summer Olympics in London.\nJill Biden last attended the Olympics in 2010, when she and then-Vice President Joe Biden, led the U.S. delegation to the Winter Games in Vancouver, Canada."
  }
]