[
  {
    "headline": "Jigawa Hisbah tasks residents on graveyard management",
    "summarized_story": "Jigawa Hisbah Board has urged residents of the state to ensure proper sanitation and maintenance of graveyards in their respective communities.\nMalam Ibrahim Dahiru, the Hisbsh Commander, gave the charge in an interview with the News Agency of Nigeria (NAN) on Saturday in Dutse.\nThe commander lamented the pathetic state of some of the graveyards, particularly in rural areas due to poor sanitation.\n“It is worrisome that we are not giving the needed attention to the graveyards maintenance through regular sanitation to keep them tidy and clean.\n“At least residents should ensure they weed out grass three times a year in their respective graveyards,” he said."
  },
  {
    "headline": "Utomi tasks building institute on building collapse, affordable housing",
    "summarized_story": "Prof. Pat Utomi, Founder, Centre for Values in Leadership, has advised the Nigeria Institute of Building to address corruption and the dearth of artisans in the construction industry to curb building collapses in Nigeria.\nGiving a keynote address, tagged ‘Building Collapse as Metaphor,’ Utomi said that all hands must be on deck towards bridging the shelter gap.\nHe also urged NIOB to always engage the building regulatory agencies to rightly enforce laws to eliminate quacks in the industry and guarantee quality assurance in building production and management.\nHe urged Nigeria to emulate housing development and delivery in advanced economies to bridge the shelter gap and transform the nation’s economic fortunes.\nHe urged NIOB to take charge in correcting anomalies including the dearth of skilled artisans to tackle Nigeria’s housing deficit and housing needs."
  },
  {
    "headline": "Why we cancelled Emirates flights to Lagos – NCAA",
    "summarized_story": "…Air Peace refused more than one weekly flight to Dubai… Emirates initially granted 21 weekly flights to NigeriaBy Lawani MikairuThe Nigerian Civil Aviation Authority ,NCAA, yesterday explained why it withdrew the 21 weekly flights frequency earlier approved for Emirates Airlines by the Ministry of Aviation.\nThis is just as NCAA revealed that the only Nigerian airline, Air Peace, currently going to Dubai, UAE, was refused multiple flight frequency and given only one weekly flight.\nCaptain Musa Nuhu said: “The Nigerian Government was gracious to grant Emirates Airlines 21 frequencies it requested for.\nThe airline wants to operate 14 weekly flights to Lagos and another seven weekly to Abuja airports.\nThe letter read: “I write to inform you of the withdrawal of the approval granted to Emirates Airlines winter schedule."
  },
  {
    "headline": "Top trending Nigerian entertainers 2021, why they trended",
    "summarized_story": "Google on Wednesday released the 2021 top trending items on their search engine, showing the most searched terms, topics, personalities, entertainers and many more by Nigerians.\nShe practically lived the whole of 2021 in the eye of the storm on social media.\nThen, the pretty actress never left social media with all sorts of skits and antics.\nMusic Industry: Why they trendedIf Tiwa Savage hadn’t made the cut Google would have had some questions to answer.\nIn fact, Tiwa Savage was the most trending person of 2021 ahead of Obi Cubana and Sunday Igboho."
  },
  {
    "headline": "Bandits Kill kidnapped ECWA Church Pastor, after collecting ransom",
    "summarized_story": "…Exchange fire with security agents in Kaduna community, shoot pregnant ladyBy Ibrahim Hassan-WuyoBandits have finally killed Rev.\nDauda Bature, Pastor of ECWA Church Nariya, Kaduna State who was kidnapped in his farm.\nThe bandits later demanded for ransom and Rev.\nMeanwhile, residents of a Kaduna community had to run for their lives as security agents and Invading bandits were engaged in a gun duel ,leading to shooting of a pregnant woman.\nNormalcy has returned to the Sabo GRA as people were seen pursuing their legitimate businesses, even as stern looking combat ready security agents continued to patrol the area."
  },
  {
    "headline": "Teni, Jaywon, others thrill fans as Funmi Ayinke launches album “The Journey”",
    "summarized_story": "Shina Peller, the publisher of Ovation International, Bashorun Dele Momodu, royal fathers and others who all took part in the launching of the 15-track album titled, The Journey.\nThe album is a mix of inspirational and soulful soft music that was well produced and mastered to delight my listeners,” she said.\nOn her choice of features on the album, FunmiAyinke said, “I grew up listening to Chief Ebenezer Obey whose career has lasted multiple decades.\nIt was a dream come through having him on a record that I intend to use to inspire a wider audience.\nI also featured established characters such as veteran gospel singers: Funmi Aragbaye, TDot, Magnito, and Klint D Drunk on the album.”"
  },
  {
    "headline": "Tambuwal urges Buhari to do more on security situation in Sokoto",
    "summarized_story": "“It appear those bandits pursued from Zamfara state have relocated to Sokoto state.\nThis is a very serious concern,” he said,” I am appealing to President Muhammadu Buhari “to deploy more troops and resources to Sokoto state to fight the criminals.\n“Here in Sokoto state, you can verify this from the heads of security agencies, there is nothing they have asked of us that we have not done.\nSince the commencement of this administration, we have given security personnel in Sokoto state not less than 500 vehicles.\n“Mr President wants me to convey his profound condolence over the loss of all the citizens who have departed."
  },
  {
    "headline": "Zamfara: Police deploy tactical teams to Kaura Namoda, Moriki, Shinkafi",
    "summarized_story": "Zamfara State Police Command said it has deployed a police tactical team to Kaura Namoda-Moriki and Shinkafi road to put the insecurity situation ravaging the axis under control.\n“As for now, the road is free for movement because we have deployed seven operational vehicles working from morning until evening,” Elkanah said.\nThe commissioner, however, appealed to the residents of the area to be calm as the security operatives are on top of the issue, pleading that they should not run away from their origin.\nDAILY POST reports that the axis has been the enclave of bandits in the state after they shifted from Dansadau axis where they operate from.\nIt was learnt that Kaura Namoda, Moriki, Shinkafi and Zurmi have now remained the colony of banditry in the state."
  },
  {
    "headline": "Ex-Jigawa Commissioner for Environment, Gambasha is dead",
    "summarized_story": "Former Jigawa State Commissioner for Environment, Barau Abdullahi Gambasha, is dead.\nA family source told DAILY POST that the Commissioner died Friday night in a hospital at the age of 63 after suffering from undisclosed illness.\nMeanwhile, Governor Muhammad Badaru Abubakar of Jigawa State has consoled the families and the people of the state.\nThe statement said the governor was deeply saddened with the news of the death of Alhaji Baurau Gambasha who was a former member of the state executive council and commissioner of environment.\nGovernor Badaru said Alhaji Barau Gambasha was a seasoned politician whose contributions to the political development in the state will ever be remembered."
  },
  {
    "headline": "Matawalle’s aide, Bappa condemns insurgency in northern Nigeria",
    "summarized_story": "These are uprisings that have a theological root attached to their philosophy, albeit a queer interpretation of the Islamic by the two separate insurgents.\nIt has now matured into crass satanism by burning humans alive without purpose at all”“I have heard a lot of apologists for these bandits.\nHe also banned the ‘Yan-Sa-Kai Vigilantes which they alleged were killing their brethren in the rural areas.\n“If indeed, they are fighting for their ethnic clans, we would have seen them channeling their proceeds to the development of those clans.\nThey shall continue to be treated as such until the desired end to their undesirable menace is brought to a glorious end.”"
  },
  {
    "headline": "CSOs urge Bauchi govt to lift embargo on employments",
    "summarized_story": "A call has gone to the Bauchi State Government to lift as a matter of urgency, embargo placed on employment in the state, particularly in the health and education sectors.\nThe call was made on Friday by the Forum of Executive Directors of Civil Society Organisations (CSOs), which declared that it was long overdue for the state government to do so.\nChindo lamented that as against the 1,208 numbers required in health facilities across the state, only 109 are currently serving in the facilities.\nHe noted that the situation has overwhelmed health workers to the extent that one person performs the work of about 10 persons.\n“The government must find a way to employ while they are cleaning the payroll."
  },
  {
    "headline": "No one is happy anymore – Gov Ortom laments state of nation",
    "summarized_story": "Governor Samuel Ortom of Benue State has lamented that Nigerians are currently in pain over the state of the nation ranging from deteriorating security situation to economic issues.\nThe governor who spoke on Friday during the swearing-in of the new National Working Committee of the Peoples Democratic Party, PDP led by its Chairman, Dr. Iyorchia Ayu and other members of the National Working Committee, NWC, appealed to Nigerians to work together for the restoration of the country’s glory.\nHe urged all citizens of the country to put partisan politics, religion and ethnic sentiments aside and team up with the PDP for the rescue of the nation.\n“But with the swearing in of a new leadership of the PDP in place which is an alternative to the APC-led Government, I am hopeful for myself, for my state and for my country Nigeria.\nThe Governor expressed hope that the coming in of Dr. Ayu and other members of the National Working Committee marks the beginning of the rescue mission and called on the people to work together to rebuild the country which the founding fathers envisaged."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "78 Nigerian students arrive Russia on Scholarship — Embassy",
    "summarized_story": "Seventy-Eight Nigerians who are on scholarship to study various courses have arrived in Russia, the Nigerian Embassy in Moscow has said.\n“The thirty-two (32) scholars, accompanied by two (2) officials of the Federal Scholarship Board (FSB) were received by officials of Nigerian Embassy, Moscow.\n“The students are currently undergoing mandatory language courses at the various universities in Russia,” the statement said.\n“Every year, over eighty-five (85) Nigerian students are awarded scholarships to study in Russia.\nIn 2021, over one hundred Nigerian scholarship students, currently studying virtually, are scheduled to arrive before the end of the year,” it said."
  },
  {
    "headline": "Atiku faults Buhari’s development strategies, seeks power devolution",
    "summarized_story": "Former Vice President Atiku Abubakar on Saturday faulted President Muhammadu Buhari’s development strategies.\nThe former Vice President spoke on “Diversity, Education and Autonomy” while delivering the convocation lecture of the Achievers University, Owo in Ondo State.\nAtiku, who reiterated his call for autonomy of the constituent parts, said the country needs to tailor its development policies and practices to its diversity.\n“That is how you allow greater autonomy while pulling together.\nGreater autonomy for states will allow ideas to germinate from anywhere and blossom."
  },
  {
    "headline": "BREAKING: Police rescue abducted Imo monarch",
    "summarized_story": "The police on Saturday rescued unhurt the traditional ruler of the Mbutu Ancient Kingdom in Aboh Mbaise Local Government Area of Imo State, Eze Damian Nwaigwe.\nHe was taken away from the palace at about 2:30 am on Thursday.\nA source said the gunmen, numbering about 10, shot into the air before whisking the monarch away.\nREAD ALSO: Imo monarch murdered 24 hours after abductionThe command’s spokesman, Michael Abattam, a Chief Superintendent of Police, confirmed the development.\n- Advertisement -He said the monarch has been reunited with his family."
  },
  {
    "headline": "Why I want to be Gov. of Benue – AGF",
    "summarized_story": "Why I want to be Gov.\nof Benue – AGFFormer Attorney-General of the Federal (AGF) and Minister of Justice, Chief Micheal Aondoakaa, has told The Nation he will create wealth and employment through agriculture for youths if elected as governor of Benue State in 2023.\nHe said Benue as the food basket of the nation has no reason not to create wealth and generate employment through agriculture.\nThe APC governorship aspirant said as governor of Benue, he will also give priority to agric processing, mechanism and export to generate foreign earnings.\n- Advertisement -“From the performances of President Muhammadu Buhari, I am confident that Nigeria and Benue in particular will vote APC come 2023,” he said."
  },
  {
    "headline": "2023: We’re not desperate for Yoruba president –Afenifere",
    "summarized_story": "From Oluseye Ojo, IbadanPan-Yoruba socio-cultural and political organisation, Afenifere, has said it was not desperate to have a Yoruba man as Nigeria’s president in 2023.\nThe group’s position was in contrast with that of Yoruba Council of Elders (YCE), which said it supported a president of Yoruba extraction.\nThey insisted that presidential power must come to the South West in 2023, and the acceptable person that the Yoruba would present for the office would be decided as time progresses.\nAs far as we are concerned in Afenifere, whoever that emerges as president in 2023, will have problem in running the country if Nigeria is not restructured.\nHe added that the Yoruba that are interested in contesting for president in 2023 should come out clearly and declare their intention."
  },
  {
    "headline": "Abducted Imo monarch killed, body dumped at market square",
    "summarized_story": "From George Onyejiuwa, OwerriTension and anxiety gripped Imo State on Friday, with the killing of the abducted traditional ruler of Atta community in Njaba Local Government area of the state.\nThe lifeless corpse of Eze Azike who was reportedly abducted on Thursday was dumped at the market square of this community on Friday morning.\nIt was also learnt that the gunmen had killed four other persons in the Atta Njaba community before the abduction of the late traditional ruler.\n“The traditional ruler of Atta ancient kingdom in the Njaba LGA, Eze Edwin Azike, has been murdered.\nHis lifeless body was dumped at the market square and the villagers discovered it this morning."
  },
  {
    "headline": "2023: Igbo won’t beg for presidency –Massob, others",
    "summarized_story": "Movement for the Actualization of the Sovereign State of Biafra (MASSOB), yesterday, said it was abominable for the Igbo to kneel to people in order to mount the saddle of power.\nNdigbo are not cowards or weaklings.”He advised Igbo elders to stop making disgraceful and disrespectful utterances in their quest for the President of Nigeria.\nHe added that being a president of Nigeria for four or eight years is not the ultimate desire of Ndigbo.\nSupporting the MASSOB leader’s stance, the National President of Indigenous Igbo Youth Congress (IIYC), Chief Mayor Echefu, said that Igbo do not kneel for anybody or group, but only to Almighty God.\nChairman of ADF Media and Publicity Bureau, Abia Onyike noted that it was left for each Igbo presidential aspirant to decide which approach to adopt in pursuing his aspiration."
  },
  {
    "headline": "Pastor nabbed for raping pregnant woman in Ondo",
    "summarized_story": "From Bamigbola Gbolagunte, AkureThe Police in Ondo State have arrested a popular broadcaster and pastor of Celestial Church of Christ (CCC) (names withheld) for allegedly raping a five-month pregnant lady inside the premises of his church.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nIt was alleged that the 19-year old lady was raped when she went for a deliverance programme at the church.\nOn that faithful day, I went to church but unfortunately, they had finished the service.\nHe later stood up and entered a room; he called me to enter a room inside the church."
  },
  {
    "headline": "Men are polygamous by nature –Nkechi Blessing",
    "summarized_story": "Nollywood actress, Nkechi Blessing Sunday will never quit her marriage because of infidelity; rather she would stay back and fight for what she loves.\nI do not support cheating because no woman wants to share her husband, but these are things that one cannot control.\nMen are polygamous by nature.\nThere are a lot of attractive females everywhere, so it takes the grace of God for a man to stay faithful to a woman.\nSocial media doesn’t scatter relationships; it’s the lies that partners tell themselves that scatter it."
  },
  {
    "headline": "Tambuwal: Defective Military Operation in Zamfara Made Sokoto Vulnerable to Bandits’ Attacks",
    "summarized_story": "Aminu Waziri Tambuwal of Sokoto state, has left the state “very vulnerable” to the deadly and inhuman activities of these criminal elements.\n“It does appear as if those bandits pursued from Zamfara state have relocated to Sokoto state.\nThis is a very serious call for concern,” he said, appealing to President Muhammadu Buhari “to deploy more resources to Sokoto state.\nSince the commencement of this administration, we have given security personnel in Sokoto state not less than 500 vehicles.\n“Mr President wants me to convey his profound condolence over the loss of all the citizens who have departed."
  },
  {
    "headline": "At Biden’s Forum, Buhari Promises Free, Fair Elections, Transfer of Power to Winners in 2023",
    "summarized_story": "“I am proud to state that Nigeria has had over two decades of uninterrupted democratic governance and has unequivocally remained committed to upholding the core values and principles of democracy.\n“Since assuming office in 2015, we have been able to introduce mechanisms to ensure free, fair and credible elections.\nPresident Buhari thanked President Biden, government and people of the United States for hosting the summit.\n“We, therefore, must remain resolute and enhance cooperation, so that together, we build back better democratic institutions and sustainable democratic values,” the President said.\nBut regrettably, our democratic gains of the past decades are under threats of unconstitutional takeover of power."
  },
  {
    "headline": "N69bn Debt: Appeal Court Dismisses Jimoh Ibrahim’s Suit to Recover Asset",
    "summarized_story": "The appellate court upheld the November 4, 2020 order of Justice Rilwan Aikawa of the Federal High Court, Lagos which authorised AMCON to take over Ibrahim’s assets.\nOther properties are the building of Abuja International Hotels Limited located at No.\n94, Awolowo Road, Ikoyi, Lagos; NICON Building at No.\nSome other entities which AMCON alleged were linked to Ibrahim, including Nicon Insurance Limited, Nigerian-Re-Insurance Limited, Abuja Hotel Limited and Nicon Hotels Limited also filed an application asking the judge to discharge the said order.\nIn a unanimous decision yesterday, the Court of Appeal upheld the preliminary objection of AMCON and accordingly dismissed both appeals."
  },
  {
    "headline": "Omicron: Obasanjo, Uganda’s Former VP, in Joint Article, Lambast Western World for Red Listing African Countries",
    "summarized_story": "Our CorrespondentsFormer president Olusegun Obasanjo and the former vice-president of Uganda, Specioza Wandira-Kazibwe, have condemned the travel ban on African countries over concerns relating to the Omicron variant of COVID-19.\nA number of countries in Europe banned travel from countries in Africa following the discovery of the variant by South African scientists.\n“Africa’s embrace of smart multilateralism is manifest in being the first continent to agree on a common digital platform for bio-surveillance and biosecurity.\nIt was as clear as noonday to those of us championing African multilateralism that retreating behind the walls of nationalist survival would be continental suicide.\n“This is smart multilateralism at work."
  },
  {
    "headline": "Jolted by Unending Killings, President Sends NSA, IG, Three Others to Sokoto, Katsina",
    "summarized_story": "On the same day, hundreds of youths stormed the streets of Kano State, with banners and placards, protesting mass killings in Northern Nigeria.\nSokoto KillingsTerrorists have been ravaging Sokoto State for almost three years, with several local government areas under the control of the outlaws.\nKatsina KillingsIn Katsina State, the terrorists are active in virtually all the local government areas.\nHe said: “The gruesome murder of Dr. Rabe Nasir, a serving commissioner in Katsina State, is a great loss, not only to Katsina State, but also to the entire nation.\nThere has been outrage in the North since terrorists burnt alive some travellers in Sokoto State early in the week."
  },
  {
    "headline": "Junketing President Buhari To Visit Turkey, Plans Local Trips To Ebonyi, Kano, Daura",
    "summarized_story": "Buhari, it was gathered, would also be embarking on local trips to Ebonyi, Kano as well as to his hometown of Daura in Katsina State where he is likely to spend the New Year break.\nLocal trips in December include Ebonyi, Kano and Daura where he will likely spend the New Year break,” a source within the President's circle told SaharaReporters on Saturday.\nShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja, for the UAE.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionThe Nigerian President has been junketing across the world in the last three months.\nIn September 2021, Buhari travelled to New York, United States, to participate in the 76th Session of the United Nations General Assembly."
  },
  {
    "headline": "Junketing President Buhari To Visit Turkey, Plans Local Trips To Ebonyi, Kano, Daura",
    "summarized_story": "Buhari, it was gathered, would also be embarking on local trips to Ebonyi, Kano as well as to his hometown of Daura in Katsina State where he is likely to spend the New Year break.\nLocal trips in December include Ebonyi, Kano and Daura where he will likely spend the New Year break,” a source within the President's circle told SaharaReporters on Saturday.\nShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja, for the UAE.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionThe Nigerian President has been junketing across the world in the last three months.\nIn September 2021, Buhari travelled to New York, United States, to participate in the 76th Session of the United Nations General Assembly."
  },
  {
    "headline": "BREAKING: Angry Youths Barricade Highways In Northern Nigeria, Protest Against Killings In Region, Buhari's Failure",
    "summarized_story": "Some angry youths have blocked some major highways in the Northern part of the country to protest against incessant attacks by armed bandits in the region.\nThe protest followed the killing of 45 travellers by bandits in Sokoto.\nThe protesters, displaying placards depicting their anger at the situation, have been sighted in Kano, Bauchi, Zamfara and Sokoto states.\nHe said: “I am very distressed at the manner of death visited on these hapless citizens who were undertaking a legitimate journey to another part of the country.\n“It shows that the evil this administration is confronting requires the support and involvement of all Nigerians."
  },
  {
    "headline": "BREAKING: Angry Youths Barricade Highways In Northern Nigeria, Protest Against Killings In Region, Buhari's Failure",
    "summarized_story": "Some angry youths have blocked some major highways in the Northern part of the country to protest against incessant attacks by armed bandits in the region.\nThe protest followed the killing of 45 travellers by bandits in Sokoto.\nThe protesters, displaying placards depicting their anger at the situation, have been sighted in Kano, Bauchi, Zamfara and Sokoto states.\nHe said: “I am very distressed at the manner of death visited on these hapless citizens who were undertaking a legitimate journey to another part of the country.\n“It shows that the evil this administration is confronting requires the support and involvement of all Nigerians."
  },
  {
    "headline": "Ex-Jigawa Environment Commissioner, Gambasha, Is Dead",
    "summarized_story": "A former Jigawa State Commissioner for Environment, Barau Abdullahi Gambasha, is dead.\nA family source told Daily Post that the commissioner died on Friday night in a hospital at the age of 63 after suffering from an undisclosed illness.\nGovernor Muhammad Badaru Abubakar of Jigawa State has condoled with the family of the deceased and people of the state.\nIn a statement signed by Special Adviser Media and Public Relations to the governor, Habibu Nuhu Kila, Abubakar said they were saddened by the news of the death of Gambasha.\nHe described his death as a great loss not only to his family but the state in general."
  },
  {
    "headline": "'Itunu will be vindicated' -- Reps vow to investigate death of Nigerian lady in Côte d’Ivoire prison",
    "summarized_story": "The house of representatives says it will unravel the circumstances surrounding the demise of Itunu Babalola, the Nigerian lady who died in Côte D’Ivoire prison.\nEmmanuel Babalola, the father of the deceased, said the family wants a thorough investigation into the cause of his daughter’s death.\nHe said Itunu was victimised in prison and appealed to the federal government to wade into the matter urgently.\nThe post went viral and eventually gained the attention of the Nigerians in Diaspora Commission (NIDCOM).\nItunu died in prison after she was said to have contracted an infection."
  },
  {
    "headline": "'Itunu will be vindicated' -- Reps vow to investigate death of Nigerian lady in Côte d’Ivoire prison",
    "summarized_story": "The house of representatives says it will unravel the circumstances surrounding the demise of Itunu Babalola, the Nigerian lady who died in Côte D’Ivoire prison.\nEmmanuel Babalola, the father of the deceased, said the family wants a thorough investigation into the cause of his daughter’s death.\nHe said Itunu was victimised in prison and appealed to the federal government to wade into the matter urgently.\nThe post went viral and eventually gained the attention of the Nigerians in Diaspora Commission (NIDCOM).\nItunu died in prison after she was said to have contracted an infection."
  },
  {
    "headline": "EXCLUSIVE: 'It's totally unjust' -- UAE writes Hadi Sirika, seeks review of Emirates' flight frequency",
    "summarized_story": "The United Arab Emirates (UAE) says the Nigerian Civil Aviation Authority’s (NCAA) action to limit Emirates’ flights to once weekly is unjustifiable.\n“Air Peace initially operated at Sharjah Airport, shifted to Dubai Airport, and then returned to Sharjah Airport.\nIt, however, urged NCAA to review the decision and restore the approval of the Emirates Airline Winter Scheule, as filed.\n“Finally, we suggest that Air Peace should consider flying their two flights to any UAE airport at which there are available slots.\nAs expected, the GCAA will support Air Peace in this activity, where required."
  },
  {
    "headline": "EXCLUSIVE: 'It's totally unjust' -- UAE writes Hadi Sirika, seeks review of Emirates' flight frequency",
    "summarized_story": "The United Arab Emirates (UAE) says the Nigerian Civil Aviation Authority’s (NCAA) action to limit Emirates’ flights to once weekly is unjustifiable.\n“Air Peace initially operated at Sharjah Airport, shifted to Dubai Airport, and then returned to Sharjah Airport.\nIt, however, urged NCAA to review the decision and restore the approval of the Emirates Airline Winter Scheule, as filed.\n“Finally, we suggest that Air Peace should consider flying their two flights to any UAE airport at which there are available slots.\nAs expected, the GCAA will support Air Peace in this activity, where required."
  },
  {
    "headline": "Daily COVID Tracker: Infections spread amid Omicron variant as NCDC logs 533 cases",
    "summarized_story": "AdvertisementThe World Health Organisation (WHO) had said 115,000 nurses died from COVID at 115,000, but Catton said the figure is probably double.\nNigeria records 533 COVID infectionNigeria has seen a surge in the daily number of COVID cases amid the spread of the Omicron variant.\nOn Friday, the Nigeria Centre for Disease Control (NCDC) recorded 533 cases across the country.\nOmicron: Obasanjo, Wandira-Kazibwe advocate ‘global hyper-cooperation’ amid travel banFormer President Olusegun Obasanjo and Specioza Wandira-Kazibwe, former vice-president of Uganda, have condemned the travel ban on African countries over concerns relating to the Omicron COVID variant.\nSeveral western nations banned travel from Africa following the discovery of the Omicron COVID variant by South Africa."
  },
  {
    "headline": "This may be African languages’ best bet against extinction",
    "summarized_story": "How can this be avoided, especially for African languages?\nGet the best African tech newsletters in your inboxMandla, a Zulu and Xhosa word that means power, is an innovative e-learning language app created for those who seek to strengthen their connection with their African roots.\nA diverse team building a diverse productAs the duo built, they realised they needed more diverse hands.\nThe third Apiou raised is about niche: their product focuses on Africa and African languages and culture.\nUnlike other language learning apps that are including African languages just to check a diversity-and-inclusion box, Mandla’s mission is deeper than educational or entertainment purposes; it’s really about cultural preservation."
  },
  {
    "headline": "Could Africa ditch cash?",
    "summarized_story": "The era of cash could be drawing to an end as central bank-backed digital currencies (CBDC”s) takes root in Africa.\nSo far, it’s only Nigeria that has launched an official, state-backed digital currency – christened the eNaira – on the continent as more countries continue to express interest.\nThe Baobab Network has traced at least 60 cryptocurrency companies in Africa, with the majority (43 percent) of them headquartered in Nigeria, followed by South Africa (18 percent) and Kenya (11 percent).\nThis is affirmed by another comparative study by GSMA published in March 2021 showing more than half of 310 live mobile money services in 2020 across the globe were found in Africa.\nWith over 55 percent of the world’s mobile money services recorded in Africa and a significant population turning to e-wallets and cryptocurrency, the question now becomes whether the continent might ditch paper money altogether."
  },
  {
    "headline": "CinetPay gets $2.4m seed to digitise payments in francophone Africa",
    "summarized_story": "CinetPay, an Ivory Coast-based startup that enables merchants in francophone Africa to accept and make electronic payments online or via mobile Point of Sale (PoS) devices, on Wednesday said it has raised $2.4 million seed funding.\nOn CinetPay’s mobile and web-based platform, businesses can sign up to process payments from over 130 different payment operators—including MTN mobile money, M-Pesa, Orange Money, Visa, Mastercard, etc—via a single interface.\nCinetPay thus simplifies the process of accepting payments, eliminating the need for merchants to integrate with different systems for managing sales and revenues.\nSimilarly, up to 80% of the population in the French-speaking African region have a mobile money account and less than 20% bank accounts.\nWalter Baddoo, co-founder and General Partner at 4DX Ventures reveals that the VC firm has been “tracking the francophone Africa market” for some time now and is impressed by CinetPay’s ambitious goal to digitise payments across the region."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Enterprise Hotel is democratising real estate investments for regular Africans",
    "summarized_story": "AdvertisementFractional investment startup, Enterprise Hotel, hopes to change this by offering Africans the opportunity to invest in commercial real estate with as little as ₦30,000 ($52).\nHow Enterprise Hotel makes moneyEnterprise Hotel makes money in two ways.\nHis time working in real estate showed him that only a handful of people could afford to buy or own real estate.\nThen we can start talking to investors.”Aside from helping more people gain access to real estate investments, Enterprise Hotel indirectly solves another problem.\nFor Enterprise Hotel, operating in the real estate industry with its high financial requirements poses a significant hurdle."
  },
  {
    "headline": "Open banking and its progenitor, nominees, Techpoint Awards 2021, and some exciting news out of Africa",
    "summarized_story": "However, the open banking system is arguably one of his most significant achievements.\nOluwanifemi Kolawole had a chat with the finance expert, and he dished about his career, life, and the open banking system.\nRead: Adedeji Olowe is building a global reputation as Africa’s open banking leaderAnd the nominees are…By now, I’m sure you’ve heard about the biggest tech event in West Africa — Techpoint Build 2021.\nNominees for Techpoint Awards (Nigerian edition) are out!\nTo check if your favourite Nigerian startup made the list, click here: Techpoint Awards 2021: And the nominees are…Some exciting newsCinetPay Founders."
  },
  {
    "headline": "Road to super app? GIGM adds e-wallet, bill payment features",
    "summarized_story": "Share this article:Nigeria-based mobility giant, GIGM, has launched a payment service for its users.\nSource: SuppliedThe super app model has gained popularity in emerging economies following the successes of WeChat and Alipay in China.\nFor GIGM, this could be building on its tech-enabled transportation platform to offer payment services to its users.\nNigeria’s fragmented transportation services mean that users cannot travel comfortably over short distances.\nWith its position as a leading transportation service provider and the addition of a payment option, the company looks to be on the right path."
  },
  {
    "headline": "More pain for Nigerian states as FAAC shrinks by N68bn in November",
    "summarized_story": "More pain for Nigerian states as FAAC shrinks by N68bn in NovemberThe ability of Nigerian states and other tiers of government to meet their various obligations is under more risk as gross monthly distribution by the Federation Account Allocation Committee (FAAC) to the three tiers of government dropped by N68billion in November.\nThe continuous decline in Nigeria’s FAAC allocation to the three tiers of government is also due to the subsidy payment, according to market analysts.\nThe Nigerian National Petroleum Corporation (NNPC) has been deducting from its remittance to FAAC, a threat to the ability of many Nigerian states and other tiers of government to meet their financial obligations.\n“Since June ’21, the corporation has deducted a total of N939bn from its FAAC remittance.\n“Incessant payment of subsidy on refined petroleum products would narrow FAAC allocations and widen the country’s budget deficit."
  },
  {
    "headline": "IHS risks losing N380bn tower deal with MTN Nigeria over dollar pricing",
    "summarized_story": "IHS, the largest tower company in Africa, may lose an eight-year-old N380 billion contract after MTN Nigeria required the deal to be denominated in the local currency, the naira.\nIHS controls many MTN Group tower assets in different parts of Africa including Nigeria.\nIn 2014, IHS acquired 4,154 towers from MTN Nigeria and a further 4,696 towers in 2015.\nThe 9,000 towers from MTN Nigeria are more than 50 percent of IHS’ tower assets in Nigeria at 16,522 towers.\nMTN holds 85,176,719 ordinary shares of IHS Towers, representing about 20 percent of the tower company, as a result of the IPO."
  },
  {
    "headline": "Again, Emirates suspends flights to Nigeria over UAE-Nigeria diplomatic row",
    "summarized_story": "The United Arab Emirates (UAE) has rejected the directive from Nigeria that puts on hold Emirates flights suspension while restricting the carrier to one weekly light to Abuja.\nThe carrier, in a statement, said Emirates will be completely suspending its flights between Nigeria and Dubai until the Civil Aviation Authorities from both countries find a solution to the current ongoing issue.\nAccording to the carrier, “With the recently imposed directive limiting Emirates to operate one flight per week to Nigeria via Abuja, Emirates will be completely suspending its flights between Nigeria and Dubai, until the Civil Aviation Authorities from both countries find a solution to the current ongoing issue.\n“We regret the inconvenience caused, and customers can contact their travel agent or booking office to make alternative arrangements.\nNuhu explained that Hadi Sirika, the Minister of Aviation had graciously granted Emirates Airlines 21 frequencies weekly to two major airports in Nigeria; Lagos, 14 and Abuja, seven."
  },
  {
    "headline": "Obaseki swears in five SSAs, 12 SAs in Orhionmwon LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has sworn in five Senior Special Assistants (SSAs) and 12 Special Assistants (SAs), following harmonization by leaders and members of the Peoples Democratic Party (PDP) in Orhionmwon Local Government Area (LGA).\nObaseki, who performed the inauguration ceremony in Abudu, the headquarters of Orhionmwon LGA, reiterated the need to encourage women participation in politics.\nI said for SSAs, they should give me five nominations and two of these people should be women.\nThey mobilized for us and now it’s time for them to get an appointment, but they were not nominated.\nWhen I came to campaign, we made promises and I am not the kind of leader that doesn’t fulfill promises."
  },
  {
    "headline": "Obaseki, Ibori, Kwankwaso, others pay last respects to Lucky Igbinedion’s mother, Maria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Friday, joined other eminent Nigerians to pay last tribute to late Mrs. Maria Oredola Igbinedion, mother of former Edo State Governor, Chief Lucky Igbinedion.\nGuests at the funeral mass held at St. Austin Catholic Church, Benin City include former Military Governor of Bendel State, Sen. Tunde Ogbeha; former Governor of Delta State, Chief James Ibori and former Governor of Kano State, Sen. Rabiu Kwankwaso.\nOthers are former Senate President, Pius Ayim Pius; former Imo State Governor, Achike Udenwa; former Edo State Deputy Governor, Mike Oghiadomhe and Sen. Matthew Urhoghide, among others.\nObaseki, who commiserated with the former governor, extolled the exemplary life of late Mrs. Maria Oredola Igbinedion, noting that she lived a fulfilled life, in service to God and humanity.\nMoses said late Maria Igbinedion exuded uncommon love and impacted positively on those who crossed her path while she was alive."
  },
  {
    "headline": "A 13 -year old girl has been raped to death in Issele Uku, Aniocha Local Government Area of Delta – Nigerian Observer",
    "summarized_story": "A 13 -year old girl has been raped to death in Issele Uku, Aniocha Local Government Area of DeltaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – A rights activist, Henry Gwanimshu, had earlier posted the incident on Facebook.\nHe had said that the teenager was hypnotized and raped on Tuesday night by a married man, whose name was given as Mr. Nwosu Chuka.\n“Sadly, she died few hours ago at El Comfort Hospital Bonsaac Asaba.\n“Before her death, she told her sister that Chuka Nwosu took her to Vatonic hotel Issele Uku where she was raped and then used a white tissue paper to wipe blood from her private part.\nHe described the incident as second so far recorded at Issele Uku."
  },
  {
    "headline": "Obaseki swears in five SSAs, 10 SAs in Ovia South-West LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Thursday, swore in five Senior Special Assistants (SSAs) and 10 Special Assistants (SAs) in Ovia South-West Local Government Area (LGA) of the state.\nObaseki, who swore in the new appointees at Iguobazuwa, the administrative headquarters of Ovia South-West LGA, urged leaders and members of the party in the council to encourage more women into politics.\nObaseki noted, “When we campaigned during our election, you went with us and saw the challenges facing our people.\nHe said, “The e-registration in Ovia South West is not as encouraging and impressive as it ought to be.\nIn Orhionmwon, new members are over 52,000; Ikpoba-Okha 61,000, and Akoko-Edo 31,000, but here in Ovia South-West, it’s 2,510."
  },
  {
    "headline": "Alleged take over of Abuja Electricity: Court orders parties to maintain status quo",
    "summarized_story": "A Federal High Court sitting in Abuja, on Friday, ordered parties in a suit filed over the controversy on the alleged takeover of the Abuja Electricity Distribution Company (AEDC) to maintain status quo pending the next date of hearing.\nThe plaintiffs had sought an order restraining the AGF, CBN, BPE and Ministry of Finance from interfering with the operations and management of AEDC .\nAfter hearing the motion, Justice Ekwo ordered the parties to maintain status quo ante bellum pending the next date of hearing.\nHe adjourned the case until December 20 for hearing of the motion on notice.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Osun 2022: Dele Adeleke Picks Nomination Form, Says Osun Needs to be Re-engineered",
    "summarized_story": "By Sunday Oguntuyi OsogboOne of the Peoples Democratic Party (PDP) aspirants in the forthcoming Osun governorship election, Mr Bamidele Adeleke, has picked his nomination form.\nAdeleke picked his nomination form Friday afternoon at the national headquarters of the party in Abuja.\nThis is why rural dwellers are today living like they are not part of the Osun project.\n“One thing is clear to even the people who are in power today – Osun state needs urgent re-engineering.\n“I am coming into this race with three decades of hard-earned working experience in corporate financial re-engineering, project management and human resource management."
  },
  {
    "headline": "2023: Arewa group seeks power shift to Southeast, says North now a human abattoir",
    "summarized_story": "ACCSON, umbrella body of over 40 CSOs, youth , students and women groups in the North, said it considered the said statement attributed to Yerima as a reckless one devoid of reason, empathy, and fairness.\nThe African Youth Charter defines a youth as somebody within the age brackets of 15 to 35 years-old.\nWhile the United Nations categorized such person as one who is between 15 to 24 years-old respectively.”“So, going by the above definitions, Alhaji Yerima Shettima is not a youth and can not be classified as one.\nBoth past and present crop of elected and appointed leaders from within our region have failed us completely.\nThe North Central Zone alone has produced two Senate Presidents in 12 years; a Deputy Senate president and a Deputy Speaker of the House of Representatives."
  },
  {
    "headline": "Omicron: Obasanjo, Uganda’s former VP, Wandira-Kazibwe blast U.K, others for imposing bans on African countries",
    "summarized_story": "Nigeria’s former president, Chief Olusegun Obasanjo and former vice president of Uganda, Specioza Wandira-Kazibwe, have in a joint article condemned the travel ban on African countries over concerns relating to the Omicron Covid-19 variant.\nOver 20 of countries, mostly in Europe, North America and Asia, including the United Kingdom, banned travel from countries in Africa following the detection of the Omicron Coronavirus variant by South African scientists.\n“Africa’s embrace of smart multilateralism is manifest in being the first continent to agree on a common digital platform for bio-surveillance and biosecurity.\nIt was as clear as noonday to those of us championing African multilateralism that retreating behind the walls of nationalist survival would be continental suicide.\n“This is smart multilateralism at work."
  },
  {
    "headline": "Ogun, Lagos On Collision Course Over Proposed Light Rail Project",
    "summarized_story": "The governments of Ogun and Lagos states may soon be on collision course following the notice of demolition cum acquisition served by the Lagos Metropolitan Area Transport Authority (LAMATA) on residents of Itoki-Agbado-Ijoko community in preparation for the construction of the proposed Light Rail project by Lagos State.\nOlakunle Oluomo issued the directive while presiding over the Assembly’s businesses during the plenary session yesterday.\nOluomo was apparently responding to the submission of his colleague-lawmaker from Ifo II state constituency, Hon.\nGaniyu Oyedeji, who reported the unauthorized distribution of the demolition notice by LAMATA to residents of the areas under personal explanation at a plenary held at the Assembly Complex, Oke-Mosan, Abeokuta.\nThe Ogun Speaker also lauded the state governor, Prince Dapo Abiodun on the proposed road projects listed for construction and rehabilitation as contained in the year 2022 budget proposal currently being debated by the lawmakers."
  },
  {
    "headline": "Ogun, Lagos On Collision Course Over Proposed Light Rail Project",
    "summarized_story": "The governments of Ogun and Lagos states may soon be on collision course following the notice of demolition cum acquisition served by the Lagos Metropolitan Area Transport Authority (LAMATA) on residents of Itoki-Agbado-Ijoko community in preparation for the construction of the proposed Light Rail project by Lagos State.\nOlakunle Oluomo issued the directive while presiding over the Assembly’s businesses during the plenary session yesterday.\nOluomo was apparently responding to the submission of his colleague-lawmaker from Ifo II state constituency, Hon.\nGaniyu Oyedeji, who reported the unauthorized distribution of the demolition notice by LAMATA to residents of the areas under personal explanation at a plenary held at the Assembly Complex, Oke-Mosan, Abeokuta.\nThe Ogun Speaker also lauded the state governor, Prince Dapo Abiodun on the proposed road projects listed for construction and rehabilitation as contained in the year 2022 budget proposal currently being debated by the lawmakers."
  },
  {
    "headline": "Kidnapping: Court To Deliver Judgment In Evans Case February 25",
    "summarized_story": "Justices Hakeem Oshodi of the Lagos State High Court in Ikeja on Friday fixed February 25, 2022, to deliver judgment in the case of alleged kidnap kingpin, Chukwudimeme Onwuamadike also known as, Evans and five others charged with conspiracy and kidnapping.\nEvans is also facing similar charges before Justice Oluwatoyin Taiwo and Justice Adedayo Akintoye of the same court.\nWhile arguing his final written address, Evans’s lawyer, Victor Opara urged the court to discharge and acquit his client of the crimes.\nADVERTISEMENTHe said, “The victim said he was blindfolded throughout his 88-day ordeal, did not state to the court in his testimony that he could physically identify Evans.\n“There is also the fatality of the prosecution’s case that there was no identification parade to identify the first defendant (Evans)."
  },
  {
    "headline": "Kidnapping: Court To Deliver Judgment In Evans Case February 25",
    "summarized_story": "Justices Hakeem Oshodi of the Lagos State High Court in Ikeja on Friday fixed February 25, 2022, to deliver judgment in the case of alleged kidnap kingpin, Chukwudimeme Onwuamadike also known as, Evans and five others charged with conspiracy and kidnapping.\nEvans is also facing similar charges before Justice Oluwatoyin Taiwo and Justice Adedayo Akintoye of the same court.\nWhile arguing his final written address, Evans’s lawyer, Victor Opara urged the court to discharge and acquit his client of the crimes.\nADVERTISEMENTHe said, “The victim said he was blindfolded throughout his 88-day ordeal, did not state to the court in his testimony that he could physically identify Evans.\n“There is also the fatality of the prosecution’s case that there was no identification parade to identify the first defendant (Evans)."
  },
  {
    "headline": "Clergyman In Police Net For Raping Pregnant Woman",
    "summarized_story": "For allegedly raping a five months pregnant woman, men of Ondo State Police Command have arrested a popular pastor of Celestial Church of Christ (CCC), Gbenga Filani.\nPastor Filani, who is also a popular broadcaster in the state allegedly, raped the woman inside the church premises.\nLEADERSHIP Weekend learnt that the 19-year old lady identified as Bukola was allegedly raped when she came for deliverance at the church of the pastor.\nOn that fateful day, I went to Church but unfortunately, they ended the service.\nI did all the things he asked me to do“He dipped his middle finger with oil on my private part."
  },
  {
    "headline": "Adebanjo is a blank politically-minded leader, pestered Tinubu to build his Lekki house –Akande",
    "summarized_story": "The former Osun State governor further said Adebanjo pestered the APC National Leader, Asiwaju Bola Tinubu, to build him a house in Lekki, where he now resides.\nChief Adebanjo celebrated his 90th birthday in 2018.\nChief Adebanjo, the most vociferous of them, is a blank politically-minded leader who recognises readily and always that he never has what it takes to aspire for high political positions.\n“He constantly harbours lumps of yellow hate-bile in his heart for any co-political leader with brighter chances for any major public office within or outside his political party.\n‘Papa, you can see that this document is old, Tinubu said as he handed over a big envelope to Ajayi."
  },
  {
    "headline": "Adebanjo is a blank politically-minded leader, pestered Tinubu to build his Lekki house –Akande",
    "summarized_story": "The former Osun State governor further said Adebanjo pestered the APC National Leader, Asiwaju Bola Tinubu, to build him a house in Lekki, where he now resides.\nChief Adebanjo celebrated his 90th birthday in 2018.\nChief Adebanjo, the most vociferous of them, is a blank politically-minded leader who recognises readily and always that he never has what it takes to aspire for high political positions.\n“He constantly harbours lumps of yellow hate-bile in his heart for any co-political leader with brighter chances for any major public office within or outside his political party.\n‘Papa, you can see that this document is old, Tinubu said as he handed over a big envelope to Ajayi."
  },
  {
    "headline": "Kaduna bandits kill kidnapped ECWA pastor, after collecting ransom",
    "summarized_story": "Dauda Bature, Pastor of ECWA Church Nariya, Kaduna State who was kidnapped in his farm.\nThe bandits later demanded for ransom and Rev.\nDauda’s wife took the ransom and delivered to the bandits.\nMeanwhile, residents of a Kaduna community had to run for their lives as security agents and Invading bandits were engaged in a gun duel ,leading to shooting of a pregnant woman.\nNormalcy has returned to the Sabo GRA as people were seen pursuing their legitimate businesses, even as stern looking combat ready security agents continued to patrol the area."
  },
  {
    "headline": "Kaduna bandits kill kidnapped ECWA pastor, after collecting ransom",
    "summarized_story": "Dauda Bature, Pastor of ECWA Church Nariya, Kaduna State who was kidnapped in his farm.\nThe bandits later demanded for ransom and Rev.\nDauda’s wife took the ransom and delivered to the bandits.\nMeanwhile, residents of a Kaduna community had to run for their lives as security agents and Invading bandits were engaged in a gun duel ,leading to shooting of a pregnant woman.\nNormalcy has returned to the Sabo GRA as people were seen pursuing their legitimate businesses, even as stern looking combat ready security agents continued to patrol the area."
  },
  {
    "headline": "Bandits Kill Abducted ECWA Pastor In Kaduna After Collecting Ransom",
    "summarized_story": "Reverend Dauda Bature, pastor-in-charge of the Evangelical Church Winning All in Nariya, Igabi Local Government Area, Kaduna State, was assassinated by bandits after an undisclosed ransom was paid.\nThe cleric was alleged to have been kidnapped on November 8 while working in his farm in the same area, according to Sun.\nThe bandits allegedly began negotiations with the man’s wife and sought a ransom of roughly N10 million, which the family could not afford at the moment.\n“When some money was raised, they asked the wife to bring the money which she took to them on November 18.\n“What this means is that the bandits have become so cruel and brutal to their victims."
  },
  {
    "headline": "Gov Masari Reveals Why Katsina Commissioner Was Brutally Murdered",
    "summarized_story": "Aminu Bello Masari, the Governor of Katsina State, has revealed how the late Commissioner of Science and Technology in Katsina State, Dr. Rabe Nasir, died.\nNadir’s lifeless body was found in the bathroom of his home, located at the Fatima Shema Housing Estate yesterday,” Masari said in the statement.\n“He was a conscientious, dedicated, hardworking, and loyal person who never failed in any duty assigned to him,” Masari said of the deceased.\nWhile expressing his condolences to the Commissioner’s immediate family, which included his wife, children, elderly mother, and many siblings, Katsina State Governor stated the Commissioner’s death was a big loss to the state.\nIn Katsina, the body of late Dr. Nasir Rabe was laid to rest today, in accordance with Islamic rights."
  },
  {
    "headline": "Buhari’s Visit To Ebonyi Key To Release Of Nnamdi Kanu From Detention — Ohanaeze",
    "summarized_story": "Ohanaeze, however, urged the leadership of IPOB to stop any attempt or action that will warrant President Buhari to decline in actions that will lead to the unconditional release of Nnamdi Kanu.\n“IPOB shouldn’t give credence to the antagonism and friction of Northern groups like Arewa Consultative Forum, Northern Elders Forum, Coalition of Northern groups and Arewa Youths that President Buhari shouldn’t release Nnamdi Kanu, because this imbecility and absurdity will make President Buhari to decline in actions that will lead to the release of Nnamdi Kanu.\n“Ndigbo will welcome President Buhari to Ebonyi State in line with Igbo traditional culture and norms of welcoming esteemed visitors.\n“Southeast Governors led by Governor Umahi will secure the release of Nnamdi Kanu and others in Abakiliki.\nWe have implicit confidence that the southeast political leadership and Igbo leadership led by Ohanaeze Ndigbo will seal the deal and facilitate the release of Nnamdi Kanu."
  },
  {
    "headline": "Sylvester Oromoni: 6 Suspects Arraigned, Remanded In Custody",
    "summarized_story": "Three students and three staff members of Dowen College Lekki were remanded in custody by a Lagos Chief Magistrate Court yesterday for the attack and death of 12-year-old Sylvester Oromoni Junior.\nFollowing an application by the Lagos State Police Command to retain the suspects in custody awaiting the conclusion of its investigation into the terrible incident, Magistrate A.O.\nOn Tuesday, the Lagos State Police Command announced that five Dowen College pupils and three housemasters were already in arrest for alleged participation in the killing of a classmate.\n“The students whose names were mentioned are in police custody and investigation is on.\nThe police authorities had so far refused to make public the names of the suspects in its custody over the incident."
  },
  {
    "headline": "CSOs condemn publications against Military, hail security forces",
    "summarized_story": "A coalition of Civil Society Organisations (CSOs) have faulted media publications insinuating that internal wrangling in the military was responsible for the security challenges being faced in the country.\nGen. S A Adebayo has been the Chief of Military Intelligence and has admirably vast experience and expertise.\n“Throughout the history of Nigeria, the synergy within and between the armed forces and security agencies has been legendary, leading to the formation of joint operations and task forces with astonishing results.\n“The coordinated military operations and the successes against terrorism and criminality in the country is a perfect testimony to the coordination and cooperation between the army.\n“Nigerians must discountenance the press release from the group and continue to cooperate with security forces to further destroy these elements of disunity.”RelatedNo tags for this post."
  },
  {
    "headline": "VIDEO: Watch as Wife slaps husband during live radio show",
    "summarized_story": "A Ghanaian woman has slapped her husband in front of a shocked presenter during a radio interview on Kumasi-based Nhyira FM in the Ashanti region of Ghana.\nShe assaulted her husband in front of the stunned radio presenter, their landlady, and other guests present in the studio.\nHe disclosed that his wife has been keeping faeces and urine in their room, although they have a toilet and a bathroom.\nThe distraught man further mentioned that his wife has not been washing their children’s clothes.\nThe woman noted that her husband was disgracing her on live radio."
  },
  {
    "headline": "Despair, anger as petrol price increase looms",
    "summarized_story": "Many Nigerians continue to wonder why the strong interest in petrol subsidy when subsidy for gas and kerosene has long been removed.\n“In the 2020 budget, we made a provision to assume that at the maximum by the end of June, we must exit the petroleum subsidy.\nThey wondered why the government would stop subsidies on petrol and pay N5, 000 to 40 million Nigerians.\nQuestioning the methodology for selecting the 40 million, the LCCI said the method of selecting the beneficiaries is faulty.\nSo, we have to have a landing as to the exact number between 20 to 40 million."
  },
  {
    "headline": "‘Don’t Be Afraid To Say It Out,’ Sanwo-Olu Asks Students To Report Bullies",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu has urged students in the state to promptly report any incident of bullying and not be afraid to report anyone that mistreats them.\nThe governor while addressing the students on Friday, during the commissioning of Lagos State Model College in Igbokuta, Ikorodu stressed that bullying will not be tolerated.\nYou must be well behaved, if there is any unusual event, don’t be afraid to say it out.\nWe do not want to have pupils that will be condoning bullying and cultism in their schools.\nHe encouraged the students not to keep quiet in the face of bullying but to, “say something if you see something."
  },
  {
    "headline": "Emirates To Suspend Nigeria Flights From December 13",
    "summarized_story": "Emirates Airline on Friday said it was suspending all its flights between Nigeria and Dubai from December 13.\nThe airline’s decision comes after the Nigerian Civil Aviation Authority (NCAA) limited its flight activities in Nigeria.\nThe NCAA had accused UAE authorities of not granting equal rights to the sole Nigerian carrier, Air Peace, flying to Dubai via Sharjah.\nREAD ALSO: Why We Withdrew Frequencies Approval For Emirates Airlines – NCAA“With the recently imposed directive limiting Emirates to operate one flight per week to Nigeria via Abuja, Emirates will be suspending its flights between Nigeria and Dubai from 13 December 2021, until the UAE and Nigerian authorities work on a solution to the ongoing issue,” a statement from Emirates said on Friday.\nCustomers can simply hold on to their Emirates ticket and when flights resume, get in touch with their travel agent or booking office to make new travel plans."
  },
  {
    "headline": "Buhari Sends Security, Intelligence Heads To Sokoto, Katsina Over Worsening Attacks",
    "summarized_story": "President Muhammadu Buhari Friday dispatched a high-level delegation, made up of the heads of the nation’s intelligence and security services to Sokoto and Katsina States in response to the recent spike in bandit activities.\nAccording to senior special media aide, Garba Shehu, the president is expecting an immediate situation report and recommendations on actions to follow to effectively deal with the worrying situation.\nRead Also: FG Begins Administration Of COVID-19 Booster ShotsThe delegation led by the National Security Adviser, Major General Babagana Munguno (Rtd) is made up of the Inspector General of Police, Usman Alkali Baba, the Director-General of the DSS Yusuf Magaji Bichi, the Director-General, National Intelligence Agency, Ambassador Ahmed Rufa’i Abubakar and the Chief of Defence Intelligence, Major General Samuel Adebayo.\nThe president’s latest action was prompted by the recent gruesome killing of several travelers in Sokoto and the assassination of a commissioner in Katsina State.\nHe extended deep condolences to the families of the victims, assuring Nigerians that security agencies would continue to give their all to bring to an end the operations of the criminals."
  },
  {
    "headline": "Reps Seek Compulsory Establishment Of Crèches In All Public And Private Workplaces",
    "summarized_story": "The House of Representatives is seeking the compulsory establishment of creches in all public and private workplaces in the country.\nA bill seeking to establish the creches passed second reading on the floor of the House in Abuja on Thursday.\nThe long title of the bill reads, “A Bill for an Act to Amend the Labour Act, Cap.\nL1, Laws of the Federation of Nigeria, 2004 to make Provision for Establishment of Creches in every Public or Private (Health, Educational, Industrial or Commercial, Etc.)\nWHO states the advantages of exclusive breastfeeding thus: “Breast milk is the ideal food for infants."
  },
  {
    "headline": "At Least 50 Dead In Kentucky As Storms Batter U.S.",
    "summarized_story": "At least 50 people were dead after a tornado ripped through the southeastern US state of Kentucky, its governor told reporters, as storms ravaged large swathes of the country.\nSeveral counties in Kentucky were devastated, with the strongest tornado tearing 200 miles through the state, governor Andy Beshear said.\nThe Collinsville Emergency Management Agency described it as a “mass casualty incident” with “multiple subjects trapped at Amazon Warehouse”.\nIn a statement sent to local media, Amazon spokesperson Richard Rocha said “the safety and well-being of our employees and partners is our top priority right now.\nIn Tennessee, at least two people were killed in storm-related incidents, an emergency management official told local media."
  },
  {
    "headline": "ECOWAS council considers two-term limits for presidents in the region",
    "summarized_story": "ECOWAS council considers two-term limits for presidents in the region"
  },
  {
    "headline": "Akeredolu's aide accuses Federal Fire Service of damaging his vehicle -",
    "summarized_story": "A Special Assistant to the Ondo state Governor, Oluwarotimi Akeredolu on Multimedia, Olugbenga Asade, has accused the Federal Fire Service Corps (Ondo State) of damaging his vehicle.\nHe noted that two months after damaging his vehicle, nothing has been done to fix it by the fire fighters.\nThey declined my request to see the driver that crashed my vehicle.\nHe therefore requested, that the Federal Fire Service Corps should provide the truck driver that crashed his vehicle with an apology for absconding and as well, take responsibility of fixing his damaged vehicle.\nAccording to him, the Federal Fire service in the state has continued to turn deaf ears to his plea."
  },
  {
    "headline": "[WATCH] Bisi Akande unveils Autobiography entitled 'My Participations'",
    "summarized_story": ""
  },
  {
    "headline": "Updated: 28-year-old female lawyer nominated commissioner in Nasarawa -",
    "summarized_story": "A 28 year old female lawyer, Hannah Bala, has been nominated as a Commissioner by the Nasarawa State Governor, Abdullahi Sule.\nThe nomination of the female lawyer was announced at the state House of Assembly by the Speaker, Ibrahim Balarabe.\nThis follows the presentation of fifteen commissioner nominees to the assembly for consideration.\nSpeaking on her nomination, the Nasarawa State governor, Abdullahi Sule through his Chief Press Secretary, said the decision is to encourage and ensure active participation of the youths in governance.\nHannah graduated from the Nasarawa State University Keffi in 2016 and proceeded to the Nigerian law school where she graduated in 2018."
  },
  {
    "headline": "New UK Mask Rules Start as Johnson Under Fire Over Parties",
    "summarized_story": "In his current role, Doyle has directed the government’s public statements about the party allegations.\nFor several days, Johnson’s office denied a party had taken place and insisted rules had been followed at all times.\nThat claim unraveled when a leaked video showed senior staff members joking about the alleged party.\nI don’t know.”The Christmas party claims are the latest in a string of allegations of rule-breaking and ethics violations by Johnson and government officials.\nWes Streeting, health spokesman for the opposition Labour Party, said the stream of allegations undermined trust in the government during a public health crisis."
  },
  {
    "headline": "Nigeria: Jolted by Unending Killings, Buhari Sends NSA, IG to Sokoto, Katsina",
    "summarized_story": "Terrorists have been ravaging Sokoto State for almost three years, with several local government areas under the control of the outlaws.\nLast Thursday, three people were killed by extremists who invaded Kurawa village in Sabon Birni Local Government Area of Sokoto State.\nLast Wednesday, the Katsina State Commissioner of Science and Technology, Dr. Rabe Nasir, was killed in his House located at Fatima Shema Quarters, Katsina.\nHe said: “The gruesome murder of Dr. Rabe Nasir, a serving commissioner in Katsina State, is a great loss, not only to Katsina State, but also to the entire nation.\nThere has been outrage in the North since terrorists burnt alive some travellers in Sokoto State early in the week."
  },
  {
    "headline": "Omicron: Obasanjo, Uganda’s Former VP, in Joint Article, Lambast Western World for Red Listing African Countries",
    "summarized_story": "Former NIgeria president Olusegun Obasanjo and the former vice-president of Uganda, Specioza Wandira-Kazibwe, have condemned the travel ban on African countries over concerns relating to the Omicron variant of COVID-19.\nA number of countries in Europe banned travel from countries in Africa following the discovery of the variant by South African scientists.\n“Africa’s embrace of smart multilateralism is manifest in being the first continent to agree on a common digital platform for bio-surveillance and biosecurity.\nIt was as clear as noonday to those of us championing African multilateralism that retreating behind the walls of nationalist survival would be continental suicide.\n“This is smart multilateralism at work."
  },
  {
    "headline": "At Biden’s Forum, Buhari Promises Free, Fair Elections, Transfer of Power to Winners in 2023",
    "summarized_story": "“I am proud to state that Nigeria has had over two decades of uninterrupted democratic governance and has unequivocally remained committed to upholding the core values and principles of democracy.\n“Since assuming office in 2015, we have been able to introduce mechanisms to ensure free, fair and credible elections.\nPresident Buhari thanked President Biden, government and people of the United States for hosting the summit.\n“We, therefore, must remain resolute and enhance cooperation, so that together, we build back better democratic institutions and sustainable democratic values,” the President said.\nHe also noted that the summit was taking place at a time when democratic institutions around the world were facing several challenges."
  },
  {
    "headline": "Nigerian Magnate Otedola Acquires Additional Stake in First Bank Holdings, Consolidates Largest Shareholder Status",
    "summarized_story": "Mr Otedola acquired at least 2.5 per cent additional interest in the company, bringing his total stake to 7.57 per cent.\nMr Otedola previously made piecemeal acquisitions summing up to 5.07 per cent.\nThe purchase will formally consolidate his position as the single biggest shareholder of FBN Holdings, placing him well ahead of his closest rival Tunde Hassan-Odukale, FirstBank’s chairman, whom he has come in contention with since the news of his share acquisitions broke into the open late October.\nDays after, the board of FBN Holdings issued a letter seen by PREMIUM TIMES to the Corporate Affairs Commission, notifying Hassan-Odukale’s “5.36 per cent” cumulative stake and other related details.\nThat technically puts Hassan-Odukale’s interest in the entity at 4.31 per cent after deducting the controversial stake."
  }
]