[
  {
    "headline": "BREAKING: Tanzania’s Abdulrazak Gurnah wins 2021 Nobel Literature Prize",
    "summarized_story": "Tanzanian-born novelist Abdulrazak Gurnah, whose work touches on colonialism and refugee life, on Thursday won the Nobel Literature Prize, the Swedish Academy said.\nGurnah has published 10 novels and a number of short stories.\nThe Nobel Prize comes with a medal and a prize sum of 10 million Swedish kronor (about 980,000 euros, $1.1 million).\nAhead of Thursday’s announcement, Nobel watchers had suggested the Swedish Academy could choose to give the nod to a writer from Asia or Africa, following a pledge to make the prize more diverse.\nOf the 118 literature laureates since the first Nobel was awarded in 1901, 95 — or more than 80 percent — have been Europeans or North Americans."
  },
  {
    "headline": "Actress Etinosa bags four nominations in HAPAwards, gets US invitation",
    "summarized_story": "Nollywood actress, Etinosa Idemudia, has bagged four nominations in the Hollywood and African Prestigious awards, and an invitation to the United States for the event.\nThe excited mother-of-one took to her verified Instagram handle to announce her nominations, sharing screenshots of her invite.\nShe captioned her post, ” I have just received multiple award nominations and invitation to Los Angeles CA USA.\nThe first award I get from a project is the reaction, joy and satisfaction of my viewers.\nThe actress lost her father two weeks ago and had vowed not to procreate again."
  },
  {
    "headline": "BREAKING: National Assembly’ll pass 2022 budget before end of 2021 —Lawan",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said the National Assembly is committed to passing the 2022 Appropriation Bill before the end of this year.\nLawan, in his opening speech at the budget laying ceremony, recalled how the 9th National Assembly promised to return Nigeria to a January-to-December budget cycle with the 2020 budget and made it possible.\nHe added that the feat was repeated with the 2021 budget.\nWhile thanking the President, Major General Muhammadu Buhari (retd), for early presentation of budget, the Senate President said the lawmakers would pass the money bill before the end of 2021 to allow maintenance of the new budget cycle."
  },
  {
    "headline": "Happening: President Buhari presents 2022 budget to National Assembly",
    "summarized_story": "President Muhammadu Buhari making the budget presentation to the National AssemblyBy Tordue Salem, ABUJAPresident Muhammadu Buhari has arrived the National Assembly for the presentation of the Appropriations Bill 2022, in company governors, ministers and heads of agencies.\nThe President wore a solemn look as a Christian prayer from Senator Bamidele Opeyemi(APC-Ekiti State), and a Moslem one by Rep Makki Yalleman(Jigawa-APC) were said.\nDetails coming.\nVanguard News Nigeria"
  },
  {
    "headline": "Tanzanian Abdulrazak Gurnah wins Nobel literature prize",
    "summarized_story": "Source: APTanzanian writer, Abdulrazak Gurnah, has been awarded the Nobel Prize for Literature.\nThe prize money comes from a bequest left by the prize’s creator, Swedish inventor Alfred Nobel, who died in 1895.\nThe 2021 Nobel Prize for literature was announced today, Thursday.\nNigeria’s Professor Wole Soyinka won the Nobel Prize in Literature in 1986.\nBenjamin List and David W.C. MacMillan were named as laureates of the Nobel Prize for chemistry on Wednesday for finding an easier and environmentally cleaner way to build molecules that can be used to make compounds, including medicines and pesticides."
  },
  {
    "headline": "Oyo tree that fell, killed 4, ‘rises’",
    "summarized_story": "Below are images of the same tree when it fell.\nBy Sola Isola, IBADANThe 100-year-old tree that fell on Monday due to heavy windstorm at Sabo area of Oyo in Oyo State, leaving four people dead, has reportedly risen again.\nSources confirmed that the fallen tree rose back mysteriously on Tuesday, after all its branches had been hewn off.\nOba Lamidi Adeyemi, the Alaafin of Oyo, was said to have gone to the scene to commiserate with the families of the people, who died when the tree fell on its victims.\nThe fallen tree rose back again mysteriously."
  },
  {
    "headline": "80% of our convictions cybercrime-related — EFCC",
    "summarized_story": "By Wahab AdesinaThe Economic and Financial Crimes Commission, EFCC, has revealed that 80 percent of the convictions it has made were offences related to cyber security.\nREAD ALSO:Police nab 1 for alleged murder in EnuguHe said: “I want to authoritatively state that as at September, 2021, the commission has recorded about 978 convictions out of this, 80 per cent is connected to cybercrime and cybercrime related offences.\n‘’However, this development has made our e-dealings vulnerable to cyber attacks and negative consequences of security threats.\n“Cyber security experts believe that financial damages and losses will reach $6, 000, 000, 000, 000.00 by the end of this year.\n‘’This rise was triggered by the huge financial gains on the side of the perpetrators,” Bawa said."
  },
  {
    "headline": "N’Delta youths not militants, oppressive govt is militant — Bishop Egbebo",
    "summarized_story": "Hyacinth Oroko Egbebo, Bishop, Catholic Diocese of Bomadi, Delta State, is both a preacher and activist on the pulpit.\nThey are culpable and must not have anything to do with our future engagements for development of the Niger-Delta.\nWe recall with lots of regret that our own son who was the immediate past president did not have the courage to make the PIA a reality.\nThese boys are not militants and if there was anything militant, it was Nigeria herself that was militant against us.\nWhat I do primarily is to use my office as a bishop to proclaim the truth, the good news to everybody."
  },
  {
    "headline": "Insecurity: Security agencies urged to unite against terrorism in Nigeria",
    "summarized_story": "The National President of the Nigeria Union of Journalists, NUJ, Mr. Chris Isiguzo, on Thursday, tasked all security agencies to unite against terrorism and other related insecurity that is ravaging all parts of the country, especially now the 2023 general election is fast approaching.\nHe expressed worries over the increasing insecurity in the country especially in the southeast region wherein some suspected hoodlums have continued to destroy valued properties worth millions of naira and killings of innocent citizens of the area.\n“It is in this regard that we frown at the various comments of some highly placed Government officials that accuse the media of over-blowing security challenges in the country before the international community.\n“The good news is the fact that our automated identity card is already addressing the issue of quacks and fake media practitioners.\nAny individual who wants to belong to the NUJ must adhere to the provisions of the constitution with respect to membership,” he stated."
  },
  {
    "headline": "PIA: Senate confirms four NPRA members",
    "summarized_story": "The Senate has confirmed the appointment of Mr Idaere Ogan, as Chairman, Nigerian Midstream and Downstream Petroleum Regulatory Authority (NPRA).\nMohammed said that the nominees possessed the technical knowledge and professional expertise needed to be appointed as members of the board.\n“I think this should be noted for Nigerians to know that country is ready for full utilisation and optimisation of the benefits in the oil and gas sector,” he said.\nPresident of Senate, Ahmad Lawan, said that the nominees were expected to lay a solid foundation for the NPRA.\nHe, therefore, advised them to work in collaboration with the relevant committees of the National Assembly to ensure a positive outcome in the oil and gas sector."
  },
  {
    "headline": "Anambra election test to determine Nigeria’s future – Traditional ruler tells Buhari",
    "summarized_story": "A traditional ruler in Abia State, Eze Uwadiegwu Ogbonnaya, has said that the forthcoming gubernatorial election in Anambra State is a test to determine the future of Nigeria.\nRecall that the Independent National Electoral Commission (INEC) has fixed Saturday, 6th November 2021, as the date for the gubernatorial election in Anambra State.\nOgbonnaya, while addressing the delegates conference, insisted that the election will determine where Nigeria will be in the future.\n“This election in Anambra State will be a test for Nigeria.\n“If the Federal Government cannot declare a state of emergency in Borno and other North-East states, how can the Federal Government declare a state of emergency in Anambra State,” he said."
  },
  {
    "headline": "Police warn vigilance group members against unlawful acts in Kano",
    "summarized_story": "The Commissioner of Police in Kano State, Sama’ila Shu’aibu-Dikko, has advised vigilance group members against unlawful acts for better performance of their official assignments.\nShu’aibu-Dikko gave the advice in Kano when the State Commander, Vigilante Group of Nigeria (VGN), Malam Shehu Rabiu, visited him said that the group should be seen working for the interest of the society.\nHe explained that the security agencies are very much aware of their activities towards promoting security in the state for its overall development.\nHe advised the vigilance group members not to detain suspects, hand them over to the police, and not videotape suspects to ensure proper investigation.\nThe VGN Commander, Shehu Rabiu, had explained that the visit was to strengthen synergy with the police to ensure a more effective fight against crime in the state."
  },
  {
    "headline": "BREAKING: Buhari arrives NASS for 2022 budget presentation",
    "summarized_story": "President Muhammadu Buhari has arrived at the National Assembly for the 2022 annual budget presentation to the joint session of lawmakers.\nHe arrived at 12.05 pm with top government officials and a retinue of aides to the waiting lawmakers at the green chamber of the House of Representatives.\nHe was immediately received by the Senate President, Dr Ahmad Ibrahim Lawan, and the Speaker of the House of Representatives, Hon.\nFemi Gbajabiamila.\nDetails later…"
  },
  {
    "headline": "PHOTOS: Buhari receives Gov Obiano in Abuja",
    "summarized_story": ""
  },
  {
    "headline": "Osinbajo off to UK for UN event",
    "summarized_story": "By Bolaji Ogundele, Abuja- Advertisement -Vice President Yemi Osinbajo will on Thursday leave Abuja for London, the United Kingdom, where he is billed to represent the President at a United Nations (UN) high level event on the Energy Transition in Africa agenda with special focus on Nigeria.\nThis was disclosed in a statement by Senior Special Assistant to the President on Media and Publicity, Office of the Vice President, Mr Laolu Akande.\nThe event, holding Friday at the Imperial College, will feature meetings organised by UN Energy ahead of the UN Climate Conference COP26 which would be hosted by the United Kingdom in Glasgow, Scotland.\nThe Vice President will also deliver an address at the event where he is billed to interact with the academic community on the global energy transition and Nigeria’s position on a just transition.\nThe Vice President will be accompanied by the Minister of State for Environment, Mrs Sharon Ikeazor and the Special Adviser to the President on Economic Matters, Dr Adeyemi Dipeolu, among others."
  },
  {
    "headline": "NDLEA arrests 90 suspected drugs dealers in Edo",
    "summarized_story": "- Advertisement -The National Drug Law Enforcement Agency (NDLEA) command in Edo, has arrested 90 suspected illicit drugs dealers in the state.\nMr Buba Wakawa, the state NDLEA commander disclosed this when he spoke with the News Agency of Nigeria (NAN) Benin on Thursday.\nHe said that 7,135.79 kilogrammes of hard drugs made up of cannabis sativa, psychotropic substance and four pinches of methamphetamine were also recovered from them.\n“A total number of 15 cannabis sativa farms measuring about 40.03 hectares were also discovered and destroyed within the period.\nHe reiterated the command’s commitment to winning the war against illicit drug peddling and trafficking in the state."
  },
  {
    "headline": "Money Laundering: Maina’s son, Faisal, bags 14 years jail term",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Federal High Court has convicted and sentenced the son of former Chairman of the defunct Pension Reform Taskforce Team, Abdulrasheed Maina, Faisal, to 14 years imprisonment.\nWhile the court sentenced the Defendant to five years in count 1 and 3 of the charge, he was sentenced to 14 years on count 2 of the charge.\nThe court held that the it found him guilty on all the three-counts of money laundering offences, said the sentence would run concurrently, starting from Thursday.\nIt alleged that Maina’s son had sometimes between 2013 and 2019, received the sum of N58.11million, being proceeds of a corrupt act by his father.\nThe EFCC had ealier told the court that it got intelligence report that Faisal had escaped to the United States of America."
  },
  {
    "headline": "Heavy security at National Assembly as Buhari presents 2022 budget",
    "summarized_story": "Heavy security presence have been thrown in and around the National Assembly Complex in Abuja as the President, Major General Muhammadu Buhari (retd.\n), is billed to lay the 2022 Appropriation Bill before a joint session of the National Assembly at 12noon.\nBuhari had on Tuesday written to both the Senate and the House of Representatives to notify the chambers of his intention to present the Federal Government budget on Thursday.\nBy Wednesday, the premises had begun to wear a new look especially along the route the President takes from the Presidential Villa to the White House section of the complex, which houses the chambers.\nThe ceremony is to take place at the House chamber, which has a bigger capacity to contain the 469 members of the parliament, members of the Federal Executive Committee and more."
  },
  {
    "headline": "FG threatens to declare state of emergency in Anambra",
    "summarized_story": "From Juliana Taiwo-Obalonye, Ndubuisi Orji, Abuja, Stanley Uzoaru, Owerri, Obinna Odogwu, Awka and Geoffrey Anyanwu, EnuguThe Federal Government, yesterday, threatened to invoke a state of emergency in Anambra State to ensure the sanctity of the November 6 governorship election.\nMeanehile, angry reactions have trailed the state of emergency threat of the Federal Government.\nMalami, however, said the Federal Government had the responsibility to sustain democratic order and would not hesitate to declare a state of emergency if the security situation in the state did not improve to allow peaceful conduct of election.\nAs a government, we have a responsibility to ensure the sustenance of our democratic order, we have a responsibility to provide security to life and properties.\nAnd necessary security in terms of democratic order must certainly prevail for the purpose of this election,” he said."
  },
  {
    "headline": "The Sun Awards: We’re honoured to be chosen –Ezeigbo, Onunkwo",
    "summarized_story": "Nnamdi Ezeigbo and Chairman/Chief Executive Officer, Seahorse Lubricants Industries, Chief Ebuka Onunkwo, have described The Sun Awards as worthy recognition that excites every winner.\nCommending The Sun for speaking the truth and defending the voiceless, Ezeigbo said he was happy to join other eminent Nigerians who had been honoured by the newspaper.\nNigeria has about 200 million people; so, it’s something very special to be picked out of this number.”Describing The Sun Awards as prestigious.\nUkeh commended Ezeigbo for leading what he called a revolution in the telephone and computer gadgets sector in the country.\nApart from Ezeigbo and Onunkwo, there are 22 others who will receive awards."
  },
  {
    "headline": "Respite for patients as doctors resume work",
    "summarized_story": "In compliance with the directive of the association, the doctors were back at their duty posts bringing respite to patients and thei families.\nIn Kaduna, Secretary of the association, Dr Abass Ajayi, said patients were being attended to as normal activities had resumed.\nAt the Federal Neuro Psychiatry Hospital, National Ear Care Center and National Eye Centre in the state, indicated that Doctors had resumed work fully, as they were seen attending to patients.\nAlso, doctors in Kebbi have resumed work fully at the Federal Medical Centre (FMC), Birnin Kebbi.\nAt the Abubakar Tafawa Balewa Teaching Hospital (ATBUTH) chapter, no fewer than 200 resident doctors were on hand to undertake clinical services."
  },
  {
    "headline": "Buhari: Nigeria’s Debt Still at Sustainable Level",
    "summarized_story": "By Adedayo AkinwalePresidnet Muhammadu Buhari has said that Nigerians were right to be concerned about the decision of the federal government to seek additional loan to fund 2022 budget estimates, but insisted that the debt level of the federal government was still at sustainable limit.\nThe President disclosed this Thursday while presenting the 2022 budget estimates to the joint session of the National Assembly.\nHe said the new loans were meant to complete ongoing critical infrastructure projects across the country.\nDerails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "2022 Budget: FG Pegs Crude Oil Benchmark at $57",
    "summarized_story": "By Adedayo AkinwalePresident Muhammadu Buhari said that the federal government had pegged crude oil benchmark at $57 per barrel in the 2022 budget.\nHe also added that the federal government also projected 13 per cent inflation rate in the same fiscal year.\nThe President disclosed this Thursday while presenting the 2022 budget estimates to the joint session of the National Assembly.\nDetails later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Presents 2022 Budget Proposal, Seeks Speedy Passage by N’Assembly",
    "summarized_story": "Says finance minister will provide further detailsDeji Elumoye and Adedayo AkinwalePresident Muhammadu Buhari is about now presenting the 2022 Appropriation Bill to the Joint Session of the National Assembly.\nHe canvassed for an early passage of the budget proposal, the details of which he is reeling out in his budget speech.\nHe told the federal legislators that the Minister of Finance, Budget and National Planning, Zainab Ahmed, will make available further details about the 2022 budget to the legislative arm.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "2022 Budget Presentation: Lawan Reads Welcome Address",
    "summarized_story": "By Deji Elumoye and Adedayo AkinwalePresident of the Senate and Chairman of the National Assembly, Dr Ahmad Lawan, is presenting his welcome address at the Joint session of the National Assembly for the presentation of the 2022 Appropriation Bill by President Muhammadu Buhari.\nIt was preceeded by opening prayers said in both the Christian and Muslim ways by Senator Opeyemi Bamidele and Hon Aliyu Mardi respectively.\nDetails later..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Arrives N’Assembly for 2022 Budget Presentation",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has arrived the National Assembly complex at the Three Arms Zone in Abuja to present the 2022 Appropriation Bill to the legislative arm.\nThe president, who arrived the premises at about 12.05pm, was received by the Senate President and Chairman of the National Assembly, Dr Ahmad Lawan, and the Speaker of the House of Representatives, Hon Femi Gbajabiamila, at the Chambers of the House of Representatives.\nHe is expected to present the budget proposal to a joint session of the Senate and the House at the Green Chamber any moment from now.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Buhari Visited Ailing Ex-Lagos Governor, Tinubu In Corruption-tainted London Villa Acquired By Osun Governor, Oyetola",
    "summarized_story": "A Mareva injunction is a Court order which freezes the assets of a defendant pending the outcome of a litigation.\nHe and Eludoyin, in 2003, incorporated another shelf company in the British Virgin Islands, Global Investments Offshore Limited.\nHowever in June 2018, months before he became governor, he withdrew from the company and made his children – Rukayat Oyetola, Hafiz Oyetola, and Rasheedat Oyetola directors.\nHe also transferred his shares in Global Investments Offshore Limited to Mr Eludoyin and his son Haifz in June 2018.\nAlso unclear is why Tinubu, who apparently wants to become Nigeria`s president, would agree to stay at the controversial property."
  },
  {
    "headline": "How Buhari Visited Ailing Ex-Lagos Governor, Tinubu In Corruption-tainted London Villa Acquired By Osun Governor, Oyetola",
    "summarized_story": "A Mareva injunction is a Court order which freezes the assets of a defendant pending the outcome of a litigation.\nHe and Eludoyin, in 2003, incorporated another shelf company in the British Virgin Islands, Global Investments Offshore Limited.\nHowever in June 2018, months before he became governor, he withdrew from the company and made his children – Rukayat Oyetola, Hafiz Oyetola, and Rasheedat Oyetola directors.\nHe also transferred his shares in Global Investments Offshore Limited to Mr Eludoyin and his son Haifz in June 2018.\nAlso unclear is why Tinubu, who apparently wants to become Nigeria`s president, would agree to stay at the controversial property."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Senate President Lawan, His Deputy Move To Frustrate Corruption Trial Of Ex-Minister, Stella Oduah",
    "summarized_story": "A move by President of the Nigerian Senate, Dr Ahmad Lawan, his deputy, Ovie Omo-Agege, and other leaders of the All Progressives Congress (APC) to frustrate the prosecution of Stella Oduah, a senator embroiled in corruption cases, has been uncovered.\nIt was gathered that Oduah met with Lawan and Malami to frustrate her case with the EFCC.\nShe is working very hard, using Senate President and AGF to either scuttle arraignment or frustrate the trial.\nAlternatively, they are planning to water down the trial through the prosecution via the EFCC chairman.\nShe served as Minister of Aviation between 2011 and 2014, when she was fired over a massive corruption scandal."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Senate President Lawan, His Deputy Move To Frustrate Corruption Trial Of Ex-Minister, Stella Oduah",
    "summarized_story": "A move by President of the Nigerian Senate, Dr Ahmad Lawan, his deputy, Ovie Omo-Agege, and other leaders of the All Progressives Congress (APC) to frustrate the prosecution of Stella Oduah, a senator embroiled in corruption cases, has been uncovered.\nIt was gathered that Oduah met with Lawan and Malami to frustrate her case with the EFCC.\nShe is working very hard, using Senate President and AGF to either scuttle arraignment or frustrate the trial.\nAlternatively, they are planning to water down the trial through the prosecution via the EFCC chairman.\nShe served as Minister of Aviation between 2011 and 2014, when she was fired over a massive corruption scandal."
  },
  {
    "headline": "Nigeria's Police Inspector-General Brings Back Notorious Police Unit, SARS",
    "summarized_story": "The Inspector-General of Police, Alkali Baba Usman has revived a notorious unit of the Nigeria Police Force, which was disbanded last year after #EndSARS protests, the Special Anti-Robbery Squad (SARS).\nAccording to Baba Usman, SARS has been reformed and the new rules of engagement are stated below:“No SARS personnel is allowed to interface in any civil matter.\nThey also demanded that SARS, a police unit, notorious for human rights abuses, extrajudicial killings, and other atrocities should be disbanded.\nMeanwhile, the police inspector General, Baba Usman once said the disbandment of SARS had created a vacuum in policing the country.\nHe added that the morale of police officers in the country had been low since the #EndSARS protests in October 2020."
  },
  {
    "headline": "BREAKING: Buhari not in support of emergency rule in Anambra, says Obiano",
    "summarized_story": "Willie Obiano, governor of Anambra, says President Muhammadu Buhari is not in support of a declaration of emergency rule in the state.\nAdvertisementThe governor said this to state house correspondents, on Thursday, after meeting with the president at the villa in Abuja.\nMore to follow…."
  },
  {
    "headline": "BREAKING: Buhari not in support of emergency rule in Anambra, says Obiano",
    "summarized_story": "Willie Obiano, governor of Anambra, says President Muhammadu Buhari is not in support of a declaration of emergency rule in the state.\nAdvertisementThe governor said this to state house correspondents, on Thursday, after meeting with the president at the villa in Abuja.\nMore to follow…."
  },
  {
    "headline": "Ngige to doctors: You're lucky to have me as minister",
    "summarized_story": "Chris Ngige says doctors are lucky to have him as the minister of labour and employment.\nThe minister commended the new NARD leadership for suspending its nationwide strike.\nAdvertisement“The previous NARD leadership hoarded information from your members.\n“You are lucky to have me, a medical doctor and health system manager here as the Minister of Labour and Employment.\n“That was why I sent this matter to the National Industrial Court of Nigeria (NICN).”The minister assured the doctors that all the contentious issues were being addressed."
  },
  {
    "headline": "Ngige to doctors: You're lucky to have me as minister",
    "summarized_story": "Chris Ngige says doctors are lucky to have him as the minister of labour and employment.\nThe minister commended the new NARD leadership for suspending its nationwide strike.\nAdvertisement“The previous NARD leadership hoarded information from your members.\n“You are lucky to have me, a medical doctor and health system manager here as the Minister of Labour and Employment.\n“That was why I sent this matter to the National Industrial Court of Nigeria (NICN).”The minister assured the doctors that all the contentious issues were being addressed."
  },
  {
    "headline": "Pandora Papers: How Oyetola acquired London mansion linked to Kola Aluko",
    "summarized_story": "Gboyega Oyetola, governor of Osun, bought a mansion in London from a company belonging to Kola Aluko, a Nigerian businessman who is being tried for money laundering.\nAdvertisementThis was revealed in leaked files retrieved from offshore services firms around the world and released in a Pandora Papers project led by the International Consortium of Investigative Journalists (ICIJ), and which Premium Times is a part of.\nThe federal government had in 2017 sought an injunction to freeze the assets of Aluko, including the UK property located at 32, Grove End Road, London.\n“The United Kingdom, especially the greater London area, is noted for rapid increase in the value of properties.\nThus, Mr Aluko sold the property at a discount of £8,000,000.”According to Premium Times, Oyetola and one his associates had in 1999 sought the service of a Bristol, UK-based international company registration agent, Jordans Limited, to help them set up a company."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\nKemi wants to continue supporting her mother and sister, not only by clearing their bills but also helping them to be independent of her."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "Google launches $50m equity-based investment fund for African startups",
    "summarized_story": "At the first-ever Google for Africa event, held virtually on Wednesday, Google announced the launch of a 50 million-dollar Africa Investment Fund, through which it plans to invest in African startups.\nSelected companies will be provided with access to Google’s employees, network and technologies, to help them build products.\nTargeted at early- to growth-stage startups, the new investment fund is equity-based, marking a significant shift in Google’s approach to investing in African startups.\nMeanwhile, the Google Black Founders Fund will invest in black-led startups in Africa by providing cash awards and hands-on support.\nGet the best African tech newsletters in your inbox“In the last year, we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Sub-Saharan Africa, said in an official statement."
  },
  {
    "headline": "Pandora Papers: Kenya’s first family implicated in biggest-ever offshore data leak",
    "summarized_story": "Seven members of the Kenyatta family, including the president, are revealed, through the Pandora Papers, as being variously connected to more than 10 offshore companies and foundations.\nThe Kenyattas’ offshore investments include a company with stocks and bonds worth $30 million.\nLargest-ever leakThe Pandora Papers represent the latest and largest, by data volume, in a series of major leaks of financial data about the offshore world over the last five years.\nIn 2016, the Panama Papers, which consisted of 2.6 terabytes of data, leaked from the law firm, Mossack Fonseca.\nMore than 100 billionaires feature in the leaked data, as well as celebrities, rock stars, and business leaders."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "eNaira dilemma: speed or transparency, Google’s $1b investment and Chari’s $5m seed raise",
    "summarized_story": "But, here’s the thing, a private blockchain means there’s no room for transparency.\nWhat would a private blockchain entail for the eNaira?\nClick here: eNaira: How much control does a private blockchain give the CBN?\nGoogle plans to launch the Africa Investment Fund to invest $50 million in African startups.\nOur Senior Reporter, Emmanuel Paul, gives a detailed analysis on the subsea Internet cable here: With its massive subsea Internet cable, Google says it’s playing the long game in AfricaChari closes $5m seedChari Co-Founder."
  },
  {
    "headline": "With its massive subsea Internet cable, Google says it’s playing the long game in Africa",
    "summarized_story": "Share this article:At the first Google for Africa event held today, October 6, 2021, global Internet giant, Google, has announced significant initiatives for the African continent.\nHowever, its efforts at deepening Internet connectivity has had mixed results both in Africa and outside the continent.\nThough Africa already has 13 subsea cables, Google’s new cable features a more advanced (fibre switching) technology.\nSidenote: As of 2020, Nigeria only used 10% of the MainOne cable capacity, nearly ten years after installationThe big questionNitin Gajria, Managing Director, Sub-Saharan Africa, Google.\nThis was because telecom services providers could not lay fibre cables across the Congo River, the world’s deepest and fastest river."
  },
  {
    "headline": "eNaira: How much control does a private blockchain give the CBN?",
    "summarized_story": "Goodluck — $AYOBAMI 🇸🇻 (@dondekojo) September 21, 2021While we’ve explored how this currency will work, what it means, and how it differs from other digital currencies, we’re yet to examine the possibilities of a closed or private blockchain aiding “laundering on steroids”What is a private blockchain?\nThe Hyperledger Fabric, chosen to run the eNaira by the CBN, is an example of a private blockchain.\nHow private blockchains work, compared to the public onesImmediately, the difference between a private and public blockchain is clear — control and access.\nHow much power does a private blockchain give the CBNAdedayo Adebajo, Managing Director of Jelurida Africa, the blockchain company behind Ardor, an open-source blockchain network, believes that while blockchain is immutable, in the case of a private blockchain, the owners can doctor information on it.\n“If you’re running a private blockchain, there are a number of things you need to sacrifice, part of which is transparency."
  },
  {
    "headline": "NNPC reform slows as PIA fails to prescribe timeline for cessation",
    "summarized_story": "The Petroleum Industry Act (PIA) provides a legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nRead also: Investor strikes commercial oil, gas at Oza marginal fieldThe PIA provides for the incorporation of NNPC limited and the transfer of assets and liabilities of NNPC to NNPC limited.\nThe assets and liabilities not transferred will remain with NNPC until they are extinguished or transferred to the government.\nOyedele said the concern is that the inefficiencies associated with the NNPC will persist longer than is necessary without a concrete date to turn it into NNPC Ltd.\nAccording to him, if NNPC were efficiently operated like its peer, Saudi Aramco, it should be recording profits of up to $10bn yearly."
  },
  {
    "headline": "Nigeria waits as Moderna decides African country to host its $500m Covid plant",
    "summarized_story": "Moderna which is keeping the short list of five countries to its chest, also listed well educated workforce suitable for a high-tech messenger RNA factory.\nA decision on which African country will host the plant is to be taken in the coming months, says CEO Stephane Bancel.\nModerna plans to talk to those countries and make a decision where to build the African plant in the coming months, Bancel said.\nThe $500m African plant will be capable of producing half a billion messenger RNA vaccine doses a year.\nIt is unclear if Nigeria, Africa’s most populous nation which has lost out in previous deals is in contention to win the battle to host the Moderna plant."
  },
  {
    "headline": "Pandora papers: Fury, betrayal trail rich people’s gambit to hide assets",
    "summarized_story": "Rajapaksa said he had “Instructed the chairman of the Bribery Commission to initiate investigations and submit a report within a month on the recently released Pandora Papers which caused controversy around the world.\nPosts on social media under the tag Pandora Papers revealed widespread outrage over the actions of individuals in several countries who decided to hide their assets abroad to evade scrutiny and taxes.\nObi had defended his action saying the assets were jointly owned by him and his relatives.\nThe Pandora Papers is a sad commentary on how the rule of law has been bent and broken around the world by a system of financial secrecy enabled by the U.S. and other wealthy nations.\nThe Pandora Papers probe reveals that international leaders who could tackle offshore tax avoidance have themselves secretly moved money and assets beyond the reach of tax and law enforcement authorities as their citizens struggle."
  },
  {
    "headline": "PANDEF Salutes South-South Governors Over Resolutions At Port Harcourt Meeting – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Pan Niger Delta Forum, PANDEF, has commended the Governors of the South-South Geopolitical Zone over the resolutions reached at their meeting held in Port Harcourt on Monday, October 4, 2021.\nsaid, ” it is particularly delighted at the governors’ decision to establish South-South Security Architecture, like other zones in the country, to complement the nation’s security agencies in the zone.\n“The fact is that given the degenerating security situation in the country, the whole of the Niger Delta region, particularly, the South-South zone is under existential threat”.\n“It is quite pleasing that the governors re-echoed the call for the relocation of headquarters of International Oil Companies, and even NNPC subsidiaries, to the Niger Delta.\nPANDEF, further calls on the Governors to strengthen the BRACED Commission to fast track the economic integration and development of the geopolitical zone."
  },
  {
    "headline": "Edo warns against sales, purchase of fake hardcopy admission forms into College of Nursing Sciences – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has alerted residents to the activities of fraudsters selling fake hard copy admission forms into Edo State College of Nursing Sciences.\nPermanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa, said there are no physical forms for admissions into the College, noting that all forms must be obtained from the official College’s portal on https://edocons.waeup.org.\nIrowa reiterated the need for “applicants to avoid dealing with any person purportedly acting as an agent of Edo College of Nursing Sciences in respect of the sales of admission forms into the College, as anyone who elects to deal with such persons, does so at his/her own risk.”The statement reads: “The attention of the Edo State Government has been drawn to the activities of some fraudsters, who in a bid to defraud unsuspecting members of the public, have resorted to the sales of fake hard copy admission forms into Edo State College of Nursing Sciences.\n“We state unequivocally that there are no physical forms for admissions into the College.\nAll forms must be bought from the official College’s portal on https://edocons.waeup.org."
  },
  {
    "headline": "Obaseki swears-in 11 commissioners, two special advisers …assigns portfolios to commissioners – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, has sworn-in 11 commissioners and two Special Advisers as members of the Edo State Executive Council (EXCO).\nThe two Special Advisers are Crusoe Osagie, who was appointed as Special Adviser, Media Projects and Sarah Esangbedo Ajose-Adeogun, appointed as Special Adviser, Strategy, Policy, Projects and Performance Management.\nThe inaugural EXCO meeting was held after the Commissioners and Special Advisers were sworn-in.\nHe continued: “On our part, we have articulated, in the MEGA Agenda, a vision of where we want Edo State to be before 2050.\n“As Commissioners and Special Advisers, the height of people’s expectations of you and the Government you represent are unprecedented."
  },
  {
    "headline": "Obaseki swears in Joe Acha as Edo Chief Judge, urges collaboration among arms of govt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has sworn-in Hon.\nJustice Joe Acha as the new Edo State Chief Judge.\nDuring the swearing-in ceremony at the Government House in Benin City, the governor stressed the need for collaboration among the three arms of government to engender good governance.\n“I congratulate my Lord, Justice Joe Acha, on the attainment of the apex position in our Judiciary, which is a recognition of an illustrious and unblemished career both at the bar and the bench.\n“I am certain that Your Lordship will live up to the highest ideals of your illustrious predecessors at the helm of the judicial arm of government in our state."
  },
  {
    "headline": "Court jails Maina’s son, Faisal, 14 years for fraud",
    "summarized_story": "The Federal High Court in Abuja, on Thursday, sentenced Faisal, a son of former chairperson of the defunct Pension Reform Taskforce Team, Abdulrasheed Maina, to 14 years’ imprisonment.\nThe trial judge, Okon Abang, jailed Faisal after finding him guilty on all the three counts of money laundering involving N58.1million in public funds.\nFaisal, whose father is also facing separate set of money laundering charges involving N2billon before the same judge, jumped bail and stopped attending court since last year.\nFaisal was absent from court when the judge read the judgement convicting him on all the three counts and sentencing him on Thursday.\nMr Maina has since remained in prison with his trial continuing in court."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Anambra State of Emergency Threat: Obiano meets Buhari in Abuja",
    "summarized_story": "OBINNA EZUGWUFollowing the federal government’s threat to declare a state of emergency in Anambra ahead of the governorship election billed for November 6, if attacks by unknown gunmen don’t end, the state governor, Chief Willie Obiano, on Thursday, met with President Muhammadu Buhari at the State House, Abuja over the threat.\nThe threat has been generating condemnations by many who say it is out of place and needless overreaction to the the security challenge in the state.\n“Nigerians are outraged by the threat by the Attorney-General of the Federation and Minister of Justice, Abubakar Malami,” he said.\n“Since the renewed violence in Anambra State which we believe is politically motivated, not more than 15 persons have been killed.\n“For the past seven years, Anambra has remained the safest state, most stable in Nigeria."
  },
  {
    "headline": "Maina’s son sentenced to 14 years in prison for money laundering",
    "summarized_story": "Son of Abdulrasheed Maina, former chairman of the defunct Pension Reform Taskforce Team, Faisal Maina, has been sentenced to prison by a federal high court in Abuja for money laundering.\nJustice Okon Abang handed down the sentence on Thursday.\nHe found Faisal guilty on a three-count money laundering charge preferred against him by the Economic and Financial Crimes Commission (EFCC)."
  },
  {
    "headline": "FG removes import duty on ships, its spare parts",
    "summarized_story": "Nigeria’s Federal Government has removed import duty on importation of ships and its spare parts as an incentive to encourage indigenous shipping.\nThe Director General, Nigerian Maritime Administration and Safety, Dr. Bashir Jamoh, disclosed this at the Nigeria International Maritime Summit, thenigerianmaritimenews reported.\nShe said, “How can we have Nigerians that own vessels but choose to use the shipping registries of other nations?\nAlso speaking at the event, a former Chief Executive Officer of the South African Maritime Safety Authority, Commander Tsietsi Mokhele, cited examples from South Africa and other maritime nations while advising Nigeria.\n“African nations should start by exploring their most advantageous areas in the maritime sector before addressing other areas of high value for their economies.”"
  },
  {
    "headline": "WHO recommends groundbreaking malaria vaccine for children at risk",
    "summarized_story": "The long-awaited malaria vaccine for children is a breakthrough for science, child health and malaria control,” said WHO Director-General Dr Tedros Adhanom Ghebreyesus.\n“We have long hoped for an effective malaria vaccine and now for the first time ever, we have such a vaccine recommended for widespread use.\nRTS,S/AS01 malaria vaccine should be provided in a schedule of 4 doses in children from 5 months of age for the reduction of malaria disease and burden.\nLayering the tools results in over 90% of children benefitting from at least one preventive intervention (insecticide treated bednets or the malaria vaccine).\nNext steps for the WHO-recommended malaria vaccine will include funding decisions from the global health community for broader rollout, and country decision-making on whether to adopt the vaccine as part of national malaria control strategies."
  },
  {
    "headline": "Southeast Governors, Leaders Vow To End Sit-at-home Order, Killings",
    "summarized_story": "The leaders have resolved to end killings and the Sit-At-Home order rife in the region which has claimed many lives.\nPresent at the meeting were Ebonyi State governor, David Umahi, Enugu State governor, Ifeanyi Ugwuanyi, Imo State governor, Hope Uzodinmma, former Enugu State governor, Okwesilieze Nwodo, former governor of Abia State, Theodore Orji, former deputy Senate President, Ike Ekweremadu, among others.\nApart from the killings, another ugly development that has dealt a big blow to the economy of the Southeast is the Sit-At-Home order by (IPOB).\nDuring the meeting, the governors and leaders of the Southeast geo-political Zone condemned the every Monday routine Sit-At-Home Order, by the Indigenous People of Biafra and the ongoing killings in the zone.\nHe commended the Southeast leaders for agreeing to end killings in the zone, as well as the Sit-At-Home order, and suggested engagement of the youths as the way out."
  },
  {
    "headline": "Southeast Governors, Leaders Vow To End Sit-at-home Order, Killings",
    "summarized_story": "The leaders have resolved to end killings and the Sit-At-Home order rife in the region which has claimed many lives.\nPresent at the meeting were Ebonyi State governor, David Umahi, Enugu State governor, Ifeanyi Ugwuanyi, Imo State governor, Hope Uzodinmma, former Enugu State governor, Okwesilieze Nwodo, former governor of Abia State, Theodore Orji, former deputy Senate President, Ike Ekweremadu, among others.\nApart from the killings, another ugly development that has dealt a big blow to the economy of the Southeast is the Sit-At-Home order by (IPOB).\nDuring the meeting, the governors and leaders of the Southeast geo-political Zone condemned the every Monday routine Sit-At-Home Order, by the Indigenous People of Biafra and the ongoing killings in the zone.\nHe commended the Southeast leaders for agreeing to end killings in the zone, as well as the Sit-At-Home order, and suggested engagement of the youths as the way out."
  },
  {
    "headline": "Julius Berger Wins FRSC Safety Award",
    "summarized_story": "Nigeria’s leading engineering construction company, Julius Berger Nigeria PLC has received Federal Road Safety Commission, FRSC Award of recognition for Best Practices in the implementation of Nigeria’s Road Transport Safety Standard Scheme.\nAccording to the FRSC, Julius Berger won the award for the company’s compliance with the best expectations in applying the stipulated guidelines as stated by the Corps Transport Standardisation Office.\nThe Corps ensured that all the drivers were certified with a view to developing their driving competency towards better service delivery…which will no doubt lead to improved productivity,” the FRSC said.\nThe Corps Transport Standardisation Officer, Corps Commander Abiodun Akinlade, presented the award to Julius Berger Nigeria Plc in Abuja on behalf of the Corps Marshal of the FRSCReacting to the Award, the Head, Media Relations Office of JBN Plc, Prince Moses Duku thanked the FRSC for the significant and encouraging award.\nDuku said, “Over the years, Julius Berger has seriously committed tremendous amount of resources into improving the professional competence and safety orientation of its hundreds of drivers, and operational teams in general.”"
  },
  {
    "headline": "Julius Berger Wins FRSC Safety Award",
    "summarized_story": "Nigeria’s leading engineering construction company, Julius Berger Nigeria PLC has received Federal Road Safety Commission, FRSC Award of recognition for Best Practices in the implementation of Nigeria’s Road Transport Safety Standard Scheme.\nAccording to the FRSC, Julius Berger won the award for the company’s compliance with the best expectations in applying the stipulated guidelines as stated by the Corps Transport Standardisation Office.\nThe Corps ensured that all the drivers were certified with a view to developing their driving competency towards better service delivery…which will no doubt lead to improved productivity,” the FRSC said.\nThe Corps Transport Standardisation Officer, Corps Commander Abiodun Akinlade, presented the award to Julius Berger Nigeria Plc in Abuja on behalf of the Corps Marshal of the FRSCReacting to the Award, the Head, Media Relations Office of JBN Plc, Prince Moses Duku thanked the FRSC for the significant and encouraging award.\nDuku said, “Over the years, Julius Berger has seriously committed tremendous amount of resources into improving the professional competence and safety orientation of its hundreds of drivers, and operational teams in general.”"
  },
  {
    "headline": "Court Adjourns Abuja Waste Disposal Suit To December 1",
    "summarized_story": "The constitutionality or otherwise of who should undertake waste disposal within the Abuja Municipal Area Council (AMAC) will be heard on December 1, 2021, by the Federal High Court, Abuja.\nThe case has been the subject of legal debate as the applicants and defendants seek juristic interpretation at the Federal High Court sitting in Abuja in Suit No: FHC/ABJ/CS/1585/2020.\nCFRPA accused AMAC of connivance with the Federal Capital Territory Administration (FCTA) by relinquishing its constitutional responsibility of undertaking waste disposal in the nation’s capital to the FCTA.\nConsequently, the court adjourned the suit to December 1, 2021.\nThe plaintiffs had also sought an order of court restraining the BPP from further participating in the said exercise."
  },
  {
    "headline": "At UBA, Customer Satisfaction Remains our Number one Priority – Uzoka",
    "summarized_story": "The Group Managing Director/Chief Executive Officer, United Bank for Africa (UBA) Plc, Kennedy Uzoka, has said that the main priority for every staff in the bank is to always ensure customer satisfaction.\nThis, he said, is crucial for every forward-thinking organisation such as UBA, as the customer remains the undisputed employer.\nThe Customer Service Week, which is celebrated annually all over the world, recognises the importance of customer service and seeks to show appreciation to the staff who serve and support customers with the highest degree of care and professionalism.\n“As we celebrate this year’s Customer Service Week, I would like to urge you to be consistent in ensuring that the customer is satisfied at every point.\nLet us continue to deliver the best banking experience to our customers in line with the ideals of Customer-First Philosophy,” Uzoka stated."
  },
  {
    "headline": "At UBA, Customer Satisfaction Remains our Number one Priority – Uzoka",
    "summarized_story": "The Group Managing Director/Chief Executive Officer, United Bank for Africa (UBA) Plc, Kennedy Uzoka, has said that the main priority for every staff in the bank is to always ensure customer satisfaction.\nThis, he said, is crucial for every forward-thinking organisation such as UBA, as the customer remains the undisputed employer.\nThe Customer Service Week, which is celebrated annually all over the world, recognises the importance of customer service and seeks to show appreciation to the staff who serve and support customers with the highest degree of care and professionalism.\n“As we celebrate this year’s Customer Service Week, I would like to urge you to be consistent in ensuring that the customer is satisfied at every point.\nLet us continue to deliver the best banking experience to our customers in line with the ideals of Customer-First Philosophy,” Uzoka stated."
  },
  {
    "headline": "GOCOP set for annual 2021 conference, unveils virtual link",
    "summarized_story": "All is now set for the 2021 main conference of the Guild of Corporate Online Publishers (GOCOP) slated for Thursday at Sheraton Hotels Ikeja, Lagos.\nAs a hybrid conference, GOCOP has also unveiled its virtual links [https://us02web.zoom.us/j/82805142999?pwd=R2psenJCeEd0UXdxQTFQcUFIeUJ5Zz09] to enable its members in diaspora and the public to join.\nThe newly elected Publicity Secretary, Mr. Remmy Nweke disclosed these in a press statement made available late Wednesday, October 6.\nNweke affirmed that the Governor of Lagos State, Mr. Babajide Sanwo-Olu and Chairman, Presidential Task Force on COVID-19, Mr. Boss Mustapha have confirmed participations.\nIn addition, he said, Mr. Mustapha would give a keynote address at the occasion."
  },
  {
    "headline": "GOCOP set for annual 2021 conference, unveils virtual link",
    "summarized_story": "All is now set for the 2021 main conference of the Guild of Corporate Online Publishers (GOCOP) slated for Thursday at Sheraton Hotels Ikeja, Lagos.\nAs a hybrid conference, GOCOP has also unveiled its virtual links [https://us02web.zoom.us/j/82805142999?pwd=R2psenJCeEd0UXdxQTFQcUFIeUJ5Zz09] to enable its members in diaspora and the public to join.\nThe newly elected Publicity Secretary, Mr. Remmy Nweke disclosed these in a press statement made available late Wednesday, October 6.\nNweke affirmed that the Governor of Lagos State, Mr. Babajide Sanwo-Olu and Chairman, Presidential Task Force on COVID-19, Mr. Boss Mustapha have confirmed participations.\nIn addition, he said, Mr. Mustapha would give a keynote address at the occasion."
  },
  {
    "headline": "JUST IN: Tight Security As National Assembly Awaits Buhari For 2022 Budget Presentation",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), is scheduled to lay the 2022 Appropriation Bill before a joint session of the National Assembly at 12noon.\nThere is a high presence of security officers in and around the National Assembly Complex in Abuja.\nOnly accredited members of staff, especially those in critical departments, and journalists are allowed in.\nEven with the accreditation, journalists without a special tag for the event are not allowed into the venue."
  },
  {
    "headline": "Bandits Defy Security Measures, Kill Many, Loot, Raze Houses In Katsina",
    "summarized_story": "On Tuesday, bandits overran the Yasore community in Batsari Local Council, Katsina State, in an operation that lasted several hours.\nThe notorious gunmen who defiled the ongoing security measures in the State, came riding on motorcycles as usual.\nIn the course of the attack on the community, the spokesman of the State Police Command, SP.\nThe attack was a reprisal by herdsmen whose members were killed by Yan Sakai recently.\n“Yan Sakai remains banned, and anyone caught parading himself as one would be treated like a bandit,” SP."
  },
  {
    "headline": "Strike: Buhari Regime Offers Resident Doctors N47 billion Hazard Allowance",
    "summarized_story": "Mr Ngige, who commended the new NARD leadership led by Godiya Ishaya for asking its members to return to work, disclosed that the federal government had increased the aggregate money in the 2022 budget for hazard allowance from N40 billion to N47 billion annually.\nHe explained that the latest strike would not have degenerated to the point it got to if the former NARD leadership had given their members the correct information.\nThe minister added that the government was not indebted to any doctor until August 2, when NARD embarked on the strike.\n“The previous NARD leadership hoarded information from your members.\nIt doesn’t mean that if we are doing something right, we should not be praised,” said the labour minister."
  },
  {
    "headline": "Buhari Regime Launches Military Exercise Against IPOB, ESN",
    "summarized_story": "The military exercise “Exercise Golden Dawn” has been initiated by the Muhammadu Buhari dictatorship against the Indigenous People of Biafra (IPOB) and the Eastern Security Network (ESN).\nThe Commander, 34 Artillery Brigade, Obinze, Raymond Utsaha, said the three months exercise was to “build on the gains so far recorded over the menace of the proscribed Indigenous People of Biafra (IPOB) and its Eastern Security Network (ESN)”.\nDuring the flag off on Wednesday, the state governor Hope Uzodinma said the exercise would help stem the tide of insecurity during the Christmas celebration.\n“This is a special period and season in the lives of the people of the South-East who are predominantly Christians coming back for the celebration of Christmas which usually lasts from October to December.\n“This exercise will go a long way in improving the security situation in our geo-political zone, giving our people a sense of security and encouraging our brothers and sisters who are resident abroad to come home without fear,” the governor said."
  },
  {
    "headline": "Breaking: Ex-pension boss Abdulrasheed Maina’s son sent to jail over money laundering",
    "summarized_story": "Faisal, son of the Chairman, defunct Pension Reformed Task Team (PRTT), Abdulrasheed Maina, has been sent to 24 years imprisonment by a federal High Court in AbujaJustice Okon Abang, in his judgment, held that Faisal, who was sentenced in absentia, was guilty of all the three-count charge.\nJustice Okon, who handed down a five-year-jail term for count one bordering on money laundering offence, sentenced Faisal to 14 years imprisonment on count two.\nThe judge, thereafter, sentenced the son of the ex-pension reformed boss to five years prison term on count three which bordered on asset declaration offence.\nOkon, however, ruled that the prison terms would run concurrently.\nOn July 16, Justice Abang had fixed the matter for judgment after the then Economic and Financial Cimes Commission (EFCC)’s Lawyer, Mohammed Abubakar, adopted the commission”s final written address and urged the court to convict Faisal in all the three counts levelled against him."
  },
  {
    "headline": "APGA rejects threat of emergency rule in Anambra",
    "summarized_story": "The All Progressives Grand Alliance (APGA) has called on the federal government of Nigeria not to toy with the idea of declaring emergency rule in Anambra state.\nIn a press statement in Abuja Wednesday and signed by the National Publicity Secretary of the party, Tex Okechukwu, APGA described the threat as uncalled for since Anambra has ranked for over 7 years now as the most peaceful state in Nigeria.\nIt questioned the rationale behind the idea of planning to declare a state of emergency in Anambra state with less than one month to the governorship election when it was yet to do the same in worse states such as Borno, Yobe, Kaduna, Niger, and Nasarawa.\nAPGA called on all well-meaning people in Anambra state to rise up and condemn the plan as it would truncate all the landmarks recorded by the present APGA-led government in the state.\n“We reason that some persons are afraid to face the electorate in Anambra State and are devising a face-saving method to trample upon the will of the people,” the party stated."
  },
  {
    "headline": "Revealed! How Horse-riding bandits killed 18 in Zamfara, 10 massacred in Katsina",
    "summarized_story": "No fewer than 18 people including women and children have been killed by a group of suspected bandits in a fresh attack at Kurya Madaro town of Kaura Namoda local government area of Zamfara state.\n“We have buried 18 of our people who were gruesomely killed by the bandits last night, in line with Islamic tenets today,” the source added.\nKatsinaAnd in yet another attack, bandits Tuesday morning killed 10 people and injured several others, burning shops and houses in Yasore community of Katsina state.\nYasore is less than two kilometres from Batsari, the headquarter of the local government area by the same name.\nIt shares boundaries with Rugu forest, Jibia local government area in Katsina and Zurmi in Zamfara state."
  },
  {
    "headline": "President Buhari Presents N16.39trn Budget For 2022",
    "summarized_story": "President Muhammadu Buhari on Thursday presented a total budget of N16.39 trillion for the year 2022 to the National Assembly.\nThe 2022 Budget will be the last full year budget to be implemented by this administration.\nThe 2022 budget is also the first in our history, where MDAs were clearly advised on gender responsive budgeting.\nTotal federally distributable revenue is estimated at 12.72 trillion Naira in 2022 while total revenue available to fund the 2022 Federal Budget is estimated at 10.13 trillion Naira.\nWe plan to finance the deficit mainly by new borrowings totalling 5.01 trillion Naira, 90.73 billion Naira from Privatization Proceeds and 1.16 trillion Naira drawdowns on loans secured for specific development projects."
  },
  {
    "headline": "Court Sentences Maina’s Son Faisal To 14 Years Imprisonment",
    "summarized_story": "Faisal Maina, son of the former chairman of the now-defunct Pension Reformed Task Team, Abdulrasheed Maina has been sentenced to 14 years imprisonment.\nFor Count 1, Justice Abang ordered that he be jailed for five years.\nThe court also ordered that Faisal returns to the Federal Government, the sum of N58.1m and the company used, to wind up.\nREAD ALSO: Maina To Remain In Custody As Court Rejects Fresh Bail ApplicationFor count three, he was jailed for five years.\n“We have a bench warrant of the court for the arrest of the defendant and his apprehension before the court."
  },
  {
    "headline": "Nigeria’s GDP To Grow By 2.4 Percent In 2021, Says World Bank",
    "summarized_story": "The World Bank expects the Nigerian economy to grow by 2.4 percent in 2021.\nIn June, the World Bank had set the GDP growth rate at 1.8 percent.\nThe higher growth rate published this month is expected to be supportedby the service sector.\n“Nigeria’s economic growth shows little sign of speedy recovery from the 2020 recession,” the World Bank said.\n“The main driver of the recovery is the non-oil sector, with a growth rate of 6.7 percent compared with 0.8 percent in the first quarter.”"
  },
  {
    "headline": "Moderna To Set Up $500m Vaccine Plant In Africa",
    "summarized_story": "READ ALSO: NAFDAC Approves Moderna And Sputnik Vaccines For UseModerna’s announcement is a victory for voices like the Director-General of the World Trade Organisation, Ngozi Okonjo-Iweala, who have called for vaccine manufacturers to ramp up investment in Africa.\n“Since Moderna’s founding in 2010, our mission has been to make a transformative impact on human lives through our medicines.\nAfter a decade of pioneering the development of our mRNA platform, we have been humbled to play a critical role in combatting the COVID-19 pandemic globally with our mRNA vaccine.\n“On behalf of our growing team, partners and shareholders, we are determined to extend Moderna’s societal impact through the investment in a state-of-the-art mRNA manufacturing facility in Africa.\n“We expect to manufacture our COVID-19 vaccine as well as additional products within our mRNA vaccine portfolio at this facility.”"
  },
  {
    "headline": "PIA Will Boost Nigeria’s Oil Production To 4m Barrels Per Day – Petroleum Minister",
    "summarized_story": "Minister of State for Petroleum Resources Timipre Sylva, has said that the passage of the Petroleum Industry Bill into law will significantly boost Nigeria’s potential to achieve its oil production to four million barrels per day.\nIn addition, he said the passage of the PIA will also boost the nation’s oil reserves from 37 billion barrels to 40 billion barrels.\n“The PIA 2021 will undoubtedly assist in harnessing Nigeria’s potential to achieve its oil production to four million barrels per day and oil reserves from 37 billion barrels to 40 billion barrels while also drawing on the country’s estimated 600 cubic ft of natural gas to provide clean and efficient energy,” Mr Sylva said on Thursday at the SEPLAT Energy Summit which held in Abuja with the theme, ‘Global Trends In Energy Transition.’According to the minister, the new law has “enhanced the Nigerian Petroleum Industry’s reputation, provided the pathway to new investments and consolidates our ability to play a significant role in meeting the world’s growing demand for energy”.\nPresident Buhari signed the bill into law on August 16.\nIt replaces the Petroleum Act of 1969."
  },
  {
    "headline": "Fire fighters, responders battling to put out Federal Secretariat, Abuja fire",
    "summarized_story": "A fire at the Federal Secretariat in Abuja has affected a portion of the buildings.\nThe fire at the car park burnt one car, according to a preliminary finding by the Federal Fire Service.\nThese are pictures taken minutes after a fire outbreak was reported at The federal secretariat in AbujaFire fighters are battling to put out the blaze.\nWe do not have any more information beyond these images which we have just received.\nFiretrucks and first responders are at the scene battling the flames and trying to contain it."
  },
  {
    "headline": "Niger State Government announces new Emir of Kontagora",
    "summarized_story": "Niger state government announces Mohammed Barau as the 7th Emir of kontogora.\nThis is coming on the hills of an earlier disputed selection done on the 19th of September after the demise of the late emir.\nThe honourable commissioner for local government and chieftaincy affairs Emmanuel Umar disclosed while speaking to press men at the government house in Minna."
  },
  {
    "headline": "Former President Jonathan meets President Buhari",
    "summarized_story": "President Muhammadu Buhari on Wednesday received his predecessor in office, Dr. Goodluck Jonathan, at the presidential Villa, Abuja.\nThe former president came into the premises at about 4pm.\nThe reason for his visit was not immediately disclosed as he did not speak to the media afterwards, but it would not be unconnected with Dr. Jonathan’s active role as ECOWAS special envoy to Mali"
  },
  {
    "headline": "Bandits Kill 18 In Zamfara Community, steal food items",
    "summarized_story": "Suspected Bandits have killed eighteen person’s in Zamfara community and Unspecified number of locals sustained gunshots woundsThe gunmen in their large number with sophisticated weapons invaded Kuryar Madaro community that’s in Kaura Namoda Local government area of the stateThey stormed the community Tuesday’s night and started shooting sporadically and the locals fled for safetySources told TVC NEWS that a police Patrol Vehicle, Houses, food banks and shops were set Ablaze and large quantity of food stuff were carted away by the gunmenKuryar Madaro Community is along the troubled Kaura Namoda – Shinkafi RoadEfforts to speak to police in the state yielded no results as the phone number of the spokesperson of the command Shehu Mohammed is not connecting as at the time of filing this reportThe attack on Kuryar Madaro Community is the first attack since Communication network was restored in Gusau after one month of shutdown to allow security operatives carryout operation in all bandit enclaves across the state."
  },
  {
    "headline": "World Bank Raises Nigeria’s Growth Projection to 2.4%",
    "summarized_story": "The World Bank Group has raised its 2021 Gross Domestic Product (GDP) projection for Nigeria to 2.4 per cent, higher than the 1.\nThe multilateral institution also declared that Sub-Saharan Africa was set to emerge from the 2020 recession sparked by the COVID-19 pandemic with growth expected to expand by 3.3 per cent in 2021.\nThe Chief Economist for Africa at the World Bank, Albert Zeufack explained: “Fair and broad access to effective and safe COVID 19 vaccines is key to saving lives and strengthening Africa’s economic recovery.\n“Apart from mounting fiscal pressures and rising debt levels as they implement measures for a sustainable and inclusive economic recovery, Sub-Saharan African countries are also faced with worsening impacts of climate change,” the World Bank report said.\nIt pointed out that private firms and governments in Africa were providing training for jobs in solar energy (Togo and South Africa)."
  },
  {
    "headline": "VAT: Nigeria Government May Challenge States Directly at Supreme Court, Says AGF Malami",
    "summarized_story": "Nigeria’s federal government may approach the Supreme Court to determine if the states have any constitutional right to collect the controversial Value Added Tax (VAT).\n“And some other governors have filed in an application for joinder, seeking to be joined in the matter as interested parties.\n“But the federal government is still looking at other possibilities, all options open in terms of challenging the action, the action of the state government.\n“So, the issue is whether that freedom of movement is constitutionally guaranteed, or is not.\nAnd my answer to it is, the freedom of movement is indeed, constitutionally guaranteed.”Deji Elumoye in Abuja"
  },
  {
    "headline": "Brazilian Footballer William Ribeiro Charged with Attempted Murder after Kicking Referee in the Head",
    "summarized_story": "Brazilian footballer is facing a charge of attempted murder after kicking a referee in the head and knocking him unconscious.\nRibeiro was arrested after attacking referee Rodrigo Crivellaro in the head during a match on Monday in Venancio Aires, in Brazil´s southern Rio Grande do Sul state.\nThe match between Sport Club Sao Paulo and Guarani-RS was in the Rio Grande do Sul state’s second tier.\nRibeiro, who was playing for Sport Club Sao Paulo, attacked Crivellaro at the beginning of the second half.\nHe punched me in the face, I fell to the ground, got kicked, and passed out,” Crivellaro told a local radio station."
  },
  {
    "headline": "Infantino Ecstatic Over Meetings with Buhari and First Lady, Praises Pinnick",
    "summarized_story": "President of world football –governing body FIFA, Gianni Infantino, has recalled beautiful memories of his visit to Nigeria last month where he met with President Muhammadu Buhari, the First Lady, Dr (Mrs) Aisha Buhari and a clutch of dignitaries in Nigeria’s political and football space.\n“On behalf of the entire FIFA delegation, we would like to thank you for affording us such a cordial welcome and warm hospitality on the occasion of our recent visit to Nigeria, last 15 and 16 September.\n“During this two-day visit, we have shared many important moments.\nCertainly, among the highlights were the audiences with H.E.\nMr Muhammadu Buhari, President of the Federal Republic of Nigeria, as well as with the First Lady H. E. Mrs Aisha Buhari, in Abuja, the opening match of the 2021 Aisha Buhari Cup, which we attended together, and the wonderful dinner organized in Lagos."
  },
  {
    "headline": "Nigeria to Raise $219m from Selling State Power Assets in 2022",
    "summarized_story": "Nigeria is planning to raise 90 billion naira ($219 million) next year from selling mostly government-owned power assets to help fund spending in 2022.\nThe National Integrated Power Projects (NIPPs) which is the government vehicle that owns several power generation plants in Nigeria, would be up for sale soon.\nHowever, the power assets that would be up for sale are yet to be disclosed by the government.\nThe government of President Muhammadu Buhari plans to borrow nearly $6 billion in external financing to help fund spending in 2021 and to partly finance an expected 6 trillion naira deficit.\nShe added, “Nigeria’s borrowing has been of great concern and has elicited a lot of discussions, but if you look at the total size of the borrowing, it is still within healthy and sustainable limits”."
  }
]