[
  {
    "headline": "INEC in dilemma over prosecution of 1.1million multiple registrants",
    "summarized_story": "The Independent National Electoral Commission says it has not ruled out the possibility of prosecuting the 1,126,359 persons involved in multiple registrations in the ongoing Continuous Voter Registration.\nOkoye, however, noted that prosecuting over one million multiple registrants was no “tea party” and that some of the people did it out of ignorance.\nHe stated, “The commission has not ruled out the prosecution of multiple registrants.\nThe commission will complete the registration before taking a position on the issue of multiple registrants.\nThereafter, the supplementary voter register will be integrated with the main register and published."
  },
  {
    "headline": "National Assembly’s lamentation over insecurity mere 2023 campaign –PANDEF",
    "summarized_story": "The Pan Niger Delta Forum has stated that the lamentation of the National Assembly over the spate of killings and insecurity in the country is a mere campaign strategy to endear Nigerians to them towards the 2023 elections.\nHe blamed the National Assembly for contributing to the failure of Nigeria’s security systems by its lack of critical evaluation of the situation.\n“We will conclude that what they (Assemblymen) are doing now is political campaign.\nYears ago, they were a rubberstamp National Assembly.\nSo the National Assembly share a major part of the blame for the collapse in Nation’s security architecture."
  },
  {
    "headline": "APC, PDP clash over Matawalle’s purchase of 260 vehicles for monarchs",
    "summarized_story": "The cars; Cadillac 2019 model, were for 17 emirs, 13 senior district heads and 230 district heads across the state.\nAhmed said, “The governor needs to be more serious in tackling insecurity in the state instead of wasting the scarce resources on white-elephant projects.\nThe insecurity challenges affecting the state should matter most at this moment.\nHe should squarely focus on the security challenges facing the state and stop deceiving people with bad policies.\nHe has been telling the world that he has succeeded in tackling insecurity in the state."
  },
  {
    "headline": "2023: Delta South leaders meet, restate support for Oborevwori",
    "summarized_story": "…say he’s the most popular, acceptable aspirant…pay Okowa Easter visitBy Festus Ahon, ASABADelta South Peoples Democratic Party, PDP Leaders and Stakeholders Forum in Delta South have reiterated their support for the governorship aspiration of Rt.\nHon Sheriff Oborevwori in the 2023 gubernatorial election.\nAnd you know, Delta South has remained the strongest hold of the PDP over the years.\nAnd to further strengthen PDP in Delta South, we will be holding a rally very soon.\nHon Sheriff Oborevwori as he is the most popular and acceptable aspirant among others”."
  },
  {
    "headline": "Easter: Time to heal Nigeria — Senator Kwari",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Senator representing Kaduna North Senatorial District of Kaduna State, Suleiman Abdu Kwari has called on Christians in his constituency and the nation, in general, to see the Easter celebration as a period to seek healing of the nation, through fervent prayers.\nIn a statement from his office, the lawmaker explained that Nigeria is at crossroads, facing various challenges notably insecurity, adding that “the power of prayers is limitless”He also encouraged Nigerians not to give up hope for a better tomorrow, adding that once stakeholders rise up in prayers and take safety measures, the nation will eventually find the current challenge a passing phase.\nSenator Kwari also used the Easter period to solicit prayers for President Muhammadu Buhari and Governor Nasir El-rufai of Kaduna State for their commitment to ending the insurgency, banditry, and Kidnapping.\nWhile wishing for a happy Easter celebration, the Senator urged Christians to consider the Easter period as a time to draw lessons from the exemplary life of Jesus Christ."
  },
  {
    "headline": "Why building islamic centre is essential to muslim community – Pantami",
    "summarized_story": "The Minister of Communications and Digital Economy, Prof. Isa Pantami, has underscored the significance of mosque as a centre for the integration and advance of Islam and Muslim community in the country.\nPantami made the assertion at the Public Presentation of Progress Report and Milestones on Al-Noor Mosque Expansion Project, held at the International Centre for Islamic Culture and Education (ICICE), on Saturday in Abuja.\nSimilarly, the first University and first Degree Awarding institution in the world was the University of al-Qarawiyyin in Morocco.\n“It was followed by the University of Al Azhar in Cairo, Egypt, both of them originated from a mosque.\n“The series of activities at the centre includes praying five times daily, conducting marriage activities, taking care of orphans, widows and vulnerable groups."
  },
  {
    "headline": "[ICYMI] Catholic Church allows separation on account of violence — Archbishop Adewale",
    "summarized_story": "By Sam EyobokaTHE Catholic Archbishop of Lagos, Dr Alfred Adewale has reacted to the matrimonial imbroglio that led death of the Gospel artiste in Abuja, saying that “No clerics should ever support or encourage any woman or even a man to continue to stay in an abusive relationship or marriage.\nIt will be tantamount to connivance for any clergyman to support domestic violence.\n“Though the bible admonishes the woman to be submissive to her husband (Ephesians 5:22-33), it’s not a license for the man to become a terror.”Speaking through his Director of Social of Communications, Rev Fatjer Anthony Godonu, the Archbishop emphasized that:“I believe strongly that any woman who feels her life is truly and sincerely threatened by her spouse should get out of such marriage immediately.\nThe Catholic Church in such instance grants express separation until otherwise.”"
  },
  {
    "headline": "2023: Enugu Diaspora group endorses Ekweremadu",
    "summarized_story": "Ekweremadu…President Emeritus disassociates self from letterA group of Enugu State-born United States of America- based professionals, the Enugu State Independent Professional Group in Diaspora (ESIPGID), has endorsed former Deputy President of the Senate, Senator Ike Ekweremadu, as the most sustainable and prepared aspirant to take over from the incumbent governor, Hon.\nThe group made the endorsement in a statement entitled “Our Stand on Zoning” signed by the Chairman, Prof. William Onyebeke, and several others.\nIn taking stocks of critical sectors since 1999, ESIPGID said Enugu was worse off, although power had rotated to the three senatorial districts of the state.\nWithout sentiment or favor, the Distinguished Senator, Professor Ike Ekweremadu comfortably checks off favorably on all points and criteria, at this time.\nHe should run, he should win and he should ascend to the seat of the next Executive Governor of Enugu state in 2023."
  },
  {
    "headline": "Herdsmen attack 77-year-old farmer in Ondo",
    "summarized_story": "A 77-year-old farmer, Benjamin Babatunde was over the weekend attacked and macheted by suspected herdsmen in Ikakumo Akoko, Akoko North East Local Government Area of Ondo State.\nBut the farmer said he had no money on the farm.\nA middle-aged farmer was also macheted in Ikakumo when they plucked his cashew nuts a few weeks ago.\nThe incident was said to have been reported to the police in Ikare Akoko.\nBoth Area Commander, ACP Muri Agboola, and the Divisional Police Officer, DPO, Ikare- Akoko confirmed the case, disclosing that investigation had commenced to unravel and arrest the culprits."
  },
  {
    "headline": "MNJTF bomb ISWAP leaders, camps",
    "summarized_story": "The Multinational Joint Task Force (MNJTF) has bombarded ISWAP commanders’ enclaves and training camps near Lake Chad.\nThe aerial assault was led by the Nigerien Air Task Force at the Tumbun Rego axis in Borno State.\nThe April 14 airstrikes eliminated ISWAP leaders including Ibn Usman, Hani Abdullahi, Abakar Shuwa, Abu Jibrillah and Abu Ali.\n“A mix of Nigerian Air Force and Nigerien Air Force aircraft attacked adjoining locations that served as havens of the fighters.\nThe military says many terrorist locations in Sambisa Forest have been captured while an onslaught is ongoing in the Tumbuns."
  },
  {
    "headline": "Ile-Ife violence: Osun govt appeals for calm, orders immediate investigation",
    "summarized_story": "The Osun State Government has ordered an immediate investigation into the remote and immediate causes of the violent face-off between the personnel of the Nigerian Police and youths of Okoro, Ile-Ife.\nIn a statement signed by Funke Egbemode, the state’s Commissioner for Information and Civic Orientation, the state government announced that it was aware of the violence.\n“We implore our citizens to embrace peace and shun violence, in the spirit of this solemn season,” the statement concluded.\nIt was earlier reported that the Osun State Police Command has arrested three suspected ritualists with a human heart in Osogbo/OAU Ife Campus Road, Osun State.\nThe trio, according to the statement, were arrested in Safejo area of Ile-Ife."
  },
  {
    "headline": "We’ll bring APC chieftains who allegedly stole N15bn in Oyo to book – Makinde",
    "summarized_story": "Governor Seyi Makinde of Oyo State has declared that his government is after some chieftains of the All Progressives Congress (APC) who allegedly stole about N15 billion from the state treasury.\nMakinde has however alleged that some chieftains of APC in the state have cornered some money belonging to the state.\nHe alleged that the APC members used a certain company to siphon between N12 and N15 billion of Oyo State’s money.\n“The money is in excess of N12 billion to N15 billion.\nThose who stole it are not Chinese but from Oyo State."
  },
  {
    "headline": "Ogun: Agro Cargo Airport will serve agro-processing companies, others – Abiodun",
    "summarized_story": "He noted that the airport would also provide facilities for cargo processing, storage, warehouses, training centre, among others.\nThe agro serving part is the most interesting, it is going to be a conglomeration of agro-processing companies that take raw materials, turn them into finished goods.\nWe will also have an aggregation centres, storage facilities for agro produce so that the agro-processing centres will not run out of raw materials.\n“This is a truly an international cargo airport.\nCargo companies have also applied to have their presence here."
  },
  {
    "headline": "Omo-Agege, Ekweremadu, Ngige, govs, others preach peace, love vigilance at Easter",
    "summarized_story": "The Delta Central lawmaker therefore urged Christians to rededicate themselves to the values of love, peace, sacrifice and tolerance.\n“Easter celebrates Christians’ belief in the divine power of Jesus and the hope that loss leads to something new.\nEkweremadu said: “Easter is a thought-provoking moment as it commemorates the triumph of love, forgiveness, and self-sacrifice over hate and evil.\nNgige also felicitated Christians on the occasion of the remembrance of the death and resurrection of Christ.\n“In the spirit of the Easter season, I would like to repeat this appeal for forgiveness, peace and reconciliation in our state."
  },
  {
    "headline": "More knocks for FG over Dariye, Nyame pardons",
    "summarized_story": "By Mike Odiegwu, Port Harcourt and Eric Ikhilae, AbujaThe Federal Government yesterday received more knocks for the pardons granted to former governors of Plateau State, Joshua Dariye and Taraba State, Jolly Nyame, convicted for corruption.\nThey want (Jolly) Nyame to help them in Taraba State.\nHe distinguished the pardon granted to the late governor of Bayelsa State, Diepreye Alamieyeseigha from the current case of Nyame and Dariye.\n“Where lies the justice for the impoverished people of Plateau and Taraba states who will now watch their tormentors stroll out with red carpet treatment?\nBut as we speak, ex-governors Dariye and Nyame are still in our custody."
  },
  {
    "headline": "I’m sad my sisters are still in captivity, says rescued Chibok girl Grace Dauda",
    "summarized_story": "One of the liberated girls, Grace Dauda, was there to share her experience.\nLooking pretty and well-kept, Dauda recalled her experience in the three years she spent in captivity saying: “Imagine yourself living in the forest, no freedom and fighter jets hovering around.\nI no longer hear anything about my sisters in captivity.\nShe said all Nigerians are now a metaphor for Chibok girls, stressing that the series of abductions and attacks, including the recent Kaduna-Abuja train bombing and abduction more than underline this.\nShe, however, that they are still being processed, which is why they have not released their names."
  },
  {
    "headline": "Rebuilding Jos main market: Better late than never",
    "summarized_story": "The burnt Jos Main Market held a special place in the soul of Plateau State and its people.\nIt was initially conceived, like most iconic projects in the state, by the former Governor of the defunct Benue Plateau State, Mr. Joseph D. Gomwalk, in 1975.\nIt was the military Governor Navy Commodore Samuel B. Atukum’s special honour to invite Gen. Buhari, then Head of State, to Plateau State to commission the market in 1985.\nIf Jaiz Bank will rebuild the burnt Jos Main Market and thus resuscitate the economy of Plateau State, so be it.\nThe above performance profile and experience in the sector are good assurances of the bank’s capacity to handle the Jos market project."
  },
  {
    "headline": "Tinubu to youths: With you on my side, we’ll make Nigeria excel",
    "summarized_story": "Tinubu to youths: With you on my side, we’ll make Nigeria excelAll Progressives Congress (APC) National Leader, Asiwaju Bola Tinubu, yesterday sought the support of Nigerian youths in his bid for the presidency, saying together, they could change the story of the country for the better.\n“If YouTube alone has 2.9 billion people following it, including you all standing here, then Nigeria can excel.\nNigeria, Tinubu said, has all it requires to conveniently feed its citizens “by being creative, visionary and committed.”Continuing, he said: “Anybody who says we cannot, they can get out, because it is voluntary.\nTinubu, addressing the crowd of youths he described as the brightest, urged them to team up with him in his bid to change the story of Nigeria for the youths and tomorrow which they represent.\n“I have no doubt that Bola Tinubu is capable of this, which is why I support his campaign to lead Nigeria."
  },
  {
    "headline": "Pat Utomi exclusive: Why Nigerians should reject APC, PDP in 2023",
    "summarized_story": "He said the ruling All Progressives Congress (APC) and the Peoples Democratic Party (PDP) have failed in the rescue mission.\nExcerpt:Contrary to the expectation that the opposition party, Peoples Democratic Party (PDP) will zone its presidency to the South, the party has decided to throw it open to all zones.\nThere is no way you can contain the current security problem until you go to policing and when I say policing it doesn’t have to be formal.\nAre you talking about community policing?\nYou know that there are two different views on community policing, community policing in the classic sense of it, as police and community talking, but community policing with the community as police, a vigilante kind of it, but now designed, like in a way India organizes policing."
  },
  {
    "headline": "Call for Buhari to resign: Northern elders under fire",
    "summarized_story": "For SOKAPU, the position of the northern elders on Buhari was suspicious, pointing out that it was not too long they were shouting Hosanna in favour of Buhari even amid killings and kidnapping of innocent Nigerians.\nExpectedly, however, the presidency had immediately replied the northern elders, describing them as failed politicians seeking cheap publicity.\n“Northern Elders asking President Muhammadu Buhari to resign over killings in the country is uncalled for, there is no need for such call.\n“The northern elders should rather proffer solution to the problem and advise government on how to go about ending these killings and kidnapping.\n“When his nepotism, favouritism in making key Federal appointments and in the award of federal projects favoured the Hausa/Fulani Muslims of the North, to which these northern elders belong, why didn’t they ask him to resign?"
  },
  {
    "headline": "Abia North: Jubilation as Lawan commissions projects attracted by Kalu – The Sun Nigeria",
    "summarized_story": "It was jubilation galore in parts of Abia North Senatorial District at the weekend when the Senate President, Dr. Ahmad Lawan, commissioned roads and other projects attracted by the Senate Chief Whip, Dr. Orji Uzor Kalu.\nThis is even as the former Abia State governor promised that he would attract more dividends of democracy even beyond his immediate constituency of Abia North.\nOther projects commissioned by the Senate President were three boreholes in Agbaja, Amuri and Enugwu all in Nkporo, Ohafia LGA and the 7.5km road in Agbaja Nkporo.\nIn appreciation of what Kalu did for them, traditional rulers from the various communities came out in their numbers to honour the Senate President with chieftaincy titles.\nAt Alayi and Item in Bende LGA, the Senate President was given the titles of Ezi Enyi1 and Nwanne Di N’Mba, respectively."
  },
  {
    "headline": "Obi, Sule, Ugwuanyi, Uzodimma, other govs, clerics felicitate Christians at Easter",
    "summarized_story": "Obi who made the remarks in his Easter message, also urged Christians to show commitment to the wellbeing of the country and remember her in their prayers.\nOn his part, Imo State Governor, Senator Hope Uzodinma urged Nigerians to use the occasion of this Easter to rethink their humanity.\nHe said the essence of humanity is love of God and love of neighbour as exemplified by the sacrificial love of Jesus Christ.\nOkowa noted that the resurrection of Jesus Christ, symbolised in Easter, remained a turning point in the lives of Christians.\nIn the spirit of Easter, New Nigeria People’s Party (NNPP), felicitated with Christians and appealed to Nigerians to show love and remain peaceful."
  },
  {
    "headline": "2023: Nigerians tired of excuses, want banditry-free country – Tinubu",
    "summarized_story": "National Leader of All Progressives Congress (APC), Asiwaju Bola Tinubu, yesterday declared that Nigerians were tired of excuses and lamentations of the past over the numerous challenges like epileptic power supply and banditry bedeviling the country, adding that a united and banditry-free Nigeria is possible if he is elected as president.\nThe South-West youth leaders at the event took turns to speak on why the youths were promoting the APC National Leader, Asiwaju Tinubu, to become the next president of Nigeria, come 2023.\nThis was just as they described the APC national leader as a detribalized Nigeria, who would take the country to greater heights, come 2023, if voted as president of the country.\nThe support for Tinubu’s presidential election was not limited to the youths as South-West state assemblies also threw their support at the event.\nA member of Lagos State House of Assembly, Hon."
  },
  {
    "headline": "APC Holds Presidential Primary May 30/31, Gov May 23, Sale of Forms Opens April 22",
    "summarized_story": "Ahead of the NEC meeting, the NWC will also meet in Abuja next Tuesday.\nThe source also revealed that for the states’ houses of assembly, the Expression of Interest form will cost N500, 000, while the Nomination form will cost N1, 500,000.\nAspirants for House of Representatives will pay N1 million for Expression of Interest and N4 million for the Nomination form, while those vying for Senate will pay N2 million for Expression of Interest and N8 million Nomination form.\nThe party also proposed N5 million for Expression of Interest and N25 million as Nomination form for the governorship seat.\nFor the Presidential position, the Expression of Interest form is fixed at N5 million while nomination form is fixed for N40 million."
  },
  {
    "headline": "World Bank in Latest ‘Africa’s Pulse’ Projects 2.7% Growth for Nigeria in 2022",
    "summarized_story": "Ndubuisi Francis in AbujaThe World Bank in its latest Africa’s Pulse, a biannual analysis of the near-term regional macroeconomic outlook, has projected a 2.7% growth for Nigeria in 2022.\nOf the region’s three largest economies – Angola, Nigeria, and South Africa – only Nigeria is projected to enjoy a fairly good growth in 2022.\nThe report said growth in South Africa is expected to decline by 2.8 percentage points in 2022, dragged by persistent structural constraints.\nResource-rich countries, especially their extractive sectors, will see improved economic performance due to the war in Ukraine, while non-resource rich countries will experience a deceleration in economic activity,” said the World Bank.\nIt said: Excluding Angola, Nigeria and South Africa, regional growth is projected at 4.1 per cent in 2022, and 4.9 per cent in 2023."
  },
  {
    "headline": "20 Days After, 68 Abducted Train Passengers Languish in Dungeon of Terrorists, Families Restless, Confused",
    "summarized_story": "“They should try as much as possible to reach out to the perpetrators and rescue our loved ones.\nBut it’s now an opportunity and a window for the government to rescue our loved ones by opening a channel of communication with them (terrorists).\nWe are appealing to them to come out to open a channel of discussion with the bandits and get our loved ones out as quickly as possible.\nWe are like living corpses.”No fewer than 362 passengers were onboard the train at the time terrorists struck on March 28.\nAccording to Atta, the terrorists said the train attack was just the beginning and that they would go further than this."
  },
  {
    "headline": "Higher Food Prices Drive Inflation to 15.92%, Highest in 5 Months",
    "summarized_story": "Month on month, the headline index increased by 0.11 per cent to 1.74 per cent in March compared to 1.63 per cent in February.\nAccording to the statistical agency, month on month, food inflation was highest in Anambra with 3.78 per cent, followed by Niger with 3.60 per cent and Zamfara 3.31 per cent in the month under review.\nHowever, countrywide, the rise in the food index was caused by increases in prices of bread and cereals, food product, potatoes, yam and other tuber, fish, meat, oils and fats.\nMonth on month, the core sub-index stood at 0.98 per cent in March, down by 0.35 per cent compared to 1.33 per cent in February.\nYear on year, urban inflation increased to 16.44 per cent in March, showing a decline of 2.32 per cent compared to 18.76 per cent in 2021."
  },
  {
    "headline": "Gunmen Invade Soludo’s Community, Kill One Policeman",
    "summarized_story": "David-Chyddy Eleke in AwkaGunmen on Friday invaded Isuofia Community, Aguata Local Government Area, where Anambra State governor, Prof Charles Soludo, hails from.\nTHISDAY gathered one police man was killed in the process, and that the incident happened at a junction leading to the governor’s house.\nA source said the gunmen stormed the junction, where security operatives were stationed, attacking the operatives.\nThe source said the gunmen were angered by the idea of stationing a security post in the area.\n“One police man was however killed in the process,” the source said."
  },
  {
    "headline": "Bank Documents Expose How Akwa Ibom Governor, Emmanuel Wired N110 Million From State Account To PDP Chieftain Before 2019 Election",
    "summarized_story": "Bank documents have shown how Governor Udom Emmanuel of Akwa Ibom State authorised the transfer of N110 million from the state treasury to the personal account of one Obong Akpabong Moffat UdoEkpo, a chieftain of the Peoples Democratic Party (PDP) in the Oruk Anam Local Government Area of the state.\nThe bank documents showing the transactions from Zenith Bank, which were obtained by SaharaReporters revealed that the money was paid in tranches between 05/02/2019 and 22/03/2019 to the personal account of UdoEkpo.\nAkwa Ibom Governor Udom EmmanuelAbout N80 million of the fund was transferred to the PDP chieftain a few days before the March 9, 2019 governorship election in the state, following which Emmanuel secured a second term in office.\nUdoEkpo was a grassroots mobiliser and a strong supporter of the governor’s second term bid.\nUdoEkpo is also contesting to represent the Oruk Anam constituency in the Akwa Ibom State House of Assembly."
  },
  {
    "headline": "Bank Documents Expose How Akwa Ibom Governor, Emmanuel Wired N110 Million From State Account To PDP Chieftain Before 2019 Election",
    "summarized_story": "Bank documents have shown how Governor Udom Emmanuel of Akwa Ibom State authorised the transfer of N110 million from the state treasury to the personal account of one Obong Akpabong Moffat UdoEkpo, a chieftain of the Peoples Democratic Party (PDP) in the Oruk Anam Local Government Area of the state.\nThe bank documents showing the transactions from Zenith Bank, which were obtained by SaharaReporters revealed that the money was paid in tranches between 05/02/2019 and 22/03/2019 to the personal account of UdoEkpo.\nAkwa Ibom Governor Udom EmmanuelAbout N80 million of the fund was transferred to the PDP chieftain a few days before the March 9, 2019 governorship election in the state, following which Emmanuel secured a second term in office.\nUdoEkpo was a grassroots mobiliser and a strong supporter of the governor’s second term bid.\nUdoEkpo is also contesting to represent the Oruk Anam constituency in the Akwa Ibom State House of Assembly."
  },
  {
    "headline": "EXCLUSIVE: APC Senator, Stella Oduah Secretly Obtains PDP Senatorial Nomination Form After Tricking Attorney General, Malami To Frustrate N7.9billion Fraud Trial",
    "summarized_story": "Stella Oduah, a Nigerian Senator and former Minister of Aviation has finalised her defection from the ruling All Progressives Congress (APC) to the Peoples Democratic Party (PDP), SaharaReporters has gathered.\nStella OduahA source told SaharaReporters that the Senator returned to the PDP and secretly obtained the party’s nomination form to return to the Senate.\n“Senator Stella Oduah has finally dumped the APC and moved to the PDP after days of playing hide and seek game.\nSaharaReporters on Tuesday, March 29, 2022 reported that the former aviation minister had concluded plans to dump the ruling APC for the PDP.\nSee Also Politics After Tricking Nigeria’s Attorney General, Malami To Frustrate N7.9bn Fraud Trial, Stella Oduah Moves To Dump APC For PDPSaharaReporters reported that the Senator had held a closed-door meeting with Anyim Pius Anyim, a PDP presidential aspirant and some party leaders."
  },
  {
    "headline": "EXCLUSIVE: APC Senator, Stella Oduah Secretly Obtains PDP Senatorial Nomination Form After Tricking Attorney General, Malami To Frustrate N7.9billion Fraud Trial",
    "summarized_story": "Stella Oduah, a Nigerian Senator and former Minister of Aviation has finalised her defection from the ruling All Progressives Congress (APC) to the Peoples Democratic Party (PDP), SaharaReporters has gathered.\nStella OduahA source told SaharaReporters that the Senator returned to the PDP and secretly obtained the party’s nomination form to return to the Senate.\n“Senator Stella Oduah has finally dumped the APC and moved to the PDP after days of playing hide and seek game.\nSaharaReporters on Tuesday, March 29, 2022 reported that the former aviation minister had concluded plans to dump the ruling APC for the PDP.\nSee Also Politics After Tricking Nigeria’s Attorney General, Malami To Frustrate N7.9bn Fraud Trial, Stella Oduah Moves To Dump APC For PDPSaharaReporters reported that the Senator had held a closed-door meeting with Anyim Pius Anyim, a PDP presidential aspirant and some party leaders."
  },
  {
    "headline": "Buhari: To resign or not to resign?",
    "summarized_story": "On Tuesday, the Northern Elders Forum (NEF) issued a statement asking President Muhammadu Buhari to “seriously consider” resigning over the pervasive insecurity in the land.\nIn November, 2014, Alhaji Lai Mohammed, then spokesman for the All Progressives Congress (APC), asked President Goodluck Jonathan to resign.\nAt every turn of killings and kidnappings, they rush out a press statement describing Nigeria as “unsafe”, tagging the APC government as “incompetent” and asking Buhari to resign.\nNow PDP is telling us if Buhari resigns or if we vote out APC, Nigerians would be safe.\nThe call for Buhari to resign does not excite me because I would rather take a holistic view of the entire gamut."
  },
  {
    "headline": "Buhari: To resign or not to resign?",
    "summarized_story": "On Tuesday, the Northern Elders Forum (NEF) issued a statement asking President Muhammadu Buhari to “seriously consider” resigning over the pervasive insecurity in the land.\nIn November, 2014, Alhaji Lai Mohammed, then spokesman for the All Progressives Congress (APC), asked President Goodluck Jonathan to resign.\nAt every turn of killings and kidnappings, they rush out a press statement describing Nigeria as “unsafe”, tagging the APC government as “incompetent” and asking Buhari to resign.\nNow PDP is telling us if Buhari resigns or if we vote out APC, Nigerians would be safe.\nThe call for Buhari to resign does not excite me because I would rather take a holistic view of the entire gamut."
  },
  {
    "headline": "Akpanudoedehe declares guber bid, says he'll deliver Akwa Ibom from poverty",
    "summarized_story": "John Akpanudoedehe, former national secretary of the All Progressives Congress (APC) caretaker committee, has declared his intention to contest the governorship of Akwa Ibom.\nAkpanudoedehe formally announced his intention on Saturday at an APC political gathering in Uyo, the Akwa Ibom capital.\nSpeaking at the event, the former senator said God has given him a “special gift” to take the people of Akwa Ibom out of poverty.\nHe added that if elected, he will give N1 million grant to 1,000 people in each LGA of the state.\nI hereby declare to run for the governor of Akwa Ibom state,” he said."
  },
  {
    "headline": "Akpanudoedehe declares guber bid, says he'll deliver Akwa Ibom from poverty",
    "summarized_story": "John Akpanudoedehe, former national secretary of the All Progressives Congress (APC) caretaker committee, has declared his intention to contest the governorship of Akwa Ibom.\nAkpanudoedehe formally announced his intention on Saturday at an APC political gathering in Uyo, the Akwa Ibom capital.\nSpeaking at the event, the former senator said God has given him a “special gift” to take the people of Akwa Ibom out of poverty.\nHe added that if elected, he will give N1 million grant to 1,000 people in each LGA of the state.\nI hereby declare to run for the governor of Akwa Ibom state,” he said."
  },
  {
    "headline": "'One killed, many abducted' as gunmen invade Niger community",
    "summarized_story": "Gunmen have reportedly abducted an unconfirmed number of persons along the Tapila-Gwada road, an area located in Shiroro LGA of Niger state.\nThe gunmen were said to have attacked the area on Saturday at about 7pm.\nAdvertisementA resident of the community told TheCable that two of her cousins were among the residents that the gunmen abducted.\nAccording to her, many people had to run into the bush for safety and only came out after the gunmen had left.\nCommunities in the north-central and north-west zones have been recording an increase in the activities of gunmen in recent months."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Digital Nomads: Julian Owusu’s journey from football to fintech",
    "summarized_story": "Even though football held a promising future for Julian, it was only one of his dreams.\n“I grew up playing football,” he says, “But I’ve always been interested in tech, even long before I started playing professionally.”At the beginning of his football career, Julian knew he wanted to tell a different story with his journey.\nI wanted to be different.”He started his professional journey at 16 when he joined Eleven Wise—a Division One football league club based in Ghana—as a striker.\nWhen football players on defining paths, such as Julian, retire, it’s often because of injury.\n“It was difficult at the beginning, but all the skills I’d learnt playing football were transferrable."
  },
  {
    "headline": "In the wake of explosive accusations against Africa’s most valuable startup, Flutterwave co-founder speaks",
    "summarized_story": "Africa Fintech Foundry is an initiative by Access Bank that nurtures and accelerates the growth of fintech startups in Africa.\nAccess Bank was the budding fintech’s banking partner and Flutterwave helped introduce the bank to its Silicon Valley network.\nOtherwise, as a result of the hostility among banks, other banks can just say, ‘You’re from Access Bank, we will not use you.’ While we’re not Access Bank.\nWe’re Flutterwave,” Aboyeji said.\nFuture Africa, which Iyin Aboyeji leads, and Gbenga Agboola, Flutterwave CEO, are investors in Big Cabal Media, parent company of TechCabal."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "Uber doesn’t want to Friyay",
    "summarized_story": "Uber Tanzania suspends operationsYesterday, Thursday, April 14, 2022, ride-hailing company, Uber, suspended operations in Tanzania until further notice after six years in the country.\nIn Nigeria, Uber increased rates on its UberX platform by 13% in Lagos and 20% in Nigeria’s capital, Abuja.\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nIt means that OPay cards will be linked to OPay’s mobile app, allowing users to request the issuance or cancellation of prepaid cards.\nThe prepaid cards will be distributed in collaboration with Egyptian Cards Company, the largest card distributor in the local and regional markets."
  },
  {
    "headline": "Can embedded finance drive financial inclusion in Nigeria?",
    "summarized_story": "An embedded finance play involves a company, usually not a financial institution, offering a financial service in addition to its existing offers.\nWhichever way you look at it, embedded finance seems like a good deal for everyone involved, so how does that affect financial inclusion in Nigeria?\nAccording to the World Bank, financial inclusion means that businesses and individuals have access to financial products and services that meet their needs responsibly and sustainably.\nHowever, considering financial inclusion can be achieved in other ways besides using a bank account, this may not be an accurate representation of financial inclusion in Nigeria.\nAdvertisementBy integrating financial services into non-financial solutions, more Nigerians can be integrated into the financial system without requiring a bank account."
  },
  {
    "headline": "Is Flutterwave’s CEO guilty of insider trading or not?",
    "summarized_story": "Anyway, today, I’ll be discussing:Flutterwave CEO’s insider trading allegationHow VC firm, Katapult, investsUmba’s $15 million Series AIs Flutterwave’s CEO guilty of insider trading or not?\nSince then, the phrase “insider trading” has topped my Twitter trend tables.\nIf Chimgozirim’s informant uses this insider information to profit in the stock market, all three involved are guilty and can be prosecuted.\nWhat does the law say about insider trading?\nInsider trading laws apply to private and public companies and transactions involving employees, employee stock plans, and third-party shareholders."
  },
  {
    "headline": "Explainer: Why is Insider Trading a crime?",
    "summarized_story": "What is insider trading?\nThe scenario above illustrates the concept of insider trading, a phenomenon that is not new to capital markets.\nBlack’s Law dictionary defines insider trading as the use of material, non-public information in trading the shares of a company by a corporate insider or other person who owes a fiduciary duty to the company.\nIn Nigeria, there seems to be no clear framework on insider trading for private companies.\nThe United States Securities and Exchange Commission recognizes that the law against insider trading applied to private companies."
  },
  {
    "headline": "How to convert a petrol engine into an electric vehicle",
    "summarized_story": "How to convert a petrol engine into an electric vehicleDan Henry faces a dilemma when it comes to driving.\nHe’s a climate-conscious, time-pressed tech executive who adores classic cars, especially the 1961 Austin-Healey 3000 Mk II, Bloomberg reported.\nElectrifying an old vehicle is a time-consuming and costly process.\n“Some people scream that we’re taking the soul out of the car, but the reality is that we’re preserving it.” Marc Davis, founder of Moment Motor said.\nThe number of old cars traded on peer-to-peer marketplaces like Craigslist is estimated to be ten times that figure."
  },
  {
    "headline": "How to price your art",
    "summarized_story": "Patrons is a full-suite art advisory firm that helps private and corporate art collectors with diversifying their wealth through art collection, appraisal, packaging & transportation, storage, insurance, maintenance and restoration.\nThe total cost price of your artwork will then be $405.\nSet a price and stick to itWhen you set your price, you are basically setting your standard.\nThey are in the business of art and have mastered the art of pricing.\nSimply put, gallerists are able to convince collectors that the art they sell is worth the asking price."
  },
  {
    "headline": "500 widows empowered in Kwara – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIlorin – No fewer than 500 widows from across the 16 local government areas of Kwara state have been empowered with various working tools, including cash donations, worth millions of Naira.\nSpeaking while distributing the cash donations and working tools in Ilorin, the state capital, the sponsor of the empowerment programme, Mr. Kolo Baba Jiyah, said the spirit behind the empowerment is to support the widows to enable them meet up with the life challenges.\n“I know what life means for a widow to maintain herself and care for the children’s going by the prevailing economic situation in the country.\nHe urged the beneficiaries to make judicious use of the tools to improve their lives, urging them not to sell them as doing that would not be beneficial to them.\nEarlier, an associate of the philanthropist, Alatare Suleiman Musa, lauded Jiyah for his kind gesture, noting that his empowerment programme has touched so many lives in Kwara state, adding that Nigeria needs people like Jiyah to reduce the poverty among the citizenry."
  },
  {
    "headline": "Edo govt, firm synergize on transparency, performance metrics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPoised to ensure transparency and performance-based service delivery, the Edo State Government has said it is instituting measures and metrics for evaluating activities of civil and public servants so as to meet set targets.\nThis was disclosed by the Commissioner for Finance, Joseph Eboigbe during the ongoing performance management capacity building workshop, organized for Heads of Ministries, Departments and Agencies (MDAs).\nThe workshop is expected to ensure quarterly feedback from MDAs on their performance and identify current gaps.\n“Security is also a huge priority as the state is strengthening its security architecture in partnership with security agencies.\nShe said the government has made immense contributions towards the development of human capital, noting “I want to see Nigeria working again."
  },
  {
    "headline": "Easter: Obaseki urges hope, sacrifice to rebuild nation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has urged Christian faithful to emulate Jesus Christ by making sacrifices that would engender development and ensure lasting peace and unity in the country.\nObaseki, in his Easter Message, urged Christians to reflect on the purpose of Easter celebration with a renewed hope for a better Nigeria, and be a part of the process of rebuilding the country.\nHe noted, “I felicitate with Christian faithful as we celebrate the sacrifice of the death and resurrection of our Lord Jesus and urge that we use the opportunity to reflect on the purpose of the celebration and renew our hopes towards achieving a better Nigeria.\n“We may have been stretched beyond limits considering the myriad of challenges that we currently face as a people, but there’s hope.\nThe good news is that our dear country, irrespective of these glaring challenges, is not beyond redemption."
  },
  {
    "headline": "Edo rallies stakeholders, assures programmes to preserve, promote cultural heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has urged for the collaboration of all stakeholders to preserve and promote the state’s rich cultural heritage, reassuring that the government will sustain efforts at preserving the state’s cultural assets and drive growth in the arts, culture and tourism sector.\nThe Edo State Commissioner for Arts, Culture and Diaspora Affairs, Hon.\nBamidele Obaitan, made the call during a meeting with stakeholders in the arts and culture sector, in Benin City, the Edo State capital.\nHe, however, advised heads of social and cultural departments in the local councils to collate the data of all cultural and tourism sites as well as a compendium of all festivals at the grassroots for effective documentation.\nHe further revealed the government’s plan to assist self-employed youths with grants through the African Development Bank (AfDB)."
  },
  {
    "headline": "Access Bank moves beyond banking, becomes financial services holding company from May 1",
    "summarized_story": "Access Bank Plc, a leading Nigerian lender, has said it is transforming from core banking into a full financial services holding company from 1 May, 2022.\nHerbert Wigwe, the managing director of the bank, in a notice to shareholders on Saturday said the new company will be known as Access Holdings, PIc, but trading as Access Corporation.\nThe products on offer will include buy-now-pay-later loans, car loans, small mortgages, salary-based loans, working capital loans, durable goods loans, point of sale loans and much more.\n“Payment Company: a Payment Services Company that will drive payments domestically, across the African continent and beyond.\nPrimarily a business services company, the Payco will make payments simpler, faster and more efficiently."
  },
  {
    "headline": "Wike: I’m the only candidate capable of beating APC in 2023",
    "summarized_story": "Nyesom Wike, governor of Rivers State and People’s Democratic Party (PDP) presidential aspirant, has said he the only aspirant in the party who is capable of defeating the All Progressives Congress (APC) at the 2023 polls.\nThe Rivers State governor, however, said he would remain in the party even if he does not win its presidential ticket, noting that he will back the option of consensus candidate if based on equity, justice and fairness.\nHe said this while addressing stakeholders of the Niger State chapter of the PDP on his intention to contest for president at the party secretariat in Minna on Saturday.\nHe solicited stakeholders’ support in the state party to enable him become the flagbearer of the party.\n“I can become the president if I get the mandate of delegates to make me the flag bearer."
  },
  {
    "headline": "World Bank raises debt crisis concerns – as Buhari earmarks N4trn for fuel subsidy",
    "summarized_story": "According to the report, “Risk remains high on increasing fuel subsidies, which could weigh heavily on public finance and pose debt sustainability concerns.\n“Nevertheless, public debt as a percentage of GDP is currently moderate.”The Washington-based institution added that the country’s soaring military spending and debt servicing costs could prey on the country’s debt sustainability level.\n“Persistent fuel subsidies, increasing military spending for security purposes, and rising debt servicing costs weigh heavily on public finance to keep public debt at a sustainable level in Nigeria,” the report added.\nIt projected a 2.7 per cent growth for Nigeria in 2022.\nAccording to World Bank, growth in Nigeria is forecast to increase to 3.8 per cent in 2022 and stabilise at 4 per cent from 2023 to 2024."
  },
  {
    "headline": "Eni lifts force Majeure at Obiafu/Obrikom gas line, restores production",
    "summarized_story": "Eni, an Italian energy group, on Friday, said it had lifted a force majeure on gas exports from Nigeria’s Okaka in Bayelsa State after repairing a vandalised pipeline.\nEni had declared force majeure on April 6, 2022 after the Ogboinbiri to Obiafu/Obrikom gas line operated by local unit Nigerian Agip Oil Company was damaged by a hacksaw cut, resulting in the loss of five million standard cubic metres per day.\nA spokesman for Eni said in a statement that operations had been fully restored this week.\nDisruptions to oil and gas production are common in the oil-rich Niger Delta region, where pipelines are often vandalised and crude stolen for illegal refining.\nEni had declared a force majeure following a major attack on its 24-inch gas line at Okaka in Yenagoa."
  },
  {
    "headline": "Abuja Ministry Holds 2022 Praise, Drama Festival On Easter Monday",
    "summarized_story": "Vision Drama Missions Outreach International, a drama and film ministry-based organisation in Abuja, Nigeria, will on Easter Monday, April 18, 2022 hold this year’s edition of Praise and Drama festival with the theme, “Fight To Finish Strong This Season”.\nPresident of the organisation, Felix Bankole, said the Praise Drama festival started in 2011 as a mandate from God to raise an altar of praise, worship and pray to God.\nDuring the one-day programme, a new movie titled ‘Mugun Zamani’ (The Wicked Generation) will be premiered at the occasion.\nArtistes that featured in the movie are Shola Mike Agboola, Joseph Opadele, Gloria Amuche, David Emmanuel, and Gabriel Akpanke, among others.\nADVERTISEMENTGuests expected to grace the festival include Chris Morgan, Sam Bulus, Taiwo Emmanuel, Jide, Pastor E.A."
  },
  {
    "headline": "SGF, Govs Felicitate With Christians On Easter",
    "summarized_story": "He urged Christians to emulate the sacrifice of Jesus Christ as well as his teaching on love, compassion, selflessness and tolerance in all dealings.\nObaseki gave the charge in a message to mark Good Friday, a Christian holiday in preparation for the Easter celebration.\nThe governor stated that Easter exemplifies the ultimate sacrifice made by Jesus Christ to save mankind, noting that as individuals, Christians must take into consideration the welfare of others.\nHe said: “Easter symbolises love, sacrifice, service to God and country as well as triumph of good over evil.\nHe said: “Easter symbolises love, sacrifice, service to God and country as well as triumph of good over evil."
  },
  {
    "headline": "Easter: Police, FRSC Urge Crime-free, Accident-free Celebration",
    "summarized_story": "Ahead of the Easter celebration, the inspector-general of Police, IGP Usman Baba, in his resolve to ensure crime-free Easter celebrations, has ordered intensive security patrols of all public spaces and critical national assets.\nThis is even as the corps marshal, Federal Road Safety Corps, Dr Boboye Oyeyemi called on all motorists to ensure full compliance to all road traffic laws.\nAccording to Bisi Kazeem, the corps public education officer, all personnel have been adequately briefed on the imperatives of ensuring that motorists are made to drive in accordance with the stipulation of the Nigerian Highway Code and other regulations on best road practices.\nMeanwhile, the commissioners of police and their supervising AIGs have been directed to ensure proper supervision of the men assigned for these assignments.\nADVERTISEMENTThey must be professional and courteous to law-abiding citizens but firm and ruthless to criminal elements who might want to take the advantage of the festive period to perpetrate their unholy acts."
  },
  {
    "headline": "Easter: Police, FRSC Urge Crime-free, Accident-free Celebration",
    "summarized_story": "Ahead of the Easter celebration, the inspector-general of Police, IGP Usman Baba, in his resolve to ensure crime-free Easter celebrations, has ordered intensive security patrols of all public spaces and critical national assets.\nThis is even as the corps marshal, Federal Road Safety Corps, Dr Boboye Oyeyemi called on all motorists to ensure full compliance to all road traffic laws.\nAccording to Bisi Kazeem, the corps public education officer, all personnel have been adequately briefed on the imperatives of ensuring that motorists are made to drive in accordance with the stipulation of the Nigerian Highway Code and other regulations on best road practices.\nMeanwhile, the commissioners of police and their supervising AIGs have been directed to ensure proper supervision of the men assigned for these assignments.\nADVERTISEMENTThey must be professional and courteous to law-abiding citizens but firm and ruthless to criminal elements who might want to take the advantage of the festive period to perpetrate their unholy acts."
  },
  {
    "headline": "Federal Govt Eulogises Late Orlando Julius, Consoles Family",
    "summarized_story": "The minister of Information and Culture, Alhaji Lai Mohammed, has condoled with the family, friends and fans of the late highlife musician, Julius Aremu Olusanya Ekemode, popularly known as Orlando Julius, saying his death robs the music industry of another trailblazing legend and the nation of another giant star.\nIn a statement issued in Lagos yesterday, the minister described the late Orlando Julius as an all-rounder in his field, noting that he made his mark as a singer, songwriter, saxophonist and performer.\n‘’Despite a larger-than-life image, he remained a decent gentleman and a good family man.\nHis passion for music was unparalleled, hence he excelled in his chosen field.\n‘’By dint of hard work, he and others like him laid the foundation and helped to nurture Afrobeat to global prominence,’’ he said, adding:’’It was, therefore, most fitting that he lived long enough to witness the moment in which Nigerian music has taken the world by storm.’’Alhaji Mohammed urged the family of the late music legend to take solace in the good and remarkable life of their patriarch and prayed for repose to the soul of the departed."
  },
  {
    "headline": "Extend presidential pardon to petty thieves, Falana urges FG",
    "summarized_story": "Rights activist Femi Falana, SAN, on Friday in Ikeja urged the Federal Government to extend Thursday’s presidential pardon granted some top Nigerians, to people serving terms for petty offences.\nThe News Agency of Nigeria reports that the Council of State granted presidential pardon to 159 convicts on Thursday.\n“When we are talking of justice and fair play, if you want to pardon some set of people, then you must also extend presidential pardon to petty thieves in the prisons.\nSpeaking on the passing of late Odumakin after a year, Falana described his loss as a monumental tragedy.\nNAN reports that late Odumakin, died in April 2, 2021, after battling with respiratory problems, occasioned by COVID-19 complications."
  },
  {
    "headline": "Nigeria ranks below Seychelles, Lybia, Morocco, Gabon, others in minimum wage index",
    "summarized_story": "Indeed, African countries have some of the lowest minimum wage rates in the world with Nigeria not ranking among the first 20.\nThe highest paying minimum wage Afrixan country is Seychelles m minimum wage at $432 per month.\nAccording to Investopedia, a minimum wage is the lowest, statutorily required wage that a worker can earn.\nIn other words, it is illegal for employers to pay employees anything short of the minimum wage as stipulated by a federal law of a given country.\nBelow are the African countries with the highest minimum wage, according to available statistics obtained from Statista."
  },
  {
    "headline": "How Osinbajo Declined Obasanjo’s Offer To Dump Lagos, Tinubu in 2005",
    "summarized_story": "Detailing how he turned down Obasanjo’s offer, Ogunsakin in an article titled “Attacking Osinbajo” said “in 2005, President Obasanjo invited Osinbajo to take appointment as the Attorney General of the Federation after Chief Akin Olujimi, SAN left office.\nHe said Obasanjo was impressed by Osinbajo’s impeccable record and wanted him to replicate the wholesome changes he had implemented in Lagos but Osinbajo was loyal to Asiwaju Bola Tinubu and Lagos state.\n“Obasanjo saw the sterling qualities and performance that Osinbajo had as Attorney General of Lagos.\nThe President without informing Tinubu offered the post to the Lagos AG.\nSpeaking further, Ogunsakin said, “the Vice President not only stood with Tinubu, but stayed loyal to Lagos State."
  },
  {
    "headline": "2023: PDP adjusts dates on sale, submission of nomination forms",
    "summarized_story": "The Peoples Democratic Party (PDP) has extended the closing dates for the purchase and submission of Expression of Interest and Nomination Forms ahead of the 2023 general elections.\nAccording to a statement signed by PDP’s National Publicity Secretary, Debo Ologunagba, this is to enable the Party to make up for the two days public holidays during Easter.\nThe last day for the purchase of all forms was Thursday, April 14, 2022, while the last day for the submission of all forms was April 17, 2022.\nThe initial dates for screening of aspirants for State House of Assembly: April 19, 2022, National Assembly: April 20, 2022, Governorship: April 21, 2022, and for Presidential: April 25, 2022.\nHowever, the following dates have now been fixed for the screening of aspirants:State House of Assembly: Friday, April 22, 2022,National Assembly: Monday, April 25, 2022Governorship: Tuesday, April 26, 2022Presidential: Wednesday, April 27, 2022"
  },
  {
    "headline": "Terrorists kill 2, injure many in Kaduna community",
    "summarized_story": "Bandits have attacked Agban Kagoro community in Kaura local government area of Kaduna state and shot to death two persons, while injuring many others.\nThe bandits stormed the community in large numbers and started shooting sporadically before killing two people, while many others sustained gunshot injuries.\nThough Kaduna state government and the Kaduna state Police Command are yet to confirm the attack, former chairman of Kaura Local Government Area, Hon.\nResidents of many communities in Kaduna state have severally suffered bandits’ attack in recent times.\nThe bandits had attacked the Kaduna International Airport and killed a security man."
  },
  {
    "headline": "On Good Friday, student slumps, dies on drama stage",
    "summarized_story": "The unexpected happened at Claratian University of Nigeria, Nekede, in Owerri, Imo state when a seminarian, Suel Ambrose, slumped and died while acting a drama on good Friday.\nThe incident caused panic and pandemonium among the seminarians and passersby as frantic efforts to revive the deceased failed.\nOne of the students, Mavis said the 25- year- old first year student of Philosophy died on the spot.\nWe took him to our school hospital and the doctors did their best to revive him but he was not responding.\n“The drama was in commemoration of the death and resurrection of Jesus Christ in respect to the Easter celebration."
  },
  {
    "headline": "[Breaking] Ukraine war: Russia slams ban on UK Prime Minister Boris Johnson",
    "summarized_story": "Russia has banned Prime Minister Boris Johnson and other senior ministers from entering Russia over the UK’s “hostile” stance on the war in Ukraine.\nForeign Secretary Liz Truss, Defence Secretary Ben Wallace and 10 other senior politicians – mostly members of the Cabinet – have also been barred.\nMoscow said the decision had been made in retaliation to the UK’s sanctions against it since it invaded Ukraine.\nOn Wednesday, the US said that more sophisticated offensive weaponry would be sent to Ukraine as part of a $800m (£612m) package.\nIn response, Moscow on Friday warned the US that there would be “unpredictable consequences” if it refused to stop sending weapons to Ukraine."
  },
  {
    "headline": "Bashir Nura Alkali resumes Office as New Permanent Secretary for Works Ministry – NigPilot",
    "summarized_story": "Newly appointed Permanent Secretary of the Federal Ministry of Works and Housing, Mr. Bashir Nura Alkali has resumed duty following the recent approval and redeployment of Permanent Secretaries in the Federal Civil Service by His Excellency, President Muhammadu Buhari.\nEarlier in his remarks, Director Overseeing the Office of the Permanent Secretary, Engr.\nThat tells you the kind of person the new Permanent Secretary is.\nBut it is a gain to us in the Federal Ministry of Works and Housing,’’ Uzo said.\nUzo handed over two sets of handover notes, that of the former Permanent Secretary and that of when he acted as the Director Overseeing the Permanent Secretary’s Office."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Air Force Strikes Kill 70 ISWAP Terrorists In Lake Chad",
    "summarized_story": "The air force said on Saturday that it had killed more than 70 Islamic State affiliated fighters in the Lake Chad area, at the border with Niger Republic.\nThe statement said aircraft from both Nigeria and Niger Republic had taken part in the operation.\nThe Lake Chad area is known for hosting fighters of the Islamic State West Africa Province (ISWAP), a jihadist group active since 2016.\n“Over 70 ISWAP terrorists were either eliminated or severely injured,” he said.\nSince last year, ISWAP has mostly taken over from its rival Boko Haram, after its leader Abubakar Shekau died during inter-factional clashes."
  },
  {
    "headline": "2023: I Promise You A Banditry-Free Nigeria, Tinubu Woos Youths In Lagos",
    "summarized_story": "﻿All Progressives Congress (APC) chieftain Bola Ahmed Tinubu on Saturday promised that he will deliver a banditry-free, prosperous Nigeria if elected President.\nHe made the pledge while speaking to a crowd of party youths at the Mobalaji Johnson Arena in Onikan, Lagos.\n“A united Nigeria is our dream,” Mr Tinubu said.\nA violent-free Nigeria, a banditry-free Nigeria.\n“I joined young people from the SW States at Mobolaji Johnson Arena, Onikan in their support for the presidential aspiration of Asiwaju Bola Tinubu,” Governor Sanwo-Olu said."
  },
  {
    "headline": "2023: Wike Woos PDP Delegates In Niger, Plateau, Vows To End Banditry",
    "summarized_story": "﻿Rivers State Governor, Nyesom Wike has continued his nationwide tour to seek the votes of delegates to the presidential primary election of the Peoples Democratic Party, with a visit to two North Central States of Niger and Plateau.\nIn Niger State, Governor Wike told the delegates at the Party’s secretariat that he has the capacity to end banditry in their domain.\nGovernor Wike stressed that the recent prerogative of mercy granted the jailed former Governor of Taraba State, Jolly Nyame and that of Plateau State, Joshua Dariye was a further dent on the anti-corruption mantra of the APC-controlled Federal Government.\nGovernor Wike then proceeded with his delegation from Rivers State to Jos, the Plateau State capital where he met with former Governor Jonah Jang at his residence, before visiting the State Secretariat of the PDP to address the delegates and party executives led by Christopher Hassan.\nGovernor Wike equally promised to end the insecurity in Plateau State and replicate his development blueprint in Rivers State at the federal level."
  },
  {
    "headline": "Crude Oil Theft: Navy Makes Arrests, Seizes $700,000 Worth Of Illegal Products",
    "summarized_story": "The Navy on Saturday said it has made several arrests and seized more than $700,000 worth of illegally refined products in the nation’s oil producing areas as part of its Operation DAKATAR DA BARAWO (OPDDB).\nOPDDB was launched on April 1 in response to a national outcry over massive looting of the nation’s oil resources.\nThe Nigerian Upstream Petroleum Regulatory Commission, in March, said the country had lost about $3.27 billion worth of oil to vandalism and theft in the past 14 months.\nREAD ALSO: Procedures Govt Should Follow To Remove Petrol Subsidy – MoghaluIn a statement signed by spokesperson, Comodore Adedotun Ayo-Vaughan, the Navy said it was committed to enforcing a zero-tolerance for crude-oil theft and illegal bunkering in the oil-producing areas.\nRead the Navy’s statement below:"
  },
  {
    "headline": "Bauchi Speaker Defects To PDP",
    "summarized_story": "Speaker of the Bauchi State House of Assembly, Hon Abubakar Suleiman has dumped the APC for the PDP.\nThe Speaker was elected under controversial circumstances.\nRecall the leadership crisis that engulfed the Bauchi State House of Assembly in 2019 after 11 members out of 31 lawmakers elected Hon Suleiman as Speaker and this led to the emergence of a factional Speaker.\nThe House from the onset was dominated by the APC with 21 members, 8 members from the PDP and one member from the NNPP.\nWith the Speaker’s defection, there are now 16 members in the APC and 15 in the PDP."
  },
  {
    "headline": "Senator Akpanudoedehe declares for Akwa Ibom Gov race -",
    "summarized_story": "The Former National Secretary of the dissolved Caretaker/Extraordinary Convention Planning Committee (CECPC) of the ruling All Progressives Congress (APC) Senator John James Akpanudoedehe has joined the Akwa Ibom governorship race.\nHe promised to lead the State out of poverty, ensure even development and bring prosperity to his people.\nHe declared on Saturday at a grand reception to receive him to the State after his service as the National Secretary of the party’s CECPC at Ibom Hall, Uyo, Akwa Ibom.\nThe former CECPC Secretary accepted and agreed to carry the flag of the party at the 2023 governorship election in the State.\nAkwa Ibom APC chairman, Obong Augustine Ekanem, insisted the party was intact under his leadership and ready to take over government from the ruling Peoples Democratic Party (PDP) in the State."
  },
  {
    "headline": "2023 Presidency: Gov Yahaya Bello is APC’s best bet",
    "summarized_story": "The Yahaya Bello Presidential Campaign Organisation says the governor Yahaya Bello possesses all the attributes that can retain the presidency for the ruling All Progressives Congress in 2023.\nOf the pool of aspirants, as the country stands today, even across party lines, Governor Yahaya Bello is the best bet for the younger generation if this dream must be actualized.\nBeing the strongest contender from the region places Governor Bello in a vantage position to clinch the presidential ticket.\nTherefore, in terms of the main issues confronting the nation, Governor Yahaya Bello has excelled remarkably in Kogi State.\nThey will rally round Governor Yahaya Bello and retain the presidency with a wide margin come 2023.”"
  },
  {
    "headline": "APC Holds Maiden Post-Convention NEC Meeting on April 20, 2022 -",
    "summarized_story": "The All Progressives Congress (APC) National Working Committee (NWC) has called the maiden post-National Convention meeting of the National Executive Committee (NEC) to be held on Wednesday, 20th April, 2022.\nThe emergency NEC meeting which will take place at the Congress Hall of Transcorp Hilton Hotel in Abuja will commence at 10am.\n“Pursuant to Article 25.2.ii of the Constitution of the All Progressives Congress (APC), the National Working Committee (NWC) hereby invites members of the National Executive Committee (NEC) of our great Party to a meeting to consider the Party’s Timetable/Schedule of Activities for Primaries for the nomination of candidates for the 2023 General Elections and other relevant business of the Party.\n“All members of the NEC are by this invitation to take notice of the meeting in accordance with Article 12.3 of the APC Constitution, please,” the official notice/invitation for the NEC meeting stated."
  },
  {
    "headline": "APC holds Maiden post-convention NEC meeting April 20",
    "summarized_story": "The All Progressives Congress (APC) National Working Committee (NWC) has called the maiden post-National Convention meeting of the National Executive Committee (NEC) to be held on Wednesday, 20th April.The emergency NEC meeting which will take place at the Congress Hall of Transcorp Hilton Hotel in Abuja will commence at 10am.\nThis is contained in a statement issued on Friday by the party’s Publicity Secretary.\n“Pursuant to Article 25.2.ii of the Constitution of the All Progressives Congress (APC), the National Working Committee (NWC) hereby invites members of the National Executive Committee (NEC) of our great Party to a meeting to consider the Party’s Timetable/Schedule of Activities for Primaries for the nomination of candidates for the 2023 General Elections and other relevant business of the Party.\n“All members of the NEC are by this invitation to take notice of the meeting in accordance with Article 12.3 of the APC Constitution, please,” the official notice/invitation for the NEC meeting stated."
  },
  {
    "headline": "Higher Food Prices Drive Nigeria’s Inflation to 15.92%, Highest in 5 Months",
    "summarized_story": "Month on month, the headline index increased by 0.11 per cent to 1.74 per cent in March compared to 1.63 per cent in February.\nAccording to the statistical agency, month on month, food inflation was highest in Anambra with 3.78 per cent, followed by Niger with 3.60 per cent and Zamfara 3.31 per cent in the month under review.\nHowever, countrywide, the rise in the food index was caused by increases in prices of bread and cereals, food product, potatoes, yam and other tuber, fish, meat, oils and fats.\nMonth on month, the core sub-index stood at 0.98 per cent in March, down by 0.35 per cent compared to 1.33 per cent in February.\nYear on year, urban inflation increased to 16.44 per cent in March, showing a decline of 2.32 per cent compared to 18.76 per cent in 2021."
  },
  {
    "headline": "Kaduna Train Attack: Families of Abductees Plan to Resist Resumption of Train Services If Loved Ones Are Not Rescued",
    "summarized_story": "Families of some abductees on the Abuja-Kaduna train on Friday warned that they would resist any attempt to resume services on the route without rescuing their loved ones.\nThey also lashed out at the Minister of Transport, Rotimi Amaechi, for declaring for president days after the train attack, saying he was insensitive to the plight of the people and should resign.\nRelatedStories No Content AvailableJimoh warned the NRC against the proposed resumption of train services without first rescuing the kidnapped victims.\nHe said further that in the course of his discussions with them during the phone call, the terrorists told him that the state governor, (Nasir El-Rufai) had been running his mouth and that was why they came to his doorstep.\nAccording to Atta, the terrorists said the train attack was just the beginning and that they would go further than this."
  },
  {
    "headline": "Nigeria: 20 Days After, 68 Abducted Train Passengers Languish in Dungeon of Terrorists, Families Restless, Confused",
    "summarized_story": "One of the abducted family members, Aliyu Mohammed, who spoke in Abuja last Thursday, begged the terrorists to give room for families to negotiate the release of their loved ones.\n“They should try as much as possible to reach out to the perpetrators and rescue our loved ones.\nBut it’s now an opportunity and a window for the government to rescue our loved ones by opening a channel of communication with them (terrorists).\nWe are appealing to them to come out to open a channel of discussion with the bandits and get our loved ones out as quickly as possible.\nWe are like living corpses.”No fewer than 362 passengers were onboard the train at the time terrorists struck on March 28."
  },
  {
    "headline": "World Bank in Latest ‘Africa’s Pulse’ Projects 2.7% Growth for Nigeria in 2022",
    "summarized_story": "The World Bank in its latest Africa’s Pulse, a biannual analysis of the near-term regional macroeconomic outlook, has projected a 2.7% growth for Nigeria in 2022.\nOf the region’s three largest economies – Angola, Nigeria, and South Africa – onlyNigeria is projected to enjoy a fairly good growth in 2022.\nThe report said growth in South Africa is expected to decline by 2.8 percentage points in 2022, dragged by persistent structural constraints.\nResource-rich countries, especially their extractive sectors, will see improved economic performance due to the war in Ukraine, while non-resource rich countries will experience a deceleration in economic activity,” said the World Bank.\nIt said: Excluding Angola, Nigeria and South Africa, regional growth is projected at 4.1 per cent in 2022, and 4.9 per cent in 2023."
  },
  {
    "headline": "Twitter Adopts ‘Poison Pill’ Plan to Block Elon Musk From Increasing Stake",
    "summarized_story": "Twitter Inc. moved to prevent Elon Musk from significantly increasing his stake, a day after he unveiled a $43 billion unsolicited takeover bid for the social-media company.\nThe company on Friday adopted a so-called poison pill that makes it difficult for Mr. Musk to increase his stake beyond 15%.\nIt earlier confirmed it received Mr. Musk’s offer and is reviewing it.\nExisting Twitter shareholders supportive of Mr. Musk could also roll over their holdings into any deal.\nBut in a sign that Twitter’s investors overall appear less than enthusiastic over Mr. Musk’s bid, the company’s shares closed down nearly 2% Thursday at $45.08."
  }
]