[
  {
    "headline": "Surgeons transplant 3D ear made of living cells",
    "summarized_story": "The procedure involves 3D scanning the patient’s opposite ear to create a blueprint, then collecting a sample of their ear cartilage cells and growing them to a sufficient quantity.\nThese are then used to create a 3D-bioprinted, full-sized outer ear.\nBonilla said: “The AuriNovo implant requires a less invasive surgical procedure than the use of rib cartilage for reconstruction.\nFactors that can increase risk include diabetic mothers and a maternal diet that is lower in carbohydrates and folic acid.\nAbsent other conditions, children with microtia can develop normally and lead healthy lives – though they may have self-esteem issues."
  },
  {
    "headline": "Surgeons transplant 3D ear made of living cells",
    "summarized_story": "The procedure involves 3D scanning the patient’s opposite ear to create a blueprint, then collecting a sample of their ear cartilage cells and growing them to a sufficient quantity.\nThese are then used to create a 3D-bioprinted, full-sized outer ear.\nBonilla said: “The AuriNovo implant requires a less invasive surgical procedure than the use of rib cartilage for reconstruction.\nFactors that can increase risk include diabetic mothers and a maternal diet that is lower in carbohydrates and folic acid.\nAbsent other conditions, children with microtia can develop normally and lead healthy lives – though they may have self-esteem issues."
  },
  {
    "headline": "Monkeypox more deadly in patients with other ailments –Virologist",
    "summarized_story": "Lara AdejoroA Medical Virologist and Immunologist at the Adeleke University, Ede, Osun State, Dr. Oladipo Kolawole, has said that monkeypox is more deadly in patients with comorbidity.\nAccording to him, the virus can overwhelm patients with comorbidity and can lead to death.\n“The meaning is that the person’s immune system is immunocompromised, he cannot handle such infections.\nSo, the power of the virus will overwhelm the immune system of such an individual which may lead to death.\nTo prevent the monkeypox virus, experts urge members of the public to practice infection prevention and control measures that have proven to limit the spread of the infection."
  },
  {
    "headline": "Monkeypox more deadly in patients with other ailments –Virologist",
    "summarized_story": "Lara AdejoroA Medical Virologist and Immunologist at the Adeleke University, Ede, Osun State, Dr. Oladipo Kolawole, has said that monkeypox is more deadly in patients with comorbidity.\nAccording to him, the virus can overwhelm patients with comorbidity and can lead to death.\n“The meaning is that the person’s immune system is immunocompromised, he cannot handle such infections.\nSo, the power of the virus will overwhelm the immune system of such an individual which may lead to death.\nTo prevent the monkeypox virus, experts urge members of the public to practice infection prevention and control measures that have proven to limit the spread of the infection."
  },
  {
    "headline": "Kano: Ban on okada still in force – Police",
    "summarized_story": "The Kano State Police Command on Thursday, reminded residents of the state, especially, commercial motorcyclists that the recent ban on okada is still in force.\nHe said the ban became imperative in order to protect lives and property of the residents as some disgruntled elements used the motorcycles to commit crimes.\n“Any individual or group that violates the ban will be arrested and prosecuted before the court of law.\nRoad users are advised to abide by traffic rules and regulations.” the statement said.\nHe further said that the “Commissioner of Police appreciated the good people of the state for their prayers, encouragement, continuous support, and cooperation."
  },
  {
    "headline": "Why Nigerians need to ‘buga’ for President Buhari – Femi Adesina",
    "summarized_story": "Special Adviser to President Muhammadu Buhari on Media and Publicity, Femi Adesina says Nigerians need to ‘buga’ for his boss for properly representing the country in SpainBuga as used by Nigerians music star, Kiss Daniel, means to flaunt one’s effort, success or achievement.\nAdesina, in a statement entitled “VISIT TO SPAIN: LET’S BUGA FOR MR PRESIDENT”, narrated his experiences while he was with the president in Spain, particularly how the Nigerian leader met with some footballers in Madrid city.\nWhen Chairman of Nigerians in Diaspora Commission (NIDCOM), Abike Dabiri-Erewa, introduced Kenneth Omeruo, a Nigerian footballer playing professional soccer in Spain, the President said: “I know him.\nOur President did the country proud, represented well, and brought us glory.\nWe must ‘buga,’ and showcase our leader, no matter what those who cavil say”."
  },
  {
    "headline": "Police nab three suspected motorcycle robbers in Ondo",
    "summarized_story": "Three suspected robbers have been apprehended by men of the Ondo State Police Command after robbing a commercial motorcyclist of his motorcycle in the state.\nThe suspects, Victor Bright, 21, AbdulRahim Mohammed, 22, and Friday Emmanuel, 27, were arrested in Owo, for the crime.\nThey snatched a Boxer motorcycle and a phone from their victim.\nBright claimed the motorcycle and phone were sold for N130,000, with one of the suspects on the run.\n“The phone was tracked to the person we sold it to and that was how we were arrested."
  },
  {
    "headline": "Buhari congratulates UK’s Queen Elizabeth on Platinum Jubilee",
    "summarized_story": "President Muhammadu Buhari has congratulated Her Majesty Queen Elizabeth II on the occasion of her Platinum Jubilee.\nBuhari noted that the Queen is the first British monarch to reach seven decades on the throne.\n“People never lose trust in Queen Elizabeth.\n“It is confirmation of the fact that Queen Elizabeth always acts and delivers according to people’s expectations”, Buhari said.\nThe Nigerian leader, on behalf of the government and citizens, wishes her more years in excellent condition of health."
  },
  {
    "headline": "Blasphemy: Why PDP gave presidential ticket to ‘supporter of murderers’ – Catholic Priest, Fr Kelvin",
    "summarized_story": "Fr Kelvin Ugwu, a Nigerian Catholic Priest serving in Malawi, has alleged that the Peoples Democratic Party, PDP, gave its presidential ticket to someone who supported the killing of Deborah Samuel.\nDeborah, a female student in Sokoto State was lynched over alleged blasphemy against Prophet Mohammed last month.\nDAILY POST recalls that the former Vice President, Atiku Abubakar, who clinched the PDP presidential ticket, had trended on social media for pulling down posts on his handles which condemned the killing.\nFr Kelvin, in a post on his verified Facebook page on Thursday, described the main opposition party as evil for giving Atiku its presidential ticket.\nWhat PDP did was to reward a supporter of murderers as their flag bearer."
  },
  {
    "headline": "Akeredolu: why APC must rotate power to retain power",
    "summarized_story": "In a post on his Facebook page, he said: “APC must work to retain power.\nThe former Lagos State governor advised the delegates against jettisoning sound judgment and track records at the convention by turning it into a “family affair”.\n“This is me telling you between my life and God Almighty, Buhari called me to be his Vice President.\nOyo State delegates are for Asiwaju, our leader.\nThe former governor also assured Tinubu of his maximum support and that of the people of Oyo State."
  },
  {
    "headline": "WHO predicts 94% reduction in Africa’s COVID-19 deaths",
    "summarized_story": "The World Health Organisation (WHO) has predicted a 94 per cent decrease in COVID-19 deaths in Africa compared to 2021.\nHowever, a variant that is 200 per cent more lethal, would cause an increase in deaths to more than 70,000.\nThe analysis estimates that COVID-19 was the seventh major cause of death in Africa in 2021, just below malaria.\n“Now is the time to refine our response and identify populations most at-risk of COVID-19,” the WHO official said.\n“Countries must intensify efforts to conduct a targeted response that provides the most vulnerable people with the health services they need, including COVID-19 vaccines and effective treatment.”"
  },
  {
    "headline": "We pay N100 each at 98 bus stops, say Badagry drivers",
    "summarized_story": "We pay N100 each at 98 bus stops, say Badagry driversCommercial bus drivers plying the Seme Border to CMS route in Lagos have complained about extortion from transport unions, military and para-military officials.\nThey accused these officials of extorting N100 from each of their buses at each of the over 98 bus stops on that route, claiming that they are forced to cough up between N17,500 and N22,000 in illegal fees, daily.\nThey lamented that this is separate from the official N800 levy drivers in the state pay to the Lagos State Government.\nConferring an honour of Life Matron on Odumakin, they solicited her help against what they termed incessant extortion.\nThe associations, comprising Ibile Drivers Welfare Association of Nigeria, Mega-City Drivers Welfare Association, Federal Mass Drivers Association and Korope Drivers Association, met Odumakin at her Ikeja, Lagos office."
  },
  {
    "headline": "APC names sub-committees for convention",
    "summarized_story": "An Wednesday night, the APC announced in a statement by its National Publicity Secretary, Felix Mouka, the constitution of sub-committees for its special convention which will end May 8.\nLagos State Governor Babajide Sanwo-Olu heads the Finance and Logistics sub-committee; Ogun State Governor Dapo Abiodun, Accreditation and Decoration; and Gombe State Governor Muhammadu Yahaya, Budget.\nPlateau State Governor Simon Lalong and Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Farouq are in charge of Hospitality and Welfare sub-committee.\nThe Presidential Screening Appeal sub- committee has Niger State Governor Abubakar Bello and Deputy Speaker of the House of Representatives.\nAhmed Wase as coordinators while Deputy Senate President Ovie Omo-Agege and Minister of Foreign Affairs Geoffery Onyeama head the Accreditation of Diplomats sub-committee."
  },
  {
    "headline": "New investor takes over Union Bank",
    "summarized_story": "A gale of change yesterday swept through the management and board of Union Bank of Nigeria (UBN) Plc.\nIts chairman, chief executive officer and eight other non-executive directors were retired by the bank’ new core investor – Titan Trust Bank (TTB) Limited.\nTGI Group Executive Director Farouk Gumel was appointed UBN Chairman.\nHe doubles as Chairman of Wacot Rice Ltd, a subsidiary company of TGI Group, and a non-executive chairman at the Nigeria Sovereign Investment Authority (NSIA).\nThree other non-executive directors – Mr. Andrew Ojei, Alhaji Abubakar Mohammed and Mr. Lawrence Mackombo were also appointed to the board of UBN."
  },
  {
    "headline": "Troops eliminate 14 terrorists, arrest 15, rescue 100 family members",
    "summarized_story": "The Defence Headquarters, yesterday, said that troops of Operation Hadin Kai had, in the past two weeks, eliminated 14 terrorists and arrested 15 others.\nHe said that 100 family members of terrorists in the North East, comprising 33 women and 67 children, were also rescued by the troops.\nHe said the terrorists fled in disarray due to the superior fire power of the troops and abandoned their properties and family members.\nThe defence spokesperson further said that troops also recovered a dump truck belonging to the Borno State Road Maintenance Agency.\nOnyeuko said further that troops on patrol in Ashigashiya, Kodele, and Apagaluwa in Gwoza Local Government Area, encountered terrorist-herders, who engaged the former in a fierce gun battle."
  },
  {
    "headline": "Kalu appointed DG of Lawan Campaign Organisation",
    "summarized_story": "The Ahmad Lawan Central Campaign Organisation has announced the Chief Whip of the Senate, Sen. Orji Kalu as its Director-General ahead of the 2023 general elections.\nHe added that the campaign organisation would ultimately lead Lawan to victory in the general election.\nChairmen of eight committees of the Campaign Organisation are Auwal Lawan, Chairman, Finance and Budget and Senator Sani Musa, co-chairman, Strategy and Planning, Senator Ikechukwu Obiora, chairman, and Senator Betty Apiafi, deputy chairman.\nSen. Aliyu Sahabi Abdullahi and Femi Fani Kayode would serve as chairman and deputy chairman of Media and Publicity, respectively.\nSecurity and Intelligence has Mallam Lawal Daura–Chairman and Commodore Mohammed Barau (retd) as deputy chairman."
  },
  {
    "headline": "South East senators endorse Ekwunife Minority Leader",
    "summarized_story": "From Fred Itua, AbujaSouth East senators have endorsed Uche Lilian Ekwunife to replace Enyinnaya Abaribe as Minority Leader of the upper legislative chamber.\nIn a letter addressed to the national chairman of the Peoples Democratic Party (PDP), Iyorchia Ayu, PDP senators from the zone explained why they settled for her.\nThe letter signed by PDP lawmakers from the geopolitical zone, read: “Please, accept the warm compliments from senators of the South East Zone as we congratulate you on the successful and well organised primaries and national convention of our great party.\n“Following the resignation of our Senate Minority Leader, Enyinnaya Abaribe from the Peoples Democratic Party PDP last week, we the underlisted PDP senators of the South East zone hereby nominate Uche Lilian Ekwunife as a replacement for Senator Enyinnaya Abaribe as the position was zoned to the South East.\n“Sir, recall that in February 2022, following the defection of former Deputy Minority Leader Senator Emmanuel Bwacha (Taraba South) from the Peoples Democratic Party (PDP) to All Progressives Congress (APC), the North East minority caucus met immediately and nominated Senator Shuaibu Isa Lau (Taraba North) from the same Zone es the new Deputy Minority Leader."
  },
  {
    "headline": "Alleged N80bn fraud: EFCC releases suspended Accountant General",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has released the suspended Accountant General of the Federation, Ahmed Idris, from its custody.\nThe spokesperson for the EFCC, Wilson Uwujaren, who confirmed the development yesterday, said that Idris was released on administrative bail.\n“Yes, he (Mr Idris) has been released on bail,” Mr Wilson said in a terse message sent to Daily Sun.\nOn May 16, Idris was arrested by the EFCC over alleged diversion and laundering of N80 billion.\nThe companies used in laundering the funds have allegedly been linked to family members and associates of the accountant-general, investigators said."
  },
  {
    "headline": "Why I dropped my governorship ambition –Ekweremadu",
    "summarized_story": "From Magnus Eze, EnuguFormer deputy president of the Senate, Ike Ekweremadu, yesterday, dropped his 2023 governorship ambition for Enugu State.\nEkweremadu in a statement, entitled: ‘Time to unite’, congratulated the Enugu State governorship candidate of the Peoples Democratic Party (PDP), Peter Mba, and wished him success in the forthcoming election.\nEkweremadu, however, noted that his team was determined to transform Enugu State if they had emerged victorious.\nEkweremadu said: “It is time to review this journey and take a well-considered decision for the unity of our state.\nYou have expressed to me individually and collectively, your readiness to take a long journey with me to actualise our vision by whatever platform."
  },
  {
    "headline": "Tinubu: I Made Buhari President, Osinbajo VP, Abiodun Governor",
    "summarized_story": "*Speaks on why he did not emerge as Buhari’s running mate in 2015*Says he surrendered his right to be VP to OsinbajoJames Sowole in AbeokutaThe National Leader of the All Progressives Congress (APC).and presidential aspirant, Asiwaju Bola Tinubu, Thursday spoke on the emergence of President Muhammadu Buhari, and Vice President Yemi Osinbajo in 2015 and Ogun State Governor Dapo Abiodun in 2019.\n“This is me telling you between my life and God Almighty, Buhari called me to be his Vice President.\nHe said because the first time he contested, he picked Okadigbo, flamboyant, Catholic, but Nigerians didn’t vote for him.\n“And I told them that I have a candidate that is a Christan that I can nominate so that the party will not break, that was how I nominated Vice President Yemi Osinbajo.\n“I was asked to submit three names, Yemi Cardozo, Wale Edun and Yemi Osinbajo, but I said that if I submitted three names, it is like open your door, for a thief."
  },
  {
    "headline": "FG: Disagreements Among Concessioners Delaying Take-off of $3.1bn e-Customs Project",
    "summarized_story": "According to the minister: “The e-Customs project was approved by Council.\nAnd there were some challenges that had to do with disagreements among the concession partners.\nAli reportedly said the e-Customs concession project would ease the cost of doing business, boost revenue, enhance productivity and stop every arbitrariness in the service.\nAlso, Ahmed disclosed plan by the federal government to address rising cost food prices across the country as it plans to convene a meeting of the National Food Security Council shortly.\n“There is also the supply of drugs and medical equipment for police hospitals across the country at the cost of N2 billion."
  },
  {
    "headline": "Presidency: APC Still Divided on Zoning, Mulls Options to Face Atiku",
    "summarized_story": "Interestingly, the development, has pushed the party leadership to consider the reopening of sales of Expression of Interest and Nomination forms to more members by way of broadening its choices for a suitable presidential candidate, that would secure the confidence of the people and lead the party to victory.\nThe APC was first thrown into confusion, when Atiku emerged candidate of the PDP at a keenly contested presidential primaries in Abuja, a situation, which completely unsettled the thinking and extrapolations in the ruling party.\nUnfortunately, the confusion was further accentuated on Monday, when President Muhammadu Buhari, at a meeting with the 22 governors of the party and Adamu, pleaded with the stakeholders to let him choose his successor as a sign of reciprocity.\nHe, therefore, enjoined them all to let him too enjoy same privileges through “reciprocity” of similar action, to choose his successor at the proposed June 6 presidential primaries.\nBut since this new thinking was thrown into the mix by the president, the leadership of the party, including the governors, as major stakeholders, had started pondering the options opened to them and particularly, lead them to victory."
  },
  {
    "headline": "Atiku Receives Certificate of Return, Says There is Much to Be Done",
    "summarized_story": "According to Atiku who spoke on his victory at the convention, “we should not take that or their defeat for granted.\nThe main contest is the one to win the presidency of our country for our party.\n“It will require the entire PDP family and other supporters and sympathisers.\n“Rather within the PDP family, we had a minor contest, a small contest within the family.\nThe visit was barely 24 hours that Atiku visited Wike in company of some PDP officials."
  },
  {
    "headline": "News in Photographs: Osinbajo Presides over FEC Meeting",
    "summarized_story": "Vice President Yemi Osinbajo Wednesday presided over the weekly Federal Executive Council meeting.\nThe meeting held at the Council Chamber was attended by some cabibet members while others joined the meeting virtually from the various offices.President Muhammadu Buhari is currently on a visit to Spain.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Would Have Lost Presidential Election Fourth Time In 2015 If Not For Me – Tinubu",
    "summarized_story": "One of the presidential aspirants of the All Progressives Congress (APC) and former Lagos State governor, Bola Tinubu, says he led a political struggle that produced President Muhammadu Buhari in 2015.\nHe spoke at presidential lodge in Abeokuta, the state capital, while addressing the APC delegates ahead of the party’s primaries.\nSpeaking on Buhari’s emergence, he said “If not me that led the war front, Buhari wouldn’t have emerged.\nHe told Tinubu that delegates from the state would do “the right thing” at the convention.\nAbiodun described Tinubu as a political warrior, serial winner and strategist."
  },
  {
    "headline": "Buhari Would Have Lost Presidential Election Fourth Time In 2015 If Not For Me – Tinubu",
    "summarized_story": "One of the presidential aspirants of the All Progressives Congress (APC) and former Lagos State governor, Bola Tinubu, says he led a political struggle that produced President Muhammadu Buhari in 2015.\nHe spoke at presidential lodge in Abeokuta, the state capital, while addressing the APC delegates ahead of the party’s primaries.\nSpeaking on Buhari’s emergence, he said “If not me that led the war front, Buhari wouldn’t have emerged.\nHe told Tinubu that delegates from the state would do “the right thing” at the convention.\nAbiodun described Tinubu as a political warrior, serial winner and strategist."
  },
  {
    "headline": "Buhari Would Have Lost Presidential Election Fourth Time In 2015 If Not For Me – Tinubu",
    "summarized_story": "One of the presidential aspirants of the All Progressives Congress (APC) and former Lagos State governor, Bola Tinubu, says he led a political struggle that produced President Muhammadu Buhari in 2015.\nHe spoke at presidential lodge in Abeokuta, the state capital, while addressing the APC delegates ahead of the party’s primaries.\nSpeaking on Buhari’s emergence, he said “If not me that led the war front, Buhari wouldn’t have emerged.\nHe told Tinubu that delegates from the state would do “the right thing” at the convention.\nAbiodun described Tinubu as a political warrior, serial winner and strategist."
  },
  {
    "headline": "BREAKING: Jubilation As Appeal Court Affirms Sowore As Substantive AAC Chairman, Sacks Impostor, Nzenwa",
    "summarized_story": "An Appeal Court sitting in Abuja has affirmed that human rights activist and presidential aspirant, Omoyele Sowore, is the substantive Chairman of the African Action Congress (AAC).\nSowore had in an appeal marked CA/A/812/2019 challenged a High Court judgment delivered by Justice Inyang Ekwo declaring a Nigerian government usurper, Leonard Nzenwa, as the Acting Chairman of the party.\nThe court therefore set aside the judgment of the lower court recognising Nzenwa as acting Chairman.\nThe court further awarded the sum of N200,000 damages against Nzenwa in favour of Sowore.\nIt would be recalled that Nzenwa secretly obtained a judgment from the FCT High Court on June 19, 2019, to the effect that Sowore had been suspended as the National Chairman of the party alongside Deputy National Chairman, Dr. Malcom Fabiyi."
  },
  {
    "headline": "BREAKING: Jubilation As Appeal Court Affirms Sowore As Substantive AAC Chairman, Sacks Impostor, Nzenwa",
    "summarized_story": "An Appeal Court sitting in Abuja has affirmed that human rights activist and presidential aspirant, Omoyele Sowore, is the substantive Chairman of the African Action Congress (AAC).\nSowore had in an appeal marked CA/A/812/2019 challenged a High Court judgment delivered by Justice Inyang Ekwo declaring a Nigerian government usurper, Leonard Nzenwa, as the Acting Chairman of the party.\nThe court therefore set aside the judgment of the lower court recognising Nzenwa as acting Chairman.\nThe court further awarded the sum of N200,000 damages against Nzenwa in favour of Sowore.\nIt would be recalled that Nzenwa secretly obtained a judgment from the FCT High Court on June 19, 2019, to the effect that Sowore had been suspended as the National Chairman of the party alongside Deputy National Chairman, Dr. Malcom Fabiyi."
  },
  {
    "headline": "Saudi Arabia launches e-service for umrah pilgrims to get visas in 24 hours",
    "summarized_story": "The kingdom of Saudi Arabia says it has launched an electronic service for the issuance of visas to umrah pilgrims within 24 hours.\nWith the launch, Muslims from countries outside Saudi Arabia planning to attend umrah can now individually apply for the visa through a designated web service.\nAdvertisementTawfiq added that “the visit visa for Umrah will be issued now within 24 hours”.\nHe said pilgrims who visit the kingdom to perform umrah can also visit other Saudi cities without any restraints.\nAdvertisement#VIDEO: Minister of #Hajj and Umrah Dr. @tfrabiah announced the launching of an electronic service to apply for #Umrah visa for individual Umrah pilgrims from outside #SaudiArabia."
  },
  {
    "headline": "Saudi Arabia launches e-service for umrah pilgrims to get visas in 24 hours",
    "summarized_story": "The kingdom of Saudi Arabia says it has launched an electronic service for the issuance of visas to umrah pilgrims within 24 hours.\nWith the launch, Muslims from countries outside Saudi Arabia planning to attend umrah can now individually apply for the visa through a designated web service.\nAdvertisementTawfiq added that “the visit visa for Umrah will be issued now within 24 hours”.\nHe said pilgrims who visit the kingdom to perform umrah can also visit other Saudi cities without any restraints.\nAdvertisement#VIDEO: Minister of #Hajj and Umrah Dr. @tfrabiah announced the launching of an electronic service to apply for #Umrah visa for individual Umrah pilgrims from outside #SaudiArabia."
  },
  {
    "headline": "Tinubu: If not for me, Buhari wouldn't have become president in 2015",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC) and presidential hopeful, says without him, President Muhammadu Buhari wouldn’t have won the presidential election in 2015.\nDescribing the election as a “battle”, Tinubu also spoke on how he “surrendered” the vice-presidential ticket to Yemi Osinbajo, when concerns were raised over a Muslim-Muslim ticket for the APC.\n“Buhari asked me to be his running mate, but Saraki campaigned against a Muslim-Muslim ticket.\nWale Edun was number two, Yemi Osinbajo was number three.\n“If not for me that led the battlefront, Buhari wouldn’t have won."
  },
  {
    "headline": "Tinubu: If not for me, Buhari wouldn't have become president in 2015",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC) and presidential hopeful, says without him, President Muhammadu Buhari wouldn’t have won the presidential election in 2015.\nDescribing the election as a “battle”, Tinubu also spoke on how he “surrendered” the vice-presidential ticket to Yemi Osinbajo, when concerns were raised over a Muslim-Muslim ticket for the APC.\n“Buhari asked me to be his running mate, but Saraki campaigned against a Muslim-Muslim ticket.\nWale Edun was number two, Yemi Osinbajo was number three.\n“If not for me that led the battlefront, Buhari wouldn’t have won."
  },
  {
    "headline": "Osinbajo meets Adamu, five APC governors in Aso Rock",
    "summarized_story": "Vice-President Yemi Osinbajo, on Thursday, met with Abdullahi Adamu, the national chairman of the All Progressives Congress (APC).\nAlso on Thursday, five APC governors met with Osinbajo at his residence in the presidential villa, Abuja.\nOsinbajo’s meeting with the APC chairman and the governors, comes ahead of the party’s convention to select its presidential candidate for the 2023 elections.\nPresident Muhammadu Buhari had, before travelling to Madrid, Spain on official visit, met with the 22 governors of the APC, where he sought their support to choose his successor.\nAdvertisementOsinbajo’s meeting with Adamu and the governors also comes after the conclusion of the party’s screening exercise for presidential hopefuls by the John Oyegun-led committee."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Appetito buys Lamma to expand into Tunisia, Morocco, and West Africa",
    "summarized_story": "We’re 12 months ahead of our plan to expand in Africa,” Mokhtar said in the statement.\nBoth companies have already begun to train staff together, Lamma co-founder and CEO Yassir El Ismaili El Idrissi told TechCabal on a call.\nAppetito co-founders and Lamma co-founder, Yassir El Ismaili El Idrissi.\nWith the addition of Rabat and the Greater Tunis area, it appears that the new Appetito already has its hands full.\nEl Idrissi, the Lamma co-founder who will be joining Appetito to lead its growth and expansion, says the firm will focus on consolidating in the markets it is already operating in."
  },
  {
    "headline": "Patricia’s CEO on taking risks and building for impact",
    "summarized_story": "He’d received a gift card worth ₦30,000 (~$73), in 2015, from his uncle in the US, in lieu of a monthly allowance.\nNeeding to exchange the gift card for cash, he went online to transact with a gift card exchange, only to fall victim to a scam.\nGift card scams are commonplace: users are asked to disclose the card’s number, unwittingly granting the scammer access to its funds.\nFor the next 2 years, from 2017 through 2018, Patricia would operate as a gift card exchange.\nIn 2019, Fejiro transitioned Patricia from gift card exchanging to a line that he found to be blossoming in popularity and demand: crypto trading."
  },
  {
    "headline": "Even after a $10,000 loss, this crypto trader found a gem in the crypto space, and she’s never letting go",
    "summarized_story": "This is what an expert crypto trader who identifies simply as Ademi asks anyone who wants to make money from crypto.\nEven after losing $10,000, she still sticks to crypto trading as a career.\nStarting with the 2017 bull marketPhoto by CardMapr.nl on UnsplashA crypto bull market is a time when the value of crypto assets keeps rising.\nHowever, a bear market — what comes at the end of a bull market — is what separates the newbies from the experts.\nHowever, just as Bitcoin reached the $20,000 limelight, it was followed by a 30% drop that bloodied the entire crypto market."
  },
  {
    "headline": "Talk360’s $4 million seed",
    "summarized_story": "Today, I’ll be discussing:How Victoria Fabunmi helps founders get capitalTalk360’s $4 million seedAppetito’s acquisitionHow Victoria Fabunmi helps founders get capitalVictoria Fabunmi.\nIf you want to understand how the Venture Capital market works, look for his story every Wednesday at 12 p.m. WAT!\nPerhaps you’re wondering how to get started in venture capital; wonder no more!\nCheck them out here: How Victoria Fabunmi helps startup founders get capital to drive growthTalk360’s $4 million seedTalk360, South Africa’s international calling platform, had announced a $4 million seed round.\nThe company wants to use some of its funding to build its own payment platform to make payment and checkout easier for its African users."
  },
  {
    "headline": "[PODCAST] An NFT marketplace for creatives",
    "summarized_story": "Techpoint Africa is too.\nAyoken is an NFT marketplace for creatives to increase their earnings.\nHenry-Coco Bassey feels such a product is great for creatives as they could make more money from their art.\nProdigeezy, who helps BNXN manage his NFT collection, shares the same opinion but points out that it is not yet mainstream, potentially impacting income for creatives.\nFor more on these stories, tune in to the Techpoint Africa Podcast on Spotify, Google Podcast, Apple Podcast, and any podcast platform you use."
  },
  {
    "headline": "Vault Hill debuts its NFT marketplace with the public sale of metaverse land",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain-based company, Vault Hill, has launched its NFT marketplace with the public sale of land in its human-centric metaverse, Vault Hill City (VHC).\nAs part of the land sale, a free HTC VIVE Flow VR glasses will be given per parcel of land bought.\nThe VHC land parcels are Non-Fungible Tokens (NFTs) built on the Ethereum blockchain (ERC-721) which are unique and distinct.\nIt is also the first virtual world with urban planning and development benefits to ensure users build on their virtual land respectfully.\nFurther information regarding the land sale can be found here and the metaverse development timeline can be viewed in the whitepaper."
  },
  {
    "headline": "Adaverse Backs Cassava Network With A Seed Investment To Empower African Content Creators",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\n“EMURGO Africa is excited to support the development of Cassava Network’s innovative content rewards ecosystem.\nTo apply for funding at Adaverse, visit www.adaverse.coBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Missing Crown: Prosecution Counsels Express Fear Over Magistrate’s Neutrality – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Prosecution counsels in the case involving Chief Ayirimi Emami and the Commissioner of Police have expressed lack of confidence on the neutrality of the Magistrate trying the matter at the Warri South Magistrate Court.\nThe aggrieved counsels consequently want the case to be tried by another Magistrate in the court alleging bias by the presiding Magistrate Ejiro Diejomaoh (Mrs).\nThis application was vehemently opposed by the defence counsel, Chief Otomewo arguing that there was no provision for the use of Statement on Oath at the Magistrate’s Court.\nIt is also on record that the Magistrate had never recorded Chief Ariyo as a Chief even though Chief Ariyo announces himself as such.\nThe Prosecution counsels, however, said that they had tried to distinguish between an objection arising from the lack of neutrality of a court and other forms of objection."
  },
  {
    "headline": "Obaseki strengthens ties with German govt for investments in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, is in talks with key Ministries, Department and Agencies (MDAs) of the German Government to discuss areas of mutual collaboration, highlighting untapped investment opportunities in different sectors of the state’s economy, including agriculture, healthcare, technology and education, among others.\nThe series of meetings being held in Germany are facilitated by GIZ-Skye, aimed at strengthening existing partnerships between the two governments in job creation, youth development, arts and culture as well as investments in industries and the productive sector.\nThe governor also met with the Association of German Chambers of Industry and Commerce (DHK) to discuss areas of partnership for investment and employment promotion in Edo State.\nHe is expected to be meeting with senior officials of the German government to foster relations between Edo State and Germany.\nObaseki’s visit to Germany is the latest of the series of investment trips embarked on by the Governor to attract investments into the state to grow its economy."
  },
  {
    "headline": "FIDA Edo marks week, pushes for end to GBV – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The International Federation of Female Lawyers (FIDA), Edo State Branch has kicked against gender based violence (GBV), as statistics from the Directorate of Public Prosecution (DPP) showed that of its 1,059 cases in court, 205 pertained to GBV cases with 4-10 of such cases originating from Police case files.\nDeclaring the FIDA week open which ran with the theme, “Changing the narrative of gender based violence: A multidimensional approach, “Chief Judge, Edo State, Hon.\nJustice Joe Acha represented by Justice Geraldine Ono Imadegbelo said violence against women, girls and children should be treated under the violence against persons prohibition (VAPP) Law.\nEarlier in her welcome address to stakeholders, legal luminaries and representatives of organizations, CSO’s, NGO’s and the media at the FIDA occasion, Chairperson Edo FIDA, Mrs. Violet Oghogho Olumese stated that apart from counselling and rendering Pro bono services to indigents, FIDA was poised to change the narrative in incidents of GBV through reliance on the VAPP Law as domesticated in Edo State in 2021.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo IRS,Security Agencies set to embark on Vehicle Verification Exercise – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State lnternal Revenue Service in conjunction with relevant Security Agencies has concluded plan to embark on motor Vehicle particulars verification exercise soon.\nA Statement signed by Abu Sadat, Acting Head, Edo State lnternal Revenue Service and made available to The NIGERIAN OBSERVER in Benin City yesterday noted that the exercise would hold across the State and federal government ministries, Departments and Agencies ( MDAs).\n” We will need your support in this regard by informing your Staff to update their Vehicle documentation”,the statement addedWhile soliciting for the maximum cooperation of those concerned, the release further hinted that the exercise would be needed to make Edo State motorists fully compliant with motor vehicle Administration law, adding that the exercise may be carried out on private vehicles in the respective Government MDAs premises.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "CBN effects review of inter-bank settlement system, others",
    "summarized_story": "The Central Bank of Nigeria (CBN) has reviewed the operations of the Nigeria Inter-Bank Settlement System (NIBSS) and other electronic payment operations.\nMusa Jimoh, Director, Payments System Management Department of the bank disclosed this in a circular.\nJimoh stated that the review was in furtherance of a 2014 circular on the subject.\nHe added that banks should adhere to Multiple Factor Authentication for “highly secured’’ online funds transfer.\n“They should inform and educate customers on the use of indemnity to increase transaction limits where applicable,’’ he stated."
  },
  {
    "headline": "Orji Kalu, Fani-Kayode, Obiora shun Southern presidency lead Ahmad Lawan campaign team",
    "summarized_story": "Barau Jibrin, a senator, is the head of Contact and Mobilisation, while Peter Nwaoboshi, also a senator, will function as the deputy chairman.\nAliyu Sahabi Abdullahi, a senator and Femi Fani-Kayode will serve as chairman and deputy chairman of Media and Publicity respectively.\nSecurity and Intelligence has Lawal Daura–chairman and Mohammed Barau , a retired navy commodore, as deputy chairman.\nTransport and Logistics has Bello Mandiya, a senator as chairman while Hillary Bisong is the deputy Chairman.\nThe APC presidential primary holds between June 6 and 8."
  },
  {
    "headline": "Fallout of EU ban on Russian oil: OPEC to increase output",
    "summarized_story": "Adebayo ObajemuThe ongoing Russian military campaign in Ukraine has further rocked global economy with devastating effect.\nOPEC made the announcement at its 29th OPEC and non-OPEC ministerial meeting, according to a statement released by the organisation on Thursday.\nThe meeting emphasized the significance of stable and balanced markets for both crude oil and refined productsOn Monday, the EU said it has agreed to ban 90 per cent of Russian oil imports by the end of the year as part of sanctions for Russia’s invasion of Ukraine.\nAccording to OPEC statement on Thursday, the organization affirmed it has decided to reiterate the decision of the 10th OPEC and non-OPEC Ministerial meeting on 12 April 2020 and further endorsed in subsequent meetings, including the 19th OPEC and non-OPEC Ministerial Meeting on 18 July 2021.\nCompensation plans should be submitted in accordance with the statement of the 15th OPEC and non-OPEC Ministerial Meeting."
  },
  {
    "headline": "CR7’s Portugal stage comeback to draw Spain in Nations League opener",
    "summarized_story": "Portugal and Spain settled for a 1-1 draw in their opening match of the European Nations League on Thursday, with Alvaro Morata’s first-half finish was cancelled out by a late equaliser from Ricardo Horta.\nA 1-1 draw means neither of the two favourites in Group A2 claim the early advantage, with games against Switzerland and Czech Republic to come.\nSpain play the Czechs in Prague on Sunday while Portugal are at home to Switzerland.\nSpain took the lead in the 25th minute and it came from a Portugal attack, as Joao Cancelo’s attempted flick left the ball loose and Gavi raced to intercept.\nThe teenager drove past the half-way line and with options ahead of him, slipped the pass right, Morata letting it run for Pablo Sarabia outside him and continuing on into the box."
  },
  {
    "headline": "Without me Buhari would not be president, he’d contested several times, lost and cried – Tinubu",
    "summarized_story": "Former governor of Lagos State, Bola Ahmed Tinubu, has said President Muhammadu Buhari would not have become president of Nigeria in 2015 without his support.\nTinubu, an All Progressives Congress (APC) presidential hopeful, noted that President Buhari, prior to 2015 had contested for president several times and lost.\nThe former governor who spoke to APC delegates in Abeokuta, Ogun State on Thursday, said, “If not for me that led the war front, Buhari won’t have emerged.\nHe contested first, second and third times, but lost.\n“I don’t want them to just mention me in history books for nothing,” Mr Tinubu said."
  },
  {
    "headline": "Bauchi Gov Re-appoints Kashim As SSG Days After Stepping Down As Gov’ship Candidate",
    "summarized_story": "Bauchi State governor, Bala Mohammed, has reappointed Barrister Ibrahim Mohammed Kashim as the Secretary to the Bauchi State Government (SSG).\nThe reappointment of Barrister Kashim followed his decision to withdraw step down as the state’s governorship candidate of the People’s Democratic Party (PDP) for the 2023 elections.\nKashim had emerged as the governorship flag bearer of the party in Bauchi a week ago at the party’s governorship primaries as an unopposed governorship aspirant of the PDP.\n“His reappointment was informed by his track record of sincerity, loyalty, commitment and wealth of experience in the discharge of assigned responsibilities,” the statement reads in part.\nLEADERSHIP recalls that two days ago, Barrister Kashim announced his decision to step down as governorship candidate, prompting PDP in the State to announce plans to conduct another governorship primary election."
  },
  {
    "headline": "Bauchi Gov Re-appoints Kashim As SSG Days After Stepping Down As Gov’ship Candidate",
    "summarized_story": "Bauchi State governor, Bala Mohammed, has reappointed Barrister Ibrahim Mohammed Kashim as the Secretary to the Bauchi State Government (SSG).\nThe reappointment of Barrister Kashim followed his decision to withdraw step down as the state’s governorship candidate of the People’s Democratic Party (PDP) for the 2023 elections.\nKashim had emerged as the governorship flag bearer of the party in Bauchi a week ago at the party’s governorship primaries as an unopposed governorship aspirant of the PDP.\n“His reappointment was informed by his track record of sincerity, loyalty, commitment and wealth of experience in the discharge of assigned responsibilities,” the statement reads in part.\nLEADERSHIP recalls that two days ago, Barrister Kashim announced his decision to step down as governorship candidate, prompting PDP in the State to announce plans to conduct another governorship primary election."
  },
  {
    "headline": "JUST-IN: Osinbajo Meets APC Chair, Govs",
    "summarized_story": "Vice-President Yemi Osinbajo, is currently meeting with the national chairman of the All Progressives Congress (APC), Abdullahi Adamu, and five governors of the party on Thursday night.\nThe meeting is taking place at the presidential villa, Abuja.\nLEADERSHIP gathered that the meeting may not be unconnected to the party’s presidential primary election slated for Monday next week.\nRecall that President Muhammadu Buhari met with the governors on Tuesday before travelling to Spain for a State visit.\nThe President is also expected to meet with the APC governors on return from the trip on Friday in order to arrive at a consensus ahead of the special national convention of the party."
  },
  {
    "headline": "JUST-IN: Osinbajo Meets APC Chair, Govs",
    "summarized_story": "Vice-President Yemi Osinbajo, is currently meeting with the national chairman of the All Progressives Congress (APC), Abdullahi Adamu, and five governors of the party on Thursday night.\nThe meeting is taking place at the presidential villa, Abuja.\nLEADERSHIP gathered that the meeting may not be unconnected to the party’s presidential primary election slated for Monday next week.\nRecall that President Muhammadu Buhari met with the governors on Tuesday before travelling to Spain for a State visit.\nThe President is also expected to meet with the APC governors on return from the trip on Friday in order to arrive at a consensus ahead of the special national convention of the party."
  },
  {
    "headline": "It’s My Turn, I’m Tired Of Serving People, Tinubu Tells Ogun Delegates",
    "summarized_story": "Vice President Yemi Osinbajo, a fellow presidential aspirant of the APC, hails from Ogun State.\nThe APC national leader recalled that he had supported several Nigerian politicians to actualise their political ambition, citing President Muhammadu Buhari as one of such he supported.\nEven President Buhari wouldn’t have won that presidential election in 2015 after three unsuccessful attempts without my support”.\n“Since President Buhari assumed office, I have not accepted any ministerial or Ambassadorial position.\nDon’t make it a family affairs o,” Tinubu admonished the delegates."
  },
  {
    "headline": "Tinubu’s TV station Deletes poll after Nigerians rated Osinbajo ahead of him",
    "summarized_story": "Ahead of the presidential primary of the ruling All Progressive Congress, APC, a now-deleted poll conducted by TVC, a Nigeria-based broadcast outlet, tipped Vice President Yemi Osinbajo as the favourite for the party’s ticket.\nAfter 1,721 people had voted, with Osinbajo leading with 43%, followed by Tinubu with 40%, Amaechi with 8%, and Lawan with 9% of the total votes cast, the tweet was deleted, Quest Times reported.\nIn related news, a Twitter handle “BiggDaaddyy1” known to be a dogged follower of the Asiwaju camp, and who was simultaneously hosting a Twitter space, had to delete his poll which asked: “Refusing Bola Tinubu APC ticket is a betrayal; YES or NO?”.\nA total of 1,763 people voted; 73 voted NO and only 27% voted YES.\nThis is not the first time the Vice President will defeat his opponents in an opinion poll, Quest Times reported."
  },
  {
    "headline": "BREAKING: APC Presidential Primary: Tinubu, Sanwo-Olu, Ganduje others arrive Ibadan, meet Oyo delegates",
    "summarized_story": "Former Governor of Lagos State, Bola Ahmed Tinubu, the incumbent, Babajide Sanwo-Olu and his counterparts from Kano State, Abdullahi Ganduje have arrived in Ibadan the Oyo State capital, as part of his electioneering campaign.\nTinubu and supporters are said to be in Ibadan to woo the All Progressives Congress (APC) delegates ahead of the forthcoming presidential primary, fixed for 6th June this year.\nThose on Tinubu’s convoy include former governor of Borno State, Senator Kasim Setthima, Senator Tokunbo Abiru, Bosun Oladele, Rotimi Makinde, Senator Rilwan Soji Akanbi, Senator Dayo Adeyeye, Bosun Oladele and Wasiu Eshinlokun.\nOn ground in Ibadan to welcome the presidential aspirant were APC gubernatorial candidates, Senator Teslim Folarin, Akeem Adeyemi, Akin Alabi, former Minister of Communications, Adebayo Shittu, Dokun Odebunmi, Senator Fatai Buhari, Idris Adeoye and APC Chairman in the state, Isacc Omodewu.\nAt the time of filing this report, Tinubu was meeting the delegates at an event centre in Ibadan."
  },
  {
    "headline": "BREAKING: Primaries: Lagos APC Members Protest Alleged Imposition Of Candidates By Tinubu, Other Party Leaders",
    "summarized_story": "Members of the All Progressives Congress (APC) in the Kosofe area of Lagos State have protested the imposition of candidates in the recently concluded primary elections in the state.\nThe protesters rejected Hajia Kafilat Ogbara who emerged winner of the All Progressives Congress (APC) primary for Kosofe Federal Constituency.\nThe protesters accused the national leader of the party, Bola Tinubu and other leaders of the party in the state of being behind the alleged imposition of some candidates on them.\nThe members of the party, who flooded the streets on Thursday, alleged that party leaders disregarded the results of the primary elections and instead recognised candidates who lost out.\nIf we cannot elect our representatives, our leaders are biased and compromised.”According to them, the party leaders have been induced by the candidates who lost out in the last primary."
  },
  {
    "headline": "BREAKING: Suspended Accountant-General released from EFCC custody",
    "summarized_story": "The suspended Accountant-General of the Federation, Ahmed Idris, has been released by the Economic and Financial Crimes Commission after he was arrested for his alleged involvement in a N174 billion fraud, The News Direct can confirm.\nIdris was released on bail from the custody of the anti-graft agency on Wednesday night in Abuja and has since been reunited with his family.\nThe EFCC spokesperson, Wilson Uwujaren, confirmed this to our correspondent on Thursday morning.\nThree days after his arrest, Idris was suspended by the Minister of Finance, Budget and National Planning, Zainab Ahmed, to enable him to face his probe.\n“Some of the alleged infractions occurred when Nwabuoku was the Director of Finance and Accounts, Ministry of Defence,” the source said."
  },
  {
    "headline": "Tragedy! Man kills wife, grandmother, shoots self dead",
    "summarized_story": "A three-month-old is safe and his father is dead after authorities say the man shot his wife and his wife’s grandmother point-blank before fleeing with the baby.\nDeputies say Igbokwe shot his wife, identified as Tangela Igbokwe, after she told him she wanted a divorce.\nThe man is also accused of shooting his wife’s grandmother, identified as Linda Larkins.\nAt about 1:05 a.m., officers with the Ennis Police Department located Obinna’s white Honda and tried to stop him.\nAt about 1:05 a.m., officers with the Ennis Police Department located Obinna’s white Honda and tried to stop him."
  },
  {
    "headline": "VIDEO: At last, Tinubu reveals role he played before Buhari, Osinbajo emerged President, Vice President",
    "summarized_story": "Presidential aspirant, Bola Tinubu, has revealed that it is not only the turn of the South West to produce Nigeria’s next president but that he is the one, who should be the next Nigerian leader.\nSpeaking with delegates of the All Progressives Congress, he revealed his role in the emergence of the President Muhammadu Buhari.\nHe said, “If not for me that led the war front, Buhari won’t have emerged.\nI will stand with you and you will win but you won’t joke with the matters of the Yorubas.\nThis time, it’s Yoruba’s turn and in Yorubaland, it’s my turn.”Share this: TwitterFacebook"
  },
  {
    "headline": "In 2015, I buried my ambition for Osinbajo to become Vice President – Tinubu",
    "summarized_story": "Tinubu stated this Thursday, while meeting with delegates and leaders of the party in Ogun State at the Presidential lodge, Abeokuta.\nThe former Lagos state governor who said he decided to set the record straight, ahead of the party’s presidential primary haven heard different versions on the emergence of the Vice President as running mate to President Muhammadu Buhari.\nI was approach by President Muhammadu Buhari to run as his Vice President in 2015 at the early formation of the All Progressives Congress.\n“I was told to bring three names but after due consultations, I decided to pen only Yemi Osinbajo to run as Vice President.\nMeanwhile, the Ogun state governor assured the former Lagos state governor of the state support, saying that, “you have shown to us why you are most capable and qualified for the position you are seeking."
  },
  {
    "headline": "Why we reversed $3.1bn e-customs project – FG",
    "summarized_story": "By Mathew Dadiya, AbujaFederal Government has explained the reasons why the $3.1 billion contract for ‘complete automation’ of the Nigerian Custom Service, approved by the Federal Executive Council (FEC), in 2020 was reversed.\nIt clarified that disagreements between partners that formed a consortium for the project, delayed its takeoff despite efforts by the government through the office of the Attorney General of the Federation to mediate.\nAsked to explain the rationale behind a new e-Customs concession agreement between the NCS, Africa Finance Corporation (AFC) and China’s Huawei Technologies Limited, Ahmed said: “The E-customs project was approved by Council.\nAnd there were some challenges that had to do with disagreements between the concession partners.\nAnd at the end of the day, I think one of the partners in the concession did not agree with the arrangements”, she stated."
  },
  {
    "headline": "Oil price nears $125 a barrel amid EU ban on 90% Russian oil imports",
    "summarized_story": "Agency reportOil prices jumped on Tuesday after the European Commission (EU) leaders reached an agreement on Monday to ban 90 percent of Russian oil imports by the end of 2022.\nThe EU announced on Monday its agreement to ban 90 percent of Russian oil imports by the end of the year as part of sanctions against Moscow for invading Ukraine.\nIn a tweet on Monday, Charles Michel, president of the European Council, said the move would immediately halt 75 percent of Russian oil imports.\n“The sanctions will immediately impact 75 percent of Russian oil imports.\n“We have covered overall 90 percent of Russian oil being winded down during this time frame."
  },
  {
    "headline": "New Materials Nigeria Company to save $100m forex for Nigeria annually",
    "summarized_story": "By our correspondentNew Materials Nigeria Company, a building material company recently commissioned in the Kuje area of Abuja will save Nigeria a whopping sum of $100m in foreign exchange annually when fully operational, its Managing Director, Mr. Jackie Dai Hui has said.\nSpeaking further, the Managing Director said that so far, over $50 million has been invested in the New Materials Nigeria Company explaining that in no distant time, it will grow its investment in Nigeria by establishing a branch in Lagos.\nAccording to him, the establishment of the New Materials Nigeria Company has gone a long way to provide employment to 150 Nigerians both at senior and junior levels who he said are also being trained in various skills.\nWe train Nigerians to run the company; we are transferring technology to those who are brilliant.\n“We can increase our company’s presence in Nigeria because we can source all our raw materials in Nigeria."
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "Without Me, Buhari Wouldn’t Have Become President – Tinubu",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) Bola Tinubu has recalled his role in the emergence of President Muhammadu Buhari in 2015, maintaining that the Katsina-born leader would have lost the election if not for his efforts.\nTinubu made the comment on Thursday while addressing party delegates at the Presidential Lodge in Abeokuta, Ogun State.\n“If not for me that stood behind Buhari, he wouldn’t have become the President.\nThe third, he failed,” Tinubu, one of the frontline aspirants for the APC presidential ticket, told the delegates.\nThat was how I nominated Vice President Yemi Osinbajo."
  },
  {
    "headline": "As Nigeria’s President, I Will Consider Political Solution For Nnamdi Kanu – Prof. Umeadi",
    "summarized_story": "The presidential candidate of the All Progressives Grand Alliance (APGA) Prof. Peter Umeadi says he will consider a political solution for the leader of the Indigenous Peoples of Biafra (Biafra) Nnamdi Kanu if he becomes Nigeria’s leader.\nAnd the former Chief Judge of Anambra State believes a political solution, which he likened to amnesty, can resolve the matter.\n“I will consider a political solution.\nWhen you consider a political solution, you don’t just release him,” he said during an interview on Channels Television’s Politics Today on Friday.\nThat’s a political solution."
  },
  {
    "headline": "EFCC Releases Suspended Accountant-General On Bail",
    "summarized_story": "The suspended Accountant-General of the Federation, Ahmed Idris, has been released on bail by the Economic and Financial Crimes Commission (EFCC).\nEFCC spokesperson, Wilson Uwujaren, confirmed the development to Channels Television.\nThe EFCC had arrested Idris on May 16 over an N80 billion fraud.\nREAD ALSO: EFCC Closes Case Against Ex-Governor JangHe was arrested after failing to honour the commission’s invitations to respond to issues connected to the fraudulent act, the EFCC said.\nAfter his arrest, the Minister of Finance, Zainab Ahmed, suspended Idris."
  },
  {
    "headline": "We’ll Continue To Defend Interests Of All Our Law-Abiding Citizens Abroad – Buhari",
    "summarized_story": "President Muhammadu Buhari on Thursday said his administration will continue to defend the interest of law-abiding Nigerians abroad.\nHe stated this during a meeting with Nigerians living in Spain on the sidelines of his official visit, pledging that Nigeria will continue to defend the interests of its nationals living abroad.\n“I have also been informed of how law-abiding you are here in Spain.\nMore importantly, through your commitment to your various callings, you have enhanced the name and image of our country, thereby, earning Nigeria’s respect in Spain”.\nOmeruo presented President Buhari with a football and jersey in appreciation of the Nigerian leader’s support for sports, especially the Super Eagles."
  },
  {
    "headline": "Buhari Rejoices With ‘Compassionate’ Queen Elizabeth II On Platinum Jubilee",
    "summarized_story": "President Muhammadu Buhari has rejoiced with Her Majesty Queen Elizabeth II on her Platinum Jubilee, describing her as a compassionate leader.\n“Warmest wishes and congratulations to Her Majesty Queen Elizabeth II, on the occasion of her Platinum Jubilee.\nI rejoice with a loyal, patriotic and compassionate leader who truly works for the people,” Buhari said.\n“People never lose trust in Queen Elizabeth.\nIt is confirmation of the fact that Queen Elizabeth always acts and delivers according to people’s expectations.”READ ALSO: Buhari Hails Pope’s Appointment Of Bishop Okpaleke As CardinalWarmest wishes and congratulations to Her Majesty Queen Elizabeth II, on the occasion of her Platinum Jubilee."
  },
  {
    "headline": "Makinde congratulates Atiku, says PDP determined to rescue Nigeria in 2023 -",
    "summarized_story": "Oyo State Governor, Seyi Makinde, said the Peoples Democratic Party (PDP) remains determined to rescue Nigeria from the throes of bad leadership.\nA statement by the Chief Press Secretary to the governor, Taiwo Adisa, indicated that the governor stated these in his weekly newsletter.\nNyesom Wike, said “we will play our part to ensure that the PDP’s Operation Rescue Nigeria is a resounding success.”He said: “As you already know, we had the People’s Democratic Party (PDP) primaries in which we again demonstrated two things to Nigerians:“One, that the PDP is serious about ensuring that we make the right decisions for Operation Rescue Nigeria.\nThe weaker party had to wait for the results of the PDP convention before they made their move.\n“Two, that the PDP stands head and shoulders above the rest in coordinating primaries at the state and national levels."
  },
  {
    "headline": "Kaduna PDP delegate lauded for sharing N7m with less privileged -",
    "summarized_story": "A People’s Democratic Party (PDP) delegate in Kaduna state Mr. Tanko Sabo, who shared part of the cash he received from his party’s aspirants among less privileged members of his community, has been lauded for his kindness.\nMr Tanko Sabo was one of the national delegates to the recent National Assembly, Governorship and Presidential primary election of the PDP.\nA former Special Adviser (SA) on Media to the late Kaduna State Governor Yakowa, Mr. Reuben Buhari, revealed that Mr. Sabo spent about 7 million Naira on indigent members of Sanga Local Government Area.\nHe was said to have paid the school fees of a couple of children and settled the hospital bills of others.\nMr Tanko Sabo had promised to support his community if chosen as a PDP delegate, a promise many say he has fulfilled."
  },
  {
    "headline": "Tinubu meets APC delegates in Oyo",
    "summarized_story": "Leading presidential aspirant on the platform of the All Progressives Congress, Asiwaju Bola Tinubu has met with the party’s delegates in Oyo State.\nHe was accompanied by the Governor of Kano, Abdullahi Ganduje, former Governor of Borno, Kashim Shettima, Speaker of Lagos Assembly, Mudashiru Obasa and other party Chieftains.\nThe presidential hopeful was received by the Governor of Lagos, Babajide Sanwo-Olu and other party loyalists in Oyo State.\nThe APC chieftain was cheered up by crowd of supporters and delegates as he engaged in conversations with them ahead of the forthcoming presidential primary.\nThe delegates gave their assurance that Asiwaju Tinubu will get their votes at the convention to be able to clinch the party’s ticket for the 2023 presidential election."
  },
  {
    "headline": "Niger youths call for a female deputy governor",
    "summarized_story": "A group of concerned Christian youths in the All Progressives Congress in Niger state are calling on the APC gubernatorial candidate Mohammed Umar to consider a woman as his running mate in the forth coming general elections.\nIn a press statement signed by the coordinator of the group Joshua Nmadu the group said all though the 35 percent affirmation bill did not scale through in the national assembly having a woman as the deputy governor will give voice to women and the issue that concerns them.\nWith respect to this the group is endorsing Mary Noel-Berje to be the running mate for Umar Bago in the coming elections in 2023.\nThe group stress that Mary Noel-Berje who is currently the chief press secretary to Niger state governor Abubakar Sani Bello has the requisite experience to occupy the office of the deputy governor and ensure the victory of the team.\nThey also pledge to mobilise other Christian youths in the state to support the campaign if their plea is granted."
  },
  {
    "headline": "My Administration Will be Able to Move Oil Output to About 3 Million Barrels Per Day- Tein Jack-Rich",
    "summarized_story": "APC presidential aspirant Tein Jack-Rich elaborates his plans to solve Nigeria’s insecurity issues with concrete investments in crude oil production."
  },
  {
    "headline": "Nigerian Army Refutes Prelate’s Kidnapping Allegations -Trending With Ojy Okpe – Arise News",
    "summarized_story": "The Nigerian Army has reacted to allegations of Collusion made by Samuel Kanu-Uche, prelate of the Methodist Church of Nigeria who on Sunday was abducted by gunmen along the Enugu-Port Harcourt expressway in Abia state.\nIn another development, the Cambridge University Press has reacted to the backlash that trailed Trish Lorenz a British journalist and author who came under fire over her latest book titled Soro Soke: The Young Disruptors of an African Megacity.\nThe federal government has banned the sale and consumption of wild animals otherwise known as bush meat in a bid to curb the spread of monkeypox disease following its recent resurgence in the country.\nFinally, Tanko Rossi Sabo one of the delegates in the just concluded primary elections of the Peoples Democratic Party from Kaduna State is reported to have spent about N20 million naira from the election largesse to assist the less privileged."
  },
  {
    "headline": "‘Fuel on Fire’: US and Germany Agree to Supply Advanced Weapons to Ukraine",
    "summarized_story": "Andriy Yermak, the head of the Ukrainian president’s office, hailed the new Western weapons.\nAs the new weapons shipments were announced, a Russian missile hit rail lines in the western Lviv region, a key conduit for supplies of Western weapons and other supplies, officials said.\nGermany’s promise of IRIS-T air defense systems would mark the first delivery of long-range air defense weapons to Ukraine since the start of the war.\nGerman Chancellor Olaf Scholz told lawmakers that the IRIS-T’s surface-to-air missiles are the most modern air defense system the country has.\n“With this, we will enable Ukraine to defend an entire city from Russian air attacks,” he said."
  },
  {
    "headline": "Messi Pulls Strings as Argentina Outclass Italy 3-0 in COMMEBOL-UEFA Cup of Champions Match at Wembley",
    "summarized_story": "Argentina marked the revival of the Cup of Champions in style as they outclassed Italy 3-0 in a heavyweight clash billed as the “Finalissima” at a raucous Wembley Stadium on Wednesday.\nWe knew it was going to be an attractive game and a nice setting to be champion,” Messi said after the match.\nArgentina could have scored plenty more after the break with Messi pulling the strings and Italy keeper Gianluigi Donnarumma sparing his side a drubbing.\nThe Finalissima is the revival of the CONMEBOL-UEFA Cup of Champions that has been played only twice before, in 1985 and 1993.\n“Everything changed since we won the Copa America,” Di Maria said."
  },
  {
    "headline": "Gunman Kills Four in Oklahoma Medical Centre",
    "summarized_story": "Armed police then ran towards the medical centre.\nPolice arrived at the medical center three minutes after receiving a call about the shooting on Wednesday afternoon.\nI was very happy with what we know so far regarding the response of our officers,” Dalgleish said.\nTwo weeks before the Uvalde shooting, a white gunman killed 10 people at a supermarket in a Black neighborhood in Buffalo, New York.\nThe Natalie Building contains doctors’ offices including an orthopedic center, Dalgleish said, adding he believed the victims included employees and patients."
  }
]