[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Elon Musk’s father has another child with 35-year-old stepdaughter",
    "summarized_story": "By Biodun BusariWorld richest man, Elon Musk’s father, Errol Musk has shared a shocking revelation of a having a “secret” second child with his 35-year-old stepdaughter Jana Bezuidenhout.\nHe, now, has a total of seven children including Tesla CEO Elon Musk.\nRead Also:Twitter sues Elon Musk for terminating $44bn takeover dealElon Musk pulls out of $44 billion Twitter dealDangote now 63rd, as Elon Musk tops 100 billionaires’ rankingJana Bezuidenhout is the daughter of Errol Musk’s second wife Heide Bezuidenhout, whom he married after splitting with Elon Musk’s mother Maye Haldeman Musk in 1979.\nFrom this marriage, he has three children – Elon, Kimbal, and Tosca.\nElon Musk’s Startups Could Be Silver Lining for Bankers Burned by Twitter DealThe Musk family were in “shock” when they found out that Ms Bezuidenhout is pregnant with Errol Musk’s child, the report added."
  },
  {
    "headline": "Poor leadership responsible for moribund health sector – Radiographers",
    "summarized_story": "By Vincent Ujumadu, AwkaNigerian Radiographers have identified poor leadership as the reason the Nigerian health sector is at its moribund state.\nThe president of the Association of Radiographers of Nigeria, Dr.Dlama Joseph and the secretary, Dr. Samuel Laushugno described the proposed bill as capable of reforming the Nigerian health sector starting from the apex hospitals; the university teaching hospitals.\nIt is time for real health administrators to be appointed to these offices in order to turn things around.\n“The assertion is self-serving and unheard of in saner climes and should not be tolerated in a healthcare sector which APCOM itself has described as _’frail and desperately sick.\n“We commend the conscientious efforts of Hon Bamidele Salam who proposed the bill, and the national assembly for their assiduous efforts to uphold and bring transformation in the Nigerian health institutions."
  },
  {
    "headline": "Int’l cycling union to establish training center in Nigeria",
    "summarized_story": "The International Cycling Union says it would established cycling training center in Nigeria for the development of the sport in the country.\nWazzam, also the president of Confederation of Africa Cycling (CAC), said that Nigeria was one of the biggest cycling countries in Africa, hence the need for the establishment of UCI training centres.\nHe said the president of Cycling Federation of Nigeria (CFN), Giandomenico Massari, was doing a good job for the development of cycling in Nigeria.\n“This is very positive for African track cycling as it demonstrates the desire for more African nations to participate in track cycling”, he said.\nThe 2022 Africa Cycling championship, which started on Thursday at the Moshood Abiola National Stadium, will end on Sunday."
  },
  {
    "headline": "Your job is to mobilise workers, not select candidates, LP tells NLC",
    "summarized_story": "Mr Ogar Osim, Chairman of the Labour Party (LP) in Cross River, on Friday told the Nigeria Labour Congress (NLC) in the state that its mandate was to mobilise workers to support the party in 2023 but not to select candidates for the party.\nAccording to the party chairman, the NLC is not there to lead LP, but “they have their mandate which is to mobilise, even though anytime I meet with them, they claim they founded the party and must take over.\nHe maintained that what the leadership of NLC in the state wanted was for him to sit with them to harmonise and possibly adopt their candidates.\nHe added that while the LP still had the right of substitution in some positions, it would not destroy the chances in the state by fielding illegal candidates selected by the NLC without INEC’s presence.\nThe News Agency of Nigeria (NAN) reports that the NLC on June 9, had elected Mr Earnest Jones as the governorship candidate of LP in the absence of the party chairman and INEC officials (NAN)"
  },
  {
    "headline": "Tinubu can’t make one dollar to a naira – Ex-minister",
    "summarized_story": "According to reports, a Local government chairman in Lagos State, Ayodele Adewale had on Wednesday when he appeared on the Arise TV remarked that it would be possible for Tinubu to make the naira equal the US dollars.\n“I talked about bringing one dollar to a naira, it is very possible.\nHis words: “Tinubu made this kind of statement in 2015, when he was campaigning for Muhammadu Buhari.\n“That’s how it started in 2014, leading to the opposition against President Goodluck Jonathan on how the Naira will be at par with the US Dollar if Buhari is voted to power.\nThat claim is unrealistic, given the fact that he may likely follow the economic path of Buhari if voted into power."
  },
  {
    "headline": "Internet of Things: Minister promises proactive regulation",
    "summarized_story": "The Minister of Communications and Digital Economy, Prof. Isa Ibrahim Pantami, has reassured the nation that Nigeria’s telecom regulatory framework is capable of addressing the challenges that may arise from the advancement of the Internet of Things (IoT) in the country.\nPantami was speaking at the twin event – Stakeholders Consultative Forum on Regulatory Roadmap for IoT Ecosystem in Nigeria, hosted by the Nigerian Communications Commission (NCC); and the presentation of two books written by him.\nProf Pantami said Nigeria has already exhibited its preparedness to harness the potential of this new service, as demonstrated in the reduction in incidences of cybercrimes in Nigeria over the past two years.\nEarlier in an address of welcome, the Executive Vice Chairman/Chief Executive Officer of the NCC, Prof. Umar Danbatta, explained that, in the process of undertaking its responsibility of regulation.\nAccording to him, the consultation presents a unique opportunity to appraise the emergence and future deployment of IoT products and services for the benefit of consumers in Nigeria."
  },
  {
    "headline": "BREAKING: Osun 2022: Court restrains Amotekun from election duty",
    "summarized_story": "A Federal High Court sitting in Osogbo, the Osun State capital, has restrained the Osun Security Network, codenamed Amotekun Corps from participating in Saturday’s gubernatorial election.\nThe court order also mandated the Independent National Electoral Commission (INEC) not to make use of the Amotekun Corps as part of the personnel to be deployed to provide security in the election.\nThe order warned Amotekun not to serve as either security personnel or volunteer in the guber election.\nPart of the order reads, “That the 1st defendant (INEC) is hereby restrained from requesting the deployment of the second defendant (AMOTEKUN) as part of the security personnel deployable for the purpose of Osun 2022 governorship election pending the determination of the originating summons filed in the suit.”Speaking on the court order, Hashim Abioye stated, “With this order, it is forbidden for the INEC to make use of Amotekun as part of the security personnel to be drafted for the election.\n“As I speak to you, those concerned, the INEC, police and other relevant agencies, have been appropriately served.”"
  },
  {
    "headline": "IPOB’s threat to British High Commissioner, Catriona Laing condemnable – Shehu Sani",
    "summarized_story": "Senator Shehu Sani has condemned the move by the Indigenous People of Biafra, IPOB, to stop the British High Commissioner, Catriona Laing from visiting the Southeast.\nDAILY POST recalls that the secessionist group, on Thursday, in a statement by its spokesman, Emma Powerful asked Catriona Laing to suspend her planned visit.\nReacting, Shehu Sani, a former governorship aspirant in Kaduna State, said in a tweet that the warning may not reflect the general view of the people in the region.\n“If actually, the separatist group in the South East has issued threats to the British High Commissioner, Catriona Laing not to visit the South East, then that threat is condemnable.\n“And I believe it doesn’t reflect the views of the people of the region except otherwise stated,” he wrote."
  },
  {
    "headline": "Osun 2022: Security atmosphere tense as gun-wielding men sighted in Osogbo",
    "summarized_story": "Less than 24 hours to the Osun State governorship election, gun-wielding men were sighted at some sites in Osogbo, the state capital.\nOn Thursday, at a mega rally of the Peoples Democratic Party (PDP) in Osogbo, some thugs were sighted at the venue wielding dangerous weapons in the presence of security operatives.\nAlso in a different location in Osogbo on Thursday, some men with guns were spotted at Estate, behind Reflex bar.\n“The intra-cult clashes are a result of the power tussle by the various cult groups within the party.\nYiaga Africa also received a report that these cult groups are assembling small arms and light weapons ahead of the election."
  },
  {
    "headline": "Court orders FG to immediately review salaries of judicial officers",
    "summarized_story": "Justice Osatohanmwen Obaseki-Osaghae of the National Industrial Court, Abuja on Friday ordered the Federal Government to put machinery in place for the immediate review of the salaries and allowances of the judicial officers in Nigeria.\nThe judge held that the current salaries and allowances of judicial officers in the country are not only abysmally low but embarrassing.\nThe judge held that the refusal of the government to review the judicial officers’ salaries and allowances for 14 years was unconstitutional, unlawful, and should be compelled to do the needful.\nObaseki-Osaghae lamented that it is unfortunate that justices and judges who are ministers in the temple of justice have become victims of injustice in the country.\nDetails later."
  },
  {
    "headline": "Impeachment: Oyo CJ constitutes 7-man panel to investigate Deputy Gov The Nation Newspaper",
    "summarized_story": "The Oyo State Chief Judge, Justice Munta Abimbola, on Friday constituted a seven-man panel to investigate the allegations levelled against the Deputy Governor, Rauf Olaniyan, by the State House of Assembly.\nThis is contained in a statement by Mrs Comfort Udoh, the Information Officer, Oyo State High Court, made available to newsmen in Ibadan.\nThe News Agency of Nigeria (NAN) recalled that the House of Assembly had in June directed Abimbola to constitute a panel to investigate Olaniyan.\nOlaniyan had through his counsel, Afolabi Fashanu (SAN), dragged the House to court over the impeachment move against him by the lawmakers.\nNAN reports that the Oyo State High Court in Ibadan, had on Thursday dismissed the suit filed by the State Deputy Governor, challenging the moves initiated to impeach him by the state House of Assembly."
  },
  {
    "headline": "Alao-Akala's son, wife welcome twin after 14 IVFs, miscarriages The Nation Newspaper",
    "summarized_story": "After eight years of waiting, Juwon, the son of former Oyo Governor late Adebayo Alao-Akala, and his wife Hadiza have welcomed a set of twin- a boy and a girl.\nThe duo tied the knot at an Islamic and white wedding in Okoya’s estate in Lekki, Lagos in 2014.\n…..It started in November 2014, Innocent naive and very hopeful, Little did I know what was in front of me.\n“God all I can say is thank you, After 14 IVFs, multiple miscarriages including 24 weekers, boy/girl twins and 17 weekers identical triplet girls.\n“I have a story, l’Il tell you in detail soon.”"
  },
  {
    "headline": "Why I chose Idahosa as running mate",
    "summarized_story": "Sen. Rabiu Kwankwaso, Presidential Candidate of the New Nigeria Peoples Party (NNPP) says he chose Bishop Isaac Idahosa as his running mate because of his impeccable integrity.\nThe News Agency of Nigeria (NAN) recalls that the choice of Idahosa as Kwankwaso’s running mate in the 2023 presidential election on the platform of the NNPP was made known on Thursday.\nRead Also: Kwankwaso picks Bishop Idahosa as running mate“A self-made achiever and a credible Nigerian, Bishop Idahosa is also selected because he represents the definition of a true role-model for the Nigerian Youth,” he said.\nHe said the team would save Nigeria from the current challenges and create a new Nigeria where justice, equity, fairness, unity, security and development would be strenghtened.\nBishop Idahosa will be publicly and official unveiled to Nigerians on Monday, July 18 at the International Conference Centre, Abuja."
  },
  {
    "headline": "Court bars newsmen from covering late Osinachi children’s testimony The Nation Newspaper",
    "summarized_story": "A Federal Capital Territory High Court, Wuse Zone 2, Abuja, on Friday barred journalists from covering and witnessing the late gospel singer, Osinachi children’s testimony.\nThe move was as a result of the court granting the three oral applications made by Aderonke Imana, the prosecution counsel, on June 22.\nThe counsel filed the applications during the court hearing in the alleged culpable homicide case against Peter Nwachukwu, the late singer’s husband.\nThe second application Imana brought was premised on section 160 of the Child Rights Act and section 209 of the Evidence Act.\nThe application prayed the court to allow the other two witnesses, who are the deceased children, being minors to give unsworn evidence as Pw3 and Pw4."
  },
  {
    "headline": "Wipe out terrorists, Buhari gives fresh order to military The Nation Newspaper",
    "summarized_story": "By Bolaji Ogundele, Abuja and AbdulGafar Alabelewe, KadunaPresident: last 12 years most challengingNigeria to sustain sub-regional security collaborationThe military got fresh marching orders yesterday from President Muhammadu Buhari: wipe out terrorists.\nHe described an aspect of their training, which focused on countering security threats, as very important.\n“The last 12 years have been very challenging for our nation, considering the different security threats that have besieged the country.\nMajor Sunday Olayinka Atomode bagged three awards: Minister of Defence Award for highest overall score, Chief of Defence Staff Award for Department of Joint Studies and Chief of Army Staff Award for Department of Land Warfare.\nGodwin Emeka Okutue won the Chief of Naval Staff Award for the Department of Marine Warfare; Squadron Leader Peter Chika Echeazu bagged the Chief of Air Staff Award for the Department of Air Warfare."
  },
  {
    "headline": "Breaking: Court orders an upward review of Judges salaries",
    "summarized_story": "From Godwin Tsa, AbujaA National Industrial Court hasordered the Federal Government to immediately carry out an upward review of the salaries and allowances of the judicial officers.\nJustice Osatohanmwen Obaseki-Osaghae who issued the order held that the current salaries and allowances of judicial officers in the country is not only abysmally low but embarrassing.\nThe judge held that the refusal of the government to review the judicial officers salaries and allowances for 14 years was unconstitutional, unlawful and should be compelled to do the needful.\nJustice Obaseki-Osaghae, lamented that it is unfortunate that justices and judges who are ministers in the temple of Justice have become victims of injustice in the country.\nDetails later."
  },
  {
    "headline": "Court bars newsmen from covering late Osinachi children’s testimony",
    "summarized_story": "A Federal Capital Territory High Court, Wuse Zone 2, Abuja, on Friday barred journalists from covering and witnessing the late gospel singer, Osinachi children’s testimony.\nThe move was as a result of the court granting the three oral applications made by Aderonke Imana, the prosecution counsel, on June 22.\nThe counsel filed the applications during the court hearing in the alleged culpable homicide case against Peter Nwachukwu, the late singer’s husband.\nThe second application Imana brought was premised on section 160 of the Child Rights Act and section 209 of the Evidence Act.\nThe application prayed the court to allow the other two witnesses, who are the deceased children, being minors to give unsworn evidence as Pw3 and Pw4."
  },
  {
    "headline": "Sacked Lagos Assembly Commission chairman to seek redress in court",
    "summarized_story": "Sacked Chairman of the Lagos State House of Assembly Services Commission (LAHASCOM), Mr Olawale Mogaji, has said he would approach the court to challenge his removal from office.\nThe News Agency of Nigeria (NAN) reports that the Lagos State House of Assembly on Thursday, in a voice vote at the plenary session sacked Mogaji as the Chairman of the commission.\nMogaji, in a statement issued in Lagos on Thursday, argued that due process was not followed by the House in the termination of his appointment.\n“I heard through the news that the Speaker of the Lagos State House of Assembly sack my appointment as Chairman of the Lagos State House of Assembly Services Commission at the plenary today.\n“The speaker without recourse to the Service rules has been operating the commission like a unit of the Assembly."
  },
  {
    "headline": "Cyber security: Nigeria improving on global ranking – Pantami",
    "summarized_story": "Nigeria has improved on its global ranking in cyber security, the Minister of Communications and Digital Economy, Prof. Isa Pantami, has said.\nPantami made this known on the sideline of the Stakeholder’s Consultative Forum on Emerging Technologies organised by Nigeria Communication Commission (NCC) and Federal Ministry of Communications and Digital Economy in Lagos.\nThe minister said that Nigeria was not doing badly on the global cyber security index which ranked the country 75 out of 175 countries in 2018.\nPantami said that Nigeria”s ICT regulatory approach since 2019 hinged on the National Digital Economy policy and strategy for a digital Nigeria based strictly on developmental regulation.\nThe News Agency of Nigeria reports that there was also a public presentation of books authored by the minister of Communications and Digital Economy."
  },
  {
    "headline": "Umahi carries out minor cabinet reshuffle",
    "summarized_story": "David Umahi of Ebonyi has carried out a minor cabinet reshuffle to in his effort to ensure good governance for the people.\n“Mr Mark Onu, Special Assistant (SA) on Youth Mobilisation is now Special Assistant to the governor on drug control.\n“Mr Njoku Ozoemena, Special Assistant on Solid Minerals is to be reassigned by the Deputy Governor, Mr Ofoke Kerian Emeka, SA on Attitudinal Change is to be reassigned by the Deputy Governor,” he said.\nOn empowerment programme, the commissioner said that the executive received the final report on the empowerment of youths and women.\n“The beneficiaries should go to the office of the deputy governor for final verification and documentation,” he said."
  },
  {
    "headline": "Forensic Audit: NDDC Boss Lauds Buhari for Approval of 33 Vehicles for Security Operatives – THISDAYLIVE",
    "summarized_story": "The joint security committee includes officers from the Nigerian Army, Navy, Police, Directorate of State Security (DSS), and the Nigeria Civil Defence Corps.\nAccording to Akwa, “The vehicles were provided for the security agencies as directed by President Buhari.\nThe president also instructed that the security vehicles be handed over to the security agencies at the end of the forensic audit exercise and that is why we are doing this today.\n“The ceremony is very symbolic because it tells a very good story about the security agencies.\nThe task the federal government gave us to support the forensic audit was successfully carried out."
  },
  {
    "headline": "Impeachment: Oyo CJ Constitutes Seven-man Panel to Probe Deputy Gov – THISDAYLIVE",
    "summarized_story": "The Oyo State Chief Judge (CJ), Justice Munta Abimbola, on Friday constituted a seven-man panel to investigate the allegations levelled against the Deputy Governor, Rauf Olaniyan, by the sate House of Assembly.\nThis is contained in a statement by Mrs Comfort Udoh, the Information Officer, Oyo State High Court, made available to newsmen in Ibadan.\nThe House of Assembly had in June directed Abimbola to constitute a panel to investigate Olaniyan.\nThe chief judge urged the panel members to have fear of God and act in accordance with their conscience and just in the discharge of their duties.\nThe Oyo State High Court in Ibadan, had on Thursday dismissed the suit filed by the state deputy governor, challenging the moves initiated to remove him by the state House of Assembly."
  },
  {
    "headline": "NNPP Guber Candidate, Gov Yahaya Mourn Gombe Traditional Ruler – THISDAYLIVE",
    "summarized_story": "Segun Awofadeji in GombeThe governorship candidate of the New Nigeria People’s Party (NNPP) in Gombe State, Khamisu Ahmed Mailantarki, has described the death of the Ajiyan Gombe and District Head of Kwami, Alhaji Haruna Abdullahi, as an unforgettable event in the state.\nIn a condolence message sent to THISDAY yesterday, Mailantarki said Abdullahi, who was also one of the kingmakers in Gombe Emirate, was a great traditional icon.\nYahaya urged the family members to sustain the legacies of honour, dignity and selfless service left by the late senior district head, Abdullahi.\nMeanwhile, Mailantarki said the late Ajiyan Gombe contributed immensely towards building peace and promoting harmonious co-existence among the residents of his district and the state at large.\nHe said: “The passing away of the traditional leader is a huge loss to Kwami Local Government Area and Gombe State because he was an iconic figure and revered leader who rendered selfless service to humanity throughout his reign."
  },
  {
    "headline": "Court Orders FG to Review Salaries of Judicial Officers – THISDAYLIVE",
    "summarized_story": "* CJN to now receive N10m monthly, Appeal Court President N9m, High Courts CJ, N8mAlex Enumah in AbujaJustice Osatohanmwen Obaseki-Osaghae of the National Industrial Court (NIC), Abuja on Friday held that the current salaries and allowances of judicial officers in the country is not only abysmally low but embarrassing and accordingly ordered the federal government to put machinery in place for the immediate review of the salaries and allowances of the judicial officers.\nTo this end, Justice Obaseki-Osaghae ordered the federal government to commence a monthly payment of N10 million to the Chief Justice of Nigeria (CJN), N9 million to other justices of the apex court; President of Court of Appeal, N9 million, while other justices of the appellate court N8 million; chief judges of both federal and state High Courts, N8 million, while judges of the federal and state High Courts, N7 million.\nThe judge held that the refusal of the government to review the judicial officers’ salaries and allowances for 14 years was unconstitutional, unlawful and should be compelled to do the needful.\nObaseki-Osaghae lamented that it is unfortunate that justices and judges who are ministers in the temple of justice have become victims of injustice in the country.\nDetails later…"
  },
  {
    "headline": "FCTA Exposes Maitama Highbrow Property Owners for N29.5bn Ground Rent Debt – THISDAYLIVE",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Federal Capital Territory Administration (FCTA) has ascribed the bulk of the N29.5 billion ground rent debts owed it to property owners in upscale Asokoro, Industrial Area II and Maitama Districts.\nThe FCTA Director, Information and Communication, Muhammed Hazat Sule, made this startling revelation yesterday in a statement.\nHe said the property owners in the listed highbrow areas accounted for 10.67 per cent, 9.43 per cent and 9.29 per cent respectively of the total sum due to the FCTA Coordinating Committee on the Recovery of Outstanding Ground Rents amounting to N29,506,643,943.98.\nHe said the committee was already contemplating legal documentations to take up all property owners, who had failed to pay, despite repeated threat of court, for prosecution, revocation, or outright forfeiture.\nProperty owners in other districts like Kukwaba, Gwarinpa I, Gudu, Kado, Karmo, Katampe Extension, Utako, Mabushi, Durumi, Daki-Biyu, Guzape, Jahi, Dutse Wuye, and Institutions and Research were said to owe various degrees of percentages."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "POS Agent Laments Loss Of Over N250,000 To Defective Payment Machine And Failure Of Company, PayForce To Rectify Issues",
    "summarized_story": "A point of sale (POS) agent identified as Oluwakorede Noah has raised the alarm over the refusal of Crowd Force, a distribution network, to address complaints of failed financial transactions for over a month.\nAccording to Noah, he was introduced to the company's product, PayForce and had been an agent on the platform.\nHowever, he started observing malfunctions in the machine as customers’ accounts get debited and his own wallet was not credited.\nHe said, “I have been working with PayForce as a POS agent.\nWe have asked Mr Noah to tell his customers to go to the bank for a reversal."
  },
  {
    "headline": "BREAKING: Nigeria's inflation rate hits 5-year high at 18.60%",
    "summarized_story": "The consumer price index (CPI), which measures the rate of change in prices of goods and services, surged to 18.60 percent in June 2022, up from 17.71 percent in the previous month.\nThe National Bureau of Statistics (NBS) said this in its consumer price index (CPI) report for June 2022, released on Friday.\nThis is the highest since February 2017.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Nigeria's inflation rate hits 5-year high at 18.60%",
    "summarized_story": "The consumer price index (CPI), which measures the rate of change in prices of goods and services, surged to 18.60 percent in June 2022, up from 17.71 percent in the previous month.\nThe National Bureau of Statistics (NBS) said this in its consumer price index (CPI) report for June 2022, released on Friday.\nThis is the highest since February 2017.\nMore to follow…"
  },
  {
    "headline": "Court orders Imagine Global founders to pay N18.9bn to aggrieved investors",
    "summarized_story": "The Lagos state high court sitting at Osborne, Ikoyi, has ordered Imagine Global Holding Company Limited and its owners, Bamise and Elizabeth Ajetunmobi, to pay N18.9 billion to aggrieved investors.\nOn Thursday, Toyin Oyekan-Abdullahi, the judge, gave a judgement in favour of the 27 claimants who filed the suit.\nLast year, the court granted an ex-parte order restraining 21 banks in Nigeria from releasing funds to Imagine Global founders.\nReports and social media posts alleged that the Ajetumobi’s fled with billions of naira belonging to their investors.\nAdvertisementIn preliminary objections filed by Olakunle Nathan-Marsh, their counsel, the Ajetunmobi’s, who did not appear in court, prayed the court to dismiss the investors’ suit."
  },
  {
    "headline": "Court orders Imagine Global founders to pay N18.9bn to aggrieved investors",
    "summarized_story": "The Lagos state high court sitting at Osborne, Ikoyi, has ordered Imagine Global Holding Company Limited and its owners, Bamise and Elizabeth Ajetunmobi, to pay N18.9 billion to aggrieved investors.\nOn Thursday, Toyin Oyekan-Abdullahi, the judge, gave a judgement in favour of the 27 claimants who filed the suit.\nLast year, the court granted an ex-parte order restraining 21 banks in Nigeria from releasing funds to Imagine Global founders.\nReports and social media posts alleged that the Ajetumobi’s fled with billions of naira belonging to their investors.\nAdvertisementIn preliminary objections filed by Olakunle Nathan-Marsh, their counsel, the Ajetunmobi’s, who did not appear in court, prayed the court to dismiss the investors’ suit."
  },
  {
    "headline": "Osun election: AD, party deregistered by INEC, asks members to vote for APC",
    "summarized_story": "Alliance for Democracy has asked its members to support the re-election bid of Gboyega Oyetola, governor of Osun state.\nOyetola, candidate of the All Progressives Congress (APC), is seeking another four-year term in the governorship election scheduled to take place on Saturday.\n“We equally enjoin all the good people of Osun State to vote Gov.\nOyetola for continuity in good governance.”AdvertisementThe party also congratulated Bola Tinubu on his election as the presidential candidate of the APC.\n“The leadership of the party, congratulates him (Tinubu) on his well-deserved victory at the APC primaries and his emergence as the party’s presidential flag bearer,” the party said."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Egyptian startup Swvl enters Mexico via Urbvan acquisition",
    "summarized_story": "Swvl Holdings Corp, a multinational mobility as a service provider, has announced an agreement to acquire Urbvan, a mobility platform that provides tech-enabled mobility services in Mexico.\nWith this acquisition, the Egyptian-born startup will be expanding into Mexico, the second most populated country in Latin America.\n“Urbvan was founded on the same principles as Swvl: to address the inefficiencies found in traditional mass transit in many parts of the world.\n“We are excited to partner with Swvl as we work to illustrate best practices for tech-optimised day-to-day travel in Mexico.\nSwvl, which went public in 2021, was the first African startup to go public via a SPAC and is currently valued at $1.5 billion."
  },
  {
    "headline": "How Klasha is solving some of the biggest problems in African ecommerce?",
    "summarized_story": "While online shopping is still nascent on the continent, African tech startups are jumping in to solve the hard problems of making ecommerce work in Africa.\nKlasha’s core product is the Klasha Checkout which allows ecommerce platforms, websites, apps and consumers to pay international online merchants in African currencies, while the merchants receive the payout in G20 currencies: dollar, euro, and pound.\nThis incentivises these global merchants to expand their services to African consumers.\nThe app has evolved to allow African consumers to pay global retailers including fashion products on Asos, Zara, and H&M, and streaming services like Spotify and Apple Music.\nDue to the nascency of ecommerce in these countries, Anuna said Klasha has had to engage in education campaigns to effectively sell ecommerce as an alternative to commerce."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Meet Burna Boy's monitor engineer, Precious Tawo as he takes us on his journey into sound engineering",
    "summarized_story": "Without further ado, let’s meet Precious Tawo, freelance sound engineer and production manager.\nOn the 20th day [of the Calabar festival], we were doing a sound check in the stadium for the band, and my boss was not on the stage.\nPrecious Tawo’s journey into sound engineeringPrecious TawoI didn’t choose the path; the path chose me.\nAnd in 2013, the Calabar Festival was very popular.\nWe tried everything and eventually had to plug my monitors into my boss’ equipment."
  },
  {
    "headline": "Nigerian celebrities switch from political endorsers to contenders",
    "summarized_story": "From giving politicians endorsements during elections, a number of Nigerian celebrities are now contesting for political offices.\nSome celebrities are sensitising the electorate, especially the youths, to the importance of being more involved in politics.\nMusic and political campaigns have always been entwined and politicians have always added musicians to their campaign train to get the younger generation to listen to their political agendas.\nIn October 2020, young celebrities and other youths marched to the streets during the EndSARS protest to demonstrate against police brutality and poor leadership.\nCelebrities planned the free “Youth Vote Count” concert in June 2022 to encourage young people to take part in their civic responsibilities."
  },
  {
    "headline": "Cuba’s brain gain: How Nigeria can profit from doctors’ exodus",
    "summarized_story": "The largest share of Cuba’s export earnings accrues from incomes gained through a programme that ships about 50,000 health workers to more than 60 countries across the world.\nAfrica’s most populous nation, Nigeria, has a ratio of 4 doctors per 10,000 people.\nThe number of Cuban health professionals serving abroad rose from 5,000 in 2003 to 25,000 in 2005 and to over 40,000 by 2007.\nOlamide Brown, founder of Flying Doctors Healthcare Investment Group, said Nigeria needs to be able to do more with less since it can afford budgets controlled by the countries luring away its doctors.\nWhy not change that into a brain gain opportunity by making trade deals with countries that need doctors in exchange for a fee."
  },
  {
    "headline": "How Super Falcons overpowered Cameroon again to qualify for World Cup – Nigerian Observer",
    "summarized_story": "How Super Falcons overpowered Cameroon again to qualify for World CupShare FacebookTwitterStumbleuponLinkedInPinterestNigeria’s Super Falcons on Thursday in Casablanca qualified for the 2023 FIFA Women’s World Cup finals to be hosted by Australia and New Zealand.\nA lone goal by Rasheedat Ajibade against Cameroon’s Indomitable Lionesses steered the Super Falcons to the semi-finals of the ongoing Women’s Africa Cup of Nations (WAFCON) in Morocco.\nHowever, after Nigeria scored, Gabrielle Onguene lashed at the Nigeria goal but it went far away.\nNAN reports that Nigeria’s Super Falcons have now become the 15th team to qualify for the ninth FIFA Women’s World Cup finals scheduled for July 20 to Aug. 20 in 2023.\nThe fifth- and sixth-placed teams at the ongoing WAFCON in Morocco will have another shot at qualifying for the World Cup."
  },
  {
    "headline": "2023 WWC: Buhari hails Super Falcon for qualifying – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPresident Muhammadu Buhari has congratulated Nigeria’s Female Football team the Super Falcons for qualifying for the Women’s World Cup in Australia and New Zealand in 2023.\nSuper Falcons’ qualification came after their lone goal victory against Cameroon on Thursday night in one of the quarter-finals encounter at the ongoing Women’s Africa Cup of Nations (WAFCON) in Morocco.\nAccording to Buhari, he looks forward to the next generation of upcoming stars, who through hard work, discipline, resilience and determination, will one day win the World Cup for Nigeria.\nThe News Agency of Nigeria (NAN) reports that the 2023 FIFA Women’s World Cup is scheduled to be the 9th edition of the FIFA Women’s World Cup, the quadrennial world championship for women’s national teams organised by FIFA.\nThe 2023 tournament will see the Women’s World Cup expanded from 24 to 32 teams."
  },
  {
    "headline": "Edo rolls out 90-day action plan to improve ease of doing business – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPoised to improve the ease of doing business in Edo State, the state government has developed a 90-day actionable plan to make the state more conducive for business and attract investment.\nThe Managing Director, Edo State Investment Promotion Office (ESIPO), Mr. Kelvin Uwaibi, disclosed this in a chat with journalists in Benin City.\nHe said the new action plan highlights the role of key stakeholders involved in the ease of doing business ecosystem both in the public and private sector, identifying performance metrics for implementing MDA’s, governance structure for handling ease of doing business reforms and implementing the operating model.\nThe Edo State Public Procurement Agency (EDPPA) has ensured transparency in public procurements while the Edo State Investment Promotion Office (ESIPO), ensures a seamless investment process.\n“Through the Edo State Geographical Information System (EDOGIS), land management has been liberalized."
  },
  {
    "headline": "Edo PDP conducts bye-election for House of Reps, State Assembly – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State chapter of the Peoples Democratic Party (PDP), on Thursday, conducted a bye-election to select new candidates to fly the party’s flag in the forthcoming Egor/Ikpoba Okha Federal House of Representatives and State Assembly elections respectively.\nThe election was to fill the vacancy created by the death of the lawmaker representing Egor/Ikpoba Okha Federal Constituency in the House of Representatives, Hon.\nA former member representing Ikpoba Okha Constituency at the Edo State House of Assembly, Mr. Henry Okhuarobo, who had resigned the position to contest, polled 54 votes to win the bye-election held in Benin City.\nI will do my absolute best to ensure that the fortunes of Edo are improved,” Okhuarobo pledged.\nSimilarly, Mr. Nicholas Asonsere, won the PDP ticket for the state House of Assembly with 28 votes to defeat Richard Egharevba and Esosa Ogbeifun."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Bassey Akpan, Akwa Ibom senator dumps PDP",
    "summarized_story": "Bassey Akpan, senator representing Akwa Ibom North-East Senatorial District, has resigned his membership of the Peoples Democratic Party (PDP).\nAkpan, who is the Chairman, Senate Committee on Petroleum Resources (Upstream), made his intention known in a letter he personally signed dated July 15, 2022.\n“Therefore, after an extensive consultation with my God, family, friends, supporters, and well-meaning believers in a just and equitable Akwa Ibom State across the world, it’s obvious that these collective yearnings and aspirations cannot be actualised under the platform of the Peoples Democratic Party (PDP).\n“I am convinced that this action will enable me to take the next positive step to meet the hopes and expectations of Akwa Ibom People.\n“Thank you and may God bless Akwa Ibom State.”"
  },
  {
    "headline": "Germany, WFP, UNICEF donate €40m for IDPs’ support in Borno, Yobe",
    "summarized_story": "The government of Germany in partnership with the World Food Programme (WFP) and UNICEF have funded a €40 million humanitarian package to support vulnerable populations in Borno and Yobe states.\nThe three-year programme targets children from birth up to two years of age, pregnant women, school-age children, adolescent girls, female-headed households, and people with disabilities.\nLeveraging ongoing humanitarian support in Bade LG of Yobe state and Shani LGA of Borno state, the UN-led agencies will also provide interventions to address drivers of conflict and fragility throughout various sectors.\nPeter Hawkins, the UNICEF representative in Nigeria, described the project as “a pathway to peace and sustainable development”.\nProtracted insecurity, high food prices, and COVID-19 lockdowns have left more than four million people in need of food assistance in the Northeast."
  },
  {
    "headline": "Breaking: Court orders increase in salaries of CJN, judges",
    "summarized_story": "The National Industrial Court, NIC, on Friday, effected an upward review of salaries of judicial officers in the country.\nThe court, in the judgement delivered by Justice Osatohanmwen Obaseki-Osagie, noted that salaries of judges and justices have been stagnated for over 14 years.\n“Judicial officers are daily impoverished by the devaluation of the Naira.\nLikewise, the court increased salaries of Court of Appeal Justices, Chief Judges, President of the Industrial Court, Grand Khadis and President of Customary Courts to N8m, even as it ordered FG to forthwith, pay N7m to other judges, monthly.\nThe judgement followed a suit that was brought before the court by a Senior Advocate of Nigeria, SAN, Mr. Sebastian Hon."
  },
  {
    "headline": "Idika Kalu to Gumi: Don’t link Peter Obi with IPOB agitation",
    "summarized_story": "Dr. Kalu Idika Kalu, former minister of finance, has advised Shiekh Ahmad Gumi, a Kaduna based Islamic cleric, against linking Mr. Peter Obi, presidential candidate of the Labour Party with the agitation of the Indigenous People of Biafra (IPOB).\nGumi had in a post, said that the emergence of Obi had slowed down the agitation for Biafra by IPOB members, claiming that the ‘noise’ about Biafra is all about South East clinching the presidency.\nHowever, in an interview with Vanguard, Kalu, said that Obi’s background and upbringing had nothing to suggest what Gumi was insinuating.\nThe former minister further reminded Gumi that IPOB had already denied any ties with Obi, wondering why he will be making unnecessary political capital out of Obi’s ambition.\nKalu noted that he knew the candidates of the major parties but advised Nigerians to choose wisely based on competence."
  },
  {
    "headline": "FG recommends effective PIA implementation in 2021 Debt Sustainability Analysis",
    "summarized_story": "The federal government has recommended an effective implementation of the Petroleum Industry Act, PIA, 2021 which is expected to attract investment in the oil and gas sectorThe recommendation was made in the nation’s Debt Sustainability Analysis (DSA) for 2021 released on Thursday.\nThe DSA identified real Gross Domestic Product, GDP, growth, real interest rate and exchange rate as key challenges that could push up total public debt up this year and in 2023.\nThe DSA posted on the DMO website indicated that Nigeria adopted Market Access Country-Debt Sustainability Analysis (MAC-DSA) framework to conduct its debt sustainability exercise in 2021.\nOn the challenges of growing public debt, the DSA identified “Standard Macro-Fiscal shocks are Primary Balance, real GDP growth, real Interest Rate, real Exchange Rate and Combined Macro-Fiscal.\nAccording to the analysis, “70.48 per cent of FGN’s total public debt stock as at December 31, 2020 was market-based debt, which comprised domestic debt, with a share of 55.42 per cent and External Debt accounting for 15.06 per cent."
  },
  {
    "headline": "BREAKING: Akwa Ibom Senator, Bassey Akpan, Dumps PDP",
    "summarized_story": "Senator representing Akwa Ibom North-East senatorial district of Akwa Ibom State, Albert Bassey Akpan, has resigned his membership of the Peoples Democratic Party (PDP).\nLEADERSHIP reports that Pastor Umo Eno was elected the gubernatorial candidate of the PDP during the primaries in the state.\nThe letter reads; “It is with the greatest sense of responsibility, purpose, and love for my people that I make bold this communication.\n“As you are aware, my aspiration to serve our dear state in the office of the Executive Governor is not personal or selfish but rather the collective ambition of our people, based on the principles of justice and equity, to achieve a better and prosperous Akwa Ibom State.\nI am therefore compelled to resign my membership of the Peoples Democratic Party (PDP) forthwith.”"
  },
  {
    "headline": "BREAKING: Akwa Ibom Senator, Bassey Akpan, Dumps PDP",
    "summarized_story": "Senator representing Akwa Ibom North-East senatorial district of Akwa Ibom State, Albert Bassey Akpan, has resigned his membership of the Peoples Democratic Party (PDP).\nLEADERSHIP reports that Pastor Umo Eno was elected the gubernatorial candidate of the PDP during the primaries in the state.\nThe letter reads; “It is with the greatest sense of responsibility, purpose, and love for my people that I make bold this communication.\n“As you are aware, my aspiration to serve our dear state in the office of the Executive Governor is not personal or selfish but rather the collective ambition of our people, based on the principles of justice and equity, to achieve a better and prosperous Akwa Ibom State.\nI am therefore compelled to resign my membership of the Peoples Democratic Party (PDP) forthwith.”"
  },
  {
    "headline": "Bill Gates Plans To Give Away His Wealth",
    "summarized_story": "One of the world’s richest billionaires, Bill Gates, has vowed to donate most of his wealth to his Foundation in the coming future.\nTo help make this spending increase possible, Bill Gates transferred $20 billion of his own fortune to the foundation’s endowment this month,” he said.\nBill Gates’ net worth historyIn 1986, when Microsoft went public, Bill Gates made $350 million.\nIn 2021, Bill and his ex-wife Melinda Gates announced that they were breaking up after 27 years of marriage.\nTo date, Gates has donated nearly $57 billion to the Gates Foundation."
  },
  {
    "headline": "Bill Gates Plans To Give Away His Wealth",
    "summarized_story": "One of the world’s richest billionaires, Bill Gates, has vowed to donate most of his wealth to his Foundation in the coming future.\nTo help make this spending increase possible, Bill Gates transferred $20 billion of his own fortune to the foundation’s endowment this month,” he said.\nBill Gates’ net worth historyIn 1986, when Microsoft went public, Bill Gates made $350 million.\nIn 2021, Bill and his ex-wife Melinda Gates announced that they were breaking up after 27 years of marriage.\nTo date, Gates has donated nearly $57 billion to the Gates Foundation."
  },
  {
    "headline": "BREAKING: Court Orders Federal Govt To Review Judicial Officers’ Salaries",
    "summarized_story": "The National Industrial Court, Abuja, has ordered the federal government to work out modalities for the immediate review of the salaries and allowances of judicial officers in Nigeria.\nJustice Osatohanmwen Obaseki-Osaghae, who issued the order on Friday, held that the current salaries and allowances of judicial officers in the country were not only abysmally low but embarrassing.\nIn his judgment in a suit instituted against the federal government by a Senior Advocate of Nigeria, Chief Sebastine Hon, Justice Obaseki-Osaghae ordered the federal government to commence a monthly payment of N10million to the Chief Justice of Nigeria (CJN), N9 million to other justices of the apex court and President of Court of Appeal, while other justices of the appellate court should get N8million, Chief Judges of both Federal and States HIgh Courts N8million while judges of the Federal and States High Courts should earn N7million.\nThe judge held that the refusal of the government to review the judicial officers’ salaries and allowances for 14 years was unconstitutional, unlawful and should be compelled to do the needful.\nJustice Obaseki-Osaghae lamented that it was unfortunate that justices and judges who are ministers in the temple of Justice have become victims of injustice in the country."
  },
  {
    "headline": "Muslim-Muslim Ticket: Tinubu Will Take Bold Steps If Elected President – Oshiomhole",
    "summarized_story": "Adams Oshiomhole, a former national chairman of the All Progressives Congress (APC), has endorsed the Muslim-Muslim presidential ticket.\nBola Tinubu, the APC presidential candidate, made the proper choice, in Oshiomhole’s opinion, in selecting Borno Senator Kashim Shettima as his running mate.\nHe pointed out that Tinubu’s selection of Shettima demonstrated his willingness to make risky decisions if elected president in 2023.\nOshiomhole said: “The more opposition party joined the Muslim-Muslim debate, the more I’m satisfied that Asiwaju Bola Tinubu’s decision is right.\nTinubu’s decision shows that he will take bold steps when elected."
  },
  {
    "headline": "2023: I Have Millions Of Followers To Defeat APC – Funke Akindele",
    "summarized_story": "The Peoples Democratic Party’s (PDP) deputy governor candidate for Lagos State, Funke Akindele, has stated why she will defeat the All Progressives Congress (APC) in the 2023 election.\nRecall that the APC had said that Funke, the PDP’s deputy gubernatorial candidate, had nothing to offer and would lose the upcoming poll.\nIn addition to her social media fans, she bragged about how many people in Lagos State at large adore her.\nFunke said: “I have the numbers, I have fans and followers and I’m true to myself.\n“I have fans at the grassroots level outside Ikorodu ready to support me and I’m true to myself."
  },
  {
    "headline": "Why Wike Didn’t Attend Osun PDP Rally – Official",
    "summarized_story": "Rivers State Governor Nyesom Ezenwo Wike may have been absent at grand rally of the Peoples Democratic Party (PDP) in Osun State due to his current foreign trip.\nA source close to Government House, Port Harcourt, told LEADERSHIP that Wike was yet to return to the country after attending his son’s graduation in the United Kingdom (UK).\nThe source said: “You know that if Governor Wike is in Nigeria, everyone will know.\nNwuke said, “The truth is that you know that are issues in the PDP that have not been resolved.\nOne can say clearly that Wike loves his party but, you don’t also expect him to be there when the coast is not clear.”"
  },
  {
    "headline": "BREAKING: Baba Ijesha found guilty of sexual assault of minor",
    "summarized_story": "Justice Oluwatoyin Taiwo of the Ikeja Domestic Violence and Sexual Offences Court has sentenced Nollywood actor and comedian, Olanrewaju James, popularly known as Baba Ijesha, to 16 years imprisonment over sexual assault.\nBaba Ijesha is facing six counts of child defilement that include indecent treatment of a child, sexual assault, attempted sexual assault by penetration and sexual assault by penetration.\nDuring the trial, six prosecution witnesses testified against him.\nThe defence witnesses were Baba Ijesha (defendant) and Mr Lawrence Ayeni, an expert in video production and CCTV installation and maintenance.\n“We have a compelling evidence of six prosecution witnesses which I must say are not contradictory."
  },
  {
    "headline": "Osun 2022: Court voids Adeoti’s move to stop Oyetola’s return",
    "summarized_story": "Justice Ekwo held that there was no iota of law supporting the plaintiff (Adeoti)’s process filed before the court.\nIn the suit, the plaintiff listed the APC, Oyetola and Independent National Electoral Commission (INEC) as 1st, 2nd and 3rd defendants respectively.\nAtiku urges Osun votersIn a another development, the Peoples Democratic Party(PDP) presidential candidate, former Vice President Atiku Abubakar has urged voters in Osun state to protect and curb the ruling party from stealing their votes again.\nINEC moves sensitive materials to LGAsAhead of the Saturday governorship election in Osun state, the Independent National Electoral Commission (INEC) Thursday moved the sensitive materials to the 30 local government areas.\n“The first batch of the Commission’s delegation arrived Osun state on Tuesday, July 12, while the second batch are expected in the various Local Government Areas today Thursday July 14, 2022."
  },
  {
    "headline": "Buhari to Armed Forces: Wipe out terrorists, return peace to Nigeria",
    "summarized_story": "President Muhammadu Buhari has ordered the Nigerian Armed Forces to confront terrorists, wipe them off the face of the earth and return peace and security to the country.\nHe said the last 12 years had been very challenging for Nigeria, considering the different security threats that besieged the country.\n“The response of the Armed Forces of Nigeria to the Boko Haram insurgency, banditry, militancy, kidnapping as well as the activities of separatists and armed militias amongst others have been commendable.\nYou must endeavour to make honest and positive contributions in the discharge of the constitutional responsibilities of the Armed Forces of Nigeria, your strategic ministries, department and agencies and be good ambassadors of the Armed Forces Command and Staff College.\n“Also, about 3,858 Boko Haram terrorists and their families surrendered between July 1 and July 14, comprising 505 males, 1,042 females and 2,311 children,” he said."
  },
  {
    "headline": "Breaking: Donald Trump’s first wife is dead",
    "summarized_story": "Ivana Trump, Donald Trump’s first wife and the mother of three of his children, has died aged 73.\nAfter their separation, Ms Trump went on to launch her own lines of beauty products, clothing and jewellery.\nBut Mr Trump’s claims that she was an alternate on the 1972 Winter Olympics team were refuted in 1989 by a local Olympic official.\nOver the course of their marriage, Ms Trump held several roles within the Trump Organization, including as manager of the Plaza Hotel in Manhattan.\nBut Mr Trump reportedly locked her out of her office at the hotel in 1990 as they sparred over four pre-nuptial agreements."
  },
  {
    "headline": "X-raying reforms in SEC and uncanny zeal for investment space",
    "summarized_story": "Also, the Yuguda-led executive management team has been implementing capital market development goals set out in the Capital Market Master Plan (CMMP) (2015-2025) and successfully completed the review of CMMP to realign the initiatives/deliverables to prevailing market conditions and keep the document relevant in the dynamic capital market due to issues related to Fintech, sustainability and regional integration.\nThis is even as it processed six Schemes of Merger, seven Acquisitions, 21 Corporate Restructurings, and three Takeovers during the period.\nUnder his leadership, rules for the integrated West African Capital Market were developed and reviewed.\nOn human capital development, the Commission had in 2019 conducted an internal capacity assessment that outlined staffing deficits and needs.\nThe Commission has also secured counterpart funding of $450,000 from AfDB on its Nigeria Securities Market Surveillance System Project to support the deployment of a real-time market surveillance system for the Nigerian capital market."
  },
  {
    "headline": "TAJBank opens new branch to deepen financial inclusion",
    "summarized_story": "…as excited traders jostle to open accountBY Kehinde IbrahimTAJBank Ltd, a leading non-interest hank, has continued its service and financial inclusion drive with the opening of a new, technology-powered branch in Wuse 2, Abuja.\nThe opening of the new branch brings the lender’s growing branch network to 22 within its first two years of operation.\nJoda explained: “The opening of the new branch is to continue with our strategy of ensuring that we take the TAJBank brand to all the nooks and crannies of the Country with the aim of addressing the service needs of our teeming customers.\n“We understand that Customers want to do business and sometimes someone to give them that advisory service they yearn for which in turn will help to address their financial challenges”, he added.\nThe non-interest bank is also set to launch Nigeria’s first private sector Sukuk offering under a N100 billion programme."
  },
  {
    "headline": "NES28 to rally stakeholders for sustainable economic growth",
    "summarized_story": "While welcoming participants to the event, the chairman of the NESG, Mr Asue Ighodalo, said that the annual Nigerian Economic Summits had been sustained as a public-private dialogue platform by the NESG (representing the private sector) and the Federal Ministry of Finance, Budget and National Planning (representing the Federal Government of Nigeria).\nHe noted that the Summit is a foremost platform through which the federal and state governments engage with corporate leaders and discuss Nigeria’s national and sub-national economic realities to co-create reform strategies that are critical for the advancement and reform of the Nigerian economy.\nMr Ighodalo stated that the vision of a secure, developed, prosperous and macro-economically stable country where the rule of law prevails and no one is left oppressed appears dimmed with today’s considerable headwinds, but the current electoral cycle offers a unique opportunity to reflect and reset.\nHe noted that the challenge of non-inclusive economic growth reflects low productivity across employment-elastic sectors, which continues to weaken their capacity to create more job opportunities and decent employment.\n“Government has a pivotal role in jump-starting and addressing with utmost urgency six critical challenges including non-inclusive economic growth, macroeconomic instability, infrastructure deficit, human capital deficit and skills gap, national insecurity and weak economic competitiveness,” he stated."
  },
  {
    "headline": "Danger as Naira hits N620/$ at parallel market",
    "summarized_story": "Naira yesterday fell to N620 per dollar at the parallel market amid the lingering scarcity of the greenback.\nCurrency traders known as Bureaux De Change operators (BDCs) said there was increased demand for the dollar by importers at the street market.\nThe traders put the buying price of the dollar at N614 and the selling price at N620, leaving a profit margin of N6.\nAccording to the Central Bank of Nigeria (CBN), the parallel market is not a true reflection of the country’s exchange rate.\nOn Tuesday, the euro fell to parity against the dollar for the first time in almost 20 years."
  },
  {
    "headline": "GPMI Congratulates Air Peace over flight operations to China",
    "summarized_story": "The Global Peace Movement International, UK has congratulated the Chairman and CEO of Nigeria’s largest carrier, Air Peace, Allen Onyema on the inaugural flight ceremony from Lagos to Guangzhou, China at the Murtala Muhammed International Airport, Ikeja, Lagos on Wednesday.\nPresident General, Dr. Mike Uyi in a statement on Thursday commended the airline and its CEO for the bold move to reposition the nation’s aviation industry.\nUyi said this step by Air Peace, Nigeria can now compete in the international, regional and domestic air travel market to regain what the country has lost over the years to foreign airlines.\nHe also noted that with the increase in capacity, it is expected that Air Peace would open new frontiers, new destinations both in Africa and beyond and in doing so, create more job opportunities for Nigerians.\n“This is a significant step for an accomplished man whose visionary airline is already employing over 3000 Nigerians and turning their economic fortunes around,” Uyi said."
  },
  {
    "headline": "2023: PDP Sues INEC, APC And Labour Party, Wants Shettima And Baba-Ahmed Barred As VP Candidates",
    "summarized_story": "The Peoples Democratic Party has instituted a lawsuit at the Federal High Court in Abuja, praying the court to compel the Independent National Electoral Commission to prevent the Presidential Candidates of the All Progressives Congress, Bola Tinubu and Labour Party, Peter Obi, from replacing their running mates with Senator Kashim Shettima and Senator Datti Baba-Ahmed.\nThe PDP is also asking the court to declare that Tinubu and Obi be disqualified unless they contest alongside their previous running mates – Kabiru Masari and Doyin Okupe.\nIn the originating summons, the PDP is seeking an order barring the Independent National Electoral Commission from replacing the running mates of Tinubu and Obi.\nREAD ALSO: Osun Election: INEC Begins Distribution Of Sensitive MaterialsThose listed as first to seventh respondents in the case are INEC, APC, Tinubu, Masari, Labour Party, Obi and Okupe, respectively.\nThe party asked the court to rule that both Tinubu and Obi will be disqualified the moment they substitute the names of their running mates."
  },
  {
    "headline": "Court Orders Upward Review Of Judges Salaries",
    "summarized_story": "Justice Osatohanmwen Obaseki-Osaghae of the National Industrial Court in Abuja has ordered the Revenue Mobilisation Allocation and Fiscal Commission to immediately put in place a machinery to start the upward review of salaries to some judicial officers.\nThe Senior Advocate had approached the court to seek a salary increase for Nigerian judges.\nREAD ALSO: Industrial Court Set To Deliver Judgement On Judges Welfare SuitIn his ruling, Justice Obaseki-Osaghae also ordered an upward review of the salaries of the affected judicial workers every year or at most every two years.\nBefore ruling on the case, Justice Obaseki-Osaghae ruled on the issue of jurisdiction, holding that the claimant has shown sufficient reason and thus has jurisdiction over the claims.\nThe case had progressed at the court after earlier efforts by the National Assembly and the National Judicial Council to have an out-of-court settlement failed."
  },
  {
    "headline": "Osun Election: INEC Begins Distribution Of Sensitive Materials",
    "summarized_story": "With the Osun governorship election barely 24 hours from now, the Independent National Electoral Commission (INEC) has commenced the distribution of sensitive materials to all the 30 local government areas of the state.\nINEC officials moved the materials amid tight security on Thursday night at the commission’s headquarters located along Gbongan/Osogbo road.\nWhile handing out the materials, the Osun State Resident Electoral Commissioner, Prof. Abdulganiy Raji said the electoral officers would take the items to their councils where they would be sent to the polling units on Saturday morning.\nREAD ALSO: Atiku, Okowa, Davido Woo Osun Voters For AdelekeAccording to him, the move is to ensure efficient delivery of the items to the polling units on Saturday.\nBoth men will slug it out on Saturday with the people of Osun State to decide who will govern them for the next four years."
  },
  {
    "headline": "Six Boko Haram Commanders Surrender As Troops Neutralise 42 Terrorists",
    "summarized_story": "Troops of HADIN KAI have continued to take the battle to Boko Haram Terrorists/Islamic State of West Africa Province enclaves with more coordinated operations leading to the surrendering of six top terrorists Commanders.\nAccording to him, the terrorists leaders surrendered to the troops in Gwoza on Wednesday, July 13.\n“Also, about 3,858 Boko Haram Terrorists and their families surrendered between 1 – 14 July 2022, comprising 505 male, 1,042 Female and 2,311 children,” General Onyeuko disclosed.\nGeneral Onyeuko said the successful airstrike neutralized several Boko Haram Terrorists and destroyed their hideout.\nThe military spokesman said all surrendered Boko Haram/Islamic State of West Africa Province terrorists and their families were profiled and documented while all recovered items and apprehended suspected terrorists were handed over to the appropriate authority for further action."
  },
  {
    "headline": "We Need PDP To Take Over, People Want To Right The Wrongs – Funke Akindele",
    "summarized_story": "“You need a party with a structure if you want to win, a viable party and you need PDP to take over.”This is the assertion made on Thursday by the Lagos state deputy gubernatorial candidate of the Peoples Democratic Party(PDP), Funke Akindele during Channels Television’s flagship programme, Politics Today.\nFunke, a popular Nollywood actress and content creator was surprisingly picked as the running mate to Olajide Adediran who described her as large-hearted with a well-known history of service and advocacy.\nHowever, the move by Adediran popularly known as Jandor has been greeted with much scepticism in many quarters.\nI have faced different challenges as a Lagosian and I looked at it; are we going to continue like this?\nLagos is suffering from infrastructural decay and deficit.”Not A FigureheadIn her role to influence policies and critical decision-making as deputy governor, the actress said “Dr Olajide Adediran has a listening ear, he carries his people along."
  },
  {
    "headline": "Updated: Segun Oni petitions Tribunal over Ekiti Guber result",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship Poll, Segun Oni Has filed a Petition Challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.Submitting his Petition at the State High Court, the Former Governor says he is of the believe that he won the election and his petition will prove sameHead of the Legal Team, Obafemi Adewale says the Candidate is challenging the result based on irregularities before and during the election and Questions specifically the Legality of the announced Candidate.\nAdvertisementIt could be recalled that Segun Oni was the runner up at the Election where he polled a total of 82,211 votes against the Winner, Biodun Oyebanji of the APC as announced by INECAdvertisement"
  },
  {
    "headline": "Ekiti 2022: Oni files suit against Oyebanji's victory",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship poll, Segun Oni has filed a petition challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.\nDetails shortlyAdvertisementAdvertisement"
  },
  {
    "headline": "Usifo Ataga’s murder: Chidinma's trial stalled over absense of lawyer",
    "summarized_story": "The trial of undergraduate, Chidinma Ojukwu, an alleged killer of Super TV boss, Usifo Ataga, was stalled on Thursday following the absence of her lawyer.\nAdvertisementMs Ojukwu is standing trial for the alleged murder, stealing, and forgery alongside her sister, Chioma Egbuchu, and one Adedapo Quadri.\nAdvertisementAdvertisementBut lawyers to the first and second defendant said they were not aware of their colleague’s absence.\nAdenike Oluwafemi, the state’s lawyer, told the court that they were disappointed that Mr Egwu was unable to call them.\nAdvertisementShe also mentioned that their witness was in court.https://www.tvcnews.tv/2022/07/oyo-court-fixes-july-26-to-deliver-judgment-against-deputy-governor/However, another lawyer, C.J Jiakeponna announced appearance for the third defendant, Ms Egbuchu."
  },
  {
    "headline": "Bamise: Court orders BRT driver Andrew Nice to hire new lawyer",
    "summarized_story": "AdvertisementJustice Sonaike issued the order following the absence of Andrew Nice’s counsel Abayomi Omotubora.\nThe court also forewarned that it would order the Legal Aid Council to take up his case if he fails to show up for the next adjourned date without a lawyer.\nMr Omotubora was absent in court again on Thursday, resulting in another adjournment, but this time the judge expressed his displeasure with the situation.\nThe AG said ” The matter was adjourned till today on 30th June 2022, in the presence of counsel for the defence.\nI would be urging the court to ask the defendantt for the whereabouts of his counsel, before I make any necessary application”."
  },
  {
    "headline": "Biden to Meet Saudi Crown Prince Amid Criticism, Oil Tensions",
    "summarized_story": "White House advisers have declined to say whether Biden will shake hands with the prince, the kingdom’s de facto ruler.\nBiden said he would raise human rights issues in Saudi Arabia, but he did not say specifically if he would broach the Khashoggi murder with its leaders.\nread more“Thanks to months of steady diplomacy between my administration and Saudi Arabia, it is finally a reality,” Biden said in a statement.\nSunni Muslim Saudi Arabia and Shi’ite Muslim Iran have for years vied for regional influence but launched direct talks last year in an effort to contain tensions.\nDuring his visit to Israel, Biden and Prime Minister Yair Lapid signed a joint pledge to deny Iran nuclear weapons, which the Islamic Republic denies seeking."
  },
  {
    "headline": "Sri Lanka Swears In Acting Leader after Mass Protests",
    "summarized_story": "Sri Lanka’s prime minister Ranil Wickremesinghe has been sworn in as acting president as the country reels from an economic crisis and unrest.\nHe replaces Gotabaya Rajapaksa who fled to Singapore after unprecedented mass protests which saw demonstrators overrun the presidential palace.\nSri Lanka is experiencing economic chaos as it faces an acute shortage of food, fuel and other basic supplies.\nSri Lanka: The basicsSri Lanka is an island nation off southern India: It won independence from British rule in 1948.\nHis brother Gotabaya, who was defence secretary at the time and later became president, fled the country after mass unrest."
  },
  {
    "headline": "Nigeria, China Sign Agreement on Intellectual Security Project",
    "summarized_story": "Nigeria and China, have signed a bilateral intellectual agreement to find lasting solutions to the challenges of insecurity in both countries.\nSpeaking on the Nigeria, China bilateral intellectual agreement, the Chinese Ambassador to Nigeria, Cui Jianchun, said, Nigeria and China have challenges of insecurity and that the two countries need to work together in harmony to ensure peace in both countries, Africa and the world.\n“Both China and Nigeria have issues of insecurity, we need peace, therefore, we must work together to find resolutions to these problems.\nHis words: “We are looking at ways through which we can make Nigeria a developed country and the rest of Africa as well through infrastructure, ICT and good governance.\nContributions to the magazine will be 60% China, 40% Nigerian and the magazine will cost N1000 due to subsidy from the Chinese."
  },
  {
    "headline": "Nigeria: Brigade of Guards Tightens Security in Abuja Over Terror Fears",
    "summarized_story": "The Armed Forces of Nigeria are working tirelessly to enhance their combat effectiveness, operational capability and training necessary to eliminate the threats, in synergy with other institutions and nations.\nThis occasion provides me another opportunity to briefly reflect on the state of the Nigerian nation, particularly, regarding national security.\n“Our government is poised to promote national security and development, as well as to remain committed to promoting a vision of a secure, safe, just, peaceful, prosperous and strong Nigeria.\nAjose equally promised to sponsor sporting activities and competitions among corps members in the camp for harmonious coexistence to thrive.\nResponding, Muhammed thanked the Nigerian Army for vowing to secure the lives and property of Corps members in the state."
  },
  {
    "headline": "Osun Election Will Herald an End to APC’s Reign in Nigeria, Atiku Says",
    "summarized_story": "Presidential candidate of the Peoples Democratic Party, Alhaji Atiku Abubakar, on Thursday, said a PDP victory in the Osun State governorship election on Saturday will bring an end to the reign of the ruling All Progressives Congress in the country.\nBut mild tension erupted Thursday in Osogbo, the Osun State capital, when the government reportedly denied the PDP use of the Osogbo township stadium for its planned mega rally.\nIt has the power of descriptiveness.”On the popularity of the PDP candidate, Atiku said, “By my understanding, the slogan of Imole as the brand identity of the Peoples Democratic Party (PDP) gubernatorial candidate in the Osun State election could not have been more apt.\nFielding questions after the mega rally in Osogbo, the PDP presidential candidate said, “It is a social media drama.\nA statement by Samson Itodo, Executive Director, Yiaga Africa and Ezenwa Nwagwu, a board member, Yiaga Africa, lamented the possibility of vote buying in the Osun election."
  }
]