[
  {
    "headline": "PDP, Zulum disagree over resettled IDPS",
    "summarized_story": "“We have seen instances where insurgents offered as low as between N5,000 and N10,000 to recruit some spies and weapons smugglers,” he said.\nThe governor said this made his administration to regularly visit internally displaced persons at all camps in the state to deliver food, cash and clothing.\nMahdi said without security, the resettled locals could easily be recruited by Boko Haram.\nHe said, “How could they resettle these poor people to these communities when they know very well that these places are not safe for habitation?\n“I expected the state government to ensure the terrorists are cleared from the destroyed communities first before resettling the people."
  },
  {
    "headline": "NAHCON to refund pilgrims as Saudi Arabia cancels 2021 Hajj",
    "summarized_story": "The commission promised that pilgrims who requested refunds of their deposits for Hajj would be granted the request without delay.\nThe statement read, “NAHCON has received news of the cancellation of Hajj for international pilgrims for the 2021 season.\nThe commission’s officials in Saudi Arabia have confirmed that state television and radio stations in the Kingdom have announced the news.\n“NAHCON respects the decision of Saudi Arabia in this regard, no matter how painful that decision may be to us and to intending pilgrims worldwide.\n“As in the previous year, those pilgrims who request refunds of their deposits for Hajj will be granted such without unnecessary delay."
  },
  {
    "headline": "Insecurity: Army laments high rate of injured soldiers, Senate visits military hospital",
    "summarized_story": "Onuchukwu had while briefing his visitors, said some of the wounded soldiers were maimed for life and required cutting-edge medical facilities to keep them alive .\n“While some of such wounded personnel got treated and discharged with different forms of deformities, some are maimed for life .\n“Our armed forces deserve all the support from all the citizens of Nigeria because they are fighting on our behalf.\n“To do otherwise is to be unfair to the armed forces.\n“I want to assure you once more that beyond the supplementary budget, in 2022, we will provide more resources for our armed forces and I hope that the armed forces will be prioritised."
  },
  {
    "headline": "Southeast leaders reaffirm commitment to one united Nigeria",
    "summarized_story": "Leaders of the southeast geopolitical zone, have said the people are not disposed to the call for secession from Nigeria.\nThe leaders hinted that no other tribe has demonstrated belief and commitment to the unity of the country more than the southeast.\nIn a release made available to DAILY POST by Onyebuchi Ememanka, the Chief Press Secretary to Governor Okezie Ikpeazu of Abia State, the acclaimed southeast leaders, reaffirmed their commitment to the sustenance of a united Nigeria where there is justice, equity and equality of all Nigerians.\nThey explained that what the people of the South East are demanding is a country where there is equal treatment of all citizens and that those calling for the secession of the South East do not speak for the people.\nThe Southeast leaders further assured that they will hold another meeting later in June after which they will meet with the President."
  },
  {
    "headline": "June 12: Why Abiola was not honoured in Jonathan's administration",
    "summarized_story": "Hafsat Abiola-Costello, daughter of Moshood Olawale (MKO) Abiola has revealed how former President Goodluck Jonathan turned down Rauf Aregbesola’s advice to honour her father.\nShe recalled that long before President Muhammadu Buhari assumed power, Aregbesola, the Interior Minister pressed for recognition for Abiola as a former President.\nYou know that recently President Muhammadu Buhari honoured MKO but Ogbeni had been working on it.\n“And well before President Buhari was President, when we had President Jonathan, Ogbeni also approached Jonathan to make an appeal that MKO be honoured.\nSo, it was not something that was carried out eventually.”In 2018, Buhari honoured the late business mogul, philanthropist and sports lover with the highest honour in the country."
  },
  {
    "headline": "June 12: Many who voted for Buhari are now dead",
    "summarized_story": "According to him, “Buhari has indeed let down his supporters, he has considerably disappointed those who voted him in as President.\nBuhari has failed woefully in his primary assignment to secure the lives of the citizens who are his subjects.\nIt is ridiculous that Buhari came out to score himself that he has not performed badly and that people should objectively assess his government.\n“One cannot but re-echo Sunny Okosun song of yesteryears ‘Which way Nigeria, which way to go?\nIt will certainly be a very big relief to many Nigerians.”Bamgbose advises Buhari on appointment of new Chief of Army Staff"
  },
  {
    "headline": "Olumba Olumba insists Nigeria will not divide, says agitators are doomed",
    "summarized_story": "Spiritual Leader, the Brotherhood of the Cross and Star, Olumba Olumba Obu has insisted that Nigeria can never be divided and that agitators are doomed.\nHe said all those fanning embers of secession, plotting to take over the government and sponsoring killings are doomed and will be arrested.\nHe said Nigeria is God’s own country, emphasising that all those threatening her existence have been arrested by spiritual forces.\nAll those fanning embers of division, sponsoring killings and threatening her existence are doomed.\nOlumba Olumba cautions christians"
  },
  {
    "headline": "22 years of democracy is worth celebrating",
    "summarized_story": "Governor Ahmadu Fintiri of Adamawa State has praised the courage and desire of the Nigerian citizenry to allow democracy thrive after two decades of it.\nThe governor, in a statement to newsmen by his Press Secretary, Humwashi Wonosikou, said that 22 years of uninterrupted democracy is indeed something to thank God for.\nHe stressed that democracy is at the heart of addressing the defining challenges of the times with rising regional agitations, insecurity, poverty and the COVID-19 pandemic.\n“Today, we celebrate the return to civil rule, the restoration of our dignity and the democratic resilience we have built over the last two decades,” Fintiri stated.\n“The projects spread across the state represents the value and meaning of Democracy Day.”Nigerians losing money to fraudulent investment schemes – EFCC"
  },
  {
    "headline": "June 12: Streets deserted, businesses shut in Lagos, Abuja, Calabar, others",
    "summarized_story": "CSOs, NAOS stage peaceful protest in OsogboThe Osun Civil Society Coalition and the National Association of Osun Students (NAOS) held a peaceful protest in Osogbo, calling for a better Nigeria.\nEnugu residents shun protestResidents of Enugu shunned the Democracy Day protest championed by the Save Nigeria Group (SNG) in parts of the country.\nNigerians stage #June 12 protest in LondonSome Nigerians residing in the United Kingdom also staged a protest to mark Democracy Day.\nPDP condemns clampdown on protestersThe opposition Peoples Democratic Party (PDP) yesterday condemned what it called a clampdown on peaceful protesters on Democracy Day.\nShe said: “We give thanks to Mr. President for formerly declaring this day as Democracy Day."
  },
  {
    "headline": "June 12: Democracy is at work in Edo – Dep Gov",
    "summarized_story": "By Bisi Olaniyi, Southsouth Bureau ChiefDeputy Governor of Edo State, Philip Shaibu, has stated that the people’s democracy has come to stay on June 12, which he says is at work in the state.\nHe made the declaration yesterday in Benin in his goodwill message to mark this year’s Democracy Day, while calling on all residents of the state to develop attitudinal change in their approach to governance.\nShaibu, a former member of the House of Representatives, said: “Edo State has every reason to celebrate this year’s Democracy Day, because we are the model state of true democracy in Nigeria.\nThe reality of democracy was demonstrated during the September 19, 2020 governorship election, as only the voice of the people prevailed.\nADVERTISEMENT“The May 28, 2021 landmark judgment of the Supreme Court on Edo governorship election shows that democracy has been given its pride of place in Nigeria."
  },
  {
    "headline": "Wike orders demolition of identified criminal hideouts in Rivers",
    "summarized_story": "By Mike Odiegwu, Port HarcourtRivers State governor, Nyesom Wike, has ordered the demolition of all criminal hideouts in Ahoada, Elele, Eleme and Onne to prevent any attempt by any group or individuals to undermine security of the state.\nThe governor said criminals were already coming to terms with the reality that Rivers is too hot for them to invade at will and carry out their foolish attacks on targeted security posts and personnel.\nWike, who spoke in state broadcast on Friday, said: “This was the reason we ordered the destruction of all the shanties and makeshift structures located along Elele to Ahoada expanse of the East–West road to deny the criminals the opportunity to continue to undermine our security from these hideouts.\nADVERTISEMENT“We have equally decided to destroy all the shanties, illegal shops and mechanic sheds along the Eleme to Onne stretch of the East-West road having discovered these places are also as hideouts and operational bases for criminals and criminal activities in the state.\nHe, however, emphasised that the government was merely discharging its constitutional responsibility to advance the collective security of all with no ethnic targets or political sentiments."
  },
  {
    "headline": "NDLEA intercepts 100,000 bottles of codeine syrup at Onne Port",
    "summarized_story": "By Nicholas Kalu, AbujaThe National Drug Law Enforcement Agency (NDLEA) has intercepted over 100,000 bottles of codeine syrup, weighing 15,325kg, at the Onne Seaport, Port Harcourt, Rivers State.\nDirector, Media & Advocacy, NDLEA , Abuja, Femi Babafemi, disclosed this in a statement on Saturday.\n“In a related development, NDLEA operatives at the Nnamdi Azikiwe International Airport, Abuja, NAIA, have seized nine cartons of khat, weighing 146.95kilograms at the cargo wing of the airport.\nGeneral Mohamed Buba Marwa (Retd) has hailed the synergy among various government agencies at the Onne port and charged them not to rest on their oars as they daily work hard to keep Nigeria safe.\n“‘The damage 100,000 bottles of codeine would have done to our youths if they had slipped through the port to our villages, towns and cities is unimaginable."
  },
  {
    "headline": "June 12: FCT police disperse Shiite members, others from carrying out protest in Abuja",
    "summarized_story": "Molly Kilete, AbujaThe Federal Capital Territory (FCT), Police Command said it has successfully dispersed members of the proscribed Islamic Movement of Nigeria (IMN)-Shiites and other groups from taking advantage of the June 12 democracy day to embark on protest in the nations capital.\nFCT command Police Public Relations Officer, Yusuf Mariam, who made this known, said some members of the group had gathered around the Apo-Gudu axis of the FCT, to incite public disturbance were dispersed and prevented from breaching public peace.\nYusuf in a statement said,“The FCT Police Command on Saturday, 12th June, 2021 successfully restored calm at Apo-Gudu axis after professionally dispersing a protest by some members of the proscribed* Islamic Movement of Nigeria (IMN)-Shiites and others targeted at inciting public disturbance and breaching public peace.\n“Consequently, the action of the Command was necessitated by the concerns of some agitated residents.\n“The Command implores residents to remain calm and law-abiding while reaffirming its unwavering commitment to the protection of lives and property within the FCT”."
  },
  {
    "headline": "BREAKING: Again, herdsmen kill six farmers in Nasarawa State",
    "summarized_story": "By Leo Nzwanke, LafiaAbout six farmers are said to have been killed by suspected herdsmen in keana local government area of Nasarawa state.\nConfirming the killings, President, Tiv Development Association (TIDA) Nasarawa State Comrade Peter Ahemba said that about six Tiv farmers in Nasarawa State were killed by suspected herdsmen.\nComrade Ahemba said the suspected Fulani herdsmen evaded Tse-Jimin village, Aloshi kingdom of Keana local government at about 9:45pm yesterday.\nComrade Ahemba also said those killed are Batholomi Yahaya, Mnena Gideon, Ityokugh Yakubu, Timothy Aye, Ababi Tsavbee and Blessing Oliver.\nThe TIDA president said one of the woman who survived the attacked confirmed that they were Fulani herdsmen."
  },
  {
    "headline": "Full text of President Muhammadu Buhari's Democracy day 2021 address – The Sun Nigeria",
    "summarized_story": "It is a celebration of freedom and a victory for one people, one country and one Nigeria.\nI have also recently approved the National Poverty Reduction with Growth Strategy Plan that augments existing plans to further reduce poverty in Nigeria.\nI am very convinced that this 100 million target can be met and this informed the development of a National Poverty Reduction with Growth Strategy.\nThe day I joined the Nigerian Army I was prepared to lay down my life for Nigeria.\nI thank you for your patience and attention and more importantly your resolve to join hands in making Nigeria the country of our dream."
  },
  {
    "headline": "I’m lazy in bed –Eka Duke",
    "summarized_story": "For Nollywood actress, Eka Duke, being good in bed is a natural gift; it has nothing to do with where you come from.\nAs a matter of fact, Duke is against the notion that Calabar girls like her have special prowess in sex matters.\nAccording to the microbiology graduate, being good in bed is nothing but a gift; it has nothing to do with being Calabar girl.\n“It is generally assumed that Calabar girls are very good in bed and also good at taking care of their men.\nAs for me, I’m very lazy in bed."
  },
  {
    "headline": "June 12: Embrace democratic virtues, Kalu tells political class",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has called on the political class to demonstrate and uphold the tenets of democracy in all endeavours.\nCommending the President Muhammadu Buhari-led Federal Government for its concerted efforts in repositioning the country, Kalu stressed that the President has built critical infrastructure across the nation.\nIn a goodwill message in commemoration of this year’s democracy day, Kalu commended Nigerians for embracing democracy, adding that the country has benefited from the dividends of democracy.\n“The political class, regardless of party affiliations, should support the president’s agenda of building a prosperous Nigeria.\n“The political class should emulate the qualities of the late Chief M.K.O Abiola, who was a widely accepted business mogul and political leader beyond the shores of Africa."
  },
  {
    "headline": "Buhari: I Joined Army Prepared to Die for Nigeria, As President I’ll Defend Its Corporate Existence",
    "summarized_story": "President Muhammadu Buhari has said that he was prepared to die for Nigeria the day he joined the army, vowing that as President, he will defend the country’s corporate existence.\n“Overcoming the present challenges is but one of a necessary process that we have to undergo as a nation so that we can come out stronger.\nThe day I joined the Nigerian Army I was prepared to lay down my life for Nigeria.\n“As your President I remain ever committed to upholding and defending Nigeria’s corporate existence,” the president said, in a national broadcast to mark Nigeria’s 2021 Democracy Day Saturday.\nPresident Buhari said, “overcoming the present challenges is but one of a necessary process that we have to undergo as a nation so that we can come out stronger.”He further said, “My strong belief in the Nigerian spirit gives me comfort that we are facing these challenges with renewed commitment to keep our country one.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: I Will Ensure Security, Welfare of Nigerians",
    "summarized_story": "President Muhammadu Buhari has said that he will do all within his power to ensure that the security and welfare of Nigerians remain the primary purpose of government.\nSpeaking during a broadcast to commemorate the 2021 Democracy Day, the president said: “In adhering to the Fundamental Objectives and Directive Principles of State Policy notably section 14(2)(b) I shall do all within my power to ensure that the Security and welfare of the people remain the primary purpose of government.\n“I have, throughout my tenure, provided the security agencies with all they require relative to available resources and will be providing more as the dynamics unfold to put an end to our security problems.”Details.\nlater..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "On Democracy Day, Buhari Vows to Punish ‘Enemies of State’",
    "summarized_story": "In his Democracy Day message, Tinubu called on Nigerians to defend democracy, saying good democratic governance is the only solution to various challenges confronting Nigeria.\nDemocratic good governance offers the only reasonable solution to the challenges confronting Nigeria.”Going further, he said, “We must stand for democracy today.\nWithout his historic effort and sacrifice, this day would not be democracy day.\nThey will not go away quietly or in consideration of the compelling logic of democratic governance.\nThe real end product of democracy should be good governance.”The former senate president said that it was obvious that in Nigeria, democracy had not given birth to good governance."
  },
  {
    "headline": "For the Record: Buhari’s Democracy Day Speech",
    "summarized_story": "Fellow Nigerians,I join you all today to commemorate and celebrate our Democracy Day.\nI have also recently approved the National Poverty Reduction with Growth Strategy Plan that augments existing plans to further reduce poverty in Nigeria.\nI am very convinced that this 100 million target can be met and this informed the development of a National Poverty Reduction with Growth Strategy.\nThe day I joined the Nigerian Army I was prepared to lay down my life for Nigeria.\nSpeech by President Muhammadu Buhari, on the celebration of Democracy Day on June 12, 2021Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Condoles with Families of Fallen Soldiers, Victims of Insecurity",
    "summarized_story": "President Muhammadu Buhari has sent his condolences to the families of military personnel who lost their lives in the line of duty and Nigerians who are unfortunate victims of such senseless arsons, kidnappings and murders.\nIn his national broadcast on Saturday to mark this year’s democracy day, Buhari said: “Once again, I want to render my sincere and heart-felt condolences to the families and friends of our gallant service men and women who lost their lives in the line of duty and as a sacrifice to keep Nigeria safe.\n“I extend the same condolence to the families and friends of our country men, women and children who were unfortunate victims of such senseless arsons, kidnappings and murders.\n“I also share the pains of families and direct victims of ransom-seeking, kidnaped victims who went through unimaginable trauma in the course of their forced imprisonment.”“Let me assure my fellow citizens that every incident, however minor gives me great worry and concern and I immediately order security agencies to swiftly but safely rescue victims and bring perpetrators to justice.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: June 12 Protesters Intercept Busload Of Northerners Going To Lagos, Recover Guns",
    "summarized_story": "A bus conveying some northerners from Gombe State to Lagos has been intercepted in Akure, the Ondo State capital, by the June 12 protesters.\nLocally made guns were found in the bus.\nPHOTONEWS: #June12thProtest Protesters In Ondo Arrest Northerners Traveling From Gombe To Lagos With Locally Made Guns, Hand Them Over To Amotekun Corps pic.twitter.com/fATpQ4XAv1 — Sahara Reporters (@SaharaReporters) June 12, 2021The protesters handed the suspects to the operatives of the security outfit, Amotekun.\nThe suspects are being interrogated."
  },
  {
    "headline": "BREAKING: June 12 Protesters Intercept Busload Of Northerners Going To Lagos, Recover Guns",
    "summarized_story": "A bus conveying some northerners from Gombe State to Lagos has been intercepted in Akure, the Ondo State capital, by the June 12 protesters.\nLocally made guns were found in the bus.\nPHOTONEWS: #June12thProtest Protesters In Ondo Arrest Northerners Traveling From Gombe To Lagos With Locally Made Guns, Hand Them Over To Amotekun Corps pic.twitter.com/fATpQ4XAv1 — Sahara Reporters (@SaharaReporters) June 12, 2021The protesters handed the suspects to the operatives of the security outfit, Amotekun.\nThe suspects are being interrogated."
  },
  {
    "headline": "June 12: Police Attack Protesters In Abuja",
    "summarized_story": "Men of the Nigeria Police Force on Saturday morning thwarted a June 12 protest in the Gudu area of the Federal Capital Territory when they stormed the area and started firing tear gas canisters.\nAccording to Punch, the protest began around 08:30 am and was going on smoothly with the protesters, mainly youths, expressing their dissatisfaction with the nation's state.\nThe protesters, who chanted \"Buhari must go\", \"Say no to injustice\", amongst other solidarity phrases, scampered for safety when the security operatives started shooting.\nJournalists who were covering the protest and some of them also streaming it on Facebook Live ran for cover as the security operatives bombarded the demonstration ground."
  },
  {
    "headline": "June 12: Police Attack Protesters In Abuja",
    "summarized_story": "Men of the Nigeria Police Force on Saturday morning thwarted a June 12 protest in the Gudu area of the Federal Capital Territory when they stormed the area and started firing tear gas canisters.\nAccording to Punch, the protest began around 08:30 am and was going on smoothly with the protesters, mainly youths, expressing their dissatisfaction with the nation's state.\nThe protesters, who chanted \"Buhari must go\", \"Say no to injustice\", amongst other solidarity phrases, scampered for safety when the security operatives started shooting.\nJournalists who were covering the protest and some of them also streaming it on Facebook Live ran for cover as the security operatives bombarded the demonstration ground."
  },
  {
    "headline": "Residents Flee As Soldiers Invade Abia Community In Search Of Suspected ESN Members Who Allegedly Shot One Of Them",
    "summarized_story": "Soldiers of 14 Brigade, Army Headquarters have invaded Ohafia in Ohafia Local Government, Abia State, searching for a soldier allegedly shot by gunmen suspected to be members of the Eastern Security Network.\nHe also stated that many houses in the Amangwu Ohafia community were burnt.\n“A lot of houses have been burnt at Amangwu Ohafia community.\nSome persons said six soldiers were killed; others said four and some ESN members were killed in the heavy gunfire.\nBut the truth is that the Amangwu community, including Elu, Ebem and Amaepku, are all on fire."
  },
  {
    "headline": "Abduction: Nuhu Bamalli Polytechnic suspends academic activities",
    "summarized_story": "The management of Nuhu Bamalli Polytechnic in Zaria, Kaduna state has announced the indefinite suspension of academic activities following the recent attack on the institution by suspected bandits.\nAdvertisementAccording to NAN, Mahmud Kwarbai, its information officer, broke the news in a statement on Friday.\nKwarbai said the attack had created tension, hence the indefinite suspension of activities at the institution.\nAdvertisementThe information officer added that students had subsequently been directed to vacate the institution immediately.\nAdvertisement“The bandits invaded our school at about 11 pm yesterday (Thursday) and abducted two academic staff and three students,” he said."
  },
  {
    "headline": "ASUU directs UNIJOS lecturers to boycott PG programmes",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) chapter at the University of Jos (UNIJOS) has directed its members to withdraw their participation in all postgraduate programmes run in the institution.\nAdvertisementThe order was on the back of an alleged refusal by UNIJOS to honour a memorandum of understanding (MoU) reached with its members on the sharing formula for non-NUC funded programmes run by the varsity.\nIn a statement on Wednesday by Lazarus Maigoro, the chairman of UNIJOS-ASUU, the union warned its members to adhere strictly to the directive, adding that violators would be sanctioned.\nAdvertisementCopyright 2021 TheCable.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from TheCable.Follow us on twitter @Thecablestyle"
  },
  {
    "headline": "We may conduct second UTME this year, says JAMB registrar",
    "summarized_story": "Ishaq Oloyede, registrar of the Joint Admissions and Matriculation Board (JAMB), says the exam body may conduct a second 2021 Unified Tertiary Matriculation Examination (UTME) for candidates with genuine registration issues.\nAdvertisementAccording to NAN, Oloyede spoke on Wednesday while monitoring the profiling of candidates with 2021 UTME registration challenges in Lagos.\n“So far, we have just 17, 758 candidates with challenges that had been profiled, nationwide,” he said.\n“We keep hearing flimsy excuses such as my lesson teacher used his phone to generate the profile code, our tutorial centre helped us to register and I was not in town.\nAdvertisement“Other reasons advanced are: I used my mother’s NIN to generate my profile code, my mummy did the registration for me.”According to the registrar, some candidates were honest enough to say they did not have money to procure the UTME forms."
  },
  {
    "headline": "ASUP suspends 65-day-old strike",
    "summarized_story": "The Academic Staff Union of Polytechnics (ASUP) has resolved to suspend its 65-day-old strike.\nBut on Wednesday, the union issued a statement announcing the suspension of the strike with effect from Thursday, June 10.\nAdvertisementEarlier addressing NAPS, Chukuemeka Nwajiuba, minister of state for education, had noted that everything that had to do with ASUP had been settled.\nHe had also said that the onus was with the union to be fair on the students by calling off the strike.\nAdvertisement“When ASUP wanted to start this strike, we wrote them and said everything that ASUP requested for has been agreed upon, we do not have one area of disagreement."
  },
  {
    "headline": "Wizkid under fire for releasing documentary amid June 12 protest",
    "summarized_story": "AdvertisementAdvertisementDuring the #EndSARS protest, Wizkid had reprimanded his industry colleague, Reekado Banks, for announcing their joint single at a time when talks of police brutality dominated social media.\n— ZEUS (@itzbasito) June 12, 2021Cry if you want to cry, but If Na Cuppy post Wetin una Wizkid post, Una go don bully her.\nAmnesia don hold una now now 😩😩 — Big OG (@Seyi_OG) June 12, 2021All of una go try drag Wizkid, but make the boy no chop again?\nYou can stay on Twitter, tweeting about the country, while going about your business and living your life.\n— Joey Akan (@JoeyAkan) June 12, 2021Rema made a post today, y'all didn't drag him, but all of a sudden you're pushing agenda on Wizkid?"
  },
  {
    "headline": "MultiChoice is increasing its stake in BetKing for $281.5 million",
    "summarized_story": "Seven months after taking up an initial 20% stake in BetKing, South African pay TV operator MultiChoice plans to increase its shareholding in the online gambling company to 49% in a $281.5 million deal.\nBetKing is the trading name of Blue Lake Ventures Limited, a pan-African sports betting and entertainment business with major operations in Nigeria.\nThe value of MultiChoice’s initial investment in BetKing was said to be worth more than $100 million.\nBetKing’s annual statement for the financial year ended December 2020 shows a growth in revenue to $77.9 million, from $54.7 million in the previous year.\nYet, Africa accounts for only 2% of global sports betting revenue."
  },
  {
    "headline": "Nigeria’s Central Bank to launch digital currency before 2022",
    "summarized_story": "Nigeria may pilot an official digital currency in 2021, going by the words of Rakiyat Mohammed, a Central Bank Director in charge of the Information Technology Department, who revealed on Thursday that the banking regulator will soon launch a digital currency.\nA Central Bank Digital Currency (CBDC) represents a country’s official currency in digital form.\nAccording to the CBN director, about 80% of central banks in the world are currently exploring the possibility of issuing central bank digital currency and Nigeria could not be left behind.\nLast year, the Bahamas launched the world’s first central bank digital currency.\nWhen it eventually becomes operational, the digital currency will complement the existing forms of currency in the country and could help reduce the high cost of managing and transferring cash."
  },
  {
    "headline": "What is a VPN and how does it work in Nigeria?",
    "summarized_story": "On the internet, different computers send and receive information between Internet Protocol (IP) addresses.\nBefore turning on my VPN, my device was in Lagos, NigeriaAfter turning on my VPN, my device is in Santo Domingo, Dominican RepublicThe images above show how my location changed from Nigeria to Dominican Republic after turning on my VPN.\nNo monitoring: As we mentioned earlier, your internet service provider (ISP) can see your internet traffic and probably log your browsing history.\nWhat is the difference between a VPN app, a VPN plugin, and a VPN browser?\nAlso, some sites and services look at VPN traffic as suspicious and won’t let you connect."
  },
  {
    "headline": "TECNO CAMON 17 Pro: A Creative Nod to the Selfie and the Selfie Culture",
    "summarized_story": "A few weeks back, TECNO launched the TECNO CAMON 17 Pro smartphone, focusing on the selfie with a 48MP AI selfie camera and 90 Hz super-high refreshing rate at 6.8-inch FHD Screen.\nSo, today, I am going to be sharing the things I love about the Camon 17 Pro.\nThe selfie camera of the Camon 17 Pro is one of the highlights of the phone.\nCamera LAB – The TAIVOS™ Imaging LaboratoryThe TECNO CAMON 17 Pro comes with trademarked TAIVOS technology.\nFurthermore, the TECNO CAMON 17 Pro comes with fast charging so, the TECNO CAMON 17 Pro will be ready to leave when you are."
  },
  {
    "headline": "Fostering Gender Inclusion in Technology with the Bolt Drive4WITech Initiative",
    "summarized_story": "The journey into tech for women in Africa is an ongoing discussion largely influenced by cultural norms and societal expectations concerning gender.\nBolt, an inclusive mobility company, recognises this and as part of efforts to drive participation and inclusion for women in technology, launched the #Drive4WITech (Drive for Women in Tech) initiative to support young women in Africa.\nQ: Among the many applications received, you were selected to intern with Bolt in the #Drive4WITech initiative.\nOluwakorede: I supported the marketing team at Bolt Nigeria.\nI am more equipped to confidently make significant contributions to my future work team."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "From ballot paper to blockchain ledger, can the tech behind Bitcoin heal Nigeria’s democracy?",
    "summarized_story": "Blockchain technology is often tied to the flagship cryptocurrency — Bitcoin.\nIn a Forbes article, Frank Palermo advocated blockchain voting in the US after an alleged hack of the current voting system in 2016.\nIn May 2018, according to NBC News, West Virginians living abroad were able to send their votes in for a primary election with a blockchain voting system.\ni-Elect is a blockchain voting platform with a use case in Nigeria created by blockchain developer and designer Jerry Ojumah.\nIt also says the growing proposals for blockchain elections is borne out of the enthusiasm to improve and modernise elections."
  },
  {
    "headline": "Global Wellness Day: Protecting mental health with technology",
    "summarized_story": "In Africa, mental health resources are scarce, reflecting the weakness of mental health services on the continent.\nA World Health Organization (WHO) fact sheet reveals that mental health disorders, otherwise known as mental health illnesses, vary and come with different presentations.\nNonetheless, a mental health concern becomes a mental health disorder when signs and symptoms cause recurring stress and affect the ability to function.\nProtecting your mental health with technologyImage by Firmbee from PixabayThere are effective strategies to prevent and alleviate the suffering caused by mental health disorders, and technology is one of them.\nMANI attempts to fight stigma, improve mental health literacy, and drive policies that benefit mental health service users and those at risk."
  },
  {
    "headline": "Increase in fintech app installations, Apple Health new features, Plentywaka partners with GUO",
    "summarized_story": "Today, I’m discussingIncrease in fintech app installationsApple Health features for the elderlyPlentywaka partners with GUOIncrease in fintech app installations in Nigeria, South Africa, and KenyaThe global fintech industry recorded impressive growth in 2020.\nThe report reveals that beyond funding, fintech app installations grew by160% in the last quarter of 2020.\nSimilarly, Kenya saw 100% growth, and South Africa 52% growth, in fintech app installations.\nThe economic effects of COVID-19 led to the rise in fintech app installations.\nSource: PlentyWaka TwitterPlentywaka, a Nigerian bus-hailing tech company, has announced its partnership with interstate bus company, GUO Transport, to expand its reach."
  },
  {
    "headline": "Naira ends week strong at official market",
    "summarized_story": "The foreign exchange trading week ended on Friday, June 11, 2021, with the Naira stronger in value than the dollar at the official window despite low liquidity.\nRead Also: Nigeria can earn huge foreign exchange from coffee – farmers At the end of the trading week, the Naira closed at N410.80k per dollar, gaining 0.06 percent…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "June 12: Police arrest, shoot gas canisters to disperse protesters",
    "summarized_story": "Personnel of the Nigerian police deployed at Ojota, Lagos State, ahead of the anticipated June 12 protest is determined to stop protesters from exercising their civic rights aimed at ending bad governance.\nThe protest started at Mile 12 and progressed to the Gani Fawehinmi Park in Ojota—the original venue.\nRead Also: Full text: Buhari’s Democracy Day message to the nationThe police, however, began mounting pressure on the group.\nWhen that failed, they shot multiple gas canisters at the protesters and shot multiple rounds in the air.\nAt the time of filing this report, individual protesters are speaking to the press, and gradually rebuilding."
  },
  {
    "headline": "22 years of democracy: Non-state actors dictate the pace in Nigeria",
    "summarized_story": "22 years of democracy: Non-state actors dictate the pace in NigeriaIt was 28 years ago today that the military junta under the then General Ibrahim Badamasi Babangida buccaneered the efforts of the Nigerian people for a safe return to a democratic rule.\nMoshood Kashimawo Olawale (MKO) Abiola contested for the presidency in 1993, but the election results were annulled by the junta because of allegations…"
  },
  {
    "headline": "World Day Against Child Labour: Obaseki seeks legislation, global action to end menace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for legislative and decisive actions, as well as increased collaboration among global stakeholders to prevent, prohibit and eradicate child labour in its entirety.\nObaseki made the call in commemoration of the 2021 World Day Against Child Labour, with the theme, “Act now: end child labour!” marked every June 12, by the International Labour Organisation (ILO), and observed across the globe.\nThe governor noted that there is an urgent need for stakeholders to improve efforts in the global fight against child labour in order to save the nine million additional children at risk of being pushed into child labour by the end of 2022 as a result of the coronavirus pandemic, according to a new report by the ILO and United Nations International Children’s Emergency Fund (UNICEF).\nObaseki said his government has strengthened institutions in the state to enforce the Child Rights Law, and ensure that children are protected from abuses, especially child labour, which robs them of their childhood and deprives them of the opportunity to live their lives to the fullest.\n“In sub-Saharan Africa, population growth, recurrent crises, extreme poverty, and inadequate social protection measures have led to an additional 16.6 million children in child labour over the past four years.”..."
  },
  {
    "headline": "We must all work together to sustain democracy, says Edo. Dep Gov – Nigerian Observer",
    "summarized_story": "We must all work together to sustain democracy, says Edo.\nShaibu stated this while addressing a cross section of protesters who were in a peaceful protest to Edo Government House, Benin City.\nHe said that the governor should issue a second proclamation letter which is against the law.\n“After 22 years of democracy, Nigerians are still suffering as the standard of living has gone from bad to worse in the country.\nWe enjoy freedom of speech but not freedom after speech."
  },
  {
    "headline": "Obaseki salutes Nigerians on Democracy Day, urges eternal vigilance to consolidate ideals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, felicitates with Nigerians, as the country marks this year’s Democracy Day.\nThe people and the government hold the key to the solution of our problems and we must work together to make our country truly great.\nWe have a ready example in Edo State, which today is a beacon of hope for democracy.\nIt takes eternal vigilance to keep our country one and prosperous.\nHappy Democracy DayLong live the Federal Republic of NigeriaGodwin N. ObasekiGovernor, Edo State."
  },
  {
    "headline": "Obaseki congratulates Osikhekha, Ibrahim, others on Guild of Editors roles – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with the reelected President of the Nigerian Guild of Editors (NGE), Mr. Mustapha Isah Osikhekha, on retaining the highly exalted position in the Guild at the recent NGE convention in Kano.\nThe governor also congratulated two other Edo-born editors, Mr. Iyobosa Uwugiaren, who was returned as General Secretary of the Guild and Mr. Umoru Ibrahim, a member of the Guild’s Standing Committee representing the North.\n“As a worthy son of Edo State, we celebrate his new feat and encourage him to keep the spirit of excellence alive.\nAt a time that Edo youths are seeking for mentors and sources of inspiration, the feat singles Osikhekha out as someone worth emulating.\nUmoru Ibrahim, also from Edo State, is a member of the Guild’s Standing Committee representing the North."
  },
  {
    "headline": "Democracy Day: CSOs march to MKO Abiola’s Lagos home",
    "summarized_story": "ADVERTISEMENTA coalition of Civil Society Organisations (CSOs) on Saturday marched to late MKO Abiola’s Lagos home, in commemoration of the 2021 Democracy Day.\nMr Abiola was the acclaimed winner of the June 12, 1993 Presidential Election annulled by the Ibrahim Babangida-led military government.\nAlex Omotehinse, National President, Centre for Human and Socioeconomic Rights (CHSR), one of the participating CSOs, told NAN that the walk was in commemoration of the historic victory of late Abiola.\n“We felicitate with Nigerians on the occasion of this year’s Democracy Day.\nApart from CHSR, other CSOs in the walk included the Coalition of Self-Determination Group; Activists for Good Governance; Committee for Protection of People’s mandates (CPPM) among others."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Ayinla, FirstBank sponsored movie premieres in Lagos on Sunday",
    "summarized_story": "First Bank of Nigeria Limited has announced its lead sponsorship of a movie titled ‘Ayinla’, which is billed to premiere on Sunday, 13 June 2021.\nAyinla is directed by multiple award-winning and globally acclaimed Nigerian filmmaker and director, Tunde Kelani, and produced by Jadesola Osiberu.\nWith the sponsorship of similar socio-cultural initiatives in the creative arts industry like Moremi, Makaliki, Oba Esugbayi stage drama, October 1st (a movie) and the Calabar Festival.\nThe Bank’s sponsorship of ‘Ayinla’ affirms the Bank’s support for the development of arts in Nigeria under its [email protected] initiative.\nIn addition, with this initiative and other sponsored event, FirstBank is committed to strengthening its contribution to the development of the entertainment industry in the country."
  },
  {
    "headline": "If we don’t remember Abiola, our search for nationhood will remain elusive – Gov Abiodun",
    "summarized_story": "The governor gave the advice in Abeokuta while speaking at the 2021 Democracy Day celebration.\n“We will continue to be fair, just, equitable, accountable, open, transparent, inclusive and obey the rule of law.\nIt is part of our forward and deliberate approach to saying a ‘Farewell to Poverty’ two years down the line.\nWe have rekindled the hope of our people in their own government and continued to make them the essence of governance.\nThat is the essence of democracy as preached and pursued by MKO Abiola”, the governor submitted."
  },
  {
    "headline": "Nigeria now at war because of betrayal by ‘one section’ —Gani Adams",
    "summarized_story": "OBINNA EZUGWUIba Gani Adams, the Aareonakakanfo of Yorubaland, has said Nigeria is at war with itself because “a section” of the country consistently betrays the all citizens.\nAdams also criticised the Federal Government for banning micro-blogging site Twitter saying it is an attempt to gag the press and stifle freedom of expression.\nNigeria is at war with itself because a section of the country has always betrayed the trust which is the bond that binds us together as a nation,” he said.\nAs far as I am concerned, it is another ploy to tamper with the citizens’ rights to freedom of speech and expression.\n“In global democracy, freedom of speech and expression is a major component of an ideal democracy."
  },
  {
    "headline": "June 12: Ibadan protesters say they want better Nigeria, not secession",
    "summarized_story": "Olusesan LaoyeJune 12 protesters who stormed various protesting points in Ibadan the Oyo State capital on Saturday, were seen shouting that they were not out for secession but for a better Nigeria where the youth would live a better life with good employment and where they can be fully engaged in legitimate businesses.\nThe protesters gathered at Mokola roundabout, Agodi gate and University of Ibadan gate.\nOthers were seen in front of Mapo Hall and Challenge areas in Ibadan Metropolis.\nThe appearance of Governor Seyi Makinde at Agodi and Yemetu area of Ibadan Ibadan where he addressed the protesters added to the glamour.\nThe issue of insecurity, he argued, must be tackled decisively to stop agitations of secession going on across the country."
  },
  {
    "headline": "Federal Govt Suspends Salaries Of 331 Civil Servants",
    "summarized_story": "The Federal Government has suspended the salaries of 331 civil servants for failure to update their Integrated Personnel and Payroll Information System (IPPIS) as was directed.\nAccording to the statement, Mamman had signed the circular of the suspension on behalf of the Head of the Civil Service of the Federation, Dr Folasade Yemi-Esan.\n“The salaries of 331 federal civil servants have been suspended on the IPPIS platform for their failure to carry out the online records update of the HR Module of Integrated Personnel and Payroll Information System.\n“And signed on behalf of the Head of Civil Service of the Federation, Dr Folasade Yemi-Esan by the Permanent Secretary, Career Management Office, Mahmuda Mamman,” the statement said.\nThe Human Resources Module of IPPIS records update exercise was initiated to rid the service of ghost workers, cut down government expenditure and ensure credible personnel records."
  },
  {
    "headline": "Federal Govt Suspends Salaries Of 331 Civil Servants",
    "summarized_story": "The Federal Government has suspended the salaries of 331 civil servants for failure to update their Integrated Personnel and Payroll Information System (IPPIS) as was directed.\nAccording to the statement, Mamman had signed the circular of the suspension on behalf of the Head of the Civil Service of the Federation, Dr Folasade Yemi-Esan.\n“The salaries of 331 federal civil servants have been suspended on the IPPIS platform for their failure to carry out the online records update of the HR Module of Integrated Personnel and Payroll Information System.\n“And signed on behalf of the Head of Civil Service of the Federation, Dr Folasade Yemi-Esan by the Permanent Secretary, Career Management Office, Mahmuda Mamman,” the statement said.\nThe Human Resources Module of IPPIS records update exercise was initiated to rid the service of ghost workers, cut down government expenditure and ensure credible personnel records."
  },
  {
    "headline": "I Will Retire From Active Politics After My Tenure – Gov Masari",
    "summarized_story": "Governor Aminu Masari of Katsina State said he will retire from active politics after his tenure as governor in 2023.\nHe explained that he would retire to his farm after his tenure as governor of the state.\n“I have held various positions from Commissioner in Katsina State, to the National Assembly where I served as Speaker of the House of Representatives.\n“I am still serving my people as the Governor of Katsina State.\nADVERTISEMENT“After I have satisfactorily succeeded in doing that, I will retire to my farm,” the governor stated."
  },
  {
    "headline": "I Will Retire From Active Politics After My Tenure – Gov Masari",
    "summarized_story": "Governor Aminu Masari of Katsina State said he will retire from active politics after his tenure as governor in 2023.\nHe explained that he would retire to his farm after his tenure as governor of the state.\n“I have held various positions from Commissioner in Katsina State, to the National Assembly where I served as Speaker of the House of Representatives.\n“I am still serving my people as the Governor of Katsina State.\nADVERTISEMENT“After I have satisfactorily succeeded in doing that, I will retire to my farm,” the governor stated."
  },
  {
    "headline": "Democracy Day: Ondo Rep Salutes Constituents, Says Better Days Ahead",
    "summarized_story": "The lawmaker representing Akure North/South federal constituency in the House of Representatives, Hon.\nAdedayo Omolafe, has congratulated his constituents and Nigerians as the nation marks the 2021 Democracy Day on June 12.\nOmolafe in a statement personally signed by him described the 22 years of uninterrupted democracy in Nigeria as one of the best things to have happen to Nigeria since1960.\nHe said that though there were some challenges such as insecurity experienced presently in the country, but with time and proper intelligence by security agencies, better days are ahead.\n”In a matter of weeks, the whole world would witness the mother of all constituency briefings and uncommon Empowerment programme here in Akure,” the lawmaker said."
  },
  {
    "headline": "FG flags off construction of Farin-Ruwa dam in Nasarawa State —",
    "summarized_story": "The Federal Government on Saturday flagged off the construction of Farin-Ruwa Hydropower Multipurpose Dam in Wamba Local Government Area (LGA) of Nasarawa State.\nThe minister said that the project was originally initiated and started by Nasarawa State Government in 2004 to generate 20MW hydropower electricity to boost socioeconomic development of the state.\nAdamu lauded the Nasarawa State Government for initiating the project and providing all the necessary logistics for the smooth takeover.\nAbdullahi Sule of Nasarawa State commended the President and the Ministry of Water Resources for taking over the multipurpose hydro dam project.\nThe programme had in attendance traditional rulers from the area, national and state house of assembly members from Nasarawa State, commissioners, amongst other government functionaries."
  },
  {
    "headline": "NDLEA intercepts 100,000 bottles of codeine syrup at Onne Port...",
    "summarized_story": "The National Drug Law Enforcement Agency, (NDLEA) has intercepted and seized no fewer than 100,000 bottles of codeine syrup with a total weight of 15,325 kgs at the Onne seaport, Port Harcourt, Rivers state.\nGen. Buba Marwa as hailing the synergy between various government agencies at the Onne port.\n“The damage 100,000 bottles of codeine could have done to our youths, if they had slipped through the port to our villages, towns and cities, is unimaginable.\n146.95 kgs of khat could have done the same damage if allowed to go unto our streets.\n“We will ultimately, with the support of all our stakeholders and partners, win the battle against illicit drug trafficking and abuse”, he said."
  },
  {
    "headline": "Borno govt will not retrench workers — Gov Zulum assures —",
    "summarized_story": "Babagana Zulum of Borno has announced that his administration will not retrench any civil servant in spite of the current trying moments in the insurgency-wracked state.\nZulum made this known on Saturday, in Maiduguri, at a luncheon organized to mark Democracy Day and his two years in office.\nThe governor, who also lamented inadequate health workers in the health sector, particularly in primary healthcare centres, said more health workers would also be recruited.\nWhile commending the people of Borno for their support to his administration, Zulum urged other elected politicians in the state to show quality representation or risk not being re-elected in 2023.\nGen Abubakar Haruna who spoke on behalf of members of the state security council."
  },
  {
    "headline": "June 12: PDP condemns APC, Buhari’s clampdown on peaceful protesters",
    "summarized_story": "Tunde Opalana, AbujaThe Peoples Democratic Party (PDP) has condemned in the strongest term , the violent clampdown by security agents on the order of the All Progressives Congress (APC) and President Muhamamdu Buhari on Nigerians who are peacefully protesting on Democracy Day.\n“It is instructive to note that President Buhari, in his supposed Democracy Day address, failed to rein in his security operatives despite the warnings by the PDP.\nThis places the culpability for whatever befalls Nigerians, in the face of the violent attacks by security agencies, on the APC as well as Mr. President’s desk”.\nThe party said it is not surprised that in his over 20 minutes speech, “Mr.\nThe party noted that it is cataloguing all the infringements which the APC and President Buhari are rudely imposing on Nigerians and urge all global democratic institutions to take note of the violent infringements and clampdown on democracy in Nigeria by the APC."
  },
  {
    "headline": "June 12: Pro, anti-Buhari protests hold in Abuja amid tight security",
    "summarized_story": "Parallel June 12 protests are holding in the Federal Capital Territory, Abuja.\nWhile pro-democracy groups’ protesters gathered at Gudu Park, pro-Buhari protesters staged theirs in front of the Unity Fountain.\nThe pro-democracy protest was earlier scheduled for the Unity Fountain but the venue was suddenly changed to Gudu Park.\nThe Unity fountain is heavily guarded by armed police officers and other personnel suspected to be DSS operatives.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "June 12: Pro, anti-Buhari protests hold in Abuja amid tight security",
    "summarized_story": "Parallel June 12 protests are holding in the Federal Capital Territory, Abuja.\nWhile pro-democracy groups’ protesters gathered at Gudu Park, pro-Buhari protesters staged theirs in front of the Unity Fountain.\nThe pro-democracy protest was earlier scheduled for the Unity Fountain but the venue was suddenly changed to Gudu Park.\nThe Unity fountain is heavily guarded by armed police officers and other personnel suspected to be DSS operatives.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "June 12: PDP condemns clampdown on protesters",
    "summarized_story": "The Peoples Democratic Party has accused the All Progressives Congress and the President, Major General Muhammadu Buhari (retd.\nThe party made this known on Saturday via a statement titled, ‘June 12: PDP condemns APC, Buhari’s clampdown on peaceful protesters’, signed by the PDP National Publicity Secretary, Kola Ologbondiyan.\nThe PUNCH had reported that operatives of the Nigerian Police Force tear-gassed protesters in Lagos and the Federal Capital Territory.\nIn the statement, the PDP condemned the act by the operatives, accusing APC and Buhari of “violent clampdown” on protesters’ rights.\nThe statement read, “The Peoples Democratic Party condemns, in the strongest term ever, the violent clampdown by agents of the All Progressives Congress and President Muhammadu Buhari on Nigerians who are peacefully protesting on Democracy Day."
  },
  {
    "headline": "June 12: PDP condemns clampdown on protesters",
    "summarized_story": "The Peoples Democratic Party has accused the All Progressives Congress and the President, Major General Muhammadu Buhari (retd.\nThe party made this known on Saturday via a statement titled, ‘June 12: PDP condemns APC, Buhari’s clampdown on peaceful protesters’, signed by the PDP National Publicity Secretary, Kola Ologbondiyan.\nThe PUNCH had reported that operatives of the Nigerian Police Force tear-gassed protesters in Lagos and the Federal Capital Territory.\nIn the statement, the PDP condemned the act by the operatives, accusing APC and Buhari of “violent clampdown” on protesters’ rights.\nThe statement read, “The Peoples Democratic Party condemns, in the strongest term ever, the violent clampdown by agents of the All Progressives Congress and President Muhammadu Buhari on Nigerians who are peacefully protesting on Democracy Day."
  },
  {
    "headline": "Why Abdulsalami’s role in promoting democracy can’t be disputed – Jonathan",
    "summarized_story": "By Kazeem UgbodagaFormer President, Dr. Goodluck Jonathan on Saturday said former Military Head of State, Abdulsalami Abubakar’s role in promoting democracy cannot be disputed because of his relentless passion and sacrifice for the nation.\nJonathan, in a goodwill message to felicitate with Abdulsalami as he clocks 79, commended the retired general for his efforts and contributions to the peace and unity of the country.\nAccording to him, Abdulsalami’s role in promoting democracy and his passion for service is highly commendable.\nNigerians will continue to honour you for the role you played in our nation’s transition from military to civilian administration, which has flourished for over two decades and produced notable leaders.\n“On behalf of my family and the Goodluck Jonathan Foundation, I wish you more years of sound health, strength and peace as you celebrate.”"
  },
  {
    "headline": "Petrol Station manager found inside underground tank dies",
    "summarized_story": "By Jethro IbilekeThe manager of a petrol station (name withheld), who was found inside an underground tank, has reportedly died, in Ughelli town, in Delta State.\nThe station manager was allegedly discovered with a 20-litre gallon and a hose, by a co-staff of the station situated along Ughelli/Patani Road.\nIt was gathered that the man who was said to be in his early 30s, reportedly went to work very early on that fateful morning at the petrol station and went to the underground tank with 20 gallons and a hose for unknown reason.\nA source in the area who pleaded anonymity, alleged that when other workers resumed for duty, they discovered the deceased in the manhole leading to the underground tank, struggling for breath.\nThe management of the petrol station and family of the deceased could not be reached for comments on the incident."
  },
  {
    "headline": "June 12: Ojota boils as protest continues (Photos)",
    "summarized_story": "By Efunla AyodeleMore protests rock Ojota area of Lagos, Southwest Nigeria on June 12, Democracy Day as Nigerians take to the street to protest bad governance from President Muhammadu Buhari.\nThe area is paralyzed as vehicular move has been halted as protesters marched on the road chanting anti-Buhari’s songs.\nLarge number of anti-riot policemen have been drafted to the area to ensure the protests did not degenerate into violence.\nAsides the earlier violence in Ojota where the police disperse hoodlums with teargas canisters, the resurgence protest is being watched by the police to ensure it was peaceful."
  },
  {
    "headline": "BREAKING: Gov Seyi Makinde Joins June 12 Protest (VIDEO)",
    "summarized_story": "Seyi Makinde, the governor of Oyo State, joined the June 12 demonstration in his state on Saturday.\nMakinde, a governor from the Peoples Democratic Party’s (PDP) platform, took part in the protest in Ibadan, the state capital.\nIn a video that went viral, the governor can be seen amidst demonstrators screaming his name as he speaks to them.\nAs he spoke, the youths could be heard chanting, “that is our governor, we love you.”Nigerians staged a protest to show their dissatisfaction with the country’s present condition of affairs as the country commemorates its Democracy Day.\nWatch video below:"
  },
  {
    "headline": "BREAKING: NANS Makes U-turn, Joins June 12 Protest In Osogbo",
    "summarized_story": "The National Association of Nigeria Students (NANS) has reversed its decision to order members to boycott the statewide demonstration on June 12.\nOn Saturday, the association’s Osun State chapter joined a statewide demonstration in Osogbo, the state capital.\nSunday Asefon, the president of the NANS, announced on Friday that the scheduled statewide protest on June 12 had been postponed.\nHowever, a civil society coalition in Osun has organized a big march against Nigerian insecurity and unemployment.\nComrade Oyelayo Afeez, the Chairman of NANS JCI in Osun State, led the organization’s members en masse to Oke-Fia."
  },
  {
    "headline": "#IStandWithBuhari Protesters Fight Over Money In Abuja",
    "summarized_story": "A battle broke out at the Unity Fountain in Abuja on Saturday morning between members of the #IStandWithBuhari protest group.\nThe leaders of the various groups were observed having a heated discussion about the distribution of monetary resources intended for organizing counter-protests.\nHuman rights campaigners and civil society organizations had called for a statewide protest on June 12 against President Muhammadu Buhari’s administration.\nFree Kogi2 (two anti-President Muhammadu Buhari demonstrators, Larry Emmanuel and Victor Anene Udoka, who are being held in Kogi State), Buhari Must Go, and others are among the others.\nRestore electricity tariffs, end the ASUP (Academic Staff Union of Polytechnics) strike, restore fuel prices, reinstate party deregistration, and release Nicholas Mbah."
  },
  {
    "headline": "BREAKING: June 12 Protest Kicks Off In Osogbo, Akure",
    "summarized_story": "On Saturday, youths protesting bad governance and insecurity stormed Osogbo, the capital of Osun State, and Akure, the capital of Ondo State.\nYouths from Osun State’s Coalition of Civil Society congregated on the renowned Oke-Fai roundabout, according to reports.\n“We cannot allow our state’s economic activity to be ruined in the name of few secessionist agitators.\nWe are here today to demand a better country that works for everyone; we want a safe environment,” Waheed Saka, one of the Osun protestors, stated.\n“We need a good and working Nigeria,” “stop the killings,” and “End terrible governance” are among the slogans on banners hoisted by protestors in Akure."
  },
  {
    "headline": "Breaking: Eriksen wakes up after slumping on the pitch, Denmark vs Finland Euro 2020 game continues",
    "summarized_story": "English referee Anthony Taylor called medics on to the pitch and Eriksen underwent prolonged treatment, including CPR.\nTeam-mates formed a shield around the former Tottenham player, while fans inside the stadium were clearly stunned by the incident, with some pictured in tears.\n“Eriksen is awake and his condition remains stable,” the Danish FA later said.\nA statement read: “Following the request made by players of both teams, UEFA has agreed to restart the match between Denmark and Finland tonight at 20:30 CET.\nEriksen’s club, Inter, tweeted: “Forza Chris, all of our thoughts are with you.”Former team Tottenham said: “Get well soon, Christian."
  },
  {
    "headline": "Pictures: Mr Macaroni joins #June12thProtest in Lagos",
    "summarized_story": "PreviousSadiya Umar Farouq: On the podium of honour"
  },
  {
    "headline": "Pictures: Nigerians in UK join #June12thProtest",
    "summarized_story": "PreviousBreaking: Historic as Algeria become first African team to record 27-match unbeaten run"
  },
  {
    "headline": "President Buhari Appoints Ilelah as NBC Director-General -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Army redeploys 11 Generals, 3 colonels in latest shake up -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Army , last night redeployed eleven Generals, 3 Colonels in the latest shakeup.\nThe outgone Director Army Public Relations, Brigadier General Mohammed Yerima announced the redeployment in a statement in Abuja.\nAccording the statement, “Nigerian Army (NA) has released posting and appointments of senior officers.\nThis is in line with the Chief of Army Staff vision to have a professional Nigerian Army ready to accomplish assigned missions within a Joint Environment in Defence of Nigeria.\nThe Chief of Army Staff, Major General Faruk Yahaya urged all the affected senior officers to justify the confidence reposed on them."
  },
  {
    "headline": "Buhari flags-off Commercial operation of Lagos-lbadan Train service -NigPilot",
    "summarized_story": "President Muhammadu Buhari has officially flagged off commercial operations of the Lagos-Ibadan standard gauge railway project yesterday.\n” This is already yielding the desired result as construction activities on the railway segment, Kaduna – Kano has commenced with back-end engineering activities.\nRotimi Amaechi earlier in his remarks expressed gratitude to President Muhammadu Buhari for summoning the courage to take the loan from China Exim bank to execute the rail project.\nThanking President Buhari for his support in ensuring the project is a success, he stressed that the occasion is the third time of the President commissioning railway project completed during his tenure.\nHe equally thanked the Minister for being the chief pilot of the project in which the project wouldnt have been successful without his tenacity."
  },
  {
    "headline": "UNODC trains Migration, NAPTIP on data collection on human trafficking -NigPilot",
    "summarized_story": "United Nations Office on Drugs and Crime, UNODC, with funding from the Government of Canada, organized a four-day long training of trainers on data collection and analysis on trafficking in persons and smuggling of migrants, TIP and SOM for officers of Nigeria Immigration Service, NIS, National Agency for the Prohibition of Trafficking in Persons, NAPTIP.\nUNODC said the training would equip officers from the Nigeria Immigration Service, NIS, and the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, with the necessary tools when working with data, but also to train data providers at federal and state levels to improve the overall national reporting on TIP and SOM in Nigeria.\nAccording to the agency, it further engaged in the upcoming months with trained NAPTIP and NIS officers to conduct step-down trainings for NAPTIP and NIS zonal commands, recently established State Task Forces and other data providers.\n“Strengthening evidence-based response to trafficking in persons and smuggling of migrants in Nigeria, project funded by Canada, UNODC is currently conducting a threat assessment of trafficking in persons and related organized crime in Nigeria that will support NAPTIP and NIS in developing evidence-based policies and law enforcement strategies,” said UNODC.\nAlso, NIS Deputy Comptroller General, Ms. Anthonia Ifeoma Opara, said in her opening remarks that “this training of trainers is a commendable attempt by UNODC to strengthen the capacity of relevant agencies to generate and process data on trafficking in persons and smuggling of migrants.”Speaking also, NAPTIP’s Director of Research and Programme Development, Mr. OlusayoOlubiyi, added that “UNODC’s training will go a long way in enriching the knowledge and skills necessary to ensure our data is accurate and precise.”"
  },
  {
    "headline": "Democracy Day: Use Of Teargas Was In Line With Global Standards – Police",
    "summarized_story": "The Nigerian police on Saturday justified its use of tear gas on protesters who took to the streets to mark Democracy Day by voicing their grievances against the government of the day.\nAccording to police spokesman, Mr Frank Mba, the actions of officers were in line with international best practices of dispersing violent protests.\nThe police shot teargas at protesters in Lagos and Abuja.\n‘An isolated case’According to Mr Mba, the use of teargas was an isolated case in Abuja where protesters turned violent.\n“We had an isolated case in Abuja where some of the protesters became unruly and in line with international best practices, police fired teargas at them,” he said."
  },
  {
    "headline": "Democracy Day: Police Shoot Teargas At Protesters In Abuja, Lagos",
    "summarized_story": "﻿The police on Saturday shot teargas to disperse protesters in the Gudu area of Abuja and Ojota area of Lagos as the country marked Democracy Day on June 12.\nThe Unity Fountain in Abuja, which is a popular venue for protests in the nation’s capital, had been shy of protesters as of 8:15am.\n‘Resign from office’According to our correspondent, the protesters in Gudu had turned out in their numbers carrying placards and banners with various inscriptions.\nProtest holds in Oyo, OndoThe Democracy Day protests held at Mokola, Ibadan amid heavy police presence.\nChannels Television reporters also observed protests in Osun state."
  },
  {
    "headline": "We Have Lifted 10.5m Nigerians Out Of Poverty In Two Years – Buhari",
    "summarized_story": "President Muhammadu Buhari on Saturday said his administration has lifted 10.5 million people out of poverty in the past two years.\nIn 2019, the President had promised to work towards lifting 100 million Nigerians out of poverty in 10 years.\n﻿“Our over-all economic target of lifting 100 million Nigerians out of poverty in 10 years is our goal notwithstanding COVID-19.\n“Our conditional cash transfer program has benefited over 1.6 million poor and vulnerable households comprising more than 8 million individuals.\n“I have also recently approved the National Poverty Reduction with Growth Strategy Plan that augments existing plans to further reduce poverty in Nigeria."
  },
  {
    "headline": "June 12: PDP Condemns Clampdown On Peaceful Protesters",
    "summarized_story": "The Peoples Democratic Party (PDP) has condemned the clampdown on peaceful protesters on Democracy Day.\nThe party in a statement signed on Saturday by its spokesperson, Kola Ologbondiyan said “the brutal clampdown on Nigerian citizens is sacrilegious”“The Peoples Democratic Party (PDP) condemns, in the strongest term ever, the violent clampdown by agents of the All Progressives Congress (APC) and President Muhammadu Buhari on Nigerians who are peacefully protesting on Democracy Day.\n﻿“It is awkward that the APC and President Buhari, who were allowed their freedom when they protested in 2014, would turn around to subject Nigerians to actions of inhumanity including the use of firearms against the people, as being witnessed today,” the statement read in part.\nREAD ALSO: Security Operatives Foil Fresh Kidnap Attempt On Another Kaduna SchoolThe party claimed that President Buhari, in his Democracy Day address, failed to rein in his security operatives despite the cautions by the PDP.\nThe party stressed that it is cataloging all the infringements which the APC and President Buhari are imposing on Nigerians and urged all global democratic institutions to take note of the infringements and clampdown on democracy in Nigeria by the APC."
  },
  {
    "headline": "G7 Leaders Take On China, Covid And Climate",
    "summarized_story": "G7 leaders on Saturday confronted China and the threat of future pandemics as the elite club of wealthy nations advertised a newfound Western unity at its first physical summit since 2019.\nAsked if other G7 leaders agreed with him about a US diplomatic renaissance, Biden pointed to Macron, who replied: “Definitely.”‘Build back better’Promising to “collectively catalyse” hundreds of billions of infrastructure investment for low- and middle-income countries, the G7 leaders said they would offer a “values-driven, high-standard and transparent” partnership.\nCovid vaccines“The #CarbisBayDeclaration marks a proud and historic moment for us all,” British Prime Minister Boris Johnson said on Twitter.\nThe G7 leaders are also expected to pledge to donate one billion vaccine doses to poor countries this year and next — although campaigners say the rollout is much too slow to end the crisis now.\nMost of the G7 leaders will reconvene Monday in Brussels for a NATO meeting, before Biden heads on to his first summit with Russian President Vladimir Putin in Geneva, vowing to deliver a blunt message about Russian behaviour."
  },
  {
    "headline": "Zamfara Government suspends Democracy Day Celebration due to bandits killing",
    "summarized_story": "Zamfara state government has suspended activities marking this year’s Democracy Day celebration due to the Resurgence of Banditry and kidnapping in the stateThe state government says the suspension became necessary considering the casualties recorded in recent Attacks on three local governments in the stateAt a state broadcast in Gusau, Governor Bello Matawalle says forty five persons were killed in yesterday’s attack in Zurmi Local governmentAccording to him, Banditry and kidnapping in the state is getting worst by the dayThe governor adds that the suspension of three traditional rulers alledgedly involved in banditry activities is to serve as deterant to others, as his administration will deal decisively with anyone found guilty of any crimeAdvertisementHe urges locals locals in troubled areas to defend themselves against bandits, to complement the effort of security agenciesThe Zamfara State Government assures it will implement the report of the committee set up to proffer lasting solution to the menace of Insecurity in the stateThis is the first in twenty two years that Zamfara state is not celebrating this very important day due to the upsurge of Insecurity"
  },
  {
    "headline": "Akure Protesters Intercept travellers going To Lagos, Recover Guns",
    "summarized_story": "A bus conveying some travellers from Gombe State to Lagos has been intercepted in Akure, the Ondo State capital, by the June 12 protesters.\nTwo locally made guns were found in the bus.\nThe travellers we’re later handed over to the men of Amotekun corps.\nThe corps commander of Amotekun in the state, Adetunji Adeleye confirmed the development.\nHe said the corps is currently profiling the suspects"
  },
  {
    "headline": "Saudi Arabia bars foreign pilgrims from Hajj for a second year over Covid-19",
    "summarized_story": "No foreign pilgrims will be allowed to perform the Hajj once again this year after Saudi Arabia restricted the annual pilgrimage to citizens and residents, and set a maximum of 60,000 pilgrims in response to the coronavirus pandemic.\n“In light of what the whole world is witnessing with the coronavirus pandemic … and the emergence of new variants, the relevant authorities have continued to monitor the global health situation,” the statement added.\nHajj, a once-in-a-lifetime duty for every able-bodied Muslim who can afford it, is a major source of income for the Saudi government.\nIn a relaxation of coronavirus curbs last October, Saudi Arabia opened the Grand Mosque for prayers for the first time in seven months and partially resumed the Umrah pilgrimage.\nThe limit on Umrah pilgrims is 20,000 a day, with a total of 60,000 worshippers allowed to perform daily prayers at the mosque."
  },
  {
    "headline": "Democracy Day: 10.5m Brought Out of Poverty, Buhari Says",
    "summarized_story": "Nigeria’s President Muhammadu Buhari says his administration’s has ensured 10.5 million citizens have been brought out of poverty since 2019.\nThe Nigerian leader stated this during a live broadcast to commemorate the June 12 Democracy Day.\nMr Buhari noted that the government is still determined to ensure that the overall economic target of lifting 100 million Nigerians out of poverty in 10 years is accomplished notwithstanding COVID-19.\n“Our overall economic target of lifting 100 million Nigerians out of poverty in 10 years is our goal notwithstanding COVID-19.\n“I am very convinced that this 100 million target can be met and this informed the development of a National Poverty Reduction with Growth Strategy."
  },
  {
    "headline": "UFC’S Kamaru Usman to Build Academy in Nigeria",
    "summarized_story": "Nigeria born Ultimate Fighting Championship (UFC) Welterweight Champion, Kamaru Usman has disclosed his plan to set up a sporting academy in the country.\nUsman, nicknamed Nigeria’s Nightmare, made this known during his visit to the Nigerians in Diaspora Commission (NiDCOM) in Abuja on Friday.\nThe professional mixed martial artist, who have been away from Nigeria for over a decade, said he was happy to be home, despite discouragement from individuals.\nThe Auchi-born international sports celebrity, made known his intention of setting up an academy to train Nigerian youths on his expertise: kick-boxing, boxing and mixed martial arts.\nShe called on other Nigerian Diaspora to follow Usman’s noble example, in contributing to the country’s development, in their various capacities."
  },
  {
    "headline": "South Africa Expels Lesotho Ambassadors Over Illegal Alcohol",
    "summarized_story": "South Africa has given several diplomats from Lesotho 72 hours to leave the country over the illegal sale of duty-free alcohol.\nA notice from the South African authorities listed the diplomats and their dependants and stated that they had “abused their diplomatic privileges”.\nLesotho has distanced itself from the actions of the diplomats and said that it was working on their return.\nThe South African government has declared all those involved as “persona non grata”.\nThe illegal sale of alcohol in South Africa grew in 2020 during the coronavirus lockdowns that saw stores and bars close to prevent the spread of the virus."
  },
  {
    "headline": "Court Clears Lungu to Run For Zambian President Again",
    "summarized_story": "Zambia’s constitutional court has cleared President Edgar Lungu to run for another term in office in August’s elections.\nThe opposition was trying for a second time to get him barred over the constitutional two-term limit.\nMr Lungu was first elected president in 2015 in the wake of the death in office of his predecessor Michael Sata.\nBut, in line with Zambia’s constitution, he only served the remainder of Sata’s term before running and winning the 2016 election.\nIn other words, 2016 to 2021 is his first full term."
  },
  {
    "headline": "Italy Open 2020 Euro With Emphatic Win over Turkey",
    "summarized_story": "Italy rode three second-half goals to a 3-0 win over Turkey in Group A of the opening match of the 2020 European Championship in Rome on Friday.\nRoberto Mancini’s Italy came into the match on a 27-match unbeaten run and their fine form showed early on as the Azzurri dominated possession and went close with a pair of headers from corner kicks just past the 20-minute mark.\nThe pressure on the Turkish defence finally told when Merih Demiral inadvertently chested the ball into his own net from a Domenico Berardi cross and Italy took the lead shortly after the restart.\nLorenzo Insigne put the game away for Italy in the 79th minute, curling home a beautiful first-time shot after Turkey’s Cakir hooked a goal kick right to the opposing side and Italy pounced for their third.\nTurkey will face Wales next in Group A action, while Italy play Switzerland, with both games played on Wednesday, June 16."
  }
]