[
  {
    "headline": "COVID-19: Fully vaccinated Nigerian travellers no longer required to self-isolate on arrival in UK",
    "summarized_story": "Amarachi OkehThe United Kingdom says fully vaccinated Nigerian travellers arriving in the United Kingdom would no longer need to self-isolate from Monday, October 11.\nThe UK government disclosed this in a new policy statement it released on Thursday.\nAccording to the statement published on the UK’s official website, fully vaccinated Nigerians will also not need to take a pre-departure test as previously required, with effect from Monday, October 11.\n“If you arrive in England before that date, you must follow the rules for people who are not fully vaccinated.\n“If you arrive after that, you can use a vaccine certificate to prove your vaccination status.”The site added that fully vaccinated Nigerians travelling to England do not need to be quarantined any longer."
  },
  {
    "headline": "COVID-19: Fully vaccinated Nigerian travellers no longer required to self-isolate on arrival in UK",
    "summarized_story": "Amarachi OkehThe United Kingdom says fully vaccinated Nigerian travellers arriving in the United Kingdom would no longer need to self-isolate from Monday, October 11.\nThe UK government disclosed this in a new policy statement it released on Thursday.\nAccording to the statement published on the UK’s official website, fully vaccinated Nigerians will also not need to take a pre-departure test as previously required, with effect from Monday, October 11.\n“If you arrive in England before that date, you must follow the rules for people who are not fully vaccinated.\n“If you arrive after that, you can use a vaccine certificate to prove your vaccination status.”The site added that fully vaccinated Nigerians travelling to England do not need to be quarantined any longer."
  },
  {
    "headline": "UN chief says unequal COVID-19 vaccine rollout immoral, senseless",
    "summarized_story": "UN chief Antonio Guterres on Thursday branded rich nations’ vaccine hogging as immoral and stupid, saying choking off poorer countries’ access to vaccines risked undermining their own defences against the pandemic.\nThe UN health agency said 1.5 billion vaccine doses were now being manufactured every month – with less than one week’s production needed to reach the 10 per cent target.\n“Vaccine inequality is aiding and abetting the COVID-19 pandemic,” Guterres told a virtual press conference alongside Tedros.\nMeanwhile, Tedros also announced that the WHO had now finalised a clinical case definition for the post-COVID-19 condition often called Long COVID.\nThey may appear following recovery from acute-stage COVID-19, or persist from the initial illness."
  },
  {
    "headline": "UN chief says unequal COVID-19 vaccine rollout immoral, senseless",
    "summarized_story": "UN chief Antonio Guterres on Thursday branded rich nations’ vaccine hogging as immoral and stupid, saying choking off poorer countries’ access to vaccines risked undermining their own defences against the pandemic.\nThe UN health agency said 1.5 billion vaccine doses were now being manufactured every month – with less than one week’s production needed to reach the 10 per cent target.\n“Vaccine inequality is aiding and abetting the COVID-19 pandemic,” Guterres told a virtual press conference alongside Tedros.\nMeanwhile, Tedros also announced that the WHO had now finalised a clinical case definition for the post-COVID-19 condition often called Long COVID.\nThey may appear following recovery from acute-stage COVID-19, or persist from the initial illness."
  },
  {
    "headline": "Justice, fairness key to security in Islam",
    "summarized_story": "Praise be to Allah, the Lord of the Worlds, who ordered the faithful administration of justice and urged mankind to dispense and be witnesses to justice on all.\nBe steadfast witnesses for justice, as witnesses to God, even against yourselves, the rich or poor.\nStand firm for justice as witnesses for Allah even if it is against yourselves, your parents, or close relatives.\nO Servants of Allah, I urge you and myself to fear God Almighty, for His blessings upon you continue to flow.\nMay God Almighty guide us to do what He loves and be pleased with us."
  },
  {
    "headline": "2020 emergency flood intervention: NEMA distributes equipment, fertilizers, seedlings to farmers in Oyo",
    "summarized_story": "Pix caption: Mr. Saheed Akiode , NEMA South West Zonal Coordinator giving out farm inputs, to farmers in Oyo state.\nBy Esther Onyegbula3741 farmers in Oyo State have benefitted from the federal government flood emergency intervention scheme.\nThe National Emergency Management Agency NEMA provided the emergency intervention to the farmers affected by 2020 flood in Oyo State.\nNEMA on behalf of the federal government distributed farm inputs, fertilizers, and seedlings to 3741 farmers in 11 local government areas in Oyo state for this year’s planting season.\nHe said “The farmers should use the farm inputs, fertilizers and seedlings for the purpose they were given to them."
  },
  {
    "headline": "Plateau LG Elections: STF warns against planned disruption of peace",
    "summarized_story": "…vows to deal with merchants of violenceBy Kingsley OmonobiThe Special Task Force of Operation Safe Haven in Jos has said it is in possession of intelligence about plans by those it described as disgruntled elements to disrupt the peace in the Plateau during the Local Government elections.\nConsequently, the STF has warned the “merchants of violence” to desist from the planned disturbance as it will not hesitate to deal decisively perpetratorsA statement by Major Ishaku Takwa, Military Information Officer titled “Planned Disruption of Peace By Disgruntled Elements” made this known on Friday.\nIt said, “Intelligence report available to Operation Safe Haven indicates a planned disruption of peace and security of Plateau state by disgruntled element during the local government election scheduled for Saturday 9 October 2021.\n“Operation Safe Haven therefore urges the traditional rulers, religious leaders as well as parents and guardians to warn their subject against being used to disrupt the peace on the plateau.\n“Any action short of unity and peaceful coexistence on the plateau would be viewed as deliberate plan to frustrate the effort of the troops of Operation Safe Haven, such action will be resisted and decisively dealt with.”Vanguard News Nigeria"
  },
  {
    "headline": "Police hand over 187 rescued abductees to Zamfara govt –PPRO",
    "summarized_story": "The Commissioner of Police in the state, Mr Ayuba Elkanah, while handing over the rescued victims to Gov.\nMeanwhile, Elkanah has assured that the police and other security agencies would continue to put in their best to ensure the return of lasting peace and security in the state.\nHe sympathised with the victims for the sufferings they passed through while in captivity, and promised that the police will redouble their commitments to protect lives and properties of the citizens of Zamfara State.\nResponding, while taking over the rescued victims, Matawalle thanked the police and other security agencies for their resilience and hard work in the enforcement of the new security measures in the state.\nHe further said that the state Government would ensure that the victims undergo medical treatment before being reunited with their families."
  },
  {
    "headline": "Journalists win Nobel Peace Prize",
    "summarized_story": "The Nobel Peace Prize has been awarded to journalists Maria Ressa and Dmitry Muratov for their efforts to safeguard freedom of expression in the Philippines and Russia, respectively.\nRessa is the CEO of Rappler, a news outlet critical of Philippine President Rodrigo Duterte’s regime, while Muratov heads the independent Russian newspaper Novaya Gazeta.\n“Free, independent and fact-based journalism serves to protect against abuse of power, lies and war propaganda,” Berit Reiss-Andersen, chair of the Norwegian Nobel Committee, said as she announced the prize in Oslo on Friday.\n“It is the 102nd time the prize has been awarded.\nRessa becomes the first woman to be awarded a Nobel Prize this year."
  },
  {
    "headline": "Insecurity: COAS charges troops to be at alert",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant General Faruk Yahaya, on Friday, charged troops to be alert and vigilant.\nBrig Gen Onyema Nwachukwu, Director of Army Public Relations, in a statement on Friday, said the COAS gave the charge while addressing instructors at Depot Nigerian Army, Nigerian Military School (NMS), Directorate of Army Physical Training (DAPT), and Army School of Physical Training (ASPT).\nHe restated that welfare will continue to be given the desired attention under his watch.\nAccording to the statement, the COAS praised troops for their selfless service and urged them to keep the flag flying in the defence of their fatherland and service to humanity.\nThis, he said, is necessary to justify the confidence the President and Commander-in-Chief reposes on the armed forces."
  },
  {
    "headline": "Ozigbo harps on peaceful conduct of Nov 6 Anambra guber poll",
    "summarized_story": "Valentine Ozigbo, the gubernatorial candidate of the Peoples Democratic Party (PDP) in Anambra State, has harped on the need for the peaceful conduct of the November 6 election in the state.\nOzigbo also promised a robust security architecture to ensure the protection of lives and properties of the citizens if victorious at the polls.\nOzigbo further disclosed his willingness to collaborate with the US delegation and other promoters of peace to ensure a credible and hitch-free process before, during, and after the election in Anambra.\nThe American delegation was led by the US Embassy’s Political/Economic Chief for Southern Nigeria, Brandon Hudspeth.\nOthers in the US contingent were the Security Chief of the US Consulate, Jim Suor; Political Officer for the South East Region, Briana Olson; and a political analyst, Arnold Abulime."
  },
  {
    "headline": "Plateau LG polls: NCPC boss, Northern CAN urge citizens to shun violence",
    "summarized_story": "Barely 24 hours to the local government elections in Plateau State, the Executive Secretary, Nigeria Christian Pilgrim Commission (NCPC), and Chairman Christian Association of Nigeria (CAN), in Northern Nigeria, Rev.\nPam made the appeal during a peace advocacy visit to the Anglican Bishop of Jos, Rev.\nDachollom Datiri; ECWA President, Rev.\nHe reminded Plateau citizens to know that elections will certainly come and go but the state will remain home to all.\nPam maintained that “The security of Plateau is very crucial to Nigeria and what we need at this time is peace."
  },
  {
    "headline": "We’ll hold FG responsible if anything happens to Ortom – S/East group",
    "summarized_story": "The Coalition of South East Youth Leaders, COSEYL, has warned against an attack on Governor Samuel Ortom of Benue State, saying it will hold the Federal Government accountable should anything bad happen to the governor.\nThe group gave the warning via a statement issued on Thursday in Owerri, the Imo State capital by its President, Goodluck Ibem.\nCOSEYL alleged that the governor had raised the alarm over threats to his life following his stand on open grazing in the South East and other parts of the country.\nAccording to COESYL, any attack on Governor Ortom “is not just an attack on the opposition or a dissenting voice but one against us and our democracy, since as a Coalition, we share the same opinion on grazing with the governor.\nWe will not take this, not even from any president or presidency,”."
  },
  {
    "headline": "Nnamdi Kanu: Why Sen Abaribe should be in prison – Femi Adesina",
    "summarized_story": "Femi Adesina, President Muhammadu Buhari’s Special Adviser on Media and Publicity, has launched an attack on Senate Minority Leader, Senator Eyinnaya Abaribe.\nAdesina, who was referring to Abaribe, said the Senator should be in prison for supporting “someone bent on dismembering Nigeria.”Abaribe from Abia South had stood as surety for Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, in 2017.\nThe lawmaker and two others’ stand led to an Abuja Federal High Court granting Kanu bail on April 25, 2017.\nBut, the Senate Minority Leader encountered some troubles after Kanu jumped bail and fled Nigeria the same year.\nKanu had claimed to have fled Nigeria after an alleged attempt on his life by soldiers in Abia in September 2017."
  },
  {
    "headline": "Arungun Emirate set to Honour Orji Kalu",
    "summarized_story": "Senator Orji Kalu was notified of his conferment in a letter written by the Emir of Argungu in Kebbi State,His Highness, Alhaji Mohammed Mera.\nReading the letter to Kalu on behalf of the Emirate council, Senator Abdullahi added that the traditional event will be held during the annual international fishing festival in Arungun Kebbi State.\nThe Monarch in another letter formally invited Senator Kalu to his 25th coronation anniversary and the wedding ceremony of his first daughter Habiba to Engr.\nA book detailing the rich cultural heritage and history of one of the oldest Emirate in Nigeria Argungu was also presented to Senator Orji Uzo Kalu.\nIn his remarks, Senator Kalu appreciated the Argungu emirate in considering him worthy of receiving the traditional title."
  },
  {
    "headline": "PDP NEC okays zoning of party chair to North",
    "summarized_story": "From Ndubuisi Orji, AbujaThe National Executive Committee (NEC) of the Peoples Democratic Party (PDP), yesterday, approved the zoning of the party’s next national chairman to the North.\nOlogbondiyan said the NEC considered and adopted Governor Ifeanyi Ugwuanyi-led Zoning Committee’s report, ahead of the party’s national convention, scheduled for October 30.\nThe committee had recommended that the current elective National Working Committee (NWC) positions in the party should be swapped between the north and the south.\nBala Mohammed committee on PDP performance in the last general elections would be considered in another meeting of the NEC.\nPDP acting national chairman, Yemi Akinwonmi, in his opening remarks, charged party leaders to bury their differences in the interest of the party."
  },
  {
    "headline": "Buhari considers fresh tax laws, presents N16.39trn 2022 budget",
    "summarized_story": "From Fred Itua, AbujaPresident Muhammadu Buhari, yesterday, revealed plans to review existing tax laws in the country.\nHe stated this when he presented a N16.39 trillion budget proposal for the 2022 fiscal year to a joint session of the National Assembly.\nThe president disclosed that efforts were being made by his administration to partly support the realisation of fiscal projections by reviewing the current tax and fiscal laws to produce a draft Finance Bill 2022.\nBuhari, who tagged the Appropriations Bill 2022 “Budget of economic growth and sustainability,” said allocations to MDAs were guided by the strategic objectives of the National Development Plan of 2021-2025.\nBased on these fiscal assumptions and parameters, total federally-collectible revenue was estimated at N17.70 trillion in 2022, he said."
  },
  {
    "headline": "Wike calls for increased revenue allocation to states",
    "summarized_story": "He spoke through his deputy, Mrs. Ipalibo Banigo, at the public hearing on review of revenue allocation formula for South-South zone, organised by RMAFC, held in Port Harcourt, yesterday.\nGovernor Wike faulted the use of 1992 population figure, public school enrolment and public hospital bed spaces and land mass as formular for allocation of revenue.\n“Using the same formular of 1992 as a basis for revenue allocation in this country is so unfortunate.\nGive the states 40 percent, give Local Government 20 percent.\nAccording to him, the data that would be collated from the states will help the commission to arrive at a fair revenue formula."
  },
  {
    "headline": "FG’s 774,000 jobs for LGAs a scam – TUC",
    "summarized_story": "By Bimbola OyesolaTrade Union Congress (TUC), yesterday, said the Federal Government’s Special Public Works Programme aimed at employing 774,000 citizens across the country’s local government areas is a scam designed to manipulate Nigerians.\nOlaleye, however faulted the minister’s claim saying: “I have not seen anybody who has been employed since the government announced the commencement of the 774,000 jobs.\nHe therefore charged the government to create the enabling environment for the private sector to create quality jobs for citizens, rather than dissipate time and resources on the 774,000 jobs scheme.\n“It is slave labour and unhealthy to engage a graduate of five years or a post-graduate on a salary of 15, 000 per month.\nThe thought of such a job in the morning is in itself unhealthy and hazardous,” she said."
  },
  {
    "headline": "Buhari: Petrol Subsidy Eroding Revenues Available to Fund Budget",
    "summarized_story": "Buhari made the revelations in Abuja while presenting a N16.39 trillion Appropriation Bill for the 2022 fiscal year to a joint session of the National Assembly.\nBut Chairman of the National Assembly and President of the Senate, Dr. Ahmad Lawan, flayed the rising level of budget deficit.\nNevertheless, there was hope of an early passage of the 2022 budget proposal, as Speaker of the House of Representatives, Hon.\nSimilarly, the ruling party All Progressives Congress (APC) yesterday said the proposed 2022 budget was designed to accelerate government’s on-going efforts to diversify the economy.\nAccording to him, the 2022 to 2024 Medium Term Expenditure Framework and Fiscal Strategy Paper (MTEF/FSP) set the parameters for the 2022 Budget."
  },
  {
    "headline": "PDP NEC Backs Governors, Zones Chairmanship to North",
    "summarized_story": "In a related development, the suspended national chairman of PDP, Uche Secondus, said he was in court to stop an alleged blackmail, planned hijack, and plot to destroy PDP.\nBut on the zoning of the presidential ticket, Ologbondiyan said the report was referred to another NEC meeting, where it would be decided.\nI now referred them to the resolution of NEC, where NEC decided that power should remain in the South-west for eight years.\nHowever, from the North East were the incumbent PDP Deputy National Chairman (North), Senator Suleiman Nazif and former Governor of Gombe State, Dr. Ibrahim Dankwambo.\nThe venue is NEC Hall of the PDP National Secretariat, Wadata Plaza and the time is 11.AM prompt.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "…Lawmakers Express Divergent Views on 2022 Expenditures",
    "summarized_story": "Babatunde Ayeni said the main expectation was on security, saying the country is going nowhere without adequate funding of the security sector.\nAccording to him, “We hope it will take us out of misery, given critical attention to education and security.\nAccording to Onyejeocha, “The president said this is the first time that gender issues are being included in the budget.\nWe must ensure that the revenue comes in to ensure the implementation of the budget as envisaged by Nigerians.\nIt is good news if we complete all the road projects, it is good news when we complete all the rail projects."
  },
  {
    "headline": "Analysts Laud Timely Budget Transmission, Say Projections Realistic",
    "summarized_story": "James Emejo in AbujaAnalysts yesterday commended President Muhammadu Buhari for the timely transmission of the 2022 Appropriation Bill to the National Assembly.\nBuhari, yesterday presented the N16.3 trillion 2022 Appropriation Bill to the Joint Session of the National Assembly.\n“First, let me commend the President for presenting the 2022 appropriation bill in relatively good time.\n“I am satisfied with the benchmarks of oil price of $57 per barrel and the output level of 1.88million barrel per day, exchange rate at $410.\n“The government is also spending more on recurrent expenditure in 2022 and most of the capital expenditure might not yield returns in the 2022 fiscal year."
  },
  {
    "headline": "FG: Energy Transition Must Take Cognisance of Nations’ Peculiarities",
    "summarized_story": "He explained that while this was a major concern for climate activists in developed nations, the clamour to emphasise only renewable energy as the sole pathway to energy transition was a source of concern for African countries.\n“This is why in Nigeria, we reject the concept of a single pathway to the energy transition.\nIndeed, we prefer the concept of ‘just’ energy transition which takes into cognisance the specific circumstances of each nation in developing the energy transition pathway that best achieves the environmental, social, political and economic objectives of the transition in that specific nation.\n“Multiple pathways to the energy transition should and must exist in order to ensure that no country is left behind in the process of achieving net-zero by 2050.\nHe argued that energy transition could no longer be limited to incremental steps, but must become a transformational effort based on rapid upscaling and implementation of all available technologies to innovate for the future."
  },
  {
    "headline": "EXCLUSIVE: Buhari Plans Removal Of Attorney-General Malami, 14 Other Ministers",
    "summarized_story": "A top source in government, however, told the newspaper that Malami has begun moves to truncate the plans.\n“President Buhari is planning to sack 15 Ministers with Malami topping the list.\nBuhari had on September 1 sacked Saleh Mamman, the Minister of Power; and Sabo Nanono, the Minister of Agriculture and Rural Development.\nMalami also bought a house in 2020 worth N150 million in the Gwarimpa area of Abuja.\nObservers say Buhari’s silence is an endorsement of the atrocities of one of his most trusted lieutenants, Malami."
  },
  {
    "headline": "EXCLUSIVE: Buhari Plans Removal Of Attorney-General Malami, 14 Other Ministers",
    "summarized_story": "A top source in government, however, told the newspaper that Malami has begun moves to truncate the plans.\n“President Buhari is planning to sack 15 Ministers with Malami topping the list.\nBuhari had on September 1 sacked Saleh Mamman, the Minister of Power; and Sabo Nanono, the Minister of Agriculture and Rural Development.\nMalami also bought a house in 2020 worth N150 million in the Gwarimpa area of Abuja.\nObservers say Buhari’s silence is an endorsement of the atrocities of one of his most trusted lieutenants, Malami."
  },
  {
    "headline": "How Buhari Visited Ailing Ex-Lagos Governor, Tinubu In Corruption-tainted London Villa Acquired By Osun Governor, Oyetola",
    "summarized_story": "A Mareva injunction is a Court order which freezes the assets of a defendant pending the outcome of a litigation.\nHe and Eludoyin, in 2003, incorporated another shelf company in the British Virgin Islands, Global Investments Offshore Limited.\nHowever in June 2018, months before he became governor, he withdrew from the company and made his children – Rukayat Oyetola, Hafiz Oyetola, and Rasheedat Oyetola directors.\nHe also transferred his shares in Global Investments Offshore Limited to Mr Eludoyin and his son Haifz in June 2018.\nAlso unclear is why Tinubu, who apparently wants to become Nigeria`s president, would agree to stay at the controversial property."
  },
  {
    "headline": "How Buhari Visited Ailing Ex-Lagos Governor, Tinubu In Corruption-tainted London Villa Acquired By Osun Governor, Oyetola",
    "summarized_story": "A Mareva injunction is a Court order which freezes the assets of a defendant pending the outcome of a litigation.\nHe and Eludoyin, in 2003, incorporated another shelf company in the British Virgin Islands, Global Investments Offshore Limited.\nHowever in June 2018, months before he became governor, he withdrew from the company and made his children – Rukayat Oyetola, Hafiz Oyetola, and Rasheedat Oyetola directors.\nHe also transferred his shares in Global Investments Offshore Limited to Mr Eludoyin and his son Haifz in June 2018.\nAlso unclear is why Tinubu, who apparently wants to become Nigeria`s president, would agree to stay at the controversial property."
  },
  {
    "headline": "Nigerian Agency Reveals Number Of Houses Boko Haram Destroyed In Northeast Region In 12 Years",
    "summarized_story": "No fewer than 500,000 buildings were said to have been destroyed by Boko Haram terrorists in Nigeria's Northeast region.\nThe terrorists have also rendered over 2.2 million persons, including women and children homeless during their 12-year violent hostilities in the region.\nAlkali further disclosed that the mass housing project was NEDC's intervention, aimed at bridging the dire housing gap in the Northeast.\nBorno State, being the epicentre of Boko Haram destruction, has 1,000 houses already built by the commission, according to Alkali.\nThe bridge, located in the Michika Local Government Area of Adamawa State, was blown off by Boko Haram terrorists seven years ago."
  },
  {
    "headline": "Nigeria’s corruption respects diversity and federal character",
    "summarized_story": "I think there is a design flaw with the African public officer; I mean, with the Nigerian public officer.\nThe average Nigerian public officer has shown himself to be a parasitic organism that keeps sucking the national treasury with a proboscis.\nAnd Nigerian public officers featured prominently in this investigation.\nThe uncanny thing about the Pandora Papers is that Nigeria’s geographical character is well-captured on the corruption lamina.\nPublic officers from the north, south, east and west have been named on that inglorious list."
  },
  {
    "headline": "Nigeria’s corruption respects diversity and federal character",
    "summarized_story": "I think there is a design flaw with the African public officer; I mean, with the Nigerian public officer.\nThe average Nigerian public officer has shown himself to be a parasitic organism that keeps sucking the national treasury with a proboscis.\nAnd Nigerian public officers featured prominently in this investigation.\nThe uncanny thing about the Pandora Papers is that Nigeria’s geographical character is well-captured on the corruption lamina.\nPublic officers from the north, south, east and west have been named on that inglorious list."
  },
  {
    "headline": "Femi Adesina: Abaribe should have been jailed when Nnamdi Kanu jumped bail",
    "summarized_story": "Femi Adesina, presidential spokesman, says Enyinnaya Abaribe, senate minority leader, should have been imprisoned when Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), jumped bail.\nAdvertisementThe IPOB leader, who is facing charges bordering on treasonable felony, jumped bail in 2017.\nThe senate minority leader was one of those who stood as surety for him before he was granted bail.\nKanu was rearrested in June after he was lured with “cash donation” — after being on the run for some years.\nAdvertisementIn an article entitled, ‘Weighty Matters About Our Country’, on Friday, Adesina said the senator stood as surety for Kanu who was bent on dismembering the country."
  },
  {
    "headline": "Femi Adesina: Abaribe should have been jailed when Nnamdi Kanu jumped bail",
    "summarized_story": "Femi Adesina, presidential spokesman, says Enyinnaya Abaribe, senate minority leader, should have been imprisoned when Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), jumped bail.\nAdvertisementThe IPOB leader, who is facing charges bordering on treasonable felony, jumped bail in 2017.\nThe senate minority leader was one of those who stood as surety for him before he was granted bail.\nKanu was rearrested in June after he was lured with “cash donation” — after being on the run for some years.\nAdvertisementIn an article entitled, ‘Weighty Matters About Our Country’, on Friday, Adesina said the senator stood as surety for Kanu who was bent on dismembering the country."
  },
  {
    "headline": "NMA president: No law says a doctor needs police report to treat gunshot victims",
    "summarized_story": "Innocent Ujah, president of the Nigerian Medical Association (NMA), says the police should stop harassing medical doctors for treating patients with gun wounds.\nAdvertisementHe says there is no law which mandates doctors to demand a police report before treating victims of gunshots.\nHe said though the police do not have any business demanding reports before doctors can treat patients with gun wounds, they harass doctors who do.\n“The Nigeria police should be educated on the role of the medical doctor.\nA medical doctor doesn’t need any permission before he attends to any emergency."
  },
  {
    "headline": "An ex-Google EMEA lead expands his address verification service to Nigeria",
    "summarized_story": "Without an address, it’s almost impossible to be reached or receive delivery of goods or financial services.\nIn 2020, OkHi changed its model from collecting addresses for mobility businesses in Kenya to verifying addresses for financial services companies in Nigeria.\nHowever, our hypothesis was that we can build our address database faster by providing digital address verification for financial services.”Why was Nigeria the target?\nThe process is not only time-consuming and costly but also limits access to financial services.\nThey create their OkHi address with one business and then they can use their address with other services."
  },
  {
    "headline": "Aggregators are enabling independent voices in Kenya’s controlled news circuit",
    "summarized_story": "Data-driven digital media is taking the place of print in Kenya.\nEmerging to take the place of rifling through the morning newspaper are scrollable, swipeable news aggregators that have the potential to change Kenya’s media landscape.\nThe Standard Group comes in second, with three spin-offs: The Standard, The Standard on Saturday, and The Standard on Sunday.\nMuch like other aggregators, like Google News and Flipboard, Opera News’ AI crawls the internet for content.\nAs Kenya’s 2022 elections draw near, content moderation will become harder than ever and the nation’s news aggregators will have to rise to the challenge."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\nKemi wants to continue supporting her mother and sister, not only by clearing their bills but also helping them to be independent of her."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "Nabsolute’s SpinHeard for artists, Uber’s latest expansion, and Klasha’s $2.4m seed",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:Nabsolute’s SpinHeardUber’s expansionKlasha’s $2.4m seedNabsolute’s SpinHeard aims to help independent artistsVictor Okpala, Founder of Nabsolute.\nAdvertisementThis is what Nabsolute Media, a media communications and marketing agency based in Nigeria, is looking to do for independent artists with its recently launched platform, SpinHeard.\nUS-based technology company, Uber, known primarily for its ride-hailing service, has announced an expansion into Ibadan and Port Harcourt.\nKlasha’s $2.4m seed round will be used to bolster cross-border payments infrastructureJessica Anuna, Klasha’s FounderFirst, the news: Klasha, a US-based, Africa-focused cross-border payments startup, has announced raising $2.4m in seed investment.\nNotable eCommerce platforms like WooCommerce and OpenCart have integrated Klasha’s plugins, with the startup also having an official partnership with BigCommerce."
  },
  {
    "headline": "Nabsolute wants to give independent artistes affordable exposure with SpinHeard",
    "summarized_story": "Advertisement“And that is a fee that a lot of independent artistes cannot afford,” Okpala explains, “This group makes up a large percentage of the industry.\nAccording to Okpala, SpinHeard comes with incentives for these curators, especially to simplify their jobs.\nFor starters, SpinHeard will help independent artistes upload their content to the popular video-sharing app, Triller and get promoted for free, of course, after content vetting.\nThis would expose these independent artistes to the perks the company already offers clients it runs comms for — in terms of push notifications, banner support, and other home page features.\nDespite the success recorded with Nabsolute, Okpala doesn’t expect SpinHeard to be a walk in the park."
  },
  {
    "headline": "eNaira dilemma: speed or transparency, Google’s $1b investment and Chari’s $5m seed raise",
    "summarized_story": "But, here’s the thing, a private blockchain means there’s no room for transparency.\nWhat would a private blockchain entail for the eNaira?\nClick here: eNaira: How much control does a private blockchain give the CBN?\nGoogle plans to launch the Africa Investment Fund to invest $50 million in African startups.\nOur Senior Reporter, Emmanuel Paul, gives a detailed analysis on the subsea Internet cable here: With its massive subsea Internet cable, Google says it’s playing the long game in AfricaChari closes $5m seedChari Co-Founder."
  },
  {
    "headline": "Africa film industries can create 20 million jobs – UNESCO",
    "summarized_story": "Africa’s film industry could contribute $20 billion to the continent’s revenue and also employ 20 million Africans but its potentials remain untapped, according to a report by UNESCO.\nAdditionally, just 19 out of 54 African countries offer financial support to filmmakers.\n“Africa’s potential as a film powerhouse remains largely untapped, despite significant growth in production across the continent, the report argues.\nTwo-thirds of African countries acknowledged that more than half of the proceeds were lost to illegal avenues such as piracy.\nThe report outlines further challenges in the African film industry, including limitations on freedom of expression, as well as education, training, and internet connectivity."
  },
  {
    "headline": "Nigeria risks N10.82trn deficit in 2022 on unrealistic revenue target",
    "summarized_story": "President Muhammadu Buhari in his budget proposal to lawmakers on Thursday said the Federal Government was targeting revenues of N10.13 trillion and a deficit of N6.258 trillion in 2022.\nThat then leaves Abuja with a deficit of N10.82 trillion, the highest ever and equivalent to a full year’s entire budget.\nThat’s the single largest expenditure item in the budget and equates to double of Nigeria’s total revenue in 2020.\nNigeria’s poor revenue performance has made analysts criticise the government for raising the bar each year despite obvious challenges in attaining revenue targets.\nUnrealistic revenue targets have often left the country with a much bigger deficit than planned."
  },
  {
    "headline": "Lagos airport users lament unfair car towing",
    "summarized_story": "Read Also: System outages delay passengers’ check-in at Lagos airportAviation stakeholders told BusinessDay that the modus operandi of the towing vehicle operators contravenes airport regulations, as they are not properly kitted.\nThey also do not have logos that distinguish one towing vehicle from another.\nThey insisted they would collect cash from almost everyone, which means the money won’t be remitted to the airport authority,” Oge said.\n“The airport authority has given tow operators target to remit a certain amount of money monthly.\n“Rather than operate according to the ethos of road safety, airport tow operators are only interested in squeezing money from passengers."
  },
  {
    "headline": "Niger Delta Integrity Group Lauds Appointment of Isiyaku Abdullahi as MD, PPMC – Nigerian Observer",
    "summarized_story": "“We know Isiyaku Abdullahi very well when he served at the Integrated Data Services Limited (IDSL) in Benin City as not just a people’s man but someone with rich knowledge of the Niger Delta, who we trust will ensure uninterrupted supply of petroleum products not just across the 36 states of Nigeria, but the Niger Delta in particular.\nThe Group further stated that “Isiyaku Abdullahi’s performances as Group General Manager in the Finance & Accounts Directorate under the amiable and knowledgeable Oil and Gas Professional Umar Isa Ajiya, the CFO/GED F&A was recognized.\n“We are aware that prior to his appointment as the Managing Director of PPMC, Isiyaku Abdullahi in his capacity as the Group General Manager (GGM) Accounts of the NNPC.\nA consummate team player, Abdullahi is a bundle of joy to work with.\nPresident Muhammadu Buhari in 2019 graciously approved Abdullahi Isiyaku’s appointment as General Manager Finance, NNPC Pensions Ltd and left huge accomplishment there too."
  },
  {
    "headline": "Edo govt begins removal of illegal stalls, eave extensions, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Thursday, commenced another phase of demolition of illegal structures and eave extensions in parts of Benin Metropolis, in line with the government’s urban renewal drive.\nThe exercise focused on the demolition of eave extensions, mostly in business environments, in the Government Reservation Area (GRA).\nOfficials of the Edo State Ministry of Physical Planning and Urban Development began the exercise from the Ugbor axis of Benin City with the removal of illegal structures erected on the right of way.\nThe government bulldozers brought down the illegal structures around Limit Road and Osadebay Road, along Country Home Road, both at the Government Reservation Area, in Benin City.\nIllegal developments on nearby Emmanuel Igodan and adjoining roads were also affected in the exercise, which is expected to continue in the days ahead."
  },
  {
    "headline": "Edo to renovate 1,000 more classrooms, reassures of conducive learning environment for students – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is committed to ensuring a conducive learning environment for pupils and students in the state.\nObaseki, while speaking to journalists in Benin City, said the government plans to renovate 1,000 more classrooms across various schools in the state to ensure that students have the best learning environment.\nIn the next few weeks, we will start another round of refurbishment of another 1,000 classrooms across the state.\nI am confident that by the time that we are leaving office in 2024, we would have qualified teachers in every classroom in Edo State.\nI am assuring you that I will continue to spend Edo State money on its people.”..."
  },
  {
    "headline": "Oredo Ward 4 PDP Chairman, Ihama suspended for anti-party activities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Chairman of the Peoples Democratic Party (PDP) in Ward 4, Oredo Local Government Area, Mr. Friday Enaruna Ihama has been suspended for alleged anti-party activities.\nThe State Assistant Financial Secretary, Mr. Aroko Thomas, said the suspended chairman of the ward, Mr. Friday Enaruna Ihama, allegedly engaged in anti-party activities during and after the September 19 governorship election in 2020.\nHe said Mr. Ihama had since deployed different tactics to halt the progress of the party in the ward.\nMr. Thomas said for close to one year, the suspended chairman has failed to call for a meeting of members from the ward, which is a deliberate effort to destroy the PDP in the Governor’s ward.\nA committee was thereafter set up to investigate the allegations leveled against the suspended chairman."
  },
  {
    "headline": "I’m being blackmailed with my sex tape – Tiwa Savage",
    "summarized_story": "Nigerian music star, Tiwa Savage, has revealed that she is being blackmailed for a sex tape.\nThe singer hinted that the blackmailer sent the sex video of herself and her current date to her team demanding money.\nShe said “I’m not gonna call it a sex tape.\nI’m obsessed with Brandy.”Early music careerWhen quizzed about how long she had been singing, Tiwa noted that she began her career as a background vocalist.\nOn her future plans, Tiwa said she hopes to be in the American Grammy Superbowl in the next decade."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Abiodun denied tampering with Ogun LG funds",
    "summarized_story": "Idowu Olakunle,AbeokutaOgun State Governor, Prince Dapo Abiodun says his administration never tampered with the monthly allocation of the 20 local governments in the state from the federal government.\nAbiodun made the denial at a meeting he held with the 20 local government chairmen, in his office at Oke-Mosan Abeokuta.\nThe governor’s came on the heels of allegations that the LGs funds were being tampered with by his government.\nHe explained that his administration has always made up for the shortfalls from the federal allocation to the local governments, to be able to pay staff salaries, pensions and execute developmental projects.\n“I will keep to my campaign promises and allow local governments free hand to run their affairs."
  },
  {
    "headline": "Army explains why it arrested actor Chiwetalu Agu",
    "summarized_story": "OBINNA EZUGWUThe Nigerian Army has said it arrested veteran actor, Mr. Chiwetalu Agu, whom it described as “one Chiwetalu Agu” for inciting members of the public and soliciting support for the proscribed Indigenous People of Biafra (IPOB).\nThe statement read, “Troops of Nigerian Army(NA) have arrested one Chiwetalu Agu while inciting members of the public and soliciting for support for the proscribed Indigenous People of Biafra (IPOB).\nDressed in a very well known attire of the proscribed group, Chiwetalu Agu was picked up for questioning while inciting members of the public to join the proscribed group.\n“Chinwetalu Agu has clearly demonstrated uncharitable disposition to negate peace and security in the region, hence, he is taken into custody for preliminary investigation.\nThey are equally urged to continue to support the security agencies to restore normalcy to the region in furtherance of peace.”"
  },
  {
    "headline": "Abia stakeholders in building industry proffer solutions to building collapses in Nigeria",
    "summarized_story": "PETER OKORE, UmuahiaThe Abia State chapter of Nigerian Institute of Architects (NIA), has affirmed that the greatest hindrance to building well in Nigeria is the neglect of professionals in handling building development schemes.\nThese are contained in an address presented at the 2021 Architects Forum held in Umuahia, Abia capital with the theme: “Towards A Better Urban Future: How To Build Well.”Arc.\nAnagha maintained that building well remains the fulcrum for achieving a better urban future.\nSaid he: “Owing to the peculiar circumstances of our Urban Environment, we carefully chose this theme to continue the discourse commenced last year.\nLast year’s Forum highlighted the peculiar problems facing the built environment in our urban cities, and zeroed on necessary measures to solve the problem of incessant building collapse."
  },
  {
    "headline": "Osun using sports to drive development – Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Adegboyega Oyetola, on Thursday said his administration’s commitment to sports development is aimed at continuously preaching and spreading the messages of love, unity, hope and development in the state.\nThe Governor reaffirmed his Administration’s commitment to ensuring adequate implementation of the State’s Youth Policy Statement designed to promote Youth Education, Youth Empowerment, Youth Entrepreneurship and Youth Engagement.\nThis is even as the Governor declared the year 2021 Osun Sports Festival closed after its finals competition at Osogbo City Stadium.\nIt stems from our avowed and determined quest to transform sports and youth development in our State.\n“I wish to emphasise here that the aim of this project is to institute the State Policy on Sports as enshrined in the State Youth Policy."
  },
  {
    "headline": "NETCO To Offer Internship, Scholarship To Lagos Students",
    "summarized_story": "The National Engineering and Technical Company (NETCO) said it will offer internship opportunities to the best science students of Kuramo Senior College and Victoria Island Senior Secondary School, Lagos.\nNETCO, a subsidiary of the Nigerian National Petroleum Company (NNPC) Ltd, also added that it would offer scholarship to undergraduates in engineering courses from Iru Community, Victoria Island, Lagos.\nNETCO managing director, Mr Johnson Awoyomi, made the pledge on Wednesday while flagging off the ‘NETCO Goes To Schools’ initiative in Lagos.\nAwoyomi, represented by Mr Kigo Ahmad, Executive Director, Services, NETCO, said the initiative was part of NETCO’s corporate social responsibility programme to Iru land, its host community.\nHe said: “It is a NETCO thematic thrust in education and economic empowerment programme that is geared towards the growth and development of Iru land."
  },
  {
    "headline": "NETCO To Offer Internship, Scholarship To Lagos Students",
    "summarized_story": "The National Engineering and Technical Company (NETCO) said it will offer internship opportunities to the best science students of Kuramo Senior College and Victoria Island Senior Secondary School, Lagos.\nNETCO, a subsidiary of the Nigerian National Petroleum Company (NNPC) Ltd, also added that it would offer scholarship to undergraduates in engineering courses from Iru Community, Victoria Island, Lagos.\nNETCO managing director, Mr Johnson Awoyomi, made the pledge on Wednesday while flagging off the ‘NETCO Goes To Schools’ initiative in Lagos.\nAwoyomi, represented by Mr Kigo Ahmad, Executive Director, Services, NETCO, said the initiative was part of NETCO’s corporate social responsibility programme to Iru land, its host community.\nHe said: “It is a NETCO thematic thrust in education and economic empowerment programme that is geared towards the growth and development of Iru land."
  },
  {
    "headline": "Sanwo-Olu Endorses Nigeria Skits Industry Awards",
    "summarized_story": "The Lagos State governor, Mr. Babajide Sanwo-Olu, has taken his commitment to the promotion of inclusive society a notch higher as he formally endorsed the maiden Nigeria Skits Industry Awards (NSIA) and gave consent to the nomination of Lagos as the host city of the event.\nA statement by the chief press secretary to the governor, Gboyega Akosile, said this was in demonstration of Sanwo-Olu’s belief that the society will be built with everyone contributing their quota in different ways.\nHe stated this on Monday when the promoter of the NSIA, Congressman Bimbo Daramola, paid him a visit at the Lagos House, Marina where he presented the governor with the Awards insignia.\nDeclaring his love for the emerging skits industry, Governor Sanwo-Olu commended the organisers for thinking of giving formal recognition to the artistes who have used the medium of skits to give expression to their various talents.\nADVERTISEMENTThe governor said the creativity, passion and determination that they have shown has made skits a significant feature of the Nigerian entertainment landscape, agreeing that giving the skit makers the recognition they have earned is proper and thoughtful."
  },
  {
    "headline": "Sanwo-Olu Endorses Nigeria Skits Industry Awards",
    "summarized_story": "The Lagos State governor, Mr. Babajide Sanwo-Olu, has taken his commitment to the promotion of inclusive society a notch higher as he formally endorsed the maiden Nigeria Skits Industry Awards (NSIA) and gave consent to the nomination of Lagos as the host city of the event.\nA statement by the chief press secretary to the governor, Gboyega Akosile, said this was in demonstration of Sanwo-Olu’s belief that the society will be built with everyone contributing their quota in different ways.\nHe stated this on Monday when the promoter of the NSIA, Congressman Bimbo Daramola, paid him a visit at the Lagos House, Marina where he presented the governor with the Awards insignia.\nDeclaring his love for the emerging skits industry, Governor Sanwo-Olu commended the organisers for thinking of giving formal recognition to the artistes who have used the medium of skits to give expression to their various talents.\nADVERTISEMENTThe governor said the creativity, passion and determination that they have shown has made skits a significant feature of the Nigerian entertainment landscape, agreeing that giving the skit makers the recognition they have earned is proper and thoughtful."
  },
  {
    "headline": "Governor Abiodun Gives LG Chairmen Marching Orders On Kidnappings, Cultism, Others",
    "summarized_story": "Ogun State Governor Prince Dapo Abiodun has directed the chairmen of the 20 local government areas of the state to stamp out kidnapping, cultism, robbery among others so that the state can maintain its leading role as the industrial hub of the country.\nThis came yesterday as the governor hinted that his administration had on monthly basis, augmented funds accrued to the local governments administrations to enable them perform their statutory roles and function effectively.\nAbiodun, who gave the order during a meeting with the 2 chairmen in his office at the state secretariat complex in Oke-Mosan, Abeokuta, said it became necessary in view of the fact that the council chairmen remain the closest to the grassroots.\n“We know that as a tier of government, they can work with the state government.\nIf they are empowered, they can complement us as they are the closest to the people and can identify their problems and needs,” he pointed out."
  },
  {
    "headline": "Again, gunmen invade Ebonyi community, kill two policemen, eight others",
    "summarized_story": "Again, gunmen invade Ebonyi community, kill two policemen, eight othersAgain, gunmen invade Ebonyi community, kill two policemen, eight othersAT least, no fewer than 10 persons, including two policemen, were killed on Thursday when gunmen invaded Isu and Onicha-Igboeze communities, in the Onicha Local Government Area of Ebonyi State.\nWhile two policemen were reportedly killed in Isu, others were killed in Onicha Igboeze.\nIt was also said that two lawyers were also killed by the gunmen, during the attack.\nThe two lawyers, it was learnt, were in a vehicle when they ran into the gunmen who operated with a Lexus SUV.\nThe PUNCH reports that there have been killings in Onicha in the last three months by gunmen and suspected security agents."
  },
  {
    "headline": "Again, gunmen invade Ebonyi community, kill two policemen, eight others",
    "summarized_story": "Again, gunmen invade Ebonyi community, kill two policemen, eight othersAgain, gunmen invade Ebonyi community, kill two policemen, eight othersAT least, no fewer than 10 persons, including two policemen, were killed on Thursday when gunmen invaded Isu and Onicha-Igboeze communities, in the Onicha Local Government Area of Ebonyi State.\nWhile two policemen were reportedly killed in Isu, others were killed in Onicha Igboeze.\nIt was also said that two lawyers were also killed by the gunmen, during the attack.\nThe two lawyers, it was learnt, were in a vehicle when they ran into the gunmen who operated with a Lexus SUV.\nThe PUNCH reports that there have been killings in Onicha in the last three months by gunmen and suspected security agents."
  },
  {
    "headline": "Pandora Papers: I broke no law ― Peter Obi",
    "summarized_story": "Former Anambra State Governor and Peoples Democratic Party, PDP, Vice Presidential Candidate in the 2019 election, Mr Peter Obi, has reacted to a media report that he breached Nigerian laws by engaging in secret businesses set up in tax havens, insisting that he broke no law.\nAn online publication quoting Pandora Papers had listed Obi as one of those personalities who clandestinely set up and operated businesses overseas, including in notorious tax and secrecy havens in ways that breached Nigerian laws.\nThe Pandora Papers is a leak of about 12 million documents that revealed hidden wealth and tax avoidance by some of the world’s rich and powerful.\nThe former governor said he did not in any respect whatsoever violate any law before, during and after his stewardship as the Governor of Anambra.\nObi said he also engaged and acted on solicited advice by reputable legal practitioners on whose opinion he relied."
  },
  {
    "headline": "Pandora Papers: I broke no law ― Peter Obi",
    "summarized_story": "Former Anambra State Governor and Peoples Democratic Party, PDP, Vice Presidential Candidate in the 2019 election, Mr Peter Obi, has reacted to a media report that he breached Nigerian laws by engaging in secret businesses set up in tax havens, insisting that he broke no law.\nAn online publication quoting Pandora Papers had listed Obi as one of those personalities who clandestinely set up and operated businesses overseas, including in notorious tax and secrecy havens in ways that breached Nigerian laws.\nThe Pandora Papers is a leak of about 12 million documents that revealed hidden wealth and tax avoidance by some of the world’s rich and powerful.\nThe former governor said he did not in any respect whatsoever violate any law before, during and after his stewardship as the Governor of Anambra.\nObi said he also engaged and acted on solicited advice by reputable legal practitioners on whose opinion he relied."
  },
  {
    "headline": "Budget: Buhari Borrowing N5.01 Trillion To Service Stolen Funds",
    "summarized_story": "President Muhammadu Buhari has budgeted over N5.1 trillion to service stolen funds that have plunged the country into debts, according to Hon.\n“Seriously, this government said, they are fighting corruption, but as a lawmaker, I never see the corruption fight because we say we are fighting corruption and we are slow and not acting.\nIf there is strong investigation and interrogation in this country, I am sure we will not borrow money to service debts.\n“The money that was supposed to be invested in education, railways, health, security and other critical infrastructure would be used to service debts in 2022.\n“Did they acquire mansions with their salaries and we said we are fighting corruption?"
  },
  {
    "headline": "Police Kills Suspected IPOB/ESN Member In Imo, Recovers Arms",
    "summarized_story": "During a gun fight at Umuchoke in the Ehime Mbano LGA of Imo State, the Imo State Police Command stated one suspected member of the outlawed Indigenous People of Biafra and Eastern Security Network IPOB/ ESN terror gang was killed.\nThe hoodlum had been on the command’s wanted list but on the run after involvement in many deaths of police officers and the burning of police stations, according to a statement signed by CSP Michael Abattam, Police Public Relations Officer in Imo State.\nThe police said investigation was in progress and its operatives are working in synergy with other security agencies to arrest the other members of the terror group, especially those that escaped with bullet wounds.\nThe Commissioner of Police, Imo State Command, CP Rabiu Hussaini, while commending the officers and men for their gallantry, expressed his appreciation to the people of Imo State for their support.\nThe CP advised them to continue to assist the police with credible information and report to the nearest police station any person seen with bullet wounds."
  },
  {
    "headline": "Ex-PDP Governors Declare Bid For 2023 Presidential Ticket",
    "summarized_story": "Three former governors of the Peoples Democratic Party (PDP) have expressed their intention to run for president in 2023.\nPrevious Vice President Atiku Abubakar was in attendance, as were PDP Governors led by Chairman and Sokoto Governor Aminu Tambuwal, as well as former and current governors, ministers, and federal lawmakers.\nThe Zoning and Convention Planning Committees were chaired by Ugwaunyi and Adamawa Governor, Ahmadu Fintiri, according to Acting National Chairman Yemi Akinwonmi.\nThree former Northern Governors and a party executive have confirmed their candidacy for the PDP flagbearership.\nDeputy National Chairman (North), ex-Senator Suleiman Nazif, and former Gombe Governor, Ibrahim Dankwambo, are both from the North-East, according to DAILY POST."
  },
  {
    "headline": "There’s No Plan To Bring Back SARS — IGP",
    "summarized_story": "The Nigerian Police Force has claimed that it has no plans to resurrect the renowned Special Anti-Robbery Squad (SARS) (SARS).\nSARS was dismantled in late 2020, following a nationwide #EndSARS protest amid suspected SARS officer brutality, extrajudicial killings, and human rights violations.\nThe SARS squad, according to the police chief, has been disbanded and will never be revived.\nMba said, “The Force wishes to categorically emphasise that there is no plan whatsoever to bring back the disbanded SARS.\nIt thereafter introduced the Special Weapons and Tactics Team, which many Nigerians described as not different from the disbanded SARS."
  },
  {
    "headline": "Pictures: Police rescues 187 Kidnapped victims in Zamfara",
    "summarized_story": "By Sanusi Muhammad, GusauZamfara State Police Command through its tactical operatives in a Joint operations at Tsibiri forest in Maradun local government government area of the state has rescued 187 Kidnapped victims.\nThis was made known by the state Commissioner of Police CP Ayuba N. Elkana while handing over the victims to the state government for onward measures.\nAccording to him, the victims were rescued unconditionally who were abducted in Rini village of Bakura LGA, Gora village of Maradun LGA, Sabon Birni village and Shinkafi in Shinkafi LGA respectively .\n“The abducted victims who spent many weeks in captivity were unconditionally rescued following an extensive search and rescue operations that lasted for hours,” he said.\nThe CP further assured that Police and other security agencies will continue to put in their best to ensure the return of lasting peace and security in the state."
  },
  {
    "headline": "Pictures: Suspects operating Illegal rehabilitation centre nabbed",
    "summarized_story": "Kano state police command on, Thursday, uncovered an illegal rehabilitation centre for wrongful confinement and child abuse.\nThe state Police spokesperson, DSP Abdullahi Haruna Kiyawa, disclosed this in a statement said the command on Thursday, October 7, received a credible source that, one Aminu Rabiu, of Yar Akwa, Naibawa Quarters, Tarauni LGA, Kano State is running an illegal rehabilitation centre with chained and tortured inmates including children.\n“On receipt of the report, the Commissioner of Police, Kano State Command, CP Sama’ila Shu’aibu Dikko, immediately raised and instructed team of detectives to proceed to the scene, rescue the victims and arrest the culprits,” he stated.\n“The team immediately arrived the scene and discovered 47 inmates confined in a house, with four of the victims leg chained and some with various degrees of injuries resulting from torture.\nThey were rushed to Murtala Mohammed Specialist Hospital Kano for treatment and handed over to Kano state government."
  },
  {
    "headline": "VIDEO: Veteran Nollywood actor Chinwetalu Agu reveals what he was doing before Army arrested him",
    "summarized_story": "Actor Chinwetalu Agu in a viral video revealed that he was sharing bread when men of Nigerian army arrested him.\nHe distance himself from the claim that he was campaigning for the proscribed Indigenous People of Biafra and Eastern Security Network.\nThe veteran actor was arrested by Men of Nigerian Army at Upper Iweka in Anambra state on Thursday.\nThe comic actor who spoke at the army division he was taken to after the arrest, insisted that what he wore is a civil dress and not a Biafran regalia.\nHe also stated that he was sharing bread to people and was not campaigning for IPOB or ESN when he was arrested."
  },
  {
    "headline": "NCR launches “Project Zero Hunger” for refugees, IDPs, others -NigPilot",
    "summarized_story": "National Commission for Refugees, Migrants and Internally Displaced Persons NCFRMI, in collaboration with Defence and Police Officers’ Wives Association DEPOWA, has launched the “Project Zero Hunger” programme aimed at catering for refugees, IDPs and other vulnerable groups in states across the federation.\nThe Project Zero Hunger Initiative will fight food insecurity and stem the threat of famine in our land.\nThe Project will additionally assuage the growing burden of hunger amongst persons of concern.\nI see that much has been done through partnerships with critical stakeholders for appropriate support to mobilize and deploy resources to provide a pedestal of success for the Project Zero Hunger Initiative.\n“On behalf of our persons of concern, I hereby launch Project Zero Hunger and pray that it positively impacts on the lives of the intended beneficiaries.”"
  },
  {
    "headline": "Access Bank, Xploits Consulting donate food, school items to orphanages in FCT -NigPilot",
    "summarized_story": "In continued efforts to bring succor to orphans across the FCT, Access Bank Plc and Xploits Consulting Ltd , have donated food and school items to some orphanages as part of their projects to ensure that they have a better life.\nSome of the orphanages captured in the project and visited include Daughters of Charity Orphanage, Bwari, Destined Children’s Orphanage, Kado Estate, Abuja, Best Life Orphanage, Gwagwalada, Al’ansar Orphanage, Kuje in the FCT.\nSpeaking at the handing over of the items, Director, Communications, Xploits Consulting Ltd, Mrs, Grace Taiwo said that the presentation of the items were part of Access Bank Plc’s Corporate Social Responsibility, CSR adding that the bank’s commitment was largely focused around the United Nations Sustainable Develop Goals.\nTaiwo assured that her organisation with support from Access Bank Plc will continue to invest in the lives of Nigerians especially in areas of education, health, gender equality, arts.\nShe listed some of the items donated to include food items, toiletries and stationeries."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "President Buhari Receives Certificate of Incorporation For NNPC",
    "summarized_story": "President Muhammadu Buhari has received the Certificate of Incorporation of the Nigerian National Petroleum Corporation (NNPC).\nFollowing the signing of the Petroleum Industry Bill into law by President Muhammadu Buhari on August 17, Mr Sylva had said that the (NNPC) will become a commercial company within six months.\nConsequently, all shares in NNPC Limited are expected to be vested in the government at incorporation and held by the Ministry of Finance.\nREAD ALSO: President Buhari Signs Petroleum Industry Bill Into LawMr Sylva noted that although the new Petroleum Act has deregulated the oil sector, subsidy policies will remain in place till further notice.\nIn addition, he said the passage of the PIA will also boost the nation’s oil reserves from 37 billion barrels to 40 billion barrels."
  },
  {
    "headline": "Banditry: Police Rescue 187 People From Zamfara Forest",
    "summarized_story": "The Police in Zamfara State have rescued 187 people abducted and held captive by bandits in Tsibiri Forest in Maradun Local Government Area of the state.\nSome of those rescued are natives of Gora Namaye, Rini, and Shinkafi in Zamfara while the others are from Sabon Birnin LGA in Sokoto State.\nAccording to the police commissioner, these efforts led to the rescue of hundreds of abducted victims who have been reunited with their respective families.\nElkana gave the assurance that the police and other security agencies would continue to put in their best to ensure the return of lasting peace and security in the state.\nThe Secretary to the State Government, Kabiru Balarabe, who received the rescued victims thanked the police and other security agencies for enforcing the new security measures."
  },
  {
    "headline": "Buhari Presents N16.39trn 2022 Budget Proposal To National Assembly",
    "summarized_story": "President Muhammadu Buhari on Thursday proposed a total budget of N16.39 trillion for the year 2022 to the National Assembly.\nThe 2022 Budget will be the last full year budget to be implemented by this administration.\nFederal Government’s retained revenues (excluding Government Owned Enterprises) amounted to 2.61 trillion Naira against the proportionate target of 3.95 trillion Naira for the period.\nMr. Senate President, Mr. Speaker, Distinguished and Honourable Members of the National Assembly, this speech would be incomplete without commending the immense, patriotic, and collaborative support of the National Assembly in the effort to deliver socio-economic development and democracy dividends for our people.\nI wish to assure you of the strong commitment of the Executive to strengthen the relationship with the National Assembly."
  },
  {
    "headline": "UK Relaxes Rules For Fully Vaccinated Travellers From Nigeria",
    "summarized_story": "The United Kingdom has reviewed its travel protocols for travellers from Nigeria who have taken their complete jabs of the COVID-19 vaccines approved by authorities in the country.\nThe revised policy applies to those who have been fully vaccinated with AstraZeneca (including Covidshield), Pfizer, Moderna and Johnson and Johnson vaccines.\n“Fully vaccinated means that you have had a complete course of an approved vaccine at least 14 days before you arrive in England.\nThe day you had your final dose does not count as one of the 14 days,” the statement added.\nI would encourage all eligible people to get vaccinated,” Llewellyn-Jones said."
  },
  {
    "headline": "Pop Diva Adele Breaks Silence, Bares Pain In Return Interview",
    "summarized_story": "People are used to me being a recluse,” she said in comments published on the fashion magazine’s website late Thursday, her first major interview since 2016.\n“I’ve been on my journey to find my true happiness ever since,” added Adele, who currently lived in Los Angeles.\n“My relationship with men in general, my entire life, has always been: ‘You’re going to hurt me, so I’ll hurt you first’.\nIt’s just toxic and prevents me from actually finding any happiness,” she told Vogue.\n“I got really famous right as Amy Winehouse died,” she told Vogue."
  },
  {
    "headline": "UK Government changes vaccination policy for Nigerian travellers -",
    "summarized_story": "The United Kingdom has announced that fully vaccinated Nigerian travellers to England will not need to take a pre-departure test, undertake a day 8 test or self-isolate for 10 days as previously required, with effect from Monday, October 11.\nThis policy, according to the British High Commission, applies to those fully vaccinated with AstraZeneca (including Covidshield), Pfizer, Moderna and Johnson and Johnson.\n“This policy applies to those fully vaccinated with AstraZeneca (including Covidshield), Pfizer, Moderna and Janssen (Johnson and Johnson).\nFully vaccinated means that you have had a complete course of an approved vaccine at least 14 days before you arrive in England.\nThe statement also quoted the acting British High Commissioner, Ben Llewellyn-Jones, as saying, “The exemption of fully-vaccinated Nigerians travelling to the UK from providing a pre-departure test and self-isolating for 10 days, is a very welcome development."
  },
  {
    "headline": "EFCC arraigns Nigerian Female accomplice in P&ID scam",
    "summarized_story": "The Economic and Financial Crimes Commission, EFCC, on Thursday October 7, 2021 re-arraigned Mrs. Grace Taiga, a female accomplice in the multiple fraud case involving Process and Industrial Development Limited (P&ID) before Justice Obiora Egwuatu of the Federal High Court, Abuja on 9 count amended charges, bordering on accepting bribes and other related crimes.\nThe defendant pleaded not guilty to all the charges while the prosecution counsel, Abba Mohammed prayed the court for a trial date and for the defendant to be remanded in prison custody.\nDefence counsel, Ola Olanipekun, SAN, said he filed a bail application on behalf of the defendant on March 18, 2021, praying the judge to admit her to bail on the grounds of ill-health and being a senior lawyer and former director, Legal Services in the Ministry of Petroleum Resources who was called to the Bar in 1977.\nHowever, the prosecuting counsel said the Commission filed a counter affidavit rejecting the bail application and a further counter affidavit this morning, which he said they relied on.\nAfter listening to the arguments by counsel, Justice Egwuatu released the defendant to her counsel and adjourned the matter till October 27, 2021 for ruling on her bail application."
  },
  {
    "headline": "No life lost in Federal Secretariat fire",
    "summarized_story": "The Federal Government has said no life was lost in the fire incident which occurred at the Federal Secretariat, Ministry of Education Wing on Wednesday.\nA statement signed by the Director Press, Federal Ministry of Education says two of the affected staff in the incident who have been hospitalized at the Maitama General Hospital in Abuja are in stable condition and are responding to treatment.\nCommenting on the cause of the fire incident, the Director said, preliminary investigation indicates that the fire incident may have been caused by a power surge, resulting to a spark from an electrical condition, which ignited the fire.\nHe explained that a Committee has been constituted with a view to investigate and determine the actual cause of the fire and to recommend measures to be taken to prevent similar incidents in future."
  },
  {
    "headline": "BREAKING: PDP NEC approves zoning of chairmanship position to north -",
    "summarized_story": "The national executive Committee of the People’s Democratic Party has adopted recommendations by the governor ifeanyi ugwuanyi led zoning committee.\nThe recommendation requires that the position of the national chairman of the party should be zoned to the North, the Party also agreed that the current offices being held by officers in the Southern Zones of the country, namely, South West, South East and South South zones, should swap places with the offices currently in the northern zones of Nigeria, namely, North West, North East and North Central zones.\nThis recommendations were approved by the national executive Committee which is the second highest decision making organ of the PDP.\nThe meeting of the PDP NEC had in attendance former vice president Atiku Abubakar and other top party stalwarts, many of whom have stayed out of party politics since the PDP lost power in 2015."
  },
  {
    "headline": "Ex-VP Atiku Says Zoning the Presidency Not the Solution to Nigeria’s Problems",
    "summarized_story": "Atiku Abubakar, former vice-president, says Nigeria’s president can come from any part of the country.\nAbubakar spoke on Thursday at the national executive committee (NEC) meeting of the Peoples Democratic Party (PDP) in Abuja.\nThe former vice-president said the geopolitical zone of the president is not the solution to the problems of the country.\n“The Peoples Democratic Party (PDP) has the right to determine its rules and how the party should be governed.\n“There is no such thing as a president from southern Nigeria or a president from northern Nigeria."
  },
  {
    "headline": "Two Journalists, Russia’s Muratov and Phillipines’ Ressa, Win Nobel Peace Prize – Arise News",
    "summarized_story": "The Nobel Peace Prize has been awarded to journalists Maria Ressa of the Philippines and Dmitry Muratov of Russia.\nThe Rome-based U.N. agency was lauded for seeking to end starvation as “a weapon of war and conflict.”The prestigious award is accompanied by a gold medal and 10 million Swedish kronor (over $1.14 million).\nThe prize money comes from a bequest left by the prize’s creator, Swedish inventor Alfred Nobel, who died in 1895.\nOn Monday, the Nobel Committee awarded the prize in physiology or medicine to Americans David Julius and Ardem Patapoutian for their discoveries into how the human body perceives temperature and touch.\nThe Nobel Prize in physics was awarded Tuesday to three scientists whose work found order in seeming disorder, helping to explain and predict complex forces of nature, including expanding our understanding of climate change."
  },
  {
    "headline": "US Senate Approves Temporary Lift of Debt Ceiling, Averts Default",
    "summarized_story": "The Senate voted 50-48 to pass the bill following weeks of partisan fighting.\nThe plan emerged on Wednesday after top Senate Republican Mitch McConnell said Republicans were open to a temporary hike after twice blocking Democrats’ attempts to raise the cap.\nread moreRECONCILIATIONWashington’s debt limit troubles are unlikely to be resolved with passage of the short-term increase.\nReferring to the deal providing a debt limit reprieve until December, McConnell said in a Senate speech: “Now there will be no question.\nDemocrats had been trying to pass legislation that would have raised the debt limit through the end of 2022, which Republicans blocked."
  },
  {
    "headline": "Rising Chip Prices Fuel Samsung’s Best Quarterly Profit in 3 Years",
    "summarized_story": "Samsung Electronics Co Ltd on Friday flagged a 28% jump in its third-quarter operating profit to the highest in three years, driven by rising memory chip prices and display sales for new flagship smartphone launches.\nThe world’s largest memory chip and smartphone maker estimated its July-September profit at 15.8 trillion won ($13.3 billion), below a Refinitiv SmartEstimate of 16.1 trillion won.\n“The mobile business’ operating margin might have been lower than the market expected,” said Park Sung-soon, analyst at Cape Investment & Securities.\n“We will have to see marketing costs and what the mix of products Samsung sold was like.”Rising memory chip prices and shipments, plus a jump in profitability at Samsung’s chip contract manufacturing business, likely raised the chip division’s operating profit by about 79% from a year earlier, analysts said.\nSemiconductors accounted for about half of Samsung’s operating profit in the first half of the year."
  },
  {
    "headline": "Tesla Moving Headquarters to Texas from California",
    "summarized_story": "Tesla joins Oracle, HP and Toyota Motor in moving U.S. headquarters to Texas from California, which has relatively high taxes and living costs.\n“I’m excited to announce that we’re moving our headquarters to Austin, Texas,” Musk told the company’s annual meeting, held in the Texas car factory.\n“This is not a matter of, sort of, Tesla leaving California,” he said, saying it plans to increase output from its main California factory and Nevada factory by 50%.\nThe Fremont, California factory nonetheless is “jammed” and it is tough for people to afford houses in California, he said.\nMusk had a rocky relationship at times with California, threatening to move Tesla headquarters and future programs to Texas during a row over the closure of Tesla’s factory in Fremont, California due to COVID-19, for instance."
  }
]