[
  {
    "headline": "Christmas: Extend love to your neighbours, Atiku tasks Nigerians",
    "summarized_story": "Former Vice President, Abubakar Atiku, on Saturday admonished Nigerians to extend love to their neighbours.\nHe made this call in his Christmas message which he shared across his social media platforms.\nEmphasising on the essence of the celebration, the former Presidential aspirant noted that Nigerians should trust God for a better tomorrow.\nHe said, “Christmas is a time of love, therefore, I call on all Nigerians to emulate the essence of this season and unite for the greater good of our dear country.\n“We should continue to extend hands of love and fellowship to our neighbours and live as one big family, irrespective of our social, political and religious leanings and continue to trust God for a better tomorrow and a greater country.”Copyright PUNCH."
  },
  {
    "headline": "Corper’s family begs Army not to dismiss romantic soldier",
    "summarized_story": "The family of a youth corper simply identified as Remi, who proposed to a female soldier, Private Sofiyat Akinlabi, at the National Youth Service Corps Orientation Camp in Yikpata, Kwara State, has appealed to military authorities not to dismiss the romantic soldier.\nWe don’t want her to be dismissed; we want her to continue her job in the military,” a family source told our correspondent.\nAccording to the family member, Remi and Akinlabi’s friendship started in Abeokuta, Ogun State over three years ago before the latter joined the military.\nThe lovebirds had shared a hug and kiss to the delight of other corpers at the Mammy market.\nThey met in Abeokuta over three years ago before she joined the Army but lost contact some time ago."
  },
  {
    "headline": "Ugwuanyi receives Enugu/US-born international basketball star",
    "summarized_story": "Governor Ugwuanyi Ifeanyi of Enugu State, on Friday, received the US-born international basketball forward and Captain of the Nigeria Women’s National Team, Adaora Elonu, who hails from Okpatu in Udi Local Government Area of Enugu State, at the Government House, Enugu.\nElonu who also plays basketball in Spain and the US is in Enugu for the festive season and other engagements.\nSpeaking to newsmen shortly after the meeting, the international basketball player expressed gratitude to Gov.\nCornelius Nnaji, the Deputy Speaker of the Enugu State House of Assembly, Rt.\nUche Ugwu, the Special Adviser to the Governor on Information, Steve Oruruo and the Enugu State Basketball Coach, Chiedozie Nwoye joined Gov."
  },
  {
    "headline": "El-Rufai felicitates with Christians on Christmas, preaches love, tolerance",
    "summarized_story": "By Ibrahim Hassan-WuyoGovernor Nasiru Ahmad El-Rufai of Kaduna State has facilitated with the Christian faithful on the special occasion of Christmas.\nHe set for us an example of the power of faith, providing an assurance that we can be better than our current circumstances.”“We celebrate Christmas in difficult times.\nWe can all, as Christians as well as Muslims, emulate the example of Jesus Christ.\nWe pray to God Almighty that the blessings and lessons of Christmas will spread all through our State and move us to be better people.\nThe festive aspects of our celebration of Christmas may be limited by the continuing threat of Covid-19."
  },
  {
    "headline": "Yuletide: We’ve had enough, God protect us this season – CAN",
    "summarized_story": "By Ibrahim Hassan-WuyoChristians in Kaduna State have invoked God’s blessings upon them in this Christmas season, to have no reason to cry over any loss during the Yuletide.\n” The love of God has been poured on us, he shall shield us.\nThe Chairman of the Christian Association of Nigeria, CAN,in Kaduna state, Rev.\nSo if christ said “watch and pray he means watch and pray, Get it right brethren, he did not just said pray, he said WATCH and then pray.\nThe COVID-19 is still very much around with us and still evolving, I call on Christians in Kaduna state to observe all protocols given to deal with this pandemic."
  },
  {
    "headline": "In this new season, I shall focus on God only – Ooni’s Ex-wife",
    "summarized_story": "Naomi stated this through a statement released on her official social media handle yesterday shortly after dropping her title as the wife of the Yoruba monarch in the country.\nThe former queen of Ile-Ife, described the period after her divorce to the monarch as a new season, adding that the period would be dedicated solely to God’s activities across the country.\nIn this new season, I shall be focusing on God only”“It is God’s way of saying I know about it all.\nI, at this moment, appeal to all parties involved to allow the peace of God with the consciousness that there is a lovely little boy between us.\nAfter dropping the status of the monarch’s wife, Silekunola stressed that she has embraced the status of “Queen of the people and mother of my adorable Prince”."
  },
  {
    "headline": "Ugwuanyi ambassador of peace, good governance, says Enugu lawmaker",
    "summarized_story": "By Ikechukwu OduThe lawmaker, representing Nsukka West State Constituency in the Enugu State House of Assembly, Dr. Emma Ugwuerua, yesterday, described Governor Ifeanyi Ugwuanyi of Enugu State as an ambassador of peace whose dexterity in governance has brought security of lives and properties in the state.\nThis is really to appreciate you on the way and manner we have been working together to support His Excellency, the Executive Governor of Enugu State, Rt.\nIfeanyi Lawrence Ugwuanyi and my humble self that represents our Constituency in the Enugu State House of Assembly,” the lawmaker said.\nWhile urging him to continue with his kind gesture and community services, they also thanked Governor Ugwuanyi for giving him a level-playing ground to operate.\nThe duo who spoke on behalf of the party stakeholders pledged their unalloyed support to Governor Ugwuanyi and Dr. Emma Ugwuerua."
  },
  {
    "headline": "Senator Adeyeye felicitates with Christians, Ekiti residents at Christmas",
    "summarized_story": "The year 2021 presented a unique set of challenges for the human race but despite this, humanity has a lot to be thankful for.\nThis was the thrust of a message by Senator Dayo Adeyeye at Christmas this year.\nHe said for Nigerians especially, the challenges posed by the dwindling economy, insecurity and the COVID-19 pandemic were enough to dampen peoples spirit.\nAdeyeye used the occasion to congratulate Ekiti citizens for an eventful year that has been largely peaceful, urging them to celebrate in moderation while engaging in some sober reflection on the past and the road ahead.\nSenator Adeyeye wished all Ekiti residents a Merry Christmas."
  },
  {
    "headline": "Resident doctors reject FG’s new hazard allowance",
    "summarized_story": "The National Association of Resident Doctors (NARD), have rejected the new hazard allowance announced by the federal government for medical doctors and health workers in the country.\nThe government increased the allowance for doctors from N5,000 to between N32,000 and N40,000 while other health workers like nurses, laboratory workers among others had theirs reviewed to between N15,000 and N34,000 respectively.\nA circular with reference number SWC/S/04/S.218/11/406 dated December 22, 2021, and signed by the Executive Chairman of the National Salaries, Wages and Income Commission stated, “Concerning the review of the hazard allowance applicable to health workers in the services of the federal hospitals, medical centres and clinics in ministries, departments and agencies, the hazard allowance was reviewed to a flat rate that ranges from N5,000 to between N15,000 and N34,000 for health workers on the CONHESS salary structure, while doctors on CONMESS had theirs reviewed from N5,000 to between N32,000 and N40,000.”But the position of the National Association of Resident Doctors’ position in a statement issued by Dr Godiya Ishaya; its National President, indicate the medical union is not satisfied with the review.\nThe association enjoined the Federal Government to review the rate to prevent the need for further negotiations in the future."
  },
  {
    "headline": "Christmas: Rep Onuigbo tasks Nigerians on patriotism",
    "summarized_story": "The lawmaker representing Ikwuano/Umuahia North/Umuahia South federal Constituency of Abia State at the House of Representatives, Sam Onuigbo, has insisted that only the collective resolve and spirit of patriotism by Nigerians can foster an egalitarian and peaceful Society.\nThe federal lawmaker gave the assurance in his Christmas message issued to newsmen in Umuahia on Friday.\nThe Abia federal lawmaker on behalf of his family, felicitated with the people of Ikwuano/Umuahia North/Umuahia south federal Constituency, and the entire Abians at yuletide.\nHe further asked God to bless and protect the entire constituents of IKwuano, Umuahia North, Umuahia south constituency, Abia State and Nigeria at large.\nThe message by Onuigbo partly said, “though we are faced with various challenges as a constituency, state and country, these obstacles are, however not insurmountable."
  },
  {
    "headline": "Pray for peace, unity of Nigeria – Oyetola sues Christians",
    "summarized_story": "Osun State Governor, Gboyega Oyetola, has felicitated Nigerians, particularly Christians in the state as they celebrate the birth of Jesus Christ.\nOyetola asked Christians to use the festive occasion to pray for the prosperity, peace and unity of Nigeria.\nIn his Christmas message signed by his spokesperson, Ismail Omipidan, Oyetola urged Christians to use the Yuletide season to rekindle acts of love and kindness to one another, especially the vulnerable in the society.\n“Also, let us seize the festive occasion to pray for the prosperity, peace and unity of Nigeria as this period calls for introspection and continued prayers for our dear nation.\nI, therefore, call on Nigerians to continue to reflect on the positive tenets that unite us as a nation and strengthen the polity,” Oyetola said."
  },
  {
    "headline": "We have much to learn from Christmas – Senator Basiru to Osun Christians",
    "summarized_story": "The Senate spokesperson and Senator representing Osun Central Senatorial District, Ajibola Basiru has said Nigerians have a lot to learn from the birth of Jesus Christ.\nMaking this known in a Christmas message to the residents of Osun State, Basiru said Jesus lived his life to change lives, restore hope to the hopeless even as he built an army of followers and endured in the face of persecution being born in a simple manger.\nWhile remarking that with a solid faith in God, prayers and perseverance, Nigeria will overcome its challenges, he revealed that the country’s leadership has not been taking things lying down.\nHe said “I want to felicitate Christians and of course the entire constituents of Osun Central on the occasion of this years Christmas celebrations, marking the birth of the Lord, Jesus Christ.\nWe have a full course to thank God for sparing our lives and for seeing us scaling social and economic hurdles year 2021 placed before us."
  },
  {
    "headline": "11 things you probably didn’t know about Bola Ige",
    "summarized_story": "11 things you probably didn’t know about Bola IgeChief James Ajibola Idowu Ige (SAN) was the Attorney-General and Minister of Justice renowned for his oratorial prowess and advocacy work on civil rights and democracy.\nHere are 11 things you probably did not know about the late Ige1.\nBola Ige was born in Esa Oke, Osun State in September 13, 1930.\nHe was a Nigerian lawyer and politician, who served as Attorney-General and Minister of Justice under former President Olusegun Obasanjo.\nIge established Bola Ige & Co in 1961 and later became a Senior Advocate of Nigeria."
  },
  {
    "headline": "‘I became an orphan again with Ige’s death’",
    "summarized_story": "‘I became an orphan again with Ige’s death’Elder statesman and former Osun State Governor Bisi Akande was on his way to Osogbo after a trip to the United Kingdom when Muyiwa Ige broke the news of his father’s death.\nHe drove in his car with Akinwumi and they headed for Osogbo via the old road from Ibadan, passing Iwo.\nThen, the line went off,” Akande recalled.\nMembers of the team started groaning and moaning and there was general confusion.\n“It was President Obasanjo on the other end,” Akande recalled."
  },
  {
    "headline": "Ige wanted to resign from Obasanjo’s govt before murder, says Akande",
    "summarized_story": "Ige wanted to resign from Obasanjo’s govt before murder, says AkandeChief Bola Ige intended to resign from the government of Chief Olusegun Obasanjo before he was killed on December 23, 2001, former Osun State Governor Chief Bisi Akande has said.\nAkande, in his book, ‘My Participations’, recalled that the late Ige confided in him about his plan to leave as the Attorney-General of the Federation and Minister of Justice.\nHis reason was that the government was not implementing programmes that could benefit the people.\nBefore being posted to the Ministry of Justice, Ige was Minister of Power and had vowed to ensure a stable electricity supply within six months.\n- Advertisement -The author also added that Ige’s former deputy governor, who was then the Minister of Internal Affairs, Chief Sunday Afolabi, chided Chief Ige that he should not forget that he was only invited to ‘come and eat.’"
  },
  {
    "headline": "Akande: How ex-minister Bola Ige was killed",
    "summarized_story": "Elder statesman Chief Bisi Akande has recounted how Chief Bola Ige was killed.\nIge was shot dead in his Ibadan, Oyo State capital, residence on December 23, 2001.\nAkande, who was Osun State governor at the time, recalled in his book ‘My Participations’ the circumstances in which Ige was killed.\n“Instead of going to Esa-Oke, Uncle Bola decided to spend the night in Ibadan.\n“They overpowered the only gateman who had been working with Uncle Bola before he took up the ministerial appointment with Obasanjo and marched him upstairs."
  },
  {
    "headline": "Buhari to Service Chiefs: Crush Boko Haram, ISWAP before 2023",
    "summarized_story": "The service chiefs yesterday got a fresh marching order from President Muhammadu Buhari to crush the Islamic State of West Africa Province (ISWAP), which has overtaken Boko Haram in the North East insurgency, before he leaves office in 2023.\nBuhari said he meant what he told the troops in Maiduguri on the need to rout Boko Haram and ISWAP insurgents.\nHe also sought a more proactive campaign to rout the insurgents, whether Boko Haram or ISWAP.\nHope, Peace, Joy, Love are the recurring themes of this time.\nHe expressed optimism that the current problem would soon vanish if Nigerians embrace peace which Jesus Christ Himself stands for."
  },
  {
    "headline": "Insecurity: Ganduje cries out to Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaGovernor of Kano State, Abdullahi Ganduje, has called on President Muhammadu Buhari to come to the aid of state governors, saying most forests across the country now accommodate terrorists, armed robbers, bandits and criminals.\nThe governor spoke at the State House after a meeting with President Buhari about the security situation in his state.\n“In Kano State we have taken some measures.\nIn that forest, we established a military training ground in conjunction with the Army.\nAnd there’s a lot of military training going on in that forest using the facilities that we have provided."
  },
  {
    "headline": "Christmas: Hard times for South-East, South-South travellers – The Sun Nigeria",
    "summarized_story": "From the Onitsha end, he ran into a long stretch of vehicles wanting to access the bridge.\nAt the Asaba end, he ran into another long line of vehicles wanting to cross over to the Onitsha end.\nIt stretched from the neck of the bridge at the Asaba Toll Gate till Abraka Junction in Delta State.\nLocated at the Onitsha end were various groups like Ocha Brigade, Anambra Youth Traffic Volunteers, Anambra Traffic Management Agency (ATMA) Police and Federal Road Safety Corps personnel.\nSimilarly, the House of Representatives recently directed security agencies to remove multiple checkpoints on highways leading to the South-East."
  },
  {
    "headline": "Christmas: Kalu calls for religious tolerance, harmony",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr Orji Kalu has urged Nigerians to use the Christmas season to offer prayers for the country.\nDescribing the Christmas season as an opportunity to demonstrate love, unity, piety, and service to humanity, Kalu congratulated Nigerians, especially Christians for the 2021 Christmas celebration.\nKalu, while calling on Nigerians regardless of religious differences to embrace peace and harmony, stressed that development could only thrive in a hitch-free atmosphere.\nNigerians should embrace the acts of forgiveness, tolerance, mutual respect, generosity and humanity in a bid to build a prosperous, indivisible and united Nigeria.\n“The merriment of the festivity should be extended to family, friends and associates, who are not Christians.”The former Governor wished Nigerians a joyous Christmas celebration."
  },
  {
    "headline": "Afenifere, MBF, lawyers: What National Assembly should do on Electoral Act",
    "summarized_story": "While some of the lawyers are urging the National Assembly to prove its independence by vetoing the President on the issue, leaders of such groups as Afenifere and the Middle Belt Forum are doubtful whether NASS members can pull that off.\nThey asked: “What happens to the freedom of political parties to determine their internal affairs?\nHe warned Nigerians not to allow the debate on the contentious direct primary provision to overshadow the critical aspect, which is the electronic transmission of election result.\nOn the issue of direct primary, he said the constitution of the political parties vests them with power to select their candidates for elections.\nNational Publicity Secretary of Afenifere, Jare Ajayi also, charged Nigerians and the National Assembly not to allow the vital aspects of the bill to be thrown into the waste-bins."
  },
  {
    "headline": "Pipeline damage: Lagos residents may celebrate Christmas in darkness",
    "summarized_story": "From Isaac Anumihe, AbujaResidents of Lagos State may celebrate Christmas in darkness following the damage yesterday of a pipeline along Isheri Olofin, off Igbando – LASU Expressway of Lagos State, by an early morning inferno.\nIn a statement, Transmission Company of Nigeria (TCN), said that the fire caused a massive damage to 330kV Ikeja-West Akangba transmission line 1, burning off a large portion of the conductor.\nThe transmission towers affected are the two closest to the site of the incident and three across the Lagos Canal.\n“As a result of the incident, there is a major reduction of bulk power wheeled to TCN’s 330/132/33kV Akangba Transmission Substation in Lagos.\n“Once it is energised, supply will be restored to all the substations affected by the incident from the second 330kV transmission line, as the load carried by the burnt 330kV line will now be transferred to the second line.”"
  },
  {
    "headline": "In Christmas Dispatch, Buhari Promises Nigerians End to Killings, Kidnappings",
    "summarized_story": "Hope, Peace, Joy, Love are the recurring themes of this time.\nUrges Citizens to Get VaccinatedAlso in the Christmas message, the President pleaded with all citizens to get vaccinated against COVID-19.\nIgnatius Kaigama yesterday lamented that the hearts of Nigerians are heavy with the suffering they had experienced and seen in 2021 alone.\nThe bishops said Nigerians should always remember the popular Christmas refrain, Emmanuel which is that “God is with us” and try to be hopeful of a better future.\nIn its Christmas message issued by the Catholic Bishops Conference of Nigeria (CBCN) jointly signed by the President, Most Rev."
  },
  {
    "headline": "FG: ISWAP’s Ability to Launch Rockets on Borno Disturbing",
    "summarized_story": "This is just as the federal government allayed the fears of Nigerians over the reported planned attack by terrorists on Abuja, the nation’s capital.\nISWAP had launched multiple rockets on Maiduguri, the state capital, hours before the visit of the President to Borno State.\nHe said: “The marching orders are always the same; you have even told Nigerians the marching orders of the President.\nGanduje Demands Deployment of more SoldiersGovernor Abdullahi Ganduje of Kano State has asked President Muhammadu Buhari to deploy more military personnel to forests in the state.\n“In Kano State, we have taken some measures."
  },
  {
    "headline": "NCDC: 45 Cases of Omicron so far Detected in Nigeria",
    "summarized_story": "*Says country now experiencing community transmission of variantOnyebuchi EzigboThe Nigeria Centre for Disease Control (NCDC) yesterday announced that 45 cases of the Omicron variant of COVID-19 had so far been recorded in the country, with no death logged.\nNCDC Director-General, Dr Ifedayo Adetifa, who disclosed the Nigerian Omicron statistics at a virtual media briefing, said the new cases were in people without travel history, which suggested that the country was already experiencing community transmission.\nAdetifa said the six cases of Omicron earlier detected were in persons with recent travel history to South Africa.\nAccording to him, it is important for Nigerians to maintain physical distance and avoid contact with anyone showing symptoms of respiratory illness.\nThe agency however said all the COVID-19 vaccines in the country offered significant protection against the Omicron variant, and that two doses should still ward off severe disease."
  },
  {
    "headline": "Buhari in Borno, Promises to Cater for Families of Dead, Wounded Soldiers",
    "summarized_story": "* Says with new hardware, military more prepared to flush out terroristsDeji Elumoye in AbujaPresident Muhammadu Buhari, yesterday, said his administration would support families of dead and wounded soldiers, and help them realise their potential.\nBuhari stated this in Maiduguri, the Borno State capital, when he addressed troops at the Nigerian Air Force Base.\nBuhari assured the families of soldiers, who paid the supreme price for the country, and the injured that the federal government would cater for their needs, in recognition of their sacrifices for all Nigerians.\nI am also happy with the increased level of cooperation between the good people of Borno State, other stakeholders and the security agencies.\nThis intervention will benefit not only students from Borno and the North-east but also students from all parts of Nigeria."
  },
  {
    "headline": "Olori Naomi, Ooni of Ife’s Wife, Announces Divorce from Monarch",
    "summarized_story": "Yinka Kolawole in OsogboWife of the Ooni of Ife, Oba Adeyeye Ogunwusi, Ojaja II, Olori Naomi Silekunola, yesterday, announced her separation from the monarch, citing many personal reasons.\nIn a statement posted on her verified Instagram handle and Facebook account, in the morning, Naomi announced an end to the three-year marriage.\nOoni, on assuming the throne of his fathers, married Olori Wuraola Zaynab Otiti, who left in 2017.\n“Kabiyesi Ooni Adeyeye Enitan Babatunde Ogunwusi, Ojaja II, The Ooni of Ife, is an embodiment of God’s love for humanity.\nWhile the Ooni may not be able to make comments in the media, we will not stand by and allow the office of the Ooni and by extension, the entire Yoruba race to be denigrated.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Police Officers Extorted N405,000 From Us After Falsely Accusing Us Of Being Cult Members— University Student",
    "summarized_story": "He said an officer had pointed his gun at the team of friends and cocked it even before the search began.\nHe added that while the search was on, the officers asked questions regarding their identities.\nSamuel said he had identified himself as a UNILAG student while his male friend identified himself as a student of Yaba College of Technology (YABATECH).\nBut another officer asked us to pay N400,000 instead.\n“The two guys with a woman they arrested along with us were invited to pay N640,000."
  },
  {
    "headline": "How Police Officers Extorted N405,000 From Us After Falsely Accusing Us Of Being Cult Members— University Student",
    "summarized_story": "He said an officer had pointed his gun at the team of friends and cocked it even before the search began.\nHe added that while the search was on, the officers asked questions regarding their identities.\nSamuel said he had identified himself as a UNILAG student while his male friend identified himself as a student of Yaba College of Technology (YABATECH).\nBut another officer asked us to pay N400,000 instead.\n“The two guys with a woman they arrested along with us were invited to pay N640,000."
  },
  {
    "headline": "How Police Officers Extorted N405,000 From Us After Falsely Accusing Us Of Being Cult Members— University Student",
    "summarized_story": "He said an officer had pointed his gun at the team of friends and cocked it even before the search began.\nHe added that while the search was on, the officers asked questions regarding their identities.\nSamuel said he had identified himself as a UNILAG student while his male friend identified himself as a student of Yaba College of Technology (YABATECH).\nBut another officer asked us to pay N400,000 instead.\n“The two guys with a woman they arrested along with us were invited to pay N640,000."
  },
  {
    "headline": "EXCLUSIVE: How Under Fire Policewoman, Colleagues Accused Of Extorting N22million Bitcoin From Young Men In Lagos Forced UK Returnee To Pay $30,000 Over Fictitious Petition",
    "summarized_story": "DSP Nwawe, who told her men to deal with the young man if he failed to cooperate, threatened to jail him and even get a promotion for doing so.\nImmediately DSP Nwawe and her rogue team received the $30,000, they did some paperwork and released Adedire to go.\n“They held me at gunpoint and forced me to sign a statement they had written that I was an Internet fraudster.\nIn October 2020, the situation hit a climax when young Nigerians took to the streets to protest police harassment, extortion and brutality.\nBut more than one year since that historic event, nothing has changed as rogue policemen continue to violate the rights of Nigerians – young and old."
  },
  {
    "headline": "EXCLUSIVE: How Under Fire Policewoman, Colleagues Accused Of Extorting N22million Bitcoin From Young Men In Lagos Forced UK Returnee To Pay $30,000 Over Fictitious Petition",
    "summarized_story": "DSP Nwawe, who told her men to deal with the young man if he failed to cooperate, threatened to jail him and even get a promotion for doing so.\nImmediately DSP Nwawe and her rogue team received the $30,000, they did some paperwork and released Adedire to go.\n“They held me at gunpoint and forced me to sign a statement they had written that I was an Internet fraudster.\nIn October 2020, the situation hit a climax when young Nigerians took to the streets to protest police harassment, extortion and brutality.\nBut more than one year since that historic event, nothing has changed as rogue policemen continue to violate the rights of Nigerians – young and old."
  },
  {
    "headline": "TCN restores power to Lagos communities -- hours after pipeline explosion",
    "summarized_story": "The Transmission Company of Nigeria (TCN) says it has restored power to Lagos areas affected by the pipeline explosion that rocked Alimosho LGA.\nFemi Oke-Osanyintolu, director-general, Lagos State Emergency Management Agency (LASEMA), said a pipeline explosion had led to the collapse of the 330KVA transmission power line.\nShe said that before the collapse of the five towers, the energised second 330KV Akangba-Ikeja West Line acted as a redundant line on that axis.\nSule Abdulaziz, TCN managing director, while inspecting the site of the incident, said the second 330kV line which tripped during the incident was patrolled by TCN engineers and certified okay before it was energised.\nAbdulaziz also added that TCN had already directed two contractors to mobilise for the reconstruction of the towers and 330kV line."
  },
  {
    "headline": "TCN restores power to Lagos communities -- hours after pipeline explosion",
    "summarized_story": "The Transmission Company of Nigeria (TCN) says it has restored power to Lagos areas affected by the pipeline explosion that rocked Alimosho LGA.\nFemi Oke-Osanyintolu, director-general, Lagos State Emergency Management Agency (LASEMA), said a pipeline explosion had led to the collapse of the 330KVA transmission power line.\nShe said that before the collapse of the five towers, the energised second 330KV Akangba-Ikeja West Line acted as a redundant line on that axis.\nSule Abdulaziz, TCN managing director, while inspecting the site of the incident, said the second 330kV line which tripped during the incident was patrolled by TCN engineers and certified okay before it was energised.\nAbdulaziz also added that TCN had already directed two contractors to mobilise for the reconstruction of the towers and 330kV line."
  },
  {
    "headline": "Medical council scraps N900,000 fee for foreign-trained doctors -- after public outcry",
    "summarized_story": "The Mental and Dental Council of Nigeria (MDCN) has scrapped the N900,000 mandatory fee for foreign-trained medical doctors.\nAdvertisementThe council, in a statement, announced that its previous publication that foreign-trained doctors are to undergo a six-month mandatory attachment programme in teaching hospitals has been withdrawn.\nTheCable had reported that the medical council asked all medical graduates who schooled abroad and seek to take the council’s assessment examination will undergo a six-month mandatory attachment programme.\nAdvertisementThe decision of the medical council did not go down well with many Nigerians in the wake of the massive emigration of health workers to other countries.\n“This is to inform the general public, that following the public reactions to the MDCN publication on the mandatory six-month teaching hospitals attachment programme for foreign-trained medical and dental graduates, especially the petition by a coalition of parents of foreign-trained medical doctors to the national assembly,” the statement reads."
  },
  {
    "headline": "Medical council scraps N900,000 fee for foreign-trained doctors -- after public outcry",
    "summarized_story": "The Mental and Dental Council of Nigeria (MDCN) has scrapped the N900,000 mandatory fee for foreign-trained medical doctors.\nAdvertisementThe council, in a statement, announced that its previous publication that foreign-trained doctors are to undergo a six-month mandatory attachment programme in teaching hospitals has been withdrawn.\nTheCable had reported that the medical council asked all medical graduates who schooled abroad and seek to take the council’s assessment examination will undergo a six-month mandatory attachment programme.\nAdvertisementThe decision of the medical council did not go down well with many Nigerians in the wake of the massive emigration of health workers to other countries.\n“This is to inform the general public, that following the public reactions to the MDCN publication on the mandatory six-month teaching hospitals attachment programme for foreign-trained medical and dental graduates, especially the petition by a coalition of parents of foreign-trained medical doctors to the national assembly,” the statement reads."
  },
  {
    "headline": "Tunde Lemo, Mudassir Amray... meet bankers behind 2-year-old Titan Trust Bank",
    "summarized_story": "On Thursday, a 2-year-old Titan Trust Bank (TTB) acquired an 89.39 percent stake in the 104-year old Union Bank of Nigeria Plc.\nTitan Trust operates as a commercial bank with national authorisation.\nTUNDE LEMO, CHAIRMANTunde Lemo, chairman of Titan Trust Bank, is a Nigerian banker and former deputy governor, Central Bank of Nigeria (CBN).\nADAEZE UDENSI, EXECUTIVE DIRECTORAdaeze Udensi, the executive director of Titan Trust Bank, joined the company in April 2019.\nShe joined Heritage in March 2015 and served as an executive director and executive compliance officer."
  },
  {
    "headline": "Ghana’s answer to Silicon Valley is inside refurbished government buildings",
    "summarized_story": "This project in the heart of Ghana’s capital city, the Accra Digital Centre, is a symbol of Ghana’s ambition to be the startup capital of Africa.\nAn aerial view of the Accra Digital Centre“Beyond Ghana’s capital city, the government has identified unused government buildings around the country,” said David Ofori, Head of Operations at the Accra Digital Centre.\nFour years later, the Accra Digital Centre is living up to expectation and looks to be a worthy template for other centres across the country.\nAnother early tenant of the Accra Digital Centre is aYo, an affordable insurance product by MTN.\nThe Accra Digital Centre is looking to partner with local or foreign investors and investment companies to expand its reach and impact."
  },
  {
    "headline": "Flutterwave x Wizkid to drive global payments adoption",
    "summarized_story": "While Paystack was more involved with helping startups collect payments, Flutterwave focused on helping anyone send and receive money via its API.\nSince then, the digital payments service has transformed payments in Africa with a number of solutions.\nIt allows African merchants collect payments from their customers anywhere in the world, on web and mobile.\nFlutterwave SendFlutterwave Send dashboardIts latest product, Flutterwave Send, is taking payments to the global level.\nThe Essence of Flutterwave SendAt the helm of Flutterwave Send is Afrobeats artiste, Ayodeji Ibrahim Balogun—popularly known as Wizkid—who was signed on as Flutterwave’s global brand ambassador."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Worried about your child’s online safety during holidays? Try these tools",
    "summarized_story": "Nearly all social media platforms have age restrictions of at least 13 years to use their platform.\nWith many divided on the move, China’s regulatory authority has implemented regulations requiring social media and gaming companies to disincentivise youth from spending too much time on social media.\nGiven the several reported cases of online abuse on the platform, online safety precautions need to be taken, especially for young people.\nTikTokPhoto by Solen Feyissa on UnsplashWith over 2.6 billion downloads, TikTok is one of the most used social media platforms globally.\nLike every other social media platform, it has its safety issues."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "In Ecobank’s case with Honeywell, bank’s lawyer is biggest victim so far",
    "summarized_story": "On January 11, 2018, the Legal Practitioners Privileges Committee severely sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of senior advocate of Nigeria and all other privileges attached to the rank.\nAs set out above, Ogunba on behalf of Ecobank, deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.\nRead Also: Ecobank warns FMN against Honeywell acquisition deal“It is obvious that it is Ecobank’s intention through Ogunba to harass, embarrass and disrupt the business of the Honeywell Group.\nThe damaging effect of Ecobank’s numerous mischievous suits and wrongly obtained orders is enormous and cannot be quantified.\n“Consequently, the legal practitioners’ privileges committee at its 129th plenary meeting have withdrawn the rank of senior advocate of Nigeria from Kunle Ogunba Esq and all other privileges attached to the rank forthwith.”The story has been updated."
  },
  {
    "headline": "Christmas: Edo govt urges love, sacrifice, fetes orphans, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged residents in the state to show love to orphans and the less privileged, in the spirit of the Christmas celebration.\nAddressing journalists in Benin City, after presenting gift items to children at the Project Charilove Foundation, in Benin City, the Commissioner for Social Development and Gender Issues, Hon.\nMaria Edekor said the government is committed to the welfare of all citizens, including the less privileged.\nGod gave them to us and we are happy because every gift from God is a good gift.”The commissioner further stated, “His Excellency thought it wise that we bring these gift items to these children.\nThe government is ready to serve the people, irrespective of your status or vulnerability.”The founder and service leader, Project Charilove Foundation, Bro."
  },
  {
    "headline": "CHRISTMAS MESSAGE – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI wish all Edo people in the state and the Diaspora a merry Christmas.\nKindly adhere to the COVID-19 protocols and be safe as you celebrate with your friends and loved ones.\nFor security and other emergencies, please call the Edo helpline on 08000911911 and 08001235111.\nI wish you all a joyful Christmas celebration.\nSignedHis Excellency, Godwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "AIG Zone 5 Warns Officers Against Bullying, Extortion, others – Nigerian Observer",
    "summarized_story": "AIG Ahmad Abdurrahman stated this in his maiden chat with our crime reporter at his office, Zone 5 Command headquarters, Adesuwa road, Benin City, yesterday.\n“I have held my maiden address with some senior police officers and some personnel of the zone.\nAIG Ahmad stated.\nRecall that AIG Ahmad Abdurrahman assumed duty in zone 5 on December 16, 2021 after taking over from AIG Isaac O. Akinmoyede who has been redeployed to zone 9, Umuahia.\nZone 5 Command with its headquarters on Adesuwa road in Benin City is in charge of Edo and Delta States police command."
  },
  {
    "headline": "Buhari calls for cooperation among elites in tackling Nigeria’s challenges – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari says there is need for more cooperation among the elites in the country in resolving the challenges facing the nation.\nThe president’s spokesman, Mr Femi Adesina, in a statement in Abuja, said Buhari made the call when he visited the palace of the Shehu of Borno.\nHe said the elites owe it to the people to inform, guide and shape opinions since they had more access and knowledge on the economy.\n“What our country needs now is the continued cooperation of the elites.\nThe president assured Nigerians that his administration will use the remaining period to consolidate on efforts in restoring peace and improving the economy."
  },
  {
    "headline": "I have a small share in Titan Trust Bank – Tunde Lemo",
    "summarized_story": "Chairman of Titan Trust Bank Limited, Tunde Lemo, has said his shareholding in the bank, which is acquiring a majority stake in Union Bank of Nigeria Plc, is very small.\nLemo, a former deputy governor of the Central Bank, said this in a statement on Friday, a day after the announcement that the bank had reached an agreement to acquire 89.39 per cent stake in Union Bank.\nAccording to him, it had become necessary to make clarification on the structure of the bank following interest it generated after the announcement of Union Bank acquisition.\nI am only providing leadership.”On Thursday, the board of Union Bank announced that its investors, Union Global Partners Limited, Atlas Mara Limited and other shareholders, had reached an agreement with Titan Trust Bank to divest their shareholding in Union Bank to TTB.\nLemo was quoted in the statement that the transaction marked a key step for Titan Trust in its strategic growth journey and propelled the institution to the next level in the Nigerian banking sector."
  },
  {
    "headline": "Catholic Bishops warn Buhari, others against continued harassment of critics",
    "summarized_story": "The Catholic Bishops Conference of Nigeria (CBCN), has urged government at all levels to resist the temptation of harassing and arresting their critics.\nThe bishops gave the advice in a Christmas message signed by the President of CBCN, Most Reverend Augustine Akubueze, and made available to journalists on Friday in Abuja.\nThey said there is need to listen to everyone, advising all Nigerians to pray for a government that will listen to everyone.\nThe conference also urged the government to release those who were arrested and detained for speaking their mind about the government.\nAccording to the bishops, there is need to listen to each other, as part measures to resolve insecurity and other challenges confronting the country."
  },
  {
    "headline": "Sterling Bank’s One Woman partners QSE Foundation to empower women",
    "summarized_story": "Sterling Bank Plc, through its One Woman Proposition, has collaborated with the QSE Foundation to empower women in the Ikate Elegushi community of Lekki in Lagos State by providing them with credit facilities.\nThe programme for empowering women, which is a focal point for One Woman at Sterling Bank, will enable the women to scale up their existing businesses while also positioning Sterling Bank Plc as a gender-centric organization.\nSpeaking at the presentation ceremony, Mr. Gbenga Adegoke, Group Head, Products and Proposition with Sterling Bank, said the empowerment programme is an integral part of the bank’s partnership with QSE Foundation, founded by Olori (Queen) Sekinat Aramide Elegushi.\nThis is because Every Nanny has evolved beyond providing nanny services to rendering other services like home tutor, elderly care, cooks, housekeepers etc.\nFree annual health checks for women the entire week of the International Women’s Day in selected Sterling Bank branches is also being offered as part of the timely proposition"
  },
  {
    "headline": "Economic Sustainability Plan: NSIA, REA partner to roll out over 200,000 Solar Home Systems under “Solar Power Naija”",
    "summarized_story": "The Nigeria Sovereign Investment Authority (NSIA) is investing in the Off-Grid renewable space in partnership with the Rural Electrification Agency (REA).\nThe Solar Power Naija Program is being launched under the Buhari Administration’s Economic Sustainability Plan (“ESP”) and supervised directly by the Vice President of the Federal Republic of Nigeria, Prof. Yemi Osinbajo.\nThe NSIA-REA partnership will see the NSIA creating an initial revolving fund of N10 billion for qualified developers to distribute and manufacture Solar Home Systems.\nThe REA under the Ministry of Power will provide technical and advisory support to the NSIA as it rolls out the program.\nAt completion, it is expected that this investment will demonstrate locally that the Solar Off-Grid space is an investable segment of the power market."
  },
  {
    "headline": "Senate President Visits Kwankwaso In Kano Over Brother’s Death",
    "summarized_story": "The President of the Senate, Ahmad Lawan, on Friday, paid a condolence visit to former governor of Kano State, Senator Rabiu Musa Kwankwaso, whose younger brother, Alhaji Inuwa died few days ago.\nA statement signed by the media adviser to the Senate President, Ola Awoniyi, said Lawan was in Kano to attend the wedding fatiha of the daughter of another former governor of the State and member of the Senate, Senator Ibrahim Shekarau.\nShortly after the wedding, the Senate President and his entourage proceeded to Senator Kwankwaso’s house to commiserate and pray with him.\nThe Senate President was accompanied by the Senate Leader, Dr Yahaya Abdullahi, Senator Bello Mandiya and Senator Barau Jibrin.\nADVERTISEMENT“We are here in your house this afternoon to condole with you over the death of our brother, our friend, Alhaji Inuwa who died some few days ago."
  },
  {
    "headline": "Bandits Have Taken Over Falgore Forest, Ganduje Tells Buhari",
    "summarized_story": "Kano State governor, Abdullahi Ganduje, has raised the alarm over the invasion of Falgore Forest by bandits.\nADVERTISEMENTHe said, “First of all, I came to see Mr. President and brief him on the security situation in Kano.\n“In Kano State we have taken some measures.\nWe have two large forests the Falgore forest, which is bordering Kano, Kaduna and Bauchi and also not far away from Plateau.\nADVERTISEMENT“So, that is helping to checkmate the activities of bandits in that forest and I have requested Mr President to also establish another institution within that forest and that forest will be liberated completely."
  },
  {
    "headline": "Christmas: Imbibe Virtue Of Reconciliation, Kaduna Senator Tasks Nigerians",
    "summarized_story": "The Senator representing Kaduna Central in the National Assembly, Uba Sani, has urged Nigerians to imbibe the spirit of reconciliation as they celebrate this year’s Christmas.\nBut the most worrisome remains the nefarious activities of terrorists, kidnappers, assasins and other criminal elements.\nADVERTISEMENT“In some communities, lack of unity makes common action against criminal elements difficult.\nWe must realise that the activities of criminal elements threatens our common humanity.\nMay He reward your sacrifices,” Uba Sani stated."
  },
  {
    "headline": "Christmas: Imbibe Virtue Of Reconciliation, Kaduna Senator Tasks Nigerians",
    "summarized_story": "The Senator representing Kaduna Central in the National Assembly, Uba Sani, has urged Nigerians to imbibe the spirit of reconciliation as they celebrate this year’s Christmas.\nBut the most worrisome remains the nefarious activities of terrorists, kidnappers, assasins and other criminal elements.\nADVERTISEMENT“In some communities, lack of unity makes common action against criminal elements difficult.\nWe must realise that the activities of criminal elements threatens our common humanity.\nMay He reward your sacrifices,” Uba Sani stated."
  },
  {
    "headline": "SGF Mustapha Felicitates With Nigerians At Christmas",
    "summarized_story": "The Secretary to the Government of the Federation (SGF), Boss Mustapha, has felicitated with Nigerians, particularly the Christian faithful, on the joyous occasion of the 2021 Christmas celebration, to commemorate the birth of our Lord, Jesus Christ.\nHe described the birth of Jesus Christ as a blessing to mankind exemplified in his teaching of love, humility, forbearance, compassion and selflessness.\nAccording to a statement signed by the director of information in the office of the SGF, Willie Bassey, on Friday, he charged Christians to emulate the pattern of life of Jesus Christ by exhibiting love, unity, harmony and peaceful co-existence in their daily living.\nThe SGF also called on Christendom to re-dedicate themselves to the will of God by eschewing violence, avarice, discord and all negative tendencies capable of dividing the nation.\nADVERTISEMENTWhile wishing Nigerians a Merry Christmas and a prosperous New Year in advance, he reminded all on the need to continue to adhere to all non-pharmaceutical interventions (NPIs) including regular wearing of masks, washing of hands , social distancing and avoidance of unnecessary travels in order to curb the spread of the Omicron variant of COVID-19."
  },
  {
    "headline": "Christmas plea: Corps member’s family begs Army not to dismiss romantic soldier",
    "summarized_story": "The family of a youth corper simply identified as Remi, who proposed to a female soldier, Private Sofiyat Akinlabi, at the National Youth Service Corps Orientation Camp in Yikpata, Kwara State, has appealed to military authorities not to dismiss the romantic soldier.\n“We appeal to the Nigerian Army to tamper justice with mercy and release her.\nWe don’t want her to be dismissed; we want her to continue her job in the military,” a family source told our correspondent.\nAccording to the family member, Remi and Akinlabi’s friendship started in Abeokuta, Ogun State over three years ago before the latter joined the military.\nThey met in Abeokuta over three years ago before she joined the Army but lost contact some time ago."
  },
  {
    "headline": "Christmas plea: Corps member’s family begs Army not to dismiss romantic soldier",
    "summarized_story": "The family of a youth corper simply identified as Remi, who proposed to a female soldier, Private Sofiyat Akinlabi, at the National Youth Service Corps Orientation Camp in Yikpata, Kwara State, has appealed to military authorities not to dismiss the romantic soldier.\n“We appeal to the Nigerian Army to tamper justice with mercy and release her.\nWe don’t want her to be dismissed; we want her to continue her job in the military,” a family source told our correspondent.\nAccording to the family member, Remi and Akinlabi’s friendship started in Abeokuta, Ogun State over three years ago before the latter joined the military.\nThey met in Abeokuta over three years ago before she joined the Army but lost contact some time ago."
  },
  {
    "headline": "Christmas: NCDC begs security agents to enforce COVID-19 protocols",
    "summarized_story": "The call by the NCDC was contained in a directive obtained by Saturday PUNCH in Abuja on Friday.\nThese include the Federal Ministry of Health, state Ministries of Health and the NCDC.\nThe NCDC boss said the country had identified 39 additional cases of the Omicron variant, bringing the total number of confirmed infections to 45.\nAdetifa said as of Friday, Nigeria had not recorded any death from the Omicron variant of COVID-19.\n“In addition to vaccination, we are telling people to embrace preventive strategies to curtail the spread of COVID-19."
  },
  {
    "headline": "Christmas: NCDC begs security agents to enforce COVID-19 protocols",
    "summarized_story": "The call by the NCDC was contained in a directive obtained by Saturday PUNCH in Abuja on Friday.\nThese include the Federal Ministry of Health, state Ministries of Health and the NCDC.\nThe NCDC boss said the country had identified 39 additional cases of the Omicron variant, bringing the total number of confirmed infections to 45.\nAdetifa said as of Friday, Nigeria had not recorded any death from the Omicron variant of COVID-19.\n“In addition to vaccination, we are telling people to embrace preventive strategies to curtail the spread of COVID-19."
  },
  {
    "headline": "Tension as Imo Police recovers human skull from suspected oil dealers",
    "summarized_story": "The Imo State Police Command on Thursday paraded two suspects with human skulls who claimed to be in the oil business to lure their victims to their business premises in the bush where they were allegedly killed before collecting their vehicles and selling them.\nThe suspects were paraded at the Imo State Police Command in Owerri, alongside other suspects in other crime-related matters.\nThe suspects were Ejike Nwachukwu ‘Male’ aged 31 years of Umungwu Obosima in Ihaji/Egbema LGA, IMO State, Alaoma Egonu ‘Male’ aged 40 years of Umuoyem in Nkwerre LGA, IMO State but resident at No.\n“They later led the Police team to the buyer of the vehicles where one Aloma Egonu ‘Male’ was arrested.\nOn further interrogation,n they took the Police Operative to the bush where they normally dump their killed victims, on which the operatives discovered the decomposed body and recovered a human skull,” Police said."
  },
  {
    "headline": "Peruvian government reacts to Fireboy DML single Peru",
    "summarized_story": "Fireboy DML’s Peru featuring Grammy award winner Ed Sheeran has caught the attention of Peruvian Government.\nThe South American country through its official Twitter handle said Fireboy might have got his inspiration for the smash hit track from the country’s name.\nPeruvians were told by their government to listen to Peru Remix with British Singer Ed SheeranReacting to the song, the South American country wrote: “PERU PARA, PERU PERU PARA!!!\n🇵🇪🎶Seems like @edsheeran and @fireboydml were inspired by our country to launch their newest hit?\nFireboy had released the long-awaited international remix for his hit single featuring English singer Ed Sheeran."
  },
  {
    "headline": "Pope Francis calls for humility in Christmas Eve mass",
    "summarized_story": "Pope Francis Friday called on the faithful to value the “little things in life” and show solidarity with the poor in his Christmas Eve mass in St. Peter’s Basilica.\nThose who had not managed to grab a ticket watched on huge screens outside St Peter’s Basilica.\n“Jesus asks us to rediscover and value the little things in life,” he said.\nFrancis, formerly the Archbishop of Buenos Aires Jorge Mario Bergoglio, called for more solidarity with those living in poverty.\nIt was the second such Christmas Eve mass during the coronavirus pandemic."
  },
  {
    "headline": "I’ll Deal With Bandits, Next President Must Secure Nigeria — Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that his government will consider using military force to fight robbers in the northwest.\nBuhari remarked in Maiduguri, Borno State, that Nigeria is now receiving military weapons that will be utilized to combat bandits.\nIn addition, the President stated that his successor would work to ensure the country’s security.\nOnly a secure country, according to Buhari, can be managed.\n“The problem is in the North West as I said, is same people, same culture, we are going to deal with them."
  },
  {
    "headline": "2023: Primate Ayodele Gives Revelation On Nigeria’s Next President",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has described how Nigeria’s next president will appear.\nThe future president of Nigeria, according to Primate Ayodele, will not be an old man or a child.\nThe cleric said in a statement signed by his Media Aide, Oluwatosin Osho, that Nigeria’s next president will be one who is devoid of scandal, as God has revealed him.\nThere will be a lot that will surround who will become the next president of Nigeria.\nThe spirit of God says Buhari is ready to handover and will not interfere or dabble into the affairs of who becomes the next President."
  },
  {
    "headline": "BREAKING: Buhari Presides Over Security Meeting In Abuja",
    "summarized_story": "At the Presidential Villa in Abuja, President Muhammadu Buhari (retd.)\nis currently presiding over a security meeting.\nThis came after the President swore in Muazu Sambo, the newly appointed Minister of State for Works and Housing.\nThe Senate confirmed the new Minister of State, a building engineer, as a Minister-Designate earlier this week after the upper legislative house screened him.\nVice President Yemi Osinbajo, the Secretary to the Government of the Federation, Mr. Boss Mustapha, and the National Security Adviser, Major General Babagana Monguno, are among those in attendance (retd.)."
  },
  {
    "headline": "2023: Primate Ayodele Gives Revelation On Nigeria’s Next President",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has described how Nigeria’s next president will appear.\nThe future president of Nigeria, according to Primate Ayodele, will not be an old man or a child.\nThe cleric said in a statement signed by his Media Aide, Oluwatosin Osho, that Nigeria’s next president will be one who is devoid of scandal, as God has revealed him.\nThere will be a lot that will surround who will become the next president of Nigeria.\nThe spirit of God says Buhari is ready to handover and will not interfere or dabble into the affairs of who becomes the next President."
  },
  {
    "headline": "Insecurity: Declare state of emergency in Kaduna, other northern states – Bishop tells FG",
    "summarized_story": "The Bishop of Wusasa Diocese, Archbishop of Kaduna province and Dean Church of Nigeria (Anglican Communion), Most Rev.\nHe made the call in his Christmas message to citizens while speaking with Journalists in Zaria.\nLamido spoke of how Innocent people were either being killed or kidnapped in the region incessantly.\nHe said possession of fire arms by the citizens would not bring desired solution to problem, rather it would worsen the situation.\nOn the teaching of Christ, he called on both Muslims and Christians faith to tolerate one another and live in peace as the Christ himself represents peace."
  },
  {
    "headline": "Anambra: One dead, 6 injured on Christmas eve fatal crash",
    "summarized_story": "At least one person died on Christmas Eve following a fatal accident that occured along Enugu-Onistha expressway by Umuokpu, Awka South Local Government Area of Anambra state.\nBlueprint learnt that the deceased was the driver of the vehicle and probably the father and husband of the 11 occupants of the vehicle.\nAccording to an eyewitness, Mr Emmanuel Nwatarali, it was a lone crash involving 12 people in a blue Passat Volkswagen Wagon with registration number BEN658TP.\n“The FRSC rescue team on ground managed traffic and ensured that obstruction caused by the crash was cleared.\nThe Sector Commander Anambra State, Corps Commander Adeoye Irelewuyi has sympathized with the family of the dead victim and wished the injured victims quick recovery."
  },
  {
    "headline": "VIDEO: Watch as Nigerian man marries two wives same day as Christmas gift",
    "summarized_story": "A video has surface online, showing a Nigerian man, simply identified as Muhammed who married to two beautiful women on the same day in Niger State.\nThe wedding ceremony took place in Bida, Niger state.\nIt had been reported earlier that Mohammed had announced that his wedding ceremony to Adama and Aisha will last for five days.\nThe wedding festivities began on December 22, and will end on Sunday, December 26.\nRelatedNo tags for this post."
  },
  {
    "headline": "Nigerians Join Christians Worldwide To Celebrate Christmas",
    "summarized_story": "Christmas is here again and Christians in Nigeria have joined their fellow believers across the world to celebrate the birth of Jesus Christ.\nThe Nigerian Railway Corporation (NRC) said this gesture is to enable Nigerians to travel and celebrate Christmas.\nPresident Muhammadu Buhari in his New Year message congratulated Nigerians, especially the Christians.\nAnd as more states join the vaccination drive, President Buhari is also calling on Nigerians to get the jabs.\nMany State Governors across the country also asked Nigerians to be Christ-like as Christians across the world celebrate the birth of Jesus Christ."
  },
  {
    "headline": "Pope Calls For Humility In Christmas Eve Mass",
    "summarized_story": "Pope Francis Friday called on the faithful to value the “little things in life” and show solidarity with the poor in his Christmas Eve mass in St. Peter’s Basilica.\nThose who had not managed to grab a ticket watched on huge screens outside St Peter’s Basilica.\n“Jesus asks us to rediscover and value the little things in life,” he said.\nFrancis, formerly the Archbishop of Buenos Aires Jorge Mario Bergoglio, called for more solidarity with those living in poverty.\nIt was the second such Christmas Eve mass during the coronavirus pandemic."
  },
  {
    "headline": "Christmas: Governors Preach Love, Ask Nigerians To Emulate Christ",
    "summarized_story": "In his statement, Kwara State Governor AbdulRahman AbdulRazak said the Christmas season brings back good memories of God’s faithfulness and love for all, irrespective of creed.\n“Christ, the reason for the season, embodies peace, love for all, charity, goodness, equity and justice, and absolute belief in God.\n“Do good this Christmas season by remembering the less privileged,” he said.\nEmulating ChristIn his Christmas message, Ekiti State Governor, Kayode Fayemi, charged Christians to emulate Christ’s love and humility as they celebrate this year’s Christmas, stressing that the birth of Christ which Christmas symbolises was a demonstration of God’s love for humanity.\n“The Christmas festivity presents us all with an opportunity to relive the lessons of love, peace and sacrificial living that Christ taught with his life."
  },
  {
    "headline": "Avoid Unnecessary Travels To Curb Spread Of Omicron Variant – Boss Mustapha",
    "summarized_story": "The Secretary to the Government of the Federation, Boss Mustapha has asked Nigerians to avoid unnecessary travels in order to spread the spread of the Omicron variant in the country.\nThe SGF made the call in a statement issued by spokesperson Willie Bassey on the 2021 Christmas celebration to commemorate the birth of Jesus Christ.\n“The Secretary to the Government of the Federation, Boss Mustapha, felicitates with Nigerians, particularly the Christian faithful, on the joyous occasion of the 2021 Christmas celebration, to commemorate the birth of our Lord, Jesus Christ,” the statement read.\n“He described the birth of Jesus Christ as a blessing to mankind exemplified in his teaching of love, humility, forbearance, compassion and selflessness.\nHe charged Christians to emulate the pattern of life of Jesus Christ by exhibiting love, unity, harmony and peaceful co-existence in their daily living."
  },
  {
    "headline": "Ali Baba, Bois Olorun, Segun Obe, BJ Sax Thrill Audience At Sunrise Christmas Special",
    "summarized_story": "﻿The Christmas Special edition of Sunrise, Channels Television breakfast show featured top music artists and comedians thrilling the audience.\nNigeria’s King of comedy Alibaba Akpobome was the co-anchor who alongside the Ayo Makinde presented the Christmas special.\nThe gospel Apala music band, Boiz Olorun also serenaded the viewers as they render Christmas songs in traditional style served with melodious drumming of gangan.\nGospel singer Segun Obe and Saxophonist BJ Sax performed to the delight of all while Comedian Omo Baba and Saco brought loads of laughter to the studio.\nOthe side attraction on the show was the quiz competition which had participants from across the globe."
  },
  {
    "headline": "Override the President, pass Electoral Act amended bill into law; Anglican Bishop tells lawmakers -",
    "summarized_story": "Bishop of the Anglican Communion, Kaduna Diocese, Timothy Yahaya wants the National Assembly to override the President and pass the electoral amendment bill into Law.\nHe has also asked them to always remember that they owe Nigerians a legacy of a free, fair and credible elections.\nBishop Timothy Yahaya made this known after the Christmas service at the Cathedral of St. Micheal in Kaduna.\nHe said the body language of the President has shown his unwillingness to assent to the bill.\nPassing the bill into law according to him will correct the wrong impression Nigerians have about the National Assembly been a ‘rubber stamp’ parliament."
  },
  {
    "headline": "Fayemi signs 2022 Appropriation bill into law, promises timely completion of legacy projects -",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi has signed the 2022 Appropriation of One Hundred Billion, Seven Hundred and Fifty Three Million, Nine Hundred and Ninety Three Thousand, Two Hundred and Forty One Naira, Sixty Kobo ( ₦100, 753,993,241.60K) into law with a promise to complete all ongoing legacy projects and consolidate on other achievements recorded in the past three years.\nThe 2022 Appropriation, christened “Budget of Legacy and Consolidation”, was presented to the Governor by the Speaker of the Ekiti State House of Assembly, Rt.\nHon Funminiyi Afuye, at the Executive Council Chamber, Governor’s Office, Ado Ekiti in the presence of the Deputy Governor, Otunba Bisi Egbeyemi, Deputy Speaker, Hakeem Jamiu, and other members of the Executive Council and the legislators.\nOthers include completion and equipping of the Intensive Care Unit (ICU) at Ekiti State University Teaching Hospital (ESUTH), construction and renovation of schools, provision of learning materials to students, completion of ongoing erosion and watershed management project, foundation laying for Ekiti Knowledge Zone and the Special Agriculture Processing Zone, among others.\nThe Governor added that the budget was also prepared to ensure that enduring legacies are handed over to successive governments with a clear blueprint of development plans to lift Ekiti into a period of sustained prosperity."
  },
  {
    "headline": "PDP nat'l chairman, Ayu felicitates with Nigerians at Christmas, charges them to keep hope alive -",
    "summarized_story": "The National Chairman of the People’s Democratic Party, Iyorchia Ayu, has felicitated with Nigerians at Christmas, and charged them to keep hope alive in spite of daunting circumstances.\nAyu said although the Christmas Season symbolizes love, hope, sharing, celebration and thanksgiving, the gloomy economic situation has made such very difficult.\nAyu spoke to Nigerians via his goodwill message to Nigerians, entitled, “Do not lose hope, Nigerians: the good days are coming back.”According to him: “Nigerians love themselves.\nNigerians love life.\nDo not let the sorry state of the nation dampen the Christmas spirit,” he added."
  },
  {
    "headline": "Dowen College: Five students tried over Sylvester oromoni’s death granted bail -",
    "summarized_story": "A Chief Magistrates’ court in the Yaba area of Lagos has granted bail to five students of Dowen College following a charge of conspiracy and homicide made against them by the State Criminal Investigation Department, Panti.\nThe police charged the minors following the alleged murder of their 12-year old schoolmate, Sylvester Oromoni.\nChief magistrate Olatunbosun Adeola, who heard the bail application on Tuesday granted them bail in the sum of N1m each.\nThe magistrate also ordered the defendants to produce two sureties each in like sum.\nMagistrate Adeola said that one of each of the defendants’ sureties must be their parent, and must swear an affidavit of compliance."
  },
  {
    "headline": "Egypt’s Petroleum Corporation Signs $1bn Oil-Exploration Agreement with Eni",
    "summarized_story": "Egyptian General Petroleum Corporation (EGPC) has signed an agreement with Italian energy group Eni (ENI.MI) for oil exploration in the Gulf of Suez and Nile Delta regions worth “not less than $1 billion” of investments, the petroleum ministry said on Friday.\nThe agreement also included a commitment from Eni to additionally spend “not less than $20 million” to drill 4 wells, the ministry added in a statement."
  },
  {
    "headline": "Putin Says Europe Only Has Itself to Blame for Surging Gas Prices",
    "summarized_story": "The European Union can only blame its own policies for record gas prices as some of its members resell cheap Russian gas at much higher prices within the bloc, Russian President Vladimir Putin said on Friday.\nEurope’s benchmark gas price climbed to a new record on Tuesday, up almost 800% since the start of the year.\nRussian gas giant Gazprom has not booked gas transit capacity for exports via the Yamal-Europe pipeline for Dec. 25, auction results showed.\nPutin said on Thursday that Germany was reselling Russian gas to Poland and Ukraine rather than relieving an overheated market.\nIn Ukraine, another transit route for Russian gas to Europe, the head of state gas transmission operator said Gazprom had reduced daily gas transit across Ukrainian territory to 87.7 million cubic metres (mcm) from 109 mcm."
  },
  {
    "headline": "Russia Court Fines Google, Meta Platforms",
    "summarized_story": "Google said in an email it would study the court ruling before deciding on further steps.\nLater on Friday, the court fined Meta Platforms 2 billion roubles ($27.15 million) on the same grounds.\nGoogle, which has paid more than 32 million roubles in fines over content violations this year, is at odds with Moscow on a number of issues.\nread moreLast week, a sanctioned Russian businessman claimed victory over Google in a court case that could see the tech giant hit with another heavy fine.\nMoscow has also demanded that 13 foreign and mostly U.S. technology companies, which include Google and Meta Platforms, be officially represented on Russian soil by Jan. 1 or face possible restrictions or outright bans."
  },
  {
    "headline": "Satellite Images Show Russia Still Building Up Forces Near Ukraine",
    "summarized_story": "New satellite images captured by a private U.S. company show that Russia has continued to build up its forces in annexed Crimea and near Ukraine in recent weeks while pressing the United States for talks over security guarantees it is seeking.\nU.S., European and Ukrainian leaders have accused Russia of building up troops again near Ukraine’s border since October after an earlier brief buildup in April, when Maxar also released images.\nIt cited increased activity at three sites in Crimea and at five sites in western Russia.\nread moreWhen asked on Friday about the build-up of Russian troops near Ukraine, Kremlin spokesperson Dmitry Peskov said Moscow was acting to defend its own security.\nThe West has threatened to block the pipeline, which is awaiting regulatory approval in Germany, if Russia invades Ukraine."
  },
  {
    "headline": "Thousands of Flights Cancelled Globally as Omicron Mars Christmas Weekend",
    "summarized_story": "Commercial airlines around the world canceled more than 4,500 flights over the Christmas weekend, as a mounting wave of COVID-19 infections driven by the Omicron variant created greater uncertainty and misery for holiday travelers.\nThe website showed that 1,779 Christmas Day flights were called off worldwide, along with 402 more that had been scheduled for Sunday.\nCommercial air traffic within the United States and into or out of the country accounted for more than a quarter of all the canceled flights over the weekend, FlightAware data showed.\nAmong the first U.S. carriers to report a wave of holiday weekend cancellations were United Airlines and Delta Air Lines (DAL.N), which scrubbed nearly 280 flights combined on Friday alone, citing personnel shortages amid the surge of COVID-19 infections.\nThe Biden administration will next week lift travel restrictions on eight southern African countries imposed last month over concerns about the Omicron variant, the White House said."
  }
]