[
  {
    "headline": "Odili’s home raid: Disowning suspect doesn’t exonerate AGF yet, says NBA investigator",
    "summarized_story": "Ubani, who was given the assignment last Friday by the NBA President, Mr Olumide Akpata, said the parade of the suspects had not vitiated his mandate.\nHe said the NBA’s demand for the President, Major General Muhammadu Buhari (retd.\n), to set up an independent panel of inquiry to look into the case and unravel the perpetrators still stood.\nUbani added that the fact that the Attorney General of the Federation, Mr Abubakar Malami (SAN), disowned the alleged arrowhead of the illegal operation, Lawrence Ajojo, was not enough to exonerate him.\nThe police are doing their own investigation by parading some persons; we (NBA) needs to reach out to those people and hear their own side of the story."
  },
  {
    "headline": "Nigeria needs responsible political, religious leaders, says Osinbajo",
    "summarized_story": "The Vice President, Prof Yemi Osinbanjo, has said Nigeria as a secular nation needs responsible political and religious leaders.\nAccording to him, a religious leader who preaches against another and a political leader who cannot carry everyone along are irreverent.\nOsinbajo said, “So we are in a multi-ethnic, multi-religious society and need responsible political leaders.\nWe need responsible religious leaders, not those who are prepared to destroy the unity of the country so that they can be hailed by their parochial communities.\nThese of course cover political, religious, ethnic, and corporate leaders."
  },
  {
    "headline": "N924m Debt: Court orders Kanu to pay N30,000 fine for stalling proceedings",
    "summarized_story": "AMCON had dragged Hardley Apartment, its directors, Ayoola Gam-Ikon and Kanu, before the court over alleged debt of N924.7 million.\nAMCON’s lawyer, Jayes Ujah, while objecting to Idelegbagbon’s request, sought for imposition of fine on the respondents for filing frivolous motions.\nAMCON had, in 2015, dragged Hardley Apartment, its directors, Gam-Ikon and Kanu before the court in its bit to recover alleged debt owed a bank.\nThe order, which was to subsist pending the determination of the suit, followed AMCON’s bid to recover the debt.\nHowever, following the transfer of Justice Abang to another jurisdiction of the court, the matter was reassigned to Justice Aneke."
  },
  {
    "headline": "NIN enrolment reaches 67m – Pantami",
    "summarized_story": "The Federal Government says no fewer than 67 million people have registered for National Identification Number, NIN, which is the foundation for economy growth and national security.\nHe said the focus currently was on the younger age from age one to 14 years.\nThe minister said government placed premium on the NIN enrolment because it is the foundation for the growth of the economy, securing the country and protecting investors from fraudulent elements.\n“With NIN enrolment, the identity of citizens and legal residents will be known and whosoever goes online, the identity will be known by the Federal Government and security institutions.\nThe minister said the enrolment had been made seamless with the increase of enrolment centres from 1,600 to 6,000 while one or two enrolment centres were set up in every country for Nigerians in the Diaspora."
  },
  {
    "headline": "Alao-Akala, others agree on Oyo APC state executive committee list",
    "summarized_story": "Adebayo Alao-Akala and some other stakeholders in the Oyo State Chapter of All Progressives Congress (APC) have adopted the October 30 harmonised list of the Oyo State Executive Committee for the party.\nThe 11-man committee directed by the APC national secretariat to ratify the harmonised state executive list on Friday held two parallel meetings.\nAlao-Akala, some zonal leaders and members of Oyo APC Elders’ Advisory Council attended the meeting held at the former governor’s residence in Ibadan.\nOthers who attended the meeting are Chief Samuel Ogbuku, the Chairman, Oyo APC State Congress Appeal Panel, and Lawan Gambo, the Chairman, APC State Congress Committee.\n“Oyo APC State Congress Appeal Panel has no power to change the list of new state executives of the party who emerged through the State Congress of October 30 at Liberty Stadium Ibadan."
  },
  {
    "headline": "Nigerians are competitive wherever they find themselves, Buhari tells UAE Minister",
    "summarized_story": "President Muhammadu BuhariBy Johnbosco AgbakwuruPresident Muhammadu Buhari, on Friday, commended the resourcefulness and resilience of Nigerians in any part of the world they find themselves.\nSpeaking during a meeting with United Arab Emirates’ (UAE) Minister of State Foreign Affairs, His Excellency Shaikh Shakboot Alnahyan, on the sidelines of the Paris Peace Forum (PPF) in France, the President said Nigerians are “competitive both at home and abroad”.\nAccording to a statement issued by his Special Adviser on Media and Publicity, Chief Femi Adesina, President Buhari said “Nigerians are all over the place, very competitive.\nWe may be taking small steps, but they are leading somewhere.”On proposed investments in Nigeria, Alnahyan said it would be a win-win situation, “which would bring hope and opportunities for people in both countries.\nWe want to come and add quality and value.”He equally commended the Nigerian government for its robust tackling of violent extremism."
  },
  {
    "headline": "Bayelsa Govt tasks youths on war against oil theft, illegal refining",
    "summarized_story": "Sen. Lawrence EwhrudjakpoThe Bayelsa Government has called on youths to support the fight against oil bunkering, illegal refining and other unwholesome activities that impact negatively on oil production and revenues accruing to the state.\nThe deputy governor, who decried the sharp drop in Bayelsa’s oil production, said several oil wells are operating at zero output level.\nHe blamed the development on the activities of oil thieves, illegal refining of crude and unnecessary stoppage of the operations of oil companies.\nHe maintained that illegal oil refining does not only endanger the health of the people but also destroys the environment of both the present and future generations.\nWe must all put our hands on deck to check this illegal refining of crude oil."
  },
  {
    "headline": "SSANU/NASU protest in Port Harcourt over sharing formula for earned allowance",
    "summarized_story": "Members of the University of Port Harcourt branch of the Senior Staff Association of Nigeria Universities and the Non-Academic Staff Union of Universities, on Friday, staged a protest in rejection of the proposed sharing formula of the N22.12 billion earned allowance by the federal government.\nThis comes two weeks after the federal government released the payment formula for the earned allowance.\nThe delay in the disbursement of the money is however due to the disagreement by SSANU and NASU.\nThe university workers who marched around UNIPORT campus threatened indefinite strike should the government go ahead to implement the 75% (for academic staff) against 25% (non-teaching staff) sharing formula.\nThe protest was called by the National leadership of the Joint Action Committee of the two unions."
  },
  {
    "headline": "Nigerian Senate exonerates Finance Ministry of withholding funds from MDAs",
    "summarized_story": "The Nigerian Senate, on Friday, ruled out the allegation that the Federal Ministry of Finance was not releasing funds to Ministries, Departments and Agencies (MDAs) of government, for the purpose of executing their budgets.\nRather, the Senate Committee Chairman on Appropriation, Senator Jibrin Barau argued that the MDAs have enjoyed prompt release of recurrent and capital overhead funds this year.\nBut Senator Barau, while addressing journalists in National Assembly on Friday, admitted that his committee has been monitoring the release of funds, saying, “the Ministry has done well”.\nThe Federal Ministry of Finance has done very well in prompt release of funds for execution of capital projects.\nAs far as I know as the Senate Committee Chairman on Appropriation, there is so much money in accounts of some MDAs."
  },
  {
    "headline": "Alleged lopsidedness: Bauchi judiciary denies appointing judicial officials",
    "summarized_story": "“The state judiciary is distinct from the state Ministry of Justice.\nThe state judiciary is an organ of government just like the executive and the legislature constitutionally created under S. 6(2) of the 1999 Constitution of the Federal Republic of Nigeria (as amended).\n“It therefore goes without saying that the Ministry of Justice does not have power to recruit or appoint judges for the state judiciary.\n“So any purported exercise carried out by anybody or authority in respect of not only State judicial officers but even judicial staff is an exercise in futility,” Danjuma stated.\nDanjuma informed that appointment of judges was not only sensitive but also regulated by the National Judicial Policy, Judicial Appointments Guidelines and Code of Conduct for Judicial Officers."
  },
  {
    "headline": "Embrace global agenda of UHC – Buhari tells ECOWAS countries",
    "summarized_story": "President Muhammadu Buhari has urged member countries of the Economic Community of West African States (ECOWAS) to embrace the global agenda on Universal Health Coverage (UHC).\nThe president described UHC as a critical element that required recommitment for increased people-centered investment in sustainable health development.\nThe Ordinary Session of West African Health Organisation, (WAHO), is an annual meeting by the 15 member states.\nThe meeting is to enable them to brainstorm on health-related issues in the region and how the region can surmount future pandemics.\nThe president noted that embracing UHC by member states would strengthen the manpower base in the health sector, infrastructure and laboratory capacities within and across ECOWAS borders."
  },
  {
    "headline": "ISWAP frees Yobe official, one other after 4 months",
    "summarized_story": "The Islamic State’s West Africa Province (ISWAP) has released Ali Shehu a.k.a.\nThe liaison officer was freed alongside his associate identified as Mustapha.\nOn July 24, ISWAP seized Ali, Mustapha and two Nigerian soldiers along the Maiduguri-Damaturu road.\nThey were ambushed near Jakana village, 41 kilometres to Maiduguri, the Borno capitalAli was taken from an official Toyota Hilux conveying diesel purchased for use in Yobe liaison office in Maiduguri due to prolonged power outage.\n“It was not clear who negotiated with ISWAP to secure their release”, an intelligence officer told PRNigeria on Friday."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Dani Alves makes sensational return to Barcelona",
    "summarized_story": "Barcelona and Dani Alves have reached an agreement in principle for the player to join the football first team for the remainder of the current season.\nThe club will announce the full details at his official presentation as a new FC Barcelona playerDani Alves came to Barça in the summer of 2008 after five brilliant seasons in Sevilla.\nIn the summer of 2016, he left for Juventus, and since then has been at Paris Saint-Germain and lastly, at São Paulo back in his home country.\n- Advertisement -Alves won 23 titles at FC Barcelona: 6 Ligas, 4 Copas del Rey, 3 Champions League, 3 Club World Cups, 3 Spanish Super Cups and 4 European Super Cups.\nHe also won titles at Juventus (2), Paris Saint-Germain (6) and São Paulo (1) before returning to Catalonia"
  },
  {
    "headline": "US Consulate announces student Visa surge days",
    "summarized_story": "The U.S. Consulate has stipulated six days to attend to students needing visas for studies in the United States.\nThis approach will be two-fold: a special procedure for students who need to renew student visas to continue their course of study, and a series of dedicated interview days for prospective new students.\n“You may be eligible for a priority student visa interview slot if you are a prospective student seeking an F1 visa appointment and you have not been refused an F1 visa in the past six months.\n“Abuja student surge days will take place on December 8, December 15, and January 12.\nFor students renewing visas, the statement listed separate requirements."
  },
  {
    "headline": "Post pandemic: NGO partners UNIPORT on African economy",
    "summarized_story": "A Non-Governmental Organisation based in Finland, Centre for Multidisciplinary Research and Innovation (CEMRI) and the University of Port Harcourt Entrepreneurship Centre (UPEC), have begun a three day conference to brainstorm on ways to explore ways to rebuild African economy after Covid-19 pandemic.\nThe workshop tagged: “International Conference on Entrepreneurship, Business and Economic Restoration in Post Covid-19 Africa (CEBER), which began yesterday at the University of Port Harcourt Campus is expected to feature both foreign and local resource persons.\nHe said: ‘Within the last few years, some countries in Africa have recorded many giant strides in information technology, medicine and health, education, tourism and banking.\n“However, the reportage of Africa by majority of the international media organizations have consistently centered on the negative, thus, casting pale of hopelessness and gloomy future on the continent.\n“This does not only affect the perception of Africans about their richly endowed continent, but also affect international investors’ interest in our continent."
  },
  {
    "headline": "Afghanistan: India hosts regional security dialogue",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Republic of India, earlier in the week, hosted the eight-nation regional security dialogue on Afghanistan.\nThe Times of India reported that the National Security Adviser of India, Ajit Doval, chaired the dialogue, which was attended by his counterparts from Iran, Kazakhstan, Kyrgyzstan, Russia, Tajikistan, Turkmenistan, and Uzbekistan.\n“The Third Regional Security Dialogue on Afghanistan called for support for a peaceful, secure and stable Afghanistan.\n“Participants at the Delhi dialogue discussed evolving situation in Afghanistan, its regional and global ramifications, the declaration informed.\nSpeaking during the meeting, Doval said it was time for close consultations and greater cooperation."
  },
  {
    "headline": "Anambra guber: Soludo, Ibezim receive certificates of return",
    "summarized_story": "From Obinna Odogwu, AwkaThe Independent National Electoral Commission (INEC) has presented certificates of return to the Anambra State Governor-elect, Prof. Chukwuma Soludo, and his deputy, Dr Onyeka Ibezim.\nNational Chairman of INEC, Prof. Mahmoud Yakubu, represented by the Supervising National Commissioner for Anambra, Festus Okoye, presented the certificates to them at the headquarters of the commission in Awka, the state capital.\nSoludo, in his speech, promised not to let Ndi Anambra down.\n“I believe that a sound and credible electoral system is foundational to having an accountable, responsive and developmental state.\nI also believe that the Bimodal Voter Accreditation System (BVAS) deployed, if refined, will give us that desired Eldorado in our electoral system”, Soludo said."
  },
  {
    "headline": "Justice Odili: Police arrest ‘CSP’, journalist, Islamic scholar, 11 others over invasion",
    "summarized_story": "He described those arrested as document forgers who were on their own and not hired by any personnel of the Federal Ministry of Justice.\nThe men were said to have been led by Ajodo, who admitted that he was engaged as a consultant by the Attorney-General of the Federation and Minister of Justice, Abubakar Malami.\nMalami noted that investigation has commenced to unravel the circumstances, personalities behind the invasion and the sponsored campaign of calumny against him.\nWhich worked has he executed for the Honourable Attorney General of the Federation and the Ministry of Justice?\nJustice Odili.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Afenifere tackles Buhari, insists Nigeria’s structures must be renegotiated",
    "summarized_story": "It said Islamic cleric, Ahmed Gumi, who has been canvassing amnesty for the bandits is only re-echoing the same views held by Buhari before he became president.\nThe group said this in Lagos at a press conference with the theme: ‘Fixing Nigeria, Before the Fall’, addressed by its leader, Ayo Adebanjo.\nBut what used to be confined to the North East, has today become a pan Nigerian.\n“Buhari regime has treated them with kids gloves, and have blithely labelled them as bandits, businessmen, vandals, and even recently as area boys.\nIt was mortally wounded in January 1966 and was then slaughtered in July of 1966."
  },
  {
    "headline": "Troops kill 46 insurgents, rescue 140 kidnapped persons",
    "summarized_story": "From Molly Kilete, AbujaThe Defence Headquarters (DHQ) said soldiers on counter insurgency operations and other security operations across the country killed 46 terrorists and bandits in the last two weeks and rescued 140 kidnapped persons.\nThe DHQ also said that another 1,186 members of Boko Haram, alongside their families, surrendered to troops in Borno State in the last two weeks.\nHe added that troops also rescued 13 kidnapped civilians within the period and recovered arms and ammunition from the criminals.\n“Also, troops neutralised three armed robbers and rescued two kidnapped civilians, while five criminal elements associated with pipeline vandalism, piracy, illegal oil bunkering and armed robbery were arrested within the period.\n“Troops of Operation Delta Safe conducted land, maritime and air operations in the South-South zone, to forestall activities of economic saboteurs and other criminal elements."
  },
  {
    "headline": "Gov Fayemi: Malami Should Defend Nigeria, Not Claimants",
    "summarized_story": "He upbraided the attorney general for publicly identifying himself as the attorney general of the federal government during his interview, noting that the office which Malami occupies exists to serve the federation and not the federal government.\nRather than defending the consultants, Fayemi insisted that Malami’s job was to defend the federal, state and local governments which make up the federation.\n“The attorney general of the federation is pushing so vehemently on the side of people whose primary intent is to fleece the Nigerian people.\n“These matters were not appealed by the federal ministry of justice, admittedly not under Malami at the time.\n“I am afraid that we do not believe that the attorney general has demonstrated this (transparency) and that’s what has brought this about,” he declared."
  },
  {
    "headline": "Police Parade 14 Suspects over Invasion of Justice Odili’s Residence",
    "summarized_story": "THISDAY disowned one of the suspects, Mr. Stanley Nkwazema, who claimed to be a staff and contributing editor of the newspaper.\nNkwazema claimed he was investigating an exclusive story.\nMba said all the suspects attended all the meetings before the invasion and were all there on the night of the invasion.\n“Contrary to his claim, Mr. Nkwazema is neither a staff of THISDAY nor a Contributing Editor.\nWhich work has he executed for the Honourable Attorney General of the Federation and the Minister of Justice?"
  },
  {
    "headline": "Buhari: We’ve Invested Massively in Roads, Rail, Power, Airports",
    "summarized_story": "Buhari also declared that investment in gas was a top priority of his government, as it had huge benefits in terms of financial returns and generation of power.\nDuring the opening of the three-day forum yesterday, Buhari flayed the disparity in the distribution of COVID-19 vaccines between developed and developing nations since the pandemic broke out last year.\nThis massive gap between vaccine requirements in Africa and vaccine availability is undermining the fight against the coronavirus pandemic on the continent.\nBuhari said pledges should be fulfilled in a timely manner, as he appreciated some countries, like France, that had donated vaccines to developing countries.\n“Licensing agreements should be reached with pharmaceutical companies for the transfer of intellectual property and technology to support the production of vaccines in Africa."
  },
  {
    "headline": "Banditry: Military Deploys Troops, Attack Helicopters on Abuja-Kaduna Rail Line",
    "summarized_story": "Kingsley Nwezeh in AbujaThe military high command, yesterday, said it has ordered the deployment of troops and attack helicopters on the Abuja-Kaduna Expressway in a bid to contain attacks by bandits on the rail line in the area.\nOn the North-east, he said 31 terrorists were decimated while 71 were arrested and that,1,181 insurgents surrendered to troops.\nHe said within the period, several anti-illegal oil production and raid operations were executed at different locations in the zone that yielded significant results.\nHe stated that in the course of the operations, troops discovered and deactivated illegal oil refining and bunkering sites in Bayeslsa, Delta and Rivers.\n“Consequently, a total 1,252,250 litres of illegally refined AGO and 1,140,340l litres of stolen crude were recovered in the course of the operations”, he said."
  },
  {
    "headline": "Breaking: Police Arrest Fake CSP, 14 Suspects Who Invaded Justice Odili’s House",
    "summarized_story": "By Kingsley NwezehThe Nigeria Police Thursday paraded one fake Chief Superintendent of Police (CSP), Lawrence Ajojo, and 14 other criminal suspects including some members of other law enforcement agencies, who invaded Justice Mary Odili’s House in Maitama, Abuja.\nParading the suspects, on Thursday at the Force Criminal Investigation Department(FCID), Area 10, Garki, Force Public Relations Officer, Mr. Frank Mba, a Commissioner of Police, said the suspects involved in the criminal acts were drawn from different professional backgrounds, notably, journalism, banking and law enforcement.\nIn a chat with newsmen, the fake CSP, Ajojo admitted that “he’s not an officer of the Nigeria Police.”He, however, claimed to be a consultant for the Attorney General and Minister of Justice, Abubakar Malami, but insisted that the AGF did not direct him on failed raid on Justice Odili’s House.\nThe journalist involved also claimed to be working on an exclusive story but was blamed for not reporting the story before and after it broke until he was invited by the police.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Nigerian Army Authorities Mismanaged Funds Budgeted For Direct Service Commission 26",
    "summarized_story": "The Nigerian Army has squandered the monetary allocation for the Direct Short Service Commission (DSSC) 26, year 2021, SaharaReporters has learnt.\nAccording to authoritative sources, in August 2020, the Nigerian Army advertised the recruitment of candidates for the Direct Short Service Commission (DSSC 26) and people applied.\nAccording to the source, after the training, successful candidates would be invited to go for training at the Nigerian Army School of Infantry, Jaji, Kaduna State, but nothing had been heard from the Nigerian Army since then.\nHe said, “A certain amount of money was released to the Nigerian Army concerning the training of the Direct Short Service 26 personnel.\nUsually by August, the Nigerian Army would have released names for new intakes."
  },
  {
    "headline": "How Nigerian Army Authorities Mismanaged Funds Budgeted For Direct Service Commission 26",
    "summarized_story": "The Nigerian Army has squandered the monetary allocation for the Direct Short Service Commission (DSSC) 26, year 2021, SaharaReporters has learnt.\nAccording to authoritative sources, in August 2020, the Nigerian Army advertised the recruitment of candidates for the Direct Short Service Commission (DSSC 26) and people applied.\nAccording to the source, after the training, successful candidates would be invited to go for training at the Nigerian Army School of Infantry, Jaji, Kaduna State, but nothing had been heard from the Nigerian Army since then.\nHe said, “A certain amount of money was released to the Nigerian Army concerning the training of the Direct Short Service 26 personnel.\nUsually by August, the Nigerian Army would have released names for new intakes."
  },
  {
    "headline": "EXCLUSIVE: How Governor Emefiele-Led Central Bank Of Nigeria Failed To Keep Records Of Funds Recovered Under Buhari Government From 2016 To 2019",
    "summarized_story": "The newly released Auditor-General for the Federation Annual Report for 2019 has revealed that Governor Godwin Emefiele-led Central Bank of Nigeria failed to keep records of recovered funds between 2016 and 2019.\n“The above anomalies could be attributed to weaknesses in the internal control system at the Central Bank of Nigeria.\nRecommendations; The CBN Governor is requested to: i Furnish reasons for the nil recovery records between 2016 and 2019, and ii.\nThe latest investigation by the EFCC only adds to the growing list of atrocities and scandals that the lavish CBN governor, Emefiele, is enmeshed in.\nSee Also Politics Opposition Party Calls For Resignation, Probe of Nigeria's Central Bank Governor, Emefiele Over Massive Looting Allegations“It is instructive to note that when Emefiele took over office as CBN Governor in 2014, naira exchanged for N164 to a dollar."
  },
  {
    "headline": "EXCLUSIVE: How Governor Emefiele-Led Central Bank Of Nigeria Failed To Keep Records Of Funds Recovered Under Buhari Government From 2016 To 2019",
    "summarized_story": "The newly released Auditor-General for the Federation Annual Report for 2019 has revealed that Governor Godwin Emefiele-led Central Bank of Nigeria failed to keep records of recovered funds between 2016 and 2019.\n“The above anomalies could be attributed to weaknesses in the internal control system at the Central Bank of Nigeria.\nRecommendations; The CBN Governor is requested to: i Furnish reasons for the nil recovery records between 2016 and 2019, and ii.\nThe latest investigation by the EFCC only adds to the growing list of atrocities and scandals that the lavish CBN governor, Emefiele, is enmeshed in.\nSee Also Politics Opposition Party Calls For Resignation, Probe of Nigeria's Central Bank Governor, Emefiele Over Massive Looting Allegations“It is instructive to note that when Emefiele took over office as CBN Governor in 2014, naira exchanged for N164 to a dollar."
  },
  {
    "headline": "Fixing Nigeria, Before The Fall: Full Text Of Trending Press Address By Leader Of Afenifere, Ayo Adebanjo",
    "summarized_story": "In spite of deepening disappointments, the Nigerian Press has stood as, perhaps, the last and only beacon of hope in thatrealisation.\nTo be sure, the Nigerian state that was negotiated before independence in 1960, the one that was birthed and named on the 1st of October 1960, is long dead.\nTHE BASIS OF THE NIGERIAN STATE MUST BE CLEARLY NEGOTIATED.\nThe Fulani Islamist agenda of the Buhari regime has found accommodation for each and every one of the public rebuttals of the lies of Nigeria.\nThe same Buhari regime had labeled the just and peaceful demands of Omoyele Sowore’s RevolutionNow Movement as terrorist, and judicially curtailed his freedom."
  },
  {
    "headline": "Uzodimma offers scholarship to Imo indigene who bagged 9As in WASSCE",
    "summarized_story": "Hope Uzodimma, governor of Imo state, has offered a scholarship to Confidence Nwaozuzu, an indigene who made distinctions in nine subjects in the 2020 West African Senior School Certificate Examination (WASSCE).\nAdvertisementAccording to NAN, Oguwike Nwachuku, chief press secretary to the governor, announced the scholarship in a statement on Thursday.\nThe governor, who received Nwaozuzu at the government house, in Owerri, also promised to train her through university education.\nHe said that the state government deemed it fit to identify with Nwaozuzu as a way of encouraging her and spurring other Imo students on in their academic endeavour.\nAdvertisementAlso speaking, Nwaozuzu appreciated the governor for inviting her and giving her “lifelong empowerment” in the form of education."
  },
  {
    "headline": "Maiduguri now among most peaceful places, says UNIMAID VC",
    "summarized_story": "Aliyu Shugaba, the vice-chancellor (VC) at the University of Maiduguri (UNIMAID), says Maiduguri has become one of the most peaceful state capitals it was once known for.\nAccording to NAN, the VC said the busy activities that Maiduguri was once known for had returned, adding that the university recorded tremendous achievement with visitors thronging it.\nShugaba said that, despite the harrowing experience in the last 12 years, the university remained resilient.\nAdvertisementHe added that the institution remained open to academic activities, making it easy to bounce back.\n“I dare say now that if you want the most peaceful place in the whole of this country, then Maiduguri is one."
  },
  {
    "headline": "FAKE NEWS ALERT: Photo of Jigawa varsity SUG president with guards was from ‘security awareness’ event",
    "summarized_story": "AdvertisementIn the images, which surfaced online on Thursday, the SUG president showed up on campus in a white Mercedes Benz accompanied by a bevy of security men clad in black suits.\nThe six security men are believed to be his fellow students.\nAccording to him, the students at the criminology and security studies department of the varsity were staging a security awareness event when the images were taken.\nThey also work as security men at the university gates, then it’s concluded with a symposium.\n“What you see is just the students providing special security to the student’s union president."
  },
  {
    "headline": "Basketmouth: Music was my first love, not comedy",
    "summarized_story": "Basketmouth, Nigerian comedian cum musician, says before his foray into comedy and acting, his first career path was music.\nBasketmouth said he had to venture into comedy and acting before music because the timing wasn’t right.\n“Most people do not know this but music was my first love, then TV before comedy,” he wrote.\nGod bless the day I met you.”Basketmouth recently teamed up with 2Baba and Blaqbonez for the delivery of ‘Trouble,’ his much anticipated single.\nAdvertisementIn November 2020, the ace stand-up comedian also came through with ‘Yabasi’, a soundtrack album for ‘Papa Benji’, his comedy series."
  },
  {
    "headline": "‘Sexual assault’: Witness ‘scared’ to testify against Baba Ijesha in court",
    "summarized_story": "The prosecution team of the Lagos government says one of the witnesses set to testify against Baba Ijesha, the embattled Yoruba actor, is scared to do so.\nThe actor is already facing a six-count charge bordering on the indecent treatment of a child, sexual assault, attempted sexual assault by penetration, and sexual assault by penetration.\nYusuf Sule, state counsel, told the court that one of the witnesses was scared to testify against Baba Ijesha.\nSule was explaining the absence of two witnesses slated to testify against the actor in his ongoing trial for sexual assault.\n“The second witness could not come to court; he is jittery, he is scared to come to court."
  },
  {
    "headline": "Where is Africa’s digital media landscape headed?",
    "summarized_story": "Digital media in Africa is growing fast: traditional media organisations are finding their way to the internet while digital-only media organisations are taking firm root.\nMore Africans are online, they are spending more time on the internet and relying more on digital media more than ever.\nHow can digital media in Africa create a profitable business model?\nWhile it is normal to get excited about the different innovative news products in the continent’s digital media landscape, Abiru explains that more media houses need to produce more information that helps people understand what is going on around them.\nShe believes African journalists can do amazing work, but their budget is way smaller than that of global publications."
  },
  {
    "headline": "Exclusive: Meta’s VP MEA and Turkey on Facebook’s transition into the metaverse",
    "summarized_story": "Leading that work in Africa is Derya Matras, Vice President (VP), Middle East, Africa (MEA) and Turkey, Meta.\nPrior to her appointment as VP in August, Matras was the Managing Director for the MEA and Turkey region.\nIt’s the next evolution in a long line of social technologies, and it’s ushering in a new chapter for our company.\nWhy should Facebook build this?\nBut it’s important to reiterate that Meta is neither going to build, own, or run the metaverse on its own."
  },
  {
    "headline": "MFS Africa raises $100m to continue expanding its digital payments network",
    "summarized_story": "MFS Africa, Africa’s largest digital payments network, has raised a $100 million Series C funding, an investment divided into two commitments: $70 million for equity and $30 million for debt financing.\nThe announcement came a few weeks after the company extended its footprint into the Nigeria market by acquiring Baxi, one of Nigeria’s largest digital solutions and distribution companies, from Capricorn Digital.\nFounded by Dare Okoudjou in 2009, MFS connects more than 320 million mobile money wallets across over 35 African countries.\nThe company plans to use the new investment to hire more global talent, power its Governance, Risks and Compliance (GRC) functions, and ramp up its expansion efforts.\nWe are excited to join MFS Africa’s world-class management team on its mission and to support its growth journey.”Share this article"
  },
  {
    "headline": "How to secure funding for your early-stage startup in Africa",
    "summarized_story": "Ayobami and Ayobamigbe work with Ingressive Capital, a venture capital firm that writes up to $400K cheques to early-stage startups.\nDisrupt Africa reported a 68.4% jump in the number of investors in 2020 (370 investors) from 2019’s reported number of 261 investors.\nStartup accelerators like Y Combinator and TechStars have become incredible partners to the growth of the African startup ecosystem.\nwith FirstCheck Africa, Let’s Talk with Microtraction), Invest in the Future with Future Africa), and How I Got Funded (Ingressive Capital).\nYour investment pitch deck should address the pivotal questions of the problem, why the problem matters, your solution, and the market opportunity (total addressable market)."
  },
  {
    "headline": "Ghana mobile money revenue offers clues to MTN Nigeria’s PSB expectation",
    "summarized_story": "The Central Bank of Nigeria recently granted approval in principle to MTN Nigeria and Airtel Africa to operate payment service banks (PSBs), with final approval to follow in six months, subject to specific requirements.\nTo extrapolate the revenue MTN Nigeria is likely to generate from its mobile money business in Africa’s most populous nation, BusinessDay proceeded to analyze the data by Tellimer, a global technology, information, and data provider, that surveyed mobile money penetration (defined as mobile money users as a percentage of total subscriber base) across various African telcos and markets.\nAs expected, Safaricom had the highest penetration (71percent), given its dominance and the positive trend for mobile money in Kenya.\n“This means that it will be very difficult for MTN Nigeria to replicate M-Pesa’s success in Kenya or that of its fellow MTN Group subsidiary in Ghana,” Omole said.\nThe central bank had in 2019 granted approvals to Hope PSB, Money Master PSB and 9PSB."
  },
  {
    "headline": "Foreign investors prefer Nigerian banks’ Eurobonds to their stocks",
    "summarized_story": "Foreign investors can’t get enough of Nigerian banks’ Eurobonds but won’t touch their stocks with a ten-foot pole.\nFirst, it was Access Bank and now United Bank for Africa (UBA) that has issued Eurobonds that ended up oversubscribed by foreign investors, a sign of strong investor confidence in Nigeria’s top banks.\nFor the UBA Eurobond, investors will receive 6.75 percent every year for five years.\nThe lack of interest in banking stocks, once favourites of foreign investors, is due to challenges with accessing foreign exchange, which has made many wary of holding naira assets.\nAlthough dollar liquidity has been improving in recent times and is expected to improve even further as banks tap the Eurobond market, foreign investors remain largely on the side-lines."
  },
  {
    "headline": "Lagos streets turn outlets for fast food",
    "summarized_story": "In a bid to reach more customers and boost sales, fast food restaurants have turned Lagos streets into retail channels to sell their products in cheaper and smaller packs.\nAccording to a BusinessDay survey, restaurants in Lagos, Nigeria commercial hubs, such as Mr. Biggs, Chicken Republic, and Sweet Sensation, pioneers of the Quick Service Restaurants (QSRs) industry, have been using the ‘Sell-on-the-Go’ marketing strategy, by setting up express kiosks since 2019.\nApart from the QSRs going into smaller formats, FMCGs now package their products into smaller sachets to target the larger segment of the economy.\n“A lot of consumer food service operators are now trying to explore the format of miniaturization.\nAlthough it is an interesting opportunity, Uzo advises that QSRs should not copy each other or else their business could shut down."
  },
  {
    "headline": "NUJ, ACJN agree to a truce at ROLAC roundtable – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Members of the Edo State Council of the Nigeria Union of Journalists (NUJ) have been promised two slots for membership in the Information Subcommittee of the Administration of Criminal Justice Monitoring Committee in Edo State during the British Council’s Rule of Law and Anti- corruption (ROLAC)” initiative meet up in Benin City.\nThe get together of media practitioners and members of the Administration of the Criminal Justice Monitoring Committee aims to bridge existing loopholes and build synergy to solidify the administration of the criminal justice law in Edo State.\nChairman, Edo State Council of the NUJ, Sir Roland Osakue who spoke through the Treasurer, Osaretin Omokpae aside advocating for a good working relationship between both parties appealed for the establishment of a Press Corp in the Judiciary with the proviso for security for press men.\nThe need for training of media practitioners on the use of judicial lexicon (language) by the Judiciary was also emphasized.\nThis interaction is important as it enables the media to understand what this group has done; look at areas of collaboration with the committee and also ask pertinent questions on how the committee can perform optimally to perform the implementation of the ACJN in Edo state.”..."
  },
  {
    "headline": "Obaseki assures support for businesses, enabling environment for local, international investors – Nigerian Observer",
    "summarized_story": "“It must be attractive to our own people first and they must invest before outsiders and foreign investors will follow.\n“We need to ensure law and order in the environment, which will attract both local and foreign investors,” he added.\nWe have to make the State attractive by providing those things that will sustain businesses and help people make profits.\nWe will also work with you to improve the lives of the people of the State.”Other guests at the occasion include the wife of Edo State Governor Mrs. Betsy Obaseki; Speaker, Edo State House of Assembly (EDHA), Rt.\nand Chief of Staff to Edo State Governor, Hon."
  },
  {
    "headline": "Infrastructure Revolution: Obaseki is a gift to Edo – Enabulele – Nigerian Observer",
    "summarized_story": "Excerpts:What is your assessment of the Infrastructure development under Governor Godwin Obaseki administration in the past 12 months or from 2016 to date?\nAs far as I am concerned, this government is doing so much in the area of Infrastructure development.\nWe also need to understand that road development is very critical a sector in any government or economy.\nThere are a whole lot of road projects such as the Obakhabhaiye Road network which is housing the Edo State bus terminal.\nThere is a masterplan for Edo State that is being designed by a group of consultants and the regional master planner."
  },
  {
    "headline": "Teni, Waje, Jonny Drile, Ayarastarr, others light up Benin City as Alaghodaro Summit kicks up in Grand style – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIt is no longer news that the fifth of the annual Alaghodaro Summit initiated by the Godwin Obaseki led administration in Edo State, Nigeria commenced yesterday Friday November 12th, 2021 in the ancient City of Benin with its usual fun-fare laced in tough provoking talk show and other interesting brain storming session geared towards the economy emancipation of the state.\nOrganized annually by the Edo State government, the event at every interval since its inception in the last five years had found a pathway as part of the blue print towards the economy development of the state.\nHowever, the unique nature of this year’s annual top show introduced a new dimension to relive the popular adage of “All works have no play make Jack a dull boy “by bringing top Nigerian artistes to light-up the city with musical concert that both the old and young will live to remember for a very long time to come.\nExpectedly, top Nigerian Artistes like AYRA STARR, JONNY DRILE, WAJE, TENI, and DJ NEPUNE whom this writer learnt are already in town for the Edo Youth MEGA Concert are expected to showcase their talents at the long evening show.\nA visit by the Nigeria observer correspondent to the Sir Victor uwaifo creative hub of Fame revealed that all is now set for the show that is expected to draw the creme-de-la-creme in the business world, entertainment industry, as well as fun-seekers to the concert venue."
  },
  {
    "headline": "National Housing Programme: Nigerians invited to apply as Fashola launches portal for sale of houses",
    "summarized_story": "Nigerians can now apply for houses built under the current Federal Government’s National Housing Programme (NHP) in 34 states of the country following the launch, Friday, of the portal by the Minister of Works and Housing, Babatunde Fashola, through which interested members of the public could apply for allocation.\nThe minister told his audience, “We converge here just to introduce a portal on which the National Housing Programme pilot will be offered for sale to the public.\n“We are the policy head of those parastatals like the Federal Housing Authority (FHA), the Federal Mortgage Bank of Nigeria (FMBN) and so on.\nWe are saying that the National Housing Programme had not succeeded in the past and some of the houses built then still remain empty.\nSo we conducted a national survey across the zones just to find out what is acceptable,” the minister said."
  },
  {
    "headline": "Nigerian govt to auction N150bn bonds in November",
    "summarized_story": "Nigeria’s Debt Management Office (DMO), has said the Federal Government will offer N150 billion bonds for subscription in November.\nThe Office which made the disclosure in a circular on its website, said that the bonds consisted of three bonds worth N50bn each.\nThe DMO noted that bonds, which will be auctioned on November 17, have a settlement date of November 19.\nThe bonds also qualify as government securities within the meaning of Company Income Tax Act and Personal Income Tax Act for Tax Exemption for Pension Funds amongst other investors.\nAlso, they qualify to be listed on the Nigerian Stock Exchange and FMDQ OTC Securities Exchange."
  },
  {
    "headline": "United States Student Visa Surge Begins November 24, 2021",
    "summarized_story": "New Student Visa ApplicationsYou may be eligible for a priority student visa interview slot if you are a prospective student seeking an F1 visa appointment and you have not been refused an F1 visa in the past six months.\nAbuja applicants: Abuja student surge days will take place on December 8, December 15, and January 12.\nThese surge days will be filled on a first-come, first-served basis.\nThese surge days will be filled on a first-come, first-served basis.\nFor more information pertaining to student visa requirements, please visit https://www.ustraveldocs.com/ng/ng-niv-typefandm.asp."
  },
  {
    "headline": "Jaiz Bank appoints Ahmed Hassan as new CFO",
    "summarized_story": "Jaiz Bank Plc has appointed announced Mr Ahmed Alhaji Hassan as Executive Director/Chief Financial Officer.\n‘’Jaiz Bank Plc (the Bank) hereby notifies the Nigerian Exchange Limited (NGX) and the general public of the appointment of Mr Ahmed Alhaji Hassan as an Executive Director/Chief Financial Officer of the Bank.\nThe appointment has been duly approved by the Central Bank of Nigeria,” the statement said.\nPrior to joining Jaiz Bank in 2013, Ahmed gained valuable work experiences in reputable establishments like; the Securities & Exchange Commission (SEC), former New Africa Merchant Bank Ltd, NAL Merchant Bank (now Sterling Bank), and FCMB.\nIt is important to recall that Jaiz Bank is the premier non-interest bank in Nigeria."
  },
  {
    "headline": "Osun govt Gives N867m Worth Of Bonds To 154 Retirees",
    "summarized_story": "By Sunday Oguntuyi, OsogboTo further cater for the well-being of pensioners in Osun State, the government on Friday presented over N867 million worth of bonds to 154 retirees.\nAddressing the beneficiaries, Afolabi eulogized governor Gboyega Oyetola for his commitment to the welfare of pensioners and workers in the state.\nHe said the Contributory Pension Scheme was aimed at assisting civil servants to save towards their future.\nAdeleke said the Oyetola led administration is committed to the welfare of the workers and pensioners in the state.\nHe assured Governor Oyetola of their support before, during and after the next year gubernatorial election in the state saying one good term deserves another."
  },
  {
    "headline": "Tordue Salem: NUJ Faults Police Narrative, Demands Independent Inquiry, Autopsy",
    "summarized_story": "The FCT Council of the Nigeria Union of Journalists (NUJ) has tasked the Federal Government to empanel an independent probe into circumstances surrounding the death of Vanguard Newspapers reporter, Tordue Salem.\nSalem went missing on October 13, 2021 in Abuja and was reported dead on November 11 by the newspaper he worked with for several years.\n“The death of Mr. Tordue Salem opens another dark chapter for journalism and journalists in Nigeria and we are grievously saddened by it.\n“It is in this regard that we urge President Muhammadu Buhari to order for an independent inquiry into the tragic end of Mr. Tordue.\n“The NUJ also demands for an independent autopsy so as to allay the fears of thousands of journalists and citizens across the country that indeed the late Mr. Tordue was a victim of a hit and run driver,” it said."
  },
  {
    "headline": "Tordue Salem: NUJ Faults Police Narrative, Demands Independent Inquiry, Autopsy",
    "summarized_story": "The FCT Council of the Nigeria Union of Journalists (NUJ) has tasked the Federal Government to empanel an independent probe into circumstances surrounding the death of Vanguard Newspapers reporter, Tordue Salem.\nSalem went missing on October 13, 2021 in Abuja and was reported dead on November 11 by the newspaper he worked with for several years.\n“The death of Mr. Tordue Salem opens another dark chapter for journalism and journalists in Nigeria and we are grievously saddened by it.\n“It is in this regard that we urge President Muhammadu Buhari to order for an independent inquiry into the tragic end of Mr. Tordue.\n“The NUJ also demands for an independent autopsy so as to allay the fears of thousands of journalists and citizens across the country that indeed the late Mr. Tordue was a victim of a hit and run driver,” it said."
  },
  {
    "headline": "Drug Distribution: Marketers Seek Registered Warehouses In States, Set Up Taskforce",
    "summarized_story": "To keep drugs safe and intact from the point of manufacture and import to storage, and distribution to the end users, the Association of Pharmaceutical Products Marketers of Nigeria (APPMAN) has said that it was working on having registered warehouses with regulated facilities in each state of the Federation.\nSpeaking in Lagos on Thursday, during the 2021 APPMAN Annual Convention, national president of the association, Hon.\nHe reiterated that, “as a rule, all members of APPMAN engage the services of superintendent pharmacists, that oversee our premises and retail prescriptions where applicable.\n“Much of our efforts are geared and directed at achieving overall good safety practices, in the drug distribution chain systems in Nigeria.\n“Under my leadership, APPMAN has been embraced by virtually all the 36 states in Nigeria thus making information dissemination, awareness creation and group control at our fingertips."
  },
  {
    "headline": "Drug Distribution: Marketers Seek Registered Warehouses In States, Set Up Taskforce",
    "summarized_story": "To keep drugs safe and intact from the point of manufacture and import to storage, and distribution to the end users, the Association of Pharmaceutical Products Marketers of Nigeria (APPMAN) has said that it was working on having registered warehouses with regulated facilities in each state of the Federation.\nSpeaking in Lagos on Thursday, during the 2021 APPMAN Annual Convention, national president of the association, Hon.\nHe reiterated that, “as a rule, all members of APPMAN engage the services of superintendent pharmacists, that oversee our premises and retail prescriptions where applicable.\n“Much of our efforts are geared and directed at achieving overall good safety practices, in the drug distribution chain systems in Nigeria.\n“Under my leadership, APPMAN has been embraced by virtually all the 36 states in Nigeria thus making information dissemination, awareness creation and group control at our fingertips."
  },
  {
    "headline": "NERC Jerks Up Meter Prices By 32.4% Amid Scarcity",
    "summarized_story": "While the meter price increased due to the new 7.5 per cent VAT, it further increased in July following forex challenges.\nAccording to the pricing template in April 2020, a single phase meter sold for N39,991.50 while a three phase meter went for N67,055.85.\nHowever, with the pricing template of NERC in June 2020, the single phase meter rose to N44,896.17 while the three phase meter sold for N82,855.19.\nAnalysis shows that the single phase meter rose by N449 which is 11 per cent, the three-phase meter rose by N829 (18 per cent).\nThe 11 DisCos then included the 7.5 per cent VAT and as at today, a single phase meter goes for N48,263 while three phase is N89,069."
  },
  {
    "headline": "Omo Agege tackles Okowa: You can’t rescue Nigeria after destroying Delta",
    "summarized_story": "Deputy Senate President Ovie Omo-Agege has accused Delta Governor Ifeanyi Okowa of destroying the State.\n– Advertisement –His words: “I saw the Governor of Delta State on television saying he wants to rescue Nigeria.\nSomeone who has not been able to rescue Delta State saying he wants to rescue Nigeria.\n“He has already done enough damage to Delta State.\n“So, go back and recruit and canvass people on our behalf that there will be a better Delta State in 2023, a better state for all of us as partners."
  },
  {
    "headline": "Omo Agege tackles Okowa: You can’t rescue Nigeria after destroying Delta",
    "summarized_story": "Deputy Senate President Ovie Omo-Agege has accused Delta Governor Ifeanyi Okowa of destroying the State.\n– Advertisement –His words: “I saw the Governor of Delta State on television saying he wants to rescue Nigeria.\nSomeone who has not been able to rescue Delta State saying he wants to rescue Nigeria.\n“He has already done enough damage to Delta State.\n“So, go back and recruit and canvass people on our behalf that there will be a better Delta State in 2023, a better state for all of us as partners."
  },
  {
    "headline": "Prosecutor to judge: Witness scared to testify against Baba Ijesha in court",
    "summarized_story": "Prosecutor to judge: Witness scared to testify against Baba Ijesha in courtProsecutor to judge: Witness scared to testify against Baba Ijesha in courtThe prosecution team of the Lagos State Government has told an Ikeja Special Offences Court that one of the witnesses set to testify against Nollywood actor Olanrewaju James alias Baba Ijesha is scared to testify in court.\nState counsel, Mr Yusuf Sule, made the disclosure on Friday while explaining the absence of two witnesses slated to testify against the actor in his ongoing trial for sexual assault.\n“The second witness could not come to court; he is jittery, he is scared to come to court.\n“My lord, we will ensure that all the witnesses are in court by next week Friday,” the prosecutor said.\nNAN reports that James is facing a six-count charge bordering on the indecent treatment of a child, sexual assault, attempted sexual assault by penetration and sexual assault by penetration."
  },
  {
    "headline": "Prosecutor to judge: Witness scared to testify against Baba Ijesha in court",
    "summarized_story": "Prosecutor to judge: Witness scared to testify against Baba Ijesha in courtProsecutor to judge: Witness scared to testify against Baba Ijesha in courtThe prosecution team of the Lagos State Government has told an Ikeja Special Offences Court that one of the witnesses set to testify against Nollywood actor Olanrewaju James alias Baba Ijesha is scared to testify in court.\nState counsel, Mr Yusuf Sule, made the disclosure on Friday while explaining the absence of two witnesses slated to testify against the actor in his ongoing trial for sexual assault.\n“The second witness could not come to court; he is jittery, he is scared to come to court.\n“My lord, we will ensure that all the witnesses are in court by next week Friday,” the prosecutor said.\nNAN reports that James is facing a six-count charge bordering on the indecent treatment of a child, sexual assault, attempted sexual assault by penetration and sexual assault by penetration."
  },
  {
    "headline": "Lt. Gen. Adeosun, 11 Infantry officers pulled out of army",
    "summarized_story": "By Mohammad Tijjani/KadunaThe Nigerian Army (NA) on Friday, pulled out the former Chief of Policy and Plans, Army Headquarters, Lt-Gen Lamidi Adeosun and 11 other Generals out of active service.\nThe pulling out parade was part of activities of the ongoing Infantry Corps annual leadership lectures and biennial reunion, holding at the Infantry Corps Centre in Jaji Military Cantonment, Kaduna State.\nThe theme of the four-day event which began on Nov.10, is “Positioning Nigeria Army Infantry Corps to Win All Land Battles in a Joint Environment”.\nAdeosun who spoke on behalf of the retired Generals, said the pulling out parade was part of military tradition.\nHe also thanked the Chief of Army Staff, Lt-Gen Farouk Yahaya and the Commander Infantry Corps, Maj-Gen Victor Ezugwu for the opportunity of a rewarding and fulfilling life experience."
  },
  {
    "headline": "Many die as two buses burst into flames after collision,",
    "summarized_story": "The accident which resulted into an inferno occurred due to a head-on collision involving a white Toyota Coaster bus and a white Ford J5 bus.\nAn eye witness told NAN that the Coaster bus passengers were believed to be coming from a function and were returning to Akure.\nThe local gin in the J5 bus was said to have aided the fire which later smoldered after the head-on collusion with the accident causing a traffic gridlock for more than one hour at the axis.\nMr Sikiru Alonge, Federal Road Safety Corps (FRSC) Unit Commander, Ore Unit Command, who confirmed the accident to NAN said the number of dead bodies could not be confirmed.\nThe FRSC boss urged motorists and other road users to always refrain from over-speeding on the highway in order to avert avoidable road accidents."
  },
  {
    "headline": "Government Style Is Horrible, Taken Nigeria To Stone Age – Dele Momodu",
    "summarized_story": "Dele Momodu, a presidential contender in 2011, has revealed his reasons for criticizing President Muhammadu Buhari (retd).\nMomodu claimed in a post on his verified Facebook page that Buhari’s style of government is terrible and has caused Nigeria to regress.\nThe veteran journalist also stated how he got into politics despite not joining a political party.\nIn 2015, Momodu worked with Buhari under the All Progressives Congress party.\nHowever, Momodu made a case for the opposition Peoples Democratic Party, stating that the party is the solution to the country’s current challenges."
  },
  {
    "headline": "BREAKING: EFCC Arrests Precious Ofure For $200,000 Bitcoin Fraud, Links Suspect To Cubana Group",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has apprehended Precious Ofure Omonkhoa for an alleged bitcoin investment scam.\nThe suspect claimed that he ran a bitcoin scheme where people invest money to make huge returns.\nPreliminary investigation, Uwujaren noted, revealed that Precious engaged in a dating scam and had defrauded two victims in Canada.\nIt is unclear if the EFCC questioned the businessman about Precious’ transaction with CASA-Cubana during his 4-day interrogation in Abuja.\nUwujaren added that upon his arrest, $50,000 was found in the suspect’s bitcoin wallet."
  },
  {
    "headline": "BREAKING: FG Increases Prices Of Electricity Meters",
    "summarized_story": "Beginning November 15, 2021, the federal government will hike the price of single-phase and three-phase electricity meters.\nThe Nigerian Electricity Regulatory Commission released a circular on November 11, 2021, addressed to managing directors, all electricity distribution firms, and all meter asset providers.\nThe circular was titled ‘Review of the unit price of end-use meters under the Meter Asset Provider and National Mass Metering Regulations’ and has the reference number NERC/REG/MAP/GEN/751/2.\nThe regulator increased the price of a single-phase meter from its existing price of N44,896.17 to a revised price of N58,661.69 in the document.\nIt also raised the price of a three-phase meter from N82,855.19 to N109,684.36 (updated rate)."
  },
  {
    "headline": "DSS Arraigns Ex-Adamawa Governor, Nyako’s Former Aide Over N80million Alleged Fraud",
    "summarized_story": "Sheriff Rabiu, a retired Assistant Commissioner of Police and former Chief Security Officer to Murtala Nyako, the former governor of Adamawa state, has been charged with fraud in the amount of N80 million.\nOn November 9, 2021, SaharaReporters reported that Rabiu Sheriff, an Assistant Commissioner of Police (ACP), was being held by the Department of State Services (DSS) in connection with an alleged fraud involving N80 million in landed property.\nThe State (Complainant) vs. Sheriff Abubakar Rabiu (Defendant), former Chief Security Officer (CSO) to Murtala Hammanyero Nyako, Adamawa state former Governor, was heard at the state High Court I in Yola before Justice Hafsat Abdulrahaman.\nAn application for the initiation of trial under section 111(b) of the defendant (Sheriff) of Adamawa state administration of criminal justice legislation 2018 is filed in case number HC/ADSY/77CA/2021.\nWhile giving her ruling, Justice Hafsat granted the defendant bail on the grounds of health challenge and asserted that bail is a constitutional right."
  },
  {
    "headline": "Citizens thumb up FG on e-Naira",
    "summarized_story": "China, Bahamas, Cambodia, and a few other countries have already issued their own central bank digital currencies (CBDCs).\nHe also said the adoption of Central Bank Digital Currency (CBDC) can increase Nigeria’s Gross Domestic Product (GDP) by $29 billion over the next 10 years.\nThe e-Naira and Naira will have the same value and will always be exchanged at 1 Naira to 1 e-Naira.\nHe said: “All things being equal, the CBN e-Naira launch is a welcome development.\nInterestingly, e-Naira is going to be a ‘game-changer’ that would provide an alternative payment system and would radically transform the payment landscape."
  },
  {
    "headline": "Breaking: Police unseal Plateau House of Assembly complex as Lalong makes immediate request (PICTURES)",
    "summarized_story": "The Nigerian Police and other security agencies on Friday unsealed the Plateau State of Assembly, complex, allowing Speaker Yakubu Sanda and 11 other lawmakers to stage plenary.\nSpeaker Sanda who read the communication said governor Lalong is seeking for the screening of Mr. Fabian Ari Ntum as Chairman of the electoral body.\nThe House resolved to screen the seven nominees on another legislative session, as moved by House Majority leader Naa’anlong Daniel.\nSimilarly, the House has resolved to move legislative sessions to old Government House pending when the hallowed chamber in the Assembly complex will be fixed back.\nThe House Speaker, Sanda, thereafter adjourned plenary till next week."
  },
  {
    "headline": "Happening now: Vanguard reporter’s ‘killer’ nabbed",
    "summarized_story": "The Nigeria Police, Friday, paraded a 29-year-old cab driver, Itoro Clement, for reportedly knocking down and killing Vanguard reporter, Henry Tordue Salam.\nParading the suspect, Force Public Relations Officer, CP Frank Mba, said Clement was arrested following investigation by operatives of the Nigeria Police Intelligence Response Team (IRT) and confessed to knocking down the journalist on October 13, 2021, at about 10pm, around the Mabushi-Wuse inter-change.\nDetails loading…"
  },
  {
    "headline": "Nigerians Are Competitive Abroad Due To Good Education From Home – Buhari",
    "summarized_story": "President Muhammadu Buhari says Nigerians all over the world are very competitive, noting that they acquired the trait from home where the citizens have been properly educated and immersed in business rudiments.\nThe President stated this on Friday when he met with the Minister of State Foreign Affairs of United Arab Emirates (UAE), His Excellency Shaikh Shakboot Alnahyan, at the sidelines of the Paris Peace Forum.\nAccording to a statement by his special media aide, Femi Adesina, President Buhari described his countrymen and women as “competitive both at home and abroad,” and urged them to always abide by the rules of their host countries.\nSaid the President: “Nigerians are all over the place, very competitive.\nWe want to come and add quality and value.”He equally commended the Nigerian government for its robust tackling of violent extremism."
  },
  {
    "headline": "Anambra Poll: INEC Presents Certificate Of Return To Soludo, Deputy",
    "summarized_story": "The governorship candidate of the All Progressives Grand Alliance (APGA), Charles Soludo, has received his Certificate of Return from the Independent National Electoral Commission (INEC) following his victory in the just-concluded guber election in Anambra State.\nSoludo, a former governor of the Central Bank of Nigeria (CBN), received the Certificate of Return in a ceremony on Friday in Awka.\nThe Deputy Governor-elect, Onyeka Ibezim, also got his Certificate of Return.\n“The President looks forward to working with the incoming governor for the peace, security, and development of not only Anambra State but the entire country.\n”Soludo had, in the wake of his win, thanked the people of Anambra State for giving him the mandate."
  },
  {
    "headline": "UPDATED: Police Arrest Suspected Hit-And-Run Driver Over Death Of Vanguard Journalist",
    "summarized_story": "The Police have arrested a commercial driver suspected to be responsible for the death of a Vanguard Journalist, Tordue Salem.\nWhile speaking to journalists during the parade, Clement Itoro admitted to have knocked off an unknown pedestrian at about 10:00 pm the same day Tordue Salem went missing.\n“The place I knocked this person down, is a criminal place everybody knows that place,” he said.\nHow Hit And Run Driver Was Arrested – PoliceThe Force Public Relations Officer, Frank Mba explained to journalists how Clement Itoro was arrested.\nAccording to Mr Frank, “when Clement hit Tordue, the victim’s phone, an iPhone fell on the car’s wheel screen."
  },
  {
    "headline": "Finance Minister Blames Rising Cost Of Rice On Smuggling",
    "summarized_story": "﻿The Minister of Finance, Budget, and National Planning, Zainab Ahmed, on Thursday, said smuggling is responsible for the rising cost of rice in the country.\nSpeaking during an interview on Channels Television’s Politics Today on Thursday, the Minister said smuggling is affecting the market and hurting the citizens.\n“Unfortunately there is a lot of distortion and the distortion is arising from smuggling of goods into the country,” the Minister said.\nThe Minister also reacted to the fresh borrowing request by the Federal Government which was recently approved by the National Assembly.\nThe borrowing that was approved by the lawmakers, the Minister noted, has been in the National Assembly since early this year."
  },
  {
    "headline": "Netherlands Return To Partial Lockdown As Covid Surges",
    "summarized_story": "Dutch Prime Minister Mark Rutte on Friday announced Western Europe’s first partial lockdown of the winter, with three weeks of Covid curbs on restaurants, shops, and sporting events.\nThe government will review the situation on December 3 to see if further measures are needed, Rutte added.\nCases have soared since the Dutch government lifted most Covid measures less than two months ago on September 25.\nThe Covid spike comes despite the fact that 82 percent of Dutch people over the age of 12 have been fully vaccinated.\nCovid case numbers are on the rise across much of Europe with neighbouring Germany also mulling fresh restrictions."
  },
  {
    "headline": "Bandits Strike Another Zamfara Community, Kill Village Head, 9 Others -",
    "summarized_story": "At least no fewer than Nine persons including a village head were Killed by suspected armed bandits in Tungar Ruwa Village in Anka local government area of Zamfara stateThe gunmen also rustled unspecified number of livestock, bugled shops and carted away with food stuff among other valuablesSome residents of the area especially women and children have fled the village for the fear of the unknownSources told TVC news that the gunmen invaded the town Wednesday night and started shooting sporadically leading to the death of nine locals and saveral others sustained gunshots woundsSpokesperson of the Zamfara State Police Command Superintendent Mohammed Shehu Confirmed the incidentThough he says no village head was killedAccording to him, details of the attack is still sketchy on the side of the police as at the time of filling this reportThe zamfara state police command says police tactical operatives have been deployed to the area to go after the perpetrators and also to forestall further attackThe Command further appeal to the people to always cooperate with security agencies to clampdown on criminals and their collaboratorsAnka is one of the local government areas in zamfara state that has no Telecomm services due to the ongoing unslaught against bandits in the stateThis attack is coming few days after police patrol team were attacked along Magani – Gusau road leading to the death of Seven Policemen."
  },
  {
    "headline": "Ex-DG FIIRO pleads not guilty to 3-count charge at Ikeja high court -",
    "summarized_story": "The judge ordered Mr Igwe’s remand following his not guilty plea to a three-count charge of making a document with false information, using his office to proffer unfair advantage and making false statement to a public officer.\nThe charges were proffered against the ex-DG of FIIRO by the Independent Corrupt Practices Commission (ICPC).\nAccording to the lead prosecutor for the ICPC, Henry Umore, Mr Igwe committed the offences in Lagos sometime in December 2002.\n“Sometime in January 2020, He made a false statement to Detective Andrew Osove, an Investigating Officer with the ICPC.\nIn a short ruling, Justice Solebo granted Mr Igwe bail in the sum of N500,000 with two sureties in like sum."
  },
  {
    "headline": "PHOTOS: Thugs invade Plateau Assembly chamber, vandalise property -",
    "summarized_story": "Suspected political thugs invade the chamber of the Plateau State House of Assembly Thursday night and vandalised properties.and other documents.\nThis is coming days after the impeachment of the speaker of the House of Assembly, an event that has thrown the assembly into political turmoil."
  },
  {
    "headline": "Witness reluctant to testify in Baba Ijesha’s case",
    "summarized_story": "The alleged sexual assault trial of Nollywood actor, Olanrewaju James a.k.a.\nBaba Ijesha was stalled on Friday owing to the absence of two witnesses for the Lagos State Government.\nAnother witness, also a police officer, is also said to be reluctant to testify.\nBut Justice Taiwo told the prosecution to “put its house in order.”Further heading was fixed for November 19 and December 2.\nBaba Ijesha is facing a six-count charge bordering on allegations of indecent treatment of a child, sexual assault, attempted sexual assault by penetration and sexual assault by penetration."
  },
  {
    "headline": "The Smithsonian Hosts 24hr Pop-Up in Lagos",
    "summarized_story": "The Smithsonian National Museum of African Art hosted the first edition of TASTE!\nin Lagos, Nigeria.\nis the foundation experience of 24-hours of the #Smithsonian in Lagos.\nFrom celebrating and displaying Africanart for a global audience to the restitution of the Benin Bronzes, the Smithsonian seeks to solidify it’s presence as a mainstay in the African Art scene.\nFor it’s collaboration with Art X, using sound, photography, and food respectively, artists Emeka Ogboh, Iké Udé, and Temitayo Ogunbiyi with chef Renèe Chuks question assumptions concerning culture, geography, and identity."
  },
  {
    "headline": "US Journalist Jailed for 11 Years in Army-Ruled Myanmar",
    "summarized_story": "A court in military-ruled Myanmar on Friday jailed American journalist Danny Fenster for 11 years, his lawyer and his employer said, despite U.S. calls for his release from what it said was unjust detention.\n“There is absolutely no basis to convict Danny of these charges,” said Thomas Kean, editor-in-chief of Frontier Myanmar, one of the country’s top independent news outlets.\n“The junta’s rationale for this outrageous, rights abusing sentence is first to shock and intimidate all remaining Burmese journalists inside Myanmar by punishing a foreign journalist this way,” he said.\nIndependent media has been accused by the junta of incitement.\nMyanmar authorities overlooked Fenster in a recent amnesty for hundreds of people detained over anti-junta protests, which included some journalists."
  },
  {
    "headline": "Azikiwe Against Biafran Tyranny – Trending With Ojy Okpe",
    "summarized_story": "The arrest of 14 persons in connection to the raid of the home of Mary Odili, a justice of the Supreme Court has generated mixed reactions.\nDuring a press briefing on Thursday, Frank Mba, the police, public relations officer, said a fake chief superintendent of police, an Islamic scholar and a journalist were among the 14 persons arrested.\nA video Of Dr. Nnamdi Azikiwe, the first president of Nigeria, speaking at the Nigerian High Commission in London, with a message to the Igbos during the Civil War in 1969, to turn away from the leaders of Biafra who misled them into supporting an enterprise that had brought them widespread suffering has resurfaced online and is making the rounds on social media.\nMeanwhile, Eunice Ngozi Onuegbusi, the woman who was seen in a viral video rejecting money from agents of the All Progressives Congress, after they tried to pay her and a group of other women the sum of N5,000 each, to vote for their party on November 6th during the Anambra Governorship election; on Thursday was awarded the sum of N1 million by Willy Obiano, the governor of Anambra State.\nThe Governor thanked her for her courage, saying even though she knew the money could buy her temporary relief, she remained loyal And voted according to her conscience ."
  },
  {
    "headline": "Toshiba Plans to Split into Three Firms, Rejects Calls to Go Private",
    "summarized_story": "Japan’s Toshiba Corp outlined plans on Friday to split into three independent companies, seeking to appease activist shareholders calling for a radical overhaul after years of scandal.\nA break-up would run counter to calls by some shareholders for Toshiba to be taken private.\nRETURNS FOR SHAREHOLDERSAs part of the overhaul, Toshiba aims to return around 100 billion yen ($875 million) to shareholders over the next two financial years.\nOther assets that will continue to be held by Toshiba include its stake in Toshiba Tec Corp (6588.T), a maker of printing and retail information systems.\nTwo years later, it secured a $5.4 billion cash injection from 30-plus overseas investors that helped avoid a delisting but brought in activist shareholders including Elliott Management, Third Point and Farallon."
  },
  {
    "headline": "Nigeria Police Parade 14 Suspects over Invasion of Justice Odili’s Residence",
    "summarized_story": "The Nigeria Police on Thursday paraded 14 suspects allegedly involved in the invasion of the Abuja residence of Supreme Court Justice, Mrs. Mary Odili.\nTHISDAY disowned one of the suspects, Mr. Stanley Nkwazema, who claimed to be a staff and contributing editor of the newspaper.\nNkwazema claimed he was investigating an exclusive story.\nMba said all the suspects attended all the meetings before the invasion and were all there on the night of the invasion.\n“Contrary to his claim, Mr. Nkwazema is neither a staff of THISDAY nor a Contributing Editor."
  }
]