[
  {
    "headline": "Poly students endorse Oyetola for second term",
    "summarized_story": "The National Association of Polytechnic Students on Wednesday endorsed Osun State Governor, Adegboyega Oyetola, for another term.\nAccording to a statement by the governor’s Chief Press Secretary, Ismail Omipidan, the students explained that they decided to support Oyetola in order to sustain the tempo of steady progress and development in the state.\nThe statement quoted the association’s National President, Olalere Benedict, as saying that the endorsement was aimed at reciprocating the governor’s good gesture towards the students in the state and Nigeria at large.\n“This endorsement and honour bestowed on our leader and father for second term as Osun State governor are to seek for his support in remodelling and rebranding the association and students’ structure in the state to meet up with the demands of the polytechnic students across Nigeria,” he said.\nReceiving the award on behalf of the governor, the deputy governor, Benedict Alabi, said the present administration holds students in high esteem and would always do everything to prioritise their interests."
  },
  {
    "headline": "Some interests capitalising on Assembly crisis to attack me – Lalong",
    "summarized_story": "ABOUT two years and six months after their election in 2019, 14 members of the Edo State House of Assembly on Wednesday approached the Code of Conduct Bureau, in Abuja, demanding for an investigation into the activities of the Assembly Clerk, Audu Omogbai.\nTwo years and six months, we have not been integrated into the House of Assembly.\nIn response, the CCB chairman said, “The CCB is an unbiased umpire.\nI assure you that we are going to look into your petition thoroughly and apply all that is necessary.\nAlthough you came with the press, investigations are meant to be confidential, it’s not going to be the same.”Copyright PUNCH."
  },
  {
    "headline": "Fire outbreak: UNIMAID bans cooking in hostel rooms",
    "summarized_story": "Scene of the pipeline explosion at Isheri, LagosIrked by the spate of fire outbreak in students’ hostels, the management of University of Maiduguri (UNIMAID), has banned students living in the hostels from cooking inside their rooms.\nThe management of the school said the fire outbreaks were caused by cooking stoves.\nA.M. Gimba titled: “Warning Notice on Cooking in Bedrooms,” said that defaulting students would be expelled from the hostel.\n“Recently the university has witnessed fire outbreaks in students halls of residence, specifically girls hostel.\n“This is attributed to cooking in the rooms in contravention of the rules and regulations of hostel residence,” he said."
  },
  {
    "headline": "This feels like titles and trophies, delighted Dani Alves smells Camp Nou grass",
    "summarized_story": "He picked grass from Camp Nou pitch, smelled it and said: “This smells like Camp Nou.\nThis smells like titles.”In the beginningHe joined Barca from Sevilla in 2008, collected 23 trophies in 391 appearances and scoring 21 goals.\nI’m still shocked — Dani AlvesDani Alves told BarcaTV+: “I’m still shocked.\n“We need to believe that we are Barcelona, the best club in the world.\n“Sometimes it sounds demagogic to say ‘it’s the best club in the world’, but I’ve been elsewhere and I know what I’m saying: this is the best club in the world, Barcelona is unique."
  },
  {
    "headline": "Police arrest hotelier over OAU Post-graduate student’s death",
    "summarized_story": "The Osun Police Command says it has arrested the proprietor of a popular Hotel and Resort in Ile-Ife (nameswitheld) over the death of a Masters Degree student of the Obafemi Awolowo University (OAU).\nOpalola said the hotelier was the latest suspect arrested in connection with the incident, adding that six people had earlier been arrested.\nA statement by the university Public Relations Office, Mr Abiodun Olanrewaju, said that the Vice-Chancellor of the University, Prof. Eyitope Ogunbodede, described the incident as sad and unfortunate.\n“The vice-chancellor pledged the commitment of the university’s administration to work with the law enforcement agents to unravel the circumstances leading to the death of Mr Adegoke.\n“Ogunbodede prayed for the repose of the soul of Mr Adegoke and that God should grant the family the fortitude to bear the irreparable loss.”(NAN)"
  },
  {
    "headline": "PHOTOS: Group Chairman, UBA, Tony Elumelu visits Zambian President",
    "summarized_story": "Group Chairman, UBA Plc and Founder, The Tony Elumelu Foundation, Mr Tony Elumelu, has on Tuesday, visited the President of Zambia, Hakainde Hichilema.\nDuring the visit, President Hichilema thanked Elumelu for his philanthropic support around Africa and his involvement in enhancing the economy of Zambia through the UBA and the Tony Elumelu Foundation in Lusaka, Zambia."
  },
  {
    "headline": "PDP appoints Caretaker Committee for Lagos",
    "summarized_story": "The National Working Committee (NWC) of the Peoples Democratic Party (PDP) has ki appointed Mr Julius Akinsola, as the Chairman of the Caretaker Committee of the Lagos State chapter of the party.\nThe PDP said this in a statement by its National Organising Secretary, retired Col. Austin Akobundu on Wednesday in Abuja.\nAkobundu said that the decision of the NWC was pursuant to its powers under Sections 29(2)(b) and 31(2)€ of the PDP Constitution (2017 as amended).\n“The caretaker committee is charged with the responsibility of running the affairs of the party in Lagos State as stipulated in Section 21(2)(a-b) of the PDP Constitution, for a period, not exceeding 90 days (from November to February 2022) until a new executive committee is elected.\n“All critical stakeholders, leaders and members of our great party in Lagos state and other parts of the country is by this guided accordingly,” Akobundu said."
  },
  {
    "headline": "Lagos govt reacts to outrage over damning report on End SARS, Lekki toll gate massacre",
    "summarized_story": "Lagos State Government has responded the reactions and anger trailing the report of the Panel of Inquiry on Restitution for Victims of SARS Related Abuses and Other Matters.\nOmotoso referred to the arguments and controversies over the revelations about Army’s invasion and shooting at Lekki toll gate on October 20, 2020.\nOmotoso noted that apart from setting up the panel, the Sanwo-Olu administration provided full support.\n“At the appropriate time, the Government will make known its views on all the issues raised by the Panel through the release of a White Paper”, the statement added.\nAttorney-General and Commissioner for Justice, Moyosore Onigbanjo (SAN) is leading the four-man team to produce the White Paper in two weeks."
  },
  {
    "headline": "Military, police not rivals – Lagos CP Odumosu",
    "summarized_story": "Commissioner of Police in Lagos State, Hakeem Odumosu says the military, police and other units are not rivals.\nOdumosu made the remark during the study tour of delegates of Senior Course 44, Armed Forces Command and Staff College, Jaji, to the police headquarters in Ikeja.\nOdumosu noted that the visit will enable the course participants to get thorough knowledge of the strategies being adopted by the command.\n“The strategies include, but not limited to, proactive and intelligence-driven security strategies against crimes and criminality to ensure a secured environment”, he disclosed.\nLeader of the delegates, Commodore K. J. Odubanjo thanked Odumosu for the warm reception accorded the team."
  },
  {
    "headline": "Gbajabiamila appoints ex-Rep, Adedapo Lam-Adesina as aide on political matters",
    "summarized_story": "House of Representatives Speaker, Femi Gbajabiamila has appointed Adedapo Lam-Adesina as his Special Assistant on Political Matters (South-West).\nHe served as the representative of Ibadan North East/South East Federal Constituency of Oyo State.\nThe politician, formerly Commissioner for Youths and Sport in Oyo, has been Gbaja’s close ally since the 2015 speakership contest.\nLam-Adesina replaces Ayodeji Joseph, a former lawmaker, who served the Speaker in the same capacity.\nJoseph was recently named the Managing Director of Lagos State Development and Property Corporation (LSDPC)."
  },
  {
    "headline": "Police confirm 4 casualties in Badagry building collapse, 6 rescued",
    "summarized_story": "The Police in Lagos State have confirmed the death of four persons in the Badagry building collapse.\nOn Wednesday, a storey building under construction at Flour Mill Estate in Magbon caved in.\nThe tragedy followed the Ikoyi building collapse where 45 died and more than a dozen injured.\nThey are receiving medical care at the Badagry General Hospital.\n“Four bodies recovered and deposited at the Badagry General Hospital morgue for autopsy”, Ajisebutu announced."
  },
  {
    "headline": "Gov. Ugwuanyi tops nominee for 2021 Nigeria Tech Innovation and Telecom Awards (NTITA)",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State is among the top nominees for the 2021 Nigeria Tech Innovation and Telecom Awards (NTITA) which celebrates Nigeria’s most profound digital leaders.\nThe annual event which operates as a collaborative platform with stakeholders majorly from the Association of Telecommunications Companies of Nigeria (ATCON) and the African Digital Economy Forum (ADEF) will confer Gov.\nInterestingly, Enugu is also leading the list for Tech Innovation Hub of the Year (Mentoring & Capacity Building); and Emerging Leaders in Innovation/Tech Advisory (Public Sector).\nUnbeknownst to many people, the state has demonstrated strong focus on youth development and soft skill building.\nThis has really impressed the 2021 NTITA jurors”."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Experts recommend 10,000 steps daily to prevent diabetes, hypertension",
    "summarized_story": "Experts have advised Nigerians to engage in consistent physical activities as it helps to prevent hypertension, diabetes and cancer.\nThey spoke at a media conference organised by pharmaceutical company, Mega Lifesciences, in line with this year’s World Diabetes Day in Lagos.\nThe don advised Nigerians to be more active, keep slim and fit as a way to remain healthy.\nFasanmade said: “We should make about 10,000 steps per day to keep hypertension, diabetes and cancer away.\nHe listed some of the symptoms of the condition to include passing “plenty” of urine, poor vision, poor erection, poor stamina, poor obstetric history including miscarriages and stillbirth, and itching on the skin."
  },
  {
    "headline": "Kano, institute partner on animal feed production",
    "summarized_story": "The Kano State Agro-Pastoral Development Project (KSADP) has signed an agreement with the Nigerian Institute of Animal Science (NIAS) for pasture production in the state.\nShortly after signing the agreement in Kano, the State Project Coordinator of KSADP Malam Ibrahim Garba Muhammad revealed that, as part of the agreement, the project has allocated four hectares of land to NIAS, at Kadawa, Garun Mallam Local Government Area, for pasture production.\nThe Registrar, who is the Chief Executive Officer (CEO) of the Nigerian Institute of Animal Science, Prof. Eustace Ayemere Iyayi, said the endeavour would help in meeting the increasing demand for fodder.\nProf. Iyayi explained that the institute would use irrigation and rain-fed pasture production techniques to develop the four hectares it received.\nManaging Director of Kano State Agricultural and Rural Development Agency’s (KSADP’s) executing agency, Dr Junaidu Yakubu Muhammad, promised that the state government would create the enabling environment for a mutually rewarding and sustainable partnership with the Nigerian Institute of Animal Science."
  },
  {
    "headline": "Forum seeks probe of NSCDC boss",
    "summarized_story": "The Unified Nigerian Youth Forum (UNYF) has called on President Muhammadu Buhari to investigate allegations of corruption against the Commandant-General of the Nigerian Security and Civil Defence Corps (NSCDC), Dr Ahmed Audi.\nIts President, Comrade Abdulsalam Mohammed Kazeem said the Forum had followed activities under the current NSCDC CG which includes “unprofessional conduct, contract/job racketeering, favouritism, administrative bribe and other forms of bad leadership.”The Forum averred the administration of President Buhari has zero tolerance for all forms of corruption at any level of governance, but lamented, however, that “to our greatest surprise, the Nigerian Security and Civil Defence Corps is the corruption hub of Nigeria under the leadership of Mr Audi.\nIn less than a year of his headship, he has transferred many professional, patriotic, committed and brave commanders of the corps out of strategic position/commands and replaced them with his puppet, which lacks all the required professional qualities to occupy such sensitive positions.”UNFY said: “With the current insecurity which ranges from banditry, cattle rustling and all other forms of criminality, the NSCDC is expected to support the armed forces, the police and other security outfits in tackling crimes.”- Advertisement -The forum said should Mr President fail to act now, it will not hesitate to carry out massive protests across the country.\n“If President Buhari refuses to act by sacking Ahmed Audi as the Commandant-General of NSCDC, we will embark on nationwide protest."
  },
  {
    "headline": "Janguza 3,000-capacity correctional village ready for commissioning April 2022",
    "summarized_story": "The Federal Government of Nigeria has said the 3,000 capacity Nigerian Correctional Service (NCoS) Correctional Village being constructed in Janguza, Kano State, would be ready for commissioning in April, 2022.\n“In the period under review, we commenced the construction of 3000 modern capacity custodial center in each of the 6 geopolitical zones.\n“We have integrated the construction of life centers into the new 3000-capacity custodial facilities in each of the geo-political zones.\nOn reformation and rehabilitation of the inmates, the Minister revealed that there are 465 inmates running different degree programmes at the National Open University of Nigeria.\n“There are currently about 465 inmates running various Degree programs, 85 of the inmates are running Post – Graduate Degree programs, 4 are running PhD programs within the custodial facilities."
  },
  {
    "headline": "Nigeria exits America’s religious violators’ list",
    "summarized_story": "From Ndubuisi Orji, and Aidoghie Paulinus, AbujaAmerican Government has removed Nigeria from its religious violators’ list, Secretary of State, Antony Blinken, said in a statement yesterday.\nBlinken said the United States would not waver in its commitment to advocate for freedom of religion or belief for all and in every country.\n“The nexus between human rights and peace is beyond contest.\nSustainable development is only possible when human rights become the cornerstone of governance.\n“Under this government, human rights’ abuses have become the spur of violent conflicts, halting economic progress, growth and development."
  },
  {
    "headline": "Ataga’s alleged murder: Chidinma left night before corpse was found – witness",
    "summarized_story": "Chidinma Ojukwu, the first defendant in the case of murder of Super TV Chief Executive Officer, Usifo Ataga, left the apartment, where the alleged murder occurred, a night before Ataga’s body was found.\nA security guard at the apartment said this on Wednesday while testifying before a Lagos high court as the second prosecution witness in the murder trial.\nWhile Ojukwu and Quadri are charged with conspiracy and murder of Ataga, Egbuchu is charged with theft of Ataga’s iPhone.\nThe witness denied that he told the police that he suspected one Mr Babalola Disu, who also logged at the apartment at the time the alleged murder happened.\nHe told the court that he found Ataga’s corpse in the morning of June 16."
  },
  {
    "headline": "Five burnt to death in tanker explosion on Lagos-Ibadan Expressway",
    "summarized_story": "From Laide Raheem, AbeokutaFive people have been confirmed dead in a petrol tanker explosion on Wednesday morning at the Ogere section of the Lagos-Ibadan Expressway.\nThe sector commander said that the suspected cause of the incident was wrongful overtaking and dangerous driving on the part of the petrol tanker driver, who collided with a moving truck, resulting in a fire outbreak.\nThe five dead victims were recovered from one of the crashed trucks and were burnt beyond recognition, Umar said.\nThe sector commander indicated that the Fire Service in Sagamu, Police Traffic Division Ogere and Gateway Police Station, Old Tollgate, Ogere had been contacted.\n‘Motorists are hereby enjoined to take alternative routes to avoid spending several hours in the traffic gridlock,’ Umar said."
  },
  {
    "headline": "EndSARS: Afenifere, CNPP, PDP, Bode George, Falana, Moghalu, Ugwummadu, Nwanguma demand action",
    "summarized_story": "On Monday, the Justice Doris Okuwobi-led panel submitted its report, stating that the armed forces shot and killed protesters at Lekki Toll Gate in Lagos last year.\n“You and I knew that people were killed at Lekki, but the Federal Government said nobody was killed.\nThe policemen who were killed by criminal elements during the protests should be honoured, notwithstanding that their family members have been compensated by the Lagos State Government.\nHowever, as police brutality has continued unabated, we call on the government to set up the Lagos State Human Rights Committee in line with the recommendation of the Panel.\nThe government has been trying to cover up what happened at the Lekki Toll Gate but the truth has come out."
  },
  {
    "headline": "Again, Another Building Collapses in Lagos, Kill Four",
    "summarized_story": "Rebecca EjifomaFour persons, Wednesday, died and five others were injured after a two-storey building collapsed at Flour Mill Estate, Magbon in Badagry area of Lagos State.\nThe building, which was said to be under construction, crumbled at about 1pm.\nFive workers were rescued with various degrees of injuries and taken to Catholic hospital at Magbon.\nFarinloye added that the building was located behind a dwelling structure.\n“The building construction started about two years ago but was not completed."
  },
  {
    "headline": "October Revenue Drops as FG, States, LGs Share N671.910bn",
    "summarized_story": "From the amount, the federal government received N284.292 billion, the states (N209.838 billion), and local government councils (N156.282 billion) while the oil producing states received N21.498 billion as 13 per cent derivation revenue.\nThe VAT distribution saw the federal government taking N23.227 billion, the states received N77.422 billion, local governments got N54.195 billion.\nAlso, the Distributable Statutory Revenue of N407.864 billion received for the month was lower than the N692.283 billion received for the previous month by N284.419 billion, from which the federal government received N180.551 billion, states got N91.578 billion, local governmentss got N70.603 billion,N21.118 billion was allocated as 13 per cent mineral revenue).\nThe communiqué also indicated that Augmentations of N100 billion saw the federal government receiving N52.680 billion, states (N26.720 billion), local received N20.600 billion.\nThe sum of N50 billion from non-oil revenue was also shared with the federal government receiving N26.340 billion, state governments (N13.360 billion), and local governments N10.300 billion."
  },
  {
    "headline": "Emefiele: CBN Disbursed N3trn Loans to Nigerian Businesses in One Year to Cushion Impact of Covid-19",
    "summarized_story": "He also reiterated that the monetary and fiscal authorities were working hand in hand to deliver a stronger economy to Nigerians.\nOn the recently launched “100 for 100 “, he noted that it was floated to support employment creation, assuring that the central bank would do everything possible to provide foreign exchange to import plants and machinery.\nHe added, “We know that people would like to play some games but I can assure you that the central bank has the resources to monitor.\nSo, it is left for you to respond whether there is collaboration between monetary and fiscal authority there.\nAccording to the CBN helmsman, it was high time Nigeria stopped relying on an economy that depends on oil."
  },
  {
    "headline": "#EndSARS: It’s Time for Healing, Say UN, US, as CDS Cautions against Denigrating Army",
    "summarized_story": "“I urge the government to implement the recommendations of the judicial panel of inquiry to rebuild trust and start the process of healing and reconciliation,” Kallon added.\nIt urged the Lagos State government and the federal government to take appropriate steps to address the alleged abuses.\nHe urged the Lagos State government to accelerate the issuance of the White Paper as well as the implementation of the far-reaching recommendations.\nHe assured, however, that the Nigerian Armed Forces remained committed to their professional calling of protecting the territorial integrity of the country.\n“If Nigerians don’t trust us, then we wouldn’t have been doing what we are doing and in any case, it is the armed forces of Nigeria and remember, we are not talking about the police, we are talking about the armed forces, with emphasis, armed forces, so when the armed forces are called out, it is because there is a need for the armed forces; there is no one who do not require and desire to live in peace."
  },
  {
    "headline": "NNPC Gets $1bn Boost from Afreximbank, Sees Oil at $100pb",
    "summarized_story": "In terms of the NNPC and Afreximbank deal, it was gathered that it did not involve exploration of crude oil, but mainly for trade financing and export of the crude produced by the national oil company, although details still remained sketchy last night.\nArise News Channel reported that the $1.04 billion would be repaid to the continental bank with about 25,000bpd of crude oil produced by the state oil company.\nCurrently, the global oil market has a deficit of over 600,000 bpd, a development that has led to increase in oil and gas prices and bringing along attendant inflationary pressures.\n“It’s very obvious that by the close of the year, we will get back to the 1.7 barrels to 1.8 barrels per day of crude oil.\nBut obviously, the oil industry is adjusting, people are facing new realities and of course, the focus is changing."
  },
  {
    "headline": "EXCLUSIVE: Bandits Inform Adamawa Community Of Impending Attack, Demand N30million Upfront",
    "summarized_story": "Bandits have sent threats to the Fa'a Gaya community in the Hong Local Government Area of Adamawa State demanding N30million ransom so that they would not invade and launch terror on the community.\n“Kidnappers have threatened to wipe out one village called Fa'a Gaya in Hong LGA of Adamawa State.\nWhy is it that the Nigerian government neglected its citizens and even hand them over to criminals kidnappers, bandits, Boko Haram and ISWAP terrorists?\n“Right now the leaders of Fa'a Gaya community are holding meetings because of the terrible tribulation and trauma that they are going through.\n“Until the criminals, terrorists will carry out their operation on innocent Nigerians before the security agencies start giving excuses for nothing!"
  },
  {
    "headline": "EXCLUSIVE: Bandits Inform Adamawa Community Of Impending Attack, Demand N30million Upfront",
    "summarized_story": "Bandits have sent threats to the Fa'a Gaya community in the Hong Local Government Area of Adamawa State demanding N30million ransom so that they would not invade and launch terror on the community.\n“Kidnappers have threatened to wipe out one village called Fa'a Gaya in Hong LGA of Adamawa State.\nWhy is it that the Nigerian government neglected its citizens and even hand them over to criminals kidnappers, bandits, Boko Haram and ISWAP terrorists?\n“Right now the leaders of Fa'a Gaya community are holding meetings because of the terrible tribulation and trauma that they are going through.\n“Until the criminals, terrorists will carry out their operation on innocent Nigerians before the security agencies start giving excuses for nothing!"
  },
  {
    "headline": "EXCLUSIVE: Nigeria Police Authorities Order Female Officers Married To Civilians To Vacate Barracks With Families",
    "summarized_story": "A large number of married policewomen and others married to civilians living in different barracks in Enugu State are on the verge of being homeless following an order by the police authorities directing them to vacate the facilities.\nThe signal originated from the Department of Finance and Administration in Enugu State and was addressed to all Assistant Commissioners of Police, Heads of Department and Divisional Police Officers in the state.\nThe document also asked those who sublet whole or part of their barrack accommodations to civilians to eject them or face disciplinary action.\nOne of the affected female officers, who spoke to SaharaReporters on condition of anonymity for fear of being sanctioned said she was shocked by the directive.\n“Evicting women police from the barracks just because they are married to civilians is insane and the shameful."
  },
  {
    "headline": "EXCLUSIVE: Nigeria Police Authorities Order Female Officers Married To Civilians To Vacate Barracks With Families",
    "summarized_story": "A large number of married policewomen and others married to civilians living in different barracks in Enugu State are on the verge of being homeless following an order by the police authorities directing them to vacate the facilities.\nThe signal originated from the Department of Finance and Administration in Enugu State and was addressed to all Assistant Commissioners of Police, Heads of Department and Divisional Police Officers in the state.\nThe document also asked those who sublet whole or part of their barrack accommodations to civilians to eject them or face disciplinary action.\nOne of the affected female officers, who spoke to SaharaReporters on condition of anonymity for fear of being sanctioned said she was shocked by the directive.\n“Evicting women police from the barracks just because they are married to civilians is insane and the shameful."
  },
  {
    "headline": "Lekki Panel's Report: Conspiracy Of Massacre Exposed, By Bolaji O. Akinyemi",
    "summarized_story": "Memory of the blood stained flag of the massacre was renewed at the first anniversary, with Nigerian youths and their parent promising never to forget!\nIt manipulated the incomplete CCTV video footage of the Lekki Toll Gate on the night of October 20, 2020, which it tendered before the Panel!\nThis situation was what the Endsars was meant to address, when Nigerian youths got together and rose in unison to say enough is enough!\nPanel's Report gave recognition to the potential of the Nigerian youth and the emerging leadership they constitute going forward to 2023!\nMay the wishes of Nigerian youths for a systemic society where things work and all can be free to express themselves, contribute their creativities and live their dreams come to pass!"
  },
  {
    "headline": "EXTRA: No diamond bra recovered from Diezani, says Bawa",
    "summarized_story": "Abdulrasheed Bawa, chairman of the Economic and Financial Crimes Commission (EFCC), says there was no diamond bra recovered from Diezani Alison-Madueke, former petroleum minister.\nIn October, he federal government had listed assets forfeited by Diezani to include properties located in Banana Island Foreshore Estate, Ikoyi, Lagos.\nHowever, reports had circulated at the time that diamond bras were included in the items forfeited by the former minister.\nSpeaking on Wednesday when he featured on Your View, a programme on TVC, the EFCC chairman said no such item was recovered from Diezani.\n“You have accused us several times of media trial, but I think it’s good to be fair to everybody at all times."
  },
  {
    "headline": "EXTRA: No diamond bra recovered from Diezani, says Bawa",
    "summarized_story": "Abdulrasheed Bawa, chairman of the Economic and Financial Crimes Commission (EFCC), says there was no diamond bra recovered from Diezani Alison-Madueke, former petroleum minister.\nIn October, he federal government had listed assets forfeited by Diezani to include properties located in Banana Island Foreshore Estate, Ikoyi, Lagos.\nHowever, reports had circulated at the time that diamond bras were included in the items forfeited by the former minister.\nSpeaking on Wednesday when he featured on Your View, a programme on TVC, the EFCC chairman said no such item was recovered from Diezani.\n“You have accused us several times of media trial, but I think it’s good to be fair to everybody at all times."
  },
  {
    "headline": "'Don't nullify government's good intentions' — Lagos speaks on 'arguments' over #EndSARS report",
    "summarized_story": "The Lagos government has called for restraint over “arguments” on the report of the state judicial panel on police brutality.\nAdvertisementOn Monday, the panel submitted two documents — a consolidated report on cases of police brutality and another on the Lekki incident investigation — to Babajide Sanwo-Olu, governor of the state.\nSpeaking after the report was submitted, Sanwo-Olu constituted a four-member committee to come up with a white paper on the recommendations of the panel within two weeks.\n“In accordance with the Tribunal of Inquiry Law 2015, a committee has been set up to bring up a white paper on the report to determine the next line of action.\n“At the appropriate time, the government will make known its views on all the issues raised by the panel through the release of a white paper.”"
  },
  {
    "headline": "'Don't nullify government's good intentions' — Lagos speaks on 'arguments' over #EndSARS report",
    "summarized_story": "The Lagos government has called for restraint over “arguments” on the report of the state judicial panel on police brutality.\nAdvertisementOn Monday, the panel submitted two documents — a consolidated report on cases of police brutality and another on the Lekki incident investigation — to Babajide Sanwo-Olu, governor of the state.\nSpeaking after the report was submitted, Sanwo-Olu constituted a four-member committee to come up with a white paper on the recommendations of the panel within two weeks.\n“In accordance with the Tribunal of Inquiry Law 2015, a committee has been set up to bring up a white paper on the report to determine the next line of action.\n“At the appropriate time, the government will make known its views on all the issues raised by the panel through the release of a white paper.”"
  },
  {
    "headline": "Biden orders probe of oil companies over 'illegal conduct' in high fuel prices",
    "summarized_story": "President Joe Biden has asked the federal trade commission (FTC) to launch an investigation into possible illegal conduct by oil companies in the United States.\nAdvertisementBiden disclosed this in a letter posted by the White House to Lina Khan, FTC chair, on Wednesday in Washington, D.C.Last month, the US government blamed the jump in oil prices on the cautious oil output by OPEC, calling on the oil cartel to ramp up production.\nAdvertisementIn the letter, he directed Khan to haul out potential disfavour of consumers’ interest meted out by oil and gas companies in the U.S.“The bottom line is this: gasoline prices at the pump remain high, even though oil and gas companies costs are declining,” Biden said.\n“This unexplained large gap between the price of unfinished gasoline and the average price at the pump is well above the pre-pandemic average.\n“Meanwhile, the largest oil and gas companies in America are generating significant profits off higher energy prices."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "Shuttlers raises $1.6 million to expand to Nigerian cities",
    "summarized_story": "Shuttlers, a logistics startup out of Lagos, Nigeria, has raised $1.6 million in seed funding to expand into African countries.\nWith its new raise, Shuttlers intends to try its wheels in more Nigerian cities before expanding beyond the borders of the country into other African countries.\nShuttling Lagos’ transportation systemIn 2016, Damilola Olokesusi founded Shuttlers to tackle the inefficient transportation system in Lagos, Africa’s most populous city.\nWith over 100 buses and 300 bus stops in Lagos, Shuttlers also claims to have recorded over 2 million trips since its inception in 2013.\n“Our mission at Shuttlers is to transform the way people commute around the world, by building a global partner network and connecting communities of shuttlers like we are presently doing in Lagos, Nigeria."
  },
  {
    "headline": "Sangu Delle is building a “tech-forward healthcare system” across Africa",
    "summarized_story": "This week, Africa Health Holdings, a healthcare startup that operates 40 medical facilities across three countries in Africa, said it has secured $18 million Series A funding.\nAfrica Health Holdings plans to deploy the funds towards building its “tech-forward healthcare system” across the continent.\nIn 2017, Delle took his learnings from all the healthcare investments he lead at GPI and founded Africa Health Holdings.\nSangu Delle, founder and CEO of Africa Health Holdings.\nThe next global healthcare frontierOn Monday, Nigeria-based DrugStoc also announced a $4.4 million Series A fundraising round, led by Africa HealthCare Master Fund, with participation from Vested World and German Development Bank."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Led by ex-OPay exec, Kredi Money wants to be the one-stop-shop for payments, loans, insurance, other financial services",
    "summarized_story": "Consequently, looking at Nigeria’s financial services space will reveal several startups with diverse financial use cases.\nBut for the founders of digital banking startup, Kredi Money, financial services consumers could receive a better experience.\nKredi money was pretty much the brainchild of their combined experiences in the market.\nFrom Left to Right: Samuel Orji, Co-founder Kredi Money, and Afolabi Abimbola, CEO of Kredi Money.\nAbimbola reveals that he wanted to lay the groundwork for a financial services company, before approaching institutional investors."
  },
  {
    "headline": "Techpoint Build 2021, meme coins, Shuttlers’ seed funding, DrugStoc’s Series A, Nigeria’s housing deficit",
    "summarized_story": "All you need to know about meme coinsWith cryptocurrency minting new millionaires, there has been a rise in meme coins.\nMeme coins are crypto tokens inspired by social media trends, jokes, or movies.\nAside from original gangster (OG) meme coins, most meme coins have no use case backing them, which makes trading in them a risky venture.\nFor the latest instalment of Crypto Explorer, our Reporter, Bolu Abiodun, goes into detail about meme coins.\nSource: SuppliedNigerian mobility startup, Shuttlers has raised $1.6 million in seed funding."
  },
  {
    "headline": "Wakanda Inu: What meme tokens are and why you should care",
    "summarized_story": "In fact, the first African themed meme coin, Wakanda Inu, has just been launched.\nAlthough there are hundreds of meme coins, those referred to as OG (original gangster) meme coins are the most popular with the highest market capitalisation.\nInterestingly there’s now an African-themed meme coin — Wakanda Inu — made to create wealth for Africans.\nFor example, the new African-themed meme token — Wakanda Inu — named after a fictional African city — Wakanda — in the movie the Black Panther is on the rise and rallying strongly.\nThe African meme token — Wakanda InuWakanda Inu home pageAccording to the token’s whitepaper, “Wakanda Inu is a community meme project forged from the deep and warm consciousness of humanity.”It says it is “a decentralized meme token to drive growth in the industry, decentralized finance-oriented activities across the world."
  },
  {
    "headline": "Nigerians enrolment in US universities hits 3yr low",
    "summarized_story": "The number of Nigerian students seeking admission in US universities dipped by 6.5 percent in 2020/2021, the lowest in three years, a BusinessDay analysis of new admission data shows.\nAnalysts attribute the decline to foreign exchange (FX) scarcity and difficulty in sourcing FX, thus making tuition fees expensive.\n“It is not surprising because the difficulty in sourcing for FX, volatility in the exchange rate, and uncertainty that persists in the exchange rate environment have made it too difficult to pay school fees,” Moses Ojo, a Lagos-based economic analyst, says.\nBefore the drop, the number of Nigerian students studying in the US has increased steadily since the 2011/2012 academic year from 7,028 to 13,762 in 2019/20.\nIt is also facing the problem of dilapidated infrastructure,” Peter Okebukola, former executive secretary of the National Universities Commission, said."
  },
  {
    "headline": "#EndSARS panel report: How the army covered up massacre",
    "summarized_story": "But not at the Lekki Toll Gate: The #EndSARS protest at Lekki Toll Gate in particular was peaceful and orderly and was not hijacked by hoodlums, the panel held.\nThe only other logical explanation for unleashing the army at the Lekki Toll Gate comes down to economic considerations.\nAnother witness Dabira Ayuku also testified that she saw seven bodies being put in a military truck at the Lekki Toll Gate.\nBut analysts say without accountability, a common thread in recorded atrocities by the Nigerian Army, and this would only be a dress rehearsal for the next massacre.\nAugust 1967The Nigerian Army troops entered Asaba in pursuit of the retreating Biafran army, slaughtering thousands of civilians and leaving the town in ruins."
  },
  {
    "headline": "Pension funds embrace stocks as bond yields decline",
    "summarized_story": "Nigeria’s pension funds are finding solace in domestic stocks with N874 billion investments as of September 30, 2021, amid declining bond yields, according to figures from the National Pension Commission (PenCom).\nFrom the unaudited report on pension funds industry portfolio for the period ended September 30, 2021, released by PenCom, N873.49 billion was invested in stocks, as against N846.55 billion in August 2021.\nThey note that the pension industry’s exposure to Nigerian Treasury Bills (NTBs) continues to trend downward.\nDave Uduanu, managing director/CEO, Sigma Pensions, says there is nothing fundamental in the investment figures on stocks, but a sign of recovery from COVID-19.\nWhat has happened was that, with the absence of foreign portfolio investment, any new money put in will lead to a rally in some good names (good stocks), and that could mean higher state,” he says."
  },
  {
    "headline": "Edo govt intensifies removal of illegal structures under high tensions, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has intensified the demolition of illegal structures constructed under high tension cables and other unauthorized places in the Benin metropolis.\nThe exercise is aimed at removing structures by illegal developers and squatters that trade in unauthorized locations such as under the Transmission Company of Nigeria (TCN) High Tension Lines in the metropolis.\nAccording to her, “We are on a demolition exercise to remove illegal structures and traders under high tension/power line at Trinity Way, popularly known as Abuja Quarters.”“How can you do an illegal thing and try to legalize it?\nIf anything happens under this power line, who will be blamed?\n“We have given them ample time to move, but instead of them to move they are building more permanent structures under the power line."
  },
  {
    "headline": "Edo flags off outbreak response for circulating vaccine-derived poliovirus type 2 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Deputy Governor, Rt.\nComrade Philip Shaibu has flagged off the state’s Second Phase Outbreak Response (OBR) for Circulating Vaccine-Derived Polio Virus Type 2.\nThe flag-off ceremony, which was held at Eyaen Primary Healthcare Centre (PHC), Benin City, Uhunmwode Local Government Area of Edo State, was to kick-start a coordinated response to routine immunisation.\nShe explained that the novel oral polio vaccine (noPV2) is the modified version of the moPV that had been used in previous years.\nErhabor encouraged healthcare workers, community leaders and other opinion leaders to support the campaign to ensure its success."
  },
  {
    "headline": "Obaseki pledges sustained investment in healthcare, reassures of one healthcare centre for every ward in Edo – Nigerian Observer",
    "summarized_story": "Obaseki pledges sustained investment in healthcare, reassures of one healthcare centre for every ward in EdoShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said his government is focused on reforming and upgrading the state’s primary healthcare system, ensuring swift, affordable and quality medical service delivery to Edo people.\nObaseki, who spoke to journalists in Benin City, said the government plans to have at least one standard primary healthcare centre in every ward in Edo with well-trained staff and technology before 2024.\nAccording to him, “In the area of healthcare, we have just started, even though we have done quite a lot of work in the sector.\nOur focus has always been on basic care, just like we did with our education system; we are fixing those areas where our people have the first interaction with our healthcare system.\n“We have revamped the Edo Specialist Hospital and ignored the manipulations from detractors who try to make an issue of our decision to bring down a 90-year-old hospital and move it into a 5-year-old hospital.”“So, we are transforming the Specialist Hospital and building a new Stella Obasanjo Hospital,” he stated."
  },
  {
    "headline": "NYSC DG, Ibrahim, kicks against rejection of corps members by employers’ – Nigerian Observer",
    "summarized_story": "General Shaibu Ibrahim, expressed his resentment in Benin City, during corps employers workshop organised by the scheme.\nAhmed Tijani said the workshop was to eliciting idea and suggestions aimed at ensuring good partnership and relationship between NYSC, employers and corp members.\nHe said NYSC is also worried by employers not applying for corps members, under utilisation, delay in issuance of monthly clearance, aiding corps abscondment, lack of provision of statutory welfare of corps members among others.\nHe said employers are expected to make some statutory welfare provision for the corps members serving with them during their service year.\nHe warned that employers have no authority to approve leave or movement of corps members outside their state of deployment."
  },
  {
    "headline": "Bandits return to Niger community, abduct four, demand N150 million ransom",
    "summarized_story": "Suspected bandits have again abducted four persons in Tegina in Rafi Local Government Area of Niger State.\nTegina is the town where 136 pupils of an Islamiyya school were abducted on May 30.\nWeeks before that incident, bandits had also kidnapped scores of students from a public secondary school in Kagara in the same area.\nMr Muhammad said the victims were kidnapped on Sunday night at a water factory opposite Government Secondary School, Tegina.\nResidents said the four persons kidnapped on Sunday include a health worker identified as Sani Garba and the owner of the water factory, Bako BK."
  },
  {
    "headline": "Shun self-centered politics to succeed in Nigeria – Elliot Uko writes Igbo leaders",
    "summarized_story": "And on the 29th of July 1966, as General Ironsi was taken out in Ibadan, Ndigbo fell into a very deep, unfriendly and dirty political pit.\n“They are aware of past mistakes of Igbo leadership.\nThey know of the post civil war behaviour and disposition of Igbo leaders, through the military era, till date.\nOur leaders across board, political leaders, traditional rulers, the clergy, elders, business leaders and opinion leaders, must identify with the pains of the masses.\nIgbo leaders must find out what time it is."
  },
  {
    "headline": "Ardova completes issuance of Issuance of N25.3bn Series 1 Fixed Rate Bonds under a N60bn Debt Issuance Programme",
    "summarized_story": "OBINNA EZUGWUArdova Plc has announced the successful completion of a N25.3 billion Series 1 (Tranche A and Tranche B) Fixed Rate Senior Unsecured Bond Issue (“the “Bond Issue”) under its N60 billion Debt Issuance Programme.\nArdova will apply the proceeds of the Bond Issue to fund expansion projects and its working capital requirements.\nVetiva Capital Management Limited and Stanbic IBTC Capital Limited acted as Lead Issuing House and Joint Issuing House respectively to the Bond Issue.\nOur relationship with Nigeria’s debt capital markets commenced in December 2016 with the issuance of the Company’s debut bonds.\nWe thank the institutional investor community for supporting the Bond Issue, as its success should encourage other similar companies to access the domestic debt capital markets for their strategic funding needs."
  },
  {
    "headline": "NGX Spotlights SPACs as a Viable Alternative Route to Public Markets",
    "summarized_story": "In recognition of the role Special Purpose Acquisition Companies (SPACs) play in catalyzing economic growth through public markets Nigeria and Africa, Nigerian Exchange Limited (NGX) hosted a webinar with the theme SPACs: An Alternative Route to Public Markets on Wednesday, 17 November 2021.\nHe commented, “I must commend NGX for putting this webinar together to highlight the opportunities available to the market to access financing through SPACs at a time when we need to deepen our markets.\nThe session featured Partner & Co-Founder, Verod Capital, Mr. Eric Idiahi and CEO, Orango Investment Corporation, Mr. Eric V Guichard with CEO, Stanbic IBTC Capital, Mr. Funso Akere serving as panel moderator.\nNGX remains committed to the development of innovative capital market solutions to nurture and encourage new listings while leveraging technology to optimize our processes, improve time to market, create alternate routes to market, and further deepen liquidity within the Nigerian Capital Markets.\nStakeholders can, therefore, look forward to other engagements such as this to spur activity in the market."
  },
  {
    "headline": "Davido in demonstration of star power, rakes in N114m from fans in five hours",
    "summarized_story": "“If u know I’ve given you a hit song .. send me money ….\nuna know una selves oo,” he wrote in a tweet he accompanied with laughing emojies.\n“You people that got a hit song from David know say it’s worth way more!\n“I want my own hit song with Davido.\n“I know say una love me but una love me like this?"
  },
  {
    "headline": "Cash Challenge: 114m Hits Davido’s Account, Surprised By Otedola, Others",
    "summarized_story": "Top singer, David Adedeji Adeleke, popularly known as Davido has continue to receive credit alerts on his account to the extent that he said that he was tried of receiving money.\nThe fund that got to his account has reached a hundred and fourteen million plus (N114,053,067.53) as at the time of filing this report.\nThe cash challenge which started on Wednesday afternoon, had gone viral with many celebs trying to emulate the singer and request for funds from their fans out of amusement perhaps.\nOne of the highlights of the cash challenge was when billionaire businessmen, Mr Femi Otedola, surprised the singer with a staggering amount though undisclosed.\nDavido, who is a generous giver himself, had always used his mantra, ‘We rise by lifting others’ to point out his philosophy."
  },
  {
    "headline": "Unpaid Arrears: FCT Primary, Sec School Teachers Begin 5-Day Warning Strike",
    "summarized_story": "Teachers of primary schools and Government Secondary Schools in the Federal Capital Territory (FCT), under the aegis of the Nigeria Union of Teachers (NUT), will embark on a five-day warning strike from Thursday over non-payment of their promotion arrears.\nAccording to her, the council chairmen have also refused to offset teachers’ promotion arrears from 2014 to 2018, non-implementation of 2020 and 2021 annual increments, and upgrading of qualified teachers.\nShe also said the FCT Administration has failed to pay 2016, 2017, and 2018 promotion arrears to the secondary school teachers in the FCT despite the ultimatum issued.\nJethro added that the failure of the FCT Administration and the six area council chairmen to settle the outstanding entitlements of FCT teachers within five days period of the warning strike, the union will have no other option than to declare an indefinite strike to press home their demands.\nWhen contacted, the chairman of Gwagwalada Area Council, Alhaji Adamu Mustapha, who is also the FCT ALGON chairman, did not pick calls or reply to text messages sent to him."
  },
  {
    "headline": "Gov Zulum Visits Family Of Late Gen. Zirkushu, Doles Out N20m",
    "summarized_story": "Borno State governor, Professor Babagana Umara Zulum, on Wednesday, led a delegation on a condolence visit to the bereaved family of late Brigadier General Dzarma Zirkushu.\nBlessing Zirkushu, widow of the late General and her five children, after being received by Mr Gurdebil Zirkushu, a brother to the late General, among other family members.\nGovernor Zulum consoled the family and urged them to take solace in the heroic legacy bequeathed to them by the late General.\nMeanwhile, the Kaduna State government has also announced a donation of N2m to support the family of late General Zirkushu.\nSamuel Aruwan, Commissioner for Internal Security and Home Affairs, announced the donation shortly after Governor Zulum released N20m to the family."
  },
  {
    "headline": "COP26: Young People Must Have A Seat In All Policy Debates – Saraki",
    "summarized_story": "Against the backdrop of the recently concluded United Nations Climate Change Conference, commonly referred to as #COP26, in Glasgow, Scotland, a former President of the Senate, Dr. Abubakar Bukola Saraki, has emphasised the importance of young people contributions to crucial policy debates and discussions.\nSaraki in a statement signed his Digital Communications Aide, Olu Onemola, on Wednesday, said: “Climate change is happening now, but it is also about the future of our nation and the world.\n“More young people like yourself should have attended COP26 to contribute to the discussions.\n“This is why, policymakers across the nation and the world need to sit down and make realistic decisions that will combat this problem here in Nigeria.\nIf you remember, in the 8th Senate, we passed a Climate Change Bill that was never signed into law,” Saraki, who served as the Chairman of the Senate Committee on Environment and Ecology said."
  },
  {
    "headline": "Four dead as two-storey building collapses in Lagos",
    "summarized_story": "Four persons have been confirmed dead as a two-storey building located at Flour Mills Estate, Magbon in the Badagry area of Lagos State collapsed on Wednesday.\nHe said, “A two-storey building under construction at Flour mill Estate collapsed at about 1300 hour this afternoon.\n“The families and relations of the affected victims have been identified by the relations of the victims.\nThe building is located behind a dwelling structure.\nRescue operations have been concluded now.”This Director of the Lagos State Fire and Rescue Service, Margaret Adeseye, earlier broke the news on their Facebook page."
  },
  {
    "headline": "Ondo NYSC coordinator: Many corps members are drug addicts",
    "summarized_story": "The National Youths Service Corps has called for collaborative efforts from all stakeholders in addressing the increasing rate of drug abuse and addiction among corps members.\nAni spoke at the 2021 corps employers workshop in Akure, the state capital, on Wednesday.\nReacting to the complaints, Ani said, “For the Corps members that take weeds(Indian hemp), I need to let you know that NYSC is doing so much.\nMany of our children (corps members) are drug addicts.\n“I wish to remind you of a subsisting circular from the Federal Government which prohibits rejection of corps members by government’s MDAs,” the DG stated."
  },
  {
    "headline": "Ondo NYSC coordinator: Many corps members are drug addicts",
    "summarized_story": "The National Youths Service Corps has called for collaborative efforts from all stakeholders in addressing the increasing rate of drug abuse and addiction among corps members.\nAni spoke at the 2021 corps employers workshop in Akure, the state capital, on Wednesday.\nReacting to the complaints, Ani said, “For the Corps members that take weeds(Indian hemp), I need to let you know that NYSC is doing so much.\nMany of our children (corps members) are drug addicts.\n“I wish to remind you of a subsisting circular from the Federal Government which prohibits rejection of corps members by government’s MDAs,” the DG stated."
  },
  {
    "headline": "Edo crisis worsens as 14 legislators storm CCB with petition",
    "summarized_story": "About two years and six months after their election in 2019, 14 members of the Edo State House of Assembly on Wednesday stormed the Code of Conduct Bureau in Abuja demanding investigation of their exclusion by the Clerk of the Assembly, Audu Yahaya Omogbai.\nThey called on the CCB to intervene and rescue democracy, but warned that “Edo will be a dirty reference point in years to come.”The legislators who were received by the chairman of CCB, Prof. Mohammed Isah, were led by a former Speaker of Edo State House of Assembly, Victor Edohor and former Commissioner for Education, Washington Osifo.\nTwo years and six months, we have not been integrated into the House of Assembly.\n“Sir, our major complaint is that the present impasse at the EDHA was caused deliberately and mischievously by Alhaji Audu Yahaya Omogbai, the current Clerk of the House.\nI assure you that we are going to look into your petition thoroughly and apply all that is necessary."
  },
  {
    "headline": "Presidential ambitions: Ohanaeze commends Anyim, Ohuabunwa",
    "summarized_story": "“There is no better time to seek for the Igbo Presidency than now.\n“Therefore, we call on all other Presidential faithful of Igbo extraction to openly declare their interest to contest like Senator Anyim and Mazi Ohuabunwa did.\nTherefore, other Igbo sons and daughters should join the race.\n“As former President of the Senate, Chief Anyim, made the Igbos proud and has remained a detribalised Nigerian.\nAs former Secretary to Government of the Federation, Chief Anyim brought his humility and wealth of experience to bear, to ensure the government he served succeeded."
  },
  {
    "headline": "Updated: Davido rakes in over N140 million in donations from fans, friends",
    "summarized_story": "Award-winning Nigerian singer, David Adeleke also known as Davido has received more than N140.3 million from his friends, colleagues and fans on social media.\n”If u know I’ve given you a hit song .. send me money ….\nuna know una selves oo”, the DMW boss tweeted.\nuna know una selves oo 😂😂😂🥰🥰🎉🎉 — Davido (@davido) November 17, 2021Moments later, he started giving updates and revealed that the targeted amount he is expecting is N100m which he intends to use to clear his Rolls Royce from the port.\nOmo nah like joke I start this thing oo 😂😂 26m — Davido (@davido) November 17, 2021At the time of publishing, the music star had raised N74M."
  },
  {
    "headline": "Rittenhouse trial: Defence lawyers set to make mistrial claim",
    "summarized_story": "Defence lawyers in the Wisconsin murder trial of teenager Kyle Rittenhouse said they would ask for a mistrial because of a dispute with prosecutors over video evidence.\nThe lawyers made their plan known as jurors ended their second day of deliberations without reaching a verdict.\nThis was after reviewing a series of videos of the teenager’s deadly encounters at racial justice protests last year.\nThe jury spent about 45 minutes on Wednesday watching drone video of the Rosenbaum shooting and other videos of the subsequent shootings of Huber and Grosskreutz.\nLike Zimmerman, Rittenhouse has become a polarizing figure, viewed as heroic by some conservatives who favour expansive gun rights and as a symbol of a reckless American gun culture by many on the left."
  },
  {
    "headline": "BREAKING: Occupants Trapped As Storey Building Collapses In Badagry, Lagos",
    "summarized_story": "On Wednesday, a storey building in the Flour Mills Estate, Magbon, Badagry region of Lagos State collapsed, trapping occupants.\nThis was reported on the Lagos State Fire and Rescue Service’s Facebook page in a statement signed by Margaret Adeseye, Director of the Lagos State Fire and Rescue Service.\nThe statement read, “There has been a reported case of a storey building collapse at Sunny Filled, Flour Mills, Estate, Magbon, Badagry, Lagos.\n“The Lagos State Fire and Rescue Service, Badagry Station had rescued five victims from the under-construction building while concerted efforts are ongoing to rescue remaining trapped victims.\n“However, four adults male have been recovered (unconscious) thus far as the Nigerian Police, Morogbo Division and the Community dwellers are complimenting the efforts of the Lagos State Fire and Rescue Service.”"
  },
  {
    "headline": "Pictorial: Police Take Over APC National Secretariat, Abuja",
    "summarized_story": "Dozens of armed policemen in four patrol vans have taken over the entry and exit points on Blantyre Street where the All Progressives Congress, APC, National Secretariat is located.\nIt was gathered in Abuja, on Wednesday, that the policemen who were complimented by officers of the Department of State Service, are at the location to forestall a possible breakdown of law and order.\nThe Punch learnt that the security officials mobilized in response to security reports about a planned protest by aggrieved APC members against the party leadership to register their displeasure over the conduct of the recently conducted ward, local government and state congresses.\nSee photos below:"
  },
  {
    "headline": "All You Care About Is Tinubu – Aisha Yesufu Slams Lagos Assembly Over Lekki Massacre",
    "summarized_story": "Popular activist, Aisha Yesufu has slammed members of the Lagos State House of Assembly over their alleged indifferent attitude to the End SARS issues.\nAccording to Yesufu, a social activist, the Lagos assembly members have not done enough to show that they are with the Nigerian youths on the issues that emanated from the nationwide protest but are instead pledging allegiance to Bola Tinubu, the national leader of the All Progressives Congress, APC.\nShe said that the lawmakers have remained mute even after the Lagos State Panel of Investigation recently published a report about the Lekki Toll Gate incident.\nAisha, who was at the forefront of the EndSARS protest in October 2020, tweeted, “The thing that hurt me more than the killings at Lekki Toll Gate was how members of Lagos State House of Assembly threw #EndSars protesters under the bus and were practically swearing allegiance to Tinubu.\nAll they cared about was Tinubu.”"
  },
  {
    "headline": "Sani Dangote Buried As Influential personalities Storms Kano",
    "summarized_story": "Sani Dangote, the younger brother of Africa’s richest man who died in US on Sunday has been buried in Kano.\nHe was laid to rest at a cemetery located at No.92 Sarari quarters in Kano, on Wednesday morning.\nThe Chief Imam of Kano Emir’s palace, Sani Muhammad, led the prayer session at Kofar Kudu, Emir’s palace, Kano.\nNotable among them were Kashim shettima of Borno, former Bauchi state governor, Adamu Mu’azu, Borno state Governor, Babagana Umara Zulum, THISDAY Publisher, Nduka Obaigbena; Chairman, BUA Group, Abdussamad Isiyaka Rabiu.\nOther are Director-General, DSS, Yusuf Magaji Bichi; Senate President Ahmad Lawan; former Senate President Bukola Saraki; Governor Abdullahi Ganduje, Emir of Kano, Aminu Ado Bayero, among others."
  },
  {
    "headline": "Breaking: Another tragedy hits Lagos as building collapses, 4 feared dead (PICTURES)",
    "summarized_story": "Yet another building under construction has collapsed in Magbon, Badagry area of Lagos on Wednesday with four persons feared dead.\nFive others were rescued from the rubbles with varying degrees of injury, while efforts are still on to rescue others.\nAlready, rescue operation is ongoing.\nDetails loading…RelatedNo tags for this post."
  },
  {
    "headline": "End in sight for insurgency, banditry – CAS Amao",
    "summarized_story": "Chief of Air Staff Air Marshal Isiaka Oladayo Amao has assured Nigerians that the end of insurgency and banditry is in sight.\n“In the face of challenges at hand, prudency and accountability have been the guiding principle of implementation of budgetary allocations by the Nigeria Air Force,” Amao said.\n“The Air Force and by extension the military generally, deserve commendation from Nigerians as far as war against insurgency and banditry are concerned.\nNULGEMeanwhile, the Nigeria Union of Local Government Employees (NULGE) has demanded the immediate release of 12 of her members in Zaria local government council, Kaduna state, kidnapped since November 8, 2021.\n“You see, the scenario was made worse because of the shutdown of telecommunications in Kaduna state."
  },
  {
    "headline": "Exclusive: Job racketeering sets FCSC, MDAs on edge",
    "summarized_story": "A swathe of alleged fake appointment and recruitment letters in possession of many employment seekers has compelled the setting up of service-wide verification exercise for all officers recruited by the Federal Civil Service Commission (FCSC) from 2013 to 2020.\nBut the FCSC frowned at those letters on the grounds that they did not emanate from them.\nWe are particularly concerned because cases of such fake letters are increasingly embarrassing to the commission.\nTo say the least, it’s terrible.”“We are particularly concerned that it is rampant and the culprits are mostly from the MDAs.\nThe circular FC3171/S.7/T3/101 issued on the 27th of August, 2021, directed all MDAs to carry out the exercise."
  },
  {
    "headline": "US Excludes Nigeria From Religious Violators’ List",
    "summarized_story": "The United States on Wednesday excluded Nigeria from its list of religious violators.\nIn a statement by the US Secretary of State, Antony Blinken, the US blacklisted Russia, China, and eight other countries.\nHe added that “the challenges to religious freedom in the world today are structural, systemic, and deeply entrenched.\nIn 2020, the US placed Nigeria and six other countries on its special watch list of states that had engaged in or tolerated the severe violation of religious freedom, however, the nation was exempted in the 2021 list.\nWednesday’s development comes as a plus ahead of Blinken’s scheduled visit to Nigeria within the week."
  },
  {
    "headline": "Suspected Ambazonian Soldiers From Cameroon Kill 11 In Taraba",
    "summarized_story": "Palpable tension gripped residents of Takum Local Government Area of Taraba State when some suspected Ambazonian soldiers from the Republic of Cameroon stormed the community.\nTakum local government area is a border community between Taraba State and the Republic of Cameroon.\nREAD ALSO: Tension As Woman, Policeman Accidentally Kill Three Persons In AkureHe disclosed that the Ambazonian soldiers first attacked the border community in Cameroon republic before crossing over to Nigeria to unleash mayhem.\n“The Ambazonian separatist soldiers attacked my village Manga which is a border community between Taraba State and Republic of Cameroon in Takum LGA,” he said.\n“My elder brother is the traditional ruler there; they laid ambush and killed him in his palace before proceeding to kill others."
  },
  {
    "headline": "Four Dead, Others Trapped As Another Building Collapses In Lagos",
    "summarized_story": "Four persons have died and five others rescued as a building under construction collapsed in the Badagry area of Lagos State on Wednesday.\nThe Lagos State Emergency Management Agency (LASEMA), confirmed the figures in an update.\n“However, 4 (four) adults male have been recovered (unconscious) thus far as the Nigerian Police, Morogbo Division, and the community dwellers are complementing the efforts of the Lagos State Fire and Rescue Service,” the Director of the Lagos State Fire and Rescue Service, Margaret Adeseye, said about the building located at Sunny Filled, Flour Mills, Estate, Magbon in Badagry.\n﻿In the update, the agency said efforts were ongoing to rescue other people trapped in the building.\nThe development elicited reactions from many quarters with Governor Babajide Sanwo-Olu of Lagos State admitting that “mistakes were made from all angles”."
  },
  {
    "headline": "Vice President Of Dangote Group Sani Buried In Kano",
    "summarized_story": "The Vice President of the Dangote Group, Sani Dangote, has been buried in Kano State.\n﻿The late Sani Dangote died on Sunday, according to a statement by the Dangote Group.\nIn a message to Alhaji Aminu Dantata, the patriarch of the Dantata family, and to the President of the Dangote Group, Aliko, President Buhari described the deceased as an honest business leader with a reputation for integrity.\nPresident Buhari equally prayed to Allah to grant fortitude to the Dantata and Dangote families over the loss.\nThe President of Dangote Group, Alhaji Aliko, and his uncle, Alhaji Aminu Dantata expressed appreciation to the President and prayed in turn for his good health and the success of the administration he leads."
  },
  {
    "headline": "VIDEO: Police Take Over APC National Secretariat In Abuja",
    "summarized_story": "The All Progressives Congress (APC) National Secretariat in Abuja was on Wednesday taken over by dozens of armed policemen in various patrol vans.\nUpon their arrival, the security operatives positioned themselves at the entry and exit points of the secretariat.\nAccording to sources, the policemen stormed the building following a hint that some protesters were planning to stage a march at the premises.\nAs of the time of filing this report, the ruling party was yet to make an official statement regarding the development."
  },
  {
    "headline": "Speaker, Gbajabiamila, appoints Dapo Lam-Adesina as Political Assistant -",
    "summarized_story": "The Speaker of the House of Representatives, Femi Gbajabiamila, has approved the appointment of a former member of the House, Adedapo Lam-Adesina, as his Special Assistant on Political Matters for the South-West.\nDapo Lam-Adesina replaces Ayodeji Joseph, a former lawmaker who served the Speaker as his Political Assistant for the Southwest until his recent appointment as the Managing Director/Chief Executive Officer of the Lagos State Development and Property Corporation.\nThe appointment was announced in a statement by the Special Adviser to the Speaker on Media and Publicity, Lanre Lasisi, titled ‘Gbajabiamila appoints ex-Rep, Adedapo Lam-Adesina, as Special Assistant – Political Matters (South-West).’Adedapo, son of a former Governor of Oyo State, the late Lam Adesina, was a member of the 8th House and represented Ibadan-North East/South-East Federal Constituency of Oyo State.\nHe was also a former Commissioner for Youths and Sport in the State."
  },
  {
    "headline": "Nigeria's unemployment problem needs to be solved from the roots",
    "summarized_story": "The Minister for Labour and Employment, Chris Ngige, has stated that more action is required to address the country’s unemployment crisis.\nNgige said, “We need to solve the problem of unemployment from the roots.\n“There is violence, insecurity, banditry ravaging all of Africa; Nigeria now is getting its turn of the madness.\nFor me as minister, while I thank the German government, ILO, and European Union, we need to do more.\nAlso, 1,700 Nigerians and about 400 of them who are returnees from Germany have benefitted from business startup support."
  },
  {
    "headline": "NRC directs shutdown of train services over warning strike",
    "summarized_story": "The Nigerian Railway Corporation has ordered the suspension of train services between Abuja and Kaduna, Lagos, Ibadan, and Warri due to a strike.\nThe NRC directed district managers to be prepared to shut down train stations plying Abuja-Kaduna, Lagos-Ibadan and Warri-Itakpe routes in the event that workers down tools.\nThe three-day warning strike by workers of the Nigerian Railway Corporation (NRC) is to hold from November 18th to November 20th.\nA letter titled, “Notice and Directive to embark on 3-day warning strike nationwide,” dated November 12th, had been addressed by the District Chairman/Secretary Nigeria Union of Railway workers and Senior Staff Association.\nThe mobilisation for the strike is unprecedented and the entire NRC workers are top gear for the warning strike,” he said."
  },
  {
    "headline": "FG announces possible resumption of flights to UAE",
    "summarized_story": "The federal government has announced the possibility of resuming flights between Nigeria and the United Arab Emirates (UAE).\nNational incident manager of the presidential steering group on COVID-19, Mukhtar Muhammad, said both countries had agreed on the UAE government’s revised travel limits and conditions.\nHe explained that, in order to maintain harmony, the federal government has agreed to the COVID-19 testing requirement imposed by the UAE government in March 2021.\nDirect flights between both countries were suspended in March over issues relating to COVID-19 protocol.\nIn February, Emirates directed Nigerian travellers at the Lagos and Abuja airports to conduct rapid COVID-19 tests before departure, which led to a ban on Emirates flights in Nigeria."
  },
  {
    "headline": "Obasanjo Seeks More Cross Border Trade within Africa",
    "summarized_story": "On the third Day of the Intra-African Trade Fair in Durban, South Africa, ARISE News spoke exclusively to former Nigerian President and Chairman of the Intra-African Trade Forum Advisory Council, Olusegun Obasanjo.\nHe said there is a need for African countries to break free from colonial legacies which have kept countries from trusting and trading more with each other."
  },
  {
    "headline": "“We Already Knew There Was a Massacre” – Falz on #EndSARS Panel Report on Lekki Shooting",
    "summarized_story": "It was supposed to be a hub of peaceful dissent against police brutality, the symbol and the sum of the frustration and crushed hopes of Nigeria’s youth.\nBut the atmosphere changed dramatically when the country’s security forces opened fire on young protestors just over a year ago at the Lekki tollgate in Lagos.\nThe shooting was captured on mobile phones and live-streamed on Instagram, but the Nigerian authorities denied it had ever happened.\nWell now the victims, the journalists and the activists who sought to prove that the security forces shot and killed #EndSARS protestors have been vindicated by the official report into the shooting, which called it a massacre."
  },
  {
    "headline": "Delhi Smog: Schools and Colleges Shut as Pollution Worsens",
    "summarized_story": "Authorities in the India capital, Delhi, have shut all schools and colleges indefinitely amid the worsening levels of air pollution.\nA figure between zero and 50 is considered “good”, and between 51 and 100 is “satisfactory”, according to the the air quality index or AQI.\nThe air turns especially toxic in winter months as farmers in neighbouring states burn crop stubble.\nAnd fireworks during the festival of Diwali, which happens at the same time, only worsen the air quality.\nFollowing the hearing, a meeting was called by Delhi’s Commission for Air Quality Management and emergency measures were announced."
  },
  {
    "headline": "Canada: Deadly Storm Cuts Transport Links Around Vancouver",
    "summarized_story": "A deadly storm described by officials as a once-in-a-century weather event has severed road and rail links around Vancouver, Canada.\nThe woman’s body was found near Lillooet, about 250km (155 miles) from Vancouver, according to the Royal Canadian Mounted Police (RCMP).\nJust complete panic.”The provincial minister of transportation, Rob Fleming, told a news conference it was the “worst weather storm in a century”.\nThousands of homes in British Columbia were evacuated after an “atmospheric river” dumped the region’s monthly rainfall average in just 24 hours.\nEarlier this month, a tornado was spotted in British Columbia – the first time one has been seen in the area in five decades."
  },
  {
    "headline": "Nigeria’s Parliament Intervenes in Diplomatic Row with UAE",
    "summarized_story": "Nigeria’s Senate and the House of Representatives on Tuesday resolved to intervene in the diplomatic row between Nigeria and the United Arab Emirates (UAE) following disagreements between both countries.\nAt the Senate, the decision to wade into the dispute was reached sequel to a point of order by the Minority Leader, Senator Enyinnaya Abaribe, during plenary.\nAccording to Abaribe, Emirates airline then shut down flights to and from Nigeria owing to the disagreement between the airline and the aviation authorities on the propriety of subjecting passengers travelling from Nigeria to emergency COVID-19 protocols.\nElumelu had while moving the motion, noted that Nigeria and the UAE have had a positive diplomatic relationship and in 2009 the UAE established its embassy in Nigeria.\nThe adhoc committees were given four weeks to carry out the exercise and report back to the house."
  }
]