[
  {
    "headline": "At least two dead, 22 injured in Pakistan bomb blast",
    "summarized_story": "At least two people were killed and 22 wounded on Thursday by a bomb blast in a busy shopping district of the Pakistani megacity of Lahore, police and officials said.\n“Initial investigations show that it was a time-controlled device on a motorbike which was the cause of the blast,” Rana Arif, spokesman for Lahore police, told AFP.\nHospital sources and police said two people were killed — including a child — and 22 injured in the blast, which happened in old Lahore’s busy Anarkali shopping district.\nThere was no immediate claim of responsibility, but there have been a series of blasts and attacks against police since December when a truce between the government and Pakistan’s Taliban lapsed.\nTehreek-e-Taliban Pakistan (TTP) — a home-grown movement that shares common roots with the Afghan Taliban — has claimed responsibility for most of those incidents."
  },
  {
    "headline": "Terrorism charge: Nnamdi Kanu never denied IPOB in court, says lawyer",
    "summarized_story": "The leader of Indigenous People of Biafra, Nnamdi Kanu, never denied being the leader of the Igbo nationalist organisation while taking his plea at a Federal High Court in Abuja on Wednesday, his lawyer, Ifeanyi Ejiofor, has said.\nEjiofor said this in a statement on Thursday titled, “Onyendu Mazi Nnamdi Kanu never denied being the leader of IPOB – Let the records be set straight”.\n“For the records, Onyendu Mazi Nnamdi Kanu never denied being the leader of IPOB while taking his plea, but only stoutly denied the fact that IPOB is a terrorist organisation and that being its leader is an offence, which position is well informed.\n“Members of the public should be well guided that the status of the black market order proscribing IPOB is a subject of Appeal in Appeal Number: Appeal No.\n“We do not wish to dwell further on this subject, but be rightly informed that Onyendu Mazi Nnamdi Kanu never denied being the leader of IPOB while taking his plea yesterday.”Copyright PUNCH."
  },
  {
    "headline": "Osinbajo presides NEC maiden meeting in 2022",
    "summarized_story": "By Johnbosco AgbakwuruVICE President Yemi Osinbajo is currently presiding over the first National Economic Council, NEC, meeting in 2022 at the State House Conference Hall (Old Banquet Hall), Abuja.\nThe Council membership includes the Governor of Central Bank of Nigeria (CBN), Godwin Emefiele; Secretary to the Government of the Federation (SGF), Boss Mustapha; Minister of Federal Capital Territory (FCT), Mohammed Bello and the 36 state governors.\nThe NEC meeting is physically attended by some state governors while others are attending virtually from their state capitals.\nA communique is expected to be issued at the end of the meeting after being briefed by relevant government agencies on economic programmes of government.\nThe NEC which meets monthly is constitutionally empowered to advise the President on nation’s economic matters."
  },
  {
    "headline": "China’s common prosperity has African significance by Chu Maoming, China’s Consul General in Lagos",
    "summarized_story": "The phrase common prosperity has gained prominence as China is determined to bring better lives to more people.\nWhat does common prosperity mean?\nGenerations of the CPC’s top leaders attached great importance to common prosperity.\nMore tangible progress toward common prosperity has been listed as one of China’s key long-term targets through 2035 when the country is expected to achieve basic modernization.\nFor common prosperity, China aims to increase the size of middle-income groups and create an olive-shaped income pattern."
  },
  {
    "headline": "Uche Nwosu: HURIWA petitions IGP, DSS, Army, gives PSC 3 days ultimatum to respond",
    "summarized_story": "By Dirisu Yakubu & Fortune EromoseleFrontline civil rights group, The Human Rights Writers Association of Nigeria, HURIWA, Wednesday, petitioned the Inspector-General of Police, Department of State Services, and the Nigerian Army over the arrest of former Deputy Chief of Staff to ex- Imo state governor, Rochas Okorocha, Mr. Uche Nwosu a few weeks ago.\nAddressing newsmen in Abuja, national coordinator of HURIWA, Comrade Emmanuel Onwubiko, gave the Police Service Commission, PSC, three working days to respond to its petition on the sporadic shooting and arrest of Uche Nwosu at an Anglican Church in Imo state.\n“We are sending this petition as one of the most credible civil Rights organizations in the country.\n“Our single formulated prayer is for the Police Service Commission to identify the police operatives who did the unthinkable and terrorist act of invading a Church and shooting sporadically right inside a well populated Church.\n“The Police officers including the Police commissioner of Imo State who confirmed the invasion which he termed ‘arrest’ of Uche Nwosu must be invited by the PSC to clear their names or be dismissed.”VANGUAR NEWS NIGERIA"
  },
  {
    "headline": "Kidnap resurgence: 2023 polls may be a mirage in S-West —Afenifere, YCE",
    "summarized_story": "Both Afenifere and YCE lamented that the South-West has not had it this bad, as regards insecurity.\nAjayi said: “We recall the incessant kidnapping of and attacks on innocent people in Ondo, Ogun, Osun and Ekiti states.\n“Afenifere acknowledged that President Muhammadu Buhari was aware of the security situation going by his recent expressions on the issue.\n“Several orders have been given by Mr President in the recent past just as Nigerians never stopped praying.\nBut it looks as if the more orders are given and prayers are said, the worse our security situation becomes."
  },
  {
    "headline": "2023: ‘Okowa, free to choose successor’",
    "summarized_story": "“Nobody should dictate to Governor Okowa over his successor or the senatorial district to produce the next governor.\n“The issue of a successor is a very serious business, because a bad successor can mismanage the legacies Governor Okowa is labouring to build today.\nAnd I don’t think Governor Okowa in his right sense would allow anybody to handpick a successor for him.\n“Thinking of imposing a successor on Governor Okowa is a joke taken too far.\n“If Governor Okowa accepts the demands coming from high profile politicians over who succeeds him, he would live to regret it."
  },
  {
    "headline": "WHO recommends lifting COVID-19 travel restrictions",
    "summarized_story": "The World Health Organization (WHO) has urged nations to lift or ease COVID-19 travel restrictions.\nNAN reports that WHO said travel restrictions have proven to be of little public health value but detrimental to economic growth.\nOn January 13, the WHO Emergency Committee on International Health Regulations met via video conference to evaluate the latest developments in the pandemic situation across the world.\n“The WHO advised for international traffic to not require proof of vaccination against COVID-19 for international travel as the only pathway or condition permitting international travel given limited global access and inequitable distribution of COVID-19 vaccines,” the statement said.\nThe WHO also urged states to recognise all vaccines that have received WHO authorisation, particularly in the context of international travel."
  },
  {
    "headline": "Adamawa reschedules local govt election for April 9",
    "summarized_story": "Adamawa State has scheduled its local government election for April 9, 2022.\nThe Adamawa State Independent Electoral Commission (ADSIEC) indicated this in the election timetable obtained by our correspondent on Thursday.\nThis is the third date that ADSIEC has fixed in its attempt at organising an election to pick chairmen and councillors for the 21 LGAs of Adamawa State, after first scheduling the election last year for November 27 and then postponing it to December 4 and eventually postponing it indefinitely, citing insufficient resources.\nThe commission has also fixed 14th to 19th February for party primaries at ward and local government levels, while 21st to 25th February is for collection of nomination forms by candidates.\nElection campaigns are billed for the 23rd March to 8th April, leading up to the April 9 fixed for the election proper."
  },
  {
    "headline": "FG’s Social Investment Programme, avenue to enrich few Nigerians – Gov Mohammed",
    "summarized_story": "Governor Bala Abdulkadir Mohammed of Bauchi State has alleged that the Federal Government-funded Social Investment Programme (SIP) is an avenue to enrich a few Nigerians implementing it even though President Muhammadu Buhari has good intentions with it.\nHe declared that since the Federal Government commenced the SIP, Bauchi State had not benefitted from it in any form.\nHe submitted that such laudable people-oriented programmes meant for the benefit of all Nigerians ought not to be politicised.\nWhile speaking on his administration’s economic empowerment programme, Mohammed informed that each of the 20 local government areas in Bauchi State would benefit from the programme.\nDAILY POST reports that so far the governor has launched the economic empowerment programme in 10 LGAs, the latest being Dambam and Misau LGAs."
  },
  {
    "headline": "Autonomy: NULGE President, Ambali makes case for local governments",
    "summarized_story": "The President, Nigerian Union of Local Government Employees (NULGE), Olatunji Ambali, has said there is an urgent need for autonomy for local governments in the country.\nSpeaking at a press conference in Abuja, Ambali suggested that the Independent National Electoral Commission (INEC) should be allowed to conduct local government polls for fair, free and credible elections.\nAmbali emphasized that NULGE was also clamouring for financial autonomy for the councils in order to ensure transparency in its operations.\nHe enjoined state governors to seek God and Nigerians’ forgiveness for allegedly destroying the local government system.\nHe observed that insecurity would not end soon if according to him there is consistent rape of the local government system by cabals and politicians."
  },
  {
    "headline": "Without amending 1999 constitution, 2023 polls will be charade – Pastor Giwa warns",
    "summarized_story": "A Nigerian cleric, Pastor Adewale Giwa, has disclosed that it will be unwise for the country to go into the 2023 general elections without properly amending the 1999 constitution.\nAccording to him, the aspirants that had made their intentions of joining the presidential race should be more concerned about the many lacunas in the 1999 constitution instead of the forthcoming general elections.\nAccording to the pastor, the present challenges facing the country is due to the mistake made by Nigerians in 2015 when a wrong leader was elected.\n“When the truth is lacking in a country, such a country will find it extremely difficult to progress.\n“All those who want to contest ought to have spoken within one voice on the need to look into the 1999 constitution and expunge the irrelevant in it."
  },
  {
    "headline": "Abdulsalami to politicians: watch your words, deeds ahead of 2023 elections",
    "summarized_story": "By Frank Ikpefan and Nicholas Kalu, AbujaA former Head of State Gen Abdulsalami Abubakar (rtd) has cautioned the political class to watch their words and deeds ahead of the 2023 general elections.\nAccording to Gen Abubakar, the political class must realise that the fate of Nigeria lies in their hands.\nThe former Head of State said we must all remember that no one can rule over a nation in ruins.\nAbubakar said: “Our political class must realise that the fate of Nigeria lies in its hands and choose to do good in this moment of history.\n“As they justle for power in the coming elections, all politicians must watch their words and deeds carefully and avoid saying or doing things that will further heat up the polity."
  },
  {
    "headline": "Davido, cousin intensify war of words over Osun 2022",
    "summarized_story": "Popular singer Davido and his cousin, Bamidele Adeleke, have intensified the war of words over the interest of the latter in the Osun 2022 governorship race.\nThe Nation reports the singer had called out Bamidele for challenging his uncle for the governorship ticket of the PDP despite being from the same family.\nDavido also accused his cousin of sponsoring an article about the death of his late mother, Veronica on his governorship ambition.\nRead Also: Davido continues ballistic attack on cousin over Osun Gov ambition- Advertisement -“Worst of all this (Dele) really doing all this from the house my father gave you!\nWe can all follow different paths and still live as one big, happy family,” he said."
  },
  {
    "headline": "Iheanacho cried hard when he was dropped for last AFCON – John Ogu",
    "summarized_story": "Iheanacho cried hard when he was dropped for last AFCON – John OguFormer international John Ogu has revealed how Super Eagles striker Kelechi Iheanacho cried hard when the latter was dropped in the last Africa Cup of Nations (AFCON).\nIn Nigeria’s first game of the AFCON 2021, a superb first-half strike from Iheanacho secured an important 1-0 win for Nigeria in their crunch clash with Egypt in Garoua.\nOgu tweeted: “One person I’m most proud of is Kelechi Ihenacho.\nI remember the last Afcon he was dropped.\nI’m so happy for him Today @67Kelechi”He further said: “Last Afcon we went to, the 3 players who were dropped are buzzing real good in the present Squad – @SemiAjayi, @67Kelechi, @Simon27Moses ."
  },
  {
    "headline": "Six ways to avoid ‘sudden’ slump",
    "summarized_story": "Here are a few tips to adhere to which can help one to avoid slump:- Advertisement -1.\nThe body constantly loses water throughout the day, mostly through urine and sweat but also from regular body functions like breathing.\nAlways check your blood pressureHigh blood pressure is one of the leading causes of sudden cardiac arrest or heart issues.\nHigh blood pressure (also called hypertension) happens when your blood moves through your arteries at a higher pressure than normal.\nThis is why it’s sometimes called “the silent killer.” It is very important to have your blood pressure checked regularly."
  },
  {
    "headline": "Governors tighten grip on APC ahead convention",
    "summarized_story": "Sources said APC governors agreed to recommend two aspirants to the President to avoid rancour.\nA governor, who spoke in confidence, said: “We are working towards a crisis-free national convention, especially the choice of our next national chairman.\n“As governors, we have decided to assist the President and the party by limiting the choices of chairmanship aspirants to two at the national convention.\nThe National Convention will hold on February 26.\nThe secretary said the hearing of complaints arising from the National Convention will be conducted on February 28."
  },
  {
    "headline": "Breaking: Gunmen Lunch Full Scale War On Niger Communities, Kill Scores, Many Abducted, Houses Set Ablaze",
    "summarized_story": "On Tuesday night, the people of Ukuru village in Bobi, Mariga local government area were woken up by the gunmen killing unspecified number of people and Houses, food barns, including other properties were destroyed.\nScores of people, including women and children were abducted during the attack.\nThe Tuesday night attacks is coming barely 48 hours after the gunmen ambushed Joint Security Team in Kwanan Dutse, killing three policemen and two vigilantes while a number of the gunmen were also neutralized.\nEqually in Shiroro local government area, the gunmen also on Tuesday morning went haywire, sacking over 30 villages and displaced over 3,000 people.\nWomen were also said to have been raped in Ajatai in Kwaki community by the gunmen who stormed these communities at about 8:00am on Tuesday."
  },
  {
    "headline": "Kanu: Court awards N1bn damages, orders FG to apologise",
    "summarized_story": "In the suit marked HIH/FR14/2021, Kanu asked the court to compel the respondents to pay him N5 billion in damages as monetary compensation for the “physical, mental, emotional, psychological and other damages” suffered as a result of the alleged infringement on his fundamental rights.\nThe suit also sought an order of injunction restraining the Federal Government from taking any further step in the prosecution of Nnamdi Kanu in Charge No: FHC/ABJ/CR/383/2015 (Federal Republic of Nigeria v. Nnamdi Kanu) pursuant to his unlawful expulsion from Kenya to Nigeria.\nIn a judgment that lasted for an hour, the judge said his court lacked jurisdiction to adjudicate in the applicant’s reliefs Nos.\nJustice Anya said the court was not vested with the powers to adjudicate on matters that took place in a foreign land, far away outside its jurisdiction.\nThe court, therefore, ordered the Federal Government to apologise to Nnamdi Kanu for infringing on his human rights and awarded N1billion as exemplary damages."
  },
  {
    "headline": "2023: South East presidency overdue- Orji Kalu",
    "summarized_story": "From Fred Itua and Kenneth Udeh, AbujaFormer governor of Abia State and Chief Whip of the Senate, Orji Uzor Kalu, yesterday, said the All Progressives Congress (APC) zoning the presidency to the South East in 2023 was overdue.\nAddressing National Assembly correspondents in Abuja, he revealed that the president’s body language supports a power shift to the South East in 2023.\nI told you the only two zones that have not tasted the presidency are the South East and the North East.\nIf they zone it to the South East, I have everything it takes to make a good president.”On the forthcoming convention of APC, Kalu said: “I am expecting very a good convention and a very good atmosphere.\nGovernor of Ebonyi State, Dave Umahi had also met with Buhari to declare his ambition to take over from him in 2023."
  },
  {
    "headline": "Court remands 2 brothers to Kuje prisons over alleged fraud against Arthur Eze",
    "summarized_story": "The two brothers, Eze Onyeka Nnadozie and Eze Olisaebuka Okwuchukwu, were brought to court by the EFCC over a 114-count charge that bothered on theft and fraud.\nThey were also charged along their companies, Berlus Resources Limited, Dym Integrated Resources Lumited and Danmayo Multi-resources Global Limited.\nSome of the property, following court judgements, have been returned to Prince Eze, as their unlawful financial acquisitions also took place at the same time they were paid staff of Prince Eze.\nThe EFCC had recorded successful judgements against the two brothers in different courts over alleged fraud following diligent investigation and prosecution.\nTo authenticate the veracity of their investigation and charges, the EFCC had listed Prince Eze as one of the witnesses in the ongoing trial."
  },
  {
    "headline": "Fuel increase: NLC begins mobilisation for nationwide protest",
    "summarized_story": "By Bimbola OyesolaNigeria Labour Congress (NLC), yesterday, directed all its states organs to intensify mobilisation for next Thursday’s nationwide protest against the Federal Government proposed increase in the pump price of petrol.\nIn the same vein, NLC said its members should be ready to commence a total strike that would shut down the economy from February 1.\nIt equally warned that the strike may come earlier should government go ahead with the announcement of the increase before February.\nThe NLC at its Central Working Committee (CWC) meeting in Lagos, yesterday, said reaction to government announcement’s removal of subsidy on petrol would be spontaneous.\nNLC Vice President, Lateef Oyelekan, said the CWC meeting, the first in the year, was to sensitise and prepare the workers for the action next week."
  },
  {
    "headline": "Upstream Commission Rakes in N175bn from Sale of Marginal Fields",
    "summarized_story": "The new commission further stated that 20 companies which won the bids had partially paid up, among those who won the 57 oilfields.\nMarginal fields are smaller oil blocks typically developed by indigenous companies and have remained unproduced for a period of over 10 years.\nNigeria last conducted marginal field bid rounds in 2003, with 16 of the fields contributing just two per cent to the national oil and gas reserves.\nIn addition, the senators urged the upstream commission to deploy technology in taming oil theft as well as work towards reducing the cost of production per barrel of crude oil.\nThe senate committee, upstream, explained that the PIA remains work in progress, stating that all grey areas in the law will be ironed out in the next set of amendments."
  },
  {
    "headline": "Electoral Bill: Govs Meet, Challenge House to Concur with Senate",
    "summarized_story": "Already, some civil society organisations (CSOs) have rejected the consensus option introduced by the Senate in the amended Electoral Bill.\nChairman, Senate Committee on INEC, Senator Kabiru Gaya, told journalists after plenary that the bill would be transmitted to the president next week.\nIn his presentation, the Senate Leader, recalled that President Muhammadu Buhari, had signified withholding his assent on the Electoral Act No.\nThe statement read: “At today’s plenary, the Senate and House of Representatives recommitted the Electoral Bill 2021, with proposed amendment to Clause 84 dealing with nomination of candidates.\nWe reject the decision of the Senate to introduce a completely new mode of ‘consensus’ as a procedure for candidates’ nomination."
  },
  {
    "headline": "APC: We’re Yet to Zone Party Positions Ahead of Convention",
    "summarized_story": "In the same breath, the immediate past National Secretary of the All Progressives Grand Alliance (APGA), Dr. Sani Shinkafi, has also joined the APC chairmanship race of the party.\nIt concluded that the national convention to elect national officers to the National Executive Committee (NEC) would take place on the 26th, while the National Convention Appeal was scheduled for February 28.\nAgainst this backdrop, the APC leadership has beefed up security at the party secretariat in Abuja as the meeting of the Caretaker/Extraordinary Convention Planning Committee (APC) entered the second day.\nMeanwhile, member of the party from Bayelsa State, Mr. Ambrosini Sambo, has described the alleged zoning of the APC chairmanship to the North West as a plot to destroy the party.\nOn his party, Shinkafi, who just joined the APC chairmanship race, is believed to being sponsored by the Zamfara State Governor, Bello Matawalle."
  },
  {
    "headline": "Court Orders FG, Army to Pay N1bn Compensation, Tender Apology to Kanu over Invasion of His Home",
    "summarized_story": "The court also ordered the Federal Government to issue a written apology to the IPOB leader for violating his fundamental human rights and destroying his home during the military operation code named Python Dance II.\nHowever the Court declined jurisdiction over the issue of the abduction and extradition of the IPOB leader from Kenya, saying that such powers resides with the federal high court.\nThe separatist leader also asked the court to make “an order mandating and compelling the respondents to pay the sum of N5 billion to the applicant” as damages.\nBut Justice Anya said that in awarding N1billon to the applicant, the Court took cognisant of the “examplary and compensatory damages” done to the applicant by the respondents.\nCounsel to the Army, Mr. Amos Tori in his reaction to the judgment said that the army authorities would study the court verdict and respond appropriately."
  },
  {
    "headline": "I Will Clarify from Relevant Agencies FG’s Position on Fuel Subsidy Removal, Says Lai Mohammed",
    "summarized_story": "Deji Elumoye in AbujaThe Minister of Information and Culture, Alhaji Lai Mohammed, has said he will need to consult with relevant agencies to know the exact position of government on whether or not fuel subsidy will be stopped this year.\nWhen asked to clarity the issue since the 2022 budget has no subsidy provision beyond June 2022, the minister said he needed to consult with the relevant government agencies to determine the exact position of the subsidy removal question.\nShe had said: “In our 2022 budget, we only factored in subsidy for the first half of the year.\nBut he also conceded that subsidy was a big burden, noting that a solution had to be found to it.\n“Many of us are very concerned with the recent agitations, protests and many citizens were so concerned, our constituents across the country are very concerned that the federal government will remove the petroleum subsidy."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "Pictures Of Northern Governors Posing With Associate Of Bandits’ Leader, Turji Raise Suspicion",
    "summarized_story": "Some photographs taken in the recent past showing two governors and an associate of notorious bandits’ kingpin, Bello Turji, standing together have raised dusts.\nIn the picture with the suspect, Musa Kamarawa, who has confessed to working with Turji, are the governors of Zamfara and Sokoto, Bello Matawalle and Aminu Tambuwal, and the deputy governor of Sokoto, Mannir Dan Iyya.\nZamfara and Sokoto are two of the North-west states under attacks by bandits in which hundreds of people have been killed and thousands displaced.\nKamarawa was among those first contacted by Mr Matawalle after he was declared governor in 2019, to facilitate a peace accord with bandits, Premium Times reports.\n“Though Bello Turji didn’t accept the peace accord, there were a lot of bandits who turned in their guns and ammunition through Musa (Kamarawa)."
  },
  {
    "headline": "Pictures Of Northern Governors Posing With Associate Of Bandits’ Leader, Turji Raise Suspicion",
    "summarized_story": "Some photographs taken in the recent past showing two governors and an associate of notorious bandits’ kingpin, Bello Turji, standing together have raised dusts.\nIn the picture with the suspect, Musa Kamarawa, who has confessed to working with Turji, are the governors of Zamfara and Sokoto, Bello Matawalle and Aminu Tambuwal, and the deputy governor of Sokoto, Mannir Dan Iyya.\nZamfara and Sokoto are two of the North-west states under attacks by bandits in which hundreds of people have been killed and thousands displaced.\nKamarawa was among those first contacted by Mr Matawalle after he was declared governor in 2019, to facilitate a peace accord with bandits, Premium Times reports.\n“Though Bello Turji didn’t accept the peace accord, there were a lot of bandits who turned in their guns and ammunition through Musa (Kamarawa)."
  },
  {
    "headline": "FUTA students protest ‘extortion, harassment by thugs’",
    "summarized_story": "Some students of the Federal University of Technology, Akure (FUTA) living off-campus on Monday staged a protest over alleged incessant extortion and harassment by suspected thugs and cultists.\nAdvertisementThe protesting students gathered at the road leading to the varsity’s second gate, crippling vehicular and other activities in the area for hours.\nShe said the thugs would ambush and extort male students on their way to classes, while female students were constantly harassed as well.\nAdvertisement“We have two gates, south gate and north gate.\nI stay at south gate and I know how it can be."
  },
  {
    "headline": "Five ways technology can ease stress of back-to-school rush",
    "summarized_story": "There is also taking time out of their busy schedules to help their kids with homework among other things.\nFor parents trying to ease their ‘back to school’ stress, here are five ways that technology can help:AdvertisementSet reminders with Google AssistantSetting reminders is a smart way to remember all the things that are important for school, from lunches to school events.\nParents should however allow their children to generate the answers to their homework questions before searching Google for the answer.\nAdvertisementThere are also a variety of educational videos for children that can help parents tutor children who wish to learn more beyond their school work.\nFamily Link allows parents to set digital rules to help guide their children as they learn and explore online."
  },
  {
    "headline": "Police arrest ‘killer’ of UNIJOS student",
    "summarized_story": "The Plateau state police command has arrested Moses Oko, the alleged killer of Jennifer Anthony, a student of the University of Jos (UNIJOS).\nAdvertisementBartholomew Onyeka, the state commissioner of police, disclosed this on Wednesday while parading the suspect at the command’s headquarters in Jos.\nJennifer, a 300-level student of the institution, was declared missing by her friends on social media in December.\nAdvertisementAccording to him, the suspect had fled the hotel “after commiting the crime.”The commissioner of police said the suspect was arrested in Benue with the help of his father who is a lecturer at UNIJOS.\n“The command in a bid to arrest the perpetrator launched an aggressive manhunt on the suspect and tactically trailed him to Benue State where he was arrested by hawked-eye police operatives of the Command."
  },
  {
    "headline": "Kaduna asks public schools to adopt four-day work week",
    "summarized_story": "The Kaduna government has directed all public schools in the state to migrate to the four-day working week.\nSchools are set to reopen on January 10 for the second term of the 2021/2022 academic session.\nThe Kaduna government, on December 1, 2021, began its pre-announced transition to a four-day work week.\nLawal, in her recent notice, asked public schools in the state to adjust to the new system.\nAdvertisementShe advised members of the school security committee to ensure proper monitoring of security apparatus."
  },
  {
    "headline": "BBNaija’s Omashola expecting first child with fiancée",
    "summarized_story": "Omashola Oburoh, former Big Brother Naija (BBNaija) housemate, has announced he is expecting his first child with his fiancée.\nAdvertisementThe reality TV star and actor broke the news in an Instagram post on Thursday.\nHe also accompanied the post with a video clip of an ultrasound scan carried out on his partner at an undisclosed health facility.\nThe BBNaija star expressed his excitement at being a potential father.\nAdvertisement“All these years I was thinking my pee pee don’t work, finally we got a very long leg start,” he wrote."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How Moni Africa leverages social trust to finance mobile money agents",
    "summarized_story": "Get the best African tech newsletters in your inboxFollowing a conversation in November 2020 with a cluster of mobile money agents in the Shapati community in Lekki-Ajah, Lagos, one thing was clear to Iromini: liquidity is a major challenge plaguing the mobile money ecosystem.\nThe startup instead leverages an algorithm developed around social trust and social underwriting that’s seen the platform achieve a highly impressive repayment rate.\nMoni Africa claims its revenue has grown 50% month-on-month so far and most of its agents, about 70% of which are women, have grown their businesses by 3x.\nIts 0.1% default rate, according to the CEO, can be attributed to the platform’s community-based model and interest rate which supports the unit economics of a mobile money agent.\nIn the long run, the startup plans to expand its community-finance model beyond mobile money agents to different SMEs across Africa."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "Nigeria’s new deal with Twitter is not a win for the government or citizens",
    "summarized_story": "Nigeria’s new deal with Twitter is its government’s most recent effort to control social media.\nAccording to Twitter’s Transparency Report—a report that gives insights into information and removal requests from around the world, by country—Nigeria has made zero removal requests and just 7 information requests, at the time of reporting.\nHowever, India has made 12,435 legal removal requests, 67 court orders, and 12,368 other legal demands, representing 6% of global removal requests.\nIn February last year, India’s government enacted a fresh social media rule that made social media companies like Facebook, WhatsApp, Twitter, and others more accountable to legal requests.\nBut Sesan says Nigeria’s internet restriction tactics are miles behind India’s because the latter drew up regulations; Twitter will only respond to legal requests backed by legislation."
  },
  {
    "headline": "Ghana Plots to Become West Africa’s Gas Hub in threat to Nigeria",
    "summarized_story": "Ghana Plots to Become West Africa’s Gas Hub in threat to NigeriaGhana’s state-owned oil company is progressing with plans to sell liquefied natural gas throughout West Africa in a move that will test Nigeria’s dominance and her failure to better position the country’s energy credentials.\nGNPC is working with partners interested in building infrastructure to sell LNG to domestic users and those within the sub-region looking to boost power, Ussif said.\nInvestments in offshore debt securities sold by foreign governments, companies and multilateral development banks can be used as collateral for loans, the central bank said.\nCredit in West Africa’s second-biggest economy expanded at about 6.7% in the first 10 months of 2021, the slowest pace in three years as the pandemic decimated demand.\nLenders must desist from accepting debt securities issued by their local or international affiliates, the regulator said."
  },
  {
    "headline": "Fuel Subsidy: NEC to consider N302/litre new pump price",
    "summarized_story": "The National Economic Council (NEC) has begun meeting in Abuja to consider reports of its adhoc committee which recommended a N302 per litre price for Premium Motor Spirit (PMS) popularly known as petrol.\nThe meeting which is currently ongoing, is being chaired by Vice President Yemi Osinbajo.\nThe Governors who have expressed their displeasure over the continued funding of fuel subsidy projected at N150bn monthly, see such expenditure as a drain on the federation accounts.\nThe NEC adhoc committee which is headed by Vice President Yemi Osinbjo had received and reviewed the report recommending N302 /liter , as against the current N162/N165/ liter, at a virtual meeting of the adhoc committee, in preparations to the full NEC meeting during the week.\nIt was gathered that although a sub committee of the National Economic Council NEC, had made a recommendation that the new fuel pump price be pegged at N302 per liter."
  },
  {
    "headline": "Naira to face pressure on low oil output, rising interest rates",
    "summarized_story": "Economists have said the devaluation of Nigeria’s currency, naira, is inevitable in 2022 as lower oil production puts pressure on the nation’s reserves.\nOverall, our baseline expectation is that the CBN will devalue the naira between N440/$ and N460/$ at the I&E Window,” the analysts said.\n“We also see interest rates going higher in countries like Ghana, Kenya, and Zambia, but Nigeria will be able to hold the line and support recovery despite weak naira,” Brice said.\nWe see the I&E window FX rate at N482/$1 in 2022.”The bleak outlook for the naira does not stop there.\nThe naira exchanged at N414 per dollar on Wednesday at the official market, according to data from trading platform, FMDQ."
  },
  {
    "headline": "Tipper drivers protest killing of colleague by security personnel in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Angry tipper drivers protested the killing of their colleague by security personnel alleged to be operative of the Department of State Services (DSS) in Benin City.\n“And before a blink of eye, the DSS operatives opened fire which resulted in the death of a tipper driver.\nThe development caused heavy gridlock in the Benin metropolis as other drivers protested the death of their colleague.\nThe source said the hoodlums, upon sighting the DSS operatives, pounced on them with guns and various dangerous weapons.\nThe DSS source said its operatives sustained varying degrees of injuries during the attack while their vehicles were also damaged."
  },
  {
    "headline": "Diaspora group lite up Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – As part of efforts to contribute to the development of Abudu, a group under the aegis of Abudu in Diaspora Group has commenced installation of about 250 solar streetlights in the community.\n“We (Abudu in diaspora group) are responsible for the Abudu lighting up project; our motive was to help our people back home at Abudu.\n“When we use to stay in Abudu, people come from outside the state to come and stay in Abudu.\nWe have other projects, and we hope at least we should be able to do one project every year in the community.\nthe solar streetlights project is just a starting point for things to come”."
  },
  {
    "headline": "Nation Blue Economy: Vice President Seeks Stakeholders Participation, Inaugurates Expanded Committee – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Vice President, Prof Yemi Osinbajo has sought for wider participation of relevant stakeholders in the blue economy project to deepen participation and benefits of Nigerians from the country’s marine resources.\nOsinbajo made the call at the inaugural meeting of an Expanded Committee on Sustainable Blue Economy in Nigeria in the Presidential Villa recently.\nAccording to him, a viable blue economy project will offer vista of opportunities not only for littoral states where there are bodies of waters but for the entire country.\n“Countries have to define the scope of their blue economy based on their priorities.\nIn his opening remark, Transportation Minister, Rotimi Amaechi said the blue economy is capable of improving government revenue, create employments and grow the gross domestic product of Nigeria."
  },
  {
    "headline": "2023 Presidency: I’m capable but not desperate to lead Nigeria – Orji Kalu – Nigerian Observer",
    "summarized_story": "Kalu stressed that his visit to President Buhari was a usual one adding that their relationship has spanned for years before he became President.\nI have said before that there are only two zones that have not been President : the Southeast and the Northeast.\n“It’s overdue for an Igboman to become a Nigerian President, I believe the Southeast should produce the next President and it’s going to happen ”.\nWhen asked about President Buhari’s body language to the contentious electoral act and 2023 Kalu responded saying “He’s body language is where other Nigerians are .\nThe Governor of Ebonyi State, Dave Umahi had also met with Buhari to declare his ambition to take over from him in 2023."
  },
  {
    "headline": "Tinubu tenders apology for falsely claiming voters cards have expired",
    "summarized_story": "Presidential aspirant and former governor of Lagos State, Bola Tinubu has tendered an apology for claiming the permanent voter cards (PVCs) issued by the Independent National Electoral Commission (INEC) have expired.\nWhile addressing some women leaders who paid him a visit in Abuja, the presidential aspirant said the PVCs in the possession of citizens have expired.\n“In case they do not announce to you on time, the PVC you have has expired,” Tinubu had said.\n“Take one family member, two family members, knock on all doors and make sure that the new registration… Because they may not announce to you on time.\nHe urged them to continue to mobilise voters to update their PVCs and help thwart the prevailing voter-apathy.”"
  },
  {
    "headline": "Wike orders council chairmen to destroy illegal refineries over Port Harcourt soot",
    "summarized_story": "Governor of Rivers State, Governor, Nyesom Wike has given chairmen of local governments in the state orders to destroy all illegal refineries in their domains as part of the ongoing war to stop the spread of soot.\nWike who received a comprehensive list of all illegal refineries in the state from chairmen of the 23 local government areas of the state, asked them to hire bulldozers and destroy all identified illegal refineries in Rivers.\nThe governor asked the Commissioner of Police, Eboka Friday, to provide adequate security for the chairmen during the operations.\nThe governor had earlier issued a 48-hour ultimatum to the 23 chairmen to provide him with a comprehensive list of all illegal refinery sites and their operators within their respective jurisdiction.\nAll those areas where the illegal refinery sites are in the bush, in the creek, clear the place."
  },
  {
    "headline": "Good governance key to sustainable development – Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Adegboyega Oyetola, has said that good governance is key to sustainable socioeconomic development in every polity.\nOyetola said this during an engagement programme organised by the State’s Civic Engagement Centre on Wednesday at Eti-Oni Asalu, Oriade South LCDA.\nHe noted that his administration would continue to uphold the pace of good governance in both ideas and principles, especially in the area of infrastructural and human capital development.\nThe governor said that the importance of good governance, consistency of policies, reforms and sustainable economic growth could not be overemphasized in achieving a virile polity to positively impacts the masses.\nHe said, “the current administration has equally recorded a plethora of giant strides and achievements in critical sectors such as infrastructure, health, security, education, social welfarism among others."
  },
  {
    "headline": "Ebonyi guber aspirant, Nwonu promises human capital devt, scholarships, others",
    "summarized_story": "A member of the House of Representatives and a leading aspirant for Ebonyi State governorship ticket on the platform of the People’s Democratic Party, Rt.\nAnayo Edwin Nwonu, has promised to pursue human capital development if he is elected into office as governor in 2023.\nThe lawmaker who spoke to journalists in Abakaliki, the Ebonyi State capital on Tuesday, stated that his developmental priorities would include the restoration of scholarships for Ebonyi Youths, revamping of the Education Sector, improvement in the healthcare delivery system and a full return to a functional and effective local government system in the state.\nOther priorities of his administration, according to him, include the restoration of the statutory rights and benefits of civil servants and local government staff, restoration of civil service ethics, conducive environment for enterpreneurship, mechanized agriculture and mass employment for Ebonyi Youths.\nNwonu expressed confidence that Nigeria will return to the part of progress if his party, the PDP, returns to power at the federal level in 2023, that democracy in the country would experience a major boost when the party takes over the reigns of power in Aso Rock."
  },
  {
    "headline": "Convention: APC Denies Zoning National Chairmanship, Others",
    "summarized_story": "The All Progressives Congress (APC) has refuted report in the media suggesting that it has zoned the party’s national chairmanship to the North Central.\nThe party’s Caretaker/Extraordinary Convention Planning Committee (CECPC) denied releasing zoning arrangement for the national convention slated for February 26, 2022.\nThe committee, after its 19th regular meeting, which lasted for two days, released the timetable and schedule of activities for the convention of the party.\nAddressing journalists after Wednesday’s meeting held at the party’s national secretariat, the secretary of the caretaker committee, Senator John James Akpanudoedehe, said at no time did the committee discuss the zoning arrangement for the National Convention.\nWe are yet to meet on the issue of zoning."
  },
  {
    "headline": "INEC Tackles Tinubu, Says PVCs Don’t Expire",
    "summarized_story": "The Independent National Electoral Commission (INEC) has reacted to claims by a national leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu, on the validity of the Permanent Voter’s Cards (PVCs), saying the current PVCs have not expired.\nTinubu while hosting some of his supporters, had claimed that there had been a decline in the number of eligible voters in recent times because PVCs have expired.\nOyekanmi stressed that double registration is an offence under the electoral law.\nHe said, “In fact, double registration is an offence under our laws.\nOnce a name appears on the National Register of Voters, it stays there permanently."
  },
  {
    "headline": "FedPoly Ohodo ‘ll Drive Industrial Dev’t In South-East – Council Chair",
    "summarized_story": "The chairman, Governing Council of Federal Polytechnic, Ohodo, EnuguState, Silva Ameh, has said that the newly established higher institution will drive industrial development in the southeast region.\nHe said the institution is an entrepreneurial polytechnic and will beactive in applied teaching and learning, theory and research that areessential to the future society, business and industry.\n“The polytechnic must become an engine for the southeast regionaleconomic development.\nADVERTISEMENT“I dare say that the establishment of the Ohodo Polytechnic is anopportunity for the South-eastern Region to become an Economic andIndustrial Hub, especially for agricultural equipment and alliedimplements.\nWhile congratulating other members of the council and principalofficers of the polytechnic, he charged them to remain focus on thegoal of the institution to promote economic growth and technologicaldevelopment."
  },
  {
    "headline": "FedPoly Ohodo ‘ll Drive Industrial Dev’t In South-East – Council Chair",
    "summarized_story": "The chairman, Governing Council of Federal Polytechnic, Ohodo, EnuguState, Silva Ameh, has said that the newly established higher institution will drive industrial development in the southeast region.\nHe said the institution is an entrepreneurial polytechnic and will beactive in applied teaching and learning, theory and research that areessential to the future society, business and industry.\n“The polytechnic must become an engine for the southeast regionaleconomic development.\nADVERTISEMENT“I dare say that the establishment of the Ohodo Polytechnic is anopportunity for the South-eastern Region to become an Economic andIndustrial Hub, especially for agricultural equipment and alliedimplements.\nWhile congratulating other members of the council and principalofficers of the polytechnic, he charged them to remain focus on thegoal of the institution to promote economic growth and technologicaldevelopment."
  },
  {
    "headline": "EFCC Arrests 8 For Internet Fraud In Benue",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission (EFCC), have arrested eight suspects for alleged involvement in computer-related fraud in Markudi, Benue State.\nThe suspects are: Okoha Chinedu Charles, Chibuizor Philip Nnake, Emmanuela Odeh Eneokpe, Ushir Terhile John, Okoro Ossico Osaro, Ejiofor Chibuizor, Wandoo Juliet Baru and Tarbee Destines.\nEFCC spokesperson, Wilson Uwujaren, who confirmed the arrest, said the suspects were arrested on Wednesday, January 19, 2022 during an operation by operatives of the Commission in the State capital.\nHe also said the suspects will be charged to Court as soon as investigations were concluded.\nAfter carrying out this fraudulent act, the defendant absconded from his duty post to Plateau State where he was eventually arrested by operatives of the Commission."
  },
  {
    "headline": "Full text: Remarks by Lai Mohammed at the signing of cultural property implementation act with US",
    "summarized_story": "By GBENGA ADEOLAREMARKS BY THE HONOURABLE MINISTER OF INFORMATION AND CULTURE, ALHAJILAI MOHAMMED, AT THE SIGNING OF THE CULTURAL PROPERTY IMPLEMENTATIONACT (CPIA) AGREEMENT BETWEEN NIGERIA AND THE UNITED STATES OF AMERICAIN ABUJA ON THURSDAY, 20 JANUARY 2022PROTOCOLGood morning.\nIt’;s my pleasure to welcome you all to this importantlandmark event, which is the signing of the Cultural PropertyImplementation Act (CPIA) between Nigeria and the United States ofAmerica.\nThestolen artifacts are mostly smuggled to Europe, the United States ofAmerica and other places for the benefit of art collectors.\nThis legislation was enacted by the United States to restrict theimportation into the US of archeological materials ranging in datefrom 1500 B.C.\nWe want to most sincerely thank the Government of the UnitedStates, in particular the Embassy of the United States in Nigeria, formaking this possible."
  },
  {
    "headline": "Full text: Remarks by Lai Mohammed at the signing of cultural property implementation act with US",
    "summarized_story": "By GBENGA ADEOLAREMARKS BY THE HONOURABLE MINISTER OF INFORMATION AND CULTURE, ALHAJILAI MOHAMMED, AT THE SIGNING OF THE CULTURAL PROPERTY IMPLEMENTATIONACT (CPIA) AGREEMENT BETWEEN NIGERIA AND THE UNITED STATES OF AMERICAIN ABUJA ON THURSDAY, 20 JANUARY 2022PROTOCOLGood morning.\nIt’;s my pleasure to welcome you all to this importantlandmark event, which is the signing of the Cultural PropertyImplementation Act (CPIA) between Nigeria and the United States ofAmerica.\nThestolen artifacts are mostly smuggled to Europe, the United States ofAmerica and other places for the benefit of art collectors.\nThis legislation was enacted by the United States to restrict theimportation into the US of archeological materials ranging in datefrom 1500 B.C.\nWe want to most sincerely thank the Government of the UnitedStates, in particular the Embassy of the United States in Nigeria, formaking this possible."
  },
  {
    "headline": "Costa Rica 2022: Falconets arrive Douala for clash with Cameroon’s Lionesses",
    "summarized_story": "By EPHRAIM NWOSUNigeria’s U20 Girls, Falconets will fly into the city of Douala on Thursday ahead of a FIFA U20 Women’s World Cup, fourth round, first leg encounter against their Cameroonian counterparts, scheduled for Saturday, 22nd January at the Stade Japoma.\nThis fixture, being the penultimate round of the qualification series, is guaranteed to produce fireworks in both legs, with the eternal rivalry between Nigeria and Cameroon being the strongest undertone in the narrative.\nCoach Chris Danjuma has again stuck to his regulars in a 23-woman squad that will travel by Asky Airline and arrive in Cameroon’s commercial capital on Thursday evening.\nThe return leg will take place at the Mobolaji Johnson Arena, Lagos on Saturday, 5th February.\nFALCONETS FOR CLASH WITH CAMEROON IN DOUALA:Goalkeepers: Nelly Ekeh (Sunshine Queens); Monle Oyono (Bayelsa Queens); Inyene Etim (Abia Angels)Defenders: Oluwatosin Demehin (Rivers Angels); Omowunmi Oshobukola (Edo Queens); Rofiat Imuran (Rivers Angels); Jumoke Alani (Edo Queens); Motunrayo Ezekiel (Naija Ratels); Oluwabunmi Oladeji (Nasarawa Amazons); Oluchi Ohaegbulem (Confluence Queens)Midfielders: Bashirat Amoo (Nasarawa Amazons); Esther Onyenezide (FC Robo Queens); Yina Adoo (Nasarawa Amazons); Chidinma Ogbuchi (FC Robo Queens); Chinyere Kalu (Nasarawa Amazons); Anuoluwapo Salisu (Bayelsa Queens)Forwards: Joy Jerry (Bayelsa Queens); Mercy Idoko (Nasarawa Amazons); Flourish Sebastine (Bayelsa Queens); Taiwo Lawal (FC Robo Queens); Precious Vincent (Bayelsa Queens); Blessing Okpe (Rivers Angels); Blessing Nkor (Sunshine Queens)Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Costa Rica 2022: Falconets arrive Douala for clash with Cameroon’s Lionesses",
    "summarized_story": "By EPHRAIM NWOSUNigeria’s U20 Girls, Falconets will fly into the city of Douala on Thursday ahead of a FIFA U20 Women’s World Cup, fourth round, first leg encounter against their Cameroonian counterparts, scheduled for Saturday, 22nd January at the Stade Japoma.\nThis fixture, being the penultimate round of the qualification series, is guaranteed to produce fireworks in both legs, with the eternal rivalry between Nigeria and Cameroon being the strongest undertone in the narrative.\nCoach Chris Danjuma has again stuck to his regulars in a 23-woman squad that will travel by Asky Airline and arrive in Cameroon’s commercial capital on Thursday evening.\nThe return leg will take place at the Mobolaji Johnson Arena, Lagos on Saturday, 5th February.\nFALCONETS FOR CLASH WITH CAMEROON IN DOUALA:Goalkeepers: Nelly Ekeh (Sunshine Queens); Monle Oyono (Bayelsa Queens); Inyene Etim (Abia Angels)Defenders: Oluwatosin Demehin (Rivers Angels); Omowunmi Oshobukola (Edo Queens); Rofiat Imuran (Rivers Angels); Jumoke Alani (Edo Queens); Motunrayo Ezekiel (Naija Ratels); Oluwabunmi Oladeji (Nasarawa Amazons); Oluchi Ohaegbulem (Confluence Queens)Midfielders: Bashirat Amoo (Nasarawa Amazons); Esther Onyenezide (FC Robo Queens); Yina Adoo (Nasarawa Amazons); Chidinma Ogbuchi (FC Robo Queens); Chinyere Kalu (Nasarawa Amazons); Anuoluwapo Salisu (Bayelsa Queens)Forwards: Joy Jerry (Bayelsa Queens); Mercy Idoko (Nasarawa Amazons); Flourish Sebastine (Bayelsa Queens); Taiwo Lawal (FC Robo Queens); Precious Vincent (Bayelsa Queens); Blessing Okpe (Rivers Angels); Blessing Nkor (Sunshine Queens)Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari lands in Kaduna straight from Banjul [photos]",
    "summarized_story": "President Muhammadu Buhari has arrived Kaduna to begin a two-day official visit.\nWhile in Kaduna, Buhari will inaugurate road projects and other facilities executed by the state government, including the Dangote Peugeot Automobile Nigeria Limited.\nThe visit will take Buhari to Zaria, Kafanchan and the capital, Kaduna, where projects have been listed for commissioning.\nAccording to Muyiwa Adekeye, special adviser on media to Governor El-Rufai, the key projects include the re-modelled Murtala Muhammed Square, Infectious Disease Hospital all in Kaduna.\nThe list also included 19 road projects in Kaduna, Zaria and Kafanchan towns."
  },
  {
    "headline": "Medvedev passes Kyrgios test, Murray, Raducanu out",
    "summarized_story": "Russian World Number Two Daniil Medvedev moved into the third round of the Australian Open on Thursday, beating home favourite Nick Kyrgios in four sets 7-6 6-4 4-6 6-2.\nAn inspired Kyrgios forced a break of serve in the third set to take the match into the fourth.\nA double break in the fourth set made it look easy for last year’s Australian Open finalist.\nDaniel won 6-4 6-4 6-4..\nA tough loss for me, that’s for sure,” Murray said after the 6-4 6-4 6-4 defeat to the world number 120."
  },
  {
    "headline": "Vigilantes Arrest Four Bandits Plotting To Kidnap On Lagos-Ibadan Expressway",
    "summarized_story": "Vigilantes Arrest Four Bandits Plotting To Kidnap On Lagos-Ibadan ExpresswayFour Fulani bandits were apprehended by local security operatives and vigilantes as they attempted to kidnap travelers on the Lagos-Ibadan Expressway.\nThe security personnel said in a video seen by SaharaReporters on Thursday that they initiated a manhunt for the assailants after a series of abductions on the ever-bustling road.\nThe culprits were allegedly apprehended within a forest along the Lagos-Sagamu junction near a hamlet called Lufape before the Redeemed Christian Church of God Camp in Ogun State, according to the footage.\nAbdullahi, Abubakar, Ibrahim, and Mohammed were the bandits’ names.\nThe perpetrators were found with deadly weapons like as filled magazines and guns, according to local security officers who talked in Yoruba."
  },
  {
    "headline": "INSECURITY: Nigeria Defence Chief Irabor Announces New Military Approach",
    "summarized_story": "General Lucky Irabor, the Chief of Defence Staff (CDS), says the Armed Forces of Nigeria (AFN) is pursuing a new approach to combat instability.\nIrabor, as part of measures to sustain progress and successes, said the military had adopted “the whole-of-society approach” to solve challenges.\nThe Defence Chief noted that the youths could play a pivotal role in advancing the course of national security.\n“Engaging the youths is practically making them become part and parcel of the fabric of stability of the society towards enhancing national security,” he said.\nIrabor listed national security components as freedom from dangers and threats, a country’s ability to defend, develop, promote core values and legitimate interests, as well as the wellbeing of the people."
  },
  {
    "headline": "Nnamdi Kanu Denied Being An IPOB Member – Buhari Govt",
    "summarized_story": "Nnamdi Kanu has denied being a member of the Indigenous People of Biafra, or IPOB, according to the Nigerian government.\nShuaibu Labaran, counsel to the Federal Government, said Kanu “vehemently” denied being a member of the proscribed pro-Biafra group.\nHe disclosed this while speaking with journalists after yesterday’s court proceedings at the Federal High Court sitting in Abuja.\nAccording to Labaran: “One of the charges suggested that the defendant, Nnamdi Kanu is a member of IPOB and he vehemently denied being a member of IPOB.\nKanu is locked up in the custody of the Department of State Services, DSS, following his re-arrest and repatriation from Kenya in June 2021."
  },
  {
    "headline": "Photos As Ogbomoso Residents Hold Candle Night For Former Oyo Governor Alao Akala",
    "summarized_story": "Photos As Ogbomoso Residents Hold Candle Night For Former Oyo Governor Alao AkalaHundreds of citizens of Ogbomoso, Oyo State, planned a candle night march on Wednesday in honor of Chief Christopher Adebayo Alao-Akala, a former governor of the state.\nNEWS DIRECT reports that Alao-Akala is an indigene of Ogbomoso, the second largest city in the State.\nHe was the governor of the State between 2007 and 2011.\nTo pay their last respect for the former governor, youths, women and men in their hundreds organized a candle night procession in honor of the former governor.\nThey described the former Governor as someone whose legacies cannot be forgotten in a hurry."
  },
  {
    "headline": "Breaking: Unknown tennis player sends Andy Murray out of Australian Open",
    "summarized_story": "Britain’s former world number one Andy Murray produced a subdued display as he was beaten by Japan’s Taro Daniel in the Australian Open second round.\nMurray lost 6-4 6-4 6-4 to qualifier Daniel – ranked below him at 120 in the world – on John Cain Arena.\nMurray had never previously lost a Grand Slam match to an opponent ranked as low as 28-year-old Daniel.\nFor Daniel, victory meant he reached the third round of a major for the first time in his career.\nMurray shot a disconsolate look towards his box after Daniel clinched victory with a crisp backhand volley on his first match point."
  },
  {
    "headline": "When experts brainstormed at FirstBank ‘s Economic Outlook 2022 Webinar",
    "summarized_story": "First Bank of Nigeria Limited recently hosted Nigeria’s Economic outlook webinar for 2022.\nAMAKA IFEAKANDU who monitored the event virtually, looks at the variables expected to shape the nation’s economy and boost the economic growth of the country in 2022.\nFirst Bank of Nigeria Limited, Nigeria’s premier and leading financial services provider recently hosted Nigeria’s economic outlook webinar to set the tone for the domestic and global economic activities that would shape the nation’s economy in the 2022 financial year.\nOther GDP projectionsBefore the announcement of the programme, the Central Bank of Nigeria in its 2022 economic outlook presented by its governor, Godwin Emefiele, projected the nation’s GDP growth by 3.2 per cent.\nThey admitted that investment in real estate, ICT, financial services sector, construction Industry, agriculture and manufacturing among others, would contribute to economic growth."
  },
  {
    "headline": "Electoral Act Amendment Bill: CSOs slam Senate’s consensus option, Bill remains in limbo",
    "summarized_story": "Political parties are left with whichever options they prefer according to their realities.\nMany of those in power and can engineer a consensus, want indirect primaries while those out of power or the corridors hope for some luck with direct primaries.\n“I know an ex-governor who favoured indirect primaries while in power, but now campaigns for direct primaries.\nThose who argue that direct primaries would be too expensive have not told Nigerians why and what is considered too expensive.\n“For instance, how much did direct party primaries cost in the Lagos State gubernatorial primaries viz-a-vis indirect primaries in many states?"
  },
  {
    "headline": "Electoral Act Amendment: NGF Commends Senate, Asks Reps To Include Consensus Option",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) has commended the Senate for re-amending the Electoral Act Amendment Bill giving room for direct, indirect, and consensus options for nominating candidates for the various political parties in the country.\nThey commended the Senate for amending clause 84 regarding the mode of candidate selection in the Electoral Act Amendment Bill.\nThe state governors also discussed issues as regards the nation’s security challenges, health, food security, among others.\nGovernors at the meeting include the NGF Chairman and Ekiti State Governor, Kayode Fayemi; Kano State Governor Abdullahi Ganduje; Nasarawa Governor Abdullahi Sule; Anambra Governor Willie Obiano; Oyo State Governor Seyi Makinde and Osun State Governor Gboyeba Oyetola.\nHowever, unlike their counterparts in the Senate, the Reps adopted direct and indirect primaries but expunged the option of consensus candidature."
  },
  {
    "headline": "Operation Safe Haven Trains Civilian Joint Task Force In Southern Kaduna",
    "summarized_story": "In a bid to curb the incessant banditry activities in southern Kaduna, Operation SAFE HAVEN graduated 98 youths trained on surveillance and information gathering on Wednesday.\nThe graduation ceremony, which took place at Headquarters Sector 7 Kafanchan, saw youths selected from all the communities and ethnic groups in southern Kaduna passed out in a colourful graduation ceremony.\nSpeaking to the grandaunts, the Commander Operation SAFE HAVEN, Major General Ibrahim Ali, charged the youths to distance themselves from sentiment and discharge their duty without fear or favour.\nSpeaking earlier, Commander Sector 7, Operation SAFE HAVEN, Colonel Timothy Opurum, noted that the training of the youths was necessary considering the importance of peace to development.\nThe highlight of the graduation ceremony was a march past parade and light combat demonstration by the grandaunts to the admiration of the Commander Operation SAFE HAVEN."
  },
  {
    "headline": "13 Civil Groups Reject Senate’s Inclusion Of Consensus Option In Electoral Bill",
    "summarized_story": "Thirteen Civil Society groups have rejected the introduction of consensus as a mode for the nomination of candidates seeking election into public offices in the Electoral Act Amendment Bill.\nThe groups faulted the action of the Senate in a statement jointly signed by them on Wednesday, hours after the lawmakers modified the proposed amendments to the Electoral Act.\n“We reject the decision of the Senate to introduce a completely new mode of “consensus” as a procedure for candidates’ nomination,” the statement read.\n“The consensus mode is antithetical to democratic principles and will result in the subversion of popular will.\n“At today’s plenary, the Senate and House of Representatives recommitted the Electoral Bill 2021 with the proposed amendment to Clause 84 dealing with the nomination of candidates."
  },
  {
    "headline": "Lagos Govt Acquires Two New High-Speed Trains",
    "summarized_story": "﻿The Lagos State government has acquired two new high-speed trains for its Red Line rail project, as part of efforts to improve traffic management and transportation.\nWe have seen our beautiful white and red trains.\nCoincidentally, the rail line is called Red Line and you can see they have given us the colour.\nThe acting Milwaukee Mayor, Cavalier Johnson, who received Governor Sanwo-Olu in the city, said “It is a little bittersweet.\nGovernor Sanwo-Olu was accompanied by the Lagos State Commissioner for Transportation, Dr Frederic Oladeinde; his Special Adviser on Works, Aramide Adeyoye, and Managing Director of Lagos Metropolitan Area Transport Authority (LAMATA), Abimbola Akinajo."
  },
  {
    "headline": "Australian Open Under Pressure Over ‘Optional’ COVID-19 Tests",
    "summarized_story": "The Australian Open was under growing pressure Thursday to make Covid tests mandatory after leading players questioned the seemingly lax policy and the Grand Slam got its first positive case.\nTennis Australia (TA), which organises the Australian Open, said players were encouraged to test themselves regularly but it was only mandatory if they had symptoms.\nZverev’s remarks threw another spotlight on Covid policies at the Australian Open, which were already under scrutiny following the saga of deported defending champion Novak Djokovic.\nWomen’s third seed Garbine Muguruza called testing for players an “optional thing”.\nAll players at the Australian Open have to be vaccinated or have a medical exemption — a rule central to the deportation of the unvaccinated Djokovic."
  },
  {
    "headline": "Asiwaju Tinubu charges Nigerians to collect PVC's",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu received APC women leaders across the country including the Federal Capital territory where he charged them to unite and go all out to collect their PVCs for them to be able to exercise their civic right during the forthcoming election.\nThe women say the visit was to affirm their support for Bola Tinubu’s 2023 Presidential ambition.\nAdvertisement"
  },
  {
    "headline": "APC Sets February 26th for its National Convention -",
    "summarized_story": "Nigeria’s governing party, the All Progressives Congress, has set 26th of February as the date to hold it’s National Convention.\nThe National Chairman of the APC Caretaker Extraordinary Convention Planning Committee, Governor Mai Mala Buni stated this in his speech at the Progressives Women’s Conference holding Abuja, Nigeria."
  },
  {
    "headline": "Wrong version of Electoral Act Amendment bill sent to President Buhari",
    "summarized_story": "The House of Representatives will re-introduce the Electoral Act Amendment Bill at Wednesday plenary.\nSpeaker of the House, Femi Gbajabiamila, made this known as he welcomed his colleagues to 2022 legislative business.\nAdvertisementThe Speaker also expressed concerns about the errors purported to be in the Bill sent to Mr. President for assent, insisting a different version might have been transmitted.\nAdvertisementHe assured Nigerians the Constitution Amendment Bill would be ready for the concurrence of the States Houses of Assembly before end of February."
  },
  {
    "headline": "Aggrieved PDP Governorship aspirants protest in Ado Ekiti -",
    "summarized_story": "PDP Governorship Aspirants,Biodun Olujimi and Segun Oni Leads Protest Against Former Governor Ayodele Fayose Accusing him of Hijacking the Ward Congress Held on Saturday 15th January 2022.\nSome Party Faithfuls Joined the Protest this morning calling for the indefinite Suspension of Fayose from the PDP.\nAdvertisementThe Party Leaders accused Fayose of Sabotaging the Efforts of the Party by collating Ward Excos at a Private Event Center Owned by Him while the real Congress was ongoing in the 177 Wards of the State.\nThey Therefore Urged the National Working Committee to disregard any Purported List sent by Ayodele Fayose to the Party Secretariat in Abuja as they declared that there is no Congress Held in the State."
  },
  {
    "headline": "First Aid Flights Arrive in Tonga after Big Volcano Eruption",
    "summarized_story": "The first flights carrying fresh water and other aid to Tonga finally arrived Thursday after the Pacific nation’s main airport runway was cleared of ash left by a huge volcanic eruption.\nNew Zealand and Australia each sent military transport planes that were carrying water containers, kits for temporary shelters, generators, hygiene supplies and communications equipment.\nThe deliveries were dropped off without the military personnel coming in contact with people at the airport in Tonga.\nCommunications with Tonga remain limited after Saturday’s eruption and tsunami appeared to have broken the single fiber-optic cable that connects Tonga with the rest of the world.\nAnother New Zealand navy ship carrying 250,000 liters (66,000 gallons) of water is on its way."
  },
  {
    "headline": "UK Lifts Covid Restrictions, Says Omicron Wave ‘Has Peaked’",
    "summarized_story": "The government is no longer advising people to work from home, and compulsory face masks will be scrapped in secondary school classrooms starting Thursday.\nFace masks will no longer be legally required anywhere in England as of that day.\nJohnson said Wednesday that more than 90% of those over age 60 in the U.K. have had booster shots.\nOfficial figures showed that COVID-19 infections have dropped in most parts of the U.K. for the first time since early December.\nScotland and Wales, which set their own public health rules, have also announced similar easing of restrictions."
  },
  {
    "headline": "Fuel Subsidy Removal: I Will Get Clarity from Relevant Agencies on FG’s Position, Says Lai Mohammed",
    "summarized_story": "The Minister of Information and Culture, Alhaji Lai Mohammed, has said he would need to consult with relevant agencies to know the exact position of government on whether or not fuel subsidy would be stopped this year.\nWhen asked to clarify the issue since the 2022 budget had no subsidy provision beyond June, 2022, the minister said he needed to consult with the relevant government agencies to determine the exact position of the subsidy removal question.\n“As for the removal of fuel subsidy, I think you will give me time to consult with relevant departments and ministries and I will get back to you,” the minister.\nMany of us are very concerned with the recent agitations, protests, and many citizens were so concerned, our constituents across the country are very concerned that the federal government will remove the petroleum subsidy.\nAnd for us, as parliamentarians, as legislators representing the people of Nigeria, this must be of interest to us.”Deji Elumoye in Abuja"
  },
  {
    "headline": "Lagos Acquires High-Speed Intracity Trains for Red Line Rail Project",
    "summarized_story": "In line with his administration’s commitment to traffic management and transportation, Lagos State Governor, Mr. Babajide Sanwo-Olu, has acquired two sets of 10-car new Talgo 330kmph speed trains for the Lagos Red Line rail project.\nThe trains would be heading to Lagos, Nigeria for the Red Line, a 37 km track rail project started by Governor Babajide Sanwo-Olu.\nThe red line would have 11 stations and when completed would be the first operational metro system in West Africa, the statement explained.\nLagos State Government had last November announced traffic diversion at Kayode Ogunmokun road in Mushin for a period of six weeks in continuation of the first phase of the Lagos Red Line Rail Mass Transit project from Oyingbo to Agbado.\n“Coincidentally, the rail line is called Red Line and you can see they have given us the colour."
  },
  {
    "headline": "Nigeria: APC Yet to Zone Party Positions Ahead of Convention",
    "summarized_story": "The leadership of the All Progressives Congress (APC), has denied reports that it had zoned some party positions ahead of its national convention slated for February 26.\nIt concluded that the national convention to elect national officers to the National Executive Committee (NEC) would take place on the 26th, while the National Convention Appeal was scheduled for February 28.\nAgainst this backdrop, the APC leadership has beefed up security at the party secretariat in Abuja as the meeting of the Caretaker/Extraordinary Convention Planning Committee (APC) entered the second day.\nThe Caretaker committee could not reach a logical conclusion on the venue, and modalities of the convention of the party slated for February 26.\nHe insisted that during the recent revalidation and registration exercise conducted in the state, Yari and some other party stakeholders in the state refused to participate."
  }
]