[
  {
    "headline": "Kaduna Baptists students abductors promise to release all abductees, free 15",
    "summarized_story": "SOME parents of the abducted students of Bethel Baptist High School, Kaduna, have said the kidnappers called them to pick up their children at different locations with the promise that they (students) have all been released.\nHowever, only 15 of the students, who were kidnapped in July, regained their freedom on Sunday after 46 days in the captors’ den.\nTwenty-eight students were earlier released after the payment of N50 million, while the latest release was after the payment of an additional N24 million.\nThe students, 121 in numbers, according to the President, Kaduna Baptist Conference, who is also the Proprietor of the school, Rev.\nWith the release of 15 out of the 80 students, 65 of the students are still in the kidnappers’ denThe students were handed over to the traumatised parents at around 1:30pm."
  },
  {
    "headline": "We won’t enforce sit-at-home again – IPOB",
    "summarized_story": "IPOB noted that it was expedient for the global community to be aware that it had since two weeks ago suspended its earlier weekly sit-at-home order.\n“IPOB restates that there is no longer Ghost Mondays in Biafra land in solidarity with our detained leader, Mazi Nnamdi Kanu.\n“Security agencies have perfected plans to unleash attacks on innocent people in the name of ESN and IPOB volunteers.\nReacting, the spokesman for the Enugu State Police Command, Daniel Ndukwe, described the allegation as the imagination of its purveyors and calculated to tarnish the image of the police.\nReacting, the Enugu State Police spokesman, Daniel Ndukwe, said, “Police in Enugu remain committed to the protection of lives and property."
  },
  {
    "headline": "Bandits attack Katsina, Kaduna communities, kill 24",
    "summarized_story": "A total of 24 persons were killed in two communities in Katsina and Kaduna State by bandits who were armed with sophisticated weapons.\nResidents claimed that the bandits killed 20 persons and injured many others.\nThe spokesman for the Katsina Police Command, Gambo Isah, however, insisted that the bandits killed 12 persons and injured six others.\nHe said, “They (bandits) killed 12 people and injured six others.\nThe commissioner said the attack was a reprisal to the earlier attack in Ungwan Dooh (Mado) area."
  },
  {
    "headline": "Police arrest female suspect over attacks on security formations in South East",
    "summarized_story": "The police have arrested a 22-year-old woman in connection with the series of attacks on security formations and other critical national infrastructure in the South-East.\nHe said the suspect was arrested by operatives of the Nigeria Police Force, working with the military and other security agencies.\nAdeniran said the suspect was arrested over her alleged complicity in the series of deliberate and well coordinated attacks on national infrastructure and killing of security operatives in the South-East.\nHe said the arrest of the female suspect and the revelations from her confession, assisted the police in the arrest of the male suspect.\nHe said the Inspector General of Police (I-G), Mr Usman Baba has commended the security operatives for the unrelenting fight against violent crimes in the country."
  },
  {
    "headline": "Catholic bishop calls for end to ‘sit-at-home’ order in South East",
    "summarized_story": "The Catholic Bishop of Enugu Diocese, Most Reverend Calistus Onaga has appealed to agitators in the South East to suspend the sit-at-home order imposed on the region.\nThe cleric said the sit-at-home order, which the intentions were not clearly stated, was capable of causing more hardship to the people, if not suspended.\nThe Catholic Bishop wondered why the agitators, who claimed to be protecting the interest of the poor masses of South East, would turn around to inflict pains on them at the same time.\nThe Enugu diocesan bishop wondered why the security operatives could travel to other countries to arrest Nigerians, yet they could not arrest those terrorising farmers in the forest.\nIn his message, the Enugu State Governor, Chief Ifeanyi Ugwuanyi thanked the bishops for choosing the state for the conference and for their prayers for unceasing prayers, wise counsel, support and solidarity."
  },
  {
    "headline": "NNPC Weekly Review: FG sets to implement PIA, says no petrol price increase",
    "summarized_story": "According to the president, the committee has 12 months to complete the assignment and periodic updates will be given to the president.\nIn the week under review, the Nigerian National Petroleum Corporation (NNPC) assured Nigerians that the Federal Government has no immediate plans to increase the price of petrol following the signing of the PIB into law by Buhari.\nHe noted that Nigeria currently had the capacity to produce three million barrels of crude oil per day but was restricted to 1.4million barrels because of international obligations.\nAlso, the Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Malam Mele Kyari has expressed his appreciation to President Muhamadu Buhari for signing the Petroleum Industry Bill into law without delay.\nGlobal Crude Oil OutlookOil prices weakened for a fourth session due to a strong dollar as surging cases of coronavirus in Japan added to a weak demand picture in Asia."
  },
  {
    "headline": "Attack leaves 9 dead, one injured in Kaduna",
    "summarized_story": "The Kaduna State Government says an attack on Ungwan Dooh village in Zangon Kataf Local Government area of the state on Saturday, has resulted in the death of no fewer than nine persons.\nHe said the incident was reported to the Kaduna State government by troops of Operation Safe Haven, who responded to distress calls and mobilized to the area.\n“One resident sustained gunshot injuries and is receiving treatment in hospital; two houses were razed in the attack,”he added.\nThe Commissioner said that the troops had also rescued 12 persons while they were fleeing from the attackers.\nThe Commissioner said that Balarabe, who also wished the injured resident quick recovery, urged security agencies to conduct diligent investigations into the attack."
  },
  {
    "headline": "Marriage: Yusuf Buhari hosts father, father-in-law, others to luncheon",
    "summarized_story": "President Muhammadu Buhari, his wife, Hajiya Aisha Buhari and the Vice President, Prof. Yemi Osinbajo, were among dignitaries at the luncheon organised for Yusuf and Zahra Buhari.\nYusuf took Zahra, daughter of the Emir of Bichi, Nasiru Ado Bayero, as wife at a ceremony in Bichi, Kano State, on Friday.\nHowever, Yusuf and wife played host to the President, the Vice President, governors, other politicians and business moguls from within and outside the country during the event.\nThe father of the bride, Emir of Bichi, Nasiru Ado Bayero, some state governors were also in attendance.\nIt would be recalled that the father of bride, Alhaji Nasiru Ado-Bayero, was presented with Staff of Office by Gov."
  },
  {
    "headline": "Plateau Killings: Ogun evacuates stranded students",
    "summarized_story": "At least, 80 indigenes of Ogun State schooling at the University of Jos were said to have been rescued by the State Government following the killings in Plateau State.\nIt was learnt that four students of UNIJOS had been killed in the incident.\nThe Special Assistant to Governor Dapo Abiodun on Students’ Matters, Azeez Adeyemi confirmed to newsmen in Abeokuta that the governor had ordered the evacuation of Ogun students in jos.\nIt was said that the evacuation was carried out in collaboration with the National Association of Nigerian Students (NANS), the National Association of Ogun State Students (NAOSS) as well as security agencies.\nHe maintained that it is the duty of the State to ensure the safety of the stranded students."
  },
  {
    "headline": "Nigeria has no govt – Omokri condemns killing of 2 Methodist pastors, 24 others",
    "summarized_story": "Omokri wondered if Nigeria still has a government with the spate of killings by bandits across the country.\nAccording to Omokri, bandits killed 28 people on Sunday across different states.\nIn a tweet, Omokri wrote: “Bandits kill 12 people in Duba, Katsina.\nBandits kill 2 Methodist pastors in Benue.\nDoes Nigeria really have a government?”Recall that Governor Samuel Ortom of Benue State had earlier condemned the killing of two pastors in the state."
  },
  {
    "headline": "I have seen three Olu of Warri, I don’t want to see fourth coronation – Obasanjo",
    "summarized_story": "Former President, Olusegun Obasanjo, on Sunday prayed not to see the coronation of another Olu of Warri.\nObasanjo said he wishes not to see the fourth coronation of Olu of Warri because he has seen three in his lifetime.\nThe former president spoke during the thanksgiving service of the newly-installed Olu of Warri, Ogiame Atuwatse III, at the Palace of the Olu of Warri, Warri South Local Government Area of Delta State.\n“I am one of the happiest on your installation because God has especially favoured me to see three Olus and I don’t pray to see the fourth one.\n“If God has given you a role to perform you will be offending God if you fail to perform that task,” he said."
  },
  {
    "headline": "NCC boss, Danbatta lists benefits of digital literacy to socio-economic development",
    "summarized_story": "The Executive Vice-Chairman and Chief Executive Officer of the Nigerian Communications Commission (NCC), Prof. Umar Garba Danbatta, has identified major benefits in promoting digital literacy in the country.\nDelivering the first Annual Lecture of the Bichi Emirate titled, “Digital Literacy as a Veritable Tool for Social and Economic Transformation” in Bichi, Kano State, over the weekend, Danbatta challenged actors in both public and private sectors to key into the programme.\nHe noted that digital literacy provides the confidence required by individual citizens to utilise digital contents and tools, adding that it also helps citizens to effectively collaborate in creating digital content and becoming innovative problem-solvers within their socio-economic ecosystem.\nIn demonstration of its recognition of the importance of digital literacy, Danbatta said that the NCC has, over the years, implemented various programmes to support adoption and application of digital skills in Nigeria.\nThe programmes, according to him, not only provide the necessary digital tools but also support the provision of digital infrastructure, training, connectivity and other incentives to facilitate the development of digital literacy skills."
  },
  {
    "headline": "Another LG bans prostitution, alcohol businesses in Jigawa",
    "summarized_story": "Taura Local Government Area of Jigawa State has issued a seven-day notice to commercial sex workers and bar attendants to vacate the area.\nHe said that the move will help local government on its efforts to ensure maximum security of the area.\n“Henceforth, prostitution, selling and drinking alcohol is prohibited in Taura Local Government.\n“I therefore issue a seven-daysnotice to who ever takes it as means of livelihood to change business or vacate the area,” he said.\nThis is coming after Gwaram local Government had issued similar ultimatum to commercial sex workers and bar attendants to change the business or vacate the area."
  },
  {
    "headline": "What Nigerians think of COVID-19 vaccines",
    "summarized_story": "In response to the COVID-19 pandemic, Nigeria took delivery of the first batch of 3.94 million doses of the Oxford-AstraZeneca COVID-19 vaccine, on the 2nd of March 2021.\nHayab, who is a survivor of COVID-19, said: “Before COVID-19, many of us had received yellow fever vaccine.\nAnother 3,930,910 doses of Pfizer-Bio-N Tech COVID-19 vaccine donated by the US government are due in August.\nOf the number, 244 were aged 21-29, 436 were willing to take the COVID-19 test, 458 were willing to disclose contacts’ names if tested positive, and 434 were willing to take the COVID-19 vaccine.\nThose whose financial status had worsened due to the pandemic were three times less likely to take the COVID-19 vaccine."
  },
  {
    "headline": "Katsina deploys 30,000 vigilantes in rural communities",
    "summarized_story": "Masari dismisses call for resignationCentral Market fire renovation: Traders blamed for delayThe Katsina State Government has approved the deployment of 30,000 trained vigilantes to the 34 local government areas of the state to complement security presence, especially in the rural communities.\nIn a related development, Governor Masari has dismissed a call by the state’s chapter of the Coalition of Northern Groups (CNG) for his resignation over his stance on self-defence against bandits.\nGovernor Masari’s Director-General on Media, Alhaji Abdul Labaran in a statement said Masari stated this yesterday in Katsina.\nThe coalition called on him to resign his position as the governor and chief security officer of the state.\nBut Masari said: “Security is on the exclusive list of the Nigerian Constitution, which means it is exclusively a Federal Government affair."
  },
  {
    "headline": "Olurin, a statesman par excellence, says Oni",
    "summarized_story": "A former Ekiti State governor, Chief Olusegun Oni, has described a former Sole Administrator of the state, the late Brig.-Gen. Adetunji Olurin, as a statesman per excellence.\nIn a tribute yesterday in Ado-Ekiti, the state capital, the former governor said the news of Olurin’s death was a rude shock to him.\nADVERTISEMENTHe described the late Olurin as a great man and an extraordinary officer who served Ekiti State with exceptional commitment and courage in his short stint as a sole administrator and left lasting legacies.\nAlso, the senator representing Ekiti Central, Opeyemi Bamidele, described Olurin’s death as devastating.\nIn a condolence message yesterday in Ado-Ekiti, the senator said the late Olurin was a patriotic Nigerian, a peace builder, a stabiliser, and a democrat."
  },
  {
    "headline": "Striking resident doctors reject new MoU",
    "summarized_story": "The Nigerian Association of Resident Doctors (NARD) has rejected the new Memorandum of Understanding (MoU) the Federal Government presented to the union.\nThe News Agency of Nigeria (NAN) reports that the Nigeria Medical Association (NMA) led the striking doctors to a meeting summoned at the instance of President Muhammadu Buhari to resolve the current strike by doctors across the country.\nNAN recalls that the resident doctors embarked on an indefinite strike on August 1 to press home the issues of agitation amongst their members.\nThe NARD president said the nationwide strike would continue and that the union members would proceed with the court case.\nHe added that NARD leadership has to present the new MoU to its members before he could sign the document."
  },
  {
    "headline": "Again, bandits butcher 12 residents in Katsina community",
    "summarized_story": "From Agaju Madugba, KatsinaThe orgy of violent attacks continued in Katsina at the weekend with suspected bandits slaughtering 12 residents of Duba community, Batsari Local Government Area, on Saturday night.\nIt was gathered that the bandits stormed the village at about 9pm and engaged in shooting of residents, resulting in the death of 12, while six others were injured.\nKatsina State Police Public Relations Officer, Mr. Gambo Isah, said the attackers also looted a number of shops and rustled some domestic animals.\nAccording to Isah,“a joint military, police and air force operation is on to deal with the situation and investigation is in top gear with a view to arresting the perpetrators of the crime.”The victims were laid to rest according to Muslim rites on Sunday afternoon.\nThe Duba killings are the third in a series of bloody attacks by bandits after Governor Aminu Bello Masari’s August 17 directive to residents to acquire arms and protect themselves during attacks by bandits."
  },
  {
    "headline": "Security operatives plan to disguise as ESN to enforce sit-at-home, IPOB alleges",
    "summarized_story": "From Stanley Uzoaru, OwerriThe Indigenous People of Biafra (IPOB) has alleged that security operatives in collaboration with some politicians have perfected plans to disguise as members of the Eastern Security Network (ESN) to enforce the sit-at-home order it had relaxed.\nHe claimed the perpetrators would come under the guise of IPOB volunteers to create chaos.\n“Security agencies have perfected plans to unleash attacks on innocent people in the name of ESN and IPOB volunteers.\nWe have no plans again to enforce any sit-at-home order.\nThey want to wear jeans trousers and combat knicker jeans and brand it ESN and IPOB volunteers."
  },
  {
    "headline": "Strike: Resident doctors reject FG’s MoU",
    "summarized_story": "The association described the MoU as a veiled punishment for doctors, who are to bear the brunt of government’s failures.\nResident doctors on August 1 commenced a strike over alleged failure of the Federal Government to implement an agreement bordering on salaries and allowances.\nThe Nigeria Medical Association (NMA), on Friday, led the resident doctors to a meeting summoned at the instance of President Muhammadu Buhari to resolve the nationwide strike.\nThe minister said the meeting did not discuss the issue of ‘No Work No Pay’ but that all parties at the meeting agreed to an out-of-court settlement.\n“The meeting agreed we need to let this matter go."
  },
  {
    "headline": "Reprisal attacks: Unidentified persons kill 3, burn houses in Zangon-Kataf",
    "summarized_story": "From Noah Ebije, KadunaFollowing renewed attacks on Ungwan Dooh (Mado) area by bandits on Sunday which led to death of many residents in Zangon-Kataf local government area, three herders were said to have been killed in reprisal attack, less than 24 hours of the first attack.\n“According to reports from security agencies, the attack was a reprisal to the earlier attack in Ungwan Dooh (Mado) area.\nThe reprisal targeted the residence of one Ardo Tanko Usman, where three residents were killed.\n“Acting Governor, Dr. Hadiza Balarabe received the report with sadness, and decried the spiral of killings and reprisals in the area.\n“The Acting Governor appealed for calm and urged residents to desist from reprisal killings while security agencies carry on investigations”."
  },
  {
    "headline": "Drama as hospital produces wrong corpse of killed LASU student for burial",
    "summarized_story": "By Gabriel DikeControversy has continued to trail the killing of a student of Lagos State University (LASU), Ojo, Nurudeen Alowonle, as mortuary attendants at the Mainland Hospital, Yaba, Lagos, produced a wrong corpse for the family, activists and friends who had gathered to pick the corpse for burial on Friday.\nHis words: ”I got to the morgue of Mainland Hospital Yaba in the morning of Friday, August 20th.\nIt was nothing more than a mass of entrails which was highly decomposed and put together in a body bag.\nWe said there was no way we could present this to the family as the ‘body’ of their son.\n”This made the family to insist that the body be buried the very day."
  },
  {
    "headline": "Buhari Mourns Veteran Diplomat, Muhammad Abubakar",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has mourned veteran diplomat, Ambassador Muhammad Dahiru Abubakar.\nHe said: “I’m proud of his untainted record of integrity and selfless service.\nHe had never used public office for personal profits–a rare quality in a society where people are obsessed with the desire to amass wealth by any means,’’ President Buhari further extolled the virtues of the veteran diplomat.\nPresident Buhari prayed to Almighty God to forgive the gentle soul of the deceased and reward his good deeds with paradise.\nHe also extended condolences to the family and government of Kano State over what he called “this enormous loss of a great Nigerian.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Bandits Release Another 15 Abducted Kaduna Baptist School Students",
    "summarized_story": "By John Shiklam in KadunaFifteen of the remaining 80 abducted students of Bethel Baptist High School, Damishi, Kaduna have been released from captivity.\nChairman of the Kaduna state chapter of the Christian Association of Nigeria (CAN), Rev.\nAfter the release of the 28 students in July, the bandits were said to have demanded for another N80m for the release of the remaining 80 students.\nIt was learnt that an undisclosed amount of money was paid before the 15 students were freed.\nOn July 5, bandits invaded the school located some few kilometers away from Kaduna metropolis and abducted 121 students."
  },
  {
    "headline": "APC Chairmanship Battle Hots Up",
    "summarized_story": "Yari, a two-time Governor of Zamfara State, had indicated his interest to run for the office of the National Chairman of the APC.\nAl-Makura is another political heavyweight in the race for the position of the National Chairman of APC.\nHowever, whatever achievements he recorded as Borno State governor were blighted by the Boko Haram terrorists.\nBut his experience as a two-term governor, and his current position as a serving minister in President Buhari’s cabinet, will boost his chances.\nHowever, APC sources have described him as being ‘docile’ and ‘laid back’ in his campaign for the party’s chairmanship."
  },
  {
    "headline": "Unite for Nigeria, Buhari Urges Future Leaders",
    "summarized_story": "Deji Elumoye in Abuja and Ibrahim Shuaibu in KanoPresident Muhammadu Buhari has called on emerging leaders in the country to rid the nation of divisiveness and unite the people.\nThe leader of the presidential delegation, Professor Gambari, who is a maternal uncle of the Emir, Nasiru Ado Bayero, reaffirmed his loyalty and affinity to the Emir.\nThe Emir, had on Friday, given his daughter in marriage to the son of President Buhari, Yusuf.\nHe urged the Emir and other Emirs in the state, to continue to assist the government in providing security for lives and property.\nThe governor urged the Emir to remain a father to all his subjects without discrimination."
  },
  {
    "headline": "Nigeria’s External Reserves Hit $37bn with $3.5bn New SDRs",
    "summarized_story": "This is coming as the CBN has threatened to revoke the operating licence of any microfinance bank found engaging in foreign exchange transactions.\nSDRs are supplementary foreign exchange reserve assets defined and maintained by the IMF.\nSDRs were created in 1969 to supplement a shortfall of preferred foreign exchange reserve assets, namely gold and United States dollars.\n“In the first fortnight of August, Nigeria’s gross external reserves maintained a steady accretion.\nThe economic research firm projected additional foreign exchange accretion through the anticipated rise in higher oil revenue in the coming months."
  },
  {
    "headline": "How Buhari’s Newly-wed Son, Yusuf’s Accident In 2017 Pushed Doctor Who First Received Him To Commit Suicide",
    "summarized_story": "Yusuf, son of President Muhammadu Buhari, had in Abuja in December 2017 led a doctor identified as Obafemi to commit suicide, SaharaReporters has learnt.\n“We thank God for the return of our son Yusuf today (Thursday) after his medical trip,” she wrote.\nThere he met Dr Obafemi who was one of the most junior doctors at the facility.\n“Their madness led to the sacking of Dr Obafemi for having the audacity to transfer a patient without their authorisation.\n“Fortunately for Dr Obafemi, there was a lady that works at Nisa Premier whose husband works at Cedarcrest."
  },
  {
    "headline": "How Buhari’s Newly-wed Son, Yusuf’s Accident In 2017 Pushed Doctor Who First Received Him To Commit Suicide",
    "summarized_story": "Yusuf, son of President Muhammadu Buhari, had in Abuja in December 2017 led a doctor identified as Obafemi to commit suicide, SaharaReporters has learnt.\n“We thank God for the return of our son Yusuf today (Thursday) after his medical trip,” she wrote.\nThere he met Dr Obafemi who was one of the most junior doctors at the facility.\n“Their madness led to the sacking of Dr Obafemi for having the audacity to transfer a patient without their authorisation.\n“Fortunately for Dr Obafemi, there was a lady that works at Nisa Premier whose husband works at Cedarcrest."
  },
  {
    "headline": "How Buhari’s Newly-wed Son, Yusuf’s Accident In 2017 Pushed Doctor Who First Received Him To Commit Suicide",
    "summarized_story": "Yusuf, son of President Muhammadu Buhari, had in Abuja in December 2017 led a doctor identified as Obafemi to commit suicide, SaharaReporters has learnt.\n“We thank God for the return of our son Yusuf today (Thursday) after his medical trip,” she wrote.\nThere he met Dr Obafemi who was one of the most junior doctors at the facility.\n“Their madness led to the sacking of Dr Obafemi for having the audacity to transfer a patient without their authorisation.\n“Fortunately for Dr Obafemi, there was a lady that works at Nisa Premier whose husband works at Cedarcrest."
  },
  {
    "headline": "How Apostle Suleman Slept With Me Twice, Gave Me N500,000 – Nollywood Actress, Ifemeludike",
    "summarized_story": "A Nollywood actress and human rights’ activist, Chioma Ifemeludike, has disclosed that the Senior Pastor and General Overseer, Omega Fire Ministries International, Apostle Johnson Suleman, paid her over N500,000 and had sex with her.\n“We all know the part I played in the Stephanie Otobo saga.\nYou knew how we got Stephanie Otobo to come to the altar and apologise to mama (Suleman’s wife) and brought Stephanie Otobo’s mother to Auchi.\n“I am coming to that issue because you are pushing me to that extent, Apostle Johnson Suleman as much as I knew what happened.\nMs. Okeke was previously named by Otobo, Apostle Suleman’s estranged lover, as being one of the other women in his life."
  },
  {
    "headline": "How Apostle Suleman Slept With Me Twice, Gave Me N500,000 – Nollywood Actress, Ifemeludike",
    "summarized_story": "A Nollywood actress and human rights’ activist, Chioma Ifemeludike, has disclosed that the Senior Pastor and General Overseer, Omega Fire Ministries International, Apostle Johnson Suleman, paid her over N500,000 and had sex with her.\n“We all know the part I played in the Stephanie Otobo saga.\nYou knew how we got Stephanie Otobo to come to the altar and apologise to mama (Suleman’s wife) and brought Stephanie Otobo’s mother to Auchi.\n“I am coming to that issue because you are pushing me to that extent, Apostle Johnson Suleman as much as I knew what happened.\nMs. Okeke was previously named by Otobo, Apostle Suleman’s estranged lover, as being one of the other women in his life."
  },
  {
    "headline": "Rivers judgement: Continue to pay VAT to us, FIRS tells taxpayers",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) has directed taxpayers in the country to continue to pay value-added tax (VAT) to the agency to avoid facing penalties for failing to do so.\nAdvertisementDespite the appeal filed by FIRS, Nyesom Wike, governor of Rivers, signed a bill on value-added tax (VAT) collection into law on Thursday.\nWike maintained that the judgment of the federal high court had sufficiently addressed the illegality perpetrated by the FIRS.\nBut FIRS said both parties are aware of the appeal and stay of execution on the judgment and advised taxpayers to continue to pay VAT to it.\n“The suit was about who has the constitutional duty for the collection of VAT and Personal income tax in Rivers State."
  },
  {
    "headline": "Rivers judgement: Continue to pay VAT to us, FIRS tells taxpayers",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) has directed taxpayers in the country to continue to pay value-added tax (VAT) to the agency to avoid facing penalties for failing to do so.\nAdvertisementDespite the appeal filed by FIRS, Nyesom Wike, governor of Rivers, signed a bill on value-added tax (VAT) collection into law on Thursday.\nWike maintained that the judgment of the federal high court had sufficiently addressed the illegality perpetrated by the FIRS.\nBut FIRS said both parties are aware of the appeal and stay of execution on the judgment and advised taxpayers to continue to pay VAT to it.\n“The suit was about who has the constitutional duty for the collection of VAT and Personal income tax in Rivers State."
  },
  {
    "headline": "Three herders killed in reprisal attack in Kaduna",
    "summarized_story": "Three herders have been reportedly killed in a reprisal attack by gunmen who stormed Ribok, Tsoriyang and Kankada areas of Zangon Kataf LGA, Kaduna state.\nAdvertisementIn a statement on Sunday, Samuel Aruwan, commissioner for internal security, said the attack was a reprisal of the killing in Ungwan Dooh village of the LGA.\nHe said the gunmen targeted the residence of one Ardo Tanko Usman, where three occupants were killed.\nThe military and police arrived the scene and evacuated scores of herders to safety.\nShe also wished the injured victims a quick recovery.”The commissioner said the state government has appealed for calm and urged residents to desist from reprisal killings while security agencies carry on investigations."
  },
  {
    "headline": "Three herders killed in reprisal attack in Kaduna",
    "summarized_story": "Three herders have been reportedly killed in a reprisal attack by gunmen who stormed Ribok, Tsoriyang and Kankada areas of Zangon Kataf LGA, Kaduna state.\nAdvertisementIn a statement on Sunday, Samuel Aruwan, commissioner for internal security, said the attack was a reprisal of the killing in Ungwan Dooh village of the LGA.\nHe said the gunmen targeted the residence of one Ardo Tanko Usman, where three occupants were killed.\nThe military and police arrived the scene and evacuated scores of herders to safety.\nShe also wished the injured victims a quick recovery.”The commissioner said the state government has appealed for calm and urged residents to desist from reprisal killings while security agencies carry on investigations."
  },
  {
    "headline": "PHOTOS: Tears, relief as freed Kaduna Baptist school students reunite with parents",
    "summarized_story": "The 15 students of Bethel Baptist High School, Damishi, Kaduna, released by bandits on Saturday have reunited with their parents.\nThe parents were prevented from speaking with journalists by officials of the Baptist church.\nIsrael Akanji, president of the Nigerian Baptist Convention, said 63 of the students are still in captivity.\n“But in everything, God said we should give thanks and we are giving thanks for what he has done.\n“Between the time 28 of the students were released on July 25 and now, some of them escaped,” he said."
  },
  {
    "headline": "Explained: Can the Nigerian government really spy on your WhatsApp messages?",
    "summarized_story": "However, some uncertainty hangs over how Nigerian authorities plan to go about intercepting WhatsApp, particularly because the platform uses end-to-end encryption for its messages.\nStorage loopholesThere are also vulnerabilities with how WhatsApp messages are stored, which could be exploited by hackers.\nWhatsApp chats are saved in four locations, from where data can be retrieved later.\nIt’s unclear how the Nigerian government intends to go about tracking WhatsApp messages after earmarking billions of naira for the said interception solution.\nWith over 90 million Nigerian users per data from Statista, WhatsApp is the most popular social media platform used in the country."
  },
  {
    "headline": "Meet Regina Honu, a Ghanaian software developer teaching thousands of girls to code",
    "summarized_story": "Failure is not finalIn her first year in senior secondary school, Honu had her first taste of failure during an Inter-school quiz competition.\nConversation between Regina Honu and students of Ashesi University during a visit.\nSame experience at another bank and turning away from a job at MicrosoftShe eventually left Zenith bank for Fidelity bank, a Ghanaian Bank.\nResigning from her JobThe morning of the day Honu resigned from her job, she didn’t know it would happen.\n10 years and countingIt’s been almost 10 years since Honu started Soronko Academy, for her there’s still so much more to do."
  },
  {
    "headline": "Nigeria’s Central Bank freezes bank accounts of fintech platforms Risevest, Bamboo, Trove and Chaka",
    "summarized_story": "The Central Bank of Nigeria has just frozen the bank accounts of Nigerian fintech platforms Risevest, Bamboo, Trove and Chaka for the next six months.\nNotably, all four companies affected by this action have gotten licenses from Nigeria’s Securities and Exchange Commission (SEC) to operate as digital platforms for buying and selling stocks.\n— Bamboo (@investbamboo) August 17, 2021So far none of the affected companies has come out to refute this claim.\nAccording to a source from one of the affected companies, they lost a lot of users and deposits after the April announcement.\nTechCabal has reached out to the affected fintech companies and is awaiting their comments."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "In other precious metals, Silver is currently trading at $23.74 an ounce, down 2.25% for the week, platinum is back above the $1,000 trading zone to stand at $1,026.10, up 5.33% for the week and palladium is trading at $2,648.50, up 0.82% for the week.\nIn the coming week, oil prices are expected to dip further on COVID surge, worries about more supply.\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold in the NAFEX window.\nFunding rates are still expected to trade in double digits trend in the coming week in the absence of any maturity.\nActivity in the coming week is expected to be dictated by the market liquidity situation."
  },
  {
    "headline": "Insecurity: Nigeria’s gambit with ‘repentant’ Boko Haram",
    "summarized_story": "“As a government, you can’t be celebrating some Boko Haram members turning away from their act of terrorism.\nThe Arewa Consultative Forum (ACF), pan-northern socio-political organisation, urged government to rather prosecute the “repentant” Boko Haram members for the crimes committed against fellow Nigerians.\nIn the statement titled, ‘On repentant Boko Haram terrorists and the principle of equity and justice,’ACF said: “We are currently witnessing large scale surrender of large numbers of Boko Haram insurgents, among whom are bomb makers, commanders, arsonists, rapists, and child snatchers.\n“A Nigerian Army General once said a repentant Boko Haram member stands a chance to become Nigeria’s president.\n“For me, I even think this people are not the real Boko Haram, because for the real Boko Haram it would be very difficult for them to surrender."
  },
  {
    "headline": "Is Wike leading one-man revolution to true federalism?",
    "summarized_story": "Niger Delta militants have used the gun to shoot for resource control and true federalism for 16 years; the intellectuals in the South-South and East have used oratory and logic to press for restructuring and power devolution so the states can have more powers and more funds to no avail.\nNow, one man, Governor Nyesom…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Revamp of Edo College of Education ‘ll enhance employability of graduates – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the revamp of the Edo State College of Education will enhance the employability of graduates from the institution to compete favourably with their peers across the globe.\nRepresentative of the governor and Chief of Staff to the Edo State Governor, Hon.\nOsaigbovo Iyoha, said this during a courtesy visit by the Executive Members of the Students Union Government (SUG) of the Edo State College of Education, Igueben Campus, at the Government House in Benin City.\nHe said the decision by the government to revamp the College of Education will benefit the students and ensure that the college competes favourably with other world-class institutions across the globe.\nHe noted: “The revamping and total overhauling of the institution is to make it world-class and ensure that graduates from the college are employable."
  },
  {
    "headline": "Obaseki launches vigilante network for Edo Central, hails donors of operational vehicles – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has launched a vigilante network for the Edo Central Senatorial District, known as Atanakpa, as part of measures to boost security in the state and ensure the protection of lives and property of citizens.\nRepresentative of the governor and Coordinator, Edo State Vigilante Network, Mr. Yusuf Haruna, who spoke at the launch of the security network in Uromi, praised members of Esan Solidarity Forum for complementing the efforts of the government in driving community-led security network to ensure adequate security across Edo.\nRepresentative of the chairman, Board of Trustees, Esan Solidarity Forum, Air Commodore Patrick Udabor (Rtd.\n), said the launch of the local security outfit “is a new dawn for the people of Esan.”Edo State Commissioner of Police, who was represented by the Area Commander, Otabor Festus, said he was delighted with the launching of the local security network.\nOn their part, members of the local organizing committee, expressed appreciation to the governor for supporting the initiative and hailed the team spirit of members of Esan Solidarity Forum."
  },
  {
    "headline": "COVID-19: Obaseki to flag off second phase vaccination tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will tomorrow, Monday, August 23, 2021, flag off the second phase coronavirus (COVID-19) vaccination exercise to inoculate more Edo citizens against the deadly virus.\nThe flag off for the rollout of the vaccines follows the successful delivery of 76,712 doses of COVID-19 vaccines at the weekend.\nThey include 65,016 doses of Moderna and 11,696 doses of AstraZeneca vaccines.\nSpeaking to journalists, Health Educator, Edo State Primary Healthcare Development Agency (ESPHDA), Mrs. Irene Uabor, charged residents to complement government’s effort at containing the pandemic by coming out and getting vaccinated against the virus.\nAccording to her, “Governor Godwin Obaseki will tomorrow, Monday, August 23, 2021, flag-off the second phase vaccination exercise to enable more residents take the vaccines to protect them from COVID-19."
  },
  {
    "headline": "Orhionmwon Electrification: Communities hail Obaseki, calls for timely completion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOghada – Following commencement of the rural electrification of some communities in Orhionmwon and Uhunmwode local government areas by Edo state government, inhabitants have called for timely completion of the project to boost socioeconomic development of the areas.\nThe inhabitants who are into agriculture and other businesses have been disconnected from the national grid for more than two years due to faulty transformers and other electronicals that hitherto supply power to the affected areas.\nThe EDSOGPADEC chairman, Kennedy Osifo during inspection of the installation said Governor Godwin Obaseki gave approval for the project to address the perennial power situation in the areas, which the people called for it speedy completion.\n“for close to five years now, no light; it generator everybody are using, everybody.\nAt Oghada community, the people expressed doubts over the project completion within the next few years due to government beaurocracy, but however welcomed the project."
  },
  {
    "headline": "Marriage: Yusuf Buhari hosts father, father-in-law, others to luncheon",
    "summarized_story": "ADVERTISEMENTPresident Muhammadu Buhari, his wife, Aisha Buhari and the Vice President, Yemi Osinbajo, were among dignitaries at the luncheon organised for Yusuf and Zahra Buhari.\nYusuf took Zahra, daughter of the Emir of Bichi, Nasiru Ado Bayero, as wife at a ceremony in Bichi, Kano State, on Friday.\nThe father of the bride, Emir of Bichi, Nasiru Ado Bayero, and some state governors were also in attendance.\nSome wives of state governors and the Group Managing-Director of the Nigerian National Petroleum Corporation (NNPC), Mele Kyari were also sighted at the event.\nThe father of the bride, Nasiru Ado-Bayero, was presented with the Staff of Office by Governor Abdullahi Ganduje of Kano State on Saturday in Bichi."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Yoruba culture promoter, Oyatoye sues actress Anjorin-Lawal for defamation, demands N30m damages",
    "summarized_story": "Oyatoye according to the writ of summons, stated that there was no justification for Anjorin-Lawal to issue the post.\nOyatoye further avered that Messrs Eko Akete Chambers was compelled to write a letter to the defendant on the 1st of February, 2021 which was addressed and delivered to the defendant on same 1st of February.\nMeanwhile Olaniyi in a statement at the weekend has alleged threat to his life following the legal action against Anjorin .\nHe said he has reported the matter to the Zone 2 police station where it is currently being investigated.\nHe also stated that apart from the Zone2 police station, the state CID in Alagban Ikoyi Lagos is also aware of the matter."
  },
  {
    "headline": "Demise of Akire’s queen, Lawal huge loss to Ikire Kingdom – Osun Commissioner, Oyebamiji",
    "summarized_story": "By Sunday Oguntuyi,OsogboOsun Commissioner For Finance, Mr Bola Oyebamiji has condoled with the Akire of Ikire kingdom, Oba Olatunde Falabi and the entire sons and daughters of the ancient town on the demise of the Queen of Akire, Olori Anthonia Aduke Falabi.\nThe Commissioner stated this in a letter of condolence to the Akire of Ikire land made available to newsmen in Osogbo on Saturday through the Senior Special Assistant to Governor Adegboyega Oyetola on Finance, Dr Wale Tijani.\nWe mourn mama so much, she was a good woman, the palace will miss her, the entire town will miss her.\n“Ikire land has obviously lost a great son with a good heart.\nI pray that our Monarch and the entire Ikire land will have the strength to bear the loss”."
  },
  {
    "headline": "Abiodun mourns former ECOMOG Commander, ex-Oyo governor, Gen. Olurin",
    "summarized_story": "Idowu Olakunle,AbeokutaOgun State governor, Prince Dapo Abiodun, has mourned the death of the former Military Governor of Oyo State, General Adetunji Idowu Olurin (rtd), who passed on Saturday morning at the age of 76.\nHe added that the late general was an illustrious son of Ogun State, who put the state and Nigeria on the global map with his exploits when he served as the ECOMOG Commander in Liberia.\nHe noted that General Olurin of the popular Olurin Family in Ilaro, Yewa South Local Government Area of the state served Nigeria and ECOWAS in many capacities.\nHe was Military Governor of Oyo State and later Civilian Administrator of Ekiti State after retirement.\n“On behalf of my family and the people of Ogun State, I commiserate with the entire Olurin Family of Ilaro."
  },
  {
    "headline": "FG, States, LGAs share N760.717bn as FAAC for July",
    "summarized_story": "The N760.717 billion total distributable revenue comprised distributable statutory revenue of N617.705 billion; distributable Value Added Tax (VAT) revenue of N140.555 billion and Exchange Gain of N2.457 billion.\nFrom this, the Federal Government received N299.004 billion, the State Governments received N151.659 billion and the Local Government Councils received N116.922 billion.\nIn the month of July 2021, the gross revenue available from the Value Added Tax (VAT) was N151.134 billion.\nThe sum of N4.534 billion allocation to NEDC and N6.045 billion cost of revenue collection were deducted from the N151.134 billion gross Value Added Tax (VAT) revenue, resulting in the distributable Value Added Tax (VAT) revenue of N140.555billion.\nFrom the N140.555 billion distributable Value Added Tax (VAT) revenue, the Federal Government received N21.083 billion, the State Governments received N70.278 billion and the Local Government Councils received N49.194 billion."
  },
  {
    "headline": "Wedding: Yusuf Buhari, Wife Host Dignitaries To Luncheon In Abuja",
    "summarized_story": "President Muhammadu Buhari, his wife, Aisha Buhari, and the Vice President, Prof. Yemi Osinbajo (SAN), were among both local and foreign dignitaries at the luncheon organised for the President’s son, Yusuf and his newly wedded wife, Zahra, in Abuja.\nThe event, which held at the Old Banquet Hall of the Presidential Villa, was the concluding part of the marriage ceremony between the son of President Buhari, Yusuf, and his new wife, Zahra, which started on Friday in Bichi, Kano State.\nYusuf took Zahra, daughter of the Emir of Bichi, Nasiru Ado Bayero, as wife at an elaborate ceremony in Bichi, Kano State, on Friday, playing host to a huge crowd of dignitaries, including President Buhari, the Vice President, governors, ministers, other politicians and business moguls from within and outside the country.\nADVERTISEMENTHowever, at the Sunday luncheon at the Presidential Villa, the couple hosted yet another crowd of dignitaries.\nAmong governors in attendance were those of Imo, Hope Uzodinma; Kebbi, Atiku Bagudu; Kogi, Yahaya Bello; Plateau, Simon Lalong; and Ebonyi, Dave Umahi."
  },
  {
    "headline": "Wedding: Yusuf Buhari, Wife Host Dignitaries To Luncheon In Abuja",
    "summarized_story": "President Muhammadu Buhari, his wife, Aisha Buhari, and the Vice President, Prof. Yemi Osinbajo (SAN), were among both local and foreign dignitaries at the luncheon organised for the President’s son, Yusuf and his newly wedded wife, Zahra, in Abuja.\nThe event, which held at the Old Banquet Hall of the Presidential Villa, was the concluding part of the marriage ceremony between the son of President Buhari, Yusuf, and his new wife, Zahra, which started on Friday in Bichi, Kano State.\nYusuf took Zahra, daughter of the Emir of Bichi, Nasiru Ado Bayero, as wife at an elaborate ceremony in Bichi, Kano State, on Friday, playing host to a huge crowd of dignitaries, including President Buhari, the Vice President, governors, ministers, other politicians and business moguls from within and outside the country.\nADVERTISEMENTHowever, at the Sunday luncheon at the Presidential Villa, the couple hosted yet another crowd of dignitaries.\nAmong governors in attendance were those of Imo, Hope Uzodinma; Kebbi, Atiku Bagudu; Kogi, Yahaya Bello; Plateau, Simon Lalong; and Ebonyi, Dave Umahi."
  },
  {
    "headline": "Court Remands NSCDC Personnel Over Alleged Rape Of 7 Year-old",
    "summarized_story": "An Owerri Magistrate Court has ordered the remand of a 39 year-old Okechukwu Nwanguma, an official of the Nigerian Security ans Civil Defence Corps (NSCDC) in the Nwangele local government area of Imo State for allegedly raping a seven year-old girl.\nThis is even as a 62 year-old Theodore Okeke has been remanded for the alleged rape of a six year-old daughter of his tenant in Irete, Owerri West local government area of the state.\nThe family court had ordered the remands following the charges filed by the Imo State Committee on Ending Violence Against Women and Girls (ISCEVAWG).\nSubsequent medical tests revealed that the seven year-old girl had been severally raped which resulted in the complication.\nAfter the rape, the 62 year-old threatened the girl (name withheld) but she eventually summoned courage to confided in her mother."
  },
  {
    "headline": "Court Remands NSCDC Personnel Over Alleged Rape Of 7 Year-old",
    "summarized_story": "An Owerri Magistrate Court has ordered the remand of a 39 year-old Okechukwu Nwanguma, an official of the Nigerian Security ans Civil Defence Corps (NSCDC) in the Nwangele local government area of Imo State for allegedly raping a seven year-old girl.\nThis is even as a 62 year-old Theodore Okeke has been remanded for the alleged rape of a six year-old daughter of his tenant in Irete, Owerri West local government area of the state.\nThe family court had ordered the remands following the charges filed by the Imo State Committee on Ending Violence Against Women and Girls (ISCEVAWG).\nSubsequent medical tests revealed that the seven year-old girl had been severally raped which resulted in the complication.\nAfter the rape, the 62 year-old threatened the girl (name withheld) but she eventually summoned courage to confided in her mother."
  },
  {
    "headline": "Rivers APC Chieftain Denies Plan To Dump Party",
    "summarized_story": "A former candidate for the House of Representatives seat on the platform of the All Progressives Congress (APC) in Rivers State, Chief Tony Okocha, has denied plans to dump the party for the Peoples Democratic Party ( PDP).\nOkocha, who was Chief of Staff to former Governor Rotimi Amaechi, disclosed this while speaking with LEADERSHIP in Port Harcourt, the Rivers State capital.\nADVERTISEMENTThe APC chieftain said: “I am sure you know that Wike is governor of Rivers State and not governor of PDP.\nI have attended state government events because I am a stakeholder in the state, especially commissioning of projects.\n“The issue of joining the APC was collectively resolved because somebody has to be at the centre."
  },
  {
    "headline": "Anambra: Ifeanyi Ubah challenges Charles Soludo to public debate",
    "summarized_story": "Ahead of the November 6, 2021 Anambra State Governorship Election, the candidate of the Young Progressives Party, Senator Ifeanyi Ubah, has challenged Prof. Charles Soludo of the All Progressives Grand Alliance to a public debate.\nUbah, who represents Anambra South in the upper legislative chamber, disclosed this is in a statement by his media office on Sunday.\nThe statement was titled, ‘Anambra2021: Senator Ifeanyi Ubah Challenges Prof. Soludo To Provide His Manifesto Within 48hours And A Public Debate Within 7 Days Of Presentation Of His Manifesto’.\nThe senator referred to a recent statement made by Soludo that Anambra was too sophisticated for a school certificate holder to aspire to govern.\n“In this regard, I am challenging Prof. Soludo to an open public manifesto debate with me."
  },
  {
    "headline": "Anambra: Ifeanyi Ubah challenges Charles Soludo to public debate",
    "summarized_story": "Ahead of the November 6, 2021 Anambra State Governorship Election, the candidate of the Young Progressives Party, Senator Ifeanyi Ubah, has challenged Prof. Charles Soludo of the All Progressives Grand Alliance to a public debate.\nUbah, who represents Anambra South in the upper legislative chamber, disclosed this is in a statement by his media office on Sunday.\nThe statement was titled, ‘Anambra2021: Senator Ifeanyi Ubah Challenges Prof. Soludo To Provide His Manifesto Within 48hours And A Public Debate Within 7 Days Of Presentation Of His Manifesto’.\nThe senator referred to a recent statement made by Soludo that Anambra was too sophisticated for a school certificate holder to aspire to govern.\n“In this regard, I am challenging Prof. Soludo to an open public manifesto debate with me."
  },
  {
    "headline": "ZLP alleges: Obiano plans to finance Soludo’s campaign with N60bn",
    "summarized_story": "The Zenith Labour Party has accused the Anambra State Governor, Willie Obiano, of sourcing about N60bn to fund the election of Professor Chukwuma Soludo of the All Progressives Grand Alliance as his successor.\nThe opposition alleged that the governor was seeking the fund in form of supplementary budget from the State House of Assembly.\nThe accusation was contained in a statement by the ZLP Publicity Secretary, Campaign Council, Afam Ofomata.\nBut in a swift reaction, the state Commissioner for Information and Public Enlightenment, C-Don Adinuba, described the allegation as intelligible.\nEvery government in Nigeria, including the Federal Government, goes for supplementary budget annually."
  },
  {
    "headline": "ZLP alleges: Obiano plans to finance Soludo’s campaign with N60bn",
    "summarized_story": "The Zenith Labour Party has accused the Anambra State Governor, Willie Obiano, of sourcing about N60bn to fund the election of Professor Chukwuma Soludo of the All Progressives Grand Alliance as his successor.\nThe opposition alleged that the governor was seeking the fund in form of supplementary budget from the State House of Assembly.\nThe accusation was contained in a statement by the ZLP Publicity Secretary, Campaign Council, Afam Ofomata.\nBut in a swift reaction, the state Commissioner for Information and Public Enlightenment, C-Don Adinuba, described the allegation as intelligible.\nEvery government in Nigeria, including the Federal Government, goes for supplementary budget annually."
  },
  {
    "headline": "Oyedepo bans youths from entering Living Faith with earphones",
    "summarized_story": "Presiding Bishop, Living Faith Worldwide, David Oyedepo has banned youths with earphones from entering the church as they are not ready to hear God’s words.\nOyedepo said they should go somewhere else, as the church would not tolerate youths who are not ready to listen to the words of God.\nSpeaking during a church service on Sunday, Oyedepo lamented that “We live in a very rowdy time.\nYoung generation, please listen to me: all these things you plug in your ear is to block your way forward.\nThey even plug it in anywhere, on the streets: noise, noise, noise!"
  },
  {
    "headline": "MTN makes audacious investment statement for next three years",
    "summarized_story": "The Chairman of MTN Nigeria Communications, Dr Ernest Ndukwe, disclosed this during the company’s 20th anniversary celebration held on Sunday in Lagos.\nNdukwe said that MTN was also “committed to specifically expanding its rural connectivity to reach areas that were underserved” across the country.\nRelated News MTN Nigeria partners with LaLiga“This is a response to government’s drive towards public-private partnership in the rehabilitation of critical road infrastructure in Nigeria,” Toriola said“We’ve initiated plans for the construction of a purpose-built, state-of-the-art head office in Lagos.\n“We will also be selling down 14 per cent of MTN shares to over two million Nigerian retail investors,” Toriola said.\nMTN Nigeria currently provides services in 223 cities and towns, in more than 10,000 villages and communities, in the 36 states and the Federal Capital Territory."
  },
  {
    "headline": "BREAKING: Kidnapped ABSU Lecturer Regains Freedom",
    "summarized_story": "According to a university source, one of the kidnapped lecturers at Abia State University Uturu, ABSU, Don Chris Afulike of the Department of Mass Communication, has regained his freedom.\nMr Chijioke Nwogu, the institution’s Public Relations Officer, told Vanguard in a telephone conversation that the lecturer regained his release on Friday night.\nProfessor S. O. Eze of the Department of Industrial Chemistry, has yet to be released, according to the university official.\nOn Thursday evening, the lecturers and other commuters were abducted by suspected Fulani bandits terrorizing vehicles on the Uturu/Isuikwuato Road.\nDespite pledges from security officials that the matter would be addressed, kidnappings for ransom by Fulani bandits have continued in the Isuikwuato/Bende axis."
  },
  {
    "headline": "Bayelsa SSG’s Mother, Betinah Reunites With Family After 34 Days In Kidnappers’ Den",
    "summarized_story": "After 34 days in captivity, Madam Betinah Benson, the 86-year-old mother of the Secretary to the Bayelsa State Government, has regained her freedom and been reunited with her family.\nRemember that Madam Betinah Benson was kidnapped from her rural home Korokorosei hamlet in Southern Ijaw Local Government Area of Bayelsa State in 2013 and held captive for several days before being released.\nMeanwhile, the Nigerian Army detained a 27-year-old suspect a few days after taking over the investigation into the octogenarian’s kidnapping.\nThe kidnappers had previously demanded N500 million in ransom in exchange for her release.\nThe suspect, named Stanley Woniowei, is a native of the Olugbobiri community in the State’s Southern Ijaw Local Government Area."
  },
  {
    "headline": "Over 300 Bandits Attack Katsina, Kill 12, Injure Many",
    "summarized_story": "On Saturday, around 300 bandits equipped with modern weaponry attacked Duba hamlet in Batsari LGA, Katsina State.\nAccording to NEWS DIRECT, approximately 300 criminals invaded the Duba village, shooting randomly into the air before looting various shops and rustling some domestic animals belonging to the people.\nHowever, a police spokesman claimed that the hoodlums are being pursued by a joint squad of security personnel while the inquiry continues.\nAccording to a community source, the bodies of the deceased were buried on Sunday, and those who were injured are being treated at the hospital.\nThe Batsari local government region is one of the worst-affected areas in the state by bandits."
  },
  {
    "headline": "Why 84-Year-Old Obasanjo Knelt Before 37-Year-Old Olu Of Warri",
    "summarized_story": "Former President Olusegun Obasanjo’s Special Assistant on Media, Kehinde Akinyemi, has explained why his boss knelt before His Royal Highness Utieyinoritsetsola Emiko, who was crowned the 21st Olu of Warri, Ogiame Atuwatse III, on Saturday.\n“He (Obasanjo) went to Warri this (Sunday) morning to pay homage to the new king.\nObasanjo is the Baba of Africa and he can pay homage to every exalted traditional seat,” Akinyemi told our correspondent on Sunday.\nThe new Atuwatse III is the son of the 19th Olu Atuwatse II, Godwin Toritseju Emiko and Gladys Durorike Emiko.\nBorn on April 2, 1984, the new Olu, a descendant of Olu Akengbuwa, studied both in Nigeria and overseas."
  },
  {
    "headline": "Bandits kidnap Zamfara monarch, kill 24 in Kaduna, Katsina",
    "summarized_story": "Some suspected bandits have abducted the district head of Adabka in Bukkuyum local government area of Zamfara state, Alhaji Nafi’u Shehu and his royal aid, Malam Ashiru Umar.\nHe claimed “the incident occurred following the withdrawal of mobile police operatives in the area barely one week ago.\nBlueprint recalled that the bandits broke into the school located at Damishi along the Kaduna – Kachia highway, Chikun local government area of the state and whisked away 121 students.\nThe bandits thereafter made fresh demand of N80 million ransom to release the remaining 78 students in captivity.\nAkanji said they expected the bandits to release all the remaining 78 students."
  },
  {
    "headline": "Jos Muslims to Christians: We’ll protect churches in our domain",
    "summarized_story": "The meeting was at the instance of Jasawa Community Development Association (JCDA), an umbrella body of Hausa and Fulani Muslims of Jos.\nIn a nine-point communiqué read by its national secretary, Alhaji Aminu Mato, the meeting agreed to protect all churches in the area.\n“This will go a long way to preventing further occurrence of crisis in Jos and its environs.\nIn attendance at the parley were religious and community leaders within and outside Jos, as well as other stakeholders.\nHe also expressed worry that the suspension of academic activities and closure of the school would pose a serious setback to the students’ academic sojourn."
  },
  {
    "headline": "Breaking: Lukaku scores on debut as Chelsea compound Arsenal Premier League woes",
    "summarized_story": "Romelu Lukaku a while ago on Sunday scored on Chelsea debut during matchday two of the English Premier League againstThe match ended 2-0 in favour of Chelsea.\nReece James also got on the scoresheet.\nDetails coming…"
  },
  {
    "headline": "Osu Caste: Stakeholders partner community to abrogate age-long practice in Igbolan -NigPilot",
    "summarized_story": "Prominent religious and traditional leaders in Mbieri community of Imo state in conjunction with the National Human Rights Commission, NHRC, have called for the abrogation of age-long Osu, Ume, Ohu, and Diala Caste practice in Igbo land.\nDr. Asinobi said, “A typical proscription of OSU involved a traditional religious ritual where the DIALA community gathered at the village shrine, with the Chief Priest of the land presiding over the ritual.\nThe OSU was tied, as the Chief Priest pronounced over his head, such curses that were supposed to come upon the land.\nBy virtue of the ritual, the OSU was regarded as one that was cursed, abominable, and untouchable.\nA lot of the OHU were captured in battles, whereas some were drawn from the OSU class.”"
  },
  {
    "headline": "APC crisis: Will leadership hammer fall on 100 members who sue party?",
    "summarized_story": "The plaintiffs argued that only the National Working Committee of the party could constitute a Caretaker Committee as provided under Article 13(4)(xvi) of the APC Constitution.\nThe row over the status of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC) has for a while threatened the fragile peace within the ruling party.\nThe APC leadership vowed to dish out maximum punishment to offenders in accordance with its constitutional provisions.\nObahiagbon said, “The APC has party Constitution and the party Constitution is quite clear on issues that has to do with the necessity of members of this political party to exhaust all domestic remedies.\nAs to what the sanction would be, for any member of this party who has fallen short of respecting the party Constitution not only with regards to taking the CECPC to Court."
  },
  {
    "headline": "2023 Presidency: Osinbajo-Ganduje posters surface in Abuja -NigPilot",
    "summarized_story": "As permutations for the 2023 presidential race continues to gather momentum, posters with pictures of Vice President Yemi Osinbajo and Governor Abdullahi Ganduje have flooded the Federal Capital Territory.\nThe posters were sponsored by a support ground called the “Osinbajo-Ganduje Alliance”.\n“We believe that if power rotates to the South, Osinbajo is best placed to unite, heal and inspire our great nation.\nKano in North West Nigeria is renowned for its politics, and boasts of the largest voter turn-out figures in Nigeria.\nLagos, Osinbajo’s political alma mater, has arguably become the hub of political influence and activity in the South of Nigeria."
  },
  {
    "headline": "NYC to sponsor Nigerian U-17 footballers to Europe -NigPilot",
    "summarized_story": "Nigerian Youth Congress , NYC, is to sponsor some Nigerian youth teams of U-17 to Europe to boost their football skills.\nPresident of the Nigerian Youth Congress, Blessing A. Akinlosotu ably represented by the Publicity Secretary, Prince Engr.\nKpoje Chukwudi made this known during a recap of the National Grassroot Football Tournament that was held over the weekend in Sapele Technical College, Delta State.\nSpeaking further, Alobari, in his speech called on the states governors and Federal ministry of youth and sports to support the good work of the National Grass-root Coaches Association.\nHowever, it is worthy of note that It is the mandate of NYC to support the upcoming young talent in sports, especially football."
  },
  {
    "headline": "15 More Abducted Bethel School Students Regain Freedom",
    "summarized_story": "Fifteen more abducted students of Bethel Baptist Secondary School in Chikun Local Government Area of Kaduna state have regained their freedom.\nAlthough the government or security agencies are yet to confirm the development, a source in the school told Channels Television that the 15 students were released on Sunday after a ransom was paid to the bandits.\nBandits suspected to be kidnappers had on July 5 attacked the school and took away 121 students from their hostels.\nMost of the victims have since returned after their families paid ransom to the gunmen, but some are still in captivity.\nDespite the incessant attacks on communities in Kaduna, the state government says it will no longer consider the option of negotiation with the criminals."
  },
  {
    "headline": "12 Killed, Six Injured As Bandits Attack Katsina Community",
    "summarized_story": "Twelve persons have been killed, with six injured following an attack by bandits on the Duba community in Batsari Local Government Area of Katsina State.\nPolice Public Relations Officer in the state, SP Gambo Isah confirmed the incident to Channels Television on Sunday via a telephone call.\nA resident of the area, Malam Aminu Batsari who was attending the burial of those killed during the incident also confirmed the attack.\nBatsari is close to the dreaded Rugu Forest, one of the ten frontline LGAs in Katsina where armed bandits have been carrying out their nefarious activities.\nBanditry is common in Katsina and other states in the North-West region despite efforts by security agencies and reassurances from the government."
  },
  {
    "headline": "Olu Of Warri: Tshola Emiko Crowned Ogiame Atuwatse III",
    "summarized_story": "The Ogiame Atuwatse III, formerly known as Omoba Tshola Emiko, has been crowned as the 21st Olu of Warri Kingdom.\nA New NameAfter he took the oath of office and adopted a title for his reign, the Olu of Warri was crowned by the Uwangue of Warri, Chief Gabriel Awala.\nThis led to the change of his name from Omoba Tsola Emiko to Ogiame Atuwatse III.\nOgiame Atuwatse III, a descendant of Olu Akengbuwa, was born on April 2, 1984, in Warri to the then Prince Godwin Toritseju Emiko, who later became the 20th Olu of Warri, Ogiame Atuwatse II, and Gladys Durorike Emiko.\nAs an entrepreneur, he founded Noble Nigeria Limited and Coral Curator limited."
  },
  {
    "headline": "VIDEO: Olu Of Warri Reverses Ancestral Curse On Nigeria, Proclaims Healing",
    "summarized_story": "The Olu of Warri, Ogiame Atuwatse III, has reversed an ancestral curse placed on Nigeria by his grandfather, Olu Erejuwa II, as a result of the injustice meted out to him.\nHe made the reversal in his first proclamation on Saturday during his coronation as the 21st ruler of the Warri Kingdom in Delta State.\n“As the spiritual, cultural, political, and traditional ruler of this land, I, Ogiame Atuwatse III, the 21st Olu of Warri, the first son of Olu Atuwatse II, the grandson of and direct descendant of Olu Erediuwa II who was offended on this throne, hereby, reverse the curse placed over this land,” the traditional ruler declared.\nIn a reaction, both traditional leaders were said to have placed a curse on the land and the issue has yet to be revisited since then.\nAccording to Atuwatse III, it is not recorded that Erediuwa II reversed the curse, neither is it recorded that Akenzua II did the same."
  },
  {
    "headline": "We’ve Gone Beyond Looking For Grazing Routes – Falana",
    "summarized_story": "Human Rights Activist and Senior Advocate of Nigeria, Femi Falana has faulted the Presidency’s approval to review grazing reserves in 25 states in the country.\nFalana who was a guest on Channels TV’s Sunday Politics, said: “we’ve gone beyond this stage of looking for grazing routes”.\n“As far as the law is concerned, the President cannot, (with profound respect), be talking of looking for grazing routes in 2021, Nigeria.\n“The Northern Governor Forum, the Southern Governors Forum, and even the Miyetti Allah group have all come to a conclusion that open grazing is obsolete,” he added.\nWe need a modern solution to this problem,” Falana said."
  },
  {
    "headline": "Gunmen kill eight, abduct scores in Zamfara Community",
    "summarized_story": "Eight persons were killed and unspecified number of persons were abducted in three communities in Bukuyyum Local government area of Zamfara state.Among the kidnap victims is a District Head of Adabka District Alhaji Nafiu Shehu and a newly wedded brideThe communities affected are Dangurunfa, Masamar Mudi and MallamawaThe gunmen stormed the area Saturday afternoon and abducted the traditional ruler in his palaceTVC NEWS also Gathered that the abduction is coming a week after mobile police unit deployed to keep peace in the area was withdrawn.\nPolice in Zamfara had Saturday evening assured residents of Tsafe local government and commuters that it has intensified ground and air surveillance to avert attack in the area.\nAdvertisementA press statement signed by the Spokesperson of the command Shehu Mohammed appealled to citizens to disregard rumour of bandits surrounding Tsafe local governmentThe statement added that security operatives has been deployed along Gusau – Yankara axis especially along black spots” The Zamfara State Police Command under is assuring the people of the State especially Tsafe LGA where report of threat by bandits to attack the town emerged that the Command in Collaboration with other security agencies especially the Military has emplaced adequate security in Tsafe and its environ to safeguard the lives and properties of the citizens” Shehu Mohammed said.\n“Joint ground and air surveillance patrols have been intensified along the Gusau – Tsafe – Yankara Road with a view to averting any attack on the communities”.\nThe Command further appeal to members of the public to remain calm and go about their normal activities and also support security operatives with credible information about the activities of criminal elements for prompt action."
  },
  {
    "headline": "PIA: N/Delta youths threaten fresh hostilities, military says we’re prepared to maintain law, order",
    "summarized_story": "This comes as the Defence Headquarters stated that the military was prepared to prevent a breakdown in law and order in the region.\n“The Niger Delta will renew its agitation.\nBut we, the youth of the Niger Delta, are networking and speaking among ourselves to know what next to do.\nSo far so good, the law has not gone down well with the youth of the Niger Delta.\nWe have all it takes to ensure that the peace and stability enjoyed in the Niger Delta remains and keep everyone secured."
  },
  {
    "headline": "Governor Ortom tasks security operatives to apprehend killers of two Pastors in Ochoro community",
    "summarized_story": "Two pastors have been reportedly assassinated by persons suspected to be members of the Bonta militia in the Ochoro community of Konshisha Local Government Area, Benue State.\nThe pastors identified as Moses Ijoko Aleje and Ijuo Emmanuel Aleje with the Methodist Church, Ochoro were killed on their way to the hospital on Tuesday at 10 a.m.An indigene of Ochoro Community stated that the two pastors, who are Igede people of Ochoro community, were gruesomely murdered by Bonta Militias on their way to Oju Local Government for medical attention.\nThe Chairman of Konshisha Local Government, James Jirgba, confirmed the killing.\nHe said received the report while he was attending a meeting at Government House in Makurdi that two persons who were on their way to the hospital, were later killed.\nAdvertisementIn a statement by the chief Press secretary, Governor Samuel Ortom has tasked security operatives to apprehend those responsible for the killing of the two pastorsThe Public Relations Officer of the Benue State Police Command, DSP Catherine Anene, could not be reached to confirm the incident as at press time."
  },
  {
    "headline": "US: Tropical Storm Henri Makes Landfall in Rhode Island",
    "summarized_story": "Tropical Storm Henri made landfall in Rhode Island early Sunday, packing heavy winds and drenching rains as it began lashing the northeastern U.S. coastline.\nThe storm was downgraded from a hurricane to a tropical storm but still packed wind gusts of up to 75 mph.\nMillions on New York’s Long Island and in southern New England braced for the possibility of flooding, toppled trees and extended power outages.\nDriving surf and sheets of rain scoured the beach towns of southern Rhode Island as the storm approached, leaving some coastal roads nearly impassable.\nRhode Island Gov."
  },
  {
    "headline": "Nigeria: Bandits Release 15 Kaduna Baptist Students after Ransom Paid, 65 Still Held Captive",
    "summarized_story": "Fifteen of the remaining 80 abducted students of Bethel Baptist High School, Damishi, Kaduna have been released from captivity.\nThe chairman of the Kaduna State chapter of Christain Association of Nigeria, Joseph Hayab, confirmed their release to ARISE NEWS.\nAccording to him, the students were released on Saturday night by the bandits.\nAn undisclosed amount of money was paid before the 15 students were freed.\nThe remaining students still in captivity are now 65."
  },
  {
    "headline": "US Civil Rights Leader Jesse Jackson and His Wife Hospitalized for Covid",
    "summarized_story": "Jesse Jackson, a famed civil rights leader and two-time presidential candidate, and his wife, Jacqueline, have been hospitalized after testing positive for Covid-19, according to a statement Saturday.\nJesse Jackson, 79, is vaccinated against the virus and received his first dose in January during a publicized event as he urged others to receive the inoculation as soon as possible.\n“Doctors are currently monitoring the condition of both,” according to the statement from Jesse Jackson’s nonprofit, the Rainbow/PUSH Coalition.\nMartin Luther King, Jesse Jackson was key in guiding the modern civil rights movement on numerous issues, including voting rights.\nEarlier this month, he was arrested outside the U.S. Capitol during a demonstration calling for Congress to end the filibuster in order to support voting rights."
  },
  {
    "headline": "Olympic Champion Elaine Thompson-Herah Runs Second Fastest Time in Women’s 100m History",
    "summarized_story": "Olympic champion Elaine Thompson-Herah ran the second fastest women’s 100m of all time at the Eugene Diamond League.\nThe race was won by Switzerland’s Mujinga Kambundji, with American Gabrielle Thomas finishing 0.08 secs ahead of world champion Asher-Smith.\nIn the men’s 200m, American Olympic bronze medallist Noah Lyles set a new meeting record and world lead of 19.52 secs.\nIn the field events, Olympic pole vault champion Katie Nageotte, also of the US, won with a jump of 4.82m, again finishing ahead of Tokyo silver medallist Holly Bradshaw.\nPortugal’s triple jump Olympic champion Pedro Pichardo continued his winning form at Hayward Field, while Ukraine’s Iryna Gerashchenko, fourth in Tokyo, won the women’s high jump."
  },
  {
    "headline": "Dozens Hurt as Israel Raids Gaza, Fires at Palestinian Protesters",
    "summarized_story": "The Israeli military has launched air raids on Gaza following clashes between its soldiers and Palestinian protesters during a demonstration to commemorate the burning of Jerusalem’s Al-Aqsa Mosque 52 years ago.\nThe raids came hours after Israeli soldiers opened fire on crowds of young Palestinians protesting at the fence separating Gaza and Israel.\nThe Palestinian health ministry said dozens of people were wounded, including a 13-year-old Palestinian boy who was shot in the head.\nAl Jazeera’s Youmna al-Sayed said at least 10 of the Palestinians wounded were children and two were in a critical condition.\nAt least 260 Palestinians, including 67 children, and 13 Israelis were killed in the fighting."
  }
]