[
  {
    "headline": "NDLEA traces N4.2bn to Abba Kyari, co-accused’s accounts",
    "summarized_story": "The details are part of a report sent to the Attorney-General of the Federation, Abubakar Malami, by the NDLEA.\nHowever, Kyari’s deputy, Ubua, may have received far more than him as not less than N2.8bn was traced to his eight bank accounts.\nKyari is facing eight counts of conspiracy, obstruction, and dealing in cocaine, and other related offences at the Federal High Court, Abuja.\nThe PUNCH learnt that the AGF’s approval was required by the NDLEA to seize a suspect’s property pending conviction by the court.\nA senior officer stated, “Under the NDLEA Act, the NDLEA cannot forfeit his assets unless based on the consent of the Attorney-General."
  },
  {
    "headline": "We won’t make gunpoint negotiations with ASUU, says FG",
    "summarized_story": "THE Federal Ministry of Education has said it will not enter into agreements with the Academic Staff Union of Universities under duress.\nThe National President, ASUU, Emmanuel Osodeke, confirmed that the NEC was indeed meeting, but refused to make further comments.\n“The NEC is meeting and details will be communicated,” the ASUU president simply said.\nIf I were ASUU, I would call off the strike and that is what we are telling ASUU to do.\n“The Federal Government had referred UTAS to NITDA to conduct user acceptance test and vulnerability test assessment and penetration test prior to the final deployment."
  },
  {
    "headline": "Senate under Saraki passed most bills, group replies BMO",
    "summarized_story": "THE Saraki Support Group has said the eighth Senate under Dr Bukola Saraki passed the most bills since 1999 to give direction to the economy and strengthen the country’s ability to tackle corruption.\n“The facts are there that the eighth Senate passed the most bills since 1999 and they are not just ordinary bills.\nHe added, “The 319 bills passed by the eighth Senate are more than all the bills passed by the fourth, fifth, sixth, and seventh Senate combined.\nThe same thing is with the 192 petitions successfully attended to by the eighth Senate.\nUp till today, some of the innovations introduced by the eighth Senate continue as a tradition in the Senate."
  },
  {
    "headline": "Lagos holds grand finale of Spelling Bee competition",
    "summarized_story": "By Adesina WahabThe Office of Education Quality Assurance in the Lagos State Ministry of Education has announced that the grand finale of the 20th edition of the Lagos State Annual Spelling Bee Competition for public school students will hold on 16th and 17th March, 2022, at the Adeyemi Bero Auditorium, Alausa, Ikeja.\nThe Spelling Bee project was pioneered in 2001 by the former First Lady of Lagos State, Senator Mrs. Oluremi Tinubu (OON), through New Era Foundation, with the aim of promoting excellence, healthy academic rivalry, good reading habits and public speaking proficiency among students in government schools in Lagos State.\nHer words: “These brands have magnanimously toed the line of corporate social responsibility towards the delivery of quality education and talent building in line with Governor Babajide Sanwo-Olu’s T.H.E.M.E.S.\nagenda on Education and Technology”.\nMrs. Seriki-Ayeni envisaged that this year’s competition would bring out the best in participants and also justify the state government’s strides at promoting excellence in the education sector in Lagos."
  },
  {
    "headline": "Borno Dep Gov, Kadafur congratulates Professor Dogo as new VC, Nile Varsity",
    "summarized_story": "By Ndahi Marama, MaiduguriBorno State Deputy Governor, Hon Umar Usman Kadafur has congratulated Professor Dili Dogo Over his recent appointment as the new Vice-Chancellor Nile University.\nA statement, which Kadafur personally signed on Sunday, was made available to our Correspondent in Maiduguri indicates that the deputy governor is so thrilled to hear that Professor Dili Dogo reached his goal.\nThe deputy governor said that he always knew Dogo could do it, and he is incredibly proud of him.\nYou set an amazing example for everyone in Borno State and the country at large.\nDogo who hail from the Marama town of Hawul local government area, southern Borno senatorial district, is happily married with children."
  },
  {
    "headline": "Electoral Act: Senate’s rejection of Buhari’s amendment right — Saraki",
    "summarized_story": "Dr Bukola SarakiBy Olayinka AjayiFormer Senate President, Bukola Saraki has commended the Senate for shutting down President Muhammadu Buhari’s proposed amendment to Section 84 (12) of the Electoral Act.\nSpeaking on a monitored programme on Channels television, ‘Sunday Politics’ Saraki who lauded the Red Chamber for being nationalistic in its approach said: “I must commend the Senate for doing the right thing.\nWhat is the right thing?\nSo, the Senate did the right thing.\nThat is why I think they did the right thing."
  },
  {
    "headline": "It’s not recorded in law that a Governor can be removed as a result of defection — Ebonyi Senator",
    "summarized_story": ",By Peter Okutu, AbakalikiA former Senator in Ebonyi State, Senator Julius Ucha, Sunday, described the Court verdict on the removal of Governor David Umahi and his Deputy, Dr Kelechi Igwe as unconditional and illegal.\n“Therefore, I do not know why the issue of the defection of a State Governor is a subject matter of litigation.\nThe 1999 Constitution of the FRN as amended has a specific provision as to how a Governor can vacate his office.\nIt is not known to law or the Constitution that a Governor can be removed from office as a result of defection”.\nHe however stated that if a Party secures judgement against a State Governor on defection, the Governor has the right to appeal such judgement as in the case of Umahi and his deputy."
  },
  {
    "headline": "Ebonyi: APC lampoons Wike over utterances against Umahi",
    "summarized_story": "By Peter Okutu, AbakalikiThe Ebonyi State chapter of the All Progressives Congress, APC, Sunday, came heavily on Governor Ezenwo Nyesom Wike of Rivers State for allegedly making uncomplimentary remarks against the personality and political status of Governor David Nweze Umahi of Ebonyi State.\nThe statement read in part: “The attention of the Ebonyi State Chapter of the All Progressives Congress (APC) has been drawn to the reckless outburst of the primitive Governor of Rivers State, Nyesom Wike.\nThe Rivers State Governor was reacting to the very unjust and widely condemnable Federal High Court ruling which recently sacked Governor Umahi and his Deputy, Dr Kelechi Igwe.\n“Nigerians are very much aware that there is no comparison between the widely rated performing Governor of Ebonyi State, Engr.\nChief David Umahi, and the power-drunk Governor of Rivers State, Nyesom Wike, in any area, as Governor Umahi clearly surpasses the sleeping Governor of Rivers state in all indexes of performance both in private life and in Public service."
  },
  {
    "headline": "Abiodun inspects industrial Atan-Lusada-Agbara Road, says project ready September",
    "summarized_story": "Ogun State governor, Dapo Abiodun, has disclosed that the ongoing construction of the 19- kilometre Atan- Lusada-Agbara road in Ado-Odo/ Ota Local Government Area of the state, will be ready for commissioning in September.\nAbiodun gave this disclosure on Sunday after inspecting the level of work done on the industrial road.\nHe noted that the contractor handling the project has divided it into three sections: O-6, 6-11 and 11-19 for ease of execution of the road.\nAccording to him, “one lane of the road is expected to be completed by the end of the second quarter of this year, while the whole road project would be completed by September, 2022”.\n“This very road is what earned us the industrial capital of this country."
  },
  {
    "headline": "2023: Groups condemn attack on Akwa Ibom Speaker during consultations",
    "summarized_story": "Two groups, The Mandate Eye and the Akwa Ibom Integrity Alliance, have condemned the attack on Hon.\nAniekan Bassey, Speaker of the Akwa Ibom State House of Assembly at Ibiono Ibom Local Government Area.\nBassey and Godwin Ekpo, the member representing Ibiono Ibom in the Assembly, had gone to consult stakeholders of the Peoples Democratic Party (PDP) on his senatorial ambition before the speaker was attacked by youths.\nBarrister Abia, who is the chairman of the Akwa Ibom Integrity Alliance, expressed disappointment that some people could constitute a nuisance and go about harassing politicians who do not align with their views in the 21st century.\nThat Mr Speaker did not allow the appurtenances and weight of his office to influence him typifies altruistic leadership."
  },
  {
    "headline": "Islamic scholar advocates proper training for children to curb social vices",
    "summarized_story": "An Ibadan-based Islamic cleric, Mallam Ali Temitope Abdussalam, has advised parents to give their children proper training before they become adults.\nAbdussalam, who is the Director of Ali Institute for Qur’an memorisation, Ibadan, noted that failure to give children proper home and spiritual training they need at a tender age may lead to regret when they grow up to be adults.\nAbdussalam made these disclosures on Sunday in Ibadan, the Oyo State capital, during the graduation of his students.\n“Always remember that failure to give them the spiritual diet they need today will lead to regret tomorrow regardless of their level of western education.\n“We are all witnesses to the aftermath effect of these tools being deployed by shaytan."
  },
  {
    "headline": "NCC boss, Danbatta receives multiple awards at International Women’s Day event",
    "summarized_story": "For Prof. Umar Garba Danbatta, the Executive Vice Chairman and Chief Executive Officer of the Nigerian Communications Commission (NCC), the 2022 International Women’s Day became a day for acknowledging his role in women empowerment in the country, as numerous beneficiaries of his efforts decorated him with awards of recognition.\nIn the same vein, the CDS, Mumbayya House and KCSF also presented their award of recognition to the EVC, leaving the NCC boss visibly surprised.\nEqually, the Director of Legal and Regulatory Services is a woman, and lastly the Director of Projects.\nImportantly, more than 50% of the workforce in NCC is made up of women,” Danbatta informed his audience.\nThe NCC boss further stated that the Commission is particularly committed to bridging the gender-oriented digital divide."
  },
  {
    "headline": "Umahi’s removal order unconstitutional, illegal – Ebonyi Senator, Ucha",
    "summarized_story": "A former Senator in Ebonyi State, Julius Ucha, has described the removal order of Ebonyi State Governor, Engr David Umahi, and his deputy, Barrister Kelechi Igwe, as illegal.\n“Therefore, I do not know why the issue of the defection of a state Governor is a subject matter of litigation.\nThe 1999 Constitution of the FRN as amended has a specific provision as to how a Governor can vacate his office.\nIt is not known to law or the Constitution that a Governor can be removed from office as a result of defection”.\nHe said that when the PDP was talking about reclaiming Ebonyi State, it was not only a distraction but deception and diversionary to make it difficult for Governor Umahi to install his successor."
  },
  {
    "headline": "Depression after childbirth: A silent killer",
    "summarized_story": "Many women experience unexplainable emotional changes after childbirth, one of which is post-partum depression.\nOmotola Uti, a mother of one, knew nothing about postpartum depression (PPD) till a few weeks to her delivery date.\nPostpartum depression suffered by a mother following childbirth, typically arising from the combination of hormonal changes, psychological adjustment to motherhood, and fatigue; postnatal depression.\nPostpartum depression and its causes explainedAccording to medical practitioners, depression after childbirth falls under types of mental illnesses which affect human beings, especially women.\nWhat most women experience is postpartum blues within the first three days of delivery, and over 80 per cent of women experience blues."
  },
  {
    "headline": "PDP disowns ‘primary election timetable’",
    "summarized_story": "The Peoples Democratic Party (PDP) has disowned a purported timetable for the party’s 2023 primary election currently circulating in the social media.\nThe main opposition said the circulating timetable, purported to have been signed and released by PDP’s National Organising Secretary Umar Bature, as fake.\nIn a statement yesterday in Abuja by the party’s spokesman Debo Ologunagba, the PDP urged its members and the public to ignore the document.\nThe spokesman said the party had not released any timetable for its primary elections.\n“At the appropriate time, the official timetable and schedule of activities of the PDP, when approved, will be formally announced and published through the official communication channels of our party and not in the social media.”"
  },
  {
    "headline": "GenCos accuse federal agency NBET of owing N1.6tr",
    "summarized_story": "Ogaji put the nation’s current electricity generation at 4,000Megawatts and blamed the development on poor management of the power grid.\nOne of the reasons that the power plants are down is due to inefficient management of the grid,” she told reporters.\nThe APGC spokesman recalled that power generating plants were doing better when they were managed by a technical expert, Marek Martin.\nWhen Marcel Martin was in Nigeria, he developed tools that were used to manage the grid by both the generation companies and distribution companies.\nThe Executive Secretary noted that were the thermal plants working optimally, the GenCos would produce about 9,000MW."
  },
  {
    "headline": "IPOB to Southeast leaders: Kanu innocent, don’t beg for his release",
    "summarized_story": "The Indigenous People of Biafra (IPOB) yesterday asked Southeast leaders to stop begging for the release of its leader, Nnamdi Kanu.\nKanu is facing terrorism charges before Justice Binta Nyako of the Federal High Court in Abuja.\nIn a statement by its Media and Publicity Secretary, Emma Powerful, IPOB described the charges against its leader as empty and laughable.\n“What is expected to happen on 8th of April 2022, is total acquittal and discharge of Mazi Kanu and nothing more.\nThe Federal Government said Kanu directed IPOB members “to manufacture bombs” and to “destroy public facilities”."
  },
  {
    "headline": "NMDPRA: we don’t know how $1.27b was deducted from Federation Account",
    "summarized_story": "The Nigeria Midstream and Downstream Petroleum Regulatory Authority (NMDPRA, formerly Department of Petroleum Resources, DPR) has told the House of Representatives that only the Nigerian National Petroleum Company (NNPC) Limited can explain why it deducted about $1.2 billion from the Federation Account in 2019.\nThe agency said this in its response to a query from the Office of the Auditor General of the Federation (OAuGF) which asked it to recover the money from the NNPC or face sanction.\nFailure to do this, it said, the agency should be sanctioned for failure to collect and account for government revenue as stipulated in Paragraph 3112 (i) of the Financial Regulations.\nBut when the management appeared before the Public Accounts Committee of the House of Representatives, it said the money deducted by the NNPC was for priority projects of the Federal Government, adding that only the company could explain the deduction.\nThe NMDPRA said the money, which was supposed to enter an account belonging to the DPR and controlled by the AuGF, never entered the account."
  },
  {
    "headline": "I didn’t exonerate Kyari, I only ask for further probe – Malami",
    "summarized_story": "From Godwin Tsa, AbujaThe Attorney-General of the Federation and Minister of Justice (AGF), Abubakar Malami, SAN has refuted media reports that his Office had conclusively exonerated Abba Kyari.\nThe AGF who made the clarification on Sunday through a statement by his Special Assistant on Media and Public Relations, Dr. Umar Gwandu, described the report as false.\nIt was a case of work in progress in respect of which the office of the Attorney General of the federation requested for further probe in relation to some aspects of investigation.\nDr. Gwandu said that It was clear that the conclusion on the alleged contradiction on the issue was a clear case of misconception.\nThe issues were raised for further investigation with a view to cover the field in investigation in order to arrived at informed decision."
  },
  {
    "headline": "2023: PDP Govs insist on presidency",
    "summarized_story": "Sunday Sun gathered that to achieve this objective, both the PDP and APC governors are making frantic efforts to ensure that their colleagues clinch the presidential ticket of the two major political parties.\nGovernors speculated to be eyeing the 2023 presidency include Aminu Tambuwal, Sokoto; Bala Mohammed, Bauchi; Nyesom Wike, Rivers; Emmanuel Udom, Akwa Ibom; Ifeanyi Ugwuanyi, and Kayode Fayemi, Ekiti.\nThe PDP governors had last December ensured that their preferred candidates emerged as members of the party’s National Working Committee (NWC).\nWhile the APC governors are currently locked in an epic battle with other party leaders over control of the ruling party, ahead of the presidential primary.\nThe NEC meeting is expected to take critical decisions on issues relating to the 2023 polls, especially as it concerns the zoning of the presidential ticket and guideline for party primary."
  },
  {
    "headline": "Abia guber: Ikpeazu moves to lobby PDP stakeholders on preferred successor",
    "summarized_story": "The ward leaders are automatic delegates who will select the PDP candidate in a primary election.\nFormer governor of Abia State and senator representing Abia Central, Theodore Orji, last week announced his support for power shift to Abia North, instead of any other part of the state.\nElders of Ngwaland and Ukwa in the state had attacked Senator Orji, saying they are in support of Governor Ikpeazu to pick a successor from Ngwaland.\nMeanwhile, Abia PDP will this week make reconciliation effort to mend broken fences ahead of selection of candidate for next year’s election.\nThose to be met are former Senate President, Adolphus Wabara; Governor Ikpeazu, Senator Orji; former governorship candidate of PDP in 2007, and Chief Onyema Ugochukwu, among others."
  },
  {
    "headline": "Lagos: Sanwo-Olu’s second term non-negotiable – Ogunlewe",
    "summarized_story": "Frontline chieftain of the All Progressives Congress (APC) and former Minister of Works, Senator Adeseye Ogunlewe, has said that the party must prioritize to promote stability of Lagos State by making sure that Governor Babajide Sanwo-Olu gets a second term.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThere is no sense in stopping him or not allowing him to complete the commendable works he is doing in the state.\nAccording to him, “we don’t want disruption again, breaking of policies and government has negatively affected Lagos State and we must avoid it at all costs”.\nYou have been consistent in terms of service delivery to the people of Lagos and indeed this country."
  },
  {
    "headline": "I see advances from men as compliments –Amaka Alberto Ama, beauty queen",
    "summarized_story": "By Christy AnyanwuHer dream from childhood was to become a beauty queen and it came to pass recently when she was crowned Miss Ututu 2022.\nHow did you get to know about Miss Ututu beauty pageant?\nI got to know about the beauty pageant through social media, Facebook to be precise, and I had to jump at it.\nWhat’s the reaction of your boyfriend to your emergence as a beauty queen?\nMy advice for girls who may want to enter for beauty pageant is to be straightforward and honest."
  },
  {
    "headline": "Buhari Reads Riot Act to APC Leaders, Cautions against Name-calling, Backstabbing",
    "summarized_story": "Rather, he said, the party must be ready to put its house in order ahead of the planned national convention of the party holding in Abuja on March 26, 2022.\nHe stressed that whenever the substantive chairman comes back, the acting chairman would have to give way.\nINEC as an institution has said that as far as it is concerned, Governor Buni remains the chairman of the party.\nAt the meeting, it was gathered that the party chieftain urged Akpanudoedehe to sign the notice of the NEC meeting.\nThe source noted that all efforts are to ensure that the convention date of the party is not postponed."
  },
  {
    "headline": "Anxiety as PDP National Caucus, NEC Meet Over Presidential Ticket",
    "summarized_story": "Chuks Okocha in AbujaThere is anxiety among members of the Peoples Democratic Party (PDP) as the national caucus of the main opposition party and the party’s National Executive Committee (NEC) meet on Monday (tomorrow) and Tuesday to take a decision on the presidential ticket of the party, THISDAY has learnt.\nThe party also urged its national caucus to determine the implications of throwing the presidential ticket open.\nTHISDAY gathered that the report of the Bauchi State governor’s committee would form the main agenda of the national caucus meeting and NEC meetings of the PDP.\n“In the memo to the national caucus, there are variables we want them to consider.\nOne is whether geopolitical zoning is in the interest of the PDP in winning the presidential election come 2023 and two, what will it cost the PDP if it throws the presidential ticket open."
  },
  {
    "headline": "Again, Crude Oil Production by OPEC, Allies Falls by 890,000 bpd",
    "summarized_story": "It was also a month that saw Nigeria raise output to 1.51 million bpd, a marked improvement from the previous few months when the country struggled to produce between 1.2 million bpd and 1.4 bpd.\nThe latest report showed that production from OPEC+ participants was 38.25 million bpd in February, up from 37.91 million bpd in January, but below the target of 39.14 million, according to an Argus survey, which shares insights and analyses about energy and commodity markets worldwide.\nA day earlier, crude oil prices fell significantly, tumbling from a 2008 high of $130, about the largest single-day percentage decline since April 2020.\nNigeria’s benchmark oil dropped 13 per cent to $111 a barrel, while the WTI crude oil which topped $130 at the height of trading earlier in the week, lost 12 per cent.\nMinister of State Petroleum, Mr Timipre Sylva, last week said that the absence of long-term investment in the oil and gas sector, as well as insecurity, should be blamed on Nigeria’s current low crude oil production."
  },
  {
    "headline": "Ganduje: Nigeria’s Challenges Linked to Faulty Foundation Laid by Colonialists",
    "summarized_story": "Kemi Olaitan in IbadanKano State Governor, Dr. Abdullahi Ganduje, has attributed the challenges of nation-building in Nigeria to the faulty foundation laid by the colonial masters.\nThe governor said that the faulty foundation laid by the colonial masters was purely done to actualise their interests and not for any genuine development of the country.\n“The challenges of nation-building in Nigeria are attributable to the very faulty foundation laid by the European colonial masters.\nGanduje said that the colonial rule divided Nigeria into North and South without much concern for the peculiarities of the two regions.\n“Nation-building is about building a common sense of purpose, sense of shared destiny and collective imagination of belonging."
  },
  {
    "headline": "NBA, Others Kick against Proposed NITDA Bill 2021",
    "summarized_story": "*Say bill conflicts with regulatory powers of existing agenciesEmma OkonjiLegal experts in Nigeria who attended the two days stakeholders’ forum on National Information Technology Development Agency (NITDA) Bill 2021 in Lagos, which ended at the weekend, have picked holes in the new propositions contained in the proposed bill, which is a Repeal and Re-Enactment Bill 2021.\nThe legal practitioners described the bill as infiltrating and an attempt to unnecessarily duplicate the regulatory powers of some existing government agencies in the country.\nThey made their positions known during a webinar session on ‘Stakeholders’ Engagement for Legal Practitioners in Nigeria on National Information Technology Development Agency Bill, 2021.\nThis followed an earlier stakeholders’ engagement meeting held by NITDA in Abuja to consider the proposed NITDA Bill 2021 which, among other things, was aimed at changing NITDA from an IT Development Agency, to a regulator of the information technology industry ecosystem.\nThe legal practitioners called on those that drafted the NITDA Bill 2021 to go back and review it and ensure that they address all the areas of regulatory conflict with existing regulatory powers and functions of other agencies."
  },
  {
    "headline": "Nigerian Soldier Caught Extorting Money From Motorists By Superior Officer Cries, Begs For Forgiveness",
    "summarized_story": "A soldier has be caught extorting money from motorists along the popular Maiduguri-Damaturu Highway by a superior officer.\nWhile the time the video was shot was unknown, the soldier was seen crying, prostrating and pleading with a senior officer, who caught him extorting a motorist.\nThe soldier was asked by the superior to surrender all the money extorted from motorists.\nWhile the armed soldier was heard saying he has worked for many years for the Nigerian Army amid tears, the unknown superior officer responded by telling the erring personnel that he was behaving like a low-level soldier.\nCommenting on the video, a soldier said, “He is not a young soldier at all, he is a staff sergeant, it’s so sad."
  },
  {
    "headline": "Nigerian Soldier Caught Extorting Money From Motorists By Superior Officer Cries, Begs For Forgiveness",
    "summarized_story": "A soldier has be caught extorting money from motorists along the popular Maiduguri-Damaturu Highway by a superior officer.\nWhile the time the video was shot was unknown, the soldier was seen crying, prostrating and pleading with a senior officer, who caught him extorting a motorist.\nThe soldier was asked by the superior to surrender all the money extorted from motorists.\nWhile the armed soldier was heard saying he has worked for many years for the Nigerian Army amid tears, the unknown superior officer responded by telling the erring personnel that he was behaving like a low-level soldier.\nCommenting on the video, a soldier said, “He is not a young soldier at all, he is a staff sergeant, it’s so sad."
  },
  {
    "headline": "Cocaine Saga: Nigerian Anti-drug Agency, NDLEA Moves To Extend Abba Kyari’s Detention To Investigate Disgraced Police Officer's Choice Assets",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) on Thursday filed a court application seeking the extension of the detention of the suspended Deputy Commissioner of Police, Abba Kyari and four other suspects involved in an alleged drug deal.\nThe extension is for the agency to investigate the assets Kyari claimed to own in a viral video.\nAbba Kyari confessed to the ownership of the choice estates in Lekki, Victoria Island, Lagos; Gussappe and Highbrow Asokoro in the Federal Capital Territory, Abuja, Vanguard reports.\nIt was learnt that NDLEA operatives gave him an asset verification form to fill and are attempting to verify the properties he claimed he claimed were his in the video.\nIt was also learnt that forensic analysis of the exhibits recovered from the suspects and other accomplices was done to get more suspects involved in the cocaine deal arrested."
  },
  {
    "headline": "Cocaine Saga: Nigerian Anti-drug Agency, NDLEA Moves To Extend Abba Kyari’s Detention To Investigate Disgraced Police Officer's Choice Assets",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) on Thursday filed a court application seeking the extension of the detention of the suspended Deputy Commissioner of Police, Abba Kyari and four other suspects involved in an alleged drug deal.\nThe extension is for the agency to investigate the assets Kyari claimed to own in a viral video.\nAbba Kyari confessed to the ownership of the choice estates in Lekki, Victoria Island, Lagos; Gussappe and Highbrow Asokoro in the Federal Capital Territory, Abuja, Vanguard reports.\nIt was learnt that NDLEA operatives gave him an asset verification form to fill and are attempting to verify the properties he claimed he claimed were his in the video.\nIt was also learnt that forensic analysis of the exhibits recovered from the suspects and other accomplices was done to get more suspects involved in the cocaine deal arrested."
  },
  {
    "headline": "Cocaine Saga: Nigerian Anti-drug Agency, NDLEA Moves To Extend Abba Kyari’s Detention To Investigate Disgraced Police Officer's Choice Assets",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) on Thursday filed a court application seeking the extension of the detention of the suspended Deputy Commissioner of Police, Abba Kyari and four other suspects involved in an alleged drug deal.\nThe extension is for the agency to investigate the assets Kyari claimed to own in a viral video.\nAbba Kyari confessed to the ownership of the choice estates in Lekki, Victoria Island, Lagos; Gussappe and Highbrow Asokoro in the Federal Capital Territory, Abuja, Vanguard reports.\nIt was learnt that NDLEA operatives gave him an asset verification form to fill and are attempting to verify the properties he claimed he claimed were his in the video.\nIt was also learnt that forensic analysis of the exhibits recovered from the suspects and other accomplices was done to get more suspects involved in the cocaine deal arrested."
  },
  {
    "headline": "I’ll declare presidential ambition before end of March, says Saraki",
    "summarized_story": "Bukola Saraki, former senate president, says he has “what it takes” to lead Nigeria.\nThe former Kwara governor said he has been touring the country with his team to consult stakeholders on his presidential ambition.\nAccording to him, he will declare his intention to run for president in 2023 after the Peoples Democratic Party (PDP) decides which geopolitical zone will get its presidential ticket.\n“Short of anything that stops an individual, I will definitely be announcing sometime before the end of the month, my intention to vie for president.\n“There are people who can provide solutions to the problems of the country if you give them the opportunity.”"
  },
  {
    "headline": "I’ll declare presidential ambition before end of March, says Saraki",
    "summarized_story": "Bukola Saraki, former senate president, says he has “what it takes” to lead Nigeria.\nThe former Kwara governor said he has been touring the country with his team to consult stakeholders on his presidential ambition.\nAccording to him, he will declare his intention to run for president in 2023 after the Peoples Democratic Party (PDP) decides which geopolitical zone will get its presidential ticket.\n“Short of anything that stops an individual, I will definitely be announcing sometime before the end of the month, my intention to vie for president.\n“There are people who can provide solutions to the problems of the country if you give them the opportunity.”"
  },
  {
    "headline": "Sources: Buhari has approved sanctions for those responsible for off-spec petrol",
    "summarized_story": "President Muhammadu Buhari has approved sanctions for those responsible for the importation of off-spec petrol into the country, TheCable understands.\nIn February, the president had ordered that “producers and providers” of the petrol with methanol quantity above Nigeria’s specification, which was recently imported into the country, must be held accountable.\nAdvertisementThe source said Buhari approved a plan, which included provisions for sanctions for those who responsible for the importation of the off-spec petrol.\n“The plan is designed to do everything necessary to end the scarcity quickly and hold those responsible for it in the first instance responsible to avoid a repeat,” the source said.\n“The 24-hour operations also have an enforcement element with monitoring teams to prevent any act of sabotage and ensure smooth operations."
  },
  {
    "headline": "Sources: Buhari has approved sanctions for those responsible for off-spec petrol",
    "summarized_story": "President Muhammadu Buhari has approved sanctions for those responsible for the importation of off-spec petrol into the country, TheCable understands.\nIn February, the president had ordered that “producers and providers” of the petrol with methanol quantity above Nigeria’s specification, which was recently imported into the country, must be held accountable.\nAdvertisementThe source said Buhari approved a plan, which included provisions for sanctions for those who responsible for the importation of the off-spec petrol.\n“The plan is designed to do everything necessary to end the scarcity quickly and hold those responsible for it in the first instance responsible to avoid a repeat,” the source said.\n“The 24-hour operations also have an enforcement element with monitoring teams to prevent any act of sabotage and ensure smooth operations."
  },
  {
    "headline": "'Unconscionable cruelty' -- WHO, UN seek end to 'horrific attacks' in Ukraine",
    "summarized_story": "“Today, we call for an immediate cessation of all attacks on health care in Ukraine,” the statement reads.\nAdvertisement“These horrific attacks are killing and causing serious injuries to patients and health workers, destroying vital health infrastructure and forcing thousands to forgo accessing health services despite catastrophic needs.\n“Agencies noted that since the start of the war, 31 attacks on health care have been documented via the WHO’s Surveillance System for Attacks on Health Care (SSA).\nAccording to these reports, in 24 incidents health care facilities were damaged or destroyed, while in five cases ambulances were damaged or destroyed.\n“The health care system in Ukraine is clearly under significant strain, and its collapse would be a catastrophe."
  },
  {
    "headline": "Nigerian government shuts down 6 illegal digital loan companies",
    "summarized_story": "According to Punch, digital lending platforms like GoCash, Okash, EasyCredit, Easi Moni, KashKash, and Speedy Choice were among the busted companies.\n“This information started quite a while ago.\nThese companies move around a lot, and it took us several months visiting each of their locations,” he said.\nWith no address, all these companies have are mobile apps that can be downloaded on both Google and Apple Stores.\nWe also understand that there are between 5 and 7 companies operating at the same location,” said Irukera, hinting at the agency’s ambition to cleanse the nation of all illegal digital lending practices."
  },
  {
    "headline": "Peace Ojemeh’s Haze Monkey finds a home in the $80 billion NFT industry",
    "summarized_story": "By the time she gathered enough knowledge, she reached out to her friend Alabo Briggs, 22, a blockchain engineer, about building their own NFT collection.\nThe next one is the animation series about Haze Monkey’s unique stories where holders and community members will be characters.\nBefore the countdown campaign started, Haze Monkey had gathered over 5,000 organic social followers and over 6,000 Discord community members from across the globe.\nBut Haze Monkey did about 20%.\nThough built by Africans in Africa, Haze Monkey has already positioned itself as a global brand."
  },
  {
    "headline": "Nigerian banks cut dollar spending limit for naira debit cards",
    "summarized_story": "Over the past month, at least 2 of Nigeria’s largest commercial banks have announced reduced limits on international transactions using naira debit cards to $20 (around ₦10,000) per month.\nThis comes as a longstanding scarcity of foreign exchange continues to bite Africa’s largest economy and biggest oil exporter, despite the recent surge in global energy prices.\nNigerians can use their naira-denominated debit cards to pay for transactions billed in US dollars online.\nFor every purchase, debits are made directly from their naira accounts at current exchange rates.\n“Remember you can use your UBA Dollar, Pounds or Euro Card for international POS, ATM, and web transactions,” UBA’s mail read."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Protecting your mental health and privacy",
    "summarized_story": "Is mental health only related to mental illnesses?\nThis means that someone may have good mental health, no mental illness or be somewhere in between.\nHaving good mental health and no mental illness is at the top of the spectrum, while having poor mental health and a mental illness is at the bottom.\nWhile the people who are somewhere in the middle may have good mental health but a mental illness, they may also have poor mental health but no mental illness.\nConsequently, we must all strive to be at the top of the mental health spectrum which begins with prioritising your mental health as much as you do your physical and sexual health."
  },
  {
    "headline": "Nigeria has a new data protection enforcing body; here’s why you should care",
    "summarized_story": "Among other things, the statement credits the introduction of the Nigeria Data Protection Regulation (NDPR) and the National Digital Economy Policy and Strategy (NDEPS) with creating more awareness about data protection and resulting in the “datafication” of the Nigerian economy.\nAccording to the European Commission, “DPAs are independent public authorities that supervise, through investigative and corrective powers, the application of the data protection law.\nAccording to Suleiman’s statement, the NDPB would “support the process for the development of a primary legislation for data protection and privacy.”The race to a dedicated data protection and privacy law has taken several turns.\nFilled with false starts, the closest Nigeria has come to a law passed by the National Assembly was in 2018 with the Nigeria Data Protection Bill 2018.\nThe Bill provides a much more robust approach to data protection, providing for more categories of data than the NDPR, which appears to deal more with electronic data."
  },
  {
    "headline": "Building a tech startup with no-code tools",
    "summarized_story": "Building a startup with no-code toolsCross section of Ozi team.\nTwo University of Lagos (UNILAG) graduates — Adejumo Azeez and Israel Akpan — are building a tech startup without writing one line of code.\nAfter spending months looking for a developer to build their product, the duo resorted to no-code tools.\nBut even a startup built with no-code tools still has challenges.\nTheir startup, Ozi, can be described as a Communications as a Service product that Azeez and Akpan started in the university."
  },
  {
    "headline": "Abia Charter of Equity tears political leaders apart",
    "summarized_story": "Torn apart and at each other’s throats are the Old Bende zone and Aba zone.\nThe second term of Governor Okezie Ikpeazu, who is from Aba zone (Ngwa), will expire in May 2023.\nBut his stance has pitched him against the political stakeholders of Ukwa-Ngwa zone who are insisting that the Old Aba Zone should produce Ikpeazu’s successor in 2023.\nAba Zone has had only Dr Okezie Ikpeazu, who will complete eight years from May 2015 to May 2023.\nAnother eight years for Umuahia Zone would be 26 years for Umuahia Zone and eight years for Aba Zone."
  },
  {
    "headline": "Fuel crisis in 10 frames",
    "summarized_story": "Fuel crisis in 10 framesThe Petrol scarcity, or fuel crisis, in Nigeria has foisted untold hardship on motorists and commuters alike.\nWale Amoo captures the emotions in 10 photo frames."
  },
  {
    "headline": "Edo poly rector hails Obaseki’s strides in education, as school matriculates over 1000 new students – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Polytechnic, Usen, has matriculated 1,050 new students into its National Diploma and Higher National Diploma programmes for the 2021/ 2022 academic session.\nIn an address, the Rector of the polytechnic, Professor Abiodun Falodun, applauded Edo State Governor, Mr Godwin Obaseki, for his consistent support in ensuring that the institution becomes a world-class polytechnic.\nHe noted that the governor was instrumental in the success recorded during the last accreditation and resource inspection of programmes in the polytechnic.\nAccording to him, “It is my pleasure to inform you that during the last accreditation exercise, some academic programmes were fully accredited by NBTE.\nThe Management is also making preparations to invite NBTE for accreditation and resource inspection of more programmes (precisely, the NBTE team will visit Edo Poly 23rd and 24th March)."
  },
  {
    "headline": "Obaseki swears in new commissioner, inaugurates Edo Sports Commission – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has sworn in a new commissioner and inaugurated the Edo State Sports Commission.\nAddressing the new Commissioner, Obaseki noted, “You are going to be overseeing Culture, and its related to Diaspora Affairs.\nObaseki continued: “Yusuf Ali, the Chairman of the Edo Sports Commission has excelled, both locally and internationally.\nHe further noted, “Edo State can start now to prepare for a global market in sports by identifying young talents in schools and catching them young.\nWe should excel in all areas of sports as we continue to invest in sports development.”Chairman of the Edo State Sports Commission, Yusuf Ali pledged that his team will do their best to transform sports in Edo."
  },
  {
    "headline": "Edo kicks off operation show your building plan, serves demand notice to defaulters – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, at the weekend, commenced a recertification exercise for house owners in the Ugbor and Amagba communities within the Benin metropolis.\nAs a part of the exercise, property owners and developers within the affected areas are expected to provide their building plans upon demand at their houses and sites for clearance and recertification.\nOfficials of the Edo State Enforcement Team under the Ministry of Physical Planning, Urban and Regional Development, however, marked houses that could not provide evidence of their building plans and served them contravention/demand notices, either by hand or by pasting them on the buildings.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, said the exercise is in line with the government’s vision of actualising the 30-year development plan.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Accident claims 12 on Ilorin-Ogbomoso Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestILORIN – Twelve people are feared dead in a road accident which occurred on Ilorin-Ogbomoso Road on Saturday.\nMr Jonathan Owoade, Kwara Sector Commander of the Federal Road Safety Corps, gave the figure to newsmen in Ilorin.\nHe blamed the accident on route violation, speed limit violation and loss of control.\nOwoade advised motorists to adhere to road safety rules and regulations and be in the right frame of mind.\n“We will ensure that, on our own part, we continue to enlighten motorists on road safety precautions."
  },
  {
    "headline": "Osun Govt to Review Chiefs Law, Sets up tripartite committee",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Adegboyega Oyetola, on Sunday expressed his administration’s readiness to set up a tripartite committee that would review the existing Chiefs Law of the State.\n“As to the Chiefs Law of our dear State, we will be very happy if that is reviewed.\nIt is our hope that this would further strengthen the traditional institution which has been our vision as a government.\n“So, to further demonstrate our commitment to ensuring a vibrant and viable traditional institution, we will set up the committee to look into it.\nOba Olabomi who is the leader of the Committee on State Chiefs Law set up by the members of the Traditional Council of Obas, said the review of the Law would help to innovatively reposition the traditional institution in the State."
  },
  {
    "headline": "Malami makes u-turn on Abba Kyari, says no evidence linking him with money laundering",
    "summarized_story": "Abubakar Malami, Nigeria’s Attorney General and Minister of Justice, has made a u-turn in his latest advice regarding the suspended Deputy Commissioner of Police, Abba Kyari, noting that there is no evidence linking the embattled police officer to money laundering.\nThe AGF’s February letter contradicted his January directive that Kyari should be probed for money laundering and for receiving 33 proceeds of crime.\nMalami, in a legal advice, had therefore, directed the Inspector-General of Police, Usman Baba, to carry out further investigations, noting that a prima facie case of money laundering had been established against the DCP.\nAbubakar insisted that the ministry did not say there was no evidence of money laundering against Kyari.\nThe commission had rejected the police investigation on Kyari carried out by the SIP led by DIG Joseph Egbunike."
  },
  {
    "headline": "Buhari blames media for APC crisis, warns against backstabbing in party",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has blamed the media for giving undue coverage to matters that concern the All Progressives Congress (APC), which he suggested has contributed to crisis rocking the party.\nBuhari said, “This is a party that has been in existence barely for eight years, becoming the dominant party because it has thrown open its doors to defectors from other parties, big and small.\n“It is important to ask what benefits the poor are getting during the period of intense negative coverage.\n“It is therefore important for the media to put such matters into perspective.\n“Of course, the media are welcome to comment on the content of the character of the potential APC candidates; discuss their suitability for leadership; scrutinize their offer to the membership."
  },
  {
    "headline": "‘Prepare Your Handover Notes:’ Busuyi Ayowole, PRP guber candidate tells Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboAhead of July 16 governorship election in Osun State, the People’s Redemption Party (PRP) has unanimously adopted Engr.\nThe decision was made on Saturday at the end of the party’s primary election that took place at the NUJ Press Centre, along Iwo/Ibadan road, Osogbo.\nThe primary election was witnessed by party’s official from the national headquarters, Abuja.\nSpeaking shortly after his announcement, the candidate, Busuyi Ayowole, the incumbent governor should start preparing his handover notes because his party is well positioned to take over the mantle of leadership in the state.\n“I want to say it emphatically that our party, the Peoples Redemption Party (PRP) is ready to rescue our dear state from the misgovernance of the ruling APC."
  },
  {
    "headline": "ASUU Strike: UNILORIN Students Berate Federal Govt",
    "summarized_story": "As the four-week warning strike embarked upon by members of Academic Staff Union of Universities (ASUU) comes to an end, students of the University of Ilorin (UNILORIN) have berated the federal government over its failure to meet the lecturers’ demands.\nThe president and public relations officer of the UNILORIN Students Union Government (SUG), Taofik Opeyemi and Olabode Stephen respectively, made the feelings of the students known in a statement issued on Sunday.\nThe students lamented that: “As the warning strike winds off, the federal government has not exhibited the traits of meeting the demands.\n“This is not only bad for the lecturers but terrible for the university system.\n“While we do this, we urge all Unilorites and every Nigerian student to stand up as we join forces together to fight for our right – quality education,” the students stated."
  },
  {
    "headline": "I Won’t Sue Wike For Accussing Me Of Embezzlement – Abe",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) in Rivers State, Senator Magnus Ngei Abe, has ruled out dragging Governor Nyesom Ezenwo Wike to court, over allegation of embezzlement of funds levelled against him by the latter.\nWike had in 2017 accused Abe of embezzling funds meant for the construction of the Kpobie-Bodo Road in Gokana local government area of the state.\nThe former lawmaker said: “I am part of whatever success that we have had in Rivers State because I have been in Rivers State politics at least from 1998 or so.\nWe have better ideas; we know the things that did not work and cannot work, we know the things that can work and can be made better.\nAbe added: “In building a state, in building a society, in building a community, everybody has a role to play."
  },
  {
    "headline": "Ganduje, Emir Of Kano Task Olubadan On Nigeria’s Unity",
    "summarized_story": "Kano State governor, Mohammed Ganduje has enjoined the Olubadan of Ibadanland, Oba Dr. Lekan Balogun, Alli Okunmade ll to continue to work for the unity of the country.\nThe Governor who stated this during a visit to the Alarere residence of the new Olubadan of Ibadanland on Saturday added that whatever affects Ibadan affects him, describing the ancient city as a home to every Kano person and vice-versa.\nGovernor Ganduje noted that with his daughter, who was married to Idris Ajimobi, the son of the late former Governor of Oyo State, Sen. Abiola Ajimobi, he had become part and parcel of the ancient metropolis.\nIn his homage, Emir of Kano, Alhaji Aminu Ado Bayero told Oba Balogun that both the government and traditional institution in Kano State were happy for him as ‘one’ of them and enjoined him to maintain the cordial relationship existing between the two ancient metropolis.\nThe powerful Kano entourage was led to the Olubadan Palace by the former Secretary to the Oyo State Government (SSG), Alhaji Olalekan Alli, Mr. Bolaji Tunji who was former Special Adviser to the former Governor of Oyo State, late Sen. Abiola Ajimobi and Idris Ajimobi, an in-law to the Governor of Kano State, Dr. Ganduje."
  },
  {
    "headline": "Multimix Academy Hosts Roundtable On Supply Chain Education In Nigeria",
    "summarized_story": "Multimix Academy, Nigeria’s leading Supply Chain Management, Logistics, and Business Process Training Academy, hosted a roundtable conference with stakeholders in the Nigerian logistics and supply chain industry on Thursday 10th March 2022, at Radisson Blu, Victoria Island, Lagos.\nThe roundtable discussion aimed to provide Multimix Academy with the required value to the Nigerian trade industry and a curriculum review with intense industry participation.\nDr Obiora Madu, the Chairman of Multimix Academy and Director General, African Centre for Supply Chain, highlighted the purpose of the roundtable gathering in his welcome/ keynote address.\n“In the last two decades, Multimix Academy has been in the forefront of providing Logistics and Supply Chain Education in Nigeria.\nTo this end, Multimix Academy has hosted this inaugural Supply Chain Roundtable with identified Supply Chain professionals at the top of their field in various sectors of the economy to get a first-hand and credible view of the challenges and educational needs in the industry.”ADVERTISEMENT"
  },
  {
    "headline": "N1.5bn Was Moved From Ministry Account To Fani-Kayode, EFCC Tells Court",
    "summarized_story": "An operative of the Economic and Financial Crimes Commission (EFCC), Shuaibu Shehu has narrated to Federal High Court in Lagos how the sum of N1.5 billion was fraudulently transferred from the Ministry of External Affairs account to Joint Trust Dimension Nigeria Limited, allegedly belonging to a former Aviation Minister, Femi Fani-Kayode.\nThe defendants, who were accused by the EFCC of laundering the sum of N4.6 billion between January and March 2015 all pleaded not guilty to the charge.\nThe witness stated, “We commenced investigation immediately and wrote a letter of investigation activities to Zenith Bank requesting for a statement of account of Joint Trust and all the transactions in the account.\nOur findings revealed that on January 8, 13, and 16,2015, the sum of N300 million, N400 million, and N800 million respectively were transferred from the Ministry of External Affairs research library account, Ministry of External Affairs research project account, and Ministry of External Affairs research capital account respectively into Joint Trust Dimension Nigeria Limited account,” Shehu saidThe witness further testified that the monies were moved into Femi Fani-Kayode ‘s (second defendant) company account, Joint Trust Dimension Nigeria Limited with Zenith Bank.\nADVERTISEMENTThe EFCC operative further told the court that on February 4, 2015, the second defendant withdrew N170 million cash, on February 5, 2015, he withdrew N40 million, and on February 9, he withdrew N60 million."
  },
  {
    "headline": "PDP hits back at Buhari: 'Your administration most corrupt, rudderless'",
    "summarized_story": "The Peoples Democratic Party (PDP) has described the President Muhammadu Buhari-led All Progressives Congress (APC) administration as a perfect example of arrogance in failure.\nThe PDP asserted that Buhari presided over the most rudderless, corrupt, disunited, disorganized, arrogant political party and government in the history of the country; a fact that is already established by Nigerians across board.\nThe party was reacting to Buhari’s warning to APC to take a example from PDP which fell as a result of disunity.\nAccording to him, “Look at the once-powerful, main opposition Peoples Democratic Party now enfeebled and adrift and learn lessons in disunity, mismanagement and corruption.\n“This is in addition to the recent arrogant, corrupt and criminal removal of electricity subsidy without reference to Nigerians among other thoughtless and inhumane actions of the APC government."
  },
  {
    "headline": "ASUU says UTAS salary platform scored 77% in integrity test",
    "summarized_story": "Osodeke was reacting to recent statements credited to both the Minister of Communications and Digital Economy and Director-General, NITDA that UTAS had failed the integrity test.\n“This was attested to by the report coming from NITDA then to the effect that UTAS scored 85 per cent in User Acceptance Test (UAT), ‘’he said.\n“Suffice it to say here that some observations and questions were raised by NITDA to which UTAS technical team has to provide clarification.\nHe also appealed to the DG, NITDA to stop making comments capable of jeopardising the joint on-going testing of UTAS between the NITDA Technical Team and its counterparts.\nThe lecturers’ demands include funding of the Revitalisation of Public Universities, Earned Academic Allowances, University Transparency Accountability Solution (UTAS) and promotion arrears."
  },
  {
    "headline": "Barack Obama Tests Positive For COVID-19",
    "summarized_story": "Former President Barack Obama confirmed that he had tested positive for COVID-19 on Sunday.\nObama, 60, and his wife, Michelle, are both completely vaccinated and boosted, according to the former president.\nMichelle Obama’s test came back negative.\nObama’s diagnosis is a “reminder to get vaccinated if you haven’t already, even as cases decline,” he said."
  },
  {
    "headline": "BREAKING: Aviation Fuel Scarcity Leaves Passengers Stranded At Abuja Airport, Disrupts Flights",
    "summarized_story": "Some passengers have been stranded at the Nnamdi Azikiwe International Airport as aircraft companies compete for aviation fuel, which is in short supply.\nAviation fuel, also known as Jet-A1, is a specialized type of petroleum-based fuel used to power airplanes that often accounts for more than 30% of an airline’s operating costs.\nPassengers on Air Peace and Dana Air were stuck for several hours at the Abuja airport on Sunday due to a lack of fuel to fly the planes to their respective destinations, according to SaharaReporters.\n“The flights affected are Air Peace, Abuja to Lagos and Dana Air, Abuja to Port Harcourt“Passengers have been stranded for more than two hours and it is because of lack of fuel,” a source at the airport tells SaharaReporters on Sunday.\nDue to a “prolonged scarcity of aviation fuel” and a rise in the product price, Nigerian airlines warned passengers last week that flight interruptions were possible."
  },
  {
    "headline": "ASUU Meets Today For Declaration Of Possible Total, Indefinite, Suffocating Strike",
    "summarized_story": "The Academic Staff Union of Universities’ National Executive Council will meet today (Sunday), according to the striking union’s twitter page, which reads: ASUU Executives will be meeting this evening for declaration of a possible total, indefinite, and’suffocating’ strike.\nAccording to one of the NEC members, the meeting will be held in Abuja to discuss the ongoing strike.\n“Yes, we are meeting today on the ongoing strike and other matters,” he said.\nThe meeting is coming one day to the expiration of the warning strike by ASUU.\nThe union had on Monday, February 14, 2022, declared a total and comprehensive four-week warning strike."
  },
  {
    "headline": "FG Shuts GoCash, Okash Other Online Banks, Freezes Accounts",
    "summarized_story": "The federal government of Nigeria has declared illegal the operations of online banks such as GoCash, Okash, EasyCredit, Kashkash, Speedy Choice, and Easy Moni.\n“This information started quite a while ago.\nSome time ago, when the country was on lockdown in 2020 due to the pandemic, we started seeing the rise in money lenders,” he said.\nHe said, “Essentially, what they have is an app, and so we started gathering more information about them.\nWe also understand that they are between five and seven companies operating at the same location.”"
  },
  {
    "headline": "Breaking: Torres, Aubameyang score as Barcelona dismantle Osasona, overtake Atletico Madrid in La Liga 3rd place",
    "summarized_story": "Ferran Torres scored twice as Barcelona continued their impressive run of form by beating Osasuna for a fourth La Liga win in a row.\nFormer Manchester City striker Torres opened the scoring early on from the penalty spot after Gavi was fouled.\nHe got his second soon after with a clinical finish following a great through ball by Ousmane Dembele.\nPierre-Emerick Aubameyang stabbed in from another Dembele assist before substitute Riqui Puig added a fourth.\nThe win moved Barcelona up to third on 51 points, although they remain way off the pace in the title battle with leaders Real Madrid on 63 points."
  },
  {
    "headline": "VIDEO: Drama as man sticks with married woman on bed, snake appears",
    "summarized_story": "A video has emerged of unidentified married woman who is seen stocked to a man on bed after s3x.\nAccording to the video, a snake is seen on the same bed preventing onlookers from separating them."
  },
  {
    "headline": "Pictures: NDLEA arrests popular General Overseer with drugs",
    "summarized_story": "The General Overseer of Christ Living Hope Church, Rev.\nUgochukwu Emmanuel Ekwem, in possession of 54 sticks of Cannabis allegedly wrapped around his body has been arrested by Operatives of the National Drug Law Enforcement Agency (NDLEA).\nAccording to NDLEA’s director media and advocacy Femi Babafemi, the Pastor who was heading to Nairobi, Kenya for a three-week crusade was arrested at Murtala Muhammed International Airport (MMIA), Ikeja, Lagos.\nBabafemi said the cleric has already confessed during a preliminary interview that he packed the quantity of illicit substance on his body to use during the crusade in Kenya.\nThe statement further revealed that the Anambra-based preacher was arrested on Monday 7, 2022 during the outward clearance of passengers on Ethiopian Airlines flight to Nairobi via Addis Ababa."
  },
  {
    "headline": "Five Killed, Others Injured As Bandits Open Fire On Vehicle In Katsina",
    "summarized_story": "At least five passengers were confirmed killed and three others critically injured after bandits armed with sophisticated weapons opened fire on a vehicle passing along Yantumaki – Danmusa road in Katsina State.\nAn eyewitness told Channels Television that out of the eight passengers, who were all indigenes of Gobirawa and Kaigar Malamai villages in Katsina State, six of them were returning from Benin City in Edo State where they work.\nHe said the vehicle left Yantumaki for Danmusa town in the early hours of Saturday.\nIn the morning, they boarded the vehicle for Danmusa town from where they would take motorcycles to their villages.\nThe vehicle was attacked a few minutes after leaving Yantumaki”."
  },
  {
    "headline": "I Didn’t Exonerate Kyari, I Only Asked For Further Probe – Malami",
    "summarized_story": "Attorney-General of the Federation and Minister of Justice, Abubakar Malami, (SAN) has described as false the media reports that his office had conclusively exonerated Abba Kyari.\nMonths later, the AGF affirmed that investigations carried out by the police had indicted the once-celebrated officer for money laundering.\nThe alleged contradiction in the AGF’s statements sparked speculations in the media that he was plotting to exonerate Kyari.\nThe NDLEA had filed eight counts of hard drug trafficking against him along with six others.\nAccording to the agency, Mr Kyari, between January 19 and 25, dealt in 17.55 kilograms of cocaine."
  },
  {
    "headline": "I Have What It Takes To Lead Nigeria – Saraki",
    "summarized_story": "﻿Former Senate President, Bukola Saraki, has said he is capable of leading Nigeria.\nHe said this during an interview on Channels TV’s Sunday Politics while responding to questions regarding his interest in the 2023 Presidential election.\n“I believe I have what it takes to lead Nigeria,” Saraki said.\nRead Also: Ngige ‘Seriously Consulting’ To Run For President In 2023According to Saraki, those are essential qualities needed to unite the country as it is today.\nWhile the former Senate President has yet to officially declare his intentions to run for President, he, however, said he is currently consulting and in due course, he will make an appropriate announcement."
  },
  {
    "headline": "NDLEA Arrests General Overseer With Drugs As Operatives Intercept Parcels Of Cocaine",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA) have arrested a preacher and the General Overseer of Christ Living Hope Church, Rev.\nREAD ALSO: NDLEA Seizes Smuggled Opioid Capsules In Lagos PortSimilarly, another passenger, Nnakeanyi Chukwuka King, was intercepted with 40 parcels of Cocaine concealed in bottles of body cream weighing 9.70kg.\nThe illicit substance was concealed inside plastic containers labelled as ‘African Dishes’ and packed in a bag,” the NDLEA added.\n“At the point of his arrest, another 152 bottles of the drug were recovered from his vehicle.\nFollowing the seizures and arrests, the Chairman/ Chief Executive of the NDLEA, Brig."
  },
  {
    "headline": "Obama Tests Positive For COVID-19",
    "summarized_story": "Barack Obama has tested positive for a mild case of Covid-19, the former US president said on his Twitter account Sunday.\n“I’ve had a scratchy throat for a couple of days, but am feeling fine otherwise,” Obama tweeted, adding that his wife, former first lady Michelle Obama, has so far tested negative.\n“This vaccine means hope,” Obama said in the video.\n“It will protect you and those you love from this dangerous and deadly disease.”In August, Obama scaled back his 60th birthday celebrations due to the spread of the Delta variant of the coronavirus.\nUS daily case counts have fallen off sharply, according to the (CDC), with an average of around 35,000 cases per day in mid-March compared to a peak of an average of 810,000 cases per day in mid-January."
  },
  {
    "headline": "Buhari warns APC leaders against name-calling, distractions over convention -",
    "summarized_story": "President Muhammadu Buhari on Saturday issued a warning to leaders of the All Progressives Congress (APC) against “name-calling and distractions” ahead of the party’s national convention.\nThe president’s warning was contained in a statement issued on Saturday by Garba Shehu, presidential spokesman.\nIt would be recalled that over the past days, governors and other stakeholders in the APC have engaged in back-and-forth over the arrangements for the party’s national convention scheduled to hold on March 26.\nIn the statement, Buhari said distractions of any sort in relation to the party’s activities must stop.\n“There must be no more distractions ahead of the convention to choose new leaders,” the President said."
  },
  {
    "headline": "President Muhammadu Buhari asks for Order in The APC -",
    "summarized_story": "President Muhammadu Buhari warns the leaders (and membership) of the All Progressives Party (APC) to desist from name-calling and backstabbing ahead of the oncoming March 26 Convention, remain steadfast and maintain its unity if the party is to continue in the path of victory and its dominance at all levels throughout the country.\nPresident Buhari asks the members to look at the once-powerful, “main opposition” Peoples Democratic Party (PDP) now enfeebled and adrift and learn lessons in disunity, mismanagement and corruption.\n”But parties splintered by competing egos destine themselves to the worst possible fate,” the President warned.\nIt is important to ask what benefits the poor are getting during the period of intense negative coverage.\nThat is for the general election."
  },
  {
    "headline": "INEC letter: Bello's CECPC makes u-turn, says Buni still in charge -",
    "summarized_story": "Since the inception of this CECPC on June 25, 2020, whenever the chairman is not around and Governor Sani Bello is around, he acts on behalf of all as the Chairman.\n“So, one has to leave for the other, whichever, he has transmitted a letter and Governor Sani Bello has been acting appropriately.\n“As part of efforts towards the hitch-free conduct of the March 26th National Convention of the All Progressives Congress (APC), the Caretaker/Extraordinary Convention Planning Committee (CECPC) stepped up preparations this week.\nThe purpose is to ensure speedy execution of the various activities leading to the National Convention on March 26, 2022.\nHe assured that the March 26th National Convention was on course and sacrosanct."
  },
  {
    "headline": "Updated: APC denies writing INEC on emergency NEC meeting -",
    "summarized_story": "The All Progressives Congress, APC has described as figment of imagination, the purported letter written to the party by the Independent National Electoral Commission (INEC) on the need to give the Commission a 21-day notice for its national convention slated for March 26.\nEarlier, there were media reports that the commission had rejected a letter allegedly written by the APC Caretaker Committee requesting it to monitor its emergency NEC meeting.\nIn the latest development, the ruling party said neither the new acting chairman nor the secretary wrote the electoral umpire."
  },
  {
    "headline": "“The President Can’t Be Minister of Petroleum From an Executive Position”- Kunle Adegoke",
    "summarized_story": "Kunle Adegoke, Senior Advocate of Nigeria & Member of the ruling party, All Progressives Congress joins ARISE News to discuss the details behind what is permissible and what could make it difficult for The President, and other government official, to hold multiple executive positions across the federal government, in line with the Constitution of Nigeria."
  },
  {
    "headline": "301 Nigerians Fleeing Ukraine Arrive Nigeria from Hungary",
    "summarized_story": "The sixth batch of 301 Nigerians fleeing from the war-torn Ukraine arrived at the Nnamdi Azikiwe International Airport, Abuja, Saturday evening.\nThe returnees, mostly students stranded in Sumy for weeks, arrived the country aboard Azman Air.\nThe fifth batch of Nigerian evacuees had arrived early Friday at the Nnamdi Azikiwe International Airport, Abuja.\nThey arrived on a plane owned by Air Peace, one of the airlines billed to airlift Nigerians returning from Ukraine.\nThe evacuees, according to the Nigerians in Diaspora Commission (NiDCOM), also got free SIM cards loaded with airtime to allow them reach their family members courtesy of a partnership between NiDCOM and MTN."
  },
  {
    "headline": "Nigeria Ports Authority Inaugurates First Non-Oil Export Processing Terminal in Lagos",
    "summarized_story": "RelatedStories No Content AvailableThe Nigerian Ports Authority (NPA) has flagged off the first non-oil export processing terminal, situated in Ibeshe-Ikorodu, Lagos State.\nThe Ibeshe-Ikorodu facility is designated as EssLibra Terminal.\nThe EssLibra Terminal is an integrated logistics off-dock terminal, ready for all export activities such as stuffing, on-site customs clearance and barging services.\nThe agency said the terminal covered an area of 120,000 square metres (sqm) that includes an export processing zone, trailer park, RoRo facility and fuel dump.\nBello Koko asked the management of the terminal to resist the temptation to veer off export processing for which the facility was built."
  },
  {
    "headline": "Nigeria: Obasanjo Denies Endorsing South-East for Presidency",
    "summarized_story": "Former President Olusegun Obasanjo on Saturday refuted the claim that he had endorsed the South-east for the presidency ahead of 2023 elections.\nObasanjo’s rebuttal was in reaction to a report quoting him to have backed the region to produce the next president.\nThe report stated that Obasanjo made the endorsement while receiving a presidential aspirant, Mr. Mao Ohuabunwa, in Abeokuta, Ogun State, on Thursday.\nObasanjo spoke through his Media Aide, Kehinde Akinyemi, in a statement made available to journalists in Abeokuta.\nHe said: “If that was the way the presidential aspirant wanted to approach his ambition, such was the wrong way."
  },
  {
    "headline": "Again, Crude Oil Production by OPEC, Allies Falls by 890,000 bpd",
    "summarized_story": "Despite the decision of the Organisation of Petroleum Exporting Countries (OPEC) and its allies, OPEC+, to raise crude oil production by 340,000 barrels per day last month, the gap between the group’s actual output and target still widened to 890,000 bpd, according to the cartel’s report.\nIt was also a month that saw Nigeria raise output to 1.51 million bpd, a marked improvement from the previous few months when the country struggled to produce between 1.2 million bpd and 1.4 bpd.\nA day earlier, crude oil prices fell significantly, tumbling from a 2008 high of $130, about the largest single-day percentage decline since April 2020.\nNigeria’s benchmark oil dropped 13 per cent to $111 a barrel, while the WTI crude oil which topped $130 at the height of trading earlier in the week, lost 12 per cent.\nMinister of State Petroleum, Mr Timipre Sylva, last week said that the absence of long-term investment in the oil and gas sector, as well as insecurity, should be blamed on Nigeria’s current low crude oil production."
  }
]