[
  {
    "headline": "World Malaria Day: WHO tasks Nigeria, others on new strains, drug, insecticide resistance",
    "summarized_story": "World Health OrganizationSays 228m cases occurred in WHO/AFRO Region in 2021By Chioma ObinnaAs the World marks this year’s World Malaria Day, the World Health Organisation, WHO, on Sunday urged Nigeria and other malaria endemic countries to work on drug and insecticide resistance, as well as focus on new strains of malaria parasite arising from the region, which are more difficult to detect, and treat.\nMaking the call in her message to mark day, the WHO Regional Director for Africa, Dr Matshidiso Moeti said malaria remains a significant public health and development challenge.\nAccording to her, last year, about 95 percent of the estimated 228 million cases occurred in the WHO/AFRO Region, along with 602 020 reported deaths.\nMalaria affects households and communities, and these communities need to be empowered to play an active role in the fight against this disease.\n“As WHO in Africa, we recognize that a whole-of-society approach requires us to listen to, and learn from, those who are worst impacted."
  },
  {
    "headline": "Ugwuanyi’s community honours his deputy, speaker, Reps, others",
    "summarized_story": "Anayo Onwuegbu, were among the dignitaries honoured with Chieftaincy titles by the traditional ruler of Governor Ifeanyi Ugwuanyi’s community, Ohom Orba, in Udenu Local Government Area, HRH Igwe Everestus Onah, the Uchenna 1 of Ohom Orba Ancient Kingdom.\nUgwuanyi congratulated his Deputy, Lolo Ezeilo, the Speaker, Rt.\nThe Deputy Governor, Lolo Ezeilo, was conferred with Chieftaincy title of “Nwanne Di Na Mba 1 of Orba”, the Speaker, Rt.\nAtigwe was honoured with the Chieftaincy title of Muoneme1 of Ohom Orba while Prof. OdoEdeoga, Chief Onu and Engr.\nOnwuegbu were recipients of “Ojide Onye Ibe 1 of Ohom Orba, Omenanwata 1 of Ohom Orba and Ezi Oyi Ohom Orba respectively."
  },
  {
    "headline": "2023: Udom Emmanuel meets PDP leaders, Bode George in Lagos",
    "summarized_story": "* Promises coastal transportation system to boost Lagos economyBy Clifford NdujiheAKWA Ibom State Governor and 2023 Presidential Aspirant on the platform of the Peoples Democratic Party, Mr. Udom Emmanuel, yesterday met with PDP leaders in Lagos to intimate them of his aspiration.\nThe parley was hosted by Deputy National Chairman of the PDP, Chief Olabode GeorgeEmmanuel was accompanied by the Director General of his campaign, Dr. Gabriel Suswam and Akwa Ibom State commissioner of information, Ini Ememobong, among others.\nGovernor Udom Emmanuel appreciated the host for his nationalistic roles thus far.\nAcknowledging the importance and special status of Lagos, Emmanuel said that a coastal transportation system for Lagos would further expand the economic prosperity not only of Lagos but also Nigeria as a whole.\n“Industrialization drive for Lagos will jump-start Nigeria’s economy and strengthen the naira,” he said."
  },
  {
    "headline": "Convene confab to address varsity workers’ strike, NCFront, 3rd force tell FG",
    "summarized_story": "“The bedrock of modern nation building is education and any country that trivializes it, is clearly on a path to failure.\n“It is our view that the issues concerning the public universities can be resolved, if government comes to the table with sincerity of purpose by recognizing the problems and show willingness to fix them.\nThe current spate of strikes also revolves around some of these same issues and governments’ failure to honour previous Collective Agreements.\n“It is our hope that the Education Confab as proposed would come up with critical resolutions that should alter current policies and laws in a way that would prevent University based Unions’ strikes in the foreseeable future.\nOur dream is to build a nation in which every citizen shall be free and educated, healthy and prosperous.”"
  },
  {
    "headline": "2023: Hayatu-Deen distances self from PDP northern consensus candidates",
    "summarized_story": "By Clifford NdujiheA Presidential aspirant on the platform of the Peoples Democratic Party, PDP, Mohammed Hayatu-Deen, has dissociated himself from the announcement of Governor Bala Mohammad and Senator Bukola Saraki as the preferred Northern consensus candidates for the PDP by the Prof. Ango Abdullahi-led committee.\n“For the record, it must be stated that the four candidates seeking a consensus had agreed that the process had collapsed prior to this announcement.\nThe candidates could not reach a compromise resulting in the decision of our principal, Mohammed Hayatu-Deen, and Governor Aminu Tambuwal to discontinue the process.\n“The purpose of the meeting yesterday (Saturday) was for candidates who participated in the consensus process to express their gratitude to the Northern Elders for their efforts in seeking a consensus.\n“After this announcement, we consulted with the Northern Elders’ Forum and agreed that the campaign of Mohammed Hayatu-Deen would henceforth proceed independently to maintain the sanctity and integrity of the People’s Democratic Party."
  },
  {
    "headline": "War: We see, feel it – Zelensky sends message to US",
    "summarized_story": "Ukrainian President Volodymyr Zelensky has said his country appreciates the unprecedented assistance it gets from the United States and President Joe Biden.\nZelensky met with the US Secretary of State, Antony Blinken and US Secretary of Defense Lloyd Austin on Sunday.\n“I would like to thank President Biden personally and on behalf of the entire Ukrainian people for his leadership in supporting Ukraine, for his personal clear position.\nWe feel it.”Zelensky also discussed strengthening US sanctions on Russia, the statement said.\nUK Minister Boris Johnson, made the promise while saying that Russia has a “realistic possibility” of winning the war in Ukraine."
  },
  {
    "headline": "Rep member, Nse Ekpenyong is dead",
    "summarized_story": "Nse Ekpenyong, a member of the House of Representatives, is dead.\nThe lawmaker’s death was confirmed by his aide, theCable reports.\nIt was gathered that Ekpenyong died on Saturday.\nThe circumstances surrounding his death are still sketchy.\nEkpenyong, a member of the Peoples Democratic Party represented Oron/Mbo/Okobo/Udung Uko/Urue Offong/Oruko Federal Constituency of Akwa Ibom State."
  },
  {
    "headline": "Imo illegal refinery disaster: Stop making empty noise, you’re guilty – HURIWA slams Buhari, Uzodinma",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has asked President Muhammadu Buhari and the Imo State Governor, Hope Uzodinma, to stop chasing shadows and speaking from both sides of their mouths over the recent inferno that engulfed an illegal refinery site, leading to the death of over 100 persons engaged in crude oil bunkering.\nAt least 100 persons were feared dead as fire razed an illegal crude oil refining site at Abaezi forest, in Ohaji-Egbema council area of Imo State in the early hours of Sunday while about 150 others sustained serious degrees of burns.\nHURIWA said that the Imo State Government could not get the actionable intelligence on the activities of the illegal bunkering hoodlums so as to deploy the needed mechanisms of law enforcement in collaboration with the Federal Government to preemptively stop these activities of illegal bunkering.\n“Why is the Federal Government headed by President Muhammadu Buhari making needless noise after the ugly fire incident in Imo State has already killed over 100 persons allegedly involved in illegal crude oil bunkering?\n“Why has President Muhammadu Buhari not considered building one REFINERY in Imo State but opted to rather invest billions of taxpayers’ money in Niger Republic?"
  },
  {
    "headline": "Nigerians will hear the news – Simon Ekpa fumes over threat by herdsmen to invade Southeast",
    "summarized_story": "Simon Ekpa, a self-acclaimed disciple of the leader of the Indigenous People of Biafra, Nnamdi Kanu, has reacted to alleged moves by some groups of herders who threatened to attack and takeover Igboland.\nIPOB had alleged that the herders are planning to invade the region to take over the land as allegedly done in some other parts of the country.\nSpokesman of the secessionist group, Emma Powerful, while reacting to the threat, said they are not bothered by their threat, saying the region is not like other places they claimed to have conquered.\nSimilarly, Ekpa in a tweet on his official Twitter handle, said the Igbos only believe in actions, saying “Nigerian news will tell the story”.\nHe said, “Those expecting us to respond to Fulani terrorists threat of invading Igbo-Biafra community should understand that we are now in the era of action."
  },
  {
    "headline": "Easter vacation stalls Sowore’s arraignment on cybercrime charges",
    "summarized_story": "For the second time, the planned arraignment of Omoyele Sowore on cybercrime charges was on Monday in Abuja aborted due to the ongoing Easter vacation of the Federal High Court.\nThe Federal Government filed three-count criminal charges against Sowore, a presidential aspirant in the 2023 presidential election.\nThe filing of the criminal charges followed complaints to the Federal Government by a businessman, Mr Ned Nwoko.\nLawyers in the matter were informed that the Federal High Court was still on Easter vacation and were also told to pick a fresh date for the arraignment.\nSahara Reporters, an online medium, was charged as 2nd defendant along with its publisher, Sowore in the criminal charges."
  },
  {
    "headline": "2023: North East group backs northern consensus candidates",
    "summarized_story": "By Sunday AniThe North East Consolidated Group (NECG), yesterday, endorsed the emergence of the Bauchi State Governor, Bala Mohammed, and the former Senate President, Dr. Bukola Saraki as the northern consensus candidates for the 2023 election.\nThe North West had effortlessly produced three democratic presidents right from the First Republic till date, with the support of the North East and North Central.\nWe hope that the North West will continue to support the North East and the North Central as the table turns 2023.”100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nThe governor’s effort is boosting the economic, social and political capital of the entire North East.\nNECG stresses the need for not just the North but also Nigeria as a whole to rally round and rescue the country.”"
  },
  {
    "headline": "How sharp practices among govt’s officials hinder malaria eradication in Kaduna",
    "summarized_story": "From Sola Ojo, KadunaSharp practices such as diversion and proxy deliveries of the free malaria commodities and poor funding on the part of the government have been identified as top threats to development partners’ investments in malaria eradication in Nigeria especially in Kaduna state, Northwest Nigeria.\n“One of the challenges that persist is sharp practices around distributed free malaria commodities (drugs and mosquito nets for example) with NOT FOR SALE written on them.\n“We are not happy that this is still happening despite several calls on the state government and when we say government, we mean State Malaria Eradication Programme (SMEP) which is saddled with malaria activities in the state.\nHe then called on the responsible health authority in the state to increase funding for malaria activities beyond mere budgeting without releases and cashback to implement malaria programmes.\n“On our part as civil society, it is our responsibility to demand accountability for malaria commodities."
  },
  {
    "headline": "Murder of OAU Student: Court adjourns abruptly as co-defendant slumps",
    "summarized_story": "The defendants were standing trial on alleged murder of a master’s student of Obafemi Awolowo University (OAU), Timothy Adegoke.\nDo not miss the Vital Information, it goes off in 2 days!\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nThe defendants were to open their defense on Monday when the incident happened.\nThe judge thereby adjourned the matter for urgent attention to the ailing defendant."
  },
  {
    "headline": "NDLEA arrests drug baron behind N3billion Tramadol linked to Abba Kyari’s team",
    "summarized_story": "From Godwin Tsa, AbujaA crack team of the National Drug Law Enforcement Agency(NDLEA) has arrested a billionaire drug baron, Chief Afam Mallinson Emmanuel Ukatu, who is behind the N3billion Tramadol deal involving the embattled suspended Deputy Commissioner of Police, Abba Kyari-led Intelligence Response Team (IRT).\nAfter the arrest of Ukatu’s staff: Pius Enidom and Sunday Ibekwete, Kyaris men were then led by the suspects to Mallinson’s warehouse at Ojota in Lagos where 197 additional Cartons of Tramadol 225mg were seized by the IRT Team.\nThe monetary value of the 202 cartons of Tramadol seized from Mallinson in one day was over N3billion.\nThree weeks after the seizure, the Kyaris IRT team transferred only 12 Cartons of the Tramadol with one truck and a suspect to the Lagos Command of the NDLEA, leaving 190 cartons unaccounted for.\nAfter over eight months of following the lead, anti-narcotic officers of the Agency eventually arrested Ukatu at the Lagos airport on 13th April 2022."
  },
  {
    "headline": "Imo explosion deaths: Uzodimma goes after operators of illegal bunkering",
    "summarized_story": "From Stanley Uzoaru, OwerriGovernor Hope Uzodimma has directed security agencies in the state to intensify their search for the owners of the illegal refineries and ensure their immediate arrest and trial.\nThis is sequel to the incident that occurred at Abaezi in Ohaji/Egbema Local Government Area of the State recently where over 100 persons loss their lives at an illegal oil refinery.\nDo not miss the Vital Information, it goes off in 2 days!\n“Governor Hope Uzodimma has directed immediate evacuation of the charred remains of the victims for mass burial, while the area should be fumigated for environmental safety.\nPremature Ejaculation & \"Small Joystick\" Resolved in 7Days... Click Here For Details ."
  },
  {
    "headline": "Oil Theft: Navy Seizes 6 Million Litres of Stolen Crude from Illegal Refiners",
    "summarized_story": "The site also had five large pits holding approximately 700,000 litres of stolen crude oil.\nDuring the operation, 19 ovens, 26 metal storage tanks and two dugout pits laden with about 250,000 litres of suspected stolen crude oil and 50,000 litres of illegally refined AGO were destroyed.\nDuring the operation, 16 ovens, 31 metal storage tanks and seven large pits all filled with about 850,000 litres of stolen crude oil were equally deactivated.\n“The wooden boat was laden with 60,000Litres of illegally refined AGO together with over 100 sacks of same product.\nThe authorities have been struggling to curb the proliferation of illegal plants where stolen crude oil is refined."
  },
  {
    "headline": "NEF: We’re Not Involved in PDP Consensus Arrangement",
    "summarized_story": "“So, based on this, I didn’t go to Minna, and the decision that the two people are the Northern consensus candidate doesn’t in anyway reflect my wish, and should therefore not worry my supporters.\nWe met on Wednesday and we agreed to bury the issue of consensus candidate.\nYes, one consensus candidate has not emerged but they have initiated a process, which can help the party later on.\nRather, it was the group of presidential aspirants made up of Senator Bala Mohammed, RT Hon Aminu Tambuwal.\nSenator Bukola Saraki and Alhaji Mohammed Hayatu-Deen that collectively, freely and willingly approached Gen Babangida to help select from amongst themselves a Consensus Presidential Aspirant."
  },
  {
    "headline": "Sanwo-Olu: Lagos Rail System to Commence Operation First Quarter 2023",
    "summarized_story": "* Blue line at 90% completion*Laments vandalism of rail equipmentSegun JamesLagos State Governor, Mr. Babajide Sanwo-Olu, yesterday, inspected the on-going construction of the Lagos Rail Line project and said the first quarter 2023 target for commencement of operational service was sacrosanct.\nThe governor, however, warned those that had started vandalising the barricades around rail line to desist from the act, saying the tracks are hazardous.\nSanwo-Olu inspected the Blue line rail project alongside some of his cabinet members, top officials of Lagos Metropolitan Area Transport Authority (LAMATA), and contractors handling the project.\nThe first phase of the Blue line rail project starts from Mile 2 and terminates at Marina.\nMarina Station is an elevated station and it stretches out to outer Marina and terminates where the Governor’s residence is."
  },
  {
    "headline": "Atiku, Tambuwal, Lamido Reject Saraki, Mohammed as Northern PDP’s Consensus Presidential Candidates",
    "summarized_story": "Atiku, Tambuwal, Lamido, and Hayatu-Deen, who are all PDP presidential aspirants, have also denounced the report of Prof. Ango Abdullahi, which endorsed Saraki and Mohammed as the North’s consensus presidential candidates with the backing of a former military President, Gen. Ibrahim Babangida (rtd).\nThe First Lady invited all presidential aspirants of all political parties, to the Ramadan Iftar, where he also hosted elected officials of the political parties.\nThe report, which shortlisted Saraki and Governor Mohammed as the two northern presidential consensus candidates, urged Tambuwal and the investment banker and economist, Hayatu-Deen to drop their presidential ambition.\nAlso denouncing the controversial consensus report, former Jigawa State Governor, Lamido called on all members of the party in the northern states to ignore it.\nThe position of the northern elders is not only injurious to the North but equally injurious to the northern aspirants,” Lamido explained."
  },
  {
    "headline": "Alaafin Lamidi Adeyemi Dies, Buried in Glory",
    "summarized_story": "He said the late Alaafin was a patriotic and highly respected traditional ruler who had immeasurable love for his people and great faith in a united Nigeria.\nIn a condolence letter to Makinde, Jonathan noted that the late Alaafin was a skilled custodian of the tradition and culture of his people who had an eventful and epoch-making reign.\nOsun State governor, Oyetola, also described the passing of the Alaafin of Oyo, as shocking, saying it signified the end of an era.\nOyetola also commiserated with his Oyo State counterpart, Makinde, and the entire Yoruba race over the demise of the late monarch.\nGovernor of Benue State, Ortom also yesterday commiserated with the government and people of Oyo State over the transition to the great beyond of the Alaafin of Oyo."
  },
  {
    "headline": "BREAKING: Traditional Worshippers Protest Open Display Of Alaafin Of Oyo's Corpse on Internet During Burial",
    "summarized_story": "The Traditional Worshippers Association of Nigeria, Oyo State branch has condemned the open display of the corpse of the late Alaafin of Oyo, Oba Lamidi Adeyemi III, during the Muslim prayer session, saying it was against the tenets of traditional respect for a dead king.\nThe association disclosed this on Sunday in a statement jointly signed by its Chairman, Adefabi Dasola and Secretary, Dr. Fakayode Fayemi Fatunde respectively.\nThe statement noted that the late monarch never minced words in condemning the open display of any Yoruba Oba remains for any purpose while he was alive.\nThe traditional worshippers said it was disappointing to see the corpse of a revered monarch being displayed all over the internet.\nIn fact, Oba Adeyemi was a true devotee of Ṣango and that was why he joined the ancestors on Sango Worship day."
  },
  {
    "headline": "BREAKING: Traditional Worshippers Protest Open Display Of Alaafin Of Oyo's Corpse on Internet During Burial",
    "summarized_story": "The Traditional Worshippers Association of Nigeria, Oyo State branch has condemned the open display of the corpse of the late Alaafin of Oyo, Oba Lamidi Adeyemi III, during the Muslim prayer session, saying it was against the tenets of traditional respect for a dead king.\nThe association disclosed this on Sunday in a statement jointly signed by its Chairman, Adefabi Dasola and Secretary, Dr. Fakayode Fayemi Fatunde respectively.\nThe statement noted that the late monarch never minced words in condemning the open display of any Yoruba Oba remains for any purpose while he was alive.\nThe traditional worshippers said it was disappointing to see the corpse of a revered monarch being displayed all over the internet.\nIn fact, Oba Adeyemi was a true devotee of Ṣango and that was why he joined the ancestors on Sango Worship day."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Wema Bank Officials Offered Policeman Bribe To Stop Investigation On N1.7billion Money Laundering, Fraud",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nThe Executive Director of the Bank, Mr Wole Akinleye, was also invited and he tried hard to derail and stop the investigation.\nMeanwhile, the police has charged one Ojo Oladipupo, Chief Security Officer of Wema Bank Plc, to court for attempted bribery.\nSee Also Exclusive EXCLUSIVE: How Wema Bank Top Officials Used Redeemed Church Pastor’s Account For N1.7billion Money Laundering, Fraud“Guess what they do after, they now moved that N1.7billion from Adewole’s account into different bank accounts in tranches.\nIn January 2022, a group, Transparency Nigeria Group, asked the Central Bank of Nigeria to dismiss the Chief Executive Officer of Wema Bank, Ademola Ademise, over alleged fraud."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Wema Bank Officials Offered Policeman Bribe To Stop Investigation On N1.7billion Money Laundering, Fraud",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nThe Executive Director of the Bank, Mr Wole Akinleye, was also invited and he tried hard to derail and stop the investigation.\nMeanwhile, the police has charged one Ojo Oladipupo, Chief Security Officer of Wema Bank Plc, to court for attempted bribery.\nSee Also Exclusive EXCLUSIVE: How Wema Bank Top Officials Used Redeemed Church Pastor’s Account For N1.7billion Money Laundering, Fraud“Guess what they do after, they now moved that N1.7billion from Adewole’s account into different bank accounts in tranches.\nIn January 2022, a group, Transparency Nigeria Group, asked the Central Bank of Nigeria to dismiss the Chief Executive Officer of Wema Bank, Ademola Ademise, over alleged fraud."
  },
  {
    "headline": "Twitter Board In Advanced Talks To Sell Company To World’s Wealthiest Man, Elon Musk",
    "summarized_story": "The discussions followed a Twitter board meeting on Sunday morning to discuss Mr. Musk’s offer, the people said.\nThe situation involving Twitter and Mr. Musk remains fluid and fast-moving, the people with knowledge of the situation said.\nTwitter also adopted a “poison pill,” a defensive manoeuvre that would prevent Mr. Musk from accumulating more of the company’s stock.\nMr. Musk updated his proposal last week, putting pressure on Twitter to more seriously consider his bid.\nMr. Musk, 50, has made clear that he sees many deficiencies in Twitter as a social media service."
  },
  {
    "headline": "Lagos reopens Chrisland School amid sex scandal",
    "summarized_story": "The Lagos state government has directed that all Chrisland School be reopened on Monday — a few days after it was shut down over a sex tape scandal involving its pupils.\nAdefisayo added the directive is to ensure students of the school are not denied access to learning when schools across the state resume on Monday.\n“The Lagos State Ministry of Education has directed that all Chrisland Schools shut for alleged misconduct of some students in Dubai be reopened from Monday, April 25th, 2022,” the statement read.\nBesides, it is to ensure that students are not denied access to learning when the new term begins on Monday 25th April 2022.\nAdvertisement“The state Government shut the schools for the safety of students and the staff and to ensure unhindered investigation of the incident."
  },
  {
    "headline": "OAU reacts as female student accuses professor of sexual assault",
    "summarized_story": "The management of the Obafemi Awolowo University (OAU) in Ile-Ife has vowed to ensure justice is served in a case of alleged sexual assault involving Joseph Opefeyitimi, a professor at the institution.\nAdvertisementOpefeyitimi is a professor of Yoruba incantations and stylistics in the department of Linguistics and African Languages.\nBoluwatife Bababunmi, a student in the same department, had in a petition addressed to the school, accused the professor of sexually assaulting her in his office.\n“Procedurally, after the receipt of the formal complaints, the first step was that the departmental committee sat on the matter and, after thorough investigation, Professor Opefeyitimi was found prima facie liable.\nThe committee, which also sat and clinically deliberated on this same matter, recommended appropriate disciplinary actions against Professor Ayo Opefeyitimi to the university management."
  },
  {
    "headline": "ASUU strike: UNILAG beats Bowen in ‘Twitter battle’ for Rema",
    "summarized_story": "The University of Lagos (UNILAG) has won the Twitter poll organised by Rema, the Afrobeats singer, on varsity to attend amid the ongoing strike by the Academic Staff Union of Universities.\nReacting to Rema’s Twitter post, Bowen University in Iwo, Osun state had openly invited the singer to enroll in its institution.\nCaught in between the two varsities, the 21-year-old singer on Tuesday put up a Twitter poll to seek the opinions of his fans.\nAfter 24 hours, the Twitter poll accrued 118, 365 votes, and saw UNILAG rake in 63.2% of the votes to Bowen’s 36.8%.\nUNILAG and BOWEN University."
  },
  {
    "headline": "NECO reschedules 2022 NCEE over low registration",
    "summarized_story": "The National Examinations Council (NECO) has rescheduled the 2022 National Common Entrance Examination (NCEE) from April 23 to May 7.\nAccording to Sani, the extension was to give states with low registration of candidates the opportunity to register more people for the exercise.\nAdvertisementHe enjoined candidates, parents, guardians, and relevant stakeholders to take note of the new date for the examination.\nThe NECO spokesman also advised candidates, parents, and guardians to download the new examination timetable from the council’s website — www.neco.gov.ng.\nAdvertisementDantani Wushishi, NECO registrar, had earlier said the registration is only for pupils who would not be less than age 10 by September 2022."
  },
  {
    "headline": "Sources: Mr Macaroni didn’t get married to Mummy Wa",
    "summarized_story": "Mr Macaroni, the Nigerian comedian, is not married to Kemi Ikuseedun, his colleague who is better known as Mummy Wa, TheCable Lifestyle has learnt.\nAdvertisementDuring the weekend, the skit maker had sparked a wave of bewilderment on social media after he announced his “engagement” to Mummy Wa.\nAdvertisementThis had left fans in a labyrinth of confusion as to whether Macaroni and Mummy Wa actually got married or if it was a skit.\nBut speaking with TheCable Lifestyle on Monday, an insider in the thespian’s team said the two skit makers didn’t get married as widely assumed.\nOn March 24, the skit maker had said he has no plan of getting married soon."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Google’s Africa internet cable arrives in Lagos, Nigeria",
    "summarized_story": "Google has announced that earlier today, Equiano, a subsea internet cable running through Portugal to South Africa landed in Lagos, Nigeria.\nThis announcement is coming a month after Equiano first landed on the African continent in Togo.\nThe project, which is named after Nigerian-born writer and abolitionist Olaudah Equiano, is expected to help support further digital transformation in Nigeria, a country with a thriving tech ecosystem.\n“Google is committed to supporting Africa’s digital transformation and we are excited to see the impact of the landing of Equiano in Nigeria,” Juliet Ehimuan, Director, West Africa at Google said.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, It's the weekend again, and I've been looking forward to it!\nFirst off, thank you for sticking with me...."
  },
  {
    "headline": "Cheers to a healthier you or a faster Internet?",
    "summarized_story": "I had contacted Reliance hoping that they would cover a mental health illness different from depression.\nSo, while we raise a glass to a healthy and productive week, I’ll be discussing:Equiano: A faster Internet connectionWave’s e-money licenceEquiano: A faster Internet connectionGoogle’s Submarine Cable shipThis week looks wonderful.\nHere it is: Equiano, a cutting-edge submarine Internet cable, is set to arrive in Lagos, Nigeria, on Friday, April 29, 2022.\nFunded by Google, the Internet cable has a capacity of 144 terabits (18 Terabytes) and is named after Olaudah Equiano, the historical abolitionist.\nBut Google’s Internet cable could help reduce the download time to 1.2 minutes."
  },
  {
    "headline": "Say goodbye to clout chasing on the gram",
    "summarized_story": "AdvertisementWhen you compare this to, say, California, United States – which has an estimated 630,000 developers – you’ll see that this is a problem.\nInstagram prioritises originalityAdam Mosseri, Instagram CEO, announced on Wednesday, April 20, 2022, that the company will change its ranking algorithm to emphasise original content more prominently on its platform.\nThis would also help to prioritise the distribution of original content over reposted content in places like the Reels tab and feed.\nWe’re going to do more to try and value original content more, particularly compared to reposted content,” he says.\nWhat’s more, Mosseri mentioned two recent product launches: product tagging and enhanced tagging."
  },
  {
    "headline": "What you need to know as Google’s Equiano cable lands In Nigeria",
    "summarized_story": "Share this article:Google has announced the launch of Equiano, a state of the art submarine Internet cable, which is set to land in Lagos, Nigeria.\nThe Internet cable, named after Olaudah Equiano, a historical abolitionist, has a capacity of 144 terabits (18 Terabytes).\nOne of the landmark moments was in 2009, during the launch of the MainOne submarine cable, a private submarine cable that today spans Nigeria, Ghana, and Cote d’Ivoire.\nThere’s a vast submarine cable capacity in Africa that still doesn’t reflect on your download speeds or streaming quality.\nAs of 2020, Africa had a submarine cable capacity of 100 Tbps, but it was only using 10%."
  },
  {
    "headline": "Nigerian universities fuel division as quality slips",
    "summarized_story": "According to the latest data from the ranking web of universities, the highest ranking of a Nigerian university, (which is the University of Ibadan) is 1,231st.\nStakeholders have decried the frequent strikes in Nigerian universities.\n“If it is about the slip in quality of teaching and learning in Nigeria, how come students from Nigerian universities are found to be doing well in foreign tertiary institutions?” he asked.\n“There are more non-teaching staff than the teaching staff in many Nigerian universities.\nIt was found that the quality of education and learning started slipping about the same time that Nigerian universities and government started to focus on their polarisation rather than the quality of their output."
  },
  {
    "headline": "Nigerian universities fuel division as quality slips",
    "summarized_story": "According to the latest data from the ranking web of universities, the highest ranking of a Nigerian university, (which is the University of Ibadan) is 1,231st.\nStakeholders have decried the frequent strikes in Nigerian universities.\n“If it is about the slip in quality of teaching and learning in Nigeria, how come students from Nigerian universities are found to be doing well in foreign tertiary institutions?” he asked.\n“There are more non-teaching staff than the teaching staff in many Nigerian universities.\nIt was found that the quality of education and learning started slipping about the same time that Nigerian universities and government started to focus on their polarisation rather than the quality of their output."
  },
  {
    "headline": "‘Foreigners’ are not welcome in federal universities",
    "summarized_story": "Anyone would be forgiven for the expectation that Nigerian universities, especially the federal ones, should be primarily centres for the advancement of learning.\nInvestigations show that since the late 1980s, Nigerian federal universities have been anything but federal in character and in principle.\nFor instance, there is no federal university in Nigeria today in which the vice-chancellor (VC) is not from the region and or the predominant religion in the region.\nFor instance, all federal universities in the North have VCs from the region, and same for the East, South-South, and West.\nEssentially, Nigeria’s federal universities are only meant for those from the region and from the predominant religion in the area."
  },
  {
    "headline": "ICT : Power House of the MEGA Agenda Revolution of Obaseki led administration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Information Communication ICT, Agency which has earned Edo State various local and national awards for ICT development, E-governance implementation and broad band penetration plans and programs has lived up to its mandate as the power house of the MEGA agenda revolution of the Governor Godwin Obaseki led administration.\n“The government is ramping up quickly to connect all ministries, Departments and Agencies into a fully centralized process and the VPN is currently being installed to complete the connectivity of all public institution in Edo State.\nThe development of ICT labs and E- learning Management System in collaboration with the ICT Agency is in progress to shape and advance these initiatives ,” she added.\nThis reward system is being driven in collaboration with the head of service.\nOn the institutional approach, the Public Service Academy is codifying its processes working on an enabling law and developing an operational play,” she noted."
  },
  {
    "headline": "Truck set ablaze after crushing music director in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-A Benin-based music director has been killed by a trailer along the Benin bypass at Ahor N’Uselu in Uhunmwonde local government area of Edo State.\nSources disclosed that the music director identified simply as Simon was crushed when a commercial motorcycle that he boarded was knocked down by the truck.\nThe accident occurred when both the truck driver and the motorcycle rider were avoiding another trailer that broke down on the busy road.\nThe unfortunate incident triggered a pandemonium during which irate youths set the truck ablaze in the middle of the road about 10:16a.m on Friday, April 22, 2022.\nThe operatives were also on the ground when the burnt truck was being towed from the accident spot."
  },
  {
    "headline": "Edo charges residents on food, environmental hygiene as Lassa fever cases reach 185 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has confirmed 185 cases of Lassa fever since the outbreak of the epidemic in the state, with the government reiterating the need for residents to maintain good environmental health and sanitation habits as well as proper hygiene in the handling and preparation of food.\nProf. Akoria noted, “Edo State has confirmed 185 Lassa fever cases since the outbreak of the disease in the state.\nThe fatality rate stands at 14 percent and this is not acceptable to the Edo State Government.\n“The intervention of the Edo State Government is targeted at reducing the number that fall ill with Lassa fever as we focus on downstream approaches that require ownership and participation.\nWe are also working with the Edo State Waste Management Board.”“I call on the people to improve their food and environmental hygiene in the state,” she urged."
  },
  {
    "headline": "Obaseki mourns passing of Alaafin of Oyo, Oba Lamidi Adeyemi – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of an illustrious leader of the Yoruba race, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III.\nIn a statement, the governor described the Alaafin of Oyo, as a “a great ruler, who displayed kindness and compassion to his people, espousing the virtues of hard work, diligence and love for humanity.”He noted, “It is with a heavy heart that I mourn the passing of a revered monarch and an illustrious leader of the Yoruba race, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III.\n“Brave and cheerful, Oba Adeyemi embodied the ideals of the Yoruba nation, promoting the rich culture and heritage of the Yorubas and providing wise counsel to those who sought guidance from the throne.”According to him, “During his over 50-year spell on the throne, Oyo witnessed numerous transformations and transitions, but he remained true to his heritage and harped on the need for brotherly love and conscientious living.”“He will be remembered for his kind-nature, conviviality, wisdom and love for humanity and living.”Obaseki commiserated with the Government and people of Oyo State, the Oyo Kingdom, family, friends, associates and well-wishers, and prayed that God will grant all the fortitude to bear this irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Rising subsidy, debt hobble economic recovery",
    "summarized_story": "BY EMEKA EJEREThere is a gloomy outlook for Nigeria’s economic recovery drive, with inflating petrol subsidy payments posing serious threat to more growth-enhancing activities of both the federal and sub-national governments.\nThis is even as the situation is accounting heavily to more government borrowing, which is raising concerns of possible debt distress among economic experts.\nHe argued that by retaining the petrol subsidy, the government would find it difficult to meet other commitments.\nHe said, Nigeria is on the brink of debt distress because our debt profile now is not sustainable.\n“Also, the federal government has submitted a supplementary budget proposal for subsidy for N2.55tn after the budget was passed."
  },
  {
    "headline": "High food price will continue in Nigeria till 2023, IMF warns",
    "summarized_story": "According to it, inflation is expected to remain high, and far longer than it had previously forecasted.\nAccording to it, the sharp hike in oil and gas prices led to an increase in energy costs.\nIn most emerging market and developing economies rising food prices also played a significant role, as poor weather hit harvests and rising oil and gas prices drove up the cost of fertilizer.\nHigher prices for international food commodities impact countries differently depending on the food share of households consumption baskets and the types of foods consumed.\nLow-income countries where wheat, corn, and sorghum are a large part of the diet (especially in sub-Saharan Africa) have seen inflation almost wholly driven by rising food prices."
  },
  {
    "headline": "NDLEA arrests drug baron behind N3bn Tramadol linked to Abba Kyari’s team",
    "summarized_story": "National Drug Law Enforcement Agency (NDLEA) says it has arrested Chief Afam Mallinson Emmanuel Ukatu, the drug baron allegedly behind the N3billion Tramadol deal involving the embattled suspended Deputy Commissioner of Police, Abba Kyari-led Intelligence Response Team (IRT).\nAfter the arrest of Ukatu’s staff: Pius Enidom and Sunday Ibekwete, Kyari’s men were then led by the suspects to Mallinson’s warehouse at Ojota in Lagos where 197 additional Cartons of Tramadol 225mg were seized by the IRT Team.\nThe monetary value of the 202 cartons of Tramadol seized from Mallinson in one day was over N3billion.\nThree weeks after the seizure, the Kyari’s IRT team transferred only 12 Cartons of the Tramadol with one truck and a suspect to the Lagos Command of the NDLEA, leaving 190 cartons unaccounted for.\nAfter over eight months of following the lead, anti-narcotic officers of the Agency eventually arrested Ukatu at the Lagos airport on 13th April 2022."
  },
  {
    "headline": "Timothy Adegoke: Court adjourns as Adedoyin’s co-defendant slumps",
    "summarized_story": "By Sunday Oguntuyi, OsogboThere was confusion at Osun State High Court sitting in Osogbo, on Monday after second defendant, Magdalene Chiefuna in the case of the murder of Timothy Adegoke, OAU’s postgraduate student slumped moments after she was called into the dock.\nIt took the intervention of the court clerk, warders and some people in the court to avert what seemed like an unfolding tragedy.\nHowever, Presiding Judge, Justice Adepele Ojo, stood down the case.\nThe matter was slated for defendants to open their defence today following the closing of prosecution case in March.\nPresiding Judge, Justice Adepele Ojo quickly adjourned the matter shortly to allow the defendant be attended to."
  },
  {
    "headline": "Pandemonium As Police Fingered In Death Of Traditional Head, 2 Others In Ondo",
    "summarized_story": "Pandemonium was let loose in Kajola community, Odigbo local government area of Ondo State on Saturday as youths in their hundreds mobilised to burn the police station in the area over alleged police recklessness, leading to the death of three persons including a traditional community head (Baale).\nThe victims, namely David Olowofeyekun, Gbenga Abayomi and Kola Akinduro, who was the Head of Korede Village, were on a motorcycle and heading home from their farms when the incident happened.\n“It was not due to the recklessness of the police officers, they took one way and they had an accident.\nSo there was no way the police can be reckless in a situation whereby there is a route to take and they took another one.\n“Of course it was an oncoming vehicle that they collided with and died, it was not police recklessness there,” the PPRO said."
  },
  {
    "headline": "Macron Beats Le Pen In French Election – Projections – Leadership News",
    "summarized_story": "Emmanuel Macron has beaten far-right candidate, Marine Le Pen, to win the French presidency, projections show.\nHe has taken 58% of the vote to her 42% in a narrower victory than their previous contest in 2017.\nMacron, 44, will make history by becoming the first French president to be re-elected in 20 years.\nLe Pen, 53, was running for the presidency for a third time.\nThe defeated far-right candidate says she will never abandon the French people as she concedes defeat in the presidential election."
  },
  {
    "headline": "Consensus: NECG Wants Bala Mohammed To Step Down For Saraki",
    "summarized_story": "The North-East Consolidated Group (NECG) has commended the Northern Elders for shortlisting the President of the 8th Senate, Abubakar Bukola Saraki, and Bauchi State governor, Bala Mohammed, as the possible consensus presidential candidate of the North on the platform of People’s Democratic Party (PDP) in the 2023 general elections.\nThe group in a press release signed by its chairman, Mr. Ahmad Abubakar (A.Yobe) and made available to journalists, appreciated the bold step taken by the Northern Elders under the leadership of Prof. Ango Abdullahi and the Northern PDP caucus ahead of PDP presidential primaries.\nA. Yobe noted that the former Senate President Saraki was more than qualified to fly the PDP flag at the 2023 polls over Governor Mohammed.\nHe said Governor Bala Mohammed should be considerate and patriotic enough to step down for Saraki in the interest of the North.\nADVERTISEMENT“Senator Abubakar Bukola Saraki being a well groomed personality, young and perfectly fit for the task of rescuing Nigeria from the glaring danger Nigeria is facing today."
  },
  {
    "headline": "Consensus: NECG Wants Bala Mohammed To Step Down For Saraki",
    "summarized_story": "The North-East Consolidated Group (NECG) has commended the Northern Elders for shortlisting the President of the 8th Senate, Abubakar Bukola Saraki, and Bauchi State governor, Bala Mohammed, as the possible consensus presidential candidate of the North on the platform of People’s Democratic Party (PDP) in the 2023 general elections.\nThe group in a press release signed by its chairman, Mr. Ahmad Abubakar (A.Yobe) and made available to journalists, appreciated the bold step taken by the Northern Elders under the leadership of Prof. Ango Abdullahi and the Northern PDP caucus ahead of PDP presidential primaries.\nA. Yobe noted that the former Senate President Saraki was more than qualified to fly the PDP flag at the 2023 polls over Governor Mohammed.\nHe said Governor Bala Mohammed should be considerate and patriotic enough to step down for Saraki in the interest of the North.\nADVERTISEMENT“Senator Abubakar Bukola Saraki being a well groomed personality, young and perfectly fit for the task of rescuing Nigeria from the glaring danger Nigeria is facing today."
  },
  {
    "headline": "Abuja Airport To Introduce Park ‘N’ Pay",
    "summarized_story": "Preparations are in advanced stage to introduce ‘park and pay’ for motorists at the Nnamdi Azikiwe International Airport, Abuja.\nSpeaking to LEADERSHIP over the weekend, the airport manager/regional general manager, North Central, Kabir Mohammed, said this was aimed at bringing sanity to the airport.\nMohammed, who was deployed to head the Abuja Airport on March 10, 2022, further said the introduction of the park and pay at the airport will address the problems of touts, who go about harrasing and extorting innocent drivers who bring in passengers at the airport.\nADVERTISEMENTHe also said as part of the ongoing reorganisations at the airport, the roudy taxi drivers and the illegal businesses going on at the front of the departure hall at airport will be addressed.\nHe said the effort has improved on the situation to a great extent, making entry into the airport easier."
  },
  {
    "headline": "Revealed: Billionaire Afam Ukatu behind N3bn Tramadol linked to Abba Kyari",
    "summarized_story": "Chief Afam Mallinson Emmanuel Ukatu, a Nigerian billionaire, has been identified as the drug baron behind the N3billion Tramadol deal involving the embattled suspended Deputy Commissioner of Police, Abba Kyari-led Intelligence Response Team, IRT.\nFemi Babafemi, the official spokesman of the National Drug Law Enforcement Agency, NDLEA, confirmed the development on Monday.\nAccording to NDLEA, Ukatu owns pharmaceutical and plastic manufacturing companies, which he used as a cover to import illicit drugs into Nigeria.\nThe monetary value of the 202 cartons of Tramadol seized from Mallinson in one day was over N3billion.\nAfter over eight months of following the lead, anti-narcotic officers of the Agency eventually arrested Ukatu at the Lagos airport on 13th April 2022."
  },
  {
    "headline": "Oromoni: Journalists barred from inquest coverage",
    "summarized_story": "By Adenike AyodeleA coroner sitting in Ikeja Magistrates’ Court on Monday barred journalists and other interested parties from covering and witnessing the inquest.\nThe case aims to unravel the circumstances that led to the death of a 12-year-old student of Dowen College Lagos, Sylvester Oromoni Jnr.\nNAN reported that the registrar of the court announced that the hearing was mainly for lawyers, and urged newsmen and other interested parties to leave the courtroom.\n“Journalists will be shut out from covering the inquest this week because minors will be testifying.\nOromoni’s family had alleged that the 12-year-old student died on Nov. 30, 2021, from injuries sustained in an attack by five senior students of the college."
  },
  {
    "headline": "Bala Mohammed: If Tinubu was in PDP, he would be handed the presidential ticket",
    "summarized_story": "Bala Mohammed: If Tinubu was in PDP, he would be handed the presidential ticketBala Mohammed, governor of Bauchi, says if Bola Tinubu, presidential hopeful of the All Progressives Congress (APC), was a member of the Peoples Democratic Party (PDP), he would be handed the presidential ticket in 2023.\nSpeaking on the programme, Mohammed said he met Tinubu among other eminent Nigerians, adding that the former Lagos governor would be given the presidential ticket because of his contributions if he was in the PDP.\nSupporters of Tinubu have been calling on the APC to hand him the presidential ticket because he “worked hard” in getting Buhari into office.\nShe has shown that she is a mother of the nation and all the presidential aspirants not only in PDP, APC but all the other parties were there.\nBut Tambuwal and other stakeholders rejected the report, saying it was not the agreement reached at a previous meeting of PDP presidential hopefuls."
  },
  {
    "headline": "Nigerian Military Arrests Wanted Bandit Terrorising Benue, Nasarawa, Taraba Communities, Others Killed",
    "summarized_story": "The wanted leader of a notorious gang of bandits terrorising communities in Benue, Nasarawa and Taraba states, Leggi Jibrin, has been arrested after a gun battle with troops of Operation Whirl Stroke, OPWS, the joint military/security operation covering the three states.\nAccording to Vanguard, the wanted bandit, who had been on the radar of OPWS, was arrested by the troops at Agam/Gidan Bawa village in the Nasarawa Local Government Area of Nasarawa State during a sting operation.\nThe source said, “Troops of OPWS deployed to Ugya in Toto LGA of Nasarawa State received credible intel and responded swiftly to a distress call of a kidnap incident at Zaure forest.\n“On arrival at the forest, our troops saw three trucks loaded with illegal timber that was abandoned in the forest.\nAccordingly, the troops combed the forest, stumbled on the kidnappers’ camp and rescued five of their victims."
  },
  {
    "headline": "JUST IN: NDLEA Arrests Billionaire Drug Baron Behind N3bn Tramadol Linked To Abba Kyari’s Team",
    "summarized_story": "Chief Afam Mallinson Emmanuel Ukatu, the billionaire drug baron behind the N3 billion Tramadol transaction involving the embattled suspended Deputy Commissioner of Police, Abba Kyari-led Intelligence Response Team, IRT, has been detained by NDLEA operatives.\nUkatu owns pharmaceutical and plastic manufacturing businesses that he used as a front to smuggle in illegal drugs in Nigeria.\nFollowing the arrest of Ukatu’s personnel, Pius Enidom and Sunday Ibekwete, Kyaris men were led by the suspects to Mallinson’s warehouse in Ojota, Lagos, where the IRT Team seized 197 more Cartons of Tramadol 225mg.\nThe monetary value of the 202 cartons of Tramadol seized from Mallinson in one day was over N3billion.\nThree weeks after the seizure, the Kyaris IRT team delivered only 12 cartons of Tramadol to the NDLEA’s Lagos Command, along with one truck and a suspect, leaving 190 cartons unaccounted for."
  },
  {
    "headline": "ASUU Faults FG’s Negotiation, May Continue Strike",
    "summarized_story": "Prof Emmanuel Osodeke, President of ASUU, and Chris Ngige, Minister of Labour and EmploymentThe Academic Staff Union of Universities has slammed the Federal Government’s handling of its requests negotiations and casual attitude toward the current strike.\nToday is the tenth week of the ASUU rollover strike, which will expire in two weeks.\nOn when the issue will be resolved, the minister had said, “It depends on ASUU.\nHe went on to say that the union may have no choice but to extend the strike after it expires.\nSimilarly, the Senior Staff Association of Nigerian Universities and the Non-Academic Staff Union of Education and Associated Institutions have extended their strike by one month."
  },
  {
    "headline": "Breaking: Pandemonium as explosion rocks Senate President’s home town, 1 dead, 6 injured",
    "summarized_story": "Resisdents of Gashua in Bade local government area of Yobe state are now living in fear after an Improvised Explosive Device (IED) triggered explosion hit the community Sunday night.\nAlready, one person has been confirmed dead while six others in a specialist hospital are injured.\nAn eyewitness said the incident occurred around 7:20pm when a heavy sound was heard, which threw the entire area into pandemonium.\nPolice Public Relations Officer (PPRO) Yobe state command, ASP Dungus Abdulkarim, confirmed to newsmen in Damaturu, that the explosion occurred from a likely IED.\n“Although our EOD detectives are at the scene to find out what type of explosion and the cause of the explosion."
  },
  {
    "headline": "Consensus: PDP row thickens as NEF disowns Bala, Saraki",
    "summarized_story": "The row generated by the consensus arrangement among some presidential aspirants within the Peoples Democratic Party(PDP) has generated further row, with the Northern Elders Forum (NEF) distancing itself from the plan.\nGovernor Tambuwal and Mr Hayatu-Deen were also reported to have presented themselves for the election.\nThe communiqué quoted Abdullahi as saying that a leading aspirant from the North-central and one from the North-east would be presented as northern presidential candidates.\nBala furthers campaignNotwithstanding the controversy around the consensus, Governor Bala Mohammed has promised to build on it and unfold his vision in a matter of days.\nHe also warned that “the position of the Northern Elders is not only injurious to the North but equally injurious to the Northern Aspirants”."
  },
  {
    "headline": "Presidency: US Think Tanks, policy experts in pursuit of Nigeria’s collapse",
    "summarized_story": "The presidency also berated the US policy experts and think tanks for their perennial attempts at predicting the country’s collapse; which, it said, does not paint a true picture of a country that has enjoyed 23 years of steady democracy 29 years since its last coup.\nThe statement partly read: “It is a pity therefore that US policy and support towards our country, including during the Buhari administration, has been so inconsistent.\n“In 2015 the then newly-elected Buhari government requested US military support in the form of Super Tucano jet fighters for the Nigerian Air Force.\nThe Nigerian military, security, and intelligence services repeatedly made this request.\n“Yet despite all the evidence to the contrary, the collapse predictors keep doubling down on their bets."
  },
  {
    "headline": "NCC, stakeholders brainstorm on Blockchain’s benefits to economy",
    "summarized_story": "By Onu OkorieThe Nigerian Communications Commission (NCC), stakeholders in the academia, the public sector and enthusiasts of technology for development, have deliberated on the benefits derivable from emerging technologies such as Blockchain, to advance the growth of the Nigerian economy.\nThe stakeholders, who spoke in turn at the workshop, acknowledged and profoundly appreciated the role of NCC in engendering a dynamic digital regulatory environment, the remarkable contribution to the growth and development of novel and emerging technologies, and NCC’s adoption of adaptive mechanisms that have enhanced emerging technologies in Nigeria.\nHe also affirmed that Blockchain would be central in the implementation of the National e-Govt Masterplan.\nArabi asserted that Nigeria ranks third in Africa, in the use of telecommunications for public service delivery, coming behind South Africa and Egypt.\nArabi called on policymakers to ensure robust policy formulation that ensures improved digital literacy and increased automation in public service delivery."
  },
  {
    "headline": "CBN defends multiple exchange rates",
    "summarized_story": "This was in reaction to the president of the World Bank, David Malpass, who had mentioned on Wednesday, at a press conference that, the multiple exchange rates in the country is not encouraging to investors and also not an effective way of managing the country’s exchange rate.\nAccording to Emefiele, the CBN is working on a home grown solution at merging the exchange rates even as he said there is need to first merge the level of demand with that of supply.\nThat will also start to also reduce the demand for foreign exchange that will normally will go for importation of petroleum products.\nRight now no foreign exchange for importation of rice or maize, very little amount for wheat.\nThat is what we’re trying to do and I imagine that by the time we achieved this, we will continue to engage with World Bank or the IMF,” he pointed out."
  },
  {
    "headline": "Sovereign Trust Insurance grows profit by 42%",
    "summarized_story": "By Kehinde Ibrahim LagosSOVEREIGN Trust Insurance Plc has announced that it recorded 42 per cent growth in its Profit After Tax in 2021.\nThe company’s Profit After Tax during the period stood at N974 million as against N687 million recorded in year 2020.\nProfit Before Tax equally increased from N796 million in 2020 to N885 million in the year under review, representing 11 per cent growth.\nThe net premium income also grew by 11 per cent from N6.5 billion to N7.2 billion in 2021.\n“The development is indeed a commendable one considering the myriad of challenges that the insurance industry had to deal with in the past year of 2021, ”the Sovereign Trust Insurance boss stated."
  },
  {
    "headline": "LG Technology helping families reduce food waste at Ramadan",
    "summarized_story": "By Kehinde Ibrahim LagosLG Electronics has said its innovative technology is helping families eat healthier and reduce food wastage during Ramadan.\nAccording to the general manager, Home Appliances Division, LG Electronics West Africa, Mr. Brian Kang, LG is committed to not just helping people eat healthy, but reducing food waste.\nHe said, “Food waste is a known issue during Ramadan, and.\nThe company said in a statement that global food waste is a massive issue with huge financial, ethical, and environmental costs.\nOne global brand that have continuously rethink how food wastage can be better managed is home appliance leader, LG Electronics."
  },
  {
    "headline": "Cable Equiano: Pantami, Danbatta pledge enabling policy environment for wider connectivity",
    "summarized_story": "The duo stated this on the sideline of the reception marking the landing of the Equiano undersea Cable System in Nigeria at the Open Access Data Centre at Lekki in Lagos.\nPantami and Danbatta commended Google LLC, the West Indian Ocean Cable Company (WIOCC), and other investors for bringing additional bandwidth capacity into the country to drive connectivity and growth.\nPantami also promised an enabling environment that encourages foreign and local investment in infrastructure project such as the way Google and its co-investors have done.\nDanbatta expressed delight that Equiano has joined the list of other submarine cables at the shores of Nigeria, including SAT3 cable, MainOne cable, Glo1 cable as well as the African Coast to Europe (ACE) submarine cable by Dolphin and West African Cable System (WACS) by MTN.\nThis is in keeping with the provisions of the digital economy policy being implemented by government in collaboration with all stakeholders."
  },
  {
    "headline": "NDLEA Nabs Suspected Drug Baron Behind N3bn Tramadol Linked To Abba Kyari’s Team",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA) have arrested a suspected billionaire drug baron.\nHe is behind the N3 billion Tramadol deal involving the embattled suspended Deputy Commissioner of Police, Abba Kyari-led Intelligence Response Team, (IRT), the Director, Media, and Advocacy of the NDLEA Femi Babafemi said in a statement on Monday.\nHe said after the arrest of one of his staff, Kyari’s men were then led by the suspects to his warehouse where 197 additional Cartons of Tramadol 225mg were seized by the IRT Team.\nThe monetary value of the 202 cartons of Tramadol seized from him in one day was over N3 billion.\nAccording to him, three weeks after the seizure, the Kyari’s IRT team transferred only 12 Cartons of the Tramadol with one truck and a suspect to the Lagos Command of the NDLEA, leaving 190 cartons unaccounted for."
  },
  {
    "headline": "World Leaders Welcome Macron’s Re-Election",
    "summarized_story": "World leaders rushed to congratulate France’s centrist President Emmanuel Macron on his re-election and defeat of far-right leader Marine Le Pen in elections Sunday.\n– Australia –Australian Prime Minister Scott Morrison said Macron’s victory was a “great expression of liberal democracy in action in uncertain times”.\nWorld Health Organization Director-General Tedros Adhanom Ghebreyesus said he looked forward to “continuing the important partnership” with France “for a healthier, safer, fairer world”.\n– Ireland –Prime Minister Micheal Martin hailed Macron’s “principled and dynamic leadership” as “important not only for France but for Europe”.\n– Sweden –Prime Minister Magdalena Andersson sent her “warmest congratulations”."
  },
  {
    "headline": "One Killed, Seven Injured As Explosion Rocks Yobe State",
    "summarized_story": "One person has been killed while seven others were injured after an Improvised Explosive Device (IED) exploded in Yobe state.\nThe incident happened on Sunday night at a local drinking joint at Abasha ward in Gashua, the headquarters of Bade Local Government Council of the state.\nGashua is located 187 kilometers away from Damaturu the state capital and is the hometown of Senate President Ahmed Lawan.\nREAD ALSO: Terrorists Attack Yobe Community, Kill NineThis incident followed a similar one masterminded by suspected Boko Haram insurgents in the Geidam community of the state where nine persons were killed.\nThe locals further explained the attackers took the residents and the military base at Geidam unaware as there was no gun battle."
  },
  {
    "headline": "Presidency Blames Bishop Kukah, Others For Delay In Delivery Of Tucano Jets",
    "summarized_story": "According to a statement issued on Sunday by Presidential Spokesman Garba Shehu, one of those opponents includes the Catholic Bishop of Sokoto Diocese, Matthew Hassan Kukah.\nBut despite previous predictions of coups in the country, democracy has remained unbroken for the past 29 years.\nIt is all very well to claim it is in the United States’ interests to help Nigeria become an even-better democracy and stable country.\nHopefully, the United States and Nigeria are going to forge ahead with our continuing partnership in fighting terrorism in and out of the sub-region.\nThe dream of our founding fathers of a strong, united and prosperous Nigeria remains very much intact."
  },
  {
    "headline": "World’s Oldest Person Dies In Japan At 119",
    "summarized_story": "A Japanese woman certified the world’s oldest person has died at the age of 119, local officials said Monday.\nShe married Hideo Tanaka a century ago in 1922, giving birth to four children and adopting a fifth.\nWhen the Guinness World Records recognised her as the oldest person alive in 2019, she was asked what moment she was the most happy in life.\n“I am extremely saddened by the news.”Japan has the world’s most elderly population, according to World Bank data, with around 28 percent aged 65 or over.\nThe oldest-ever living person verified by Guinness was Frenchwoman Jeanne Louise Calment, who died aged 122 years and 164 days in 1997."
  },
  {
    "headline": "2023: PDP row thickens as NEF disowns Bala, Saraki",
    "summarized_story": "The Northern Elders Forum (NEF) distancing itself from the purported consensus among some presidential aspirants within the People’s Democratic Party.\nThe quartet of Sokoto state Governor Aminu Waziri Tambuwal, Bauchi state Governor Abdulkadir Bala Mohammed, former Senate President Abubakar Bukola Saraki and renown economic expert and seasoned banker, Mohammed Hayatuo-Deen, had traversed the length and breadth of the country championing the consensus arrangement.\nBut the arrangement collapsed when the duo of Bala and Saraki from the North-east and North-central respectively, were announced by a committee of northern leaders and presidential aspirants within the party."
  },
  {
    "headline": "APC, PDP have monetised democracy in Nigeria",
    "summarized_story": "Veteran Journalist and Public Affairs Analyst, Babajide Kolade-Otitoju has accused the All Progressives Congress and the People’s Democratic Party of monitising democratic with their extravagant nomination form fees.\nHe made this known on Saturday while tearing on his show “Issues With Jide” an online programme that streams on TVC News Youtube Channel.\nThe Kogi-born journalists said the current fees released by the two parties for nomination forms clearly show democracy has been monitised in Nigeria."
  },
  {
    "headline": "Police hunt for fleeing lover who machetted girlfriend in Ondo -",
    "summarized_story": "The Police in Ondo State are investigating the bloody attack on a lady identified as Funmilola Ogundare by her boyfriend in Akure.\nHer boyfriend left her in a pool of blood.\nThe boyfriend left her in a pool of blood inside an apartment located in Ijapo Estate.\nSpokesperson of Ondo State Polo Command, Mrs Funmilayo Odunlami, explained that the suspect took the victim to his friend’s house where he allegedly committed the dastardly act.\nThe suspect took the woman to the apartment to spend the night with her."
  },
  {
    "headline": "APC reschedules sale of nomination forms, sends directors on leave -",
    "summarized_story": "The All Progressives Congress (APC) has rescheduled for next week the sale of expression of interest and nomination forms for elective positions which was originally fixed for today.\nThe leadership of the party has also sent all the six directors at the APC National Secretariat, on compulsory leave.\nAs the party rev up arrangements for their primaries which must be concluded by 3rd June , the Independent National Electoral Commission (INEC) has asked them to submit their membership registers to enable it monitor the primaries at all levels."
  },
  {
    "headline": "Lagos Rail to Commence Operations First Quarter 2023, Says Governor Sanwo-Olu",
    "summarized_story": "Lagos State Governor, Mr. Babajide Sanwo-Olu, on Sunday, inspected the on-going construction of the Lagos Rail Line project and said the first quarter 2023 target for commencement of operational service was sacrosanct.\nThe governor, however, warned those that had started vandalising the barricades around rail line to desist from the act, saying the tracks are hazardous.\nSanwo-Olu inspected the Blue line rail project alongside some of his cabinet members, top officials of Lagos Metropolitan Area Transport Authority (LAMATA), and contractors handling the project.\nThe first phase of the Blue line rail project starts from Mile 2 and terminates at Marina.\nMarina Station is an elevated station and it stretches out to outer Marina and terminates where the Governor’s residence is."
  },
  {
    "headline": "Nigeria: We’re Not Involved in PDP Consensus Arrangement, Northern Elders Say",
    "summarized_story": "“It is important to make clear that the entire process did not involve the Northern Elders Forum as a group, and is not a product of the group.\n“So, based on this, I didn’t go to Minna, and the decision that the two people are the Northern consensus candidate doesn’t in anyway reflect my wish, and should therefore not worry my supporters.\nI communicated with Governor of Bauchi Bala Mohammed whether he received same message which he did.\n“How come Babangida and the Northern elders he invited would impose it on us after all we took ourselves to him, and we later withdrew,” he stated.\nRather, it was the group of presidential aspirants made up of Senator Bala Mohammed, RT Hon Aminu Tambuwal."
  },
  {
    "headline": "Oil Theft: Nigerian Navy Seizes 6 Million Litres of Stolen Crude from Illegal Refiners",
    "summarized_story": "In furtherance of Operation Dakatar Da Barawo (OPDDB) that was launched to checkmate crude oil theft and related acts of economic sabotage, the Nigerian Navy said it seized 6, 000, 000 litres of stolen crude oil estimated at N264 billion.\nAccordingly, seven large cooking ovens, 10 large metal storage tanks and drums all laden with about 400,000 litres of illegally refined AGO and 20,000 litres of suspected illegally refined PMS were discovered.\nThe site also had five large pits holding approximately 700,000 litres of stolen crude oil.\nDuring the operation, 16 ovens, 31 metal storage tanks and seven large pits all filled with about 850,000 litres of stolen crude oil were equally deactivated.\n“The wooden boat was laden with 60,000Litres of illegally refined AGO together with over 100 sacks of same product."
  },
  {
    "headline": "Nigeria First Lady Aisha Buhari Advises Presidential Aspirants to Pick Women as Running Mates",
    "summarized_story": "The Wife of the President, Aisha Buhari at the weekend met with presidential aspirants drawn from all political parties with a plea on the aspirants to adopt women as their running mates in the forthcoming 2023 presidential poll.\nThe First Lady, who hosted the aspirants to Iftar (breaking of fast) at the State House, Abuja, also urged political parties to reserve certain percentage of contestable offices for women.\nAccording to her, considering the voting strength and involvement of women in politics, they should be adopted as running mates in the forthcoming elections.\n“In fact, it is high time women were adopted as running mates at all levels, considering their voting strength and active involvement in political processes.\nIf anybody want to win elections, you have got to come to the youth.”Also speaking, Kaduna State Governor, Mallam Nasir El Rufai, urged the aspirants not to neglect the North-west."
  },
  {
    "headline": "Nigeria: Only 16 Out of 5,100 Cases Have Been Convicted of Gender-Based Violence, Says Women Affairs Minister Tallen",
    "summarized_story": "The Minister of Women Affairs and Social Development, Paullen Tallen has revealed that out of 5, 100 cases of Gender Based Violence (GBV), only 16 of such cases have been convicted so far, nationwide.\nIndicting the judicial system over its slow judicial process, Tallen called on the Ministry of Interior to as a matter of urgency, include psychiatric evaluation as prerequisites for marriage.\nLamenting that there had been zero allocation for the fight against GBV, the minister said only organisations like the EU and UN Spotlight Initiative have given assistance.\n“Perpetrators need to be told that Nigeria is a society with Zero Tolerance against GBV.\nWe must put an end to the culture of reinforcing male dominance in the society.”"
  }
]