[
  {
    "headline": "Fauci calls Republican Senator ‘moron’ after tense exchange",
    "summarized_story": "Dr Anthony Fauci called Kansas Senator Roger Marshall a “moron” on Tuesday after a tense exchange over Fauci’s financial disclosures, a sign of the increasing hostility between conservatives and one of the nation’s top COVID-19 experts.\nWhen Fauci called Marshall “misinformed” and said his financial disclosure was public information and available upon request, Marshall said his office had been unable to find the information.\nThroughout the pandemic, Fauci has been a target of conservatives who have chafed at the way the government has handled health restrictions.\nFauci also clashed with Paul over an email exchange between him and former director of the National Institutes of Health Francis Collins.\nBut also those who have criticised him for public health measures intended to decrease the spread of the virus."
  },
  {
    "headline": "Boris Johnson faces parliament over latest party scandal",
    "summarized_story": "British Prime Minister Boris Johnson faced a parliamentary reckoning Wednesday about another alleged breach of coronavirus rules that has prompted damning headlines and calls for him to quit.\nJohnson is under fierce pressure to say whether he attended a boozy gathering in the garden of his Downing Street residence in May 2020, in the midst of the country’s first strict lockdown.\n“If the prime minister knowingly attended a party I don’t see how he can survive, having accepted resignations for far less,” Conservative lawmaker Nigel Mills told the BBC.\nJohnson, elected by a landslide in December 2019, will be quizzed for the first time on the latest claims by opposition Labour leader Keir Starmer and other MPs at weekly parliamentary questions from noon (1200 GMT).\nJohnson and his wife Carrie attended the gathering, according to anonymous witnesses quoted in the media, intensifying public anger from a time when millions were obediently respecting the lockdown rules."
  },
  {
    "headline": "Suspected killer of UniJos students, others arrested",
    "summarized_story": "By Marie-Therese NanlongThe Police in Plateau State have arrested and paraded one Moses Oko, a 20-year-old suspected Yahoo boy who allegedly killed one Jennifer Anthony, a 300L UNIJOS Student whose dead body was found on January, 1st, 2022.\nThe suspect was paraded alongside suspected personal effects of the deceased as well as blood-soaked bedsheet and blood-stained fork allegedly used to pluck the deceased’s eyes.\nAddressing journalists at the Police headquarters in Jos, the CP said, “The Command through my leadership has put together a lot of strategies to prevent crimes in Plateau State.\n“Upon receipt of the report, Police detectives attached to ‘A’ Division immediately swung into action and the following persons; Esther Sunday ‘f’ aged 26years; Jemila Thomas ‘F’ aged 36years; Victoria Danladi ‘f’ aged 36years and Joy Nnamani ‘f’ aged 18years all of Kabong Gada Biu Jos were arrested.\n“The Suspects have confessed to the crime and case has been transferred to the National Agency for the Prohibition of Trafficking in Persons (NAPTIP).”Others who were equally paraded were suspected cultists, robbery suspects and suspected kidnappers."
  },
  {
    "headline": "Group blames FG’s inaction for illegal miners’ operations in Edo",
    "summarized_story": "By Ozioruva AliuBENIN CITY – AN Edo State group; Concerned Indigenes of Dagbala (CID) in Akoko-Edo local government area of Edo State has said the delay by the federal government in taking action against illegal miners in many parts of the country and particularly Dagbala was fuelling illegal mining activities in the locality.\nConvener of the group and protem chairman, Philip Adelabu, stated this in a statement released to newsmen in Benin City.\n“Seriously, we are concerned with the fact that activities of illegal miners have heightened security in the area which have instilled fear among our people.\n“Our fear is further compounded with the denial that there was nothing like illegal mining there even in the face of attacks on some of our people by the illegal miners.\n“It is against this background that we are appealing to the concerned authority to allow the legitimate license holders to go back and occupy their respective allotted mining space in Oketegbe to put an end to the activity of these illegal miners,” he stated."
  },
  {
    "headline": "UN reappoints Amina Mohammed Deputy Secretary General",
    "summarized_story": "By Ibrahim HassanNigeria’s Amina Mohammed has been re-appointed United Nations, UN’s Deputy Secretary-General.\nREAD ALSO:Kuda Bank: Broadening banking access with innovationIn delegating development coordination to the Deputy Secretary-General, the UN scribe set in motion the most ambitious reform in the history of the organisation’s development system.\nMohammed’s leadership helped advance the conceptual shift from the UN that member- states called for in adopting the Sustainable Development Goals.\n“Over the last five years, the United Nations Sustainable Development Group was strengthened to enhance global leadership and oversight for development and the United Nations established a strengthened United Nations Resident Coordinator system as the foundation of a more effective development system,” the UN said in a statement.\nACF National Publicity Secretary, Emmanuel Yawe said the group was very happy she was found worthy of holding such a high office not only once but twice."
  },
  {
    "headline": "Gov Buni warns against sabotaging Gombe reconciliation",
    "summarized_story": "Mai Mala BuniGovernor of Yobe State and Chairman All Progressives Congress, APC, Caretaker Extraordinary Convention Planning Committee, Mai Mala Buni, yesterday said there was no truth in reports claiming that the party would review congresses in Gombe State.\nDirector General, Press and Media Affairs to the governor, Mamman Mohammed, quoted him as saying that the governor had at no time, said or directed anyone to state on his behalf or the party, anything pertaining to the said review.\nREAD ALSOBank customers advocate improvement in digital banking, complaints resolutionsAccording to the governor; “The report is a baseless speculation and a figment of the author’s imagination that does not reflect in any way the position of the party.\n“It is pertinent to note that, we have gone a long way in reconciling the two prominent members of the party in person of His Excellency, the Executive Governor of Gombe State, Alhaji Muhammadu Inuwa Yahaya and his brother, Senator Muhammadu Danjuma Goje.”“We condemn in strong terms any action deliberately concocted to sabotage the new peace and true reconciliation among these critical stakeholders of the party."
  },
  {
    "headline": "UN condemns Zamfara killings, asks FG to arrest perpetrators",
    "summarized_story": "The United Nations, UN, has condemned the recent attacks that claimed the lives of several residents in Zamfara State, calling on the Federal Government to arrest and prosecute the perpetrators.\nREAD ALSO:GOMBE: Transformation of the Savannah socio-economic landscape gains momentumAccording to the statement, “The Secretary-General strongly condemns the appalling attacks perpetrated over the weekend in Nigeria’s Zamfara State in which scores of civilians were killed.\n“The Secretary-General urges the Nigerian authorities to spare no effort in bringing those responsible for these heinous crimes to justice.\nAbout four villages were razed in the attacks that lasted more than 48 hours in Anka and Bukkuyum LGAs.\nThe killings attracted condemnation from various individuals and groups within Nigeria, and from the international community including President Muhammadu Buhari."
  },
  {
    "headline": "Allow your daughters to join Army – Yobe govt tells parents, guardians",
    "summarized_story": "The Yobe State Government has urged parents and guardians in the state to allow their daughters to join the Nigerian Army in order to help in defending the territorial integrity of the country.\nSpecial Adviser on Security Affairs to Governor Mai Mala Buni and Chairman, Yobe State Recruitment Committee, Brig.\nTalking about the transparency of the recruitment exercise, Abdulsalam said, “the Nigerian Army recruitment is the most transparent of all recruitment exercises.\nWhen also asked whether there is political interference in the recruitment screening exercise, the Chairman denied any political interference in the exercise.\nSo, there is no interference as far as Nigerian Army recruitment exercise is a concern”, he stressed."
  },
  {
    "headline": "Alleged N32.9bn money laundering: Court remands Mompha",
    "summarized_story": "The defendant was arraigned alongside his company, Ismalob Global Investment Ltd on a fresh eight-count charge of fraud.\nThe defendant is also currently facing trial at the Federal High Court Lagos on a 22-count fraud charge proffered against him by the EFCC.\nHe pleaded not guilty to a charge of conspiracy to launder funds obtained through unlawful activity, laundering of funds obtained through unlawful activity and retention of proceeds of criminal conduct.\nAccording to the EFCC, Mompha committed the alleged offence between 2016 to 2019 in Lagos.\n“The said sum involves the proceeds of a specified unlawful activity which is obtained by false pretence."
  },
  {
    "headline": "Pantami, Aregbesola set to commission digital Nigeria project in Osun",
    "summarized_story": "The Minister of Communications and Digital Economy, Prof. Isa Ali Ibrahim Pantami, and his counterpart in the Ministry of Interior, Ogbeni Rauf Aregbesola, will commission a Digital Nigeria Centre (DNC) project in Osun State on January 14, 2022.\nThis is in order to give concrete expression to the underlining principles and fundamental philosophy of the emergent digital culture in Nigeria, particularly Item No.\n2 of the eight pillars of the National Digital Economy Policy and Strategy (NDEPS) 2020-2030.\nThe Governor of Osun State, His Excellency, Adegboyega Oyetola, is also expected at the event as a Special Guest of Honour.\nThis project, the first to be commissioned in Osun State since the modification of the project as DNC, is located at the Ijesa Muslim Grammar School, Ilesa."
  },
  {
    "headline": "BREAKING: Ex-Oyo Governor, Alao-Akala is dead",
    "summarized_story": "A former Governor of Oyo State, Chief Christopher Adebayo Alao-Akala is dead.\nDAILY POST gathered that Alao-Akala, who is from Ogbomoso, died on Wednesday.\nHe was Oyo State Governor between 2007 and 2011.\nMedia aide to the former Governor, Tolu Mustapha confirmed the death to DAILY POST on Wednesday.\nIt has happened”."
  },
  {
    "headline": "NLC condemns bill to outlaw strikes in health sector",
    "summarized_story": "The Nigeria Labour Congress (NLC) has vehemently objected to the bill seeking to outlaw strikes in the health sector.\nThe NLC President, Ayuba Wabba, while briefing newsmen in Abuja on Tuesday, observed that the bill negated international and national laws.\nAyuba Wabba noted, “It is laughable, where industrial relations are working optimally, strikes can be avoided and therefore, this is the provision of the law and I am sure that those proposing the bill are not aware of those laws, and those laws are very explicit.”According to him, the bill was sponsored by a member of the House of Representatives, Simon Chukwuemeka Atigwe (PDP, Enugu), seeking to amend the Trade Disputes Act.\nHe explained that the bill, which prohibits health workers from embarking on strikes, has scaled first reading in the House.\nThe NLC President observed that the right of workers to strike constitutes a fundamental right of workers and their organization, especially unions used as a means of defending their interests, economic and social rights."
  },
  {
    "headline": "Makinde confirms ex-Oyo Governor Alao-Akala’s death",
    "summarized_story": "Oyo Governor Seyi Makinde has confirmed the death of one of his predecessors Otunba Adebayo Alao-Akala.\nMakinde dropped the hint when he was called to deliver a goodwill message at an ongoing interfaith prayers for Oyo workers.\nThe Governor, who said he got the news at the event, only called for a minute silence.\n- Advertisement -The former APC chieftain died Wednesday morning in his sleep at his Ogbomoso country home.\nThe cause of his death remains unknown."
  },
  {
    "headline": "17 things to know about late Ex-Oyo Governor Alao-Akala",
    "summarized_story": "17 things to know about late Ex-Oyo Governor Alao-AkalaA former Oyo Governor Otunba Christopher Alao-Akala, is dead.\nHe was a former Governor of Oyo State and a candidate of the ADP in the 2019 Governorship election in Oyo State.\nHe also attended the Administrative Staff College, Topo, Badagry; the Nigeria Institute of International Affairs (NIIA), Victoria Island, Lagos; Police Staff College, Jos; Command and Staff College, Jaji.\nHe served as the Deputy Governor of Oyo State from May 2003 to January 2006.\nFollowing the impeachment of then-incumbent Governor (Rashidi Ladoja), Alao-Akala was sworn into office as Governor in January 2006 and served for 11 months."
  },
  {
    "headline": "UPDATED: EFCC re-arraigns Mompha over alleged fresh N6b fraud",
    "summarized_story": "The EFCC also alleged that Mompha concealed his interest inexpensive wristwatches and an iPhone valued at over N70million.\n- Advertisement -They are a “Rolex Oyster Perpetual Wristwatch, Audemars Piguet Wristwatch, Audemars Piguet-J46220 Wristwatch, XY Hublot-1321920 Wristwatch, XY Hublot-924206 Wristwatch and an iPhone 8 with Serial No.\nAfter entertaining the submissions of counsel Justice Dada remanded Mompha in EFCC custody pending the hearing and ruling on his bail application on January 18, 2021.\nIn count 1, the defendants are accused of conspiracy to launder funds obtained through unlawful activity contrary to the Advance Fee Fraud and Other Fraud Related Offences Act, 2006.\nAUDEMARS PIGUET-J46220 WRISTWATCH, XY HUBLOT-1321920 WRISTWATCH, XY HUBLOT-924206 WRISTWATCH and iPhone 8 with serial no."
  },
  {
    "headline": "BREAKING: Ex-Oyo Governor Alao-Akala dies at 71",
    "summarized_story": "Former Oyo Governor Otunba Adebayo Alao-Akala is dead.\nAlao-Akala died exactly one month after the demise of the Soun of Ogbomosho.\nUnconfirmed source said the former Governor died on Wednesday morning in his sleep.\nAnother source said the convoy of the former Governor had already been rolled out for a trip to Ibadan before the incident.\nAkala was a former Deputy to Ex-Governor Rashidi Ladoja from 2003-2007 before he contested and emerged Governor in 2007."
  },
  {
    "headline": "I’ll match anybody grit for grit for APC presidential ticket – Orji Kalu",
    "summarized_story": "The Chief Whip of the Senate, Sen. Orji Kalu, says he is ready to contest the All Progressives Congress (APC) presidential ticket with anybody if the party zones it to the South.\nThis is contained in a statement issued by the former Abia governor and made available to the News Agency of Nigeria (NAN) on Wednesday.\nREAD ALSO: Buhari implored to help Southeast secure APC presidential ticket- Advertisement -According to Kalu, he has all that it takes to match anybody grit for grit, and campaign for campaign, for the APC presidential ticket.\nThe News Agency of Nigeria (NAN) reports that former Governor of Lagos State, Sen. Ahmed Tinubu, Gov.\nDave Umahi of Ebonyi and others, have declared their intention to seek nomination for the APC presidential ticket."
  },
  {
    "headline": "Ex-Oyo Governor Adebayo Alao-Akala is dead",
    "summarized_story": "From Oluseye Ojo, IbadanA former governor of Oyo State, Otunba Adebayo Alao-Akala, is dead.\nDaily Sun has learnt that the governor of the state between 2007 and 2011 died in the early hours of today.\nAlthough there has not been an official confirmation of his death, close aides to him said he died in the early hours of today in his Ogbomoso residence.\nAlao-Akala, who also served as deputy governor in the state between 2003 and 2007, was 71-years-old.\nOne of the security details of the governor said: ‘Oga went to bed yesterday night and with instruction that we would travel from Ogbomoso to Ibadan today."
  },
  {
    "headline": "Kalu rejoices with Senate President Ahmad Lawan at 63",
    "summarized_story": "By Iheanacho Nwosu, LagosFormer Governor of Abia State and Chief Whip of the Senate Dr Orji Kalu has described the Senate President, Senator Ahmad Lawan, as a patriotic statesman and compassionate politician.\nKalu, acknowledging the contributions of the Senate President to the growth and development of Nigeria, stressed that the celebrant is a strong advocate of democracy.\nIn a goodwill message, Kalu prayed for a longer life for the celebrant, noting that the Senate President deserves commendation for complementing the efforts of President Muhammadu Buhari in repositioning the country.\n‘On behalf of the people of Abia North Senatorial District, I congratulate the President of the Senate, Senator Ahmad Lawan on the occasion of his 63rd birthday anniversary,’ Kalu stated.\n‘In his current capacity, the Senate President has been a rallying point for his colleagues and contemporaries."
  },
  {
    "headline": "Ebonyi: Man strangles two grandchildren to death, hangs himself",
    "summarized_story": "From Chijioke Agwu, AbakalikiA sixty-year-old man, Mr Uguru Ugbo, from Ohagewaka Izzi in Izzi Local Government Area of Ebonyi State, has reportedly killed his two grandchildren.\nDaily Sun gathered that the suspect went on to commit suicide by hanging following the double murders.\nSources from the community gave the children’s names as Godspower and Saviour Ugbo, both below five years old.\nAnother grandchild, Chimdirim Ugbo, was also found unconscious and was rushed to the hospital,’ one of the sources who pleaded anonymity said.\nConfirming the incident, the Police Public Relations Officer, Mrs Loveth Odah, explained that the suspect allegedly hung himself on a rope at the back of his house after allegedly committing the crime."
  },
  {
    "headline": "I’ll consider contesting if APC zones ticket to South-East –Kalu",
    "summarized_story": "Chief Whip of the Senate, Orji Uzor Kalu, has said he will consider contesting for president if the All Progressives Congress (APC) zones its presidential ticket to the South-East.\nMeanwhile, Kalu has renewed the call for the postponement of the national convention of the party.\n“I still stand by my words that the APC convention should be postponed.\nI believe that the best thing to do is to protect democracy and our party, the APC.\nI want us to adopt the ANC method, where you might be president of Nigeria and not president of the party."
  },
  {
    "headline": "Shonekan: FG orders flag to fly at half-mast as Buhari, govs, IBB, Jonathan, Kalu, Ayu, Ayim, others mourn",
    "summarized_story": "“As a leader, Chief Shonekan was well respected because of the enormous goodwill he brought into governance.\n“Either as a politician or a boardroom guru, Chief Shonekan possessed a unique set skill of bringing stability to a tumultuous situation.\n“The late Chief Shonekan left behind worthy legacies for leaders at all levels to emulate.”Kalu prayed for the repose of the soul of Chief Shonekan, and urged the Shonekan family to uphold the remarkable attributes of their late patriarch.\n“Chief Shonekan was a first-class administrator, boardroom guru and astute leader whose imprint in the business and political firmaments can not be erased.\nAt each budget year, Chief Shonekan would be invited to critique our budget proposals, and gave us further input to enrich the final budget."
  },
  {
    "headline": "Breaking: Ex-Oyo Gov, Alao-Akala, Dies at 71",
    "summarized_story": "Kemi Olaitan in IbadanFormer Governor of Oyo State, Otunba Adebayo Alao-Akala, is dead.\nIt was gathered that the chieftain of the All Progressives Congress (APC) died on Wednesday.\nHowever, the cause of his death is still unknown at the time of filing this report.\nBorn on June 3, 1950, at Ogbomoso in the Ogbomoso North local government area of Oyo State, he had his elementary school at Osupa Baptist Day School, Ogbomoso before proceeding to Kamina Barracks Middle School, 5th Battalion of Infantry in Tamale, Ghana.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ernest Adegunle Oladeinde Shonekan, GCFR, CBE, 1936-2022",
    "summarized_story": "At each budget year, Chief Shonekan would be invited to critique our budget proposals, and gave us further input to enrich the final budget.\n“As a leader, Chief Shonekan was well-respected, because of the enormous goodwill he brought into governance.\nThe statement said, “Chief Shonekan was a first-class administrator, boardroom guru and astute leader, whose imprint in the business and political firmaments cannot be erased.\nIn his brief time as Head of State, Chief Shonekan tried his best to advance peace, stability and development in Nigeria.\n“Even outside office, Chief Shonekan remained committed to the unity, stability and development of our nation."
  },
  {
    "headline": "INTELS Responds to FG, Says Process of Awarding Pilotage Contract Not Closed",
    "summarized_story": "Eromosele AbiodunThe battle to retain its service boat contract in the pilotage district of Lagos, Warri, Bonny, Port-Harcourt and Calabar, which expired on August 8, 2020, may not be over yet as INTELS Nigeria Limited yesterday said it does not consider the process of awarding the Pilotage contract closed.\nINLTELS argued the service boat contract was being carried out by it for over a decade with excellent results both in terms of the service rendered and the revenue generated in favour of the NPA and by extension, Nigeria.\nIt is also the subject of a pending arbitration.\nThis has resulted in a significant and constant financial benefit for the NPA.”The second point, the statement added, was about the debt ratio between IINTELS/affiliate and the NPA.\nThat is, approximately $20 million per year for the 15 years set out in the settlement proposal."
  },
  {
    "headline": "Umahi in State House, Informs Buhari of His Presidential Ambition",
    "summarized_story": "Says Ohaneze should not dabble into politicsDeji Elumoye in AbujaGovernor Dave Umahi of Ebonyi State was on Tuesday at the State House, Abuja to inform President Muhammadu Buhari of his intention to run for President under the platform of the ruling All Progressives Congress (APC) in 2023.\nUmahi’s visit is coming barely 24 hours after the APC National Leader, Senator Bola Ahmed Tinubu, also visited the Villa to inform the President of his presidential ambition.\nThe governor, who spoke with newsmen after a closed-door meeting with President Buhari, said he stands a better chance to emerge as APC presidential candidate going by his pedigree as a governor in one of the South East states.\nUmahi said he was now ready to consult widely about his presidential ambition having informed the President who is the leader of “our great party”.\nAsked if he had informed the Igbo Socio-cultural group, Ohaneze, about his ambition, the governor said that was not necessary adding that the group should not involve itself in politics."
  },
  {
    "headline": "Shonekan, the Boardroom Guru, Who Became Head of Govt",
    "summarized_story": "The name Ernest Adegunle Oladeinde Shonekan entered Nigerian political lexicon on January 2, 1993 when former Military President, General Ibrahim Badamosi Babangida, appointed him as head of the Transition Council and Head of Government.\nHe later became the interim Head of State (Head of Interim National Government) after Gen Babangida ‘stepped aside’ from office on August 26, 1993 following the crisis that trailed the annulment of the June 12 presidential election, won by Chief MKO Abiola.\nAnd since then, Ernest Shonekan, GCFR, had remained in the political consciousness of Nigerians.\nPrior to his political career, Shonekan, a lawyer, had a rich background in the private sector.\nShortly after his spell as Head of the Interim National Government (ING), Shonekan in 1994 founded the Nigerian Economic Summit Group (NESG), a private sector-led think-tank and policy advocacy group."
  },
  {
    "headline": "BREAKING: Buhari's Regime Deactivates Sowore’s National ID Card, Permanent Voter Card, International Passport, Gives No Reason For Action",
    "summarized_story": "The Nigerian Government has deactivated biometric identification of human rights activist and former Presidential candidate, Omoyele Sowore.\nThe documents deactivated include the activist’s national identity card, permanent voter card, international passport and driver license.\nThe allegation was later dropped when the DSS realised Sowore had never been to the United Arab Emirate.\nIn all, Sowore spent over four months in detention despite two court orders directing his release on bail during that period.\nObservers around the world including leading legal practitioners have described the charges against the activist as frivolous and laughable."
  },
  {
    "headline": "BREAKING: Buhari's Regime Deactivates Sowore’s National ID Card, Permanent Voter Card, International Passport, Gives No Reason For Action",
    "summarized_story": "The Nigerian Government has deactivated biometric identification of human rights activist and former Presidential candidate, Omoyele Sowore.\nThe documents deactivated include the activist’s national identity card, permanent voter card, international passport and driver license.\nThe allegation was later dropped when the DSS realised Sowore had never been to the United Arab Emirate.\nIn all, Sowore spent over four months in detention despite two court orders directing his release on bail during that period.\nObservers around the world including leading legal practitioners have described the charges against the activist as frivolous and laughable."
  },
  {
    "headline": "BREAKING: Buhari's Regime Deactivates Sowore’s National ID Card, Permanent Voter Card, International Passport, Gives No Reason For Action",
    "summarized_story": "The Nigerian Government has deactivated biometric identification of human rights activist and former Presidential candidate, Omoyele Sowore.\nThe documents deactivated include the activist’s national identity card, permanent voter card, international passport and driver license.\nThe allegation was later dropped when the DSS realised Sowore had never been to the United Arab Emirate.\nIn all, Sowore spent over four months in detention despite two court orders directing his release on bail during that period.\nObservers around the world including leading legal practitioners have described the charges against the activist as frivolous and laughable."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, EFCC Invites Ogun Assembly Speaker, Lawmakers Again For Financial Fraud After Governor Abiodun 'Killed' First Invitation",
    "summarized_story": "Nigeria’s Anti-graft agency, the Economic and Financial Crimes Commission (EFCC) has again invited the Speaker of the Ogun State House of Assembly, Olakunle Oluomo, for questioning over alleged financial misappropriation, forgery and money laundering.\n“This led to a rift between the Speaker and the recently impeached Deputy Speaker after the latter demanded accountability and transparency.\nThe current Speaker and 3 other current members were part of the 8th Assembly under investigation.\nA current Special Adviser to the Governor of Ogun state who also has a school certificate scandal case over him, was part of the 8th Assembly under the EFCC radar.\n“Speaker falsified some contents {S.7(4)} of Ogun State Legislative Funds Management Bill, after passage, for personal/selfish grounds."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, EFCC Invites Ogun Assembly Speaker, Lawmakers Again For Financial Fraud After Governor Abiodun 'Killed' First Invitation",
    "summarized_story": "Nigeria’s Anti-graft agency, the Economic and Financial Crimes Commission (EFCC) has again invited the Speaker of the Ogun State House of Assembly, Olakunle Oluomo, for questioning over alleged financial misappropriation, forgery and money laundering.\n“This led to a rift between the Speaker and the recently impeached Deputy Speaker after the latter demanded accountability and transparency.\nThe current Speaker and 3 other current members were part of the 8th Assembly under investigation.\nA current Special Adviser to the Governor of Ogun state who also has a school certificate scandal case over him, was part of the 8th Assembly under the EFCC radar.\n“Speaker falsified some contents {S.7(4)} of Ogun State Legislative Funds Management Bill, after passage, for personal/selfish grounds."
  },
  {
    "headline": "'Those asking why I haven't completed bridge project don't have cars' -- Ikpeazu lashes out at critics",
    "summarized_story": "Okezie Ikpeazu, governor of Abia, has lashed out at those asking why it is taking long for his administration to complete the construction of a bridge in the state.\nThe construction of Aba-Osisioma flyover is said to have begun in 2017 — over four years since his administration commenced the project.\nThe governor said those asking about the project do not have cars, adding that people who do not have cars have no business with a flyover.\nI started the flyover on my own because I saw the need for it,” he said after he was asked about the project.\n“Most of the people demanding updates on the flyover don’t have vehicles, they are moving about with legs."
  },
  {
    "headline": "'Those asking why I haven't completed bridge project don't have cars' -- Ikpeazu lashes out at critics",
    "summarized_story": "Okezie Ikpeazu, governor of Abia, has lashed out at those asking why it is taking long for his administration to complete the construction of a bridge in the state.\nThe construction of Aba-Osisioma flyover is said to have begun in 2017 — over four years since his administration commenced the project.\nThe governor said those asking about the project do not have cars, adding that people who do not have cars have no business with a flyover.\nI started the flyover on my own because I saw the need for it,” he said after he was asked about the project.\n“Most of the people demanding updates on the flyover don’t have vehicles, they are moving about with legs."
  },
  {
    "headline": "Alao-Akala, former Oyo governor, is dead",
    "summarized_story": "Adebayo Alao-Akala, former governor of Oyo state, is dead.\nAlao-Akala died on Wednesday, aged 71.\nHe was born on June 3, 1950 in Ogbomosho, Oyo state.\nHe was said to have died in his sleep in Ogbomoso on Wednesday morning.\nBut the truth is Governor Akala is no more."
  },
  {
    "headline": "Alao-Akala, former Oyo governor, is dead",
    "summarized_story": "Adebayo Alao-Akala, former governor of Oyo state, is dead.\nAlao-Akala died on Wednesday, aged 71.\nHe was born on June 3, 1950 in Ogbomosho, Oyo state.\nHe was said to have died in his sleep in Ogbomoso on Wednesday morning.\nBut the truth is Governor Akala is no more."
  },
  {
    "headline": "Umahi: APC's presidential ticket should be zoned to south-east for fairness",
    "summarized_story": "David Umahi, governor of Ebonyi, has said the presidential ticket of the All Progressives Congress (APC) should be zoned to the south-east for “equity and fairness”.\nUmahi, who on Tuesday declared his intention to be the party’s standard-bearer at the 2023 presidential election, spoke in a chat with Arise TV on Wednesday.\nThe governor said, given the “sentiment being expressed by all the sectors of the society”, APC should zone its presidential ticket to the south-east “to enable the nation move forward”.\n“And nobody is saying, ‘if you don’t zone it to the south-east, the nation will not move forward’, but I think that if a nation is built on equity and fairness then there is going to be progress and prosperity.\nSo you can understand that I’m new in the house and whatever happens in terms of my desire and that of the south-east is a favour.”"
  },
  {
    "headline": "TLcom Capital backs Nigeria’s SeamlessHR in $10m Series A round",
    "summarized_story": "Nigerian startup SeamlessHR, which provides payroll and HR software-as-a-service (SaaS) solutions for medium to large-sized companies in several African countries, has closed a new $10 million Series A round.\nAfrica-focused VC firm, TLcom Capital led the round while some of SeamlessHR’s existing investors participated once again, such as Lateral Capital and Enza Capital.\nSeamlessHR started in 2013 as Insidify.com, a jobs aggregator with a recruitment management system that matched employers to job seekers.\nAfter several iterations, the founders made a strategic pivot, relaunching in 2018 as an enterprise-grade, cloud-based HR and payroll management SaaS.\n“Thanks to our customers, we have become the leading cloud HR and Payroll SaaS in Africa in such a short time,” CEO Okeleji said."
  },
  {
    "headline": "Unchecked ambition, lax regulations: The genesis of predatory digital lenders in Nigeria",
    "summarized_story": "But, as the years went by, new digital lenders popped up at different corners.\nSome digital lenders even started giving out loans to people with bad ratings on credit bureau—an obvious red flag.\nWhen debtors defaulted, the banks, however, unlike digital lenders, responded differently to the defaults.\nFortunately, a number of governing bodies are beginning to do something about these digital lenders.\nIf victims like Anyaeji and his friends would ever be free from the disturbance and intimidation from these predatory digital lenders, Nigeria’s regulators would have to increase the pace of their response."
  },
  {
    "headline": "On the making of King of Boys, Netflix’s first original Nigerian series",
    "summarized_story": "KOB 2 was well received by movie lovers as it topped Netflix’s top-ten movie charts for many weeks.\nMA: Interestingly, as at the time we started shooting KOB 2, I don’t think it was confirmed as a Netflix original.\nDA: Considering that this was Netflix’s first Nigerian original series, how much technical support did Netflix bring in?\nDA: What was the difference between shooting a regular movie and a 7-part series?\nMA: Another thing that’s noteworthy is that, when we finished shooting King of Boys, nobody knew we had shot a series."
  },
  {
    "headline": "Cameroon risks stunting mobile money growth with new transaction levy",
    "summarized_story": "Among Cameroonians, new year celebrations have so far coincided with pushback against a new tax on mobile money transactions introduced by the Paul Biya administration.\n#WeSayNo.”The new mobile money tax will especially hit the poorest, unbanked segments of Cameroon society.\nA later study also points out that many mobile money users belong to “marginalised societal groups” hence the negative impact on financial inclusion and broader development goals of mobile money taxes is significant.\nSimilarly, a 1% tax on mobile money transactions in Uganda was cut in half after protests.\nUnlike Ghana’s case, however, citizens were barely informed of the details before Cameroon’s government implemented the new mobile money tax in November, according to local media reports."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Here are the confirmed speakers for Techpoint Build 2021",
    "summarized_story": "So, in no particular order, here are your speakers for Techpoint Build 2021.\nVictor EkwealorVictor EkwealorVictor Ekwealor is a technology analyst, entrepreneur, and media professional with extensive experience in the startup ecosystem.\nHe will be your host at Techpoint Build 2021.\nDare-Johnson’s career spans several industries with over a decade of marketing experience at tech startups, FMCGs, and the healthcare industry.\nThis is not a comprehensive list of all our speakers and will be updated as we receive confirmation."
  },
  {
    "headline": "ANKA’s Series A, Cyberattacks in Africa",
    "summarized_story": "Share this article:Hi there,Here’s what we’re discussing today:ANKA’s Series ACyberattacks in AfricaANKA raises $6.2 million Series AThe ANKA teamIvorian eCommerce startup, ANKA, has announced its $6.2 million pre-Series A round.\nWith the fresh injection of capital, it will be focusing on building the mobile infrastructure of ANKA’s eCommerce SaaS, hiring more talent, and product development.\nCyberattacks in AfricaPhoto by Dan Nelson on UnsplashIf you’re anything like me, you don’t lose any sleep over potential cyberattacks.\nAccording to the cybersecurity firm, Check Point Research, the fourth quarter of 2021 witnessed an astonishing rate of cyberattacks, with organisations seeing about 925 cyberattacks weekly.\nOf all regions surveyed, Africa had the highest volume of attacks, with organisations on the continent facing 1353 attacks weekly."
  },
  {
    "headline": "Crypto made it to AFCON! Aren’t African governments wary?",
    "summarized_story": "Anyways, the entire situation was surprising since AFCON is one of the world’s major continental tournaments, like Euros and Copa America.\nGetting the global crypto-trading platform on AFCON basically translates to legitimately allowing millions of Africans to see crypto ads on every matchday.\nThe terms of the partnership involve having Binance adverts placed on the perimeter boards on all the stadiums hosting AFCON matches.\nNigeria continues to lead crypto peer-to-peer transactionsIt might not be convenient to argue that the football governing body for Africa, the Confederation of Africa Football (CAF), isn’t aware of this apathy.\nClubs like Tottenham Hotspur FC, Brighton & Hove Albion FC, Cardiff City FC, Crystal Palace FC, Leicester City FC, Newcastle United FC, and Southampton FC make the list."
  },
  {
    "headline": "Buhari orders audit of economy under tenure",
    "summarized_story": "President Muhammadu Buhari has ordered a wholesale audit of key aspects of the Nigerian economy as he seeks a better understanding of the health of Africa’s largest economy following the appointment of a chief economic adviser, BusinessDay has learnt.\nThe detailed review will involve examination of trade policies, fiscal and monetary policies as well as the institutions that are relevant to these policies.\nThe audit will cover the past six and half years and the report is expected to be handed in to the president before the end of March.\nOn trade, the president seeks an examination of the effectiveness of key policies in this regard and to locate where there have been problems with implementation including those accentuated by policies/goals misalignment.\nIn the time left, it is expected the president will seek the acceleration of key economic reforms, some of which have already been approved and others still in the works."
  },
  {
    "headline": "Buhari orders audit of economy under tenure",
    "summarized_story": "President Muhammadu Buhari has ordered a wholesale audit of key aspects of the Nigerian economy as he seeks a better understanding of the health of Africa’s largest economy following the appointment of a chief economic adviser, BusinessDay has learnt.\nThe detailed review will involve examination of trade policies, fiscal and monetary policies as well as the institutions that are relevant to these policies.\nThe audit will cover the past six and half years and the report is expected to be handed in to the president before the end of March.\nOn trade, the president seeks an examination of the effectiveness of key policies in this regard and to locate where there have been problems with implementation including those accentuated by policies/goals misalignment.\nIn the time left, it is expected the president will seek the acceleration of key economic reforms, some of which have already been approved and others still in the works."
  },
  {
    "headline": "BEDC to restore service to Uvbe, Evbuobanosa, Abudu, others soon – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOGHADA – Expectations are high in some communities in Orhionmwon and parts of Uhunmwode local government areas of Edo State, as maintenance work on broken down electricity cables, poles and transformers in the area is expected to commence soon.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, among others have been without electricity for more than five years.\nAccording to a youth leader in the area, Saturday Irabor, the Agbor business unit of Benin Electricity Distribution Company (BEDC) notified the communities of arrangements to reconnect them back to the national grid.\nThe official was however silent about the electricity debt owed by the communities, which BEDC earlier said prompted it to suspend service to the area.\nHowever, barely two months after the installation, vandals struck and went away with the armoured cables in the transformers which they later abandoned inside a bush where the community recovered them."
  },
  {
    "headline": "Delta Police Arrests Suspected Internet Fraudsters, Recovery Arms, Ammunitions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command says that two suspected internet fraudsters are currently cooling their feet in police custody following his arrest on the 8/01/2022 .\nABH 911 GW with two male occupants namely Daniel Anikpe “M” age 27Yrs and Chikeluba James Ani “M” age 27Yrs both residing at Ulo line shop off Asaba –Ibusa road.\n“After a painstaking search was conducted on the suspects and the vehicle, one locally made double barrel pistol, three live cartridges, one jack knife, two wraps of substances suspected to be Indian hemp.\n“He also stated that he bought the gun at a cost of twenty-five thousand naira(#25,000).\nInvestigation is ongoing.” The statement said."
  },
  {
    "headline": "Edo community vs abattoir operator: Absence of defendant lawyer stall case in court – Nigerian Observer",
    "summarized_story": "The community also asked for N5 million damages from the defendant for the nuisance she has alleged been and still constituting in the area.\nAt the hearing yesterday, counsel to the defendant pleaded for adjournment on the ground that his principal, Dr. Osagie Obayuwana, was at the Supreme Court, in Abuja and would wanted to personally handle the case.\nHe told the court that Dr. Obayuwana would appear before the court on the next adjourned date.\nHe however urged the court to fine the defense counsel N50,000, so that they would be deligent in the case next time.\nChief Magistrate Prince Mutairu Oarhe, having listern to both counsels argument and counter argument adjourned the case to February 16, 2022 for continuation of hearing."
  },
  {
    "headline": "Obaseki mourns death of former Interim Head of Govt, Ernest Shonekan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI am saddened by the passing of Nigeria’s former Interim Head of National Government, Chief Ernest Shonekan, at the age of 85.\nShonekan was an unassuming leader and a cerebral lawyer, who helped to steady our nation during the turbulent years of Nigeria’s Third Republic.\nAs the founder of the Nigeria Economic Summit Group, his commitment to private and free enterprise remains indelible in the annals of our history.\nIt is heartbreaking that Chief Shonekan will not be available to offer his priceless advice and guidance as we approach another election season.\nHe will be remembered for his fortitude while he was on the saddle as Interim Head of National Government as well as the genuine effort made to guide Nigeria back to democratic rule."
  },
  {
    "headline": "Ex-Oyo Governor, Alao-Akala dies at 71",
    "summarized_story": "Former Oyo State governor, Otunba Christopher Alao-Akala has died, aged 71.\nAlao-Akala was enlisted as Cadet Inspector of Police in June 1974, at the Nigeria Police College, Ikeja.\nKwara State Command, Ilorin; Assistant Commissioner of Police, Agodi Area Command, Ibadan, Oyo State Police Command, Ibadan.\nDr. Alao-Akala was a businessman who founded and chaired TDB Global Ventures and Parrot FM radio station, both in Ogbomoso, Oyo State.\nFollowing the impeachment of then incumbent Governor, Rashidi Ladoja, Alao-Akala was sworn into office in January 2006 and served for 11 months."
  },
  {
    "headline": "FBN General partners supermarket to deepen insurance penetration",
    "summarized_story": "BY EMEKA EJEREA partnership between FBN General Insurance and Supersaver Supermarket has launched a customer loyalty insurance scheme as part of its strategies to deepen insurance penetration.\nA leading community supermarket, Supersaver Supermarket’spartnership with FBN General Insurance is targeted at establishing a mutual business relationship between the companies and the benefiting customers.\nThe scheme, which offers gift vouchers to Supersaver customers on attainment of N100,000, also offers the customers an FBN General Insurance Personal Accident cover that ranges from a cumulative value of N600,000 to N3.4million for one year, depending on the option.\nHe said: “We are delighted to launch this proposition in partnership with Supersaver.\n“I want to assure our customers and stakeholders that FBN General Insurance will continue to leverage on diversified business model to ensure they are satisfied at all times.’’Facebook Notice for EU!"
  },
  {
    "headline": "Heineken set to takeover minority shares in Champion Breweries",
    "summarized_story": "Adebayo ObajemuIn a bid to increase its equity share in Champion Breweries, Heineken has opened application list for a N3.11 billion takeover bid of minority shares in Champion Breweries, a move that may see the Netherlands-based Heineken increasing its controlling equity in the Nigerian brewer to about 76 per cent.\nThe brewery giant , through its wholly-owned subsidiary, Raysun Nigeria Limited, is aiming to have about 1.197 billion ordinary shares of 50 kobo each or about 15.3 per cent additional stake in Champion Breweries under a mandatory takeover bid (MTO).\nThe qualification date for the MTO was Friday, December 31, 2021, implying that only minority shareholders of Champion Breweries as at the close of business on December 31, 2021 can participate in the ongoing offer.\nShareholders may accept the MTO at their discretion.\nIt should be noted that Heineken, through Raysun Nigeria Limited, has 60.7 per cent majority equity stake in Champion Breweries, while Akwa Ibom State holds 10 per cent equity stake as other Nigerian shareholders hold 29.3 per cent equity stake."
  },
  {
    "headline": "2023 Guber Polls: Could the return of Austin Igwe Edeze to PDP alter Ebonyi State political equation?",
    "summarized_story": "By Chris NwanzeThe recent detection of Chief Austin Igwe Edeze from the All Progressives Congress (APC) to the People’s Democratic Party (PDP) in Ebonyi State has jolted the prevalent political equation, vis-a-vis the 2023 political permutations in the state.\nHe was a dedicated and loyal disciple to Egwu during his days as Governor of Ebonyi State.\nIn Ebonyi Central District, two political gladiators are equally in the race for the 2023 Guber race.\nHe was later appointed into the powerful office as Executive Chairman of Ebonyi State Universal Basic Education Board(2002-2007) by former Governor of Ebonyi State, Dr. Sam Egwu.\nIn 2015, he was the Ebonyi State Coordinator of the Buhari Campaign Organization."
  },
  {
    "headline": "2023 Presidency: Gov Bello Is The Best Of The Pack – Group",
    "summarized_story": "A political support group ‘Got Your Back Nigeria’ said Governor Yahaya Bello of Kogi state has the support of even the opposition party to run for the presidency come 2023.\nADVERTISEMENTHe said: “The names listed on the PDP side were Atiku Abubakar, Aminu Tambuwal, Bukola Saraki, Bala Mohammed, Peter Obi, Sam Ohuabunwa, Goodluck Jonathan and Pius Anyim.\nAnd on the APC side were names like Bola Tinubu, Prof Yemi Osinbajo, Governor Yahaya Bello, Rochas Okorocha, Rotimi Amaechi, Godswill Akpabio, Kayode Fayemi and Babatunde Fashola.\nADVERTISEMENT“Finally on the program in reference, the Guests and the Anchor of that didactic show on politics (Politics Today), were unanimous in the chances of the name that stole the show.\nIt was Governor Yahaya Bello (GYB) everywhere throughout the duration of the show."
  },
  {
    "headline": "JUST-IN: Policeman Shot Dead In Ondo",
    "summarized_story": "A yet-to-be identified Police officer has been shot dead by gunmen at Oke Maria axis in Oka-Akoko, Akoko South West local government area of Ondo State.\nA source informed LEADERSHIP that the policeman was believed to have been killed by armed robbers on Tuesday evening.\nThe State Police Public Relations Officer, DSP Oluwafunmilayo Odunlami, confirmed the incident when contacted.\nOdunlami said, “It is true, but I am waiting for a report before I can give you full details.”ADVERTISEMENTDetails Later…ADVERTISEMENT"
  },
  {
    "headline": "Army Appoints, Redeploys GOCs, Other Senior Officers",
    "summarized_story": "The Nigerian Army has appointed Major General OJ Akpor as Director of Defence Information and redeployed General Officers Commanding (GOCs) and other senior officers in a major shake-up.\nThe director, Army Public Relations, Brigadier General Onyema Nwachukwu, announcing the redeployment, said the Chief of Army Staff, Lieutenant General Faruk Yahaya, approved the posting and appointment of senior officers of the Nigerian Army in an effort to rejig and reinvigorate the Army.\nOthers are; Major General SE Udounwa from Army War College Nigeria, he moves to the newly established Army Headquarters Department of Special Services and Programmes as Chief of Special Services/Programmes (Army), whereas Major General MT Durowaiye moves from Army Headquarters Department of Policy and Plans to Army Headquarters Department of Administration (Army) and appointed Director, Veteran Affairs Directorate.\nAdditionally, Major General HT Wesley moves from Office of the Chief of Army Staff to Headquarters Defence Intelligence Agency and appointed Director Administration; Major General J.O.\nOchai moves from Army Headquarters Department of Operations to Nigerian Army Armour School and appointed Commandant; Major General SG Mohammed moves from 6 Division to Army Headquarters Department of Policy and Plans as Deputy Chief of Policy and Plans, amongst others."
  },
  {
    "headline": "Army Appoints, Redeploys GOCs, Other Senior Officers",
    "summarized_story": "The Nigerian Army has appointed Major General OJ Akpor as Director of Defence Information and redeployed General Officers Commanding (GOCs) and other senior officers in a major shake-up.\nThe director, Army Public Relations, Brigadier General Onyema Nwachukwu, announcing the redeployment, said the Chief of Army Staff, Lieutenant General Faruk Yahaya, approved the posting and appointment of senior officers of the Nigerian Army in an effort to rejig and reinvigorate the Army.\nOthers are; Major General SE Udounwa from Army War College Nigeria, he moves to the newly established Army Headquarters Department of Special Services and Programmes as Chief of Special Services/Programmes (Army), whereas Major General MT Durowaiye moves from Army Headquarters Department of Policy and Plans to Army Headquarters Department of Administration (Army) and appointed Director, Veteran Affairs Directorate.\nAdditionally, Major General HT Wesley moves from Office of the Chief of Army Staff to Headquarters Defence Intelligence Agency and appointed Director Administration; Major General J.O.\nOchai moves from Army Headquarters Department of Operations to Nigerian Army Armour School and appointed Commandant; Major General SG Mohammed moves from 6 Division to Army Headquarters Department of Policy and Plans as Deputy Chief of Policy and Plans, amongst others."
  },
  {
    "headline": "NIMC Servers Most Secure For Identity Management – DG",
    "summarized_story": "The National Identity Management Commission (NIMC) has said that its servers were not breached but are fully optimised at the highest international security levels as the custodian of the most important national database for Nigeria.\nMaking this declaration in his New Year message contained in a statement issued on Tuesday, NIMC director-general, Engr.\n“Over the years, through painstaking efforts, NIMC has built a robust and credible system for Nigeria’s identity database.\nThe Commission and its infrastructure are certified to the ISO 27001:2013 Information Security Management System Standard which are revalidated annually.\nEngr Aziz also appealed to all stakeholders to embrace the identity, enrol and receive their NINs."
  },
  {
    "headline": "Drama as Mummy G. O.’s church tightens security, deploys ‘holy’ police",
    "summarized_story": "She would later discover that Mummy G. O.’s Rapture Proclaimer Evangelical Church of God Church, located in the estate, is responsible for the sudden increase in strange faces.\nWhen a PREMIUM TIMES reporter visited the estate on Monday afternoon, something was different.\nYou must cover your hairNo coloured hair is allowed, and you must not visit Mummy G.O.’s church with your hair uncovered.\nYou must not come to Mummy G.O.’s church without a bible.\nMake-up Is prohibitedIf you visit Mummy G.O.’s church, ensure that you do not wear make-up."
  },
  {
    "headline": "Drama as Mummy G. O.’s church tightens security, deploys ‘holy’ police",
    "summarized_story": "She would later discover that Mummy G. O.’s Rapture Proclaimer Evangelical Church of God Church, located in the estate, is responsible for the sudden increase in strange faces.\nWhen a PREMIUM TIMES reporter visited the estate on Monday afternoon, something was different.\nYou must cover your hairNo coloured hair is allowed, and you must not visit Mummy G.O.’s church with your hair uncovered.\nYou must not come to Mummy G.O.’s church without a bible.\nMake-up Is prohibitedIf you visit Mummy G.O.’s church, ensure that you do not wear make-up."
  },
  {
    "headline": "Buhari okays establishment of Nigeria Diaspora Investment Trust Fund",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari Tuesday in Abuja endorsed the establishment of the Nigerian Diaspora Investment Trust Fund (NDITF), a private sector investment window with Nigerians in the Diaspora to support direct investments in the country.\nSpeaking at the presentation of a compendium entitled +600 Diaspora Icons @ 60, published by the Nigerians in Diaspora Commission (NiDCOM), the President said Nigeria is open to welcoming the Diaspora Direct Investment by compatriots abroad.\n‘‘As we launch the compendium of excellent Nigerians today, we are also celebrating some of our best, nationally and globally.\nRecounting his engagements with Nigerians in the Diaspora during his official travels abroad, the President said his Diaspora threefold agenda remains unchanged.\n‘‘They should be the best and excel in all their endeavours and they should ‘give back’ by contributing to the development of Nigeria.’’The President commended the Diaspora Commission led by Hon."
  },
  {
    "headline": "Buhari okays establishment of Nigeria Diaspora Investment Trust Fund",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari Tuesday in Abuja endorsed the establishment of the Nigerian Diaspora Investment Trust Fund (NDITF), a private sector investment window with Nigerians in the Diaspora to support direct investments in the country.\nSpeaking at the presentation of a compendium entitled +600 Diaspora Icons @ 60, published by the Nigerians in Diaspora Commission (NiDCOM), the President said Nigeria is open to welcoming the Diaspora Direct Investment by compatriots abroad.\n‘‘As we launch the compendium of excellent Nigerians today, we are also celebrating some of our best, nationally and globally.\nRecounting his engagements with Nigerians in the Diaspora during his official travels abroad, the President said his Diaspora threefold agenda remains unchanged.\n‘‘They should be the best and excel in all their endeavours and they should ‘give back’ by contributing to the development of Nigeria.’’The President commended the Diaspora Commission led by Hon."
  },
  {
    "headline": "Ex-Oyo governor Alao-Akala is dead",
    "summarized_story": "Former governor of Oyo State Adebayo Alao-Akala is dead.\nThough details of his death were sketchy, multiple reports said he died in his sleep early today.\nAlao-Akala, a former police officer died died exactly a month after the monarch of his Ogbomoso town, died.\nAlao-Akala, born 3 June 1950, was governor of Oyo state between 2006 and 2011.\nUntil his death, he was a member of the All Progressives Congress."
  },
  {
    "headline": "NDLEA officials arrest comedian Iam Degeneral",
    "summarized_story": "Officials of the National Drug Law Enforcement Agency (NDLEA) have stormed the home Instagram comedian, Sunday Joshua Martins, popularly known as Iam Degeneral.\nThe officials reportedly manhandled the popular comedy skit maker, in the early hours of Wednesday, before arresting him.\nThe comedian in a video could be seen being beaten by the officials as he recorded the arrest.\nAll these videos that you’re also doing, you don’t have the right to do them,” one of the officials said.\nAccording to Mr. Macaroni, another skit maker, Martins was subsequently arrested."
  },
  {
    "headline": "Sylvester Oromoni: ‘We Have Won’ – Dowen College Releases Another Statement",
    "summarized_story": "Dowen College’s administration has asked the public to refrain from spreading false information about Sylvester Oromoni’s death.\nThe school administrators urged that the public allow late Sylvester’s soul to rest in peace in a statement made on Monday, January 10, in which they also stated that they had won.\nThe statement read;“At this point, we respectfully request that all those who have consistently, misguidedly and maliciously pushed false information should desist immediately and allow our dear Sylvester’s soul rest peacefully in our Lord’s arms.\n“Today the truth wins, our faith wins and our integrity wins.\nWe pray that no school or organisation ever has to experience what we have been going through.”"
  },
  {
    "headline": "BREAKING: Buhari’s Regime Deactivates Sowore’s National ID Card, Permanent Voter Card, International Passport",
    "summarized_story": "Omoyele Sowore, a human rights activist and former Presidential candidate in Nigeria, has had his biometric identification disabled by the Nigerian government.\nThe activist’s national identity card, permanent voter card, foreign passport, and driver license were all deactivated.\nThe administration of President Muhammadu Buhari has yet to provide a rationale for the move.\nHe is accused of insulting President Muhammadu Buhari and plotting to destabilize his administration.\nSowore was detained for more than four months despite two court rulings mandating his release on bail during that time."
  },
  {
    "headline": "JUST IN: EFCC Arraigns Mompha For Alleged Money Laundering",
    "summarized_story": "JUST IN: EFCC Arraigns Mompha For Alleged Money LaunderingIsmailia Mustapha a.k.a.\nMompha has been charged with fraud by the Economic and Financial Crimes Commission (EFCC).\nThe acclaimed Bureau De Change dealer was arrested on Monday for alleged money laundering.\nEFCC accuses him of obtaining money through unlawful activities and retention of alleged proceeds of crime.\nThe popular socialite is alleged to have received illicit funds on behalf of ‘Yahoo boys’ and got varying commissions."
  },
  {
    "headline": "2023 Election: Tinubu’s Presidential Ambition Won’t Stop Osinbajo – Aide",
    "summarized_story": "After the declaration of Bola Tinubu, the ex-governor of Lagos State, an adviser to Vice President Yemi Osinbajo has stated that his boss will not relinquish his interest in running for president in 2023.\nTinubu had on Monday announced that he had informed President Muhammadu Buhari of his interest to vie for the country’s presidency.\nFrom what we have seen, many Nigerians, including key figures in the political and corporate world, believe that he is the best to succeed President Buhari.\n“I know the impression many people have is that be­cause his benefactor, Tinubu has declared interest to run, the vice president will perish his ambition.\nThe vice president will contest but he will not jump the gun."
  },
  {
    "headline": "Breaking: Ex-Oyo state governor, Alao-Akala, slumps, dies",
    "summarized_story": "Former governor of Oyo state, Otunba Christopher Adebayo Alao-Akala is dead.\nSources told Blueprint that Otunba Alao-Akala reportedly slumped and died in Abuja Wednesday morning.\nThe news of the Ogbomoso-born politician is said to be shocking and unbelievable to many of his political associates and friends in and across Oyo state particularly in Ogbomoso, his country home.\nOtunba Alao-Akala was born on June, 3 1950.\nThe incumbent governor of Oyo state, Seyi Makinde, has confirmed the demise of"
  },
  {
    "headline": "Breaking: Government foils Military coup plot in Burkina Faso *Top officer, others arrested",
    "summarized_story": "There are indications that a Lt-Colonel Emmanuel Zoungrana of Burkina Faso Army has been arrested by the national gendarmerie, according to Jeune Afrique.\nThe 41-year-old Lieutenant- Colonel Zoungrana is suspected of having instigated an attempted coup.\nSeveral other soldiers were reportedly arrested,” according to the Jeune Afrique newspaper while citing several security sources.\nAccording to his biography, Emmanuel Zoungrana entered the Military Academy of Kadiogo (PMK) in 1993.\nEmmanuel Zoungrana also led the 25th commando parachute regiment, based in Bobo-Dioulasso."
  },
  {
    "headline": "2023 Presidency: Like Tinubu, Umahi meets Buhari, opens up on ambition",
    "summarized_story": "Ebonyi state Governor Dave Umahi has formally informed President Muhammadu Buhari of his 2023 presidential ambition on the platform of the All Progressives Congress (APC).\nTinubu had while speaking to journalists after a closed-door meeting with Buhari in Abuja, Monday, said it’s been his age-long ambition to lead the country one day.\n“I have informed the President of my ambition but I have not informed Nigerians yet, I am still consulting.\nUmahi followsFielding questions from State House correspondents after a meeting with Buhari in his office in Abuja, Tuesday, the governor said the president advised him to consult widely.\nTinubu had last November visited Kalu in his villa mansion where he intimated the federal lawmaker about his presidential ambition."
  },
  {
    "headline": "Former Oyo Governor Christopher Alao-Akala Dies At 71",
    "summarized_story": "A former governor of Oyo State, Christopher Alao-Akala, is dead.\nAlao-Akala was a former governor of Oyo State and a candidate of the Action Democratic Party (ADP) in the 2019 governorship election in the state.\nHe has also attended the Administrative Staff College, Topo, Badagry; the Nigeria Institute of International Affairs (NIIA), Victoria Island, Lagos; Police Staff College, Jos; Command and Staff College, Jaji.\nHe was elected the vice-chairman of ALGON, Oyo State Chapter between 1999 and 2002.\nHe served as the Deputy Governor of Oyo State from May 2003 to January 2006."
  },
  {
    "headline": "Three Children, Woman Confirmed Dead In Delta Building Collapse",
    "summarized_story": "﻿One more person has been confirmed dead in the church building collapse in Delta State, raising the death toll to four.\nThe Police Public Relations Officer in Delta, Bright Edafe, had also confirmed that 18 other people trapped in the rubble were rescued.\nAlthough it is unclear if those rescued are all children, Edafe said the search and rescue operations were over.\nWhen the building collapsed on Tuesday, several persons were feared to be trapped in the rubble.\nSearch and rescue operations began thereafter, leading to the recovery of the survivors from the rubble, but not without four lives lost."
  },
  {
    "headline": "‘We Live In Fear,’ Zamfara Residents Raise Alarm Over Attacks By Bandits",
    "summarized_story": "In an interview with Channels Television on Tuesday, a Gusau resident, Hafizu Salisu, decried the incessant attacks on communities in the area.\nMy grandfather’s residence in Zurmi serves as an Internally Displaced Persons (IDPs) camp.\n“Those who have been sacked from their communities by bandits usually run to the residence to stay.\nBandits in the north-western state have displaced hundreds of thousands of residents and rendered thousands of others as orphans.\nAlthough Zamfara has eight official Internally Displaced Persons (IDPs) camps, some displaced persons temporarily take shelter in primary schools while others are staying with their relatives resident in safer communities and Gusau."
  },
  {
    "headline": "Nigeria’s Economy To Grow By 2.5% In 2022 – World Bank",
    "summarized_story": "Nigeria’s economy is expected to by 2.5 per cent in 2022 and by another 0.3 per cent next year, the World Bank has projected.\nThe World Bank gave the forecast in its latest Global Economic Prospects report, a copy of which was obtained by Channels Television on Wednesday.\nThe World Bank stated that in some countries, the services and manufacturing sectors again reeled from the adverse impact of the pandemic, while high unemployment and elevated inflation dented consumer confidence.\nWhile focusing on Nigeria’s north-east region and some Sub-Saharan African (SSA) countries such as Burkina Faso, Chad, Mali, Mauritania, and Niger, it said rising social unrest, insecurity, and civil conflicts have further restrained investment and consumer spending.\nMore than 70 per cent of SSA countries reported at least a 50 per cent increase in new COVID-19 cases during the last two weeks of 2021.”"
  },
  {
    "headline": "Fayemi Warns Ekiti Civil Servants Against Participating In Political Activities",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi, has warned civil servants against participating in political activities, saying that it runs contrary to the rules governing the service.\nSpeaking during a meeting with senior civil servants on Wednesday in Ado Ekiti, Fayemi condemned those who abandoned their duties to play politics, warning that such workers will face the consequences.\nREAD ALSO: Fundamental Rights Suit: Nnamdi Kanu To Know Fate On January 19Although the governor noted that there can’t be complete neutrality in the civil service, he warned that civil servants should desist from politics.\n“The politicisation of civil service is something that I believe the civil service public rules actually is very explicit about.\nSo it’s a question of enforcement on the part of the leadership of the civil service and public service generally,” he said."
  },
  {
    "headline": "Shonekan was a unifying force for Nigeria",
    "summarized_story": "Former President, Olusegun Obasanjo has described former Head of the Interim National Government (ING), Ernest Shonekan as a unifying force for the nation.\nHe said his contribution to the growth and development of democracy in Nigeria cannot be forgotten in a hurry.\nFormer President Obasanjo said “He would be remembered as a man of sustained strongwill to succeed.\nHe further discribed the former Head of Interim National Government as “a unifying force for the nation and his contribution to the growth and development of democracy in Nigeria cannot be forgotten in a hurry.\nIndeed, Chief Shonekan died at a time the country is in dire need of his leadership, wealth of experience and wisdom to tackle the multifaceted challenges facing the nation.”"
  },
  {
    "headline": "President Buhari pays tribute to life, legacy of ex-interim President, Shonekan -",
    "summarized_story": "President Muhammadu Buhari has received with profound sadness the news of the death of a great statesman and former Head of the Interim National Government, Chief Ernest Shonekan.\nIn a statement by his media aide, Femi Adesina, the President extends deepest condolences to Chief Shonekan’s wife, Margaret, loved ones, as well as the government and people of Ogun State.\nThe President notes that Chief Shonekan demonstrated to all that the love for country and commitment to her development, peace and unity transcend the trappings of office and the transient nature of political power.\nAccording to him, Nigeria owes a great debt to Chief Shonekan, the peacemaker, who even at the twilight of his life time never stopped believing and working for a prosperous and democratic country.\nThe President prays that the memory of the departed Head of Government will remain a blessing to Nigeria even as he finds perfect peace with Almighty God."
  },
  {
    "headline": "Photos: Super Eagles players having walk out ahead Egypt clash -",
    "summarized_story": "Nigeria’s senior national team, Super Eagles, on Tuesday morning had a walkout exercise ahead of the AFCON match against the Pharaoh’s of Egypt.\nBoth Egypt and Nigeria will this evening open the group D matches in the ongoing AFCON 2021 competition in Cameroon."
  },
  {
    "headline": "More than 200 people killed in recent attacks on Zamfara communities",
    "summarized_story": "The People’s Democratic Party in Zamfara said the casualty figure in the recent bandits attack on seven Communities in two Local Government Areas of the state is over two hundred and not fifty eight as the Government state claimed.\nThe PDP said, the casualty in Bukuyyum Local Government Area alone is over one hundred and fiftyZamfara state Chairman of the party Bala Condemn the killings described it as barbaricThe opposition party has also raised the alarm over an alleged sinister plot by the ruling All Progressives Congress to frame up, arrest and detain critical stakeholders of the partyThe party adds that the Move is unpolitical and an attempt to Intimidate and Silence Opposition Parties in zamfaraBala Mande insist that the PDP in Zamfara will not stop speaking the mind of the MassesThe Ruling All Progressive Congress and the Main opposition party PDP in Zamfara have been at logger head in recent timesThe clash has now taken a different dimension as both parties are accusing each other for being responsible for the worsening Insecurity in the state“Plenty of our members are the list of arrest by Security Operatives following directives of the state government authorities”“As we speak, Security agencies are on the trail of Prof. Kabiru Jabaka the Vice Chairman of the PDP Simply because he spoke the the truth and expose the weakness of the Zamfara State Government” Bala MandeThey Called on International Community to deny travel Visa to undemocratic political leaders in Nigeria."
  },
  {
    "headline": "Bode George: PDP is Ready for Whatever the APC Will Throw at It, Including Tinubu",
    "summarized_story": "Former National Vice-Chairman and former military Governor of Ondo State, Chief Bode George bares his mind on ARISE TV about the chances of former Lagos State Governor and APC National Leader, Bola Ahmed Tinubu in emerging as President in the 2023 General Elections"
  },
  {
    "headline": "In Yorubaland, A Kingmaker Cannot Be King, Bode George Tells Tinubu",
    "summarized_story": ""
  },
  {
    "headline": "Burkinabe Soldiers Held Over Plot to ‘Destabilise’ Institutions",
    "summarized_story": "Authorities in Burkina Faso say eight soldiers, including a high-ranking commander, have been detained in connection with an alleged plot to “destabilise” the country’s institutions.\nThe military prosecutor’s office said in a statement it had learned of the alleged plot on Saturday after “a member of the gang” denounced the plan.\nAn investigation has been launched and eight soldiers have been detained for questioning, it added.\nSecurity sources told the AFP news agency that Lieutenant Colonel Emmanuel Zoungrana, commander of western forces fighting armed groups in the country, was among those arrested.\nOne of the security sources said “suspicions of a plot to destabilise [the government] with ramifications abroad” had hung over Zoungrana and several soldiers since protests erupted in November calling for Kabore to go over the rising violence."
  },
  {
    "headline": "Russia and China Block UN Support for ECOWAS Sanctions on Mali",
    "summarized_story": "Russia and China have blocked the United Nations Security Council from supporting a decision by the West African economic bloc ECOWAS to impose new sanctions on Mali, after its military leaders proposed staying in power for up to five years before staging elections.\nFrance, Mali’s former colonial power which also holds the European Union’s rotating presidency, and the United States, have underlined their support for the ECOWAS sanctions.\nRussia rejected the proposed council statement as unbalanced and expressed sympathy to the government.\nHe said Russian trainers are in Mali to advise and train its military on the use of military equipment acquired by the government from Russia.\nIn an address to the nation on Monday, military leader Colonel Assimi Goita called the sanctions “inhumane” while also stating that Mali remains open to dialogue."
  },
  {
    "headline": "AFCON: Guinea-Bissau Miss Late Penalty in Group D Draw with Sudan",
    "summarized_story": "Guinea-Bissau missed a late penalty as they were held by Sudan in their Group D opener in the Africa Cup of Nations.\nMidfielder Pele saw his 82nd-minute spot-kick kept out by Sudan goalkeeper Ali Abou Achrine, with Piqueti striking the bar on the rebound.\nEarlier in Group D Kelechi Iheanacho was on target as Nigeria comfortably beat seven-time champions Egypt.\nMohamed Abdelrahman went closest for Sudan, forcing a good stop from Guinea-Bissau goalkeeper Maurice Gomis on the stroke of half-time.\nSudan will face Nigeria in Group D on Saturday (16:00 GMT), while Guinea-Bissau take on Egypt (19:00 GMT)."
  }
]