[
  {
    "headline": "Bandits/herdsmen farm occupation: Insecurity grounds CBN borrowers, farmers say loan repayment difficult",
    "summarized_story": "Yusuf stated, “I don’t know how to pay the CBN loan because I didn’t harvest anything.\nAccording to them, the fact that the insurance for the CBN ABP does not cover cattle menace has compounded their problems.\nApart from bank loans, farmers get funds from thrift societies, which is more terrible.\n‘If we don’t pay ABP loan, CBN will not give us another’“Farmers are having difficult times to pay back the ABP loan and invariably, if we are not able to pay the loans, the CBN will not be happy to give us more.\nThe loss cannot be quantified in that people who were rich rice farmers before are now taking refuge in IDP camps."
  },
  {
    "headline": "Rivers youths demand reopening of training centre",
    "summarized_story": "SIXTY youths nominated for a free training at the Port Harcourt Technical and Vocational Centre on Monday embarked on a protest over the continued closure of the facility by the Rivers State Government.\n1, Odoni Street, Port Harcourt, carried a banner with the inscription; ‘Skill acquisition is key’ and ‘Education commissioner, please, allow the free training of youths’.\nSpeaking to newsmen, Wagor Augustine, who claims to be a staff of the centre, accused the state Commissioner for Education, Prof. Kaniye Ebeku, of shutting the centre, thereby denying the youths the opportunity to acquire skills.\n“They are not staff of the Rivers State Government now and at any time previously, and the government owes them no obligation whatsoever.\n“Contrary to what he has falsely and maliciously alleged, no responsible donor or agency, including the World Bank, has approached the Honourable Commissioner for Education, or the Government of Rivers State regarding any offer to give free training to Rivers State Youths at the PHTVC.”Copyright PUNCH."
  },
  {
    "headline": "ICBAM to honour Ogunsan with fellowship award",
    "summarized_story": "The Institute of Corporate and Business Affairs Management (ICBAM), Nigeria, has nominated the Chairman of Executive Group and Board Member, Lagos State Security Trust Fund (LSSTF), Dr. Ayo Ogunsan, for an Honorary Fellowship Merit award, while also appointing him as Director, Strategic Partnership/Inter Governmental Affairs, of the Institute.\nIn a recent letter addressed to Ogunsan, signed by the registrar, Charles Bakare, the institute said it has only identified Ogunsan as a public figure, with an impeccable character, sterling performance and an exemplary leadership style.\nREAD ALSOMany escape death, as truck plunges into BRT terminal in Lagos“The nomination is based on strong recommendations from Hon.\n“A honorary merit award acknowledges that the recipients deserve to be recognized for their achievements and contributions to the society.\nThis is a golden opportunity to serve humanity through the Institute of Corporate and Business Affairs Management (ICBAM), Nigeria."
  },
  {
    "headline": "APC may face challenges after Buhari’s exit in 2023 – Lawan",
    "summarized_story": "…advices party leaders to divest power to youths to sustain legaciesPresident of the Senate, Ahmad Lawan, has said that the All Progressives Congress (APC) may face challenges after the exit of President Muhammadu Buhari from office in 2023, except timely interventions are taken to avert same.\nHe noted that by doing so, the party would be able to retain its appeal and nationalistic outlook beyond the 2023 general elections.\n“[And] when he leaves, he would still have some roles, but I daresay that it is after he leaves office that APC will face its challenge.\n“Yes, we have to know our value then, and the value of APC presently is APC minus President Muhammadu Buhari.\n“I really feel we can do better to have more youths and more women in our government and party positions.”Vanguard News Nigeria"
  },
  {
    "headline": "Nigerian Army dismisses torture Video of terrorist",
    "summarized_story": "Brig General Onyema Nwachukwu, Director Army Public Relations…says uniform of soldiers carrying out the act not in Troops’ inventoryThe Nigerian Army has denied that a video in circulation showing some soldiers purportedly mutilating a terrorist suspect contains troops of Operation Hadin Kai.\nThe Army said the uniform of the purported soldiers in the video is not among those used by Nigerian soldiers fighting in any theatre of operation in the country.\nA statement by Brig General Onyema Nwachukwu, Director Army Public Relations, titled ‘Re: Video of Soldiers Mutilating A Suspect’, said, “The Nigerian Army (NA) has been notified of an online video footage making the rounds in the social media, showing some persons in military fatigue torturing and mutilating an individual.\n“Very importantly, the uniform of NA troops deployed in the North East is the Nigerian Desert Camouflage, while that of other operations around the country is the Nigerian Woodland Camouflage.\n“The NA therefore, wishes to clearly inform the general public that the video being circulated does not have any connection with its operations."
  },
  {
    "headline": "774,000 jobs: FG goes after defaulting banks",
    "summarized_story": "Festus KeyamoBy Johnbosco AgbakwuruTHE Federal Government, Monday met with the seven banks handling payment of N20,000 stipends for 774,000 participants of the Extended Special Public Works (ESPW) programme.\nParticipants are therefore encouraged to collect their ATM cards from the banks so that they can access their payments from various cash points without necessarily going to the banks.\nHe said, “Consequently, selected participants are at liberty to approach any of the seven selected banks nearest to the Local Government where they were selected.\nThe Banks are Access, FCMB, Fidelity, Heritage, UBA, Yobe MFB and Zenith.\nThe banks were represented by Atinuke Sayo-Adeyemi (Access Bank), Alero Bola-Pelemo (FCMB), Fatima Garba (Fidelity Bank), ChiChi Alek (Heritage Bank), Arerepade Akagwu (UBA), Soibiye Iketubosin (Zenith Bank) and Sheriff Mohammad Ibrahim (Yobe Micro Finance Bank)."
  },
  {
    "headline": "FG pays N10 bn to 1m beneficiaries every 2 months -Coordinator",
    "summarized_story": "President Muhammadu BuhariMr Apera Iorwa, National Coordinator, National Social Safety-Nets Coordinating Office (NASSCO) says the Federal Government pays N10 billion to one million beneficiaries every two months from the National Cash Transfer.\nIorwa said this at the National Social Safety-Nets Programme (NASSP) Third-Party Project scorecard dissemination meeting on Monday, in Abuja.\n“We do this through the World Bank facility of 500 million dollars for five years.\n“The Abacha repatriated loot of 325 million dollars was given toNational Cash Transfer Office (NCTO).\nHe said that the cash transfer had also helped to send more children toschool, as their parents were able to buy books and school uniforms."
  },
  {
    "headline": "Social media won't transform lives, join politics",
    "summarized_story": "Vice President, Yemi Osinbajo has charged youths in Nigeria to join politics.\nOsinbajo made the call on Monday in Abuja at the maiden Progressive Youth Conference organized by the All Progressives Congress (APC) youth wing.\nThe VP, in his speech titled, “The Future is a Decision,” said more political participation by majority youths would help them to make meaningful changes.\nThe Vice President added that it is crucial for young Nigerians already involved in politics to influence others to also participate.\nThe VP advised young citizens youths not to be discouraged from joining politics because of negative sentiments associated with politics in the country."
  },
  {
    "headline": "Ikpeazu swears in 10 new Permanent Secretaries in Abia, charges them on equity",
    "summarized_story": "Governor Okezie Ikpeazu has sworn in 10 new Permanent Secretaries into the Abia State civil service, with a charge for them to align themselves with the programmes and policies of his administration.\nSpeaking during the swearing-in ceremony held Monday at Dr Michael Okpara Auditorium Umuahia, Governor Ikpeazu congratulated the newly elevated civil servants on the milestone they have attained.\nGovernor Ikpeazu further enjoined them to take up the new responsibility with maturity and candour, and expressed confidence in the capability of the appointees to acquit themselves creditably in the new assignment.\nThe state chief executive also charged them to carry other staff of their ministries along so as to realize the government’s policies and programmes for the state.\nThe new Permanent Secretaries are Isiakpu, Uzoma Livingstone,Enyioko, Benson Ugochukwu, Engr."
  },
  {
    "headline": "IPOB: HURIWA reacts as Northern Coalition calls for Igbo referendum",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has reacted to a recent statement by a Northern group asking the government to grant Igbos a referendum and let them separate from Nigeria.\nIn a press statement, a group known as the Coalition of Northern Groups (CNG) had said that only a referendum for Igbo exit can guarantee peaceful Nigeria.\n“Apart from the Coalition of Northern Groups, Hakin Baba Ahmed recently made the same call for an Igbo referendum on behalf of the Northern Elders Forum,” HURIWA noted.\n“That other call for Igbo referendum came about the same time that a serving Northern Senator to the same Igbo ethnic group said that they would get into war if that was what they wanted.\n“It is important to remind those profiling other ethnic groups and calling for Igbo referendum, that it is not only Biafra secessionist agitation that is going on in the country."
  },
  {
    "headline": "Suspected herdsmen sent packing from Babanla, Kwara",
    "summarized_story": "Some herdsmen have been sent packing from Babanla community in Ifelodun Local Government Area of Kwara State.\nA statement by the spokesman of the Nigeria Security and Civil Defence Corps Kwara state command, Babawale Zaid Afolabi, disclosed in Ilorin on Monday.\nHe said “The suspected herdsmen entered the community from an unknown destination with the intention of settling down in Babanla community on Sunday.\n“Immediately they were sighted, some members of the community alerted the NSCDC office, the corps personnel swung into action and they were moved to the office.\n” The herdsmen were sent back, officers supervised and escorted them out of the community,” the spokesman added."
  },
  {
    "headline": "Family reacts to rumoured death of CAC leader, Prophet SK Abiara",
    "summarized_story": "The family of Prophet Samuel Kayode Abiara says speculations about his death are completely false.\nAbiara is the General Evangelist, Worldwide of the Christ Apostolic Church (CAC).\nPastor Isaac Abiara of the CAC Agbala Itura Worldwide issued a rebuttal in reaction to circulating news.\n“Prophet (Dr) S. K. Abiara, Planter of Christ Apostolic Church Agbala Itura is healthy and alive”, the statement read.\nAkinola gave up the ghost hours after the death of Prophet T. B. Joshua, founder of the Synagogue Church of All Nations (SCOAN)."
  },
  {
    "headline": "Atlanta ’96 feat: Group to fete Ajunwa",
    "summarized_story": "A Lagos-based entertainment outfit, Great Dynamic Talents Limited, has revealed its plans to celebrate the 25th anniversary of Chioma Ajunwa’s golden jump.\nChief Executive Officer of the outfit Rev.\nSamuel Ikpea who is also the chairman of Nigeria Football Supporters Club revealed that the plans include a symposium, as well as a creative musical tagged Ajunwa: ‘The Trials and Triumph ‘.\nADVERTISEMENTHe went further to disclose that the celebrations of Chioma Ajunwa will begin on August 2nd a symbolic date for her Olympic games feat, as well as, 6th, and 7th, 2021, at the prestigious Shell Muson Centre in Lagos.\nAccording to Ikpea, who is also the National Chairman of Nigeria Football Supporters Club, further plans will also see Chioma Ajunwa and the organizers, visiting the 36 States Governors of Nigeria and presenting with a replica of the historic Olympic gold medal."
  },
  {
    "headline": "Tokyo 2020 Olympic Games: Nigeria chase relay tickets to Lagos Athletics Meet",
    "summarized_story": "After failing to meet the qualification time for the relay events of the Tokyo 2020 Olympic Games during the National Olympics trials at the weekend, Nigeria continues its chase for the tickets at the Lagos Athletics Championships scheduled for Thursday, June 24 at Teslim Balogun Stadium.\nHowever, athletics buffs have expressed concern that the slowness of the track may hamper the team’s chances of meeting the qualification time.\nADVERTISEMENTAccording to the Chairman of the Lagos State Athletics Association, Dayo Alao, the tournament is aimed to help Nigeria athletes and others to pick their tickets to the rescheduled Tokyo 2020 Olympic Games.\n“Apart from the opportunity to earn some prize monies, this event will also serve as a Tokyo Olympic qualifying event.\nAccording to Alao, the top three finishers in each event would mouth-watering prize while 24 states are already in Lagos for the meet."
  },
  {
    "headline": "Euro 2020: Pogba could become highest-paid player in EPL",
    "summarized_story": "Manchester United are reportedly considering making Paul Pogba the highest-paid player in the Premier League as they look to tie the Frenchman down.\nPogba has entered the final year of his current deal at Old Trafford, worth £300,000-a-week, and his club are keen to prevent him from going into the new season with his future still uncertain.\nThis would see the structure of the deal agreed once Pogba returns from the Euros later this summer, with the 28-year-old commenting last week his focus was on his country.\n“I have one year left on my contract, everyone knows that,” Pogba said in a press conference.\nIn December, Raiola was definite in his assessment of his client’s future at United with reported interest from Juventus and Real Madrid."
  },
  {
    "headline": "CAS cuts Siasia’s life ban to five years",
    "summarized_story": "By Olalekan OkusanThe life ban imposed on former Super Eagles coach Samson Siasia has been reduced to five years by the Court of Arbitration for Sport (CAS), while a fine of 50,000 Swiss francs ($54,000) was overturned “as inappropriate and excessive”.\nADVERTISEMENTBut CAS in its decision yesterday said a life ban for Siasia was “disproportionate” for a passive offense that did not fetch him any money.\nIn a statement released by CAS, the decision to reduce the life ban to five years followed the appeal filed by Siasia over the decision of FIFA on April 11 to ban the coach for life over his involvement in bribery for fixing a match in 2010.\n“The Panel acknowledged the need for sanctions to be sufficiently high enough to eradicate bribery and especially match-fixing in football.\nWith this development, Siasia’s ban expires in August 2024."
  },
  {
    "headline": "Tokyo Olympics to allow 10,000 spectators per venue",
    "summarized_story": "Up to 10,000 domestic spectators will be allowed in Tokyo 2020 venues, Olympics organizers said yesterday, a decision that cuts against the recommendation of medical experts who said holding the event without fans was the least risky option.\nThe national stadium, built for the 1964 Tokyo Olympics and due to host athletics and soccer this time, would have held 68,000 fans but now will be at a sliver of that.\nOrganizers are still considering whether to allow alcohol to be served in venues, Tokyo 2020 President Seiko Hashimoto said.\nEven as experts voiced concern, Hashimoto had previously said she was eyeing allowing up to 10,000 fans.\nSome of the country’s top health experts on Friday said banning spectators would be the least risky option."
  },
  {
    "headline": "Nobody can push Igbo out of Nigeria -Abaribe",
    "summarized_story": "From Magnus Eze and Jude Chinedu, EnuguSENATE Minority Leader, Enyinnaya Abaribe, yesterday, said nobody can push the Igbo out of Nigeria.\nChairing the inauguration of Igbonine, a new sociocultural organization in Enugu, Abaribe said that the Igbo have paid the highest price of keeping Nigeria together, adding that they serve as glue binding the nation.\n“We have become the glue that holds Nigeria together because we are the largest domestic investors in Nigeria.\nWe are the most travelled people in Nigeria, we don’t want to leave Nigeria but some people are trying to push us out of the country and the reason they are doing that is what we don’t know.\nHe declared that as equal partners in the Nigeria project, the Igbo were qualified to get any position in the land including the Presidency."
  },
  {
    "headline": "Niger school abduction: Negotiations collapse as Gov Bello orders full scale rescue operation",
    "summarized_story": "About 1,000 security agents, drawn from the Army, the Police, Civil Defence, the local hunters and local vigilantes have been mobilized for the rescue operation.\nThis is coming almost three weeks after the abduction of the school children, and after series of negotiations between the parents and the bandits.\nAfter agreeing with parents they started shifting goal post and now we are here to take action”.\nThe Governor disclosed that “most of these Bandits are from outside the country, they are hired to cause problems for us.\nThe Governor had earlier met with Parents of the 136 kidnapped students of the Islammiya School and other stakeholders at the palace of the Emir of Kagara, Alh."
  },
  {
    "headline": "Buhari meets Ngige, Gambari over insecurity in South East",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari at the weekend met with Minister of Labour and Employment, Chris Ngige, and his Chief of Staff, Ibrahim Gambari at Aso Rock over the escalating insecurity in the South East.\nBriefing State House Correspondents at the end of the meeting, Ngige said they both briefed the president and made proposals to him on how to end the crisis.\nAnd we are following up with dialogue, which at the end of the day is what will happen.\n“I have to see him to appraise him with labour industrial milieu, especially when you know that the judiciary and parliamentary workers JUSUN and PASAN respectively had been been on strike that lasted for two months.\nWe achieved a truce, through up an agreement and we have to today summit his own copies of the agreement to him."
  },
  {
    "headline": "Father’s Day: Kalu tasks fathers on nation building",
    "summarized_story": "Kalu tasked the nation’s fathers to rise to the occasion of defending the Church and the nation at large.\nThe ambience of the church was lightened up as Kalu donated over N2 million to the Catholic Men Organisation (CMO), Catholic Women Organisation and officiating Catholic priests.\nFather Charles congratulated fathers and acknowledged that the roles of fathers in nation building cannot be over-emphasised.\nThe Catholic cleric also urged fathers to register with CMO and lamented the refusal of some fathers in the church to join the organisation.\nHe outlined the numerous benefits of aligning with the forum, while urging unregistered fathers to join the association."
  },
  {
    "headline": "NDLEA nabs law enforcement officer, 6 others for dealing in cocaine",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has arrested a serving officer of a law enforcement agency, Popoola Abayomi for selling assorted illicit drugs to students of a Federal university and cultists in Ogun state.\nBefore he was finally arrested, Abayomi, had been on the watch list of the agency in connection with drug related offences.\nAfter the arrest of the two suspects, some student union officials of the institution blocked the NDLEA team with their official vehicle.\nThe following day, two ladies; Mary Peter, 40, and Mercy Oladele, 39, were arrested at Total Garden, Ibadan when NDLEA operatives acting on a tip-off, intercepted their commercial micra car.\nThe suspect had arrived the ‘D’ arrival hall of the airport on 14th June on Turkish airline flight from Pakistan with the illicit drug inserted in his anus."
  },
  {
    "headline": "Buhari: My Policies, Projects, Appointments Guided By Equity, Inclusiveness",
    "summarized_story": "•Says criminal elements terrorising Nigeria will be prosecutedBy Adedayo AkinwalePresident Muhammadu Buhari on Monday said that all the policy initiatives, projects and even appointments by his administration were guided by equity and inclusiveness.\nBuhari stated this in Abuja while declaring open the maiden edition of the Progressives Youth Conference with the theme, “The Future Is A Decision”, organized by the All Progressives Congress (APC) youth wing.\nHe stated: “So far, all the policies initiatives, projects and even appointments by this administration have been guided by equity and inclusiveness.\nBuni stressed that the ruling party had no doubt repositioned itself as Nigeria’s leading party and Africa’s largest political party.\nHe added that power was not given but taken, adding that the life and future of the country is in their hands."
  },
  {
    "headline": "Amid Global Pressure, UAE to Fine Violators of New Corporate Transparency Rules",
    "summarized_story": "The report gave graphic details of illicit financial flows (IFFs) from Nigeria to the UK and the UAE, specifically Dubai.\nHowever, as the UAE prepares to implement the new rules on beneficial owners, there are questions about numerous exemptions and loopholes in the rules.\nThere’s a lack of interest behind this beneficial ownership law,” Kumar said.\nGovernment-owned corporations and publicly traded entities are also excluded from the ownership reporting requirement.\nAdministrative penalties and fines of up to 100,000 UAE dirhams for companies that don’t comply with reporting beneficial ownership information will begin July 1."
  },
  {
    "headline": "Breaking: CAS Reduces Siasia’s Life Ban to Five Years",
    "summarized_story": "CAS ruling Monday is the fallout of the appeal filed by Siasia challenging the decision rendered by the Adjudicatory Chamber of FIFA on 11 April 2019.\nIn 2010, a match fixer tried to involve Mr Siasia as a coach of a club under his strict instructions.\nWith the promise of employment benefits, Mr Siasia would have had to always field several players under the control of the match fixer.\nThe negotiations between the match fixer and Mr Siasia in relation to the conditions of employment were conducted by email over a period of two months.\n” *The imposed fine of CHF 50,000 (fifty thousand Swiss Francs) on Mr Siasia is set aside."
  },
  {
    "headline": "Customs to Impound Unverified Private Jets",
    "summarized_story": "James EmejoThe Nigeria Customs Service (NCS) Monday said it will impound private jets whose documents are not verified before July 6, 2021.\nCustoms Public Relations Officer, Mr. Joseph Attah, disclosed this during a media briefing to update the public on the ongoing audit of privately-owned aircraft operating in the country.\nThe service had in May announced plans to carry out a holistic audit of the private jets imported into the country to ensure that all appropriate revenues of the government were not evaded as well as ensure that operating rules were not breached.\nWe also know that some brought their private jets under a temporary import certificate, which has expired and not renewed.\n“For the avoidance of doubt, private aircrafts owners or their representatives are to report to room 305, Tariff and Trade Departments, Nigeria Customs Service headquarters, Abuja, from 10am to 5pm."
  },
  {
    "headline": "Oil Spillage: Court Orders Mobil, NNPC to Pay Akwa Ibom Communities N82bn",
    "summarized_story": "The communities, led by Obong Effiong Archianga and nine others, had in April 2012 dragged the NNPC, Mobil Producing Nigeria Unlimited and ExxonMobil Corporation to court over oil spillages in their communities between 2000 and 2010.\nDelivering judgment in the matter, Justice Taiwo held that the American oil company and NNPC were negligent in the way and manner they handled oil spills that caused environmental degradation in the communities.\nSpecifically, the court held that the oral and documentary evidence produced by Mobil were not in any way helpful to the court as they were targeted at serving predetermined interest.\nThe judge held that section 11, subsection 5 of the Oil Pipeline Act, makes it mandatory for oil companies to monitor and repair their pipelines to avoid spillages and environmental degradation.\nHowever, the third defendant, ExxonMobil Corporation, was removed from the court action when the court established that there was no cause of action against it."
  },
  {
    "headline": "Nigerian Navy Personnel Sack Ogun Community To Take Over Land, Expel Traditional Ruler",
    "summarized_story": "SaharaReporters gathered that the military men have also sent packing the local chief, Baale, Chief Waheed Muraino, as the people continued to desert their homes due to the invading military men.\n“The navy personnel are being used by warring families and parties laying claim to lands in the community.\nThe Ogun State Police Command has also invited Sufi Taiwo several times, but he never honoured the invitation once.\n“We hereby call on the Ogun State Government, human rights lawyers, and other well-meaning Nigerians to come to our aid.\nDOCUMENTS: Nigerian Navy Personnel Sack Ogun Community to Take Over Land, Expel Traditional Ruler by Sahara Reporters on Scribd"
  },
  {
    "headline": "Nigerian Navy Personnel Sack Ogun Community To Take Over Land, Expel Traditional Ruler",
    "summarized_story": "SaharaReporters gathered that the military men have also sent packing the local chief, Baale, Chief Waheed Muraino, as the people continued to desert their homes due to the invading military men.\n“The navy personnel are being used by warring families and parties laying claim to lands in the community.\nThe Ogun State Police Command has also invited Sufi Taiwo several times, but he never honoured the invitation once.\n“We hereby call on the Ogun State Government, human rights lawyers, and other well-meaning Nigerians to come to our aid.\nDOCUMENTS: Nigerian Navy Personnel Sack Ogun Community to Take Over Land, Expel Traditional Ruler by Sahara Reporters on Scribd"
  },
  {
    "headline": "BUSTED: Foreign Affairs Ministry Mismanages N28billion Released By Buhari For Distressed Missions",
    "summarized_story": "The Ministry of Foreign Affairs allegedly mismanaged $68 million (about N28 billion) released by the President Muhammadu Buhari administration in 2018 for disbursement to some of the country’s foreign missions, SaharaReporters learnt.\nSaharaReporters learnt from a government’s audit report that the Ministry’s Permanent Secretary has now been asked to explain how the funds, allegedly misused, were disbursed to the missions.\nThe Auditor-General’s report stated that when queries were sent to the ministry to explain the issues around how $68 million was disbursed, no responses were received.\nThe report reads, “Issue 1 – Lack of accountability in the Disbursement of intervention fund for distressed missions - $68,875,902.\nThe Ministry however approved the release of the excess to the Consulate-General of Nigeria in Dubai, which was originally not among the missions in need of intervention funds."
  },
  {
    "headline": "BUSTED: Foreign Affairs Ministry Mismanages N28billion Released By Buhari For Distressed Missions",
    "summarized_story": "The Ministry of Foreign Affairs allegedly mismanaged $68 million (about N28 billion) released by the President Muhammadu Buhari administration in 2018 for disbursement to some of the country’s foreign missions, SaharaReporters learnt.\nSaharaReporters learnt from a government’s audit report that the Ministry’s Permanent Secretary has now been asked to explain how the funds, allegedly misused, were disbursed to the missions.\nThe Auditor-General’s report stated that when queries were sent to the ministry to explain the issues around how $68 million was disbursed, no responses were received.\nThe report reads, “Issue 1 – Lack of accountability in the Disbursement of intervention fund for distressed missions - $68,875,902.\nThe Ministry however approved the release of the excess to the Consulate-General of Nigeria in Dubai, which was originally not among the missions in need of intervention funds."
  },
  {
    "headline": "Gunmen Kill Physically Challenged Man, Wife, Daughter In Ibadan",
    "summarized_story": "Gunmen on a motorcycle reportedly invaded Iyana Court, Ile Titun area in the Ibadan South-East Local Government Area of Ibadan and killed a family of three.\nOur correspondent gathered that a physically challenged man identified as Sodiq, but also known as Chicken, was the target of the attack by the hoodlums.\nSodiq, who was said to have kyphosis (also known as round back or hunchback), was shot dead, alongside his wife and daughter.\nIt was gathered that the gunmen made sure that Sodiq was dead before they escaped through Olomi area.\nThe Police Public Relations Officer in Oyo State, Adewale Osifeso, when contacted said he would find out and get back to our correspondent."
  },
  {
    "headline": "Osinbajo to youths: Your ideas will retire those ahead of you -- not age",
    "summarized_story": "Vice-President Yemi Osinbajo says youths will have a better chance of making a significant impact in politics through productive ideas, rather than relying on their age.\nThe vice-president said big ideas, great solutions and creative plans must come from the youths.\n“It is the strength of your ideas and the depth of organisation that will retire those ahead of you, not your age,” he said.\nThe big ideas, the great solutions, the creative plans must come from you.\nAnd this is your moment.”Osinbajo said although ideas and numbers are important, politics is about service to the people."
  },
  {
    "headline": "Osinbajo to youths: Your ideas will retire those ahead of you -- not age",
    "summarized_story": "Vice-President Yemi Osinbajo says youths will have a better chance of making a significant impact in politics through productive ideas, rather than relying on their age.\nThe vice-president said big ideas, great solutions and creative plans must come from the youths.\n“It is the strength of your ideas and the depth of organisation that will retire those ahead of you, not your age,” he said.\nThe big ideas, the great solutions, the creative plans must come from you.\nAnd this is your moment.”Osinbajo said although ideas and numbers are important, politics is about service to the people."
  },
  {
    "headline": "Top US bank to investigate Nigerian ‘staff’ accused of body-shaming lady",
    "summarized_story": "Wells Fargo, a prominent American multinational financial services company, has promised to investigate allegations of racial discrimination against Oluwaseun Adeoye, who is believed to be its staff.\nAdvertisementThe company’s response followed a post by Joyce Agbanobi, a US-based Nigerian lady, wherein she called out Adeoye for allegedly body-shaming her during this year’s Father’s Day celebration.\nIn the post, the Nigerian man appeared to have asked Agbanobi why “her skin is so black” and advised her to bleach her skin.\n@oluwaseun Adeoye a Wells Fargo employee has to be called to order, we need to protect other women from people like him!!\n!”In its reaction, Wells Fargo commended Agbanobi for bringing the matter to its attention while asking her to forward details of the conversation to the company’s email for proper review."
  },
  {
    "headline": "Top US bank to investigate Nigerian ‘staff’ accused of body-shaming lady",
    "summarized_story": "Wells Fargo, a prominent American multinational financial services company, has promised to investigate allegations of racial discrimination against Oluwaseun Adeoye, who is believed to be its staff.\nAdvertisementThe company’s response followed a post by Joyce Agbanobi, a US-based Nigerian lady, wherein she called out Adeoye for allegedly body-shaming her during this year’s Father’s Day celebration.\nIn the post, the Nigerian man appeared to have asked Agbanobi why “her skin is so black” and advised her to bleach her skin.\n@oluwaseun Adeoye a Wells Fargo employee has to be called to order, we need to protect other women from people like him!!\n!”In its reaction, Wells Fargo commended Agbanobi for bringing the matter to its attention while asking her to forward details of the conversation to the company’s email for proper review."
  },
  {
    "headline": "Buhari finally constitutes EFCC board -- first since 2015",
    "summarized_story": "President Muhammadu Buhari has constituted the board of the Economic and Financial Crimes Commission (EFCC).\nAdvertisementThe anti-graft agency has been without a board since 2015 when Buhari came into power.\nAdvertisement“President Buhari has appointed George Abang Ekpungu as the Secretary of the Economic and Financial Crimes Commission (EFCC), for a tenure of five years,” Gwandu said.\n“Also appointed as board members of the Economic and Financial Crimes Commission are Luqman Muhammad (South South), Anumba Adaeze (South East), Alhaji Kola Raheem Adesina (North Central) and Alhaji Yahya Muhammad (North East).\nAdvertisement“These appointments are in line with Section 2 (1) and Section 4 of the Economic and Financial Crimes Commission Act, 2004."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "How to avoid investment scams in Nigeria",
    "summarized_story": "Over the past few weeks, two different scams have been uncovered in Nigeria.\nIt’s safe to say that many more investment scams will continue to spring up.\nOfficial website: https://t.co/HMfsRY9aCspic.twitter.com/i0gqGXYzjJ — Instablog9ja (@instablog9ja) May 28, 2021In it, the actor claimed that the company, Millionaires Club Investment, would give you 50% ROI (Return on Investment) in 3 days.\nLegitimate investment platforms are usually keen to inform you of the risks involved when you’re putting your money with them.\n“And you are licensed by…?”This is probably one of the most essential checks you must perform before you hand over funds to an investment company."
  },
  {
    "headline": "The Next Wave: $1.3 billion is not healthy enough",
    "summarized_story": "Between 2015 and 2020, 97 private equity and venture capital fund investments worth $1.3bn were made in health care in Africa.\nBetween 2015 and 2020, AVCA estimates that healthtech accounted for 35% of health care investments in Africa.\nIn 2020 alone, healthtech was the bright star too – gulping 45% of health care investments.\nBoluwatife Sanwo/TC InsightsAs with mPharma, new innovative health startups are relying on VC funding to rise to popular consciousness.\nCOVID-19, while an unfortunate pandemic, has spurred a welcome boost in visibility for healthcare startups."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "3 Steps To Register Your Small Business With CAC Online • Techpoint Africa",
    "summarized_story": "This post is a delayed version of SME Clinic newsletter, a weekly newsletter that provides tips and recommendations to help you position your small business for success.\nDid you know that the Corporate Affairs Commission (CAC) has made it possible for you to register your company and business name online?\nSo let’s get into how to register your business name or company online.\nSo there you have it, online business name and company registration in just three steps.\nAdvertisementIf you want to learn how to reach more customers, grow, and manage your business online, SME Clinic is for you."
  },
  {
    "headline": "Google plans to support African founders and entrepreneurs with new $6m funding options",
    "summarized_story": "Google has announced opening up three new programmes targeted at supporting African entrepreneurs — the 6th cohort of Google for Startups Accelerator (GFSA) Africa, $3 million Black Founders Fund (BFF) Africa, and Google.org-backed $3 million grants for female entrepreneurs.\nNotably, the first virtual class of Google for Startups Accelerator Africa was launched last year due to the COVID-19 pandemic.\nAdvertisementBlack Founders Fund (BFF) AfricaSimultaneously, applications will be opened for the $3 million Black Founders Fund for African startups in their early stage.\nThe programme will have 50 African startups, led by Black founders, receive cheques between $50k and $100k.\nThis will also include seed capital in the form of cash grants and Google product support for 500 aspiring female entrepreneurs."
  },
  {
    "headline": "Shoprite’s exit and lessons about Nigerian consumers",
    "summarized_story": "Nigerian consumers come in different shades and shapes, promising retailers acres of diamond to mine from, Shoprite counted on this.\nNine years ago, Shoprite, Africa’s retail giant saw scope in Nigeria for nearly a thousand outlets because of the massive population and how this would translate into consumption.\nWell, the target was 700 shops, Reuters…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Lagos overtakes Nairobi as home to most start-ups",
    "summarized_story": "Lagos, Nigeria’s busiest city with a massive consumer market has overtaken Nairobi, Kenya’s capital as home and a top destination for the greatest number of start-ups in Africa.\nOver 500 active start-ups operate out of Lagos.\nThe large population of Lagos, Nigeria’s commercial hub is one of the reasons for the rise in start-ups in the city.\n“It is not surprising that Lagos is the top start-up hub in Africa,” Andrew S Nevin, Partner/Chief Economist, PwC, Nigeria said.\nIt is the highest-ranking country in Western Africa and the 3rd highest-ranking country in Africa,” research analysts at StartupBlink, said."
  },
  {
    "headline": "Demand for raw materials pushes Nigeria’s fertiliser imports up 547%",
    "summarized_story": "The rising demand for diammonium phosphate (DAP), muriate of potash (MOP), and granular ammonium sulphate by blenders caused a 547 percent surge in Nigeria’s global fertiliser imports in 2020.\nData from the International Trade Centre (ITC) show that the country’s imported $250.2 million (N118bn) worth of raw materials for various fertiliser blends in 2020 from…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Court adjourns hearing on illegal acquisition of lands By Chinese companies until September 2021 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITTY- The hearing and resolution on the case of the 15 hectares of land own by a London-based business man, and illegally encroached and acquired by a Chinese company in Utesi Community in lkpoba Okha Local Government Area of Edo State has been fixed for September 21, 2021.\nIn her ruling, during the court proceedings, the presiding judge in Benin City high court, haven listened to the pleas of the counsel to the Chinese companies to give them time to explore avenues to settle with the claimant, Mr lbosa Osodin, adjourn hearing on the case, with suit number B/2452020, to 21st of September 2021.\nThe barrister, while frowning at the illegality perpetuated by the Chinese companies said, “We are not happy that our client, Mr Ibosa who is an investor will be treated in this manner” by foreigners whose companies have deliberately disregarded their corporate social responsibilities to the Utesi community by constant pollution and environmental degradation to the inhabitants of the community.\nBarrister Osula said further that, the case in point is a novel one, and certain that justice will not only be done, but will be seen to be done.\nHe said further that the Chinese companies cannot get away with their illegality, because “We are a firm believer of the legal philosophy that the court is the last hope of the common man”."
  },
  {
    "headline": "Edo begins use of revenue scratch cards in move to expand tax net – Nigerian Observer",
    "summarized_story": "Edo begins use of revenue scratch cards in move to expand tax netShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Internal Revenue Service, (EIRS) has introduced the use of Revenue Scratch Cards to simplify tax payment for businesses owners, particularly those in the informal sector.\nIn a statement, Head, Corporate Communications, EIRS, Courage Eboigbe, said: “The Revenue Scratch Card is part of the Edo Revenue Administration System (ERAS) mobile payment solution, which caters for individual businesses and ensures financial inclusion of the informal sector by recognizing each taxpayer who cannot obtain a tax clearance documentation.\n“With the use of the revenue scratch cards, taxpayers get instant notifications and receipts on transactions made.\nIt further enables taxpayers make payments from the comfort of their business premises, which eliminates waste of time and unnecessary bank queues.”He added that “Individual taxpayers are expected to purchase the face value of the Revenue Scratch Cards from EIRS licensed and approved dealers and their vendors.”The statement further enjoined taxpayers to always ensure purchased cards are processed and receipted by approved and designated Revenue Collectors (RCs) with a unique Point of Sale (PoS) device."
  },
  {
    "headline": "Omega Ministry church pastor beat wife to death in Akwa Ibom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA 49-year old Pastor, Ukachukwu Christopher, the General Overseer of Omega World Global Ministry (Fellowship Church) beat wife, Patience, 40, to death and secretly buried her corpse in a shallow grave in his compound.\nThe incident was learnt to have happened at Ikot Abia village in Eket Local Government area, Akwa Ibom State, where his Church is located.\nThe Police Public Relation Officer, Akwa Ibom command, SP Odiko Macdon who confirmed the incident disclosed that Police operatives from the State have arrested Christopher, detained him and he is undergoing interrogation over the alleged murder.\nIn other to cover his tracks, he dug a shallow grave in his compound and buried her.\nThe Commissioner of Police Akwa Ibom State, Andrew Amiengheme, has ordered the Deputy Commissioner of Police in-charge of the State Investigation and Intelligence Department to take over the matter for discreet investigation and assured that the suspect will be charge."
  },
  {
    "headline": "Obaseki reforms: Air Peace expands operations to Benin-Port Harcourt route – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWith the upgrade of facilities at the Benin Airport, supported by the Governor Godwin Obaseki-led administration, Nigeria’s biggest domestic carrier, Air Peace, has commenced operations on the Benin-Port Harcourt route.\nThe development is sequel to the expansion of airline operations at the airport, with Azman Air and Max Air commencing operations, in addition to the presence of Air Peace, Aero Contractors and Arik Air.\nAn official at the Benin Airport, who requested anonymity because he was not authorized to speak to the press, said the new route is strategic as it would provide a lifeline to people who would have been stuck on the deplorable East-West Road to Benin.\n“The new route is strategic and a welcome development.\nThe Governor Obaseki-led administration was instrumental to the upgrade of the airport, with support to install instrument landing and night landing equipment at the facility."
  },
  {
    "headline": "Again, Buhari vows to tackle insecurity",
    "summarized_story": "President Muhammadu Buhari on Monday in Abuja, reassured that no effort would be spared in tackling insecurity in the country and bringing its perpetrators to justice.\nMr Buhari, however, implored Nigerians not to be discouraged or relent in the joint task of nation building.\nMr Buhari also gave assurance that the APC would remain bound by the tenets of its manifesto and constitution.\n“I’m quite confident that our deliberations today will have a notable impact on the party’s activities and even trickle down to my administration,’’ Mr Buhari said.\nADVERTISEMENT“So far, all the policies, initiatives, projects and even appointments by this administration have been guided by equity and inclusiveness."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Social Media Has Enhanced Half Million Coffee Operations – Alshehri",
    "summarized_story": "Founder of Half Million Coffee, Meshal Khalid H. Alshehri, said that social media has enhanced operations of the company.\nSpeaking on how social media has shaped the upward trajectory of Half Million Coffee, Alshehri said, “we have been using social media in the branding and marketing of your business.\n“I regularly use social media to make advertisements and do promotions.\nAdvertisementsDespite his passion and zeal to make a success out of Half Million Coffee, Alshehri said that he had doubts on the viability of the coffee shop that is now doing extremely well financially.\nSpeaking on the fears he had and the initial challenges he encountered when starting Half Million Coffee, Alshehri said, “Internet marketing was one area that I was having difficulties and deeply challenged because of the many issues that surround itADVERTISEMENT“But I did not allow it to faze me down or affect my business adversely."
  },
  {
    "headline": "Social Media Has Enhanced Half Million Coffee Operations – Alshehri",
    "summarized_story": "Founder of Half Million Coffee, Meshal Khalid H. Alshehri, said that social media has enhanced operations of the company.\nSpeaking on how social media has shaped the upward trajectory of Half Million Coffee, Alshehri said, “we have been using social media in the branding and marketing of your business.\n“I regularly use social media to make advertisements and do promotions.\nAdvertisementsDespite his passion and zeal to make a success out of Half Million Coffee, Alshehri said that he had doubts on the viability of the coffee shop that is now doing extremely well financially.\nSpeaking on the fears he had and the initial challenges he encountered when starting Half Million Coffee, Alshehri said, “Internet marketing was one area that I was having difficulties and deeply challenged because of the many issues that surround itADVERTISEMENT“But I did not allow it to faze me down or affect my business adversely."
  },
  {
    "headline": "PHOTO NEWS: Vice President Yemi Osinbajo returning to his seat after his address at the Progressive Youth Conference in Abuja on Monday",
    "summarized_story": "PHOTO NEWS: Vice President Yemi Osinbajo returning to his seat after his address at the Progressive Youth Conference in Abuja on Monday.\nPhoto shows Senate President Ahmed Lawan, Ministers Fashola, Aregbesola, Ahmed and SGF Boss Mustapha applauding the VP.\nADVERTISEMENT"
  },
  {
    "headline": "PHOTO NEWS: Vice President Yemi Osinbajo returning to his seat after his address at the Progressive Youth Conference in Abuja on Monday",
    "summarized_story": "PHOTO NEWS: Vice President Yemi Osinbajo returning to his seat after his address at the Progressive Youth Conference in Abuja on Monday.\nPhoto shows Senate President Ahmed Lawan, Ministers Fashola, Aregbesola, Ahmed and SGF Boss Mustapha applauding the VP.\nADVERTISEMENT"
  },
  {
    "headline": "EFCC Arrests 2 Over Alleged N768.5m Fraud",
    "summarized_story": "AdvertisementsThe suspects, alongside Obialor Christian Worenwu (now at large), allegedly approached an investment company, Luxury Gold, for an investment loan facility.\nSubsequently, the sum of N110,000, 000.00 was paid into the GTBank account of Barieeba, while the sum of N255,000, 000.00 was paid into the First City Monument Bank account of Obieze.\nThe third suspect, Worenwu, who is at large, also received the sum of N403,585, 000.00 in his GTBank account.\nThe petitioner also alleged that the loans were to be repaid sometime in March, 2021.\nADVERTISEMENTAlso recovered from the suspects are landed properties purchased with alleged proceeds of crime."
  },
  {
    "headline": "NIMET: Training of aeronautical observers, forecasters begins in Katsina",
    "summarized_story": "The Nigerian Meteorological Agency (NiMet) has begun training 70 aeronautical and meteorological forecasters and observers in order to ensure aircraft safety.\nAs you may be aware, aviation is all about safety, safety, and more safety.\nOne of the most important aspects of this safety of lives and property is meteorological services.\n“Aside from training, they are subjected to competency evaluations on a regular basis, all in an effort to guarantee that aviation safety is not jeopardized in any way.\nWe’re here for the 9th Edition of the Aeronautical Meteorological Forecasters and Observers Refresher Course.”He then expressed gratitude to the Katsina State Government for collaborating with the agency to ensure the exercise’s success in the state."
  },
  {
    "headline": "BUSTED: Buhari’s N28 billion for distressed missions was mismanaged by the Foreign Affairs Ministry",
    "summarized_story": "According to SaharaReporters, the Ministry of Foreign Affairs wasted $68 million (about N28 billion) released by President Muhammadu Buhari’s administration in 2018 for payout to some of the country’s foreign missions.\nAccording to the Auditor-report, General’s when questions about how $68 million was disbursed were forwarded to the ministry, no responses were received.\n“Issue 1 – Lack of Accountability in the Disbursement of Intervention Fund for Distressed Missions – $68,875,902,” according to the study.\n“The issue was communicated to the Permanent Secretary via Management Letter Ref No.\n“The Permanent Secretary must answer in detail for how the sum of USD68,875,902.00 was distributed to the beneficiary missions, failing which consequences would be imposed.”"
  },
  {
    "headline": "BREAKING: T.B Joshua’s Successor Revealed By SCOAN Elders",
    "summarized_story": "Following the demise of the founder of the Synagogue Church of All Nations, SCOAN, TB Joshua, the elders in council of the church have decided to select a successor.\nDaily times gathered that SCOAN elders who had a crucial meeting stated that the church had no secession plan but someone has to carry the mantle of leading the church.\nSo much spiritual and financial efforts went into building SCOAN and it cannot just waste away,’’ a top aide said.\nEvelyn, the wife of late TB Joshua, and also a senior pastor in SCOAN, confirmed the funeral arrangements when she received Lagos state governor Babajide Sanwo-Olu.\nHowever, it is reported that the pastor’s family and church elders intervened and decided the pastor will be buried in Lagos on July 11."
  },
  {
    "headline": "$430m Enugu-Cameroon highway project to be completed this year – AfDB",
    "summarized_story": "The African Development Bank (AfDB) says the 430 million dollars highway project linking Enugu to Bamenda in Cameroon will be completed this year.\nAccording to Adesina, the 430 million dollars highway project will transform trade opportunities between the two countries.\nAccording to him, the bank’s support for infrastructure in the ECOWAS region has doubled over the past five years, increasing from two billion dollars in 2015 to four billion dollars.\n“Our 650 million dollars financing for the transport corridors linking Sierra Leone, Guinea and Liberia will impact on economic opportunities for 51 million people.\n“I am pleased that this year, the bank will provide 105 million dollars financing for the road linking Guinea-Bissau and Senegal,’’ he said."
  },
  {
    "headline": "Samson Siasia: CAS cancels FIFA life ban",
    "summarized_story": "Former Super Eagles player and Nigerian national team coach, Samson Siasia has got some reprieve on the life ban imposed on him by FIFA, following a match-fixing scandal.\nThe Court of Arbitration for Sport(CAS) on Monday reduced to five years the life ban imposed by FIFA in April 2019, saying the punishment was disproportionate to the offence.\nFIFA imposed the ban on Siasia in April 2019 after Siaisia was found guilty of agreeing to join a match-fixing ring in 2010.\nThe CAS ruling upheld the guilty verdict but reduced the length of the ban and set aside the additional fine of 50,000 Swiss francs ($54,000).\nThe fine was dropped as the panel felt it would be “inappropriate and excessive” on top of the ban."
  },
  {
    "headline": "Lawan predicts serious problems for APC after Buhari’s exit",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said that the All Progressives Congress (APC) may face challenges after the exit of President Muhammadu Buhari from office in 2023, except timely interventions are taken to avert same.\n“Yes, we have to know our value then, and the value of APC presently is APC minus President Muhammadu Buhari.\n“But when it is a family affair, and this is my position, power is given not taken.\n“So, we also have to mentor our youths, but we have to give them the opportunity to participate in governance.\n“I really feel we can do better to have more youths and more women in our government and party positions.”"
  },
  {
    "headline": "Soludo in trouble as APGA factions invite INEC’s Zamfara pill",
    "summarized_story": "By AbankulaThe Anambra governorship ambition of Chukwuma Soludo, the former CBN governor, has run into troubled waters.\nThe deepening schism in his All Progressives Grand Alliance (APGA) may make INEC apply the Zamfara treatment, reports indicated.\nIn Zamfara, the All Progressives Congress, in the run-up to the 2019 elections, broke into factions and failed to hold legal primaries for all elective posts.\nThe Publicity Secretary of the Okeke-led faction of the party, Ikechukwu Chukwunyere, gave reasons the disqualification may happen.\nProfessor Chukwuma Soludo, is a frontrunner to clinch the governorship ticket of APGA."
  },
  {
    "headline": "There’s No Place In Nigeria We Have Not Impacted By The Positively – Buhari",
    "summarized_story": "President Muhammadu Buhari said on Monday that his administration has had a beneficial influence on infrastructure in all sections of the country.\nOn Monday, Buhari addressed at the inaugural APC Progressive Youth Conference, which was hosted at the International Conference Centre in Abuja.\nHe urged the youths to work for the betterment of the country as well as for themselves.\n“There is actually no part of the country that has not been impacted positively in the areas of infrastructure, agriculture and economic support initiative based on peculiarities of the regions.\nIt is the responsibility of every one of us to work towards the development and advancement of this country,” he said."
  },
  {
    "headline": "BREAKING: Buhari Names Ekpungu EFCC Secretary, Appoints Board Members After 6 Years",
    "summarized_story": "George Abang Ekpungu has been named Secretary of the Economic and Financial Crimes Commission by President Muhammadu Buhari (EFCC).\nBuhari also named members of the anti-graft agency’s board of directors, which is chaired by Abdulrasheed Bawa.\nLuqman Muhammad (South South), Anumba Adaeze (South East), Kole Raheem Adesina (North Central), and Yahya Muhammad (North Central) are the candidates (North East).\nSections 2 (1) and 4 of the Economic and Financial Crimes Commission Act, 2004 govern the appointment.\nGwandu recalled that the “EFCC has been operating without board members since 2015”."
  },
  {
    "headline": "Kemisola Ogunniyi: Release Of End SARS Protester Who Delivered Baby In Prison Stalled",
    "summarized_story": "The effort to free the 18-year-old End SARS protester who gave birth while in prison custody has stalled.\nThe bail application of Kemisola Ogunniyi, who was held for allegedly being involved in the arson committed in Akure during the demonstration, was denied by Justice Omolara Adejumo, who stated she was uninformed of the bail application by the defendant’s counsel.\nDuring the curfew imposed in Ondo State in the aftermath of the End SARS demonstration, Kemisola was arrested alongside three other accused.\nAccording to the Defendant’s Counsel, Tope Temokun, due to court process, his client’s bail will be considered on Tuesday.\n“There are procedures for all court matters, it was a court order that put the person in the custody and the court order has to be followed in securing her bail ."
  },
  {
    "headline": "How Buhari’s Promises Of Restructuring Gained Him Votes In 2015",
    "summarized_story": "The Minister told journalists in Awka, Anambra State, said the Buhari administration has already begun the restructuring process, beginning with the economy.\nA former presidential aide, Reno Omokri described Buhari’s promise as an election scam stating that it was the promise that gave him the victory in 2015.\n“Yet, Buhari made false promises to restructure Nigeria and obtained votes from Nigerians based on that.\nNow, he says he will NEVER restructure Nigeria.\nA respondent, Promise Emeka who spoke to DAILY POST in Abuja, said the president used restructuring to market himself during the election."
  },
  {
    "headline": "Breaking: CAS reduces Siasia’s life ban",
    "summarized_story": "The Court of Arbitration for Sport (CAS) on Monday announced that it has reduced the life ban imposed on former Head Coach of Nigeria’s Super Eagles, Samson Siasia to five years.\nWorld football governing body, FIFA, had slammed Siasia with life ban over alleged match fixing scandal.\n“In 2010, a match fixer tried to involve Mr Siasia as a coach of a club under his strict instructions.\nWith the promise of employment benefits, Mr Siasia would have had to always field several players under the control of the match fixer.\n“The imposed fine of CHF 50,000 (fifty thousand Swiss Francs) on Mr Siasia is set aside."
  },
  {
    "headline": "Pictures: Flood takes over Ijebu Ode in Ogun",
    "summarized_story": "PreviousAPC needs Al-Makura to win in 2023"
  },
  {
    "headline": "VIDEO: Elizabeth Anyanacho gets gold, reacts thereafter at Beirut Open",
    "summarized_story": ""
  },
  {
    "headline": "Buhari directs RCC to commence work immediately on damaged section of Aleto Bridge -NigPilot",
    "summarized_story": "President Muhammadu Buhari has directed Reynolds Construction Company, RCC, to immediately undertake intervention on the damaged Aleto Bridge at KM 6+500 on the East-West road Section III(A) by Eleme, Onne Junction in Rivers State to alleviate the plight of motorists and other users.\nThis was disclosed by the Minister of Niger Delta Affairs, Sen. Godswill Akpabio, during an emergency meeting held with contractors handling the various sections of the East-West road on Thursday, in his office in Abuja.\nHe further noted that various sections of the road which have been in limbo over the years, have attained levels of completion and would be due for commissioning by President Buhari soon, affirming, that issue of compensation would be addressed in no time.\nThe Managing Director, RCC Nigeria Limited, Engineer Nader Yusuf in his remarks, stated that there are insinuations that sand mining around the river bank affected the foundation of the Aleto Bridge.\nYusuf further assured the minister that Engineers would move to site immediately to make the road motorable for road users."
  },
  {
    "headline": "Buhari directs RCC to commence work immediately on damaged section of Aleto Bridge -NigPilot",
    "summarized_story": "President Muhammadu Buhari has directed Reynolds Construction Company, RCC, to immediately undertake intervention on the damaged Aleto Bridge at KM 6+500 on the East-West road Section III(A) by Eleme, Onne Junction in Rivers State to alleviate the plight of motorists and other users.\nThis was disclosed by the Minister of Niger Delta Affairs, Sen. Godswill Akpabio, during an emergency meeting held with contractors handling the various sections of the East-West road on Thursday, in his office in Abuja.\nHe further noted that various sections of the road which have been in limbo over the years, have attained levels of completion and would be due for commissioning by President Buhari soon, affirming, that issue of compensation would be addressed in no time.\nThe Managing Director, RCC Nigeria Limited, Engineer Nader Yusuf in his remarks, stated that there are insinuations that sand mining around the river bank affected the foundation of the Aleto Bridge.\nYusuf further assured the minister that Engineers would move to site immediately to make the road motorable for road users."
  },
  {
    "headline": "Insecurity; AU- ECOSOCC Women task FG to consider women in all tiers of govt -NigPilot",
    "summarized_story": "Head women and gender affairs cluster committee AU-ECOSOCC Nigeria, Adaora Onyechere, has called on the federal government to as a matter consider women in all parts of the economic policy as a play critical role, not just as women but as burden bearers of instability in most part of the country.\nShe made the call yesterday while addressing the forum at a press conference on the role of Nigerian women in conflict resolution, peacebuilding, and mediation, in Abuja.\nShe stressed that women have a right to peace and should have the right to peacebuilding as citizens in conflict resolutions just as they remain the first group of burden bearers and the primary individual at the receiving e nd of the war, crisis, banditry, community clash, and terrorismOyenchere appealed to the government as well as African Leaders on the need to strengthen the voice of the women as well as have the political will and empathy to listen to the voices of their women who play critical roles in peacebuilding.\n“Government should be able to strengthen the local skill of women in all sector of the national economy at all levels in other to provide employment for the teeming youths and reduce casualties of those who lost their lives to banditry and criminalities as a means of survival.\nThe African Union ECOSOCC Nigeria has its mandate to commit to peace and security of Nigerian state and as well call on critical stakeholders on the need to weigh the consequences of choosing vices other than dialogue in conflict resolution in a democratic state which will impact harshly on the vulnerable citizens especially women”, she said."
  },
  {
    "headline": "Insecurity; AU- ECOSOCC Women task FG to consider women in all tiers of govt -NigPilot",
    "summarized_story": "Head women and gender affairs cluster committee AU-ECOSOCC Nigeria, Adaora Onyechere, has called on the federal government to as a matter consider women in all parts of the economic policy as a play critical role, not just as women but as burden bearers of instability in most part of the country.\nShe made the call yesterday while addressing the forum at a press conference on the role of Nigerian women in conflict resolution, peacebuilding, and mediation, in Abuja.\nShe stressed that women have a right to peace and should have the right to peacebuilding as citizens in conflict resolutions just as they remain the first group of burden bearers and the primary individual at the receiving e nd of the war, crisis, banditry, community clash, and terrorismOyenchere appealed to the government as well as African Leaders on the need to strengthen the voice of the women as well as have the political will and empathy to listen to the voices of their women who play critical roles in peacebuilding.\n“Government should be able to strengthen the local skill of women in all sector of the national economy at all levels in other to provide employment for the teeming youths and reduce casualties of those who lost their lives to banditry and criminalities as a means of survival.\nThe African Union ECOSOCC Nigeria has its mandate to commit to peace and security of Nigerian state and as well call on critical stakeholders on the need to weigh the consequences of choosing vices other than dialogue in conflict resolution in a democratic state which will impact harshly on the vulnerable citizens especially women”, she said."
  },
  {
    "headline": "NRDF bill will drive knowledge based economy-Bogoro -NigPilot",
    "summarized_story": "Executive secretary, Tertiary education trust Fund, TETFund, Professor Suleiman Bogoro has stressed that a new vista is emerging in Nigeria with the inauguration of the draft committee on the National Research and Development Foundation, NRDF, bill.\nBogoro who spoke during the fourth edition of the virtual Global Engagement Series: “The Paradigm Shift, with focused on the Institutionalization of R&D in Nigeria’s Engineering, Technology And Material Sciences Sector,” said there is a great hope for Nigeria once the bill is signed.\nIt reflects a new beginning, a realistic beginning for the knowledge economy to take its rightful place in our country.\n“An institutional framework needs to be put in place to domicile, drive and oversee Nigeria’s progress to a knowledge based economy.\n“We urgently need the early actualisation of the national research development foundation, which we have all been crying for so that this foundation can completely recommend with the means of bringing areas of knowledge base links.”"
  },
  {
    "headline": "Those Waiting For Nigeria To Break Will Be Sorely Disappointed – Osinbajo",
    "summarized_story": "The Vice President, Professor Yemi Osinbajo, is confident that Nigeria will remain united as a strong nation to the frustration of those waiting to see the country broken into pieces.\nHe made the remark on Monday in Abuja at the maiden edition of the All Progressives Congress (APC) Progressives Youth Conference.\n“Even if that was true at some point, today, that notion stands on very weak legs indeed,” he said.\nThe event had in attendance APC youth leaders and older party leaders from various parts of the country, as well as top government officials.\nConversations at the conference centred on more youth inclusiveness in party politics and the positioning of young people for the 2023 general elections."
  },
  {
    "headline": "Suspected IPOB Members, Others Arrested Over Attacks On Police, INEC Facilities In Ebonyi",
    "summarized_story": "Dozens of suspected members of the Indigenous People of Biafra (IPOB)/ Eastern Security Network (ESN) have been arrested in connection with the attacks on police stations and offices of the Independent National Electoral Commission (INEC) in Ebonyi State.\nRead the full text of the police commissioner’s briefing below:PRESS BRIEFING/PARADING OF 60 SUSPECTS ARRESTED FOR DIFFERENT OFFENCES BY THE COMMISSIONER OF POLICE EBONYI STATE CP.\nThe gang are also responsible for the attacks on some government facilities and the killing of security agents in the area.\nThe said gang members were alleged to have fled the scene on sighting Police on the day he was arrested.\nI wish to thank immensely His Excellency, the Executive Governor of Ebonyi State, Chief Engr."
  },
  {
    "headline": "‘Night Operation, Chinese Connection’: How A Rail Vandalism Operation Thrived In Nasarawa",
    "summarized_story": "But they couldn’t make the arrest because the youths refused.”Another railway staff suggested that the youths were motivated by a sense of entitlement.\nChinese connectionThe youths, according to the police, were in cahoots with several top politicians, corrupt police officers and NSCDC staff, and Chinese nationals.\nThis month, the police announced that it had cracked down on a criminal syndicate engaged in vandalising rail tracks across the North-West and North-Central.\nInside the warehouse, the police discovered different vandalised rail equipment, stolen rail installation racks, weld-shear, rail puller, other rail accessories and consumables.\n“Removal of rail tracks can cause train derailment, with deadly consequences,” he said at a town hall meeting recently."
  },
  {
    "headline": "Five Killed, Four Injured As Police Inspector Opens Fire On Youths In Enugu",
    "summarized_story": "Five persons have been killed and four others injured after a Police Inspector went into a shooting frenzy in Enugu State on Sunday.\nThe police officer who reportedly attacked a neighborhood in Golf Estate, GRA, Enugu, is said to be attached to a lottery company within the area.\nConfirming the incident in a statement, the state police command said it was unclear what led to the sporadic shooting.\nHe further disclosed that the four others who sustained injuries are currently receiving treatment at the Enugu State University Teaching Hospital.\nThe police commissioner while sympathising with the family and friends of the deceased persons, urged them to remain calm while the police conclude their investigation."
  },
  {
    "headline": "Italy Says Face Masks Won’t Be Mandatory From June 28",
    "summarized_story": "Face masks will no longer be compulsory in Italy, one of the countries in Europe worst hit by the coronavirus, from June 28, the health ministry said Monday.\nThe lifting of the mask requirement would come into effect in regions labelled “white” under Italy’s classification system for how rapidly the virus is spreading, Health Minister Roberto Speranza wrote on Facebook.\nThe country has recorded 127,291 deaths since the pandemic reached it in early 2020, with 4.25 million infections.\nSo far 30 percent of people over 12 have been vaccinated, or around 16 million out of a population of 60 million.\nMore than 46 million vaccine doses have been administered in Italy."
  },
  {
    "headline": "Fulani leaders Pay Solidarity Visit To Kebbi State Governor",
    "summarized_story": "Leaders of Fulani communities in the twenty one local government areas of Kebbi state have paid a solidarity visit to the state governor Atiku Bagudu over the abduction of students of the Federal Government College Birnin Yauri.\nDuring the visit, the leader of the fulani groups in the state, Bello Aliyu Gotomoassured President Muhammadu Buhariof their resolve to compliment the effort of security agencies to eradicate banditry in the country.\nHe says they are also at the government house to show their willingness to join the ongoing fight to rescue the abducted students.\nGovernor Atiku Bagudu described the visit as a morale booster as the state is making effort to ensure bandits have no hiding place in all the twenty one local government areas of the state.\nThe governor was represented by his adviser on security matters, Major Garba Rabiu Kamba (rtd), also thanked other groups who visited and showed support and commitment to help the state government in tackling the new wave of crime in the state."
  },
  {
    "headline": "We will continue to improve business climate – FG",
    "summarized_story": "The Federal Government says it will continue to interact and engage with the Organised Private Sector (OPS) in the country, while improving the country’s business climate, in the full knowledge that the sector is the real engine room of growth and development, according to Vice President Yemi Osinbajo, SAN.\nResponding, the Vice President while welcoming the presentation, noted that “the private sector is the engine of growth, there is no way the Federal Government can do anything in the economy without the private sector.\nGod will continue to empower you.”The virtual interaction was also attended the Minister of Industry, Trade and Investment, Otunba Niyi Adebayo, among other senior government officials.\nResponding, the Vice President while welcoming the presentation, noted that “the private sector is the engine of growth, there is no way the Federal Government can do anything in the economy without the private sector.\nGod will continue to empower you.”The virtual interaction was also attended the Minister of Industry, Trade and Investment, Otunba Niyi Adebayo, among other senior government officials."
  },
  {
    "headline": "Ondo PDP formally requests for copies of Appellate Court Judgment",
    "summarized_story": "The People’s Democratic Party, PDP in Ondo State has formally requested the certified copies of the judgment of the appeal filed by the party and Mr Eyitayo Jegede over the October 10, 2020 Governorship election in the state from the Appellate Court.\nThe request addressed to the Deputy Chief Registrar of the Appeal Court, Akure Judicial Division and signed by the State party Chairman, Alhaji Fatai Adams was submitted by the State Legal Adviser, Mr Wole Awofade at the court in Akure.\nThe letter requesting for Appellate Court judgement, the State Legal Adviser, Mr Awofade said the request for the copies became necessary in view of the need to study it and aid the appeal of the judgment at the Supreme Court.\nMeanwhile, members of the PDP had gathered at the Party’s secretariat in Akure to stage a peaceful protest to the Appeal court over alleged plan to undermine the party’s decision to approach the Supreme Court."
  },
  {
    "headline": "Belgium Complete Perfect Euro 2020 Group Campaign With Win Over Finland",
    "summarized_story": "Belgium completed a perfect group campaign with a 2-0 victory over Finland at the European Championship on Monday.\nAn own goal and a Romelu Lukaku strike made the difference as the Belgians finished Group B play with nine points from three games as the head to the knockout stage.\nFinland, who finish the group in third, must await other results to learn if they will move on to the round of 16.\nBut a VAR review judged the Inter Milan striker was fractionally offside before the pass and overturned the goal.\nLukaku, then, got his goal soon after with a tidy turn and finish after receiving a De Bruyne pass with his back to goal — the powerful striker beating Hradecky to the near post with a well-struck right-footed shot."
  },
  {
    "headline": "Euro 2020: Denmark Thrash Russia to Honour Eriksen and Qualify For Round of 16",
    "summarized_story": "Denmark pulled off an emphatic 4-1 win over Russia at the Parken Stadium to qualify for the knockout stages of Euro 2020 as Group B rivals Finland lost to Belgium.\nThe Belgians swept to victory in the group, winning all three games, with Denmark taking second place on three points and Finland behind them on goal difference.\nMikkel Damsgaard fired the Danes in front with a stunning curling shot in the 38th minute, and Yussuf Poulsen pounced on a poor back pass from Roman Zobnin to score the second in the 59th.\nArtyom Dzyuba pulled one back from the penalty spot for Russia in the 70th minute but a thunderous strike from Andreas Christensen and a fourth from Joakim Maehle completed the rout.\nDenmark will meet Wales in the last 16 in Amsterdam on June 26."
  },
  {
    "headline": "Man City Make £100m Bid For Tottenham Striker Kane",
    "summarized_story": "Manchester City have made a £100m bid for Tottenham striker Harry Kane.\nCity are open to including players in addition to the cash offer, but Tottenham are expected to reject the bid.\nUK media reported last month that Kane had told Spurs he wanted to leave this summer with Man City, Manchester United and Chelsea the interested clubs.\nThe Premier League champions’ priority is to replace Sergio Aguero, with Kane being considered along with Erling Haaland, Romelu Lukaku and Lautaro Martinez.\nMan City begin their Premier League title defence by travelling to Tottenham on August 15."
  },
  {
    "headline": "Nigerian Court Awards $199m Damages Against ExxonMobil, NNPC Over Oil Spillage",
    "summarized_story": "A Nigerian Court has ordered the Mobil Producing Nigeria Unlimited and the Nigerian National Petroleum Corporation (NNPC) to pay oil communities in Ibeno Local Government Area of Akwa Ibom a cumulative damages of 81.9 billion over oil spillage.\nJustice Taiwo Taiwo of the Federal High Court, Abuja, in a judgement debt, ordered that the payment must be paid within 14 days, and failure of which eight per cent interest would be accruable on the principal sum annually.\nDelivering judgement on Monday in a joint suit instituted against the two defendants by the aggrieved oil producing communities, Justice Taiwo held that the American oil company and NNPC were negligent in the way they handled oil spills that caused environmental degradation in the communities.\nHowever, the judge held that the instant suit had to do with fundamental rights that cannot be rendered impotent by the statute of limitations.\nJustice Taiwo consequently awarded the sum of N42.8 billion as damages for intangible losses, N21.9 billion for special damages as annotated and N10 billion as general damages."
  },
  {
    "headline": "Nigeria Court Orders FG to Pay Bayelsa State $951 Million Derivative Arrears",
    "summarized_story": "A Federal High Court in the Nigerian capital, Abuja, on Monday, ordered the Federal Government to pay $951 million to the Bayelsa State Government.\nThe amount is the 13 per cent derivative sum due as arrears of revenue and payable to the Bayelsa government.\nJustice Ekwo ruled that the development made the court to declare the plaintiff’s case “unchanged.”The News Agency of Nigeria reports that Ken Njemanze filed the suit on behalf of the Bayelsa government.\nHe said the defendant (AGF) had admitted the claims of the Bayelsa government in the process the former filed in reaction to the suit.\nAccording to the Bayelsa government, the money had accrued from 2003 to 2017."
  }
]