[
  {
    "headline": "BREAKING: Osodeke emerges new ASUU president",
    "summarized_story": "The executive council of ASUU would however spend a maximum of four years.\nThey were elected at the national delegates conference of ASUU held in Awka, Anambra State.\nRead AlsoWhile Prof. Victor Emmanuel Osodeke of the Michael Okpara University of Agriculture, Umudike in Abia State was elected President, Chris Piwuna, a Consultant Psychiatrist and Associate Professor in the College of Medicine, University of Jos was elected Vice President.\nOthers are Prof. Siji Sowande (Treasurer); Prof. Ade Adejumo (Financial Secretary); Dr. Austen Sado (Investment Secretary); Dr. Adamu Babayo (Internal Auditor) and Dr. Stella-Maris Okey (Welfare Secretary).\nWhile the new President was former Vice President to Prof. Biodun Ogunyemi, outgone President, Piwuna, before his election, was the Internal Auditor of ASUU and its former Chairman in UNIJOS."
  },
  {
    "headline": "BREAKING: Jonathan’s ex-aide, Ahmed Gulak, shot dead in Imo",
    "summarized_story": "A former presidential aide, Ahmed Gulak, has been shot dead in Imo State on Sunday.\nSources said that he was ambushed while on his way to Sam Mbakwe International Cargo airport.\nHis motorcade was attacked at a place called Obiagwa, close to the Airport.\nThe former aide to ex-president Goodluck Jonathan was attacked in his vehicle – Camry – marked Texas BFT 2150, The PUNCH was told.\nYou know that Imo command is different from Airport command.”Details later…"
  },
  {
    "headline": "Buhari travels to Ghana for Emergency ECOWAS Summit",
    "summarized_story": "Kindly Share This Story:By Johnbosco AgbakwuruPresident Muhammadu Buhari is expected to depart Abuja on Sunday for Accra, Ghana to attend an emergency Extraordinary Summit of ECOWAS, convened to discuss recent political developments in Mali.\nA statement issued by the Special Adviser to the President on Media and Publicity, Chief Femi Adesina explained that the meeting was at the instance of the Chairman of the Authority of Heads of State and Government of ECOWAS and President of Ghana, Nana Akufo-Addo.\nREAD ALSO 5 soldiers feared dead as gunmen attack military checkpoint in AnambraAdesina said prior to the Extraordinary Summit, the President had met with the Special Envoy and ECOWAS mediator in Mali, former President Goodluck Jonathan, who briefed him on the latest developments in the country following his meeting with key political actors in the West African country.\nHe is expected back in Abuja at the end of the one-day Summit.\nKindly Share This Story:"
  },
  {
    "headline": "Buhari and Nigeria: Who belongs to whom?",
    "summarized_story": "Many refused to believe that even the man, Buhari, believed in the words that he let drop from his own lips.\nMy focus is on what Nigeria means to Buhari; specifically, does Buhari believe he is chief servant of Nigerians or he thinks he OWNS Nigeria?\nNow, a reason for Nigeria’s food security crisis is Fulani herders’ attack on farmers, especially in the Middle belt and the entire South.\nDoes Buhari know that Nigeria has a constitution?\nIn 2015, Nigeria which Buhari and APC came to save was 12th in Africa food security index."
  },
  {
    "headline": "Umahi mocks IPOB’s sit-at-home order, says freedom fighters shouldn’t be outside country vomiting rubbish",
    "summarized_story": "Kindly Share This Story:By Peter Okutu – AbakalikiGovernor David Umahi of Ebonyi State, Saturday mocked the sit-at-home order declared by the Indigenous People of Biafra, IPOB, saying freedom fighters should not be outside the country and vomiting rubbish.\nThe spirit of our founding fathers is devoid of selfishness.\nWe thank our founding fathers.\n“The dreams of our founding fathers have been realized.\n“President Buhari is good to Ebonyi State and we are not afraid to say it."
  },
  {
    "headline": "BREAKING: Police reportedly arrest 57 Biafra Zionists members in Enugu",
    "summarized_story": "About 57 members of the Barr.\nBenjamin Onwuka-led Biafra Zionists Federation, BZF, have been arrested in Enugu State.\nDAILY POST learnt that they were picked up on Sunday morning shortly before the commencement of their Biafra Day parade.\nIn a message he sent out on Sunday, the self-acclaimed BZF leader said “they arrested 57 of our members this morning.\nOnwuka had a few days ago announced that they would storm the Michael Okpara Square, Enugu, today, for a Biafra parade."
  },
  {
    "headline": "BREAKING: IPOB killed Ahmed Gulak over Nnamdi Kanu's sit-at-home order",
    "summarized_story": "Nigeria intelligence community have linked the assassination of former political adviser to ex-President Goodluck Jonathan, Ahmed Gulak, to the Indigenous People of Biafra (IPOB).\nThe officer disclosed they intercepted communication and saw videos where Kanu threatened anyone who fails to observe his sit-at-home order from May 29 to May 31 will die.\nThe IPOB leader warned that the order is compulsory and must be obeyed South-East people.\non the 29th, there will be no movement, this is not sit-at-home but no movement.\nGulak, an All Progressives Congress (APC) chieftain, was killed in Owerri, Imo State capital on Saturday night."
  },
  {
    "headline": "Kanu hails Oduduwa agitators for forcefully reopening Idi-Iroko border",
    "summarized_story": "Mazi Nnamdi Kanu has lauded the Oduduwa Republic agitators who invaded the Idi-Iroko border in Ogun State on Saturday and reopened all the gates.\nDAILY POST had reported that the secessionists stormed the border community on Saturday and forced open all the gates at the international frontier.\nAccording to a tweet on his official Twitter handle on Sunday Kanu said the yoruba nationYorubators have forcefully taken what belongs to them.\nThe tweet reads: “The real owners of the land; the indigenous owners of ‘Nigeria’ are beginning to repossess their land from Fulani Caliphate, their stooges, vassals & hangers-on.\n“Congratulations to my #Oduduwa brethren for the successful retake of the Idi-Iroko border from #Fulani terrorists”."
  },
  {
    "headline": "Gunmen murder Jonathan’s ex-adviser Ahmed Gulak in Imo",
    "summarized_story": "Ahmed Gulak, a former political adviser to ex-President Goodluck Jonathan has been murdered.\nGulak was shot dead by gunmen in Owerri, the Imo capital.\nThe former chieftain of the Peoples Democratic Party (PDP) joined the All Progressives Congress (APC) in 2018.\nIn the same year, the Adamawa-born politician chaired the APC governorship primary committee in Imo.\n“Allaahummaghfir li (Ahmed Ali Gulak) warfa’ darajatahu fil-mahdiyyeena, wakhlufhu fee ‘aqibihi fil-ghaabireena, waghfir-lanaa wa lahu yaa Rabbal-‘aalameena, wafsah lahu fee qabrihi wa nawwir lahu feehi”, she tweeted."
  },
  {
    "headline": "Terrorism: Zulum tasks Farouk Yahaya on fight against insurgents, bandits",
    "summarized_story": "Governor Babagana Zulum of Borno State has urged the new Chief of Army Staff (COAS), Maj.-Gen. Farouk Yahaya, to sustain the fight against insurgents, bandits and other criminal elements in the country.\nThe governor made the call in a statement on Sunday in Maiduguri by his Special Adviser on Communications and Strategy, Malam Isa Gusau.\nZulum, who commended President Muhammadu Buhari for the choice of Yahaya, said the development showed Buhari’s consistency and commitment in combating insurgency in the North East.\n“With the appointment of General Yahaya, the country has retained the advantage of having in place service chiefs who have all served in Borno and have sufficient operational knowledge in the fight against Boko Haram and ISWAP.\nZulum expressed optimism that the experiences and combined efforts of the service and other stakeholders would facilitate the fight against insurgents."
  },
  {
    "headline": "IPOB stay-at-home order: Tension in Ebonyi, Imo, Abia, others",
    "summarized_story": "By Sunny Nwankwo, Umuahia/Ogochukwu Anioke,Abakaliki/Damien Duruiheoma,Enugu/Chris Njoku,OwerriIt was all fears and tension in the Southeast states of Abia, Anambra, Ebonyi, Enugu and Imo yesterday ahead of the commencement of the sit-at-home order issued by the proscribed Indigenous People of Biafra (IPOB).\nSome residents berated IPOB and its leader, Nnamdi Kanu, for putting the people under unnecessary stress.\nThe fear was heightened by a social media publication on Friday purportedly issued by IPOB leader Nnamdi Kanu, warning people to stock their homes.\nThe Abia State Police Command enjoined residents and visitors to the state to disregard the IPOB, MASSOB or any other pro-Biafra group sit-at-home order.\n“But today, he is threatening death on anybody who flouts the sit-at-home order, telling them that it is no longer voluntary but compulsory."
  },
  {
    "headline": "God has anointed Tinubu as next President, says Bishop",
    "summarized_story": "By Osagie Otabor, AkureGeneral Overseer and Primate of Christ Revelation Church of God a.k.a Holy Promise, Bishop Ayodeji Ipinmoroti has said that God did not design Nigeria to disintegrate.\nBishop Ipinmoroti spoke during a sermon to commemorate the Children National Day wherein he unveiled his recent encounter with God that showed him former Lagos Governor Bola Tinubu will emerge next President.\nHe said Tinubu would emerge, President, even though many of his political associates would betray him before the elections.\nBishop Ipinmoroti said God showed him “Nigeria system will work again but we need to repent from our sinful ways.\nThat God chosen candidate is Tinubu."
  },
  {
    "headline": "BREAKING: Former Jonathan’s aide, Gulak, shot dead in Owerri",
    "summarized_story": "By Our ReporterEx-political Adviser to former President Goodluck Jonathan, Ahmed Gulak, has been shot dead in Owerri.\nThe chieftain of the All Progressives Congress (APC) was shot by gunmen in Imo State, the capital.\nEyewitness told The Nation Gulak was allegedly shot dead around 06:30am by gunmen at Amaekwemgba Junction, Umueze Ezemba Community, a few poles to the airport.\nHe was reportedly accosted while driving from Enyiogugu Mbaise area towards the airport before his assailants blocked him and shot him twice on the head.\nADVERTISEMENTSome people around the area alleged that the gunmen came in military camouflage."
  },
  {
    "headline": "FRSC warns public against the use of government registration number plates",
    "summarized_story": "Agency ReporterThe Ogun Command of Federal Road Safety Corps (FRSC), has warned members of the public who are fond of using government registration number plates in their vehicles to commit crimes to desist from such activities in order not to face the wrath of the law.\nMr Umar Ahmed, the Ogun Sector Commander of FRSC, gave the warning in an interview with the News Agency of Nigeria (NAN) on Sunday, in Ota, Ogun.\nAhmed said FRSC personnel had arrested drivers of para-military vehicles, commercial bus drivers, drivers of government, state and local government vehicles, among others, who violated traffic regulations as well as those who used government registration number plates in disguise.\nADVERTISEMENT“Any offender who violated government registration number plates or any impounded vehicles would be handed over to the police for further investigation,” he said.\nThe Sector Commander also reiterated FRSC’s commitment to partner with all sister agencies to tackle the crime rate in the state."
  },
  {
    "headline": "BREAKING: Gunmen abduct lawmaker in Nasarawa",
    "summarized_story": "From Leo Nzwanke, LafiaA member of Nasarawa State House Assembly representing Nasarawa Central State Constituency Hon Ismai Danbaba has been kidnapped.\nHon Danbaba was kidnapped on Saturday evening while traveling to Jos, plateau state to attend a work for Nasarawa State legislators.\nHe explained that the kidnapped Member had pass Andaha in Akwanga local government area of Nasarawa State heading to the forest area in Sanga local government area of Kaduna state when the kidnappers ambush him and whisk him away.\nThe kidnapped Member Hon Ismail Danbaba came into the assembly last year on the platform of APC through a bye election to represent Nasarawa Central State Constituency.\nHon Omadefu urged members of the public to pray for his safety."
  },
  {
    "headline": "BREAKING: Jonathan’s ex-aide, Ahmed Gulak, killed by gunmen in Imo",
    "summarized_story": "From Stanley Uzoaru, OwerriGunmen have reportedly killed the former political adviser to ex president Goodluck Jonathan and former Speaker of the Adamawa State House of Assembly, Ahmed Gulak.\nAlthough, circumstances surrounding the All Progressive Congress (APC) chieftain’s death is still sketchy at the time of this report, sources said he was shot by the gunmen close to the Imo airport last night.\nDetails soon…"
  },
  {
    "headline": "Buhari, Osinbajo receive second jab of COVID-19 vaccine",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari yesterday received his second jab of AstraZeneca vaccine against the COVID-19.\nRecall that the President Buhari and Vice President Yemi Osinbajo had taken their first jabs of the vaccine during a ceremony in March.\nVice President Osinbajo, also received his second dose of the COVID-19 vaccine at his Aguda House residence.\nThe Chief Nursing Officer at the State House Clinic, Esther Tukur, administered the jab was on the vice-president.\nThe State House Vaccination team also included Chief Medical Physician Dr. Nicholas Audiffren and Dr, Abiodun Adelowo."
  },
  {
    "headline": "2023 presidency: Nobody can stop me If… –Wike",
    "summarized_story": "From Tony John, Port HarcourtThe Rivers State governor, Nyesom Ezenwo Wike, recently fielded questions from journalists in Port Harcourt, Rivers State.\nThe same Aliyu Babangida in 2017 was one of those who opposed Uche Secondus to be chairman of the party.\nToday, if they hold election in Niger State, can he make PDP to win in the state?\nAs I talk with you now, no state congress of PDP has been done in Niger State.\nI am not in the category of Aliyu Babangida; he knows that very well."
  },
  {
    "headline": "Nigeria heavily challenged – Olisa Agbakoba (SAN)",
    "summarized_story": "By Daniel KanuHuman rights activist, legal giant, and former President of Nigeria Bar Association (NBA), Mr Olisa Agbakoba (SAN) is worried on how Nigeria is drifting by the day.\nNigeria is now number 1 as the most dangerous area of piracy, as rated by the International Maritime Bureau.\nOn the whole, one will say that Nigeria is very heavily challenged.\nLeadership, yes, leadership is the main problem and Chinua Achebe has said that in his book “The trouble with Nigeria”.\nI don’t live in the Federal Republic of Nigeria, I live in Lagos State, the Federal Republic of Nigeria is just an expression."
  },
  {
    "headline": "Breaking: Ahmed Gulak, Ex-Political Adviser to Former President Jonathan, Killed in Owerri",
    "summarized_story": "Ahmed Gulak, a former political adviser to former President Goodluck Jonathan, was shot dead on Sunday in Owerri, Imo State capital.\nDetails of his death are still scanty, but reports said he was shot dead by unknown gunmen who ambushed his vehicle on his way to Sam Mbakwe Airport in the state capital.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "After 40 Days in Captivity, All Remaining Abducted Greenfield Students Freed",
    "summarized_story": "Five out of the abducted students and a Male warden were grossly murdered by the bandits.\n“Governor Nasir El-Rufai welcomed the news of the students’ release, and conveyed solace and encouragement to them following their harrowing ordeal.\n“Yes, 14 of the students of the Greenfield University were released from captivity this evening (Saturday), remaining three of them still in captivity,” Jalige explained.\nHe did not give details of the students’ release and why three were still being held.\nThe last batch of 27 of the students was released about two weeks ago after spending 56 days in captivity."
  },
  {
    "headline": "Irabor: We’ll Not Relent Until Enemies of State are Brought to their Knees",
    "summarized_story": "•Troops kill 17 insurgents, IPOB members in Borno, RiversKingsley Nwezeh in AbujaThe Chief of Defence Staff (CDS), General Lucky Irabor, said yesterday that the armed forces would not relent in their onslaught against terrorists until the enemies of the Nigerian state were defeated.\nAddressing a group, God Bless Nigeria, which organised a solidarity march to the Defence Headquarters complex in Abuja, the defence chief vowed that enemies of the state would be brought to their knees.\nThe marchers carried banners with the inscription, “Armed Forces Appreciation Day”, in support of the country’s security forces.\nThe defence chief, who was represented by the Director, Defence Information (DDI), Brigadier-General Onyema Nwachukwu, said the military was committed to defeating the adversaries.\nNwachukwu stated while receiving the group, “I welcome the God Bless Nigeria group on behalf of the Chief of Defence Staff, service chiefs and the entire military."
  },
  {
    "headline": "APC Stalling National Convention Because Committee Members Plan to Succeed Themselves",
    "summarized_story": "•APC members threaten legal action for over stayingChuks Okocha in AbujaThe extraordinary caretaker committee of the All Progressives Congress (APC) is yet to announce dates for the national convention of the party because some members of the committee are allegedly planning to succeed themselves as national executive committee members.\nBut after 12 months, no date has been announced for the election of the executive committee members, even after the six months mandate was extended in December 2020.\nTHISDAY also gathered that the Buni-led caretaker committee had begun to plan another meeting of NEC to seek an elongation of the tenure of the committee.\nAlthough this has not been tabled before the NEC, members of the party, who should know were already protesting against the idea of members self-perpetuating themselves under any guise.\nAnything outside announcing the dates of the national convention and other dates for the states congresses is outside our mandate."
  },
  {
    "headline": "Osinbajo: FG Deploys Significant Resources to Address Challenges in Human Capital Devt",
    "summarized_story": "Obinna ChimaThe federal government has over the years deployed significant resources to address challenges in education and healthcare, in its efforts to address human capital development and related issues in the country, Vice President Yemi Osinbajo, has said.\nExplaining circumstances where governments may need to intervene directly, including in human capital development, the Vice President said, “direct state (government) intervention is crucial.\nMaking reference to some specific interventions of the federal government, Osinbajo said, “in our first budget, we devoted for N500 billion to our Social Investment Programme.\nWe have a large public service but you still have huge shortages in, for example, health and education sectors.\nI think we have to look at really, the professionalisation of our public service, ensuring that we have the right quality of people in the right jobs,” Osinbajo added."
  },
  {
    "headline": "10 Dead As Boko Haram Attacks Troops In Borno",
    "summarized_story": "Boko Haram fighters on Friday attacked the Operation Hadan Kai troops’ location in Rann in the Kala Balge Local Government Area of Borno State, with 10 of them shot dead during a fierce gun battle.\nThis was hours into the resumption of the new Chief of Army Staff, Maj Gen Farouk Yahaya, at the Nigerian Army Headquarters, Abuja.\n“The terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\n“The troops chased the retreating terrorist and ensured there was no further threat to the town and its residents.\nTroops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "10 Dead As Boko Haram Attacks Troops In Borno",
    "summarized_story": "Boko Haram fighters on Friday attacked the Operation Hadan Kai troops’ location in Rann in the Kala Balge Local Government Area of Borno State, with 10 of them shot dead during a fierce gun battle.\nThis was hours into the resumption of the new Chief of Army Staff, Maj Gen Farouk Yahaya, at the Nigerian Army Headquarters, Abuja.\n“The terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\n“The troops chased the retreating terrorist and ensured there was no further threat to the town and its residents.\nTroops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "Tinubu Takes N9billion From Lagos Internally Generated Revenue Account Monthly, Says Bode George",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), says excessive leakages of revenues and monumental corruption are responsible for slow growth in Lagos state.\nSpeaking in an interview with Yoruba Tooto TV, George accused Bola Tinubu, national leader of the All Progressives Congress (APC) of taking N9 billion monthly from the Lagos state internally generated revenue account.\nBola Tinubu“Do you know how much is Lagos state internally generated revenue monthly?\nThings are hard in this country.”George added that the late Funsho Williams should have become the Lagos state governor.\nHe would have been a better governor of Lagos state,” he said."
  },
  {
    "headline": "Tinubu Takes N9billion From Lagos Internally Generated Revenue Account Monthly, Says Bode George",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), says excessive leakages of revenues and monumental corruption are responsible for slow growth in Lagos state.\nSpeaking in an interview with Yoruba Tooto TV, George accused Bola Tinubu, national leader of the All Progressives Congress (APC) of taking N9 billion monthly from the Lagos state internally generated revenue account.\nBola Tinubu“Do you know how much is Lagos state internally generated revenue monthly?\nThings are hard in this country.”George added that the late Funsho Williams should have become the Lagos state governor.\nHe would have been a better governor of Lagos state,” he said."
  },
  {
    "headline": "Ex-President Jonathan's Former Political Adviser, Ahmed Gulak Murdered In Imo",
    "summarized_story": "Former Special Adviser on Politics to the then President, Goodluck Jonathan, Ahmed Gulak has been killed by gunmen in Owerri, Imo State.\nAhmed GulakWhy Gulak was in Imo State was not disclosed but he was said to have been invited by some Northern groups in the state.\nSpeaker of the Adamawa State House of Assembly, former Senior Special Assistant to the Vice President and former Special Adviser Political to President Goodluck Jonathan, Barr.\n“May Allah (SWT) also give all his children, relatives, friends and loved ones, the fortitude to bear the irreparable loss.\nAnd may Allah (SWT) bless us with faithful deaths when it is our turn to die."
  },
  {
    "headline": "Fire guts Ladipo spare parts market",
    "summarized_story": "Fire has gutted the Alapeju section of the Ladipo market in Mushin area of Lagos state.\nAdvertisementOfficials of the Lagos state fire service who arrived at the scene said the incident happened on Sunday morning.\nAs of the time of filing this report, the cause of the fire has not been ascertained.\n“We are currently attending to Fire emergency at spare parts sales line, Alapeju section of Ladipo Market, Mushin Lagos,” the agency wrote on Twitter.\nAdvertisementWe are currently attending to Fire emergency at spare parts sales line, Alapeju section of Ladipo Market, Mushin Lagos#foragreaterlagos@jidesanwoolu@Fedfireng@Mr_JAGs pic.twitter.com/ArqFshS6w5 — Lagos State Fire and Rescue Service (@LagosRescue) May 30, 2021AdvertisementEarlier in the month, a section of the Cairo market in Oshodi-Isolo LGA, was razed with goods worth fortune lost in the inferno."
  },
  {
    "headline": "Fire guts Ladipo spare parts market",
    "summarized_story": "Fire has gutted the Alapeju section of the Ladipo market in Mushin area of Lagos state.\nAdvertisementOfficials of the Lagos state fire service who arrived at the scene said the incident happened on Sunday morning.\nAs of the time of filing this report, the cause of the fire has not been ascertained.\n“We are currently attending to Fire emergency at spare parts sales line, Alapeju section of Ladipo Market, Mushin Lagos,” the agency wrote on Twitter.\nAdvertisementWe are currently attending to Fire emergency at spare parts sales line, Alapeju section of Ladipo Market, Mushin Lagos#foragreaterlagos@jidesanwoolu@Fedfireng@Mr_JAGs pic.twitter.com/ArqFshS6w5 — Lagos State Fire and Rescue Service (@LagosRescue) May 30, 2021AdvertisementEarlier in the month, a section of the Cairo market in Oshodi-Isolo LGA, was razed with goods worth fortune lost in the inferno."
  },
  {
    "headline": "Ahmed Gulak, Jonathan’s ex-aide, shot dead in Owerri",
    "summarized_story": "Ahmed Gulak, a chieftain of the All Progressives Congress (APC), has been killed by gunmen in Imo state.\nAdvertisementTheCable understands that the former aide of ex-President Goodluck Jonathan was shot dead by gunmen while returning to Abuja from Owerri, Imo state capital.\nHe once declared himself as the national chairman of the Peoples Democratic Party (PDP) during the party’s leadership crisis in January 2016.\nGulak was chairman of the APC committee that conducted the primaries for Imo governorship election.\nAdvertisementThe APC national working committee (NWC) eventually cancelled the exercise after Nwosu was announced the winner."
  },
  {
    "headline": "Ahmed Gulak, Jonathan’s ex-aide, shot dead in Owerri",
    "summarized_story": "Ahmed Gulak, a chieftain of the All Progressives Congress (APC), has been killed by gunmen in Imo state.\nAdvertisementTheCable understands that the former aide of ex-President Goodluck Jonathan was shot dead by gunmen while returning to Abuja from Owerri, Imo state capital.\nHe once declared himself as the national chairman of the Peoples Democratic Party (PDP) during the party’s leadership crisis in January 2016.\nGulak was chairman of the APC committee that conducted the primaries for Imo governorship election.\nAdvertisementThe APC national working committee (NWC) eventually cancelled the exercise after Nwosu was announced the winner."
  },
  {
    "headline": "El-Rufai: States shouldn't pay salaries above their tax revenues",
    "summarized_story": "Nasir el-Rufai, governor of Kaduna, says states should not pay salaries that are above their tax revenues.\nAdvertisementThe governor has been at loggerheads with the Nigeria Labour Congress (NLC) over the state’s resolve to disengage 4,000 workers across the 23 LGAs.\nHe noted that no country can perform better without the right quality of skills in its public service.\n“Each state needs to set its minimum wage because the cost of living is different across the states.\n“We must ensure that we have the right fit and the right quality of skill in public service as a balance.”"
  },
  {
    "headline": "Nokia X20 Review – Dualsight Camera, 2-day battery life, and more",
    "summarized_story": "Early in April, HMD Global announced the launch of six new Nokia Android smartphones.\nIts major selling points include 3 years worth of Android updates from Nokia, cinema mode and dualsight camera, 2-day battery life and a large screen that allows you to watch virtually anything in full HD+.\nThe Nokia X20 retails for about $480.\nFinally, inside the box we have the following:The Nokia X20 : I mean, it would be extremely awkward if this was not in there.\nThe Look, The Feel, The HeftI will start by saying the Nokia X20 is a large phone."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "How GOtv Nigeria Built the Widest Coverage in Nigeria with Investments in Local Infrastructure",
    "summarized_story": "Nationwide digital terrestrial television operator GOtv has greatly contributed to Nigeria’s digital migration through eye-watering infrastructure investment.\nBut GOtv, launched by Details Nigeria in October 2011, has shown confidence in the local broadcast industry.\nThe company has since worked closely with the government and the Nigerian Communications Commission (NCC) in providing affordable digital television for everyone through unmatched investments in modern broadcast infrastructure.\nOver the years, GOtv has continued to invest heavily in the latest technology in digital television, especially on its transmission technology, which it has consistently improved upon.\nThese investments by GOtv in the local broadcast infrastructure and the expansion of its network coverage have come as the government-driven digital switchover programme (DSO) progresses in fits and starts."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "Crusader Sterling, ARM, Premium lead other PFAs in Fund II unit price",
    "summarized_story": "As of May 14, 2021, Crusader Sterling Pensions, ARM Pension Managers, Premium Pension, Stanbic IBTC Pension and NLPC led other Pension Fund Administrators (PFAs) in Unit Price of Fund II.\nA fund’s unit price is the price per each share in the fund.\nIn the data assessed by BusinessDay, Crusader Sterling Pensions led in unit price for this fund, having 5.6737, followed by ARM Pension Managers with 5.1754.\nPremium Pension followed suit with unit price of 5.1324; Stanbic IBTC Pensions 5.0383, while NLPC PFA had 5.0189 on the review date.\nPerformance also differs between one PFA and the other across the different funds, that is Fund I, Fund II, Fund III, Fund IV, among others."
  },
  {
    "headline": "22 years of democracy: Poverty, insecurity dealing deadly blow on Nigerians",
    "summarized_story": "Twenty-two years ago, on May 29, 1999, Nigeria returned to civil rule.\nMany Nigerians have grown weary of what appear to be empty claims of sterling performance that does not positively change their lives.\nThe latest report by World Poverty Clock has shown that more Nigerians have been plunged into extreme poverty since 2019.\nTwenty-two years after return to civil rule, Nigerians have grown farther apart, with many more people and ethnic nationalities clamouring for restructuring or outright secession.\nTwenty-two years after return to civil rule, there is actually no freedom of speech or association, as government harasses citizens and intimidates those who hold different opinions from them."
  },
  {
    "headline": "Constitution amendment: National Assembly faces tough task as distrust trails exercise",
    "summarized_story": "A fresh move toward the amendment of Nigeria’s 1999 Constitution began Wednesday, May 26, 2021 with the National Assembly conducting a two-day public hearing across the country.\nSome Nigerians have also made case for a brand-new document, saying that the current constitution must be discarded.\n“I do not support the amendment of the 1999 Constitution and I have doubts about this whole process.\nAfe Babalola, a senior advocate of Nigeria, saidamending the 1999 Constitution, as proposed, is a futile exercise.\nThe National Assembly has not delivered on that."
  },
  {
    "headline": "Resource Mobilisation Key in Promoting AYSRH Advocacy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestMembers of Advocacy Core Groups (ACGs) and Media Forum were on May 5 trained on key components ofResource Mobilisation.\nTaking participants on Introduction to Resource Mobilisation, with sub-topics on Resource Mobilisation and Organization Functions, sources and truths of resource mobilisation,Dr Emonena Bernard, pointed out that the delivery of services and products by an organization depends on a continual process of resource Mobilisation and supported by new business development by the organisation.\nHe listed resource Mobilisation sources to include members contribution, sale of goods and services for user fees, foundation contributions, government contracts, grants, national and international donors, amongst others.\n“Successful Resource Mobilisation requires a lot of work and takes a lot of time.\nHighpoint of the training was the distribution of a sample of an Organization Resource Mobilisation Plan, 2021-2023 to participants, and it included Projected Resource Needs for FP/AYSRH, 2021 to 2023, a three-year planning map."
  },
  {
    "headline": "Children’s day: Edo SUBEB to achieve global standard literacy, numeracy skill- chairman – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAUCHI : Dr. Joan Oviawe, the Executive Chairman, Edo State Universal Basic Education Board (SUBEB) said that the state is committed to achieve global standard literacy and numeracy skill in all Edo children.\nShe disclosed that the board had launched a campaign to make every child in the state a “Reading Champion”.\nThe Edo SUBEB chairman, said children are leaders of tommorrow and must be given special care and protection from parents, teachers and other members of the family.\n“Children’s day celebration also remind us about the rights of children which should be of general application to all children.\n“Our aim is that every Edo child should be able to read in primary one and urged parents to encourage their children on the reading culture."
  },
  {
    "headline": "The Nigerian OBSERVER @ 53: Challenges And Opportunities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Bendel Newspapers Company Limited (BNCL), publishers of the Observer Titles celebrates her 53 years of existence today.\nMr Aloba later became the pioneer General Manager of The Nigerian OBSERVER.\nToday, The Nigerian OBSERVER remains the longest surviving government owned newspaper in the country after series of re-launching and re-designing to meet industry standard.\nThe government of Delta State, on its part, set up Delta Printing Press on August 8, 1994 to produce a state owned newspaper.\nNevertheless, The OBSERVER Newspapers thrived in the face of challenges and competitions from privately owned newspapers, to emerge as the longest surviving government owned newspaper in the country."
  },
  {
    "headline": "The Buhari Administration @ 6: Presidency lists achievements – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Presidency says the Muhammadu Buhari administration is recording giant strides, enough to make Nigerians proud.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "Former adviser to Goodluck Jonathan reportedly shot dead in Owerri",
    "summarized_story": "ADVERTISEMENTA former political adviser to President Goodluck Jonathan, Ahmed Gulak, has reportedly been shot dead in Owerri, Imo State.\nThe paper said Umar Ardo, a chieftain of the Peoples Democratic Party (PDP) and personal friend of Mr Gulak, has confirmed the killing.\n“May Allah (SWT) forgive his sins, bless his soul and reward his good deeds with Aljannah on the Day of Resurrection.\nMay Allah (SWT) also give all his children, relatives, friends and loved ones, the fortitude to bear the irreparable loss.\nAnd may Allah (SWT) bless us with faithful deaths when it is our turn to die."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "APC chieftain, Ahmed Gulak shot dead in Imo",
    "summarized_story": "A chieftain of the All Progressive Congress (APC), Ahmed Gulak, has been killed by unknown gunmen in Imo state.\nGulak, a former aide of ex-President Goodluck Jonathan was shot dead by unknown gunmen while returning to Abuja from Owerri, Imo state capital.\nDetails later…"
  },
  {
    "headline": "Buhari happy Greenfield University students are home, safe – Presidency",
    "summarized_story": "OBINNA EZUGWUThe presidency has said President Muhammadu Buhari is relieved that the Greenfield University students freed on Saturday are now home safe, at the end of a 40-day ordeal.\nA statement by the presidency posted via its twitter handle @NGRPresident, also said Buhari condoles with the families of the students and staff that were killed by the abductors.\nFourteen of the 17 remaining abducted students and staff of the Kaduna based university were released earlier on Saturday at a location along the Kaduna- Abuja highway.\nOn April 23, the remains of three of the abducted students were found in Kwanan Bature village, a location close to the university.\nThe Kaduna State Government and the Federal Government have discouraged ransom payments to bandits."
  },
  {
    "headline": "Osun APC youth leaders rally support for Oyetola, dissociate from party ‘splinter group’",
    "summarized_story": "While staying clear from the party’so splinter group called “The Osun Progressive,” the youth leaders also declared their support for the APC caretaker chairman, Prince Gboyega Famodun saying they were pleased with his eadership style.\nThe meeting held on Friday, at the APC party Secretariat, Osogbo, had in attendance the, State Youth Leader, Senatorial Youth leaders, as well as all the local governments youth leaders and their assistants across the three Senatorial districts.\nAremo further explained that they endorsed Governor Oyetola to pilot the affairs of the state beyond 2022, owing to his performance which he described unprecedented.\nHe noted that despite the meagre resources, Oyetola had transformed the state beyond the expectations of the people of the state.\n“Governor Gboyega Oyetola has done tremendously well."
  },
  {
    "headline": "Governor Oyetola and the Chinese fable, by Charles Adeyemi",
    "summarized_story": "Governor Oyetola has not only fulfill his promise of paying full salaries, he has went further to approve minimum wage for all levels of Osun workforce, isn’t this a miracle?\nAt the end of their fact finding mission accross the country which includes but not limited to evaluation of Budget Preparation process, budget performance process, public procurement process, financial accounting process, auditing process and even revenue collection process.\nAnother project that played a key role in osun fiscal governance is SLOGOR (State and Local Governance Reform Project).\nGovernor Oyetola has repositioned the fiscal governance of osun than before.\nOsun couldn’t have Achieve so much with so little if not for financial mastery and prudence of the Governor."
  },
  {
    "headline": "Monday’s Sit-At-Home Order Sacrosant, IPOB Insists",
    "summarized_story": "IPOB media and publicity secretary, Comrade Emma Powerful, in a statement signed by him and made available to journalists made the disclosures on Saturday.\nHe said that there will be no human and vehicular movements throughout ‘Biafra land’ on Monday, May 31 in honour of people he called ‘Biafrans” during the Nigerian civil war.\nAccording to him, “Every person in Biafra land is, therefore, advised to observe a sit-at-home order on Monday, 31st May 2021.\n“Everyone is to remain indoors in Biafra land from 6:00am to 6:00pm on that day.\nComrade Powerful warned that, anyone violating the sit-at-home order should blame himself for whatever fate that befalls such person as penalty for stubbornness."
  },
  {
    "headline": "Monday’s Sit-At-Home Order Sacrosant, IPOB Insists",
    "summarized_story": "IPOB media and publicity secretary, Comrade Emma Powerful, in a statement signed by him and made available to journalists made the disclosures on Saturday.\nHe said that there will be no human and vehicular movements throughout ‘Biafra land’ on Monday, May 31 in honour of people he called ‘Biafrans” during the Nigerian civil war.\nAccording to him, “Every person in Biafra land is, therefore, advised to observe a sit-at-home order on Monday, 31st May 2021.\n“Everyone is to remain indoors in Biafra land from 6:00am to 6:00pm on that day.\nComrade Powerful warned that, anyone violating the sit-at-home order should blame himself for whatever fate that befalls such person as penalty for stubbornness."
  },
  {
    "headline": "BREAKING: Gunmen Kidnap Nasarawa Assembly Member, Demand N100m",
    "summarized_story": "A member of the Nasarawa State House Assembly (NSHA) representing Nasarawa Central State Constituency, Hon.\nAn eyewitness said Danbaba was kidnapped on Saturday evening while traveling to Jos, Plateau State, to attend an official function.\nLEADERSHIP reports that the kidnapped Member, Hon.\nDanbaba, was elected in 2020 on the platform of APC through a bye-election to represent Nasarawa Central State Constituency.\nADVERTISEMENTMeanwhile, LEADERSHIP gathered that the kidnappers have called some colleagues and relations of the victim to demand for N100m ransom."
  },
  {
    "headline": "BREAKING: Gunmen Kidnap Nasarawa Assembly Member, Demand N100m",
    "summarized_story": "A member of the Nasarawa State House Assembly (NSHA) representing Nasarawa Central State Constituency, Hon.\nAn eyewitness said Danbaba was kidnapped on Saturday evening while traveling to Jos, Plateau State, to attend an official function.\nLEADERSHIP reports that the kidnapped Member, Hon.\nDanbaba, was elected in 2020 on the platform of APC through a bye-election to represent Nasarawa Central State Constituency.\nADVERTISEMENTMeanwhile, LEADERSHIP gathered that the kidnappers have called some colleagues and relations of the victim to demand for N100m ransom."
  },
  {
    "headline": "BREAKING: Ahmed Gulak Shot Dead In Owerri",
    "summarized_story": "Gulak, an All Progressives Congress (APC) chieftain, was killed in Owerri, Imo State capital on Saturday night.\n“Barr Gulak was said to have been killed last night by unknown gunmen in Owerri, Imo State.\n“May Allah (SWT) forgive his sins, bless his soul and reward his good deeds with Aljannah on the Day of Resurrection.\nMay Allah (SWT) also give all his children, relatives, friends and loved ones, the fortitude to bear the irreparable loss.\nAnd may Allah (SWT) bless us with faithful deaths when it is our turn to die."
  },
  {
    "headline": "Biafra: Nnamdi Kanu is your son, discuss with him – Ohanaeze chieftain tells Buhari",
    "summarized_story": "A chieftain of the Igbo socio-political organisation, Ohanaeze Ndigbo, Chuks Ibegbu, has called on President Muhammadu Buhari to engage Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, Islamic Movement in Nigeria, IMN, and other agitators in a roundtable discussion.\nIbegbu said Kanu would put an end to his agitations if Buhari calls him to a father-son discussion.\nAccording to Ibegbu: “Buhari does not want to sit and talk to agitators.\nInstead of using the police and army to fight your home citizens and killing them, call them to a round table discussion.\n“Buhari should call Nnamdi Kanu saying look “you are my son what is your problem?"
  },
  {
    "headline": "IPOB killed Ahmed Gulak over Nnamdi Kanu’s sit-at-home order – Nigeria intelligence services",
    "summarized_story": "Nigeria intelligence community have linked the assassination of former political adviser to ex-President Goodluck Jonathan, Ahmed Gulak, to the Indigenous People of Biafra (IPOB).\nSecurity agencies have repeatedly linked the ESN to the killing of security personnel and destruction of government facilities in South-East and South-South States.\nThe officer disclosed they intercepted communication and saw videos where Kanu threatened anyone who fails to observe his sit-at-home order from May 29 to May 31 will die.\nThe IPOB leader warned that the order is compulsory and must be obeyed South-East people.\non the 29th, there will be no movement, this is not sit-at-home but no movement."
  },
  {
    "headline": "Serial Rapist bags 1,088 years in prison in Pretoria",
    "summarized_story": "33-year-old Sello Abram Mapunya has been sentenced to 1,088 years in prison by a Pretoria high court on Thursday May 27, after he raped and robbed 56 women across Pretoria for five years.\nMapunya who committed the crime while he lived with his girlfriend, eight-year-old son and four-year-old daughter in Pretoria, attacked women in Tshwane’s suburbs of Nellmapius, Mamelodi, Silverton, Olievenhoutbosch and Atteridgeville.\nHis youngest victim was 14.\nHe sentenced Mapunya to life terms for molesting his teenage victim and three other women who he raped multiple times.\nHis youngest victim, Refilwe Selamolela who is now 19 and agreed to be identified, said she had spent years asking herself why men raped and hurt women."
  },
  {
    "headline": "President Buhari set to depart Abuja to Ghana for emergency ECOWAS summit",
    "summarized_story": "President Muhammadu Buhari is expected to fly out of Abuja on Sunday for Accra, Ghana, where he will attend an emergency Extraordinary Summit of ECOWAS.\nThe summit has been convened to discuss recent political developments in Mali.\nA statement issued by Buhari’s Special Adviser to the President on Media and Publicity, Femi Adesina, noted the meeting was at the instance of the Chairman of the Authority of Heads of State and Government of ECOWAS and President of Ghana, Nana Akufo-Addo.\nREAD ALSO: Police arrest 4 over illegal possession of pistol..\nIt read: “As the situation in Mali continues to evolve, Nigeria had condemned the May 24 military coup, the subsequent detention of the president and prime minister by soldiers, and called for the immediate and unconditional release of all civilian officials detained.”President Buhari will be accompanied by the Minister of Foreign Affairs, Geoffrey Onyeama, Minister of Defence, Maj. Gen. Bashir Salihi Magashi (rtd), Minister of Industry, Trade and Investment, Otunba Richard Adebayo, and Director-General of National Intelligence Agency (NIA), Ahmed Rufai Abubakar."
  },
  {
    "headline": "Army dismisses 3,040 soldiers for desertion, murder, rape, drunkenness, others",
    "summarized_story": "THE Nigerian Army has dismissed no fewer than 3,040 soldiers from service for various acts of misconduct, and indiscipline, including desertion, possession of hard drugs, rape and murder.\nThe names of the personnel were contained in a 90-page document titled, ‘List of soldiers dismissed from the Nigerian Army,’ obtained by our correspondent in Abuja on Friday.\nOver 1,000 soldiers were discharged for AWOL (Away Without Leave), while hundreds others were sacked for desertion.\nMaj Gen Danjumma Ali-Keffi, General Officer Commanding 1 Division Nigeria Army Kaduna, made the remarks during the passing out of 80 regular recruit intakes at the Depot Nigerian Army Zaria on Saturday.\n“It is noteworthy that as you pass out today, the strength of the Nigerian Army has been enhanced by 6,400 able-bodied men and women,” he said."
  },
  {
    "headline": "Army dismisses 3,040 soldiers for desertion, murder, rape, drunkenness, others",
    "summarized_story": "THE Nigerian Army has dismissed no fewer than 3,040 soldiers from service for various acts of misconduct, and indiscipline, including desertion, possession of hard drugs, rape and murder.\nThe names of the personnel were contained in a 90-page document titled, ‘List of soldiers dismissed from the Nigerian Army,’ obtained by our correspondent in Abuja on Friday.\nOver 1,000 soldiers were discharged for AWOL (Away Without Leave), while hundreds others were sacked for desertion.\nMaj Gen Danjumma Ali-Keffi, General Officer Commanding 1 Division Nigeria Army Kaduna, made the remarks during the passing out of 80 regular recruit intakes at the Depot Nigerian Army Zaria on Saturday.\n“It is noteworthy that as you pass out today, the strength of the Nigerian Army has been enhanced by 6,400 able-bodied men and women,” he said."
  },
  {
    "headline": "Fresh attack: Four killed as gunmen raze Imo police station",
    "summarized_story": "Gunmen on Saturday night torched the Izombe Divisional Police Headquarters located in the Oguta Local Government Area of Imo State.\nThe latest attack came just 24 hours after fleeing hoodlums razed a police station, Magistrate and High Courts, and vandalised a health centre in Atta community in the Njaba Local Government Area of the state.\nThough they succeeded in setting it ablaze, four of the invaders were killed, according to the police spokesperson in the state, Bala Elkana.\nFour hoodlums were neutralised during the attack while others escaped with bullet wounds.\n“The Commissioner of Police, Imo State, CP Abutu Yaro, commended the men for their abiding faith in defence of the public space and urged them to be resilient in this fight until the enemies of the people are totally defeated."
  },
  {
    "headline": "Fresh attack: Four killed as gunmen raze Imo police station",
    "summarized_story": "Gunmen on Saturday night torched the Izombe Divisional Police Headquarters located in the Oguta Local Government Area of Imo State.\nThe latest attack came just 24 hours after fleeing hoodlums razed a police station, Magistrate and High Courts, and vandalised a health centre in Atta community in the Njaba Local Government Area of the state.\nThough they succeeded in setting it ablaze, four of the invaders were killed, according to the police spokesperson in the state, Bala Elkana.\nFour hoodlums were neutralised during the attack while others escaped with bullet wounds.\n“The Commissioner of Police, Imo State, CP Abutu Yaro, commended the men for their abiding faith in defence of the public space and urged them to be resilient in this fight until the enemies of the people are totally defeated."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "52 Nigerians hit with severe reactions after taking AstraZeneca vaccine",
    "summarized_story": "By Kazeem UgbodagaThe National Primary Health Care Development Agency, NPHCDA, on Friday disclosed that 52 Nigerians have experienced moderate to severe reactions after taking the AstraZeneca vaccine.\nExecutive Director and Chief Executive Officer, NPHCDA, Dr. Faisal Shuaib disclosed this at a news conference in Abuja.\nHe also said 8,439 Nigerians experienced mild Adverse events following immunization (AEFI) after taking the vaccine.\n“Similarly, 52 cases of moderate to severe incidents of AEFI have been reported.\nAccording to Shuaib, as of today, April 16th, 1,071,346, representing 53.2% of the eligible persons targeted with the AstraZeneca vaccine had been administered their first dose in this vaccination phase."
  },
  {
    "headline": "Nigeria’s President Buhari Wins 2021 All-Africa Award For Performance",
    "summarized_story": "The selection committee comprises media representatives from the five regions of the continent who rely on media reports and experts on road networks, transport, and sustainable development.\nAccording to a statement from the African Development Bank (AfDB) on Friday, Buhari was named winner during the inaugural Africa Road Builders Conference held on March 31 in Cairo, Egypt.\nThe selection committee, however, cited Nigeria’s efforts to improve road safety and air quality for road users.\nThe award was created in honour of Babacar Ndiaye, President of the AfDB Group from 1985 to 1995.\nEach year, the Africa Road Builders selection committee carefully evaluates ambitious and tangible projects that have a real impact on the mobility of people in Africa."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Assassinate Ex-PDP National Chairman, Ahmed Gulak In Owerri",
    "summarized_story": "A former special adviser to ex-president Goodluck Jonathan on Political Matters, Ahmed Gulak has been reportedly killed by Unknown Gunmen in Owerri.\nNEWS DIRECT reports that Gulak was shot dead while returning to Abuja from Owerri, Imo state.\nGulak’s daughter took to Twitter to announce the death of her father who had just died.\nIn her tweet, she wrote: “I just lost my dad please put him in your Dua.\nAllaahummaghfir li (Ahmed Ali Gulak) warfa’ darajatahu fil-mahdiyyeena, wakhlufhu fee ‘aqibihi fil-ghaabireena , waghfir-lanaa wa lahu yaa Rabbal-‘aalameena, wafsah lahu fee qabrihi wa nawwir lahu feehi”More details later…"
  },
  {
    "headline": "How We Paid N180m Ransom, Bought Motorcycles — Parents Of Abducted Greenfield Students",
    "summarized_story": "Remember that the robbers who kidnapped the students sought N100 million in ransom as well as ten new bikes.\nThis comes after robbers assassinated five pupils after their parents failed to acquire the N800 million ransom demanded by the captors.\nThe bandits, however, reduced the ransom to N100m and 10 motorcycles and later asked the parents to pay N10m for each victim.\nAccording to Punch, reliable sources disclosed that the parents paid the ransom and bought eight brand new motorcycles to the bandits before the students regained their freedom.\nHe said, “We paid ransom before they were released."
  },
  {
    "headline": "VIDEO: Watch as parents reveal how much they paid bandits before kidnapped students, staff of Greenfield University regained freedom",
    "summarized_story": "NextSuper Tucano: NASS members assess progress of work in USA, 6 for delivery in July"
  },
  {
    "headline": "Breaking: Fire wrecks havoc inside popular Lagos market",
    "summarized_story": "Fire on Sunday morning gutted popular Ladipo market in Lagos state.\nAlready, officials of the state fire service battling to the fire at Alapeju part of the market.\nThe spokesman of the state fire service, Amodu Shuabu, who confirmed the incident , said efforts were in place to put out the raging inferno.\nIn August, similar fire incident destroyed goods within same market place.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Government behind us, bandits tell parents of kidnapped students of Greenfield University",
    "summarized_story": "The 16 abducted students and staff of Greenfield University, Kasarami, Chikun local government of Kaduna state have been released after 39 days in captivity.\nBandits stormed Greenfield University on April 20th, 2021 killing a gateman for attempting to shut the game against them, before kidnapping 19 students and three female staff of the university.\nFive of the students were later killed by the bandits, before parents of one of them paid some ransom to secure his freedom.\nOne of the abducted but freed staff, Mrs Bassey expressed appreciation to God that they were returned safely and reunited with their families.\nWe will take that decision later.”Also speaking, Mr Chukwuemeka Lawrence, husband to one of the freed staff, said, “we paid ransom before they were released."
  },
  {
    "headline": "NAF to take delivery of six A-29 Super Tucano in July – NigPilot",
    "summarized_story": "Director of Public Relations and InformationNigerian Air Force, Air Commodore Edward Gabkwet made this disclosure in a statement in Abuja.\nSpecifically, members of the joint committee are in the USA to assess the status and progress of work on the NAF A-29 Super Tucano aircraft.\nOn arrival at EDSI on 27 May 2021, the NASS team led by Senator Michael Nnachi, was briefed on the progress of work on the NAF A-29 Super Tucano programme and the scheduled date of delivery.\nSenator Michael Nnachi commended EDSI for the quality of work on the NAF A-29 Super Tucano.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Aliyu laments the effect of COVID-19 on children – NigPilot",
    "summarized_story": "Federal Capital Territory Minister of State, Dr. Ramatu Tijjani Aliyu, has stated that the costs of the COVID-19 pandemic for children are immediate but warned that if unaddressed, it may last a lifetime.\nAliyu noted that the Children’s Day celebration offers an inspirational entry-point to advocate, promote and celebrate children’s rights, translating into dialogues and actions that would build a better world for the children, she, however, regretted that the COVID-19 crisis has resulted in a child rights crisis.\nWhile commending the theme: “Effect of COVID-19 pandemic on the total well-being of Nigerian Child: The way forward”, she however noted that the COVID-19 has affected lives and homes in so many ways; some children have lost their parents, just as the nation’s economy has been drastically affected.\nSecretary FCT Social Development Secretariat, Dr. Kelvin Ike, commended the FCT Minister of State for reviving the FCT Children’s Day celebration despite the challenges.\nOther activities according to him include FCT Children’s parliament election, inauguration and summit, essay writing and poem recitation competitions among selected Primary, Junior and Senior Secondary school levels and cultural dance competition."
  },
  {
    "headline": "The emergence of vaccines has not stopped the spread of COVID-19 – NigPilot",
    "summarized_story": "Sidie Mohamed Tunis has expressed worries over the surge in covid-19 infection despite the discovery of the covid vaccine, saying that the emergence of vaccines has not stopped the spread of the virus.\nHon Tunis who said this in Abuja also observed that new infections are being reported and newer strains are being discovered.\n“The emergence of vaccines has not stopped the spread of the virus.\nNew infections are being reported and newer strains are being discovered.\n“Although vaccines are a powerful weapon against COVID-19, they are not the only tool."
  },
  {
    "headline": "ECOWAS Parliament talks tough on Mali coup",
    "summarized_story": "The Community Parliament of the Economic State of West African States (ECOWAS), has taken a tough stance on the military intervention in Mali.\nThe speaker of ECOWAS Parliament, Rt.\nSidie Mohamed Tunis said this at the ongoing 2021 Ordinary Session of ECOWAS Parliament holding in Abuja, the Nigerian Capital.\nI wish to emphasize that the ECOWAS Parliament condemns, in the strongest terms, the military take over in Mali and all acts in the region that threatens or stalls the process of entrenching Democracy across our States.\nThe Speaker added that the ECOWAS Parliament stands ready to support all efforts aimed at putting Mali on the right trajectory of peace and democracy."
  },
  {
    "headline": "Army Vows To Crush Boko Haram, IPOB",
    "summarized_story": "The Nigerian Army has reiterated its commitment to riding the country of criminal elements and has vowed to crush Boko Haram terrorists and members of the banned Indigenous Peoples of Biafra (IPOB).\nNigeria’s Chief of Army Staff (COAS) Major General Faruk Yahaya stated this on Saturday during the passing out parade of the 80 regular recruits intake at the Nigerian Army Depot, Zaria in Kaduna State.\nREAD ALSO: Seven IPOB Members Killed In Rivers – Army SpokespersonOn Saturday, the Nigerian Army had raided a Boko Haram logistics base in Guibja, Yobe State.\nThe camp was promptly destroyed while suspects and corpses were handed over to the Police for further actions,” it explained.\nA Nigerian court has outlawed IPOB and the Federal Government has designated the group as terrorists."
  },
  {
    "headline": "Gunmen Kill Jonathan’s Former Aide, Gulak",
    "summarized_story": "Gunmen have killed a chieftain of the All Progressives Congress (APC) Ahmed Gulak in Umueze-Obiangwu community along Sam Mbakwe Airport road in Owerri, Imo state.\nSources told Channels Television that Gulak who was a former aide to ex-President Goodluck Jonathan was heading to the airport when the assailants attacked him and shot him on the spot.\nGulak was trailed from his hotel room to the spot where he was killed.\nThe Police Public Relations Officer of the Imo Police Command Bala Elkana told Channels Television that he is yet to be briefed on the incident.\nDetails later…"
  },
  {
    "headline": "14 Abducted Greenfield University Students, Staff Released",
    "summarized_story": "﻿Chimezie Enyiocha, KadunaSome 14 abducted students and staff of Greenfield University in Kaduna State have been released, Channels Television can report.\nOn April 23, the remains of three of the abducted students were found in Kwanan Bature village, a location close to the university.\nIn a statement on May 5, President Muhammadu Buhari appealed for “the release of the students of the Greenfield University.”Parents, Police Face-OffThe students release comes 40 days after they were abducted.\nThe released hostages comprised of students and staff of Greenfield University, the statement said.\n“Governor Nasir El-Rufai welcomed the news of the students’ release, and conveyed solace and encouragement to them following their harrowing ordeal."
  },
  {
    "headline": "Gunmen Set Ablaze Courts, Police Station In Imo Community",
    "summarized_story": "Eyitope Kuteyi, OwerriGunmen have razed down a magistrate court, high court and a divisional police station in Atta community, Njaba local government area of Imo State.\nThe attack was accompanied by long hours of sporadic gunshots in the community, generating panic among residents.\nCommunity members said they noticed that the courts and police station had been set ablaze on Saturday morning.\nMajor streets in Owerri, the Imo State capital, recorded very low vehicular and human movement, as of Saturday morning.\nMarkets and businesses have also been mostly shut as Imo state residents fear an outbreak of violence."
  },
  {
    "headline": "Nasarawa Lawmaker Kidnapped In Kaduna",
    "summarized_story": "A member of the Nasarawa State House of Assembly Ismail Danbaba has been kidnaped.\nDanbaba who represents Nasarawa Central constituency was kidnapped on Saturday evening along Sanga forest in Sanga Local Government Area of Kaduna State.\nThe lawmaker was on his way to the Plateau State capital, Jos for a workshop.\nOn Saturday, 14 students and staff of the Greenfield University in Kaduna were released by their abductors after a 40-day ordeal.\nREAD ALSO: Three Abducted Greenfield University Students Found DeadBandits had on April 20 stormed the educational institution, and abducted the students and staff."
  },
  {
    "headline": "Gunmen abduct Nasarawa Assembly member, Ismail Danbaba",
    "summarized_story": "A member of the Nasarawa State House of Assembly representing Nasarawa Central State Constituency Ismail Danbaba has been kidnapped.\nThe lawmaker was abducted on Saturday evening while on an official trip to Jos, plateau state.\nThe operation took place at the forest in Sanga local government area of Kaduna state.\nChairman , the State House Assembly committee on information, Mohammed Adamu Omadefu confirmed the in incident to journalists in Lafia.\nThe kidnapped Member was said to have passed Andaha in Akwanga local government area of Nasarawa State, heading to the forest area in Sanga local government area of Kaduna state when the kidnappers ambushed him and whisked him away."
  },
  {
    "headline": "Ahmed Gulak shot dead at Airport in Owerri",
    "summarized_story": "Ahmed Gulak, resident Goodluck Jonathan’s former Special Adviser on Politics, has been shot dead in Owerri, Imo state, by unknown gunmen.\nReport say Gulak was on his way to Abuja from Owerri when he was killed Saturday night.\nHe served as the Honourable Speaker of the Adamawa State House of Assembly, as well as the Vice President’s Senior Special Assistant and President Goodluck Jonathan’s Special Political Adviser."
  },
  {
    "headline": "Champions League Final: Havertz, Kante Key in Chelsea Victory against Man City",
    "summarized_story": "Pep has thought ‘I don’t need a holding midfielder in the centre’ because Chelsea play with two men on the outside in Mason Mount and Kai Havertz behind Timo Werner.\nDown the middle, N’Golo Kante was breaking play up so well too, pinching things and stopping City from building any momentum with their passing.\nThat was it, while Chelsea kept getting behind City, and had plenty of other opportunities before and after their goal.\nHe will get some criticism now about changing a winning style because City lost, and are still waiting for their first Champions League triumph.\nCity have come a long way, and this was their first Champions League final."
  },
  {
    "headline": "Champions League: Tuchel’s Masterclass Leaves Guardiola in Despair",
    "summarized_story": "As it has done with Tuchel winning the Champions League after replacing Frank Lampard in January, and as it did when Roberto Di Matteo replaced Andre Villas-Boas in 2012 and won this tournament for the first time.\nHe suffered the pain of defeat in last season’s Champions League final.\nWhat a contrast it was to the despair of Guardiola and Manchester City, who will leave Porto accompanied by bitter disappointment and regrets after a night in which they failed to produce the goods.\nTuchel has now beaten Guardiola three times since he was appointed in January, in the FA Cup semi-final and in the Premier League at Etihad Stadium.\nFor Guardiola and Manchester City, the wait goes on."
  },
  {
    "headline": "End of Netanyahu Era Could Be in the Cards in Israeli Political Drama",
    "summarized_story": "Israel was gripped by political drama on Sunday over the possibly imminent end of Prime Minister Benjamin Netanyahu’s record run as the country’s leader.\nLapid’s chances of success rest largely with far-right politician Naftali Bennett, a kingmaker whose Yamina party has six key seats in parliament.\nBennett has maintained public silence in recent days, with Likud party chief Netanyahu fuelling speculation his own tenure was about to end in a tweet and video on Friday.\nA former defence minister, Bennett has reversed course before over ousting Netanyahu, 71, a right-wing leader in power consecutively since 2009 and now on trial on corruption charges that he denies.\n“The anti-Prime Minister Benjamin Netanyahu government of change is still not an accomplished fact,” political columnist Yossi Verter wrote in the left-wing Haaretz newspaper on Sunday."
  },
  {
    "headline": "Russia Confirms $500m Loan for Belarus as West Toughens Sanctions",
    "summarized_story": "Russia has agreed to release a second $500m loan to Belarus as Moscow stepped up its support for Belarusian President Alexander Lukashenko amid outrage in the West about the grounding of a European passenger plane and the arrest of a dissident journalist.\nThe money is part of a $1.5bn loan that Russia promised Belarus as part of Moscow’s efforts to stabilise its neighbour after mass protests broke out against Lukashenko’s nearly three-decade rule last year.\nRussia also pledged to consider increasing flights with Belarus to offset the effect of the EU’s flight bans, according to Kremlin spokesman Dmitry Peskov.\n“On the initiative of the Russian president, the topic of the Russian citizen, who was detained, was raised … Naturally, we are not indifferent to her fate,” Peskov was cited as saying.\nThe president has instructed the Russian Foreign Ministry to follow the Russian citizen case with the utmost attention,” Peskov added."
  },
  {
    "headline": "Mali Coup Leader in Ghana for ECOWAS Crisis Talks",
    "summarized_story": "Colonel Assimi Goita, Mali’s coup leader and newly appointed interim president, has been summoned to an emergency meeting of West African leaders in Ghana.\nAt Sunday’s extraordinary summit, the 15-member Economic Community of West African States (ECOWAS) is set to discuss how to deal with Mali’s second coup in nine months.\nGoita left Bamako for Ghana’s capital, Accra, on Saturday after receiving an ECOWAS letter asking for “consultations”, according to the AFP news agency.\nThen the constitutional court – contravening a joint declaration issued following talks in the wake of last August’s coup – named Goita as Mali’s new transitional president.\nThe declaration, reached between ECOWAS and Mali’s civil and military leaders, said the vice president of the transition “cannot under any circumstances replace the president”."
  }
]