[
  {
    "headline": "Pictorial: Women protest rejected bills at National Assembly gate",
    "summarized_story": "Nigerian women on Wednesday stormed the National Assembly gate in their numbers to express their grievance over the rejection of women-related bills.\nDuring the plenary session on Tuesday, a bill seeking to give at least ten slots to women as ministers and commissioners in the federal and state governments failed at the upper legislative chamber.\nSee photos of protesters below:Photo: Solomon OdeniyiCopyright PUNCH.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Hard drugs, energy drinks can ruin academic careers, Ondo warns students",
    "summarized_story": "The Ondo State Committee on Drug Control on Wednesday cautioned students against consuming energy drinks and other illicit substances.\nOmotiba added that drug abuse has negative effects on students’ academic careers, asking them to avoid any gathering that could lure them into drug abuse.\nHe added that the increase in the crime rate in society was largely due to high level of drug abuse among the youths.\nRead Also 200 Ondo students receive solar energy trainingJeyifous, therefore, advised the students to set standards for themselves, so as to maintain a healthy lifestyle and determine who to relate with.\nHe pledged to inaugurate a Drug-Free Club in the school to spearhead the campaign against drug abuse among the students."
  },
  {
    "headline": "MC Oluomo replies NURTW’s query, denies wrongdoing",
    "summarized_story": "The Lagos State Chairman of the National Union of Road Transport Workers, Musiliu Akinsanya, aka MC Oluomo, has refuted claims of engaging in acts of insubordination and anti-union activities in the state.\nAkinsanya responded to the query in a letter he personally signed on February 25, 2022, a copy of which was obtained by our correspondent on Tuesday.\nAs a trustee, he has the right of entry to the state secretariat and has never been denied that right to my knowledge.\n“There is, therefore, no former state secretariat to hand over as same is contractually obligated to the Amalgamated Mega-City Transport Limited to his knowledge and our knowledge,” he said.\n“It was never to create rivalry and/or disharmony and until now, the peace that we have in Lagos State, was never experienced by previous administrations."
  },
  {
    "headline": "Buhari rejects APC govs plea to dump Adamu as preferred nat’l chair",
    "summarized_story": "The APC governors on the platform of Progressive Governors Forum, PGF, met with the president at the Presidential Villa, Abuja, shortly before he departed for Kenya.\nThis came as the South-East geopolitical zone has lost out in its bid to produce the national secretary of the party in the forthcoming national convention.\nThe governors were led to the meeting with the President by the chairman of the PGF and governor of Kebbi State, Atiku Bagudu.\nIt was gathered that the chairman of the APC Extraordinary Convention Planning Committee, CECPC, and Yobe State governor, Mai Mala Buni, was also absent at the meeting.\nOn the necessity for the yesterday meeting, Bagudu explained: “Today (Tuesday), March 1, a number of APC governors came to Mr. President to, among others, congratulate him on signing the Electoral Act."
  },
  {
    "headline": "FG under pressure over rising foreign debts —Finance Minister",
    "summarized_story": "Zainab AhmedSets up task force on Donor-Funded Projects disbursementBy Emma Ujah, Abuja Bureau ChiefPublic agitations against rising foreign debts have put pressure on the Federal Government to ensure prudent utilisation of foreign loans, even as it has set up a task force on disbursement on Donor-Funded Projects.\nMinister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, said this while addressing members of the federal legislature at a retreat in Lagos, yesterday.\nHer words: “It is public knowledge that there have been increased public agitations against rising foreign debts levels.\nAccording to her, “the Term of Reference (ToR) of the task force is to evaluate, review and chart a fresh course to significantly increase disbursement levels in donor-financed projects in the country.\n“It is to also work with relevant stakeholders to facilitate various approval processes for donor-assisted projects before final approval from the National Assembly.”"
  },
  {
    "headline": "Why I don’t want to see my mother — Libya returnee",
    "summarized_story": "The Libya returnees arriving.\nBy Bose Adelaja, LagosA Libya returnee, Miss Tosin Omole, has narrated how she left her three months old son in her mother’s care and headed for Europe, only to find herself in prostitution business in Libya.\nIn an emotional voice, she said her mother was approached by a lady in same street as her family, who sweet-talked her mother into convince her (Tosin) to embark on the journey so she could take care of her mother.\n“I had to obey my mother and embark on the journey, when the pressure became unbearable.\n“My trafficker paid for the journey from Nigeria to Libya, which started on February 26, 2016."
  },
  {
    "headline": "Senate, House of Reps reject VAT on Exclusive List",
    "summarized_story": "They separately also shut down the provision for immunity and life pension for principal officers of the National Assembly.\nThe Senate also moved the Railway from the Exclusive Legislative List to Concurrent Legislative List, even as a Bill on devolution of powers to move Airports from Exclusive Legislative List to the Concurrent Legislative List and for Related Matters was passed.\nValue Added Tax failed to make exclusive listThe House also refused to make VAT an exclusive concern of the Federal Government.\nTo Provide for the Financial Independence of State House of Assembly and State Judiciary; and for Related Matters.\n*To move fingerprints, identification and criminal records from the Exclusive Legislative List to the Concurrent Legislative List; and for Related Matters."
  },
  {
    "headline": "Unidentified couple found dead in abandoned car",
    "summarized_story": ""
  },
  {
    "headline": "Northern group decries rising cement prices",
    "summarized_story": "The Northern Youth Council of Nigeria (NYCN) has expressed concern with the continued increase in the price of cement in the country.\nThe youths observed that the continued increase in the commodity is meant to ensure that poor Nigerians are turned into destitutes in their own country.\nComrade Isah Abubakar, President of the council, stated that the group received the news of the declaration of over N500 billion profit before tax and over N350 billion profit after tax by Dangote Cement with mixed feelings.\nIt added that the declared amount is a sad reminder of how Nigerians and Nigeria are being ripped and raped by a monopolist that enjoys government protection and patronage.\n“Looking inward, Northern Nigeria where Dangote hails from has a larger chunk of this poverty and other frightening negative economic and social variables,” the statement further lamented."
  },
  {
    "headline": "Obasanjo visits Olubadan-designate, Lekan Balogun",
    "summarized_story": "Former President, Chief Olusegun Obasanjo, has paid a courtesy visit to the residence of the Olubadan designate, Dr Lekan Balogun.\nDAILY POST gathered on Wednesday that Obasanjo visited Balogun on Tuesday.\nObasanjo was accompanied to the Alarere residence of the Olubadan designate by a former Chairman of Ibadan North-East Local Government area of Oyo State, Mr Gbenga Adewusi.\nDAILY POST learnt that Obasanjo joined Balogun at dining on his arrival.\nOur correspondent gathered that Obasanjo was in Ibadan to congratulate Balogun on his nomination as the next Olubadan."
  },
  {
    "headline": "Fuel scarcity: Residents accuse marketers of diverting, hoarding petrol in Kaduna",
    "summarized_story": "Kaduna residents queuing for petrol at different filling stations across the metropolis have raised suspicions that marketers are diverting and hoarding the product.\nThe motorists expressed displeasure at some filling stations that got a supply of fuel, served a few vehicles, only to tell others that fuel is finished.\n“I was amazed when I heard that, a particular filling station is about to offload fuel.\nHe called on the authority to always check the excesses of some filling stations in the state.\nHowever, some filling station managers in the state denied hoarding/diverting fuel during an interview with DAILYPOST on Tuesday."
  },
  {
    "headline": "Constitution review: Don’t allow corrupt governors sabotage LG autonomy bill – HURIWA tells Senate",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has urged the National Assembly to ensure that corrupt governors do not sabotage the bill granting Local Government financial autonomy.\nThe rights group also carpeted the National Assembly for voting out pro-women provisions in the constitution review.\nHURIWA hailed the 9th Senate for passing the bill to grant financial and administrative autonomy to all the 774 local government areas of the country.\nFor administrative autonomy, the bill seeks to allow local governments to conduct their own elections.\n“Undoubtedly, viable local governments have the inevitable potential of creating jobs for school leavers and graduates to serve their communities and grow their local economies."
  },
  {
    "headline": "Pantami, NCC boss, Danbatta lead Nigerian delegation to MWC 2022",
    "summarized_story": "The Minister of Communications and Digital Economy, Prof. Isa Ali Ibrahim Pantami, accompanied by the Executive Vice Chairman and Chief Executive Officer (EVC/CEO) of the Nigerian Communications Commission (NCC), Prof. Umar Danbatta, is leading the Nigerian delegation to the ongoing Mobile World Congress (MWC) 2022.\nThe Mobile World Congress, the most influential conference and exhibition of stakeholders in mobile technology, innovation and connectivity, is taking place in Barcelona from February 28 to March 3, 2022.\nThe Nigerian delegation is scheduled to participate in at least 33 sessions during MWC, organised by Global System for Mobile Communications Association (GSMA).\nOn March 2, 2022, the Nigerian delegation will meet a United States (US) delegation to discuss collaboration on telecommunications and related ICT issues.\nThe Nigerian delegation will also engage the exhibition by Huawei Technologies as well as chat with the company’s senior executive management."
  },
  {
    "headline": "BREAKING: Ondo students block Ibadan-Akure-Abuja highway",
    "summarized_story": "Tertiary institution students in Ondo State under the auspices of the National Association of University Students (NAUS) on Wednesday blocked the busy Ibadan-Akure-Abuja highway in protest over the ongoing strike action by the Academic Staff Union of Universities (ASUU).\nThe blockade caused heavy vehicular traffic along the highway as many heavy duty trucks and passengers bus going to and fro Abuja, Lagos or Benin were stranded.\nMotorists travelling to nearby communities along the highway resorted to taking alternative untarred route.\nEsedere stated that students should not be made to suffer for any problem between ASUU and the Federal Government.\nVice Chairman of NAUS, Ondo State chapter, Shittu Folarin, said the students want to ensure this would be the last action by ASUU."
  },
  {
    "headline": "BREAKING: Protesters block NASS gate over rejected women Bills",
    "summarized_story": "Various women groups have blocked the Federal Secretariat axis entrance of the National Assembly to protest the outcome of the voting on constitutional amendment.\nThey were not allowed access into the National Assembly by security agents.\nDuring the voting in the National Assembly on Monday, the Bills promoting the interest of women were thrown out.\nRead Also: Group urges implementation of rights bill to protect women, girlsThe women insisted they would not leave until they meet the leadership of the National Assembly.\nAs of the time of filing this report the gates to the National Assembly were still blocked."
  },
  {
    "headline": "21 killed, scores injured in Kharkiv attack, says Gov",
    "summarized_story": "No fewer than 21 persons were killed with 112 wounded when Russian troops shelled Kharkiv city on Wednesday.\nCNN quoted Kharkiv Governor as saying the casualties were getting worse in the war that reached the seventh day."
  },
  {
    "headline": "Buhari turns down governors’ plea to drop Adamu",
    "summarized_story": "President Muhammadu Buhari yesterday insisted that former Nasarawa State Governor Abdullahi Adamu should become the next national chairman of the All Progressives Congress (APC).\nThe President also rejected the renewed attempt by three governors to change the zoning formula, which was agreed upon last week by the Progressives Governors Forum (PGF).\nA section of the divided APC Governors Forum made efforts to stop the President from giving audience to their colleagues, who rejected Adamu and the zoning arrangement.\nBut, a few other governors with much influence prevailed on the President to go ahead with the session.\nA pressure group, APC National Stakeholders, vowed to resist any attempt to impose Senator Adamu as Chairman (South) at the convention."
  },
  {
    "headline": "Tackling money rituals involving human sacrifice",
    "summarized_story": "Today’s money rituals have antecedents in pre-existing rituals of supplication.\nWhat is unusual in modern Nigeria is not the use of human sacrifice for such rituals.\nAccordingly, money ritual involving human sacrifice in order to get rich was unknown.\nFirst, while belief in human sacrifice as passport to wealth cannot be simply legislated out of existence, specific laws are in order that specify stiff penalties for anyone involved in human sacrifice.\nA key event at such programmes should be values education and the need to avoid criminal activities, including human sacrifice."
  },
  {
    "headline": "Thousands of women to occupy NASS until gender bills are reconsidered",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaNigerian women have vowed to occupy the National Assembly beginning 8 am Wednesday until all gender-related bills in the constitution amendment exercise are reconsidered.\nThe statement reads in full:‘Nigeria women are disappointed and aggrieved at the actions of the 9th National Assembly (NASS) today Tuesday, March 1, 2022, when they denied women the opportunity of inclusion and representation in governance by voting against the gender bills.\n‘The proposed gender bills in the 5th Constitution Alteration Bills that were all rejected are Bills targeted at addressing the current gender imbalance across the legislative arm of governments across the country whilst reducing the under-representation of women in political office.\n‘Nigerian women, therefore, demand that all gender Bills be reconsidered.\nThis would have come down to creating 111 extra seats for women at the National Assembly."
  },
  {
    "headline": "Buhari rejects APC governors’ request to dump Adamu as anointed national chairman",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari outrightly rejected Governors of the All Progressives Congress (APC) request for him to change his mind on his preference for Senator Abdullahi Adamu as the consensus candidate for the national chairmanship.\nA source who was present at the meeting Tuesday with the President at the presidential villa, Abuja shortly before he left for Kenya, confirmed the development.\nThe President was said to have bluntly refused to shift ground when the governors advanced their reasons against the serving senator representing Nasarawa West Senatorial District becoming the national chairman.\nThe chairman of the Progressives Governors Forum and Governor of Kebbi State, Atiku Bagudu, gave this assurance after he led governors of the party to meet with President Buhari.\nChairman of the chairman of the APC Extraordinary Convention Planning Committee, (CECPC) and Yobe State governor, Mai Mala Buni, was however absent at the meeting."
  },
  {
    "headline": "NASS okays VAT, airport, rail, electricity decentralisation",
    "summarized_story": "The parliament dumped the bid to expand immunity to presiding officers of the National Assembly and the Chief Justice of Nigeria.\nThe National Assembly is voting on the amendments to the 1999 constitution with 68 constitutional bills up for consideration.\nPresident of the Middle Belt Forum (MBF), Dr. Pogu Bitrus, described the autonomy for local governments as a good development.\nCommending the National Assembly for the bold step, he said: “It will bring the government closer to the people.\n“Autonomy to local governments will make the people to be part and parcel of the governance process."
  },
  {
    "headline": "Pastor Adeboye, genuine leader in all ramifications -Kalu",
    "summarized_story": "Describing Pastor Adeboye as a rare gem, Kalu acknowledged the contributions of Daddy GO to nation building as a pastor, statesman and philanthropist.\n“I felicitate with the founder and General Overseer of RCCG, Pastor Enoch Adeboye as he clocks 80.\n“I equally congratulate the wife of the General Overseer, Pastor Foluke Adeboye, members of the Adeboye family and RCCG.\n“Pastor Adeboye has consistently sustained his commitment to the service of God and mankind.\nPastor Adeboye is a genuine leader in all ramifications."
  },
  {
    "headline": "Ganduje sacks 4 officials over forgery, land scam – The Sun Nigeria",
    "summarized_story": "From Desmond Mgboh, KanoThe Kano State government has dismissed from service four staff of the state Bureau for Land Management for selling public landed properties, forging documents, issuing false information and falsification of official records.\nA statement signed by the state commissioner for information, Muhammad Garba, Tuesday indicated that the dismissed officers are Abdulmuminu Usman Magami, Senior Survey Assistant on Salary Grade Level 06 and Abdullahi Nuhu Idris, Senior Land Officer on Salary Grade Level 10.\nOthers are: Audu Abba Aliyu, Press Attendant on Salary Level 05 and Baba Audu, Assistant Chief Land Officer on Salary Grade Level 13.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nHe said their dismissal was in accordance with Civil Service Rule No.04406, adding that the decision was to serve as deterrent to others."
  },
  {
    "headline": "President Insists Adamu is Preferred Candidate for APC Chair",
    "summarized_story": "The engagement provided an avenue for South-east APC governors to complain about the zoning of the office of the national secretary to South-west rather than their region.\nSo, we congratulate the National Assembly for passage of the amendments and equally congratulate Mr. President for signing the amendment.\nIt is expected that there will be serious crisis within the party after the national convention fixed for March 26.\nAspirants Write Buhari, Want National Convention HaltedThe Forum of All Progressive Congress (APC) Aspirants for National Convention wrote to President Muhammadu Buhari and urged him to halt the forthcoming national convention of the party slated for March 26.\nThe forum stated, “We crave your patience to recall the near toxic wrangling over the timing of APC’s National Convention."
  },
  {
    "headline": "Constitution Review: National Assembly Okays Autonomy for LGs, State Legislature, Judiciary",
    "summarized_story": "The Senate passed a total of 49 bills out of the 68 considered during voting on the Constitution bills.\nAlso, the federal lawmakers at the end of the exercise, approved financial autonomy for state legislatures, judiciary and local governments (LGs) in the country.\nFor the Financial Independence of State Houses of Assembly and State Judiciary, 296 members voted in favour of the proposal.\nFurthermore, 269 lawmakers voted in support of independent candidacy in presidential, governorship, National Assembly, State Houses of Assembly and local government council elections.\nHowever, his appeals were not heeded to and he thereafter vowed to expose those who voted against women bills."
  },
  {
    "headline": "Breaking: Senate Okays Financial Autonomy for State Legislature, Judiciary",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Breaking: Lawmakers Kick as Osinbajo’s Wife, Dolapo, Visits House to Observe Voting on Constitution Amendment",
    "summarized_story": "Udora OrizuSome members of the House of Representatives on Tuesday, kicked against move to usher in the Wife of the Vice President, Dolapo Osinbajo, to witness voting on the clauses up for consideration in the Constitution Amendment Bills.\nThe Speaker, Hon.\nFemi Gbajabiamila, who presided over the session had called on the House Leader, Hon.\nAdo Doguwa, to suspend relevant rules of the House and move that the VP’s wife should be ushered in to witness the proceedings.\nThis generated screams of Nays from lawmakers across party lines."
  },
  {
    "headline": "Breaking: Buhari Seeks Amendment to New Electoral Act",
    "summarized_story": "Sunday AborisadePresident Muhammadu Buhari has formally asked the Senate to amend the newly signed Electoral Act 2022.\nBuhari, in a letter to the President of the Senate, Ahmad Lawan, specifically asked the federal parliament to consider deleting Section 84 (12) which has to do with the resignation of political appointees before party primariesDetails later…..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Sowore Declares To Run For Nigerian President In 2023",
    "summarized_story": "Human rights activist, Omoyele Sowore has officially declared to run for President in 2023.\nSowore is expected to contest on the platform of the African Action Congress (AAC).\n“SOWORE FOR President,” the activist posted on Facebook on Tuesday.\nSowore had last week said he would make his 2023 presidential declaration in March.\nSpeaking after his release, the activist said he was optimistic about becoming the next president of the country and not being threatened by anyone."
  },
  {
    "headline": "BREAKING: Sowore Declares To Run For Nigerian President In 2023",
    "summarized_story": "Human rights activist, Omoyele Sowore has officially declared to run for President in 2023.\nSowore is expected to contest on the platform of the African Action Congress (AAC).\n“SOWORE FOR President,” the activist posted on Facebook on Tuesday.\nSowore had last week said he would make his 2023 presidential declaration in March.\nSpeaking after his release, the activist said he was optimistic about becoming the next president of the country and not being threatened by anyone."
  },
  {
    "headline": "BREAKING: Court Declines Disgraced ‘Super Cop’, Abba Kyari’s Bail Application",
    "summarized_story": "A Federal High Court (FHC), Abuja has refused to grant the bail application of suspended Deputy Commissioner of Police (DCP), Abba Kyari.\nThe disgraced cop had also told the court that he was suffering from diabetes and hypertension.\nJustice Ekwo held that the sister court, which gave the order in favour of NDLEA on February 22, was a court of coordinate jurisdiction.\nThe judge, however, said he was inclined to hear Kyari’s fundamental enforcement rights suit with the urgency it deserves after the expiration of the 14-day court order.\nHe then adjourned until March 15 to hear Kyari’s application to demand his fundamental right enforcement"
  },
  {
    "headline": "BREAKING: Court Declines Disgraced ‘Super Cop’, Abba Kyari’s Bail Application",
    "summarized_story": "A Federal High Court (FHC), Abuja has refused to grant the bail application of suspended Deputy Commissioner of Police (DCP), Abba Kyari.\nThe disgraced cop had also told the court that he was suffering from diabetes and hypertension.\nJustice Ekwo held that the sister court, which gave the order in favour of NDLEA on February 22, was a court of coordinate jurisdiction.\nThe judge, however, said he was inclined to hear Kyari’s fundamental enforcement rights suit with the urgency it deserves after the expiration of the 14-day court order.\nHe then adjourned until March 15 to hear Kyari’s application to demand his fundamental right enforcement"
  },
  {
    "headline": "BREAKING: Court Declines Disgraced ‘Super Cop’, Abba Kyari’s Bail Application",
    "summarized_story": "A Federal High Court (FHC), Abuja has refused to grant the bail application of suspended Deputy Commissioner of Police (DCP), Abba Kyari.\nThe disgraced cop had also told the court that he was suffering from diabetes and hypertension.\nJustice Ekwo held that the sister court, which gave the order in favour of NDLEA on February 22, was a court of coordinate jurisdiction.\nThe judge, however, said he was inclined to hear Kyari’s fundamental enforcement rights suit with the urgency it deserves after the expiration of the 14-day court order.\nHe then adjourned until March 15 to hear Kyari’s application to demand his fundamental right enforcement"
  },
  {
    "headline": "Tinubu won't oppose reconciling with Aregbesola, says aide",
    "summarized_story": "Tunde Rahman, media aide of Bola Tinubu, chieftain of the All Progressives Congress (APC), says the former Lagos governor will not oppose reconciling with Rauf Aregbesola, minister of interior.\nOn Tuesday, TheCable reported that Adeyeye Ogunwusi, the Ooni of Ife, and Lamidi Adeyemi, the Alaafin of Oyo, met with Aregbesola in Oyo state.\nTheCable learnt that the meeting was organised to reconcile Aregbesola and Tinubu amid the ongoing rift between the duo.\nHe would not oppose the idea.”AdvertisementTheCable had reported that plans were underway to facilitate Tinubu and Aregbesola’s reconciliation.\nIn June 2020, TheCable reported that the relationship between the duo had turned sour — but they both denied the report."
  },
  {
    "headline": "Tinubu won't oppose reconciling with Aregbesola, says aide",
    "summarized_story": "Tunde Rahman, media aide of Bola Tinubu, chieftain of the All Progressives Congress (APC), says the former Lagos governor will not oppose reconciling with Rauf Aregbesola, minister of interior.\nOn Tuesday, TheCable reported that Adeyeye Ogunwusi, the Ooni of Ife, and Lamidi Adeyemi, the Alaafin of Oyo, met with Aregbesola in Oyo state.\nTheCable learnt that the meeting was organised to reconcile Aregbesola and Tinubu amid the ongoing rift between the duo.\nHe would not oppose the idea.”AdvertisementTheCable had reported that plans were underway to facilitate Tinubu and Aregbesola’s reconciliation.\nIn June 2020, TheCable reported that the relationship between the duo had turned sour — but they both denied the report."
  },
  {
    "headline": "'He remains humble despite huge achievements' -- Osinbajo hails Adeboye at 80",
    "summarized_story": "Vice-President Yemi Osinbajo has described Enoch Adeboye, general overseer of the Redeemed Christian Church of God (RCCG), as a leader who has lived an exemplary life and remained humble in spite of his huge achievements.\nIn a message to felicitate with Adeboye on his 80th birthday, Osinbajo said the RCCG leader has impacted many lives and overseen unprecedented growth of the church, yet these achievements have not affected his behaviour.\n“Dolapo and I are honoured to write this tribute to Daddy on his 80th Birthday,” Osinbajo said.\nAdvertisement“He was, as early as 2008, listed by Newsweek, as one of the 100 most influential people in the world.\n“But the moral of the story is not in these achievements, but in how his behaviour has remained unaffected by them."
  },
  {
    "headline": "'He remains humble despite huge achievements' -- Osinbajo hails Adeboye at 80",
    "summarized_story": "Vice-President Yemi Osinbajo has described Enoch Adeboye, general overseer of the Redeemed Christian Church of God (RCCG), as a leader who has lived an exemplary life and remained humble in spite of his huge achievements.\nIn a message to felicitate with Adeboye on his 80th birthday, Osinbajo said the RCCG leader has impacted many lives and overseen unprecedented growth of the church, yet these achievements have not affected his behaviour.\n“Dolapo and I are honoured to write this tribute to Daddy on his 80th Birthday,” Osinbajo said.\nAdvertisement“He was, as early as 2008, listed by Newsweek, as one of the 100 most influential people in the world.\n“But the moral of the story is not in these achievements, but in how his behaviour has remained unaffected by them."
  },
  {
    "headline": "World Bank to provide $3bn aid package for Ukraine amid Russian invasion",
    "summarized_story": "The World Bank says it is preparing a $3 billion aid package for Ukraine in the face of Russia’s invasion.\nThe bank said the funding would start with a fast-disbursing budget injection of at least $350 million this week, followed by $200 million for health and education.\nDavid Malpass, World Bank President and Kristalina Georgieva, managing director of the International Monetary Fund (IMF), disclosed this in a joint statement on Tuesday.\nAdvertisement“This package will include the mobilization of financing from several development partners, and we welcome the already-announced support from many bilateral partners.\n“This crisis affects the lives and livelihoods of people around the world, and we offer them our full support.”"
  },
  {
    "headline": "MTN buys 144 plots of digital land, becoming first African company to enter the Metaverse",
    "summarized_story": "Today, Africa’s largest telecom company, MTN bought 144 plots of digital land in the Africarare metaverse Ubuntuland for an undisclosed sum.\nMTN with this purchase laid claim to becoming the first African company to enter the metaverse, according to a press release on the company’s website.\nAfricarare is the first South African metaverse, housing digital land with roots in the African continent.\nAlongside MTN, South African advertising agency M&C Saatchi Abel also purchased its own plot of land in the newly created Ubuntuland.\nOutside Africa, companies like Samsung, Adida and PricewaterhouseCoopers have hopped on the trend too, buying plots of digital land."
  },
  {
    "headline": "Development finance institutions are looking to Africa’s digital frontier for impact and returns",
    "summarized_story": "Development finance institutions have long funded traditional finance and infrastructure projects in Africa; now they’re increasingly backing Africa’s digital future.\nIt can mean more opportunities unlocked as DFI money de-risks investment in high risk but critical business models.\nAfrica’s telecoms infrastructure, the backbone of its digital growth today, is an example of DFI money doing good while making returns.\nIn a perfect world, DFI and MFB activity in Africa’s fairly young venture space should be led (not nominally) by African development finance institutions.\nThat should help these institutions gain more financial clout and firepower to direct African technology to the areas of greatest need."
  },
  {
    "headline": "Payroll tech heats up in Africa, on the heels of a booming fintech sector",
    "summarized_story": "Amid the fintech boom, new frontiers are being explored by African entrepreneurs in the sector, one of which is payroll and corporate benefits management.\nThrough web portals or mobile self-service apps, companies can track time, process a locally compliant payroll, and pay their employees.\nZuberi is a Ghana-based earned wage access platform.\nIt’s easy to see why investors are backing payroll fintechs or broadly tech startups digitising the administrative stack for companies.\nAnd to increase chances of repayment, Bento Africa requires employees that apply for its loans to take unemployment and health insurance covers."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, There are two types of people in the world right now: those following the Ukraine-Russian tensions..."
  },
  {
    "headline": "CDcare’s buy and “pay small small” model wants to fix Nigeria’s shaky credit culture",
    "summarized_story": "I’d help students buy laptops, and they’d pay little by little.”But his entrepreneurial sprint began a year after getting into the university.\nHe pioneered a small business that helped fellow students secure important files even after formatting their computers.\n“It’s simple; we offer a ‘pay small small for gadgets and appliances with zero interest’, and at normal market price.\nThis was a significant challenge when CDcare started, and Odukoya believes that trust is a two-way thing in eCommerce.\nMost Nigerians settle for Tokunbo because there’s really no way to ‘buy and pay small small’ for cars."
  },
  {
    "headline": "How logistics startup, Flashbike is using the Fiverr model to provide instant pick-up services",
    "summarized_story": "And perhaps — to round it up — how do you reduce customer and dispatch company headache stories?\nThe idea was simple: create a platform that aggregates dispatch riders, enables tracking, and works as quickly as a ride-hailing business.\nLike so many people, they had experienced their fair share of disappointments with delivery companies.\nAdvertisementFlashbike’s model aggregates dispatch companies to provide a pick-up service with the user given the option to pick whichever is closest to them.\nApart from implementing payments — perhaps through subscription by the companies — Flashbike wants to run ads for the logistics companies."
  },
  {
    "headline": "Truck Transit Park (TTP) marks its first anniversary with the launch of a new brand identity",
    "summarized_story": "Share this article:Truck Transit Parks (TTP) limited (Ltd), an innovative traffic management company leveraging technology to help decongest Nigerian ports, celebrated its first anniversary and unveiled its new brand on February 28, 2022.\nHe said that intensive research was done to solve truck traffic and congestion in and around ports, and technology was sourced as the solution.\nHe also said that this solution is presently being used for truck traffic management.\nAs regards the future, the MD sees TTP Ltd transforming from a traffic management company to a tech solution company.\nTruck Transit Parks Limited is a traffic management company that leverages technology and man-management systems to ease traffic challenges."
  },
  {
    "headline": "Seplat’s bid for ExxonMobil assets meets NNPC brick wall",
    "summarized_story": "While Seplat Energy Plc, a major energy company in Nigeria, has agreed to buy the shallow-water assets of ExxonMobil in the country, the crucial green light from the Nigerian National Petroleum Company Limited (NNPC) could come at a heavy cost.\nMele Kyari, the group managing director of NNPC, has said International Oil Companies (IOCs) divesting from Nigeria’s upstream sector must address issues of abandonment and decommissioning of oil assets.\nWhile the NNPC has not hidden its intention to snap up the assets, it has struggled to raise financing.\nAccording to the transaction document seen by BusinessDay, Seplat Energy has agreed to buy the entire shallow-water business of ExxonMobil in Nigeria for $1.2 billion.\nRoger Brown, CEO of Seplat Energy, said, “This transaction underpins Seplat Energy’s drive to be a leader in the growth of the indigenous independent energy sector in Nigeria."
  },
  {
    "headline": "Seplat’s bid for ExxonMobil assets meets NNPC brick wall",
    "summarized_story": "While Seplat Energy Plc, a major energy company in Nigeria, has agreed to buy the shallow-water assets of ExxonMobil in the country, the crucial green light from the Nigerian National Petroleum Company Limited (NNPC) could come at a heavy cost.\nMele Kyari, the group managing director of NNPC, has said International Oil Companies (IOCs) divesting from Nigeria’s upstream sector must address issues of abandonment and decommissioning of oil assets.\nWhile the NNPC has not hidden its intention to snap up the assets, it has struggled to raise financing.\nAccording to the transaction document seen by BusinessDay, Seplat Energy has agreed to buy the entire shallow-water business of ExxonMobil in Nigeria for $1.2 billion.\nRoger Brown, CEO of Seplat Energy, said, “This transaction underpins Seplat Energy’s drive to be a leader in the growth of the indigenous independent energy sector in Nigeria."
  },
  {
    "headline": "Oil majors’ asset sales bad for Nigeria – Kachikwu",
    "summarized_story": "“We need to have a relationship discussion with the IOCs; if they are not doing crude, they can do gas,” he said.\nLast week, ExxonMobil announced that it had reached an agreement to sell its equity interest in Mobil Producing Nigeria Unlimited to Seplat Energy, a Nigerian independent oil and gas company, through its wholly-owned subsidiary Seplat Energy Offshore Limited.\nWhen finalised, the sale will include the Mobil Development Nigeria and Mobil Exploration Nigeria equity ownership of Mobil Producing Nigeria Unlimited, which holds a 40 per cent stake in four oil mining licenses, including more than 90 shallow-water and onshore platforms and 300 producing wells.\nThe transaction, valued at over $1.2 billion, is just one of the divestments planned by oil majors operating in the country.\nHe urged the government to reallocate unused oil blocks rather than having fields lying fallow."
  },
  {
    "headline": "Senate Approves Financial Autonomy for state legislatures, judiciary and LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian Senate has approved financial autonomy for state legislatures, judiciary and local governments in the country.\nThe approval came on Tuesday during voting on the report of the Senate Committee on the Review of the 1999 Constitution (Fifth Alteration) Bills, 2022.\nOut of a total number of 88 Senators registered to vote on the bill, 34 voted in support, and 53 against the bill.\nAlso rejected were bills to override Presidential veto in Constitution Alteration; and to override Presidential veto in respect of ordinary money bills.\nThe bill on Procedure for Overriding Presidential Veto in Constitutional Alteration seeks to provide for the procedure for passing a constitution alteration bill where the President withholds assent."
  },
  {
    "headline": "Senate Pass Bill to Summon President and Govenor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Senate, on Tuesday, passed a bill to empower the National Assembly and State Assemblies to summon the President and State Governors to answer questions bothering on security or any other issues on which the National and State Houses of Assembly have powers to make laws.\nThe bill seeks alteration to Section 67 of the Principal Act by inserting after subsection (3), a new subsection (4).\nThe chamber also approved a bill to include Presiding Officers on the membership of the National Security Council.\nThe bill seeks to alter Section 129 of the Principal Act to insert after subsection (2), a new subsection (3).\nThe chamber, however, turned down a bill to provide for more seats for women in the National and State Houses of Assembly."
  },
  {
    "headline": "Obaseki faults sharing formula for FG’s conditional cash transfer programme, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has faulted the sharing formula for the Federal Government’s conditional cash transfer programme and the distribution of other social amenities.\nHe said this when he received the Executive Chairman of the Federal Character Commission, on a courtesy visit to the Government House, in Benin City, Edo State.\nObaseki said: “In terms of fair distribution of social services, the Commission has not done much.\nI urge the commission never to allow what happened during the sharing of conditional cash transfer from the Federal Government to happen again.\n“Nigerians are not happy and are angry with the way the conditional cash transfer and sharing of social and economic amenities were handled."
  },
  {
    "headline": "Obaseki harps on transparency, accountability in public procurement amid dwindling resources – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…to partner UNDP to create more jobs for Edo youthsThe Edo State Governor, Mr. Godwin Obaseki, has called for transparency and accountability in the use of public resources amid the decline in government revenue.\nObaseki gave the charge when he received a delegation of the United Nations Development Programme (UNDP), Accountability Lab and Open Contracting Partnership, at the Government House, in Benin City, the Edo State capital.\n“Transparency and accountability are key and core to our administration.\nIt is important that we show to our people how we have spent the money we got from them.\nWe need to domesticate the Nigeria Jubilee Fellows Programmes (NJFP) and need the help of UNDP."
  },
  {
    "headline": "Used as sex slaves, duped – Libya returnees lament ordeal",
    "summarized_story": "A number of Nigerians who among the latest badge of returnees from Libya have narrated horrible experiences they passed through in the North African country in the hands of traffickers.\nTwo of the female returnees, 29-year-old Tosin and Blessing, narrated their traumatic experience in the hands of their traffickers informally referred to as ‘burgers’.\nNarrating her six-year experience in Europe, Tosin, who travelled since February 2016, said she was misled by her mother to embark on the fruitless journey.\n“I had to obey my mother and embark on the journey, when the pressure became unbearable.\nMy trafficker paid for the journey from Nigeria to Libya, which started on February 26, 2016."
  },
  {
    "headline": "Wike gives reasons for deciding to pursue stomach infrastructure",
    "summarized_story": "Rivers State governor, Nyesom Wike, has said that his administration has decide to pursue stomach infrastructure because he has completed physical infrastructure.\nStomach infrastructure is a term used to refer to welfare packages given to citizens often with the intention to get their votes during elections .\n“Now that we have done virtually everything we have promised Rivers people, this is the time now we have to play politics of stomach infrastructure,” the governor said.\nThe governor described welfare as an important aspect of governance as it implies empowerment of the people economically, saying: “There is time for everything.\nThe Managing Director of Julius Berger, Lars Richter, commended the Rivers State government for giving the company the opportunity to be part of the ongoing infrastructural transformation of the state."
  },
  {
    "headline": "NNPC to ramp up production as Brent crude crosses $105/barrel",
    "summarized_story": "The Nigerian National Petroleum Company Limited (NNPC), has vowed to increase Nigeria’s oil production amid rising crude oil prices in the international market in the wake of Russia-Ukraine war.\nThe country had missed its crude oil output target for January 2022, pumping 1.46 million barrels per day against a target of 1.683 million bpd as approved by OPEC.\nNigeria, had for some time, however, failed to meet its OPEC production, but as Brent, the crude against which Nigeria’s oil is priced, crossed the $105/barrel price on Tuesday, a decade high the NNPC vowed on Tuesday to increase Nigeria’s oil production.\nSpeaking at the ongoing Nigeria International Energy Summit 2022 in Abuja, the Group Managing Director of NNPC, Mele Kyari, noted that the oil firm would increase Nigeria’s oil production.\n“And the easiest way to clear the wealth of today so that we can have the resources that will keep us through this transition is to immediately increase domestic crude oil production."
  },
  {
    "headline": "NASS affirms states’ VAT collection, LGA, legislative autonomy",
    "summarized_story": "It was victory for the 36 states and 774 local governments of the federation as the National Assembly on Tuesday rejected a proposal seeking to shift the collection of Value Added Tax (VAT) from the concurrent to the exclusive legislative list.\nA Federal High Court had last year ruled that states had the powers to collect VAT.\nAlso, the FIRS was reported to have lobbied the National Assembly by sending a proposal to the House of Representatives seeking to move VAT collection to the exclusive list.\nAlthough the tax agency denied this claim, the National Assembly accepted the proposal and sent it to its constitutional amendment committee.\nOn Tuesday, the National Assembly, voted on 68 amendments recommended by the Joint Senate and House of Representatives’ Special Ad Hoc Committee on the Review of the 1999 Constitution."
  },
  {
    "headline": "Russia Attacks Key Ukraine Cities…’They Will Bomb Us To Ashes’",
    "summarized_story": "People in Kharkiv have been appealing for international help to stop Russia’s aerial bombardment of the north-eastern city.\nGlib Mazepas who lives in the city centre wants Nato to enforce a no-fly zone over Ukraine.\nBecause they will just bomb the whole city to the ashes.”Authorities there say four people were killed in Russian shelling this morning.\nI never thought it would be like this.”Four killed as Kharkiv assault intensifiesEmergency services in the eastern city of Kharkiv say four people have been killed by Russian shelling this morning.\nThe city’s mayor says Kharkiv is “partially surrounded” by the Russian army, which the Ukrainian military is currently holding back “heroically”."
  },
  {
    "headline": "Court Okays Umahi’s Defection To APC",
    "summarized_story": "Ogbonnaya Okorie had approached the High Court seeking the court to interpret the Constitution if the Governor should not vacate office having defected from his party.\nADVERTISEMENTConsidering the submissions of both parties, the Court held that having regard to section 188 (1) of the 1999 Constitution as amended, the defendant (Governor Umahi) has not offended any provision of the Constitution or the Electoral Act in his defection to APC.\n“Every constitutional provision relating to the office of President and Vice president they are corresponding provision relating to the governor and his Deputy”.\n“As far back as 2007 the Supreme Court had ruled that there are no consequences for President and Vice President defecting from one political party or another.\nUchenna Orji commended the court for the judgement noting that the judgement is victory for Democracy."
  },
  {
    "headline": "NOTAP Partners DALOKS TechnoServe To Build Franchise For",
    "summarized_story": "The National Office for Technology Acquisition and Promotion (NOTAP) is collaborating with DALOKS Technoserve, to build franchises for Small and Medium Enterprises (SMEs) in Nigeria to promote their business brands in the country and the world.\nHe said that NOTAP has made a survey about Nigerian cuisine, and identified those that can be transformed into franchises, which the government has standardized.\nADVERTISEMENTThe Managing Director of DALOKS Technoserve Mr. Chuks Nwanodu told reporters that the collaboration with NOTAP gives opportunity to individual companies to showcase their capacity and also enable small businesses to grow.\nHe said the government through NOTAP is trying to encourage young Nigerian businesses to grow bigger and higher and spread their tentacles using their franchise, which they can sell to others while still retaining their foundational brands.\nThe CEO/Executive Secretary American Business Council, Margaret Olele in her presentation tagged “Franchise As Business Growth Accelerator” noted that small businesses can grow and add to the economic growth of the country through franchise."
  },
  {
    "headline": "2023: Give Us Peter Obi, Get 10m Votes, Youths Tell PDP",
    "summarized_story": "A group of young Nigerians under the auspices of #TakeBackNaija# Movement has promised the Peoples Democratic Party (PDP) of over 10million votes at the 2023 presidential election, should the party present former Anambra State governor, Mr Peter Obi, as the party’s flag bearer.\nThe national coordinator of the group Comrade Ali Mohammad, who made this known in Yenagoa after an interactive session with youth groups and other stakeholders ahead of the party’s primaries, pleaded with the PDP leadership to consider Peter Obi as the presidential flag bearer, considering the fact that what is at stake in 2023 is beyond party politics, but a case of rescuing the country.\nComrade Mohammed through the statement pointed out that Peter Obi is the most popular candidate amongst the Nigerian youths, as well as the elites, and most importantly, is acceptable across the six geopolitical zones, that are yearning for a credible, visionary and passionate leader, who will transform the fortunes of the country, once given the opportunity.\nHe reiterated that research carried out shows that young persons would troop out en masse to vote in 2023, if the party presents them with a candidate that represents the interest of the youths, and has a plan to revive the country’s dying economy.\nADVERTISEMENT"
  },
  {
    "headline": "Army Gets New Ultra-modern Operations Centre",
    "summarized_story": "The Chief of Army Staff, Lt Gen Faruk Yahaya, has commissioned the newly constructed Nigerian Army ultra-modern operations centre, situated at the Army headquarters complex.\nThe new centre will coordinate and control all Army operational engagements across theatres of operations nationwide.\nThe Chief of Army Staff commended his predecessor, Lt Gen (rtd) Tukur Yusufu Buratai for his foresight in conceiving the project, adding that the new operations centre will serve as a command centre, situation room, as well as operational briefing center for the Army.\nBuratai pointed out that planning and execution are very critical in the success of military operations, stressing that to have a befitting ultra-modern operations centre is an indication of Nigeria Army’s, dynamism seriousness and commitment to professionally perform its constitutional roles.\nADVERTISEMENTIn his welcome address, the chief of operations (Army), Maj Gen Olufemi Akinjobi stated that the centre is equipped with state-of-the-art facilities, that will enable it serve tripartite functions of Command Centre, situation room and operations briefing facility."
  },
  {
    "headline": "Putin wants Ukraine erased from the map: Zelenskiy",
    "summarized_story": "Putin’s Russia is aiming to erase Ukraine, its history and people, President Volodymyr Zelenskiy said in a video on Wednesday.\nHe spoke on the seventh day of Moscow’s invasion of his country, which started with heavy shelling of the Black Sea port of Mariupol.\nBut Zelenskiy, unshaven and wearing a khaki T-shirt, said the West’s response was not enough, calling for more international support, including backing Ukraine’s bid to join the European Union.\nAlthough the world has promised again and again that it will never happen again,” said Zelenskiy.\nThat’s why it is very important now that you, millions of Jews around the world, do not stay silent."
  },
  {
    "headline": "Queen Elizabeth beats COVID, returns to work",
    "summarized_story": "Queen Elizabeth II resumed public engagements Tuesday after falling ill with Covid, as her son and heir Prince Charles was quoted as saying that she is “a lot better”.\nConcerns have mounted for the 95-year-old monarch’s health since she tested positive on February 20, overshadowing the start of her record-breaking 70th year on the throne.\nThe queen last week cancelled similar scheduled engagements with new ambassadors as she was suffering from what were described as “mild” Covid symptoms.\nShe described the illness as “very worrying as the queen is getting on a bit but I think she’s absolutely wonderful”.\nCharles contracted Covid in early 2020 as the pandemic struck, and tested positive again on February 10 this year, two days after he last met his mother."
  },
  {
    "headline": "BREAKING: Ondo students block Ibadan-Akure-Abuja highway",
    "summarized_story": "Tertiary institution students in Ondo State under the auspices of the National Association of University Students (NAUS) on Wednesday blocked the busy Ibadan-Akure-Abuja highway in protest over the ongoing strike action by the Academic Staff Union of Universities (ASUU).\nThe blockade caused heavy vehicular traffic along the highway as many heavy duty trucks and passengers bus going to and fro Abuja, Lagos or Benin were stranded.\nMotorists travelling to nearby communities along the highway resorted to taking alternative untarred route.\nFormer Student Union President of Federal University of Technology, Akure , Esedere Abraham, said the protest would continue until ASUU calls off the strike action.\nEsedere stated that students should not be made to suffer for any problem between ASUU and the Federal Government."
  },
  {
    "headline": "Couple reportedly die while allegedly having s3x in a car along Lagos-Ibadan expressway (video)",
    "summarized_story": "Couple reportedly die while allegedly having s3x in a car along Lagos-Ibadan expressway (video)A couple have been reportedly found dead while allegedly having sex in a car along Lagos-Ibadan expressway.\nEyewitnesses claimed that the couple might have been dead for two days.\nThe car’s number-plate was displayed in the video and those who know the couple have been asked to contact Owe-Ibafo Police station.\nIt is also speculated that the man is a contractor as a helmet was found in the car.\nWatch the video below……."
  },
  {
    "headline": "APC: Buhari Rejects Moves To Drop Adamu As Consensus National Chair",
    "summarized_story": "The effort of some governors of the All Progressives Congress (APC) to persuade President Muhammadu Buhari to drop Senator Abdullahi Adamu as the consensus candidate for the national chairmanship position of the party failed yesterday.\nDaily Trust learnt that President Buhari turned down the suggestion from the governors to dump the federal lawmaker representing Nasarawa West Senatorial District in the National Assembly ahead of the March 26 national convention.\nIn the meantime, Daily Trust reports that the APC governors would on Tuesday night discuss the agitation over zoning after the South East APC leaders protested the swapping of the office of the national secretary to South West.\nAddressing a press conference on Tuesday in Abuja, the APC national stakeholders led by Audu Aliyu, said they would resist any form of imposition in the party.\nThe lawmaker who spoke through one of his aides, Ambassador Samuel Jimba, specifically said the claim by the APC national stakeholders led by Aliyu Audu that he was not qualified to chair the affairs of the ruling party was laughable."
  },
  {
    "headline": "Constitution Amendment: NASS Okays Autonomy For Local Governments",
    "summarized_story": "The National Assembly on Tuesday granted financial and administrative autonomy to all the local governments across Nigeria.\nBoth chambers of the National Assembly during voting on the Constitution Amendment voted in favour of Local Government administrative autonomy as a tier of government and guarantee their democratic existence and tenure.\nIn the Senate Chamber, Local government financial autonomy had 92 ‘YES’ votes and two ‘NO’ votes.\nAlso in the Senate Chamber, local government autonomy, had 258 ‘YES’ votes and 15 ‘NO’ votes.\nLocal government administrative autonomy had 88 ‘YES’ votes, four ‘NO’ votes."
  },
  {
    "headline": "[Breaking] Ukraine invasion: Over 100 Nigerians storm embassy, volunteer to fight Russian troops",
    "summarized_story": "Following the call for volunteer fighters by the Ukrainian president, Volodymyr Zelensky, about 115 Nigerian youths, Wednesday, stormed Ukraine embassy in an effort to join Ukraine in its fight against Russia.\nThe youths in their large numbers visited the Ukraine Embassy in Abuja, and were directed by the embassy to put down their names in a register provided.\nThe second secretary, Ukraine Embassy, Bohdan Soltys, confirmed the development, adding that no step had yet been taken to that effect.\nThe volunteers are believed to be responding to a recent call by Ukrainian President, Volodymyr Zelensky, urging people around the world to join the fight.\nZelensky had called on anyone who wished to join the defense of Ukraine, Europe and the world to come and fight side by side with Ukrainians."
  },
  {
    "headline": "Constitution review: Despite Aisha Buahri’s advocacy, NASS kicks out affirmative action, Senate rejects traditional rulers’ councils – Blueprint Newspapers Limited",
    "summarized_story": "Leading the pack of passed bills was item 58 which deals with independent candidacy with 89 senators voting in its favour while 5 voted against it.\nThe Bill reads: “The bill seeks to alter the Constitution to allow an Independent candidate contest for an elective position.\nOthers are item 31 which deals with establishment and maintenance of correctional centres moved from the Exclusive List to Concurrent list.\nThe bill reads: “This bill seeks to delete the item “Prisons” from the exclusive legislative list and redesignate it as Correctional Services in the Concurrent Legislative List.\nRejecting the proposal, 58 senators voted against it while 30 voted in its favour."
  },
  {
    "headline": "Breaking: Senate passes LG financial, administrative autonomy bill",
    "summarized_story": "The Senate on Tuesday passed financial and administrative bill to ensure autonomy for local government areas in Nigeria.\nDetails loading…"
  },
  {
    "headline": "Failed Bills: Women Groups Storm NASS Gate In Protest",
    "summarized_story": "﻿Various women groups on Wednesday occupied the gate of the National Assembly in protest against the rejection of women-related bills at plenary.\nIn protest against this, the women gathered early on Wednesday morning at the three arm zone and marched to the National Assembly gate chanting songs of solidarity against the move by the lawmakers.\nAlthough the gate of the National Assembly was shut, the women sat down at the gate and demanded that their voices must be heard.\nThe protest comes less than 24 hours after the bill seeking to provide special seats for women in the National and State Houses of Assembly, among other women-related bills failed.\nShe, however, left disappointed after all the bills related to women in the constitution amendment failed."
  },
  {
    "headline": "Constitution Amendment: Several Bills Irrelevant To Nigerians, Says Sagay",
    "summarized_story": "﻿The Chairman of the Presidential Advisory Committee Against Corruption (PACAC), Itse Sagay, has faulted some of the items proposed by the National Assembly as amendments to the 1999 constitution, saying they are “totally irrelevant” to Nigerians.\n“Under the distributable pool, the least able state — the poorest state — gets more from that pool.\nThe constitution shouldn’t tell us what we should do about our local governments.\nIt should not contain a list of our local governments,” he added.\nWhen you talk about the funding of local governments — how to create a special account for LG separate from the state governments — they are irrelevant; it shouldn’t be in the constitution at all.”"
  },
  {
    "headline": "International Court Of Justice Fixes Date For Ukraine War Hearings",
    "summarized_story": "The International Court of Justice said Tuesday it would hold genocide hearings on March 7 and 8 over the war in Ukraine, as fighting intensifies.\nThe Hague-based ICJ, the United Nations’ top court, will open the public hearings after Ukraine lodged a complaint with the court to order Russia to stop its invasion.\n“The hearings will be devoted to the request for the indication of provisional measures submitted by Ukraine,” the court said in a statement.\nInternational Criminal Court prosecutor Karim Khan had already announced he was launching an investigation on the “situation in Ukraine” following Russia’s invasion.\nThe United States trusts “the Court is taking into consideration the dire circumstances and rapidly unfolding events,” the State Department said in a statement Tuesday."
  },
  {
    "headline": "PHOTOS: NEMA Receives Another Batch Of 128 Nigerian Returnees From Libya",
    "summarized_story": "The National Emergency Management Agency (NEMA) has received another batch of 128 stranded Nigerian returnees from Libya.\nMs Omole narrated how the proposed journey to Europe became a hellish life of prostitution in Libya.\n“My trafficker paid for the journey from Nigeria to Libya which started on 26th February 2016.\n“I cannot ask my enemies to embark on any journey out Nigeria to seek for any non-existing job at all.\nOther agencies at the reception of the returnees included the Nigerian Immigration Service, Federal Ministry of Health, NAPTIP, FAAN, and the Nigeria Police Force."
  },
  {
    "headline": "World Bank To Dole Out Over $1bn Aid To Afghanistan",
    "summarized_story": "The World Bank on Tuesday announced more than $1 billion in humanitarian aid for Afghanistan, stating the money will go to UN agencies and international NGOs while remaining “outside the control” of the country’s Taliban rulers.\nThe reallocation from the Afghanistan Reconstruction Trust Fund (ARTF) follows the $280 million in ARTF funds disbursed last December and is aimed at supporting the humanitarian response over the critical winter months.\nThe bank suspended its aid to Kabul late last August after the hardline Islamist Taliban swept back into power.\nIt is administered by the World Bank on behalf of donor partners.\nThe objective of the new aid is to “protect vulnerable Afghans (and) help preserve human capital and key economic and social services,” the World Bank said."
  },
  {
    "headline": "Women Groups, CSO's to occupy National Assembly on Wednesday -",
    "summarized_story": "Women and civil society groups are set to occupy the National Assembly on Wednesday, over decision of the lawmakers to vote against bill seeking to create special seats for women in federal and state parliaments.\nThis decision was made after a virtual press conference in Lagos, presided over by the Founding Director of Women Advocates Research & Documentation Centre, Abiola Akiyode-Afolabi.\nAdvertisementThe decision by the lawmakers means women are denied 35% appointed positions, 35% affirmative action in party administration and leadership, while it declined citizenship to the foreign-born husband of a Nigerian woman.\nIt allows a foreign-born wife of a Nigerian get automatic citizenship, but denies women the ability to take indigeneship of their husband’s state, until after 5 years of being together.\nAdvertisementThe civil society groups and other concerned Nigerians vowed to name and shame the lawmakers for voting against the bill, aimed at promoting gender equality in Nigeria."
  },
  {
    "headline": "Senate separates AGF, Minister of Justice office",
    "summarized_story": "The senate has passed bill for separation of the office of the Attorney General of the Federation and that of the State from the Office of the Minister and Commissioner of Justice.\nThe red chamber also passed the bill for the removal of transitional Lawmaking powers of the executive but rejected the bill for expansion of the scope of Executive immunity to include other Arms of Government- Section 308AdvertisementIn the same vein, the senate also passed the bill for membership of the National Security Council to Include Presiding Officers of the National Assembly.\nThe lawmakers also passed amendment for legislative powers to summon the President and GovernorsAdvertisementMeanwhile, the House of Representatives has rejected the bill seeking to include diaspora voting in the constitution.\nOut of the 298 votes, 58 voted for the bill while 240 voted against.\nThe Senate however passed the bill for independent candidacy to contest for an elective position"
  },
  {
    "headline": "Former Governor, Segun Oni, joins SDP, emerges Ekiti Governorship candidate -",
    "summarized_story": "The Former Governor of Ekiti State, Chief Segun Oni describes the outcome of the PDP Primary in Ekiti State as disgraceful and pitching his tent with the SDP is the right step in giving Ekiti People a new lease of life.\nHe urged the Electorate to Collect their PVCs and stay alert before, during, and after the Elections assuring the People that he is ready to govern the State"
  },
  {
    "headline": "Buhari writes Senate, seeks amendment of Section 84 (12) in Electoral Act",
    "summarized_story": "The Nigerian Senate has received a letter from President Muhammadu Buhari seeking amendment to section 84 subsection 2 and subsection 12 in the 2022 Electoral Act.\nPresident Buhari in his letter that was read on the floor by President of the Senate wants the National Assembly to amend section 84 which states that no political appointee shall be a voting delegate or be voted for at the convention or congress of any political party for the purpose of the nomination of any candidate for an election.\nAdvertisementThe President said the amendment is necessary as the clause constitutes a fundamental defect and leads to the disenfranchisement of political officeholders.\nPresident Buhari added that the provision introduced qualification and disqualification criteria that ultra-vires the Constitution by way of importing blanket restrictions to serving political officeholders."
  },
  {
    "headline": "As Russia Bombards Ukranian Cities, Biden Warns Putin ‘Has No Idea What’s Coming",
    "summarized_story": "U.S. President Joe Biden warned Vladimir Putin that the Russian leader “has no idea what’s coming”, as Western nations tightened an economic noose around Russia, whose invading forces bombarded Ukrainian cities and appeared poised for an advance on Kyiv.\nHundreds of thousands of Ukrainians have fled the fighting since Putin ordered a full-scale invasion nearly a week ago, with a miles-long Russian military convoy north of Kyiv readying to advance on the capital.\nStraying from the prepared text, Biden added “He has no idea what’s coming.” He did not elaborate.\nread moreUkrainian President Volodymyr Zelenskiy called on Russia to stop bombarding civilians and resume talks.\nWest of Kyiv, in the city of Zhytomyr, four people, including a child, were killed on Tuesday by a Russian cruise missile, a Ukrainian official said."
  },
  {
    "headline": "Buhari Leaves Nigeria for Kenya, Before Travelling to London for Routine Medicals",
    "summarized_story": "Nigeria President Muhammadu Buhari departed Abuja on Tuesday for a three-day official visit to Nairobi, Kenya from where he would proceed to London for routine medical checks that may last two weeks.\nSpecial Adviser to the President on Media and Publicity, Femi Adesina, in a statement disclosed that President Buhari’s medical check-up in UK would last maximum of two weeks.\nMember States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme and championing solutions to our shared environmental challenges.\nBut each nation has a crucial role to play in protecting our people and planet.”Buhari is expected to deliver the National Statement of the country and participate in High Level Dialogue Sessions on the Environment at the event.\nAccording to the statement, Buhari believed Adeboye’s contributions to the betterment of Nigeria and other countries stand out clearly as testimonies of his divine calling, impacting greatly on education, health and infrastructural development, which include many urban and rural roads."
  },
  {
    "headline": "Nigeria Says 70% of Armed Forces Engage in Domestic Policing Due to Insecurity",
    "summarized_story": "Nigeria’s federal government has disclosed that about 70 per cent of officers of the Nigerian Armed forces are currently engaged in domestic policing operations in the country.\nHe said: “Close to 70 per cent of Nigerian armed forces personnel are engaged in policing duties across the 36 states of the federation.\nIrabor said: “The popular one, which people do not want to hear about, is the rehabilitation of repentant Boko Haram that have surrendered their weapons.\nAnd over 23,000 of them have surrendered to the Nigerian armed forces, thereby helping to mop up small arms in circulation.\n“As we approach an election year, we recommend that the government separate politics from security and that the security agencies stay off politics."
  },
  {
    "headline": "Nigeria, Equatorial Guinea Sign New Gas Deal",
    "summarized_story": "Nigeria and Equatorial Guinea on Tuesday signed a Memorandum of Understanding (MoU) to supply gas from Nigeria’s offshore fields to the neighbouring country’s gas processing facility in Punta Europa.\nWhilst we are focused on the domestic gas agenda, we are keeping an eye on the global gas market as well.\n“This collaboration allows much of that stranded gas to access the global gas market within 18 to 24 months in what will be the fastest timeline to market for a Nigerian offshore gas asset.\nMinister of Mines and Hydrocarbons, Equatorial Guinea, Gabriel Nguema Obiang Lima, in his remarks, stated that the execution of this MoU was a great example of the South-south cooperation between neighbouring Nigeria and Equatorial Guinea.\nAccording to the statement, as the world energy dynamics change, Nigeria aims to adapt rapidly to ensure that it remains at the forefront of world gas exporters."
  },
  {
    "headline": "Despite Conversations Around Energy Transition, Oil Will Still Be Relevant, Nigeria Government Insists",
    "summarized_story": "Speaking on the third day of the Nigeria International Energy Summit (NIES) tagged: “Revitalising the Industry: Future Fuels and Energy Transition,” the Minister of State, Petroleum said industry stakeholders must begin to drive a new narrative, using gas as a transition fuel.\n“While we pursue the country’s energy transition agenda, let us also recognise that fossil fuels will continue to play a critical role in our energy and economic systems.\n“While the role may appear to be in contradiction with the energy transition agenda, fossil fuels will still remain important and will remain integral part of the vision in our energy transition journey,” he explained.\nSylva stated that the federal ministry of petroleum resources, in discharge of its mandate, would continue to be an enabler to make a seamless energy transition in Nigeria happen.\nManaging Director of Chevron, Nigeria, Rick Kennedy, in his intervention, stated that the country is endowed with everything to succeed in the energy industry, including a young population of talented people."
  }
]