[
  {
    "headline": "Gombe official raises the alarm over child labour on farmlands",
    "summarized_story": "The Director, Child Welfare, Gombe State Ministry of Women Affairs and Social Development, Joseph Markus, has lamented the increase of underaged girls for cheap labour on the farmlands.\nHe urged stakeholders to ensure that issues concerning the girl child are given deserved priority.\nI told the speaker, speaker see your people.\nEducation is a tool.”Markus also reminded relevant stakeholders to ensure the domestication of the Child Rights Act, as well as the implementation of a framework towards ending child marriage in the state.\nI call on the government to please look at girls education in Gombe State and find a solution.”Copyright PUNCH."
  },
  {
    "headline": "Climate change: Edo Rep urges FG to explore other sources of revenue generation",
    "summarized_story": "A member of the House of Representatives, Mr Dennis Idahosa has urged the Federal Government to harness other sources of revenue generation, warning that overreliance on oil and gas may prove disastrous.\nHe said this has become important ahead of the implementation of the resolutions of the 26th meeting of the Conference Parties to the United Nations Framework Convention on Climate Change (UNCOP26) in Glasgow.\nIdahosa pointed out that Nigeria has numerous potential sources of revenue and if attention is not placed on them early, it would be of no benefit to its citizens and the nation at large.\nHe said that part of the resolution of the Glasgow meeting which took place between October 31 to November 12, 2021, is to phase out fossil fuels to limit global warming to 1.5 degrees Celsius compared to pre-industrial levels.\nwhile delivering his speech at the COP26 leaders’ summit pledged that Nigeria would cut its emissions to net-zero by 2060."
  },
  {
    "headline": "NDLEA intercepts N2.7b cocaine at Abuja airport",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency have arrested a 32-year-old drug trafficker based in Liberia, Maduabuchi Chinedu, at the Nnamdi Azikiwe International Airport, Abuja with 9.30 kilograms of cocaine worth over N2.7 billion in street value.\nThe suspect is said to hail from Obaha Okigwe Village, Okigwe Local Government Area of Imo State, and works as a miner in Liberia.\nThe Director, Media and Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi disclosed this in a statement titled, ‘NDLEA intercepts N2.7b cocaine at Abuja airport,’ and issued on Thursday.\nThe statement said the suspect was arrested during an inward joint search of Ethiopian Airlines flight 911 at the Abuja airport on Wednesday, November 24, 2021, with 9.30kg cocaine with each pellet in candy wraps and concealed in his luggage.\n“While commending the officers and men of the NAIA Command of the Agency for their vigilance and working in synergy with other security agencies at the airport, Chairman/Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Experts disagree as FG says new national carrier takes off April 2022",
    "summarized_story": "So that’s the first memoranda.”The next one also is approval of the outline business case for the establishment of the national carrier and this is the sixth time the memorandum appeared before Council.\nSo 5% is the maximum equity that government will take, then 46% will be owned by Nigerian entrepreneurs.\nThese 70,000 jobs are higher than the total number of civil servants that we have in the country.\nThey all started much later than the ‘national carrier’ we began its rollout since 2017.”My worry is that it is too late a time for a national carrier or else we may end up with a ‘government carrier; let us discard the ‘national carrier’ for a flag carrier now before we end up with a government carrier.\nWe have been on this national carrier thing since this government came to power."
  },
  {
    "headline": "Former President Jonathan hosts Uniport Alumni 1981 set reunion",
    "summarized_story": "Former President Dr Goodluck Jonathan, will this weekend host the University of Port Harcourt alumni set of 1981.\nJonathan, an alumnus and a pioneer graduating student of the federal institution will alongside other of his former schools mates participate in reunion activities scheduled for Thursday, November 25 to Saturday 27, 2021 in Yenagoa the Bayelsa State capital.\nA statement from the media office of Dr Goodluck Jonathan notes that activities lined up for the programme include a lecture, an excursion and a dinner and award night.\nThe University of Port Harcourt located in Rivers state was established in 1975 as University College but was upgraded to a full-fledged university in 1977.\nThe school popularly called Uniport has over the years groomed many illustrious leaders and trailblazers of international repute and the reunion is meant to encourage young and upcoming generations on the power of education."
  },
  {
    "headline": "EU experts to decide on coronavirus vaccine for children 5-11yrs",
    "summarized_story": "The European Union would soon make its first coronavirus vaccines available for children under 12.\nThe European Medicines Agency (EMA) said it would decide on Thursday whether to approve the Pfizer/BioNTech jab for children aged five and over.\nIf the EMA experts give the green light, the EU Commission still has to give official approval but that is considered a formality.\nIn Europe, the Pfizer/BioNTech vaccine has so far only been approved for people aged 12 and older.\nBut in Israel and the United States, children as young as five can be vaccinated with it."
  },
  {
    "headline": "Again, 172 Libya Returnees arrive Nigeria",
    "summarized_story": "By Bose AdelajaLess than 24 hours after a batch of 158 stranded Nigerians arrived the country from Libya, another batch of 172 stranded Nigerians have arrived from same country.\nThis makes it a total of 330 stranded Nigerians to be repatriated to Nigeria through the European Union.\nThese Returnees were among those who got stranded in their failed attempt in search of greener pastures in foreign countries.\nREAD ALSO: Another batch of 158 returnees arrive Nigeria from LibyaIn addition were 53 female adults, 12 female children and three female infants.\nEarlier in the day, 158 were returned to Nigeria from Libya."
  },
  {
    "headline": "Yoruba Nation: Afenifere, Ilana Omo Oodua tackle DSS over extradition of Igboho",
    "summarized_story": "By Dapo Akinrefon & Adeola Badru, LAGOSTHE pan-Yoruba socio-political organisation, Afenifere and Ilana Omo Oodua, IOO, yesterday, tackled the Department of State Service, DSS, for filing extradition charges against Yoruba Nation agitator, Chief Sunday Adeyemo, fondly called Sunday Igboho, who is currently detained in the Benin Republic.\nThe DSS had disclosed that the process of extraditing Igboho to Nigeria was ongoing.\nSuch meetings should be convened without delay.”Ilana Omo Oodua flays DSSSimilarly, addressing newsmen during the inauguration of Ilana Omo Oodua Worldwide Elders Advisory Council, the spokesman of the group, Maxwell Adeleye dismissed the claims by the DSS that it has filed extradition charges to bring Sunday Igboho to Nigeria.\nAkintoye said: “We are ready to fight for Yoruba nation and until we succeed, there are some things the elders can do that the youths cannot do.\nOf course, the youths are also key towards the realisation of Yoruba nation through protests, rallies, social media, and others but they also need the elders to champion the course.”"
  },
  {
    "headline": "Kwara NPC cautions stakeholders against interfering with pre-test exercise",
    "summarized_story": "The National Population Commission, NPC, in Kwara State has cautioned stakeholders to refrain from undue interference in the second pre-test census exercise in the state.\nThe second pre-test census exercise is part of the preparations for the main census exercise billed to take place in May 2022.\nThe Federal Commissioner appealed to state and local governments concerned, traditional institutions, and communities to support the commission in carrying out the second pre-test census exercise by allowing unfettered access to facilities and places to be enumerated.\nHe said the pre-test exercise will be carried out in four local government areas of the state, namely, Kaiama, Ilorin South, Offa and Oke-Ero.\nThe Federal Commissioner explained that pre-test census exercise is usually conducted before the actual census and primarily aimed at testing the census methodology, questionnaires, data collection methods, and manual for fieldwork among others."
  },
  {
    "headline": "Salary bailout: Kogi group passes vote of no-confidence on EFCC chairman",
    "summarized_story": "The Congress For Better Nigeria has passed a vote of no-confidence on the Chairman, Economic and Financial Crimes Commission, Mr. Abdulrasheed Bawa.\nDare said the no-confidence vote is hinged on the modus operandi of the EFCC Chairman.\nThe statement lamented that the EFCC on the Kogi issue is playing a political tool.\nDare, the mode of operation on the Kogi alleged N20 billion remains a dent on the EFCC.\nThis and many questions are begging for answers from the CBN.”N20 billion bailout: Kogi Assembly summons finance commissioner, sterling bank manager, others"
  },
  {
    "headline": "Hunters’ council pledges to work with security agencies, crush bandits",
    "summarized_story": "The Nigeria Hunters’ Council, Kebbi State chapter, on Thursday, expressed readiness to complement the efforts of security operatives in tackling banditry, cattle rustling, kidnapping, and other forms of criminalities across the country.\nMusa Hussaini-Rambow, Kebbi State Commander of the council, made the disclosure during a visit to One Battalion, Nigerian Army, Birnin Kebbi, and the state command of the Nigeria Security and Civil Defense Corps (NSCDC) in Birnin Kebbi on Thursday.\nHe explained that the primary objective of the council is to secure the forests and bushes where criminals have turned into their hideouts.\nI. Onyemabo, assured the readiness of the army to work with the hunters’ council to restore peace in the country.\nAlso responding, the NSCDC Commander in the state, Musa Bala, described security as everybody’s responsibility that needed support and cooperation of all while assuring to work with the hunters in terms of operations and intelligence gathering."
  },
  {
    "headline": "Your decision to increase cost of meters anti-people – Group knocks FG, NERC",
    "summarized_story": "A group, Coalition for Affordable and Regular Electricity (CARE), has condemned the Federal Government and the Nigerian Electricity Regulatory Commission (NERC) over a planned decision to increase the prices of meters.\nCARE in its reaction said that it was wrong to announce such a decision when Nigerians were still experiencing an erratic supply of electricity.\nOnakoya in the statement issued on Thursday explained that such a decision is a conspiracy between the NERC and distribution companies.\nHe further noted that such a decision will increase the economic hardship, which the majority of Nigerians are going through at this present time.\n“According to this agreement, all Nigerian Electricity consumers were promised to be freely metered by DISCOs within 18moths of the acquisition”."
  },
  {
    "headline": "Subsidy removal: 2022 budget has no provision for N5000 transport grant – Senate",
    "summarized_story": "The Senate has said there is no provision for the proposed N5,000 transport grant to cushion the effect of subsidy removal in the 2022 budget.\nSenate Committee Chairman on Finance, Senator Solomon Adeola Olamilekan stated this after he defended his committee’s report before the Committee on Appropriations chaired by Senator Jibrin Barau on Wednesday in Abuja.\nHe further posited that the 2022 budget proposal contained fuel subsidy and not a transportation grant which amounts to N2.4 trillion.\nSenator Olamilekan’s disclosure was contrary to the Minister’s submission weeks ago when she appeared before the Senate on Finance and said every citizen would be paid N5,000 as the Federal Government plans to remove fuel subsidy finally in 2022.\n“There are still a lot of issues to be deliberated upon and looked into if eventually, this will come to pass."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "102 native American children die at boarding school in Nebraska",
    "summarized_story": "Researchers in the U.S. state of Nebraska have identified 102 students who died at a government-run boarding school as Native American children, British newspaper The Independent said in a report.\nThe students, most of them young children, were identified as researchers continue to search for a cemetery used by the Genoa U.S. Indian Industrial School in Genoa with ground-penetrating radar in recent weeks.\nThe report said ranging in age from four to their early 20s, many of the children died from diseases such as tuberculosis, pneumonia and measles.\nMargaret Jacobs, a professor of history at the University of Nebraska-Lincoln and co-director of the project, said the true death toll of students at the federal boarding school is likely to be much higher than the 102 so far identified.\n- Advertisement -“These children died at the school, they did not get a chance to go home."
  },
  {
    "headline": "NDLEA intercepts cocaine worth N2.7bn at Abuja airport",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has intercepted 9.30 kilograms of cociane worth over N2.7 billion at Nnamdi Azikiwe International Airport (NAIA) Abuja.\nThe NDLEA spokesperson, Mr Femi Babafemi, in a statement on Thursday in Abuja, said a 32-year-old drug trafficker based in Liberia, Maduabuchi Chinedu, was arrested with the consignment.\nBabafemi said the suspect who hailed from Obaha Okigwe village, Okigwe Local Government Area of Imo state, lived in Liberia where he worked as a miner.\nHe said the suspect was arrested during an inward joint search of Ethiopian Airlines flight 911 at the Abuja airport on Nov. 24.\nHe said the drug, which weighed 9.30kg cocaine, was wrapped in candies wraps and concealed in the suspect’s luggage."
  },
  {
    "headline": "Troops eliminate over 90 terrorists in two weeks",
    "summarized_story": "The Defence Headquarters says troops of Operation Hadin Kai, have in the last two weeks eliminated more than 90 Boko Haram and Islamic States West Africa Province(ISWAP) terrorists in North East.\nBrig.-Gen. Bernard Onyeuko, the Acting Director, Defence Media Operations, disclosed this when he gave an update on military operations from Nov. 11 to Nov. 25 on Thursday in Abuja.\n- Advertisement -Onyeuko further disclosed that troops in Baga town arrested a notorious terrorist -Mr Haladu Saleh who has been on the wanted list since 2018.\nREAD ALSO: Troops neutralise IPOB member in ImoHe said that the troops also intercepted and impounded terrorists’ logistics supplies along Bukarti – Yusufari Road and Maima Hari Checkpoint on Biu – Damboa Road.\n”In the course of these operations, no fewer than 90 terrorists were neutralised and 21 of them arrested."
  },
  {
    "headline": "BREAKING: Buhari presides over Security Council meeting",
    "summarized_story": "President Muhammadu Buhari is presiding over the National Security Council (NSC) meeting at the State House, Abuja.\nThe President is expected to be briefed on latest security developments across the country.\nThe meeting is being attended among others by the Vice President Yemi Osinbajo; Chief of Staff to the President, Prof Ibrahim Gambari; National Security Adviser (NSA), Major General Babagana Monguno (rtd) and the Chief of Defence Staff (CDS), General Leo Irabor.\nRead Also: PHOTOS: Colonel Dodo decorated as Buhari’s Aide-De-CampThe three service chiefs of Army, Navy and Air Force as well as the Inspector General of Police, Usman Alkali Baba, are also attending the meeting.\n- Advertisement -Before the commencement of the meeting, Buhari, with the assistance of Osinbajo, decorated his Aide De Camp (ADC), Lt Col Yusuf Mukhtar Dodo, with his new red neck rank of Colonel."
  },
  {
    "headline": "IPOB activities reducing in South East – DHQ",
    "summarized_story": "In the course of these operations, troops amicably resolved farmers/herders clashes and averted bloody clash between 2 families over land disputes.\nIn Delta State, some feats were recorded at different locations in; Warri South, Warri South West, Ovwie, Warri North and Isoko North LGAs.\nOther locations include; Ohaji LGA of Imo, Bakassi LGA of Cross River State and Ukwa West LGA of Abia State.\nAlso, troops recovered a total of 27 assorted arms and 586 rounds of assorted ammunition in the course of the operations.\nSECESSIONISTS’ ACTIVITIESThe IPOB/ESN elements activities in the South East drastically reduced in recent times."
  },
  {
    "headline": "Bandits rape 30 Niger women in one day",
    "summarized_story": "No reason was given by the bandits for their action as source close told Daily Sun that their mission was just to rape women in the communities, including young girls.\nThe affected communities where the bandits carried out their heinous crime include Dnasa, Iburo, Pelele, Gofa and Nakogbe, all in Shiroro local government area.\nEvery woman or girl sighted by the bandits was dragged to her room and raped in broad daylight.\nIt was gathered that about 30 women and girls were raped, with two to three bandits raping one woman during the sex extravaganza as they moved from one community to another in their motorcycles.\nThere has not been any statement from the security agents on the latest incident which has left many of the affected women and girls traumatised."
  },
  {
    "headline": "Most bank frauds perpetrated by insiders – EFCC",
    "summarized_story": "By Ginika OkoyeThe Economic Financial Crimes Commission (EFCC) declared in Abuja, yesterday, that most frauds in the banking sector were perpetrated by insider Information, Communication Technology (ICT) employees.\nHead, Cybercrime Section of the EFCC, Mr Abbah Sambo, made the declaration at a national seminar on Banking and Allied Matters for judges.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe said that most banking sector fraud handled by the commission showed that bank employees aided the acts.\nHe also expressed regret at the increasing rate of cybercrime in spite of efforts by the commission to tackle it."
  },
  {
    "headline": "Economic affairs gets lion’s share as Sanwo-Olu presents N1.38trn budget estimate for 2022",
    "summarized_story": "By Sunday Ani and Lukman OlabiyiThe Lagos State Governor, Babajide sanwo-Olu, yesterday, presented a budget estimate of N1.38 trillion to the House of Assembly with economic affairs sector getting the lion’s share of N325,014,165,395 or 23.41 percent and the social protection sector the least with N6,109,828,1603 or 0.71 percent.\nThe general public services got N235,400,815,610 (16.96 percent), Public order and safety, N61,710,691,428 (4.45 percent) and environment, N49,846,704,975 (3.59 percent) in the appropriation bill tagged Budget of Consolidation.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe noted that the challenging environment required that government focused its interventions in areas of greatest social impact to achieve the greatest good for the greatest number in the shortest possible time.\nAccording to the governor, the budget comprises total revenue of N1.135 trillion and a deficit financing of N203.126 billion."
  },
  {
    "headline": "Nigeria receives looted Benin, Ife artefacts from US museum",
    "summarized_story": "The Consulate-General of Nigeria in New York has taken custody of three Benin and Ife artefacts from the Metropolitan Museum of Art (MET) in New York.\nThe News Agency of Nigeria (NAN) reports that the Director-General, National Commission for Museums and Monuments (NCMM), Prof. Abba Tijjani, received the artefacts from the museum in company of the Consul-General of Nigeria in New York, Ambasador Lot Egopija.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nProf. Tijjani, who later signed a Memorandum of Understanding (MoU) with MET, commended the museum for returning the artefacts and urged other museums in possession of Nigerian artefacts to follow its exemplary gesture.\nThat the two 16th-century Benin brass plaques and the 14th-century Ife brass head were later taken to the Consulate-General of Nigeria in New York for eventual return to Nigeria at a later date."
  },
  {
    "headline": "Buhari Presides over Security Meeting, Decorates ADC With New Rank",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Thursday presided over the National Security Council (NSC) meeting at the State House, Abuja.\nThe meeting is being attended among others by the Vice President Yemi Osinbajo, Chief of Staff to the President, Prof Ibrahim Gambari; National Security Adviser (NSA), Major General Babagana Monguno (rtd) and the Chief of Defence Staff (CDS), General Leo Irabor.\nThe three service chiefs of Army, Navy and Air Force as well as the Inspector General of Police, Usman Alkali Baba, are also attending the meeting.\nThe President is expected to be briefed about latest security developments across the country.\nBefore the commencement of the meeting, President Buhari with the assistance of Vice President Osinbajo decorated his Aide De Camp (ADC), Lt Col Yusuf Mukhtar Dodo, with his new red neck rank of Collonel."
  },
  {
    "headline": "Nigeria Will Survive Its Challenges, Despite Escalating Grievances, Says Fitch",
    "summarized_story": "The UK-based organisation stated this in a report titled, “Nigeria Country Risk Report – Q1- 2022,” which also included a 10-year forecast to 2030, obtained yesterday.\n“Our core view is that the Nigerian state will survive these interlocking challenges, although they will weigh on growth by deterring investment and impeding private consumption.\nThere is a downside risk, however, that ethno-religious divides will eventually lead to the break-up of the state.\nThe Fitch report said this position by the northern governors would likely exacerbate rifts with southern political leaders from both parties who believe that it would be their turn to control the presidency.\n“The latter generally are poorer and would potentially see a fall in their VAT revenue, which under the current system effectively leads to southern states cross-subsidising northern ones."
  },
  {
    "headline": "Ayiri Arraigned for Allegedly Stealing Olu of Warri’s Crowns worth N2bn",
    "summarized_story": "Sylvester Idowu in WarriThe deposed Ologbotsere of Warri Kingdom, Ayirimi Emami, was yesterday arraigned at a Warri Chief Magistrates’ Court over alleged stealing of two royal crowns worth N2 billion belonging to Warri Kingdom.\nAccording to the charge sheet with No: MW/178 C/ 2021, Emami, along with others now at large, allegedly committed the offence about 11.30 pm on March 30 this year in the house of the Olu of Warri.\nSimilarly, police prosecuting counsel, SP Sunday Irabor, said the discretion of granting bail lied within the court.\nHe, however, called for a stringent bail condition, stressing that the sureties must be reliable.\nMr. Fabius Jemide Atie held watching brief on behalf of Olu of Warri Palace."
  },
  {
    "headline": "Infrastructure, Education Top Sanwo-Olu’s N1.39trn 2022 Budget for Lagos",
    "summarized_story": "The budget proposal, christened, “Budget of Consolidation,” would be the last full-year fiscal plan of the state before the next general election.\nAbout N823.4 billion, representing 59 per cent of the 2022 budget, was earmarked for capital expenditure.\nHe said, “Year 2022 budget is the next step on our journey to true and sustainable greatness in Lagos.\n“It is in this light that we are presenting the Year 2022 Budget of Consolidation with a size of N1,388,285,459,990.51.\nObasa promised a speedy and meticulous vetting of the 2022 budget proposal."
  },
  {
    "headline": "National Carrier, Nigeria Air, to Commence Operations April 2022",
    "summarized_story": "•FG, Nigerians own 51 equity shares, to generate 70,000 jobsDeji Elumoye in AbujaThe national carrier, Nigeria Air, is set to begin flight operations by April 2022.\nSirika explained that in the new national carrier, the federal government will have five percent equity shares, Nigerian entrepreneurs 46 per cent equity shares, while the expected international strategic partners would have 49 equity shares.\nSirika stressed that FEC had given approval for the new national carrier.\nAccording to him, “Today (Wednesday) in Council, civil aviation presented two memoranda.\nOne of the memos is approval of the outline business case for the establishment of the national carrier and this is the sixth time the memorandum appeared before Council."
  },
  {
    "headline": "EXPOSED: How Nigerian Officials Diverted $100,000 Meant For Women Basketball Team, D'Tigress, Owe Each Player $4,900 Allowances",
    "summarized_story": "Speaking with SaharaReporters, a member of the senior women basketball team, D’Tigress, revealed that their allowances, bonuses, training grant worth $4,900 had also not been paid.\nShe added that none of the D’Tigress team members would show up in camp in preparation for the February 2022 FIBA World Cup if the Nigerian government failed to pay them.\nDonations made by banks for players, officials, volunteer stipends etc.\n“They forget we all have a relationship and do communicate; $500 each 2018 FIBA World Cup for players and officials; $1,000 each for finishing final 8 in FIBA World Cup; $1,000 each bonus for winning AfroBasket in Senegal for 2019 players and officials.\nThe $100,000 donated by three Nigerian banks to all the players and officials that made D’Tigress Olympics qualification possible final roster."
  },
  {
    "headline": "EXPOSED: How Nigerian Officials Diverted $100,000 Meant For Women Basketball Team, D'Tigress, Owe Each Player $4,900 Allowances",
    "summarized_story": "Speaking with SaharaReporters, a member of the senior women basketball team, D’Tigress, revealed that their allowances, bonuses, training grant worth $4,900 had also not been paid.\nShe added that none of the D’Tigress team members would show up in camp in preparation for the February 2022 FIBA World Cup if the Nigerian government failed to pay them.\nDonations made by banks for players, officials, volunteer stipends etc.\n“They forget we all have a relationship and do communicate; $500 each 2018 FIBA World Cup for players and officials; $1,000 each for finishing final 8 in FIBA World Cup; $1,000 each bonus for winning AfroBasket in Senegal for 2019 players and officials.\nThe $100,000 donated by three Nigerian banks to all the players and officials that made D’Tigress Olympics qualification possible final roster."
  },
  {
    "headline": "BREAKING: PUMA To Sue Nigeria Over Breach Of Contract After Terminating Over N1Billion Deal With Country",
    "summarized_story": "German sportswear manufacturing giant, PUMA plans to sue the Athletics Federation of Nigeria (AFN) and the Federal Ministry of Youth and Sports.\nThe deal, signed by the Gusau-led AFN, was due to expire in 2022, Punch reports.\nIn the latest development, PUMA officials have got in touch with officials of Gusau-led AFN informing them of an intention to sue.\nIn the letter, the DSS stated, “This Service (DSS) has thoroughly investigated the matter regarding the Puma deal.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "BREAKING: PUMA To Sue Nigeria Over Breach Of Contract After Terminating Over N1Billion Deal With Country",
    "summarized_story": "German sportswear manufacturing giant, PUMA plans to sue the Athletics Federation of Nigeria (AFN) and the Federal Ministry of Youth and Sports.\nThe deal, signed by the Gusau-led AFN, was due to expire in 2022, Punch reports.\nIn the latest development, PUMA officials have got in touch with officials of Gusau-led AFN informing them of an intention to sue.\nIn the letter, the DSS stated, “This Service (DSS) has thoroughly investigated the matter regarding the Puma deal.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "Real Madrid Striker, Benzema Bags One-Year Jail Term Over Sex Tape",
    "summarized_story": "France and Real Madrid forward Karim Benzema, was sentenced to a one-year suspended jail term on Wednesday.\nHe was found guilty of complicity in the attempted blackmail of a former international teammate over a sex tape.\nHe is due to play for Real Madrid against Moldovan side Sheriff Tiraspol later in the day.\nProsecutors had argued that Benzema had encouraged Valbuena to pay a suspected group of blackmailers to keep the sexually explicit tape out of the public eye.\nThe Real Madrid striker was recruited by the alleged blackmailers to encourage Valbuena to pay as his teammate stalled, the prosecution had added."
  },
  {
    "headline": "MATTERS ARISING: After three rejections, will Buhari finally sign the electoral bill?",
    "summarized_story": "The national assembly, on Friday, transmitted the electoral act amendment bill to President Muhammadu Buhari for assent.\nThe electoral act amendment bill has been a subject of public debate ever since it was reintroduced in the ninth assembly.\nThe opposition party described the approval of direct primaries for political parties as a “plot to introduce anarchy during internal party elections”.\nOur campaigns will be anchored on our performance in the last four years.”WILL BUHARI SIGN ELECTORAL BILL INTO LAW?\nIn September 2018, Buhari turned down the bill for the second time, asking the national assembly to revise some clauses."
  },
  {
    "headline": "MATTERS ARISING: After three rejections, will Buhari finally sign the electoral bill?",
    "summarized_story": "The national assembly, on Friday, transmitted the electoral act amendment bill to President Muhammadu Buhari for assent.\nThe electoral act amendment bill has been a subject of public debate ever since it was reintroduced in the ninth assembly.\nThe opposition party described the approval of direct primaries for political parties as a “plot to introduce anarchy during internal party elections”.\nOur campaigns will be anchored on our performance in the last four years.”WILL BUHARI SIGN ELECTORAL BILL INTO LAW?\nIn September 2018, Buhari turned down the bill for the second time, asking the national assembly to revise some clauses."
  },
  {
    "headline": "Senate panel counters finance minister, says N5k transport grant not in 2022 budget",
    "summarized_story": "The senate committee on finance says there is no provision of N5,000 transportation grant for N40 million poor Nigerians in the 2022 budget.\nAdvertisementZainab Ahmed, minister of finance, budget and national planning, had said the country would remove petrol subsidy by 2022 and replace it with a N5000-a-month transportation grant to the poorest Nigerians.\nOlamilekan said a proposal has to be sent to the national assembly for a provision to be made for 40 million poor citizens.\n“The minister of finance, budget and national planning was quoted as saying that 40 million Nigerians will be paid N5,000 as transportation allowance, in lieu of the fuel subsidy.\n“This is not provided for already in the 2022 budget We don’t have anywhere in the budget where 40 million Nigerians will collect N5 000 monthly as transportation allowance totaling about N2.4 trillion."
  },
  {
    "headline": "Senate panel counters finance minister, says N5k transport grant not in 2022 budget",
    "summarized_story": "The senate committee on finance says there is no provision of N5,000 transportation grant for N40 million poor Nigerians in the 2022 budget.\nAdvertisementZainab Ahmed, minister of finance, budget and national planning, had said the country would remove petrol subsidy by 2022 and replace it with a N5000-a-month transportation grant to the poorest Nigerians.\nOlamilekan said a proposal has to be sent to the national assembly for a provision to be made for 40 million poor citizens.\n“The minister of finance, budget and national planning was quoted as saying that 40 million Nigerians will be paid N5,000 as transportation allowance, in lieu of the fuel subsidy.\n“This is not provided for already in the 2022 budget We don’t have anywhere in the budget where 40 million Nigerians will collect N5 000 monthly as transportation allowance totaling about N2.4 trillion."
  },
  {
    "headline": "Inside Benue communities where residents dig shallow pits to get dirty drinking water",
    "summarized_story": "The community river once served the residents so well that they never felt the need to have boreholes.\nA significant number of residents rely on a shallow well dug inside a swamp beside the dried-up river.\nRegardless of the state of the water, residents are always at the river bank to scoop some for their daily use.\nThe community had water pollution sometime ago and part of the interventions was to ameliorate their plight of bad water.\nAnd despite the milky colour of the water, children are always found around them; excited to fill their basins and pots to the brim."
  },
  {
    "headline": "African female founders need access to high-impact mentors",
    "summarized_story": "Beyond funding, African female entrepreneurs need access to high-impact mentors and who are willing to open up their network and teach what they know.\nWhile FirstCheck argues that African women in tech are “over-mentored” and “under-funded”, early-stage female founders need some handholding.\nSo Ouffata founded The African Tech Vision (ATV) to create and open up entrepreneurial pathways for ambitious African female founders and executive leaders.\nEmpowering African female entrepreneurs at scaleThe African Tech Vision is a free entrepreneurial programme designed to support early-stage African female founders and help them achieve their goals.\nFor Ouffata, betting on African female founders is a personal decision that fits into the larger vision of The African Tech Vision program."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Nigerian fintech startup, FairMoney, hosts its first “Investor Conference”",
    "summarized_story": "Laurin Hainy, CEO and Co-Founder of FairMoneyAs of October 2021, Africa: The Big Deal reported that 57% of the amounts raised which was slightly above $1.6 billion has gone to fintech startups.\nOne such fintech is FairMoney, a digital bank that currently offers lending services in Nigeria, India, and France.\nL – R: Oluwatomide Oluwole, Finance Manager, FairMoney; Henry Obiekea, VP CapitalMarkets, FairMoney; Yaw Mante, Head, Finance – FairMoney and James Edeh, Head,Compliance, FairMoney, at the FairMoney investor’s conference.\nThey need to be able to pay, they need to be able to save, they need to be able to invest.\nThere was also a panel session on the role of fintech startups in financial inclusion in Nigeria."
  },
  {
    "headline": "Nigeria’s ranking on NFTs, Asilimia’s $2m funding, OnePipe’s $3.5m seed",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Nigerians and NFTsAsilimia’s $2m fundingOnePipe’s $3.5m seedNigeria’s NFT rankingA new report by Finders.com shows that 13.7% of Nigerian Internet users own non-fungible tokens (NFTs).\nThe report was based on a survey conducted on 1,205 Nigerian Internet users.\nThe survey also went on to estimate that Nigeria’s NFT ownership rate could reach 35% as 21.7% of the surveyed Internet users, plan to own NFTs.\nCan 1,205 Internet users out of 101.72 million tell the true story about NFTs in Nigeria?\nOnePipe’s $3.5m seedOnePipe teamNigerian fintech API, OnePipe, has closed a $3.5 million seed, co-led by Atlantica Ventures, Tribe Capital and V&R Associates."
  },
  {
    "headline": "Mr Eazi’s tech journey, Thepeer’s solution for businesses, Busha’s seed round",
    "summarized_story": "Share this article:Hi there,Here’s what I’m discussing today:Mr Eazi’s tech journeyThepeer’s solution for businessesBusha’s seed roundMr Eazi’s tech journeyMr Eazi.\nCloser home, Ajibade Oluwatosin, popularly known as Mr Eazi, has in a short time built a career that only few dream of.\nAfter leaving the university with a degree in mechanical engineering, Mr Eazi tried his hands at various things, including gold trading.\nRead more: “Watch out for Pastor Eazi!” – Mr Eazi on creative prospects beyond tech investmentsHow Thepeer plans to aid the interoperability of businesses in AfricaMichael Okoh and Chike Ononye, Co-founder of Thepeer.\nThe result was Thepeer, a startup building the infrastructure for businesses to share data easily."
  },
  {
    "headline": "How lack of local capacity to contain major spills worsens Nembe oil leak",
    "summarized_story": "The oil spill at the Santa Barbara oil field, OML 29 located in Nembe Local Government Area of Bayelsa state has gone uncontained after three weeks because Nigeria lacks the capacity, the head of the government agency combating oil leaks has said.\nThe Bonga oil spill in 2011 reportedly sent over 40,000 barrels of oil into 20 riverine communities across Akwa Ibom, Bayelsa and Delta State in Nigeria.\nIt was only contained with the invitation of Oil Spill Response Limited (OSRL), the largest international industry-funded cooperative which exists to respond to oil spills wherever in the world they may occur.\nOver the course of three weeks, it is conceivable that thousands of oil barrels may have leaked from the facility.\nThis poor capacity has worsened oil leaks in recent times."
  },
  {
    "headline": "Oil firms ignore Nigeria, pump fresh dollars into Libya",
    "summarized_story": "“I want to contribute to Libya’s comeback,” Patrick Pouyanne, TotalEnergies’ CEO, said at this week Libya’s Energy & Economic Summit 2021, the country’s first prominent energy forum in over 10 years.\nGlobal oil producer, Shell, is among the big producers that recently kick-started a disinvestment drive from its oil assets in the Niger Delta.\nTotal operated under a joint venture partnership with Shell and Italian firm Agip Oil Company in the OML 17 — both of which are also disinvesting from the project.\nBeyond lack of investments, a new wave of security threats in Nigeria has emerged that could further dent Nigeria’s production.\n“Lately, there have been groups in communities in the Niger Delta, who while seeking for cash and attention, have been vandalising oil pipelines,” a Nigeria-based official at a Western oil company said."
  },
  {
    "headline": "Retail rising but no jobs to show",
    "summarized_story": "New jobs created in the small-scale retail and trade sectors following COVID-19 pandemic have not been as productive with only a few yielding secure earnings, a recent World Bank report notes.\nIt also notes that the general shift towards retail and trade is unlikely to represent an acceleration of structural transformation or a true shift towards more productive work outside of agriculture.\nStructural transformation is the transition of an economy from low productivity and labour-intensive economic activities to higher productivity and skill-intensive activities.\nDeveloped economies like Hong Kong, Singapore, South Korea and Taiwan, also known as Asian Tigers, are fuelled by exports and rapid industrialisation, thanks to structural transformation.\nSo, it is highly unlikely for structural transformation to take place,” he said."
  },
  {
    "headline": "SEC laments resurgence of Ponzi schemes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Securities and Exchange Commission (SEC) has frowned at the resurgence of Ponzi schemes and illegal fund managers in the country’s financial sector.\nHe regretted that the upsurge of the schemes had undermined the reputation of the financial markets and dampened investors’ confidence, among other things.\n“SEC firmly believes that the country’s capital market can attain its potential if market operators and participants contribute their respective quotas to the growth.\n“The demography of investors in the country’s capital market shows that our young population do not participate in the capital market, and only few Nigerians invest in the capital market.\nAhmed said the workshop was in line with the commission’s Capital Market Master Plan (CMMP)."
  },
  {
    "headline": "NDLEA dismisses budget padding allegation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The National Drug Law Enforcement Agency, (NDLEA) has dismissed insinuations in some reports that its proposed 2022 budget was padded with N4.5 billion.\nThe Director, Media and Advocacy, NDLEA, Mr Femi Babafemi, said this in a statement on Wednesday in Abuja.\nBabafemi said the agency had been inundated with calls and messages since Tuesday, seeking clarification on an alleged insertion of N4.5 billion into the NDLEA’s proposed budget being considered by the Senate.\n“It is public knowledge that President Muhammadu Buhari magnanimously approved the construction of barracks for NDLEA over a period of four years, starting from 2022 fiscal year.\n“The typo error has since been corrected and the budget cleared on Tuesday by the Senate Committee,” he said."
  },
  {
    "headline": "Land Grabbing Allegation: Secretary, Benin Traditional Council, Frank Irabor debunks media reports – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Secretary , Benin Traditional Council, Mr Frank Irabor has debunked the malicious, defamatory and misleading information in the social media that he (Secretary) have been arrested and taking to the Edo State criminal investigative department in Benin city over alleged land grabbing for interrogation.\nIn a statement personally signed and made available to the NIGERIAN OBSERVER yesterday, Mr Frank Irabor said he was never arrested talkless of being detained at the criminal investigative department of the state police command over the afore-mentioned issue.\nAccording to the Secretary, normally, I would not have bothered to utter a single word, but for reasons of clarification and putting the record in its proper perspective, I have decided to respond accordingly.\nContinuing, he stated that he had never been involved in any land grabbingsaga, adding that the real land grabbers have never been comfortable with his (secretary) stand against land grabbing in the Benin kingdom.\n“Those that concocted this false publication are social media miscreants and should be ignored in its entirety, as I remained committed to the services of the great Oba of the great Benin kingdom, Omo N’ Oba N’ Edo Ukpu Akpolokpolo, Oba Ewuare II.” he asserted."
  },
  {
    "headline": "Rough days ahead for land grabbers as Obaseki sets to reconstitute c’ttee for protection of private property – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is set to reconstitute the Private Property Protection (PPP) Committee to deal with cases of encroachment and land grabbing in the state.\nObaseki, who spoke to journalists in Benin City, the Edo State capital, said the state has amended Private Property Protection Law 2017 and set up a special court to prosecute offenders, as part of efforts to curb the criminal activities of land grabbers and property speculators.\nAccording to the governor, “We are committed to ending land grabbing in Edo State and will next week inaugurate the Committee for the Protection of Private Property (PPP).”Recall that the governor had, on July 27, 2021, assented to the bill repealing the Edo State Private Property Protection Law 2017 and re-enacting the Edo State Private Property Protection Law 2021.\nWhile assenting to the bill, Obaseki stated that the law “affects law and order in the State.\n“We are setting up a special court to swiftly try offenders and if guilty, they will certainly face the consequences.”..."
  },
  {
    "headline": "In Reality – What Does COP26 Mean for Small Businesses?",
    "summarized_story": "But what does COP26 stand for, and what exactly does the conference mean for small businesses?\nWhat Does COP 26 Mean?\nWhat Has COP Achieved So Far, and What are the Objectives of COP26?\nIn the build-up to COP26, thousands of firms committed to eliminating carbon emissions by 2050, primarily by supporting the UN’s Race to Zero campaign.\nIn addition to contributing to positive environmental change, such firms can also benefit economically from reducing their carbon emissions."
  },
  {
    "headline": "Finance Minister, Ahmed urges investors to take advantage of master plan initiatives",
    "summarized_story": "Investors in the capital market have been urged to take advantage of initiatives introduced in the capital market which are aimed primarily at strengthening the market and accelerating development.\nThe 10- Year Master Plan initiatives include e-dividend Mandate system, Direct Cash Settlement, Regularisation of Multiple Accounts, National Investors Protection Fund, Recapitalisation of Capital Market Operators and Complaints Management Framework among others.\nShe said, “It is worthy to know that the SEC marked out a 10-year plan for development of the Nigerian capital market.\n“I enjoin participants to take advantage of initiatives introduced in the capital market which are aimed primarily at strengthening the market and accelerating development.\nThe demography of investors in the Nigerian capital market shows that our young population do not participate in the capital market, and only few Nigerians invest in the capital market."
  },
  {
    "headline": "NGX Hosts 9th Nigerian Capital Market Information Security Forum",
    "summarized_story": "Nigerian Exchange Limited (NGX) organised the 9th edition of the Nigerian Capital Market Information Security Forum (NCMISF), themed, “Navigating the Post-Pandemic Cyber Security Imperatives”, on Tuesday, 23 November 2021.\nThe one-day free to attend event brought together leading industry data privacy and security experts and capital market stakeholders virtually to share actionable information and ideas on post-pandemic effects, survival strategies and optimal pathways for the capital market and the ecosystem at large.\nIn her opening remarks, the Acting Chief Risk Officer, Enterprise Risk Management, NGX, Mrs. Oluyemi Obadare noted that, “The coronavirus has accelerated a second digital revolution not seen since the dot-com boom of the early 2000s.\nLikewise, it has made criminal minds increasingly motivated to innovate and digitize their attacks, as there has been an increased demand for information online.\nCovid-19 did not only cause a health pandemic, but a cyber-crime pandemic too and the potential impacts are here to stay."
  },
  {
    "headline": "Subsidy: NLC/Senate, FG clash over N5,000 palliative",
    "summarized_story": "BY EMEKA EJEREThe Nigeria Labour Congress (NLC) and the Nigerian Senate, on Wednesday faulted the federal government’s plan to pay N5,000 each to 40 million Nigerians to cushion the effect of fuel subsidy removal.\nBut the government promised on Tuesday that it had plans to cushion the economic effect of the planned subsidy removal, as it announced plans to replace fuel subsidy with a N5,000 monthly transportation subsidy to the poor.\nAccording to her, a monthly transport subsidy in the form of cash transfer of N5,000 will be given to between 30 and 40 million Nigerians.\n“The total amount involved in this queer initiative is far more than the money government claims to spend currently on fuel subsidy.\nApart from our concerns on the transparency of the disbursement given previous experiences with such schemes, we are wondering if government is not trying to rob Nigerians to pay Nigerians?"
  },
  {
    "headline": "Enenche, Ortom, Udom, Others Pray For Nigeria At Dunamis 25th Anniversary",
    "summarized_story": "The senior pastor of Dunamis International Gospel Centre, Dr Paul Enenche, on Wednesday, at the Glory Dome of Dunamis International Gospel Centre Abuja, led some political and diplomatic leaders in a prayer session for Nigeria and other nations of the world.\nGovernors, Senators, House of Assembly members, as well as political and diplomatic leaders went on their knees alongside worshipers to pour out their hearts to God to heal Nigeria of every bloodshed and unrest.\nThey prayed for speedy recovery of the nation from shackles of insecurity and agenda of the enemies to be frustrated permanently.\nThe event was day three of the ongoing Kingdom Power and Glory World Conference 2021, making the 25th anniversary of Dunamis church.\nSpeaking earlier on the topic: ‘Exceeding Abundant Grace (2) – the life of David’, Dr Enenche said: “If you have not lost your passion for God then you cannot lose your portion in life."
  },
  {
    "headline": "Enenche, Ortom, Udom, Others Pray For Nigeria At Dunamis 25th Anniversary",
    "summarized_story": "The senior pastor of Dunamis International Gospel Centre, Dr Paul Enenche, on Wednesday, at the Glory Dome of Dunamis International Gospel Centre Abuja, led some political and diplomatic leaders in a prayer session for Nigeria and other nations of the world.\nGovernors, Senators, House of Assembly members, as well as political and diplomatic leaders went on their knees alongside worshipers to pour out their hearts to God to heal Nigeria of every bloodshed and unrest.\nThey prayed for speedy recovery of the nation from shackles of insecurity and agenda of the enemies to be frustrated permanently.\nThe event was day three of the ongoing Kingdom Power and Glory World Conference 2021, making the 25th anniversary of Dunamis church.\nSpeaking earlier on the topic: ‘Exceeding Abundant Grace (2) – the life of David’, Dr Enenche said: “If you have not lost your passion for God then you cannot lose your portion in life."
  },
  {
    "headline": "TETFund Approves N12bn For Establishment Of 12 Centres Of Excellence",
    "summarized_story": "The Tertiary Education Trust Fund (TETFund) has allocated the sum of N1billion each for the establishment of 12 additional Centres of Excellence (CoEs) in tertiary institutions.\nRecall that under the 2020 intervention, 12 TETFund Centers of Excellence were established in universities.\nThe centres are; Federal Polytechnic Nasarawa and Federal College of Education, Pankshin (North-Central); Federal Polytechnic, Bauchi and Federal College Education, Yola (North-East); Federal Polytechnic, Kaduna and Federal College of Education, Zaria (North-west); Federal Polytechnic, Nekede and Alvan Ikoku Federal of Education, Owerri (South-East); Federal Polytechnic, Auchi and Federal College of Education (Technical) Omoku (South-South); Yaba College of Technology, Lagos and Adeyemi College Education, Ondo (South-West).\nHe said one of the basic strategic aims for establishment of Centres of Excellence is to support strategic and applications-oriented research and expertise with potential industrial applications.\nSimilarly, he said the task before the six Colleges of Education selected to host TCOES is to specialise in pedagogy and periodic curriculum review and development."
  },
  {
    "headline": "TETFund Approves N12bn For Establishment Of 12 Centres Of Excellence",
    "summarized_story": "The Tertiary Education Trust Fund (TETFund) has allocated the sum of N1billion each for the establishment of 12 additional Centres of Excellence (CoEs) in tertiary institutions.\nRecall that under the 2020 intervention, 12 TETFund Centers of Excellence were established in universities.\nThe centres are; Federal Polytechnic Nasarawa and Federal College of Education, Pankshin (North-Central); Federal Polytechnic, Bauchi and Federal College Education, Yola (North-East); Federal Polytechnic, Kaduna and Federal College of Education, Zaria (North-west); Federal Polytechnic, Nekede and Alvan Ikoku Federal of Education, Owerri (South-East); Federal Polytechnic, Auchi and Federal College of Education (Technical) Omoku (South-South); Yaba College of Technology, Lagos and Adeyemi College Education, Ondo (South-West).\nHe said one of the basic strategic aims for establishment of Centres of Excellence is to support strategic and applications-oriented research and expertise with potential industrial applications.\nSimilarly, he said the task before the six Colleges of Education selected to host TCOES is to specialise in pedagogy and periodic curriculum review and development."
  },
  {
    "headline": "Federal Govt Canvasses Involvement Of States In AfCFTA Implentation Plan",
    "summarized_story": "Minister of industry, trade and investment, Otunba Niyi Adebayo, said for Nigeria to succeed in AfCFTA, state governments must be actively involved.\nAdebayo who stated this at the AfCFTA Subnational Strategy Workshop, with the theme: “Creating Economically Viable Communities,” said it has become very important to be closer to subnational and grassroots levels, the National AfCFTA Implementation Plan of the government.\nThe minister represented by Ambassador Yonov Agah, Director General of Nigerian Office for Trade Negotiations (NOTN), said to harness the gains of AfCFTA and achieve maximum results, each state must come up and execute its own AfCFTA strategy.\nThe minister said Nigeria cannot afford to be left out of the emerging African economic block, stressing that AfCTA is a 3.4 trillion dollar economic bloc, which Nigeria must play a leading role.\nAdebayo also said government has worked tirelessly to ensure that Nigeria not only partakes as a signatory in name but become a major trade and economic powerhouse."
  },
  {
    "headline": "Injured limb: Nollywood star, Clem Ohameze set for surgery",
    "summarized_story": "Veteran actor Clem Ohameze has considered undergoing a procedural surgery to correct his lower limb.\nOhaneze said: “My name is Clem Ohaneze, Sometime back, I was involved in a car accident.\nWhile I was being treated, they discovered that my lower limb was kind of affected.\nAnd the result of the x-ray showed that my cervical vertebrae 3 had collapsed on cervical vertebrae 4.\nAnd that was what caused the retardment of the lower limb."
  },
  {
    "headline": "Injured limb: Nollywood star, Clem Ohameze set for surgery",
    "summarized_story": "Veteran actor Clem Ohameze has considered undergoing a procedural surgery to correct his lower limb.\nOhaneze said: “My name is Clem Ohaneze, Sometime back, I was involved in a car accident.\nWhile I was being treated, they discovered that my lower limb was kind of affected.\nAnd the result of the x-ray showed that my cervical vertebrae 3 had collapsed on cervical vertebrae 4.\nAnd that was what caused the retardment of the lower limb."
  },
  {
    "headline": "North-West governors visit Ikoyi collapsed building site",
    "summarized_story": "The Governors also sympathised with the people of the State and families of those who died in the unfortunate incident.\nThe North-West Governors Forum represented by its chairman and Kastina State Governor, Rt.\nAminu Bello Masari and his Kano State counterpart, Dr. Abdullahi Ganduje, commended Governor Sanwo-Olu for setting up a Tribunal of Inquiry into the collapsed building.\nIt would be recalled that a 21-storey building, still under construction, collapsed on Monday, November 1 at Gerrard Road, Ikoyi.\nSpeaking during the visit to the Collapsed Building, Masari, who was accompanied by Governors Ganduje and Sanwo-Olu, said they are happy that the Governor of Lagos State has instituted a tribunal of inquiry to unravel issues surrounding the collapsed building."
  },
  {
    "headline": "North-West governors visit Ikoyi collapsed building site",
    "summarized_story": "The Governors also sympathised with the people of the State and families of those who died in the unfortunate incident.\nThe North-West Governors Forum represented by its chairman and Kastina State Governor, Rt.\nAminu Bello Masari and his Kano State counterpart, Dr. Abdullahi Ganduje, commended Governor Sanwo-Olu for setting up a Tribunal of Inquiry into the collapsed building.\nIt would be recalled that a 21-storey building, still under construction, collapsed on Monday, November 1 at Gerrard Road, Ikoyi.\nSpeaking during the visit to the Collapsed Building, Masari, who was accompanied by Governors Ganduje and Sanwo-Olu, said they are happy that the Governor of Lagos State has instituted a tribunal of inquiry to unravel issues surrounding the collapsed building."
  },
  {
    "headline": "Just In: Veteran Comic Actor Baba Suwe Buried In Lagos (Photos)",
    "summarized_story": "Babatunde Omidina, well known as Baba Suwe, a veteran comedy performer, was laid to rest today.\nOn Monday, the actor died in the Lagos neighborhood of Ikorodu.\nArewa Okunrin, Owo laso oge, Obáj’obalo, kób gómnà, Ojabo Kofo, Teni Teni, and others are among his other films.\nThe actor was charged with cocaine trafficking by the National Drug Law Enforcement Agency in 2011.\nA Lagos High Court later determined that this was untrue and defamatory."
  },
  {
    "headline": "BREAKING: Family Mourns As Former Information Minister, Dora Akunyili’s Husband, Chike Lies In State",
    "summarized_story": "Dr. Chike Akunyili, the late husband of Dora Akunyili, former Minister of Information and Director-General of the National Agency for Food and Drug Administration Control (NAFDAC), laid in state at his home in Agulu, Anambra State, on Thursday morning.\nPeter Obi, a former governor of Anambra State, was also present.\nThe deceased’s Pontifical Requiem Mass will be held at Madonna Catholic Church in Agulu, Anambra State’s Anaocha local government area, followed by interment at his rural residence.\nOn September 29, 2021, in Anambra State, Dr. Akunyili, a medical practitioner, was slain by unknown gunmen.\nOn Friday, in-laws, friends, and well-wishers will pay condolences, and on Sunday, a thanksgiving ceremony will be held at Madonna Catholic Church in Agulu."
  },
  {
    "headline": "Gov. Matawalle Shuts Down Zamfara Filling Station, Bakery For Helping Bandits",
    "summarized_story": "For assisting bandits, Governor Bello Matawalle has shut down a filling station and bakery.\nThe Zamfara Task Force Committee on Compliance with Mr Matawalle’s Executive Order on Insecurity ordered the closure of a filling station and bakery in the Gusau and Tsafe local government areas on Wednesday.\nAbubakar Dauran, the committee’s chairman, issued the order immediately after security forces captured four suspects for allegedly supplying bandits with bread and gasoline.\nMr Dauran stated that the filling station in Tsafe town would be closed because it was selling gasoline products to the robbers’ accomplices.\n“Both the filling station and bakery house will be closed down immediately,” he said."
  },
  {
    "headline": "BREAKING: Ex-Imo Deputy Gov’s Father Regains Freedom After Six Days In Kidnappers’ Den",
    "summarized_story": "After five days in a kidnappers’ lair, Eze Henry Madumere, the traditional ruler of Achi Mbieri in the Mbaitoli Local Government Area of Imo state, has regained his freedom.\nThe monarch, who is the father of Eze Madumere, a former deputy governor of the state, was abducted on Friday in Iho, Ikeduru LGA.\nThe statement read, “The father of the former Deputy Governor of Imo State, Prince Eze Madumere’s father, HRH, Eze Henry Anoruo Madumere, has regained freedom from his abductors.\n“Pa Madumere who is the traditional ruler of Ezi-Mbieri Autonomous Community was released by the kidnappers in the early morning of Wednesday.\nHe arrived at his home town, Achi, Ezi Mbieri Autonomous Community in Mbaitoli local government area of Imo State."
  },
  {
    "headline": "Pictures: Late veteran Baba Suwe’s burial rites begins",
    "summarized_story": "NextPius Awodi, passage of a man of honour and intergity"
  },
  {
    "headline": "Air Nigeria returns April 2022, to create 70,000 jobs – Sirika",
    "summarized_story": "Minister of Aviation Hadi Sirika has said the country’s national air carrier, Air Nigeria, is expected to take off April 2022.\nSitrika said, when it becomes operational, the national carrier would create about 70,000 jobs for Nigerians.\n“Today in Council, civil aviation presented two memoranda.\nThe first one is approval for the award of contract for the provision of Automated Civil Aviation Regulatory Equipment, including software support and training, which will be located in Nnamdi Azikiwe International Airport.\nThese 70,000 jobs are higher than the total number of civil servants that we have in the country."
  },
  {
    "headline": "2022: Minister reveals full fuel deregulation plans as FG removes subsidy provision from budget",
    "summarized_story": "Minister of Finance, Budget and National Planning Hajiya Zainab Ahmed has said the federal government cannot sustain the current N250 billion monthly petroleum subsidy.\nAnd in the 2020 budget, we made a provision to assume that at the maximum by the end of June, we must exit subsidy.\nGrowth in the service sector was largely driven by better performance in the rail transport sector, pipeline sector, air transport, financial institutions, road transport sector, water transport as well as crude.\n“It includes the improvement that we’ve witnessed in the rail transport sector, pipelines, air transport, road transport, as well as water transport.\nWe don’t have anywhere in the budget where 40 million Nigerians will collect N5000 monthly as transportation allowance totalling N2.4 trillion."
  },
  {
    "headline": "At last, FG reveals when Air Nigeria ‘ll commence operations",
    "summarized_story": "The Minister of Aviation, Mr Hadi Sirika, said the country’s national air carrier, Air Nigeria, is expected to take off by April 2022.\nThe minister said this while briefing State House correspondents at the end of the weekly Federal Executive Council (FEC) meeting presided over by President Muhammadu Buhari.\nHe said the national airliner would be run by a company in which the Nigerian government would hold a five percent stake, Nigerian entrepreneurs 46 percent and the remaining 49 percent for yet to be assigned strategic equity partners, including foreign investors.\nHe said, when it becomes operational, the national carrier would create about 70,000 jobs for Nigerians."
  },
  {
    "headline": "Breaking: Anambra governor, Willie Obiano, under EFCC watchlist – Official",
    "summarized_story": "Anambra state governor Willie Obiano is gloating under pressure after the Economic and Financial Crimes Commission (EFCC) asked the Nigeria Immigration to place him on a watchlist.\nThe order from the country’s anti-corruption agency is coming barely four months to Obiano’s handover to the state governor-elect Prof. Charles Soludo.\nThis was contained in a letter to the Comptroller General of the Nigeria Immigration Service (NIS) dated November 15, 2021.\nDetails loading…"
  },
  {
    "headline": "Anambra Election Conduct was our most Challenging",
    "summarized_story": "The chairman of the Independent national electoral commission, Mahmood Yakubu , said the Anambra governorship election is the most difficult election ever conducted in the history of the commission.\nHe made the statement at a two day interactive meeting for Online publishers, media executives .\nThe commission Chairman said the sit at home order on Mondays in Anambra State by IPOB affected the preparation for election.\nMr Mahmood Yakubu said the commission lost everything in Anambra State in preparation for the election when the inec office in Awka was razed down in June.\nAs a result of that all non sensitive materials were gotten from neighbouring States, Enugu and Imo."
  },
  {
    "headline": "Concerned APC Stakeholders welcome Buhari's approval of APC Convention in Feb -",
    "summarized_story": "The Concerned APC Stakeholders has welcomed President Muhammadu Buhari’s approval of February as the Convention date.\non the 6th of October, 2021, the Group wrote a letter to President Muhammadu Buhari calling on him to intervene in some urgent matters posing existential threat to the party.\nThey commend the President as the leader of the party for demonstrating an obvious willingness to listen to all party men and women without any iota of prejudice.\nThey called on the Caretaker/Extra-Ordinary Convention Planning Committee ( CECPC) to take the presidential mandate further by immediately commencing the process that will give APC a befitting and transparent convention that all members would be proud of.\nApart from showing the seriousness it attach to the approval by the president, the Caretaker Committee they say, must not only announce a specific date for the convention, it must put all the necessary machineries for the conduct of the convention in place without further delay."
  },
  {
    "headline": "We are only mandated to relate with political parties",
    "summarized_story": "The Independent National Electoral Commission says it has been mandated to only relate with all political parties and not factional group or groups in the country.\nThe Oyo state Resident Electoral Commissioner of Australia INEC Mutiu Agboke disclosed this at a meeting held with parties stakeholders held in Ibadan.\nAgboke said this is in a bid avoid the commission been accused of serving the interest of other individuals or factions of a political party.\nAccording to him, However, let it also be on record that INEC has a mandate relate with all political parties and not factional group or groups as recently experienced with a particular political party.\nAgboke said the commission would also supports the Electoral Amendment bill that allows political parties to choose their candidates through direct primaries if assented toAgboke disclosed that over four hundred thousand registered voters are still yet to receive their Permanent Voters Cards out of the over two million registered voters in the state."
  },
  {
    "headline": "Breaking: Akeredolu imposes curfew on Ikare",
    "summarized_story": "The Ondo State Government has ordered the imposition of a twenty-four hour curfew on Ikare town, headquarters of Akoko North East Local Government Area of the State with immediate effect.\nThis is coming on the heels of security reports and credible intelligence arising from the situation in Ikare.\nSpecifically, some deaths have been recorded as a result of sporadic gunshots that have pervaded the ancient town in the last 12 hours.\nSecurity agencies, especially the Police and Amotekun have already been directed to ensure full compliance and enforcement of the curfew imposed.\nAll Traditional Rulers, Opinion and Religious Leaders are enjoined to give maximum support to this order just as they are to rein in their subjects and wards."
  },
  {
    "headline": "Nigeria Receives Stolen Benin and Ife Artefacts from US Museum",
    "summarized_story": "The consulate-general of Nigeria in New York has taken possession of three Benin and Ife artefacts from the Metropolitan Museum of Art (MET) in the United States.\nAccording to NAN, Abba Tijjani, director-general of national commission for museums and monuments (NCMM), received the artefacts from the museum in the company of Lot Egopija, consul-general of Nigeria in New York.\nThe artefacts are two 16th-century Benin brass plaques and one 14th-century Ife brass head.\nTijjani, who signed a Memorandum of Understanding (MoU) with MET, commended the museum for returning the artefacts to Nigeria.\nHe asked other museums in possession of Nigerian artefacts to follow MET’s exemplary gesture."
  },
  {
    "headline": "National Carrier, Nigeria Air, to Commence Operations April 2022",
    "summarized_story": "Nigeria’s proposed national carrier, Nigeria Air, is set to begin flight operations by April 2022.\nSirika explained that in the new national carrier, the federal government will have five percent equity shares, Nigerian entrepreneurs 46 per cent equity shares, while the expected international strategic partners would have 49 equity shares.\nSirika stressed that FEC had given approval for the new national carrier.\nAccording to him, “Today (Wednesday) in Council, civil aviation presented two memoranda.\nOne of the memos is approval of the outline business case for the establishment of the national carrier and this is the sixth time the memorandum appeared before Council."
  },
  {
    "headline": "Nigeria: Labour Rejects Proposed Fuel Price Hike",
    "summarized_story": "Wabba said the union would maintain its rejection of deregulation so long as it was based on an import-driven model.\n“The response of the Nigeria Labour Congress is that what we are hearing is the conversation of the federal government with neo-liberal international monetary institutions.\nWabba also said that any attempt to compare the price of petrol in Nigeria to other countries would be set on a faulty premise as it would be akin to comparing apples to mangoes.\n“The total amount involved in this queer initiative is far more than the money government claims to spend currently on fuel subsidy.\n“Clearly, government thoughts on the so-called removal of fuel subsidy is cloudy and appears to be a “penny wise-pound foolish” gamble."
  },
  {
    "headline": "No Provision in 2022 Budget as Finance Minister Ahmed Says N5,000 Transport Grant for Vulnerable Nigerians to Last One Year – Arise News",
    "summarized_story": "But there nothing’s stopping the states to add more than the N5,000 that is going to come from the federation.\nShe, however, stressed that the effect of the present administration’s economic growth would not be felt until GDP growth surpasses population growth rate.\nOn why economic growth recorded does not impact Nigerians, Ahmed said: “Let me say that, again, the Nigerian economy is growing.\n“The Minister of Finance, Budget and National Planning was quoted as saying that 40 million Nigerians will be paid N5000 as transportation allowance, in lieu of the fuel subsidy.\nWe don’t have anywhere in the budget where 40 million Nigerians will collect N5000 monthly as transportation allowance totaling N2.4 trillion."
  },
  {
    "headline": "Nigeria: Cause of Nembe Oil Spill Yet to Be Determined, FG Says",
    "summarized_story": "Musa said the rescue teams on ground had so far recovered 4,105 barrels of oil since the Nembe oil spill began.\nAs I speak, nobody has been able to reach the oil wellhead, where the flow is coming from.\nMusa also said, “One can only estimate the volume of oil that can be produced from any given oil wellhead when such oil wellhead is active and operational, but it is not possible to estimate the volume of loss of oil from an oil well, when there is leakage.\n“The truth of the matter is that the oil wellhead has been abandoned for years and cannot therefore be compared to oil wellhead that is active and operational.\nWhen the oil spill started, it was immediately reported and NOSDRA has been on the matter right from the onset."
  }
]