[
  {
    "headline": "Lack of early morning erection could be sign of erectile dysfunction, urologists warn",
    "summarized_story": "Amarachi OkehMedical health experts say not waking up to an early morning erection, especially when this becomes consistent, could be an indication of erectile dysfunction, noting that men should be alert to such a sign.\nAccording to them, a consistent absence of early morning erection may be an indication of the state of a man’s erectile function.\nErectile dysfunction is the inability to get or keep an erection firm enough to have sexual intercourse.\nHowever, frequent cases of erectile dysfunction, experts say, can be a sign of other health problems that need treatment.\nHe added that the history of the absence of early morning erection can be used to differentiate the type of erectile dysfunction a person is suffering from."
  },
  {
    "headline": "Lack of early morning erection could be sign of erectile dysfunction, urologists warn",
    "summarized_story": "Amarachi OkehMedical health experts say not waking up to an early morning erection, especially when this becomes consistent, could be an indication of erectile dysfunction, noting that men should be alert to such a sign.\nAccording to them, a consistent absence of early morning erection may be an indication of the state of a man’s erectile function.\nErectile dysfunction is the inability to get or keep an erection firm enough to have sexual intercourse.\nHowever, frequent cases of erectile dysfunction, experts say, can be a sign of other health problems that need treatment.\nHe added that the history of the absence of early morning erection can be used to differentiate the type of erectile dysfunction a person is suffering from."
  },
  {
    "headline": "Experts decry over-prescription of antibiotics by health workers",
    "summarized_story": "Some experts have raised concerns over the incessant prescription of antibiotics by health workers, saying it could lead to increased fatalities from infections and wounds.\nDr. Esohe Ogboghodo, a Public Health Physician, said: “Antibiotics are being over-prescribed by health workers.\nOgboghodo is also the Head, Department of Public Health and Community Medicine, University of Benin Teaching Hospital and the Chairman of UBTH’s Infection Prevention and Control.\n“We should look inward because we the health workers have a role to play,” he said.\nThe Managing Director of St. Racheal’s Pharma, Mr. Akinjide Adeosun, traced the problem of antibiotic resistance in Nigeria to the country’s high out-of-pocket healthcare expenditure."
  },
  {
    "headline": "Experts decry over-prescription of antibiotics by health workers",
    "summarized_story": "Some experts have raised concerns over the incessant prescription of antibiotics by health workers, saying it could lead to increased fatalities from infections and wounds.\nDr. Esohe Ogboghodo, a Public Health Physician, said: “Antibiotics are being over-prescribed by health workers.\nOgboghodo is also the Head, Department of Public Health and Community Medicine, University of Benin Teaching Hospital and the Chairman of UBTH’s Infection Prevention and Control.\n“We should look inward because we the health workers have a role to play,” he said.\nThe Managing Director of St. Racheal’s Pharma, Mr. Akinjide Adeosun, traced the problem of antibiotic resistance in Nigeria to the country’s high out-of-pocket healthcare expenditure."
  },
  {
    "headline": "Adam commends Okowa over Ode- Itsekiri bridge project,receives Airforce team",
    "summarized_story": "The main alignment for Ubeji is through Ifie, Aje-Etan, Ijala, across Warri River to Ugbodede, Orugbo, Ajigba and ends at Ode-Itsekiri.\nAir Commodore C. O. Obiabaka appreciated His Excellency Sen. Dr. Okowa for the massive project.\nSaying the project when completed will not only improve the economic situation of the State but help in the movement of security equipment and in securing the area.\nThe Trans-Warri Ode Itsekiri bridges and access road project was an initiative of the Ibori administration but actual work was started by the Uduaghan administration in May, 2007.\nThus the project If well funded is expected to be completed in December 2022."
  },
  {
    "headline": "2023: Stop running away from politics, get involved — Cleric tells Christians",
    "summarized_story": "According to him ” Christians should gear up to vie for elective positions in the coming dispensation.\nWe need politicians with the fear of God to come to the 2023 election if we are to move forward.\n” The call became necessary because if God-fearing people stayed away from politics, the wicked would continue to rule the nation.\nAccording to him Christians holding political offices needed to make service to humanity their priority and not how to corner for themselves and family members whats meant for the generality of the people.\nOur ways of life while holding political positions should be worthy of emulation."
  },
  {
    "headline": "BREAKING: Bandits kill former FCT Director on Abuja-Kaduna Highway",
    "summarized_story": "By Ibrahim Hassan-WuyoA Former FCT Director of Protocol and Zamfara State Governorship Aspirant, Alhaji Sagir Hamidu has been killed on Sunday along Kaduna – Abuja Road by Bandits.\nDetails later."
  },
  {
    "headline": "NECO releases results of Kano students",
    "summarized_story": "By Bashir BelloThe National Examination Council, NECO has released the examination results of students in Kano state.\nThis followed the effort by the state government to settle the NECO examination fees.\nSanusi-Kiru said the release of the result will enable the students to secure admissions in Universities and other tertiary institutions of their choices.\nHe also reiterated the determination of the Kano state government to continue to support the education sector.\nRecall that the examination body had withheld the results of over 80,000 students in the state due to the inability of the Kano State Government to clear debts."
  },
  {
    "headline": "Buhari condoles with NASS, Ekiti govt over Senator Gbenga Aluko’s death",
    "summarized_story": "President Muhammadu BuhariBy Johnbosco AgbakwuruPRESIDENT Muhammadu Buhari has expressed grief over the passing of Senator Gbenga Aluko on Saturday.\nPresident Buhari in a statement issued by his Special Adviser on Media and Publicity, Chief Femi Adesina urged family, friends and political associates of the deceased to find solace in God, and the antecedents of the former lawmaker.\nThe President commiserated with members of All Progressives Congress (APC), people and government of Ekiti State, on the loss of the political leader, who served his state and the nation, and was dutifully committed to improving the lot of his community.\nPresident Buhari prayed for the repose of his soul, and comfort for the family."
  },
  {
    "headline": "Bandits kidnap travellers on Abuja-Kaduna road",
    "summarized_story": "Bandits laid an ambush on the ever-busy Abuja-Kaduna road on Sunday, abducting an unknown number of travellers.\nThose who escaped said the gunmen blocked the road at Katari village at about 2 pm, operating for more than an hour.\nOne of them told PRNigeria that they had to turn back due to the repeated sounds of gunshots.\nThey resumed their journey after vehicular movement resumed on the other side of the highway.\nIn September, Emir Hassan Atto of Bungudu in Zamfara was taken away; a police officer attached to him was killed."
  },
  {
    "headline": "TETFund should finance private polytechnics, universities in Nigeria – PFN leader, Wale Oke",
    "summarized_story": "Pentecostal Fellowship of Nigeria (PFN) President, Bishop Francis Wale Oke wants the Tertiary Education Trust Fund (TETFund) to support private polytechnics and universities in Nigeria.\nThe respected cleric, at the weekend, urged the Federal Government to review the Tertiary Education Trust Fund (Establishment) Act of 2011.\nHe spoke on the role of faith-based schools in national transformation during the inaugural Archbishop Benson Idahosa Memorial Lecture at the Benson Idahosa University, Benin.\nHe maintains that the TETFund mandate of rehabilitation, restoration and consolidation of tertiary education will be partially fulfilled if it continues to focus on government-owned polytechnics and universities.\nOke lauded Benson Idahosa, the 3rd PFN President, for his foresight and investment in tertiary education as far back as 1978 when his university became the first to apply for NUC approval."
  },
  {
    "headline": "Davido’s N250m: Group makes case for northern orphans",
    "summarized_story": "A group, Support Group for Nigerian Orphans (AGNO), has called on David Adeleke, an award-winning singer also known as Davido, to carry orphans in the northern part of the country along while disbursing his earmarked N250 million to orphanages.\nMaking the call on Sunday in Jalingo, the Taraba State capital, the group led by its chairman, Salisu Waziri Ibrahim, said extending the gesture to northern orphanages would go a long way in addressing the numerous challenges they are facing.\nThe group said it has become necessary for them to remind Davido of his roots.\nDavido, he said, was born in the north, but hardly visits and is not in touch with some realities.\nThey said, “we have numerous orphans in this part of the country that can not raise their voices unless for some of us the NGOs that have been speaking for them” stressing that “many of them have been in camps.”Recall that Davido has said the N250 million he received from fans, friends and families as donations would be given out to orphanage homes spread across the country."
  },
  {
    "headline": "Sudanese military reinstates ousted PM Hamdok weeks after coup",
    "summarized_story": "The military in Sudan reinstated Abdalla Hamdok as Prime Minister on Sunday, four weeks after his ouster.\nThe public administrator retook office at the presidential palace in Khartoum, Sudan TV reported.\n“We will put our country back on the right track”, Hamdok said while announcing the return of democracy.\nHe will form a cabinet with civilian representatives; Al-Burhan jointly is now leader of the Sovereign Council, comprising military representatives.\nHamdok was toppled on October 25, less than five weeks after an initial attempt to seize the government."
  },
  {
    "headline": "Buhari reacts to Rev. Obiora Ezekiel’s death",
    "summarized_story": "President Muhammadu Buhari has condoled with the family of the Founder and General Overseer of Christian Pentecostal Mission International, Rev Obiora Ezekiel, over the passing of the clergyman.\nHe noted the General Overseer’s role in raising many spiritual sons, who have also moved on to mentor pastors, evangelists, and teachers, commending his vision for founding the Pentecostal Fellowship of Nigeria (PFN).\nBuhari urged prayers for the family of the departed, particularly his wife and spiritual partner, Rev.\nDr. Mercy Ezekiel, praying that the Almighty God will receive the soul of the renowned evangelist.\nCPM General Overseer, Rev Obiora Ezekiel is dead"
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "We will send APC packing in 2023, says PDP BoT chair",
    "summarized_story": "A Second Republic senator and Chairman of the Board of Trustees (BOT) of the Peoples Democratic Party (PDP), Walid Jibril, has said the main opposition will send the ruling All Progressives Congress (APC) packing in te 2023 general elections.\n“We in the PDP are very careful and hopeful about achievements and industrial development of Nigeria.\n“The industrial development in Nigeria is not going well because government policy is not consistent over the years.\n“If government policy is consistent, Nigeria wouldn’t have been where it is today.\nBut changing a policy soon after implementation by successive governments is not good for industrial development of the country."
  },
  {
    "headline": "Don’t lift ban on rice importation, Akeredolu tells Buhari",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, has urged President Mohammadu Buhari not to consider lifting the ban on rice importation.\nRepresented by his Special Adviser on Agriculture and Agric-business, Mr Akin Olotu, Governor Akeredolu said the state government would not venture into rice cultivation but partner with rice farmers to use the Sawah technology to boost production.\nA farmer can make up to N1.8million annually from one hectare using this technology.\n“It was courageous for President Buhari to ban rice importation.\nThere will be more training and sensitisation of farmers,” he said,National Coordinator of Sawah Eco-Technology, Dr. Ademiluyi Yinka, said President Buhari approved the training for rice farmers in some selected states through NCAM."
  },
  {
    "headline": "Why Nigeria varsities are ranked low, by FUTA VC",
    "summarized_story": "Vice Chancellor of the Federal University of Technology, Akure, (FUTA) Prof. Adeola Fuwape, has identified factors responsible for the poor webometric ranking of Nigerian universities.\nFuwape listed the poor economy, insecurity, poor operating environment, poor funding, lack of international recognition and prestige as reasons for Nigeria universities not being among the best 1000 universities in the world.\nFuwape spoke at the weekend at a pre-convocation press conference of the 32nd convocation ceremony of the institution.\n- Advertisement -He said 872 students got second class upper division, 1,483 second class lower division,222 had third class while six got pass.\nHe said the convocation lecture titled “Innovation Technology and Prospect of Prosperity in Nigeria,” would be delivered by Prof. Pat Utomi."
  },
  {
    "headline": "More controversy trails death of OAU postgraduate student",
    "summarized_story": "Adedoyin and five of his employees in the hotel are currently being interrogated by the Police on the matter.\nWhat could have been a giant step towards unraveling the cause of Adegoke’s death was frustrated by his family, Abiodun said.\n“It is clear that this is a calculated attempt to frustrate investigation into the matter and establish the fact that Timothy Adegoke died of natural causes,” Abiodun said.\nPolice spokesperson, SP Yemisi Opalola, had claimed that the remains of Adegoke were deposited in OAUTHC after it was exhumed.\nSpeaking in Yoruba language, she said: “I want to state it categorically that the remains of Timothy Adegoke was deposited in Osun State University Teaching Hospital and not in OAUTCH."
  },
  {
    "headline": "Breaking: APC Governors in crucial meeting in Abuja",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) governors are currently in a closed door meeting at the Kebbi State Governors Lodge in Abuja.\nAs at 8.30pm, no fewer that 20 All Progressive Congress (APC) governors have arrived the meeting venue.\nThe governors of Osun, Yobe, Gombe and Kaduna States are still being awaited.\nThe Sun had reported that the Governors will meet to decide on wide range of issues affecting the party with zoning arrangements for the national leadership of the party topping the agenda of the meeting.\nDetails later…100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Unknown gunmen invade Kwara community, kidnap monarch’s brother",
    "summarized_story": "According to reports coming from the community , Oni-Jay is a brother to one of the PDP Chieftains, Onijala who’s also former Aide to former president Goodluck Jonathan.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe blood of the victim could be seen stained the Hillux indicating he must have been seriously injured before he was taken away .\nThroughout the operation that lasted for almost an hour, there was no report that security confronted the gunmen.\nOn receipt of the information, the Commissioner of Police, Kwara State Command, CP Tuesday Assayomo immediately unleashed the Command’s tactical teams with the local hunters and vigilante to the area to rescue the victims and arrest the hoodlums."
  },
  {
    "headline": "BREAKING: Rev Ezekiel, Founder CPM dies",
    "summarized_story": "The General Overseer and Head Pastor of the Christian Pentecostal Mission International Rev.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nDR. O. EZEKIEL, has gone to be with the LORD just a few days ago.\nHe has left his mantle with us to continue where he stopped to move CPM to the next level.\nTransform Triumphantly, our General, till we meet at Jesus’ feet.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Police arrest 77-year-old gun supplier in Delta",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nConfirming the arrest in Asaba on Sunday, Public Relations Officer of the command, DSP Bright Edafe, said upon arrest, three double barrel guns, two single barrel guns and other tools used in producing guns were recovered from Enipozi.\nHe said 130 rounds live cartridges, one single barrel long gun, three packets of tramadol, six bottles of codeine and various contraband drugs were recovered from the suspect.\nEdafe stated that the victim has already “identified all suspects as those who robbed him of his motorcycle.\nSuspects are currently in custody while investigation is ongoing.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Militants blow up Agip facility over neglect in Rivers",
    "summarized_story": "From TONY JOHN, Port HarcourtA new militant group in the Niger Delta known as Bayan-Men have blown up an oil facility belonging to the Nigeria Agip Oil Company (NAOC), in Ogba/Egbema/Andoni Local Government Area of Rivers State.\nThe General said: “The only thing we want Agip to do is to deal directly with the 27 communities of Omoku, according to the Federal Government resolution.\nThey should treat communities individually.\nNow, some uncontrollable boys and some militia group have blown up Agip oil well, OB-5.\n“The group is saying that Agip should deal with individual communities, that is what the law provides."
  },
  {
    "headline": "In Double Standard, US Threatens Nigeria with Arms Embargo, While Silent on Israel",
    "summarized_story": "But Blinken, in a surprise move, said his country would apply the Leahy Laws against Nigeria.\nIt is also important to the US Congress in making judgments about continuing to assist the security forces,” Blinken explained.\nThe training is coming as the air force began a review of its safety standards in a bid to maintain high standards.\nAbout four air force planes had recently crashed in Abuja, Kaduna, and Borno within three months, recording high casualty figures and raising safety issues about the health of the air force fleet.\nThe air force, has, however, replenished its fleet with 12 A-29 Super Tucano fighter jets made up of six attack aircraft and six reconnaissance mission jets."
  },
  {
    "headline": "After Abduction of 83 Villagers, Niger Bans Sale of Motorcycles",
    "summarized_story": "•Katsina recruits 500 more vigilance operatives to tackle banditryLaleye Dipo in MinnaTo curb incessant banditry and kidnapping in Niger State, Governor Abubakar Sani Bello has banned the sale of motorcycles in the state.\nThe Katsina State Government has however, recruited 500 more persons as vigilance operatives to complement efforts of other security agencies in rural communities.\nHe stated that the ban was also informed by the fact that bandits and kidnappers now demand motorcycles as ransom.\nMeanwhile, the Katsina State Government has recruited 500 more persons as vigilance operatives to complement efforts of other security agencies in rural communities.\nWith the previous 500 persons that were recruited, the total number of vigilantes in the state is now 1,000."
  },
  {
    "headline": "PenCom: Leadway Didn’t Breach Investment Rules by Investing in First Bank",
    "summarized_story": "Festus AkanbiThe National Pension Commission (PenCom) yesterday said that Leadway Pensure Limited was not in breach of the investment regulation by investing pension funds in the equities of FBN Holding Plc.\n“The commission categorically states that the allegations are not correct and must have been made based on the lack of understanding of the investment regulation issued by the commission.\n“Therefore, the equity investments in FBN Holdings Plc., as stated cannot be appropriated or classified as shareholdings of any related party to the Pension Fund Administrators (PFA’s).\n“Leadway Pensure Limited is not in breach of the Investment Regulation by investing pension funds in the equities of FBN Holding Plc.\n“In view of the foregoing, PenCom reiterates that there was no breach of its Investment Regulation whatsoever and urged the general public to be guided accordingly,” it said."
  },
  {
    "headline": "Under Pressure from ‘Igbo Greats’, Buhari Pledges to Consider Amnesty for Kanu",
    "summarized_story": "‘You’ve made an extremely difficult demand on me as leader of this country.\nA group of Igbo elders, under the aegis of “Highly Respected Igbo Greats,” led by First Republic parliamentarian and minister of aviation, Mbazulike Amaechi, requested the amnesty for Kanu, during a visit to Buhari at the State House, Abuja, yesterday.\nWhile receiving the delegation, led by the 93 year-old statesman, Buhari said: “You’ve made an extremely difficult demand on me as leader of this country.\n“In the last six years, since I became President, nobody would say I have confronted or interfered in the work of the Judiciary.\nLet him make his case in court, instead of giving very negative impressions of the country from the outside."
  },
  {
    "headline": "Jonathan: Mismanagement of Diversity, Threat to Unity, Democracy",
    "summarized_story": "*Wants diversity harnessed, translated to strength for a peaceful, prosperous futureChuks Okocha in AbujaFormer president Goodluck Jonathan has described the mismanagement of the ethnic diversity in Nigeria in particular and Africa at large as the basic problem affecting democracy and unity in the continent.\n“Some nations are going through many challenges that have continued to pose serious threats to their unity and corporate existence.\n“Democracy thrives on the mutuality of trust between government and the people and among the different groups within a state.\n“This Dialogue: ‘Democracy and the Unity of State’ captures the essence of democracy, which drives its steam from productive civic engagements.\nWhile referring to Jonathan, he said, “My belief is that you have demonstrated very clearly that this country can be great."
  },
  {
    "headline": "BREAKING: Manchester United Sack Solskjaer After Watford Defeat",
    "summarized_story": "Manchester United on Sunday confirmed the sacking of club coach Ole Gunnar Solskjaer.\nHis removal followed a 4-1 loss of United to Watford on Saturday.\nIn a statement on Sunday, the club said, \"Manchester United announces that Ole Gunnar Solskjaer has left his role as manager.\n\"Ole will always be a legend at Manchester United and it is with regret that we have reached this difficult decision.\nHe will forever be welcome back at Old Trafford as part of the Manchester United family."
  },
  {
    "headline": "BREAKING: Manchester United Sack Solskjaer After Watford Defeat",
    "summarized_story": "Manchester United on Sunday confirmed the sacking of club coach Ole Gunnar Solskjaer.\nHis removal followed a 4-1 loss of United to Watford on Saturday.\nIn a statement on Sunday, the club said, \"Manchester United announces that Ole Gunnar Solskjaer has left his role as manager.\n\"Ole will always be a legend at Manchester United and it is with regret that we have reached this difficult decision.\nHe will forever be welcome back at Old Trafford as part of the Manchester United family."
  },
  {
    "headline": "Panic As Lagos Government Plots To Render 6,000 Residents Homeless With Planned Demolition",
    "summarized_story": "About 6,000 people who reside at Orisunmibare community in Lagos State will soon be rendered homeless following a 10-day demolition notice by the state government, SaharaReporters has gathered.\nResidents said reasons for the eviction notice by the state government remains unknown to them.\nLagos Governor Babajide Sanwo-OluThey asked Nigerians to appeal to the Lagos State Governor, Babajide Sanwo-Olu, to reverse the anti-people policy.\nThe big question is; how does rendering 6,000 households with women and children homeless a way to resolve a security situation?\n“Our Governor is a forthright man, elected by people of Lagos State whose majority population are poor people; living in precarious housing."
  },
  {
    "headline": "Panic As Lagos Government Plots To Render 6,000 Residents Homeless With Planned Demolition",
    "summarized_story": "About 6,000 people who reside at Orisunmibare community in Lagos State will soon be rendered homeless following a 10-day demolition notice by the state government, SaharaReporters has gathered.\nResidents said reasons for the eviction notice by the state government remains unknown to them.\nLagos Governor Babajide Sanwo-OluThey asked Nigerians to appeal to the Lagos State Governor, Babajide Sanwo-Olu, to reverse the anti-people policy.\nThe big question is; how does rendering 6,000 households with women and children homeless a way to resolve a security situation?\n“Our Governor is a forthright man, elected by people of Lagos State whose majority population are poor people; living in precarious housing."
  },
  {
    "headline": "Bandits Kill Former Zamfara Ruling All Progressives Congress Governorship Aspirant",
    "summarized_story": "Gunmen suspected to be bandits have killed a former governorship aspirant in the 2019 election in Zamfara State, Sagir Hamidu.\nThe late politician had vied for governorship on the platform of the ruling All Progressives Congress (APC).\nHe was shot dead by the attackers when they opened fire on travellers near Rijana along the busy expressway around 4 pm, Daily Nigerian reports.\nA survivor who spoke on condition of anonymity said the incident occurred around the Rijana area.\n“The kidnappers took advantage of the damage on the road, which forced on and off-coming motorists to move slowly on a single lane,” he said."
  },
  {
    "headline": "Ex-Zamfara APC governorship aspirant killed as gunmen attack travellers on Kaduna-Abuja highway",
    "summarized_story": "Sagir Hamida, a Zamfara governorship aspirant in the 2019 election, has been killed by gunmen.\nAdvertisementHamida was killed on Sunday when gunmen attacked travellers on the Abuja-Kaduna highway.\nAccording to NAN, Kabiru, elder brother to Sagir Hamida, said the former governorship aspirant was killed near the Abuja end of the highway.\nAlso speaking on the development, Yusuf Idris, director-general of media to Bello Matawalle, governor of Zamfara, said the governor was “in shock” over the incident.\nHamida was said to have reconciled with the Yari faction following the defection of Matawalle from the PDP to APC."
  },
  {
    "headline": "Ex-Zamfara APC governorship aspirant killed as gunmen attack travellers on Kaduna-Abuja highway",
    "summarized_story": "Sagir Hamida, a Zamfara governorship aspirant in the 2019 election, has been killed by gunmen.\nAdvertisementHamida was killed on Sunday when gunmen attacked travellers on the Abuja-Kaduna highway.\nAccording to NAN, Kabiru, elder brother to Sagir Hamida, said the former governorship aspirant was killed near the Abuja end of the highway.\nAlso speaking on the development, Yusuf Idris, director-general of media to Bello Matawalle, governor of Zamfara, said the governor was “in shock” over the incident.\nHamida was said to have reconciled with the Yari faction following the defection of Matawalle from the PDP to APC."
  },
  {
    "headline": "Faruk Yahaya: We're doing our best... it's not easy to tackle insecurity",
    "summarized_story": "Faruk Yahaya, chief of army staff (COAS), says it is not easy to tackle security challenges in the country.\nThe army chief said there is a need for citizens to volunteer useful information to security agencies to help them tackle insecurity.\n“We are addressing security challenges in collaboration with other security agencies and stakeholders.\nIt is not easy to tackle security challenges but I must tell you that we are doing our best.\n“There is the need for the public to give accurate and useful information to the security agencies to tackle insecurity."
  },
  {
    "headline": "Faruk Yahaya: We're doing our best... it's not easy to tackle insecurity",
    "summarized_story": "Faruk Yahaya, chief of army staff (COAS), says it is not easy to tackle security challenges in the country.\nThe army chief said there is a need for citizens to volunteer useful information to security agencies to help them tackle insecurity.\n“We are addressing security challenges in collaboration with other security agencies and stakeholders.\nIt is not easy to tackle security challenges but I must tell you that we are doing our best.\n“There is the need for the public to give accurate and useful information to the security agencies to tackle insecurity."
  },
  {
    "headline": "FG offers one-bedroom apartment for N9.2m under 'affordable housing scheme'",
    "summarized_story": "Advertisement“It is a programme borne out of the government’s desire to provide affordable housing for its citizenry,” information on the NHP portal reads.\nAdvertisementThe minister also said the cost of the structures range between “N7.2 million and about N16 million, depending on what a person wants”.\nChecks on the NHP portal by TheCable show that a one-bedroom bungalow goes for N9,268,751.\nA one-bedroom flat in a condominium available in southern states goes for N7,222,404, two-bedroom apartment costs N9,148,378, while a three-bedroom unit costs N13,241,074.\nBuilding a one-bedroom apartment with exactly the same specifications in a place like Lekki and in Olambe area of Ogun state will come with very different prices,” he said."
  },
  {
    "headline": "The NFT artist who captured the global lockdown with 700 portraits",
    "summarized_story": "Optimising this process, coupled with the overwhelmingly positive feedback he received from his 80 selected muses, encouraged him to create more portraits.\nIn the end, Adekola created 700 portraits, but there are only 40 portraits with striking designs and a collage of all 700 portraits on display at the exhibition halls of the gallery.\nNow titled Lockdown Portraits, his project would go on to form a part of his exhibition titled, Dislocation &… alongside Anthology of an African Wedding and Diaspora Axis.\nAdekola has evolved his art using Photoshop for over 20 years, creating over 20,000 texture designs that he used to create Anthology of an African Wedding.\nAnthology of an African Wedding, which also sells as an NFT on OpenSea, consists of 18 art pieces—9 showing traditional wedding scenes and 9 white wedding ones."
  },
  {
    "headline": "Chipper Cash’s Twitter integration may revolutionise Africa’s creative hustle",
    "summarized_story": "For years, Africa’s creative industry has been hampered by poor returns, leaving creators at the mercy of sponsors and algorithm-manipulated trends.\nOn the third most popular social media platform in Africa, the continent’s Twitter users wield power so influential that Twitter began to build out its first Africa-based team in Ghana this year.\nSo when TikTok, a newer entry into Africa’s social media space, came on the scene, it offered a monetisation plan, out of necessity.\nSo far, the Twitter-Chipper Cash integration is only supported for users in Nigeria, South Africa and Uganda.\nChipper Cash’s Twitter integration is reminiscent of similar models used on China-made live-streaming apps."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Early Access: Interview with Mr Eazi; artiste, tech bro, investor",
    "summarized_story": "Seeing Mr Eazi very relaxed was quite the revelation because his demeanour was not too different from his public appearances and videos.\n“I think Mr Eazi is a laid back musician.\nThe Nigeria-born musician later relocated to Ghana for his undergraduate studies before starting his music career in London.\nHe believes Africa is experiencing its best years in the global music industry, with many of its music genres being embraced globally.\nMotivation and obsessionOluwatosin Ajibade (Mr Eazi)."
  },
  {
    "headline": "Technology, funding, learning models: What is the next frontier for edtech startups in Africa?",
    "summarized_story": "The edtech industry in Africa: the nowAccording to Briter Bridges, as of Q1 2020, there were 210 edtech startups in Africa.\nInterestingly, he believes that in the future, edtech will focus more on its adaptability and new learning models than technology.\nAccording to Yomi Ojo, Founder of SchoolsCompass, the divide between the haves and have nots is a huge challenge for the edtech industry.\nFundingAs of August 2021, Africa’s edtech industry has attracted $20 million in funding since 2019.\nThis trend will continue.”In September 2020, South African edtech startup, Valenture Institute, raised a $7 million Series A from GSV Ventures."
  },
  {
    "headline": "The Kredi Money story, Ozow’s $48m Series B, and blockchain skills with Bitmama",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:The Kredi Money storyOzow’s $48m Series BGetting blockchain skills with BitmamaThe Kredi Money storyKredi Money Co-founders, Afolabi Abimbola and Samuel OrjiFintech remains one of the biggest movers in Nigeria’s startup ecosystem.\nAdvertisementAnother fintech startup, Kredi Money, has joined the Nigerian fintech space combining several fintech offerings into one.\nEmmanuel Paul has that answer and more here: Led by ex-OPay exec, Kredi Money wants to be the one-stop-shop for payments, loans, insurance, other financial services.\nOzow’s $48m Series BThomas Pays, CEO and Co-Founder of OzowSouth African fintech startup, Ozow has closed a $48 million Series B to ease online payments for South Africans.\n: According to 101 Blockchains, the need for blockchain talent is fueled by the advantages of blockchain, such as security, transparency, and traceability."
  },
  {
    "headline": "Debate over direct primaries puts Nigeria’s politicians, parties in quandary",
    "summarized_story": "Some stakeholders have argued that NASS should allow political parties to pick the option best suited for them.\n“That’s why I said at different fora that I’m for direct primaries.\nHe said that INEC lacked the required personnel to monitor the conduct of direct primaries by political parties.\n“The electoral law should allow political parties to adopt any of the processes suitable for them in conducting their primaries.\nThe adoption of direct party primaries will only give the governors more power to do whatever they want,” Ortom said."
  },
  {
    "headline": "ASUU strike: Parents, students edgy as varsity lecturers kick",
    "summarized_story": "Francis Herbert, a father of five, whose two children are in two different Nigerian universities, is a sad man today.\nMany concerned citizens are beginning to raise the alarm over the implication of another ASUU strike, especially on the students and the future of the country.\nMy concern is securing their future, which the Nigerian education system cannot guarantee,” the doctor said.\nShe decried that the incessant strike is impacting negatively on the rating and quality of graduates from Nigerian universities.\nIf an average professor in a Nigerian university earns barely N400, 000 a month, then how much do you think others in lower cadre earn."
  },
  {
    "headline": "Off-grid energy investor All On signs $1m deal with Salpha Energy",
    "summarized_story": "All On works with partners to increase access to commercial energy products and services for unserved and underserved off-grid energy markets in Nigeria.\nSimilarly, Sandra Chukwudozie, CEO and founder of Salpha Energy Limited, said the investment will help deliver on the company’s strategy to provide products for their customers.\nThis additional support will allow us to deliver on our strategy to provide products for customers across the range of their developing energy needs,” said Chukwudozie.\nSalpha Energy provides clean, affordable solar home energy systems that prioritizes reaching end-users at the bottom of the pyramid.\nSolar energy, according to the company, will help to create a cleaner and more sustainable future for everyone through innovative, quality-conscious, long-lasting products."
  },
  {
    "headline": "Court Verdict On Takeover Of GTBank By Innoson Motors Over N32bn Debt: Customers In Panic Withdrawal Of Money In Lagos – Nigerian Observer",
    "summarized_story": "Court Verdict On Takeover Of GTBank By Innoson Motors Over N32bn Debt: Customers In Panic Withdrawal Of Money In LagosShare FacebookTwitterStumbleuponLinkedInPinterestLAGOS – Disturbed by the threat of the chairman, Innoson Group, Innocent Chukwuma to takeover the Gtbank over accumulated N32bn debt, customers are in panic withdrawal of their money from the institution branches in Lagos.\nIt was also gathered that those who went to the bank to withdraw on Friday have vowed to alert others to come and withdraw their money on Monday.\nIt will be recalled that Innoson and GTB have had a business dispute leading to a prolonged legal battle.\nIn July, Innoson had asked a federal high court in Lagos to set aside an order permitting GTB to restructure to a holding company.\nI am assuring all the customers of GTB that if I take over, I would still run it well."
  },
  {
    "headline": "Brazil Based Drug Dealer Apprehends Over Hiding Cocaine in Lagos Airport Toilet – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – A Brazil based drug dealer, Okafor Okwudili Moses has been arrested by operatives of the National Drug Law Enforcement Agency, NDLEA over a 2.55 kilograms of cocaine recovered from a toilet at the E-Arrival hall of the Murtala Muhammed International Airport, MMIA, Ikeja Lagos.\nThe following day, Saturday 13th November, the actual owner of the consignment, Okafor arrived the airport from Brazil via an Ethiopian Airline flight and was promptly arrested.\nWhile being interviewed in custody, he confirmed he is the owner of the seized illicit drug.\nReacting to the arrest of Okafor and other suspects as well as the seizures from the states, Chairman of NDLEA, Brig.\nGen. Mohamed Buba Marwa (rtd) commended the officers and men involved in the operations across the commands for sustaining the heat on drug cartels in the country."
  },
  {
    "headline": "Obaseki boosts agric devt with new infrastructure – Nigerian Observer",
    "summarized_story": "The Edo State Governor, Mr. Godwin Obaseki, after inspecting the site, said his administration plans to make the centre an agric hub.\nAccording to him, “We decided to create an agric hub.\nAll agencies of government that are in the business of agriculture will now be located here.\nWe will have space for offices, facilities, and training centres all located here in this premises.\nWe will have various projects offices including the livestock transformation project, and offices for multilateral agencies supported projects, among others.”Obaseki said he is optimistic that the new structure will be completed by June next year."
  },
  {
    "headline": "Obaseki eulogises Lady Amena Eghobamien – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has eulogised late Lady Amena Eghobamien, describing her as a woman full of love and kindness.\nThe governor who led other top government officials to the funeral, urged the children of the deceased to emulate her virtue.\nHe said, “As for my cousins, they have no excuse not to extend love, kindness and happiness to others.\nMy word for them is that they should propagate those values that mama lived for,” he said.\n; Attorney General and Commissioner for Justice, Oluwole Iyamu SAN; Commissioner, Physical Planning and Urban Development, Isoken Omo, and former Deputy Governor of Edo State, Chief Mike Oghiadomhe, among others."
  },
  {
    "headline": "EXCLUSIVE: WAEC to release SSCE results Monday",
    "summarized_story": "It is good news for many admission seekers who may be awaiting the release of their senior school certificate examination (SSCE) results as the West African Examinations Council (WAEC) will on Monday announce the release of the long awaited results.\nMr Areghan cited various challenges including the stay-at-home-order in the South-east as part of the reasons for the seeming delay in the release of the results.\nThe spokesperson must have reached out.”AnticipationMany candidates, especially those who indicated in their Unified Tertiary Matriculation Examination (UTME) that they were awaiting their SSCE result, have anticipated the release of the results in the past few weeks.\nAccording to an insider, the university was not unaware that WAEC was yet to release its results, saying the decision was part of a screening method.\nSo the late release of the result by WAEC was a good opportunity to weed out some applicants,” the source explained."
  },
  {
    "headline": "Osun: Oyetola Hails Oyebamiji, Finance Commissioner’s Contribution To Growth Of Islam And Humanity",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State Governor, Mr Adegboyega Oyetola, has hailed Osun Commissioner for Finance, Mr Bola Oyebamiji for his contributions to the growth of Islam and Humanity, just as congratulated him on bagging Islamic Lifetime Award.\nDescribing the Finance chief as an upright man, Mr. Oyetola noted that Mr Oyebamiji is fine individual who deserves all the honour and accolades he is getting from every angle.\nAccording to the Governor, “I have never met such a loyal man as Bola Oyebamiji, he is God fearing and a lover of his fellow humans.\nHe described Mr. Oyebamiji a blessing to humanity and to the growth of Islam especially in the whole of Irewole, Ayedaade, Isokan Federal Constituency, stressing that his contributions to the growth of the religion and his philanthropic gestures is unprecedented.\nDignitaries at the well attended program include: Governor Adegboyega Oyetola, Speaker; Osun House of Assembly, Rt.Hon."
  },
  {
    "headline": "McEnies Global Communications launches as a 360-degree marketing platform",
    "summarized_story": "The three-in-one businesses were unveiled on Friday, November 19th, 2021 at a grand event held in Ibadan, Oyo State.\n“Our goal is to create total marketing communications effects that leave a lasting memory of professional fulfilment, superlative business result and personal endearing experience.\nMcEnies Communications, which has been in existence for almost a decade, is an upwardly wholly company with vast expertise and competency in integrated marketing communications services providing top-notch solutions to big and medium firms across all sectors and industry.\nMcEnies takes a holistic approach to marketing communications services and digital engagements.\nThis is why businesses like McEnies Global Communications, Perfect Clicks Signature and The Ruby Models Company are primed for the future."
  },
  {
    "headline": "CBN threatens those diverting agric fund with jail time",
    "summarized_story": "The Central Bank of Nigeria (CBN) has threatened that borrowers who divert the funds provided under the Agricultural Credit Guarantee Scheme may earn a five-year jail term.\nThe CBN said this in a report titled ‘Guidelines for the Agricultural Credit Guarantee Scheme’, released on Thursday.\nThe apex bank emphasized that it’s an offense to obtain a loan and not apply it to the purpose for which it was obtained.\nThe CBN explained that the maximum liability of the fund in respect of any guarantee given under the scheme would be fixed from time to time by the ACGSF board.\nAccording to it, the single obligor limit for non-tangible collateral is N100,000 while the obligor limit for individual, group/co-operative or a corporate society is N50m for secured loans."
  },
  {
    "headline": "Manchester United sacks Ole Gunnar Solksjaer, names Carrick as replacement",
    "summarized_story": "OBINNA EZUGWUEnglish Premier League side, Manchester United States has parted ways with coach Ole Gunnar Solksjaer and Michael Carrick interim manager.\nThe club which announced the decision in a statement on Sunday, said Solksjaer will always be a legend of the club.\n“Manchester United announces that Ole Gunnar Solskjaer has left his role as manager,” the statement said.\n“Ole will always be a legend at Manchester United and it is with regret that we have reached this difficult decision.\nHe will forever be welcome back at Old Trafford as part of the Manchester United family."
  },
  {
    "headline": "Armed Bandits Return To Abuja-Kaduna Highway, Kidnap Travellers",
    "summarized_story": "Armed bandits blocked the Abuja-Kaduna Road on Sunday afternoon and kidnapped many travellers.\nAccording to one of the travellers who escaped the abduction, he said the armed bandits blocked the road at Katari village at about 2pm and operated for more than an hour.\nKatari village is one of the most notorious havens of kidnappers along Abuja-Kaduna highway.\nADVERTISEMENTMr Atto who was a former Secretary to the Government of Zamfara State regained freedom in October after spending 32 days in the kidnapper’s den.\nOthers escaped abduction as many vehicles in which they were travelling were abandoned by the roadside after they were apparently ransacked by the attackers."
  },
  {
    "headline": "Armed Bandits Return To Abuja-Kaduna Highway, Kidnap Travellers",
    "summarized_story": "Armed bandits blocked the Abuja-Kaduna Road on Sunday afternoon and kidnapped many travellers.\nAccording to one of the travellers who escaped the abduction, he said the armed bandits blocked the road at Katari village at about 2pm and operated for more than an hour.\nKatari village is one of the most notorious havens of kidnappers along Abuja-Kaduna highway.\nADVERTISEMENTMr Atto who was a former Secretary to the Government of Zamfara State regained freedom in October after spending 32 days in the kidnapper’s den.\nOthers escaped abduction as many vehicles in which they were travelling were abandoned by the roadside after they were apparently ransacked by the attackers."
  },
  {
    "headline": "Expert Advocates Increased Use Of Point-of-Care Ultrasound In Hospitals",
    "summarized_story": "The chief medical officer of Lagos Multi Specialist Hospital, R-Jolad, Dr Abiola Fasina, has advocated the adoption of the use of Point-of-care Ultrasound (POCUS) by hospitals, to improve clinical decision-making and bridge the diagnostic imaging gap for patients, including for lung pathology.\nAccording to Fasina, supporting a Computerized Tomography scan (CT scan) or a Magnetic Resonance Imaging scan (MRI scan) can be particularly challenging for hospitals due to the cost of the initial equipment investment combined with infrastructural issues including maintenance and repair requirements.\nShe pointed out that Point-of-care Ultrasound (POCUS) has long been employed in resource-limited settings and has led to improvements in clinical decision making,” she said.\nThe WHO has advocated for expanded global access to ultrasound teaching and technology for health providers as two-thirds of the world’s population currently has no access to imaging technologies.\nADVERTISEMENT“Therefore, expanding access to ultrasound and speciﬁcally, Point-of-care ultrasound (POCUS) in the hands of clinicians at the bedside, is of primary importance to help doctors manage patients better and decrease the incidence of medical mistakes."
  },
  {
    "headline": "Expert Advocates Increased Use Of Point-of-Care Ultrasound In Hospitals",
    "summarized_story": "The chief medical officer of Lagos Multi Specialist Hospital, R-Jolad, Dr Abiola Fasina, has advocated the adoption of the use of Point-of-care Ultrasound (POCUS) by hospitals, to improve clinical decision-making and bridge the diagnostic imaging gap for patients, including for lung pathology.\nAccording to Fasina, supporting a Computerized Tomography scan (CT scan) or a Magnetic Resonance Imaging scan (MRI scan) can be particularly challenging for hospitals due to the cost of the initial equipment investment combined with infrastructural issues including maintenance and repair requirements.\nShe pointed out that Point-of-care Ultrasound (POCUS) has long been employed in resource-limited settings and has led to improvements in clinical decision making,” she said.\nThe WHO has advocated for expanded global access to ultrasound teaching and technology for health providers as two-thirds of the world’s population currently has no access to imaging technologies.\nADVERTISEMENT“Therefore, expanding access to ultrasound and speciﬁcally, Point-of-care ultrasound (POCUS) in the hands of clinicians at the bedside, is of primary importance to help doctors manage patients better and decrease the incidence of medical mistakes."
  },
  {
    "headline": "Rivers Govt To Probe 2 Fire Incidents That Occurred Within 24 Hours",
    "summarized_story": "The Rivers State government has said it will launch an investigation into the two fire incidents that occurred in less than 24 hours at the D-Line and Rumuagolu areas of the Port Harcourt metropolis.\nLess than 24 hours later, another fire incident occurred on Sunday afternoon at an uncompleted building suspected to be another dumped for illegally refined petroleum products at Rumuagolu community in Obio/Akpor local government area of the state.\nLike the fire incident that occurred in D-Line on Saturday night, that was a company premises; although the company is not in operation.\n“The Rivers State government has been able to set up two dedicated telephone lines for people to report unwholesome practices in the state.\n“So, it is important for people to understand that it is patriotic for people to report these unwholesome activities."
  },
  {
    "headline": "Terrorism charges: IPoB in search of new lawyer for Kanu",
    "summarized_story": "As the trial of the leader of the Indigenous People of Biafra, Mazi Nnamdi Kanu, enters a crucial stage, the umbrella body is seeking to recruit a top legal luminary to replace the current legal team that has been representing the breakaway agitator.\nAlthough IPoB has not discarded its current legal team made up of many lawyers, some who are rendering free services based on their belief in the cause that Mazi Kanu is leading, IPoB however wants the legal team to be spearheaded by a ‘lawyer with high pedigree, generally known and highly respected within the Nigerian judiciary’.\n“The envisaged SAN, when engaged, is expected to reorganize Mazi Nnamdi Kanu’s legal team, mobilize qualified and like-minded lawyers to work as coordinated legal team to secure victory over his terrorism and treason felony charges slammed on him by the Nigerian Government.\nIt was not also clears as at least night if IPoB had even approached Ikpeazu with any offer to represent its leader as the case against Kanu comes up early next year.\nIt will be recalled that on October 18, 2021, the Federal Government had filed an amended seven-count charge against the IPoB leader bordering on terrorism and treason felony."
  },
  {
    "headline": "Terrorism charges: IPoB in search of new lawyer for Kanu",
    "summarized_story": "As the trial of the leader of the Indigenous People of Biafra, Mazi Nnamdi Kanu, enters a crucial stage, the umbrella body is seeking to recruit a top legal luminary to replace the current legal team that has been representing the breakaway agitator.\nAlthough IPoB has not discarded its current legal team made up of many lawyers, some who are rendering free services based on their belief in the cause that Mazi Kanu is leading, IPoB however wants the legal team to be spearheaded by a ‘lawyer with high pedigree, generally known and highly respected within the Nigerian judiciary’.\n“The envisaged SAN, when engaged, is expected to reorganize Mazi Nnamdi Kanu’s legal team, mobilize qualified and like-minded lawyers to work as coordinated legal team to secure victory over his terrorism and treason felony charges slammed on him by the Nigerian Government.\nIt was not also clears as at least night if IPoB had even approached Ikpeazu with any offer to represent its leader as the case against Kanu comes up early next year.\nIt will be recalled that on October 18, 2021, the Federal Government had filed an amended seven-count charge against the IPoB leader bordering on terrorism and treason felony."
  },
  {
    "headline": "Gunmen kill cop, abduct five Chinese mine workers in DR Congo",
    "summarized_story": "Gunmen killed a police officer and kidnapped five Chinese nationals working at a gold mine in the Democratic Republic of Congo’s conflict-plagued east on Sunday, military sources said.\nRegional army spokesman Major Dieudonne Kasereka said that “at around 2 am, the camp of the Chinese group was attacked by armed bandits” in the village of Mukera in Fizi territory of South Kivu province.\nColonel David Epanga, head of the armed forces in Fizi, said one policeman was killed and another was wounded in the attack.\nThe five abducted Chinese workers were employees of a company that has been operating a gold mine in the area for four to five months, Fizi civil society head Lusambya Wanumbe said.\nIn August, South Kivu authorities suspended the work of half a dozen Chinese-financed companies, after residents accused them of mining for gold without permission and wrecking the environment."
  },
  {
    "headline": "Gunmen kill cop, abduct five Chinese mine workers in DR Congo",
    "summarized_story": "Gunmen killed a police officer and kidnapped five Chinese nationals working at a gold mine in the Democratic Republic of Congo’s conflict-plagued east on Sunday, military sources said.\nRegional army spokesman Major Dieudonne Kasereka said that “at around 2 am, the camp of the Chinese group was attacked by armed bandits” in the village of Mukera in Fizi territory of South Kivu province.\nColonel David Epanga, head of the armed forces in Fizi, said one policeman was killed and another was wounded in the attack.\nThe five abducted Chinese workers were employees of a company that has been operating a gold mine in the area for four to five months, Fizi civil society head Lusambya Wanumbe said.\nIn August, South Kivu authorities suspended the work of half a dozen Chinese-financed companies, after residents accused them of mining for gold without permission and wrecking the environment."
  },
  {
    "headline": "APC governorship aspirant Hamidu shot dead on Kaduna-Abuja Highway",
    "summarized_story": "By Abubakar AhmedAn APC governorship aspirant in Zamfara in the 2019 governorship election, Alhaji Sagir Hamidu, was killed by unknown gunmen on Sunday evening, a family source has confirmed.\nThe News Agency of Nigeria (NAN) gathered from the deceased’s elder brother, Kabiru Hamidu, that Sagir was killed near Abuja while he was returning from the weekend.\nSagir Hamidu, an Abuja-based businessman and former director in the federal civil service, aspired for the governorship of Zamfara under the Peoples Democratic Party (PDP) in 2011 but lost at the party’s primary election.\nHamidu who returned to the Yari faction of the APC in the state with the defection of the state governor, Alhaji Bello Matawalle, from the PDP to the APC to fight Matawalle’s leadership of the party in the state, a position he held till he was killed.\nAlso speaking over the development, the Director-General of Media to the governor, Malam Yusuf Idris, told NAN that the governor received the information with shock."
  },
  {
    "headline": "Reports: Bread prices going up in UK",
    "summarized_story": "The prices of bread could rise 20 per cent in the next few weeks in the UK as wheat prices hit a nine-year high.\nIndustry chiefs warned that rising global demand has sent the price of bread wheat up by 26.7 per cent in the past year.\nSome of the will be absorbed by retailers, reports Mail Online, but higher price tags on supermarket shelves are unavoidable.\nPasta has also become more expensive in recent weeks with food prices globally now at a ten-year high.\nAlice Jones, analyst with agricultural body AHDB, said: ‘UK prices are following global trends.’Bread wheat is now trading on commodity markets at £255.40 a tonne, up nearly 27 per cent on a year ago."
  },
  {
    "headline": "Names Of Victims On Lekki Tollgate Panel Report Are Fictitious – Kemi Olunloyo",
    "summarized_story": "Nigerian investigative journalist Kemi Olunloyo claims that numerous names in the #EndsSARS panel report believed to be victims of the Lekki Tollgate Killings are fictional.\nShe claimed she couldn’t discover any condolence notes on the victims’ social media accounts, despite the fact that they should have a phone and access to Facebook, Twitter, and Instagram.\nShe wrote on her Facebook posts;“There are several names in the panel report I couldn’t find online.\nThe average person that went to Lekki tollgate had a Phone, internet access with Facebook, Twitter or Instagram.\nHowever NONE of the profiles showed someone dead or condolences."
  },
  {
    "headline": "The Release Of IPOB Leader Would Be Very Dangerous – Arewa Youths President, Shettima",
    "summarized_story": "The Arewa Youths Consultative Forum, AYCF, has issued a statement warning against the release of Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB.\nIf the IPOB leader is released, AYCF’s National President, Yerima Shettima, has warned that additional Kanu’s will emerge, complicating the country’s insecurity situation.\nAllowing Kanu to go unpunished, Shettima said reoort, would be detrimental to Nigeria and the Federal Government.\nHe was reacting to President Muhammadu Buhari’s remark that he would consider the IPOB leader’s release.\nAmaechi pleaded with the president to release Kanu, rather than opt for military actions."
  },
  {
    "headline": "2023: PDP Presidential Candidate Will Be Decided By All Stakeholders – Wike",
    "summarized_story": "Nyesom Wike, the governor of Rivers State, has stated that the Peoples Democratic Party’s (PDP) presidential candidate in 2023 will be picked collectively by party stakeholders and at the appropriate time.\nOn Friday, he made the statement during a courtesy visit to Adamawa State Governor, Ahmadu Fintiri, at the Government House in Yola.\nThe successful holding of the PDP National Convention, according to Governor Wike, has put the party in a position to take power in 2023.\nFintiri, as well as other members of the PDP convention planning committee, were also complimented by Wike for conducting a rancor-free convention.\nFintiri commended all the PDP governors and other party stakeholders for the opportunity given to the committee to serve."
  },
  {
    "headline": "Mixed Reactions Trail As Buhari Consider Release Of Nnamdi Kanu",
    "summarized_story": "President Muhammadu Buhari’s announcement that he will examine the petition of some Southeast leaders to free Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB, has elicited mixed reactions.\nHowever, a constitutional lawyer, Maduabuchi Idam, contested the president’s claim that ordering Kanu’s release would constitute meddling with the judiciary.\nAbdullahi warned that Kanu’s release may serve as a spring board for other people to commit serious crimes and get away with it.\n“How do you start considering the release of a criminal like Kanu, who ordered killing of people.\n“The president, while considering should also note the damage Kanu is capable of doing if set free,” he told DAILY POST."
  },
  {
    "headline": "Yadda ɗan’uwana ya cika a gabana – Aliko Ɗangote",
    "summarized_story": ""
  },
  {
    "headline": "Matashiyar da aka taɓa zargi da safarar miyagun ƙwayoyi zuwa Saudiyya ta kammala makarantar NDLEA",
    "summarized_story": ""
  },
  {
    "headline": "Kwalejin Nazarin Kimiyyar Lafiya ta Keffi ta yi bikin yaye ɗalibai",
    "summarized_story": ""
  },
  {
    "headline": "Marigayi Yusuf Maitama Sule bai saci Kwabon al’umma ba – Jega",
    "summarized_story": ""
  },
  {
    "headline": "Drug Dealer Behind Cocaine Hidden In Lagos Airport Toilet Arrested",
    "summarized_story": "A Brazil-based drug dealer, Okafor Okwudili Moses has been arrested by operatives of the National Drug Law Enforcement Agency (NDLEA) over 2.55 kilograms of cocaine recovered from a toilet at the E-Arrival hall of the Murtala Muhammed International Airport, MMIA, Ikeja Lagos.\nThe following day, Saturday, November 13, the actual owner of the consignment, Okafor arrived at the airport from Brazil via an Ethiopian Airline and was promptly arrested.\nWhile being interviewed in custody, he confirmed he is the owner of the seized illicit drug.\nSimilarly, over 2, 832kg of drugs were seized and more than two hectares of cannabis farms destroyed in parts of Ekiti state.\nReacting to the arrest of Okafor and other suspects as well as the seizures from the states, Chairman/Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Goods And Properties Worth Millions Lost In Rivers Fire Outbreak",
    "summarized_story": "Goods and properties worth millions of naira have been lost to a devastating fire incident in Port Harcourt, Rivers State.\nThe fire, which lasted for over 10 hours since Saturday, began in an old premises of a moribund private company on Isiokpo Street in the D-Line Area of the city.\n﻿Read Also: Suspected Gas Explosion Triggers Wildfire In RiversWhile the cause is yet to be known, residents and the Rivers State Government suspect that the abandoned tankers in the premises may have been used by people who trade in illegally refined petroleum products which ignited the fire.\nAlthough the fire has been put out, men of the Federal Fire Service and the Government have urged residents to be observant and careful to avoid a fresh spark."
  },
  {
    "headline": "#EndSARS: CDD Backs Lagos Panel Report, Demands Full Implementation",
    "summarized_story": "The Centre for Democracy and Development (CDD) has backed the report of the Lagos State Judicial Panel of Inquiry on Restitution for the Victims of #EndSARS protest.\nCDD in a statement issued on Sunday by its Director, Idayat Hassan, demanded full implementation of the report led by Justice Doris Okuwobi, warning against attempts to discredit the document.\n“He should do well to publish the report and implement all the recommendations in it.\nAt CDD, we reiterate that justice delay is justice denied, hence the necessity to expedite action on the report.\nIt is time to heal wounds and provide closure for the victims,” the group said."
  },
  {
    "headline": "‘Okadas Being Used For Crime’: Lagos Crushes Over 400 Motorcycles",
    "summarized_story": "﻿The Lagos State Police Taskforce has crushed over 400 motorcycles seized from defaulting riders across the state.\nWith the traffic now, Okadas are being used to commit crime,” Mr Odumosu said.\n“And because of this now, the state government, in its wisdom, decided that Okadas should be restricted in some areas of the state.\n“Some people have insinuated that we sell back the Okadas to those we collect them from, thereby recycling it.\nThat’s why we decided that let the Doubting Thomases know that we don’t sell Okada."
  },
  {
    "headline": "Alleged N20bn Bailout: Kogi Govt Gives EFCC 48-Hour Ultimatum To Apologise",
    "summarized_story": "The Kogi State Government has given a 48-hour ultimatum to the Economic and Financial Crimes Commission (EFCC) to apologise and retract a malicious statement that it kept N20 billion bailout fund meant to pay salaries in a commercial bank meant to yield interest.\nThis is even as the Kogi State Government said it has gotten the bank’s response which exonerated them from running the account.\n“The Kogi State government does not currently operate or maintain a fixed-deposit account with Sterling Bank.\n“There is no mandate letter from the Kogi State Government to open account number 0073572696 with Sterling Bank.\nSterling Bank account 0073572696 is an internal mirror account operated by the bank for purposes of managing the Kogi State Salary Bailout facility,” Fanwo added."
  },
  {
    "headline": "Senator Marafa's Faction holds APC Congress In Zamfara LG's -",
    "summarized_story": "Hamza Mko -Tsafe LGA, Hon.\nTukur Waliyi – Bungudu LGA, Alh.\nSani Gyare kadauri – Maru LGA, Sa’idu Barebari- Gummi LGA, Al Mustapha Yakubu- Anka LGA others are Nasiru Sha’ibu – Bukkuyum LGA, Alh.\nSani Muh’d Kaya- Maradun LGA, Bello Halliru – Bakura LGA and Bello Sulaiman BS – Kaura Namoda LGA, Alh.\nIbrahim Imam – Birnin magaji LGA, Sirajo Ibrahim – Shinkafi LGA and Yakubu Mukhtar- Zurmi LGASenator Kabiru Marafa had on Friday last week Condemned the move by the APC National Headquarters to conduct Ward congresses in zamfara and vow to challenge the process in court."
  },
  {
    "headline": "Senate Transmits Electoral Act Amended Bill 2021 to Presidential Buhari -",
    "summarized_story": "The Senate has transmitted the Electoral Act amendment Bill 2021 to President Muhammadu Buhari for his assent.\nThe two Chambers of the National Assembly recently passed the bill after a conference meeting to iron out the inconsistencies in the separate bills passed by both chambers.\nThe two Chambers of the National Assembly recently passed the bill after a conference meeting to iron out the inconsistencies in the separate bills passed by both chambers.\nThe transmission of the bill to President Muhammadu Buhari was contained in note signed by the Senior Special Assistant to President Muhammadu on National Assembly Matters, Senate, Senator Babajide Omoworare.\nThe transmission of the bill to President Muhammadu Buhari was contained in note signed by the Senior Special Assistant to President Muhammadu on National Assembly Matters, Senate, Senator Babajide Omoworare."
  },
  {
    "headline": "Photos: APC National leader, Bola Tinubu arrives Kano to condole with Dangote family",
    "summarized_story": "The national leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has arrived in Kano to condole with the Dangote family over the death of Sani.\nLate Sani was the younger brother of the Africa’s richest man and chairman of the Dangote group, Aliko Dangote.\nThe former Lagos arrived the Kano international Airport alongside Kano state governor, Abdullahi Ganduje and other members of the state executive council."
  },
  {
    "headline": "College of Bishops, Council of Imams endorse Okorocha for 2023 presidency -",
    "summarized_story": "Former Governor of Imo state, Rochas Okorocha has been endorsed by a college of Bishops and Councils of Imams to be the country’s president come 2023.\nAt a press briefing in Abuja, they described Rochas Okorocha as an astute administrator, a philanthropist, that has spread his tentacles of good will across the country irrespective of tribe and religion."
  },
  {
    "headline": "Man United Sack Solskjaer, Announce Carrick as Interim Manager",
    "summarized_story": "Ole Gunnar Solskjaer has been sacked as Manchester United manager after an “embarrassing” 4-1 defeat at Watford.\nA club statement said: “Manchester United announces that Ole Gunnar Solskjaer has left his role as manager.\n“Ole will always be a legend at Manchester United and it is with regret that we have reached this difficult decision.\nThe Norwegian departs Manchester United with an inferior win percentage to that of Jose Mourinho, the man he replaced.\nThis summer, Manchester United brought in Cristiano Ronaldo, Jadon Sancho and Raphael Varane at considerable expense."
  },
  {
    "headline": "Somalia: Al-Shabab Suicide Bomber Kills Prominent Journalist in Mogadishu",
    "summarized_story": "A prominent Somali journalist who was a critic of the al-Shabab armed group was killed by a suicide bomber as he was leaving a restaurant in the capital, Mogadishu, relatives and officials said.\nAl-Shabab claimed responsibility for the blast, which killed Radio Mogadishu director Abdiaziz Mohamud Guled, commonly known as Abdiaziz Afrika.\nGovernment official Ismael Mukhtar Omar, an ex-colleague of Abdiaziz, told AFP news agency that police had confirmed that the blast had been caused by a suicide bomber.\nLiverpool 4-0 Arsenal: Jurgen Klopp happy with ‘mature’ performanceIt was a tame affair between the two long-standing rivals for most of the game but Liverpool showed their quality with a ruthless second-half display.\nLiverpool lacked intensity in the first half but got the opener through Mane, making use of the ever-reliable delivery of Alexander-Arnold."
  },
  {
    "headline": "DR Congo President Felix Tshisekedi Orders Mining Licences Audit",
    "summarized_story": "Felix Tshisekedi, president of the Democratic Republic of the Congo (DRC), has demanded a ban on issuing and trading mining permits until the country’s mining registry has been audited, a measure aimed at combating fraud within the sector.\n“This recommended clean-up will increase the contribution of the mining sector to the state’s budget and help, as a priority, the people benefit from the mineral wealth of our country,” Tshisekedi told ministers.\nTransparency activists have estimated the DRC has lost out on billions of dollars of revenue from mining deals over the past two decades.\nMining companies who fail to comply with their administrative and social obligations should have their licences revoked, Tshisekedi told Mining Minister Antoinette N’Samba.\nHe asked N’Samba to identify mining companies where the state had not gained 10 percent of shares when the permit flipped from exploration to exploitation, as required by the mining code."
  },
  {
    "headline": "US: Rittenhouse ‘Not Guilty’ Verdict Puts Biden in Difficult Political Spot",
    "summarized_story": "A difficult political atmosphere for President Joe Biden may have become even more treacherous with the acquittal of Kyle Rittenhouse.\nBiden was already facing sliding poll numbers with an electorate worn down by the coronavirus pandemic and increasing inflation.\nRittenhouse and his lawyers successfully argued that he had acted in self-defense during a confrontation in which he feared for his life.\nAnother Republican, Rep. Lauren Boebert of Colorado, on Saturday predicted that liberal outrage over the Rittenhouse trial would benefit her party.\nEven before the verdict, Biden had been facing increased pressure from some Democrats over the lack of progress on passing voting rights and police reform legislation."
  },
  {
    "headline": "In Double Standard, US Threatens Nigeria with Arms Embargo but Silent on Israel",
    "summarized_story": "But Blinken, in a surprise move, said his country would apply the Leahy Laws against Nigeria.\nIt is also important to the US Congress in making judgments about continuing to assist the security forces,” Blinken explained.\nBut a couple of things are really important,” Blinken added.\nHe explained that the report was important to make sure that such an incident would not happen again.\nSpeaking in Nigeria during a two-day official visit that ended on Friday, Blinken had disclosed that the delisting of Nigeria was based on facts."
  }
]