[
  {
    "headline": "Ivory Coast’s Gbagbo returns after acquittal by ICC",
    "summarized_story": "Ivory Coast’s former president Laurent Gbagbo returned home on Thursday for the first time in a decade after being acquitted by the International Criminal Court of crimes against humanity, AFP journalists saw.\nGbagbo, 76, arrived aboard a flight from Brussels to a tense atmosphere, with police using tear gas to disperse supporters near Abidjan airport.\nGbagbo was forced out in April 2011 after a months-long conflict sparked by his refusal to accept electoral defeat by Alassane Ouattara, the current president.\nThe short but bitter war claimed around 3,000 lives, divided the country along north-south lives and left traumatic memories that linger today.\nHis attorney Habiba Toure told AFP in Brussels that Gbagbo “is happy, enthusiastic and wants to play his part to try to reconcile Ivorians."
  },
  {
    "headline": "Ikpeazu calls for restructuring, devolution of power, others",
    "summarized_story": "The Abia State Governor, Okezie Ikpeazu, has called on the National Assembly to put in place measures for the commencement of the process of restructuring the nation and devolution of powersIkpeazu stated the need to amend the constitution to devolve powers to the states with respect to security arrangements.\nlkpeazu made the call while presenting Abia State’s position during the South East Zonal Public Hearing of the House of Representatives Special Committee on the Review of the Constitution of the Federal Republic of Nigeria held in Owerri, Imo State.\nRepresented by his Deputy, Sir Ude Oko Chukwu, Ikpeazu urged the National Assembly to urgently amend the constitution and establish a Federal, State and Local Government Police.\nIkpeazu further made a case for constitutional roles for traditional rulers who according to him are closer to the people to enable them perform better for the enhancement of good governance, rapid socio-economic development and provision of peace and security at the rural communities."
  },
  {
    "headline": "Paramount, partners on major US Military Aircraft programme",
    "summarized_story": "USAChairman of Paramount Group, Ivor Ichikowitz, on Thursday, disclosed that Paramount USA, and two of its partners have been selected to enter the final phase of the US Special Forces Command, SOCOM, Armed Overwatch aircraft flight demonstration programme, which could see around 75 aircraft acquired for over the $1 billion programme.\nThree teams namely Leidos, Paramount USA and Vertex were among five teams awarded a total of $19.3 million for prototype demonstrations and will advance the Bronco II aircraft to the Phase III Operational Prototype Demonstration later this month.\nWe are thrilled to have been selected to compete in the final phase.”Similarly, Leidos said the Bronco II is designed for ultimate mission flexibility.\nThe Bronco II is the US specific variant of Paramount’s multi-mission surveillance, reconnaissance and precision strike aircraft, The Mwari, which is being manufactured at Paramount’s Wonderboom factory in Pretoria, South Africa.\nThe Bronco II would be manufactured in Crestview, Florida and designed to meet the specific needs of US Special Operations Command."
  },
  {
    "headline": "Order prosecution of Minister fingered in $37million estate purchase fraud — Ortom urges President Buhari",
    "summarized_story": "By Peter Duru – MakurdiGovernor Samuel Ortom of Benue state has urged President Muhammadu Buhari to order the prosecution of the serving Minister fingered by the Economic and Financial Crimes Commission, EFCC, in $37million estate purchase fraud to save his integrity.\nAccording to the Governor, the Chairman of EFCC, Abdulrasheed Bawa had said that the affected Minister remitted $20million advance payment to the bank to make the property purchase.\n“You can imagine, a minister serving currently in the Federal Republic of Nigeria was caught buying a $37million estate.\nAnd we are told by the EFCC Chairman himself that this Minister remitted $20million to the bank.\nIf Mr. President is a man of Integrity, he should bring that Minister out and let him face prosecution,” he said."
  },
  {
    "headline": "Why army was authorized to enlist volunteers from Borno ― Buhari",
    "summarized_story": "He commended the state Governor, Prof. Babagana Zulum for his resilience and relentless efforts in rebuilding the state.\n“It was a mark of our appreciation for this sacrifice made by Borno State’s volunteers that the Nigerian Army was authorised to enlist hundreds of volunteers from Borno State into the Army.\n“It was part of these measures that I gave approval for the Federal Government to build 10,000 resettlement homes in Borno State.\nI highly commend the Borno State Government for its initiative in deploying the agro rangers.\n“I was exceedingly happy to commission very laudable capital projects executed at the Borno State University."
  },
  {
    "headline": "Vicious criminality, Economic challenges, mistrust, aggravate division everywhere — Audu Ogbe",
    "summarized_story": "A statement issued to Journalists on Thursday by the ACF National Publicity Secretary, Emmanuel Yawe, indicated that Audu Ogbe made the remarks at a meeting with Chief Olusegun Obasanjo and other leaders, recently.\nChief Audu Ogbe, at the meeting, explained that at no time has the realisation of these cherished ideals he mentioned, become more challenging and almost unattainable.\nAccording to the ACF chairman, “vicious criminality has sown fear in all.\nEconomic challenges exacerbate pain in our daily lives and mistrust continues to aggravate division everywhere.\nWe wish to say that among the multiplicity of challenges confronting us, one very tough one is the economy."
  },
  {
    "headline": "DSS to boost intelligence gathering in Imo",
    "summarized_story": "By Chinonso Alozie, OwerriThe Director of State Services, DDS, on Thursday, said that they would double their efforts in the area of intelligence gathering in Imo state to tackle any form of insecurity in Imo.\nThe DSS Director, Dr. Wilcox Idaminabo, gave this assurance when the Imo state governor, Hope Uzodimma, was at their state headquarters, in Owerri, for a working/familiarisation visit.\nAccording to the DSS director, that it would be one of the ways to show appreciation for the level of support the Uzodimma’s administration has given to the DSS to discharge their duties.\nAlso read: Okada rider shot dead by vigilante in DeltaIdaminabo, briefly said: “We will double our efforts to provide critical intelligence as a way of reciprocating the Governor’s gesture of supporting the Service in all areas, adding that the Governor is the first chief executive of the state to visit our office since it was relocated from Shell Camp.”Responding, the Imo state governor, Uzodimma, described the ” DSS as dependable partners and a radar for us to navigate, let me also commend the operatives for rising to the ocassion of their statutory role despite the paucity of resources to function.”“I am here at your office on a familiarisation visit the government appreciates all the sacrifices and efforts of the operatives, and that I want to assure you that my government’s relationship with the DSS, is that of partners in progress and I want the DSS to always count on the support of this government as you discharge your responsibility to the state, “Uzodimma said.\nVanguard News Nigeria"
  },
  {
    "headline": "Kebbi abduction: We are in hot pursuit of bandits",
    "summarized_story": "The Kebbi State Police Command has confirmed the abduction of unspecified number of students of Federal Government College, Birnin Yauri in the state.\nHe stated that officers of the command are currently in a hot pursuit of the assailants.\n“A combined team of Police operatives is currently in hot pursuit of bandits who today, June 17, 2021 attacked the Federal Government College, Birnin Yauri, Kebbi State.\nPolice confirm abduction of Kebbi School students, killing of officer“Following the attack, three teachers and yet to be ascertained number of students are still missing.\n“Meanwhile, the Commissioner of Police appeals to residents of Kebbi State to assist the Police with prompt information that would aid in solving the crime and apprehending the criminals."
  },
  {
    "headline": "Group protests activities of cultists in Awka",
    "summarized_story": "A coalition of youth organisation under the auspices of Concerned Anambra Youths, on Thursday, protested the activities of members of secret cults in Awka, the Anambra State capital.\nDAILY POST observed that no fewer than 60 youths have lost their lives to cult activities, occassioned by rivalry among groups, since January this year.\nThe coalition, consisting youths, moved round Awka streets on Thursday in a campaign meant to strengthen the fight against cultism, killings and other social vices.\nPolice arrests two suspects for alleged cult killing in AwkaThe protesters, who wielded placards during the protest march, lamented the increasing activities of cult groups among youths, saying it is posing threats to security in the society, especially in Awka.\n“All hands must be on deck to discourage cultism and its related activities for a safe, peaceful and secure society, ” he said."
  },
  {
    "headline": "Bayelsa Govt faults current revenue sharing formula in the Nigeria",
    "summarized_story": "Bayelsa State Government has criticised in strong terms the current revenue sharing formula in Nigeria, saying it is unjust, inadequate and unacceptable.\nHe advocated the creation of more local governments for the state as a way of resolving some of the imbalances in the sharing formula.\n“The current revenue sharing formula is totally unacceptable to us as a people.\nToday, you have written our story, the story of Bayelsa and Niger Delta.\nGesi Asamowei, who decried the continuous degradation of the Niger Delta region, lauded the author for documenting the story of the people of the region."
  },
  {
    "headline": "Insecurity: Students risk attacks as unarmed men guard Tertiary Institutions in Zamfara",
    "summarized_story": "Concerns have been raised over the use of unarmed security operatives in Tertiary Institutions in Zamfara considering the rising insecurity in the state.\nFindings by DAILY POST showed that most Tertiary Institutions in the state have unarmed private security personnel guarding school environments, a situation that has raised fear of schools’ vulnerability in the event of attacks.\nInvestigations also showed that security operatives at the State School of Nursing and Midwifery in Gusau, man the school environment without defensive weapons.\n“The private security operatives are just operating at their own risk because they don’t have any means of self-defence” he lamented.\nOur source claims that when the school had armed security operatives handling its security affairs, the school still paid N20,000 as allowances to each officer from its own pocket."
  },
  {
    "headline": "18-year-old EndSARS protester gives birth in prison",
    "summarized_story": "One of the youths arrested in Ondo State by security operatives during the EndSARS protest has given birth in prison custody.\nThe 18-year-old girl, Kemisola Oguniyi gave birth in Surulere Prison in Ondo West Local Government Area of the state where she was remanded.\nKemisola was arrested alongside three others, Ayodele Bukunmi, Ojo Samuel and Ani Obinna during the EndSARS saga.\nEndSARS protesters wanted to remove me as president – BuhariThey were remanded in prison custody shortly after a violent protest which rocked some parts of the country.\nIt was gathered that Kemisola went into labour on June 15, 2021, and gave birth to a baby boy the following day."
  },
  {
    "headline": "EURO 2020: All You Need To Know About This Week’s Matches On DStv And GOtv",
    "summarized_story": "We have all the match fixtures for the week and football fans can watch live on the dedicated SuperSport EURO2020 channel (DStv channel 204 and GOtv Channel 32).\nThese matches will be showing live on the dedicated SuperSport EURO2020 Channel (DStv channel 204 and GOtv channel 32).\nOn Monday 21 June, North Macedonia to take on Netherlands at 5pm live on SS EURO2020 (DStv channel 204 and GOtv channel 32), while Ukraine’s clash with Austria at 5pm will air live on SS Football (DStv channel 205 and GOtv channel 31).\nOn Saturday 19 June, Spain and Poland to clash at 8pm, also live on on SS EURO2020 (DStv channel 204 and GOtv Channel 32).\nOn Wednesday, 23 June at 8pm, Portugal versus France will be showing live on on SS EURO2020 (DStv channel 204 and GOtv Channel 32), while Germany versus Hungary will be live on SS Football (GOtv Channel 31)."
  },
  {
    "headline": "Air Peace Airline debuts Lagos-Ilorin flight",
    "summarized_story": "Agency ReporterThe inaugural flight of Air Peace Airline from Lagos to Ilorin has landed at the Ilorin International Airport on Thursday.\nHe assured the management of the Air Peace Airline of adequate security and a conducive environment to transact business without hindrance in all parts of the state.\nHe said Air Peace has been ensuring strategic and consistent routes network expansion driven by the company’s unwavering resolve to plug the gaps in the country’s air travel.\nOnyema disclosed that Air Peace was working to interconnect various cities in the country and beyond to tremendously impact the country’s economic indices.\nThe highlight of the inaugural flight ceremony was the cutting of tape and cake by the deputy governor, Mr Kayode Alabi."
  },
  {
    "headline": "Lagos records 6,800 awaiting trial inmates",
    "summarized_story": "Agency ReporterThe Comptroller of Corrections, Lagos State Command, Mr Adewale Adebisi, on Thursday said there were 6,800 inmates awaiting trial in the five correctional facilities in the state.\nThe session was spearheaded by the Lagos State Ministry of Justice as part of efforts to decongest correctional facilities in the state.\n“In Lagos, we have a total of 8,000 incarcerated inmates in the correctional facilities, out of which a total of 6,800 inmates are awaiting trial.\n“Some of these awaiting trial inmates have been standing trial in the courts for long.\nOf the 1,830 inmates, 283 have been convicted, 1,075 are awaiting trial, 88 are serving life terms, 372 are on death row and 12 inmates are lodgers (inmates in transit)."
  },
  {
    "headline": "Don’t borrow money without my knowledge, Wike tells new council chairmen",
    "summarized_story": "He said: “Don’t go and borrow money without the state government approval.\nEven we as State government, before we go and borrow money we get approval from the Debt Management Office.\nWike also charged the council chairmen to pay proper attention to issues of security to stem likely security breaches in their various councils.\nYou must make effort to relate with your DPOs.”The governor urged the council chairmen to ensure regular Security Council meetings.\nWike said he had received an intelligence report that some council chairmen had vowed they would not inaugurate some elected councillors perceived to be opposed to them."
  },
  {
    "headline": "UTME 2021: JAMB blacklists 18 CBT centres for infraction",
    "summarized_story": "By Gabriel DikeJoint Admissions and Matriculation Board (JAMB) has delisted 18 Computer Based Text (CBT) centres from among 820 approved centres for use in the 2021 Unified Tertiary Matriculation Examination (UTME).\nThe decision to blacklist the 18 CBT centres was taken after their underperformance during recent 2021 UTME mock examination nationwide.\nAlso, JAMB management placed 14 CBT centres under watch for various offences noticed during the conduct of the 2021 UTME mock examination.\nThe 2021 UTME will hold between Saturday, June 19, and July 3nationwide and in some foreign countries.\n“All examination officials, including the security agents, are to ensure compliance with all guidelines, rules and regulations on the examination,’’ JAMB said."
  },
  {
    "headline": "FG tightens noose on social, online media",
    "summarized_story": "However, stakeholders in the media industry kicked against the proposal which came barely a week after the NBC had asked all social media platforms and online broadcasting service providers to apply for a broadcast licence.\nGovernment moved to license social media companies after Twitter took down a tweet by President Muhammadu Buhari, after stating that the message violated its policy.\nThey argued that inclusion of internet broadcast and online media to the category of broadcast service licenses to be issued by the NBC will be injurious to freedom of expression and press freedom.\nOnly recently, NBC had asked all social media platforms and online broadcasting service providers to apply for broadcast licence.\nIts Director General, Armstrong Idachaba, gave the directive in a newspaper advertorial following Federal Government’s announcement that Twitter and other social media platforms must register as a Nigerian company for them to do business in Nigeria."
  },
  {
    "headline": "Baba Ijesha denied bail, to be tried in high court",
    "summarized_story": "By Romanus Okoye and Lukman OlabiyiYaba Chief Magistrate Court, yesterday, denied Nollywood actor, Omiyinka Olanrewaju, popularly known as Baba Ijesha, bail, on the ground that the same charge was already before a Lagos State High Court.\nThis sets the stage for trail of the actor at the High Court on charges bothering on rape, sexual assault and abuse of a minor.\n“Since there are indications that the matter is before the high court and the defendant will appear before the court, no bail can be given.\nBaba Ijesha was brought into the magistrate court premises around 12 noon, alongside other suspects.\nWhile in the dock, Baba Ijesha showed signs of discomfort as he kept bending intermittently."
  },
  {
    "headline": "Tanker explosion claims 7 lives at Idiroko",
    "summarized_story": "The Federal Road Safety Corps (FRSC) confirmed that seven persons died in an explosion after a commercial bus collided with a petrol tanker at Ajilete on Idiroko Expressway, yesterday.\nFRSC Idiroko Unit Commander, Akinwunmi Olaluwoye, said two other persons sustained injuries in the accident which happened at about 8.45am.\nHe said that the bus rammed into a tanker laden with 33 litres of petroleum product, while it was ascending the sloppy Ajilete road.\nNine persons were involved in the accident which claimed seven lives, leaving two others with various degrees of injury."
  },
  {
    "headline": "Gunmen behead Imo lawmaker’s guard, APC chieftain",
    "summarized_story": "The guard was said to have been overpowered by a large number of hoodlums who invaded the lawmakers house.\nSimilarly, Daily Sun gathered that the gunmen also beheaded an All Progressives Congress (APC) chieftain in the area, Jonathan Ugochukwu.\nWife of the APC chieftain, Mrs Nkechi Ugochukwu, disclosed that the gunmen carried her husband outside and beheaded him before torching their house.\nA community source also revealed that the rampaging gunmen also left with the head of the lawmaker’s guard.\n“They also invaded the house of another APC chieftain here, Jonathan Ugochukwu, burnt his house, beheaded him and left with his head."
  },
  {
    "headline": "Zambia’s First President, Kenneth Kaunda, is Dead",
    "summarized_story": "Kenneth Kaunda, Zambia’s first president and a key figure in its independence struggle, has died at the age of 97, his family has confirmed.\nKaunda was admitted to a hospital in the capital Lusaka on Monday suffering from pneumonia.\nIn the 1950s, Kaunda was a key figure in what was then Northern Rhodesia’s independence movement from Britain.\nAs head of the left-leaning United National Independence Party (UNIP), Kaunda then led the country through decades of one-party rule.\nKaunda – popularly known as KK – was a strong supporter of efforts to end apartheid in South Africa."
  },
  {
    "headline": "Keep CBN Overdrafts within Legal Limits, IMF Tells FG",
    "summarized_story": "Says banking sector remains liquid, well capitalisedBy Ndubuisi FrancisThe International Monetary Fund (IMF) has advised the federal government to keep reliance on overdrafts from the Central Bank Bank of Nigeria ((CBN) within legal limits.\nAccording to the IMF, real gross domestic product (GDP) is recovering but unemployment and inflation remain elevated, noting that recent exchange rate measures were encouraging.\nThe IMF mission recommended stepping up efforts to strengthen tax administration to mobilise additional revenues and help address priority spending pressures.\nIt also described as encouraging the recent removal of the official exchange rate from the CBN website and measures to enhance transparency in the setting of the NAFEX exchange rate.\nThe IMF called for the sustenance of the momentum towards fully unifying all exchange rate windows and establishing a market-clearing exchange rate."
  },
  {
    "headline": "Buhari: With Inter-agencies’ Synergy, Insurgents Now Feeling Ferocity of Our Firepower",
    "summarized_story": "I am therefore pleased to acknowledge that the military and other security agencies including civilian stakeholders are adhering to the true spirit of Operation HADIN KAI which implies jointness, synergy and cooperation,” Buhari added.\n“Concerted efforts are being made to fast-track re-construction and development programmes in the affected communities in the North East,” the President added.\nHe said he would continue to ensure that wounded soldiers received the best medical attention towards their full recovery.\nUnder my watch, the Armed Forces of Nigeria have been provided a firm strategy and clear sense of direction to safeguard the sovereignty and territorial integrity of the country,” the President said.\n“As personnel of our Armed Forces and security agencies, you must understand that these items of equipment must be put to good use against the terrorists and other criminal elements."
  },
  {
    "headline": "Buhari Visits ‘Operation Hadin Kai’ in Borno, Says Counter-insurgency War Must be Brought to Logical Conclusion",
    "summarized_story": "Your collective efforts have resulted in the relative peace being enjoyed in the region today.\nThe defence and security agencies should rest assured of the Federal Government’s unalloyed commitment to winning the battle against terror and criminality.\nSide by side with the efforts of the Armed Forces and security agencies, this Administration is developing a strategy for post-war reconstruction and peace-building.\nAlongside investment in development and reconstruction, we will sustain our investment in the Armed Forces in a manner that balances the “carrot and stick”.\nMuch more equipment will be procured for the Armed Forces to cater for both the short and long-term requirements."
  },
  {
    "headline": "Buhari, on Official Visit, Arrives Borno to Rousing Welcome",
    "summarized_story": "Maiduguri, the Borno State capital, is agog for President Muhammadu Buhari’s official visit to the state.\nThe president is in the state for a day official visit where he is expected to assess the security situation in the North-east, which has been battling with Boko Haram crisis for 12 years now.\nAlso in Maiduguri, the president is expected to commission some projects he sponsored in the state to address the relocation of internally displaced persons (IDPs), and some of the projects built by Governor Babagana Zulum.\nThe president touched down at the Nigeria Air Force Base in Maiduguri at 10.15 am where he was welcomed by the governor and other dignitaries.\nPresident Buhari has already started commissioning projects in the town and he is later expected to visit the palace of the Shehu of Borno and to have a meeting with the service chiefs who arrived the town on Wednesday ahead of the Commander-in-Chief."
  },
  {
    "headline": "BREAKING: Bandits Invade Federal Government College In Kebbi, Abduct Students",
    "summarized_story": "Bandits have abducted some students at Federal Government College, Birnin Yauri in Kebbi State.\nDetails of the incident are still sketchy, according to Daily Trust, but there are reports that a security operative was shot dead during the operation, though the killing of the security operative could not be confirmed.\nThwre have been a series of attacks on schools and abduction of pupils and students in Northern Nigeria.\nThe gunmen abducted two lecturers and eight students, according to Samuel Aruwan, the state's commissioner of internal security.\nAruwan confirmed that two students were shot; one died while the other was being treated in hospital."
  },
  {
    "headline": "BREAKING: Bandits Invade Federal Government College In Kebbi, Abduct Students",
    "summarized_story": "Bandits have abducted some students at Federal Government College, Birnin Yauri in Kebbi State.\nDetails of the incident are still sketchy, according to Daily Trust, but there are reports that a security operative was shot dead during the operation, though the killing of the security operative could not be confirmed.\nThwre have been a series of attacks on schools and abduction of pupils and students in Northern Nigeria.\nThe gunmen abducted two lecturers and eight students, according to Samuel Aruwan, the state's commissioner of internal security.\nAruwan confirmed that two students were shot; one died while the other was being treated in hospital."
  },
  {
    "headline": "EXPOSED: Nigeria's Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently currying the favour of the National Assembly's top echelon by awarding to them Bureau de Change licences.\nSaharaReporters learnt that principal and vocal members of the National Assembly have been awarded the licences by Emefiele so that they could mellow down on the several probes of infractions and misappropriations concerning the CBN.\nThe attempts by the National Assembly to probe into these CBN NIRSAL allegations had reportedly prompted the 'settlement' by the CBN governor.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "EXPOSED: Nigeria's Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently currying the favour of the National Assembly's top echelon by awarding to them Bureau de Change licences.\nSaharaReporters learnt that principal and vocal members of the National Assembly have been awarded the licences by Emefiele so that they could mellow down on the several probes of infractions and misappropriations concerning the CBN.\nThe attempts by the National Assembly to probe into these CBN NIRSAL allegations had reportedly prompted the 'settlement' by the CBN governor.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "PHOTONEWS: Buhari In Maiduguri After Weeks Of Keeping Trip A Secret To Avoid Displeased Borno Residents From Booing President",
    "summarized_story": "You may also like"
  },
  {
    "headline": "days after Google removed his Crowwe app",
    "summarized_story": "Instagram has taken down the account of Adamu Garba, a former presidential aspirant.\nAdvertisementThe chief executive officer of (CEO) of IPI Group broke the news on his Facebook page on Wednesday.\nChecks by TheCable Lifestyle showed his account has indeed been removed from the platform.\nAdvertisementSearch for his handle, @adamugarbaii, only displayed a blank page with a terse post which read “user not found.”It was not immediately clear why the Facebook-owned platform removed his account.\nAdvertisementIt also comes days after Google deleted Crowwe, his instant messaging and financial transaction app, from its Playstore."
  },
  {
    "headline": "JAMB: UTME candidates with incomplete registration should visit our special centres",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) says candidates for the 2021 Unified Tertiary Matriculation Examination (UTME) yet to complete their registration process should visit its special centres to finish it by June 15.\nBenjamin said only those who could not complete their registration during the stipulated period should visit the said centres.\nAdvertisement“At the end of the period originally scheduled for the 2021/2022 Unified Tertiary Matriculations Examination (UTME) and Direct Entry (DE) registration on May 15, the registration period was extended,” the statement read.\nAdvertisement“The candidates who have not registered but have secured the profile codes and initiated the registration process are expected to visit the specially designated registration centres to complete the registration on Tuesday, June 15.\n“The identification number on each form given to the candidates has been used to assign the candidates to their registration centres."
  },
  {
    "headline": "BUK warns against protest after student’s death",
    "summarized_story": "The management of Bayero University Kano (BUK) has warned its students against protesting the death of a 200-level student who was crushed by a moving vehicle.\nAdvertisementMalam Lamara Garba, the varsity’s secretary of information and publication, issued the warning in a statement on Sunday.\nGarba stated that Moshood was hit by a fast-moving vehicle outside the university on June 8 at about 10:00 pm.\nAdvertisementHe said the vice-chancellor had directed the dean of students affairs to visit the scene and take all necessary action.\nThe University did everything possible to save the life of Moshood, so any student(s) caught protesting will be decisively dealt with."
  },
  {
    "headline": "Iyabo Ojo and ex-employee trade words over theft claim",
    "summarized_story": "Iyabo Ojo, Nollywood actress, and Gbeminiyi Adegbola, her former employee, have engaged in a heated war of words on social media over allegations of theft.\n“I heard you say you took me like a daughter and I almost ruined your business.\n“You’re the only sacrificial lamb; business that we both know what’s up, business I gave my best but to you.\n“I went ahead, sold all my gold, which you, Gbemi, helped me carry to the buyer in Yaba.\n“I have the evidence of how you manipulated company accounts; witnesses, some of these staff still work for me.”Advertisement View this post on Instagram A post shared by Olori Alice Iyabo Ojo (@iyaboojofespris)Copyright 2021 TheCable."
  },
  {
    "headline": "Hauwa Indimi recalls how critic disapproved of her sitting down to pray during pregnancy",
    "summarized_story": "Hauwa, the daughter of Mohammed Indimi, billionare founder of Oriental Energy, has recalled when a woman gave her a disapproval for sitting down to pray while she was pregnant.\nAdvertisementShe was reacting to a comment by Toni Tones, a media personality, on the struggles of women during pregnancy.\nTones wrote: “Loss of teeth, loss of hair, facial paralysis, varicose veins, swollen ankle, acne, nausea, back pain, and so much more.\nSick of the culture around here expecting women to suck things up.\n“Woman gave me the side-eye when I was pregnant with my son and seated while praying."
  },
  {
    "headline": "TeamApt anticipates unicorn bells on the back of $16bn agent banking blitz",
    "summarized_story": "TeamApt has become a leader in Nigeria’s agent banking business and that could drive it to the envied status of a billion-dollar startup in the coming months.\nHis audacity is based on data from SANEF, the body empowered by the Central Bank of Nigeria to oversee agent banking in Nigeria.\nAccording to this data, TeamApt accounts for 74% of the agent banking industry based on the volume of transactions processed monthly.\nIn March 2021, TeamApt processed over ₦1trillion ($2.4 bn) for the first time, according to the CEO.\n🚀🚀🚀 #JustPagait — Tayo Oviosu (@oviosu) June 7, 2021Not much is known about Firstmonie, also in the agent banking heavyweight category."
  },
  {
    "headline": "Banks and startups need to partner for growth but who can solve the risks involved?",
    "summarized_story": "Five Nigerian banks have signed up as pioneer members of a new initiative that aims to increase partnerships between corporations and startups in emerging markets.\nVFD Group, an investment company that owns VBank, a digital bank, has also signed up.\nBut emerging market narratives of disruption that pit startups and corporates against each other gloss over many avenues of collaboration that currently lie fallow.\nStartups are experiments and could come with reputational risks for corporates when they fail or splinter into some sort of scandal.\nIt is possible that startups and corporates can, on their own, set up the right structures and interfaces to reduce such risks."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Gebeya announces the relaunch of its freelance marketplace, plans to grow its talent pool to 15,000 in 3 years.",
    "summarized_story": "Ethiopia-based startup, Gebeya, has announced the launch of its Pan-African freelance marketplace, which would connect startups and small and medium enterprises with the professional talents needed to grow their businesses.\nFounded in 2016 to train African youth in technology skills, Gebeya is similar to freelance platforms such as Upwork and Fiverr.\nGebeya began as an edtech startup helping Africans gain tech skills before matching them with employers.\nWith the relaunch of the talent platform, the startup can connect more talents with jobs.\nGebeya’s matching algorithm considers location, language, and budget when matching businesses with talents."
  },
  {
    "headline": "Kenya-based foodtech startup, Kune, closes $1 million pre-seed round for official launch",
    "summarized_story": "Kune, a Kenya-based foodtech startup, has announced raising $1 million in pre-seed funding.\nConsonance Investments, Liechtenstein-based investment company, Century Oak Capital GmbH, and Pariti, an ecosystem management firm also invested in this round.\nFounded in December 2020 by France-born Robin Reecht, Kune’s objective is to provide ready-to-eat food services at a moderate price.\nHe took it upon himself to proffer a sustainable solution to bridge the gap between great food and affordable pricing.\nWith Kune anticipating a fast growth rate, we just might have more founders looking into Africa’s foodtech space."
  },
  {
    "headline": "SA-based Triggerfish studio partners Disney to release African-themed animation series in 2022",
    "summarized_story": "South African animation studio, Triggerfish, in collaboration with other reputable studios like Walt Disney, is set to produce a ten-part African-themed sci-fi series, which will be a feature-length animation film.\nTitled Kizazi Moto: Generation Fire, the Disney original movie is set to be released on Disney+ in 2022.\nIn December 2020, the company hinted at a collaboration with a pan-African entertainment entity, Kugali Media, to produce an animation set in Lagos, Nigeria.\nCreators behind the series include Ahmed Teilab (Egypt), Simangaliso ‘Panda’ Sibaya and Malcolm Wope (South Africa), Terence Maluleke and Isaac Mogajane (South Africa), Ng’endo Mukii (Kenya), Shofela Coker (Nigeria), Nthato Mokgata and Terence Neale (South Africa), Pious Nyenyewa and Tafadzwa Hove (Zimbabwe), Tshepo Moche (South Africa), Raymond Malinga (Uganda) and Lesego Vorster (South Africa).\nApparently, the African animation industry has continued to be taken seriously, considering the growing interest from global animation studios like Disney."
  },
  {
    "headline": "Airfares may crash in summer as Boeing Max 8 returns, COVID-19 fears hover",
    "summarized_story": "Nigerians travelling to various countries for summer holidays this year may be paying less for airfare as airlines deploy more aircraft to various destinations with the return of Boeing Max 8.\nThis will increase capacity of airlines than it was during the grounding of the aircraft type in 2019.\nThe Boeing Max 8 aircraft was grounded worldwide on March 13, 2019, after two crashes, one in Indonesia in 2018 and the other in Ethiopia in 2019, killing 346 people.\nRead Also: Green Africa disrupts airline business with cheap airfaresIn all, 13 carriers are now flying the 737 Max on commercial services.\nIf there was no COVID-19, the impact of the return of Boeing Max 8 would have been appreciated but a lot of people are still afraid to fly because of COVID-19,” Akporiaye says."
  },
  {
    "headline": "Nigeria’s slowing inflation eludes consumers",
    "summarized_story": "Nigerians are struggling to relate with the month of May’s inflation numbers which show that consumer goods prices rose at a slower pace.\nThe headline inflation number released by the National Bureau of Statistics (NBS) shows that inflation for the month of May 2021 settled at 17.93%, which was 0.19% lower than the 18.12% of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigerian banks defy trend of rising bad loans, declining profits across Africa",
    "summarized_story": "Nigerian banks were the exception to soaring bad loans and declining profits at African banks in 2020 when the COVID-19 pandemic brought widespread economic disruption to the continent.\nThe financial reports of the 15 largest banks in South Africa, Nigeria, Kenya and Morocco analysed by global credit ratings agency, Moody’s, show nonperforming loans (NPLs) at…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "NDDC has failed, not living up to its responsibilities, Obaseki insists – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has restated that the Niger Delta Development Commission (NDDC) is not living up to its responsibility of ensuring infrastructural development in the Niger Delta and raising the standard of living of the people.\nObaseki said this on Thursday when he received the Odiowere and elders of Ugha Quarters of Urhonigbe Town in Orhionmwon Local Government Area, who were on a courtesy visit at the Government House, Benin City.\nHe said: “We are aware and know that the road has been awarded by NDDC.\nObaseki continued: “As soon as possible, we would send government agencies to check the immediate state of the road and report back.\nWe will deliver the dividends of democracy to the people of the State, including Ugha Quarters in Urhonigbe."
  },
  {
    "headline": "Edo Poly matriculates 2,200 new students, as Rector lauds Obaseki on support, partnership – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Polytechnic, Usen, has matriculated 2,200 new students into its National Diploma (ND) and Higher National Diploma (HND) programmes, with the intakes charged to be of good character and pursue excellence in their studies.\nRector of the Polytechnic, Professor Abiodun Falodun, made the submission during the school’s 19th matriculation ceremony, held in Usen, Ovia South West Local Government Area (LGA) of Edo State.\nThe Rector noted that the Edo State Governor, Mr. Godwin Obaseki, has provided immense support to drive change and community impact in the school, especially in securing accreditation for new programmes.\nHe added that the governor recently entered into partnership with the school for training of government’s secretarial staff in computer science/data processing.\nOur sincere gratitude to His Excellency, Governor Godwin Obaseki, for the invaluable assistance in the accreditation exercise."
  },
  {
    "headline": "Osinbajo presides over virtual NEC meeting – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Vice President Yemi Osinbajo presided over a virtual meeting of the National Economic Council (NEC) on Thursday at the Presidential Villa, Abuja.\nUnder the Nigerian Constitution, the vice president is the chairman of NEC.\nThe council’s meeting is held monthly to deliberate on the coordination of the economic planning efforts and economic programmes of the various levels of government.\nNEC comprises the 36 state governors, the governor of Central Bank of Nigeria, minister of finance, Secretary to the Government of the Federation and other government officials whose duties hinge on the economy.\nAt the last meeting on May 20, NEC declared its support for Nigeria’s effort at digital switch over."
  },
  {
    "headline": "Kidnapping Syndicate; Recover Arms – Nigerian Observer",
    "summarized_story": "The duo were arrested by the police on routine patrol/stop and search duty along Ughelli-Warri express way who intercepted a Toyota Picnic car navy blue in colour with Reg.\nAAA 464 YA with six (6) male occupants.\nAccording to a statement signed by DSP.\nPOLICE PUBLIC RELATIONS OFFICER, DELTA STATE COMMAND, the Countenance of some the passengers crave suspicion hence they were all asked to come down for search.\nHe however said that , investigation was still ongoing."
  },
  {
    "headline": "JUST IN: Bandits storm federal college in Kebbi, abduct students, staff",
    "summarized_story": "ADVERTISEMENTArmed bandits have abducted an undisclosed number of staff and students of the Government College (FGC), Yauri in Kebbi State, North-west Nigeria.\nPRNigeria reported that aside the kidnap, the bandits gathered that the bandits shot security personnel during an exchange of gunfire.\n“A combined team of Police operatives is currently in hot pursuit of bandits who today, June 17, 2021 attacked the Federal Government College, Birnin Yauri, Kebbi State.\nThe state shares boundaries with Kebbi state.\nThe students of the private university in Kaduna State were abducted on April 20 after bandits invaded their hostels."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Sexual Abuse: Akwa Ibom Varsity Sacks 14 Lecturers",
    "summarized_story": "The Akwa Ibom State University (AKSU) has disclosed that 14 lecturers have been shown the exit door for sexually abusing students.\nAdvertisementsAlthough the names of the randy teachers were not mentioned, the vice chancellor of the state-owned university, Prof Nse Essien, said the university will continue to weed out undesirable elements within its ranks.\nWhile admitting that he had been far away from the NUJ and the media community, the vice chancellor promised to cultivate a mutually beneficial relationship between the NUJ and AKSU.\nComrade Etuk suggested to Prof. Essien to use the occasion of his first anniversary in office to showcase the developments in AKSU, under his watch.\nADVERTISEMENTThe vice chancellor was accompanied on the visit by the deputy Vice Chancellor (Academic), Prof. Umoren Umoren and the head of the Directorate of Information, Public Relations and Protocol, Mr. Akaninyene Ibanga."
  },
  {
    "headline": "Sexual Abuse: Akwa Ibom Varsity Sacks 14 Lecturers",
    "summarized_story": "The Akwa Ibom State University (AKSU) has disclosed that 14 lecturers have been shown the exit door for sexually abusing students.\nAdvertisementsAlthough the names of the randy teachers were not mentioned, the vice chancellor of the state-owned university, Prof Nse Essien, said the university will continue to weed out undesirable elements within its ranks.\nWhile admitting that he had been far away from the NUJ and the media community, the vice chancellor promised to cultivate a mutually beneficial relationship between the NUJ and AKSU.\nComrade Etuk suggested to Prof. Essien to use the occasion of his first anniversary in office to showcase the developments in AKSU, under his watch.\nADVERTISEMENTThe vice chancellor was accompanied on the visit by the deputy Vice Chancellor (Academic), Prof. Umoren Umoren and the head of the Directorate of Information, Public Relations and Protocol, Mr. Akaninyene Ibanga."
  },
  {
    "headline": "We’ll Bring Perpetrators Of Ibadan Violence To Book – Makinde",
    "summarized_story": "The governor of Oyo State, ‘Seyi Makinde, on Thursday morning, condemned Wednesday’s violence, which erupted in Iwo Road axis of Ibadan, the state capital.\nAdvertisementsThe governor, who toured the affected area, said that the government will bring perpetrators of the act to book.\nHe said: “I visited the scene of the Iwo Road incident this morning.\nIn the meantime, we will sanitise the area behind Iwo Road where cultists congregate, and review the Park Management System.\nAdvertisements“We have also informed the phone sellers to choose representatives who will discuss how we can assist them.”Some of the phone sellers in the area were alleged to have been victims of the crisis."
  },
  {
    "headline": "We’ll Bring Perpetrators Of Ibadan Violence To Book – Makinde",
    "summarized_story": "The governor of Oyo State, ‘Seyi Makinde, on Thursday morning, condemned Wednesday’s violence, which erupted in Iwo Road axis of Ibadan, the state capital.\nAdvertisementsThe governor, who toured the affected area, said that the government will bring perpetrators of the act to book.\nHe said: “I visited the scene of the Iwo Road incident this morning.\nIn the meantime, we will sanitise the area behind Iwo Road where cultists congregate, and review the Park Management System.\nAdvertisements“We have also informed the phone sellers to choose representatives who will discuss how we can assist them.”Some of the phone sellers in the area were alleged to have been victims of the crisis."
  },
  {
    "headline": "Iheanacho Has ‘Cut Soap For Me’, Says Governor Yahaya Bello",
    "summarized_story": "Kogi State governor, Yahaya Bello, has revealed that Nigerian international footballer, Kelechi Iheanacho, has “cut a soap” for him.\nAdvertisementsThe slang, “cut a soap for me”, is a popular saying in Nigeria which translates to asking a supposedly rich person to share the secret of his or her fortunes with another person.\nThe Super Eagles and Leicester City forward had visited the Kogi governor at the latter’s Abuja residence on Thursday.\nGovernor Bello, who described the footballer as a “Senior Man” and as well congratulated him for the recent FA Cup win by his club, took to his official Facebook page to announce Iheanacho’s visit in a rather strange manner in pidgin English.\nBello wrote: “Finally, Senior Man Kells Kelechi Iheanacho don cut soap for me!"
  },
  {
    "headline": "Man arrested for stealing bag of rice in Anambra — Daily Times Nigeria",
    "summarized_story": "By Dilibe MichaelA 32 years old man identified as Ndubuesi Ndubuesi on Thursday has been arrested in Ukwulu town, Dunukofia LGA in Anambra State.\nThe suspect, Ndubuesi was caught by Ukwulu youths on Thursday, June 17.\nDuring interrogation, the 32yrs man confessed that he steal people’s rice anytime his in need of money and sell them to his clients.\nThe suspect was prevented from being set ablaze by angry youths in the village by the Ukwulu security men.\nThe Ukwulu security men have arrested the suspected man and have been taken under their custody in Ukwulu."
  },
  {
    "headline": "APC Convention: President Buhari to fix tentative date – PGF",
    "summarized_story": "By Tom OkpeGovernors on the platform of the ruling All Progressives Congress (APC) under the aegis of the Progressive Governors Forum (PGF) stated on Thursday that the tentative date of the party national convention will be fixed by the president Muhammadu Buhari.\nThe Governors indicated that there is a proposal of the convention on Mr President’s table and the moment he signs, the national Caretaker Extraordinary Convention Planning Committee, (CECPC) led by Mallam Mai Mala Buni will announce the date.\nPGF also passed a vote of confidence on the Caretaker Committee Chairman, Governor Buni of Yobe state and his caretaker committee members for their outstanding performance in rebuilding the party.\nThey commended Governor Buni for providing excellent leadership to the party at the most critical period.\n“There is a proposal before Mr. President and once he approves it, the National Caretaker Committee will announce the date,” Bagudu stated."
  },
  {
    "headline": "Navy impounds 251 bags of smuggled rice, siezes boat in A’Ibom — Daily Times Nigeria",
    "summarized_story": "The Nigerian Navy, Forward Operating Base (FOB), Ibaka, Mbo Local Government Area of Akwa Ibom, has impounded 251 bags of smuggled rice and siezed the boat used in smuUggling the rice.\nSuleiman Abdullahi, disclosed this to newsman in Ibaka on Thursday when he handed over the bags of rice to the Nigerian Customs Service(NCS).\nAbdullahi said that the 251 bags of rice were seized from smugglers on June 15, during routine patrol operations by the Forward Operating Base.\n“What you are witnessing here today is the handover of 251 bags of rice suspected to be smuggled into the Nigerian maritime border.\nBy the directive, we have carried out intensive patrol and on June 15, 2021, we seized one wooden boat and 251 bags of smuggled rice."
  },
  {
    "headline": "FG establishes portal for 10m farmers for efficient monitoring of...",
    "summarized_story": "The Federal Government says it has established an online portal to ensure efficient and effective monitoring of its interventions in the Agricultural Sector.\nThe Minister of Agriculture and Rural Development, Alhaji Muhammad Nanono, made the disclosure at the 44th Regular Meeting of the National Council of Agriculture and Rural Development on Thursday in Abuja.\n“Although, we initially set out to capture the data of 2.4million farmers across the country, the results from the exercise have encouraged the Economic Sustainability Plan team to expand the data capture to 10 million farmers.\n“A major hallmark of our agricultural interventions is inclusiveness.\n“This approach is believed to be the right one for achieving our desired economic diversification and national development,” he said."
  },
  {
    "headline": "Tompolo hosts Nollywood stars, as cast of In The Creek visits Oporoza",
    "summarized_story": "High chief Tompolo who’s reputation for the advocacy of human Rights, and the well-being of the Niger Delta people is legendary, thanked his guests and equally endorsed the values of In The Creek movie.\nTompolo further stated that he will continually support any effort that seeks to engender peace and progress for the people of the Niger Delta and Nigeria in general.\nElated Tompolo also promised to support any venture that will engage the youths meaningfully and help bring development to the region.\n“Our meeting with Tompolo was very fruitful and rewarding.\nHe embodies activism, philanthropy and uncanny vision for his people”, stated Thompson, the director of In The CreekShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Tompolo hosts Nollywood stars, as cast of In The Creek visits Oporoza",
    "summarized_story": "High chief Tompolo who’s reputation for the advocacy of human Rights, and the well-being of the Niger Delta people is legendary, thanked his guests and equally endorsed the values of In The Creek movie.\nTompolo further stated that he will continually support any effort that seeks to engender peace and progress for the people of the Niger Delta and Nigeria in general.\nElated Tompolo also promised to support any venture that will engage the youths meaningfully and help bring development to the region.\n“Our meeting with Tompolo was very fruitful and rewarding.\nHe embodies activism, philanthropy and uncanny vision for his people”, stated Thompson, the director of In The CreekShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Tight security as Buhari, service chiefs visit Maiduguri",
    "summarized_story": "There is a heavy presence of security operatives in Borno State as the President, Major General Muhammadu Buhari (retd.)\nand some service chiefs arrived Maiduguri, the state capital on Thursday morning.\nThe presidential jet landed at the Nigerian Air Force wing of the Maiduguri International Airport around 10am.\nBuhari and his entourage were received by the state governor, Babagana Zulum; as well as other government officials.\nThe governor, had in a statement on Wednesday, said, “President, Muhammadu Buhari, will be coming to Borno State on Thursday, the 17th of June, 2021."
  },
  {
    "headline": "Tight security as Buhari, service chiefs visit Maiduguri",
    "summarized_story": "There is a heavy presence of security operatives in Borno State as the President, Major General Muhammadu Buhari (retd.)\nand some service chiefs arrived Maiduguri, the state capital on Thursday morning.\nThe presidential jet landed at the Nigerian Air Force wing of the Maiduguri International Airport around 10am.\nBuhari and his entourage were received by the state governor, Babagana Zulum; as well as other government officials.\nThe governor, had in a statement on Wednesday, said, “President, Muhammadu Buhari, will be coming to Borno State on Thursday, the 17th of June, 2021."
  },
  {
    "headline": "Igboho to Buhari: Order Fulani in Southwest to vacate now",
    "summarized_story": "By Taiwo OkanlawonSelf-acclaimed Yoruba activist, Sunday Adeyemo also known as Sunday Igboho has urged President Muhammadu Buhari to order Fulani in the Southwest to vacate the region.\nIgboho, in a video, claimed that Fulani were behind banditry and kidnapping in the Southwest, hence they should vacate the region.\nIgboho said he would comb Southwest forest to ensure that Fulani were evicted from the region.\nREAD ALSO: Buhari to security forces: Don’t give breathing space to terrorists, criminalsSpeaking in Yoruba, Igboho said: “How can six million Fulani people be commanding about 250 million other Nigerians?\n“Tell President Buhari, if he doesn’t understand Yoruba; tell him in English Language that we don’t want Fulani bandits in our zone again."
  },
  {
    "headline": "Makinde vows to bring to book Iwo Road rioters",
    "summarized_story": "By Muhaimin OlowoporokuGovernor Seyi Makinde of Oyo has vowed to bring to book those involved in the deadly clash in Iwo Road on Wednesday.\nThe governor said this on Thursday after he visited the scene, where some drivers, park managers and telephone sellers clashed in the popular Iwo Road park in Ibadan.\nWhile lamenting what happened, Makinde said he would ensure everybody involved would be brought to book.\n‘I visited the scene of the Iwo Road incident this morning.\nIn the meantime, we will sanitise the area behind Iwo Road where cultists congregate and review the Park Management System."
  },
  {
    "headline": "Kenneth Kaunda the weeping president: His life and times",
    "summarized_story": "Agency ReportsKenneth Kaunda, Zambia’s founding president, who was not ashamed to weep in public, has died.\nAuthorities declared 21 days of mourning for the liberation hero who ruled from 1964, after the southern African nation won its independence from Britain, until 1991.\nAlthough Zambia’s copper-based economy fared badly under his long stewardship, Kaunda will be remembered more for his role as an anti-colonial fighter who stood up to white minority-ruled South Africa.\nAfter his son and political heir Wezi Kaunda was murdered in October 1999, Kaunda announced his withdrawal from domestic politics to concentrate on halting the spread of AIDS through his Kenneth Kaunda Children of Africa Foundation.\nIn his later years he led a quiet life, mostly staying at home and only occasionally appearing at state functions."
  },
  {
    "headline": "Nigeria’s Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "Godwin Emefiele, the Governor of the Central Bank of Nigeria, is currently currying favor with the National Assembly’s upper echelon by granting them Bureau de Change licenses.\nAccording to SaharaReporters, Emefiele granted the licenses to key and vociferous members of the National Assembly so that they could take a break from the numerous investigations into CBN infractions and misappropriations.\nAccording to SaharaReporters, some politicians used third-party firms to secure CBN licenses, while others who lacked the required financial deposits were helped by the CBN governor to obtain government loans.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "Court Orders Akeredolu To Stop Investigating The Chief Judge For Alleged Wrongdoings",
    "summarized_story": "Rotimi Akeredolu, the governor of Ondo, and the state house of assembly have been ordered to cease the investigation into Oluwatoyin Akeredolu, the state’s chief judge, over a viral video created by one Olupelumi Fagboyegun by a federal high court in Abuja.\nIn a video that went viral on social media, Fagboyegun accused the top judge of misusing her position and influencing his lengthy arrest.\nAs a result, the governor ordered an investigation into the accusation by the state attorney general.\nHe held it is only the NJC that is empowered under the constitution to probe allegations of official misconduct against any judge.\nEkwo set aside all steps taken in the investigation and granted an order of perpetual injunction, restraining all the defendants from further taking any steps in relation to the case."
  },
  {
    "headline": "After A Ten-year Exile, Former President Gbabo Returns To Côte d’Ivoire",
    "summarized_story": "Laurent Gbagbo, the former President of Côte d’Ivoire, has boarded an airplane to return home for the first time since being deposed in 2011.\nMr. Gbagbo was extradited to The Hague on charges of war crimes, although he was later acquitted.\nHundreds of people took to the streets in Abidjan’s Yopougon district, which is considered Mr Gbagbo’s political stronghold.\nHe was acquitted in 2019 of war crimes and crimes against humanity charges by the International Criminal Court for his role in the violence.\nMr Gbagbo’s return comes after protracted negotiations between his camp and the government, which delayed granting him a passport until after the 2020 election had passed."
  },
  {
    "headline": "Rivers United Coach Eguma, Kidnapped, Plateau Stadium Manager Killed",
    "summarized_story": "On Tuesday, Rivers United Football Club was rocked by the news that their manager, Stanley Eguma, had been kidnapped by unknown criminals.\nUnknown gunmen assassinated Isa Garba, the assistant stadium general manager at the Rwang Pam Stadium, in Jos on Monday.\nRivers United were in Gombe for a League match against Adamawa United on Sunday, and Eguma was kidnapped along the Enugu axis on their way back to Port Harcourt.\nIn Jos, Assistant Manager, Rwang Pam Stadium, Isa Garba was yesterday afternoon shot dead in his office at the Rwang Pam Township Stadium in Jos.\nHe was Assistant Secretary General of the Nigeria Olympic Committee (1993 to 1997) and Secretary General (1997 to 2001)."
  },
  {
    "headline": "Laycon, Dorathy, Erica, other BBNaija housemates set for reunion *See how, when to connect and watch",
    "summarized_story": "The re-union show of those that contested during the BBNaija season 5 ‘Lockdown’ edition has been scheduled to begin Thursday.\nIn a post made through its Instagram page, BBNaija stated, “It’s tonight #BBNaija Fam!!\nAll the 20 ex-housemates in the season 5 edition will get the opportunity to meet and probably clear the controversies towards each other during the Reunion Show.\nThe show will also provide an opportunity to find a resolution to some of the contentious and controversial issues that happened during the Lockdown edition of the BBNaija reality TV programme.\nSome of the unresolved issues are the controversial eviction of Erica, the controversy between Erica and Lilo, Lucy and Nengi, Ozo, Dorathy, and Nengi, and that of Praise and Lucy among others."
  },
  {
    "headline": "Breaking: Zambia ‘s first President, Kenneth Kaunda, is dead",
    "summarized_story": "Kaunda, who ruled Zambia from 1964 to 1991, died at a hospital in Lusaka where he was being treated for pneumonia.\nKenneth Kaunda, Zambia’s founding president and liberation hero, has died at a military hospital in Lusaka where he was being treated for pneumonia, his son, Kambarage, said on Thursday.\nKaunda ruled Zambia from 1964, when the southern African nation won its independence from Britain, until 1991, and afterwards become one of Africa’s most committed activists against HIV/AIDS.\nHe started his political career as organising secretary of the Northern Rhodesia African National Congress (ANC) in the Northern Province of Zambia.\nBut in 1958 he broke from the ANC to form the Zambian African National Congress (ZANC)."
  },
  {
    "headline": "VIDEO: Watch what remaining students did after bandits abducted school mates in Kebbi",
    "summarized_story": "PreviousPictures: Confusion as students, others flee day bandits kidnapped many inside Kebbi school"
  },
  {
    "headline": "Bank PHB ex-MD Atuche jailed 12 years for N25.7bn fraud -NigPilot",
    "summarized_story": "JUSTICE Lateefa Okunnu of the Lagos State High Court, Ikeja, has sentenced a former Managing Director of defunct Bank PHB Plc, Francis Atuche, to 12 years’ imprisonment for N25.7bn fraud in the bank.\nRecall that the EFCC had in 2011 arraigned the defendants before Justice Okunnu over the N25.7bn fraud.\nHowever, Atuche and the co-defendants approached the Lagos State Court of Appeal, after about three years, to challenge their trial by the lower court for lack of jurisdiction.\nAfter listening to the EFCC’s counsel, the apex court directed that the case be returned to Justice Okunnu for continuation of trial.\nAtuche and his wife returned to Justice Okunnu with Pinheiro opposing Atuche’s contention that the funds in dispute were loaned, not stolen."
  },
  {
    "headline": "Coordinated military operations has reduced insecurity in Nigeria – DHQ -NigPilot",
    "summarized_story": "The Defence Headquarters DHQ on Thursday said that the coordinated military operations across the federation has decreased the activities of terrorists, bandits and other criminal elements at the end of second quarter in Nigeria.\nActing Director, Defence Media Operation, Brigadier General Benard Onyeuko made this disclosure while briefing Defence correspondent in Abuja.\nHe said that troops of Operation Whirl Stroke remained vigilant and committed in the conduct of their operations during the period in focus.\nOn the non kinetic operations of the the military in South East, General Onyeuko said that the dialogue with South East stakeholders and leaders will lead to everlasting peace in the region.\nAll arrested criminals and recovered items have been handed over to appropriate agencies for further necessary actions” he concluded."
  },
  {
    "headline": "Return quarterly exercises to South-East to address insecurity, group begs COAS -NigPilot",
    "summarized_story": "He noted that the urgent intervention of the Nigerian Army is necessary to restore law and order.\n“We must agree that events in South-East Nigeria are indeed worrisome given the acts of criminality that have gained prominence in recent times.\n“The leadership of the Nigerian Army cannot feign ignorance of the security challenges in the South East region.\n“Our plea is hinged on the necessity to see to the restoration of peace, which would go a long way in the socio-economic well-being of the South-East region.\nOur faith and belief in the Nigerian Army remain sacrosanct."
  },
  {
    "headline": "Don’t interfere in EFCC’s investigation of Jafaru Mohammed, group tells Malami -NigPilot",
    "summarized_story": "Following Mohammed’s petition to the AGF, the group urged Malami against using his office to shield persons of interest in corruption probes from being investigated.\nIn a statement signed by its executive director, Aboki Sulyman, on Tuesday, NACW said Mohammed must be accountable, especially for industrial-scale looting of the money meant for purchasing arms and military hardware under the National Security Adviser.\nRather than hamper investigation, the group urged the AGF to prevail on Mohammed to cooperate with investigators so that he can speed up his appearance in court if indicted.\n“We are worried that, of all possible defences, Jafaru Mohammed alleged “witch-hunt and personal vendetta” as a reason for the EFCC investigation.\n“NACW, therefore, calls on the Attorney-General of the Federation and the Minister of Justice, Abubakar Malami to allow the investigation of Brigadier General Jafaru Mohammed to continue without distractions as this is what his petition amounts to."
  },
  {
    "headline": "Gunmen Abduct Students From Federal Government College In Kebbi",
    "summarized_story": "Gunmen suspected to be bandits have stormed Federal Government College, Birnin-Yauri in Kebbi State and abducted an unspecified number of students and four teachers.\nIn late May, about 200 students of an Islamiyya school in Niger state were abducted by gunmen.\nHe said the Bandits were able to abduct four teachers and an unconfirmed number of students away to an unknown destination.\nAbubakar also disclosed that a policeman lost his life, while one student sustained gun shot injury during an exchange of fire between security operatives and the bandits.\nHe added that security operatives have launched a manhunt for the bandits with a view to rescuing the kidnap victims and arresting the criminals."
  },
  {
    "headline": "‘Give No Breathing Space To Terrorists And Criminals,’ Buhari Charges Security Agents",
    "summarized_story": "﻿President Muhammadu Buhari has urged the military and other security agents not to give breathing space to terrorists and criminals in the country.\nThe President gave the charge on Thursday while addressing personnel of the Armed Forces and security agencies in Operation Hadin Kai at the Maimalari Cantonment during a visit to Borno State.\n“We should not allow our adversaries the opportunity or breathing space to challenge or undermine our national interests and core values.\nThe defence and security agencies should rest assured of the Federal Government’s unalloyed commitment to winning the battle against terror and criminality.\nMuch more equipment will be procured for the Armed Forces to cater for both the short and long-term requirements."
  },
  {
    "headline": "EFCC To Prosecute Orji Kalu All Over Again – Bawa",
    "summarized_story": "﻿Chairman of the Economic and Financial Crimes Commission (EFCC) Abdulrasheed Bawa has said former Abia State governor, Orji Uzor Kalu will be prosecuted by the agency all over again.\nBawa disclosed this on Thursday while addressing journalists during the weekly ministerial chat at the State House in Abuja.\nHe also clarified reports accredited to him concerning the involvement of a Minister in the laundering of about $37 million into real estate.\nBawa said he is confident that when the unit is fully established, corruption will significantly decline in the country.\nAccording to him, most proceeds of crime are laundered through real estate and have become a huge challenge."
  },
  {
    "headline": "Gunmen Kidnap Four Chinese Rail Workers, Kill Police Officer In Ogun",
    "summarized_story": "Four Chinese railway workers working on the Lagos-Ibadan railway have been kidnapped.\nA police officer attached to them was also killed during the attack which was carried out on Wednesday around Kila, a village between Ogun and Oyo states.\nEyewitnesses said the gunmen were dressed in black kaftan when they stormed the site of the rail project at Adeaga/Alaagba and killed the policeman while struggling to abduct the Chinese workers.\nREAD ALSO: Gunmen Kill One, Abduct Two Chinese In TarabaThey were reported to have laid an ambush in the surrounding forest for the expatriates.\nConfirming the incident on Thursday, the police public relations officer in the state, Abimbola Oyeyemi said the victims were ambushed around the area by eight gunmen."
  },
  {
    "headline": "Four Key Questions On Rising Global Inflation",
    "summarized_story": "Inflation is surging worldwide, making markets nervous that it could derail a post-pandemic economic recovery by putting pressure on central banks to consider pulling stimulus measures sooner than planned.\nBritish inflation soared to its highest level since before the pandemic last month, with clothing, fuel and oil prices rebounding as the economy reopens.\nGermany’s inflation also jumped in May to its highest level in a decade, mainly driven by surging energy prices.\nHigh inflation driven by soaring food prices has pushed seven million Nigerians into poverty, according to the World Bank.\nBut central banks in Iceland, Brazil and Russia have already raised their rates to counter inflation."
  },
  {
    "headline": "Danish Soccer star Christian Eriksen to get implantable heart defibrillator",
    "summarized_story": "The Danish Football Union (DBU) announced Thursday that Christian Eriksen, who suffered a cardiac arrest during his country’s Euro 2020 opener last weekend, will have a heart defibrillator implanted.\nEriksen is recovering in a Copenhagen hospital after collapsing during Denmark’s European Championship game against Finland.\nAccording to the Danish federation, doctors determined that Eriksen requires an ICD — implantable cardioverter-defibrillator.\n”This device is necessary after a cardiac attack due to rhythm disturbances,” the federation said in a statement.\nThe game will feature a minute’s applause for Eriksen in the 10th minute in honor of his No."
  },
  {
    "headline": "Ibadan Crisis: Gov Makinde visits violence scene, says perpetrators would be brought to book",
    "summarized_story": "Governor of Oyo State, Seyi Makinde has condemned the recent violence in Iwo Road axis of Ibadan which led to the death of two persons.\nThe governor, who toured the affected area, said the government will bring perpetrators of the act to book.\nMakinde described the occurrence as unfortunate, adding that his government has ordered investigations into the violent act.\n“I visited the scene of the Iwo Road incident this morning.\nAdvertisement“I give you my word that we will ensure that everyone involved in the dastardly act is brought to book.,” the governor said."
  },
  {
    "headline": "Local collaborators frustrating efforts of troops fighting banditry- 8Th Div GOC",
    "summarized_story": "Major General Usman Yusuf, the new General Officer Commanding GOC, 8th Division Nigeria Army Headquarters, Sokoto, has condemned the attitude of local collaborators who aid suspected bandits in sabotaging the efforts of Nigeria Army forces combatting banditry in the North West.\nThe Army Chief disclosed this in Sokoto during a courtesy call on state Governor Aminu Tambuwal at the state Government House.\nHe said, local collaborators have on many occasions informed bandits of movement of troops especially when responding to distressed call.\nHe added that this often resulted in ambushed and loss of men of the Nigeria Army.\nAccording to him, Nigeria Army hardly suffer lost in a combat attack with the bandits but lost more men in ambush and efforts of saboteurs and collaborators."
  },
  {
    "headline": "Zambia’s First President Kenneth Kaunda Dies at 97",
    "summarized_story": "Zambia’s former president, Kenneth Kaunda, the father of Zambia’s independence who led the country for 27 years has died at the age of 97.\nHe had been admitted to the Maina Soko Medical Center, a military hospital in Lusaka, on Monday where authorities disclosed he was being treated for Pneumonia.\nBut a Facebook post by his son Kambarage Kaunda, announced the Zambian founding president’s passage.\nKambarage asked for prayers for his father whom he called Mzee."
  },
  {
    "headline": "30 Schoolgirls Abducted as Terrorists Invade School in Northwest Nigeria’s Kebbi State",
    "summarized_story": "Reports suggest bandits have abducted about 30 students and three teachers of a Federal Government Girls College in northeastern Kebbi State.\nThe heavily armed bandits rode on motorcycles from neighbouring Rijau forest and stormed the school after overpowering the mobile police unit guarding the school.\nThe situation at Birnin Yauri where the school is situated is tensed and people are in the state of confusion.\nThis is definitely not the first attack on schools in northern Nigeria.\nAbductions have become more indiscriminate across northern Nigeria as local criminal gangs view victims as a source of income, and the villagers — who have been ignored by the government — as disposable."
  },
  {
    "headline": "Twitter Suspension Reduced The Spread Of Fake News – Trending With Ojy Okpe",
    "summarized_story": "Garba Shehu, Media Aide to President Mohammadu Buhari has come under fire on social media for saying that the suspension of Twitter has reduced the spread of fake news by governors on the platform of the people’s Democratic Party.\nFollowing the controversial ban of micro blogging platform Twitter, The federal government has asked the house of representatives to enact a law to regulate social and online media in Nigeria.\nU.S. president Joe Biden has apologized to CNN’s chief White House correspondent, Kaitlan Collins, after he lost his temper while speaking during a press conference following the Geneva summit with Russian President Vladimir Putin."
  },
  {
    "headline": "Under My Watch, Nigeria’s Military Has Clear Sense of Direction, Buhari Proclaims in Borno",
    "summarized_story": "Nigeria’s President Muhammadu Buhari says his administration in the past six years has provided the country’s armed forces a firm strategy and clear sense of direction to safeguard the sovereignty and territorial integrity of the West African country.\nPresident Buhari stated this on Thursday in northeastern Borno state when he visited personnel of the country’s security forces of Operation Hadin Kai.\n“Under my watch, the Armed Forces of Nigeria have been provided a firm strategy and clear sense of direction to safeguard the sovereignty and territorial integrity of the country,” Mr Buhari said.\nMuch more equipment will be procured for the Armed Forces to cater for both the short and long-term requirements.\n“I would like, at this point to also commend the hierarchy of our Armed Forces for their strategic foresight in ensuring that some of our critical military equipment are fabricated locally."
  },
  {
    "headline": "Buhari Visits Borno, Says Insurgents and Bandits to Feel Ferocity of Nigeria’s Firepower",
    "summarized_story": "President Muhammadu Buhari has promised to visit on insurgents and bandits the ferocity of the nation’s firepower and the weight of the resolve to allow for peace and security.\nHe said: “Your collective efforts have resulted in the relative peace being enjoyed in the region today.\nThe President said: “Alongside investment in development and reconstruction, we will sustain our investment in the Armed Forces in a manner that balances the “carrot and stick”.\nThe President had touched down at the Nigeria Air Force Base in Maiduguri at 10.15 am where he was welcome by Governor Babagana Zulum and other top dignitaries.\nDriving through the town in a long convoy, he was warming received by an array of students, civil servants and other section of the society who have lined the streets."
  }
]