[
  {
    "headline": "Businessman arraigned for alleged N1.3m fraud",
    "summarized_story": "A 43-year-old businessman, Musa Sani, was on Wednesday arraigned before a Kaduna Chief Magistrates’ Court for alleged N1.3 million fraud.\nThe defendant, a resident of Zaria, Kaduna State, is facing a one-count charge of criminal breach of trust.\nThe Prosecutor, Inspector Chidi Leo, told the court that the defendant committed the offence sometime in August 2020 at Badarawa in Kaduna.\nLeo said that one Garba Mohammed, entrusted the sum of N1.3 million to the defendant to buy a Peugeot 307 for him.\nHe said that the offence contravened Section 296 of the Kaduna State Penal Code Law, 2017."
  },
  {
    "headline": "Man bags eight months imprisonment for employment scam",
    "summarized_story": "Justice Darius Khobo of the Kaduna High Court on Wednesday sentenced one Austin Cole to eight months in prison for involving in N1.2million employment scam.\nThe judge, however, gave the convict an option of N300,000 fine and ordered him to pay the sum of N1.2million restitution to the complainant, Philip Rachel.\nEarlier, the EFCC Counsel, J. M. Musa, had told the court that Cole was arrested when the Commission received a petition from the complainant, Philip Rachel.\nMusa added that the offences contravened Section 1(1)(a) of the Advance Fee Fraud and Other Related Offences, 2006.\nThe counsel said that when the complainant gave the defendant the money, he diverted it to his personal use and all efforts made by her to get her money back proved abortive."
  },
  {
    "headline": "Christmas: Share joy, hope among all, Archbishop Martins urges Nigerians",
    "summarized_story": "Alfred Adewale Martins has called on all Nigerians to celebrate the joy of Christmas and the birth of Jesus Christ, despite the insecurity and economic challenges in our country.\nIn his 2021 Christmas message titled, ‘Joy to the world, the Lord is come’, signed by the Director of Social Communications, Rev.\n“Being alive to witness yet another Christmas is a great gift from God that should never be taken for granted particularly in our present realities.\n“The message of Christmas is a message of hope for everyone.\nThe Archbishop also charged all Nigerians to offer all that is within their power in order to bring joy to people especially those in a state of despair."
  },
  {
    "headline": "Akande’s book meant to destabilise South-West, says Bode George",
    "summarized_story": "For those of us who are already in the People’s Democratic Party in Lagos, let us welcome the new entrants with warm, open embrace.\nBaba Akande must apologize openly.\nThe question I want to ask Baba Akande directly is that is Bola Tinubu from Lagos?\nI want to plead with Baba Akande, unfortunately, it was not just a statement, it was a book.\nSo that is the kind of legacy Baba Akande should leave behind but from this book, you can see all the fireworks from all sides."
  },
  {
    "headline": "[BREAKING] Electoral Bill: Senators dissolve into closed-door session",
    "summarized_story": "As Voting Machines at Chamber have been testedBy Henry Umoru, AbujaSENATORS have dissolved into a closed-door session to deliberate on the letter of President Muhammadu Buhari and take a position on the withholding of assent to the 2021 Electoral Act Amendment bill.\nSoon after the Senate resumed plenary Wednesday, the President of the Senate, Senator Ahmad Lawan at 10.36 called for an Executive session.\nPresident Muhammadu Buhari had on Tuesday written the Senate and the House of Representatives, withholding assent to the 2021 Electoral Act Amendment bill that was passed by the National Assembly.\nPresident Buhari in the letter dated December 13, 2021, explained that his decision to withhold assent to the electoral bill was informed by advice from relevant Ministries, Departments and Agencies of Government after a thorough review.\nHe added that it would also impact negatively the rights of citizens to participate in the government as constitutionally ensured."
  },
  {
    "headline": "BREAKING: FG declares Monday 27, Tuesday 28 Dec and Jan 3 Public Holidays",
    "summarized_story": "The declaration was contained in a statement issued Wednesday in Abuja and signed by the Permanent Secretary in the Ministry of Interior, Dr Shuaib Belgore.\nAregbesola enjoined Christians “to practice the doctrine of Christ, which includes but is not limited to these – faith, hope, and love.\nAregbesola says “Moderately celebrate the festival without large groupings and observe all the protocols stipulated by medical authorities.\n“Aregbesola admonishes all citizens to remain focused and expresses confidence that the year 2022 would be a better year for us all.\nHe wishes all Christians, in particular, a happy Christmas and all Nigerians a peaceful and prosperous New Year celebration”, the statement added."
  },
  {
    "headline": "Nine worshippers kidnapped, four released in Enugu",
    "summarized_story": "By Ikechukwu Odu – NsukkaAt least nine persons, including six women, two men and a baby were allegedly kidnapped along Okpokwu Agamede in Eha-Amufu, Isi-Uzo Local Government Area of Enugu State, Monday evening.\nVanguard gathered that the kidnappers later released the two men, a nursing mother and her baby, but kept the remaining five women in their custody.\nThe Parish Priest of the St Mary’s Catholic Church, Odenigbo Eha-Amufu, Rev Fr Emma Nnadi, who broke the news to a WhatsApp group of reverend fathers and monsignors yesterday morning wrote “Good morning dear Msgr/Frs.\nALSO READ:“Yesterday evening, kidnappers stormed one of my outstations, Okpokwu, and kidnapped 8 persons, (2 men, 6 women and a baby).\nWhen contacted, the spokesperson of Enugu State Police Command, Daniel Ndukwe, denied the incident."
  },
  {
    "headline": "Rowdy session in Jigawa Assembly over cancellation of LG chairmen’s vehicle procurement",
    "summarized_story": "There was uproar at the Jigawa State House of Assembly on Tuesday over the refusal of the House Committee on Local Government to buy brand new Toyota Prado SUVs in the 2022 local government appropriation.\nGovernor Muhammad Badaru Abubakar had in November presented the budget estimate of N73,734,339,969,00 for the 27 local government council in the state before the House of Assembly.\nThe session turned rowdy after the House Committee on Local Governments presented its report before the floor of the House.\nIdris Garba Kareka, said the recommendations should be removed and local government chairmen allowed to purchase the vehicles as earlier proposed.\nMeanwhile the House has also recommended the increase of N744 million to make constituency project allocation N2.5 billion."
  },
  {
    "headline": "BREAKING: Senate passes 2022 budget, increases it by N1trn",
    "summarized_story": "The Nigerian Senate, on Wednesday, passed the 2022 appropriation bill.\nPresident Muhammad Buhari had on the 7th October 2021, presented the budget estimates to the joint session of the National Assembly.\nThe version of the budget passed by the Senate contained estimates of N17,126,873,917,692, as against the N16,391,023,917,692 proposed by President Buhari in October.\nThis is coming barely one week after the Senate failed to pass the budget as promised.\nDetails shortly…"
  },
  {
    "headline": "Buhari inaugurates National Development Plan 2021-2025",
    "summarized_story": "President Muhammadu Buhari has inaugurated Nigeria’s National Development Plan 2021-2025 to succeed the Economic Recovery and Growth Plan (ERGP 2017-2020).\nSpeaking at the event, the Minister of Finance, Budget and National Planning, Dr Zainab Ahmed, revealed that the new document replaced the Economic Recovery and Growth Programme.\nShe said: “The NDP 2021-2025 is designed as our medium-term Development Plan to succeed the Economic Recovery and Growth Plan (ERGP 2017-2020), which ends in December 2020.\n“The President graciously granted approval to my Ministry in 2019 to develop a new national development plan to succeed both ERGP 2017-2020.\nAccording to the minister, the NDP 2021-2025 will help Nigeria achieve its agenda at the continental and global levels."
  },
  {
    "headline": "Jigawa: Gov Badaru signs 2022 appropriation bill into law",
    "summarized_story": "Governor Muhammad Badaru Abubakar of Jigawa State has, on Wednesday, signed the 2022 appropriation bill into law.\nThe signing of the budget comes less than 24 hours after its passage by the state House of Assembly.\nDAILY POST had reported that Governor Badaru had on 10th November 2021, presented the sum of N177,795,588 appropriation bill to the state House of Assembly for the 2022 fiscal year.\nThe Governor, however, commended the legislature for the speedy passage of the bill for the service of the state.\nHe, therefore, charged the commissioners, heads of MDAs and agencies to start working for the implementation of the budget."
  },
  {
    "headline": "Gov Ayade wants NECO exams compulsory in Cross River",
    "summarized_story": "Governor of Cross River State, Professor Ben Ayade, has directed that all examinations conducted by the National Examination Council (NECO) be made compulsory for students in the state.\nHe said he was satisfied with the performance of Cross River Indigenes in NECO SSCE in the last five years.\nAyade said there was the need for the state to key in into all NECO conducted examinations, commending them for improving the quality of education in the country.\nHe said the state government will continue to support NECO to enable it to deliver on its mandate.\nHe explained that NECO, being the only national indigenous examination body in the country, deserves the support of all Nigerians."
  },
  {
    "headline": "‘Monarch accused me of being too stingy with money’",
    "summarized_story": "‘Monarch accused me of being too stingy with money’As governor of Osun State, Chief Bisi Akande had problems with the immediate past Ooni of Ife, Oba Okuade Sijuwade, and the Owa-Obokun of Ijeshaland, Oba Adekunle Aromolaran.\nHe also said Oba Aromolaran was always saying bad things about him because of his belief that he was stingy.\nI told him that Osun State had no money now to buy cars for traditional rulers.\n- Advertisement -“But his pestering was too much and I secretly sent money to him to buy a car.\nHe explained that the late Ooni wanted him to renew the Ede-Osogbo Waterworks which was to be repaired with $300 million."
  },
  {
    "headline": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’",
    "summarized_story": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’A former Osun State Governor Chief Bisi Akande has relived his confrontation with ex-President Olusegun Obasanjo when Chief Bola Ige (SAN) was murdered while serving as Attorney-General of the Federation and Minister of Justice.\nAkande, in his autobiography ‘My Participations’ said he had just returned from the United Kingdom when he was told of the murder.\n- Advertisement -“How can you say lapses in my security when Bola Ige was killed in Ibadan?\nI rule in Osun State!\n“It was President Obasanjo on the other end."
  },
  {
    "headline": "Akande: I’ve never seen anything genuine in Obasanjo",
    "summarized_story": "Akande: I’ve never seen anything genuine in ObasanjoA former Osun State Governor and first National Chairman of the All Progressives Congress (APC) Chief Bisi Akande has said he has never seen anything genuine in ex-President Olusegun Obasanjo.\nAkande, in his book, ‘My Participations’, narrated several instances of Obasanjo’s alleged attempts to bring him down.\nAkande said during the centenary celebration of the Baptist Church in Abeokuta, Obasanjo announced that he was “an example of a prudent and honest governor”.\n- Advertisement -“I have never seen anything genuine about him despite his self-glorification,” Akande wrote.\nHe accused Obasanjo of ordering that Osun State should be short-paid by N216 million monthly from the Federal Allocation."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Electoral Bill: Senate makes U-turn, shelves override of Buhari’s veto",
    "summarized_story": "From Fred Itua, AbujaThe Senate has jettisoned its plans to override President Muhammadu Buhari’s veto of the Electoral Amendment Bill, 2021, despite its repeated threats to move against him.\nThe decision of the Senate, followed an outcome of its closed door session, where it resolved to consult with the House of Representatives in January, before taking a decision.\nWith the sudden U-turn, the highly-anticipated override of the veto may have reached a dead end."
  },
  {
    "headline": "Georgia Gov, wife host Nigeria Consul to Atlanta in USA",
    "summarized_story": "Governor of Georgia, HE Bryan Kemp and First Lady, Marty Kemp with Nigerian Consul to Atlanta, Ambassador Amina Samaila when they hosted her in Georgia, United States of America.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now ."
  },
  {
    "headline": "BREAKING: Army, Navy, Air Force promote 235 generals, rear Admirals, AVM, others",
    "summarized_story": "From Molly Kilete, AbujaThe Nigerian Armed Forces have announced the promotion of 235 officers to the ranks of one and two stars generals.\nThe promotions were released late Tuesday night after the sitting of the Army Council, Navy a council and the Air Council respectively held at the ship house ministry of Defence with the minister Bashir Magashi, presiding as chairman.\nIn the latest promotion, Daily Sun gathered that the Nigerian Army promoted 36 officers to the ranks of Major Generals from Brigadier Generals, while 76 Colonels were promoted to Brigadier Generals.\nThe Nigerian Navy promoted 21 Commodores to Rear Admirals and 36 Captains to Commodores, while the NAF promoted 30 new Air Vice Marshals from Air Commodores and 36 Group Captains to Air Commodores.\nAmong the newly promoted Major Generals in the Nigerian army is the Director of Defence Media Organization( DMO), Benard Onyeuko."
  },
  {
    "headline": "Promotion galore in the police as PSC lifts 7,215",
    "summarized_story": "By Chioma Okezieh-OkehThe Police Service Commission said it has approved the promotion of two Assistant Inspectors-General of Police to the next rank of Deputy Inspectors-General.\nThe Commission also approved the promotion of twenty four Assistant Commissioners of Police to the next rank of Deputy Commissioners of Police; forty nine Chief Superintendents of Police to the rank of Assistant Commissioners.\nIt also endorsed the elevation of seventy four Superintendents of Police to Chief Superintendents and eight hundred and sixty six Deputy Superintendents of Police to Superintendents.\nIt also during the meeting approved the confirmation of 7,166 ASP11 to ASP1 and considered 24 promotion appeals relating to adjustment in promotion dates, seniority etc.\nTHE COMMISSION CONSIDERED SOME PROMOTION APPEALS AND APPROVED THE HARMONIZATION OF THE PROMOTION DATE AND PROPER PLACEMENT OF TEN CHIEF SUPERITENDENTS WHO WERE ALSO PROMOTED TO ASSISTANT COMMISSIONERS OF POLICE."
  },
  {
    "headline": "Electoral Bill: Senators press to override Buhari",
    "summarized_story": "President Buhari had withheld assent to the Electoral Amendment Bill, which the National Assembly sent to him on November 19, 2021.\nThe Senate needs the “Yes” votes of 73 lawmakers to override the veto and pass the Electoral Bill into law.\nDaily Sun gathered that between yesterday’s morning and evening, 81 senators had signed for the overriding of the president veto.\nIt is believed that the Senate would go on recess today after discussing and perhaps taking a vote on President Buhari’s veto of the Electoral Bill.\n•Reps’ll revisit electoral bill next year – GbajabiamilaHowever, Speaker Femi Gbajabiamila, has said the House of Representatives would revisit the Electoral Act Amendment when it resumes from Christmas vacation on January 2022."
  },
  {
    "headline": "Electoral Bill: Senate Mobilises to Override President’s Veto, House Defers Battle Till Jan",
    "summarized_story": "THISDAY, however, learnt that over 75 senators had already signed a proposal, as at yesterday evening, indicating a commitment to override Buhari’s veto of the electoral bill, which would be introduced as a motion.\nIn the letter, the president explained that his decision to withhold assent to the electoral bill was informed by advice from relevant Ministries, Departments and Agencies (MDAs) of government after a thorough review.\nApprehensive of possible outbursts from senators on the president’s veto and, apparently, to prevent open opposition to Buhari’s communication to the senate, Senate President Ahmed Lawan called for an executive session at 10:44am, which lasted an hour.\n“If we reject the amended electoral bill because of direct primary, then, it will be very unfortunate.\nOne of the senators said, “Yes, our initial plan was to override President Buhari’s veto on the electoral bill, but they truncated it in the process."
  },
  {
    "headline": "…Fayemi, Ortom Praise Buhari for Withholding Assent to Bill",
    "summarized_story": "Fayemi, however, denied insinuations that they were behind the president’s rejection of the bill, saying they were not afraid of direct primaries.\nPresident has not objected to direct primaries, neither has he endorsed indirect primaries.\n“So, I think we all should commend the courage of Mr. President to stand with the people.\nThere’s been this exaggerated expectation that direct primaries is going to provide all answers to whatever electoral challenges that we have faced.\nCommending Buhari for refusing assent to the electoral bill, Ortom stressed that the electronic transmission of results would deepen democracy and add value to the electoral system."
  },
  {
    "headline": "El-Rufai: We Don’t Negotiate with Terrorists in Kaduna, We Kill Them",
    "summarized_story": "Regarding his position on repentant bandits, el-Rufai said, “There is nothing like repentant terrorists (or bandits).\nNo,” he said, emphasising that Kaduna State would not negotiate with bandits, as its policy was to kill them all.\nIf you want to call them terrorists you can call them terrorists, but we don’t want to confuse them with terrorists that we know, the Boko Haram.\nHe stated, “Kaduna State is a huge state.\nHe recalled that the armed bandits had shot dead a member of Kaduna State House of Assembly, representing Giwa West constituency, Hon."
  },
  {
    "headline": "Breaking: House Passes 2022 Budget, Raises Sum to N17trn",
    "summarized_story": "Udora Orizu in AbujaThe House of Representatives at the plenary, Tuesday passed the 2022 appropriation Bill sent to it by President Muhammadu Buhari, raising the sum to N17.126 trillion.\nRecall that Buhari had in October presented to both chambers of National Assembly, the Appropriation bill tagged a “Budget of Economic Growth and Sustainability.” estimated at ₦16.39trillion.\nThe passage of the budget followed the consideration and adoption of clauses in the Bill’s report presented by the Chairman Appropriation Committee, Hon.\nMuktar Betara.\nDetails later………Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: FG Restores Emirates’ Flight Schedule",
    "summarized_story": "Chinedu EzeThe Federal government has reinstated Emirates Airlines daily schedule to Nigeria.\nThis was contained in a letter signed by Musa Nuhu, director general, Nigeria Civil Aviation Authority, (NCAA), addressed to the country manager, Emirates Airlines.\nIt will be recalled that Hadi Sirika, the minister of aviation, and Musa Nuhu, the Director-General of Nigerian Civil Aviation Authority (NCAA), restricted Emirates to just one weekly flight to Abuja after discussions broke down over restriction of Nigerian flag carrier Air Peace to just one flight to Sharjah by UAE.\nIn response, Emirates withdrew flight services to Nigeria in what led to a diplomatic row between the two countries.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Leaked Audio From Anti-graft Agency EFCC Operative Exposes How Attorney-General, Malami Ordered Unfreezing Of ‘Big Cases’ Bank Accounts",
    "summarized_story": "“If he has money in any account linked with his BVN (Bank Verification Number), he should quickly evacuate them.\nYusuf had also specifically mentioned Malami as the one in charge of the EFCC, and the minister had ordered the unfreezing of “big accounts” investigated by the commission.\nThey are unfreezing suspects’ accounts, including the big cases,” the EFCC operative was heard saying in the audio.\nAlso his account was recently unfrozen to enable them to quickly move out the money as advised by the EFCC operative.\nTwo other accounts – 2120012772 ($57,080.38) and 1060100885 (N2,390,987.69) – were held in Skye Bank in Mr Yusuf’s name."
  },
  {
    "headline": "Leaked Audio From Anti-graft Agency EFCC Operative Exposes How Attorney-General, Malami Ordered Unfreezing Of ‘Big Cases’ Bank Accounts",
    "summarized_story": "“If he has money in any account linked with his BVN (Bank Verification Number), he should quickly evacuate them.\nYusuf had also specifically mentioned Malami as the one in charge of the EFCC, and the minister had ordered the unfreezing of “big accounts” investigated by the commission.\nThey are unfreezing suspects’ accounts, including the big cases,” the EFCC operative was heard saying in the audio.\nAlso his account was recently unfrozen to enable them to quickly move out the money as advised by the EFCC operative.\nTwo other accounts – 2120012772 ($57,080.38) and 1060100885 (N2,390,987.69) – were held in Skye Bank in Mr Yusuf’s name."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Gets New Senior Attorney To Lead Defence Against Nigerian Government",
    "summarized_story": "Ifeanyi Ejiofor, the lead counsel to the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu has said that an undisclosed senior attorney will henceforth lead the defence team of the pro-Biafra separatist leader.\nThe statement read, “We paid our routine visit to our untiring, unwavering, unrelenting, rock-solid and noble client, Onyendu Mazi Nnamdi Kanu, yesterday, at the DSS detention facility at Abuja.\nAlthough he was not oblivious of my arrangement to enlist the assistance and co-operation of a Senior attorney, he did not know that I could get a Senior attorney of the rarest breed.\n“I must state here and now that the Senior attorney involved has been my mentor over the years.\nHe has worked from the sidelines with our legal team since 2016."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Gets New Senior Attorney To Lead Defence Against Nigerian Government",
    "summarized_story": "Ifeanyi Ejiofor, the lead counsel to the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu has said that an undisclosed senior attorney will henceforth lead the defence team of the pro-Biafra separatist leader.\nThe statement read, “We paid our routine visit to our untiring, unwavering, unrelenting, rock-solid and noble client, Onyendu Mazi Nnamdi Kanu, yesterday, at the DSS detention facility at Abuja.\nAlthough he was not oblivious of my arrangement to enlist the assistance and co-operation of a Senior attorney, he did not know that I could get a Senior attorney of the rarest breed.\n“I must state here and now that the Senior attorney involved has been my mentor over the years.\nHe has worked from the sidelines with our legal team since 2016."
  },
  {
    "headline": "National Assembly Should Veto Buhari, Pass Electoral Bill Or Remove Direct Primary Provisions – Civic Group, CDD",
    "summarized_story": "Civic group, the Centre for Democracy and Development (CDD), has urged federal lawmakers to use their veto power to sign the Electoral Bill 2021 to law.\n“The Centre for Democracy and Development (CDD) is shocked by President Muhammadu Buhari's decision to decline assent to the Electoral Bill 2021.\n“We must not allow a single provision truncate the goodness in the proposed electoral bill.\n“The reform in the Electoral Bill 2021 will improve the quality of elections thereby imbuing citizen’s trust in our democracy.\nThe National Assembly must act, and the time is now."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "New AIG assumes duty in zone 5, Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A new Assistant Inspector General of Police has assumed duty in zone 5 Command headquarters, Benin City.\nThe new AIG assumed duty on December 16, 2021 after taking over from AIG Isaac O. Akinmoyede who has been redeployed to zone 9, Umuahia.\nDC Operations, Kaduna State Command.\nCommissioner of Police, Special Fraud Unit, FCID, FHQ, Abuja; Commissioner of Police, Ekiti State Command; CP.\nKaduna State Command; CP."
  },
  {
    "headline": "Obaseki to increase Edo workforce, deepen ongoing reforms in civil, public service in 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government will, in 2022, sustain ongoing transformation in the state’s civil and public service, enhancing the work environment and boosting the capacity of the workers for optimal service delivery.\nObaseki, who spoke to journalists in Benin City, said his administration will in the forthcoming year commence phase two of the ongoing recruitment exercise and expand in-service training opportunities for public and civil servants.\nSpeaking to journalists, Obaseki said his government is committed to retooling the civil service and equipping workers with the right skills to deliver efficient and effective service to the Edo people.\nAccording to him, “In the new year, we would deepen the ongoing public/civil service transformation through increased process enhancement and automation.\n“We launched the Edo State Public/Civil Service Transformation Program (EdoSTEP) to institutionalise and monitor this process, just as continuous in-service capacity enhancement programmes are ongoing at the John Odigie-Oyegun Public Service Academy.”..."
  },
  {
    "headline": "Edo explores investment opportunities in LGAs, surveys three councils – Nigerian Observer",
    "summarized_story": "Managing Director, Edo Investment Promotion Office (ESIPO), Mr. Kelvin Uwaibi, disclosed this at the Validation of Areas Potential Survey Report, held in Benin City.\nI am quite happy about the three LGAs selected for this pilot survey because in each, there are tertiary institutions, which also brings huge opportunities.\nSo, the potentials in these tertiary institutions in the LGAs would be utilized optimally.\nIn her remarks, Edo State Coordinator for GIZ-SEDEN, Blessing Ajimoti, noted, “We want to get data and meet the stakeholders.\nWe want to know what the investment opportunities that exist in the various local governments to positively impact on the state’s economy.”..."
  },
  {
    "headline": "Senate confirms Engr Muazu. Sambo as Minister of Power – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The confirmation came when the appointee appeared before senate chamber for screening in Abuja.\nEngr Muazu Sambo who has served in several capacities for 35 years, such as Nigeria Port Authority and Banking sector said he has sufficient knowledge in the infrastructural development sector and assured Nigerians of his ability to deliver.\nAsked how he would use his wealth of experience to make Mambila power project work, Looking at the myriad of problems associated to the power project including court cases, Engr Muazu Sambo said the problem of Mambila is Human and having come from Taraba he would be able to solve the problems of Mambila in a short time.\nSpeaking to National Assembly correspondents soon after the confirmation, Engr Muazu Sambo appealed for prayer from the public while assuring Nigerians that he would do his best, the confidence repose in him by Mr president.\nRecalled that the Ministers of power and Agriculture were sacked recently by Mr president for poor performance and immediately appointed Muazu Sambo and that of Agriculture as ministers designate subject to senate confirmation."
  },
  {
    "headline": "Electoral Act: Senate fails to override President’s veto",
    "summarized_story": "The Senate on Wednesday failed to override President Muhammadu Buhari’s veto on the 2010 Electoral Act (amendments) Bill 2021.\n“In a closed session, the senate deliberated on matters relevant to the workings of the senate in particular and the national assembly in general,” he said.\n“The senate, also in the closed session, discussed how to respond to the letter by Mr President on the electoral bill amendment.\nThe closed session which lasted for 37 minutes started at exactly 10:44 am and ended at 11:21 am.\nThe Senate President sustained Sekibo’s point of order and the closed session commenced by 1.57 pm."
  },
  {
    "headline": "Ned Nwoko Threatens Sahara Reporters with Lawsuit, Demands N10bn for Defamation",
    "summarized_story": "Sanya ObajemuA former member of the House of Representatives, Prince Ned Nwoko, has written to Sahara Reporters to retract its “defamatory statement” against his person or face court action.\n” You went further to add new and false claims about the Paris Club Refunds and the Malaria Eradication Project being undertaken by the Ned Nwoko Foundation.\nThat they (NGF) shall issue a Letter of No Objection to payment to Ned Nwoko and the associated company Linas International Limited.\nThat from the records that there is no clam of $418mUSD by the NGF against Ned Nwolo or any of his associated companiesThat there are several court orders In favor of Ned Nwoko with respect to the subject matter.\nThis letter should also be taken as a pre-action notice to you peradventure you choose not heed to our Client’s demands."
  },
  {
    "headline": "Osun 2022: Ex- House of Reps Deputy Speaker, Yussuff, Adeoti, Salam Unite to Unseat Oyetola",
    "summarized_story": "Lasun Yussuff; former Speaker of the Osun State House of Assembly, Hon Najeem Salam and former Secretary to Osun State Government, Alhaji Moshood Adeoti.\nThe trio jointly declared that APC cannot win the 2022 governorship election if it fields the incumbent governor, Adegboyega Oyetola, as candidate.\nThe former Speaker urged party members to work in unison to realise the dreams of the majority in a bid to salvage the party and the state.\nOsun ‘APC Chairman,’ Hon.\nSalinsile said the party has decided to choose candidate from Osun West Senatorial District in the 2022 governorship election."
  },
  {
    "headline": "Court grants 5 Dowen College students allegedly involved in killing of Sylvester Oromoni N1m bail",
    "summarized_story": "A Magistrate Court in Yaba, Lagos State, on Tuesday, admitted five Dowen College students charged with the murder of 12-year-old Sylvester Oromoni, to bail in the sum of N1 million each.\nOromoni who was a junior student at the college died of his injuries weeks ago after being allegedly beaten and fed with chemicals by the alleged culprits who are seniors students of the school.\nChief magistrate, Olatunbosun Adeola, after hearing the bail application from the defendants’ counsel, ordered the defendants to produce two sureties each in like sum.\nAdeola said one of each of the defendants’ sureties must be their parent, and must swear an affidavit of compliance.\nAmah, Mr Godwin Omoaka (SAN), Mr Eze Ajibo represented Begue and Mr Michael Ayinla were in court for the minors."
  },
  {
    "headline": "Nasarawa Killings Heart Wrenching, Says President Buhari",
    "summarized_story": "President Muhammadu Buhari has expressed grief over the heart-wrenching murder of 45 farmers and scores injured following renewed hostilities in Lafia, Obi and Awe local government areas of Nasarawa State.\nPresident Buhari in a statement by presidential spokesman, Garba Shehu, said the sympathies of the entire nation were with the affected families.\n“I assure the people with all seriousness and sensitivity that this administration is doing its best to safeguard the security of people and will leave no stone unturned in fishing out the perpetrators of this senseless and barbaric incident, and bring them to justice,” he said.\nHe also expressed condolences to the government and people of the State, and expressed satisfaction with the immediate response of the State government to the incident.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "EFCC Arrests Suspect Wih 576 ATM Cards At Kano Airport",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), has again arrested another suspect at the Aminu Kano International Airport in Kano with 576 ATM cards.\nThis is coming days after the EFCC secured the conviction of three smugglers who were arrested with 1,144 ATM cards at the same Airport.\nUpon his arrest, it was discovered that Khalil, who was traveling to Uganda with Ethiopian Airline, had concealed 576 ATM cards bearing different names and banks in his luggage.\nADVERTISEMENTHe said the suspect will be charged to court as soon as the investigation is concluded.\nRecalled that the Commission had arrested three suspects at the Kano Airport between November 24 and December 1, 2021 while they were trying to smuggle a total of 1,144 ATM cards."
  },
  {
    "headline": "Federal Govt To Spend N500bn On East-West Road",
    "summarized_story": "The federal government said it would spend over half a trillion naira to complete the section I-V of the East-West road, which spans across five states of Delta, Bayelsa, Rivers, Akwa Ibom and Cross River.\nRepresented by the director, housing and urban development department in the ministry, TpL Michael Oloruntola Olufemi, the permanent secretary noted that the three inter connected essential parts of the complementary programme for the East-West Road would include “Access Management and Mitigation Action Plan; Corridor Development Plan and Collaboration; and Corridor Preservation Project.”ADVERTISEMENTHe stated that the East-West road corridor, like most other federal roads in Nigeria, is being impacted by settlement developments in many towns and cities along it, which includes Ughelli, Patani, Port Harcourt and Eket.\n“It is for this reason that the Ministry birthed the complementary programme to rally collective efforts to plan, protect and manage the road corridor to curtail the natural tendencies of settlement growths towards it.\nADVERTISEMENTSpeaking further, Ardo, stated that after presenting the draft final report, the next stage is implementation of the plan, even as he noted the need to work faster to recover lost grounds on the work programme.\nSpeaking on behalf of Pen Prime Consultancy Limited, the company that prepared the draft final report, Dr. Daniel Peverga Dam stated that from the findings, the East-West road when completed would ease traffic and improve safety of the road among other benefits which would ultimately improve socio-economic development and accessibility within and outside the region."
  },
  {
    "headline": "Federal Govt To Spend N500bn On East-West Road",
    "summarized_story": "The federal government said it would spend over half a trillion naira to complete the section I-V of the East-West road, which spans across five states of Delta, Bayelsa, Rivers, Akwa Ibom and Cross River.\nRepresented by the director, housing and urban development department in the ministry, TpL Michael Oloruntola Olufemi, the permanent secretary noted that the three inter connected essential parts of the complementary programme for the East-West Road would include “Access Management and Mitigation Action Plan; Corridor Development Plan and Collaboration; and Corridor Preservation Project.”ADVERTISEMENTHe stated that the East-West road corridor, like most other federal roads in Nigeria, is being impacted by settlement developments in many towns and cities along it, which includes Ughelli, Patani, Port Harcourt and Eket.\n“It is for this reason that the Ministry birthed the complementary programme to rally collective efforts to plan, protect and manage the road corridor to curtail the natural tendencies of settlement growths towards it.\nADVERTISEMENTSpeaking further, Ardo, stated that after presenting the draft final report, the next stage is implementation of the plan, even as he noted the need to work faster to recover lost grounds on the work programme.\nSpeaking on behalf of Pen Prime Consultancy Limited, the company that prepared the draft final report, Dr. Daniel Peverga Dam stated that from the findings, the East-West road when completed would ease traffic and improve safety of the road among other benefits which would ultimately improve socio-economic development and accessibility within and outside the region."
  },
  {
    "headline": "Uzodimma Creates Homeland Security Ministry, Appoints Ugorji Commissioner",
    "summarized_story": "Governor Hope Uzodimma of Imo State has announced a cabinet reconstitution highlighted by the creation of a new ministry of Homeland Security and Vigilante Affairs to be headed by Dr Ugorji Ugorji.\nThe man at the helms of affairs of the ministry, Dr Ugorji – is a Security Analyst and Global Affairs scholar, with expertise in human capital development, and homeland security.\nADVERTISEMENTHe also bagged a second Master’s degree in Homeland Security from George Washington University, Washington, DC.\nIn January 2021 Dr. Ugorji was appointed by Governor Uzodimma as the first ever Special Adviser on Homeland Security and Intelligence for the state.\nWe now have the historic and exciting task of building a new ministry at the directions of Governor Uzodimma."
  },
  {
    "headline": "DNA drama: Court declares actress Ronke Odusanya’s ‘baby daddy’ wanted",
    "summarized_story": "In a recent development, a Magistrates Court in Lagos State has declared Jago wanted over his absence to appear in court over their daughter’s custody.\nEarlier this year, the social media space was saturated with the sudden breakup of the actress and Jago.\nOn the 10th of February, 2021, Jago stood before the court and requested a DNA test of their daughter to determine paternity before carrying on with proceedings.\nThe court granted it and mandated for both parties to present themselves for sample collection, asking Jago to pay for the DNA test.\nIn a court document made available to The PUNCH, the court has declared Jago wanted."
  },
  {
    "headline": "DNA drama: Court declares actress Ronke Odusanya’s ‘baby daddy’ wanted",
    "summarized_story": "In a recent development, a Magistrates Court in Lagos State has declared Jago wanted over his absence to appear in court over their daughter’s custody.\nEarlier this year, the social media space was saturated with the sudden breakup of the actress and Jago.\nOn the 10th of February, 2021, Jago stood before the court and requested a DNA test of their daughter to determine paternity before carrying on with proceedings.\nThe court granted it and mandated for both parties to present themselves for sample collection, asking Jago to pay for the DNA test.\nIn a court document made available to The PUNCH, the court has declared Jago wanted."
  },
  {
    "headline": "EFCC Arrests Suspect with 576 ATM Cards at Kano Airport",
    "summarized_story": "By JUMOKE SANNIBarely two hours after the Economic and Financial Crimes Commission, EFCC, secured the conviction of three smugglers who were arrested with 1,144 ATM Cards at Malam Aminu Kano International Airport, the Kano Command of the Commission again arrested another suspect at the same Airport with 576 ATM Cards.\nUpon his arrest, it was discovered that Khalil who was traveling to Uganda with Ethiopian Airline had concealed 576 ATM cards bearing different names and banks in his luggage.\nThe suspect will be charged to court as soon as the investigation is concluded.\nIt will be recalled that the Commission had arrested three suspects at the Kano Airport between November 24 and December 1, 2021 while they were trying to smuggle a total of 1,144 ATM cards.\nHowever, a Kano State High Court presided over by Justice Jamilu Shehu on December 20, 2021, convicted and sentenced them to six months imprisonment each."
  },
  {
    "headline": "EFCC Arrests Suspect with 576 ATM Cards at Kano Airport",
    "summarized_story": "By JUMOKE SANNIBarely two hours after the Economic and Financial Crimes Commission, EFCC, secured the conviction of three smugglers who were arrested with 1,144 ATM Cards at Malam Aminu Kano International Airport, the Kano Command of the Commission again arrested another suspect at the same Airport with 576 ATM Cards.\nUpon his arrest, it was discovered that Khalil who was traveling to Uganda with Ethiopian Airline had concealed 576 ATM cards bearing different names and banks in his luggage.\nThe suspect will be charged to court as soon as the investigation is concluded.\nIt will be recalled that the Commission had arrested three suspects at the Kano Airport between November 24 and December 1, 2021 while they were trying to smuggle a total of 1,144 ATM cards.\nHowever, a Kano State High Court presided over by Justice Jamilu Shehu on December 20, 2021, convicted and sentenced them to six months imprisonment each."
  },
  {
    "headline": "FG releases dates for Christmas, New Year holidays",
    "summarized_story": "The Federal Government has declared Monday, 27th, Tuesday, 28th December 2021 and Monday, 3rd January, 2022 as public holidays to mark Christmas, Boxing Day and New Year’s Day celebrations respectively.\nAregbesola enjoined Christians to practice the doctrines of Christ, which include but not limited to these – faith, hope and love.\nHe urged Christians and Nigerians to make the best use of this festive period to pray for the total eradication of insecurity bedevilling the nation.\nAregbesola said “Moderately celebrate the festival without large groupings and observe all the protocols stipulated by medical authorities.\nTake it as a point of personal responsibility to prevent the spread of the virus”."
  },
  {
    "headline": "Meagan Good, DeVon Franklin end 9 year-old marriage",
    "summarized_story": "American actress and model, Meagan Good, and Pastor DeVon Franklin, her husband, have ended their nine year-old marriage.\nThe duo announced the news in a joint statement shared on their individual Instagram pages in the early hours of Wednesday.\nAccording to the statement, they decided to end their marriage after “much prayer and consideration,” adding that none of them is at fault.\n“After much prayer and consideration, we have decided to go into our futures separately but forever connected.\n“There’s no one at fault, we believe this is the next best chapter in the evolution of our love,” the statement read."
  },
  {
    "headline": "Edo Political Enforcer, Kabaka Gives His Life To Christ",
    "summarized_story": "Tony Kabaka, a popular Edo political enforcer, devoted his life to Christ at the Rock of Ages Church Assembly International in Benin Wednesday.\nTony Kabaka made an appearance at the altar, accompanied by several of his rumored members.\nTony Kabaka said “I have come to plead with God Almighty to touch the heart of the governor, to have mercy on me.\nI came here today to move closer to God because I don’t expect the victory God gave to me.\nKabaka was recently featured in a BBC Africa Eye Report as a top political enforcer who has helped politicians in the state engage in illegal activities."
  },
  {
    "headline": "Gov Ayade Wants NECO Exams Compulsory In Cross River",
    "summarized_story": "Professor Ben Ayade, the Governor of Cross River State, has ordered that all National Examination Council (NECO) examinations be made compulsory for students in the state.\nHe expressed satisfaction with Cross River Indigenes’ success in the NECO SSCE during the last five years.\nAyade stated that the state must participate in all NECO-conducted examinations, praising them for boosting the country’s educational quality.\nHe stated that the state government will continue to assist NECO in carrying out its job.\nHe explained that NECO, as the country’s only national indigenous examination body, deserved all Nigerians’ support."
  },
  {
    "headline": "FULL LIST: Names Of 235 New Generals, Marshals, Admirals Promoted By Nigerian Military",
    "summarized_story": "234 additional military high officers, including Adeboye Obasanjo, son of ex-President Olusegun Obasanjo, have been promoted to the ranks of one and two star Generals.\nWhile the Nigerian Army promoted 36 officers to Major-Generals from Brigadier Generals and 76 Colonels to Brigadier Generals, the Nigerian Navy promoted 21 Commodores to Rear Admirals and 36 Captains to Commodores, as previously reported.\nThe Nigerian Air Force also promoted 30 new Air Vice Marshals from Air Commodores and 36 Group Captains to Air Commodores.\nThe newly promoted Captains to Commodores in the Nigerian Navy are SA BAWA, ME EJUMABONE, MM EPELLE, GPZ ADO, OO FADAHUNSI, M FAKROGHA, PE METEKE, PP NIMMYEL, NS LAKAN, SM AHMED, ST LENGAYA, RT OLADEJO, MS OLUKOYA, AO OJO, OA AKINBAMI, HJ ARUOMAREN, CA ISAH, AO OJEBODE, BO ONALO, A ORIDE, MB SALISU, BM SULE, AA UMAR, BH SABO, ZS SULEIMAN IG IKONNE, SI MOHAMMED, CA OBIKA, OA OSHATUNBERU, JK ADEDEJI, OD NNATU, I PEPPLE, JE ADEDEJI and UM BUGAJE, MA ADETUNJI.\nThose promoted to the rank of Air Vice Marshal in the Nigerian Air Force include PN Amadi, NN Anababa, A Abdulkadir, AV Ndace, UK Abdulahi, EE Effiom, IM Etukudo, AY Abdulahi, SK Aneke, NI Ilo, AH Amensilola, EO Ebiowei, MM Onyebashi, EO Shobande, S Olatunde, FO Edosa, AH Shinkafi, BR Mamman, HA Adebowale, AH Bakari, EF Batnah, AK Ademuwagun, LI Oluwatoyin, TZ Dauda, OS Ogunsina, NV Aguiyi, AT Marquis and OO Ogunmola."
  },
  {
    "headline": "FULL LIST: Military Promotes 235 Senior Officers Amid Forceful Retirement Rumour",
    "summarized_story": "The Nigerian Armed Forces has announced the promotion of Acting Director, Defence Media Operations, Brig.-Gen. Bernard Onyeuko to the rank of Major-General.\nThe promotion came barely one week after rife insinuations that the Chief of Defence Staff, Gen. Lucky Irabor, asked not less than 50 Generals in the military to proceed on forceful retirement.\nDaily Trust reports that the promotions were released last night after the sitting of the Army Council, Navy council and the Air Council respectively, held at the Ministry of Defence with the Minister of Defence, Maj.-Gen. Bashir Magashi (Rtd) as presiding chairman.\nIn the latest promotion, our correspondent gathered that the Nigerian Army promoted 36 officers to the ranks of Major-Generals from Brigadier-Generals, while 76 Colonels were promoted to Brigadier Generals.\nThe Nigerian Navy promoted 21 Commodores to Rear Admirals and 36 Captains to Commodores, while the Nigerian Air Force promoted 30 new Air Vice Marshals from Air Commodores and 36 Group Captains to Air Commodores."
  },
  {
    "headline": "Breaking: FG declares 3-day public holidays for Christmas, New Year",
    "summarized_story": "The federal government has declared December 27, 28, 2021 and January 3, 2022 as public holidays to mark Christmas, Boxing Day and New Year’s Day celebrations respectively.\nMinister of Interior, Rauf Aregbesola, who announced this felicitated with Christians and all Nigerians at home and in the Diaspora on the Christmas and New Year celebrations.\nHe enjoined Nigerians adhere strictly to, and observe all the stipulated non-pharmaceutical protocols and guidelines.\nThe Minister admonished citizens to remain focused, while expressing confidence that 2022 would be a better year.\nHe wished all Christians a happy Christmas and all Nigerians a peaceful and prosperous New Year celebration."
  },
  {
    "headline": "2021 Nigeria Volleyball Premier League: Kano Pillars, NSCDC are Champions (PICTURES)",
    "summarized_story": "Kano Pillars and Nigeria Security and Civil Defence Corps (NSCDC) have emerged champions in the men and women’s category respectively at the just concluded 2021 National Volleyball Premier League in Abuja.\nKano Pillars (male) defeated Nigeria Security and Civil Defence Corps (NSCDC) in the titanic final battle 3-0 (32-30, 25-20, 22-25,), while NSCDC ladies retained their title after they defeated Nigeria Customs Service (NCS) 16-2, 25-19, 23-25, 22-25).\nThe Head Coach of Kano Pillars, Musa Babamusa, commended the players for giving their best during the Premier League.\n“Last year, we came second and I promised that 2021 will be our year and that’s what we witnessing right now.\nHe said, “Kudos to the Kano team that won the league."
  },
  {
    "headline": "Dumped Electoral Act Amendment Bill: Fayemi backs Buhari as senators move to override veto",
    "summarized_story": "Strong indication emerged Tuesday that the Senate may override President Muhammadu Buhari’s refusal of assent to the 2010 Electoral Act (Amendment) Bill 2021 at plenary Wednesday.\n“The members of the National Assembly consulted with a cross section of their constituents to reach an informed position on any matter of national interest and development.\n“I urge my colleagues in the National Assembly to do the needful by overriding the veto and make the bill law.\nThe NASS should extricate itself from public odium and disrespect by going ahead to override President Buhari who is APC.\nHistory stares NASS in the face if indeed it is not a rubber stamp.”Many other Senators who pleaded anonymity strongly expressed their readiness to override President Buhari on the rejected bill."
  },
  {
    "headline": "Electoral Bill: Again, Senate Holds Closed-Door Session, Awaits Reps For Next Move",
    "summarized_story": "Senators resumed plenary on Wednesday with another closed-door session discussing President Muhamadu Buhari’s veto on the Electoral Act Amendment bill.\nAt the end of the session, Senate President Ahmad Lawan said the lawmakers discussed President Buhari’s refusal to sign the Electoral Act Amendment Bill into law.\nThe National Assembly on Tuesday read President Buhari’s letter in which he declined assent to the Electoral Act Amendment Bill.\nVeto or NotPresident Buhari’s decline to the Electoral Amendment Bill drew reactions from various quarters.\nA federal lawmaker Senator George Sekibo confirmed to Channels Television on Tuesday that some senators are planning to veto President Muhammadu Buhari on the electoral act amendment bill."
  },
  {
    "headline": "Nigeria Records Highest Daily COVID-19 Infections In 11 Months",
    "summarized_story": "Nigeria on Tuesday confirmed 2,123 new COVID-19 infections, the highest daily case tally in the country since January 27th, 2021.\nThis is according to figures released by the Nigeria Centre for Disease Control (NCDC) early Tuesday morning.\nThe last time the country had a higher daily COVID-19, the number of infected people was pegged at 2,314.\nThe FCT follows with 197 infections, Edo – 155, Rivers – 81, Delta – 44, Plateau – 33, Kwara – 30, and Kano – 16.\nTriggered by the Omicron and Delta variants, the agency said the country’s infection rate has jumped by 500 percent."
  },
  {
    "headline": "FG Reinstates Emirates’ Flight Schedule To Nigeria",
    "summarized_story": "The Federal Government has reinstated Emirates’ winter flight schedule to Nigeria following the offering of daily slots to Air Peace at the Dubai Airports, DXB.\nThis is contained in a letter to the Emirates Country Manager, Nigeria signed by the Director-General, NCAA, Capt.\nMusa Nuhu dated 21st December 2021.\nThe letter read, “Following further consultation with various stakeholders and the letter from the Dubai CAA with reference number DCAA/ASA/N-3/016 dated 17th December 2021 offering Air peace airlines daily slots at Dubai airports, I wish to inform you the reinstatement of the Ministerial approval of Emirates Airlines winter schedule”.\nThis development prompted Emirates airlines to suspend its operation in Nigeria."
  },
  {
    "headline": "Electoral Bill: Fayemi, Ortom Back Buhari As CSOs, Others Question Decision",
    "summarized_story": "﻿President Muhammadu Buhari’s refusal to assent to the electoral act amendment bill drew reactions from several quarters on Tuesday.\nIn his letter, President Buhari cited several issues with the bill’s clause on direct primaries.\nThe Nigerian leader equally fears that with direct primaries, citizens’ rights will be violated while smaller political parties may face marginalisation.\nBy law, the National Assembly can bypass presidential assent of a bill into law through a two-third majority vote.\nHe stated that the new bill introduced several innovations, besides direct primaries, to help advance the country’s democracy."
  },
  {
    "headline": "Chinese City Locks Down 13 Million Residents To Fight COVID-19 Outbreak",
    "summarized_story": "Over 13 million people were ordered to stay home in the Chinese city of Xi’an, which imposed a strict lockdown on Wednesday and dramatically tightened travel controls to fight a growing Covid-19 outbreak.\nThe new restrictions were imposed after Xi’an reported 52 new coronavirus cases on Wednesday, bringing the total to 143 since December 9.\nThe orders came a day after the city in northern China began testing all of its 13 million residents.\nThe southern city of Dongxing on Tuesday ordered its 200,000 residents to isolate at home after an infection was detected.\nLocal authorities have urged calm about the rodent-borne disease, saying it is common across northern China and easily preventable through vaccination-AFP"
  },
  {
    "headline": "Dowen College: Five students tried over Sylvester oromoni’s death granted bail -",
    "summarized_story": "A Chief Magistrates’ court in the Yaba area of Lagos has granted bail to five students of Dowen College following a charge of conspiracy and homicide made against them by the State Criminal Investigation Department, Panti.\nThe police charged the minors following the alleged murder of their 12-year old schoolmate, Sylvester Oromoni.\nChief magistrate Olatunbosun Adeola, who heard the bail application on Tuesday granted them bail in the sum of N1m each.\nThe magistrate also ordered the defendants to produce two sureties each in like sum.\nMagistrate Adeola said that one of each of the defendants’ sureties must be their parent, and must swear an affidavit of compliance."
  },
  {
    "headline": "FULL TEXT: President Buhari’s letter on withholding assent to electoral bill -",
    "summarized_story": "The President of the Senate, Ahmad Lawan; and Speaker of House of Representatives, Femi Gbajabiamila, on Tuesday, at the opening of plenary read the communication from President Muhammadu Buhari on his rejection of the Electoral Act 2010 (Amendment) Bill.\n“The Electoral Act (Amendment) Bill 2021 seeks to amend certain provisions of the extant Electoral Act 2010.\nPolitical party membership is a voluntary exercise of the constitutional right to freedom of association.\nIt is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\n“In the premise of the above, I hereby signify to the National Assembly that I am constrained to withhold assent to the Electoral Act (Amendment) Bill 2021 in line with the provisions of Section 58(1) & (4) of the 1999 Constitution (as amended)."
  },
  {
    "headline": "Just In: Reps raise 2022 budget by N200bn, extend 2021 budget lifespan by 90 days -",
    "summarized_story": "The House of Representatives has extended the lifespan of the 2021 Appropriation act by nine months to enable it run concurrently with the 2022 appropriation.\nMeanwhile, the house of representatives has raised the budget by N200b and passed N17.126 billion as 2022 Spending plan.\nStill in the house of representatives, the lawmakers have approved N215.81b for the Federal Inland Revenue Service in 2022Also, the Senate has approved the nomination of Muazu Sambo as the new minister of Power.\nRecall that President Muhammadu Buhari had few months ago sacked the former minister over failure to improve the sector."
  },
  {
    "headline": "Buhari gives reasons for not signing Electoral Act Amendment Bill -",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila has read President Muhammadu Buhari’s letter explaining why he declined to sign the Electoral Act Amendment bill.\nAccording to the president, direct primaries an affront to the right to freedom of association."
  },
  {
    "headline": "South African Court Allows Zuma to Appeal Return-to-Jail Order",
    "summarized_story": "A South African court has allowed former President Jacob Zuma to appeal a ruling that ordered him back to jail after being released in September on medical parole, meaning he will be able to spend Christmas at home.\nZuma, 79, was sentenced in June to 15 months in prison for contempt of court after ignoring instructions to participate in a corruption inquiry.\nThe same court ruled on Tuesday his legal team should be able to appeal against the judgement at a higher court.\nHe said another court may find that Zuma should be treated with “compassion, empathy and humanity” because of his ill health and advanced age.\n“It means the court order cannot be enforced until the superior court hears the matter and makes a judgement,” Department of Correctional Services spokesperson Singabakho Nxumalo told Reuters news agency."
  },
  {
    "headline": "Ghana MPs Brawl in Parliament Over Mobile Money Tax",
    "summarized_story": "A brawl has broken out in Ghana’s parliament during a late-night session over a contentious government-proposed levy on electronic transactions.\nThe chaos started after opposition MPs rushed forward to prevent Deputy Speaker Joseph Osei Owusu from leaving his seat to vote, local media reports.\nThe opposition National Democratic Congress (NDC) has rejected the proposed levy of 1.75% on electronic transactions, which includes mobile-money payments.\nThe deputy speaker’s vote was seen as crucial as parliament has been heavily divided over the proposed tax.\nParliament convened again on Tuesday, but MPs did not vote on the proposed levy after agreeing to adjourn the session to January."
  },
  {
    "headline": "Nigeria Declares December 27th and 28th, January 3rd as Public Holidays for Festive Period",
    "summarized_story": "Nigeria’s Federal Government has declared Monday 27th, Tuesday 28th December 2021 and Monday, 3rd January 2022 as public holidays to mark Christmas, Boxing Day and New Year’s Day celebrations respectively.\nAregbesola enjoined Christians to practice the doctrines of Christ, which include but not limited to these – faith, hope and love.\nHe said: “We must emulate the life of Jesus Christ in His practice and teachings on Humility, Service, Compassion, Patience, Peace and Righteousness, that His birth signifies.\nHe said this Yuletide calls for spartan discipline in order to prevent the spread of the virus in our community and the nation as a whole, insisting on: “Moderately celebrate the festival without large groupings and observe all the protocols stipulated by medical authorities.\nTake it as a point of personal responsibility to prevent the spread of the virus”."
  },
  {
    "headline": "Israel Plans Fourth Covid Shots as Omicron Forces New Curbs Worldwide",
    "summarized_story": "Israel is to offer second COVID-19 booster shots as fast-spreading Omicron forces countries across the world to impose new curbs days before Christmas, but a South African study offered a glimmer of hope about the new variant’s firepower.\nAustria, Belgium, the Czech Republic and Spain were among European countries due to consider new curbs on Wednesday.\nResults of a study by Imperial College London released last week showed there was no sign that Omicron was milder than Delta.\nCountries are also looking to shorten the time between second vaccination shots and boosters.\nread moreEuropean stock indexes edged slightly higher on Wednesday, on track for a second day of gains even as Omicron infections surged."
  },
  {
    "headline": "Australian Open Confident on Nadal, Uncertain on Djokovic",
    "summarized_story": "Australian Open chief Craig Tiley is confident Rafa Nadal will be at Melbourne Park for next month’s Grand Slam despite testing positive for COVID-19, but he is still uncertain whether Novak Djokovic will be playing.\n“I’m confident Rafa will be here,” tournament organiser Tiley said of the 20-times Grand Slam champion at Melbourne Park on Wednesday.\nIf you are going to test positive and you want to play the Australian Open, your timing would be now.”Tiley reiterated that all players and staff at the Australian Open would be vaccinated or have a medical exemption granted by an independent panel of experts.\nThose requirements have prevented Djokovic, who has declined to disclose whether he is vaccinated, citing privacy, from confirming whether he will bid for a 21st Grand Slam title and a 10th Australian Open crown next month.\n“If Novak shows up at the Australian Open, he’ll either be vaccinated or he’ll have a medical exemption,” he added."
  }
]