[
  {
    "headline": "Lassa fever killed 151 in 17 weeks, says NCDC",
    "summarized_story": "No fewer than 723 cases have been managed at the case management centre for the Lassa fever disease.\nThe Nigeria Centre for Disease Control noted this on its website on Sunday’s Lassa fever situation report.\nThe PUNCH reports that Lassa fever, an endemic disease in Nigeria, occurs throughout the year.\nIt added, “The Federal Ministry of Environment is also implementing a Lassa fever environmental response campaign in high burden states.\n“Lassa fever presents initially like any other febrile illness such as malaria."
  },
  {
    "headline": "Learn from Yar’Adua, South-East PFN urges Buhari",
    "summarized_story": "The Pentecostal Fellowship of Nigeria, South-East zone, on Sunday, advised the President, Major General Muhammadu Buhari (retd.\n“The past administration of the late President Umaru Musa Yar’Adua used dialogue to solve the problems of the Niger Delta region.\nSo, we advise the incumbent administration of Muhammadu Buhari to borrow a leaf from the Yar’Adua administration.\nHe disclosed that the solemn Assembly and prayer rally was born out of God’s vision to the National President of the PFN, Bishop Francis Wale Oke.\nIn his remarks, the Enugu State Chairman of PFN, Bishop Godwin Madu, urged Christians to despair and remain prayerful and resolute."
  },
  {
    "headline": "Gunmen kill 323 security officers in 2022 –Report",
    "summarized_story": "No fewer than 323 security officers were killed by non-state actors across the country between January 1 and May 15, 2022.\nThe security operatives affected included those from the military, police, Nigeria Security and Civil Defence Corps, Nigeria Correctional Service, Vigilante Group of Nigeria, Nigeria Drug and Law Enforcement Agency, and Ebubeagu security outfit.\nOut of the 78 security operatives killed in January, 20 were soldiers, 11 policemen, 46 vigilantes, and one NSCDC personnel.\nIn April, out of the 45 security operatives killed, 30 were soldiers, 10 policemen, one vigilante, two NSCDC officials and two others.\n“Others” were used to categorise instances where the affected security operatives were not stated."
  },
  {
    "headline": "Experts see cautious trading ahead of MPC meeting",
    "summarized_story": "By Nkiruka NnoromInvestment experts are projecting a profit taking position in the stock market this week ahead of the Monetary Policy Committee (MPC) meeting later this month.\nTheir projections come as the market sustained its rally into the fifth week with investors recording N1.18 trillion gains last week.\nSimilarly, the market capitalisation of all listed equities jumped by 4.3 per cent (N1.18trn gains in value terms) to N28.262 trillion from N27.450 trillion the previous week.\nMeanwhile, the banking sector closed flat.\nThus, we see more of a “choppy theme” as cautious trading takes center stage ahead of the MPC meeting scheduled later in the month.”"
  },
  {
    "headline": "Honour UPU’S decision by voting Edevbie, Mayor of Urhoboland woos PDP delegates",
    "summarized_story": "Recall, UPU, the pan Urhobo social- political group had recently declared support for Olorogun Edevbie describing him as their best for Urhobo nation, citing his experiences in governance cutting across all tiers of governments and his personality, an additional political selling point for the 2023 gubernatorial race.\n“The generality of the voting population in Delta State,” he said, “want Olorogun Edevbie to be Governor”, saying the PDP and operators of the party should allow for a free, fair and credible primaries, where Edevbie would emerge being the best of them all”.\nAkpodoro urged the delegates to eschew money politics and shun any attempt at selling their votes for pecuniary reasons, adding that as representatives of the people and the conscience of the party there’s the need for delegates to vote wisely describing Olorogun Edevbie as the bride of the PDP and the darling of the electorates.\nThe Mayor stressed that if given the mandate, the administration of Olorogun Edevbie will meaningfully engage over 30% youths in his cabinet in addition to massive capacity building and empowerment for the state to witness accelerated development.\nOlorogun Edevbie is our numero uno, the one with Midas touch…don’t deny the pride of Urhobo nation,” the Mayor appealed."
  },
  {
    "headline": "Time for technocrats to takeover governance, says Gborogbosi, Rivers guber aspirant",
    "summarized_story": "Leesi GborogbosiDr. Leesi Gborogbosi, a governorship aspirant in Rivers State, has said the people are set for a refreshing era, as it is time for technocrats to enter participatory politics to bridge the divide between the public and private sectors.\nGborogbosi said he will speak the language of businessmen if elected governor, which will contribute to a favourable investment climate and increased job creation in River State.\n“Technocrats can also bring an ethos defined by the expectations of stakeholders.\nTechnocrats can bring transparency and accountability to the public system.\nThey understand that every kobo counts.”“With technocrats bringing the networks from the private sector that career politicians are unlikely to have,” Dr. Gborogbosi highlighted that he understood the importance of collaboration."
  },
  {
    "headline": "Gunmen kill ex-PDP leader in Akwa Ibom, abandon getaway car",
    "summarized_story": "By Chioma Onuegbu, UyoGUNMEN have reportedly killed one Mr Sylvester Ntefre, in his home at Ekparakwa, OrukAnam Local Government Area of Akwa Ibom state on Sunday morning.\nIt was gathered that the hoodlums stormed Ntefre residence around 8a.m.\nSome members of the gang who were waiting in the Jeep, abandoned the vehicle and also escaped through the bush.\nAn eyewitness told Vanguard, “And when the youths were searching the bush for the kidnappers in order to rescue Chief Ntefre, they discovered the corpse in a pool of blood.\n“The community people came out and rolled the Jeep away from that place."
  },
  {
    "headline": "Presidency: I’m in race to secure APC ticket, not alliance — Amosun",
    "summarized_story": "Senator Ibikunle AmosunBy Miftaudeen RajiIn the wake of rumours that he has formed an alliance with Asiwaju Bola Tinubu’s presidential ambition, former governor of Ogun State and presidential aspirant on the platform of All Progressives Congress, APC, Senator Ibikunle Amosun has disregarded the claim, saying he is in the race to secure the APC presidential ticket.\nThe statement reads partly, “The attention of Senator Ibikunle Amosun has been drawn to two news stories trending in the social media.\n“The first falsely claims that Senator Amosun has been cleared to contest for the Senate.\n“The second claims that Senator Amosun is set to align with a named presidential aspirant for the presidential contest.\n“Also, Senator Amosun is in the race for the presidential ticket of the APC and has no plans to align with any politician in the race."
  },
  {
    "headline": "2023 Presidency: Buhari gave me opportunity past VPs never had – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said President Muhammadu Buhari gave him opportunities his predecessors never had while in office.\nOsinbajo spoke while stressing that the training and experience garnered as Vice President under Buhari would help him lead Nigeria if elected in 2023.\nThe All Progressives Congress, APC, Presidential aspirant spoke during his interaction with the party’s delegates in Jigawa, NAN reports.\n“As vice president, the president has given me an opportunity that I do not think any other vice president has been given.\n“All I ask you to do is what is in the best interest of Nigeria; vote in the interest of our children."
  },
  {
    "headline": "Kaduna: Police warn against protest, commend residents for sustained peace",
    "summarized_story": "The Kaduna State Commissioner of Police, CP Yekini A. Ayoku, on Sunday, embarked on an observation patrol around Kaduna metropolis, checking the deployment and boosting morale of officers and men.\nViolent protests broke in Sokoto on Saturday over the arrest of two persons over the killing of Deborah Samuel for alleged blasphemy.\nFollowing this, the Kaduna State Government warned against religious protest in the state.\nIn order to checkmate, enforce the ban, the state Commissioner of Police, went round Kaduna city, to observe things for himself.\nThe CP reminded residents of the recent ban on religious protest of any kind, warning that violators would be promptly dealt with in accordance with the laws of the land."
  },
  {
    "headline": "Don’t take cocaine, cannabis other intoxicants on duty – Oyo govt tells PMS officials",
    "summarized_story": "The Oyo State Government has advised members of the Park Management System (PMS) not to consume any form of intoxicants while on duty.\nThe government has, however, warned officials of the PMS against consuming all forms of intoxicants.\nIt stated that intoxicants such as cocaine, cannabis, heroin, codeine, opioids, tobacco indian hemp and tramadol should not be consumed by the officials while on duty.\nHe added that all officials of PMS must adhere to the new regulations.\nNo member of PMS is allowed to drink any form of liquor or intoxicant substances while on duty."
  },
  {
    "headline": "2023: Ogun students condemn ‘campaign of calumny’ against Gov Abiodun",
    "summarized_story": "Ahead of the gubernatorial primary in Ogun state, the leadership of the National Association of Nigerian Students (NANS) Joint Campus Committee (JCC) Ogun State chapter and the National Association of Ogun State Students (NAOS), have disassociated themselves from an alleged petition and protest last week, purportedly held by “sponsored students” against the Executive Governor of Ogun State, Dapo Abiodun at All Progressives Congress Secretariat, Abuja.\nThe students in a statement jointly signed by Comrade Damilola Kehinde Chairman, NANS JCC Ogun, and Comrade Ogunrombi Oluwagbemileke President, National Association of Ogun State Students, condemned the activities of some political leaders in Ogun, aimed at unnecessarily heating up the political atmosphere in the state.\n“It is highly disheartening that people who are supposed to be elder statesmen in the state will be sponsoring campaigns of calumny against the sitting state governor.\n“This unwarranted sponsored media engagement aimed at His Excellency, Governor Dapo Abiodun is a high level show of irresponsibility on the part of the leaders who are sponsoring it.\n“As the legitimate and recognised students body in Ogun State, the leadership of National Association of Nigerian Students NANS, Joint Campus Committee (JCC) Ogun axis and National Association of Ogun State Students (NAOS) will resist any attempt or calculated attempts by any political leader no matter how highly placed to use our platforms to aid any political tension in Ogun state."
  },
  {
    "headline": "Media, democracy would benefit greatly if journalists are well paid – NUJ",
    "summarized_story": "The National Secretary of the Nigeria Union of Journalists (NUJ), Mr Shuaibu Leman, has said that both journalism and democracy would immensely benefit if journalists were better paid in Nigeria.\nSpeaking in Bauchi at the Nigeria Union of journalists Bauchi on Sunday, shortly after a church service thanksgiving programme to mark his retirement as a civil servant.\nLeman, however, hoped that the NUJ leadership would continue to struggle for better salary structure for journalists in the country.\n“If you look at it, journalists are one of the set of professionals that are least paid in this country.\n“My belief is that when journalists are properly paid, they will perform optimally and both journalism and democracy will truly benefit from this,” he said."
  },
  {
    "headline": "Italy, Dubai-bound drugs intercepted in Lagos",
    "summarized_story": "The Agency also said it foiled bids by drug cartels to export Tramadol, Ecstasy MDMA and Cannabis to Milan, Italy and Dubai, United Arab Emirates through the Murtala Muhammed International Airport, MMIA, Ikeja, Lagos.\nBabafemi said that at the Lagos airport, a female passenger, Odia Emiliana Efe was arrested on May 9 while trying to board a Royal Air Morocco flight from Lagos via Casablanca to Milan, Italy with 1000 tablets of Tramadol 200mg concealed in food items.\nThe statement reads, “In Abia, three trucks loaded with drugs coming from Lagos and Onitsha were intercepted in Aba, Abia State.\nRecovered from him include: 45,000 tablets of Diazepam weighing 41.5kg; 50,000 tablets of Exol, weighing 15.6kg; 1,500 tablets of Rohypnol weighing 700 grams and 300 bottles of codeine weighing 41.5kg.\nInterestingly, drugs and illicit proceeds of drug crime worth over N130 billion were successfully recovered.”"
  },
  {
    "headline": "Two herders held on kidnap charges",
    "summarized_story": "Operatives attached to the Police Intelligence Response Team (IRT) have arrested two herders, Abdulrahman Lolo, 20, and Mohammed Sanni, 26, over alleged kidnap of a man, Jibril Saidu, 35, in Kaduna State.\nThe suspects allegedly kidnapped their victim at Bandoko near Katari, along the Kaduna-Abuja Highway, Kachia Local Government Area on April 29.\nAccording to information, the suspects went away with the man and his motorcycle, adding that the man’s mother raised the alarm as soon as they left his premises.\n“The villagers immediately organised local vigilantes to secure the community and then sent a distress call to the IRT operatives attached to Operation Puff Adder for urgent action.\nAdejobi noted that, police officers were more effective when members of the public provide them useful and timely information."
  },
  {
    "headline": "Suspects arrested as motorcyclists burn sound engineer over N100 in Lagos",
    "summarized_story": "Operatives of the Lagos Police Command have arrested the suspects in connection of the mob justice meted a sound engineer, David Imoh, 38, at Lekki.\nThey were said to have beaten the sound engineer and his friends who came to intervene with sticks, clubs and other dangerous instruments.\nThe mob later set his unconscious body on fire before help could come his way,” said a source.\nSadly, our sound engineer Dave became the casualty.”One Ope King who said the deceased was her brother-in-law, wrote: “This is my brother-in-law!\n“The command would not tolerate any case of injustice, mob action or murder, no matter the degree of provocation.”"
  },
  {
    "headline": "Muslims who kill Christians in Nigeria over blasphemy won't smell Paradise",
    "summarized_story": "Muslims who kill Christians in Nigeria over blasphemy will not smell Paradise, popular Kaduna-based Islamic scholar, Sheikh Ahmad Gumi has declared.\nHe was reacting to the killing of a student of Shehu Shagari College of Education (SSCOE) Deborah Samuel over alleged blasphemy against Prophet Muhammad last Thursday.\n“There are people who are neither Muslims not Christians in Nigeria and everyone is trying to win their souls.\nSo, Prophet Muhammad said whoever kills a soul of non-Muslim that is under such agreement of living together will not smell the fragrance of paradise.\n“Is it even we the Muslims of Nigeria that want to defend Prophet Muhammad?"
  },
  {
    "headline": "BREAKING: I'll resign on Monday",
    "summarized_story": "Minister of Transportation Rotimi Amaechi has hinted that he will resign on Monday in deference to a directive by President Muhammadu Buhari to members of the Federal Executive Council (FEC) seeking election to quit.\nThe Minister gave the hint in Kaduna on Sunday when he visited the State to canvass the support of All Progressives Congress(APC) delegates for the presidential primary.\nHe expressed appreciation to Buhari for the opportunity to serve as Minister.\nAmaechi stressed the attack on the Abuja-Kaduna train would not have happened if the Federal Executive Council (FEC) had approved the surveillance contract he request to monitor the rail track.\nDetails Shortly…"
  },
  {
    "headline": "Tension, fears in Borno over alleged fresh blasphemy",
    "summarized_story": "Her comment triggered sharp reactions as someone volunteered the lady’s location and house with a warning to get her.\nThe threat by some people to give her Deborah treatment made security agents to evacuate her and her family late Saturday.\nThis was contained in another statement from the spokesperson of the scheme in Sokoto State, Malam Sani Idris.\nChairman, Northern Governors Forum and Plateau State Governor, Simon Lalong in a statement said the governors were concerned about the development which is clearly an extra-judicial measure of addressing perceived infraction.\nCAN believe that life is sacred and must never be taken by another unless as directed by the State."
  },
  {
    "headline": "The Sun gets new board of directors",
    "summarized_story": "The Board of Directors of The Sun Publishing Limited has been reconstituted, with Barr Neya Uzor-Kalu as chairman.\nOther members of the board are Onuoha Ukeh (Managing); Mr. Mike Awoyinfa, Mr. Iyke Ekeoma, Alhaji Kabiru Mohammed Shuaibu, mni, Mrs. Olufunmilayo Goka, Mr. Abayomi Fatusin and Engr.\nMr. Awoyinfa, pioneer Managing Director/Editor-in-Chief of The Sun Publishing Limited, was on the former board.\nObinna Kalu holds a Bachelor of Laws Degree (LL.B) from Abia State University, obtained in 1999.\nKalu joined The Sun Publishing Limited as General Counsel in 2013 and currently heads the Company’s Legal Department."
  },
  {
    "headline": "2023: Osinbajo, Mohammed, Saraki woo Jigawa, S’East, Kogi delegates",
    "summarized_story": "Osinbajo, who interacted with stakeholders and delegates in Dutse, Jigawa State insisted that the country deserves the best.\nHe told Ebonyi and Enugu delegates that he would run an all-inclusive government and implored them to support him to clinch the PDP presidential ticket.\nResponding to questions from newsmen after a meeting with delegates in Kogi State, he said he has the solutions to all the problems confronting the nation.\nThe former minister of works made the plea to individual delegates via a voice note he sent to all delegates of the senatorial district.\nHe believed he can win the primary with votes from the delegates and go on to win the general election."
  },
  {
    "headline": "Those fueling ethnic, religious war in S/West ‘ll regret it , Gani Adams warns",
    "summarized_story": "By Lukman OlabiyiAare Onakakanfo of Yorubaland, Iba Gani Adams, has warned those fanning the ember of war saying it is capable of fueling ethics and religious war in Nigeria.\nHe insisted that the South West would resist any attempt that could trigger crisis and disturb the peace in the region.\nIn a statement by his media aide, Adams said the culprits should be apprehended and made to face the wrath of the law.\nHe condemned the act in its totality, maintaining that such could also jeopardise the fragile unity of the nation.\n“We are in the midst of a full-blown crisis in Nigeria and unless something urgent is done, this may lead to a complete anarchy."
  },
  {
    "headline": "Court halts sharing of derivation funds to oil producing states",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered the Accountant General of the Federation to immediately halt the distribution of more than N1 trillion due to oil producing states, pending the determination of the suit before it.\nThe court presided over by Justice A R. Mohammed, in an interim injunction, held that the distribution of the derivation funds without the indices of the Revenue, Mobilisation, Allocation and Fiscal Commission (RMAFC) was injurious to the applicant, which is the Imo State Government.\nThe Imo state attorney general had, in a suit No FHC/ABJ/CE/415/2022, against RMAFC and others, challenged the distribution of the said funds without unambiguous indices by RMAFC as provided by the Nigerian Constitution.\nIn his submission before the court, counsel to the Imo State government, Chief Olusola Oke, argued on the need to protect his client, pending the determination of the suit.\nAfter granting the ex parte order, Justice Mohammed ordered Imo state to join other oil producing states as respondents to the suit."
  },
  {
    "headline": "Now Official, NFF Appoints Jose Peseiro as Head Coach of Super Eagles",
    "summarized_story": "Duro IkhazuagbeIt is now official that Portuguese gaffer, José Vitor dos Santos Peseiro, 62, has been appointed as the new Head Coach of the Super Eagles.\nOn Sunday, the Director of Communication of the NFF, Ademola Olajire, announced in a statement that Peseiro is the preferred choice amongst the five coaches interviewed for the job.\n“The appointment (of Peseiro) is with immediate effect, subject to the signing of agreed terms between the NFF and Mr Peseiro,” the official statement from the NFF announced.\nPeseiro played as a striker in his days and has wide and varied experience coaching top clubs and national teams across four different continents, namely Europe, Asia, Africa and South America.\nThe NFF also announced that former Nigeria international forward, Finidi George, will now be the First Assistant to Peseiro, with Salisu Yusuf now to be the Second Assistant, as well as Head Coach of the CHAN and U23 national teams."
  },
  {
    "headline": "To Avert Major Religious Riots, Tambuwal Declares Curfew as Protests Rock Sokoto",
    "summarized_story": "Following the protests in Sokoto, Governor Nasir-el-Rufai of Kaduna State has banned any form of religious protest across the state.\nThe declaration of the curfew in Sokoto followed the protests that greeted the condemnation of the killing by the Sultan of Sokoto, Alhaji Muhammad Sa’ad Abubakar III.\nThe protesters set a car ablaze around St. Mary Catholic Church and destroyed properties in the church.\nTo avert major religious riots, Tambuwal therefore declared a 24-hour curfew within the metropolis.\nTunga Magaiya youths had insisted that Sokoto State Government should have been responsible for her burial."
  },
  {
    "headline": "Before Another Deborah is Lynched",
    "summarized_story": "The general lull, in my opinion, is not because anything has changed in the animosity but possibly because there is a bigger enemy at the door: Boko Haram.\nWith Boko Haram becoming a common threat, the confrontations reduced.\nThe factory for the production of Boko Haram and ISIS militants is very much in full production.\nBoko Haram would have their eyes on them.\nMeanwhile, I want to commend all the Muslims and Muslim groups who have been courageous enough to condemn the killing of Deborah."
  },
  {
    "headline": "Alleged Blasphemy: Tension in Sokoto, Tambuwal Declares Curfew",
    "summarized_story": "The irate youth also demanded that those arrested over the killing should be released with immediate effect.\nHe appealed to the people of Sokoto state to continue to observe law and order.\n“Everyone should, please, in the interest of peace go back home and observe this measures, with a view to re-establishing peace, law and order in the state”, he stated..\nHe noted that it was not in the interest of anyone to have a breakdown of law and order.\n“I, therefore, appeal for restraint; and, for people to observe and respect the rule of law”, he said ."
  },
  {
    "headline": "COVID Under Control in China",
    "summarized_story": "I would like to assure my Nigerian friends that China will be able to win the battle.\nChina’s anti-epidemic experience has demonstrated that its dynamic zero-COVID policy is not only the best option but also the bottom line that must be maintained for the country’s current epidemic prevention and control work.\nBy pursuing the dynamic zero-COVID approach, China has managed to safeguard people’s lives and well-being and has minimized the epidemic’s impact on economic and social development to the largest extent.\nAs a result, it is not difficult to conclude that China’s dynamic zero-COVID policy complements and bolsters the normal operation of the economy and society.\nFacing the COVID-19 pandemic, China has carried out its largest emergency humanitarian action since the founding of the People’s Republic of China in 1949."
  },
  {
    "headline": "Commercial Motorcyclists Beat, Burn Sound Engineer To Death In Lagos Due To Disagreement Over N100 Balance",
    "summarized_story": "Nigeria Nigeria Nigeria https://t.co/qfoxlRQGGb.\"\nTo cut the long story short, try were beaten to a pulp and the sound engineer lost his life right there.\n\"As if that was not enough, the sound engineer was burnt right there on the road.\nGoing on at admiralty way lekki phase 1.\nHe was the sound engineer in my church."
  },
  {
    "headline": "Commercial Motorcyclists Beat, Burn Sound Engineer To Death In Lagos Due To Disagreement Over N100 Balance",
    "summarized_story": "Nigeria Nigeria Nigeria https://t.co/qfoxlRQGGb.\"\nTo cut the long story short, try were beaten to a pulp and the sound engineer lost his life right there.\n\"As if that was not enough, the sound engineer was burnt right there on the road.\nGoing on at admiralty way lekki phase 1.\nHe was the sound engineer in my church."
  },
  {
    "headline": "BREAKING: FCT Ministry Demolishes Multi-Million Naira Mansion Belonging To Tonto Dikeh's Ex-lover, Kpokpogri In Abuja",
    "summarized_story": "A multi-million naira mansion belonging to Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has been demolished by the Federal Capital Territory Administration (FCTA) in Abuja.\nSpeaking with SaharaReporters, the owner of the building, Kpokpogri and ex-lover of Dikeh, expressed shock saying he was not pre-informed by the officials about the demolition which he described as illegal.\n\"I don't have any issue with anybody that will warrant the wicked and illegal destruction of my house this morning without any pre-notice from the FCT ministry.\nBecause, my house is seated on a rock and an attraction of everybody; so everybody wants to have my house.\"\nPrince Joseph Kpokpogri has been having a serious battle with his estranged lover, Dikeh, resulting to series of arrest, legal actions and counter-arrest and actions."
  },
  {
    "headline": "BREAKING: FCT Ministry Demolishes Multi-Million Naira Mansion Belonging To Tonto Dikeh's Ex-lover, Kpokpogri In Abuja",
    "summarized_story": "A multi-million naira mansion belonging to Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has been demolished by the Federal Capital Territory Administration (FCTA) in Abuja.\nSpeaking with SaharaReporters, the owner of the building, Kpokpogri and ex-lover of Dikeh, expressed shock saying he was not pre-informed by the officials about the demolition which he described as illegal.\n\"I don't have any issue with anybody that will warrant the wicked and illegal destruction of my house this morning without any pre-notice from the FCT ministry.\nBecause, my house is seated on a rock and an attraction of everybody; so everybody wants to have my house.\"\nPrince Joseph Kpokpogri has been having a serious battle with his estranged lover, Dikeh, resulting to series of arrest, legal actions and counter-arrest and actions."
  },
  {
    "headline": "Alleged Blasphemy: No Votes In 2023 For Politicians Who Fail To Condemn Deborah's Murder—Christian Youths",
    "summarized_story": "The Christian Association of Nigeria (Youth Wing) has warned that any politician who fails to mourn or condemn the gruesome murder of Miss Deborah Samuel, who was killed by a mob over alleged blasphemy, should forget about their votes in the 2023 general elections.\nThe youth group condemned the killing of Deborah by fellow students of Shehu Shagari College of Education, Sokoto.\n\"Even after killing Deborah, the miscreants continued to destroy people's properties, burning church facilities and going from house to house intimidating peaceful Christians.\nAny politician who failed to mourn with the nation especially the Christians in this sorrowful time should forget our votes in 2023.\n\"We call on all Christian youths to continue to be peaceful and not take laws into their hands."
  },
  {
    "headline": "2023: Kaduna APC delegates pledge support for Amaechi -- days after endorsing Tinubu",
    "summarized_story": "Delegates of the All Progressives Congress (APC) in Kaduna state have expressed their support for the presidential bid of Rotimi Amaechi, minister of transportation.\nAmaechi’s visit to the state comes two days after the Kaduna delegates had enthusiastically assured Bola Tinubu, another APC presidential hopeful, of their allegiance.\n“You’ve heard Amaechi, you’ve seen what he has done.\nAre we in Kaduna state APC committed, as a matter of fairness and justice, to the presidency of Nigeria going to the south?\nYou’ve seen Governor Amaechi."
  },
  {
    "headline": "2023: Kaduna APC delegates pledge support for Amaechi -- days after endorsing Tinubu",
    "summarized_story": "Delegates of the All Progressives Congress (APC) in Kaduna state have expressed their support for the presidential bid of Rotimi Amaechi, minister of transportation.\nAmaechi’s visit to the state comes two days after the Kaduna delegates had enthusiastically assured Bola Tinubu, another APC presidential hopeful, of their allegiance.\n“You’ve heard Amaechi, you’ve seen what he has done.\nAre we in Kaduna state APC committed, as a matter of fairness and justice, to the presidency of Nigeria going to the south?\nYou’ve seen Governor Amaechi."
  },
  {
    "headline": "'We take it as act of God' — Deborah Samuel's parents speak on her murder",
    "summarized_story": "Emmanuel Garba, father of late Deborah Samuel, says his family has taken her death as an act of God.\nAdvertisement“We can’t say or do anything, except to take it easy as an act of God.\nWe have left all to God, we have decided to take it like that,” Garba said.\n“I personally went and brought back the body of my daughter to enable me to bury my own child.\nI have given God my heart and may God strengthen me."
  },
  {
    "headline": "'We take it as act of God' — Deborah Samuel's parents speak on her murder",
    "summarized_story": "Emmanuel Garba, father of late Deborah Samuel, says his family has taken her death as an act of God.\nAdvertisement“We can’t say or do anything, except to take it easy as an act of God.\nWe have left all to God, we have decided to take it like that,” Garba said.\n“I personally went and brought back the body of my daughter to enable me to bury my own child.\nI have given God my heart and may God strengthen me."
  },
  {
    "headline": "Buba Galadima: Kwankwaso unopposed in race for NNPP presidential ticket",
    "summarized_story": "Buba Galadima, a former member of the board of trustees (BoT) of the All Progressives Congress (APC), says Rabiu Kwankwaso is the unopposed presidential hopeful of the New Nigeria Peoples Party (NNPP).\nGaladima said the former Kano governor is the only person who purchased the presidential nomination form of the NNPP.\n“There are only two political parties in Nigeria today: NNPP and the rest.\nAdvertisementThe assertion of Galadima runs contrary to an earlier comment by Boniface Aniebonam, NNPP pioneer national chairman and founder.\n“NNPP is open for any Nigerian man that has divine calling to lead Nigeria at this critical [period]."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Google unveils first smartwatch, new phones, virtual cards and more",
    "summarized_story": "Google also announced updates to several of its most popular tools including Maps, Google Translate and its core search product.\nGoogle search which started from only text queries has over the years added the option to use voice and picture queries options.\nGoogle maps’ new immersive view for cities comes off as a challenger to Apple’s 3D mode map view.\nVirtual cardsSource: GoogleGoogle is rolling out virtual credit cards to help protect users’ financial information while they’re shopping online.\nThese virtual cards are typically used for one-time purchases, but users will also be able to use these cards for subscriptions."
  },
  {
    "headline": "Nigeria’s Central Bank edges close to eNaira use case with much-needed upgrade",
    "summarized_story": "Share this article:Nigeria’s central bank digital currency (CBDC), eNaira, will get an update that will allow it to perform more functions such as bill payment and USSD access.\n“Fundamentally, there were faults that would not have allowed the eNaira to achieve its full potential.”There were issues with setting up the eNaira Speed Wallet application at launch.\nOnly 1.3% had completed a transaction with the eNaira Wallet, while 34.4% were indifferent about the CBDC project.\nHow eNaira USSD could workWhile there’s little detail on how the eNaira will work with USSD, we can make educated guesses on how the service will work based on our understanding of the eNaira and USSD protocols in Nigeria.\nAccording to the CBN, the first tier of Speed Wallet users can set up a wallet without a Bank Verification Number (BVN)."
  },
  {
    "headline": "Interswitch raises $110m",
    "summarized_story": "Perhaps now’s a good time to ask how many fintech startups you know do not provide lending and payment options in Nigeria.\nIntelligence by Techpoint, the data and research arm of Techpoint Africa, has partnered with YC to give an account of its activities in Africa since 2009.\nThe fintech company is well known for its Point-of-Sale terminals and online consumer payment platforms like Quickteller and Verve.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in less than nine days!\nPolygon is sponsoring 50 free tickets to Techpoint Africa Blockchain Summit (TABS), holding on May 21, 2022."
  },
  {
    "headline": "Does Nigeria have too many fintech startups? What the numbers say",
    "summarized_story": "Share this article:There are at least 150 fintech startups in Nigeria, depending on who you ask.\nStatista reports that there were 144 fintech startups as of 2021 and a 2020 McKinsey report puts the number of standalone fintech startups at over 200.\nConsequently, it is not unusual to hear comments on the proliferation of fintech startups in the country, which begs the question, are there too many fintech startups in Nigeria?\nWhile the United States has 8,775 fintech startups for its 334.6 million people, the United Kingdom has 1,600 fintech startups serving 68.5 million people.\nLooking at the numbers, one could say that we need at least 1,000 more fintech startups in the country."
  },
  {
    "headline": "MARA Raises $23M to Build Africa’s Portal to the Crypto Economy",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nMARA Chain – a layer-1 blockchain, powered by the native MARA token, that gives savvy developers a place to build decentralized applications that will help shape the future of the African crypto economy.\nThe MARA Chain will launch later in 2022, giving savvy developers a place to build decentralized applications that will help shape the future of the African crypto economy.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "5 Organisations providing ‘Tech’ and ICT solutions for SMEs in Nigeria",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nSMEDANSmall and Medium enterprise development agency of Nigeria commonly known as SMEDAN, organizes e-business and empowerment training for young entrepreneurs across Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "2023: Seven women who want Buhari’s office",
    "summarized_story": "Despite the interest already shown by these women, political analysts say it is still a far cry from the 35 percent affirmative action approved by the United Nations.\nThe seven women represent less than 20 percent of the 38 male presidential aspirants.\nOf the 20 presidential candidates, two were women – Sarah Jubril of the Progressive Action Congress, and Mojisola Adekunle Obasanjo of the Masses Movement of Nigeria.\nThe 2015 presidential election was not different; Oluremi Sonaiya, a professor, was the only female in a crowd of 14 presidential candidates.\nThe presidential election held in 2019 had 73 candidates, including six women – the highest so far in the history of Nigeria’s political system."
  },
  {
    "headline": "Ossiomo Power Company wins BusinessDay Next Bulls Award 2022",
    "summarized_story": "The company’s power lines were powered in 2020 and it has since grown its market share substantially as a result of its competitive tariff, reliable power supply with an average performance of 97.5% or 22 hours per day and 100 percent metering.\nAigbogun said the Next Bulls award follows an informal, proprietary survey carried out on 500 respondents, which comprise equity analysts, retail and institutional investors, financial journalists, sectoral experts, professionals and millennials.\nHe added that 75 respondents identified Ossiomo Power and Infrastructure Company Ltd as a company whose stock they would like to own in their dream equity portfolio for long-term holding if the choice was limited to only 10 companies.\nThe respondents affirmed that they would invest in the company’s initial public offering (IPO) if it ever approached the market.\nAigbogun noted that in making the decision, the Awards Review Committee was guided by the achievements of Ossiomo Power and Infrastructure Limited, which include its “track record as an independent power company dedicated to providing power to the Benin Industrial and Enterprise Park as well as several local communities in Edo State."
  },
  {
    "headline": "Obaseki blames rise in drug abuse on ASUU strike …Appeals to FG, union to resolve industrial action – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has blamed the increasing rate of drug abuse in the state on the lingering strike action by the Academic Staff Union of Universities (ASUU).\nAddressing journalists after the state’s security council meeting at Government House in Benin City, he said drug abuse is the second biggest security threat in the state.\nThe security meeting was attended by representatives of various security agencies in the state.\nObaseki noted, “Drug abuse ranks among the top two of serious security concerns in our state.\nIn his response, Edo State Commissioner of Police, Mr. Abutu Yaro, said that the facts speak for itself, noting that Edo is safer now than before."
  },
  {
    "headline": "2023 Presidency: Nigeria needs bold, business-conscious president – Saraki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestFormer Senate President Bukola Saraki says Nigeria must get it right by voting him as the next president of the country in the 2023 general elections.\n“We need somebody who can unite Nigeria, who the youths and the old, North and South can be comfortable with.\nSaraki added that the country needed a president that was business-friendly and understood the private sector and able to change the country’s mono-economy status.\n“We need somebody that can bridge the gap between the young and the old.\nWe need somebody that can create jobs and shore up employment and that can only be done through agriculture, through non-reliance on oil."
  },
  {
    "headline": "STAKEHOLDERS STEP UP FIGHT AGAINST LASSA IN EKPOMA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – Stakeholders in Esan West Local Government Area of Edo State have adopted aggressive approaches to fighting Lassa fever disease in the local government.\nEsan West Local Government currently ranks highest in the current outbreak of Lassa fever in Edo State, in terms of number of confirmed cases of the disease.\nAuthorities of Esan West Local Government Council are currently embarking on aggressive environmental sanitation and deratisation of the various communities to eliminate rats.\nThe council, in collaboration with Civil Society groups, such as Josemaria Escriva Foundation, Concerned Ekpoma Eminent Stakeholders Forum and others, are currently embarking on massive sensitization campaign to boost awareness about the disease.\nHe explained that his administration was similarly fighting the dreaded lassa fever disease through massive sensitization campaign to increase awareness about the disease, through collaboration with civil society groups."
  },
  {
    "headline": "NFF appoints José Peseiro as Super Eagles manager",
    "summarized_story": "The Nigeria Football Federation (NFF) on Sunday announced the appointment of José Santos Peseiro as the new Head Coach of the Senior Men National Team, Super Eagles.\nThe appointment is with immediate effect, subject to the signing of agreed terms between the NFF and Mr Peseiro.\nJosé Vitor dos Santos Peseiro, 62 last month, is a Portuguese who played as a striker in his days and has wide and varied experience coaching top clubs and national teams across four different continents, namely Europe, Asia, Africa, and South America.\nHe has also served as Head Coach of the Saudi Arabian and Venezuelan National Teams.\nThe NFF also announced that former Nigeria international forward, Finidi George, will now be 1st Assistant to Peseiro, with Salisu Yusuf is now to be 2nd Assistant as well as Head Coach of the CHAN and U23 National Teams."
  },
  {
    "headline": "2023: Lawan’s candidature’ll rock like hurricane, 9 aspirants to step down for him – Orji Kalu",
    "summarized_story": "Senate Chief Whip and former governor of Abia State, Orji Uzor Kalu, has said nine presidential aspirants of the All Progressives Congress (APC) are ready to step down to for Ahmad Lawan, president of the senate.\nLawan, a late entrant into the 2023 presidential race, obtained the N100 million APC presidential forms last week.\nThe issue of the APC presidential candidate will be settled even before the primaries.\nAs I am talking to you, about nine presidential aspirants from our party have intimated me of their plans to drop their presidential ambition to support Ahmad Lawan.”“Does that not signify victory before the election?\nINEC should discipline any party that fails to meet up, because that is the only way they can take their jobs seriously,” Kalu said."
  },
  {
    "headline": "Deborah’s Murder: Only truth can heal the wounds — Pat Utomi",
    "summarized_story": "Utomi who reacted to the incident in a statement he personally signed and Titled, “A TIME TO LEAD”, blamed the current insecurity bedevilling the country on a lack of worthy leadership.\n“The incidents in Sokoto in the last two days have opened a deep wound in the Soul of our country.\nThe only thing that can heal this deep gash now is leadership and truth, like the sore in the saying by the founder of the caliphate Uthman Dan Fodio.\nOnly truth can heal this one.\nThe Sokoto state government has imposed a one-week curfew after youths protested the arrest of the perpetrators."
  },
  {
    "headline": "What Nnamdi Kanu told me – Soludo says as he visits IPOB leader",
    "summarized_story": "Anambra State governor, Charles Soludo, at the weekend, paid a visit to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nKanu who is facing treason trial, is being detained by the the federal government in Abuja.\nThe Anambra governor who announced his visit early Sunday said, it was aimed at finding lasting peace to the issue of insecurity in the Southeast.\nHe said the IPOB leader is unhappy with killings in the southeast and expressed sadness over the development.\n“He (Kanu) expressed sadness over what he described as ‘sacrilegious killings’ of innocent persons, kidnappings and all forms of criminalities, including the brutal enforcement of the senseless ‘sit at home’ perpetuated by sundry groups claiming to be acting for or on behalf of IPOB,” Soludo said."
  },
  {
    "headline": "Envoy Celebrates Growing US-Nigeria Cultural Ties in Music, Arts",
    "summarized_story": "The United States (US) Ambassador to Nigeria, Mary Beth Leonard has applauded the growing ties between the US and Nigeria in the creative industry.\nDelivering her remarks at a reception on Thursday, the envoy noted thatThe United States government is committed to strengthening the burgeoning US-Nigeria cultural ties through music, arts, film, cultural heritage, and professional and educational exchanges.\nThe event was hosted by the US Mission to honor the 15th Annual Headies Music Awards, which will be held for the first time in Atlanta later this year.\nAmbassador Leonard explained that the choice of Atlanta to host the Headies symbolizes the growing relationship between the music industries in the United States and Nigeria and the growing popularity of Nigerian music in the United States.\n“This year’s Headies awards will highlight the growing U.S.-Nigeria ties and the vast potential of Nigerian musicians as cultural exporters to the African continent and beyond,” she said."
  },
  {
    "headline": "ECOWAS Commission Tasks Resident Representatives On Crucial Documents",
    "summarized_story": "The ECOWAS Commission has charged Permanent Resident Representatives in the sub region to finalize crucial documents for the smooth running of ECOWAS Representations to Member States.\nAccording to a statement issued at the weekend by the Communications Division of the Commission, this was the focus of a retreat for Permanent Resident Representatives of ECOWAS to Member States from 11th to 13th May 2022 in Ouidah, Republic of Benin.\nHe further stated that the documents that will emerge from deliberations at the retreat will enable better service for economic and social development of Member States.\nHe reminded them of their role in line with Decision A. Dec. 9/03/14 establishing Permanent Representations in Member States and encouraged them to synchronize their actions and activities with the mandate of the Commission.\nEach representative will over the course of the three days present their activities, deliberate over the headquarters agreement and finalize the representative’s handbook."
  },
  {
    "headline": "ECOWAS Commission Tasks Resident Representatives On Crucial Documents",
    "summarized_story": "The ECOWAS Commission has charged Permanent Resident Representatives in the sub region to finalize crucial documents for the smooth running of ECOWAS Representations to Member States.\nAccording to a statement issued at the weekend by the Communications Division of the Commission, this was the focus of a retreat for Permanent Resident Representatives of ECOWAS to Member States from 11th to 13th May 2022 in Ouidah, Republic of Benin.\nHe further stated that the documents that will emerge from deliberations at the retreat will enable better service for economic and social development of Member States.\nHe reminded them of their role in line with Decision A. Dec. 9/03/14 establishing Permanent Representations in Member States and encouraged them to synchronize their actions and activities with the mandate of the Commission.\nEach representative will over the course of the three days present their activities, deliberate over the headquarters agreement and finalize the representative’s handbook."
  },
  {
    "headline": "Avoid Imposing Governorship Candidate, APC Members Tell Lalong",
    "summarized_story": "A group, the All Progressives Congress (APC) Patriots in Plateau State has urged Governor Simon Lalong and the leadership of the party to avoid imposing a governorship candidate on the people of the state.\nAccording to the APC Patriots, it will be counterproductive and as well reverse the fortunes of the party in the state.\n“Plateau abhors injustice in all its ramifications, the people of the state especially party members should not be taken for granted.\nThe government’s preferred candidate is an overnight member of the party, his membership of the party is subject to investigation.\nWe authoritatively learnt that there is a subterranean move to grant him a waiver to contest the governorship election in the state."
  },
  {
    "headline": "Avoid Imposing Governorship Candidate, APC Members Tell Lalong",
    "summarized_story": "A group, the All Progressives Congress (APC) Patriots in Plateau State has urged Governor Simon Lalong and the leadership of the party to avoid imposing a governorship candidate on the people of the state.\nAccording to the APC Patriots, it will be counterproductive and as well reverse the fortunes of the party in the state.\n“Plateau abhors injustice in all its ramifications, the people of the state especially party members should not be taken for granted.\nThe government’s preferred candidate is an overnight member of the party, his membership of the party is subject to investigation.\nWe authoritatively learnt that there is a subterranean move to grant him a waiver to contest the governorship election in the state."
  },
  {
    "headline": "Updated: One dead, 4 critically injured in California church shooting",
    "summarized_story": "One person has been reported dead and four critically injured in a mass shooting at a church in Laguna Woods in Southern California.\nThe authorities said one person has been detained in connection with the latest shooting at Geneva Presbyterian Church in Laguna Woods, the Orange County Sheriff’s Department tweeted.\n“Deputies are responding to reports of a shooting at a church on the 24000 block of El Toro Road in Laguna Woods.\nLaguna Woods is a community in Southern California of about 16,000 people.\nFire and rescue personnel were at the scene, treating and transporting multiple patients to the hospital, the Orange County Fire Authority said."
  },
  {
    "headline": "Gunmen attack police vehicle in Bayelsa: 5 killed",
    "summarized_story": "Okafor Ofiebor/Port HarcourtA police constable identified as Asuo Osuani and four police constabularies were shot dead in a gunmen ambush on a vehicle conveying some police officers and civilians at Idema-Otuabagi road, Ogbia local government area of Bayelsa State on Saturday.\nThe Special Constabulary operatives killed in the attack were Odeoye Sampson, Mr Terry Lucky, Jennifer Adejo and Ms Asueroh Tobin, according to a press statement from the Bayelsa State Police Command spokesperson SP Asinim Butswat.\nThe security operatives were from were returning from the burial of their colleague, late ASP Gilbert Sampson, at Imago Kugbo, Rivers State before they were attacked around 7.45 pm on Saturday evening.\nThe Police spokesperson added that one Inspector Urere Edwin, Ms Rejoice Sampson and Ms Reward Sampson sustained bullets injuries during the attack and are responding to treatment.\n“The Commissioner of Police, Bayelsa State Command, Ben Nebolisa Okolo, has ordered a manhunt for the gunmen who perpetrated the dastardly act."
  },
  {
    "headline": "NISS hails Oyetola on security intervention, making Osun model of socioeconomic development in Nigeria",
    "summarized_story": "The National Institute of Security Studies (NISS) has commended Governor Adegboyega Oyetola of Osun for turning the State to a security asylum and a model of socioeconomic rejuvenation in the country through his social security interventions, genuine and purposeful leadership.\nNISS also hailed the state government for the giant strides it has recorded in sustaining the status of Osun as the most peaceful State in the country despite its socioeconomic realities.\nThe participants were in Osun for a one-week study tour as part of the requirements of the Course.\nSpeaking at the Dinner, Mr. Adeleke, extolled the state government for its huge investment in the security sector, saying “We have travelled round the entire state and we have seen several things.\n“As we all know, security is the bedrock of socioeconomic development."
  },
  {
    "headline": "Peace Mass Transit Re-trains Drivers For Improved Highway Safety",
    "summarized_story": "One of the regular training and re-training programs for Peace Mass Transit drivers got underway Tuesday, and continues as we speak.\nThe program which lasts one month is designed to cover all drivers in the PMT fleet.\nOfficers of the Federal Road Safety Commission oversee the main sessions for participants while PMT safety manager, Sunday Igwegbe, takes them through the other routines.\nPeace Mass conducts regular safety refresher courses for its drivers and takes their participation seriously.\nFRSC officers take them through safety routines like fire emergency reactions, highway codes, and general road safety procedures."
  },
  {
    "headline": "Azman Air Disowns Captain Jamil Abubakar Who Justified Sokoto College Student Murder",
    "summarized_story": "Azman Airlines’ management today publicly disassociated itself from one of its top pilots, captain Jamal Abubakar, who is no longer a pilot with AzmanAir; “his last flight with us was December 22nd,” Azman Air claimed in a response tweet.\nAfter Jamil Abubakar supported the execution of Deborah Samuel by Islamic extremists, Azman Airlines distanced itself from him.\nNigerians who are under the idea that Mr.Abubakar, a member of the Azman Air crew, launched a tirade against the airline for hiring a religious bigot.\nAzman Air issued a statement on Sunday separating the airline from Mr. Abubakar, informing Nigerians that the pilot had left the company in 2019.\n“PUBLIC NOTICE: Capt Jamil Abubakar is no longer a pilot @AzmanAir; his last flight with us was 22nd Dec 2019,” Azman Air said in a rebuttal tweet."
  },
  {
    "headline": "Bishop Kukah Commends Tambuwal’s Action, Debunks Attack On Residence",
    "summarized_story": "The Catholic Bishop of Sokoto Dioceses, Most Reverend Matthew Kukah has commended the state Governor, Rt.\nThe development however prompted Governor Tambuwal to swiftly declare a 24-hours curfew in the city.\nReacting, Most Reverend Kukah, in a statement signed by the Director of Social Communications of the Catholic Diocese of Sokoto, Reverend Father Christopher A. Omotosho, commended Gov.\nBishop Kukah, in the statement, also debunked the rumored attack on his residence.\n“Contrary to information in circulation, we wish to disclaim that there was attack on any sort on the residence of Bishop Matheny Hassan Kukah”."
  },
  {
    "headline": "Deborah: Sheikh Gumi lashes killers, reveals consequences",
    "summarized_story": "A Kaduna based Islamic scholar, Sheikh Ahmad Gumi, has stated that any Muslim who kills a Christian in Nigeria for insulting or blasphemy against Prophet Muhammad (SAW) will not smell paradise.\nQuoting some Quranic verses and jurisprudence, the cleric said killing a non-Muslim under the guise of blasphemous statement against Prophet Muhammad was not a tenable excuse.\nThere are people who are neither Muslims not Christians in Nigeria, and everyone is trying to win their souls.\nIf we now begin to kill people, they will say it is even from the leader of our faith, Prophet Muhammad that we have learnt it.\n“It is unfortunate that, we even see some clerics who are telling people that whoever insults your religion, just kill them."
  },
  {
    "headline": "Breaking: At last, NFF confirms Jose Peseiro as substantive Super Eagles handler, Finidi George new 1st assistant coach",
    "summarized_story": "The Nigeria Football Federation (NFF) on Sunday announced the appointment of Mr José Santos Peseiro as the new Head Coach of the Senior Men National Team, Super Eagles.\nThe appointment is with immediate effect, subject to the signing of agreed terms between the NFF and Mr Peseiro, an official statement on Sunday evening by the NFF has revealed.\nAccording to the country’s football body, “José Vitor dos Santos Peseiro, 62, last month, is a Portuguese who played as a striker in his days and has wide and varied experience coaching top Clubs and National Teams across four different continents, namely Europe, Asia, Africa and South America.\n“The NFF also announced that former Nigeria international forward, Finidi George will now be 1st Assistant to Peseiro, with Salisu Yusuf now to be 2nd Assistant as well as Head Coach of the CHAN and U23 National Teams.\n“Usman Abdallah is 3rd Assistant while Eboboritse Uwejamomere will be the Match Analyst and another former Nigeria international, Ike Shorounmu will be the Goalkeepers’ Trainer.”Share this: TwitterFacebook"
  },
  {
    "headline": "Kaduna train attack: Terrorists release abducted pregnant woman",
    "summarized_story": "Terrorists suspected to be Ansaru group have released a pregnant woman who was abducted alongside others from the Kaduna -Abuja train last month.\nThe woman, one of the two pregnant women kidnapped from the train passengers, was released on compassionate ground, Blueprint has learnt.\nThe woman had said the terrorists were taking good care of them, noting that they were well fed.\nShe added that the terrorists also took good care of their medication.\nBlueprint recall that the released pregnant woman was abducted along with the others on the 28th March, 2022."
  },
  {
    "headline": "TCN reconstructs vandalized transmission tower in Uyo",
    "summarized_story": "… Set to energise transmission line soonBy Onu OkorieTransmission Company of Nigeria TCN has disclossed that the reconstruction works on the vandalized transmission Tower Number 104 on Odukpani – Ikot Ekpene 330kV double-circuit transmission line in Akwa Ibom has been completed, while work is ongoing to fortify other towers minimally vandalized along the same line route, to enable the restringing and tensioning of the 330kV DC transmission line, before it is energized.\nThe Executive Director, Transmission Service Provider (TSP) at TCN, Engr.\nAdewumi, who briefed newsmen at the site, said the tower has been reconstructed and work has reached an advanced stage after three weeks, even with difficulties posed by the terrain.\nAdewumi appealed to the public to help TCN in the fight against the vandalism of power infrastructure, saying that such acts are detrimental to Nigerians and the expansion of power infrastructure in Nigeria.\nHe also assured residents of Cross River State and parts of Akwa Ibom State that the company was fast-tracking the completion and restoration process."
  },
  {
    "headline": "Mastercard Foundation subsidized loans will break barriers to MSMEs productivity in Nigeria – Mrs Edu",
    "summarized_story": "By Onu OkorieThe Managing Director, First City Monument Bank FCMB, Yemisi Edun has described the Mastercard Foundation subsidized loans to 100,000 Micro, Small, and Medium Enterprises MSMEs as a purpose-driven intervention that would further help break the barriers that limit MSMEs’ productivity and overall success in Nigeria.\nThe program, which is part of the Mastercard Foundation’s Young Africa Works strategy in Nigeria, aims to sustainably move Nigerian youth out of poverty.\nThe remaining 30 percent will be deployed to meet the funding needs of youth-owned enterprises and businesses run by vulnerable members within Nigeria.\nShe said, “The past few years have been very challenging for individuals, households, and businesses in Nigeria.\n“We are proud to partner with the Mastercard Foundation to rebuild businesses, drive recovery, and stimulate economic growth by providing the much-needed support to Nigerians to engage in productive activities."
  },
  {
    "headline": "ABCON unveils roadmap on ‘save naira’ campaign",
    "summarized_story": "By Kehinde Ibrahim, LagosAssociation of Bureaux De Change Operators of Nigeria (ABCON) has developed a roadmap campaign plan needed to save the naira from further decline and enhance exchange rate stability.\nThe ABCON National Executive Council said the move to save the naira was agreed by the body at the conclusion of its meeting in Lagos, where it unveiled strategies for save the local currency, bridge the exchange rate gaps and curb volatility in the forex market.\nThe naira exchanges at N596 to dollar at the parallel market and N415.83 to dollar at the official market creating a rate gap of N180.17 per dollar.\nGwadabe insisted that now is the time to break the current industry monopoly that puts the remittances market in the hands of few players depriving others from tapping into the plan.\nThe ABCON can also be recognized as self-regulatory organization to enable it operate effectively and sanction erring members,” he stated."
  },
  {
    "headline": "Nigeria set to become destination for medical tourism, reverse brain drain – Mohammed",
    "summarized_story": "By Palma IleyeMinister of Information and Culture, Alhaji Lai Mohammed, has said that with the establishment of world class healthcare facilities in Nigeria, the country was set to become a destination for medical tourism, in addition to reversing the brain drain in the health sector.\nMohammed who spoke after a media tour of Duchess International Hospital in Lagos, said the world class healthcare facilities springing up in Nigeria will also curb medical tourism abroad, conserve foreign reserves and create jobs.\n“Today, we are here at the Duchess International Hospital.\nThe Minister said the Federal Government, through the Central Bank of Nigeria and the Bank of Industry, provided financial support for Duchess International Hospital, as part of its intervention in the health sector.\n“With that, we can conserve our foreign reserves, earn foreign exchange for the country, create jobs, reverse brain drain, become a destination for medical tourists and also ensure affordable and standard healthcare for Nigerians,” he said."
  },
  {
    "headline": "Halo financial services launches into Nigeria Fintech space",
    "summarized_story": "By Kehinde Ibrahim, LagosHALO Financial Services Ltd, a fintech start-up has launched with an innovative approach to help Nigerians manage and grow their money.\nSpeaking at a media round table to introduce the company, the Chief Executive Officer and co-founder, Chidimma Onyeokoro disclosed that Halo enables communities to provide financial services to their members.\nCommunity members are able to leverage the strength of their union for better financial returns.\nBy focusing on communities, Halo will be able to scale faster.\nThis allows us to offer a full spectrum of financial services from basic banking to sophisticated investments."
  },
  {
    "headline": "ASUU Strike: FG Working On A Funding Structure For Public Universities – Nwajiuba",
    "summarized_story": "﻿The Federal Government is working on a funding structure for public universities in the country as part of moves to tackle the incessant strikes by lecturers in these institutions.\nThis is according to the former Minister of State for Education Chukwuemeka Nwajiuba who noted that the government’s funding of public universities is unsustainable.\n“Because you see, there are only 50 of these federal universities and there are 200 others.\n“I know that even if it is not implemented now, the universities autonomy law needs to be reactivated.”The former minister’s comment adds to the debates about funding for public universities in the country.\nLecturers in these institutions have been on strike since February 14, pushing their demands, which include better funding for universities."
  },
  {
    "headline": "Kaduna Train Attack: Terrorists Release Kidnapped Pregnant Woman",
    "summarized_story": "A pregnant woman who was one of the abducted passengers in the Kaduna train attack of March 28, has been released by the terrorists.\nA member of the Concerned Relatives of Abducted Persons, Sani Musa confirmed the development to Channels Television on Sunday.\nThe pregnant woman, Thamina Mahmood, was said to have been released in compassionate spirit on Saturday afternoon after she and 61 others had spent 45 days in captivity.\nShortly after her release, the freed lady was seen in a viral video, where she appealed to the Federal Government to negotiate with the terrorists.\nAccording to her, the appeal has become necessary because of the uncertainty surrounding the plight of other kidnap victims who are still in the custody of the terrorists inside the forest."
  },
  {
    "headline": "NFF Names Jose Peseiro As New Super Eagles Head Coach",
    "summarized_story": "Jose Peseiro has been named as the Super Eagles head coach, months after his initial deal with Nigeria Football Federation (NFF) collapsed.\nSalisu Yusuf will now serve as the 2nd Assistant as well as head coach of the CHAN and U-23 national teams.\nAside from these, he worked as head coach of the Saudi Arabian and Venezuelan national teams.\nREAD ALSO: An Ex-Madrid Assistant Coach… Six Things To Know About New Eagles ManagerAnother ‘Opportunity To Work’Before Sunday’s confirmation, the Glass House had appointed Peseiro as the head coach of the three-time African champions following Gernot Rohr’s dismissal in December.\nIn the wake of the decision, Peseiro refuted claims that he was confirmed as the Nigerian head coach."
  },
  {
    "headline": "Deborah Samuel: Northern Governors Condemn Sokoto Killing, Appeal For Calm",
    "summarized_story": "The Northern Governors Forum (NGF) has condemned the killing of Deborah Samuel, a student of Shehu Shagari College of Education Sokoto who was killed on allegations of blasphemy.\nChairman of the forum Simon Lalong and Governor of Plateau State in a statement expressed the governors’ concern about the development which was clearly an extra-judicial measure of addressing perceived infractions.\nCitizens of the region and Nigerians were also called upon to show love, tolerance, and respect for one another irrespective of faith, ethnicity, or other affiliations.\nDeborah, a second-year student of the Shehu Shagari College of Education in Sokoto State, was killed on Thursday following an allegation that she had blasphemed the prophet of Islam.\nHer death has sparked outrage from various individuals and groups across the country, including the Christian community who demanded that her killers be brought to justice."
  },
  {
    "headline": "2023: Kwankwaso Will Take Nigeria To The ‘Promised Land’ – Buba Galadima – Channels Television",
    "summarized_story": "Ahead of the 2023 general elections, a former ally of President Muhammadu Buhari, Buba Galadima, has backed ex-Kano State Governor, Rabiu Kwankwaso for the presidency, saying he will take Nigeria to the promised land.\nSpeaking during an interview on Channels Television’s Politics Today, Galadima said the presidential candidate of the New Nigeria Peoples Party (NNPP) is the best suited for the post.\n“We have done everything under the sun to make it (things in Nigeria) work, it didn’t work.\nNow we have somebody with the pedigree of performance, somebody with the foresight that can take us to the promised land.\nREAD ALSO: Akwa Ibom Govt Denies Udom Blocking Atiku’s Meeting With PDP Delegates“There are only two political parties in Nigeria today: NNPP and the rest."
  },
  {
    "headline": "Finland to apply for Nato membership",
    "summarized_story": "Finland government announced on Sunday that the country will apply for Nato membership.\nMr Niinisto called it a “historic day” for Finland and declared that “a new era is beginning.”Sweden is expected to decide whether or not to apply to Nato in the coming days.\nNato Deputy Secretary General Mircea Geoana stated on Sunday that “Finland and Sweden are already the military alliance’s closest partners.” While Nato Secretary General Jens Stoltenberg recovered from Covid-19, he presided over meetings in Berlin.\nhttps://www.tvcnews.tv/2022/05/uk-set-to-relocate-50-migrants-to-rwanda/Mr Niinisto called it a “historic day” for Finland and declared that “a new era is beginning.”Sweden is expected to decide whether or not to apply to Nato in the coming days.\nNato Deputy Secretary General Mircea Geoana stated on Sunday that “Finland and Sweden are already the military alliance’s closest partners.” While Nato Secretary General Jens Stoltenberg recovered from Covid-19, he presided over meetings in Berlin."
  },
  {
    "headline": "APC inaugurates screening committee ahead party's primaries",
    "summarized_story": "The National Working Committee of the All Progressives Congress has inaugurated its screening committee ahead of the party’s primaries scheduled for 30th of May.The party set up various panels for its two-day screening of 1,693 aspirants.\nThe development was disclosed by the APC National Organising Secretary, Sulaiman Argungu, shortly after the inauguration of chairmen and secretaries of the screening committees.\nHe also disclosed that the party has a set of guidelines in the aspirant assessment and verification forms that will be given to each committee for the screening.\nThe Electoral umpire also says it is ready to monitor political parties’ primary election ahead of the next election and dateline is non-Negotiable.\nHe stated that candidates should send UTMERESULT to 55019 using the same phone number used to register for the examination."
  },
  {
    "headline": "APC Screening for NASS, Governorship candidates Starts in Abuja -",
    "summarized_story": "The All Progressives Congress.APC, has inaugurated the screening committees for its House of Representatives, Senate and Governorship aspirants.\nThe committees were inagurated on Saturday and have since commnced work.https://www.tvcnews.tv/purplegold/post.php?post=197134&action=edit#The screening exercise for each of the three committees has since commenced at various designated centres in Abuja.\nA statement by the National Organising Secretary of the APC, Sulaiman Muhammad Argungu, in Abuja indicated Chairmen and Secretaries of the committees will be inaugurated by noon while the screening exercise will begin immediately at various centres.\nAspirants for the House of Representatives will be screened at Zeus Paradise Hotel, Mabushi, in Abuja while Senatorial and governorship aspirants will have their exercise carried out at Fraser Suites, within the Central Business District, Abuja.\nThe publication of the screening exercise is expected to be released on Sunday."
  },
  {
    "headline": "Why I deleted tweet condemning murder of Sokoto student",
    "summarized_story": "The People’s Democratic Party’s Presidential Hopeful, and former Vice President, Atiku Abubakar says the directive to pull down the reaction to the killing of Sokoto College student, Deborah Samuel should not be misconstrued for condoning religious intolerance.\nThe former vice president said he has been loud on religious issues that tend to divide NigeriansMr. Abubakar spoke, this Friday when he visited Governor Godwin Obaseki in continuation of his effort to woo delegates ahead of the PDP presidential primaries"
  },
  {
    "headline": "Femi Falana: Representation In One’s Own Case By Proxy Is Unacceptable",
    "summarized_story": "Femi Falana, SAN discusses the description of the Appeal Court of Section 84(12) as unconstitutional."
  },
  {
    "headline": "Coronation Art Gallery Opens In Lagos Showcasing Aigboje Aig-Imoukhuede’s Personal Collection",
    "summarized_story": "1 of 6 - +The beauty of Lagos’ arts and culture scene has long been vivid and it’s just gotten even clearer with the opening of Coronation Art Gallery.\nUnlike traditional galleries, the Curated Viewing Experience at the gallery is showcasing dozens of pieces from Aigboje Aig-Imoukhuede’s personal collection.\nThe banker, investor and philanthropist is on a mission to democratise art, making it accessible to anyone who would like the opportunity while also carving a route that will lead to more African art and artists reaching the global stage.\nArise Correspondent, Adefemi Akinsanya @femmefemi was in attendance and sent this report."
  },
  {
    "headline": "Elon Musk Says Twitter Legal Team Told Him He Violated an NDA",
    "summarized_story": "Elon Musk on Saturday tweeted that Twitter Inc’s legal team accused him of violating a nondisclosure agreement by revealing that the sample size for the social media platform’s checks on automated users was 100.\n“Twitter legal just called to complain that I violated their NDA by revealing the bot check sample size is 100!” tweeted Musk, chief executive of electric car maker Tesla Inc.Musk on Friday tweeted that his $44-billion cash deal to take the company private was “temporarily on hold” while he awaited data on the proportion of its fake accounts.\nread moreHe said his team would test “a random sample of 100 followers” on Twitter to identify the bots.\nHis response to a question prompted Twitter’s accusation.\nHe later said that “There is some chance it might be over 90% of daily active users.”"
  },
  {
    "headline": "Buffalo Shooting: Ten Dead in Suspected Race Attack at New York State Store",
    "summarized_story": "An 18-year-old white man has shot dead 10 people in a black neighbourhood of New York state in what authorities are calling a racially motivated attack.\nThe man, named as Payton Gendron in court papers, was arrested after a stand-off at the scene – a supermarket in the city of Buffalo.\nThe suspect is believed to have driven for some 200 miles to reach the predominantly black area of the city.\nThirteen people were shot in total and the majority of the victims were black, Buffalo Police Commissioner Joseph Gramaglia said.\nHe said the suspect surrendered his weapon after a tense stand-off and was taken into custody."
  },
  {
    "headline": "Buhari Congratulates New UAE President Sheikh Zayed, Says Nigeria Expects Improved Relations",
    "summarized_story": "RelatedStories No Content AvailableNigeria’s President Muhammadu Buhari has congratulated the new President of the United Arab Emirates, Sheikh Mohamed bin Zayed, who was elected President by a Federal Supreme Council to succeed his half-brother, the late Sheikh Khalifa Bin Zayed.\n“Your predecessor made a mark in the impressive transformation of the UAE, making it a vast business and tourist attraction, building infrastructure, and creating one of the best living standards in the world.\nI’m confident that you’re going to build on this great legacy created by your half-brother.”According to the President: “Nigeria looks forward to greater cooperation with the UAE which has tremendously helped Nigeria in tracking down illegal assets and tracing terrorist funds”He added that “Dubai is a reliable partner for the progress of Nigeria and I’m confident that under the new leader, such cooperation will grow bigger and stronger.\n“I wish President Sheikh Mohammed bin Zayed God’s guidance and wisdom in the discharge of this enormous responsibility,” President Buhari prayed.\nDeji Elumoye in Abuja"
  }
]