[
  {
    "headline": "Kano pastor’s murder: NIREC demands arrest of killer fundamentalists",
    "summarized_story": "The Nigeria Inter-Religious Council on Thursday condemned the killing of a former Chairman of the Christian Association of Nigeria in the Sumaila Local Government Area of Kano State, Pastor Shuaibu Yohanna, by suspected fundamentalists in the Masu community.\nProf. Cornelius Omonokhua, titled, ‘Press release on the murder of Pastor Shuaibu Yohanna,’ said the deceased pastored the New Life for All Nations Church in Masu for about 10 years.\n“NIREC therefore condoles with the family of Pastor Shuaibu Yohanna and prays that God grant him eternal repose.\n“NIREC appeals to the Kano State Command of the Nigeria Police Force to honestly do the needful.\n“NIREC calls on the citizens of Kano and Nigeria to continue to strive for peaceful coexistence in the various communities of the nation.”Copyright PUNCH."
  },
  {
    "headline": "S’East govs, elite can’t decide Igbo’s fate, IPOB replies Umahi",
    "summarized_story": "The governor had also said counter-secessionist groups would arise if IPOB did not stop killings in the zone.\nBut IPOB, in a statement by its Director of Media and Publicity, Emma Powerful, on Thursday lashed out at the governors.\nThe statement read, “We wish to remind South-East governors that their disgraceful plan of creating another group to checkmate IPOB is dead on arrival.\n“But we want to remind South-East governors and the Igbo political elite that they represent less than one percent of the Biafran population.\n“It is unfortunate that the South-East governors are the ones contemplating to create anarchy in the region."
  },
  {
    "headline": "Evans Akere: Innovating African Traditional Wear",
    "summarized_story": "Words By – Yemisi SuleimanSince launching his fashion line, Creative Director and CEO of Vanskere, Evans Akere, has become one of the major brands saddled with the responsibility of making African traditional wear acceptable worldwide.\nHow did the VANSKERE brand come to be and how has the brand evolved over the years?\nThe brand has evolved over the years from a basic fashion brand, to a Luxury fashion brand, with emphasis on modern African traditional wear.\nThe Vanskere brand is fun, but there is also a classic appeal to your apparel.\nYou have worked in the fashion industry for quite some years now, what is the best lesson you have learned along the way?"
  },
  {
    "headline": "Evans Akere: Innovating African Traditional Wear",
    "summarized_story": "Words By – Yemisi SuleimanSince launching his fashion line, Creative Director and CEO of Vanskere, Evans Akere, has become one of the major brands saddled with the responsibility of making African traditional wear acceptable worldwide.\nHow did the VANSKERE brand come to be and how has the brand evolved over the years?\nThe brand has evolved over the years from a basic fashion brand, to a Luxury fashion brand, with emphasis on modern African traditional wear.\nThe Vanskere brand is fun, but there is also a classic appeal to your apparel.\nYou have worked in the fashion industry for quite some years now, what is the best lesson you have learned along the way?"
  },
  {
    "headline": "Abike Dabiri-Erewa: On Nigeria @ 61",
    "summarized_story": "So, yes, Nigeria is not where it should be at 61, but gradually, we will get there.\nI don’t know what you mean by the situation in Nigeria, what we encourage is, you can migrate.\nI don’t think women in the parliament are less vocal.\nSo I don’t think women are less vocal, they are less in number.\nI dream of a free, fair, equitable Nigeria, a Nigeria where poverty will be absolutely and totally reduced, a Nigeria where everybody can live comfortably, where the rich will not be getting richer and the poor getting poorer and a Nigeria where corruption will be totally gone."
  },
  {
    "headline": "Abike Dabiri-Erewa: On Nigeria @ 61",
    "summarized_story": "So, yes, Nigeria is not where it should be at 61, but gradually, we will get there.\nI don’t know what you mean by the situation in Nigeria, what we encourage is, you can migrate.\nI don’t think women in the parliament are less vocal.\nSo I don’t think women are less vocal, they are less in number.\nI dream of a free, fair, equitable Nigeria, a Nigeria where poverty will be absolutely and totally reduced, a Nigeria where everybody can live comfortably, where the rich will not be getting richer and the poor getting poorer and a Nigeria where corruption will be totally gone."
  },
  {
    "headline": "Mmekidmfon Umanah…Building a healthcare bridge between Europe and West Africa",
    "summarized_story": "By Yemisi SuleimanWith Africa’s healthcare system on the brink of collapse, Nigerian born UK based Mmekidmfon Umanah, is on a mission to strengthen the West African frontline and primary healthcare system via his project company; Aimcare Health Limited a product sourcing company that is building the healthcare bridge between Europe and West Africa by connecting European health startups to the unique market opportunities in West Africa.\nThe truth is that the African healthcare system is simply broken, and this cost me my mother’s life in 2013.\nAimcare Health Limited’s mission is to strengthen the West African frontline and primary healthcare system by providing pharmacies, primary healthcare centres, patent medicine stores and hospitals with the most innovative, user-friendly, and affordable products in the global market.\nAt what point did the Dot Glasses project come in and what informed it?\nTell us your achievement with DOT glasses project in Nigeria?"
  },
  {
    "headline": "Lawyer gives update on Nnamdi Kanu’s N5 billion suit against FG",
    "summarized_story": "The fundamental rights suit filed by Mazi Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra, IPOB, at the Abia State High Court could not hold today.\nThe counsel to Kanu, Aloy Ejimakor, disclosed this in a press release he personally signed and forwarded to DAILY POST on Thursday.\nHe also demanded N5 billion from the government over alleged gross violation of Kanu’s fundamental rights.\nThe reason was that the Abia court vacation was due to end on September 30; and according to the Judge, there was not enough time for the vacation court to conclude the case within the vacation period.\nThe case was therefore adjourned to October 7, 2021 (Today) for assignment to a Judge that will hear it under the regular court calendar."
  },
  {
    "headline": "We arrested Chiwetalu Agu for inciting Nigerians to join IPOB – Army",
    "summarized_story": "The Nigerian Army has confirmed the arrest of popular Nollywood actor, Chiwetalu Agu in Anambra State.\nDAILY POST had reported that Chiwetalu Agu was manhanled and molested by the Nigerian Army troops for wearing Biafra clothing.\nHowever, a statement by Onyema Nwachukwu, issued Brigadier General Director Army Public Relations said Agu was arrested while inciting members of the public and soliciting for support for the proscribed Indegenous People of Biafra (IPOB).\nNwachuwku said he was picked up for questioning while inciting members of the public to join the proscribed group.\nNwachuwkwu stressed that the Army would not allow IPOB and its sponsors to hold the region captive and allow the security situation to degenerate."
  },
  {
    "headline": "Passengers stranded as transport companies withdraw services in Ebonyi",
    "summarized_story": "Passengers were on Thursday stranded in Abakaliki, Ebonyi State capital following the withdrawal of services by transport companies.\nAccording to Inyaba, “From today, Thursday, October 7, 2021, no commercial vehicle shall go to Ebonyi or leave the state.\n“The government of Ebonyi State has asked us to leave the state and we have no choice but leave the state for them henceforth.\n“We have directed members of all transport unions in other states of the country to note the directive to boycott Ebonyi State from Thursday, and comply accordingly.\n“Do not load passengers from anywhere to Ebonyi State, and members who are inside Ebonyi State must not load passengers out of the state, no matter the circumstances,” he warned."
  },
  {
    "headline": "Bandits massacre 18 Nigerians in Zamfara as FG withholds list of terror financiers",
    "summarized_story": "Bandits in Zamfara State are still wreaking havoc despite the ongoing Nigerian military large-scale operation.\nThe people of the state are enduring the shutdown of network services the federal government ordered over a month ago.\nYet, the Nigerian government is insisting that the names of terror financiers will not be made public.\nIn his reaction, Bishop Matthew Hassan Kukah, head of Catholic Diocese of Sokoto, dared President Muhammadu Buhari to reveal the names of Boko Haram sponsors.\n“The federal government has told us it is not ready to publicise the names of those funding Boko Haram."
  },
  {
    "headline": "Bandits from neighbouring states terrorising Anambra – Obiano tells Buhari",
    "summarized_story": "Governor Willie Obiano of Anambra State, on Thursday, held a closed-door meeting with President Muhammadu Buhari at the Presidential Villa, Abuja.\nObiano, who updated Buhari on security challenges facing the state, said bandits from neigbouring states are responsible for the killings and disruption of public peace in Anambra.\n“These invaders from outside Anambra state, from the neighbouring towns, we are going to deal with them.\nThe governor said he also used the opportunity of his visit to Abuja to brief and solicit support from some security agencies towards addressing security challenges in Anambra.\n“We’ll overwhelm and conquer all these miscreants that came from other states nearby to come and harass Anambra people."
  },
  {
    "headline": "IPOB dares S’East govs on counter group’s dream",
    "summarized_story": "“We wish to remind South-East governors that their disgraceful plan of creating another group to checkmate IPOB is dead on arrival.\nThe people have lost confidence in them and just as their imaginary Ebubeagu security outfit, no such faceless group can survive in South East.\nBut we want to remind South East governors and the Igbo political elite that they represent less than one per cent of the Biafran population.\n“It is unfortunate that the South East governors are the ones contemplating to create anarchy in the region.\nNow it is obvious that South-East governors in collaboration with the wicked Nigeria security agents are behind the fake groups wrecking havoc across South East in their desperation to implicate IPOB."
  },
  {
    "headline": "UK changes travel rules for fully vaccinated travellers from Nigeria",
    "summarized_story": "From Aidoghie Paulinus, AbujaRespite, yesterday, came the way of Nigerian travellers as the United Kingdom (UK) changed travel rules for fully vaccinated travellers from Nigeria.\nThe British High Commission, Abuja, disclosed the development in a statement.\n“This policy applies to those fully vaccinated with AstraZeneca (including Covidshield), Pfizer, Moderna and Janssen (Johnson and Johnson).”“Fully vaccinated means that you have had a complete course of an approved vaccine at least 14 days before you arrive in England.\n“The UK remains committed to opening up international travel and enabling those who wish to enter the UK, to do so safely.\nI would encourage all eligible people to get vaccinated.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Money Laundering: Maina’s son, Faisal, bags 14 years jail term",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Federal High Court has convicted and sentenced the son of former Chairman of the defunct Pension Reform Taskforce Team, Abdulrasheed Maina, Faisal, to 14 years imprisonment.\nWhile the court sentenced the Defendant to five years in count 1 and 3 of the charge, he was sentenced to 14 years on count 2 of the charge.\nThe court held that the it found him guilty on all the three-counts of money laundering offences, said the sentence would run concurrently, starting from Thursday.\nIt alleged that Maina’s son had sometimes between 2013 and 2019, received the sum of N58.11million, being proceeds of a corrupt act by his father.\nThe EFCC had ealier told the court that it got intelligence report that Faisal had escaped to the United States of America."
  },
  {
    "headline": "Heavy security at National Assembly as Buhari presents 2022 budget",
    "summarized_story": "Heavy security presence have been thrown in and around the National Assembly Complex in Abuja as the President, Major General Muhammadu Buhari (retd.\n), is billed to lay the 2022 Appropriation Bill before a joint session of the National Assembly at 12noon.\nBuhari had on Tuesday written to both the Senate and the House of Representatives to notify the chambers of his intention to present the Federal Government budget on Thursday.\nBy Wednesday, the premises had begun to wear a new look especially along the route the President takes from the Presidential Villa to the White House section of the complex, which houses the chambers.\nThe ceremony is to take place at the House chamber, which has a bigger capacity to contain the 469 members of the parliament, members of the Federal Executive Committee and more."
  },
  {
    "headline": "FG threatens to declare state of emergency in Anambra",
    "summarized_story": "From Juliana Taiwo-Obalonye, Ndubuisi Orji, Abuja, Stanley Uzoaru, Owerri, Obinna Odogwu, Awka and Geoffrey Anyanwu, EnuguThe Federal Government, yesterday, threatened to invoke a state of emergency in Anambra State to ensure the sanctity of the November 6 governorship election.\nMeanehile, angry reactions have trailed the state of emergency threat of the Federal Government.\nMalami, however, said the Federal Government had the responsibility to sustain democratic order and would not hesitate to declare a state of emergency if the security situation in the state did not improve to allow peaceful conduct of election.\nAs a government, we have a responsibility to ensure the sustenance of our democratic order, we have a responsibility to provide security to life and properties.\nAnd necessary security in terms of democratic order must certainly prevail for the purpose of this election,” he said."
  },
  {
    "headline": "News in Photographs: Buhari Presents 2022 Budget Proposal, Seeks Speedy Passage by N’Assembly",
    "summarized_story": "Says finance minister will provide further detailsBy Deji Elumoye and Adedayo AkinwalePresident Muhammadu Buhari is about now presenting the 2022 Appropriation Bill to the Joint Session of the National Assembly.\nHe canvassed for an early passage of the budget proposal, the details of which he is reeling out in his budget speech.\nHe told the federal legislators that the Minister of Finance, Budget and National Planning, Zainab Ahmed, will make available further details about the 2022 budget to the legislative arm.\nSee PhotosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Obiano Reports Malami to Buhari, Says President Not for Emergency Rule in Anambra",
    "summarized_story": "By Deji ElumoyeGovernor Willie Obiano of Anambra State, has said the threat of the declaration of a state of emergency ahead of the November 6, 2021 gubernatorial election in his state did not have the backing of President Muhammadu Buhari.\nObiano, who spoke with newmen on Thursday after a closed-door meeting with President Buhari at the State House, Abuja, said he had reported the Attorney-General of the Federation and Minister of Justice; Abubakar Malami, to the President over the matter.\nHe also described the threat as unfortunate, and wondered why Malami had not contemplated the imposition of emergency rule in Northern states where he claimed there had been a lot of killings.\nHis words: “That’s a very unfortunate comment by the Attorney-General Malami.\nI also reported that to the President and this is not in the books of the President because he knows that Anambra has been the safest state in Nigeria for seven years plus”."
  },
  {
    "headline": "Maina’s Son, Faisal, Bags 14 Years Jail Term for Money Laundering",
    "summarized_story": "By Alex EnumahJustice Okon Abang of the Abuja Division of the Federal High Court Thursday handed down a 14-year jail term to Faisal, a son of the former Chairman of the defunct Pension Reformed Task Team (PRTT), Abdulrasheed Maina.\nJustice Abang handed down the sentence after convicting Faisal on all three-count criminal charge preferred against him by the federal government.\nThe Economic and Financial Crimes Commission (EFCC) had in 2019 arraigned Faisal before a Federal High Court on a three-count charge bordering on fraud and money laundering.\nThe court in count two sentenced Faisal to 14 years after finding him guilty on allegations of money laundering.\nThe court however handed down five years jail term each on counts one and three respectively."
  },
  {
    "headline": "Pandora Papers: I Broke No Law, Says Peter Obi",
    "summarized_story": "An online publication, Premium Times, quoting Pandora Papers, had listed Mr. Obi as one of those personalities who clandestinely set up and operated businesses overseas, including in notorious tax and secrecy havens in ways that breached Nigerian laws.\nThe Pandora Papers is a leak of about 12 million documents that revealed hidden wealth and tax avoidance by some of the world’s rich and powerful.\nObi said his understanding was that the allegation bordered more on tax avoidance and non-declaration of some jointly owned assets.\nThe former governor said he did not in any respect whatsoever violate any law before, during and after his stewardship as the Governor of Anambra.\nObi said he also engaged and acted on solicited advice by reputable legal practitioners on whose opinion he relied."
  },
  {
    "headline": "For the Record: Buhari’s 2022 Budget Speech",
    "summarized_story": "It is my great pleasure to be here once again to present the 2022 Federal Budget Proposals to this distinguished Joint Session of the National Assembly.\nThe 2022 Budget will be the last full year budget to be implemented by this administration.\nThe 2022 budget is also the first in our history, where MDAs were clearly advised on gender responsive budgeting.\nTotal federally distributable revenue is estimated at 12.72 trillion Naira in 2022 while total revenue available to fund the 2022 Federal Budget is estimated at 10.13 trillion Naira.\nWe plan to finance the deficit mainly by new borrowings totalling 5.01 trillion Naira, 90.73 billion Naira from Privatization Proceeds and 1.16 trillion Naira drawdowns on loans secured for specific development projects."
  },
  {
    "headline": "EXCLUSIVE: Buhari Plans Removal Of Attorney-General Malami, 14 Other Ministers",
    "summarized_story": "A top source in government, however, told the newspaper that Malami has begun moves to truncate the plans.\n“President Buhari is planning to sack 15 Ministers with Malami topping the list.\nBuhari had on September 1 sacked Saleh Mamman, the Minister of Power; and Sabo Nanono, the Minister of Agriculture and Rural Development.\nMalami also bought a house in 2020 worth N150 million in the Gwarimpa area of Abuja.\nObservers say Buhari’s silence is an endorsement of the atrocities of one of his most trusted lieutenants, Malami."
  },
  {
    "headline": "EXCLUSIVE: Buhari Plans Removal Of Attorney-General Malami, 14 Other Ministers",
    "summarized_story": "A top source in government, however, told the newspaper that Malami has begun moves to truncate the plans.\n“President Buhari is planning to sack 15 Ministers with Malami topping the list.\nBuhari had on September 1 sacked Saleh Mamman, the Minister of Power; and Sabo Nanono, the Minister of Agriculture and Rural Development.\nMalami also bought a house in 2020 worth N150 million in the Gwarimpa area of Abuja.\nObservers say Buhari’s silence is an endorsement of the atrocities of one of his most trusted lieutenants, Malami."
  },
  {
    "headline": "How Buhari Visited Ailing Ex-Lagos Governor, Tinubu In Corruption-tainted London Villa Acquired By Osun Governor, Oyetola",
    "summarized_story": "A Mareva injunction is a Court order which freezes the assets of a defendant pending the outcome of a litigation.\nHe and Eludoyin, in 2003, incorporated another shelf company in the British Virgin Islands, Global Investments Offshore Limited.\nHowever in June 2018, months before he became governor, he withdrew from the company and made his children – Rukayat Oyetola, Hafiz Oyetola, and Rasheedat Oyetola directors.\nHe also transferred his shares in Global Investments Offshore Limited to Mr Eludoyin and his son Haifz in June 2018.\nAlso unclear is why Tinubu, who apparently wants to become Nigeria`s president, would agree to stay at the controversial property."
  },
  {
    "headline": "How Buhari Visited Ailing Ex-Lagos Governor, Tinubu In Corruption-tainted London Villa Acquired By Osun Governor, Oyetola",
    "summarized_story": "A Mareva injunction is a Court order which freezes the assets of a defendant pending the outcome of a litigation.\nHe and Eludoyin, in 2003, incorporated another shelf company in the British Virgin Islands, Global Investments Offshore Limited.\nHowever in June 2018, months before he became governor, he withdrew from the company and made his children – Rukayat Oyetola, Hafiz Oyetola, and Rasheedat Oyetola directors.\nHe also transferred his shares in Global Investments Offshore Limited to Mr Eludoyin and his son Haifz in June 2018.\nAlso unclear is why Tinubu, who apparently wants to become Nigeria`s president, would agree to stay at the controversial property."
  },
  {
    "headline": "Abia State Yet To Assign Nnamdi Kanu's N5billion Suit Against Nigerian Government To Court – Lawyer Laments",
    "summarized_story": "The IPOB leader's lawyer said he discovered on Thursday that the case had not yet been assigned to a court.\nHowever, in a statement on Thursday, titled, “Re: Mazi Nnamdi Kanu - We are disappointed that Kanu’s Fundamental Rights case did not hold today in Umuahia, Abia State,” Ejimakor said the case was supposed to be treated urgently.\n\"The reason was that the Abia court vacation was due to end on 30th September; and according to the Judge, there’s was not enough time for the vacation court to conclude the case within the vacation period.\nIt is my hope that, going forward, there won’t be any further delay in hearing the case.\"\nResponding to enquiries in Umuahia, Ejimakor had said, “Today, I secured an Order from the High Court of Abia State to serve by substituted means an Application for enforcement of the Fundamental Rights of Mazi Nnamdi Kanu, which I recently brought before the High Court of Abia State."
  },
  {
    "headline": "Police: 187 abductees rescued in Zamfara -- in one day",
    "summarized_story": "The Zamfara police command says security operatives, in a joint operation, rescued 187 persons kidnapped from several communities across the state.\nAccording to him, the abducted persons included men, women and children, and they were handed over to the state government.\nThe abductees were said to have spent weeks in captivity before they regained their freedom.\nAdvertisementElkanah added that security agencies will continue to put in their best to ensure improved safety in the state.\nResponding while receiving the rescued victims, Bello Matawalle, Zamfara governor, commended security agencies for their efforts."
  },
  {
    "headline": "Police: 187 abductees rescued in Zamfara -- in one day",
    "summarized_story": "The Zamfara police command says security operatives, in a joint operation, rescued 187 persons kidnapped from several communities across the state.\nAccording to him, the abducted persons included men, women and children, and they were handed over to the state government.\nThe abductees were said to have spent weeks in captivity before they regained their freedom.\nAdvertisementElkanah added that security agencies will continue to put in their best to ensure improved safety in the state.\nResponding while receiving the rescued victims, Bello Matawalle, Zamfara governor, commended security agencies for their efforts."
  },
  {
    "headline": "2023 presidency: Sanwo-Olu pledges support as pro-Tinubu group kicks off campaign",
    "summarized_story": "AdvertisementThe governor spoke on Thursday at the launch of the Southwest Agenda 2023 (SWAGA ‘23), a campaign group championing the candidacy of Tinubu for the 2023 presidency.\nSanwo-Olu said the “extraordinary qualities” of the former Lagos governor sets him apart from his contemporaries in the Nigerian political scene.\nAdvertisement“Asiwaju Tinubu’s story has been a legend in vision, passion and action.\nAdvertisement“The SWAGA we are launching in Lagos today is a demonstration of Tinubu’s enduring political principles and strong vision,” he said.\nWhat we are witnessing today is the action from the vision and passion; this is what SWAGA represents."
  },
  {
    "headline": "2023 presidency: Sanwo-Olu pledges support as pro-Tinubu group kicks off campaign",
    "summarized_story": "AdvertisementThe governor spoke on Thursday at the launch of the Southwest Agenda 2023 (SWAGA ‘23), a campaign group championing the candidacy of Tinubu for the 2023 presidency.\nSanwo-Olu said the “extraordinary qualities” of the former Lagos governor sets him apart from his contemporaries in the Nigerian political scene.\nAdvertisement“Asiwaju Tinubu’s story has been a legend in vision, passion and action.\nAdvertisement“The SWAGA we are launching in Lagos today is a demonstration of Tinubu’s enduring political principles and strong vision,” he said.\nWhat we are witnessing today is the action from the vision and passion; this is what SWAGA represents."
  },
  {
    "headline": "‘It’s to avert crisis’ -- Lai backs Malami on emergency rule in Anambra",
    "summarized_story": "Lai Mohammed, minister of information and culture, has supported the position of Abubakar Malami, attorney-general of federation (AGF), on the possibility of declaring a state of emergency in Anambra.\nAdvertisementThere has been a recent increase in attacks in Anambra, leading to killings and destruction of property.\nSpeaking with reporters on Wednesday, Malami said declaring a state of emergency would ensure that the November 6 governorship election in the state takes place.\nThis position has, however, been greeted with criticism, and the Anambra government has alleged that it is a ploy to destabilise the state.\nAdvertisementIn a chat with NAN on Thursday, Mohammed said Malami’s position is an effort to avert a “constitutional crisis” in the state."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\nKemi wants to continue supporting her mother and sister, not only by clearing their bills but also helping them to be independent of her."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "Google launches $50m equity-based investment fund for African startups",
    "summarized_story": "At the first-ever Google for Africa event, held virtually on Wednesday, Google announced the launch of a 50 million-dollar Africa Investment Fund, through which it plans to invest in African startups.\nSelected companies will be provided with access to Google’s employees, network and technologies, to help them build products.\nTargeted at early- to growth-stage startups, the new investment fund is equity-based, marking a significant shift in Google’s approach to investing in African startups.\nMeanwhile, the Google Black Founders Fund will invest in black-led startups in Africa by providing cash awards and hands-on support.\nGet the best African tech newsletters in your inbox“In the last year, we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Sub-Saharan Africa, said in an official statement."
  },
  {
    "headline": "Pandora Papers: Kenya’s first family implicated in biggest-ever offshore data leak",
    "summarized_story": "Seven members of the Kenyatta family, including the president, are revealed, through the Pandora Papers, as being variously connected to more than 10 offshore companies and foundations.\nThe Kenyattas’ offshore investments include a company with stocks and bonds worth $30 million.\nLargest-ever leakThe Pandora Papers represent the latest and largest, by data volume, in a series of major leaks of financial data about the offshore world over the last five years.\nIn 2016, the Panama Papers, which consisted of 2.6 terabytes of data, leaked from the law firm, Mossack Fonseca.\nMore than 100 billionaires feature in the leaked data, as well as celebrities, rock stars, and business leaders."
  },
  {
    "headline": "UK changes travel rules for fully vaccinated travellers from Nigeria",
    "summarized_story": "From Monday, 11 October 2021, fully vaccinated travellers from Nigeria to the United Kingdom (UK) will be able to come to England without needing to provide a pre-departure test, undertake a day 8 test or self-isolate for 10 days, although will still need to book and pay for a day 2 test.\nThis policy applies to those fully vaccinated with AstraZeneca (including Covidshield), Pfizer, Moderna and Janssen (Johnson and Johnson).\nRead Also: Snag for travellers as UK blacklists Nigeria’s Covid-19 vaccine certificateThose who are not a fully vaccinated traveller from Nigeria to England, must take a pre-departure COVID-19 test; to be taken in the three days before travel.\nTo make this happen, we have been working closely with Nigeria’s National Primary Health Care Development Agency on recognising Nigeria’s vaccine certification, which we have now done.\n“The UK remains committed to opening up international travel and enabling those who wish to enter the UK, to do so safely."
  },
  {
    "headline": "Buhari’s 2022 budget proposal in 5 insightful numbers",
    "summarized_story": "President Muhammadu Buhari on Thursday presented Nigeria’s 2022 appropriation bill before lawmakers, seeking the approval of the N16.39 trillion budget which has been tagged “Budget of Economic Growth and Sustainability.”The highlights of the budget have been summarised in 5 insightful numbers.\nThis is because if the projected revenue of N10.13 trillion follows the trajectory of previous targets, the country could end up with less.\nN6.83trnNigeria plans to spend as much as N6.83 trillion on non-debt recurrent expenditure in 2022, 41.7 percent of the total budget.\nThat’s the single largest expenditure item in the budget and equates to double of Nigeria’s total revenues in 2020.\nRead also: Budget of Economic Growth and Sustainability – Full speechN3.16 trillionOil revenue is projected at N3.16 trillion in the budget proposal, making it the single largest source of expected revenue for 2022."
  },
  {
    "headline": "Nigeria waits as Moderna decides African country to host its $500m Covid plant",
    "summarized_story": "Moderna which is keeping the short list of five countries to its chest, also listed well educated workforce suitable for a high-tech messenger RNA factory.\nA decision on which African country will host the plant is to be taken in the coming months, says CEO Stephane Bancel.\nModerna plans to talk to those countries and make a decision where to build the African plant in the coming months, Bancel said.\nThe $500m African plant will be capable of producing half a billion messenger RNA vaccine doses a year.\nIt is unclear if Nigeria, Africa’s most populous nation which has lost out in previous deals is in contention to win the battle to host the Moderna plant."
  },
  {
    "headline": "Niger Delta Integrity Group Lauds Appointment of Isiyaku Abdullahi as MD, PPMC – Nigerian Observer",
    "summarized_story": "“We know Isiyaku Abdullahi very well when he served at the Integrated Data Services Limited (IDSL) in Benin City as not just a people’s man but someone with rich knowledge of the Niger Delta, who we trust will ensure uninterrupted supply of petroleum products not just across the 36 states of Nigeria, but the Niger Delta in particular.\nThe Group further stated that “Isiyaku Abdullahi’s performances as Group General Manager in the Finance & Accounts Directorate under the amiable and knowledgeable Oil and Gas Professional Umar Isa Ajiya, the CFO/GED F&A was recognized.\n“We are aware that prior to his appointment as the Managing Director of PPMC, Isiyaku Abdullahi in his capacity as the Group General Manager (GGM) Accounts of the NNPC.\nA consummate team player, Abdullahi is a bundle of joy to work with.\nPresident Muhammadu Buhari in 2019 graciously approved Abdullahi Isiyaku’s appointment as General Manager Finance, NNPC Pensions Ltd and left huge accomplishment there too."
  },
  {
    "headline": "Edo govt begins removal of illegal stalls, eave extensions, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Thursday, commenced another phase of demolition of illegal structures and eave extensions in parts of Benin Metropolis, in line with the government’s urban renewal drive.\nThe exercise focused on the demolition of eave extensions, mostly in business environments, in the Government Reservation Area (GRA).\nOfficials of the Edo State Ministry of Physical Planning and Urban Development began the exercise from the Ugbor axis of Benin City with the removal of illegal structures erected on the right of way.\nThe government bulldozers brought down the illegal structures around Limit Road and Osadebay Road, along Country Home Road, both at the Government Reservation Area, in Benin City.\nIllegal developments on nearby Emmanuel Igodan and adjoining roads were also affected in the exercise, which is expected to continue in the days ahead."
  },
  {
    "headline": "Edo to renovate 1,000 more classrooms, reassures of conducive learning environment for students – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is committed to ensuring a conducive learning environment for pupils and students in the state.\nObaseki, while speaking to journalists in Benin City, said the government plans to renovate 1,000 more classrooms across various schools in the state to ensure that students have the best learning environment.\nIn the next few weeks, we will start another round of refurbishment of another 1,000 classrooms across the state.\nI am confident that by the time that we are leaving office in 2024, we would have qualified teachers in every classroom in Edo State.\nI am assuring you that I will continue to spend Edo State money on its people.”..."
  },
  {
    "headline": "Oredo Ward 4 PDP Chairman, Ihama suspended for anti-party activities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Chairman of the Peoples Democratic Party (PDP) in Ward 4, Oredo Local Government Area, Mr. Friday Enaruna Ihama has been suspended for alleged anti-party activities.\nThe State Assistant Financial Secretary, Mr. Aroko Thomas, said the suspended chairman of the ward, Mr. Friday Enaruna Ihama, allegedly engaged in anti-party activities during and after the September 19 governorship election in 2020.\nHe said Mr. Ihama had since deployed different tactics to halt the progress of the party in the ward.\nMr. Thomas said for close to one year, the suspended chairman has failed to call for a meeting of members from the ward, which is a deliberate effort to destroy the PDP in the Governor’s ward.\nA committee was thereafter set up to investigate the allegations leveled against the suspended chairman."
  },
  {
    "headline": "Patients throng hospitals as striking Nigerian doctors resume",
    "summarized_story": "Regina Ameh had been booked for surgery at the Asokoro District Hospital, Abuja, before the resident doctors commenced the indefinite strike action on 2 August .\nBusinesses boom againMeanwhile, traders and business owners within the location of hospitals’ neighbourhoods have expressed satisfaction that the strike by the resident doctors was over.\nI didn’t know that the resident doctors were so important.\nLasisi Muiden, the hospital’s Chief Medical Director (CMD), also expressed relief with the resumption by the resident doctors.\nThe resident doctors are fully back and we hope it stays that way,” he said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Army explains why it arrested actor Chiwetalu Agu",
    "summarized_story": "OBINNA EZUGWUThe Nigerian Army has said it arrested veteran actor, Mr. Chiwetalu Agu, whom it described as “one Chiwetalu Agu” for inciting members of the public and soliciting support for the proscribed Indigenous People of Biafra (IPOB).\nThe statement read, “Troops of Nigerian Army(NA) have arrested one Chiwetalu Agu while inciting members of the public and soliciting for support for the proscribed Indigenous People of Biafra (IPOB).\nDressed in a very well known attire of the proscribed group, Chiwetalu Agu was picked up for questioning while inciting members of the public to join the proscribed group.\n“Chinwetalu Agu has clearly demonstrated uncharitable disposition to negate peace and security in the region, hence, he is taken into custody for preliminary investigation.\nThey are equally urged to continue to support the security agencies to restore normalcy to the region in furtherance of peace.”"
  },
  {
    "headline": "Abia stakeholders in building industry proffer solutions to building collapses in Nigeria",
    "summarized_story": "PETER OKORE, UmuahiaThe Abia State chapter of Nigerian Institute of Architects (NIA), has affirmed that the greatest hindrance to building well in Nigeria is the neglect of professionals in handling building development schemes.\nThese are contained in an address presented at the 2021 Architects Forum held in Umuahia, Abia capital with the theme: “Towards A Better Urban Future: How To Build Well.”Arc.\nAnagha maintained that building well remains the fulcrum for achieving a better urban future.\nSaid he: “Owing to the peculiar circumstances of our Urban Environment, we carefully chose this theme to continue the discourse commenced last year.\nLast year’s Forum highlighted the peculiar problems facing the built environment in our urban cities, and zeroed on necessary measures to solve the problem of incessant building collapse."
  },
  {
    "headline": "Osun using sports to drive development – Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Adegboyega Oyetola, on Thursday said his administration’s commitment to sports development is aimed at continuously preaching and spreading the messages of love, unity, hope and development in the state.\nThe Governor reaffirmed his Administration’s commitment to ensuring adequate implementation of the State’s Youth Policy Statement designed to promote Youth Education, Youth Empowerment, Youth Entrepreneurship and Youth Engagement.\nThis is even as the Governor declared the year 2021 Osun Sports Festival closed after its finals competition at Osogbo City Stadium.\nIt stems from our avowed and determined quest to transform sports and youth development in our State.\n“I wish to emphasise here that the aim of this project is to institute the State Policy on Sports as enshrined in the State Youth Policy."
  },
  {
    "headline": "Bus drivers shun Ebonyi over attacks by govt backed thugs",
    "summarized_story": "According to him, staff of transport companies in the state capital have been decapitated and numerous vehicles damaged since attacks by government-approved thugs began the onslaught against transporters on Tuesday.\n“From Thursday, October 7, 2021, no commercial vehicle shall go to Ebonyi or leave the state,” he said.\nHe directed members of all transport unions in other states of the country to note the directive to boycott Ebonyi State from Thursday, and comply accordingly.\n“Do not load passengers from anywhere to Ebonyi State, and members who are inside Ebonyi State must not load passengers out of the state, no matter the circumstances,” he restated.\nAttacks on commercial buses in Abakaliki, the Ebonyi state capital intensified yesterday (Wednesday) as armed thugs working for the state government smashed up additional vehicles in apparent determination to force operators out of the capital territory vicinity."
  },
  {
    "headline": "Family, Friends, Others Eulogise Late Capt. Okunbo",
    "summarized_story": "The guests, most of whom were employees from a multitude of companies he owned, all attested to how much of an icon Captain Hosa was.\nThe facility, which eventually became a greenhouse farm, was established in the heart of Edo State.\nSpeaking highly of Captain Hosa’s outstanding efforts and humanitarian impact, The Managing Director of Wells Hosa Farms, Engr.\nFrom the food on our tables to the agricultural opportunities that abound in the country, the presence of Captain Hosa is forever felt.\nThe programme of events continues throughout the week until he is laid to rest in a ceremony in his hometown, Benin City, Edo State, Nigeria, on October 9th, 2021."
  },
  {
    "headline": "Family, Friends, Others Eulogise Late Capt. Okunbo",
    "summarized_story": "The guests, most of whom were employees from a multitude of companies he owned, all attested to how much of an icon Captain Hosa was.\nThe facility, which eventually became a greenhouse farm, was established in the heart of Edo State.\nSpeaking highly of Captain Hosa’s outstanding efforts and humanitarian impact, The Managing Director of Wells Hosa Farms, Engr.\nFrom the food on our tables to the agricultural opportunities that abound in the country, the presence of Captain Hosa is forever felt.\nThe programme of events continues throughout the week until he is laid to rest in a ceremony in his hometown, Benin City, Edo State, Nigeria, on October 9th, 2021."
  },
  {
    "headline": "Kaduna North Senator Empowers Women With Skills Acquisition",
    "summarized_story": "The Senator representing Kaduna North senatorial zone, Suleiman Abdu Kwari, has sponsored a two-day skills acquisition and entrepreneurship training and poultry farming programme for hundreds of women in his senatorial district.\nThe beneficiaries were drawn from Sabon Gari, Zaria, Kudan and Makarfi local government areas of the senatorial zone.\nSenator Kwari, who was represented at the flag-off of the training by his senior legislative aide, Alhaji Adamu Bature Kudan, presented certificates with start-up funds to the beneficiaries.\nKudan noted that the second phase also gave ample opportunity for the beneficiaries to learn skills in the areas of poultry farming, cosmetology and chemical works.\nADVERTISEMENTHe also stressed that the event was part of the line-up of empowerment programmes that Senator Kwari has been implementing in his constituency for some time, urging the constituents to utilise the resources given to them accordingly."
  },
  {
    "headline": "Kaduna North Senator Empowers Women With Skills Acquisition",
    "summarized_story": "The Senator representing Kaduna North senatorial zone, Suleiman Abdu Kwari, has sponsored a two-day skills acquisition and entrepreneurship training and poultry farming programme for hundreds of women in his senatorial district.\nThe beneficiaries were drawn from Sabon Gari, Zaria, Kudan and Makarfi local government areas of the senatorial zone.\nSenator Kwari, who was represented at the flag-off of the training by his senior legislative aide, Alhaji Adamu Bature Kudan, presented certificates with start-up funds to the beneficiaries.\nKudan noted that the second phase also gave ample opportunity for the beneficiaries to learn skills in the areas of poultry farming, cosmetology and chemical works.\nADVERTISEMENTHe also stressed that the event was part of the line-up of empowerment programmes that Senator Kwari has been implementing in his constituency for some time, urging the constituents to utilise the resources given to them accordingly."
  },
  {
    "headline": "Army Accuses Veteran Actor, Chiwetalu Agu, Of Supporting IPOB",
    "summarized_story": "The Nigerian Army has said troops arrested veteran Nollywood actor, Chiwetalu Agu, for inciting the public and soliciting support for the proscribed Indigenous People of Biafra (IPOB).\nThe director of Army Public Relations, Brig Gen Onyema Nwachukwu, said the actor dressed in a well known attire of the proscribed group was picked up for questioning while inciting members of the public to join the proscribed group.\nADVERTISEMENTGen Nwachukwu stated that the Army will not allow IPOB and its sponsors to hold the region captive and allow the security situation to degenerate.\n“Individuals or groups who fan the embers of violence are warned to desist or face the consequences of their actions.\nThe Army, therefore, called on law abiding people of the South-East togo about their normal activities, as efforts were ongoing to bring perpetrators of violence to book."
  },
  {
    "headline": "Tears, tension as gunmen kill five mobile police men in Niger community",
    "summarized_story": "In an attack by suspected gunmen on Tuesday in Pangu community of Rafi Local Government Area of Niger state, five mobile policemen have been reportedly killed.\nThe gunmen were also accused of burning down the Pangu primary healthcare centre and two vehicles belonging to the mobile policemen.\nThe gunmen according to sources from the community invaded the town on motorcycles shooting sporadically to scared people away.\nThe PUNCH gathered that the gunmen began shooting the mobile policemen who tried to stop the attack and that led to the death of the security agents.\nHe said, “There have been attacks here and there” while no specific information was given on the Pangu community attack."
  },
  {
    "headline": "Tears, tension as gunmen kill five mobile police men in Niger community",
    "summarized_story": "In an attack by suspected gunmen on Tuesday in Pangu community of Rafi Local Government Area of Niger state, five mobile policemen have been reportedly killed.\nThe gunmen were also accused of burning down the Pangu primary healthcare centre and two vehicles belonging to the mobile policemen.\nThe gunmen according to sources from the community invaded the town on motorcycles shooting sporadically to scared people away.\nThe PUNCH gathered that the gunmen began shooting the mobile policemen who tried to stop the attack and that led to the death of the security agents.\nHe said, “There have been attacks here and there” while no specific information was given on the Pangu community attack."
  },
  {
    "headline": "Juju scare as IBEDC throws communities into darkness… Angry residents kick",
    "summarized_story": "PUNCH Metro gathered that electricity supply to the communities was disconnected after some residents placed fetish items at the isolator switch of the IBEDC in the Magboro area.\nOur correspondent learnt that some yet-to-be-identified persons on Saturday placed a sacrifice at the switch and also chained the electrical gadget.\n“However, on Saturday evening, when the isolator switch was up and there was electricity, some people dropped a sacrifice there.\n“As soon as IBEDC discovered that they could not pull the isolator switch down, they authorised that power be switched off from Oke-Aro.\nAs of Wednesday afternoon, the isolator switch was still chained and the sacrifice at the same spot, while residents continued to suffer outage."
  },
  {
    "headline": "Juju scare as IBEDC throws communities into darkness… Angry residents kick",
    "summarized_story": "PUNCH Metro gathered that electricity supply to the communities was disconnected after some residents placed fetish items at the isolator switch of the IBEDC in the Magboro area.\nOur correspondent learnt that some yet-to-be-identified persons on Saturday placed a sacrifice at the switch and also chained the electrical gadget.\n“However, on Saturday evening, when the isolator switch was up and there was electricity, some people dropped a sacrifice there.\n“As soon as IBEDC discovered that they could not pull the isolator switch down, they authorised that power be switched off from Oke-Aro.\nAs of Wednesday afternoon, the isolator switch was still chained and the sacrifice at the same spot, while residents continued to suffer outage."
  },
  {
    "headline": "SARS dead and buried: IGP Alkali Baba",
    "summarized_story": "By Monday Ijeh/AbujaThe Inspector General of Police (I-G), Mr Usman Baba, has given an assurance that he has no plan to resuscitate the disbanded Special Anti Robbery Squad (SARS).\nThe Force Public Relations Officer (FPRO), Mr Frank Mba, conveyed the IGP’s assurance in a statement, on Thursday, in Abuja.\nMba said the clarification followed reports making the rounds both online and offline that the IGP had ordered the re-instatement of the disbanded SARS.\n“The Force wishes to emphasise that there is no plan whatsoever to bring back the disbanded SARS.\nThe FPRO urged the public to disregard the report, saying that it was deliberately intended to misinform the public."
  },
  {
    "headline": "Reports: Trevor Noah puts his Bel Air mansion for sale",
    "summarized_story": "Trevor Noah, with his girl friend, Minka Kelly has put up his Bel Air mansion in Los Angeles for sale at $29.75 million.\nThe “Daily Show” host spent $27.5 million on the property 10 months ago, when he reportedly wanted to settle down with Kelly.\nIt offers plentiful natural light, a gym, a sauna, office space, a screening room and Crestron home automation.\nThe gated one-acre lot has an infinity pool, a pavilion with an outdoor kitchen, a security booth, a guest apartment and a separate staff entrance, according to the listing.\nNoah also owns a $10 million penthouse in New York City and formerly owned a separate $20.5 million Bel Air home, the newspaper said."
  },
  {
    "headline": "There’s No Plan To Bring Back SARS — IGP",
    "summarized_story": "The Nigerian Police Force has claimed that it has no plans to resurrect the renowned Special Anti-Robbery Squad (SARS) (SARS).\nSARS was dismantled in late 2020, following a nationwide #EndSARS protest amid suspected SARS officer brutality, extrajudicial killings, and human rights violations.\nThe SARS squad, according to the police chief, has been disbanded and will never be revived.\nMba said, “The Force wishes to categorically emphasise that there is no plan whatsoever to bring back the disbanded SARS.\nIt thereafter introduced the Special Weapons and Tactics Team, which many Nigerians described as not different from the disbanded SARS."
  },
  {
    "headline": "Election Tribunal: Governor Dapo Abiodun Accused Of Bribery",
    "summarized_story": "This comes after Olaposi Oginni, the former Secretary of the Labour Party, accused Governor Dapo Abiodun of bribing to avoid being ousted from office by the election petition tribunal, a charge the governor has denied.\nHe pleaded with me to let Dapo Abiodun finish his tenure as governor, telling me that he would do a better job.\n“If Arabambi and I had stood our grounds that Dapo Abiodun should go as at then, there would have been a rerun election.\nBut Dapo Abiodun is an ingrate, the greatest ingrate you can ever meet at that.\nArabambi went on his own as a Labour Party member and I am on my own as a Labour Party member too."
  },
  {
    "headline": "IGP Baba Revives SARS, Issues New Rules Of Engagement To Officers",
    "summarized_story": "The Nigerian Police Force’s Special Anti-Robbery Squad (SARS) has been reinstated by Inspector-General of Police Usman Alkali Baba.\nAccording to SaharaReporters, the IGP has resurrected the notorious unit and issued new terms and conditions for SARS officials’ operations.\nSARS has been overhauled, and new rules of engagement have been handed to its officers, according to a statement released by the police chief on Thursday.\nThe Police Commissioner, on the other hand, made it plain that SARS officers are only used in armed robbery and kidnapping situations.\nThe revised norms of engagement, according to IGP Baba, are as follows:“No SARS personnel is allowed to interface in any civil matter."
  },
  {
    "headline": "Where Nigeria’s President Comes From In 2023 Not Important ― Atiku Abubakar",
    "summarized_story": "Former Vice-President and the 2019 presidential candidate, Atiku Abubakar, has disclosed that the president in 2023 can come from any part of the country.\nThere have been talks and controversies, particularly among the governors as to the region that should produce the president in 2023 and succeed President Muhammadu Buhari.\nThe Northern Governors’ Forum days later had met and replied to their southern counterparts that zoning was not only unconstitutional but undemocratic.\n“The Peoples Democratic Party (PDP) has the right to determine its rules and how the party should be governed.\n“There is no such thing as a president from southern Nigeria or a president from northern Nigeria."
  },
  {
    "headline": "VIDEO: Watch how CAR scored crucial goal vs star-studded Super Eagles in FIFA World Cup qualifier",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: Army arrest veteran Nollywood star",
    "summarized_story": "A trending video has revealed how Nollywood star, Chinwetalu Agu, was arrested by some officers of the Nigerian Army for reportedly adorning Biafra insignia at the popular Upper Iweka area of Onitsha, Anambra state.\nThe veteran actor was said to be in the commercial city on a charitable mission where he shared food items to the less privileged.\nAgu was then arrested by the officers who dragged him into a vehicle and zoomed off immediately."
  },
  {
    "headline": "Happening now: New billionaire owners complete Newcastle takeover as club becomes richest at Premier League",
    "summarized_story": "Newcastle United are under new Saudi ownership after a £300million deal was agreed with Mike Ashley and signed off by the Premier League.\nA Premier League statement read: ‘The Premier League, Newcastle United Football Club and St James Holdings Limited have today settled the dispute over the takeover of the club by the consortium of PIF, PCP Capital Partners and RB Sports & Media.\n‘The legal disputes concerned which entities would own and/or have the ability to control the club following the takeover.\nThe Premier League has now received legally binding assurances that the Kingdom of Saudi Arabia will not control Newcastle United Football Club.\nNow, though, they have been able to provide sufficient proof that the Saudi state will not be in control of the club, and they have passed the Premier League owners’ and directors’ test."
  },
  {
    "headline": "Buhari Presents N16.39trn 2022 Budget Proposal To National Assembly",
    "summarized_story": "President Muhammadu Buhari on Thursday proposed a total budget of N16.39 trillion for the year 2022 to the National Assembly.\nThe 2022 Budget will be the last full year budget to be implemented by this administration.\nFederal Government’s retained revenues (excluding Government Owned Enterprises) amounted to 2.61 trillion Naira against the proportionate target of 3.95 trillion Naira for the period.\nMr. Senate President, Mr. Speaker, Distinguished and Honourable Members of the National Assembly, this speech would be incomplete without commending the immense, patriotic, and collaborative support of the National Assembly in the effort to deliver socio-economic development and democracy dividends for our people.\nI wish to assure you of the strong commitment of the Executive to strengthen the relationship with the National Assembly."
  },
  {
    "headline": "UK Relaxes Rules For Fully Vaccinated Travellers From Nigeria",
    "summarized_story": "The United Kingdom has reviewed its travel protocols for travellers from Nigeria who have taken their complete jabs of the COVID-19 vaccines approved by authorities in the country.\nThe revised policy applies to those who have been fully vaccinated with AstraZeneca (including Covidshield), Pfizer, Moderna and Johnson and Johnson vaccines.\n“Fully vaccinated means that you have had a complete course of an approved vaccine at least 14 days before you arrive in England.\nThe day you had your final dose does not count as one of the 14 days,” the statement added.\nI would encourage all eligible people to get vaccinated,” Llewellyn-Jones said."
  },
  {
    "headline": "PDP NEC Approves Zoning Of National Chairmanship Position To The North",
    "summarized_story": "﻿The National Executive Committee of the Peoples Democratic Party (PDP) has approved the recommendation of its committee to zone the position of national chairman to the North.\nNational Publicity Secretary of the party, Mr Kola Ologbondiyan, briefed journalists about the decision after the NEC meeting, which was held in Abuja on Thursday.\nThe PDP NEC also retained the scheduled date for the party’s convention.\nThere is no such thing as a president from Southern Nigeria or a president from Northern Nigeria.\n“There is only one president from Nigeria, for Nigeria, by Nigerians,” Atiku said."
  },
  {
    "headline": "Nigeria’s Osahon Enabulele Emerges President-Elect Of World Medical Association",
    "summarized_story": "President of Commonwealth Medical Association (CMA), Dr Osahon Enabulele, has emerged as the President-elect of the World Medical Association (WMA).\nDr Enabulele, a former President of the Nigerian Medical Association (NMA), takes over from Dr Heidi Stensmyren of Sweden as the President-elect of the association.\nHe vied for the position with Dr Muhammad Nizami, a Professor of Orthopaedic Surgery and President of the Pakistan Medical Association.\nThe WMA President-elect is expected to give his acceptance speech during the 2021 General Assembly of the association scheduled to hold on Friday next week in London.\nDr Enabulele will be superintending over the WMA during the 2022 – 2023 executive year."
  },
  {
    "headline": "CAR Stun Nigeria In World Cup Qualifier",
    "summarized_story": "Karl Namnganda, who plays in the French fourth division, scored in the 90th minute to give the Central African Republic a stunning 1-0 away win over Nigeria on Thursday in World Cup qualifying.\nCentral African Republic pulled off one of the greatest shocks in African World Cup qualifying despite lacking their star performer, Atletico Madrid midfielder Godfrey Kondogbia.\nCentral African Republic were ranked 124th in the world this month — 90 places below six-time World Cup qualifiers Nigeria.\nThe countries meet again on Sunday at the Stade Barthelemy Boganda, a 50,000-seat fortress where the Central African Republic seldom fail.\nHe was hired by Nigeria in 2016 and his recent contract renewal included demands that he win the 2021/2022 Africa Cup of Nations in Cameroon and qualify for the 2022 World Cup."
  },
  {
    "headline": "U.S. Consulate supports academic programs at KolaDaisi University through book donation",
    "summarized_story": "The United States Consulate General in Ibadan has donated textbooks and other higher education reference materials to KolaDaisi University to enhance the quality of learning, teaching and research in the University.\n“Books and reading are essential for quality education and an informed citizenry,” Ibelli said.\n“One of our many exchange programs is the Fulbright program which opens up opportunities for Nigerian university students and faculty members to engage in academic programs and collaborative research in U.S. institutions across various academic fields,” he added.\n“We appreciate the sheer volume of books and how they will be instrumental in supporting teaching and learning.\nThese books will in no small measure contribute to the educational advancement of our dear university,” Professor Olatubosun added."
  },
  {
    "headline": "Full Text; President Buhari presents N16.39 trillion 2022 Appropriation Bill -",
    "summarized_story": "President Muhammadu Buhari on Thursday presented N16.39 trillion 2022 Appropriation Bill to the joint session of National Assembly.\nFederal Government’s retained revenues (excluding Government Owned Enterprises) amounted to 2.61 trillion Naira against the proportionate target of 3.95 trillion Naira for the period.\nTotal federally distributable revenue is estimated at 12.72 trillion Naira in 2022 while total revenue available to fund the 2022 Federal Budget is estimated at 10.13 trillion Naira.\nOil revenue is projected at 3.16 trillion, Non-oil taxes are estimated at 2.13 trillion Naira and FGN Independent revenues are projected to be 1.82 trillion Naira.\nWe plan to finance the deficit mainly by new borrowings totalling 5.01 trillion Naira, 90.73 billion Naira from Privatization Proceeds and 1.16 trillion Naira drawdowns on loans secured for specific development projects."
  },
  {
    "headline": "Ondo Amotekun rescues Ogun cement dealer from kidnappers",
    "summarized_story": "Men of the Ondo State Security Network, popularly called Amotekun Corps, have rescued a popular cement dealer Folorunsho Sakirudeen, in Ogun waterside, from the den of kidnappers.\nMr. Sakirudeen was kidnapped on Wednesday evening by three gunmen at Antonio junction in Ogun waterside.\nHe was moved from the spot to Ajebamidele in Ondo state, where they were tracked by Amotekun operatives.\nAn Amotekun operative was injured in the operation, but he is currently receiving treatment at the hospital.\nAmotekun commander in the state, Adetunji Adeleye, said the operation was made possible, through intelligence gathering."
  },
  {
    "headline": "200 Kidnap victims rescued in Zamfara",
    "summarized_story": "Over two hundred Kidnap Victims have again been rescued in Zamfara state.\nThe biological father of the speaker Mu’azu Abubakar alongside his step mother and five others were abducted by gunmen at his residence on august fifth in Zurmi local government area.\nThe speaker’s father Mu’azu Abubakar died in the hands of his captors after two months in captivity.\nChairman of the speakers conference who doubles as the speaker of the Bauchi State House of Assembly Abubakar Suleiman commended the efforts of the Zamfara state government in the fight against banditry.\nHe reassures of the commitment of the conference of speakers to support Government at all level to end insecurityOthers in the entourage include speakers of Katsina, Kano and Yobe states Houses of Assembly."
  },
  {
    "headline": "Qatar 2022 Qualifiers: Central African Republic Shock Nigeria 1-0 in Lagos",
    "summarized_story": "The Les Fauves of Central African Republic have beaten Super Eagles of Nigeria 1-0 in the World Cup Qualifiers in Teslim Balogun Stadium, Lagos.\nKarl Namnganda’s late strike is all the Les Fauves needed to break through the Super Eagles defence, thus helping the team at the bottom of the table grab a crucial win on the road as they bagged their first win in the group."
  },
  {
    "headline": "New Groups May Rise Up to Counter IPOB, Umahi Warns – Trending with Ojy Okpe",
    "summarized_story": "The Governor of Ebonyi State David Umahi raised the alarm on live television, that new groups may emerge in the South East region to counter the secession agitations of the Indigenous People of Biafra.\nMeanwhile, a lawmaker, Cynthia Nwala was on Monday battered and stripped in the council premises of Etche Local Government, after she was accused of trying to make away with the council’s mace.\nElsewhere, a video showing five young men, who embarked on a dangerous journey to Europe onboard the MV JANE MAJURO sailing off from Apapa port in Lagos, has made the rounds on social media."
  },
  {
    "headline": "Pfizer Asks US to Allow Covid Shots for Kids Aged 5 to 11",
    "summarized_story": "Pfizer asked the US government Thursday to allow use of its COVID-19 vaccine in children ages 5 to 11 — and if regulators agree, shots could begin within a matter of weeks.\nMany parents and pediatricians are clamoring for protection for children younger than 12, today’s age cutoff for the vaccine made by Pfizer and its German partner BioNTech.\nOne big change: Pfizer says its research shows the younger kids should get a third of the dose now given to everyone else.\nHe is enrolled in Pfizer’s study at Duke University and doesn’t yet know if he received the vaccine or dummy shots.\nPfizer studied the lower dose in 2,268 volunteers ages 5 to 11, and has said there were no serious side effects."
  },
  {
    "headline": "Nigeria Spends $1.3bn on Debt Servicing In Six Months",
    "summarized_story": "Nigeria’s federal government has spent $1.302 billion on debt servicing in the first half of 2021 (January to June 2021), expending 97 percent of its revenue on debt.\nAccording to a report from Debt Management Office (DMO), in 2020, out of the federal government’s total revenue of N3.42 trillion, N3.34 trillion was used for debt servicing.\nA total of $157.012 million was paid out to service eurobond debts, while $38.22 million was paid on bilateral loans, and another $103.73 million was paid on multilateral obligations.\nIn servicing the commercial loans, the country paid $148.57 million to investors with $57.187 million paid on the 7.625 percent eurobond 2047, $48.750 million paid on the 6.5 percent eurobond 2027 and $42.637 million paid on the 7.625 percent eurobond 2025 papers.\nThe Nigerian Economic Summit Group (NESG) had earlier warned that the federal government’s debt service to revenue ratio is unsustainably high and affects its ability to meet non-debt obligations."
  },
  {
    "headline": "Maina’s Son, Faisal, Sentenced to 14 Years in Prison for Money Laundering",
    "summarized_story": "A Federal High Court sitting in Abuja has convicted and sentenced the son of former Chairman of the defunct Pension Reform Taskforce Team, Abdulrasheed Maina, Faisal, to 14 years imprisonment.\nThe trial judge Justice Okon Abang, found Faisal guilty on a three-count money laundering charge the Economic and Financial Crimes Commission, EFCC, filed and argued against him.\nThe judge held that the anti-graft agency successfully established that Faisal, operated a fictitious bank account with the United Bank for Africa, UBA, through which his father, Maina, laundered the sum of N58.1million.\nWhile the court sentenced the Defendant to 5 years in count 1 and 3 of the charge, he was sentenced to 14 years on count 2 of the charge.\nThe court held that the charge would run concurrently, starting from the judgement day."
  }
]