[
  {
    "headline": "Naval personnel deployed as gunmen kill nine in Kogi community",
    "summarized_story": "Naval personnel have been drafted to strengthen the security architecture in Bagana, Omala Local Government Area of Kogi State, following Tuesday’s invasion of the community by gunmen, who allegedly killed nine persons.\nThe PUNCH reports that apart from the nine persons, who were shot dead, several others sustained varying degrees of injury.\nThe Chief Security Officer for the local government council, Stephen Shuaibu, said there were threats of reprisals from different quarters, hence the proactive move of deploying naval personnel to prevent a further breakdown of law and order.\nAccording to them, a prominent Hausa chief, Alhaji Audi Abdullahi, and the chief of Ihankpe were at different times abducted and killed by yet-to-be apprehended bandits.\nAya added that peace had returned to the community and asked the residents to return home to continue with their legitimate business."
  },
  {
    "headline": "Sacked ministers failed to meet target, Buhari plans more evaluation",
    "summarized_story": "FORMER Minister of Agriculture, Mohammed Nanono; and former Minister of Power, Saleh Mamman, were sacked by the President, Major General Muhammadu Buhari (retd.\nThe source said, “The ministers were asked to go because they failed the evaluation test on their core targets.\nAt the retreat, ministers will see the result of their evaluation and they will know their fate.”It’s a continuous process, says BuhariHowever, the President, Major General Muhammadu Buhari (retd.\nBuhari’s announcement was contained in a statement on Wednesday by his Special Adviser on Media and Publicity, Femi Adesina, titled ‘President Buhari approves cabinet reshuffle’.\nHe further justified the termination of their appointment, which he said, was as a result of the ministers’ poor attitude to work."
  },
  {
    "headline": "Katsina Assembly passes contributory pension scheme bill",
    "summarized_story": "Katsina State House of Assembly, on Wednesday, passed an executive bill for the establishment of a contributory pension scheme in the state.\n“The presentation of the bill itself was in line with the reform of the pension system initiated by the Federal Government in 2004.\n“The reform culminated in the enactment of the Pension Reform Act, 2014.\n“The new act has made it mandatory for states, local governments and private sectors to adopt and implement the contributory scheme for their employees,’’ he said.\nThe lawmakers, after an extensive debate on the issue, unanimously adopted the report and passed the bill for the introduction of the new pension scheme in the state."
  },
  {
    "headline": "Gombe receives 100,154 doses of COVID-19 vaccine",
    "summarized_story": "Gombe State Government on Wednesday took delivery of 100,154 doses of COVID-19 vaccines for the second phase vaccination exercise.\nThe state deputy governor, Dr Manessah Jatau, who announced the development, disclosed that the state received 87,360 doses of Moderna and 12,794 doses of AstraZeneca vaccines.\n“Recently, there has been an upsurge or resurgence of COVID-19 cases in the country and the world at large.\nAlso speaking, Dr Habu Dahiru, the Commissioner for Health, said that the provision of the Moderna and AstraZeneca vaccines would augment the shortfall in the state.\n“Those that have taken AstraZeneca as their first jab, can still take it as the second dose”."
  },
  {
    "headline": "Ndokwa communities decry poor access roads, barricade Govt House",
    "summarized_story": "…your demand is being looked into- OkowaBy Festus Ahon & Ochuko Akuopha, ASABAINDIGENES of Ndokwa East Local Government Area, Delta State communities, have decried poor access roads in over 30 abandoned communities in the Area.\nThe angry indigenes who barricaded the State Government House, Asaba, demanded the construction of an accessible road network in the affected communities.\n“While this may hold true, there is however a largely disproportionate number who think that the above rendering is only but a make-believe statement”.\n“Infrastructural development in any capacity has been brought to a full halt due to sheer neglect and effortless commitment towards this region by its government representatives.\nThe SSG, who was flanked by the Chief of Staff, Government House, Mr Festus Agas and some other government functionaries, assured the protesting youths that their advance letter has been received."
  },
  {
    "headline": "Presidency replies Amnesty International, vows to fight terrorism to standstill",
    "summarized_story": "The Presidency has condemned Amnesty International’s latest salvo at Nigeria, regretting that “they have decided to side with terrorists, before the liberty of those they injure, displace and murder’’.\nReports have it that the presidency was reacting to Amnesty International’s recent claim that the Federal Government is harassing its critics and other militias.\n“Amnesty International’s latest salvo at Nigeria is but more of the same.\n“Speaking the language of universal human rights, Amnesty International deploys it only in defence – even outright promotion – of those that violently oppose the Federal Government of Nigeria.\nThe presidential aide also accused Amnesty International of playing local politics in Nigeria."
  },
  {
    "headline": "Only NEC can suspend me, Secondus blows hot",
    "summarized_story": "By Dirisu YakubuAgainst the backdrop of reports that he has been suspended by the Rivers state chapter of the Peoples Democratic Party, PDP, suspended chairman of the party, Prince Uche Secondus has said only the National Executive Committee, NEC, has the power to do so.\nIn a late reaction on Wednesday night, Secondus through his media adviser, Ike Abonyi said those behind the report are bent on destroying the party.\n“The media office of Prince Uche Secondus ordinarily should not be responding to every ‘noise’ in the media being engineered by those who set out to distract and destroy the Peoples Democratic Party, PDP, but it’s our responsibility to guide those who are easily persuaded by news in the media hence this response.\n“Such action is a mere wish as Article 59(3) of the Peoples Democratic Party, PDP, the constitution states clearly that only the National Executive Committee, NEC of the party can discipline the National Chairman or any other National officer of the party.\nVanguard News Nigeria"
  },
  {
    "headline": "NCDC chief, Chikwe Ihekweazu appointed WHO Assistant Director-General",
    "summarized_story": "The World Health Organization (WHO) has appointed the head of Nigeria Centre for Disease Control (NCDC), Chikwe Ihekweazu, as a top official.\nIhekweazu will resume as WHO Assistant Director-General for Health Emergency Intelligence from November 1, 2021.\nSpeaking, Ihekweazu expressed readiness to carry on the mission of the WHO and tackle global health challenges.\n“We need everyone to achieve global health goals together”, the public health physician added.\nIhekweazu, born in Germany, studied medicine at the University of Nigeria (UNN) and obtained a Master’s degree in Public Health from the Heinrich Heine University Düsseldorf."
  },
  {
    "headline": "Herdsman in court over alleged kidnap in Ekiti",
    "summarized_story": "A 28-year-old herdsman, Abdullahi Bande, was, on Wednesday, arraigned before an Ado-Ekiti Magistrates’ Court over alleged kidnapping of one Adebusuyi Ebenezer at Ilawe-Ekiti.\nBamikole Olasunkanmi, told the court that Abdullahi committed the offence on Aug. 26 NAN reports.\nOlasunkanmi said that the case file would be sent to the Directorate of Public Prosecution (DPP) for legal advice.\nAccording to him, the offence is punishable under Section 3(a) of the Kidnap and Terrorism (Prohibition), Laws of Ekiti State, 2015.\nHe adjourned the case till Sept. 15, for hearing."
  },
  {
    "headline": "Police call for prayers as bandits abduct 73 students in Zamfara",
    "summarized_story": "The Police in Zamfara State have confirmed the abduction of 73 students of Government Day Secondary School in Kaya.\nA statement by Mohammed Shehu, Police Public Relations Officer, said a large number of bandits invaded the school at about 11:22am on Wednesday.\nHe announced that the Commissioner, Ayuba Elkanah has deployed a search and rescue team to work in synergy with the military to free the pupils.\nElkanah appealed to the public, especially parents and relatives of the students “to exercise patience and continue to pray for the success of the ongoing rescue operation”.\nThe statement added that updates will be provided as events unfold."
  },
  {
    "headline": "Ogun Assembly mulls resident’s permit for corps members, students, others",
    "summarized_story": "The Ogun State House of Assembly is legislating on a bill that would ensure that all residents of the state are registered by the government.\nThe bill, when passed into law, would consider resident’s permit for short-term residents like National Youth Service Corps (NYSC) members and students of higher learning institutions.\n062/OG/2021 – The Ogun State Residents Registration Agency and the Registration of Ogun State Residents Law 2021” was on Wednesday deliberated on by stakeholders, at the Assembly Complex, Oke-Mosan, Abeokuta.\nDAILY POST learnt that there would be an Ogun State Resident Registration Agency, which would be saddled with the responsibility of capturing the database of people living in Ogun.\nThey harped on the need to start using data gathered for developmental purposes, adding that Community Development Associations should be saddled with the responsibility of verifying and presenting community residents for registration."
  },
  {
    "headline": "Army chief, Yahaya visits NDA after bandits’ attack, Major Datong still missing",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant General Faruk Yahaya, Wednesday, visited the Nigerian Defence Academy (NDA) over the recent security breach.\nYusuf said Major Christopher Datong is still missing and confirmed that efforts to rescue him are ongoing.\nHe informed the COAS of measures being taken along with 1 Division Nigerian Army, the Nigerian Air Force and other security agencies in Kaduna to prevent future attacks.\nSpeaking, Yahaya hailed Yusuf, GOC 1 Division, Air Officer Commanding Air Training Command and other security heads for their contributions to Datong’s search.\nThe visit of the COAS followed that of Chief of Defence Staff (CDS), General Leo Irabor."
  },
  {
    "headline": "War without end on the Plateau",
    "summarized_story": "From Berom communities to Irigwe and Anaguta communities, ethno-religious violence in Plateau North Senatorial District has gone full cycle.\nKOLADE ADEYEMI x-rays the various dimensions of the conflictsFrom 1999, successive administrations in Plateau State have witnessed and managed ethno-religious violence.\nPlateau State witnessed one of the worst violence in the history of the state.\nAn umbrella socio-cultural organization known as Plateau Our Heritage (POH) is of the view that the fundamental reason for continuous attacks and counterattacks across Plateau State has been group contesting over land.\nKwapnoe said his organization is yet to establish the allegations that the Federal Government’s Fulanisation policy is being implemented in Plateau state."
  },
  {
    "headline": "17 types of kisses and meanings",
    "summarized_story": "But you could use this knowledge the next time your partner kisses you.\nSo here we have listed down the 17 different types of kisses and their meaning for your utmost relish and enlightenment.\nEar kissMost women state that they love it when their partners kiss on the ears.\nThe gesture is typically reserved for someone special, like someone you’re really feeling.\nFrench kissThe open-mouth kiss with tongue is all types of erotic as there’s almost no other kiss that connects two people more."
  },
  {
    "headline": "NLC threatens industrial action over planned electricity tariff hike",
    "summarized_story": "The Nigeria Labour Congress (NLC) has threatened to call out workers for industrial action if the Federal Government implement the proposed hike in electricity tariff.\nNgige had said at the bipartite meeting between the government side and organised labour that the reports on electricity tariff and petrol increases would be considered by the government side.\nIt reads: “This is to officially notify you that there will be an increase in electricity tariff with effect from September 1, 2021.\nBut reacting to the reports in a statement on Wednesday, Wabba cautioned that the Organised Labour would not brook any tarrifs hike.\n“It is in light of this that we dismiss the ongoing speculation on increase in electricity tariff as mere speculations."
  },
  {
    "headline": "Buhari reappoints Ajiboye as TRCN Registrar",
    "summarized_story": "President Muhammadu Buhari has reappointed Prof Josiah Ajiboye as Registrar of the Teachers Registration Council (TRCN).\nProf Ajiboye resumed duties on Tuesday with a pledge to pursue the implementation of policies that will enhance teachers welfare in the country.\nADVERTISEMENTSpeaking after his resumption, the TRCN boss said his major focus will be on teachers professionalism and welfare to ensure that Nigerian teachers are well rewarded.\n“Actually, the major focus this time around, will be on the welfare and teacher professionalism that we have been focusing; but more importantly, on teachers welfare.\n“We left off at the point of addressing the issue of teachers welfare in Nigeria, which Mr President assented to."
  },
  {
    "headline": "Ohanaeze sets September 29 as Igbo Day",
    "summarized_story": "From Geoffrey Anyanwu, Enugu and Okey Sampson, UmuahiaOhanaeze Ndigbo Worldwide has set aside Wednesday, September 29, for the 2021 edition of Igbo Day celebration which is scheduled for Enugu State.\nIt is also a day to celebrate the Igbo resilience, ingenuity, entrepreneurial skills and frontier spirit.\nA statement by Chief Chiedozie Ogbonnia, national publicity secretary of the group said the Igbo would rather celebrate than mourn on that day because of God’s love and kindness towards the ethnic nationality.\nInstead of mourning, we have chosen to celebrate the God’s love and kindness towards the Igbo.\nWe celebrate the innate capacity and perseverance in the Igbo to break physical boundaries and achieve results where most fail.”The statement said the President General of Ohanaeze Ndigbo, Prof. George Obiozor was optimistic that this year’s Igbo Day Celebration would be very unique in several ways."
  },
  {
    "headline": "Olawunmi: CAN warns against media gag",
    "summarized_story": "From Fred Ezeh, AbujaChristian Association of Nigeria (CAN) has warned the Federal Government not to gag the press and other vocal persons criticising its policies and speaking against societal ills.\nThe organisation stated this against the backdrop of the invitation to Navy Commodore Kunle Olawunmi (retd) by the Defence Intelligence Agency (DIA) over comments that sponsors of Boko Haram and terrorists groups were known to the Federal Government.\nIts President, Samson Ayokunle Olasupo, in a statement, yesterday, said: “It was reported by the media recently that one Navy Commodore Kunle Olawunmi (retd) was invited by the Defence Intelligence Agency (DIA) over comments he allegedly made on Channels Television’s ‘Sunrise Daily Breakfast programme last Wednesday.’ We thank God that it was a friendly chat as claimed by the Defence Headquarters.\nThis would help us get to the roots of our problems and solve them.\nWe must, therefore, promote peace, love and unity in all we say and do."
  },
  {
    "headline": "Osun to honour Ajiborisha, Akande, Adeboye, Aina, Akinrinade, Alakija, Awoyinfa, Elebuibon, others",
    "summarized_story": "The awardee, totalling 28 distinguished citizens under four broad categories, were selected by a jury on the basis of their service to Osun and contributions to the global and local society.\nThose listed for Osun Lifetime Achievement Award, include: Bisi Akande, Enoch Adeboye, Abdur’rasheed Hadiyatulla and Ipoola Alani Akinrinnade.\nOthers in the lifetime achievement category are: Hammed Omidiran, Hassan Sunmonu, Tunde Ponle, Olu Aina, Akinwande Akinola, Joanah Olu Maduka, and Benjamin Adigun.\nThe state, under the Legacy Award category, also recognised Folorunsho Alakija and Susan Wenger.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "IPOB stockpiling arms, Presidency replies Amnesty Int’l",
    "summarized_story": "Amnesty International in the report had said the whereabouts of at least 50 suspected members of IPOB arrested in Oyigbo, Rivers State, by Nigerian security were still unknown since October and November 2020.\n“Speaking the language of universal human rights, Amnesty International deploys it only in defence – even outright promotion – of those that violently oppose the Federal Government of Nigeria.\nParroting the line of Nnamdi Kanu and IPOB, a proscribed terror organisation, they work to legitimise its cause to Western audiences.\n“IPOB murder Nigerian citizens.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "No plan to impeach Lalong –Speaker",
    "summarized_story": "From Gyang Bere, JosSpeaker of the Plateau State House of Assembly, Abok Nuhu Ayuba, said there is no plan to impeach Governor Simon Lalong over current security challenges.\nThe speaker said there was no time the House planned to impeach the governor, saying the lawmakers only gave the governor a two-week ultimatum to speak out and give the people hope.\n“We are not against him, we are not preparing anything just like the thinking of the general public that we want to impeach the Governor.\nHe said the House can only pass a vote of confidence on the Governor during plenary and not outside the House.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Presidency: IPOB Stockpiled Weapons, Bombs Across Nigeria",
    "summarized_story": "*Tackles Amnesty InternationalDeji ElumoyeThe Presidency has accused the Indigenous People of Biafra (IPOB) of stockpiling substantial quantity of weapons and bombs across the country.\nNow, they have amassed a substantial stockpile of weapons and bombs across the country.\n“Speaking the language of universal human rights, Amnesty International deploys it only in defence – even outright promotion – of those that violently oppose the Federal Government of Nigeria.\nNow, they have amassed a substantial stockpile of weapons and bombs across the country.\n“Amnesty International has no legal right to exist in Nigeria."
  },
  {
    "headline": "Again, Bandits Abduct Students from Zamfara School",
    "summarized_story": "Onuminya InnocentExactly a week after abductors of the students and staff of the College of Agriculture and Animal Science in Zamfara State were freed, gunmen again Wednesday morning kidnapped scores of students and some members of staff of Kaya Day Secondary School in Maradun Local Government Area of the state.\nSources said the bandits, who stormed the school on motorcycles, started shooting sporadically to scare people away and later abducted the students and some teachers.\nThe locals said over 100 students were abducted from the school.\nIn reaction to the incident, the state Governor, Bello Matawelle, has ordered the immediate closure of all the schools in the state till further notice.\nA statement by the Director of Press, Yusuf Idris Gusau, said the measure became necessary in view of the incessant abduction of school children in the state."
  },
  {
    "headline": "(Updated) Buhari Sacks Agriculture, Power Ministers, Redeploys Two Others",
    "summarized_story": "Says process shall be continuousBy Deji ElumoyePresident Muhammadu Buhari has sacked Minister of Agriculture and Rural Development, Mohammed Sabo Nanono, and Minister of Power, Engr.\n“Today, effectively marks their last participation in the Federal Executive Council deliberations and I wish them the best in all future endeavors”, he added.\nSee full statement of President Buhari to cabinet members belowSTATEMENT TO CABINET MEMBERS BY MR PRESIDENT ON THE RESHUFFLE OF FEDERAL EXECUTIVE COUNCIL ON WEDNESDAY 1ST SEPTEMBER, 2021Your Excellency the Vice President,Members of the Federal Executive Council.\nThe weekly Federal Executive Council meetings was not spared because the traditional mode was altered.\nToday, effectively marks their last participation in the Federal Executive Council deliberations and I wish them the best in all future endeavors."
  },
  {
    "headline": "NSIA Assets Rose from $1bn to $3.5bn in Six Years, Says Ahmed",
    "summarized_story": "This is just as President Muhammadu Buhari charged the new board of the Authority to make more investments to boost the nation’s economic diversification.\nShe said: “Using the NSIA Act as its guide, the Board will be required to superintend initiatives that meet the current and future needs of Nigerians.\nThe president reaffirmed his administration’s commitment to implementing long term projects and programmes that create jobs for Nigerians.\nPresident Buhari also appreciated the last board of directors whose tenure ended in May 2021.\n‘‘Accordingly, in the past four years, both the public and private sectors in Nigeria have partnered on strategic projects with the NSIA."
  },
  {
    "headline": "News in Photographs: Buhari Inaugurates NSIA Board, Chairs FEC Meeting",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari Wednesday inaugurated the board of the NigeriaSovereign Investment Authority (NSIA) and also presided over the weekly virtual meeting of the Federal Executive Council at the State House, Abuja.\nVice President Yemi Osinbajo, Secretary to Government of the Federation, Boss Mustapha and Chief of Staff to the President, Professor Ibrahim Gambari are among those physically attending the FEC meeting at the Conference Hall of the First Lady’s office.\nAlso present are Ministers of Finance Budget and National Planning, Zainab Ahmed; Attorney General of the Federation and Minister of Justice, Abubakar Malami; Works and Housing, Babtunde Fashola and Communications and Digital Economy, Dr Isa Pantami.\nOthers include Ministers of Aviation, Hadi Sirika; Mines and Steel Development, Olamilekan Adegbite, Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiya Farouq and Youth and Sports Development, Sunday Dare.\nOther Ministers as well as the Head of Civil Service of the Federation, Folashade Yemi-Esan are attending virtually from their various offices in Abuja."
  },
  {
    "headline": "Abba Kyari Asked Me To Pay The Proceed Of Hotel Owned By Kidnap Kingpin Into My Bank Account — Police Lawyer",
    "summarized_story": "A lawyer attached to the Inspector General of Police Intelligence Response Team (IGP-IRT), Nosa Uhumwangho, has explained how the embattled 'Super Cop', Abba Kyari, made him pay the proceed from a hotel owned by an alleged kidnap kingpin into his account.\nThe lawyer also stated in the affidavit that Kyari’s team had previously instructed Tochukwu Okeke, a notorious cult member to collect rents from properties owned by late Ezenwa on his behalf.\nUhumagho, under cross-examination by Ijeoma’s lead counsel, Max Ogar, admitted paying the money into his personal account based on the directive of his boss, Abba Kyari.\nIn 2018, Amnesty International and National Human Rights Commission accused Kyari of illegally depleting assets of Collins Ezenwa who was illegally executed by SARS in Owerri, Imo State.\nOther properties of Ezenwa have also been identified in Imo and Abia states, estimating his worth in billions."
  },
  {
    "headline": "Abba Kyari Asked Me To Pay The Proceed Of Hotel Owned By Kidnap Kingpin Into My Bank Account — Police Lawyer",
    "summarized_story": "A lawyer attached to the Inspector General of Police Intelligence Response Team (IGP-IRT), Nosa Uhumwangho, has explained how the embattled 'Super Cop', Abba Kyari, made him pay the proceed from a hotel owned by an alleged kidnap kingpin into his account.\nThe lawyer also stated in the affidavit that Kyari’s team had previously instructed Tochukwu Okeke, a notorious cult member to collect rents from properties owned by late Ezenwa on his behalf.\nUhumagho, under cross-examination by Ijeoma’s lead counsel, Max Ogar, admitted paying the money into his personal account based on the directive of his boss, Abba Kyari.\nIn 2018, Amnesty International and National Human Rights Commission accused Kyari of illegally depleting assets of Collins Ezenwa who was illegally executed by SARS in Owerri, Imo State.\nOther properties of Ezenwa have also been identified in Imo and Abia states, estimating his worth in billions."
  },
  {
    "headline": "Abba Kyari Asked Me To Pay The Proceed Of Hotel Owned By Kidnap Kingpin Into My Bank Account — Police Lawyer",
    "summarized_story": "A lawyer attached to the Inspector General of Police Intelligence Response Team (IGP-IRT), Nosa Uhumwangho, has explained how the embattled 'Super Cop', Abba Kyari, made him pay the proceed from a hotel owned by an alleged kidnap kingpin into his account.\nThe lawyer also stated in the affidavit that Kyari’s team had previously instructed Tochukwu Okeke, a notorious cult member to collect rents from properties owned by late Ezenwa on his behalf.\nUhumagho, under cross-examination by Ijeoma’s lead counsel, Max Ogar, admitted paying the money into his personal account based on the directive of his boss, Abba Kyari.\nIn 2018, Amnesty International and National Human Rights Commission accused Kyari of illegally depleting assets of Collins Ezenwa who was illegally executed by SARS in Owerri, Imo State.\nOther properties of Ezenwa have also been identified in Imo and Abia states, estimating his worth in billions."
  },
  {
    "headline": "BREAKING: Bandits Attack Zamfara School, Abduct Scores Of Students",
    "summarized_story": "Gunmen suspected to be bandits have abducted many students of Kaya Junior Secondary School in Maradun Local Government Area of Zamfara state.\n“There was an abduction of students just now in Kaya town, Maradun Local Government Area of Zamfara state.\nThe gunmen who were in large number came to Kaya Junior Secondary School and abduct large number of students,” a source told SaharaReporters.\nThe latest incident comes a few weeks after bandits abducted students and teachers of the College of Agriculture in the Bakura Local Government Area of Zamfara state.\nIn February 2021, gunmen struck the Government Secondary School in Kagara, Niger State, abducting school pupils, teachers, and workers."
  },
  {
    "headline": "BREAKING: Bandits Attack Zamfara School, Abduct Scores Of Students",
    "summarized_story": "Gunmen suspected to be bandits have abducted many students of Kaya Junior Secondary School in Maradun Local Government Area of Zamfara state.\n“There was an abduction of students just now in Kaya town, Maradun Local Government Area of Zamfara state.\nThe gunmen who were in large number came to Kaya Junior Secondary School and abduct large number of students,” a source told SaharaReporters.\nThe latest incident comes a few weeks after bandits abducted students and teachers of the College of Agriculture in the Bakura Local Government Area of Zamfara state.\nIn February 2021, gunmen struck the Government Secondary School in Kagara, Niger State, abducting school pupils, teachers, and workers."
  },
  {
    "headline": "Gunmen attack three lawmakers on Nasarawa highway",
    "summarized_story": "Three lawmakers in the Nasarawa state house of assembly reportedly escaped death on Wednesday, when gunmen opened fire on their vehicles.\nAdvertisementThe lawmakers — Samuel Tsebe, David Maiyaki and Peter Akwe — are said to have been attacked on the Akwanga-Lafia road in the state.\nRamhan Nansel, Nasarawa police spokesperson, who confirmed the incident, said Tsebe reported the attack to Adesina Soyemi, the commissioner of police.\nNansel said the lawmaker explained that he was attacked along the Akwanga-Lafia road around 10am on Wednesday.\nAccording to NAN, Tsebe told journalists shortly after the attack that the three lawmakers “narrowly escaped assassination” during the attack."
  },
  {
    "headline": "Gunmen attack three lawmakers on Nasarawa highway",
    "summarized_story": "Three lawmakers in the Nasarawa state house of assembly reportedly escaped death on Wednesday, when gunmen opened fire on their vehicles.\nAdvertisementThe lawmakers — Samuel Tsebe, David Maiyaki and Peter Akwe — are said to have been attacked on the Akwanga-Lafia road in the state.\nRamhan Nansel, Nasarawa police spokesperson, who confirmed the incident, said Tsebe reported the attack to Adesina Soyemi, the commissioner of police.\nNansel said the lawmaker explained that he was attacked along the Akwanga-Lafia road around 10am on Wednesday.\nAccording to NAN, Tsebe told journalists shortly after the attack that the three lawmakers “narrowly escaped assassination” during the attack."
  },
  {
    "headline": "'I never said so' -- Yemi Kale debunks report on being pressured to publish false data",
    "summarized_story": "Yemi Kale, former statistician-general of the federation, says he “never said” he was pressured to publish false data on the economy.\nIn response, he said: “I’m extremely stubborn which a few of my friends have said is a good requirement for the job.\nI’m serving my country and I will serve it correctly and I’m ready to lose my job for doing the right things.\nAdvertisement“It has come to our attention that a publication is quoting Dr. Yemi Kale wrongly, this is fake news and should be ignored.\nWe have confirmed that the former Statistician-General (Kale) never made this statement, the general public should take note,” a statement made available to TheCable reads."
  },
  {
    "headline": "'I never said so' -- Yemi Kale debunks report on being pressured to publish false data",
    "summarized_story": "Yemi Kale, former statistician-general of the federation, says he “never said” he was pressured to publish false data on the economy.\nIn response, he said: “I’m extremely stubborn which a few of my friends have said is a good requirement for the job.\nI’m serving my country and I will serve it correctly and I’m ready to lose my job for doing the right things.\nAdvertisement“It has come to our attention that a publication is quoting Dr. Yemi Kale wrongly, this is fake news and should be ignored.\nWe have confirmed that the former Statistician-General (Kale) never made this statement, the general public should take note,” a statement made available to TheCable reads."
  },
  {
    "headline": "WHO identifies new COVID variant, says it may be resistant to vaccine",
    "summarized_story": "The World Health Organisation (WHO) says it has identified a new variant of the coronavirus — labelled as ‘Mu’ — which may be resistant to vaccines.\nAdvertisementThe Mu variant is the fifth identified by the WHO — others are Alpha, Beta, Gamma and Delta.\nWhile the Mu variant has not been recorded in Africa, it has been identified in cases across South America and Europe.\n“The Mu variant has a constellation of mutations that indicate potential properties of immune escape.\nThe epidemiology of the Mu variant in South America, particularly with the co-circulation of the Delta variant, will be monitored for changes.”"
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "Ridelink raises $150k pre-seed to build e-logistics technology for East Africa",
    "summarized_story": "Ridelink, an Ugandan e-logistics platform, has just closed a $150k pre-seed investment round to improve its technology and double down on its marketing efforts.\nThe investment was birthed from the startup’s partnership with Ortus Africa Capital, Omidyar Network and African Leadership Academy’s Young Entrepreneurs Fund(Anzisha).\nFounded in 2017 by Daniel Mukisa, Ridelink operates an e-logistics platform developed to seamlessly connect SMEs to a network of transport operators.\nThough Ridelink launched its operation in Uganda, it has since expanded and serves business hubs across East Africa – in the urban, peri-urban and rural Uganda, Kenya and Tanzania.\n“The Young Entrepreneurs Fund is designed to incentivise co-investments into graduates of our programs like Daniel who have chosen to become career entrepreneurs.” said Thokoza Mjo of the Anzisha Prize, who manages the fund."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How customer loyalty is helping Nigerian fintech apps through regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nGet the best African tech newsletters in your inboxBeyond offering financial products with attractive investment returns, the startups have invested in building a customer trust and loyalty bank.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "CBN looks to Barbados to design the eNaira, why not Nigeria?",
    "summarized_story": "Share this article:On Monday, August 30, 2021, the Central Bank of Nigeria (CBN) announced that global fintech company, Bitt Inc. will be its technical partner for the launch of Nigeria’s digital currency, eNaira, scheduled for October 1, 2021.\nNigerian CBN wanted to create E-Naira cryptocurrencies and they went for a foreign company Bitt INC when they have SIBAN & CO.\npic.twitter.com/R7fXzaNpZk — Great Oracle (@AbdulMahmud01) August 31, 2021What services will Bitt Inc. be offering the CBN?\nHowever, Chuta says the CBN does not have the technical skills to perform the functions independently.\nYes, and Chuta points out that there are companies in the country that can provide the CBN with the technical expertise it requires to launch the eNaira."
  },
  {
    "headline": "“Angel investing is more than just writing a cheque” — Biola Alabi, Nollywood producer and tech investor",
    "summarized_story": "How did you get started with angel investing?\nThere’s so much around angel investing.\nWell, angel investing is literally about people; it’s about investing in people who have a good idea.\nWhile angel investing is part of my investment portfolio, it is not a core part.\nAngel investors are busy, but they want to help, so make it easier for them to do that by being specific."
  },
  {
    "headline": "Nifemi Akinwamide’s tech journey, LoftyInc Capital’s third fund, CBN reveals eNaira developers",
    "summarized_story": "Share this article:Good day,What I’m discussing today:Nifemi Akinwamide’s tech journeyLoftyInc Capital’s third fundCBN reveals eNaira’s developersNifemi Akinwamide’s journey to KudiNifemi Akinwamide.\nThey get the latest gist on developments in African tech every day, right in their inbox.\nWith his experience investing in African startups, one may argue that a $10 million fund is small.\nWhile African startups have continued to receive more money from investors, a significant portion of these funds comes from foreign investors.\nHowever, there is an increasing number of local investors willing to bet on African startups."
  },
  {
    "headline": "Obaseki, Makinde, Ikpeazu flag off PDP e-registration exercise in Anambra … confident of party’s victory at guber poll – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki and his counterparts in Oyo and Abia States, Engr.\nSeyi Makinde and Dr. Okezie Ikpeazu, respectively, on Tuesday, flagged off the e-registration and Continuous Voter Registration (CVR) exercise in Anambra State, ahead of the November 6, 2021 date for the state’s gubernatorial poll.\nObaseki, who is also the Chairman of Peoples Democratic Party (PDP) e-Registration Committee, expressed confidence that the PDP will emerge victorious in the forthcoming election.\n“As far as I am concerned and have seen, PDP is the only party in Nigeria.\n“If I can win election with just one member in the Oyo State House of Assembly, you can also do the same."
  },
  {
    "headline": "Electoral laws alone cannot guarantee credible elections, says Omo-Agege – Nigerian Observer",
    "summarized_story": "According to him, no matter how good the clauses were in the electoral laws, if the other aspects of the electioneering process were flawed, the electoral process itself will ultimately be flawed.\nProf. Adebayo Olukoshi, Chairman, The Electoral Forum and Professor, Wits School of Governance, in South Africa, commended the forum for the initiative to gather veterans with knowledgeable insights on the electoral process.\nHe said that issues of electoral integrity had continued to plague Nigeria, so, there was need to commit to working at ensuring electoral integrity, so that citizens could reap the dividends of democracy .\nMs Princess Hamman-Obels, Director, IRIAD, The Electoral Hub, said that the Hub conceptualised the Electoral Forum as a way to pool resource persons from electoral management bodies together with other electoral stakeholders.\nMs Catherine Angai, Programme Coordinator, Democracy and Accountability, OSIWA, said that the support to Electoral Hub, spoke to OSIWA’s priority for evidence-based electoral reforms."
  },
  {
    "headline": "Uwaifo was a national asset, says Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has eulogized the virtues of late music maestro, Sir Victor Uwaifo, describing his death as a loss of one of the country’s finest national assets.\nObaseki who led other top government functionaries to the residence of late Sir Uwaifo in Ekehuan Road, Benin City, on a condolence visit, said the music icon achieved so much in 80 years of his lifetime.\nHe said: “Victor Uwaifo is a music icon, a legend, and a national asset.\nThe last time I saw him was in a gathering a couple of weeks ago, in Benin City, and we greeted and exchanged pleasantries; he was a national asset.\n“The Sultan of Sokoto called me last night to express his condolences and he said ‘Sir Victor Uwaifo was a legend that influenced several generations.”Obaseki further stated: “You can’t talk of the state’s culture and art scene without talking about him."
  },
  {
    "headline": "COVID-19 3rd wave: One more unvaccinated person dies in Edo, as death toll hits 12 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo is recording an increase in the number of deaths of persons who have not been inoculated with the COVID-19 vaccines, as the state recorded another COVID-19-related death, bringing the total number of fatalities to 12.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nAccording to him, “Edo State, in the last 24 hours, recorded one more COVID-19-related death and 61 new confirmed cases, with a case positivity rate of 15.1 percent.\n“The death recorded is that of a 76-year-old unvaccinated male at the Stella Obasanjo Hospital.\nThis necessitates the need for everyone to get inoculated in order to remain healthy and alive."
  },
  {
    "headline": "Zamfara shuts schools, imposes curfew after another mass abduction of students",
    "summarized_story": "ADVERTISEMENTZamfara State government has shut down schools across the state following Wednesday’s abduction of 73 students from a public school in the state..\nHe said he has deployed a search and rescue team to work with the military to rescue the abducted students.\nThe security meeting was convened after students of Government Day Secondary School kaya in Maradun were kidnapped Wednesday afternoon.\nA source in Maradun confirmed that the Vice Principal of the school, Zayyanu Tsaba, was among those kidnapped.\nA former councilor in the area told a local news medium in Zamfara that four of his children were among the students kidnapped."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "I remain PDP national chairman – Secondus",
    "summarized_story": "OBINNA EZUGWUEmbattled national chairman of the People’s Democratic Party (PDP), Prince Uche Secondus, has maintained that he remained chairman of the party, dismissing reports of his suspension.\nSecondus, in a statement issued by his media office on Wednesday, called on the Nigerian public to disregard what he called “noise” about his suspension, which according to him, is being engineered by those bent on destroying the party.\nThe PDP chairman in the statement signed by Ike Abonyi, his special adviser on media, noted that only the National Executive Committee, NEC, of the party can discipline the National Chairman or any other National officer of the party.\n“The media office of Prince Uche Secondus ordinarily should not be responding to every ‘noise’ in the media being engineered by those who set out to distract and destroy the Peoples Democratic Party, PDP, but it’s our responsibility to guide those who are easily persuaded by news in the media hence this response,” the statement said.\n“Such action is a mere wish as Article 59(3) of the Peoples Democratic Party, PDP, constitution states clearly that only the National Executive Committee, NEC of the party can discipline the National Chairman or any other National officer of the party."
  },
  {
    "headline": "Popoola Tips Technology as Strategic Lever for Exchange of the Future",
    "summarized_story": "OBINNA EZUGWUNigerian Exchange Limited (NGX) reiterates its commitment to leverage technology to digitize securities investment and other market related transactions, noting that it remained the strategic lever for exchange of the future.\nThe Chief Executive Officer, NGX, Temi Popoola, said this during the Business Morning Show on Channels Television on Tuesday.\nAccording to him, “The Exchange is in sync with the apex regulator, the Securities and Exchange Commission (SEC) to digitalize the market and make sure that investors can buy and sell securities easily.\nWe recognise that investors look into the quality of the companies and asset classes available before making investment decisions,” he said.\nIn concluding, Popoola expressed his excitement about the future of The Exchange especially with the possibilities advancements in technology provide."
  },
  {
    "headline": "I was denied opportunity to succeed Abacha because of my Christian faith – Jeremiah Useni",
    "summarized_story": "Useni dismissed insinuations that the late head of state was poisoned, even as he said he was not partying with women, as alleged, the night before his death.\nHe died of natural causes.”Asked why he couldn’t succeed Abacha even when he was the next in line, and the late head of state’s trusted ally, Useni said, “They did not want me as head of state when Abacha died.\nThey said how can Useni, a Christian be allowed to succeed Abacha?\nI was sidelined but I didn’t bother.”Narrating what transpired after Abacha’s death, Useni said he was not aware of the death until about nine hours later, because some people did not want him to know.\n“Abacha was not a criminal; he was not as bad as people make him out to be."
  },
  {
    "headline": "Kano infernos kill 20, destroys multi-million naira properties",
    "summarized_story": "Twenty people have been killed and property worth N5.6 million destroyed in different fire incidents in the state in August in Kano State, Northwest Nigeria.\nThis is according to the State Fire Service spokesman, Mr Saminu Abdullahi, in a statement on Wednesday in Kano.\nMr Abdullahi said that the service also saved 102 lives and property worth N14.7 million in 16 fire incidents in the state during the period, NAN reported.\nHe said the service received emergency calls from 27 fire stations across the state in the period review.\n“The service responded to 81 rescue calls and 14 false alarms from residents of the state,” he added."
  },
  {
    "headline": "Breastfeeding: UNICEF Wants Imo Govt To Monitor, Track Best Practices",
    "summarized_story": "The Imo State government has been admonished to champion the crusade for active breastfeeding by mothers, through monitoring and tracking the progress of recommended best practices across the globe.\nADVERTISEMENTDr. Conteh highlighted that it is the responsibility of the state government to strengthen the links between health facilities, support breastfeeding and monitor the progress of policies, programmes and funding for breastfeeding.\nThe UNICEF boss, emphasised that UNICEF believe in a world where all mothers have the technical, financial, emotional and public support needed to start and continue breastfeeding.\nIn her contribution, Mrs Margaret Ndukwe, a farmer revealed that UNICEF in conjunction with the ministry of health had previously through advocacy, informed them about the advantages of exclusive breastfeeding.\nIn her comment, the Commissioner for Women Affairs and Vulnerable Group, Lady Nkechinyere Ugwu, stressed that the importance of exclusive breastfeeding can not be over emphasised."
  },
  {
    "headline": "Breastfeeding: UNICEF Wants Imo Govt To Monitor, Track Best Practices",
    "summarized_story": "The Imo State government has been admonished to champion the crusade for active breastfeeding by mothers, through monitoring and tracking the progress of recommended best practices across the globe.\nADVERTISEMENTDr. Conteh highlighted that it is the responsibility of the state government to strengthen the links between health facilities, support breastfeeding and monitor the progress of policies, programmes and funding for breastfeeding.\nThe UNICEF boss, emphasised that UNICEF believe in a world where all mothers have the technical, financial, emotional and public support needed to start and continue breastfeeding.\nIn her contribution, Mrs Margaret Ndukwe, a farmer revealed that UNICEF in conjunction with the ministry of health had previously through advocacy, informed them about the advantages of exclusive breastfeeding.\nIn her comment, the Commissioner for Women Affairs and Vulnerable Group, Lady Nkechinyere Ugwu, stressed that the importance of exclusive breastfeeding can not be over emphasised."
  },
  {
    "headline": "Federal Govt Begins Last Phase Of Survival Fund Scheme",
    "summarized_story": "The federal government has rolled out the last component of the Survival Fund programme known as the Guaranteed Off-take Scheme (GOS).\nGovernment said the purpose of the GOS is to stimulate direct local production by enabling 100,000 MSMEs in the production sector with funds to produce ‘post COVID lockdown’ off-take products.\nThese products include: face masks, hand sanitisers, liquid soap, disinfectants and processed foods such as garri, palm oil, groundnut oil, and spices.\n“There was also the need to ensure that every state government considered as key stakeholders in the GOS are fully integrated and understand their roles.\n“Furthermore, we needed to ensure that all logistics are put in place as close to each of the over 50,000 beneficiaries as possible."
  },
  {
    "headline": "Federal Govt Begins Last Phase Of Survival Fund Scheme",
    "summarized_story": "The federal government has rolled out the last component of the Survival Fund programme known as the Guaranteed Off-take Scheme (GOS).\nGovernment said the purpose of the GOS is to stimulate direct local production by enabling 100,000 MSMEs in the production sector with funds to produce ‘post COVID lockdown’ off-take products.\nThese products include: face masks, hand sanitisers, liquid soap, disinfectants and processed foods such as garri, palm oil, groundnut oil, and spices.\n“There was also the need to ensure that every state government considered as key stakeholders in the GOS are fully integrated and understand their roles.\n“Furthermore, we needed to ensure that all logistics are put in place as close to each of the over 50,000 beneficiaries as possible."
  },
  {
    "headline": "Nanono, Mamman’s Sack Can’t Cover Your Failures, PDP Tells Buhari",
    "summarized_story": "The Peoples Democratic Party (PDP) has reacted to the sack of two Ministers by President Muhammadu Buhari, saying the action was an infective attempt to cover for his failures in office.\nPresident Buhari on Wednesday sacked the Minister of Agriculture and Rural Development, Mohammed Sabo Nanono and his Power counterpart, Engr.\nThe opposition party said it was also investigating the real reason behind the duo’s sack given Mr. President’s public approach to fighting corruption by “easing out” the culprits.\nADVERTISEMENTThe national publicity secretary of PDP, Kola Ologbondiyan, said the inefficiency of Buhari administration is a product of myopic and divisive approach to governance as well as impunity and corruption in the All Progressives Congress (APC)-led administration.\n“The party calls on President Buhari and the APC to note that Nigerians are not swayed by the sack of the ministers but are eagerly awaiting the exit of the Buhari Presidency and the APC come May 29, 2023, as there is no hope in sight under their purview,” the party said."
  },
  {
    "headline": "Ronaldo sets new international goal record",
    "summarized_story": "Portugal’s Cristiano Ronaldo is now the all-time international scorer in men’s football with 111 goals, with a brace scored against Ireland, after missing a penalty.\nThe Manchester United old boy scored the late brace to break the international goalscoring record.\nThe Manchester United forward saw Gavin Bazunu, a Manchester City loanee, save a first-half penalty following a Jeff Hendrick foul on Bruno Fernandes.\nHe then produced a carbon copy in the sixth minute of stoppage time to score goal number 111 and secure all three points for the hosts.\nPortugal are top on 10 points after four games, three ahead of Serbia, who have played a game fewer."
  },
  {
    "headline": "Arsenal's Granit Xhaka tests positive for COVID-19",
    "summarized_story": "Arsenal midfielder and Switzerland captain Granit Xhaka has tested positive for COVID-19.\nHe was isolated while his team mates went ahead with their friendly against Greece in Basel on Wednesday.\n“Xhaka was diagnosed with symptoms on the morning of the game and was immediately isolated in his room.\nA rapid test turned out negative, the subsequent PCR test, carried out to be on the safe side, produced a positive result in the evening,” said a Swiss Football Association statement.\nXhaka, 28, will do another PCR test on Thursday."
  },
  {
    "headline": "JUST IN: President Buhari Mourns As Aisha Loses Son",
    "summarized_story": "Aisha Abubakar, a former Minister of State for Industry, Trade, and Investment, has lost her first son, Aliyu Abubakar, in a car accident.\nThree of the deceased’s siblings were also involved in the accident and are currently in the hospital.\n“The President prayed for a quick recovery for two brothers and sister of the deceased, who are currently in hospital following a road accident that claimed the deceased’s life,” the statement said.\nSenior Special Assistant to the President, Special Duties, Ya’u Darazo, Senior Special Assistant to the President, Media and Publicity, Garba Shehu, and State Chief of Protocol, Lawal Kazaure, were among those who conveyed the President’s message.\nThe minister thanked the President for sending the delegation and thanked the family for his expression of love and concern for them."
  },
  {
    "headline": "Buhari: Nigerians will feel impact of my projects when I leave office",
    "summarized_story": "President Muhammadu Buhari has said the impact of his project will be felt after he leaves office in 2023.\nThe president said this after inaugurating new board of the Nigeria Sovereign Investment Authority (NSIA).\nThe president restated his administration’s commitment to implementing long-term projects and programmes that create jobs for Nigerians.\nHe said the full impact of most of the strategic projects started under his watch would only be felt long after he had left office.\n“Accordingly, in the past four years, both the public and private sectors in Nigeria have partnered on strategic projects with the NSIA."
  },
  {
    "headline": "Police Confirm Abduction Of 73 Zamfara Students, Call For Prayers",
    "summarized_story": "The abduction of 73 students from Government Day Secondary School in Kaya has been confirmed by Zamfara State Police.\nKaya is a town in the state’s Maradun Local Government Area.\nAccording to Mohammed Shehu, the Police Public Relations Officer, a large group of bandits broke into the school at 11:22 a.m. on Wednesday.\nHe stated that the Commissioner, Ayuba Elkanah, has deployed a search and rescue team to collaborate with the military in order to free the students.\nElkanah urged the public, particularly the students’ parents and relatives, to “exert patience and continue to pray for the success of the current rescue mission.”To prevent additional attacks, security has been tightened up in Kaya village and its vicinity."
  },
  {
    "headline": "JUST IN: Uche Secondus Denies Being Suspended By PDP",
    "summarized_story": "Uche Secondus, the embattled Chairman of the Peoples Democratic Party, PDP, has disputed reports that he was suspended from his Ward 5 in Ikuru, Andoni Local Government Area, Rivers State.\nEleven of the party’s 17 executive members, according to the chairman, voted to expel Secondus.\n“Suspension of Prince Uche Secondus was done by the Ward executive after a duly constituted Ward meeting called by the Secretary on the instructions of the Chairman, according to the Constitution of our great party.\n“Until further notice, our brother, Prince Uche Secondus remains suspended.\nI want to thank you for coming and reaffirming the suspension of Uche Secundus,” he said."
  },
  {
    "headline": "Breaking: Ronaldo hits brace vs Rep. of Ireland , breaks International goal record",
    "summarized_story": "Cristiano Ronaldo broke the world record for goals scored in men’s international football as he hit his 110th and 111th goals for Portugal in their dramatic 2-1 World Cup qualifying win over the Republic of Ireland.\nThe Manchester United forward has also equalled Sergio Ramos’ European record for men’s caps – with his 180th Portugal appearance.\nThe world record – only ratified by Fifa this summer – is the 195 Malaysia caps won by Soh Chin Ann between 1969 and 1984.\nRonaldo, who rejoined United from Juventus on deadline day, and Daei are the only two male players to score 90 or more international goals.\nHow his international goals have comeWhat tournaments have they come in?"
  },
  {
    "headline": "Breaking: Zamfara govt imposes dusk-to-dawn curfew, shut down schools",
    "summarized_story": "Reports say the Zamfara state government has imposed a dusk-to-dawn curfew throughout the state.\nThe government has also shut down all schools, operating in all the local governments in the state.\nAccording to official, the curfew is from six o’clock in the evening to six o’clock in the morning.\nAccording to him, the curfew takes effect from 8 p.m. to 6 a. m in Gusau, the state capital, until further notice.\nHe said that the curfew was imposed as part of measures to tackle the growing banditry and kidnapping in the state."
  },
  {
    "headline": "Breaking: Police confirm how many students were kidnapped at another Zamfara school",
    "summarized_story": "Hours after, the Zamfara state Police command has confirmed that up to 73 students were on Wednesday kidnapped from Government Day Secondary school, Kaya in Maradun local government area.\nPolice Public Relations Officer in Zamfara SP Mohammed Shehu revealed this in a press statement in Gusau.\nAccording to the statement, “The Zamfara State Police Command wishes to confirm the abduction of 73 Students of Government Day Secondary school, Kaya in Maradun LGA.\nThe abduction followed the invasion of the school by large number of armed bandits that occurred today at exactly 1122hrs.\nSecurity has also been been beefed up at Kaya Village and environ to forestall further attack on the communities."
  },
  {
    "headline": "Terrorism: Nigeria, Turkey to strengthen Defence Relation -NigPilot",
    "summarized_story": "The Nigerian Army and its Turkish counterpart have pledged to strengthen Defence relations to tackle terrorism.\nAmbassador Bayraktar said the purpose of the visit was to improve upon the existing relationship between the two countries and assist Nigeria in its fight against terrorism.\nThe Ambassador further averred that like Nigeria, Turkey had equally been confronted with challenges of insecurity, pointing out that the Defence Corporations of both countries have to come into mutual agreement in order to curtail the activities of terrorists in both countries.\nThe Chief of Army Staff (COAS), described the visit as an opportunity to further enhance the existing cordial relationship between both countries, particularly the Land Forces of Turkey.\nHe disclosed that during his recent tour of Turkey, he paid a visit to the Turkish Defence Corporation, describing it as a very insightful tour."
  },
  {
    "headline": "Army denies alleged recruitment in 44 NA Reference Hospital -NigPilot",
    "summarized_story": "The Nigerian Army (NA) on Wednesday denied the alleged ongoing sales of Graduate Internship forms for recruitment into 44 Nigerian Army Reference Hospital Kaduna (NARHK).\nAccording to the statement, “The Nigerian Army (NA) has been notified of an advert making the rounds in the social media on sales of Graduate Internship forms for recruitment into 44 Nigerian Army Reference Hospital Kaduna (NARHK).\nThese online fraudsters are warned to desist from such criminal activities, which adversely affect the image and reputation of the Nigerian Army.\nIt is also important to state that at present, the Nigerian Army has not put out any advert for sales of forms.\nThe Nigerian Army however, reiterated that all activities relating to Graduate Internship recruitment into the 44 NARHK are usually publicized in the print and traditional electronic broadcast media when the need arises."
  },
  {
    "headline": "COAS vows to demystify invaders of NDA -NigPilot",
    "summarized_story": "Academy Public Relations Officer, Major Bashir Muhammad Jajira in a statement explained that the COAS made this pledge on Tuesday when he paid a visit to the Academy over the recent security breach in the Academy.\nGeneral Yahaya visited the Academy to get a firsthand brief on the incident and to commiserate with the commandant NDA, Maj Gen IM Yusuf, and the NDA community.\nThe COAS also undertook an on-the-spot assessment of the scene of the incident before departing the Academy.\nIn his welcome address, the Commandant NDA briefed the COAS on the security breach into the Academy which occurred on 24 August 2021.\nThe Commandant informed the COAS that these support measures have really boosted the morale of the staff and the security of the Academy."
  },
  {
    "headline": "Lukman to Ortom: Present your evidence of “fulanization”, “islamization” agenda -NigPilot",
    "summarized_story": "A chieftain of the All Progressives Congress, APC, and Director-General of Progressive Governors Forum, PGF, Dr. Salihu Moh.\nLukman has challenged Benue State governor, Samuel Ortom, to provide evidence of his claim that there is a sinister plot by the government of President Muhammadu Buhari to turn Nigeria into a Fulani and Islamic caliphate.\n“On the part of Governor Ortom, he claimed that he has forwarded his evidence to President Buhari and security agencies in the country.\nBut for a public servant as highly placed as that of a Governor, retire public servant, retire security personnel, etc.\nit portends a big danger, which if overlooked can produce a cult mentality in the country with all the ethnic and religious hatred associated with it."
  },
  {
    "headline": "UPDATED: Bandits Attack Zamfara School, Abduct Students",
    "summarized_story": "Bandits have abducted a yet-to-be ascertained number of students following an attack on Kaya Day Secondary School in Zamfara State.\nA source within the government, who pleaded anonymity, confirmed the attack on the school and the students’ abduction to Channels Television.\nSources explained that the assailants invaded the school in a large number and left with the students to an undisclosed location.\nBarely a week after the measures were put in place, bandits struck again as they invaded Kaya Day Secondary School.\nThis is the third attack on schools in Zamfara this year – coming after the incidents in Jangebe and Bakura areas of the state."
  },
  {
    "headline": "FG To Make Provision For Subsidy In 2022, Says NNPC Boss",
    "summarized_story": "The Federal Government will make provision for subsidy in 2022, Nigerian National Petroleum Corporation (NNPC) has said.\nAlthough no provision was made for fuel subsidy in 2021, he informed the lawmakers that the government had begun a conversation with relevant stakeholders to exit the subsidy regime.\nThe NNPC chief, however, stated that the process may not be concluded anytime soon, hence the need to reintroduce subsidy in the 2022 budget.\nOn Wednesday last week, the NNPC boss appeared before members of the House of Representatives Committee on Finance for a similar hearing on the 2022-2024 MTEF/FSP.\nKyari, who also responded to questions on the Dangote Refinery, justified the Federal government’s equity share in the plant."
  },
  {
    "headline": "Buhari Sacks Ministers Of Agriculture And Power",
    "summarized_story": "They are the Ministers of Agriculture and Rural Development, Mohammed Nanono, and his Power counterpart, Saleh Mamman.\nThe Special Adviser to the President on Media and Publicity, Femi Adesina, announced this on Wednesday in Abuja after the Federal Executive Council meeting.\nHe disclosed that the Minister of Environment, Mohammed Abubakar, has been redeployed to the Federal Ministry of Agriculture, while the Minister of State for Works, Abubakar Aliyu, is to take over as Minister of Power.\nThe exercise, according to Adesina, will continue in accordance with the provisions of the Constitution.\nThose affected are the present Minister of State for Labour and Employment, Festus Keyamo, and the Minister of State for Niger Delta Affairs, Senator Tayo Alasoadura."
  },
  {
    "headline": "NCDC DG Ihekweazu Appointed Assistant DG Of WHO",
    "summarized_story": "The Director General of the Nigeria Centre for Disease Control (NCDC), Chikwe Ihekweazu, has been appointed as the Assistant Director General of Health Emergency Intelligence at the World Health Organisation (WHO).\n“I am pleased to welcome Dr Chikwe Ihekweazu as an Assistant Director-General for Health Emergency Intelligence from November 1, 2021.\n“He will lead the work on strengthening pandemic and epidemic intelligence globally, including heading the WHO Hub for Pandemic and Epidemic Intelligence in Berlin.\nIn 2003, he was awarded a Fellowship for the European Programme for Intervention Epidemiology Training and subsequently completed his Public Health specialization in the United Kingdom.\nThis special event will also include a ceremony to recognize Chancellor Angela Merkel’s outstanding leadership in global public health."
  },
  {
    "headline": "Customs, NDLEA, DSS Uncover Prohibited Hard Drugs In Apapa Port",
    "summarized_story": "Operatives of the Nigeria Customs Service, National Drug Law Enforcement Agency and the Department of State Service have uncovered and seized cartons of Captagon Pills, a hard drug concealed inside the cylinder of an imported machine at the Apapa Port in Lagos State.\nThis followed intelligence and painstaking dismantling of the machine by personnel and sniffer dogs, the statement explained.\nSecurity sources at the port also noted that the seizure is a fallout of a renewed synergy and cooperation aimed at curbing any form of port-related lawlessness.\nThe heads of the three services insist that the operation will be sustained in the fight against all forms of smuggling and infractions.\nIt has also been linked as one of the most common stimulants being taken by insurgents."
  },
  {
    "headline": "Ivory Coast TV Presenter Convicted of Glorifying Rape",
    "summarized_story": "A television presenter in Ivory Coast was convicted on Wednesday of glorifying rape and given a one-year suspended prison sentence for asking a convicted rapist he invited onto his prime-time show to simulate a sexual assault using a mannequin.\nThe court also fined the presenter, Yves de Mbella, 2 million CFA francs ($3,619.91) and banned him from leaving Abidjan, the country’s commercial capital, for one year, a spokesperson for Ivory Coast’s justice system told Reuters.\nThe man who appeared on the show was sentenced to two years in prison, the spokesperson said.\nNCI also apologised and cancelled the final episode of de Mbella’s show, which had been scheduled for Friday.\nIvory Coast’s independent communications council on Tuesday ordered de Mbella suspended for 30 days, saying the segment had condoned rape and attacked the dignity of women."
  },
  {
    "headline": "Nigeria: More Trouble For Embattled PDP Chairman Secondus as Ward Suspends Him",
    "summarized_story": "There appears to be more trouble for the embattled national chairman of Nigeria’s opposition People’s Democratic Party (PDP) Uche Secondus as the executive committee of the party’s ward 5 in Ikuru, Andoni local government area of Rivers state, has suspended Mr Secondus.\nThe decision to suspend Secondus was reached at a meeting held at the party’s secretariat in Ikuru.\nThe Chairman of the ward, George Christopher said 11 of the 17 executive members approved the suspension of Secondus from the ward chapter of the party.\n“The ward executive of the Peoples Democratic Party in ward 5, Ikuru town, and the leaders met on the 31st of August, 2021 issues that affect the party,” Christopher said.\nThe calls were followed by orders from high courts in Rivers and Cross River states restraining him from parading himself as the national chairman of the PDP."
  },
  {
    "headline": "Nigeria: Zamfara Governor Matawalle Orders Closure of Schools after Gunmen Kidnap Over 70 Students",
    "summarized_story": "Governor of Nigeria’s northwestern state of Zamfara, Bello Matawalle has ordered the immediate closure of all secondary and primary schools in the state till further notice.\nThe governor’s order follows the abduction of scores of students at Kaya Day Secondary School in Maradun Local Government Area of the state by suspected terrorists.\nReports suggest the terrorists invaded the school on Wednesday morning at 11am, where they abducted students of the school to an undisclosed location.\nGovernor Matawalle is from Maradun Local Government Area where the students were abducted.\nKaya Day Secondary School is a mixed institution for both boys and girls and has about three hundred students."
  },
  {
    "headline": "US Administers Third Dose of Covid Vaccine to Over One Million People",
    "summarized_story": "The United States has administered a third dose of either Pfizer Inc or Moderna Inc’s COVID-19 vaccines to over 1 million people as of Wednesday morning, the U.S. Centers for Disease Control and Prevention said.\nU.S. health regulators authorized a third shot on Aug. 13, for people with compromised immune systems who are likely to have weaker protection from the two-dose regimens.\nThe country has administered 371,280,129 doses and distributed 443,741,705 doses of the two-dose vaccines from Moderna and Pfizer/BioNTech, as well as Johnson & Johnson’s one-shot vaccine.\nThose figures are up from the 370,212,027 vaccine doses the CDC said had gone into arms by Aug. 31 out of 441,332,155 doses delivered.\nThe agency said 205,527,578 people had received at least one dose while 174,600,017 people are fully vaccinated as of 6:00 a.m."
  },
  {
    "headline": "Zambian President Hichilema Inherits ‘Empty Treasury’",
    "summarized_story": "“People are still trying to make last-minute movements of funds, which are unauthorised, which are not theirs,” President Hakainde Hichilema said.\nMr Hichilema did not name any officials.\nHe was widely praised for the smooth transition of power to Mr Hichilema, who won the presidency after five failed attempts.\nMr Hichilema has appointed economist and former International Monetary Fund (IMF) adviser Situmbeko Musokotwane as finance minister.\nMr Hichilema said the government was committed to restoring its credibility among lenders."
  }
]