[
  {
    "headline": "NDLEA intercepts 12,385kg drugs smuggled into Lagos on waterways",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency at the weekend seized 12,385 kilograms of Loud Cannabis, a strong variant of the illicit weed imported from a neighbouring country and smuggled into Lagos through the waterways.\nThis was disclosed in a statement issued by the Director, Media and Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi on Sunday.\nThe previous day Tuesday 23rd Nov, 1,240kg was equally seized at a warehouse in Uzebba, Owan West LGA of the state.\nThe statement said other suspects arrested on Thursday, November 25 in the state for dealing in Meth, Cannabis, Cocaine, and Heroin include Ifeanyi Odibe, Uche Onwurah, and Justice Obika.\nHe charged them to always strive to record greater feats until the drug supply and drug demand reduction targets of the Agency are fully achieved."
  },
  {
    "headline": "Lagos can boost IGR through tourism, culture, says Sanwo-Olu",
    "summarized_story": "The Governor of Lagos State, Mr Babajide Sanwo-Olu, has said the state, and Nigeria by extension, has what it takes to improve the Internally Generated Revenue through tourism, arts and culture.\nSanwo-Olu said this at the celebration of Lagos Asa Day 2021 and the launching of Youth Empowerment Access Centre, held at De Blue Roof, Lagos Television, Lateef Jakande Road, Agidingbi, Ikeja, Lagos.\nThe event with the theme, ‘Let’s Use Our Cultural Heritage to Revive Our Economy,’ was organised by ASA Day Worldwide Inc. Canada in conjunction with the Lagos State Ministry of Tourism, Arts and Culture.\nThe Governor was represented at the event by the Commissioner for Tourism, Arts and Culture, Mrs Uzamat Akinbile-Yussuf.\nOther dignitaries at the event include the Special Adviser to the Governor on Tourism, Arts and Culture, Mr Solomon Bonu, some members of the Lagos State Executive Council and the Permanent Secretary, Ministry of Tourism Arts and Culture, Princess Adenike Adedoyin-Ajayi, among others."
  },
  {
    "headline": "Buhari charges agric varsities to bridge food insecurity gap",
    "summarized_story": "President Muhammadu BuhariPresident Muhammadu Buhari has challenged universities of agriculture in the country to bridge the gap of food insecurity and address the nation’s dependence on imported foods.\nThe News Agency of Nigeria (NAN) reports that Buhari said this on Saturday, at the 10th Convocation ceremony of Michael Okpara University of Agriculture Umudike (MOUAU), Abia.\nBuhari, who admitted that Nigeria is currently facing challenge of funding, however said that its endowments were far greater than constraints.\nMOUAU Chancellor, HRH Alhaji Shehu Abubakar, commended President Buhari and the university management for the smooth running of the institution.\n“Out of the 5,817 first degree graduands, 92 obtained first class honours, ,1775 with second class honours upper division, 2,905 had second class honours lower division, 1226 with third class and 18 with pass,” he said."
  },
  {
    "headline": "Borno APC blast PDP over alleged insensitivity to IDPs plight",
    "summarized_story": "By Ndahi Marama, MaiduguriThe Borno Chairman of the ruling All Progressives Congress, APC, Hon Ali Bukar Dalori, has described as unfortunate the attacking of Gov.\nBabagana Zulum APC- led administration by the opposition Peoples Democratic Party, PDP in the state over the distribution of N500 million for resettlement of Internally Displaced Persons (IDPs) from Maiduguri Bakassi camp to their respective local government areas.\nThe opposition party also called for the probe of the expenditure to see if the amount claimed was really spent.\nDalori said it is embarrassing and illogical for PDP to think of nothing rather than playing politics with the issue of security and the plight of IDPs in the state.\n“I don’t see anything wrong in empowering vulnerable persons, particularly thousands of IDPs that were given N100,000 per head of family and N50,000 for the women each, alongside food items and other incentives,” Dalori said."
  },
  {
    "headline": "National Assembly Chief Whip again distributes N34m to 540 vulnerable women, youths in Borno North",
    "summarized_story": "By Ndahi Marama, MaiduguriThe member representing Monguno, Nganzai and Marte federal constituency and the Chief Whip at the national assembly, Hon Mohammed Tahir Monguno has again distributed the sum of N34 million for the empowerment of 540 vulnerable women and youths, mostly Internally Displaced Persons, IDPs who have resettled back to their liberated communities.\nRecalled that, the Lawmaker has within the last three months embarked on a series of training and retraining of thousands of people across the constituency on Agricultural Businesses, Skills Acquisition, Managing Conflict among others.\nThe humanitarian lawmaker assured that government will continue to deploy modalities of hastening the return of IDPs to their respective homes considering the zeal displayed by the present administration.\nThey equally called on the Lawmaker to contest for Northern Borno Senatorial seat come 2023, in order to provide more dividends of democracy to the people at the grassroots.\nThe event was attended by ruling All Progressives Congress, APC stakeholders from the constituency including House of Assembly members, chairmen and secretaries among other dignitaries."
  },
  {
    "headline": "Bayelsa: This oil spill is national disaster — Ijaw",
    "summarized_story": "The landlord of Worikuma-Kiri, host to the troubled wellhead, Chief, Worikuma Ivory- Pegi elect, said the crude oil and gas discharge has destroyed his farm and land.\n“Now this crude oil on the river has dashed my hope.\nThe water has spread the crude oil everywhere.\nThe National Vice President II of the Ijaw National Congress, INC, Alabo Nengi James, submitted that the ecosystem had been adversely impacted as a result of the incident and called on the government to declare it a National Disaster.\nSunday Vanguard was reliably informed that three barges of 1,000 barrels capacity of recovered crude oil had been evacuated from the boomed area and the fourth one being loaded."
  },
  {
    "headline": "Port facility security officers bemoan criminal activities in Gulf of Guinea",
    "summarized_story": "By Godwin OritseNATIONAL Chairman of Ports Facility Security Officers Forum of Nigeria (PFSOFN), Ignatius Uche, has said that states in the Gulf of Guinea have lost billions of dollars due to sea piracy, armed robbery and other maritime criminal activities.\nHe said firm and unwavering action was needed as frontline officers in ports facility security so as to curb the threats and put them under control.\nAyika, who is also the chairman of Niger Delta Maritime Security Area, said there are security challenges in the GoG states but the ports facility security officers are making deliberate efforts to improve their services at the ports.\nAccording to her, to improve the security services, there is need for collaboration, hence the gathering of all ports security officers to share intelligence, which would aid in mitigating security challenges in the Gulf of Guinea.\nHe encouraged the ports security officers to put in their best to curb maritime crime, noting that there has been so much attacks on high seas."
  },
  {
    "headline": "Continuous dialogue critical to tackling telecoms industry challenges – NCC boss, Danbatta",
    "summarized_story": "Danbatta stated this during the second edition of NCC’s 2021 Talk to The Regulator (TTTR) forum held at Four Points by Sheraton, Lagos, over the weekend.\nThe Lagos edition of the programme followed the successful hosting of a similar dialogue in Kano on 16th October, 2021.\nThe objective of the forum is to get direct feedback from licensees on how the Commission, as a regulator, is meeting licensees’ expectations.\nWe consider our role as regulator very vital to ensuring industry sustainability, because NCC considers consultation as the lifeblood of regulation,” the EVC emphasised.\nHowever, Danbatta said some licensees are not doing as much as they ought to be doing."
  },
  {
    "headline": "EndSARS report: SERAP, 116 Nigerians drag Buhari to court",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) and 116 Nigerians have filed a lawsuit against President Muhammadu Buhari over the #EndSARS panel report for the alleged shooting of peaceful protesters at the Lekki toll-gate and police brutality cases.\nSERAP wants the Federal High Court, Abuja, to “direct and compel” President Buhari to take prompt steps by ensuring the arrest of policemen and soldiers indicted by the Lagos #EndSARS panel report.\nIn suit number FHC/ABJ/CS/1482/2021 filed on Friday, SERAP is also asking the court to direct President Buhari to ensure access to justice and effective remedies for victims, including suitable compensation.\nEndSARS: Controversy as panel members, govt clash over alleged technicalities, discrepancies in report“The safety of protesters in Nigeria remains as precarious as ever, and impunity for crimes against them is growing.\nMeanwhile, the date for the hearing of the suit is yet to be fixed."
  },
  {
    "headline": "Sustain aggressive offensive against insurgents, bandits – Army Chief, Yahaya tells troops",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant General Faruk Yahaya has directed troops of the Nigerian Army to sustain offensives against insecurities by insurgents and bandits in Nigeria.\nYahaya gave the directive on Saturday on Yola while addressing troops during an operational visit to the 23 Brigade.\nYahaya’s directives were made known in a statement by the Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu, in Abuja.\nThe Army chief assured the troops of his commitment to addressing all challenges confronting the troops to enable them to perform optimally.\nHe said that the troops needed to consistently train and bring their combat experiences to bear in tackling the adversaries decisively."
  },
  {
    "headline": "Ajimobi’s daughter cries out after being allegedly assaulted at night club",
    "summarized_story": "Ajay Ajimobi, one of the daughters of late former Oyo State Governor, Abiola Ajimobi has accused some bouncers of a Lagos nightclub of allegedly trying to assault her.\nAjimobi took to her Instagram on Saturday alleging that the bouncers ‘tried to put hands on her’ but thankfully she had her own security.\nThe 24-year-old warned them to be guided and stop acting like officers of the law.\nAlongside a video, she wrote: “Shortly after this, we got into a fight at Cocoon Lagos.\nTo be honest they are not sh*t at all, so please be guided for real.”"
  },
  {
    "headline": "Subsidy: N5,000 palliative huge disgrace, naira becoming useless – Archbishop Chukwuma",
    "summarized_story": "Dr. Emmanuel Chukwuma has asked the Federal Government to jettison the idea of paying N5,000 palliative to 40 million Nigerians.\nBut Archbishop Chukwuma, who rejected the removal of subsidy, described the proposed N5,000 palliative “as a huge disgrace.”He said this during a press conference on the activities lined up for the 50th Anniversary of the Enugu Diocese, Anglican Communion.\nBy the grace of God, he championed the course of Enugu Diocese for 27 years.\n“Right now, we have mapped out a one-week anniversary programme to celebrate the 50 years of Enugu Diocese.\n“Enugu Diocese is out to execute pragmatic evangelism; Enugu Diocese is out to make sure that we care for the poor, the less privileged, the widows, orphans and those who are displaced.”"
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Army, police dismiss reported clash in Imo",
    "summarized_story": "The Nigerian Army, 34 Artillery Brigade, Obinze, Owerri and the police command in Imo have dismissed social media reports of a clash between personnel of the two security agencies.\nThis is contained in a release co-signed by the Acting Assistant Director, Army Public Relations, Capt.\nIt said that law enforcement and security agencies in Imo would continue to synergise so as to bring to book all criminals and halt their activities in the state.\n“Please disregard as false the report making the rounds on some online media platforms of a gun duel between the personnel of the Nigerian Army and the Nigerian Police in Owerri.\n” All security agencies in the state will continue to discharge their constitutional mandate and ensure that lives and property are well protected, ” the statement read."
  },
  {
    "headline": "FRSC to impound vehicles with unregistered number plates",
    "summarized_story": "The Federal Road Safety Corps (FRSC) in Ogun State says it will begin to impound vehicles and motorcycles plying the roads with unregistered or unauthorised number plates from Monday.\nMr Ahmed Umar, the Sector Commander, stated that the operation would be carried out in conjunction with sister security agencies.\n“Pursuant to the primary role played by the FRSC in advancing national security through rigorous intelligence, it has been observed that many motorists go about with unauthorised or unregistered vehicles.\n“Therefore there will be a joint special enforcement with the police, the Ogun Traffic Compliance and Enforcement Corps and the Vehicles Inspection Office to checkmate erring motorists,’’ he stated.\n- Advertisement -Umar enjoined motorists and motorcycle operators to always go through appropriate authorities to register their vehicles."
  },
  {
    "headline": "PDP South Africa re-elects chairman",
    "summarized_story": "The People’s Democratic Party (PDP), South Africa Chapter, has re-elected Ekos Akpokabayen as its chairman.\nAkpokabayen emerged after the party’s elective congress held in Johannesburg, South Africa.\nPDP South Africa, Publicity Secretary, Michael Evah, who disclosed this in a statement, said the election was a two-horse race between a member of the party’s Board of Trustees, Tunji Omotola, and the incumbent Akpokabayen.\nEkos Akpokabayen came out with a landslide victory as the chairman-elect of the People’s Democratic Party South Africa Chapter.\nPublicity Secretary, Hon."
  },
  {
    "headline": "Police arrest two suspected armed robbers, recover arms in Delta",
    "summarized_story": "The Police Command in Delta has arrested two suspected armed robbers and recovered ammunition from them.\nThe spokesman of the Command, DSP Bright Edafe, disclosed this in a statement made available to newsmen on Sunday in Warri.\nHe explained that the patrol team was on a stop and search duty on the NPA Expressway, Warri, when they accosted the three suspects, with one currently at large.\n- Advertisement -“The suspects alighted from the motorcycle and one of them surprisingly shot at the patrol team and the team returned same.\nEdafe said that exhibits recovered from them included: one cut-to-size locally-made single-barrel gun, three live cartridges, and two expended cartridges."
  },
  {
    "headline": "APC governors move to hijack presidential ticket",
    "summarized_story": "From Romanus Ugwu, AbujaThe cold war raging in the All Progressives Congress (APC), especially between the APC progressive governors and the Presidency over zoning of the party’s positions and the 2023 presidential ticket deepened at the weekend.\n“The governors are hell-bent on one of them emerging as the party’s standard bearer for the 2023 presidential poll and they are not bulging on it.\nThey have taken their resolutions to Mr President, including the appeal that he endorses the plans for one of them to pick the presidential ticket of the party.\nThat must be the reason the North-central has been tactically endorsed to produce the party’s national chairmanship position.\n“With this arrangement, it is therefore easy to conclude that the North has also conceded the presidential ticket to the South for now."
  },
  {
    "headline": "Bandits go berserk in Niger, kill 2, abduct 63 more persons",
    "summarized_story": "From John Adams, MinnaArmed bandits laying siege to some villages in Zagzaga community in Munya Local Government Area of Niger State have prevented the people from evacuating the bodies of five vigilantes they killed in the area.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe local vigilantes were killed on Wednesday last week when they mobilised to ward off the incessant attacks by the bandits.\nNo fewer than 90 people have been abducted across seven villages in Zagzaga community in the last one week.\n“The bandits are still in the bushes in those areas, so our people could not go there."
  },
  {
    "headline": "Tension as gunmen abduct DPO in Edo, demand N50m ransom",
    "summarized_story": "From Tony Osauzo, BeninThe Divisional Police Officer (DPO) in charge of Etsako Central Local Government Area of Edo State, Ibrahim Aliyu lshaq, has been reportedly abducted by gunmen suspected to be kidnappers.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe was said to have been abducted around Ise River along the old Auchi-Ekperi- Agenebode road.\nAbout the time this ‎report was filed, his abductors were said to have demanded N50 million as ransom.\nSources said fear had enveloped‎ the community, with members debating the incident and arguing: “If a DPO can be abducted, who is safe?”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "How new Akinrun of Ikirun emerged",
    "summarized_story": "From Bamigbola Gbolagunte, AkureFresh facts have emerged on how Prince Yunus Olalekan Kadri emerged the Akinrun-elect in Ikirun, the headquarters of Ifelodun Local Government Area of Osun State.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe Elemo Aga of Ikirun who is one of the kingmakers in the town, High Chief Bamidele Onifade, revealed that the selection of Kadri was done after due consultation with the Ifa Oracle.\nHe explained that the choice of Kadri, who hails from Obaara Ruling House of Ikirun, was as a result of the judgment of an Osun State High Court delivered by Justice Jide Falola, which ordered the kingmakers to select a new traditional ruler from the ruling house next to the Gboleru ruling house following the inability of the Gboleru ruling house to present candidate for the vacant stool or Akinrun of Ikirun.\nClick here ."
  },
  {
    "headline": "Southeast govs abandoned my father in death –Ojukwu’s son laments",
    "summarized_story": "From Magnus Eze, EnuguAfamefuna Odumegwu Ojukwu, son of Bianca Ojukwu, has openly accused governors of the five Southeast states of abandoning his father, Dim Chukwuemeka Odumegwu Ojukwu, in death.\nOjukwu’s widow, Bianca, had raised similar issue in the past, including at the Second edition of Ojukwu Annual Lecture of the Chukwuemeka Odumegwu Ojukwu University, held on November 4, at the Igbariam Campus, Anambra State.\nOjukwu, leader of the defunct Republic of Biafra, who led his people to a 30-month civil war, died on November 26, 2011.\nHe said: “Ten years ago, when my father, Ikemba, Ezeigbo Gburugburu left us, I was a child.\n“Today, as we remember the passing of my father, let us celebrate our resilience as a people."
  },
  {
    "headline": "New COVID-19 Strain: Concerns Mount over Planned Visit of Ramaphosa to Nigeria",
    "summarized_story": "This development has prompted the ban of travellers from Southern African countries by the 27-member European Union (EU), and the United States, Britain, Canada, Israel, Saudi Arabia, Singapore, and UAE.\nCanada also banned travellers from seven African countries – Botswana, Eswatini, Lesotho, Mozambique, Namibia, South Africa, and Zimbabwe – over concerns about the variant.\nRamaphosa’s planned visit has raised concerns in Nigeria following the new strain of COVID-19.\nIs Nigeria going to receive the South African President and other officials when other countries are banning travellers from South Africa?\nHowever, only a few Nigerian firms are operating in South Africa."
  },
  {
    "headline": "In a Tribute to De Klerk, Gusau Highlights Nigeria’s Role to End Apartheid Regime",
    "summarized_story": "“On 2nd February 1990, while we were still working underground with their security officials, President de Klerk took the world by surprise.\nGusau said de Klerk’s historic speech had led to far-reaching political reforms and had also marked the beginning of the end of the apartheid regime in South Africa.\nWhen I sounded them out about whether they would like to visit South Africa, they were excited.\nI discussed the idea with South African officials, and it was agreed that they could undertake a visit.\n“In April 1992, President de Klerk undertook a three-day State Visit to Nigeria at the invitation of President Babangida."
  },
  {
    "headline": "CBN Set to Establish Int’l Financial Centre at Eko Atlantic City",
    "summarized_story": "According to him, most of the funds were invested in low-yielding assets relative to high-yielding opportunities in Nigeria.\nSecond, continued implementation of our intervention efforts would need to be undertaken to sustain the recovery efforts and stimulate further growth of the economy.\n“Through the pandemic, we are aware that our policy responses are often more effective when we work with the private sector.\nEmefiele also said efforts would be made to support firms geared towards producing goods for the export market.\nInfracorp is expected to raise over N15 trillion to support investment in critical infrastructure in Nigeria."
  },
  {
    "headline": "Again, Police, PSC Set to Clash over Recruitment of 10,000 Constables",
    "summarized_story": "But the Inspector General of Police (IG), Usman Alkali Baba, at the weekend called for applications from suitably qualified applicants for the 2021 recruitment exercise.\nThe 2020 recruitment exercise, however, ran into troubled waters when the police insisted that it had the mandate to recruit constables.\nBut the PSC had stood its ground, also insisting that it was constitutionally empowered to conduct recruitment for the police.\nThe retired IG said the 2020 recruitment exercise which was suspended midway was the third edition after the successful 2018 and 2019 exercises.\nBut the police high command at the weekend called for applications from suitably qualified applicants for the 2021 recruitment exercise."
  },
  {
    "headline": "Nigerians Good or Ugly, Great Exports All the Same",
    "summarized_story": "Inevitably, the news is dominated by the ugly Nigerians who get into trouble in foreign lands for criminal infractions and acts of lawlessness.\nBilateral air services arrangements are in distress just as the work permits of well over 500 Nigerians were recently not renewed for reasons not unconnected with the general conduct of ugly Nigerians.\nUnfortunately for the ugly Nigerians, China has no pretensions to liberal niceties or the finer points of human rights observances.\nAfter all, there are less than two million Nigerians in the diaspora as against the over 200 million Nigerians living in the homeland.\nBoth noble and ugly Nigerians bring back good money which we desperately need to survive."
  },
  {
    "headline": "Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In Nigeria",
    "summarized_story": "WATCH VIDEO: Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In NigeriaVideo of Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of LawYou may also like"
  },
  {
    "headline": "FG: We've rejected 90% of airlines' applications for expatriates",
    "summarized_story": "The federal government says it rejected about 90 percent of the applications by airline operators for expert quotas in their business.\n“Government is not going to lord it on Nigeria Air how they operate, but we are warning the owners of Nigeria Air that Nigerian jobs are paramount.\n“And I can guarantee you that 90 percent of the applications are rejected.\nThe minister said the federal government had been receiving applications from airlines to bring in airplanes into Nigeria on a daily basis.\nHe said all requests by the airline operators has been granted since he assumed office."
  },
  {
    "headline": "FG: We've rejected 90% of airlines' applications for expatriates",
    "summarized_story": "The federal government says it rejected about 90 percent of the applications by airline operators for expert quotas in their business.\n“Government is not going to lord it on Nigeria Air how they operate, but we are warning the owners of Nigeria Air that Nigerian jobs are paramount.\n“And I can guarantee you that 90 percent of the applications are rejected.\nThe minister said the federal government had been receiving applications from airlines to bring in airplanes into Nigeria on a daily basis.\nHe said all requests by the airline operators has been granted since he assumed office."
  },
  {
    "headline": "Many feared dead as petrol tanker explodes in Ogun",
    "summarized_story": "Many people are feared dead after a petrol-laden tanker exploded around Oju Irin in Lafenwa area of Abeokuta, Ogun state.\nBabatunde Akinbiyi, the spokesperson, Traffic Compliance and Enforcement Corps (TRACE), confirmed the incident.\nAdvertisementAkinbiyi said the tanker exploded owing to the uncooperative attitude of people around the axis, who he said were scooping petrol, which sparked the fire.\nHe asked residents to vacate the vicinity, saying TRACE, police, Federal Road Safety Corps (FRSC) and the Fire Service are on the ground to bring the situation under control.\nAhmed Umar, the FRSC sector commander in the state, also confirmed the incident, saying officers of the command are around to control traffic."
  },
  {
    "headline": "Many feared dead as petrol tanker explodes in Ogun",
    "summarized_story": "Many people are feared dead after a petrol-laden tanker exploded around Oju Irin in Lafenwa area of Abeokuta, Ogun state.\nBabatunde Akinbiyi, the spokesperson, Traffic Compliance and Enforcement Corps (TRACE), confirmed the incident.\nAdvertisementAkinbiyi said the tanker exploded owing to the uncooperative attitude of people around the axis, who he said were scooping petrol, which sparked the fire.\nHe asked residents to vacate the vicinity, saying TRACE, police, Federal Road Safety Corps (FRSC) and the Fire Service are on the ground to bring the situation under control.\nAhmed Umar, the FRSC sector commander in the state, also confirmed the incident, saying officers of the command are around to control traffic."
  },
  {
    "headline": "INTERVIEW: My election as ITTF VP an endorsement of Nigeria's strides in table tennis, says Oshodi",
    "summarized_story": "Wahid Enitan Oshodi recently made history as the second Nigerian to be elected vice-president of the International Table Tennis Federation (ITTF).\nWhat improvement in African table tennis do you plan to drive with your new position?\nAfrica has a lot of fantastic young players and we need to help them develop their skills and grow to become top players.\nNigerian-based table tennis players often complain that there aren’t enough competitions to keep them at the level needed to compete with their peers around the world.\nThe federal and state governments can’t fund all events, so we need to work harder in seeking alternative funding for competitions."
  },
  {
    "headline": "African female founders need access to high-impact mentors",
    "summarized_story": "Beyond funding, African female entrepreneurs need access to high-impact mentors and who are willing to open up their network and teach what they know.\nWhile FirstCheck argues that African women in tech are “over-mentored” and “under-funded”, early-stage female founders need some handholding.\nSo Ouffata founded The African Tech Vision (ATV) to create and open up entrepreneurial pathways for ambitious African female founders and executive leaders.\nEmpowering African female entrepreneurs at scaleThe African Tech Vision is a free entrepreneurial programme designed to support early-stage African female founders and help them achieve their goals.\nFor Ouffata, betting on African female founders is a personal decision that fits into the larger vision of The African Tech Vision program."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "The next frontier for fintech: Disruptive business models",
    "summarized_story": "Africa’s fintech industry is one of the largest and probably the most advanced.\n“We would see more fintech companies, funding more fintech companies.\nCurrently, the fintech industry is very API and cloud computing driven.\nHowever, Olowe and Hassan believe that rather than disruptive technologies, it would be a more disruptive business model.\nCiting companies like Inflow Finance and Sproutly Nigeria, Hassan says infrastructure like Mono’s would be the base of novel business models."
  },
  {
    "headline": "Nigerian fintech startup, FairMoney, hosts its first “Investor Conference”",
    "summarized_story": "Laurin Hainy, CEO and Co-Founder of FairMoneyAs of October 2021, Africa: The Big Deal reported that 57% of the amounts raised which was slightly above $1.6 billion has gone to fintech startups.\nOne such fintech is FairMoney, a digital bank that currently offers lending services in Nigeria, India, and France.\nL – R: Oluwatomide Oluwole, Finance Manager, FairMoney; Henry Obiekea, VP CapitalMarkets, FairMoney; Yaw Mante, Head, Finance – FairMoney and James Edeh, Head,Compliance, FairMoney, at the FairMoney investor’s conference.\nThey need to be able to pay, they need to be able to save, they need to be able to invest.\nThere was also a panel session on the role of fintech startups in financial inclusion in Nigeria."
  },
  {
    "headline": "Nigeria’s ranking on NFTs, Asilimia’s $2m funding, OnePipe’s $3.5m seed",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Nigerians and NFTsAsilimia’s $2m fundingOnePipe’s $3.5m seedNigeria’s NFT rankingA new report by Finders.com shows that 13.7% of Nigerian Internet users own non-fungible tokens (NFTs).\nThe report was based on a survey conducted on 1,205 Nigerian Internet users.\nThe survey also went on to estimate that Nigeria’s NFT ownership rate could reach 35% as 21.7% of the surveyed Internet users, plan to own NFTs.\nCan 1,205 Internet users out of 101.72 million tell the true story about NFTs in Nigeria?\nOnePipe’s $3.5m seedOnePipe teamNigerian fintech API, OnePipe, has closed a $3.5 million seed, co-led by Atlantica Ventures, Tribe Capital and V&R Associates."
  },
  {
    "headline": "2023 elections: Nigeria back to pre-1999 era",
    "summarized_story": "For him, Nigeria is in a more precarious situation now than in the pre-1999 election era; a development, according to him, makes nonsense of the 22 years of democratic rule.\nHe accused the ruling class of plunging more Nigerians today into the abyss of poverty than was the case in 1998 before the elections in 1999.\nToday, the sing song in society is that Nigeria has never had it so bad.\n“Politics is all struggles for political power among interests and so, no interest will want to easily relinquish power or allow power shift.\nThe political drama of the pre and post 1993 era was part of what paved the way for a South-West president in 1999."
  },
  {
    "headline": "Should you be worried about Omicron, new covid variant?",
    "summarized_story": "Should you be worried about Omicron, new covid variant?\nNews of the variant prompted countries to announce new travel restrictions on Friday and sent drug makers scrambling to see if their COVID-19 vaccines remain protective.\nThese countries introducing ban on flights include the UK which said Saturday that two cases of Omicron have been found there.\nThe World Health Organization on Friday classified the B.1.1.529 variant, or Omicron, as a SARS-CoV-2 “variant of concern,” saying it may spread more quickly than other forms of coronavirus.\nBut the biggest question remains whether protection from COVID-19 vaccines – nearly 8 billion doses have been administered globally – will hold up."
  },
  {
    "headline": "Despite FG’s lift on sanctions, Emirates yet to announce flight resumption",
    "summarized_story": "Despite FG’s lift on sanctions, Emirates yet to announce flight resumptionA day after the federal government lifted sanctions on Emirates, the airline is yet to announce flight resumption.\nAs at Saturday morning, information on the airline’s website states that Emirates direct flight operations to and from Nigeria is still on hold.\nIf your flight has been cancelled or impacted by route suspensions due to COVID-19 restrictions, you don’t need to call us immediately for rebooking.\nBut on Friday, the federal government lifted restrictions on Emirates Airlines — ten months after the diplomatic discussions around COVID-19 travel requirements on Nigerian passengers.\nIn February, Emirates directed Nigerian travellers at the Lagos and Abuja airports to conduct rapid COVID-19 tests before departure, which led to a ban on Emirates flights in Nigeria."
  },
  {
    "headline": "EDO MODULAR REFINERIES AND REMOVAL OF FUEL SUBSIDY – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe two modular refineries in Edo State have the capacity to end the importation of petroleum products in South-South region of Nigeria.\nThe two modular refineries will end fuel subsidy in the South-South region of Nigeria.\nEdo Modular Energy refinery is set to increase crude oil production from 6,000 barrels per day (bpd) to 60,000 bpd.\nThe modular refineries in Edo State are capable of eliminating petrol subsidy in the South-South region of Nigeria.\nDupot Oil Modular Refinery, Egbokor Village, Iyoba Ward, Orhionmwon Local Government ,Edo Modular and Refinery Company Ltd. and AIPCC Energy, were on the verge of completing the 5,500bpd Edo Modular Refinery, now at 70 per cent completion stage."
  },
  {
    "headline": "Obaseki celebrates Benin Club at 90, urges innovation, infrastructural devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, led other top government functionaries to the 90th anniversary celebration of Benin Club, hailing the management and members of the club for its achievements since 1931.\nThis led to the creation of the European Club now Benin Club, created in 1931.\n“We are celebrating history as the Benin Club is part of modern Benin and Edo history.\nIn his welcome address, President of Benin Club 1931, Pharm.\nFred Iboi noted, “We have achieved tremendous progress in the area of infrastructural development of the Benin Club and have installed facial recognition gadget at the access gate, which was commissioned by Governor Godwin Obaseki.”..."
  },
  {
    "headline": "Obaseki assures support for tertiary institutions in Edo to drive socio-economic devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki has said his government will continue to support tertiary institutions in the state to effectively play their roles in the development of the state and country.\nObaseki, who spoke during the 46th and 47th convocation ceremony of the University of Benin (UNIBEN), described as key, the role of universities in driving development in any society.\nAccording to him, universities nurture a crop of thinkers and innovators who birth ideas that drive societal growth, development and prosperity.\n“We are conscious, as a government, to sustain the role of the university in driving economic growth and advancement.\nWe currently host the largest concentration of higher educational institutions in the South-South of Nigeria."
  },
  {
    "headline": "Fraudulent texts: Alaghodaro board alerts public to antics of mischief makers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Alaghodaro Economic Summit LTD/GTE has warned members of the public about the activities of a criminal syndicate which is sending text messages with the intent to perpetuate fraud.\nIn a statement, Secretary of the board of the Alaghodaro Economic Summit LTD/GTE, Mrs. Eire Ifueko Alufohai Esq., urged the public to be wary of the messages asking members of the public to partake in a survey purportedly run by Access Bank on the just concluded Alaghodaro Summit.\nAccording to her, “Members of the public are warned to be wary of the antics of mischief makers and fraudsters who are sending fraudulent text messages with an intent to perpetrate fraud in the name of the Alaghodaro Economic Summit LTD/GTE.\n“The public is warned to be careful and wary of the antics of those behind this scheme as it is patently fraudulent and filled with malicious intent.\nThey are advised to kindly disregard the text messages.”..."
  },
  {
    "headline": "First Bank partners Junior Achievement Nigeria to host NCOY 2021",
    "summarized_story": "First Bank of Nigeria Limited has partnered with Junior Achievement Nigeria (JAN) to host its annual flagship event, the National Company of the Year competition (NCOY), which convenes winners of the JA Company Regional Competitions across Nigeria to compete for the National Company of the Year Award.\nThe 2021 edition of the NCOY competition will be held virtually via Zoom meetings at 10am on Saturday, 27th November 2021.\nThe 2021 National Company of the Year Program will also feature SPARK Competition.\nSPARK as an initiative of First Bank of Nigeria Limited, is an acronym for Start Performing Acts of Random Kindness.\nOur commitment to fostering entrepreneurial development amongst youths is mainly the driving force behind our support of the National Company of the Year (NCOY) and Africa Company of the Year (ACOY) competitions in past 11 years”."
  },
  {
    "headline": "Oyetola seeks citizens’ continued support, prayers as he marks three years in office",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Adegboyega Oyetola, on Friday, expressed gratitude to citizens and residents of the state for their prayers, love and support for his administration in the last three years.\nWhile urging the people to continue to pray for and support the government, Oyetola pledged to build on the successes recorded so far and deliver more dividends of democracy to the people.\n“We want you to continue to support our Administration particularly with prayers and wise counsel.\nWe believe strongly in the efficacy of prayers, that is what we stand on and this has been working for us.\nHe extolled Governor Oyetola for fulfilling the promises made to the people, urging him not to relent in his efforts to continuously bring succour to the people of the State."
  },
  {
    "headline": "Osun 2022: PDP has no candidate yet and nobody is my favourite – Adagunodo",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe National Vice Chairman of the Peoples Democratic Party (PDP) in the South West, Hon.\nOlasoji Adagunodo has said the party has no anointed or adopted candidate ahead of the 2022 gubernatorial contest in Osun State.\nHon Adagunodo stressed further that even if a candidate is adopted as consensus candidate, the constitution mandates the party to go to the field and do affirmation.\nOn who is his favourite aspirant, Adagunodo said he has none but that he will definitely have someone he will have sympathy for at the right time.\nAdagunodo also assured that PDP will win in Ekiti, Osun, the entire South West and also win the presidential election in 2022 and 2023 and beyond because the present APC regime has failed Nigerians in all sectors, economy, education, infrastructure and virtually in every aspects imaginable."
  },
  {
    "headline": "3rd Anniversary: ‘Your performance is inexhaustible,’ Osun APC Igbimo Agba Rejoices with Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe apex body of the All Progressives Congress, APC, in Osun State, Igbimo Agba, has described the performance of the state governor, Mr. Adegboyega Oyetola in the last three years as inexhaustible just as it rejoiced with the governor on the occasion of his 3rd year in office.\nThis was contained in a congratulatory message issued and signed by its chairman, Engr.\nAccording to the release, the APC body described the three years of Oyetola’s administration as full of infrastructural development in all facets of life, saying that Osun is blessed for having governor Oyetola at this critical period of economic crunch.\n“The entire body of APC, IGBIMO AGBA OSUN under my leadership heartily rejoice with Your Excellency- Alh Isiaka Adegboyega Oyetola on the third year anniversary of the APC led Government in Osun State precisely on the 27th day of this month of November, 2021,” he said.\n“Catalogue of achievements of this administration in the past three years is almost inexhaustible which touched and transformed all sectors within the State."
  },
  {
    "headline": "2023: Stakeholders Urge Mao Ohuabunwa To Return For Abia North",
    "summarized_story": "Disturbed by political developments in the Abia North senatorial district in the past two and a half years, concerned natives and stakeholders under the aegis of Abia North Progressive Group have called on Senator Mao Ohuabunwa to salvage the situation in the senatorial district.\nThey said it would be grave negligence, betrayal of their conscience and unpatriotic if they allow this to continue beyond June 2023.\nMao Ohuabunwa is a parliamentarian par excellence, his mark in the Green Chamber and then the Red Chamber is unparalleled and indelible.\n“We want to say that we are very much ready to support you and ensure that you win come 2023.\nThey threatened to occupy his residence if necessary to ensure he heeds their call and declare his interest to return to the senate."
  },
  {
    "headline": "2023: Stakeholders Urge Mao Ohuabunwa To Return For Abia North",
    "summarized_story": "Disturbed by political developments in the Abia North senatorial district in the past two and a half years, concerned natives and stakeholders under the aegis of Abia North Progressive Group have called on Senator Mao Ohuabunwa to salvage the situation in the senatorial district.\nThey said it would be grave negligence, betrayal of their conscience and unpatriotic if they allow this to continue beyond June 2023.\nMao Ohuabunwa is a parliamentarian par excellence, his mark in the Green Chamber and then the Red Chamber is unparalleled and indelible.\n“We want to say that we are very much ready to support you and ensure that you win come 2023.\nThey threatened to occupy his residence if necessary to ensure he heeds their call and declare his interest to return to the senate."
  },
  {
    "headline": "Ex-agitator, Ogoni Group Fault Appointment of Non-Ogoni As HYPREP Coordinator",
    "summarized_story": "A former Niger Delta agitator, Chief Solomon Ndigbara and the Ogoni Development Drive (ODD) have faulted plans by the federal government to appoint a non-Ogoni, Professor Philip Shekwolo, as the project coordinator of the Hydrocarbon Pollution Remediation Programme (HYPREP).\nHYPREP is the federal government agency overseeing the cleaning up of Ogoni polluted environment as recommended by report of the United Nations Environment Programme (UNEP).\nNdiagba said: “We did not write that they (federal government) should send a Hausa person to come and head HYPREP.\n“Ogoni youths and elders say capital No to Philip Shekwolo as substantive HYPREP coordinator.\nThat Ogoni people have sons and daughters who are more than qualified to pilot the affairs of HYPREP as coordinators."
  },
  {
    "headline": "Ex-agitator, Ogoni Group Fault Appointment of Non-Ogoni As HYPREP Coordinator",
    "summarized_story": "A former Niger Delta agitator, Chief Solomon Ndigbara and the Ogoni Development Drive (ODD) have faulted plans by the federal government to appoint a non-Ogoni, Professor Philip Shekwolo, as the project coordinator of the Hydrocarbon Pollution Remediation Programme (HYPREP).\nHYPREP is the federal government agency overseeing the cleaning up of Ogoni polluted environment as recommended by report of the United Nations Environment Programme (UNEP).\nNdiagba said: “We did not write that they (federal government) should send a Hausa person to come and head HYPREP.\n“Ogoni youths and elders say capital No to Philip Shekwolo as substantive HYPREP coordinator.\nThat Ogoni people have sons and daughters who are more than qualified to pilot the affairs of HYPREP as coordinators."
  },
  {
    "headline": "We‘ll Continue To Support Security Agencies To Deliver On Mandates – Makinde",
    "summarized_story": "Oyo State governor, Seyi Makinde has said his administration will continue to support security agencies operating in the state to deliver on their mandates.\nMakinde, who stated this at the government house, Agodi, Ibadan, while receiving state directors of the Department of State Services in the south west states, who were in the state to hold the zonal conference of directors of state services, said security, is key to the successful implementation of government policies.\nHe said: “We welcome you to Ibadan and I am glad that the conference went very well.\nYou were able to interact and identify some of the security challenges within the geopolitical zone.\nWe can win the war with brute force but can we win peace with the same force?"
  },
  {
    "headline": "$3.48bn loan: Nigeria risks losing assets to China, experts warn FG",
    "summarized_story": "Economic and financial experts have warned the Federal Government that Nigeria risks losing key national assets to China in the event that it defaults in paying back loans obtained from China which is currently put at $3.48bn.\nThis came as Nigeria’s Minister of Transportation, Rotimi Amaechi, in August 2020 hinted about the possibility of Nigeria forfeiting its assets to China in the event of loan default.\nHowever, financial analysts hinted about the possibility of Nigeria forfeiting key national assets to China if the country defaulted on its $3.48bn loans.\nAsked if Nigeria faced any risks on its China loans, Gbolade said, “Yes, it is very possible.\nThe first loan project was for the Nigerian national public security communication system project with $399.50m agreed on December 20, 2010 and disbursed."
  },
  {
    "headline": "$3.48bn loan: Nigeria risks losing assets to China, experts warn FG",
    "summarized_story": "Economic and financial experts have warned the Federal Government that Nigeria risks losing key national assets to China in the event that it defaults in paying back loans obtained from China which is currently put at $3.48bn.\nThis came as Nigeria’s Minister of Transportation, Rotimi Amaechi, in August 2020 hinted about the possibility of Nigeria forfeiting its assets to China in the event of loan default.\nHowever, financial analysts hinted about the possibility of Nigeria forfeiting key national assets to China if the country defaulted on its $3.48bn loans.\nAsked if Nigeria faced any risks on its China loans, Gbolade said, “Yes, it is very possible.\nThe first loan project was for the Nigerian national public security communication system project with $399.50m agreed on December 20, 2010 and disbursed."
  },
  {
    "headline": "2023 Presidency: Atiku is my candidate, not Tinubu – Mr Ibu",
    "summarized_story": "In a video that went viral, the funnyman was seen alongside other Nollywood actors ‘pledging alliance’ to the APC leader.\nHowever, in a twist of event, the actor took to his verified Instagram page to make a video to clear the air.\nReacting to the viral video, Mr Ibu said, “I do not know why this thing is going on like this.”Mr Ibu said that Atiku has been like a father to him and the former Vice-President got him a house to ‘use for the main time’.\nOkafor noted that his presidential candidate in the 2023 election is Atiku Abubakar.\nAtiku is my candidate.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "2023 Presidency: Atiku is my candidate, not Tinubu – Mr Ibu",
    "summarized_story": "In a video that went viral, the funnyman was seen alongside other Nollywood actors ‘pledging alliance’ to the APC leader.\nHowever, in a twist of event, the actor took to his verified Instagram page to make a video to clear the air.\nReacting to the viral video, Mr Ibu said, “I do not know why this thing is going on like this.”Mr Ibu said that Atiku has been like a father to him and the former Vice-President got him a house to ‘use for the main time’.\nOkafor noted that his presidential candidate in the 2023 election is Atiku Abubakar.\nAtiku is my candidate.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "BREAKING: Petrol Tanker Overturns, Explodes In Ogun",
    "summarized_story": "On Sunday, a tanker carrying Premium Motor Spirit, also known as gasoline, exploded in Abeokuta, the capital of Ogun State.\nThe tanker overturned around 04.45 a.m. while on its way inbound Rounder from Oju-Irin, Lafenwa, Abeokuta, according to our correspondent.\nTransloading was underway, according to Akinbiyi, who urged the general public, particularly those living or traveling near the axis, to be calm and cooperative.\nAs of the time of reporting this article, it was not immediately clear if there had been any casualties.\nMeanwhile, motorists traveling inward on the Rounder axis from Lafenwa are advised to take the Olomore and Oke-Ata axes as alternate routes."
  },
  {
    "headline": "EndSARS Report: Buhari Dragged To Coury By SERAP And 116 Nigerians.",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) and 116 Nigerians have launched a lawsuit against President Muhammadu Buhari over the #EndSARS panel report and allegations of police violence at the Lekki toll-gate.\nSERAP is asking the Federal High Court in Abuja to “command and compel” President Muhammadu Buhari to take immediate action to ensure the arrest of the police and soldiers officials named in the Lagos #EndSARS panel report.\nIn suit number FHC/ABJ/CS/1482/2021 filed on Friday, SERAP is also asking the court to direct President Buhari to ensure access to justice and effective remedies for victims, including suitable compensation.\n“The safety of protesters in Nigeria remains as precarious as ever, and impunity for crimes against them is growing.\nMeanwhile, the date for the hearing of the suit is yet to be fixed."
  },
  {
    "headline": "All Nigerians Should Join Anti-Graft War To Make The Country Great – Buhari",
    "summarized_story": "President Muhammadu Buhari said yesterday that if Nigeria is to attain greatness, Nigerians must join the anti-corruption fight, which he claims the government cannot win on its own.\nHe challenged Nigerians to develop a culture of discipline, hard work, honesty, and inspiring leadership in their country.\nThe president described education as the bedrock of national development while stressing that its importance could not be over-emphasised.\n“The Federal Government has not relented in finding lasting solutions to the myriad of challenges facing our universities and the nation’s education sector.\n“It is also imperative that universities should come to terms with the present realities, including the challenge of inadequate funding."
  },
  {
    "headline": "Nigeria Has No Reason To Import Food, Raw Materials – President Buhari",
    "summarized_story": "President Muhammadu Buhari expressed his displeasure Wednesday with Nigeria’s persistent reliance on imported food and raw materials, despite the country’s enormous resources and knowledge.\nBuhari also urged Nigerian institutions to step up their efforts to produce the COVID-19 vaccine in order to combat the country’s deadly illness.\nHe made these remarks at the convocations of the Federal University, Dutsin-Ma, Katsina State and Michael Okpara University of Agriculture Umudike (MOUAU), Abia State.\n“We can and should be able to feed ourselves on the rich soils and diverse ecologies that God has endowed Nigeria with.\nAt Federal University, Dutsin-Ma, Buhari admonished Nigerian universities to intensify their researches to develop a COVID-19 vaccine to tackle the dreaded virus afflicting the country."
  },
  {
    "headline": "Breaking: Explosion rocks Abeokuta as fire engulfs popular market",
    "summarized_story": "A fuel-laden tanker was engulfed in fire early Sunday morning while trying to make it’s way inbound Rounder from Oju Irin in Lafenwa area of Abeokuta, the Ogun state capital.\nConfirming the incident, the TRACE Corp Public Relations Officer, Cdr.\nBabatunde Akinbiyi, stated that the incident was due to the uncooperative attitude of people around the axis who were scooping fuel and other unwholesome act which sparked off the fire.\n“The earlier reported tanker laden with fuel which overturned while making its way inbound Rounder from Oju-Irin, Lafenwa, is now engulfed in fire, due to the uncooperative attitude of people around the axis through scooping of fuel and other unwholesome act which sparked off the fire.\n“The general public are advised to vacate the vicinity, while TRACE, POLICE, FRSC, FIRE SERVICE and other 1st responders resolve the latest emergency,” he statedDetails loading…"
  },
  {
    "headline": "Revealed! How Police trapped, killed notorious bandit terrorising Abuja-Kaduna highway",
    "summarized_story": "A notorious bandit terrorising Kaduna-Abuja Highway identified as Yellow Magaji has been gunned down by police operatives in Kaduna.\nThis was disclosed in a statement signed by the Police Public Relations Officer (PPRO) Kaduna State Command, ASP Muhammed Jalige, dated November 27, 2021.\n“One notorious bandit popularly called Yellow Magaji a.k.a Arushe was wounded in the shootout whereas his equally notorious partner, Yellow Ashana and others escaped with bullet wounds,” the statement said.\nThe statement explained that the wounded bandit was thereafter taken to Barau Dikko Teaching Hospital for possible resuscitation in a bid to obtain useful information but was confirmed dead on arrival by a medical doctor.\n“It is significant to state that the neutralised bandit Yellow Magaji until his demise was among a syndicate of bandits terrorising Kaduna-Abuja highway of recent,” it said."
  },
  {
    "headline": "WHO calls latest COVID-19 variant ‘Omicron’",
    "summarized_story": "The latest COVID-19 variant identified in South Africa has been given the Greek name ‘Omicron’, and labeled as a variant of concern by UN health agency experts due to its large number of mutations and possible faster rate of infection.\nCurrently the number of cases appears to be increasing in almost all provinces in South Africa.\nThe experts have asked countries to enhance surveillance and genome sequencing efforts to better understand the variant.\nOn Wednesday, WHO’s COVID-19 technical lead, Dr. Maria Van Kerkhove, said the information about the now ‘Omicron’ variant is still limited.\nEarlier today, the UN health agency urged all countries to adopt a risk-based and scientific approach to travel bans linked to the new variant identified in South Africa and Botswana."
  },
  {
    "headline": "In Zamfara, another APC chairman, other executive members emerge",
    "summarized_story": "The All Progressive Congress (APC) Zamfara state chapter has conducted congress where Tukur Danfulani along with 35 others emerged as newly elected executive members of the party for the next four years.\nSpeaking shortly after the elective congress, the committee chairman sent by the national headquarters of the APC, Ibrahim Masari, described the congress as credible and peaceful.\nIn his acceptance speech, the newly elected chairman Tukur Danfulani promised to carry everyone along among members and supporters of the party for the development of APC and democracy.\n“We shall strive to build the party for it’s victory come 2023 not only in Zamfara state but the country at large,” Danfulani said.\nMatawalle tasked newly elected leaders on the needs to be creative, prudence and transparency while discharging their primary responsibility."
  },
  {
    "headline": "[Breaking] FIBA 2023 World Cup qualifier: Nigeria’s D’Tigers return to winning ways, subdue Mali",
    "summarized_story": "Nigeria’s D’Tigers on Saturday beat Mali 72-70 in the ongoing FIBA 2023 World Cup qualifier.\nD’Tigers had lost to Cape Verde in the opening game two days ago.\nThe Nigerian team need to win their last match to brighten chances of moving to the next stage of the qualifier.\nThey will battle Uganda, another country in same group on Sunday.\nDetails loading…"
  },
  {
    "headline": "NANS rejects proposed subsidy removal, payment of N5000 to 4om Nigerians -",
    "summarized_story": "The National Association of Nigerian students has rejected the proposed subsidy removal of the federal government and payment of five thousand naira to 40 million poor Nigerians as transportation grant.\nThe students body threatened to shut down the country should the federal government fail to suspend its plans.\nAddressing journalists at a press conference in Abuja, they described the transportation grant as another window of corruption and excessive spending by the government."
  },
  {
    "headline": "Appeal Committee Begins Sitting In Gusau, Insist No Faction In Zamfara APC -",
    "summarized_story": "The All Progressive Congress APC appeal Committee on Zamfara ward and local government congresses says it has not received petition from any quata after five days of it’s sitting in Gusau, the state CapitalThe Committee also says the party is one and United in the state and has no FactionSecretary of the Committee set up by the National Headquarters of the APC Barr.\nSuleiman Usman Elegwu at a press conference says the Committee is committed to doing justice to it’s mandateThe Press Conference took place at the state party’s Secretariate of the Matawalle’s led FactionBarr.\nElegwu says the main objective of the committee is to receive complain from aggrieved members of the party regarding the just concluded ward and local government Congresses should there be anyThe five man APC appeal Committee led by its chairman Hamman Komo says it is yet to receive complain from any quata after five days of it’s sitting in GusauThe Committee also promises to be fair in the discharge of it’s responsibilitiesGovernor Bello Matawalle and Senator Kabiru Marafa’s Factions had conducted pararell congresses during the ward and local government congresses in the stateAPC Ward Congress in Zamfara held on Saturday 13th November while the Local Government congress held on Saturday 20th and the state Congress is expected to hold this Saturday 27th NovemberThe congresses has afforded members to elect officers of their choice that will steer the ship of the party at all levels in the next four yearsThe Governor Bello Matawalle’s led Faction and that of Senator Kabiru Marafa’s Faction has been at loggerhead since the Defection of Governor Bello from the PDP to the ruling APC in July this yearThe five man APC appeal Committee which is holding it’s sitting at the Headquarters of the Matawalle’s led Faction of the party is expected to complete it’s assignment before the State Congress of the party slated for Saturday, November 27thThe Committee also recognizes the Matawalle’s led Faction secretariate as the authentic in the state."
  },
  {
    "headline": "Anambra Election Conduct was our most Challenging",
    "summarized_story": "The chairman of the Independent national electoral commission, Mahmood Yakubu , said the Anambra governorship election is the most difficult election ever conducted in the history of the commission.\nHe made the statement at a two day interactive meeting for Online publishers, media executives .\nThe commission Chairman said the sit at home order on Mondays in Anambra State by IPOB affected the preparation for election.\nMr Mahmood Yakubu said the commission lost everything in Anambra State in preparation for the election when the inec office in Awka was razed down in June.\nAs a result of that all non sensitive materials were gotten from neighbouring States, Enugu and Imo."
  },
  {
    "headline": "Matawalle orders restoration of telecoms service in Zamfara",
    "summarized_story": "He made the announcement at the state APC Convention held at the trade fair complex, Gusau, today.\n“I want to announce today that we have taken a decision to lift the ban on telecommunications in the state.\nThe new EXCO was sworn in after the Caretaker Committee of the Party under Senator Hassan Nasiha (Central) was dissolved via motion moved by the former Governor of Zamfara State, Alhaji Mamuda Shinkafi.\nThe Convention was Chaired by the Planning Committee Chairman from the National Headquarters of the APC, Alhaji Ibrahim Kabir Masari who announced a Consensus of the Party in all the 36 elective posts of the Party.\nThe Concensus motion was moved by Senator Sahabi Yau (Zamfara South) and seconded by a frontline member, Alhaji Sani Jaji."
  },
  {
    "headline": "Sudan Military Says Several Soldiers Killed in Ethiopian Attack",
    "summarized_story": "Sudan’s military says several Sudanese soldiers were killed in an attack by Ethiopian forces in a disputed border region.\nBut the attack left “several killed” among Sudanese forces, it said, without giving a death toll.\nThe Reuters news agency, citing military sources, said at least six soldiers had been killed in the attack.\nAl-Fashaqa is a border zone long cultivated by Ethiopian farmers but claimed by Sudan.\nThe zone, which also borders Ethiopia’s troubled Tigray region, has seen sporadic deadly clashes between the two sides over the past years, but escalated last year."
  },
  {
    "headline": "Nigerian Celebrities Simi and Chigul Expose Sexism in Music and Nollywood",
    "summarized_story": "Nigerian celebrities have recently opened up publicly about the sexism they have faced after multi-award winning singer Simi spearheaded the #NobodyLikeWoman trend on Instagram.\nAs a famous artist in Africa and beyond, Simi said it summed up the sexism she had faced within her own industry of Afro music.\nNollywood actress Chioma Omeruah – famously known as Chigul – has witnessed similar struggles and believes the problem is cultural.\nBoth Chigul and Simi agree that the laws in Nigeria need to be tougher on those who discriminate against or attack women.\nHowever, Simi believes the fight for women’s rights in Africa cannot be compared with efforts in the West."
  },
  {
    "headline": "South Africa ‘Punished’ for Detecting New Omicron Variant",
    "summarized_story": "South Africa has complained it is being punished – instead of applauded – for discovering Omicron, a concerning new variant of Covid-19.\nHundreds of passengers arriving in the Netherlands from South Africa are being tested for the new variant.\nThe new Omicron variant was first reported to the WHO from South Africa on 24 November.\nThe bans were “akin to punishing South Africa for its advanced genomic sequencing and the ability to detect new variants quicker”.\nUS officials said foreigners would be blocked from travelling from South Africa, Botswana, Zimbabwe, Namibia, Lesotho, Eswatini, Mozambique and Malawi, mirroring earlier moves taken by the EU."
  },
  {
    "headline": "Israel to Impose Travel Ban for All Foreigners Over Omicron Variant",
    "summarized_story": "Israel has so far confirmed one case of the potentially more infectious Omicron strain first detected in South Africa.\nMany countries have since banned travel to South Africa and its neighbours.\nSouth Africa has complained that it is being punished – instead of applauded – for discovering Omicron earlier this month.\nSouth Africans fear impact of new variant measuresHow worrying is the new Covid variant?\nA ban on foreigners entering Israel from most African countries was imposed on Friday."
  },
  {
    "headline": "Dozens on South Africa Flights Test Positive for Covid in Netherlands",
    "summarized_story": "Those who tested positive are now being kept in isolation at a hotel near the airport.\nZimmerman was told she had tested negative at 4 am, almost 18 hours after landing in Amsterdam.\nBut she then found out she was standing right next to a man who discovered he had tested positive.\n“I’ve been told that they expect that a lot more people will test positive after five days.\nKLM will continue flights to the region, but all travellers must now test negative before departure and then quarantine for at least five days upon arrival in the Netherlands."
  }
]