[
  {
    "headline": "Insecurity: Osun poly urges compliance as host community imposes curfew",
    "summarized_story": "The management of the Osun State Polytechnic, Iree, has called on the students and staff of the institution to comply with the dusk to dawn curfew imposed by the Iree community to check rising insecurity in the town.\nThe institution, in its directive to the students and staff living within the community, subsequently advised them to comply with the restriction, and stay indoors during the period of the curfew.\nThe memo titled ‘Dusk to dawn curfew in Iree town’ read in part, “The Aree-in-Council, in conjunction with the various security organs in town, has declared a dusk to dawn curfew in Iree town.\n“You are required to abide by this directive in your own interest.”Copyright PUNCH.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "BREAKING: Oyo shuts IBEDC offices for disconnecting power supply to Gov’s Office, others",
    "summarized_story": "The Management of Ibadan Electricity Distribution Company Plc says the Oyo State Government has illegally sealed off its offices following the disconnection of electricity supply to the State Secretariat which also houses the Governor’s Office.\nThe company said the state government claimed IBEDC is owing revenue bills and personal income hence the action, but Ayodele said this claim is quite suspicious.\nThe statement reads, “The management of IBEDC hereby informs its esteemed customers of the retaliatory and illegal action of the Oyo State Government over the issue of its huge indebtedness.\n“This issue of revenue bills and personal income arising now is quite suspicious.\n“Oyo State Government is owing IBEDC a whooping consumption outstanding of N450 million for over a period of three years."
  },
  {
    "headline": "Imo police launch manhunt for killers of seven community leaders",
    "summarized_story": "The Commissioner of Police in Imo State, Rabiu Hussaini, has ordered the Deputy Commissioner of Police in charge of State Intelligence Investigation Department to begin the process of arresting the killers of seven community leader in Nmahu in the Ohaji-Egbema Local Government Area of the state.\nA statement issued by the spokesperson for the command, Mike Abattam, on Wednesday, disclosed that the leader of the gang who killed the community leaders had been identified.\nThe statement disclosed that the leader of the gang was one Ossy who escaped from Owerri Correctional Centre in 2021.\nAccording to the police, the attacks which led to the killing of seven community leaders were cult-related.\n“The Divisional Police Officer on receipt of this information immediately, mobilised his men and other patrol teams to the area, on arrival at the scene, the hoodlums have deserted the place, leaving seven persons dead."
  },
  {
    "headline": "Burna Boy, Davido, Tems, 19 other Nigerians among Avance Media’s 100 most influential young Africans list for 2021",
    "summarized_story": "Burna Boy, Davido, Tems, 19 other Nigerians among Avance Media’s 100 most influential young Africans list for 2021Joy OnuorahAvance Media List of 100 most influential young persons in AfricaAvance Media has announced the 6th publication of its annual ranking of ‘100 Most Influential Young Africans’, a list that celebrates the gifted and successful young Africans in various fields across the African continent.\nThe list includes individuals from industries such as technology, business, entertainment.\nSpeaking on the recent Publication, the MD of Avance Media, Prince Akpah, mentioned that the continent is blessed with a lot of inspiring young people who have the power to prove the worth of the continent’s future.\nStandards for selection for Avance Media’s 100 Most Influential Young Africans have always included, excellence in leadership and performance, personal accomplishment, commitment to sharing knowledge, breaking the status quo, and being an accomplished young African.\nBelow is the official list of Avance Media 2021 100 Most Influential Young Africans arranged in alphabetical order:"
  },
  {
    "headline": "Burna Boy, Davido, Tems, 19 other Nigerians among Avance Media’s 100 most influential young Africans list for 2021",
    "summarized_story": "Burna Boy, Davido, Tems, 19 other Nigerians among Avance Media’s 100 most influential young Africans list for 2021Joy OnuorahAvance Media List of 100 most influential young persons in AfricaAvance Media has announced the 6th publication of its annual ranking of ‘100 Most Influential Young Africans’, a list that celebrates the gifted and successful young Africans in various fields across the African continent.\nThe list includes individuals from industries such as technology, business, entertainment.\nSpeaking on the recent Publication, the MD of Avance Media, Prince Akpah, mentioned that the continent is blessed with a lot of inspiring young people who have the power to prove the worth of the continent’s future.\nStandards for selection for Avance Media’s 100 Most Influential Young Africans have always included, excellence in leadership and performance, personal accomplishment, commitment to sharing knowledge, breaking the status quo, and being an accomplished young African.\nBelow is the official list of Avance Media 2021 100 Most Influential Young Africans arranged in alphabetical order:"
  },
  {
    "headline": "Stylish Celebrity Mums that inspire",
    "summarized_story": "However, the most fashionable celebrities manage to capture our attention with their numerous styles, either on the red carpet or their social media handles.\nIn addition to showing the special relationship they have with their children, they also share their fondness for fashion and inspire us every day.\nHere is our definitive list of some of the most stylish celebrity moms that inspire us in every way.\nDakore Egbuson-AkandeNollywood sweetheart Dakore Egbuson-Akande is definitely holding it down as a wife, mother, and very a successful actress.\nHer fashion game was always on point, and she continues to prove that with her Instagram feed and the red carpet."
  },
  {
    "headline": "Stylish Celebrity Mums that inspire",
    "summarized_story": "However, the most fashionable celebrities manage to capture our attention with their numerous styles, either on the red carpet or their social media handles.\nIn addition to showing the special relationship they have with their children, they also share their fondness for fashion and inspire us every day.\nHere is our definitive list of some of the most stylish celebrity moms that inspire us in every way.\nDakore Egbuson-AkandeNollywood sweetheart Dakore Egbuson-Akande is definitely holding it down as a wife, mother, and very a successful actress.\nHer fashion game was always on point, and she continues to prove that with her Instagram feed and the red carpet."
  },
  {
    "headline": "Dora Akunyili’s daughter to release heroic memoir on her",
    "summarized_story": "Joy OnuorahNigerian-Canadian Speaker and Consultant, Chidiogo Akunyili-Parr is getting set to add author to her impressive resume with the release of her first book.\nThe book, a memoir, explores the life and activism of her late mother, Dora Akunyili who served as the Director-General of the National Agency for Food and Drug Administration and Control (NAFDAC) of Nigeria from 2001 to 2008.\nTitled I am Because We Are: An African Mother’s Fight for the Soul of a Nation, the book recounts the story of Akunyili’s revolution in the Nigerian pharmaceutical industry.\nThe release of the book is set for February, celebrated globally as Black History month.\nHer work is focused on harnessing the power of our interdependence based on the African philosophy, Ubuntu."
  },
  {
    "headline": "Weather affects air assault as terrorists kill children in Niger villages",
    "summarized_story": "More than 200 terrorists have attacked communities in Kontagora, Mariga and Rijau local government areas in Niger State.\nThey stormed the areas in a convoy of about 100 motorcycles and killed children at Bangi, a village in Mariga LGA.\n“Aside sacking Argida, Babugadi, Warari, Birnin Boga, Mogola and others, they also killed little children at Bangi.\nA military intelligence officer explained that bad weather prevented the Nigerian Air Force (NAF) from aerial bombardments.\nHe said pilots are mindful of severe weather conditions due to adverse hazy weather including intense storms, poor visibility, high turbulence."
  },
  {
    "headline": "Fulani militias plotting to wipe out our communities in Kaduna – Atyap group",
    "summarized_story": "The Atyap Development Association (ADA), on Wednesday, raised an alarm over the killing, burning of their communities by suspected Fulani militia.\nA statement made available to newsmen in Kaduna by Mr Samuel Achie, President of the ADA, noted that Fulani militias plan to wipe out the entire chiefdom, calling on the Federal Government to urgently send security operatives to protect them.\nAccording to him, a few days after the Fulani community falsely accused them of killing their people, they came in hundreds and wiped out the entire community, killing, burning houses and kidnapping.\nThese people kill us, turn to issue false press statements and accuse the ADA community of attacking them.\nHowever, about four persons were confirmed killed by suspected Fulani militias who attacked Sabon Kaura village in Atyap Chiefdom, Zangon Kataf Local Government Area of Kaduna State on Tuesday night."
  },
  {
    "headline": "We’ll continue to fight bandits in Zamfara until they surrender – Police",
    "summarized_story": "The Zamfara State Police Command has reiterated its efforts towards fighting bandits to a standstill in the state, saying that all security agencies are ready for them.\nAccording to him, the security agencies are enjoying unflinching support from the state government, stressing that the encouragement is boosting the efforts of the security agencies in the state.\n“The police authority in the state has established various police outposts in various areas of the state.\nThe police spokesman appealed to the members of the general public to give security agencies vital information that would help in locating the bandits and their enclaves.\n“The bandits cannot operate alone without the assistance of the informants who are parts of the villages the bandits are attacking,” he said."
  },
  {
    "headline": "Kingdom of darkness using Valentine’s Day to destroy souls – Mummy GO warns",
    "summarized_story": "Funmilayo Adebayo, a controversial Nigerian evangelist popularly known as Mummy GO, has warned Nigerians against celebrating Valentine’s Day.\nMummy GO described Valentine’s Day celebration as a day the kingdom of darkness has dedicated to convincing people to celebrate immorality, adding that the day is not worth celebrating.\nAccording to her, Valentine’s Day was initiated by the kingdom of darkness to destroy people.\nDAILY POST reports that Valentine’s Day is normally celebrated by lovers all over the world on February 14.\n“But they purposively chose it because the kingdom of darkness needs a day dedicated for falling, destruction and how do you convince people to celebrate immorality: they use popular figures loved by others.”"
  },
  {
    "headline": "We’ve prioritised police reform, recruited 40,000 officers – FG",
    "summarized_story": "The Federal Government says it recruited 40, 000 police officers in the past four years in an effort to re-energize and improve the personnel of the force to tackle increasing security challenges in the country.\nPresident Muhammadu Buhari disclosed this in his remarks while declaring open a two-day retreat for Senior Police Officers in Uyo, on Tuesday, NAN reports.\nHe added that the FG also assented to the Nigerian Police Regulatory Bill 2020 as part of measures to reposition the police force.\n“This administration has prioritised the reform, re-equipment and re-engineering the Nigerian Police, being the lead and most critical agency in the nation’s internal security architecture.\n“This is evidenced by the Presidential assent that has been granted to the Nigerian Police Trust Fund bill and the promptness with which the Board of Trustees was inaugurated."
  },
  {
    "headline": "BREAKING: Terrorists kill Police DPO in Katsina",
    "summarized_story": "Suspected terrorists have killed the Divisional Police Officer of Jibiya Local Government Area of Katsina State, DSP Abdullahi Rano, during an invasion of Magama Jibiya on Wednesday morning.\nInvestigation by The Nation revealed that Rano was killed when he led security operatives, including troops to repel the terrorists who stormed the town around 2 am.\n- Advertisement -He said normalcy was restored in the town by 9 am with security operatives patrolling the community.\nResidents confirmed the terrorists first visited the house of one Haliru Mai Bakin Mai located at Magama-Jibia and abducted his wife.\nThe PPRO however posted the picture of the late DPO on his WhatsApp page with ‘RIP’ label."
  },
  {
    "headline": "FG recruits 40, 000 police officers in 4years, says Buhari",
    "summarized_story": "President Muhammadu Buhari disclosed this in his remarks while declaring open a two-day retreat for Senior Police Officers in Uyo, on Tuesday.\nHe added that the FG also assented to the Nigerian Police Regulatory Bill 2020 as part of measures to reposition the police force.\n- Advertisement -“This administration has prioritised the reform, re-equipment and re-engineering the Nigerian Police, being the lead and most critical agency in the nation’s internal security architecture.\nAccording to him, any organisation without a vision was bound to fail, so the retreat would align the officers with the current and evolving policing and internal security realities.\n”This is with a view to strengthening our capacity to stabilise the internal security order, discourage pre-trial detention, and restore public confidence in the Force,” Baba said."
  },
  {
    "headline": "JUST IN: Alleged N5.2b fraud: Ex-JAMB registrar, ICPC fail on plea bargain talks",
    "summarized_story": "The plea bargain talks between former Registrar of the Joint Admission and Matriculation Board (JAMB) Professor Adedibu Ojerinde and the Independent Corrupt Practice and other related offences Commission (ICPC) failed on Tuesday.\nThe prosecuting agency – Independent Corrupt Practices & other related offences Commission (ICPC) – claimed Ojerinde committed the alleged offences contained in the charge from when he served as the Registrar of the National Examination Council (NECO) to his days in JAMB and up till 2021 after he left office.\nOn Tuesday, both the prosecution and defence lawyers prayed the court to allow parties one more day to work out a possible plea bargain arrangement.\n- Advertisement -But, at the mention of the case on Wednesday, lead prosecuting lawyer, Ebenezer Shogunle told the court that plea bargain talks failed“My lord, I regret to inform the court that there has been no plea bargain agreement in this matter.\nWe have witnesses in court and ready to proceed,” Shogunle said."
  },
  {
    "headline": "Oxlade’s nude pictures, s3x tape leaked",
    "summarized_story": "A leaked sex tape of rising singer Oxlade has hit the internet.\nThe video, which has been circulating all over Twitter and WhatsApp, saw the ‘Ojuju’singer in series of scenes including where he was having sex with an unknown lady.\nAlso seen in the video are nude mirror selfie and one of him smashing a lady’s butt.\nThe videos have since thrown the internet into frenzy as social media users keep sharing and giving diverse opinions.\n- Advertisement -The ‘Ojuju’ singer is however yet to comment on the trending video as at the time of filing this report."
  },
  {
    "headline": "Lalong welcomes Senate’s nod for Plateau law school campus",
    "summarized_story": "Plateau Governor Simon Bako Lalong has welcomed the decision of the Senate to create a Campus of the Nigerian Law School in the State.\nHe said the Bill amending the Legal Education Act to create six new campuses across the country was a welcome development.\nHe said: “I strongly commend the Senate for this decision and the choice of Plateau State as a host of one of the new campuses.\n- Advertisement -“Only recently, we finalised plans to establish a new Law Faculty at the Plateau State University Bokkos to expand the training of lawyers in the State and nation at large”.\nThe Federal Government last year approved the establishment of the Federal Polytechnic Ny’ak, Shendam; Karl Kumm University Vom; ANAN University Kwall and the Federal University of Education Pankshin, all in Plateau State."
  },
  {
    "headline": "Withdrawal of petrol with methanol cause of scarcity",
    "summarized_story": "Maigandi did not mention who was to be held responsible for the contaminated petroleum products in circulation.\nAlso IPMAN National Operations Controller, Mr. Mike Osatuyi, disclosed that the contaminated product is being mopped-up, a development that has caused disruption in the distribution chain.\n‘‘I can confirm to you that we have received reports that this contaminated fuel has caused damage to vehicle engines.\nThe marketer further told Daily Sun that the volume of the contaminated fuel which made is way into the country is about 200 million litres.\nMeanwhile, Some petroleum marketers say fuel scarcity will persist in Lagos and other parts of the country until depots are restocked with adequate and quality products."
  },
  {
    "headline": "Southern govs won’t support any northern presidential candidate – Akeredolu",
    "summarized_story": "From Bamigbola Gbolagunte, AkureChairman, Southern Governors’ Forum and Ondo State Governor, Mr Rotimi Akeredolu has warned political parties against picking its presidential candidates from the north, declaring that governors of the southern states would reject any candidate from the north.\nHe also predicted that any political party that fielded a northern candidate in the 2023 presidential poll would lose.\nHe said governors from the south of the country under the auspices of the Southern Governors Forum are determined to ensure that Nigeria’s next president was from the south.\nHe commended the group for its approach in involving youths in galvanising support and votes ahead of the 2023 election.\nSaid Akeredolu: “In about two or three meetings, we have come out and declared that power must move to the south."
  },
  {
    "headline": "Reps okay bill to make first degree minimum qualification for",
    "summarized_story": "From Ndubuisi Orji, AbujaThe House of Representatives, yesterday, passed for second reading a bill seeking to increase the minimum education qualification for the Nigerian President from senior school certificate or its equivalent to a university first degree or its equivalent.\nThe proposed legislation is also seeking to make a first degree or its equivalent the minimum qualification for governors and members of the state and national assembly.\nThe aforementioned sections prescribes senior school certificate or its equivalent as minimum qualification for persons seeking to be elected as president, governors, national and state assembly members.\nIn this present day, studying up to a university degree anywhere in the world would have afforded any individual certain knowledge, skills and preparedness.\nA university degree is good place to benchmark the educational qualification into certain political offices."
  },
  {
    "headline": "Lagos Catholic priest suspended indefinitely for banning Igbo songs",
    "summarized_story": "By Chinelo ObogoThe Catholic Archdiocese of Lagos has asked Rev.\nJames Anelu, the Priest-in-Charge of Holy Trinity Catholic Church, Enu-owa, Ikorodu, to proceed on indefinite leave for reportedly prohibiting parishioners from singing songs in Igbo language during service.\nIn a disclaimer issued on Monday, the Archbishop of Lagos Diocese, Alfred Martins, said Rev.\nAnelu made some unacceptable comments about Igbo songs being sung in the church and that the remarks did not represent the Catholic church’s position on common brotherhood of people of all tribes and religions.\nAnelu allegedly banned songs in Igbo language from being sung in the church, saying the Igbo cannot keep dominating other people, even in his church."
  },
  {
    "headline": "N5bn fraud: Ex-JAMB registrar, Ojerinde, seeks plea bargain",
    "summarized_story": "From Godwin Tsa, AbujaFormer Registrar, Joint Admission and Matriculation Board (JAMB), Prof. Adedibu Ojerinde, has opted for a plea bargain with the Independent Corrupt Practices and other related offences Commission (ICPC) in the alleged N5 billion fraud case against him.\nHis new lead counsel, Ibrahim Ishyaku (SAN), told the court that his client prefers an out of court settlement known as a plea bargain to resolve the matter.\nThe senior lawyer informed the judge that the trial could commence if after 24 hours, the matter could not be resolved.\nICPC lawyer, Mr Ebenezer Sogunle, did not object to the request, but insisted that the trial would proceed in case the plea bargain failed.\nMeanwhile, Justice Egwuatu has fixed today, for a report of the plea bargain to be presented."
  },
  {
    "headline": "JUST IN: Bandits Kill DPO, Soldier in Katsina",
    "summarized_story": "Injure army captainFrancis Sardauna in KatsinaThe Divisional Police Officer (DPO) of Jibia Local Government Area of Katsina State, DSP Abdulkadir Rano and one soldier have been killed in a gun battle between terrorists and security personnel at Magamar Jibia community.\nTHISDAY gathered that the terrorists who invaded the border community on Tuesday night, also shot an army captain on his lap and left many residents with varying degrees of injuries.\nA vigilante commandant in the community who pleaded anonymity, told THISDAY on Wednesday that the marauding terrorists abducted the wife of a businessman in the community.\nThe attack was said to be carried out by the terrorists under the groups of Dangote, Dan Karami and Turji.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "The 2022 Committee: Eminent Leaders Met to Build Consensus for National Rebirth",
    "summarized_story": "The meeting of 100 leading business, political, civil society and thought leaders in Lagos over the last weekend was to build consensus for national rebirth, the 2022 Committee has said.\nA statement issued Wednesday on behalf of the Conveners by the Chairman of THISDAY/Arise Media Group, Mr. Nduka Obaigbena, and former Presidential Liaison Officer to the Senate, Mr. Kashim Ibrahim-Imam, said the meeting which held from February 4 to 6 under the aegis of The 2022 Committee, in a non- partisan retreat to map a new consensus for national rebirth, was attended by 14 current governors, 13 former governors and three former Senate Presidents.\nParticipants, working in 3 Sub-Committees of National Security, The Economy and Nigeria in Transition, the statement said, “recognised that there is an urgent need to seek common ground and irreducible minimum actions to stabilise the polity at this critical time of transition.”The statement, coming on the heels of unfounded narratives on the purpose of the meeting, said ”whilst The 2022 Committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the Committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction – candidates are only chosen by political parties and we are not a political party.”Noting that all the 100 leading lights of the 2022 Committee have the capacity for national leadership, it said amongst the active participants in the work of the Committee were over seven persons, from three or more political parties, who had already publicly declared their aspirations to lead the country but were desirous of working with other patriots for non-partisan greater national goals.\n“We must have a secure, peaceful and united nation before we can have candidates for political offices,” it added.\nThe statement further said that The 2022 Committee believes that “what Nigeria needs today is for all patriots to come together to rescue our nation from all political, economic and security threats, and promote the unity of Nigeria.”It said the meetings will continue, “as we work with Federal and State Governments, current and future political leaders of all political persuasions, as well as other eminent patriotic citizens, for the greater good of the Nigerian people.”It therefore called on all patriotic volunteers, who are willing and able, to join this collective effort to stabilise the system so that a new Nigeria, that all can be proud of, could be builtShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Adulterated Fuel: Buhari Angry, Orders Query of NMDPRA Head",
    "summarized_story": "It is responsible for the regulation of the midstream and downstream petroleum operations in Nigeria which includes technical, operational, and commercial activities.\n“The reason the midstream/downstream authority is being queried first is that for now the bulk stops at its desk.\nThey are the police which should stop bad fuel from coming into the country.\n“Our technical team in conjunction with NNPC Ltd and other industry stakeholders, will continue to monitor and ensure quality petroleum products are adequately supplied and distributed nationwide,” it added.\n“And NNPC is working seriously to see that they get the correct product so that the marketers will continue loading."
  },
  {
    "headline": "Osinbajo: S’Court Seems to Be Exceeding Constitutional Limit in Election Matters",
    "summarized_story": "Osinbajo spoke at the 53rd Conference of the National Association of Law Teachers, held at Bayero University, Kano (BUK).\nHe condoled with the family and prayed God to give them the courage to bear the painful passing of their daughter.\n“In that election in 2019, the trouble at the Supreme Court game was that the APC primaries that produced candidates that were voted for were invalid.\nBecause according to the court, APC did not conduct any valid primary elections and as such, had no candidates for any elections in the state.\nOsinbajo, who used the opportunity of his engagement in Kano to visit Hanifa’s family, condoled with the girl’s parents."
  },
  {
    "headline": "Nigeria Drags UK’s Crime Agency to Court over £150m Abacha Loot",
    "summarized_story": "In the latest legal tussle over the money, generally known in Nigeria as “Abacha loot”, the report stated that Nigeria wanted the crime-fighting agency, NCA, to release funds that it froze at the request of US authorities.\nThe report stated, “It is a complicated story with many twists and turns.\nHowever, the money Abacha and his associates plundered became the subject of an international search after the dictator’s sudden death in 1998, aged 54.\nThe NCA has been working with American authorities in a bid to confiscate the funds and return them to “the people of Nigeria,” the report stated.\nBut Nigeria desperately needs the money that Abacha stole.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Under Pressure To Decline Assent To Reworked Electoral Bill – Sources",
    "summarized_story": "President Muhammadu Buhari is said to be under pressure from his associates to reject the reworked Electoral Act Amendment Bill 2022.\nIt was learnt that the President may still reject the bill because of so-called “vendetta and anti-democratic clauses” in the reworked Electoral Act Amendment Bill 2022.\nSee Also Breaking News BREAKING: National Assembly Transmits Electoral Bill To President Buhari For AssentMeanwhile according to the Independent National Electoral Commission (INEC) timetable, the presidential election will hold on February 18, 2023.\n“The President may still reject the bill because of ‘vendetta and anti-democratic clauses’ in the reworked Electoral Act Amendment Bill 2022.\n“We may end up using the Electoral Act 2010 (as amended) for the 2023 general election because of strange clauses."
  },
  {
    "headline": "Buhari Under Pressure To Decline Assent To Reworked Electoral Bill – Sources",
    "summarized_story": "President Muhammadu Buhari is said to be under pressure from his associates to reject the reworked Electoral Act Amendment Bill 2022.\nIt was learnt that the President may still reject the bill because of so-called “vendetta and anti-democratic clauses” in the reworked Electoral Act Amendment Bill 2022.\nSee Also Breaking News BREAKING: National Assembly Transmits Electoral Bill To President Buhari For AssentMeanwhile according to the Independent National Electoral Commission (INEC) timetable, the presidential election will hold on February 18, 2023.\n“The President may still reject the bill because of ‘vendetta and anti-democratic clauses’ in the reworked Electoral Act Amendment Bill 2022.\n“We may end up using the Electoral Act 2010 (as amended) for the 2023 general election because of strange clauses."
  },
  {
    "headline": "Buhari Under Pressure To Decline Assent To Reworked Electoral Bill – Sources",
    "summarized_story": "President Muhammadu Buhari is said to be under pressure from his associates to reject the reworked Electoral Act Amendment Bill 2022.\nIt was learnt that the President may still reject the bill because of so-called “vendetta and anti-democratic clauses” in the reworked Electoral Act Amendment Bill 2022.\nSee Also Breaking News BREAKING: National Assembly Transmits Electoral Bill To President Buhari For AssentMeanwhile according to the Independent National Electoral Commission (INEC) timetable, the presidential election will hold on February 18, 2023.\n“The President may still reject the bill because of ‘vendetta and anti-democratic clauses’ in the reworked Electoral Act Amendment Bill 2022.\n“We may end up using the Electoral Act 2010 (as amended) for the 2023 general election because of strange clauses."
  },
  {
    "headline": "BREAKING: Five Soldiers Killed In Auto Crash While Answering Distress Call To Repel Alleged Attack By IPOB’s Eastern Security Network",
    "summarized_story": "Five soldiers died on Tuesday while others were critically injured after a MRAP (mine-resistant, ambush protected vehicle) had an accident in Anambra State.\nSaharaReporters gathered that the soldiers from the 302 Artillery Regiment, General Support, Onitsha were on their way to Ihiala to join with their colleagues at a military checkpoint after receiving information that operatives of the Eastern Security Network (ESN) were planning to attack the checkpoint.\nThe IPOB leader described the outfit as a replica of the Western Nigeria Security Network, also known as Amotekun, earlier launched by South-West governors to curb insecurity in their region.\n\"The sole aim and objective of this newly formed security outfit known as Eastern Security Network are to halt every criminal activity and the terrorist attack on Biafraland,\" Kanu had said.\n\"This outfit, which is a vigilante group like the Amotekun in the South-West and the Miyetti Allah security outfit, will ensure the safety of our forests and farmland, which terrorists have converted into slaughter grounds and raping fields.\""
  },
  {
    "headline": "BREAKING: Five Soldiers Killed In Auto Crash While Answering Distress Call To Repel Alleged Attack By IPOB’s Eastern Security Network",
    "summarized_story": "Five soldiers died on Tuesday while others were critically injured after a MRAP (mine-resistant, ambush protected vehicle) had an accident in Anambra State.\nSaharaReporters gathered that the soldiers from the 302 Artillery Regiment, General Support, Onitsha were on their way to Ihiala to join with their colleagues at a military checkpoint after receiving information that operatives of the Eastern Security Network (ESN) were planning to attack the checkpoint.\nThe IPOB leader described the outfit as a replica of the Western Nigeria Security Network, also known as Amotekun, earlier launched by South-West governors to curb insecurity in their region.\n\"The sole aim and objective of this newly formed security outfit known as Eastern Security Network are to halt every criminal activity and the terrorist attack on Biafraland,\" Kanu had said.\n\"This outfit, which is a vigilante group like the Amotekun in the South-West and the Miyetti Allah security outfit, will ensure the safety of our forests and farmland, which terrorists have converted into slaughter grounds and raping fields.\""
  },
  {
    "headline": "BREAKING: Declare state of emergency on ritual killings, reps tell FG",
    "summarized_story": "The house of representatives has asked the federal government to declare a state of emergency on ritual killings in the country.\nThe lower legislative chamber passed the resolution at a plenary session on Wednesday following the adoption of a motion of urgent public importance sponsored by Toby Okechukwu, deputy minority leader of the house.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Declare state of emergency on ritual killings, reps tell FG",
    "summarized_story": "The house of representatives has asked the federal government to declare a state of emergency on ritual killings in the country.\nThe lower legislative chamber passed the resolution at a plenary session on Wednesday following the adoption of a motion of urgent public importance sponsored by Toby Okechukwu, deputy minority leader of the house.\nMore to follow…"
  },
  {
    "headline": "Wike in court to show solidarity with Jonah Jang on 'N6.32b fraud' trial",
    "summarized_story": "Nyesom Wike, governor of Rivers state, on Wednesday, visited the Plateau state high court sitting in Jos to attend the trial of Jonah Jang, former Plateau governor.\nThe former governor alongside his co-accused were first arraigned before Daniel Longji, a judge, in March 2018 on a 17-count charge to which they pleaded not guilty.\nHowever, the case started de novo before Christy Dabup following the retirement of the previous judge, Longji, in December 2019.\nAdvertisementWike arrived at the court premises at 9:50 am in the company of some Peoples Democratic Party chieftains and moved straight into the courtroom where the trial was already in progress.\nMike Ozekhome, Jang’s counsel, told the judge that the Rivers governor was in the court to witness the trial of his client."
  },
  {
    "headline": "Wike in court to show solidarity with Jonah Jang on 'N6.32b fraud' trial",
    "summarized_story": "Nyesom Wike, governor of Rivers state, on Wednesday, visited the Plateau state high court sitting in Jos to attend the trial of Jonah Jang, former Plateau governor.\nThe former governor alongside his co-accused were first arraigned before Daniel Longji, a judge, in March 2018 on a 17-count charge to which they pleaded not guilty.\nHowever, the case started de novo before Christy Dabup following the retirement of the previous judge, Longji, in December 2019.\nAdvertisementWike arrived at the court premises at 9:50 am in the company of some Peoples Democratic Party chieftains and moved straight into the courtroom where the trial was already in progress.\nMike Ozekhome, Jang’s counsel, told the judge that the Rivers governor was in the court to witness the trial of his client."
  },
  {
    "headline": "Gunmen attack Imo LGA, kill seven prominent community leaders",
    "summarized_story": "No fewer than seven community leaders have been killed by gunmen in Mmahu autonomous community in Ohaji/Egbema LGA of Imo state.\nThe community leaders were reportedly killed by the gunmen who invaded the community on Tuesday morning.\nCharles Mgaraho, president-general of the community, and six other leaders were killed in the attack.\nTheCable learnt the hoodlums fled the scene immediately after killing the community leaders.\nThe hoodlums invaded our community and the homes of prominent leaders of our community, killed seven of them, including the president general,” the source said."
  },
  {
    "headline": "Meta quietly shuts down its low-cost internet program across Africa",
    "summarized_story": "Notably, in countries like Kenya, Express Wi-Fi has been unavailable since mid-December 2020.\nSimilar to this announcement, about a year ago, Google shut down project Loon, one of it’s low-cost internet projects active in Kenya.\nLaunched in 2016, Express Wi-Fi program was designed as an improvement to Meta’s earlier failed Free Basics program.\nCurrently about 28% of sub-Saharan Africa’s population is connected to mobile internet according to the 2021 GSMA mobile economy report.\nThe end of Express Wi-Fi program signals a change in Meta’s approach to delivering low-cost internet across Africa."
  },
  {
    "headline": "Asa joins Spotify EQUAL Music Programme as ambassador of the month",
    "summarized_story": "Paris-born Nigerian singer, Asa, was recently announced the Spotify EQUAL Global Music Programme ambassador for the month of February.\nIn April 2021, months after it expanded to 38 African countries, Spotify launched the Spotify EQUAL Music Programme in commemoration of International Women’s Day.\nThis research helped fuel the drive for its EQUAL Global Music Programme.\nMayana already has over 560,000 streams on Spotify, and the addition to EQUAL playlists will boost it further.\nSpeaking about her selection, the singer said, “I’m honoured to be the Spotify EQUAL ambassador of the month."
  },
  {
    "headline": "What’s it like building in unpopular sectors?",
    "summarized_story": "Building a successful business in an unpopular sector is difficult globally, especially in Africa.\nBut, regardless of how difficult it is to build in Africa, some people have done it and are still doing it.\nImisi 3D, an Extended Reality (XR) creation lab that focuses on building the African XR ecosystem in Nigeria and beyond, was founded in 2017 in Lagos, Nigeria.\nRegardless of which sector one’s building, the early days are usually lonely and filled with trial and errors in product iterations and product-market fit.\nToday, there’s a massive acceptance of the XR sector owning to the numerous conversation around blockchain and the metaverse, which is essentially a digital world powered by virtual reality."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Building tech for the dead",
    "summarized_story": "In today’s episode of Techpoint Digest, we’ll be discussing an African robotics company, handling funeral arrangements with tech, and the rise of NFT theft.\nSolving African problems with roboticsOperating the Kalibotics ChessbotEveryone and their two-year-old niece is building a fintech startup, and I can’t blame them.\nHowever, other startups are building exciting tech solutions.\nAdvertisementKalibotics is a Nigerian robotics startup building products for the edtech, e-waste management, and agritech industries.\nOluwanifemi Kolawole sat down to chat with the co-founders to learn what it takes to build a robotics startup in Africa."
  },
  {
    "headline": "Kalibotics is using robotics to revamp edtech, agritech, e-waste management",
    "summarized_story": "Kalibotics smart classroomThe seemingly discouraging outcomes of these two endeavours opened their eyes to something bigger.\nThe result was the birth of robotics startup, Kalibotics, coined from two words: Kali, a Swahili term for ‘energetic’, and Robotics.\nLeading up to KaliboticsBefore Kalibotics, the duo has come a long way in building tech products and running businesses.\nOlugbenga asserts that Kalibotics’ products are targeted majorly at large businesses and the government for obvious reasons.\nWe have what is called Kalibotics Project Alpha, which is B2C."
  },
  {
    "headline": "Why are artistes interested in African startups?",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge funding rounds.\nToday on Techpoint Digest, I decided to explore artistes’ interests in African startups, a scenario that has become more noticeable recently.\nAdvertisementAfrican startups X ArtistesLast week, Nigerian startup, AltSchool, raised a $1m pre-seed to provide alternative schools for Africans.\nAs a founder himself, he runs a VC company, Africa Music Fund (AMF), that invests in African music talents.\nHe also set up a syndicate fund, Zagadat Capital, to invest in African startups."
  },
  {
    "headline": "Dirty petrol arrived Nigeria January, slipped NNPC’s tests",
    "summarized_story": "The current fuel scarcity in Nigeria’s major cities on account of petrol high in methanol raises questions about the NNPC’s quality control process, as investigations reveal that the dirty petrol first arrived Nigeria in the second week of January.\nArinola Shobande, corporate communications lead at Ardova, where some stations were affected, said the company promptly shut down the affected petrol stations.\nHowever, the consortium that includes Litasco/PV Oil/Overbrook/Northwest, sources tell BusinessDay may have imported the dirty petrol in exchange for 20,000 barrels of crude oil.\nThe shut down of the petrol stations due to the irregular specification of the petrol they were given is the last-ditch effort to contain the spread.\nRead also: Scarcity in Lagos over dirty petrol NNPC recalledOil marketers have since confirmed that impure products have been on sale."
  },
  {
    "headline": "2023: Why Nigerians must get their PVCs",
    "summarized_story": "To avoid regret in the future, adults of voting age in Nigeria have been urged to get their Permanent Voters Cards (PVCs) in preparation for the 2023 general election.\nThe Commission had last June, to improve the process and give eligible Nigerians the opportunity to have their PVCs ahead of 2023, begun an online continuous voter registration process across Nigeria.\nBased on observation from recent off-season elections, there is increasing concern among stakeholders that the situation may not be different in the 2023 general election if urgent action is not taken.\nHowever, observers say that the 15.2 million votes hardly qualify as a huge mandate.\nThe 35 percent voter turnout was down from 44 percent in the 2015 general election and down from the 54 percent turnout in 2011."
  },
  {
    "headline": "Samsung, LADOL settlement signals more investment, job creation",
    "summarized_story": "The final settlement between Samsung Heavy Industries Nigeria (SHIN) Limited and LADOL Integrated Logistics Free Zone Enterprise has reaffirmed their partnership, after three years of dispute.\n“The settlement agreement also provides for a new sublease agreement which has been executed between SHI-MCI and Global Resources Management Limited (GRML), with the NPA as the head-lessor to GRML.\n“LADOL will continue to invest in and support a range of developments and industries in LADOL Free Zone from agriculture to green energy, ensuring Nigeria becomes a sustainable industrial Hub in Africa,” Jadesimi said.\n“In recognising that Samsung Heavy Industries (Nigeria) lawfully holds 70 percent of the shares in SHI-MCI, the settlement acknowledges our extraordinary contribution to the LADOL Free Zone and its role in the economic development of Nigeria,” Jeon said.\nRead also: LADOL, SAMSUNG resolve dispute, set to unlock $300bn FDI into Nigeria“This has contributed to 560,000 man-hours of training in total."
  },
  {
    "headline": "Delta Cult Clash: Police Arrest Eleven Suspects, Recover Arms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – At least five persons have been reportedly killed, following a fierce cult clash between the Eiye and Black axe confraternity in Agbarho, Ughelli North LGA on the 6/2/2022.\nTo this end, the Delta State Police Command has arrested eleven persons connected to the mayhem.\n“The situation has been brought under control and more patrol teams have been deployed to forestall any further breakdown of law and order in the Community.\nManhunt for the other fleeing suspected cultists is ongoing.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki swears-in eight new commissioners tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will tomorrow, Wednesday, February 9, 2022, swear-in eight new Commissioners confirmed by the Edo State House of Assembly.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the ceremony will be held at the New Festival Hall at the Government House, Benin City.\nOgie noted, “It is hereby announced for the information of the general public that the eight (8) commissioner-nominees confirmed by the Edo State House of Assembly on Monday, February 7, 2022, will be sworn into office by His Excellency, the Edo State Governor, Mr. Godwin Nogheghase Obaseki, on Wednesday, February 9, 2022.”The commissioner-nominees cleared by the State House of Assembly are Chris Nehikhare, Omololu Ojehomon, Afishetu Braimoh, and Stephen Idehenre.\nOthers are Osasere Evbuomwan, Donald Ojemeh, Okojie Newton and Jonathan Lawani.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo NEWMAP inspects ongoing flood control projects, assures speedy completion – Nigerian Observer",
    "summarized_story": "Obaseki stated that the need to adhere to quality and guidelines informed the inspection exercise.\nHe reassured that the government will sustain efforts at tackling the problem of flooding and erosion across all Edo communities.\nResidents of Igbei, who spoke to journalists during the inspection, hailed the governor for putting the people at the forefront of his administration’s programmes and policies.\n“But the Governor Obaseki-led government through Edo State NEWMAP intervention has however changed this narrative with the near completion of this flood alleviation work in our community.\nThe stone-based road is the outcome of the underground drainage work done along the road, which now necessitated the asphalting of the road."
  },
  {
    "headline": "Group Urges Akhabue To Run For Edo Central Senatorial Seat – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAn Esan social cultural group — Esankugbe, with membership across the entire Edo Centre, has called on Ehia Olu Akhabue to join the Senate race for Edo Central Senatorial District.\n“ We are aware that someone like Senator Ordia once fought to frustrate Senator Ugbesia’s third term gambit.\nThe most honorable thing for him to do now is to back down and allow a fresh blood.\nWe know he has done his best these past 8 years and we appreciate him” the statement concluded.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Insurance industry generates N508bn, pays N224bn in claims in 2021",
    "summarized_story": "Insurance industry generates N508bn, pays N224bn in claims in 202Nigeria’s insurance industry generated N508 billion gross premium in 2021, out of which N224 billion was paid as claims, Chairman, Nigerian Insurers Association (NIA), Mr Ganiyu Musa, has disclosed.\nAccording to him, the association would continue to complement the efforts of the National Insurance Commission (NAICOM) in its campaign on the domestication of compulsory insurance in states.\n“It is our expectation that laws on compulsory insurance can be domesticated in other states just as Lagos State has done.\nAccording to him, the policy was required by Lagos State legislation using the VIS’s Automatic Number Plate Recognition (ANPR) equipment and the Nigerian Insurance Industry Database (NIID) Verification Platform.\nThe Nigerian Insurance Industry Database (NIID) Verification Platform, according to Musa, has made the policy necessary by law for all public buildings."
  },
  {
    "headline": "Adulterated petrol: Senior lawyers demand compensation for motorists",
    "summarized_story": "Some senior advocates and rights activists have called on the Nigeria National Petroleum Company (NNPC), which is the sole importer of petrol into the country, to compensate motorists who bought adulterated fuel.\nThe federal government had through the Nigerian Midstream and Downstream Petroleum Regulatory Authority on Tuesday said adulterated petrol, fuel with methanol quantities above Nigeria’s specification, was discovered in the supply chain.\n“How do you end up buying adulterated fuel of that magnitude?\nHe said, “It is a big issue because the contaminated fuel has to be taken out of the system.\nNow, do we have the equipment to properly take care of this contaminated fuel?"
  },
  {
    "headline": "Terrorists kill police DPO in Katsina attack",
    "summarized_story": "DSP Abdullahi Rano, the Divisional Police Officer (DPO) for Jibiya Local Government Area of Katsina State, was on Wednesday morning shot dead by terrorists who invaded Magama-Jibia border town.\nThe DPO was said to have led a reinforcement of the police and the Nigerian Army to engage the terrorists in a fierce shoot-out during which he was shot and killed.\nThe Spokesman for the Katsina Police Command, SP Gambo Isah, posted the picture of the late DPO on his WhatsApp platform with a label ‘RIP’ on it.\nA Deputy village head of Mazanya, Abubakar Sani, confirmed to Punch that the attack which began at 2am.\nResidents further disclosed that the terrorists first visited the house of one Haliru Mai Bakin Mai located at Magama-Jibia and abducted his wifeFacebook Notice for EU!"
  },
  {
    "headline": "Telecom workers vow to disrupt MTN services if demands are not met",
    "summarized_story": "Telecom workers in Nigeria have threatened to disrupt the services of MTN Nigeria and embark on industrial action if their union demands are not met.\nThe workers accused the Telecom company of ignoring the recommendations of its workers despite federal government’s intervention.\n“This negates the agreement they hitherto signed at the Ministry of Labour to fully negotiate the workers’ condition of service,” it said.\nThe union also said the issues are the non-existence of mutually negotiated exit benefits; discriminatory remuneration or benefits; inhumane retirement benefit.\n“If any of our demands are not met on or before Feb. 23, 2022, we shall be mobilising in conjunction with other sister unions affiliated to Nigeria Labour Congress workers within and outside the company for industrial actions that will force management to grant our demands,” the workers noted."
  },
  {
    "headline": "16,000 people commit suicide over indebtedness",
    "summarized_story": "Over 16,000 people committed suicide due to bankruptcy or indebtedness India’s Council of States, known as Rajya Sabha was informed on Wednesday.\nAnother 9,140 people ended their lives due to unemployment between 2018 and 2020,The grim statistics was given by Union Minister of State for Home Nityanand Rai in a response to a written question.\nHe said 5,213 people committed suicide due to bankruptcy or indebtedness in 2020, 5,908 in 2019 and 4,970 in 2018.\nA total of 3,548 people committed suicide due to unemployment in 2020, 2,851 in 2019 and 2,741 in 2018."
  },
  {
    "headline": "Del Potro loses last match in tennis farewell",
    "summarized_story": "Injury-hit Juan Martin del Potro bid an emotional farewell to his fans after losing what was possibly his last match on the tennis circuit.\nAsked if fans would see him play again, Del Potro told reporters: “I don’t know if it’s going to happen, because the pain in my knee is very high.\nAn emotional Del Potro failed to hold back tears before stepping onto the line to serve at 5-3 down in the second set as familiar chants of “Ole Delpo” reverberated around the stands.\nWhen asked after Tuesday’s match if he could manage the Rio Open next week, a tearful del Potro was unclear.\nToday I have my whole life ahead of me and I want to live in peace.”Wa tch the emotional farewell:"
  },
  {
    "headline": "Nigerian Govt Withdraws Adulterated PMS From Market",
    "summarized_story": "In view of public outcry on the proliferation of adulterated Petroleum Motor Spirit (PMS) in circulation, the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA), said the flawed product has been withdrawn from the market.\nIt said the product call back included trucks in transit.\nThe Authority in a statement issued on Tuesday confirmed that the methanol content in the withdrawn products was above Nigeria’s specification.\nIt explained that Methanol is a regular additive in Petrol and is usually blended in an acceptable quantity.\n“Meanwhile, NNPC has intensified efforts at increasing the supply of Petrol into the market in order to bridge any unforeseen supply gap”, it added."
  },
  {
    "headline": "2023: Atiku, Others At Risk As House Of Reps Move To Raise Candidates’ Minimum Education Qualification",
    "summarized_story": "2023: Atiku, Others At Risk As House Of Reps Move To Raise Candidates’ Minimum Education QualificationThe House of Representatives has passed, for second reading, a bill to bar people without university degrees from contesting the presidential position.\nTo contest for federal and state legislature and governorship seats, a candidate will need a minimum of a university degree.\nFormer Vice President and candidate of the Peoples Democratic Party at the last general election, Atiku Abubakar, presented a Diploma as his highest qualification.\nIt is not only Mr Atiku that presented less than a university degree or equivalent.\nOn Tuesday, the House debated the general principle of the bill and passed it for second reading."
  },
  {
    "headline": "JAMB Releases New Date For Commencement Of UTME, DE Registration",
    "summarized_story": "The Joint Admission and Matriculations Board, JAMB, has announced that registration for the 2022/23 Unified Tertiary Matriculation Examination (UTME) and Direct Entry (DE) will begin on Saturday, February 19th and end on March 26th, 2022.\nHowever, in a notice on Tuesday, JAMB said the postponement was to enable “more fine-tuning of the upgraded and user-friendly procedures for candidates’ registration.\nIt said the fine-tuning process will be concluded within the one-week extension period given before the commencement of registration.\n“Further to the above, the new and improved procedures for the 2022/23 UTME Registration would be made available on the Board’s website, its weekly bulletin as well as other media outlets on Monday, 14th February 2022.\n“The candidates are, by this notice, urged to follow keenly the procedures for registration as would be announced by the Board”."
  },
  {
    "headline": "Tambuwal Shut down Kebbi as PDP State Exco Backs His Presidential Ambition",
    "summarized_story": "The Kebbi State chapter of the Peoples Democratic Party, PDP, has endorsed the Presidential Ambition of Sokoto state Governor, Aminu Waziri Tambuwal.\nSpeaking on the purpose of his visit, Governor Tambuwal said he is in Kebbi to consult with the leaders in the state for his Presidential aspiration adding that with level of reception he received by the entire Kebbi PDP exos and structure, he is convinced that PDP is back in Kebbi state.\nTambuwal was received by the entire Kebbi PDP state exco led by the party chairman, Alhaji Usman Bello Suru as well as former minister of Special Duties Kabiru Tanimu Turaki, General Ishaya Bamayi, General Bello Siyaki.\nIn his remarks, the state PDP chairman, Usman Bello Suru, said the Kebbi state PDP is fully in support of Governor Tambuwal’s ambition.\nTo demonstrate this, he asked all delegates, Kebbi state PDP local government chairmen and state excos to identify themselves."
  },
  {
    "headline": "VIDEO: Watch as Abuja varsity lecturer cuts student’s hair with scissors",
    "summarized_story": "An unidentified lecturer in Veritas University in the Federal Capital Territory (FCT) has been captured in a viral video, cutting off the hair of a male student with scissors.\nThe lecturer according to the video, paused his lecture and invited the unidentified male student to the front of the class where he embarrassed him.\nIn a video posted online, the lecturer could be seen using scissors to give an irregular haircut to the undergraduate who didn’t seem too pleased.\nAfter he was done cutting off the hair, the lecturer then told his student to put the hair particles in his pocket.\nWatch the video below…"
  },
  {
    "headline": "Bandits stopping us from burying our dead – Zamfara residents",
    "summarized_story": "In a special report carried by BBC Hausa Tuesday morning and monitored by Premium Times, residents said they could not bury their dead because the bandits were still around the village.\nThe bandits are still around the village and have stopped us from retrieving the dead bodies for proper burial.\nSources from the village told newsmen that the terrorists attacked the village Monday night during which they also burnt cars, shops and houses.\nWhen residents started running, some of the bandits started shooting, which led to the death of the 10 people I told you.\nShe told us that the bandits were frustrated by vigilante members last Saturday when they attempted to attack the town."
  },
  {
    "headline": "2023 Presidency: Kwankwaso, Utomi’s Third Force no threat – APC, PDP",
    "summarized_story": "Moves to launch a Third Force Mega Party to wrest power from the ruling All Progressives Congress (APC) and the People’s Democratic Party (PDP) in the 2023 general elections are underway, Blueprint reports.\nBut the duo of the ruling APC and the opposition PDP are dismissing the coalition as no threat, saying the group would go the way of others.\n‘APC not threatened’Dismissing the coalition as no threat, Chairman Buhari Media Organisation (BMO) and APC chieftain, Niyi Akinsuji, said such assemblage can never be a threat to the governing party.\n“Third Force is not a threat to the PDP.\n“Our vehicle and platform, that is the PDP, is waiting to harvest them and treat them fairly, better than other political parties they can think of."
  },
  {
    "headline": "BREAKING: Reps Ask FG To Declare National Emergency On Ritual Killings",
    "summarized_story": "The House of Representatives has called for the declaration of a national emergency on ritual killings across the country.\nThis formed part of the resolutions reached by the lawmakers on a motion of urgent public importance entitled ‘Need to Curb the Rising Trend of Ritual Killings in Nigeria’.\nMr Toby Okechukwu, the Minority Leader of the House, moved the motion during Wednesday’s plenary at the lower chamber of the National Assembly in Abuja.\nThe lawmakers mandated the House Committee on Information, National Orientation, Ethics, and Values to report back to the House within four weeks.\nAccording to them, the Inspector General of Police should take urgent steps to increase surveillance and intelligence gathering, with a view to apprehend and prosecute all perpetrators of ritual killings in Nigeria."
  },
  {
    "headline": "‘We Don’t Trust Them,’ ASUU Accuses FG Of Lip Service",
    "summarized_story": "The Academic Staff Union of Universities (ASSU) has accused the Federal Government of paying lip service to its promises to the lecturers.\nASUU President, Professor Emmanuel Osodeke, who was a guest on Sunrise Daily on Wednesday, explained that the union has lost its trust in the government.\nIf you look at the budget, the budget of this year decreased by just one per cent, it decreased!” he said on the Channels Television breakfast programme.\n“We are having a promise at the international level, and we come back home and not implement it; that is why we don’t trust whatever they tell us.\n“Today lecturers don’t know what they will earn at the end of every month."
  },
  {
    "headline": "DPO, Soldier Killed As Gunmen Attack Jibia In Katsina",
    "summarized_story": "Gunmen suspected to be bandits have killed a Divisional Police Officer (DPO) during an attack on Jibia town in Jibia Local Government Area of Katsina State.\nAlthough the casualty on the part of the gunmen could not be ascertained, residents said a soldier was also killed and another injured.\nREAD ALSO: Eight Killed, Village Head, Three Others Abduted In KatsinaPolice and military authorities in the state have yet to confirm the incident.\nThis comes barely a day after bandits killed eight people at Guga village and Galadima community in Bakori Local Government Area of the state.\nHe said the bandits killed four persons at Guga village, four at Galadima community, and abducted four others during the attack that lasted for hours."
  },
  {
    "headline": "Petrol Supply With Excess Methanol Cause Of Fuel Scarcity, Says FG",
    "summarized_story": "Mr Ahmed said while the quality control agencies of the government have swung into the action, NNPC Limited and oil marketers have been directed to ensure robust supply of petroleum products.\n“To ensure vehicular and equipment safety, the limited quantity of the impacted product has been isolated from the market, including those loaded in trucks.\n“The NNPC Limited and all marketing companies have been directed to sustain sufficient distribution of petrol products in all retail outlets nationwide to avoid any scarcity.\n“Meanwhile, the NNPC has intensified efforts at increasing the supply of petroleum products in the market in order to bridge any unforeseen supply gap.”Fuel anxietyFuel queues had emerged on Tuesday morning in Lagos.\nSome fuel stations were locked while a few open ones had long queues of motorists waiting to buy fuel."
  },
  {
    "headline": "Wike, PDP Chieftains In Court As Ex-Plateau Gov’s Fraud Trial Resumes",
    "summarized_story": "Rivers State Governor, Nyesom Wike, and some chieftains of the Peoples Democratic Party (PDP) on Wednesday stormed the Plateau State High Court sitting in Jos where a former Governor of the state, Jonah Jang is being arraigned.\nWike and the PDP chieftains arrived at the court premises around 9.50 a.m.\nThe former governor, Jang, is standing trial for misappropriation of state funds during his tenure in office.\nGovernor Wike is in Plateau State on a reconciliatory visit to ensure that the crisis among leaders of the Peoples Democratic Party (PDP) is resolved.\nThe Governor expressed the party’s concern on the lingering misunderstanding between former Governor Jonah Jang and the governorship aspirant of the party in the state Retired Lt Gen Jeremiah Useni."
  },
  {
    "headline": "Any party that field northern candidate will lose- Akeredolu -",
    "summarized_story": "Chairman of the Southern Governors’ Forum and Ondo State Governor, Rotimi Akeredolu has warned that any party that fields a northern candidate in the 2023 Presidential election will lose.\nGovernor Akeredolu disclosed that Governors in the Southern part of the country under the auspices of the Southern Governors Forum are determined to ensure that next President comes from the south.\nGovernor Akeredolu said: “In about two or three meetings, we have come out and declared that power must move to the south.\nAdvertisement“Only a party that is determined to lose will field a northern candidate.\nWhat we stand for is fair and equitable power rotation."
  },
  {
    "headline": "Ondo former deputy governor, Ali Olanusi loses wife",
    "summarized_story": "The wife of a former deputy governor of Ondo State, Alhaja Bejide Olanusi is dead.\nShe died in Akure, having complained of stress and was taken to an hospital.\nAdvertisementIn the meantime time, the Ondo State chapter of the All Progressives Congress (APC) has commiserated with the family of former deputy governor in the State, Alhaji Ali Olanusi, over the death of his wife, Alhaja (Chief) Bejide.\nState Chairman of the party, Ade Adetimehin, described sad development as ill-timed, shocking and unfortunate.\nHe said Alhaja was a strong pillar behind the husband’s political success story."
  },
  {
    "headline": "Move to impeach Deputy Gov. Mahdi Aliyu constitutional",
    "summarized_story": "The Zamfara State House of Assembly said it’s move to impeach the state Deputy Governor Mahdi Aliyu Gusau is Constitutional.\nThe assembly said the deputy governor has bridged the constitution.\nAdvertisementAddressing newsmen, the Chairman House committee on Information, Shamsudeen Bosko said the speaker has dully served the Deputy Governor through the Secretary to the State Government the impeachment notice.\nThe Zamfara House of Assembly is accusing the state Deputy Governor of abuse of office which includes constitutional breached of section 190 and 193 (1), (2) (a)(b)(c), of the Constitution of the Federal Republic of Nigeria 1999 (as amended).\nAdvertisementThe Zamfara State House of Assembly had been at logger head with the deputy governor over plans to Impeach himA federal high court in Abuja had last restrained the House from making any move to Impeach the Deputy Governor."
  },
  {
    "headline": "Governor Wike visits former Governor Makarfi in Kaduna -",
    "summarized_story": "Rivers State Governor Nyesom WIke says Nigeria is bleeding and the Peoples Democratic Party (PDP) will be disappointing Nigerians if they don’t reunite to rescue the country and chart a new way forward.\nHe stated this in Kaduna state when he led a delegation of PDP stalwarts to visit the leader of the party and former Governor of Kaduna state after his return from a medical tour to the United Kingdom.\nAdvertisementAhmed Makarfi, who was glad to recieve the Rivers Governor was full of appreciation and commended him for his contribution towards the Successful conduct of the the Partys’ nation convention."
  },
  {
    "headline": "PDP Bigwigs Visit Ex-Leader Babangida in Minna, Agree to Suspend Zoning Debate",
    "summarized_story": "Ayu, who flew into Minna, was with the state chairman of PDP, Mr Tanko Beji and other top executive members of the party in the state.\nAlso, former Niger State governor, Dr. Muazu Babangida Aliyu; former Minister of Internal Affairs, Alhaji Abubakar Tanko; former Minister of Information, Professor Jerry Gana and Senator Zaynab Kure, were part of the delegation.\nAnother significance of the visit was that, for the first time, it brought together the PDP warring factions in the state.\nA source close to one of the two leaders, informed THISDAY that the meeting centered principally on the zoning of the presidency ahead of the 2023 polls.\nHowever, immediately after the meeting, Ayu drove straight to the Minna International Airport, from where he returned to Abuja."
  },
  {
    "headline": "Nigeria University Lecturers Warn of Imminent Strike",
    "summarized_story": "According to him, “they (government) should let us know if they have any problem on the agreement signed and if there are issues, we will sit down on the round table and resolve the issues.\nAs we speak, the federal government has adamantly done nothing to ensure that the renegotiation agreement is signed and implemented.\nWe are calling on all Nigerians to prevail on the federal government to do the needful, “he said.\nOn the funding of state and federal universities, the zonal coordinator said politicians are interested in creating new universities as constituency project rather than funding existing ones, adding that academics are underpaid.\nGo to several of our universities, particularly our state universities, they are TETfund universities because the state government has nothing doing there."
  },
  {
    "headline": "Nigeria Drags UK’s Crime Agency to Court Over £150m Abacha Loot",
    "summarized_story": "In the latest legal tussle over the money, generally known in Nigeria as “Abacha loot”, the report stated that Nigeria wanted the crime-fighting agency, NCA, to release funds that it froze at the request of US authorities.\nThe report stated, “It is a complicated story with many twists and turns.\nHowever, the money Abacha and his associates plundered became the subject of an international search after the dictator’s sudden death in 1998, aged 54.\nThe NCA has been working with American authorities in a bid to confiscate the funds and return them to “the people of Nigeria,” the report stated.\nBut Nigeria desperately needs the money that Abacha stole.”Emmanuel Addeh in Abuja with agency report"
  },
  {
    "headline": "Nigeria: Buhari Angry Over Dirty Fuel in Circulation, Orders Query of Regulatory Agency",
    "summarized_story": "The Authority was created in August 2021 in line with the Petroleum Industry Act (PIA) and encompasses a merger of three defunct regulatory agencies: Petroleum Products Pricing Regulatory Agency (PPPRA), Petroleum Equalisation Fund (Management) Board (PEFMB), and the Midstream and Downstream Divisions of the Department of Petroleum Resources (DPR).\nIt is responsible for the regulation of the midstream and downstream petroleum operations in Nigeria which includes technical, operational, and commercial activities.\n“The reason the midstream/downstream authority is being queried first is that for now the bulk stops at its desk.\n“Our technical team in conjunction with NNPC Ltd and other industry stakeholders, will continue to monitor and ensure quality petroleum products are adequately supplied and distributed nationwide,” it added.\n“And NNPC is working seriously to see that they get the correct product so that the marketers will continue loading."
  },
  {
    "headline": "Nigeria, Ghana to Clash in Abuja on March 27 in World Cup Play-Off",
    "summarized_story": "Nigeria and Ghana will face off at the MKO Abiola National Stadium, Abuja on Sunday, 27th March in what is the final leg of a potentially explosive FIFA World Cup Qatar 2022 play-off round.\nThe Nigeria Football Federation on Tuesday confirmed the date of the reverse leg to the Confederation of African Football, with the Ghana Football Association now to confirm whether the first leg inside the Cape Coast Stadium will be on Wednesday, 23rd March or Thursday, 24th March.\nThe final leg encounter will be the 59th clash at senior level between both West African giants in a chequered 71 –year rivalry, and will also be the first game involving the Super Eagles at the country’s premium sporting arena since the Eagles defeated Sudan’s Falcons of Jediane 3-1 in an Africa Cup of Nations qualifying match on 15th October 2014.\nNigeria reached the play-off round after topping a qualifying pool that included Cape Verde, Liberia and the Central African Republic while Ghana emerged from the section that had South Africa, Zimbabwe and Ethiopia."
  }
]