[
  {
    "headline": "Land acquisition: Asaba community urges Okowa to respect monarch’s decision",
    "summarized_story": "The Asaba Community has called on Governor Ifeanyi Okowa to respect their king, the Asagba of Asaba, Prof. Chike Edozien.\nThe protesters carried placards with various inscriptions such as ‘Respect Asagba of Asaba’, ‘Don’t insult Africa’s oldest living Professor of Medicine’, ‘Our King, our land is our heritage’, and ‘Please, Delta leave our land’ among others.\nSpeaking on behalf of the protesters, the Chairman Agu-Na-Ugboma Land Committee, Mr. Chukwumeka Nwosa, called on the Okowa-led government to respect Asagba of Asaba.\nWe don’t have two kings in Asaba, only one who is Asagba of Asaba and no other.\nHe said, “I want to assure you that Asagba of Asaba is one of the respected king and Okowa will not do anything to undermine the revered monarch.”Copyright PUNCH."
  },
  {
    "headline": "Egbin power plant suspends operations after fire incident",
    "summarized_story": "The Management of Egbin Power Plc has said it has suspended operations at its plant and activated emergency response after a fire incident that occurred at the power plant.\nThe company confirmed the incident occurred on Wednesday around 4:20 pm, adding that investigation was ongoing to determine the cause of the fire.\nGiving details of the incident in a statement titled, ‘Fire Incident At Egbin Power Plant’, the company explained that the fire was successfully controlled by a combined team of professional firefighters.\n“Egbin is also working with the Federal Fire Service, the Federal Ministry of Power and other stakeholders to review the incident.\n“As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with global health, safety and environmental standards.”Copyright PUNCH."
  },
  {
    "headline": "FCT elections: Voting won’t take place in 593 polling units – INEC",
    "summarized_story": "As preparations for the Federal Capital Territory (FCT) Area Council elections reach their climax, the Independent National Electoral Commission (INEC) has told stakeholders that there will be no election in 593 polling units.\nThis is as a result of the non-deployment of registered voters to the affected polling units, which cuts across the six council areas of the FCT.\nAccording to the Chairman of INEC, Mahmood Yakubu, elections will take place in 1,328 polling units having between 0-50 voting populations including 546 polling units with over 1,000 registered voters, respectively.\nDAILY POST recalls that INEC recently created additional polling units across the country, owing to logistic challenges identified during election days.\nThe INEC boss however assured that the affected polling units would be populated with voters before the 2023 general election."
  },
  {
    "headline": "Katsina: Allow LG workers to progress to Level 16 – NULGE begs Masari",
    "summarized_story": "The Katsina State chapter of the Nigeria Union of Local Government Employees (NULGE) has appealed to the state government to end the stagnation of local government workers by allowing them to progress to Level 16, as obtainable in Bauchi, Kano, Sokoto and Jigawa states.\nThe NULGE President in the state, Comrade Nasiru Wada Mai’adua, made the appeal when he led a delegation of its members from across the 34 local government areas in the state to the Secretary to the Government of the State (SGS), Dr Mustapha Inuwa.\nWada, before making the appeal, thanked Inuwa for always standing in for the local government workers whenever they came calling, citing several cases.\nWe are equally praying for the success of Governor Masari led Government and for God to guide you to success in all your future endeavours.”He noted that “the biggest challenge facing local government workers in Katsina is no other than the refusal to allow our members progress to Level 16.\nHowever, he urged the local government workers in the state to take their work seriously and practice fairness in the discharge of their duties."
  },
  {
    "headline": "Abia Speaker, Orji condoles with families of trailer accident victims",
    "summarized_story": "The Speaker of Abia State House of Assembly, Rt.\nHon Chinedum Enyinnaya Orji, has condoled with families of victims of a fatal accident that occurred on Thursday at the abattoir located at Waterside River area of Ogbor Hill, Aba,A loaded trailer had crashed into the abattoir and killed many people.\nReacting, Orji, in a statement issued to newsmen in Umuahia, on Friday, expressed shock and urged the affected families to take solace in God who alone can comfort them in these trying times.\nHe further directed the Ministry of Homeland Security to work with relevant security agencies in ensuring compliance.\nThe directive was contained in a press release by the state Commissioner for Trade and Investment, Chief John Okiyi Kalu, on Thursday."
  },
  {
    "headline": "Insecurity: Youth group urges Buhari to be proactive",
    "summarized_story": "A group, Nigeria Ethnic Nationalities Youth Leaders Council (NENYLC), has advised the President Muhammadu Buhari-led government to be more productive in curtailing the growing spate of insecurity in the country.\nSpeaking through its President-General, Terry Obirh, in a press conference in Abuja, the group stated that Nigerian youths cannot continue to witness the mindless killing of Nigerians in their numbers on a daily basis across the country.\nThe group lamented that the insecurity in the country has now reached a very alarming level, saying that they would no longer continue to fold their hands to see people being wasted in their numbers.\nThe group stressed its uncompromising position on the need for a united Nigeria and cautioned against inflammatory statements ahead of the 2023 general election.\nThe group urged Nigerian youths to participate actively in 2023 politics, urging political actors to be fair to all political zones in elections."
  },
  {
    "headline": "Buhari appoints Dr Vincent Olatunji as NDPB pioneer National Commissioner",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Dr Vincent Olatunji as the National Commissioner/Chief Executive Officer of the Nigeria Data Protection Bureau (NDPB).\nThe NDPB, she said, was established in line with global best practices and would focus on data protection and privacy for the country, among others.\n“The successful implementation of the National Digital Economy Policy and Strategy (NDEPS) for a Digital Nigeria has significantly increased the adoption of data platforms and accelerated the datafication of our society.\n“This has increased the importance of having an institution that focuses on data protection and privacy,” she said.\nOlatunji holds a PhD in Geography and Planning from the University of Lagos and an Advance Diploma in Computer Science."
  },
  {
    "headline": "Military Pension Board begins payment of minimum wage arrears",
    "summarized_story": "The Military Pension Board (MPB) has commenced payment of 25 percent of the 24 months arrears of minimum wage increments to eligible military retirees on its payroll.\nAccording to him: “The Military Pensions Board (MPB) extends its compliments to our esteemed military retirees and wishes to inform them that the Board started paying 25 percent of the arrears of minimum wage increments to eligible military retirees on MPB payroll yesterday Thursday 3 February 2022.\n“This payment is the first out of 4 installmental payments that will be made to all pensioners entitled to the arrears of minimum wage increment on pensions.\nAccordingly, Next of Kins of deceased military pensioners who died between April 2019 and April 2021 are advised to contact their banks for these payments.\nHence, they are not entitled to the 24 months minimum wage arrears.”"
  },
  {
    "headline": "Buhari appoints Olatunji NDPB pioneer national commissioner",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Dr Vincent Olatunji, as the National Commissioner/Chief Executive Officer of the Nigeria Data Protection Bureau (NDPB).\nThe NDPB, she said, was established in line with global best practice and would focus on data protection and privacy for the country, among others.\n“The successful implementation of the National Digital Economy Policy and Strategy (NDEPS) for a Digital Nigeria has significantly increased the adoption of data platforms and accelerated the datafication of our society.\n- Advertisement -Read Also: Buhari rebuffs lobby to shift APC convention date“This has increased the importance of having an institution that focuses on data protection and privacy,” she said.\nShe said that the NDPB would be responsible for consolidating the gains of NDPR and support the process for development of a primary legislation for data protection and privacy."
  },
  {
    "headline": "Zulum warns on ISWAP threat to Nigeria",
    "summarized_story": "The Islamic State’s West Africa Province (ISWAP) is a threat to Nigeria as a whole, Borno State Governor Babagana Zulum warned yesterday.\nZulum spoke during the weekly ministerial briefing of the Presidential Communication Team at the Presidential Villa in Abuja.\nAlso yesterday, the Federal Government said the Nigerian Financial Intelligence Unit (NFIU) has uncovered 96 financiers of terrorism in the country, especially those backing Boko Haram ISWAP.\n“ISWAP are more sophisticated, better funded and more educated and we shall do everything possible to defeat ISWAP.\n“On terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries."
  },
  {
    "headline": "Buhari rebuffs lobby to shift APC convention date",
    "summarized_story": "No venue in party’s notification letter to INECState chairmen inauguratedLast-minute push by some party chiefs to shift the All Progressives Congress (APC) convention date has collapsed.\nHe demonstrated a strong will in opposing moves to shift the convention date.\n“We are awaiting another letter on the venue of the APC national convention.\nA source, who spoke in confidence, said: “There is tension in APC following the uncovering of plans to postpone the party’s national convention.\n“As part of the game, the same forces/ groups will want the CECPC to conduct presidential, governorship and legislative primaries before the National Convention.”"
  },
  {
    "headline": "Uniting North, South through traditional titles",
    "summarized_story": "While some may just be able to boast of just one, there are some who can boast of more than six traditional titles conferred on them by their local traditional rulers and other community heads.\n- Advertisement -They are conferred with traditional titles in recognition of their impact in the community and across the nation.\nFormer Imo State Governor Rochas Okorocha, who represents Imo West in the Senate, bears the traditional title of “Dan Jekan Sokoto”.\nMany Northerners have also been honoured with traditional titles in the South.\nSenate President Ahmad Lawan holds the title the ‘Nwanne Di Na Mba’ (a friend in Diaspora) 1 of Igbere Kingdom title, conferred on him by traditional rulers in Igbere under the umbrella of Igbere traditional council."
  },
  {
    "headline": "Breaking: Gunmen Invade Allawa, Mariga, Burn Kill Soldiers, Burn down Military Camp",
    "summarized_story": "From John Adams, MinnaFor the second time, gunmen have attacked the military camp in Allawa in Rafi local government area of Niger state killing some soldiers and burning down their camp.\nThe gunmen numbering about 200 invaded Allawa town about 10;00pm on Thursday and made their straight to the Military camp and engaged the soldiers in a fierce gun battle which lasted for several hours.\nRecalled that in April last year, the gunmen invaded the same military camp in Allawa, killing five soldiers and an Inspector of Police.\nThis led to the shutting down of the camp by the Military but was reopened a month after with more deployments of additional troops to the area.\nIn another development, gunmen said to be numbering about 300 and riding on about 100 motorcycles, invaded Mariga town in Mariga local government area of the state and rustle over 300 cattle."
  },
  {
    "headline": "FG uncovers 123 companies, 33 BDCs, 424 associates linked to terrorism financing",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaThe Federal Government has identified 96 financiers of terrorism, involving about 123 companies, including 33 bureaux de change.\nAlso, 424 associates of the terrorism were identified, with 45 suspects arrested and to be prosecuted.\nHowever, Mohammed neither revealed the names of the terrorism financiers nor those holding onto the N7.674 trillion owed the Federal Government.\nNevertheless, at the media parley, yesterday, the Information Minister added that government has, so far, recovered N700 billion through its whistleblower policy.\nHe said:”It is common knowledge that one of the most difficult tasks for any government is to fight corruption, because when you fight corruption, corruption will fight you back!"
  },
  {
    "headline": "2023: Igbo president’ll save Nigeria –Ohanaeze",
    "summarized_story": "From Magnus Eze, EnuguOhanaeze Ndigbo Worldwide has said Nigeria is facing a synchronised national crisis which could lead to its eventual collapse or dismemberment.\nThe group, howeever, said Igbo president in 2023 will save the country from the crisis.\nIt warned against the continued disregard to the negotiated agreements on sensitive issues of power-sharing and balancing of power regardless of any other conditions.\nHow did we get to NADECO (Abiola crisis) and even South South Avengers?\n“Nigeria was a country negotiated and amalgamated under some agreements that balanced sensitive issues of power-sharing and balancing of power regardless of any other conditions."
  },
  {
    "headline": "ISWAP must not be allowed to fester, else Boko Haram’ll be child’s play – Zulum",
    "summarized_story": "“And then whether we like it or not a few days ago, I’ have said something about two local governments still not occupied by human population.\nSome say that two local governments are under the control of Boko Haram, no.\nTwo local governments are not occupied by human population.\nBut whether we like it or not, if two local governments are not occupied, what does it mean?\nIt means the capacity is not there to protect this human population to go to this local government areas."
  },
  {
    "headline": "3 dead, others missing as FPSO vessel explodes in Delta waterways",
    "summarized_story": "No fewer than three persons have been confirmed dead as explosion hit a Floating Production, Storage and Offloading Vessel known as Trinity Spirit FPSO in Ugborodo (Escravos) offshore location, Warri South – West Local Government Area in Delta State.\nThe FPSO belonging to Shebah Exploration & Production Company Ltd (SEPCOL) in receivership, blew up at the Ukpokiti Teminal at the early hours of Wednesday.\nDaily Sun gathered on Thursday that about 10 persons onboard the vessel are yet to be accounted for as reliable industry source said three person are confirmed dead even as rescue operations was still ongoing as at press time.\nThe explosion, which occured about 1:00am had caused great panic among workers in the facility and a devastation to the fishing business of locales.\nMeanwhile, the management of Shebah Exploration & Production Company Ltd (SEPCOL) , in receivership, have confirmed the unfortunate incident of the fire that engulfed its offshore facility."
  },
  {
    "headline": "Zulum: We Must Defeat ISWAP at All Cost Else B’Haram will Be Child’s Play",
    "summarized_story": "One, I said it before, a growing number of ISWAP in some parts of the state is a matter of great concern to everybody.\nAnd we should do everything possible to defeat ISWAP; otherwise, what Boko Haram did will be a child’s play.\nISWAP will be a threat to the entire nation, because of the proximity of Sub-Saharan Africa.\n“On terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries.\nThe minister said, “It is common knowledge that one of the most difficult tasks for any government is to fight corruption, because when you fight corruption, corruption will fight you back!"
  },
  {
    "headline": "APC Formally Informs INEC of Feb. 26 Convention Date",
    "summarized_story": "Adedayo Akinwale in AbujaThe All Progressives Congress (APC) has written to the Independent National Electoral Commission (INEC) to officially communicate its plan to hold a national convention on February 26.\nThe letter read, “Follow up to our letter referenced APC/NHDQ/INEC/19/021/40 dated 11 July, 2021, on the notice for the conduct of national convention.\nThis is to inform the commission that our great party has scheduled to hold its National Convention on Saturday, 26 February 2022.\n“This serves as a formal notification pursuant to the provisions of Section 85 of the Electoral Act (2010), as amended.\nWith this formal notification to INEC, it appears all is now set for the convention to hold."
  },
  {
    "headline": "ECOWAS to Deploy Stabilisation Force in Countries Under Threat of Military Takeover",
    "summarized_story": "A communiqué at the end of the meeting strongly condemned the attempted coup d’état in Guinea Bissau and expressed solidarity with President Umaro Sissoco Embalo and the people of Guinea Bissau.\nSuzi Carla BARBOSA, Senior Minister of Foreign Affairs, International Cooperation and the Diaspora of Guinea Bissau, on the circumstances surrounding the attempted coup d’état in Guinea Bissau on 1st February 2022.\n“The Authority firmly condemned the attempted coup d’état in Guinea Bissau and expressed solidarity with President Umaro Sissoco Embalo and the people of Guinea Bissau.\n“In view of these recent developments, the Authority decides to deploy a force with a view to supporting the stabilisation of the country.\nIt called on the military authorities in Guinea Bissau to establish the transition institutions, adopt a transition calendar, and facilitate the return to constitutional order within the shortest time possible."
  },
  {
    "headline": "PIA: House Moves to Transfer Defunct National Oil Corporation’s Assets to NNPC Limited",
    "summarized_story": "Udora Orizu in AbujaThe House of Representatives has begun moves to transfer assets belonging to the defunct Nigerian National Petroleum Corporation (NNPC) to the newly established Nigerian National Petroleum Company Limited, in line with the Petroleum Industry Act (PIA).\nKingsley Uju Chima, who presided over a meeting of the panel, said there were plans to meet with Chief Executive Officer of NNPC Limited, Mele Kyari, soon.\nIt is also hinged on the provisions of Section 54 of the recently signed Petroleum Industry Act.\n“The Minister of Finance and Attorney General of the Federation shall develop a framework for payment of liabilities not transferred to the NNPC Limited.\nIf the determination and transfer is not done within the stipulated 18 months, the assets, interests and liabilities are deemed transferred to NNPC Limited.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "In Major Setback for Oil Production, Shell Defers Expansion Work on 225,000bpd Bonga Oilfield",
    "summarized_story": "*Oil giant announces $19.29bn 2021 full year earningsEmmanuel Addeh in AbujaIn a big hindrance to Nigeria’s hope of raising its poor daily oil production, Shell has said it would delay expansion work at its Nigerian offshore Bonga field by another two years.\nAfter the resolution of the dispute, Shell once again invited bids for the construction of a new floating production storage and offloading (FPSO) unit for its Bonga Southwest deepwater oil field in Nigeria.\n“There has been a delay in progressing with the tendering process for the Bonga Southwest field.\n“The Bonga Southwest has been deferred,” he said, declining to offer further details.\nDeveloping Bonga South-west was set to add around one billion barrels to Nigeria’s oil reserves, the report stated."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "Ikeazor: Measures in place to contain SEPCOL’s oil vessel fire",
    "summarized_story": "Sharon Ikeazor, minister of state for environment, says necessary efforts are being made to ensure the fire incident at Ukpokiti oil field is contained.\nTheCable had reported that fire engulfed a floating production, storage and offloading (FPSO) vessel named ‘Trinity Spirit’ in the early hours of Wednesday.\nIkeazor said the oil vessel belonging to Shebah Exploration and Production Company Limited (SEPCOL) was holding about 50-60 thousand barrels of crude oil at the time of the incident.\nFurthermore, the Agency has called on oil industry operators proximate to the oil field to lend support in achieving rapid response.\n“Similarly, the Clean Nigeria Associates, a co-operative of the oil companies responding to tier II oil spill incidents has been notified to also lend its support."
  },
  {
    "headline": "Ikeazor: Measures in place to contain SEPCOL’s oil vessel fire",
    "summarized_story": "Sharon Ikeazor, minister of state for environment, says necessary efforts are being made to ensure the fire incident at Ukpokiti oil field is contained.\nTheCable had reported that fire engulfed a floating production, storage and offloading (FPSO) vessel named ‘Trinity Spirit’ in the early hours of Wednesday.\nIkeazor said the oil vessel belonging to Shebah Exploration and Production Company Limited (SEPCOL) was holding about 50-60 thousand barrels of crude oil at the time of the incident.\nFurthermore, the Agency has called on oil industry operators proximate to the oil field to lend support in achieving rapid response.\n“Similarly, the Clean Nigeria Associates, a co-operative of the oil companies responding to tier II oil spill incidents has been notified to also lend its support."
  },
  {
    "headline": "EXTRA: Release Igboho or we'll free him using 'juju', Agbekoya warns Benin Republic",
    "summarized_story": "Kamorudeen Okiki, president of Agbekoya Worldwide, has asked the government of Benin Republic to release Sunday Adeyemo better known as Sunday Igboho or the group will use a traditional means to free him from detention.\nHe fled Nigeria for Benin Republic after the Nigerian government declared him wanted.\nWe know that it is the federal government that is holding Igboho in Benin Republic, but we are telling Benin Republic authorities now to legally release him using their court,” he said.\nAdvertisement“We are Agbekoya, if they don’t release Sunday Igboho legally, we are going to take him out of Benin Republic.\n“I repeat, we Agbekoya, will get him out of Benin Republic detention and bring him back home.”"
  },
  {
    "headline": "EXTRA: Release Igboho or we'll free him using 'juju', Agbekoya warns Benin Republic",
    "summarized_story": "Kamorudeen Okiki, president of Agbekoya Worldwide, has asked the government of Benin Republic to release Sunday Adeyemo better known as Sunday Igboho or the group will use a traditional means to free him from detention.\nHe fled Nigeria for Benin Republic after the Nigerian government declared him wanted.\nWe know that it is the federal government that is holding Igboho in Benin Republic, but we are telling Benin Republic authorities now to legally release him using their court,” he said.\nAdvertisement“We are Agbekoya, if they don’t release Sunday Igboho legally, we are going to take him out of Benin Republic.\n“I repeat, we Agbekoya, will get him out of Benin Republic detention and bring him back home.”"
  },
  {
    "headline": "The north will determine Nigeria’s next president",
    "summarized_story": "In Nigeria’s politics, the north is indispensable – and it has always been.\nOwing to the alliance, Tafawa Balewa emerged as Nigeria’s first prime minister while Nnamdi Azikiwe became Nigeria’s first non-executive president.\nFrom former President Olusegun Obasanjo, former President Goodluck Jonathan to President Muhammadu Buhari – they all had the backing of the north to win.\nIn 2023 when the south is expected to produce Nigeria’s president, the electoral decision of the north is even more paramount.\nAdvertisementThe north will determine Nigeria’s president in 2023."
  },
  {
    "headline": "Saudi Arabia: A new home for Nigerian startups?",
    "summarized_story": "The Startup Passport initiative, which will ultimately be between the 8-member DCO countries, rolled out initially in Saudi Arabia and Nigeria.\nThis announcement implies that Nigerian startups building products that primarily serve the Middle East and North Africa (MENA) region are invited to build their companies from Saudi Arabia with support from the government.\nFaris AlSaqabi, Saudi Deputy Minister for Future Jobs and Capabilities, explained that the bond between Saudi Arabia and Nigeria is fueled by the country’s movement to a digital economy.\nNigerian Minister of Communications and Digital Economy, Isa Ali Pantami in conversation with a representative of the Digital Cooperation Organization.\nThis new program is expected to transform Saudi Arabia into a leading digital entertainment and media production hub."
  },
  {
    "headline": "TechCabal is surging ahead in 2022 and beyond 🚀",
    "summarized_story": "This year, we are hyper-focused on fine-tuning our editorial standards and establishing TechCabal as one of Africa’s most reputable technology and media publication.\nHe was a senior staff writer at TechCabal for 1 year and 8 months.\nHe was a staff writer at TechCabal for almost 2 years.\nMLIT is a flagship launched by Kay Uguwede, a former TechCabal staff writer.\nDigital Nomads was launched and exclusively written by Olumuyiwa, a former senior staff writer at TechCabal."
  },
  {
    "headline": "Detty December: New data identifies Lekki Phase 1 as Lagos’s COVID-19 hotspot",
    "summarized_story": "Adaobi* is a 24-year-old software engineer living with her 49-year-old mother Oge* at Lekki Phase 1, in Lagos, Nigeria.\nWe noticed that customers in Lekki Phase 1 that would normally order 20 packs of antimalarial drugs for sale within 3–4 days were now ordering 60–70 packs every 1–2 days,” said Okwuada.\nA sore throat is not indicative of malaria but it is one of the major symptoms of COVID-19.\nAnother resident of Lekki Phase 1 jokingly said he suspects everybody in Lekki has the virus already.\nAccording to a Reuter data, COVID-19 infections are decreasing in Nigeria, with 94 new infections reported on average each day."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Afrobeats: “There are global moments, but the biggest opportunity is Nigeria.” — Obi Asika",
    "summarized_story": "Obi Asika, Founder of Storm 360 Records and Co-founder of Social Media Week LagosThere is no doubt that African music, especially Afrobeats — the melting pot of West African music styles blended with American Jazz — has gone global.\nThis was then fused with Western influences to create Afrobeats.\nBy the late 2000s, we had Myspace, then Facebook, followed by YouTube,” Asika noted.\nWhile Asika believes that several platforms played a significant role in making Afrobeats go global, the talents that create the music play the biggest part.\n“Once we see the Internet no longer becoming a barrier, we’re truly going to see how African music will blow up."
  },
  {
    "headline": "How changing customer attitudes will affect fintech business models in Africa",
    "summarized_story": "Nigeria alone has 144 fintech startups, per Statista.\nAn underdeveloped financial system, difficulty accessing credit, and a growing number of smartphone users present a huge opportunity for new and existing fintech players in Africa.\nAdvertisementPreparing for competitionOluwatobi Boshoro, CEO of Infinitetiks, believes that fintech startups can expect to see competition from startups on the fringes of the financial services sector.\nCurrently, most fintech startups in Africa are focused on one financial service.\nSo what does this mean for fintech startups?"
  },
  {
    "headline": "Building a sense of trust and providing insurance for more Africans",
    "summarized_story": "Today, I’m discussing:GIG Logistics’ crypto integrationLAMI’s acquisition to drive expansion in AfricaGIG Logistics’ crypto integrationRecently, the only constant for Bitcoin has been a downward spiral.\nThose who do not have an XPAD wallet can create one on GIGGO.\nDue to the traditional distribution of insurance policies by individual insurance agents, Africa has low insurance coverage.\nTo make insurance coverage available to more people in Africa on a larger scale, the company has acquired Bluewave Insurance Agency for an undisclosed sum.\nAdelaide Odhiambo, who now works as the head of commercial partnerships at Lami, founded Bluewave Insurance, another Kenyan startup."
  },
  {
    "headline": "Escravos explosion: Setback for local content drive",
    "summarized_story": "“These recent incidents will raise questions and scepticism about the technical know-how of the local operators going forward, a development that is bad for Nigeria’s Local Content Act,” an investor exposed to Nigeria’s oil and gas sector says.\n“No operation in the energy sector must compromise on safety to accommodate local content,” Nwakwue states.\nIn 2017, the NCDMB launched the $200 million NCI Fund, which is funded from the Nigerian Content Development Fund established by the Local Content Act, helping to fund asset acquisition and assisting in loan refinancing.\nBy 2027, the NCDMB says it intends to increase local content to 70 percent, which will see the retention of as much as $14 billion within the country, annually.\nBut the inability of local oil firms to rise up to recent oil spills and handle re-mediation works in case of emergency calls for concern, experts say."
  },
  {
    "headline": "APC side-steps crisis, set for convention",
    "summarized_story": "The ruling All Progressives Congress (APC) has shown serious signs of going ahead with February 26, 2022, the date for the National Convention of the party, despite internal wrangling and negative permutations.\n“There must be issues in a political party.\n“We cannot sit down and say until all issues are settled before we can hold a convention.\nIf APC fails to conduct the convention as already fixed, the party will lose credibility,” he said.\n“I do not see any sense in the argument that why the National Convention would not hold is because the Abdullahi Adamu-led committee is still busy with its reconciliation drive."
  },
  {
    "headline": "Nigeria’s young drive gaming market revolution",
    "summarized_story": "As Africa’s gaming industry sees continuous growth, Nigeria happens to be one of the leading nations in terms of gaming activities, revenues, and the number of people playing games.\nThe trends seen in Nigeria’s gaming industry are another reason for traction.\nAs everyone is conscious of their data, no one wants to play a game that will burn all their data,” Vrakas said.\nThere has been a forecast of how the gaming industry will yield more revenue as the year unfolds.\nAccording to public sources, gaming content providers like Gameloft, Intralot, and Sirplay have partnered local gaming companies to participate in the growing success of the gaming industry by providing technology services and support."
  },
  {
    "headline": "Digital Broadcasting: Ministry of Communication and Orientation to Partner Edo State University, Uzairue – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUZAIRUE- – Edo State Ministry of Communication and Orientation will partner with Edo State University Uzairue in raising a new set of professionals that will drive the progress that Nigeria needs in the Broadcasting industry, just as the Ministry work towards having a new digital broadcasting sector.\nAndrew Adaze Emwanta during a facility tour of the Edo state University Uzairue, Etsako West Local Government area of Edo State.\nHe disclosed that the Ministry of Communication and Orientation is working towards having a new digital broadcasting sector to be controlled by the state.\nAccording to him, “Broadcasting has gone beyond analogue and the Ministry is working towards having a new digital broadcasting sector that we as a state can control.\n“The Nigeria University Commission, NUC ranking has placed Edo University 10th best in Nigeria, 2nd best in the state and the best in the South South region."
  },
  {
    "headline": "Edo Cricket Teams Win PWC National U-17 South-South Qualifiers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State male and female U-17 cricket teams, emerged champions respectively, at the PWC national cricket under 17 South-South zonal qualifiers, which took place in Benin City.\nIn the male category of the qualifiers, that took place at the Edo boys high school Cricket pitch, in Benin City, the Edo State defeated Akwa Ibom by 10 wickets.\nIn the first innings, the Edo State team had chased down their 51 runs target in the 15th over having run the Akwa Ibom team out for 50.\nEarlier in the qualifiers, the Edo State team defeated Delta state by 2 wickets in the preliminary round (Super Knockout) that took place yesterday.\nAt the Iyoba girls college where the female qualifiers took place, the Edo State team led by Coach Guobadia Esewi Peter also became champions."
  },
  {
    "headline": "NBBF: Kida vows to build solid,sustainable Domestic leagues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – After a successful elective Congress of the Nigeria Basketball Federation (NBBF) in Benin City, the leadership of the NBBF board led by Engr Musa Kida has expressed its determination to build a domestic league structure that will reflect the immense potentials that abound in Nigeria.\nThe reelected NBBF President Musa Kida gave the assurance while entertaining questions from Journalists in Benin.\nEngr Musa Kida who was unanimously returned as the NBBF’s president said the symbolic election heralds a new dawn with the domestic league at the front burner of the board’s plan.\n“We are hoping that all these stakeholders will come on board so that together we have a verile and enviable domestic league”.\nNigeria basketball election into its federation was conducted in the most democratic way with 27 states out of the 36 and the Federal Capital Territory present”."
  },
  {
    "headline": "Voters Registration: INEC meets stakeholders in Oredo LGA tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Independent Electoral Commission (INEC) in Oredo Local Government Area of Edo State, will tomorrow, Thursday, February 3, 2022, meet with stakeholders in the local council, as part of ongoing drive for the Continuous Voters Registration (CVR) exercise across the country.\nIn a statement by the Electoral Officer, Oredo LGA, Ikpe Emmanuel Benson, and signed by the Assistant Electoral Officer, Admin, Mrs. Osakue N.S, the electoral body said the stakeholders’ meeting will take place at INEC Office, along Ekenwan Road, by 11. am.\nShe noted, “As you are aware, the Independent National Electoral Commission is undergoing the Continuous Voters Registration exercise nationwide, in preparation for the 2023 General Elections and Issuing of Permanent Voters Card (PVC).\n“As a result, the electoral body will meet with the major stakeholders in the LGA at the INEC Office, Ekenwan Road by Asoro Slope, Benin City on 3rd February 2022 by 11 am.”..."
  },
  {
    "headline": "Alleged N8.7bn Debt: Former Ecobank MD, Funke Osibodu’s Husband, Victor, Dragged To Court",
    "summarized_story": "The lawsuit between Ecobank Nigeria Limited and a businessman, Victor Osibodu, and his firm, Vigeo Limited, has been delayed till March 17 by the Federal High Court in Lagos.\nVictor is the husband of Funke Osibodu, a former managing director of Ecobank Nigeria, a former top Group Executive of the Ecobank Group and Union Bank of Nigeria.\nEcobank is seeking to recover the sum from the duo, alleging that it was a debt, but Osibodu and Vigeo deny being indebted.\nJustice Yellin Bogoro fixed the date after parties prayed for time to reconcile the exhibits sought to be tendered by the bank.\nThey stated that they were not indebted to the Plaintiff in the sum of N8,701,770,328.83 or any sum at all."
  },
  {
    "headline": "Alleged N8.7bn Debt: Former Ecobank MD, Funke Osibodu’s Husband, Victor, Dragged To Court",
    "summarized_story": "The lawsuit between Ecobank Nigeria Limited and a businessman, Victor Osibodu, and his firm, Vigeo Limited, has been delayed till March 17 by the Federal High Court in Lagos.\nVictor is the husband of Funke Osibodu, a former managing director of Ecobank Nigeria, a former top Group Executive of the Ecobank Group and Union Bank of Nigeria.\nEcobank is seeking to recover the sum from the duo, alleging that it was a debt, but Osibodu and Vigeo deny being indebted.\nJustice Yellin Bogoro fixed the date after parties prayed for time to reconcile the exhibits sought to be tendered by the bank.\nThey stated that they were not indebted to the Plaintiff in the sum of N8,701,770,328.83 or any sum at all."
  },
  {
    "headline": "Ex- Rector’s Son, Olaoye, Two Others Jailed for Cyber Fraud in Ilorin",
    "summarized_story": "The trio of Olaoye, Badmus and Abdulsalam, who were prosecuted on separately by the anti-graft agency pleaded guilty to their respective charges.\nThe judge sentenced Olaoye to a term of six months imprisonment with N 150, 000.00 (One Hundred and Fifty Thousand Naira) as option of fine.\nSimilarly, Justice Akinpelu sentenced Badmus to six months imprisonment with N 100, 000.00 (One Hundred Thousand Naira) as option of fine.\nTwo phones and a laptop used by the convict to perpetrate the crime were also forfeited to the Federal Government.\nSimilarly, Justice Akinpelu sentenced Abdulsalam to six months imprisonment with N 150, 000.00 (One Hundred and Fifty Thousand Naira) as option of fine."
  },
  {
    "headline": "Ex- Rector’s Son, Olaoye, Two Others Jailed for Cyber Fraud in Ilorin",
    "summarized_story": "The trio of Olaoye, Badmus and Abdulsalam, who were prosecuted on separately by the anti-graft agency pleaded guilty to their respective charges.\nThe judge sentenced Olaoye to a term of six months imprisonment with N 150, 000.00 (One Hundred and Fifty Thousand Naira) as option of fine.\nSimilarly, Justice Akinpelu sentenced Badmus to six months imprisonment with N 100, 000.00 (One Hundred Thousand Naira) as option of fine.\nTwo phones and a laptop used by the convict to perpetrate the crime were also forfeited to the Federal Government.\nSimilarly, Justice Akinpelu sentenced Abdulsalam to six months imprisonment with N 150, 000.00 (One Hundred and Fifty Thousand Naira) as option of fine."
  },
  {
    "headline": "JUST IN: FG creates new agency, appoints CEO",
    "summarized_story": "President Muhammadu Buhari has approved the establishment of a new government agency, the Nigeria Data Protection Bureau (NDPB).\nThe establishment of the agency followed a request made by the Minister of Communications and Digital Economy, Prof Isa Ali Pantami.\nHe said the successful implementation of the National Digital Economy Policy and Strategy (NDEPS) for a Digital Nigeria has significantly increased the adoption of data platforms and accelerated the ‘datafication’ of the country.\n“This has increased the importance of having an institution that focuses on data protection and privacy,” he said.\n“Furthermore, the issuance of the Nigeria Data Protection Regulation (NDPR) in January 2019, as a subsidiary legislation to the National Information Technology Development Agency (NITDA) Act 2007, has increased awareness about the need for data protection and privacy."
  },
  {
    "headline": "Nigerians Need Another Leader Like Buhari In 2023 – Presidency",
    "summarized_story": "According to the Presidency, as 2023 approaches, Nigerians must elect a new leader, such as President Muhammadu Buhari, who can clean up the country’s corruption and mess.\nHe said, “The Niger Delta Development Commission (NDDC) is an interventionist agency created for the development of the oil producing region of the country.\n“Well, it is meant to be an interventionist agency, but one thing is crystal clear.\nAn interventionist agency is established to serve the people, and it turns to a private cash cow for a few people.\nThat is what President Buhari has in mind, and that is what we should get."
  },
  {
    "headline": "Group Commends Sanwo-Olu Over Two New Varsities",
    "summarized_story": "The Lagos State Chapter of the Advocates for Good Governance has praised the state governor, Babajide Sanwo-Olu, for signing laws to establish two more universities in the state, the Lagos State University of Education and the Lagos State University of Science and Technology.\nMr. Biyi Adebisi, the group’s coordinator, issued the commendation in a statement on Thursday.\nSanwo-Olu signed the bills transferring the Lagos State Polytechnics in Ikorodu, Isolo, and Surulere to the University of Science and Technology, as well as the Adeniran Ogunsanya Colleges of Education in Ijanikin and Michael Otedola College of Primary Education in Epe, to the Lagos State University of Education on Wednesday.\nThe establishment of the two new universities, according to the organization, will resolve concerns relating to the admission of Lagos State residents.\nThe group, while commending Sanwo-Olu “for putting his full weight behind the establishment of the two additional universities,” also appreciated the Lagos State House of Assembly led by Mudashiru Obasa for believing in the process."
  },
  {
    "headline": "2023: Shehu Sani Warns Buhari Against Retiring To Katsina After His Tenure",
    "summarized_story": "2023: Shehu Sani Warns Buhari Against Retiring To Katsina After His TenureFormer federal legislator Shehu Sani has advised President Muhammadu Buhari against retiring to Daura, Katsina State, at the end of his term.\n“If this is the State the President wants to retire and settle, he must secure it first,” he cautioned.\nOn Wednesday night, suspected bandits killed a village chief, Alhaji Jafaru Rabi’u, and abducted a yet-to-be-identified lady at Daddara Liman, Jibia Local Government Area of Katsina State, according to a report from the state.\nAccording to Mallam Yunusa, a local citizen, the terrorists also killed four other persons in the adjoining Daddara hamlet, which is part of the same Council.\nAs the locals fled for safety, the robbers plundered many household items, according to the report."
  },
  {
    "headline": "Breaking: Again, Zamfara assembly moves to impeach deputy governor",
    "summarized_story": "After six months, the Zamfara state House of Assembly has reportedly begun a fresh move to impeach the incumbent deputy governor of the state, Mahdi Aliyu Gusau.\nThe state lawmakers had in July 2021, accused the deputy governor of the Peoples Democratic Party (PDP), and gave him a 48-hour ultimatum to appear before it over allegations of official misconduct levelled against him.\nIt remains to be seen the approach the state assembly would deploy this time around.\nDetails loading…"
  },
  {
    "headline": "Pictures: Aliko Dangote storms revamped Moshood Abiola stadium pitch, hails FG",
    "summarized_story": "Billionaire businessman and Africa’s richest man, Aliko Dangote, on Thursday evening, visited the newly renovated Moshood Abiola Stadium pitch, adopted by him under the Minister of Youth and Sports Development, Sunday Dare’s Adopt-a-Pitch initiative.\nDangote, whose company, Dangote Industries Group sponsored the rehabilitation of the pitch, expressed satisfaction with the job done, as he was conducted round the pitch with the sprinklers working perfectly, and the two Digital score-boards beaming live.\nSo I think we need to complement government’s efforts to ensure that everything works.”The Minister expressed appreciation to Dangote for accepting to adopt the Moshood Abiola Stadium, stating that he was the first to embrace the Ministry’s Adopt-a-Pitch initiative.\nThe revamped Moshood Abiola Stadium is complete with nursery beds, two digital score boards, 24 Sprinklers and two-year maintenance, as part of the contract sponsored by Dangote Industries under the Adopt-a-Pitch Public Private Partnership initiative of the Ministry.\nDaura stadium Katsina has also been completed, while National Stadium Lagos amongst others have been adopted, and are at different stages of completion."
  },
  {
    "headline": "FCT polls: No election in 593 polling units – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) has stated that out of the 2,260 polling units in the FCT 593 of them have no registered voters and no election would take place at the polling units.\nYakubu said, “From just 562 polling units, the commission established additional 2,260 units and relocated some of them from congested locations to proximate but underserved areas.\n“Consequently, there are 593 polling units in the FCT without registered voters, 1,328 polling units with between 0-50 voters and 546 polling units with over 1,000 registered voters.\nThe INEC boss also spoke on other preparations for the FCT election remaining only nine days.\n“Similarly, election results will be uploaded to the INEC Result Viewing portal (IReV) in real-time when voting ends and votes are counted at polling units on Election Day”,Yakubu said."
  },
  {
    "headline": "Osinbajo, Gowon, Others Attend Shonekan’s Funeral In Lagos",
    "summarized_story": "﻿The funeral service of former Head of Interim Government, Chief Ernest Shonekan is holding at the Cathedral Church Of Christ, Marina in Lagos.\nOthers in attendance are the Secretary to the Government of Federation, Boss Mustapha, Minister of Information Lai Mohammed, Former Head Of State Yakubu Gowon, the Lagos State Governor Babajide Sanwo-Olu, Ogun State Governor Dapo Abiodun, as well as the Governor of Edo State, Godwin Obaseki.\nThe Lagos State government had announced a 13-hour closure of roads leading to Marina where the funeral is taking place.\nSince then, Shonekan went on to feature prominently as an elder statesman.\nAt the time of his death, he was the third oldest surviving Nigerian Head of State after Queen Elizabeth II and General Yakubu Gowon."
  },
  {
    "headline": "Gunmen Murder Retired Police Officer In Imo State",
    "summarized_story": "Gunmen have murdered a retired police officer Chris Kpatuma a.k.a Hipis in Mgbala Agwa Autonomous Community, Oguta Local Government Area of Imo.\nThe spokesman of the Imo State Police Command Mike Abatam, who confirmed the development, also said investigations into the matter have commenced.\nRELATEDSoldier Killed, Two Others Injured As Gunmen Ambush Troops In RiversGunmen Attack Police Station In Imo, Kill InspectorKpatuma’s murder is the latest in a series of attacks on security personnel and facilities in the South East, especially in Imo State.\nIn recent months, gunmen have targeted security agencies in the state, killing some and injuring others.\nBefore the recent incident, gunmen attacked a police station in Mgbidi, the headquarters of Oru West Local Government Area of the state."
  },
  {
    "headline": "Insurgency: Build On Gains Rather Than Denigrate Efforts Of Nigerian Military – Gen Usman",
    "summarized_story": "A former Nigerian Army spokesman, Brigadier General Sani Usman, has asked authorities to look at the feats attained by the Nigerian Armed Forces and stop denigrating the military, even as the war against insurgency rages on.\nGeneral Usman made the call on Friday while appearing as a guest on Channels Television’s Sunrise Daily.\nAddressing Zulum’s request, General Usman believes that such statements are highly demoralizing to the troops and as such should be stopped forthwith.\nGiving inferences as to what the nation needs to total decimate the terrorists, General Usman said additional numbers to the ranks, more equipment, and weaponry, will serve in consolidating the victory over the insurgents.\nGeneral Usman urged people to commend the Nigerian troops for what they have done and are still doing, stressing that the grounds they have covered in less than two decades within which the war has spanned, is indeed laudable."
  },
  {
    "headline": "FG Uncovers 96 Financiers Of Boko Haram, ISWAP",
    "summarized_story": "The Federal Government says it has uncovered 96 financiers of terrorism across the country, especially those backing Boko Haram and the Islamic State of West Africa Province (ISWAP).\nStill, on terrorism financing, Lai Mohammed said the NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping, and others with 19 countries.\nIt is common knowledge that one of the most difficult tasks for any government is to fight corruption, because when you fight corruption, corruption will fight you back!\nAlso, from its analysis of tax evasion and tax avoidance linked to corruption, NFIU has identified N3,909,707,678,112.43 in VAT and N3,737,918,335,785.82 in WithholdingTax due to the Government.\nOn terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries."
  },
  {
    "headline": "Amaechi, Malami Sued Over Alleged Unlawful Award Of N91.7bn Rail Line Contract",
    "summarized_story": "The Minister of Transportation, Rotimi Amaechi and the Attorney General of the Federation (AGF), Abubakar Malami (SAN) have been dragged before a Federal High Court in Abuja over an alleged unlawful award of 190 km rail line construction to a Chinese firm without due process of law.\nThey were sued along with the Federal Ministry of Transportation and the benefitting firm, China Civil Engineering Construction Company (CCECC).\nPlaintiffs in the suit marked FHC/ABJ/CS/1426/2021 Duluidas Nigeria Limited, Duliz Dredging and Construction Limited and Consortium of Duluidas Nigeria Limited, Duliz dredging and Construction Limited/Hebbelyixin Fastener Company Limited, China.\nPlaintiffs applied for order of injunction against the minister, his ministry and the CCECC from continuing with the award of the contract and execution of same on the basis of a flawed process.\nMeanwhile, a hearing in the matter has been fixed for February 17, 2022, by Justice Ahmed Ramat Mohammed."
  },
  {
    "headline": "APC inaugurates 34 State chairmen amid unresolved factional crisis",
    "summarized_story": "The All Progressives Congress has inaugurated elected state chairmen in the 34 states of the country and the federal capital territory, Abuja.\nHowever, Kano and Sokoto states chairmen were not inaugurated.\nAdvertisementThis is coming on the heels of preparation for the national convention which has been fixed for February 26th, even as the party has confirmed the convention date to the Independent National Electoral Commission (INEC).\nMaking the announcement during inauguration, the secretary of the Caretaker Committee, James Akpanudoedehe said he has been directed to hand over their certificate of return to them"
  },
  {
    "headline": "APC CECPC approves schedule of activities for 2022 National Convention -",
    "summarized_story": "The All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) has adopted the timetable/schedule of activities for the 26th February, 2022 APC National Convention.\nThe adoption was taken at its 19th regular meeting on Wednesday 19th January, 2022 at the Party’s National Secretariat (Buhari House)AdvertisementThe approved schedule of activities is as follow***Receiving of the Interim Report of the National Reconciliation Committee – 31/01/2022Advertisement***Consideration and adoption of Reports of State Congresses – 02/02/2022***Inauguration of the State Executives – 03/02/2022Advertisement***Sales of Forms to all aspirants vying for National Offices (APC National Secretariat) – 14/02/2022***Submission of completed forms and accompanying documents (APC National Secretariat) – On or before 19/02/2022Advertisement***Publication of Sub-Committees – 19/02/2022***Screening of all aspirants vying for National Offices – 20th – 22nd of February.\n2022Advertisement***Screening Appeals to hear and resolve complaints arising from the screening exercise – 23/02/2022***Accreditation of all statutory and elected delegates to the National Convention – 24th – 25th of February 2022Advertisement***National Convention to elect National Officers to the National Executive Committee (NEC) – 26/02/2022***National Convention Appeal to hear and resolve complaints arising from the National Convention – 28/02/2022Advertisement"
  },
  {
    "headline": "Party supporters troop to APC secretariat as State chairmen inaugurated -",
    "summarized_story": "Party supporters on Thursday trooped to the All Progressives Congress secretariat for the inauguration of the states chairmen.\nThe supporters of the various state’s chairmen across the state made it difficult for members of Caretaker/Extra-ordinary Convention Planning Committee(CECPC) of the All Progressives Congress(APC) as well as the elected chairmen get access to the secretariat.\nAdvertisementHowever, the intervention of security returned normalcy shortly after.\nThe committee members are currently having a close door meeting before commencement of the inauguration"
  },
  {
    "headline": "Ondo by-election: Olumuyiwa Adu emerges as PDP candidate",
    "summarized_story": "Olumuyiwa Adu has emerged as the People’s Democratic Party candidate for the Akure South/North Federal Constituency by-election.\nMr. Adu scored 98 votes to beat its closest rival Kemisola Adesanya who scored 70 votesAdvertisementA total of 233 delegates participated in the primary election."
  },
  {
    "headline": "Nigerian Senator Okorocha Seeks Buhari’s Intervention in N2.9bn Fraud Case – Arise News",
    "summarized_story": "“The court ordered the EFCC to release my international passport, the EFCC has refused to obey.\nThat’s not the issue; that there’s judgment on the ground.\nThere’s judgment and there’s order of court that I’m asking Mr. President, who appointed the EFCC to recall that there was the law that established the EFCC.\n“And if that law is good to make somebody EFCC, that law should be obeyed, too.\nSo, I’m not asking Mr. President, to speak on matter,” he said."
  },
  {
    "headline": "Nigeria: Shell Defers Expansion Work on 225,000bpd Bonga Oilfield By Two Years",
    "summarized_story": "In a big hindrance to Nigeria’s hope of raising its poor daily oil production, Shell has said it would delay expansion work at its Nigerian offshore Bonga field by another two years.\n“There has been a delay in progressing with the tendering process for the Bonga Southwest field.\nA spokesman for the Shell Petroleum Development Company (SPDC), Nigeria, confirmed that the contract award for the construction of the 150,000 bpd Bonga Southwest FPSO had been put on hold.\n“The Bonga Southwest has been deferred,” he said, declining to offer further details.\nShell had previously said it would develop the Bonga South-west project in three phases, with a total potential yield of 3.2 billion barrels."
  },
  {
    "headline": "WHO: Africa Records 1.1 Million New Cancer Cases, 700,000 Deaths Annually",
    "summarized_story": "The World Health Organisation (WHO) on Thursday said Africa records about 1.1 million new cases of cancer every year resulting in 700,000 deaths.\n“Every year, Africa records around 1.1 million new cases of cancer, resulting in up to 700 000 deaths.\nNational screening programmes are now operational in 72 per cent countries, 11 of which offer high-performance screening.\nNational screening programmes are now operational in 72 per cent countries, 11 of which offer high-performance screening.\nHe disclosed that Senegal was in the process of including childhood cancers in its new National Cancer Control Plan."
  },
  {
    "headline": "Nigeria: NUPRC Begins Probe of 22,000bpd Oil Vessel Explosion in Niger Delta",
    "summarized_story": "The Nigerian Upstream Petroleum Regulatory Commission (NUPRC) said it has commenced an investigation into the circumstances surrounding the explosion of a Floating Production, Storage and Offloading (FPSO) vessel in Warri, Delta State.\nThe huge facility, TRINITY SPIRIT, was built in 1976 (46 years ago), with a carrying capacity of 274774 Dead Weight Tonnage (DWT) and an overall length of 337.05 metres as well as a width of 54.5 metres.\nThe asset is owned by Shebah Exploration and Production Company Limited (SEPCOL), now in receivership, which in 2004 acquired all of 40 per cent of ConocoPhillips equity interest in OML 108.\nThe FPSO serves as the primary production facility of for OML 108 and is also a government approved terminal for lifting operations for all OML 108 production.\nIn the release titled: “Fire Incident on The Trinity Spirit FPSO,” the company announced that the incident happened in the early hours of Wednesday."
  },
  {
    "headline": "Nigeria: House Moves to Transfer Defunct National Oil Corporation’s Assets to NNPC Limited",
    "summarized_story": "Nigeria’s House of Representatives has begun moves to transfer assets belonging to the defunct Nigerian National Petroleum Corporation (NNPC) to the newly established Nigerian National Petroleum Company Limited, in line with the Petroleum Industry Act (PIA).\nThe lawmakers had for this purpose set up an ad-hoc committee to ascertain the total inventory, assets, interests and liabilities of the NNPC before transferring it to NNPC Limited, to ensure a glossary accounting system.\nKingsley Uju Chima, who presided over a meeting of the panel, said there were plans to meet with Chief Executive Officer of NNPC Limited, Mele Kyari, soon.\nIt is also hinged on the provisions of Section 54 of the recently signed Petroleum Industry Act.\n“The Minister of Finance and Attorney General of the Federation shall develop a framework for payment of liabilities not transferred to the NNPC Limited."
  }
]