[
  {
    "headline": "Declare bandits federal civil servants, Shehu Sani urges govt",
    "summarized_story": "Former Senator representing Kaduna Central, Shehu Sani, has urged government to declare bandits as federal civil servants since it has failed to view them as terrorists.\nSani said this on Twitter while lamenting the killing of Christian and Muslim worshippers in their religious houses by bandits.\n“I condole the families of the Baptist denomination and Kaduna Christians for this loss and urge our security agencies to separate war against enemies of Nigerians from politics.\nHe said, “Yesterday’s attacks on the Baptist Church Kakau Daji, Kaduna State by terrorists, the killing of some worshippers and the abductions of scores of others is tragic and unfortunate.\nThe suspension of the telecom services in the North is useless.”"
  },
  {
    "headline": "Odili: NHRC calls for prosecution of perpetrators",
    "summarized_story": "The National Human Rights Commission has called for the prosecution of those behind what it called the unlawful invasion of the Abuja residence of a Justice of the Supreme Court, Justice Mary Odili.\nThe Executive Secretary of the NHRC, Tony Ojukwu, made the call on Monday in a statement signed by Deputy Director, Public Affairs of the commission, Fatimah Mohammed.\n“The perpetrators must therefore be made to account for their professional misconduct by arresting them, prosecuting them.\nThe judiciary, he said, is a very important arm of the government that should not be ridiculed under any circumstance and inexperienced law enforcement officers must be made to know this.\nTime has come to punish this kind of professional misconduct by erring law enforcement officers to forestall total destruction of the integrity of judicial offices and the Judiciary."
  },
  {
    "headline": "Comedian I Go Dye writes on raid of Justice Odili’s home",
    "summarized_story": "I Go Dye fears that if somebody of such caliber could be a victim of human rights abuse, then the common Nigerians are endangered species.\nHe writes, “ If a high profile personality like Justice of the Supreme Court; Justice Mary Odili’s home could be illegally raided and no proper legal actions taken , then we are just embracing more dastardly actions in the near future where vigilantes would soon be illegally invading the homes of ordinary Nigerians.\n“The enforcement of justice against human right abuses is the first fundamental fact that should be taken into consideration, to know if we have any rights in Nigeria.\n“The issue of human rights violations, of arresting our youths and citizens without appropriate procedures is really disgusting.\nThere can’t be a better time, than now, to effectively address this abnormality, by bringing justice upon those involved in all illegal actions on our citizens.”Since the raid on the residence of the Justice, many Nigerians have reacted."
  },
  {
    "headline": "Updated: Fear grips Ikeja community as police discover corpses in highbrow estate",
    "summarized_story": "By Esther OnyegbulaBarely 72-hours after a decapitated corpse of an unidentified teenage girl was discovered close to a popular hotel located at Adekunle village, Adeniyi Jones, Ikeja another corpse of an unknown young lady has been found at Akora estate a few blocks from where the first corpse was abandoned.\nThe corpse which was discovered by residents in the estate on Monday morning was wrapped in a nylon bag and left at the roadsideDetails later…"
  },
  {
    "headline": "Gunshots in Plateau Assembly as youths defy security",
    "summarized_story": "By Marie-Therese Nanlong – JosThe peaceful protest at the entrance of the Plateau State House of Assembly has taken a new turn as youths loyal to the two factions in the House square up against one another.\nThe youths loyal to the embattled Speaker, Abok Ayuba were carrying placards dancing to music opposite the main entrance of the House but at about 8.30 am, another group of youths gained entry into the Assembly premises through the back gate.\nSome of them shattered the glass door which leads to the Chambers of the House as the embattled Speaker and some Members loyal to him where in, having a meeting.\nWhen those standing outside recognized some of the youths within the Assembly premises as those loyal to the Yakubu Sanda group, they began scaling the gate manned by security forces to also gain entry.\nAt the time of this report, the sounds of gunshots have subsided but the youths are still in the vicinity of the House."
  },
  {
    "headline": "2023: PDP poised to return to power with new National Working Committee —Dan Orbih",
    "summarized_story": "Nigeria’s main opposition party, the Peoples Democratic Party (PDP), is set to return as the government at the centre in 2023 given the successful completion of its national convention which held on Saturday.\nThe optimism was shared on Sunday by the National Vice Chairman (South-South), Chief Dan Orbih, while congratulating the new members of the National Working Committee (NWC) who emerged Sunday morning.\nIn all, the party had confirmed the emergence of Dr Iyorchia Ayu and 20 others as new national officers.\nCommending the rancour-free convention, Chief Orbih said that the emergence of the Iyorchia Ayu leadership specifically marked a new dawn in the history of PDP and a rekindled hope in Nigeria.\n“With this great outing, PDP is set to return as the ruling party in 2023."
  },
  {
    "headline": "Ayu, Arapaja, others are proof PDP value democracy, South-West celebrates",
    "summarized_story": "The Peoples Democratic Party, PDP, South-West Zone, has congratulated the new National Chairman of the party, Senator Iyorchia Ayu, his Deputy (South), Ambassador Taofeek Arapaja, and all the newly-elected National Working Committee, NWC, noting that the nature of their emergence shows that PDP value democracy.\nThe Party gave the congratulatory message in a statement by Chief Rahman Owokoniran, the South-West Region General Secretary.\nAccording to the party, “We cannot ask for a better leader than Ayu, and a better team at this time that 2023 is around the corner.\nThe Party scribe added that “The successful process of the national convention is also proof that PDP is ready to take over come 2023.\n“We, once again, expressed our pride in Governor Makinde in being a model for youth, showing that youths can still lead this country."
  },
  {
    "headline": "Plateau: Clash in Assembly complex, as embattled Speaker, Abok, others gain access",
    "summarized_story": "There was pandemonium at the Plateau State House of Assembly in the early hours of Monday as thugs gained access from the back of the Assembly complex to wreak havoc and attempt to remove members who were already sitted in the House.\nHowever, roads leading to the Plateau State House of Assembly were barricaded as youths bearing various placards protested in support of embattled Speaker Abok Ayuba who was purportedly impeached last week Thursday.\nAs at the time of filing this report, normalcy has been restored, but security has barricaded the road leading to the State Assembly.\nAlso, both the Commissioner of Police in the State, Edward Egbuka and State Commandant NSCDC, Alexander Barunde are still in the Assembly complex.\nDAILY POST gathered that an emissary has been sent to the Governor of the State(all APC members); while other members loyal to the embattled Speaker are in the Assembly complex, saying they will not leave until the Speaker is reinstated."
  },
  {
    "headline": "NSCDC denies alleged influx of bandits into Kano",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC), Kano State Command, has dismissed reports making the rounds that bandits from Zamfara and Katsina states were relocating to Kano State.\nThe report alleged that the bandits, escaping the onslaught of security forces, were believed to have infiltrated Kano state through some communities in Shanono, Gwarzo and Kabo local government areas of the state, where they are involved in illegal mining.\nThis was contained in a statement issued by the Command’s Spokesman, DSC Ibrahim Idris-Abdullahi, in Kano on Monday.\nThey went through Zarewa village in Kano State, along Beli road to Babbarika, to a settlement belonging to one Alhaji Shehu Danfulani to attend a wedding and naming ceremony at the settlement.\n“From our investigation so far, no bandits have relocated to Gwarzo, Kabo and Shanono local government areas, as well as Dansoshiya forest,” he said."
  },
  {
    "headline": "Tarabans lament delay in appointing minister from Taraba since Mamman’s sack",
    "summarized_story": "Two months after the sacking of the former Minister of Power, Engineer Saleh Mamman, Taraba State has been without a representative at the Federal Executive Council.\nNot comfortable with the development, Taraba indigenes, who on Monday spoke with our correspondent, expressed dismay at the ongoing delay in appointing a minister from the state.\nSince their sacking, both states’ have lacked a presence at the monthly Federal Executive Council meetings.\nDati, who expressed the belief that the story would have been different if they had a minister representing them at the federal level, urged Buhari to rectify the issue.\nSince the sacked of Mamman, several political kingpins from the All Progressives Congress (APC) extraction from the state, were observed to have been lobbying for the ministerial slot."
  },
  {
    "headline": "ECOWAS Court condemns countries’ protocol shun, low compliance with judgments",
    "summarized_story": "The ECOWAS Court has decried the shun of a key protocol by member states as well as the low rate of compliance with judgments.\nThe President, Justice Edward Amoako Asante, however, expressed regret that Article 10(f) of the protocol which would have facilitated effective collaboration between national courts and ECOWAS Court is yet to be implemented by any national court.\nThe President reminded countries of the adoption of the protection of human rights as a cardinal and fundamental value enshrined in the ECOWAS Treaty.\n“It is, therefore, necessary for member states that established ECOWAS to recognize the supranationality and the need for them to abide by obligations”, he added.\nJustice Asante advised countries to comply with judgments in the Revised Treaty which clearly provides that the judgments are binding on all member states, institutions, corporate bodies, and individuals."
  },
  {
    "headline": "Kaduna clergyman decries Nigeria’s current state",
    "summarized_story": "According to him, “The Naira is just going moribund.\nHe explained, “We know that the lockdown from COVID-19 has affected so many things but many economies across the world have rebounded.\nNemesis will soon catch up with whoever has a hand in what millions of Nigerians are going through today.\n“The Almighty who created the earth is about to begin justice that will bring stability to this nation.\nSo a lot of things are about to change.”The programme had in attendance Pastor Enoch Adeboye, of the Redeemed Christian Church of God, (RCCG) governor of Akwa-Ibom state, Emmanuel Udom, Former Governor of Plateau State, Sen. Jonah Jang, senator representing Southern Kaduna, Sen. Danjuma La’ah, former Ministers of Information, Prof. Jerry Gana, Labaran Mako, and other dignitaries."
  },
  {
    "headline": "Illegal practitioners will be sanction- NIPR boss",
    "summarized_story": "The Nigerian Institute of Public Relations (NIPR), says it plans to engage the Office of the Attorney General of the Federation (AGF) to sanction individuals who are practicing public relations without license.\nThe theme of the conference was “Strategic Security and Health Communication for Sustainable Development.”Sirajo who commended the newly inducted members for escaping the wrath of NIPR, said until their induction, they were amongst illegal practitioners even if amongst the best and most experienced in the field of public relations.\n“The law actually mandates the Attorney General of the Federation to establish a Tribunal to try those found practicing public relations without licensing by the institute.\n“We’re living in a country now that conflict entrepreneurs, ethnic chauvinists, religious bigots are trying to turn the country upside down.\n“But this country belongs to all of us and we are not going to allow that to happen,” the varsity boss said."
  },
  {
    "headline": "UPDATED: Pandemonium as thugs clash over Plateau Assembly crisis",
    "summarized_story": "There was pandemonium at the Plateau Assembly in the early hours of Monday when thugs gained access and attempted to disrupt proceedings during an emergency session of Peoples Democratic Party (PDP) and All Progresives Congress(APC) members.\nThe security personnel were taken by surprise when the thugs made their way into the Assembly complex and smashed the glass door of the gate.\nA group loyal to the former Plateau Speaker Ayuba Abok was battling the police, a youth group believee to be pro-Abok also stormed the Assembly premises.\nRead Also: Lalong supervised my impeachment, says Plateau Assembly Speaker- Advertisement -This led to bloody clash between the groups that resulted in the damage of entrance doors and windows before normalcy was restored by security personnel drafted to the Assembly.\nIn a viral video, Abok sat with 11 Assembly members calling for restoration of his leadership."
  },
  {
    "headline": "Messi: nobody asked me to play free for Barcelona",
    "summarized_story": "Lionel Messi has admitted to being “hurt” by Joan Laporta’s comments on his Barcelona exit, with the Paris Saint-Germain star insisting that he was never asked to play for the club for free.\nWhen quizzed on Messi’s move to Parc des Princes, the Barca president told RAC1 in October: “I hoped Messi would do a U-turn and he would say he would play for free.\n“The truth is that, as I explained on my way out, I did everything possible to stay, never at any time was I asked to play for free,” the Argentine forward has told Sport.\n- Advertisement -“I was asked to cut my salary by 50 per cent and I did it without any problem.\nPressed on whether he expects to land a second successive Ballon d’Or, Messi replied: “If I’m honest, I don’t think so."
  },
  {
    "headline": "Tottenham sack Nuno Espirito Santo, set to appoint Conte",
    "summarized_story": "Nuno Espirito Santo has been sacked by Tottenham after only four months in charge, with Antonio Conte set to be drafted in as his replacement.\nNuno was appointed permanent successor to Jose Mourinho in June, with Spurs handing him an initial two-year contract.\nAn announcement on Spurs’ website confirmed Nuno, along with coaching staff Ian Cathro, Rui Barbosa and Antonio Dias, have all been relieved of their duties.\n- Advertisement -“Nuno is a true gentleman and will always be welcome here.\nFive of those defeats came in the Premier League, with Crystal Palace, Chelsea, Arsenal and West Ham getting the better of his side in addition to United."
  },
  {
    "headline": "2023: North’ll back credible candidate –NEF",
    "summarized_story": "From Timothy Olanrewaju, Maiduguri and Chukwudi NwejeThe Northern Elders Forum (NEF) has declared that it would back a candidate from any region for the 2023 presidential election.\n“The next president should emerge from a credible election from any part of the country but he or she must be first and foremost a Nigerian president.\nHe, however, said the north would not be cowed by threats of secession ahead of the 2023 election.\n“So, it is clear that the NEF spokesman doesn’t know what he is saying and he has no knowledge of Nigerian political history or political science.\nHe, however, said the quest for the Nigerian President of Igbo extraction in 2023 should start with getting the November 6 Anambra State election right."
  },
  {
    "headline": "Convention: How PDP govs shared NWC seats",
    "summarized_story": "From Ndubuisi Orji, Abuja and Lateef Dada, OsogboThe Democratic Party (PDP) governors have effectively taken over the structure of the party with emergence of a new leadership.\nFormer Senate president, Senator Iyorchia Ayu, emerged the new national chairman at the party’s national convention with Senator Samuel Anyanwu as national secretary.\nFormer Oyo State deputy governor, Taofeek Arapaja, emerged as deputy national chairman (South) with 2,004 votes to defeat former Osun State governor, Olagunsoye Oyinlola, who polled 705 votes.\nAlso, Umar Damagum scored a total of 2,222 votes to defeat his sole rival, Mrs Inna Ciroma, for the position of deputy national chairman (North), who polled 365 votes.\nAhmed Mohammed, Umar Bature and Daniel Woyegikuro emerged unopposed as national treasurer, national organising secretary and national financial secretary, respectively."
  },
  {
    "headline": "Use Anambra, Ekiti polls to boost your image, Catholic bishop tells INEC",
    "summarized_story": "Catholic Bishop of Ekiti, Most Reverend Felix Ajakaye, has called on the Independent National Electoral Commission (INEC) to use the coming gubernatorial elections in Anambra and Ekiti States to boost its image positively.\nHe gave the charge in Ado Ekiti at the weekend, while delivering a lecture, entitled: ‘Ekiti Politics And The Search for Great Leadership’.\nAccording to him, INEC must act as a truly independent body, and allow the votes of Nigerians to count.\nThey will set up all manner of empowerment programmes and when the election is over, you won’t see them again.\nSpeaking on the poor figures being recorded on election day due to voter apathy, the challenged Nigerians, especially those in Anambra and Ekiti to participate effectively in electoral exercise."
  },
  {
    "headline": "CBN unveils criteria for participating in 100 for 100 policy",
    "summarized_story": "In its bid to reverse the nation’s over-reliance in imports by creating a platform that supports right companies and projects with potential to immediately transform and jumpstart the productive base of the economy, the Central Bank of Nigeria (CBN) has unveiled the criteria for participating in its 100 for 100 policy on Production and Productivity (PPP).\nAccording to the apex bank, the intervention under the 100 for 100 PPP instrument shall provide Naira funding under existing CBN Intervention Processes and complete FX funding for new machinery.\nIt adds that all intervention under this project will be made public and published in national dailies.\nThese are projects that must catalyse sustainable employment-led economic growth through increased domestic production and productivity in the near term.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Bribery trails nomination of judges in Abia",
    "summarized_story": "The process of nominating judicial officers to the National Judicial Council (NJC) for appointment as state judges has been embroiled in bribery scandal in Abia State.\nAt present, it was gathered, the state judicial commission had shortlisted 15 candidates for onward transmission to NJC, from which 10 would finally be appointed Abia State judges.\nSources revealed that Abia State Judicial Commission had set an examination for candidates who wished to become state judges.\nAbout 182 judicial officers participated in the examination, including state magistrates and law lecturers, it was learnt.\nAlso, it was gathered, a wife of one of the members of the state judicial commission was among those shortlisted for nomination to NJC."
  },
  {
    "headline": "Ayu: PDP is Back to Rescue Nigeria from Her Current Mess",
    "summarized_story": "PDP is back to rescue Nigeria from the terrible mess we have been in, in the last six years.\nTwenty-one people were elected at its national convention, which began on Saturday, October 30, and lasted till Sunday, October 31, at the Eagle Square, Abuja.\nAyu was declared national chairman after 3,426 delegates affirmed his unopposed position.\nThe office of the Deputy National Chairman (South), was keenly contested and Amb.\nSetonji Koshoede is the new deputy national secretary, Ndubisi Eneh David, deputy national treasurer, Ibrahim Abdullahi is the deputy national publicity secretary, Ighoyota Amori, deputy national organising secretary, Adamu Kamale, deputy national financial secretary, Hajaja Yakubu Wanka, deputy national woman leader, Timothy Osadolor, deputy national youth leader and Okechukwu Osuoha, deputy national legal adviser."
  },
  {
    "headline": "Rotimi Amaechi: Our 2019 Experience Won’t Happen Again in Rivers",
    "summarized_story": "Somebody told me that it was Goodluck Jonathan’s government that did the feasibility studies and design and all that, I don’t know how true it is.\nI don’t know how much longer it will take them.\nI don’t know if I should tell you this, but let me give you an example.\nYou can’t just say don’t come to Rivers, or don’t come to Ogun State, no.\nHe may crack a joke, a lot of people don’t know him."
  },
  {
    "headline": "CBN Unveils ‘100 for 100’ Policy",
    "summarized_story": "According to the central bank, the move was to ensure the operational framework for a robust and transparent process for identifying and selecting high-impact companies and projects under its 100 for 100 PPP.\nShedding more light on the initiative, the CBN stated that the instrument shall provide naira intervention funding under existing CBN intervention processes and complete foreign exchange funding for new machinery.\nFirms that intend to benefit from the instrument would be scored: Highly satisfactory, satisfactory, less satisfactory and unsatisfactory in their application.\nEmefiele had said with the new initiative, CBN would advertise, screen, scrutinise and financially support 100 targeted private sector companies in 100 days, beginning from November 1.\nUnder the initiative, the CBN governor had said, a new set of 100 companies would be rolled out every 100 days and their names would be published in the national dailies for Nigerians to see and confirm."
  },
  {
    "headline": "Buhari Departs Abuja Sunday for Climate Change Conference in Glasgow",
    "summarized_story": "To also participate in Paris peace summitBy Deji ElumoyePresident Muhammadu Buhari is expected to depart Abuja on Sunday for Glasgow, Scotland to attend the 26th Conference of Parties (COP26) to the United Nations Framework Convention on Climate Change (UNFCCC).\nPresident Buhari’s address is expected to highlight Nigeria’s key priorities and action to tackle climate change as well as progress on the country’s transition to low carbon economy, consistent with achieving the Paris Climate Agreement.\nIn Glasgow, President Buhari will participate in some side-line events hosted by US President Joe Biden and French President Emmanuel Macron.\nPresident Buhari will thereafter travel to Paris, France on an official visit to reciprocate an earlier one to Nigeria by the French President, Emmanuel Macron, and also attend the Paris Peace forum 2021, the fourth edition to be hosted by the French President.\nPresident Buhari is expected back in the country after the engagements."
  },
  {
    "headline": "News in Photographs: Tinubu Visits Buhari in State House",
    "summarized_story": "By Deji ElumoyeNational Leader of the ruling All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu on Sunday visited President Muhammadu Buhari in Abuja.\nAlthough details of the visit was not immediately known, President Buhari played host to the former Lagos State Governor at his official residence at the Presidential Villa in Abuja.\nThe President had last month visited Tinubu at his London residence and the Sunday’s visit by Asiwaju may be a way of reciprocating the President’s earlier visit.\nTinubu who arrived the President’s residence at about 10.50am and left at about 12.28pm was said to have discussed happenings in the APC and the way forward with President Buhari during the one and half hour meeting.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "ID Card Of Policeman Who Led Raid On Justice Odili's Residence Was Signed By Buhari’s Minister, Malami",
    "summarized_story": "Justice Odili’s family residence at lmo Rivers Street in Maitama, Abuja, was raided by fully armed plain-clothes security men last Friday.\nThe Identity Card of the police officer who led the assault on the residence of Justice Odili was signed by the AGF.\nSaharaReporters learnt that the name on the ID Card is Ajodo F. L. of the Police And Assets Recovery unit.\nArmed operatives had stormed Odili’s residence bearing a warrant that was issued based on information from a whistle-blower, Aliyu Umar, an Abuja-based resident.\nAnother source said, “Regarding the raid on Odili's House, it was planned because they don’t want her to become the next CJN."
  },
  {
    "headline": "ID Card Of Policeman Who Led Raid On Justice Odili's Residence Was Signed By Buhari’s Minister, Malami",
    "summarized_story": "Justice Odili’s family residence at lmo Rivers Street in Maitama, Abuja, was raided by fully armed plain-clothes security men last Friday.\nThe Identity Card of the police officer who led the assault on the residence of Justice Odili was signed by the AGF.\nSaharaReporters learnt that the name on the ID Card is Ajodo F. L. of the Police And Assets Recovery unit.\nArmed operatives had stormed Odili’s residence bearing a warrant that was issued based on information from a whistle-blower, Aliyu Umar, an Abuja-based resident.\nAnother source said, “Regarding the raid on Odili's House, it was planned because they don’t want her to become the next CJN."
  },
  {
    "headline": "ID Card Of Policeman Who Led Raid On Justice Odili's Residence Was Signed By Buhari’s Minister, Malami",
    "summarized_story": "Justice Odili’s family residence at lmo Rivers Street in Maitama, Abuja, was raided by fully armed plain-clothes security men last Friday.\nThe Identity Card of the police officer who led the assault on the residence of Justice Odili was signed by the AGF.\nSaharaReporters learnt that the name on the ID Card is Ajodo F. L. of the Police And Assets Recovery unit.\nArmed operatives had stormed Odili’s residence bearing a warrant that was issued based on information from a whistle-blower, Aliyu Umar, an Abuja-based resident.\nAnother source said, “Regarding the raid on Odili's House, it was planned because they don’t want her to become the next CJN."
  },
  {
    "headline": "How Buhari, Transport Minister, Amaechi Illegally Hand-picked Medical Firm For Multi-billion Naira Maritime Contract— Report",
    "summarized_story": "An investigation by Premium Times has revealed how President Muhammadu Buhari and the Minister of Transportation, Rotimi Amaechi illegally approved a huge national security-sensitive maritime contract to a medical company.\nThe procurement agency had said the contract was awarded in clear breach of the Public Procurement Act 2007.\nA similar position was communicated to the transport ministry but the BPP said nevertheless it could not stop the contract given the president’s approval.\nThe BPP said the transport ministry did not provide the basis for picking MedTech and Rozi International to partner for the project.\nIt is not certain if both Buhari and Amaechi obtained any security clearance before approving the contract to MedTech and its partner Rozi International."
  },
  {
    "headline": "How Buhari, Transport Minister, Amaechi Illegally Hand-picked Medical Firm For Multi-billion Naira Maritime Contract— Report",
    "summarized_story": "An investigation by Premium Times has revealed how President Muhammadu Buhari and the Minister of Transportation, Rotimi Amaechi illegally approved a huge national security-sensitive maritime contract to a medical company.\nThe procurement agency had said the contract was awarded in clear breach of the Public Procurement Act 2007.\nA similar position was communicated to the transport ministry but the BPP said nevertheless it could not stop the contract given the president’s approval.\nThe BPP said the transport ministry did not provide the basis for picking MedTech and Rozi International to partner for the project.\nIt is not certain if both Buhari and Amaechi obtained any security clearance before approving the contract to MedTech and its partner Rozi International."
  },
  {
    "headline": "Only new projects, 80% Nigerian staff... CBN unveils '100 for 100' policy criteria",
    "summarized_story": "The Central Bank of Nigeria (CBN) has unveiled selection criteria for private sector companies to participate in its new financial instrument tagged, ‘The 100 for 100 PPP — Policy on Production and Productivity’.\nUnder the new policy, Godwin Emefiele, CBN governor, had said the apex bank would advertise, screen, scrutinise and financially support 100 targeted private sector companies in 100 days, beginning from 01 November 2021.\nAccording to the CBN, the move was to ensure the operational framework for a robust and transparent process for identifying and selecting high-impact companies and projects under its 100 for 100 PPP.\nAdvertisementThe 100 for 100 PPP, according to the CBN, shall provide naira intervention funding under existing CBN intervention processes and complete foreign exchange funding for new machinery.\nIt noted that a highly satisfactory project should meet stipulated requirements by 81 to 100 per cent; a satisfactory project meets stipulated requirements by 61 to 80 per cent; a less satisfactory project meets stipulated requirements by 51 to 60 per cent while an unsatisfactory project meets stipulated requirements by zero to 50 percent."
  },
  {
    "headline": "Only new projects, 80% Nigerian staff... CBN unveils '100 for 100' policy criteria",
    "summarized_story": "The Central Bank of Nigeria (CBN) has unveiled selection criteria for private sector companies to participate in its new financial instrument tagged, ‘The 100 for 100 PPP — Policy on Production and Productivity’.\nUnder the new policy, Godwin Emefiele, CBN governor, had said the apex bank would advertise, screen, scrutinise and financially support 100 targeted private sector companies in 100 days, beginning from 01 November 2021.\nAccording to the CBN, the move was to ensure the operational framework for a robust and transparent process for identifying and selecting high-impact companies and projects under its 100 for 100 PPP.\nAdvertisementThe 100 for 100 PPP, according to the CBN, shall provide naira intervention funding under existing CBN intervention processes and complete foreign exchange funding for new machinery.\nIt noted that a highly satisfactory project should meet stipulated requirements by 81 to 100 per cent; a satisfactory project meets stipulated requirements by 61 to 80 per cent; a less satisfactory project meets stipulated requirements by 51 to 60 per cent while an unsatisfactory project meets stipulated requirements by zero to 50 percent."
  },
  {
    "headline": "Osita Chidoka: Governors can't control PDP -- their job is to manage crisis",
    "summarized_story": "Osita Chidoka, a Peoples Democratic Party (PDP) chieftain, says governors have no control over the affairs of the party.\nAdvertisementHe said governors can only help in the management of crisis and resolving issues in the party.\nAdvertisementSpeaking on the role the governors played in calming the storm, Chidoka said there is no better group to salvage the party from the crisis than the governors.\nThe burden of managing the controversy that normally comes with human interaction, of managing the tension in the party falls on the PDP governors,” he said.\nAdvertisement“So, as much as the governors are critical in managing the tension in PDP, the national working committee now represents all shades of opinions in the PDP."
  },
  {
    "headline": "Osita Chidoka: Governors can't control PDP -- their job is to manage crisis",
    "summarized_story": "Osita Chidoka, a Peoples Democratic Party (PDP) chieftain, says governors have no control over the affairs of the party.\nAdvertisementHe said governors can only help in the management of crisis and resolving issues in the party.\nAdvertisementSpeaking on the role the governors played in calming the storm, Chidoka said there is no better group to salvage the party from the crisis than the governors.\nThe burden of managing the controversy that normally comes with human interaction, of managing the tension in the party falls on the PDP governors,” he said.\nAdvertisement“So, as much as the governors are critical in managing the tension in PDP, the national working committee now represents all shades of opinions in the PDP."
  },
  {
    "headline": "South-east clerics, traditional rulers ask FG to unban IPOB",
    "summarized_story": "The South-East Council of Traditional Rulers and some Christian leaders have called on the federal government to reverse the proscription of the Indigenous People of Biafra (IPOB).\nAdvertisementHis arrest and detention have sparked unrest in the region with members of IPOB enforcing sit-at-home orders in the region in solidarity with Kanu.\nAdvertisement“Accordingly, we refer to our earlier request for the release of Mazi Nnamdi Kanu to the South-East Council of Traditional Rulers and the Representatives of Igbo Archbishops and Bishops and restate this call even more strongly.\n“We are of the firm belief that this act of courage and statesmanship is not only imperative but will speedily de-escalate the heightened state of insecurity and dislocation in the South-East zone.\nThe south-east leaders alleged that the militarisation of the zone had resulted in clashes and “bloodletting” between the youths and security agents."
  },
  {
    "headline": "Facebook changes company name to Meta, reflecting its ambitions beyond social media",
    "summarized_story": "Facebook on Thursday, October 28 announced that it has changed its company name to Meta.\nThis change of name was announced by Facebook CEO Mark Zuckerberg at Facebook’s annual Connect augmented and virtual reality conference.\nThe company said it chose the name “Meta” to serve as a reminder that there is always more to build.\nFacebook said its corporate structure is not changing, however, how the company reports its financials will.\nIn addition, Facebook assured users that the announcement does not affect how the company uses or shares data."
  },
  {
    "headline": "Beyond investing in African startups, Kepple Africa Ventures is creating new industries",
    "summarized_story": "Afterwards, he returned to Africa as a general partner at Kepple Africa Ventures.\nI knew I had to be a part of it.”Daniel Adeyemi: How did Kepple Africa Ventures start?\nThis provided Kepple with access to a network of investors to raise $18 million for Kepple Africa Ventures.\nRyosuke Yamawaki handles investing in East and Southern African startups while I focus on investing in West and North African startups.\nDA: Talking about Japanese investors, are there any other Japanese investors in Africa?"
  },
  {
    "headline": "eNaira: How to use Nigeria’s central bank digital currency",
    "summarized_story": "Nigeria became the first country in Africa to launch a central bank digital currency (CBDC) this week after President Muhammadu Buhari unveiled the eNaira at the State House in Abuja, the nation’s capital.\nIssued by the Central Bank of Nigeria (CBN), the digital currency is built on a private blockchain technology developed by Bitt Inc and has the same value as the fiat or physical currency.\nThe new currency can be accessed and used via the eNaira wallet (named “Speed”), a digital storage held and managed on a distributed ledger.\neNaira use casesFinancial institutions are responsible for onboarding their customers and integrating the eNaira wallet feature into their digital banking channels.\nThe digital currency could also bring a significant majority of Nigerians without bank accounts into the formal financial economy."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "NIN-SIM linkage extension, School abductions in Nigeria, Airtel Africa’s H1 results",
    "summarized_story": "A smattering of progress: In July 2021, the NCC said there were 59.8 million unique NIN enrolments.\nSince then, at least 1,800 school children have been abducted.\nAccording to Intelligence by Techpoint, with 11 abductions this year, more school children were kidnapped in 2021 than in previous years.\nData comes in a close second with $733 million, in comparison to $548 million in the same period last year.\nFlowing from our earlier discussion on the number of kidnapped children, the graph above shows the reported number of abducted school children in Nigeria by state since 2014."
  },
  {
    "headline": "Bolt’s EV option, aYo Holdings’ new business model, Facebook’s new name, Namibia’s crime-busting plans",
    "summarized_story": "The company plans to drive greater scale, better customer experience, and faster access to markets across the African continent in the coming years.\n50 countries in Africa have introduced mandatory SIM card registration laws.\nUa-Ndjarakana said that the SIM card registration process would be done to protect consumers’ privacy.\nDo you think SIM card registration combats crime or increases surveillance in Africa?\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "Early Access: Interview with ReelFruit founder, Affiong Williams",
    "summarized_story": "But then, it took her five years to build her first factory, and nine years in total to the Series A.Affiong Williams, founder and CEO, ReelFruit.\nThese and many more I sought to find out during a recent interview with Affiong Williams at the ReelFruit HQ in Lagos, Nigeria.\nIn this inspiring interview, Affiong Williams shares her motivations, inspirations, ambitions, entrepreneurial lessons, and tips on how to achieve a work-life balance while running a global company.\nWatch full interview or continue below for summarised text versionThe full interview will go live on Tuesday November 2, 2021 at noon.\nWatch it today on Early Access by joining our membership programme Join now Already a member?"
  },
  {
    "headline": "Frustration grows as lack of jobs rack Nigerians",
    "summarized_story": "Nigeria’s unemployment crisis, the worst since the country’s transition to democracy in 1999, is unrelenting and waging a continuous war on the people.\nA family in which all members lose their jobs lives the reality of hunger, lack of housing, illness and poor or no education.\nWhat must be doneProviding enough productive jobs for Nigeria’s young and growing population presents a particular challenge, especially at a time of weak economic growth.\nThis means that the labour market is “the primary vehicle through which the proceeds of economic growth are spread to households and individuals.\nEconomic growth without transformation is much less effective."
  },
  {
    "headline": "Frustration grows as lack of jobs rack Nigerians",
    "summarized_story": "Nigeria’s unemployment crisis, the worst since the country’s transition to democracy in 1999, is unrelenting and waging a continuous war on the people.\nA family in which all members lose their jobs lives the reality of hunger, lack of housing, illness and poor or no education.\nWhat must be doneProviding enough productive jobs for Nigeria’s young and growing population presents a particular challenge, especially at a time of weak economic growth.\nThis means that the labour market is “the primary vehicle through which the proceeds of economic growth are spread to households and individuals.\nEconomic growth without transformation is much less effective."
  },
  {
    "headline": "Nigeria PMI back below water as FX, insecurity dampens manufacturers’ outlook",
    "summarized_story": "The index which declined from 50.3 to 49.6 points was mirrored across three of the five sub-indices, according to the data.\nCurrently, it costs N411 to get one dollar from the Central Bank of Nigeria (CBN), while it costs around N580 in the parallel market.\n“The FMCGs were confronted with high operating costs during this period following the persistent inflationary pressure and FX illiquidity.\nThe PMI index had hit 51 points in May but dropped continuously till it hit 48 points in July.\nIt showed signs of strained recovery as it ended the third quarter with 49.6 and 50.3 points in August and September respectively."
  },
  {
    "headline": "World Stroke Day: Obaseki urges residents to take advantage of health insurance to check menace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has urged residents in the state to take advantage of the state government’s Health Insurance Scheme to prevent the risks of stroke.\nThe governor said this in commemoration of the World Stroke Day marked by the World Stroke Foundation.\nThe governor added, “It is important for stakeholders to sustain enlightenment campaigns that encourage people to adopt health behaviours that limit the risk of stroke.\nAccording to the World Stroke Foundation, “When somebody has a stroke, every second that goes by is crucial.\nAs brain tissue and millions of neurons begin to fade away, time could not be more precious.”..."
  },
  {
    "headline": "PUWOV arrests illegal revenue collector, as govt warns against street trading – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOfficials of the Edo State Public Works Volunteers (PUWOV) have arrested an alleged illegal revenue collector extorting motorists along Oba Market Road, in Benin City.\nIn a statement, the State Commander, PUWOV, Mukhtar Yusuf-Osagie, said after receiving several complaints of the unlawful acts in the recent weeks, PUWOV officials were deployed to effect the arrest.\nAccording to him, “we received a distress call from a concerned Edo citizen, which led to the discovery and arrest of one Oghomen Osagie, an illegal revenue collector, who specialised in extorting motorists.”He urged members of the public to report any individual or group suspected in such illegal acts, noting, “We are urging members of the public to report any suspicious act of criminality.”On the incidence of street trading, he said, “As part of measure to curtail unnecessary gridlock usually caused by traders displaying wares on the road and walkways, our officials were at Egor Market and environs to sensitize traders and motorists to desist from all unlawful act of street trading and reckless parking as the traders took to trading on the road.\n“The traders were given a 7-day notice to evacuate all tables and makeshift shops from the road and walkway as the State Government has directed the Clean Up of the area, referencing a petition from the Nigerian Postal Institute, at Egor.\n“Officials of PUWOV have restored sanity to Egor Market and environs as all makeshift shops and tables have been evacuated from the road and moved inside the main market.”He added, “Motorists and other road users can now get free access to their destination via Egor Market without any form of harassment from street traders.”..."
  },
  {
    "headline": "Edo restores 218 hectares of forest land to boost green economy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn furtherance of efforts to boost the state’s green economy, Edo State Governor, Mr. Godwin Obaseki, has said his administration has restored 218 hectares of forest land across the state.\nAddressing participants at the Wood Expo 2021, in Abuja, the governor said part of the state’s strategy on reforestation include replanting of the degraded forest compartments of 256 hectares each in four zones across the state.\nThis shows our readiness for investments in this sector.\n“We urge manufacturers, investors and other interest groups to come to Edo State and tap from the numerous investment opportunities that abound.\nShe added that the Benin River Port project will help in decongesting the Apapa Port in Lagos, noting that the strategic location of Edo State as a gateway to all states in the six geo-political zones in Nigeria, is advantageous."
  },
  {
    "headline": "UNSCR 1325: Edo State Commences Development of Action Plan for the Inclusion of Women in Peacebuilding – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City: In a bid to getting women involve in peacebuilding and security issues in Edo State, a 3- day workshop geared towards the development of the state action plan has been held in Benin.\nParticipants at the workshop are members of the Technical Steering Committee on United Nations Security Council Resolution (UNSCR) 1325.\nSpeaking, WANEP’s Head of Programs- Patience Ikpeh Obaulo, said the objectives of the workshop were to develop Edo State Action Plan in line with UNSCR 1325 and the Nigeria Action Plan (NAP), and to ascertain the cost of the state action plan and promote systematic coordination and accountability in implementation of the state action plan.\nAs part of the program the draft SAP on UNSCR 1325 was develop by members of the Technical Steering Committee.\nAs part of the program the draft SAP on UNSCR 1325 was develop by members of the Technical Steering Committee ."
  },
  {
    "headline": "Zenith Bank posts small rise in nine-month profit as operating expenses hurt earnings",
    "summarized_story": "Zenith Bank’s gross earnings rose by just 1.9 per cent at N518.7 billion as the lender’s interest and similar income slid.\n“Most banks have also struggled to grow their interest income this year,” Damilola Olupona, analyst at investment bank Chapel Hill Denham, told Arise TV in September.\n“That is also coming on the flattish loan growth, coming from a year when most banks have to grapple with Covid-19.\nAn expansion of nearly one-third in net fee and commission income to N78.3 billion helped cushion the blow of interest decline on earnings.\nPre-tax profit inched up 1.4 per cent to N177.3 billion while profit-after-tax stood at N160.6billion compared to the N159.3 billion of last year."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Globacom gains 1m internet subscribers as MTN loses 1.18 million users in Q3 2021",
    "summarized_story": "MTN, on the other hand, lost about 1.2 million subscribers in the review quarter, as its data customer base dropped to 58.4 million from 59.6 million as of the end of June 2021.\nOverall, the total number of data subscribers increased by 107,766 customers in Q3 2021.\nWhile MTN lost the highest customers, followed by 9mobile, Airtel gained 470,906 customers in the period under review while Globacom gained 1.03 million customers.\n9mobile data subscribers dropped by 206,768 in Q3 2021.\nIn the same vein, 918 users ported out of Airtel, while 881 and 863 subscribers ported out of Globacom and MTN respectively."
  },
  {
    "headline": "Anambra 2021: Anarchy looms ahead of governorship polls",
    "summarized_story": "“Troops made contact with the fleeing gunmen and engaged them in a fire fight, neutralising four of the criminals.\nSadly, a personnel of one of the security agencies paid the supreme price.\n“The Nigerian Army notes that the recent attacks are part of proscribed IPOB/ESN plan to instil fear into the public and sabotage forthcoming Anambra State Governorship Election.\nMembers of the public are reassured that the Nigerian Army, sister services and other security agencies will not relent in resolutely confronting all criminals intents against the citizenry and national interest.\nThey are also encouraged to report any unusual activity observed across Anambra State to the nearest security post.”It’s an unfolding mayhem."
  },
  {
    "headline": "Equities market surges despite ravaging poverty",
    "summarized_story": "Despite the odds, the equities market has remained impressive.\nBut despite the fact that very unfortunately, the Nigerian economy has remained weak and is indeed faced with a drought scenario, the equities market is proving to be an outlier.\nWhile the per capita income stood at $2,073.783 and over 100million survive on $1.9 a day, the equities market remains stable and more of the times bullish than bearish.\nThere is also a consensus that the Nigerian market is always attractive given that stock prices are cheap compared with stocks in the developed economies.\nThe Group has three operating subsidiaries, namely: Nigerian Exchange Limited (NGX Limited), the operating exchange; NGX Regulation Limited (NGX REGCO), the independent regulation company; and NGX Real Estate Limited (NGX RELCO), the real estate company."
  },
  {
    "headline": "CBN targets graduate entrepreneurs in fresh job creation drive",
    "summarized_story": "Unemployment rate in the country has more than quadrupled since 2016 when the economy slipped into a recession.\nIt further noted that priority would be given to innovative entrepreneurial activities with high potentials for export, job creation and transformational impact.\nAnother component of the intervention is the developmental component which shall be disbursed in the form of grants to Nigerian polytechnics and universities in a national biennial entrepreneurship competition.\nThe apex bank said it would award N500 million worth of grants to five top Nigerian polytechnics and universities with the best entrepreneurial pitches/ideas.\nOnly undergraduates of Nigerian polytechnics and universities are eligible to participate under the developmental component."
  },
  {
    "headline": "Military Airstrike Kills 37 ISWAP Terrorists, Destroys Guntrucks",
    "summarized_story": "The Air Component of Operation Hadin Kai in the North-East region has neutralised over 37 Islamic State West Africa Province (ISWAP) fighters in the Sambisa Forest.\nHe said the trucks later moved to a remote location, where they were joined by other terrorist elements at a convergence for a meeting.\n“Having clearly identified the terrorists’ hideout, the Air Component of OPHK immediately dispatched two aircrafts to conduct air interdiction on the location,” he said.\n“The air crew immediately relayed the coordinates of the location of the Gun Trucks to troops of the Land Component at Bama, who promptly engaged the location with artillery fire bombardment, neutralising the insurgents’ gun trucks,” he added.\nGeneral Nwachukwu noted that the successful joint operations conducted by both the Air and Land components underscores the importance of synergy and cooperation in the fight against terrorism and insurgency."
  },
  {
    "headline": "Military Airstrike Kills 37 ISWAP Terrorists, Destroys Guntrucks",
    "summarized_story": "The Air Component of Operation Hadin Kai in the North-East region has neutralised over 37 Islamic State West Africa Province (ISWAP) fighters in the Sambisa Forest.\nHe said the trucks later moved to a remote location, where they were joined by other terrorist elements at a convergence for a meeting.\n“Having clearly identified the terrorists’ hideout, the Air Component of OPHK immediately dispatched two aircrafts to conduct air interdiction on the location,” he said.\n“The air crew immediately relayed the coordinates of the location of the Gun Trucks to troops of the Land Component at Bama, who promptly engaged the location with artillery fire bombardment, neutralising the insurgents’ gun trucks,” he added.\nGeneral Nwachukwu noted that the successful joint operations conducted by both the Air and Land components underscores the importance of synergy and cooperation in the fight against terrorism and insurgency."
  },
  {
    "headline": "Justice Odili’s House Invasion, A New Low – SESSPN",
    "summarized_story": "The South-East South-South Professionals of Nigeria (SESSPN), has reacted to the breach of the residence of the second most senior Supreme Court Justice of the Nigeria, Justice Mary Odili, on October 29, 2021, describing it as a new low of deliberate rascality, too sordid for rational comprehension.\nFor a nation that wakes up to daily servings of state impunity, they said this was another grave sacrilege beyond ineptitude, and one hoped it won’t be our lot again after a 2016 similar castration of the Supreme Court Justices.\n“We are even more shocked at the convenient rapid denials from agencies of state on whose behest, the actors are beholden, and who acted to inflict this egregious violence on Justice Mary Odili.\nADVERTISEMENT“As we await the promised investigation by the Attorney General, we caution that it should be quick, honest and impartial to expose everyone complicit for a date with judgement.\n“And lastly, we warn that this aggravated rehash must not be a harbinger of dreadful outcome to the life and security of service of Justice Mary Odili,” he stated."
  },
  {
    "headline": "Justice Odili’s House Invasion, A New Low – SESSPN",
    "summarized_story": "The South-East South-South Professionals of Nigeria (SESSPN), has reacted to the breach of the residence of the second most senior Supreme Court Justice of the Nigeria, Justice Mary Odili, on October 29, 2021, describing it as a new low of deliberate rascality, too sordid for rational comprehension.\nFor a nation that wakes up to daily servings of state impunity, they said this was another grave sacrilege beyond ineptitude, and one hoped it won’t be our lot again after a 2016 similar castration of the Supreme Court Justices.\n“We are even more shocked at the convenient rapid denials from agencies of state on whose behest, the actors are beholden, and who acted to inflict this egregious violence on Justice Mary Odili.\nADVERTISEMENT“As we await the promised investigation by the Attorney General, we caution that it should be quick, honest and impartial to expose everyone complicit for a date with judgement.\n“And lastly, we warn that this aggravated rehash must not be a harbinger of dreadful outcome to the life and security of service of Justice Mary Odili,” he stated."
  },
  {
    "headline": "16 Lawmakers Impeached Plateau Speaker Over Incompetence, Misappropriation – Majority Leader",
    "summarized_story": "The majority leader, Plateau State House of Assembly, Hon Naanlong Gapyil, has said that the embattled Speaker of the Assembly, Hon.\nNuhu Ayuba Abok, was impeached by 16 members of the House for financial misappropriation and gross incompetence.\nNow, if you have watched the video containing house proceedings, you would find out that apart from the minority leader and Hon.\nIn all, 14 APC and 2 PDP members voted and impeached the former Speaker and the record is available.\nThis is because we have the mandate of the people of Plateau State to represent them well."
  },
  {
    "headline": "Vendors fail to embrace eNaira as downloads stall at 220,000",
    "summarized_story": "The PUNCH observed that within 48 hours after the app was launched on the App Store and Google Play, the number of downloads of the eNaira Speed Wallet and the eNaira Merchant Wallet was about 180,000 combined.\nHowever, following a barrage of negative reviews, the eNaira Speed Wallet, which is meant for consumers, was taken down for about a day, upgraded and then restored.\nSince the app was returned on Google PlayStore and the App Store, downloads have not risen significantly.\nFor the Apple devices, the number of downloads for the merchant wallet and speed wallet stood at 70, 150 downloads on Ipad and Iphone devices.\nAlso, checks by The PUNCH on Sunday showed that many vendors had failed to embrace eNaira transactions despite the fact that banks had set up platforms for such transactions."
  },
  {
    "headline": "Vendors fail to embrace eNaira as downloads stall at 220,000",
    "summarized_story": "The PUNCH observed that within 48 hours after the app was launched on the App Store and Google Play, the number of downloads of the eNaira Speed Wallet and the eNaira Merchant Wallet was about 180,000 combined.\nHowever, following a barrage of negative reviews, the eNaira Speed Wallet, which is meant for consumers, was taken down for about a day, upgraded and then restored.\nSince the app was returned on Google PlayStore and the App Store, downloads have not risen significantly.\nFor the Apple devices, the number of downloads for the merchant wallet and speed wallet stood at 70, 150 downloads on Ipad and Iphone devices.\nAlso, checks by The PUNCH on Sunday showed that many vendors had failed to embrace eNaira transactions despite the fact that banks had set up platforms for such transactions."
  },
  {
    "headline": "Again, bandits attack Baptist Church in Kaduna, kill two, scores abducted",
    "summarized_story": "Some gunmen on Sunday invaded the Baptist Church, Kakau Daji in Chikun Local Government Area of Kaduna State, killing two while scores were said to have been abducted.\nThe President of the Kaduna Baptist Convention, Rev.\nIshaya Jangado, confirmed the incident but noted that the exact number of those abducted had yet to be ascertained as of the time of filing this report.\n“The incident occurred this morning but we don’t know the exact number of people that were kidnapped yet,” he said.\nNo official confirmation came too from either the state government or the police as the Kaduna State Police Command’s spokesman, ASP Mohammad Jalige, could not be reached when contacted as his mobile telephone was not connecting."
  },
  {
    "headline": "Again, bandits attack Baptist Church in Kaduna, kill two, scores abducted",
    "summarized_story": "Some gunmen on Sunday invaded the Baptist Church, Kakau Daji in Chikun Local Government Area of Kaduna State, killing two while scores were said to have been abducted.\nThe President of the Kaduna Baptist Convention, Rev.\nIshaya Jangado, confirmed the incident but noted that the exact number of those abducted had yet to be ascertained as of the time of filing this report.\n“The incident occurred this morning but we don’t know the exact number of people that were kidnapped yet,” he said.\nNo official confirmation came too from either the state government or the police as the Kaduna State Police Command’s spokesman, ASP Mohammad Jalige, could not be reached when contacted as his mobile telephone was not connecting."
  },
  {
    "headline": "8 prophets drown in competition to be the baptist",
    "summarized_story": "Eight “prophets” belonging to an apostolic faith sect drowned on Saturday during a baptism ceremony in a river in Rushinga, Mashonaland Central Province in Zimbabwe.\nThe Herald newspaper said the “prophets” died while competing to retrieve a “holy stick” in the deep waters of Mazowe River during a ritual to select a baptist.\nThe prophets stood at the front and we started singing church songs.\n“The prophets fell into a trance and started jumping into the water and they drowned.”It was not the first time the prophets took part in the ritual.\nThe paper said the provincial development coordinator for Mashonaland Central Province, Timothy Maregere, had confirmed the incident."
  },
  {
    "headline": "Nigerian men of God must wake up from sleep: CAN",
    "summarized_story": "By Uchenna Ugwu/NANThe Christian Association of Nigeria (CAN), South-East Zone, has urged religious heads to wake up from sleep and educate politicians and Nigerians to embrace tranquility.\nAbraham Nwali, the zonal Chairman, gave the advice on Sunday during a Thanksgiving ceremony in honor of the chairman at St Paul Parish Onuebonyi in Abakaliki.\n“Men of God must wake up from sleep and advise politicians and other Nigerians on the need to embrace peace.\n“This is the hour we all must go back to God for forgiveness because we cannot do much without him,” he said.\nThe Clergyman urged the Christian faithful to adopt humanitarian services and services for God, saying “this is the secret to success.”"
  },
  {
    "headline": "Nigeria records another sub-100 COVID-19 cases",
    "summarized_story": "By Abujah RachealNigeria recorded a successive under 100 Covid-19 cases on Sunday, the NCDC said in its latest update.\nOn Saturday, Nigeria recorded 89 cases.\nThe cases further slumped to 74 on Sunday, jacking cumulative cases to 211,961.\nBenue reported the highest number of new infections with 49 cases, followed by Enugu and Osun states with six cases each.\nKano State reported five new infections; Oyo reported four infections; FCT had two infections, while Bayelsa and Ogun States had one each."
  },
  {
    "headline": "It's fake news, bandits not relocating to Kano",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC), Kano State Command, has dismissed a statement circulating in the social media that bandits from Zamfara and Katsina States were relocating to Kano state.\nThe report indicated that the bandits, escaping from the onslaught of security forces, were believed to have infiltrated Kano state through some communities in Shanono, Gwarzo and Kabo local government areas of the state.\nThey went through Zarewa village in Kano State, along Beli road to Babbarika, to a settlement belonging to one Alhaji Shehu Danfulani to attend a wedding and naming ceremony at the settlement.\nIdris-Abdullahi noted that the Village Head of Zarewa and Shehu Danfulani have all been interviewed by security agents and they confirmed the situation.\n“From our investigation so far, no bandits have relocated to Gwarzo, Kabo and Shanono local government areas, as well as Dansoshiya forest."
  },
  {
    "headline": "As A True Believer Of Christ I Won’t Ridicule Those In Power — Pastor Kumuyi Defends Silence On Buhari Regime’s Failure",
    "summarized_story": "Pastor Williams Kumuyi, the General Superintendent of the Deeper Christian Life Ministry, has warned Nigerians not to criticize individuals in positions of authority.\nNeedless to say, God recognizes the dual nature He has clothed us with, physical body and soul.\nThe inner soul requires the Word, while the external body needs material fulfillments through food, shelter, healing, job, joy, justice etc.\n“He expects the state to cater for the body while He saddles the Church with providing for the inner being.\n“We have verifiable testimonies all over the planet underscoring the incredible power of the God of the Bible times being here with man again."
  },
  {
    "headline": "Worshippers Abducted, Two Killed As Bandits Attack Kaduna Baptist church",
    "summarized_story": "Two worshippers at Baptist Church, Kakau Daji, Chikun LGA of Kaduna state have been killed after bandits attacked the church during their Sunday service on October 31.\nThe bandits surrounded the church before they started shooting sporadically.\nIshaya Jangado, the president of the Kaduna Baptist Convention, who confirmed the attack to TheCable, said an unspecified number of its worshippers were also abducted during the attack.\nI condole the families of the Baptist denomination and Kaduna Christians for this loss and urge our security agencies to separate war against enemies of Nigerians from politics.\nNo one knows who will be the next target.” he saidChikun LGA is one of the areas where telecommunications services had been suspended by the Kaduna state government to fight banditry and kidnappings."
  },
  {
    "headline": "Igbo Monarchs, Clerics Ask Buhari To Release Nnamdi Kanu For Peace To Reign In South-East",
    "summarized_story": "They also called on IPOB to cancel all scheduled sit-at-home orders and shun any action that would disrupt the November 6 Governorship Election in Anambra State.\n“It has become urgent, imperative and compelling to deemphasize the military option and move towards finding a political solution that will lead to sustainable peace.\n“We assert that heightened inequality and marginalization remain at the core of youth restiveness in our region.\nWe shall respectfully seek audience with Mr President to discuss these issues in exploring political solution and the release of Mazi Nnamdi Kanu.\n“On our part, we assure our youths that we have heard their cries of marginalization, injustice and longsuffering."
  },
  {
    "headline": "Six Months After Afenifere Spokesman Odumakin’s Death, Wife Gives Birth To Twins",
    "summarized_story": "Almost seven months after Yinka Odumakin’s death, his wife, Dr Joe Okei-Odumakin, gave birth to twins — a boy and a girl – in a hospital in the United States of America on Wednesday.\nHer late husband had left the names he intended for the babies, according to Okei-statement.\nOdumakin’sThe statement read in part, “He had, however, prophetically left words concerning what the baby or babies should be called if his wishes materialised.\nThe girl was named after Joe, while the boy was named Abraham after the late Afenifere leader, Pa Abraham Adesanya.\nHowever, the twins are coming 18 years after the birth of their last child."
  },
  {
    "headline": "PDP National Chairman-elect Ayu: Our party’s successful convention, quit notice to APC",
    "summarized_story": "National Chairman-Elect of the Peoples Democratic Party (PDP) Dr Iyorchia Ayu has thrown a challenge to the All Progressives Congress (APC).\nAyu stated this in the early hours of Sunday after he was declared winner at the party’s Special National Convention held at the Eagle Square, Abuja.\nHe said: “Indeed, the PDP, through the National Convention, has, once again, demonstrated its firm believe in participatory democracy.\nHis contesting for the same post lends more credibility to the PDP National Convention.\n“Take the power sector for instance where the contract agreement between Federal Government and DisCos and GenCos are in favour of the private companies."
  },
  {
    "headline": "Troops foil 100-man bandit attack on Niger community",
    "summarized_story": "Troops over the weekend foiled a coordinated attack by bandits on Pandogari town in Rafi local government area of Niger state.\nBlueprint learnt that not less than 100 heavily armed men riding on motorcycles stormed the town from Zamfara state with the intention of killing and kidnapping members of the community, in addition to rustling their cattle.\nWitness accounts said the bandits first launched attack on the military base in Pandogari town but met stiff opposition from soldiers who engaged them in fierce battle.\nIt was gathered that the action of the soldiers stopped the gunmen from gaining access into Pandogari town where they would have wrecked havoc.\nHe simply said: “What the security men did was to repel the attack.”"
  },
  {
    "headline": "Boosting SMEs growth through FirstSME Account",
    "summarized_story": "First Bank of Nigeria Limited, the nation’s most valuable bank brand, has over the years shown commitment towards the success and growth of SMEs business in Nigeria.\nFirstSME AccountThe First Bank’s leading SME Initiative-FirstSME account- was specifically created on August 2020, to support SMEs towards the sustenance and expansion of their businesses.\nApart from supporting SMEs, FirstSME account is also available to all non-individual entities like Limited liability Companies, Public sector institutions, Enterprises/Sole proprietorships, Partnerships & Associations, Religious Bodies, Traders NGOs.\nBenefits to customersFirstSME account has been beneficial to a lot of companies, especially SMEs, in terms enhancing the capacity to sustain growth.\nImpacts beneficiaries/economyThe First Bank FirstSME account will go a long way to reducing cost of operating corporate account which frees up funds for the beneficiaries to grow their businesses faster."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Children in 11 Borno IDP camps benefit from Cash4Wash Initiative- UNICEF -NigPilot",
    "summarized_story": "Nigerian Pilot reported that launched with support from the UK Government’s Foreign Commonwealth and Development Office (FCDO), the Cash4Wash initiative is the first of its kind implemented by UNICEF in Nigeria.\nThe learnings and experience from the initiative will be used to scale up cash transfers for WASH services to improve access to sanitation and hygiene facilities in humanitarian settings.\nThe five-month pilot project is being implemented by UNICEF through local partner Centre for Integrated Development and Research (CIDAR).\n“Cash-based interventions help to restore communities’ self-sufficiency, dignity and determination, particularly during crisis situations.\nCrucially, it will also improve living conditions for children, the most vulnerable in crisis situations,” said Phuong T. Nguyen, UNICEF’s Chief of Field Office in Maiduguri."
  },
  {
    "headline": "TETFund’s Research Grants to hit N10bn by 2022- Bogoro -NigPilot",
    "summarized_story": "Tertiary Education Trust Fund, TETFund , has expressed hope that the annual allocation to the National Research Fund, NRF, will hit N10 billion in 2022.\nBogoro stated this at a virtual meeting on ‘Democratization of Higher Education in Nigeria through Open Access,’ co-hosted by TETFund and the Training Centre in Communication, Nairobi, as part of activities to mark International Open Access Week.\nThey are two categories; institution based and National Research Fund.\nAlso speaking at the webinar, the Technical Adviser to the TETFund’s Executive Secretary, Dr Popoola Mustapha Ayodele, harped on the decolonisation of education research and technology in Africa.\nMr Daryl Naylor of Digital Science, who also spoke at the event, assured of the readiness of his organisation to always support open access initiatives in Africa."
  },
  {
    "headline": "The Church and the challenges of a nation -NigPilot",
    "summarized_story": "They must worry more about the environment these worshippers go into when they are discharged from the precincts of the Church.\nNeedless to say, God recognizes the dual nature He has clothed us with, physical body and soul.\nHe expects the state to cater for the body while He saddles the Church with providing for the inner being.\nBut diligently keying into this plan as individuals, nation and Church, gives us the far-reaching blessedness of obedience to His Word.\nThese are just a few of the instances when God has deployed His Church to intervene in the affairs of the nation and its citizens and institutions."
  },
  {
    "headline": "Osibanjo group distributes materials to Ondo, Osun schools -NigPilot",
    "summarized_story": "At Alasagba Community High School, Igbara-Oke, Adedokun Sakirat, a Senior Secondary School (SS3) student, drew the attention of OGO’s National Convener, Mr. Sylvanus Foluso Ojo for her brilliance after answering a question about Vice President Yemi Osinbajo.\nMr. Ojo thereafter surprised the indigent student with the offer to pay her pending school, and West African Examination Council, WAEC, fees, after going home with a N20, 000, donation.\nThe group also visited Ikeji-Arakeji Grammar School, Osun State where a year-two Junior Secondary School (JSS2) student, Adebayo Yesirat also went home with N20, 000, for brilliantly answering a question about the Vice President.\nHe said, “The Vice President has laid exemplary leadership template by being a loyal deputy to President Muhammadu Buhari; a University professor, a Senior Advocate of Nigeria (SAN) as a lawyer; a responsible dad and husband at home.\nWriting materials were distributed to every student in both schools, and the recipients expressed delight on the donations, as many of them claimed not to have enough of those materials prior to the visit."
  },
  {
    "headline": "Troops Kill Over 30 Terrorists During Raid In Borno",
    "summarized_story": "Over 30 terrorists have been killed following a raid by joint troops of Operation Hadin Kai (OPHK) carrying out onslaughts on terrorists’ enclaves in the North East.\nThe spokesman for the Nigerian Army, Brigadier General Onyema Nwachukwu, who disclosed this in a statement on Sunday said the raid was part of intensified operations by the military in the region.\n“In the early hours of Saturday 30 October 2021, the vigilant troops observed the movement of six gun trucks within Sambisa Forest general area, which were subsequently located at a settlement near Yuwe,” General Nwachukwu narrated.\n“The air crew immediately relayed the coordinates of the location of the gun trucks to troops of the Land Component at Bama, who promptly engaged the location with artillery fire bombardment, neutralising the insurgents’ gun trucks,” he said.\nHe asserted that troops of OPHK remained resolute and unshaken in their effort to bring the insurgents to their knees."
  },
  {
    "headline": "Monday Brief: Wike’s Odili Ultimatum, PDP Convention And Channels TV’s Triumph",
    "summarized_story": "We are focusing on the raid on Justice Mary Odili’s residence, PDP’s successful national convention, and Channels Television’s record win at the Nigerian Media Merit Award.\nThe condemnation of the siege – from the Nigerian Bar Association and senior lawyers – has been swift.\nAfter the visit, the President left for Glasgow to attend the biggest climate change event of the year, COP26.\nChannels Television is Nigeria’s best TV stationNigeria’s ‘Home for the News’ was crowned the Best Television Station of the Year for a record 14th time at the Nigerian Media Merit Awards (NMMA) on Saturday.\nThe NMMA award, which recognises media excellence in the country, is another proof of Channels’ leading role in news and broadcasting."
  },
  {
    "headline": "Channels Television Wins TV Station Of The Year For The 14th Time",
    "summarized_story": "﻿Channels Television has won the Nigerian Media Merit Award (NMMA) for Best Television Station of the Year for the 14th time.\nExtending its record in the category, the award-winning station claimed the prize on Sunday morning at an event held in Lokoja, the Kogi State capital.\nChannels Television’s Controller of Programmes, Mr Ambrose Okoh, and some senior staff members received the award on behalf of the organisation.\nThe award for Best TV Station, which recognises media excellence in the country, is one of the numerous recognitions Channels Television has received in Nigeria and globally for its programming, with an audience of over 20 million people within and outside the country.\nPrior to the award bagged on Saturday, Channels Television last won the Best Station of the Year for 2018."
  },
  {
    "headline": "Wike Gives FG 48-Hour Ultimatum To Probe Raid On Justice Odili’s Residence",
    "summarized_story": "﻿Rivers State Governor, Nyesom Wike has issued a 48-hour ultimatum to the Federal Government to probe the invasion of the residence of Justice Mary Odili.\nSecurity agents had on Friday raided the home of the Supreme Court, but Wike asked the current administration to bring to book those behind the invasion.\n“We think that there is an attempt to assassinate Justice Mary Odili, the husband and members of the family, there are no two ways about it.\n“The issue here has nothing to do with the Attorney General, we are happy he said he is not aware.\n“If anything happens to my Lord, Justice Mary Odili, the husband and the children, the Federal Government should be held responsible."
  },
  {
    "headline": "Biden Negative After Spokeswoman Tested Positive For COVID-19",
    "summarized_story": "US President Joe Biden has tested negative for Covid-19 in the wake of his chief spokeswoman testing positive, the White House said Monday.\nThe “president was tested as well, a PCR test yesterday, and he tested negative,” Principal Deputy Press Secretary Karine Jean-Pierre told reporters aboard Air Force One, on the way to the UN climate summit in Glasgow.\nOn Sunday she said that after testing negative all week, she had just had a positive result.\nHowever, she said she had not had “close contact” with Biden or other senior White House staff since her family’s first positive results.\nBiden, 78, has been vaccinated and also received a booster shot."
  },
  {
    "headline": "CFN seeks corporate sponsorship to support growth of Cycling",
    "summarized_story": "President of the Cycling Federation of Nigeria (CFN), Giandomenico Massari, has urged corporations and private individuals to support the growth of cycling at the grassroots level in the country.\nThis was stated by Massari in Abuja over the weekend while speaking about Team Nigeria’s performance at the recently concluded UCI Track Cycling World Championships in France.\nHe expressed confidence that the World Championship experience would enhance the sport’s growth in the country.\nHe also commended the athletes and cycling stakeholders for their outstanding contributions thus far.\n“Getting four of our athletes to qualify for the World Championships alone is a big achievement because we are rated the best in Africa."
  },
  {
    "headline": "FG repositions management of FHA for effective service delivery",
    "summarized_story": "President Muhammadu Buhari has approved the re-organisation of the Federal Housing Authority (FHA) management in order to improve service delivery.\nThis was made known in a press statement issued over the weekend by the Director of Press and Public Relations for the Federal Ministry of Works and Housing, Mr. Boade Akinola.\nAs part of the Authority’s new structure, the following Departments were established: Estates Services, Housing Finance and Accounts, Management Services, Project Implementation, and Research and Innovation Development.\nAbdulmumin Jibril, the Executive Director of Business Development, will now be assigned to the Research and Innovation Development Department, while Mr. Ekpenyong Maurice, the former Executive Director of Housing Finance and Corporate Services, will be assigned to the Management Services Department.\nThe newly appointed Executive Directors include Babakobi Mohammed Hauwa, Estate Services; Adamu Kure, Housing Finance and Accounts; and Chinonso Sam-Omoke, Project Implementation."
  },
  {
    "headline": "Cyber fraud: Court orders interim forfeiture of Invictus Obi's two houses, cars in Abuja",
    "summarized_story": "A Federal High Court in Lagos has ordered the temporary forfeiture of two Abuja houses and two cars associated with convicted cybercriminal Obinwanne George Okeke, also known as Invictus Obi.\nThe properties, according to the EFCC, will be used to compensate foreign victims of Invictus Obi’s fraud via the Consulate of the United States of America.\nHe adjourned till November 30 to make a final decision on the forfeiture application.\nThis application is required in order for the Consulate of the United States of America to compensate the victims of the fraud.\nIn the United States, he is currently serving a ten-year sentence for his role in a $11 million computer-based intrusion fraud scheme."
  },
  {
    "headline": "SERAP sues Buhari, wants recovery of ‘missing N881bn in 367 MDAs’",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari “over his failure to probe allegations that over ₦880bn of public funds are missing from 367 ministries, departments and agencies (MDAs).”The suit followed the grim allegations contained in Part 2 of the 2018 Annual Audited Report by the Office of the Auditor-General of the Federation that ₦880,894,733,084.811 was spent by 367 MDAs without any appropriation.\nSection 15[5] of the 1999 Nigerian Constitution (as amended), requires the Buhari administration to abolish all corrupt practices and abuse of power.\n“Granting the reliefs sought would help to address the adverse consequences of unconstitutional and poor management of public resources on the human rights of poor Nigerians.\n“The alleged missing public funds have hampered the ability of the indicted MDAs to meet the needs of average citizens, as the missing funds could have helped the government to invest in key public goods and services, and to improve access of Nigerians to these goods and services.”Joined in the suit as respondents are the Minister of Justice and Attorney General of the Federation, Abubakar Malami, SAN; and the Minister of Finance, Budget and National Planning, Zainab Ahmed.\nNo date has been fixed for the hearing of the suit."
  }
]