[
  {
    "headline": "Bauchi records 153 Lassa fever cases in one year",
    "summarized_story": "The Bauchi State Primary Healthcare Development Agency, says it has recorded 153 suspected cases of Lassa fever between January and December 2021.\nExecutive Secretary of the Agency, Dr Rilwanu Mohammed, told the News Agency of Nigeria on Sunday in Bauchi that the cases were recorded in five local government areas of the state.\nMohammed listed the affected councils to include Bauchi, Bogoro, Ganjuwa, Kirfi, Tafawa Balewa, and Toro.\nHe said that the state had recorded 21 confirmed cases of the disease while six suspected cases were currently on admission.\nHe urged the people to keep a clean environment, good sanitation, and personal hygiene to protect themselves against the disease."
  },
  {
    "headline": "Why I sometimes act like a boy -Oluwo of Iwo",
    "summarized_story": "Oba Akanbi said his efforts are tailored towards building a distinctively economic vibrant metropolis, urging stakeholders to complement his endeavours at restoring the glory of Iwo.\nOluwo made the disclosure at the annual 2021 Iwo Day celebration held at Oluwo Stadium, Iwo, Osun State.\nHe said, “In 1931, according to census conducted, Iwo was the 5th largest city after Lagos, Ibadan, Kano and Ogbomoso.\nI’ve come to reclaim and restore the glory of the town to compete favourably with Lagos, Kano and other great cities.\nOccasionally, I act like a boy, I don’t mind presenting myself as a party man if such will be to the advantage of the town."
  },
  {
    "headline": "Fresh $5.8bn loan: SERAP seeks FG’S moratorium on borrowing",
    "summarized_story": "By Olasunkanmi AkoniSocio-Economic Rights and Accountability Project, SERAP, has urged President Muhammadu Buhari to issue an immediate moratorium on borrowing by the Federal Government and the 36 states.\nThe foreign debt stock of the Federal Government, 36 states, and Federal Capital Territory reportedly stands at $37.9billion.\n“SERAP notes that governments’ ability to protect human rights is inextricably related to the ability to spend needed resources.\n“This followed previous approvals this year by the National Assembly of $16.2 (16,230,077,718) billion loan; €1 (1,020,000,000) million and a grant component of $125 million loan; $36.8 billion, €910 million loans, and a grant component of $10 million; $8.3 billion and €490 million loans; $6.1 billion, $1.5 billion and 995 million loans; and $4(4,054,476,863), €710 million and grant component of $125 million.\nIf we have not heard from you by then, SERAP shall take all appropriate legal actions to compel your government and the 36 states to comply with our requests.”"
  },
  {
    "headline": "All you need for healthy teeth is the banana peel!",
    "summarized_story": "Who doesn’t want dazzling white teeth without spending a fortune at the dentist?\nThe malic acid won’t actually break down the stain molecules, but the surface clean gives your teeth a whiter appearance.\nBanana Peel: Claim – High levels of potassium, magnesium and manganese in bananas can help remove stains from teeth.\nSimply peel a ripe banana, and rub your teeth with the insides of the peel for about two minutes.\nHowever, I like the idea that you can eat a banana and give your teeth a quick healthy buff before running off to a meeting."
  },
  {
    "headline": "Fresh $5.8bn loan: SERAP writes Buhari, seeks moratorium on borrowing",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has urged President Muhammadu Buhari to “issue an immediate moratorium on borrowing by the Federal Government and the 36 states to address a systemic debt crisis, prevent retrogressive economic measures, and the disproportionately negative impact of unsustainable debt on the poor Nigerians.”The request followed the recent approval by the National Assembly of President Buhari’s request for a $5.8bn loan and grant of $10bn.\nPrevious approvals in 2021 alone include $8.3bn; €490m, and $6.1bn.\nThe foreign debt stock of the Federal Government, 36 states, and Federal Capital Territory reportedly stands at $37.9bn.\nAccording to the Debt Management Office, the foreign debt stock of the Federal Government, 36 state governments and the Federal Capital Territory presently stands at $37.9bn.”“The loans from China alone amount to $3.59bn.\nIf we have not heard from you by then, SERAP shall take all appropriate legal actions to compel your government and the 36 states to comply with our requests.”"
  },
  {
    "headline": "Youth group launches tech platform to help Nigerians track politicians campaign promises",
    "summarized_story": "AdvoKC also also seeks to increase the rate of fulfilment of campaign promises among political office holders, the group said in the statement.\nDuring the launch, the group announced the appointment of Serah Makka-Ugbabe, ONE Campaign Executive Director on Mobilisation as the Chairman of its Advisory Board.\nThe team also announced the appointment of Dayo Ibitoye, Communication and Knowledge Management Specialist at World Bank; Olumide Abimbola, the Executive Director, Africa Policy Research Institute; Ms.\nFaith Nwadishi, Executive Director, CTA, and Dr. Aliyu Nuhu, a doctoral student at LSE into its Advisory Board.\nBeyond the ‘Promise meter’ the group noted that citizens can also access other features like Submit a Promise, Promise Reminder, Factcheck and Climate AdvoKC."
  },
  {
    "headline": "8 dead in Bauchi fatal crash – FRSC",
    "summarized_story": "Yusuf Abdullahi, Sector Commander, Federal Road Safety Corps (FRSC) in Bauchi, says no fewer than eight persons lost their lives in a road accident that occurred in Bauchi on Saturday.\nAbdullahi confirmed the incident in an interview with the News Agency of Nigeria (NAN) in Bauchi on Sunday.\nHe explained that nine people were involved in the crash, comprising two males, six females and a male child.\nThe FRSC boss said that his personnel had cleared the obstructions at the crash scene, adding that the corpses of the deceased have also been taken to the General Hospital, Dass.\n“They should also remember that only the living souls, not the dead, would live to celebrate the Christmas and new year festivities,” he stated."
  },
  {
    "headline": "Sowore reacts to alleged detention of female soldier who received marriage proposal in NYSC camp",
    "summarized_story": "Publisher of SaharaReporter, Omoyele Sowore has vowed to mobilize justice for a female soldier allegedly being detained by the Nigerian Army after she received a marriage proposal from a Youth Corper at the orientation camp in Yikpata, Kwara State.\nThe video accessed by our correspondent, showed the soldier kissing the corps member at her supposed duty post.\nReacting, Sowore, a human rights activist tackled the Nigerian army, saying the move was totally unacceptable.\nIn a post on his verified Facebook page, Sowore who vehemently condemned the action of the army, said the female soldier must get justice stressing that such treatment must stop.\nThe post reads, “Just came to my attention that the @Nigerian army detained the female soldier in this video for getting a proposal from a youth corps member."
  },
  {
    "headline": "Nigeria imported N13.7tn manufactured goods in nine months – NBS",
    "summarized_story": "Manufactured goods valued at N13.7tn were imported into Nigeria from January to September 2021, data from the National Bureau of Statistics has shown.\nThe data indicates that the country also exported manufactured goods worth N757bn in the nine months, accounting for 0.06 per cent of the total trade of N14.3tn.\nThe data revealed that manufactured goods imported into the country included antibiotics, used vehicles, motorcycles, and machines for the reception of voice, stressing that goods exported from the country included vessels and other floating structures as well as aluminium alloys.\nIt explained that in the second quarter, of the N4.5tn total trade in the sector, the country imported N4.3tn worth of manufactured goods and exported N211.6bn goods.\nTo give the manufactured goods in the country a chance to compete, he suggested a reduction of corporate income taxes as a viable solution."
  },
  {
    "headline": "COVID-19: Rivers, Lagos lead as NCDC confirm surge in 14 states",
    "summarized_story": "The Nigerian Centre for Disease Control, NCDC has confirmed 828 new cases of COVID-19 in fourteen states and the Federal Capital Territory, Abuja.\nThe new figures bring the total number of infections since 2020 to 223,483 with 2,984 deaths while about 211,522 have recovered.\nThe health agency made the disclosure on Sunday morning via a post on its verified Facebook handle.\nThe post reads, “828 new cases of COVID19 in Nigeria;Rivers-188Lagos-183Delta-97FCT-82Oyo-67Edo-54Ekiti-34Plateau-34Kano-27Anambra-22Kaduna-19Enugu-12Ogun-5Kwara-4223,483 confirmed211,522 discharged2,984 deaths”."
  },
  {
    "headline": "Expert calls out FG over insecurity, alleges total takeover of North by terrorists",
    "summarized_story": "A security expert, Husseini Ahmed has decried the take over of the entire northern region by terrorism, alleging that the federal and state governments have become helpless as the region is turned into a colony terror in Africa.\nIn an exclusive interview with DAILY POST in Gusau, Zamfara State, the expert said it is inarguable that terrorism has been one of the major issues the federal government has had to contend with.\nHe said vigilance could be maintained while ensuring that sudden and unknown structures are erected in communities.\nHe stressed that random movements of suspected persons in a particular area can immediately be reported to the security agencies for immediate investigation.\n“Informing the security agencies of any suspected development on time will ensure decisive actions that would be taken to neutralize the terrorists”According to the security expert, if the federal, state governments and the members of communities can join forces against the bandits, the federal government will win against terrorism in the north."
  },
  {
    "headline": "Buhari, Ikpeazu, others eulogize Adanma, wife of late Michael Okpara at her funeral",
    "summarized_story": "President Muhammadu Buhari has extolled the sterling virtues of late Lady Adanma Okpara, the wife of the former Premier of Eastern Region of Nigeria, Dr Michael Iheonukara Okpara.\nDAILY POST recalls that late Adanma Okpara who hailed from Umuegwu Afugiri Ohuhu in Umuahia North Local Government Area of Abia State passed away in August at the age of 99 years.\nHe also recalled that in the days of Dr. Michael Okpara, Eastern Nigeria had the fastest growing economy in the world.\nHe regretted the absence of the southeast governors at the event, to honour the late spouse of Dr Okpara, who brought accolades to the country during his days as the Premier.\nAged 99, late Lady Adanma Okpara, a Knight of John Wesley of the Methodist Church, is survived by five children, many grand and great-grandchildren, among whom is former Chairman of People’s Democratic Party(PDP) in Abia State, Uzodinma Okpara."
  },
  {
    "headline": "‘Monarch accused me of being too stingy with money’",
    "summarized_story": "‘Monarch accused me of being too stingy with money’As governor of Osun State, Chief Bisi Akande had problems with the immediate past Ooni of Ife, Oba Okuade Sijuwade, and the Owa-Obokun of Ijeshaland, Oba Adekunle Aromolaran.\nHe also said Oba Aromolaran was always saying bad things about him because of his belief that he was stingy.\nI told him that Osun State had no money now to buy cars for traditional rulers.\n- Advertisement -“But his pestering was too much and I secretly sent money to him to buy a car.\nHe explained that the late Ooni wanted him to renew the Ede-Osogbo Waterworks which was to be repaired with $300 million."
  },
  {
    "headline": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’",
    "summarized_story": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’A former Osun State Governor Chief Bisi Akande has relived his confrontation with ex-President Olusegun Obasanjo when Chief Bola Ige (SAN) was murdered while serving as Attorney-General of the Federation and Minister of Justice.\nAkande, in his autobiography ‘My Participations’ said he had just returned from the United Kingdom when he was told of the murder.\n- Advertisement -“How can you say lapses in my security when Bola Ige was killed in Ibadan?\nI rule in Osun State!\n“It was President Obasanjo on the other end."
  },
  {
    "headline": "Akande: I’ve never seen anything genuine in Obasanjo",
    "summarized_story": "Akande: I’ve never seen anything genuine in ObasanjoA former Osun State Governor and first National Chairman of the All Progressives Congress (APC) Chief Bisi Akande has said he has never seen anything genuine in ex-President Olusegun Obasanjo.\nAkande, in his book, ‘My Participations’, narrated several instances of Obasanjo’s alleged attempts to bring him down.\nAkande said during the centenary celebration of the Baptist Church in Abeokuta, Obasanjo announced that he was “an example of a prudent and honest governor”.\n- Advertisement -“I have never seen anything genuine about him despite his self-glorification,” Akande wrote.\nHe accused Obasanjo of ordering that Osun State should be short-paid by N216 million monthly from the Federal Allocation."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Again, blood flows in Kaduna as bandits kill over 20, burn several houses",
    "summarized_story": "From Noah Ebije, KadunaNo fewer than 20 persons have been killed and several property destroyed by bandits on Sunday in Giwa local government area of Kaduna State.\nThis killings came on the heels of nine persons killed by bandits in Kaduna communities about three days ago.\n“According to the report, bandits attacked Kauran Fawa, Marke and Riheya villages in Idasu, Giwa LGA, leaving more than 20 residents dead as of the time of this update.\n“The Governor also commiserated with the affected communities and directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief.\n“The identities of the victims will be published once further details are confirmed by the Kaduna State Government."
  },
  {
    "headline": "Yoruba groups kick against FG’s failure to declare bandits terrorists",
    "summarized_story": "By Lukman OlabiyiCoalition of Yoruba groups in the Diaspora under the auspices of Yoruba One Voice (YOV) has held that the Federal Government’s failure to officially designate bandits as terrorists, was deliberate and an attempt to realise Fulani’s agenda of recolonisation of Nigeria.\nYOV in a communiqué issued on Saturday, at the end of its international webinar conference, with the theme, “Foreign Banditry Effect on Farming and Farmers in Yorubaland,” knocked Federal Government for its alleged deliberate inaction of making the court’s order effective.\nAccording to the communiqué, the conference was attended by over 1,000 members of the group, who bemoaned the shortage of food supply in South West region as a result of insecurity in Yorubaland.\nAmong the people who signed the communiqué included YOV’s grand patron, Aare Gani Adams; the Secretary-General, Dr. Sina Okanlomo, and Olori Ladun Orolugbagbe, Publicity Secretary.\nThey lamented that farmers in Yorubaland were leaving their farms in droves due to no fault of theirs, but because of coordinated, drastic, maximum and ruinous attacks by bandits/terrorists."
  },
  {
    "headline": "Electoral Amendment bill: Buhari set to reply NASS on assent –Presidency",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidency has said that President Muhammadu Buhari would soon let the National Assembly know whether or not he would assent to the Electoral Act Amendment Bill 2021.\nAccording to the Senior Special Assistant on Media and Publicity to the president, Garba Shehu, Buhari has been fully briefed on the bill, especially on the contentious areas, adding that his position would be communicated to the National Assembly soon.\nSunday Sun had asked Shehu if President Buhari will sign the Electoral Amendment Bill as today (Sunday) is the last day for him to give his assent or heed to the Attorney General of the Federation and Minister of Justice, Abubakar Malami’s warning that direct primaries would throw Nigeria to chaos and the president should not sign the bill.\nThe coalition had expressed concern that President Buhari is yet to assent to the bill since it was passed and transmitted to him by the National Assembly.\nThe Senate also passed the harmonized version of the Electoral Act (Amendment) Bill, 2021."
  },
  {
    "headline": "Men pester me for marriage despite knowing I’m married –Ngozi Ezeh, actress",
    "summarized_story": "What differentiates the social media acting from the real Nollywood acting?\nWhat good or harm would you say social media has done to the movie industry?\nSocial media has helped the movie industry in mitigating copyright and piracy.\nWho exactly is Ngozi Ezeh aside the one always acting the good role in movies?\nDespite knowing that I’m married, some fans still tell me ‘I love you and I want to marry you’."
  },
  {
    "headline": "2023 presidency: Edwin Clark insists it’s turn of Southeast",
    "summarized_story": "By Agatha EmeadiElder statesman and leader of Pan-Niger Delta Forum (PANDEF), Chief Edwin Clark, has insisted that the presidency in 2023 should go to the Southeast geo-political zone.\nChief Clark reaffirmed his stand on the 2023 presidency when frontline presidential aspirant, Senator Anyim Pius Anyim, visited him in Abuja at the weekend in continuation of his consultations for the plum job.\nThe statesman encouraged Anyim to work hard with other leaders across the country to build consensus for equity and unity in Nigeria, saying that “the presidency of Nigeria in 2023 should go to the Southern part of Nigeria and indeed to the Southeast zone.\nAnyim also took the opportunity to consult with Clark on the state of the nation and his plan for the future.\n“I thank God that Chief Edwin Clark will soon be 95 years old and yet he is blessed with phenomenal memory, lucid and curious mind, a benevolent heart and boundless goodwill for all men."
  },
  {
    "headline": "Anxiety Mounts as Deadline for Buhari to Sign Electoral Bill Expires Today",
    "summarized_story": "It was learnt that he might refuse to sign the bill and ask the National Assembly to consider some of the major issues.\n“There is already a Supreme Court judgment that political parties should be allowed to decide their internal affairs.\nThe presidency source further explained that Buhari is also concerned with the cost and security implications of direct primary.\nBecause the Electoral Act (Amendment) Bill, 2021 introduces the direct primary, you should kill the whole Electoral Act (Amendment) Bill?\n“I don’t see the present rather ‘friendly’ leadership of the National Assembly galvanising the National Assembly members to override him”, he said."
  },
  {
    "headline": "Buhari Rallies International Support against Terrorism",
    "summarized_story": "Deji Elumoye in Abuja and George Okoh in MakurdiPresident Muhammadu Buhari has called on the Turkey-Africa Partnership Summit to provide concrete support to help defeat terrorism and insurgency on the African continent.\nBenue State Governor, Dr. Samuel Ortom, also yesterday again drew the attention of Buhari to the fact Nigeria is collapsing due to terrorists’ activities.\nPresident Buhari also expressed delight that the Summit convened by Turkish President, Recep Tayyip Erdogan, has given due consideration to the issue of terrorism, while also focusing on development and infrastructure in Africa.\nBuhari advised that the partnership should also focus on the global challenge of climate change which is impacting Nigeria, Turkey, and indeed the world at large.\n“To contribute to the resolution of this issue, within our means, we plan to share 15 million vaccine doses in the period ahead,” he said."
  },
  {
    "headline": "DMO: Nigeria Didn’t Mortgage National Assets as Collateral for Chinese Loans",
    "summarized_story": "Festus AkanbiThe Debt Management Office (DMO) has clarified that loans from China to Nigeria, which presently stood at $3.59billion were largely concessional as no national asset was tagged as collateral.\n“Nigeria’s total debt stock as at September 30 was $37.9 billion; this figure comprised the external debt stock of the federal government, 36 state governments and the Federal Capital Territory (FCT).\n“But total loans from China stands at $3.59 billion, which is 9.47 per cent of the total external debt.\nThe loans did not require any national asset as collateral; they were largely concessional,’’ she said.\nShe explained that before foreign loans were contracted, very sensitive steps were taken by multiple institutions of government to ensure that they were beneficial to the nation."
  },
  {
    "headline": "Osinbajo, Lawan, Govs, Ministers Grace Installation of Buhari’s Son, Yusuf, as Talban Daura",
    "summarized_story": "This is just as the Emir of Daura, Alhaji Umar Farouk Umar, lauded the President for his leadership qualities while describing Osinbajo as a noble man and trusted person.\nSpeaking at the occasion, the Emir of Daura, Alhaji Umar, praised President Buhari for his leadership qualities, adding that power belongs to God and He gives it to whoever He pleases.\nCommending both the State and Federal Governments, the traditional ruler testified that the Katsina State Government had been working hard to end the difficulties of the masses.\nHe added also that Daura had been transformed under the leadership of the President, lauding him for the developmental strides witnessed so far.\nThe Emir of Daura also extended his appreciation to the Vice President who represented the President at the occasion."
  },
  {
    "headline": "Turkey to Help Nigeria Tackle Insecurity; Buhari, Erdogan Strengthen Defence Ties",
    "summarized_story": "“I am happy Nigeria is stepping up cooperation with other nations in areas of defence and health, and we are ready to cooperate with you on these areas and more,” said Erdogan.\nPresident Buhari had earlier said Nigeria would partner with the Republic of Turkey in dealing with the current security challenges facing the nation.\nPresident Gets Surprise Birthday Cake in IstanbulPresident Buhari, at a surprise 79th birthday reception organised for him in Istanbul yesterday promised to advance the interest of Nigerians and that of the nation as he prepares to leave office in May, 2023.\nAs he stepped out of his suite, moving to the meeting room, President Buhari met a surprise lineup of the Nigerian delegation with a cake decorated in Nigeria’s national colours.\n“I look forward to the year 2023 when I finish, to go home to take charge of my farm."
  },
  {
    "headline": "Adegboruwa asks national assembly to veto electoral bill if Buhari refuses to sign",
    "summarized_story": "Ebun-Olu Adegboruwa, senior advocate of Nigeria (SAN), has asked the national assembly to veto the electoral act amendment bill if President Muhammadu Buhari refuses to sign it.\nBuhari is reportedly under pressure not to sign the bill.\nIn a statement, Adegboruwa said the failure of the president to sign the bill before travelling for a summit in Turkey is “truncating the reforms encapsulated in that historic bill”.\nAdvertisement“The president did not assent before he traveled to Turkey, thus truncating the reforms encapsulated in that historic bill,” the lawyer said.\n“I urge the national assembly, in the national interest, to invoke its constitutional powers to pass the electoral bill and save our democracy from imminent collapse."
  },
  {
    "headline": "Adegboruwa asks national assembly to veto electoral bill if Buhari refuses to sign",
    "summarized_story": "Ebun-Olu Adegboruwa, senior advocate of Nigeria (SAN), has asked the national assembly to veto the electoral act amendment bill if President Muhammadu Buhari refuses to sign it.\nBuhari is reportedly under pressure not to sign the bill.\nIn a statement, Adegboruwa said the failure of the president to sign the bill before travelling for a summit in Turkey is “truncating the reforms encapsulated in that historic bill”.\nAdvertisement“The president did not assent before he traveled to Turkey, thus truncating the reforms encapsulated in that historic bill,” the lawyer said.\n“I urge the national assembly, in the national interest, to invoke its constitutional powers to pass the electoral bill and save our democracy from imminent collapse."
  },
  {
    "headline": "Akunyili, Attahiru, TB Joshua -- 12 shocking deaths of 2021",
    "summarized_story": "IBRAHIM ATTAHIRU – CHIEF OF ARMY STAFFIbrahim Attahiru, the late chief of army staff (COAS), died in an air crash near Kaduna international airport on May 21.\nUpon assumption of office, the late army chief had shown his readiness to combat insecurity in the country.\nHere is TheCable’s obituary on the exploits of the late army chief.\nTB JOSHUA– FOUNDER OF SCOANAnother death that shocked Nigerians was that of Temitope Balogun Joshua, founder of the Synagogue Church of All Nations (SCOAN).\nCHIKE AKUNYILI – MEDICAL DOCTORThe murder of Chike Akunyili, husband of the late Dora Akunyili, ex-minister of information and communication, also came as a rude shock to Nigerians."
  },
  {
    "headline": "Akunyili, Attahiru, TB Joshua -- 12 shocking deaths of 2021",
    "summarized_story": "IBRAHIM ATTAHIRU – CHIEF OF ARMY STAFFIbrahim Attahiru, the late chief of army staff (COAS), died in an air crash near Kaduna international airport on May 21.\nUpon assumption of office, the late army chief had shown his readiness to combat insecurity in the country.\nHere is TheCable’s obituary on the exploits of the late army chief.\nTB JOSHUA– FOUNDER OF SCOANAnother death that shocked Nigerians was that of Temitope Balogun Joshua, founder of the Synagogue Church of All Nations (SCOAN).\nCHIKE AKUNYILI – MEDICAL DOCTORThe murder of Chike Akunyili, husband of the late Dora Akunyili, ex-minister of information and communication, also came as a rude shock to Nigerians."
  },
  {
    "headline": "DMO: National assets not used as collateral for Chinese loans",
    "summarized_story": "The Debt Management Office (DMO) says no national asset was used as collateral for the solicitation of loans from China.\nAdvertisementReacting to the reports, Oniha said the loans from China to Nigeria were largely concessional, as no national asset was tagged as collateral.\nShe also disclosed that Chinese loans which presently stood at $3.59 billion constitutes only 9.4 percent of the Nigeria’s total foreign debt stock of $37.9 billion.\nAdvertisement“But total loans from China stands at 3.59 billion dollars, which is 9.47 per cent of the total external debt.\nThe loans did not require any national asset as collateral; they were largely concessional.”Oniha asked Nigerians to always endeavour to verify sensitive information from official sources before disseminating it."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "4 reasons you should care about the next frontier",
    "summarized_story": "Since then, we’ve explored The Next Frontier as it relates to edtech and fintech.\nAPI healthtech startupsPhoto by National Cancer Institute on UnsplashThe fintech industry has benefited a great deal from the presence of API fintech startups as they have eased interoperability.\nCurrently, there are no African startups providing healthtech startups with an API.\nWithout API startups, the process of getting your medical history has to begin afresh, but with an API startup, all that information could be gotten in seconds.\nHolding on January 22, 2022, it will feature startup competitions and exhibitions in addition to conversations on The next frontier."
  },
  {
    "headline": "A Zimbabwean Data Protection Act to rule them all. Or not",
    "summarized_story": "Other laws included the Consumer Protection Act, Census and Statistics Act, and the Interception of Communication Act, among others.\nInitially, The Cybercrimes and Data Protection Bill was to cover all things incidental to Cybercrime and Data Protection.\nAdvertisementThe current state of affairsThe Data Protection Act, as it is known now, is styled after the Southern Africa Development Community (SADC) model law on data protection.\nAnd it might be easier than starting afresh.”Following the recommendation of the Parliamentary Joint Committee, the new act was renamed the Data Protection Act instead of the Cybercrimes and Data Protection Act.\nThe European Union’s General Data Protection Regulation — the first comprehensive data protection law — provides for this."
  },
  {
    "headline": "Nigeria-based logistics company launches HELP, to provide ambulance services with its Uber-like model",
    "summarized_story": "Our people are scared for their lives, because what happens in the case of a health emergency?\nHow it worksThe HELP mobile app is currently available for Android users on the Play Store and is soon to be available on the App Store.\nThere are two levels of external partners at HELP, Service Partners and Client Partners.\nService partners on the HELP platform include hospitals, health facilities, and private ambulance owners in the country.\nInterestingly, a random person can access the HELP service with the code."
  },
  {
    "headline": "Bleak yuletide as low purchasing power hits Nigerian households",
    "summarized_story": "The worst still is that many are not going to celebrate Christmas and New Year the way they used to; there is no purchasing power to do so.\nIn the same vein, Gbemi Okikioluwa, an economist and banker, decried that the purchasing power of many is very low now and that many will celebrate Christmas without the usual fanfare of traditional Christmas rice and killing of the fattest chicken, goat or cow.\nThe cost, the risk, the pandemic, January burden; including school fees and house rent are making it difficult for people to celebrate Christmas and New Year elaborately.\nSpeaking to our correspondent, Tunde Mogaji, a media consultant, said: “The low purchasing power among Nigerians and high cost of things are really big issues in the country now.\nThe hyper-inflation would definitely make the cost of living high and purchasing power will be low."
  },
  {
    "headline": "‘FG must take tough decisions to resolve Nigeria’s security crisis’",
    "summarized_story": "Recently, it was confirmed that 23 travellers were slain in different parts of Sokoto State.\nIn many remote communities in Northern Nigeria, the armed groups often outnumber and outgun the security forces.\n“Armed bandits ambushed and shot at their bus setting it ablaze and stood guard watching until all the passengers were burnt alive.\nThe menacing presence of the armed bandits prevented anyone from responding to the people’s screams for help,” he said.\nAccording to him, “Our situation in Sokoto State got worsened by the military operations in Zamfara State."
  },
  {
    "headline": "Recharge card sellers struggle to survive as buyers move online",
    "summarized_story": "People depended on him to sell physical recharge cards to stay in touch with their loved ones or conduct their businesses.\nI had to add provisions and snacks to support myself as the recharge card business started slowing down,” he told BusinessDay.\nShe says the business is still going well as she gets a lot of Customers who buy recharge cards from her.\nAccording to Hammed, the paper recharge card attracts more cost for the company compared to the digital form of recharging.\nKanayo, who was sitting underneath a Recharge card seller’s umbrella, told BusinessDay that he prefers to recharge online than buy the recharge card (on paper) due to the convenience that comes with it."
  },
  {
    "headline": "NAPVID distributes Xmas packages to PWDs in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – No fewer than 70 less privileged persons living with disabilities in Edo State has benefited from the Network for the Advancement of Persons With Visible Disabilities (NAPVID) Christmas packages.\nThe packages which were distributed to the beneficiaries on Saturday in Benin city, Edo State capital, include rice, groundnut oil, tin tomatoes, amongst other things.\nAccording to the executive director of NAPVID, Barr Melody Omosah, the gesture was to reach out to unemployed people with disabilities who can not provide for themselves the things they need to celebrate Christmas.\nWe feel there was a need to extend that hand of fellowship to them and give them items that would aid the Christmas celebration.\nHighpoint of the event was distribution of the items to the beneficiaries who came from different parts of the state."
  },
  {
    "headline": "Int’l Migrants Day: Obaseki urges youths to take advantage of tech revolution, agriculture – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Governor, Mr. Godwin Obaseki has urged youths to take advantage of the ongoing tech revolution in the state through programmes offered by the Edo Tech Park, to acquire technical skills in software engineering to become world-class developers.\nThe governor made the call in commemoration of the International Migrants Day, marked every December 18, by the United Nations and its sister agencies.\nHe said, “As part of our plans to end the scourge of illegal migration, we will continue to implement policies and reforms that would guarantee more economic opportunities for our youths, so they can realize their potentials and compete for top jobs as developers across the globe.”On the theme of the 2021 International Migrants Day, ‘Harnessing the Potential of Human Mobility,’ Obaseki noted, “The state government will not relent in its drive to make Edo State a digital hub that will provide youths with highly sought-after skills and create opportunities for them to be employed and work from the state for companies located anywhere in the world.\n“We have commenced the training of youths at the Edo Tech Park.\nOur plan is to train about 15,000 youths to become software engineers and equip them with the required skills to migrate legally to work in any part of the globe.”He urged youths to also embrace opportunities in the agriculture value chain by deploying innovative approaches to create wealth, noting that “the state government is building a world-class college of agriculture in the state to assist youths take advantage of opportunities in the agricultural sector.”Obaseki assured that his administration will collaborate with local and international partners to support youths to grow businesses in the state by creating the enabling environment for businesses to thrive and reducing investment risks."
  },
  {
    "headline": "Over 10,000 youths to benefit as Edo, MasterCard Foundation launch entrepreneurship programme – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – No fewer than 10,000 youths in Edo State are expected to benefit from the Transforming Nigeria Youths (TNY) Entrepreneurship programme, recently inaugurated by the state government in partnership with the Enterprise Development Centre and MasterCard Foundation.\nManaging Director, Edo Skills Development Agency, EdoJobs, Ukinebo Dare, said the programme will further boost business activities in the state, especially for Micro Small and Medium Enterprises (MSMEs).\nAnifowose noted that the youths would form the first-year beneficiaries of a five-year entrepreneurship training that would run in the state, adding that they will be exposed to three months of online training with a free data plan.\nHe added that there will be one-on-one free business mentorship, as well as access to funding for youths that would complete the three months training.\nAccording to him, “The three key objectives of the programme are to create the correct mindset about entrepreneurship, provide access to market and direct services, as well as provide access to funding opportunities."
  },
  {
    "headline": "Obaseki to upgrade 12 medical facilities, expand health insurance to rural communities in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his administration plans to upgrade 12 medical facilities in the state and expand the health insurance scheme to rural and hard-to-reach communities.\nObaseki, who spoke to journalists in Benin City, said his government is committed to sustaining investment in the healthcare sector, ensuring quality, efficient and affordable health services to Edo people.\nStating that the government is committed to ensuring that every Edo citizen has access to quality healthcare without having to worry about the financial burden, the governor added that health is a fundamental right.\nAccording to him, “We are determined to achieve Universal Health Coverage in Edo, ensuring quality healthcare delivery that is accessible to all citizens.\nWith the health insurance scheme now operational, we are building a superstructure to provide a strong capital base for the sustenance of the healthcare system, while providing our people with a more democratized system of accessing quality and affordable healthcare.”..."
  },
  {
    "headline": "WHO says Omicron Covid-19 variant now in 89 countries",
    "summarized_story": "Global health body, the World Health Organisation (WHO) has said the new Omicron variant of the coronavirus has now been detected in 89 countries.\nIn a statement on Saturday, WHO said there is consistent evidence that Omicron has a substantial growth advantage over Delta, adding that “given current available data, it is likely that Omicron will outpace Delta where community transmission occurs.”According to the organisation, “As of 16 December 2021, the Omicron variant has been identified in 89 countries across all six WHO regions.\nCurrent understanding of the Omicron variant will continue to evolve as more data becomes available,” the statement reads.\n“It is spreading significantly faster than the Delta variant in countries with documented community transmission, with a doubling time between 1.5–3 days.\n“There are still limited available data, and no peer-reviewed evidence, on vaccine efficacy or effectiveness to date for Omicron.”"
  },
  {
    "headline": "Lady Adanma Okpara: Eastern Nigeria Amazon Embarks on Her Final Journey Home",
    "summarized_story": "However, Dr. Okpara had a secret weapon in Lady Adanma, then a 37-year-old teacher, who readily stepped up to the responsibility of guiding her husband.\nIndeed, Lady Adanma as First Lady, epitomized humility, simplicity and dedication.\nIndeed, when Dr. Okpara left office, the only landed property he owned was one uncompleted building at Ogui Road in Enugu.\nThere he would live until his death in 1984, and there Lady Adanma lived till she passed on, too.\nLady Adanma set a standard on many fronts: In leadership, humility, discipline dedication, she was never found wanting."
  },
  {
    "headline": "Nigeria’s debt to China rises to $4.15 billion",
    "summarized_story": "Debt Management Office (DMO) in its latest data has revealed that Nigeria’s debt to China is $4.15 billion as of September 2021.\nThis balance is out of a total debt of $6.5 billion available for Nigeria to draw down.\nMost of the debts are for a period of 20 years with a grace period to repay the principal of about 7 years.\nOnly a $200 million debt had a tenor of 12 years with a grace period of 5 years.\nNigeria’s debt to China has risen over the last decade as government diversifies its debt portfolio towards cheaper Chinese loans with rates at an average of 2.5% per annum."
  },
  {
    "headline": "Customs Intercepts Container-Load Of Guns In Lagos",
    "summarized_story": "Officials of the Nigeria Customs Service attached to Tin Can Island Command intercepted a 40ft container carrying arms on Friday.\nThe owner of the container allegedly declared that the content were plasma televisions, but customs officers at the command discovered it contained cartons of guns.\nThe Public Relations Officer of the Tin Can Customs, Mr Uche Ejesieme, confirmed the development, saying that the container of guns was discovered during a routine examination at terminal B2 (Vehicle) of the TICT.\nHe added that, in line with service protocol, the command would inform the Customs high command in Abuja after the container had been thoroughly examined at the enforcement unit of the command.\n“As we speak, we do not have full details of who is behind the import, country of import and the model of guns."
  },
  {
    "headline": "It Is President Buhari’s Prerogative To Sign Electoral Bill — Malami",
    "summarized_story": "Abubakar Malami, Minister of Justice and Attorney-General of the Federation (AGF), has said it is the prerogative of President Muhammadu Buhari to either accent to the Electoral Act Amendment Bill or not, as the constitutional timeline expires on Sunday, December 19.\nAGF who spoke on the imbroglio that has trailed the bill since it was transmitted to the President by the National Assembly three weeks ago, said his office had officially written its legal opinion to President Buhari on the Bill and the onus was on the President to either sign the Bill into law or not.\nHe made this known on Saturday through his Special Adviser on Media and Public Relations, Dr Umar Jibrilu Gwandu, Malami said though it was premature of him to comment on a process involving official communication between the office of the President and the office of the Attorney General of Federation and Minister of Justice without allowing the conclusion of the adminsitration cycle, the general public would be adequately and timely informed by the Office of the President on the decision.\nPresident Buhari has till Sunday to either assent to the Bill or not, and in the event he refuses, the National Assembly may decide to exercise its veto power to transmute the Bill into law.\nBut the general feeling in the country is that the National Assembly may not want to exercise its veto power over the contentious Bill so as not to jeopardize its relationship with the Executive."
  },
  {
    "headline": "It Is President Buhari’s Prerogative To Sign Electoral Bill — Malami",
    "summarized_story": "Abubakar Malami, Minister of Justice and Attorney-General of the Federation (AGF), has said it is the prerogative of President Muhammadu Buhari to either accent to the Electoral Act Amendment Bill or not, as the constitutional timeline expires on Sunday, December 19.\nAGF who spoke on the imbroglio that has trailed the bill since it was transmitted to the President by the National Assembly three weeks ago, said his office had officially written its legal opinion to President Buhari on the Bill and the onus was on the President to either sign the Bill into law or not.\nHe made this known on Saturday through his Special Adviser on Media and Public Relations, Dr Umar Jibrilu Gwandu, Malami said though it was premature of him to comment on a process involving official communication between the office of the President and the office of the Attorney General of Federation and Minister of Justice without allowing the conclusion of the adminsitration cycle, the general public would be adequately and timely informed by the Office of the President on the decision.\nPresident Buhari has till Sunday to either assent to the Bill or not, and in the event he refuses, the National Assembly may decide to exercise its veto power to transmute the Bill into law.\nBut the general feeling in the country is that the National Assembly may not want to exercise its veto power over the contentious Bill so as not to jeopardize its relationship with the Executive."
  },
  {
    "headline": "ECOWAS, AFD Sign New €8m Grant Agreement For Food Security",
    "summarized_story": "This new funding follows a pilot phase funded by the European Union for €56 million (of which €31.9 million delegated to AFD) to support the ECOWAS Regional Food Security Storage Strategy.\nAdopted in 2012, this strategy combines local stocks, national stocks and a Regional Food Security Reserve (RFSR) to ensure regional solidarity in the event of a major food crisis in the region.\nThe 8 million euro and 3-year AFD support to ECOWAS aims to increase the region’s readiness to manage food, nutrition and pastoral crises with a variety of causes.\nThe ECOWAS Commission, through its Department of Agriculture, Environment and Water Resources, is responsible for the implementation of the new project.\nADVERTISEMENT“AFD’s partnership with the ECOWAS Commission since 2011 in supporting the implementation of the Regional Agricultural Policy, ECOWAP, is a living model."
  },
  {
    "headline": "ECOWAS, AFD Sign New €8m Grant Agreement For Food Security",
    "summarized_story": "This new funding follows a pilot phase funded by the European Union for €56 million (of which €31.9 million delegated to AFD) to support the ECOWAS Regional Food Security Storage Strategy.\nAdopted in 2012, this strategy combines local stocks, national stocks and a Regional Food Security Reserve (RFSR) to ensure regional solidarity in the event of a major food crisis in the region.\nThe 8 million euro and 3-year AFD support to ECOWAS aims to increase the region’s readiness to manage food, nutrition and pastoral crises with a variety of causes.\nThe ECOWAS Commission, through its Department of Agriculture, Environment and Water Resources, is responsible for the implementation of the new project.\nADVERTISEMENT“AFD’s partnership with the ECOWAS Commission since 2011 in supporting the implementation of the Regional Agricultural Policy, ECOWAP, is a living model."
  },
  {
    "headline": "Federal Govt To Partner Chinese Firm To Boost Renewable Energy In Nigeria",
    "summarized_story": "The Federal Government has mapped out strategies to collaborate with the People’s Republic of China on the development of a renewable energy research center that will boost renewable energy technology in some selected Nigerian universities.\nThe proposed partnership between the Chinese and Nigerian universities is expected to build and upgrade centres of excellence in renewable energy technologies which include; (Green Energy- Solar, Wind, Hydro, Bio-energy, Energy efficiency and management).\nThe Minister also received on behalf of the Ministry a donation of Solar Panel Equipment from the department of Commerce of Yunnan Province and Kunming Engineering Corporation Ltd of China to improve renewable energy in rural areas of Nigeria.\nHe added that the donation is a project that aims to provide the solution of electricity shortages in rural areas where the national grid is not accessible.\nHe said further that “the proposed cooperation with the Federal Ministry of Science Technology and Innovation will also promote the transfer of renewable energy technologies and green energy to Nigeria.”The project is entitled “Promoting Green Energy in Africa, light-up thousands of families by Yunnan Provincial Department of Commerce”."
  },
  {
    "headline": "Too much money! Davido buys T-shirt from Zlatan Ibile for £5,000",
    "summarized_story": "Davido buys T-shirt from Zlatan Ibile for £5,000Too much money!\nDavido buys T-shirt from Zlatan Ibile for £5,000Nigeria’s Music star, David Adeleke a.k.a Davido, bought a T-Shirt from colleague Zlatan Ibile for five thousand pounds (N2,716,590.17).\nWhile buying the shirt, Davido said, “I don’t know how much this shirt costs but we don’t buy anything for the same price.\nLast Saturday, he revealed that his N250m orphanage fund received over 1,234 applications.\nThe singer took to his Instagram stories to give update on the selection and disbursement processes of the N250m fund."
  },
  {
    "headline": "Too much money! Davido buys T-shirt from Zlatan Ibile for £5,000",
    "summarized_story": "Davido buys T-shirt from Zlatan Ibile for £5,000Too much money!\nDavido buys T-shirt from Zlatan Ibile for £5,000Nigeria’s Music star, David Adeleke a.k.a Davido, bought a T-Shirt from colleague Zlatan Ibile for five thousand pounds (N2,716,590.17).\nWhile buying the shirt, Davido said, “I don’t know how much this shirt costs but we don’t buy anything for the same price.\nLast Saturday, he revealed that his N250m orphanage fund received over 1,234 applications.\nThe singer took to his Instagram stories to give update on the selection and disbursement processes of the N250m fund."
  },
  {
    "headline": "Experts condemn CBN naira defence, oil price as external reserves slide",
    "summarized_story": "The experts, who spoke with our correspondent in separate interviews on Saturday, noted that the external reserves were mostly determined by the revenue from oil exports.\nWhen crude oil price goes up, you will see our reserves also increasing because the price is in our favour; when the price of crude oil comes down, you will also see that our reserves will tend to follow suit.\n“If you look at the oil price, for the past one and a half month, it was above $80 before November.\nUkpong said this made the external reserves seemed to be doing well in recent months when there was a rise in the reserves.\nHe noted that those buying crude oil had slowed down because the emergence of the Omicron variant of COVID-19 affected economic activities in many countries."
  },
  {
    "headline": "Experts condemn CBN naira defence, oil price as external reserves slide",
    "summarized_story": "The experts, who spoke with our correspondent in separate interviews on Saturday, noted that the external reserves were mostly determined by the revenue from oil exports.\nWhen crude oil price goes up, you will see our reserves also increasing because the price is in our favour; when the price of crude oil comes down, you will also see that our reserves will tend to follow suit.\n“If you look at the oil price, for the past one and a half month, it was above $80 before November.\nUkpong said this made the external reserves seemed to be doing well in recent months when there was a rise in the reserves.\nHe noted that those buying crude oil had slowed down because the emergence of the Omicron variant of COVID-19 affected economic activities in many countries."
  },
  {
    "headline": "Pictorial: Actor Adedimeji Lateef Marries Adebimpe Oyebade",
    "summarized_story": "Nigerian actor, Adedimeji Lateef, on Saturday tied the knot with a fellow Nollywood star, Adebimpe Oyebade.\nThe duo took to their respective Instagram pages to share pictures from the wedding.\nSharing a picture of herself and her husband, the actress wrote, “Today I marry my best friend.”The actor also wrote, “The grace of the Almighty is sufficient.\nToday I marry my best friend.”See pictures of the couple below:"
  },
  {
    "headline": "PHOTOS: Yusuf Buhari’s Day Of Honour In Daura",
    "summarized_story": "President Muhammadu Buhari’s son, Yusuf, has been turbaned Talban Daura, making him the District Head of Kwasarawa.\nThe event, which held in the president’s hometown of Daura in Katsina State, had Vice-President Yemi Osinbajo; Senate President Ahmad Lawan; Governor Abdullahi Ganduje of Kano State; Aviation Minister, Senator Hadi Sirika, his Niger Delta and Science and Technology counterparts as well as many other Senators.\nAlso in attendance was the father-in-law of the new Talba, the Emir of Bichi, Alhaji Nasiru Ado Bayero.\nSee photos below:"
  },
  {
    "headline": "BREAKING: Popular Ex-Minister Is Dead",
    "summarized_story": "Alhaji Hussaini Zanwa Akwanga, a former Minister of Labour and Productivity, is dead.\nAccording to a report by Vanguard, Akwanga died on Friday at the age of 77 after a protracted illness in his country home Akwanga, the headquarters of Akwanga local government of Nasarawa State.\nThe former Minister, a professional teacher, became a minister in 2003 but was sacked by the then President Olusegun Obasanjo.\nIn 2017, the former minister was kidnapped in his farm in Kurmin Tagwaye Village, near Akwanga, but was however released two days later after paying the ransom.\nThe deputy chairman of Akwanga local government area of Nasarawa State, Alhaji Safiyanu Isa who confirmed the death of the former Minister said “the former minister died today (Friday), in Akwanga”He has since been buried according to Islamic rites in his hometown, Akwanga."
  },
  {
    "headline": "BREAKING: Sokoto Governor, Tambuwal Orders Arrest Of Musician Who Released Song Praising Bandit Kingpin, Turji",
    "summarized_story": "Sokoto State governor, Aminu Waziri Tambuwal has ordered the arrest of a musician, Mohammad Danshanawa for praising a bandit kingpin, Bello Turji in his music.\nIn a viral music audio, Danshawa praised the terrorist, Turji, describing him as “a lion, untouchable and a great leader”.\nThe governor’s order comes three days after the song went viral on several social media platforms.\nCommenting on the song, Governor Tambuwal said, “We ordered for his arrest to serve as a deterrent.\nAs it is, one cannot move from Sokoto here to Illeila, yet someone is praise-singing a terrorist.”"
  },
  {
    "headline": "CAF Confederation Cup: Nigeria’s remaining representative, Enyimba, out",
    "summarized_story": "After failing to honour their return leg CAF Confederation Cup match against Al-Itihad in Libya, Nigeria’s remaining representatives, Enyimba, have crashed out.\nAl Itihad lost the Aba leg of the tie by 2-0 but insisted on hosting Enyimba on Sunday, a trip which the Aba giants can not make.\nEnyimba had pleaded with their hosts for a shift in date but Al Itihad has since rejected the plea.\nCAF on their part have ruled that Enyimba can only have their way should Al Itihad cooperate and accept a shift in date."
  },
  {
    "headline": "By January, I ‘ll expose those behind insecurity in Imo – Uzodinma",
    "summarized_story": "Imo state governor Hope Uzodinma has revealed his readiness to expose those sponsoring various kinds of crime against the people of the state.\nThe governor who disclosed this on Saturday during the inauguration of newly elected executive of All Progressives Congress (APC) in Owerri.\nGovernor Uzodinma said all those involved in causing one form of insecurity or the other will face the full wrath of the law.\nHe said the names of those culpable will be revealed on January 3, 2022 when a stakeholders’ meeting will be convened.\nDetails loading…"
  },
  {
    "headline": "Tragedy! Bus crushes 8 dead at marriage party",
    "summarized_story": "A bus ran over a marriage party on Friday night in Pakistan’s eastern Punjab province, leaving eight people dead and nine others injured, local media and police said.\nThe uncontrolled bus crushed a group of people enjoying a marriage party in front of their house on the roadside near the Tahli Adda area of the Mandi Bahauddin district of Punjab, local police said.\nThe death toll is feared to rise as most wounded are in critical condition, said a hospital official.\nThe initial investigation revealed that the incident occurred amid dense fog when the driver lost control of the bus, local media reported.\nPunjabi police confiscated the bus and registered a case against the driver, who ran away after the accident."
  },
  {
    "headline": "Nigeria’s COVID-19 Cases Rise With 828 New Infections",
    "summarized_story": "The latest statistics by the Nigeria Centre for Disease Control (NCDC) have revealed that the number of confirmed COVID-19 cases in Nigeria increased to 223,483 with 828 additional cases confirmed on Saturday.\nRivers State had the highest number of cases with 188 infections confirmed in the state.\nThe Federal Government on Thursday warned Nigerians to take responsibility for their health as COVID-19 cases continued to rise in the country.\nMamora said this as COVID-19 cases continued to increase, with the country recording 5,398 infections between December 6 and 15.\nFind below a tab showing current statistics of confirmed cases according to states…Confirmed Cases by State"
  },
  {
    "headline": "Fresh $5.8bn Loan: SERAP Writes Buhari, Seeks ‘Moratorium’ On Borrowing",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has urged President Muhammadu Buhari to “issue an immediate moratorium on borrowing by the Federal Government and the 36 states to address a systemic debt crisis, prevent retrogressive economic measures, and the disproportionately negative impact of unsustainable debt on the poor Nigerians.”The request followed the recent approval by the National Assembly of President Buhari’s request for a $5.8bn loan and grant of $10bn.\nPrevious approvals in 2021 alone include $8.3bn; €490m, and $6.1bn.\nThe foreign debt stock of the Federal Government, 36 states, and Federal Capital Territory reportedly stands at $37.9bn.\nAccording to the Debt Management Office, the foreign debt stock of the Federal Government, 36 state governments and the Federal Capital Territory presently stands at $37.9bn.”“The loans from China alone amount to $3.59bn.\nIf we have not heard from you by then, SERAP shall take all appropriate legal actions to compel your government and the 36 states to comply with our requests.”"
  },
  {
    "headline": "Customs Intercept Container Suspected To Be Laden With Guns In Lagos",
    "summarized_story": "A suspected container laden with arms has been intercepted by the Tin Can Island Area Command of the Nigerian Customs Service.\nThe suspected cargo was discovered in one of the terminals under the command during a routine examinationThe Public Relations Officer of the Tin Can Island Area Command, Uche Ejesieme, confirmed the arrest.\n“The interception was made during routine examination on Friday,” he said.\nThe latest seizure is coming days after the Inspector-General of Police, Usman Baba, asked police commanders and officers to brace up to the anticipated internal security challenges that the year 2022 will present.\nIGP Baba had explained that 2022 would be very challenging because it precedes the 2023 general elections and the Force would be confronted with the management of threats associated with an active political space."
  },
  {
    "headline": "PHOTOS OF THE WEEK: Oba Of Benin Welcomes Home Looted Artefacts",
    "summarized_story": "This week’s photos, curated by channelstv.com‘s Photo Editor, Sodiq Adelakun, start from the ancient city of Benin and barrels down the town of Kayunga in Central Uganda, before terminating with the sombre snapshot of a football icon’s forced goodbye in Barcelona, Spain:"
  },
  {
    "headline": "11 Notorious Kidnappers Arrested, Seven AK-47 Rifles Recovered In Taraba",
    "summarized_story": "Operatives of the Nigeria Police Intelligence Response Team, working with the Taraba State Police Command, have arrested a total of 11 notorious kidnapping suspects in Taraba State.\nAccording to the police spokesman, Frank Mba, the suspects were apprehended for their complicity and various criminal roles in the recent kidnapping incidents in Taraba.\nThey also collect huge sums of money as ransom from relatives and friends of their victims before their release.\nIn the course of investigations, the police are said to have equally identified and raided various criminal hideouts where kidnap victims are usually kept.\nWhile cache of weapons and other incriminating items were recovered from the hideouts, all the kidnap victims held hostage at the various hideouts were carefully and successfully rescued unhurt and reunited with their families."
  },
  {
    "headline": "Group vows to go to court to ensure Asiwaju Tinubu contest in 2023 -",
    "summarized_story": "A group, known as the Disciples of Jagaban (DOJ), has vowed to drag the National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu to court if he declined contesting for Presidency in the next general elections.\nThe leader of the group, Abdulhakeem Alawuje, noted that the main reason is because the suffering in the country has gotten out of control and the National Leader of the APC, has the capacity and strategy to change the situation.\nHe further explained that the giant strides Bola Ahmed Tinubu made as governor of Lagos State is enough proof that he can stabilize the nation if he becomes president in 2023.\nThe group went on to flagg off a continuous voter registration campaign in Kaduna state to sensitize youths and the general public on the need to get registered to vote.\nThey hope the campaign will also help raise the quality of participation in Politics in Nigeria"
  },
  {
    "headline": "PGF Secretariat greets PGF DG, Salihu Lukman at 59",
    "summarized_story": "The Progressive Governors Forum (PGF) Secretariat has congratulated the Director General of the Progressives Governor Forum, Salihu Lukman, on his 59th birthday.\nThe statement reads partly thus: “We appreciate your leadership style and personal commitment to the ideals of progressivism.\nAs the Director General of PGF Secretariat, we celebrate your doggedness and uncommon contributions to the development of policies across the APC controlled States and Nigeria as a whole.\n“Here in the secretariat, you always put your time and energy to make staff members be at their best.\n“Once again, congratulations and Happy Birthday, Comrade Salihu Lukman,” the statement said."
  },
  {
    "headline": "Buhari postpones official visit to Ogun",
    "summarized_story": "Ogun State Government has announced the postponement of the official visit of President Muhammadu Buhari to the State initially scheduled for Tuesday, 21st December 2021.\nIn a statement issued on Friday in Abeokuta by Tokunbo Talabi, Secretary to Ogun State Government, the government said a new date for the visit and commissioning of some of the landmark projects of Prince Dapo Abiodun Administration will be announced in due course.\nThe Government regrets any inconvenience the postponement might cause the invited guests, the statement concluded."
  },
  {
    "headline": "Photos: President Buhari cuts 79th birthday cake in Turkey",
    "summarized_story": "President Muhammadu Buhari, on Friday in Istanbul, Turkey cut his 79th birthday cake in the presence of some senior government officials.\nThe president alongside some of his ministers and other presidential aides had departed the country for the Africa-Turkey Investment Summit in Istanbul.\nAccording to pictures from the short ceremony, President Buhari and other top government officials including the minister of Foreign Affair, Geoffrey Onyeama, Minister of State Education, among others were in cheerful mood.\nSee photos below:"
  },
  {
    "headline": "Nigeria: VAT Revenue Hits N196.175bn as FAAC Shares N675.946bn for November",
    "summarized_story": "“The N675.946 billion total distributable revenue comprised distributable statutory revenue of N488.674 billion; distributable VAT revenue of N182.678 billion, Exchange Gain of N4.156 billion and Excess Bank Charges Recovered of N0.438 billion,” he said.\n“From this, the federal government received N231.863 billion, the state governments received N117.604 billion and the local government councils received N90.668 billion.\n“The sum of N5.650 billion allocation to NEDC and N7.847 billion cost of collection were deducted from the N196.175 billion gross VAT revenue, resulting in the distributable VAT revenue of N182.678 billion,” Ogubike said.\nFrom the N182.678 billion distributable VAT revenue, he revealed that the federal government received N27.402 billion, the state governments received N91.339 billion and the local government councils received N63.937 billion.\nOf the N0.438 billion excess bank charges recovered, the federal government received N0.231billion, the state governments received N0.117billionm, and the local government councils received N0.090 billion."
  },
  {
    "headline": "Turkey’s Erdogan Pledges 15m Covid Vaccine Doses for Africa",
    "summarized_story": "Speaking on Saturday at a major summit of African leaders, President Reycep Tayyip Erdogan said Turkey would send 15 million Covid-19 vaccine doses to Africa, adding that the low vaccination rates there was a blot on humanity.\n“We are aware of the global injustice in accessing the Covid-19 vaccine and Africa’s unjust treatment,” Erdogan said.\n“It is disgraceful for humanity that only six per cent of Africa’s population has been vaccinated.”Turkey is developing its vaccine, known as Turkovac, which is in the process of receiving emergency use approval.\nIt was not immediately clear from his remarks whether Turkey would first send some doses of the internationally approved vaccines it was currently using, including those developed by Pfizer-BioNTech.\n“To contribute to the resolution of this issue, within our means, we plan to share 15 million vaccine doses in the period ahead,” he said."
  },
  {
    "headline": "DMO: Nigeria Didn’t Mortgage National Assets as Collateral for Chinese Loans",
    "summarized_story": "The Debt Management Office (DMO) has clarified that loans from China to Nigeria, which presently stood at $3.59billion were largely concessional as no national asset was tagged as collateral.\n“Nigeria’s total debt stock as at September 30 was $37.9 billion; this figure comprised the external debt stock of the federal government, 36 state governments and the Federal Capital Territory (FCT).\n“But total loans from China stands at $3.59 billion, which is 9.47 per cent of the total external debt.\nThe loans did not require any national asset as collateral; they were largely concessional,’’ she said.\nShe explained that before foreign loans were contracted, very sensitive steps were taken by multiple institutions of government to ensure that they were beneficial to the nation."
  },
  {
    "headline": "Nigeria is Collapsing, Benue Governor Ortom Tells Buhari in Birthday Message",
    "summarized_story": "Governor of Benue State in Nigeria’s North-Central Benue State, Samuel Ortom, on Saturday again drew Buhari’s attention to the fact that Nigeria is collapsing due to the activities of terrorists.\nOrtom said the president is a grandfather who should understand that people are dying daily unnecessarily in the hands of terrorists.\nAccording to the statement, the governor, who said he loves Buhari, urged him to take urgent action to secure the country before he leaves office.\n“I join your family, friends, political associates, and all Nigerians to congratulate you on the occasion of your 79th birthday,” he said.\n“All is not well with Nigeria right now, Mr. President."
  },
  {
    "headline": "Nigeria’s Buhari Rallies International Support against Terrorism",
    "summarized_story": "Nigeria President Muhammadu Buhari has called on the Turkey-Africa Partnership Summit to provide concrete support to help defeat terrorism and insurgency on the African continent.\nBenue State Governor, Dr. Samuel Ortom, also on Saturday again drew the attention of Buhari to the fact Nigeria is collapsing due to terrorists’ activities.\nPresident Buhari also expressed delight that the Summit convened by Turkish President, Recep Tayyip Erdogan, has given due consideration to the issue of terrorism, while also focusing on development and infrastructure in Africa.\nBuhari advised that the partnership should also focus on the global challenge of climate change which is impacting Nigeria, Turkey, and indeed the world at large.\nNot only has there been mutual support to respond to the pandemic but also mutual support to build resilience and sustainable development in other sectors."
  }
]