[
  {
    "headline": "FRSC blames speed violations as 20 killed in Bauchi crashes",
    "summarized_story": "No fewer than 20 people were killed while seven others sustained varying degrees of injuries in multiple crashes that occurred on Sunday evening.\nThe Sector Commander, Federal Road Safety Corp, Bauchi State, Yusuf Abdullahi, confirmed the crashes to our correspondent late Sunday night.\nAbdullahi said the crash which had 10 male adults and six female adults was caused by speed violation.\nHe said, “There were 16 people involved in this crash comprising 10 male adults and six female adults.\n“Those injured included five male adults, one female adult and one female child.”Abdullahi lamented the frequent crashes along routes across the state."
  },
  {
    "headline": "EFCC bars unvaccinated staff from Kwara office, warns absentees",
    "summarized_story": "THE Economic and Financial Crimes Commission on Monday turned back unvaccinated staff members from its Jabi, Abuja headquarters.\nAddressing journalists on the reason for the enforcement, the secretary of the commission, Mr George Ekpungu, said the exercise became necessary following the advent of the Omicron variant in the country.\nHe said the EFCC Chairman, Mr Abdulrasheed Bawa, had given the directive for the enforcement to ensure all staff were vaccinated.\n“We have been sensitising staff internally but felt the need to make it public to encourage others to copy from us.\n“The COVID-19 protocols were not instituted by the EFCC."
  },
  {
    "headline": "Ninth Assembly most successful in lawmaking since 1999, Lawan",
    "summarized_story": "Senate President, Ahmad LawanBy Henry UmoruABUJA-THE President of the Senate, Senator Ahmad Lawan has described the current 9th National Assembly as the most successful in law making since the return to civil rule in 1999.\nAccording to Lawan, the focus of the ninth National Assembly had been on legislations that are most likely to impact either on the democratic Institutions, economy, security or the livelihood of Nigerians.\nHe spoke on “The Legislature, Legislative Mandate and the People – The Reality and the Public Perception.”Lawan said, “I dear say that the ninth Assembly has been the most successful in the area of lawmaking since 1999.\nLawan said, “For twenty years, the National Assembly had attempted reforming the petroleum industry without much success.\n“The National Assembly is working to consider the 2022 Budget Appropriation Bill within this legislative week.”"
  },
  {
    "headline": "Gunmen kill 9, injure 4 persons in Plateau – Police",
    "summarized_story": "The Police Command in Plateau, has said that gunmen have killed nine persons and injured four others in an attack on Pinau community in Wase Local Government Area of the state.\nHe, however, said security agencies who quickly mobilised to the scene had arrested eight suspects and recovered 12 motorcycles.\n“Yesterday, at about 4:30p.m., we received a distress call that yet to be identified gunmen invaded Pinau Village in Wase local government area.\n“Unfortunately, they killed nine persons while four persons are injured.\nOgaba said that security has been beefed up in the area to prevent escalation of violence and break down of law and order."
  },
  {
    "headline": "Pantami seeks formulating security policies with technology mindset",
    "summarized_story": "Prof. Isa Pantami, Minister of Communications and Digital Economy on Monday reiterated the need for formulation of security policies with technology mindset to tackle insecurity challenges in the country.\nPantami made the call in Abuja at the maiden annual conference of the Nigeria Information Technology Reporters’ Association (NITRA), Abuja Chapter.\nHe further said that integrating digital technology and emergency management presented significant opportunities for innovation to tackle insecurity.\nPantami added that utilising data through social networking platforms, security agencies could check for information, share news and strategies for community security.\nHe commended activities of the Ministry of Communications and Digital Economy, adding that the association was committed to propagating its activities on digitisation."
  },
  {
    "headline": "Osinbajo to federal agencies: Fulfil your mandates by supporting Nigerians’ hustle",
    "summarized_story": "Yemi OsinbajoBy Johnbosco AgbakwuruVice President Yemi Osinbajo, yesterday, tasked federal government agencies with mandates to function in the business environment to fulfill their support roles of creating a conducive and enabling business environment for Nigerians engaged in different enterprises.\nProf. Osinbajo gave the charge during the Micro, Small and Medium Enterprises (MSME) Clinics Stakeholders’ review meeting at the Presidential Villa.\nThe stakeholders meeting was attended by heads and representatives of agencies including SMEDAN, Bank of Industry, BOI, NEXIM Bank of Agriculture, BOA, SON, FIRS, NAFDAC and others.\nHe said he was told that in some other close African nations, the same registration takes six weeks.\nMariam Katagun expressed her appreciation to the Vice President for his leadership role, and also praised the stakeholders and State governors for their collaboration and cooperation in holding MSME Clinics."
  },
  {
    "headline": "We’re not rubber stamp but cooperative with executive for national devt — Lawan",
    "summarized_story": "Senate President, Ahmad LawanSenate President, Ahmed Lawan has debunked the public perception of the 9th National Assembly as a rubber stamp of the executive.\nHe spoke at a lecture he tagged, “The Legislature, Legislative Mandate and The People- The Reality and The Public Perception,” organised by the National Institute for Legislative and Democratic Studies (NILDS).\nSenator Lawan tried to clear several misconceptions around the National Assembly and its operations, stating that the salaries of the members of the National Assembly as approved by the Revenue Mobilization, Allocation and Fiscal Commission (RMAFC) which is included in the budget allocated to the National Assembly.\nHe pointed out that the budget of the National Assembly since 1999 have never gone above N150 billion, which accounts for about 3% of the annual budget.\n“The purchase of operational vehicles for members of the National Assembly has received extensive media attention,” Sen Lawan noted."
  },
  {
    "headline": "Kwara, labour finally resolve minimum wage consequential adjustment",
    "summarized_story": "Kwara State Government and the organize labour under the auspices of Joint Negotiating council (JNC) Kwara State Council on Monday, concluded the issue of consequential adjustment on grade level 07 – 17 for the new minimum wage.\nSimilarly, a comprehensive agreement was signed by both parties for the implementation of the consequential adjustment to take effect without further delay.\nOthers at the meeting were the National Union of Pensioners, NUP, chairman, NULGE president , MHWUN chairman and National Association of Nigeria Nurses and Midwives, NANNM chairman.\nThis development has brought to an end, the issue of negotiation on the consequential adjustment of the minimum wage in kwara State.\n“The agreement and the signed table as agreed shall be made available for record and actions purposes as soon as possible,” the statement added."
  },
  {
    "headline": "UI emerges best varsity in NUC’s 2021 ranking",
    "summarized_story": "The National Universities Commission (NUC) has ranked the University of Ibadan (UI) first in its latest 2021 ranking released on Sunday.\nThe ranking, which was carried out using twelve indicators, involved 113 universities across Nigeria.\nThe institutions were ranked based on the google scholar index, the total number of full-time students, students and staff ratio, efficiency, the number of international students, and contribution to the knowledge economy.\nOther criteria include; percentage of Programmes with full-time accreditation, percentage of international staff, all citations per capita, amongst others.\nHe said, “You cannot get any form of ranking system in the whole wide world that does what Nigeria has done."
  },
  {
    "headline": "Buhari reacts as South African president, Ramaphosa tests positive to COVID-19",
    "summarized_story": "President Muhammadu Buhari has sent a get well message to his South African counterpart, Mr Cyril Ramaphosa, who tested positive for COVID-19.\nIn a statement by Garba Shehu, the Senior Special Assistant to the President on Media & Publicity, on Monday, President Buhari prayed for Ramaphosa’s speedy recovery.\nHe said, “My heart and prayers are with Mr Ramaphosa of South Africa at this difficult moment of health challenges, and I pray for his speedy and full recovery.\n“Mr Ramaphosa is a friend of Nigeria and an important partner in our joint continental efforts to tackle Africa’s social, economic and political difficulties.\n“The coronavirus pandemic is a reality and has no respect for persons.”President Buhari particularly reminded Nigerians “to disregard the allegation that the pandemic is a foreign creation to depopulate Africa and boost the financial interests of western pharmaceutical companies through vaccine production.”He warned that “lack of attention to medical advice and apathy are damaging to the government’s efforts to contain the spread of this deadly viral disease.”The President, therefore, advised Nigerians to come out fully and get vaccinated."
  },
  {
    "headline": "Wike sacks Commissioner for Health, Princewill Chike",
    "summarized_story": "Governor, Nyesom Wike of Rivers State on Monday announced the sack of his commissioner for Health Prof. Princewill Chike.\nThe commissioner was sacked because he accepted to host the preliminary session of Medical and Dental Council of Nigeria, MDCN, in Port Harcourt without the approval of the state government.\nThe Governor made the announcement when he received in audience the Medical and Dental Council of Nigeria, Prof. Abba Wasiri Hassan at the Government House, Port Harcourt.\nWike described the decision of the Commissioner as most embarrassing.\nEverybody knows that it is not my nature to bring people and you cannot attend to them or host."
  },
  {
    "headline": "Yuletide: FRSC to deploy 1,060 personnel in Bauchi",
    "summarized_story": "The Bauchi State Sector Command of the Federal Road Safety Corps (FRSC) on Monday revealed that it would deploy no fewer than 1,060 Special and Regular Marshals as well as medical personnel in the state between 17th December, 2021 to 15th January, 2022 to ensure an accident-free Yuletide.\nAccording to him, the personnel to be deployed were made up of 30 medical personnel, 300 Special Marshals and 730 regular Marshals.\n“Thirty medical personnel, 300 Special Marshals, 730 Regular Marshals are well equipped and combat ready for annual operation.\n“Five officers Marshals have already been posted to Fifteen LGAs of the state where FRSC formations are not available.\nAccording to him, the exercise would cover three major routes: Bauchi-Jos road; Bauchi-Maiduguri road and Bauchi-Gombe road."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "65% of NDDC projects in Akwa Ibom are fake’",
    "summarized_story": "The Civil Society Organisation (CSO) in Akwa Ibom State has alleged that over 65 per cent of contracts awarded by the Niger Delta Development Commission (NDDC) in the state in the last five years are fake and non-existent.\nHe listed non-existent of such projects in Akwa Ibom to include fake water project at Okosi community in Okobo Local Government, non-existent perimeter fencing at Model School, Ikot Oboroenyin village in Ikot Abasi Council Area and another road project at Urue Offong in Oruko Local Government.\nUdoh said that the fake projects were discovered when the CSO decided to track down the commission’s projects in the 2019 budget.\n“We are just coming from an independent tracking of 2019 approved budgeted projects and programmes of the commission in Akwa Ibom State.\nIt may interest you to note that of the 31 projects captured in the 2019 approved budget and tracked by us, about 65 per cent of them are non-existent."
  },
  {
    "headline": "Ikpeazu to present 2022 Appropriation Bill Tuesday",
    "summarized_story": "Abia State Governor Okezie Ikpeazu will today present the 2022 Appropriation Bill to the House of Assembly.\nA statement yesterday by the Chief Press Secretary (CPS), Mr. Onyebuchi Ememanka, said that the presentation was in line with the 1999 Constitution as amended.\nHe said the venue of the presentation will be the House of Assembly, while time is 1pm.\nGovernor Ikpeazu has said his administration has approved the release of over N3.2 billion to offset salary arrears of parastatals’ workers.\nInformation & Strategy Commissioner Dr. Eze Chikamnayo broke the news yesterday at the Government House in Umuahia while briefing reporters."
  },
  {
    "headline": "COVID-19 was not created to depopulate Africa, says Buhari",
    "summarized_story": "COVID-19 was not created to depopulate Africa, says BuhariBy Bolaji Ogundele, Frank Ikpefan, Moses Emorinken, Abuja, Segun Showunmi, Ibadan, and Adekunle Jimoh, IlorinPresident Muhammadu Buhari has urged Nigerians to disregard conspiracy theories claiming that the COVID-19 pandemic was created by foreign countries to depopulate Africa or to make money for Western pharmaceutical companies.\nPresident Buhari gave the warning in his ‘get well soon’ message to the South African President, Cyril Ramaphosa, who was recently diagnosed with the COVID-19 infection.\nNYSC: no COVID-19 vaccine card, no orientation next yearTheNational Youth Service Corps (NYSC) has made the presentation of COVID-19 vaccination card compulsory for prospective corps members to attend orientation exercise from next year.\nThe scheme said from the next year, incoming prospective corps members must show evidence of vaccination before they will be allowed into the camp for registration.\nNYSC Director-General Brig-Gen Shuaibu Ibrahim stated these in a nationwide virtual address to the 2021 Batch “C” Stream Two Corps Members and camp officials."
  },
  {
    "headline": "EFCC probes governor for withdrawing N60b",
    "summarized_story": "A North-Central governor is under probe for allegedly withdrawing N60 billion in cash in six years, Economic and Financial Crimes Commission (EFCC) Executive Chairman Abdulrasheed Bawa has confirmed.\nBawa’s disclosures were contained in an interview published in EFCC Alert, an in-house journal of the commission.\n“In one of them, a governor in a Northcentral state within the last six years (one individual) has withdrawn over N60 billion in cash.\nAll those sting operations that we carried out came as a result of a series of surveillance activities as well as intelligence and information gathered before we moved in.\n“I want to assure you that all of the sting operations that we carried out, we carried them out professionally, within the ambit of the law."
  },
  {
    "headline": "Kanu sues DSS over alleged violation of rights",
    "summarized_story": "From Godwin Tsa, AbujaDetained leader of the Indigenous Peoples of Biafra (IPOB), Nnamdi Kanu, has filed a fundamental human rights enforcement suit against the Department of State Service (DSS) at the Federal High Court, Abuja, over alleged gross violation of his constitutional rights.\nWhile lamenting that Kanu has neither been allowed to practice his religion nor change his cloth, despite a subsisting court order, Opara submitted that his client was undergoing persecution in the hands of the security outfit.\nJoined as respondents in the suit are DSS director general, the DSS and the attorney general of the federation.\nHe said Kanu alleged that his demand for the security agency to grant him access to his medical record was repeatedly refused.\n“The respondents prevented the applicant from having access to a medical practitioner and legal practitioner of his choice."
  },
  {
    "headline": "Kanu drags DSS to court over alleged violation of rights",
    "summarized_story": "From Godwin Tsa, AbujaThe detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, has filed a fundamental human rights enforcement suit against the Department of State Service (DSS) before the Federal High Court in Abuja, over alleged gross violation of his constitutional rights.\nWhile lamenting that Kanu has neither been allowed to practice his religion nor change his cloth, despite a subsisting court order, Opara submitted that his client is undergoing persecution in the hands of the security outfit.\nJoined as Respondents in the suit are the Director General of the DSS, the DSS and the Attorney-General of the Federation.\nHe said that Kanu alleged that his demand for the security agency to grant him access to his medical record, was repeatedly refused.\n“The Respondents prevented the Applicant from having access to a medical practitioner and legal practitioner of his choice."
  },
  {
    "headline": "BREAKING: Gunmen attack Police Headquarters in Abia, kill Inspector",
    "summarized_story": "From Okey Sampson, UmuahiaGunmen in their numbers in the early hours of today attacked the headquarters of Abia State Police command in Umuahia the state capital, killing an Inspector of police.\nThe victim according to a reliable information was said to be one of the policemen on guard duty on the road in front of the headquarters.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe PPRO of Abia State Police Command, SP Geoffrey Ogbonna said he was yet to be briefed on the development.\nClick Here to Apply ."
  },
  {
    "headline": "Family of 6 escape death as truck falls on car in Abia",
    "summarized_story": "From Okey Sampson, UmuahiaIt was a miraculous escape for a family of six as a petroleum tanker fell on top of their car in Aba, Abia state.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“It was miraculous that the whole family survived the accident, not to talk of coming out of their can unscathed; it an only be God.\n“Some of us who watched the tanker on the car, thought all the family members had died, only to find out that before we could come for their rescue, they had come out of the car unaided.\nThe incident was said to have caused hours of serious gridlock on the ever-busy Aba/Owerri Road."
  },
  {
    "headline": "Omicron: FG bans flights from UK, Canada, Saudi, others",
    "summarized_story": "The countries affected are Saudi Arabia, the United Kingdom, Canada and Argentina.\nSo, Air Peace wanted to be going into the UAE three times a week.\nNow, we are giving them 21 frequencies from our agreement, they ought to give us 21.\nSo, what they’re supposed to do is to give Air Peace 21.\nHe said the Government of the United Kingdom proposed sticking to its standard background lines on whether a particular country will put the United Kingdom on the red list and avoid getting into hypothetical situations."
  },
  {
    "headline": "News in Photographs: Tambuwal Visits State House, Briefs Buhari on Security Situation in Sokoto",
    "summarized_story": "Sokoto State Governor Aminu Tambuwal was at the State House Monday night to brief President Muhammadu Buhari on the security situation in some parts of Sokoto State.\nThe governor’s visit to the State House came on the heels of the visit by a presidential delegation to Sokoto led by National Security Adviser, Maj General Babagana Munguno (rtd) following the gruesome killing of 23 travellers by bandits in the states.\nThe meeting between President Buhari and Governor Tambuwal held behind closed doors Monday night was expected to address the issues raised by the governor.\nSee photos.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "In Retaliatory Move, UAE Stops International Airlines from Flying Nigerian Passengers to Dubai",
    "summarized_story": "Chinedu EzeInternational carriers operating into Nigeria have confirmed a directive from United Arab Emirates that they should not airlift Nigerian travellers to Dubai.\nTHISDAY learnt that airlines had started rejecting Nigerian passengers going to Dubai, including Ethiopian Airlines, Turkish Air and others, which airlift Nigerian via their operational hubs to Dubai.\nThe airlines it was gathered insisted that they had been directed not to airlift Nigerian passport holders to Dubai.\nThis is effective today, 13th December, 2021.”A source close to Ethiopian Airlines confirmed to THISDAY, “Today they have to offload Dubai passengers.\nSo no airline wants to carry Nigerian passengers to Dubai."
  },
  {
    "headline": "Buhari Never Promised Tinubu Running Mate, His Boys Fire Back at Akande",
    "summarized_story": "‘How could he be talking of a running mate when he had not secured the ticket?\n“He said it was from this list that Buhari would choose a running mate.\n‘General, where are you choosing your running mate from?’ He answered, ‘The South-west.’ ‘Oh!\n‘If indeed you promised to make Asiwaju your running mate, it would not be fair to renege,’ he said.\n“We were registered in July 2013, and he called me to prevail on Tinubu to be his running mate in April 2014."
  },
  {
    "headline": "Ayu: There’ll Be No APC by April 2023",
    "summarized_story": "Ayu reiterated that PDP would win at least 25 of the states in the 2023 governorship polls.\nA statement from Ayu’s media office said, “By March/April 2023, there will be no APC in Nigeria.\nAyu disclosed that it was actually Mark, who advised him to go for the PDP national chairmanship.\nThe governor extolled Ayu’s vast political experience, but reminded him of the enormous task ahead to rescue Nigeria from the APC federal government in 2023.\nTherefore, the battle to rescue Nigeria, the battle to change leadership in 2023 is on you."
  },
  {
    "headline": "NFF Sacks Rohr, Names Eguavoen Interim Super Eagles Technical Adviser",
    "summarized_story": "The Nigeria Football Federation (NFF) has appointed Augustine Eguavoen, currently its Technical Director, as the Technical Adviser of the Super Eagles on an interim basis.\nThe statement said the decision to sack Rohr and appoint Eguavoen on an interim basis was taken during a virtual meeting of the NFF Executive Committee on Sunday.\nOlajire quoted General Secretary of the NFF Mohammed Sanusi as saying that the relationship between the NFF and Mr Rohr had come to an end.\n“We thank him for his services to the Super Eagles and Nigeria.\nHe was on-field captain when the Super Eagles lifted the Africa Cup for the first time on away ground, in Tunisia 27 years ago."
  },
  {
    "headline": "Breaking: Nigerian Government Bans Unvaccinated Corps Members From Camps Nationwide",
    "summarized_story": "The National Youth Service Corps (NYSC) says it will henceforth bar unvaccinated corps members from its camps nationwide.\nThis was made known on Monday by the Director-General of the scheme, Brigadier General Shuaibu Ibrahim.\nHe noted that the measure will take effect from the next orientation camp, which is a few weeks from now.\nWhile addressing the 2021 Batch “C” Stream Two corps members and camp officials, he said prospective corps members will now need to show evidence of vaccination from coronavirus before they would be allowed to register.\nlbrahim warned corps members to avoid embarking on night and unauthorised journeys, adding that they should break any journey extending beyond 6:00 pm and pass the night in a safe place."
  },
  {
    "headline": "Breaking: Nigerian Government Bans Unvaccinated Corps Members From Camps Nationwide",
    "summarized_story": "The National Youth Service Corps (NYSC) says it will henceforth bar unvaccinated corps members from its camps nationwide.\nThis was made known on Monday by the Director-General of the scheme, Brigadier General Shuaibu Ibrahim.\nHe noted that the measure will take effect from the next orientation camp, which is a few weeks from now.\nWhile addressing the 2021 Batch “C” Stream Two corps members and camp officials, he said prospective corps members will now need to show evidence of vaccination from coronavirus before they would be allowed to register.\nlbrahim warned corps members to avoid embarking on night and unauthorised journeys, adding that they should break any journey extending beyond 6:00 pm and pass the night in a safe place."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Government To Place UK, Canada, Saudi Arabia On COVID-19 Red List, Stop Airlines From Flying Into Country",
    "summarized_story": "The Nigerian Government has stated that it will place the United Kingdom, Canada and Saudi Arabia on a red list over the outbreak and spread of Coronavirus' Omicron variant.\nSirika said, “There is also a case of Saudi Arabia that put Nigeria on the ban list; Canada.\n“We have given our input that it is not acceptable by us and we recommend that those countries – Canada, UK, Saudi Arabia and Argentina – be also put on the red list.\n\"Once they are on the red list, which means they are banned, their airlines will also be banned.\nThe British High Commission had also last Sunday said it would stop issuing visitor visa applications from all red list countries including Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Government To Place UK, Canada, Saudi Arabia On COVID-19 Red List, Stop Airlines From Flying Into Country",
    "summarized_story": "The Nigerian Government has stated that it will place the United Kingdom, Canada and Saudi Arabia on a red list over the outbreak and spread of Coronavirus' Omicron variant.\nSirika said, “There is also a case of Saudi Arabia that put Nigeria on the ban list; Canada.\n“We have given our input that it is not acceptable by us and we recommend that those countries – Canada, UK, Saudi Arabia and Argentina – be also put on the red list.\n\"Once they are on the red list, which means they are banned, their airlines will also be banned.\nThe British High Commission had also last Sunday said it would stop issuing visitor visa applications from all red list countries including Nigeria."
  },
  {
    "headline": "Premier League Matches Under Threat As Clubs Record 42 Postive Covid-19 Tests In One Week",
    "summarized_story": "The Premier League has confirmed that 42 players and staff have tested positive for Covid-19, the highest ever figure for a week period.\nIn a statement the league confirmed the figures; The League can today confirm that between Monday, 6 December and Sunday, 12 December 3,805 players and club staff were tested for COVID-19.\n“The League can today confirm that between Monday 6 December and Sunday 12 December 3,805 players and club staff were tested for COVID-19.\nIn all likelihood this could lead to a number of games being called off during the busy festive season for Premier League sides.\nBBC also reports Brighton, Tottenham, Leicester, Manchester United, Aston Villa and Norwich have all confirmed cases, with United's game at Brentford in doubt."
  },
  {
    "headline": "MTN, Mafab win Nigeria 5G licences",
    "summarized_story": "MTN Nigeria and Mafab Communications Limited have been awarded the slots for the 5G spectrum in the auction by the Nigerian Communications Commission (NCC).\nAdvertisementMTN is a telco giant in Nigeria, while Mafab Communications Ltd. was incorporated in 2020 and licensed by the Nigerian Telecommunications commission to provide and operate Local Interconnect and International carrier services.\nThree qualified bidders for the 3.5 GHz spectrum, namely: MTN Nigeria, Mafab Communications Ltd, and Airtel Networks Ltd, participated in the software-based simulated auction exercise.\nAt the assignment stage, MTN offered $15,900,00 and was assigned lot one, while Mafab offered $11,120,000 and awarded slot two at no extra cost.\nAdvertisementTheCable understands that the first slot (spectrum) is 3500-3600mhz while the second slot is 3700-3800mhz."
  },
  {
    "headline": "MTN, Mafab win Nigeria 5G licences",
    "summarized_story": "MTN Nigeria and Mafab Communications Limited have been awarded the slots for the 5G spectrum in the auction by the Nigerian Communications Commission (NCC).\nAdvertisementMTN is a telco giant in Nigeria, while Mafab Communications Ltd. was incorporated in 2020 and licensed by the Nigerian Telecommunications commission to provide and operate Local Interconnect and International carrier services.\nThree qualified bidders for the 3.5 GHz spectrum, namely: MTN Nigeria, Mafab Communications Ltd, and Airtel Networks Ltd, participated in the software-based simulated auction exercise.\nAt the assignment stage, MTN offered $15,900,00 and was assigned lot one, while Mafab offered $11,120,000 and awarded slot two at no extra cost.\nAdvertisementTheCable understands that the first slot (spectrum) is 3500-3600mhz while the second slot is 3700-3800mhz."
  },
  {
    "headline": "Omicron: We've initiated steps to make countries reverse travel ban, says FG",
    "summarized_story": "The presidential steering committee (PSC) on COVID-19 says it has initiated diplomatic steps to make countries that placed travel restrictions on Nigerians reverse their decision.\nSaudi Arabia had also imposed a temporary ban on flights from Nigeria while Canada banned travel from Nigeria and nine other African countries over Omicron variant concerns.\n​”The PSC is working with mandate ministries to address the issues surrounding the restriction imposed by some countries on travelers from Nigeria on account of the Omicron variant.\nWhile each country is entitled to put in place measures to protect its citizens, Nigeria has similar responsibilities.\nAdvertisement“However, based on existing relationships, Nigeria has initiated diplomatic steps to make these countries reverse their course."
  },
  {
    "headline": "Omicron: We've initiated steps to make countries reverse travel ban, says FG",
    "summarized_story": "The presidential steering committee (PSC) on COVID-19 says it has initiated diplomatic steps to make countries that placed travel restrictions on Nigerians reverse their decision.\nSaudi Arabia had also imposed a temporary ban on flights from Nigeria while Canada banned travel from Nigeria and nine other African countries over Omicron variant concerns.\n​”The PSC is working with mandate ministries to address the issues surrounding the restriction imposed by some countries on travelers from Nigeria on account of the Omicron variant.\nWhile each country is entitled to put in place measures to protect its citizens, Nigeria has similar responsibilities.\nAdvertisement“However, based on existing relationships, Nigeria has initiated diplomatic steps to make these countries reverse their course."
  },
  {
    "headline": "JUST IN: One bidder drops out as 5G spectrum price crosses $275m at round 11",
    "summarized_story": "One of the three bidders has dropped out of the bidding processes as the 5G spectrum reached $275,904,886.25 at round 11.\nIn the first round of the auction, the current price per lot stood at $199,374,000 from the reserve price of $197,400,00.\nAdvertisementIn the second round, the price rose to $1,993,740, reaching $201,367,740, and increased to $204,388,256.10 in the third round.\nIt rose to $209,497,962.50 at the fourth round, the fifth round at $215,782,901.38, the sixth round at $224,414,217.43, while that of the seventh round stood at $231,146,643.96.\nFor the 10th round, the price per lot stood at $263,017,050,77, while the price per lot for the 11th and last round of bidding stood at 275,904,886.25."
  },
  {
    "headline": "Can Kenya get out of the supply chain crisis?",
    "summarized_story": "A global meltdownOn a global level, the supply chain meltdown began with a container shortage that cropped up at the end of 2020, with freight rates rising higher than 264%, compared to previous years.\nAt this point, global supply chains were already out of balance, and demand for exports exceeded the supply of shipping containers.\nWhile the flower industry is rebounding and trucks are moving more freely, the temporary dismemberment of the supply chain industry may continue to have knock-on effects on businesses in the East African economy.\nReliability is keyKenya’s potential supply chain crisis and its impact can be mitigated.\nWithout it, it may be years before we see supply chain issues corrected and an environment for freer trade realised."
  },
  {
    "headline": "How African startups can build multi-million dollar deals",
    "summarized_story": "One of the biggest acquisition deals of 2021 is MFS Africa’s deal with Capricorn.\nWhile the amount is undisclosed, both parties confirmed that the deal is Nigeria’s “second-largest” fintech acquisition deal, second only to Paystack’s $200 million acquisition deal with Stripe.\nBig deals start out smallFor Dare Okoudjou—who has led MFS Africa’s growth in 35 African countries—big deals and acquisitions don’t always start out as big deals.\nPrior to Capricorn, MFS Africa had acquired two other companies.\nIn 2016, MFS Africa acquired Sochitel—a company that specialised in international airtime transfers into Africa—and the acquisition, according to MFS Africa, helped create the largest transfer payment network which focuses on Africa."
  },
  {
    "headline": "Kwara raises a $4m seed to build Africa’s first credit union-powered neobank",
    "summarized_story": "The company is reportedly growing its credit union customer base by 40% month-on-month, and the listed credit unions are growing their membership by 19% and their loan base by 46%, annually.\nThough it’s reported to be courting some credit union clients in South Africa and the Philippines, which, according to the CEO, validates their solution across multiple markets.\nDue to that, it’s launching a new bank that will be powered by its existing credit unions.\nAlso, any unbanked individual can easily join a credit union and then enjoy the whole banking benefits.\n“Kwara’s unique approach is a catalyst for a new way of retail banking through digital-first credit unions."
  },
  {
    "headline": "Nigeria's GIGM adds bills payment and e-wallet features to its app",
    "summarized_story": "GIG Mobility (GIGM, formerly GIG Motors), a Nigeria-based mobility giant, this week launched electronic wallet and bills payment features on its app, as the company looks to expand its offerings beyond road mobility.\nWith the launch of the e-wallet and payments features, GIGM will be competing in a space where a plethora of fintech apps already operate.\nHence payments and e-wallet are the first of many non-core mobility features that the company intends to offer.\nAsked what other non-mobility solutions GIGM plans to launch soon, Odum said GIGM will continue to explore new offerings for its users.\n“Today it’s bills payment, tomorrow it could be a crowdfunding-based investment platform or a crypto wallet.”If you enjoyed reading this article, please share it in your WhatsApp groups and Telegram channels."
  },
  {
    "headline": "MTN Nigeria, Mafab pay $546m to get 5G licence",
    "summarized_story": "In one night, Nigeria raised half a billion dollars as MTN Nigeria plc and Mafab Communications Limited on Monday paid $273,600 million each to acquire a 3.5GHz band licence for the deployment of 5G network in the country.\nThe 5G network is expected to help achieve much lower latency, higher bandwidth, greater device density, longer battery life for nodes and greater network flexibility.\nIsa Pantami, minister of communication and digital economy, speaking during the event, said the 5G network would serve as a catalyst for the successful implementation of the National Digital Economy Development and Strategy (NDEPS) for a Digital Nigeria, and also support the implementation of the National Broadband Plan.\nHe said the full socio- economic benefits of 5G technology are largely dependent on access to a variety of spectrum resources.\n“It is indeed a memorable milestone that Nigeria is set to auction Spectrum in the 3.5GHz for the deployment of 5G at this material time,” he said."
  },
  {
    "headline": "Covid-19: Omicron pushes Nigeria’s average cases up 451%",
    "summarized_story": "From a daily average of 74 cases seen in the first week of December, Nigeria’s current Covid-19 cases have shot up by 451 percent to an average of 408, in a bout of infections driven by the latest Omicron variant.\nA total of 2,859 cases were confirmed in the week ended December 12, compared with 520 in the preceding week.\nNigeria now has 217, 481 cases confirmed and 2, 981 deaths recorded across the federation.\nNigeria recorded its first three cases of omicron on December 1, days after it was first discovered in South Africa and has entered a travell ban tussle with some countries.\nRead also: Lagos records more than half of Saturday’s 612 COVID-19 infections, continues to top chartHowever, clinical data on its severity remains limited."
  },
  {
    "headline": "What MTN’s public offer holds for retail investors",
    "summarized_story": "With MTN’s move to sell 90 percent of its public offer of 575 million shares in Nigeria to retail investors, the telco giant is allowing individual investors to have a stake in one of the country’s most profitable businesses at an attractive entry price.\nRead also: Public Offer: MTN is no longer foreign, it is Nigerian – shareholders associationMTN Nigeria’s public offer, which is the first to be delivered digitally in Nigeria, is being sold to retail investors at N169 per share.\nInvestment analysts have been stressing that the MTN public offer of 575 million shares is a “Good Buy” for investors seeking higher returns – in form of capital appreciation and dividend yield.\nResearch analysts at Coronation Asset Management believe MTN Nigeria’s offer represents excellent value for investors.\nAccording to these market analysts, the public offer will improve the liquidity of MTN shares on Nigerian Exchange Limited because it will be held by diverse investors."
  },
  {
    "headline": "Edo NEWMAP to leverage tech in waste management, test runs new app – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Erosion and Watershed Management Project in Edo State (Edo NEWMAP) is test running a plastic redemption application to assist in dealing with the threat posed by plastic waste clogging stormwater drains and natural moats.\nThe State Coordinator of Edo NEWMAP, Dr. Tom Obaseki, who revealed this at a one-day workshop on ‘Advancing Sustainable Plastic Waste Management in our Cities,’ said that the greatest threat to the sustainability and integrity of the functionality of NEWMAP infrastructure in the state is waste, particularly, plastic clogging the newly constructed stormwater drains and underground conduits.\nThe workshop is organized by the Circular Economy Club (CEC) of Abuja and Benin City, in partnership with Edo NEWMAP.\nPresenting the mobile application to key stakeholders, the Edo NEWMAP Coordinator explained that, when fully deployed, the plastic redemption scheme technology will help safeguard and make functional stormwater infrastructure provided by the government, while at the same time presenting opportunities for interested persons to make money from disposing of plastic waste.\nParticipants at the event include Chairman, Technical Steering Committee of Edo NEWMAP, Mr. Lucky Wasa, who is also the Permanent Secretary, Ministry of Environment and Sustainability; Managing Director, Edo State Investment and Promotion Office (ESIPO), Mr. Kelvin Uwaibi; General Manager, Edo State Waste Management Board, Mr. Charles Imarhiagbe and the Chief Executive Officer, Natural Eco Capital, Dr. Eugene Itua, among others."
  },
  {
    "headline": "Shippers Council Deteriorating, Due To New Boss Uncare Attitude-MWUN – Nigerian Observer",
    "summarized_story": "Hassan Bello, the immediate ES/CEO of the Council retired from service.\nAdeyanju said: “This development explains the issue I am raising about the new man at the Shippers’ Council who is not meeting with stakeholders.\n“We, however, wrote to the new man at the Shippers’ Council over the incident, but no response.\nI am talking about Alhaji Hassan Bello the former Executive Secretary, Nigeria Shippers’ Council.\n“To us at MWUN we don’t know if the Executive Secretary of Nigerian Shippers’ Council has been changed, all we know is that Hassan Bello is on leave and that is my word."
  },
  {
    "headline": "Edo explores opportunities in fashion industry, opens booth for designers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, through the state’s skills development agency, Edojobs has launched a fashion and style corner to aggregate designers and other lovers of fashion in the state.\nThe fashion booth was set up by the state government, in collaboration with GIZ’s Skills Development for Youth Employment (SKYE) programme, to create job opportunities for the state’s teeming youth population and tap into the huge opportunities in the fashion and design sector.\nA director in Edojobs, Mr. Omole Niyi, who performed the inauguration at the Edo Innovation Hub, said the booth was a platform to gather, train and empower youths interested in garment production.\nWe have a garment production factory where youths who are interested in fashion can come in and learn.\nWe expect that after six months, the trainees should be able to make garments and earn money for themselves.”..."
  },
  {
    "headline": "Benin Monarch Receives Deed of Transfer of Returnd Artifacts As he marks 5th Coronation Anniversary – Nigerian Observer",
    "summarized_story": "The Oba, however, commended President Muhammadu Buhari, for directing the return of the recently retrieved Benin artifacts to the rightful place, adding that many of the artefacts transcend mere art and are objects of religious significance to the Benin Kingdom.\n“I am happy to welcome you all to the 5th anniversary of my ascension to the throne of my forefathers as the 40th Oba of Benin in a continuous dynasty which dates back to 1170.\n“The celebration of this my 5th coronation anniversary coincides with a major event.\nToday (yesterday) we have in our midst the Nigeria High Commissioner to the United Kingdom, Ambassador Sarafa Tunji Isola.\n“I am here With the support of my ancestral, to sign the relevant Deed of Transfer on behalf of my people."
  },
  {
    "headline": "Nigeria’s green bond market rises above N55bn mark",
    "summarized_story": "Popoola said Sub-Saharan Africa is the least responsible for global climate change but remains one of the most vulnerable to the risk posed by climate change.\n“The second tranche, N15 billion ($36.1 million) 14.5 per cent 7-year Green Bond was issued in June 2019and was over-subscribed.\nThe sovereign issuance paved way for corporate green bond market to emerge with N15 billion ($36.1 million) 15.5 per cent 5-year Fixed Rate Senior Unsecured Green Bond by Access Bank and N8.5 billion ($20.5 million) 15.6 per cent 15-year Guaranteed Fixed Rate Senior Green Infrastructure Bond by North South Power Company.\nThese follow-on issuances have further increased investible instruments and deepened the Nigerian Green Bond market.\nIt is noteworthy that the size of the Green Bond market is currently N55.52 billion ($133.8 million),” Popoola said."
  },
  {
    "headline": "Abuja Electricity names new board, interim management",
    "summarized_story": "The Abuja Electricity Distribution Company (AEDC) has named a new board and interim management.\nThe statement said the new board and interim management is led by Chairman of UBA Pensions and Non-Executive Director of African Finance Corporation (AFC), Victor Osadolor who is to serve as Chairman.\nAlso named in the board is Alex Okoh, currently the Director-General of the Bureau of Public Enterprises (BPE).\nThe Interim Management, according to the statement, is led by Bada Akinwumi, who will serve as the Interim Managing Director.\nOther members of the interim management are: Sani Usman, Interim Chief Business Officer; Babajide Ibironke, Interim Chief Finance Officer; Donald Etim, Interim Chief Marketing Officer; and Femi Zacheus Interim Chief Technical Officer."
  },
  {
    "headline": "US state of Kentucky devastated by night of tornadoes, more than 100 likely dead",
    "summarized_story": "Kentucky Governor Andy Beshear said the collection of tornadoes was the most destructive in the state’s history.\n“It’s very likely going to be over 100 people lost here in Kentucky.”Beshear said 189 National Guard personnel have been deployed to assist with the recovery.\nThe rescue efforts will focus in large part on Mayfield, home to some 10,000 people in the southwestern corner of the state where it converges with Illinois, Missouri and Arkansas.\nSaying the disaster was likely one of the largest tornado outbreaks in U.S. history, President Joe Biden on Saturday approved an emergency declaration for Kentucky.\nHe told reporters he would be asking the Environmental Protection Agency to examine what role climate change may have played in fuelling the storms, and he raised questions about the tornado warning systems."
  },
  {
    "headline": "UAE bars all airlines from bringing Nigerians into the country",
    "summarized_story": "The United Arab Emirates (UAE) has barred all airlines from conveying Nigerian passengers to the country as the diplomatic row between the two nations deepens.\nAmong these airlines are Egypt Air, Air France, KLM, Ethiopian Airlines, Rwanda Air, Etihad.\nOn Monday, many Nigerian passengers who board Ethiopian Airlines heading for Dubai were sent off the plane.\nA source told Daily Trust that the de-boarding of Nigerian passengers was on the order of the UAE authorities.\n“UAE says no entry for Nigerian passengers from any airline."
  },
  {
    "headline": "Wike A True Defender Of Democracy, Says CUPP",
    "summarized_story": "The Coalition of United Political Parties (CUPP) has described River State governor, Nyesom Wike, as a great apostle and true defender of democracy, urging other politicians to emulate him.\nThe CUPP spokesman, Ikenga Ugochinyere, in a birthday message said Governor Wike as a true soldier of democracy has won many political fights that have helped reshape democracy in Nigeria.\n“At great personal risk, you have proven to be a great apostle, defender, and unconquerable guard for our democracy.\nADVERTISEMENT“You have won many judicial and political fights that have reshaped our constitutional, electoral and economic order.\nYou are a true federalist and champion of true fiscal federalism,” he stated."
  },
  {
    "headline": "Wike A True Defender Of Democracy, Says CUPP",
    "summarized_story": "The Coalition of United Political Parties (CUPP) has described River State governor, Nyesom Wike, as a great apostle and true defender of democracy, urging other politicians to emulate him.\nThe CUPP spokesman, Ikenga Ugochinyere, in a birthday message said Governor Wike as a true soldier of democracy has won many political fights that have helped reshape democracy in Nigeria.\n“At great personal risk, you have proven to be a great apostle, defender, and unconquerable guard for our democracy.\nADVERTISEMENT“You have won many judicial and political fights that have reshaped our constitutional, electoral and economic order.\nYou are a true federalist and champion of true fiscal federalism,” he stated."
  },
  {
    "headline": "Travel Ban: UK, UAE, Canada To Know Fate Next Week",
    "summarized_story": "The federal government of Nigeria is yet to ban travelers from the United Kingdom (UK), United Arab Emirates (UAE) and Canada after the countries banned flights from Nigeria as a result of Omicron variant of COVID-19.\nRecall that there were media reports that the federal government was going to retaliate the ban from the three countries.\nThe report had quoted the minister of Aviation, Hadi Sirika, as saying that the decision to ban these countries in retaliation would be made by the Presidential Steering Committee (PSC) on COVID-19 latest by Tuesday.\nThis is on-going in the interest of all parties concerned and we expect that positive results would emerge within the next one week.\nOnce they are put on the red list, which means they are banned, of course, their airlines will be banned."
  },
  {
    "headline": "Travel Ban: UK, UAE, Canada To Know Fate Next Week",
    "summarized_story": "The federal government of Nigeria is yet to ban travelers from the United Kingdom (UK), United Arab Emirates (UAE) and Canada after the countries banned flights from Nigeria as a result of Omicron variant of COVID-19.\nRecall that there were media reports that the federal government was going to retaliate the ban from the three countries.\nThe report had quoted the minister of Aviation, Hadi Sirika, as saying that the decision to ban these countries in retaliation would be made by the Presidential Steering Committee (PSC) on COVID-19 latest by Tuesday.\nThis is on-going in the interest of all parties concerned and we expect that positive results would emerge within the next one week.\nOnce they are put on the red list, which means they are banned, of course, their airlines will be banned."
  },
  {
    "headline": "NBSDI Beneficiaries Commend SMEDAN, Seek Soft Loans",
    "summarized_story": "Beneficiaries of the National Business Skills Development Initiative (NBSDI) under the Small and Medium Enterprise Development Agency of Nigeria (SMEDAN) across the country have commended the agency for the initiative.\nIn their separate reactions, beneficiaries commended the federal government for such a painstaking programme geared towards capacity building, skills acquisition, financial empowerment and job creation in the country.\nThe commendations were conveyed through the spokepersons of the beneficiaries across the six geopolitical zones of the country.\nThey, however, begged the federal government through SMEDAN to provide capital N500,000 and above to enable them rent shops and buy raw materials needed for their work.\nLEADERSHIP reports that the National Business Skills Development Initiative (NBSDI) is an initiative of the federal government through SMEDAN as an agency of government that is geared towards capacity building, skill acquisition, job creation and financial/mental empowerment of beneficiaries."
  },
  {
    "headline": "Gunmen invade Plateau community, kill 9, injure 4",
    "summarized_story": "By Polycarp AutaGunmen have killed nine people and injured four others in an attack on the Pinau community in Wase Local Government Area of Plateau state.\nASP Ubah Ogaba, the Public Relations Officer (PPRO) of Plateau Police Command said that the incident occurred on Sunday evening.\nHe noted that security agencies quickly mobilised to the scene and arrested eight suspects and recovered 12 motorcycles.\n“Yesterday, at about 4:30 p.m., we received a distress call that yet-to-be-identified gunmen invaded Pinau Village in Wase local government area.\nOgaba said that security has been beefed up in the area to prevent escalation of violence and break down of law and order."
  },
  {
    "headline": "Buhari commissions Kano-Maiduguri road",
    "summarized_story": "President Muhammadu Buhari on Monday commissioned Section II of Kano-Maiduguri Road connecting Jigawa and Bauchi States.\nThe 142.2 kilometres dualized road brings to five the number of roads commissioned across the country in the Season of Completion and Impact which began 18 days ago.\nIn his address at the event, Buhari, who was represented by the Minister of Water Resources, Engr.\nBuhari paid tribute to the patriotism of the Nigerians who participated directly or indirectly in the construction of the roads.\nFashola, who was represented at the event by the Permanent Secretary in the Ministry, Mr Babangida Hussaini, said the road projects represented a major investment in road transport infrastructure."
  },
  {
    "headline": "BREAKING: Rivers Governor, Wike Sacks Health Commissioner, Professor Chike For Hosting Event Without His Knowledge",
    "summarized_story": "Professor Princewill Chike, the state Commissioner for Health, has been fired by Rivers State Governor Nyesom Wike.\nThe commissioner was fired for failing to obtain consent from the state government to host the preliminary session of the Medical and Dental Council of Nigeria, MDCN, in Port Harcourt, the state capital.\nWike also said the request by the MDCN that state governors should establish one tertiary hospital in each of their senatorial districts will not be realisable due to the paucity of funds.\n“You have talked about siting tertiary hospital in each of the senatorial districts, you know it is not possible.\nWhere will you get the money to site this in each of the senatorial districts,” he said."
  },
  {
    "headline": "Journalist Fisayo Soyombo Held Over Story Exposing Police Corruption In Nigeria",
    "summarized_story": "The Nigerian Police Force detained Fisayo Soyombo, the founder and editor-in-chief of the Foundation for Investigative Journalism, on Monday (FIJ).\nOn Monday, Mr Soyombo accepted an invitation to be interrogated by the head of the force’s IGP monitoring section.\nIf there is no update on this handle by dusk, it means I have been unjustly detained,” Mr Soyombo tweeted.\nAccording to his organization’s claim, Mr. Soyombo has been jailed since then.\nMr Soyombo’s paper stated in a Monday night statement that he had been called after a plea by a group of attorneys defending the police against FIJ-uncovered corruption."
  },
  {
    "headline": "President Buhari Should Resign Or Be Impeached – HURIWA",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has called for President Muhammadu Buhari to resign or be impeached by the National Assembly as a result of the country’s recent insecurity.\nAccording to HURIWA, Buhari has demonstrated that he lacks the ability to safeguard Nigerians.\nThe rights group made the remark while throwing its weight behind Daily Trust Newspaper’s opinion that life in Nigeria has lost meaning under the Buhari administration.\nIn a statement by its National Coordinator, Emmanuel Onwubiko, HURIWA lamented that the leadership of the National Assembly is so incompetent and compromised that it may take extraordinary measures to get them to follow the constitution and impeach Buhari.\n“It is shocking that President Buhari does not know that the unprecedented violence unleashed on Nigerians are so unique that not even in war-ravaged Yemen or Afghanistan do you see armed Non State actors kidnapping citizens and setting travellers on fire”."
  },
  {
    "headline": "Falana Petitions Police Over Kemi Olunloyo’s Comments On Sylvester Oromoni Death",
    "summarized_story": "Mr Femi Falana, a human rights lawyer and Senior Advocate of Nigeria, has filed a petition against Ms Kemi Olunloyo, an internet blogger, for comments she allegedly made about the death of his client, late Sylvester Oromoni, 12, who was beaten to death by some students at Dowen College in Lekki, Lagos.\nThe petition was filed on behalf of the family by the chambers of Femi Falana, SAN.\nIn the petition sent to the police and other security agencies, the family called for an investigation to be conducted regarding Olunloyo’s claim that their son was a cult member among others.\nA source said the family was peeved that the blogger levelled such an allegation against their son.\nRecall that the Oromoni Family alleged that their son was beaten to a stupor by some students in the school hostel and he eventually died for refusing to join a cult group."
  },
  {
    "headline": "Breaking: Like Imo, gunmen invade Abia Police headquarters, 1 feared dead",
    "summarized_story": "Gunmen in the early hours of Monday launched attack on Abia Police headquarters located in Umuahia.\nThough police authorities are yet to confirm the attack, eyewitness said the attackers killed a policeman while operatives on duty made spirited efforts to repel the attack.\nSimilar was witnessed few months ago when gunmen attacked Imo Police headquarters in Owerri.\nThey also set free many inmates from Imo state custodial centre in Owerri on the same day.\nDetails loading…"
  },
  {
    "headline": "Breaking: Fresh 2021 UEFA Champions League last 16 draw completed, Manchester United dodge PSG, Chukwueze’s Villarreal face Juventus",
    "summarized_story": "Manchester United will play Atletico Madrid in the Champions League last 16 after the draw for the knockout stages took place for a second time.\nSpanish club, Villarreal where Nigeria’s Samuel Chukwueze is playing his trade will face Italia Seria A giants Juventus.\nHolders Chelsea face Ligue 1 champions Lille and Premier League champions Manchester City come up against Portugal’s Sporting Lisbon.\nSix-time winners Liverpool play three-time winners Inter Milan.\nChampions League last-16 draw:Red Bull Salzburg v Bayern MunichSporting Lisbon v Manchester CityBenfica v AjaxChelsea v LilleAtletico Madrid v Manchester UnitedVillarreal v JuventusInter Milan v LiverpoolPSG v Real Madrid"
  },
  {
    "headline": "Breaking: Keep off NYSC facilities if you are not vaccinated, DG warns corp members",
    "summarized_story": "The National Youth Service Corps (NYSC) has warned that only candidates with valid vaccination profile would be allowed into the camps for programme.\nThe NYSC authorities also warned those yet to carry out the exercise to keep off its facilities nationwide.\nThe military head of NYSC also warned against making night and unauthorised journeys, urging corp members to pass the night at designated places anytime their journeys extend beyond 6:00 pm.\n“We have NYSC Corps Lodges, Secretariats, and Army barracks, find out where they are and make sure you pass the night there for journeys that will take you beyond six to get to your destination,” Ibrahim said.\nThe DG urged the corps members to take advantage of the two weeks break after leaving the Orientation Camp learn new skills that will make them self reliant, rather than embark on frivolous journeys."
  },
  {
    "headline": "COVID-19 Red List: Nigeria Has Initiated Steps To Overturn Decision – FG",
    "summarized_story": "﻿Nigeria has initiated diplomatic steps to reverse the country’s inclusion into a red list by some nations.\nThe Minister of Aviation, Hadi Sirika, who represented the Chairman of the Presidential Steering Committee (PSC) on COVID-19, Boss Mustapha, stated at an emergency briefing by the committee on Monday.\nThe minister promised that the PSC will reveal the next line of action on Monday, 20th December.\nAccording to him, so far, the death toll from COVID-19 in the country has been below 3,000.\nSirika added that Nigeria is yet to receive a letter circulating on social media and indicating a revised travel restriction update purportedly from the UAE."
  },
  {
    "headline": "One Million Expired AstraZeneca Vaccines Set To Be Destroyed – NPHCDA",
    "summarized_story": "Nigeria is set to destroy one million AstraZeneca vaccines in line with environmental protocols.\nThis is according to the Executive Director of the National Primary Health Care Development Agency (NPHCDA), Faisal Shuaib.\nHe reiterated that Nigeria will no longer accept vaccines with a short shelf life as was tenable in the past, noting that so far, the PSC has administered over 10,000 doses of short-shelf life vaccines.\nThe NPHCDA boss’ comments come a few days after the Federal Government confirmed that within the last month, some COVID-19 vaccines expired in the country.\nIn a statement, the Minister of Health, Dr. Osagie Ehanire, noted that the donation of surplus Covid-19 vaccines with short/expiring shelf lives has been of great concern internationally."
  },
  {
    "headline": "30 Suspected Kidnappers Arrested As Imo Traditional Ruler Rescued",
    "summarized_story": "﻿Some 30 suspected kidnappers and criminals have been arrested in Imo state, Channels Television can report.\nA traditional ruler who was kidnapped in Okigwe local government area on Sunday, Acho Ndukwe of Ihube autonomous community, was also released during the raid.\nThe incident happened 48 hours after a traditional ruler in Atta autonomous community in Njaba local government area, also of Imo State, was abducted and murdered.\nThe traditional ruler of Mbutu community who was kidnapped last week was rescued by the police unhurt on Saturday.\nKidnapping is rife in parts of Imo State and the South-East."
  },
  {
    "headline": "National Assembly To Pass Proposed 2022 Budget This Week, Says Lawan",
    "summarized_story": "﻿The President of the Senate, Senator Ahmad Lawan, says the National Assembly will pass the proposed 2022 budget before the end of the legislative week.\nLawan said the current National Assembly has made it a practice for the budget to be presented and passed before the end of December yearly, to ensure that its implementation commences in January.\nREAD ALSO: What Buhari Said During The 2021 Budget Presentation (Full Speech)According to the lawmaker, the percentage of the National Assembly budget in the federal budget ranged between 1.44 per cent in 2019 to 0.82 per cent in 2021.\nFor him, the National Assembly has been grossly underfunded in the last four years.\nThis comes two months after President Muhammadu Buhari presented a total 2022 budget of N16.39 trillion tagged ‘Budget of Economic Growth and Sustainability” to the lawmakers."
  },
  {
    "headline": "China Reports First Omicron Case",
    "summarized_story": "China has reported its first case of the fast-spreading Omicron coronavirus variant, state media said Monday.\nAuthorities in the northern city of Tianjin confirmed the case in an individual who entered the country from an undisclosed overseas location, according to the Tianjin Daily newspaper.\nThe asymptomatic patient tested positive for Covid-19 on Thursday before further tests “confirmed the detection of the… Omicron variant”, the report said, adding that the person was being treated in isolation at hospital.\nChina has slowed its number of new virus cases to a trickle through a combination of tight border restrictions, mass testing, and targeted lockdowns.\nThe country recorded 101 new Covid-19 cases on Monday, including 21 imported infections, according to data from the National Health Commission."
  },
  {
    "headline": "Gov Akeredolu swear-in new Commissioners, Special Advisers, DG -",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, on Monday, swore-in all the 14 newly appointed Commissioners who were recently confirmed by the State House of Assembly.\nThe Governor also inaugurated seven Special Advisers and the Director-General of the Performance and Project Implementation Monitoring Unit (PPIMU).\nPresent at the event are the wife of the Governor, Chief Betty Anyanwu-Akeredolu; the Deputy Governor, Hon.\nThe new Commissioners are; Mrs Bamidele Ademola Olateju – Akoko South East; Otunba Adefarati Adegboyega – Akoko South West; Rt.\nThe Special Advisers include: Chief (Dr) Victor Ategbole; Dr. (Mrs) Wunmi Ilawole; Barr Tobi Ogunleye; Dr. Jibayo Adeyeye; Mrs Olamide Falana; Dr ."
  },
  {
    "headline": "PDP National Chairman receives Ortom in Gboko",
    "summarized_story": "The National Chairman of the People’s Democratic Party, PDP, Dr Iyorchia Ayu receives Governor Samuel Ortom and his wife, Eunice Ortom and other members of his entourage at for a decamping ceremony in Gboko.\nBenue State Deputy Governor, Engr Benson Abounu, Senators Gabriel Suswam, Orker Jev and Abba Moro, Members of the House of Representatives, Speaker and Members of the Benue State House of Assembly, State Working Committee of the PDP and other top government officials from the state were also present."
  },
  {
    "headline": "Israeli PM, Bennett, meets Abu Dhabi Crown Prince, Zayed -",
    "summarized_story": "Israeli Prime Minister Naftali Bennett’s office has disclosed that he has met with Abu Dhabi Crown Prince Sheikh Mohammed bin Zayed at his private palace in Abu Dhabi.\nThis is the first official visit of an Israeli Prime Minister to the United Arab Emirates and is coming 15 months after the signing of a normalization agreement between the two countries.\nBennett had highlighted growing trade ties between his country and the UAE in an interview with WAM, the Emirates’ state-run news agency.\nHe did not however mention in the agency’s write-up of the interview tensions with Iran.\nBut the interview made only the slightest possible nod in that direction, writing: ‘On the UAE’s efforts to enhance international cooperation for facing common challenges, the Israeli Prime Minister stressed, “the values of tolerance, peace and dialogue are common, and that is why the friendship that unites us developed at such a high speed.”‘"
  },
  {
    "headline": "APC Convention: Sani, Mustapha, 9 others to meet Thursday on way forward for party",
    "summarized_story": "Ahead of the national convention of the ruling All Progressives Congress (APC) slated for February 2022, all the national chairmanship aspirants will on Thursday this week gather in Abuja to discuss their strategies for propelling the party forward in preparation for the 2023 general elections.\nSunny Moniedafe, former Borno governor, Senator Kashim Shettima, former Gombe State governor, Senator Danjuma Goje and Mohammed Saidu Etsu.\nThe maiden edition of the summit was held in December 2020 with the Director-General of the Progressive Governors’ Forum (PGF) Salihu Moh.\n“Reports and suggestions on the lecture will be made available to the party and interested members of the public.\n“The National Chairman, Caretaker Extra-Ordinary Convention Planning Committee (CECPC), and Governor of Yobe State, Hon."
  },
  {
    "headline": "Falana Allegedly Against Adeboye’s Church Tithing – Trending With Ojy Okpe",
    "summarized_story": "In the Wake of the recent kidnappings across Northern states in Nigeria, a video surfaced over the weekend, showing a woman who narrated her ordeal In the hands of Boko Haram terrorists.\nThe monarch dared them to raise their hands if they can stay in their constituencies in peace, for just a week.\nMeanwhile, former presidential aide, Doyin Okupe, over the weekend, warned human rights lawyer, Femi Falana, against speaking ill about the general overseer of the Redeemed Christian Church of God, Pastor Enoch Adeboye.\nFinally, following the rising cases of the Omicron Coronavirus variant, quarantine protocols in the country have become stiffer.\nOver the weekend a video of hotel guests, standing out in the harsh cold weather after they were ushered out of their hotel rooms, when a fire alarm went off, circulated online."
  },
  {
    "headline": "“We Must Enforce Progressive and Viable Aviation Policies” – Alex Nwuba",
    "summarized_story": "In leaked voice note that circulated on social media at the weekend, the Minister of Aviation, Hadi Sirika, revealed that Nigeria was left with no choice than to red list the United Kingdom, Canada and Saudi Arabia, and ban flights from the three countries after they had imposed similar travel restrictions on Nigeria.\nThe UK, Canada and Saudi Arabia shut their doors to foreign travellers originating from Nigeria after cases of the #Omicron COVID-19 variant were linked to travellers arriving from the West African country.\nThe UK and Saudi Arabia also took their bans a step further by suspending the issuance of #travel visas to Nigerian citizens, while Canada said it will not accept PCR tests from the country."
  },
  {
    "headline": "UAE Stops International Airlines From Boarding Nigerian Passengers To Dubai",
    "summarized_story": "The diplomatic crisis between Nigeria and the United Arab Emirates (UAE) is getting worse as the latter has stopped foreign airlines from airlifting Nigerians to Dubai.\nAccording to reports, Ethiopian Airlines, Turkish Air and other international airlines going to Dubai from their bases refused to board Nigerians whose final destination is the UAE.\nThe airlines it was gathered insisted that they have been directed not to airlift Nigerian passport holders to Dubai.\nSo far, hundreds of passengers are affected by this directive as Ethiopian Airline a few minutes ago offloaded their Nigerian passengers to Dubai.\nDetails later…"
  },
  {
    "headline": "Tinubu Was Never Promised Running Mate Position, Buhari’s Boys Fire Back at Ex-Party Chair Akande – Arise News",
    "summarized_story": "‘How could he be talking of a running mate when he had not secured the ticket?\n“He said it was from this list that Buhari would choose a running mate.\n‘General, where are you choosing your running mate from?’ He answered, ‘The South-west.’ ‘Oh!\n‘If indeed you promised to make Asiwaju your running mate, it would not be fair to renege,’ he said.\n“We were registered in July 2013, and he called me to prevail on Tinubu to be his running mate in April 2014."
  },
  {
    "headline": "Electoral Bill: PANDEF Expresses Concern Over President Buhari’s Delayed Assent",
    "summarized_story": "The Pan Niger Delta Forum (PANDEF) has expressed concern over the delay by President Muhammadu Buhari in assenting to the 2021 Electoral Act Amendment Bill transmitted to him by the National Assembly last month.\n“Anyone, who for whatever reason, solicits the President not to sign the Bill is doing a great disservice to Nigeria.\n“PANDEF, therefore, calls on President Muhammadu Buhari to jettison partisan considerations and assent to the bill without further delay, to strengthen the nation’s democracy”.\nThe CSOs in the letter entitled “Electoral Bill: Invite Representatives of Youths, Women, PLWD and CSOs to the Signing Ceremony,” dated 11th December, 2021, expressed optimism that Buhari would sign the Electoral Amendment bill into law as he celebrates on his birthday.\n“The current Electoral Amendment Bill before the President of the Federal Republic of Nigeria for assent demands immediate and urgent assent in the interest of the electorates and entrenchment of parties’ internal democracy."
  }
]