[
  {
    "headline": "Gas explosion kills two in Mexican beach resort",
    "summarized_story": "An explosion caused by a suspected gas leak in a beachside restaurant left two dead and 19 injured in Mexico’s Caribbean resort of Playa del Carmen on Monday, authorities said.\n“Emergency teams arrived at the scene to help the victims,” the prosecutor’s office in Quintana Roo state, home to Playa del Carmen, said in a statement.\nThe incident is another setback to Mexico’s efforts to woo back tourists following the Covid-19 pandemic and an increase in violence in Caribbean resorts including Playa del Carmen, Cancun and Tulum.\nOn Saturday, a British businessman living in Playa del Carmen was shot dead.\nMexican prosecutors have linked most of the violence in recent years to turf wars between drug dealers or extortion."
  },
  {
    "headline": "IPOB: Nnamdi Kanu hires new lawyer",
    "summarized_story": "In a bid to strengthen his legal team, the leader of the Indigenous People of Biafra, Nnamdi Kanu, has hired a new lawyer, Chukwuma Machukwu Umeh (SAN).\nHe had on January 18, Kanu’s lawyer, unveiled Chief Mike Ozekhome (SAN) as the leader of the defence counsel for Nnamdi Kanu.\n“Just exited from a groundbreaking visitation with Onyendu Mazi Nnamdi Kanu.\nIt was groundbreaking because we covered many new grounds, including the addition of Chukwuma Machukwu Umeh(SAN) to the Legal Team.\nHe said, “Today, March 14 2022, we visited our amiable client – Onyendu Mazi Nnamdi Kanu at the headquarters of the DSS Abuja."
  },
  {
    "headline": "Police dismiss claims of strike as fake, mischievous",
    "summarized_story": "The Nigeria Police Force on Monday described as fake and mischievous claims of purported plans by its personnel to embark on strike.\nThe police made the clarification in a statement by the acting Force Public Relations Officer (FPRO), CSP Olumuyiwa Adejobi.\nHe said the claims, circulating in some social media handles, on plans by some personnel of the force to embark on strike from March 26, was a mischievous attempt by unscrupulous individuals.\nAdejobi said the claims was to bring the force to disrepute, misinform the public and heat up the polity.\n“The men and women of the Nigeria Police Force are fully aware that a strike action or other deliberate disruption of law enforcement services by any security organisation is mutinous."
  },
  {
    "headline": "SFH to empower over 700 Kano CPs, PPMVs to provide quality healthcare services",
    "summarized_story": ",By Bashir Bello, KANOThe Society for Family Health, SFH has disclosed plans by the organization to empower over 700 Community Pharmacists, CPs and Proprietary Patent Medicine Vendors, PPMVs in Kano State under a new project tagged, Integrated E, 2.0 to provide improved and quality healthcare services and handle common community health challenges.\nEmeka Okafor disclosed this during a stakeholder’s inception meeting to unveil the project in Kano state.\n“Currently, about 60 per cent of the people in the community and entire population seek care from either the Community Pharmacists or PPMVs.\nWe found out that we have 6,500 PPMVs and 250 Community Pharmacists.\nWhen you look at the Primary Healthcare Services, what can they (PPMVs) be trained to provide and how can they be properly supervised to make sure that this training is translating to quality services."
  },
  {
    "headline": "Breaking: Okon, Pastor Ibuot resign from Emmanuel’s Cabinet",
    "summarized_story": "By Chioma Onuegbu, UyoThe Commissioner For Economic Development and Ibom Deep Seaport, Akwa Ibom State, Mr Akan Okon, and the Commissioner for Labour and Manpower Planning, Pastor Sunday Ibuot have resigned their appointments.\nREAD ALSO: Udom solicits partnership with churches to fight cultismHe thanked governor Udom Emmanuel for the opportunity and wished the state the very best of growth and development.\n“I respectfully wish to thank His Excellency, the Executive Governor of Akwa Ibom state, for the opportunity granted me to be appointed as an Honourable Commissioner in Akwa Ibom state government.\nFirst, as the Secretary Technical Committee on Agriculture and Food Sufficiency, later Honourable Special Adviser Political/Legislative Affairs and Water Resources, and finally Honourable Commissioner in Akwa Ibom state Executive Council of your administration.\nHowever, I am tendering this resignation of appointment as Commissioner in your cabinet due to personal reasons”, Ibuot stated."
  },
  {
    "headline": "NDLEA accuses Abba Kyari’s co-defendants of unruly behaviour in detention",
    "summarized_story": "The development came shortly after Justice Nwite fixed March 28 for ruling on the bail application of the defendants, including Kyari.\n“The 3rd to 5th defendants were very unruly while in our custody,” he said, urging the court to make an order for their transfer.\nJohn Nuhu (4th and 5th defendants), informed that the allegation was due to the difficult of members of their families having access to them.\nHowever, counsel to the National Drug Law Enforcement Agency (NDLEA), Joseph Sunday, a director of Prosecution and Legal Services, opposed the bail application.\nJohn Nuhu are 2nd to 5th defendants in the charge marked FHC/ABJ/57/2022."
  },
  {
    "headline": "FG begins training of 467,183 beneficiaries of exited N- Power batches on entrepreneurship",
    "summarized_story": "N-PowerBy Joseph ErunkeABUJA-THE federal government has begun entrepreneurial training of 467,183 out of the 500,000 beneficiaries of the N-Power scheme captured in exited batches A and B.\nThe batches were exited last year after over two years to pave way for another set of beneficiaries of the National Social Investment Programme,NSIP of the government.\nUnder the programme, otherwise known as NEXIT Programme,the N-Power beneficiaries are to get loans from the Central Bank of Nigeria, upon training.\n263,998 of these applicants have confirmed their availability to participate in the training programme.”She spoke further: “For ease of coordination, this training programme would be conducted in phases.\nLet me also inform you that all the 36 States and FCT are participating in this long awaited NEXIT training programme."
  },
  {
    "headline": "God isn’t happy with Nigeria’s situation – Gani Adams",
    "summarized_story": "Aare Onakakanfo of Yoruba land, Iba Gani Adams says there are indications that God is not happy with Nigeria because of its situation.\nAdams spoke on Monday at a briefing in Lagos while unveiling programmes for the 2022 edition of Eledumare Festival.\nAdams reiterated his call for restructuring of Nigeria to forestall collapse, lamenting that “the presidency and the power brokers have failed to heed the calls”.\nThings are going the wrong way on daily basis.\nAdams, chief promoter of Olokun Festival Foundation (OFF) appealed to the government at all levels to do more for the poor."
  },
  {
    "headline": "Nigeria Police react to ‘planned strike by officers’ over salaries, welfare",
    "summarized_story": "The Nigeria Police has reacted to news alleging that some members of the force will be embarking on strike from March 26, 2022.\nA statement on Monday night by Muyiwa Adejobi, Public Relations Officer, declared the information as fake.\nHe recalled that it was the president, without any demand from the police, that directed the process of increasing salaries and allowances.\nThe statement added that the federal government and IGP Usman Baba are fully committed to the implementation of the new salary package.\nHe further mentioned the renovation of training schools, upgrade of police training curriculum, procurement and deployment of technology to boost ICT-driven policing."
  },
  {
    "headline": "Go after bandits, terrorists, not those keeping afro – Shehu Sani tells Sharia Police",
    "summarized_story": "Former Senator representing Kaduna Central Senatorial District, Shehu Sani, has asked the Sharia Police, otherwise known as Hisbah, to confront terrorists and bandits operating and damaging the name of Islam in Nigeria.\nSani, a civil rights activist, made the call on Monday in Kano during a familiarisation visit to Hisbah.\nShehu Sani argued that it is the duty of Hisbah to protect the image of Islam and Muslims in the region being abused by the bandits and terrorists who are killing innocent people in the name religion.\n“The need for them to be mobilizing people to rise against banditry and terrorism in northern part of Nigeria is also very important.\n“The need for them to reach out to rural communities and educate our citizens on the need for them not to join bandits and terrorists is also very important."
  },
  {
    "headline": "NDLEA accuses Abba Kyari’s co-defendants of unruly behaviour in detention",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), on Monday, accused three co-defendants, in the alleged drug trafficking case against suspended DCP Abba Kyari and others, of being unruly while in its custody.\nNDLEA lawyer and director, Prosecution and Legal Services, Joseph Sunday, made the allegation before Justice Emeka Nwite of a Federal High Court, Abuja.\nThe development came shortly after Justice Nwite fixed March 28 for ruling on the bail application of the defendants, including Kyari, NAN reports.\nSunday, who told Justice Nwite that ASP Bawa James, Insp.\nChiwar, who undertook that the defendants would be of good behaviour, prayed the court to allow them to continue to be kept in NDLEA custody."
  },
  {
    "headline": "Delta 2023: Okowa’s aide, Olorogun Gordons resigns",
    "summarized_story": "Ahead of the 2023 general elections, the Senior Special Assistant to the Delta State Governor on Peace and Conflict Resolution, Olorogun Samson Gorsons, has tendered his resignation to Governor Arthur Ifeanyi Okowa.\nThis is to enable him pursue his political ambition into the Delta State House of Assembly in Ughelli South Constituency.\nOlorogun tendered his resignation through the Secretary to the State Government, Patrick Ukah.\nWhile thanking the governor for the opportunity given to him to serve, Olorogun said the reason for his resignation was to allow him pursue and achieve his political ambition."
  },
  {
    "headline": "Family of 14-year-old student files N10 billion suit against Premier Academy, 7 others for negligence",
    "summarized_story": "The plaintiff states Lois Bung wrote a statement at the police stating that she had given Keren-Happuch 5 tablets of Dexamethasone (steroid) and 1 tablet of Loratadine (anti-allergy).\n“The plaintiff states that the condom and dead spermatozoa found in her daughter has no other indication except, rape, sexual molestation and sexual abuse of her daughter.\n“The plaintiff states that the Command has not at any time intimated them of the progress of the investigation.\n“The plaintiff states that the dead spermatozoa belong to a male who lives and/or works in the premises of the 1st to the 6th defendants.\n“The plaintiff states that if the defendants were not benefitting from it they have no reason not to fish out the perpetrator and punish accordingly."
  },
  {
    "headline": "BREAKING: Police return to APC Hqts, warring leaderships desert secretariat",
    "summarized_story": "From Romanus Ugwu, AbujaSecurity agents, on Monday morning, returned to the national secretariat of the All Progressives Congress (APC) and condone off the entire Blantyre Street where the party’s headquarters is located.\nThe security agents, numbering over 80 personnel, had arrived the secretariat in no fewer that 11 patrol vehicles, occupying strategic positions outside the secretariat.\n“Yes we have passed through this road previously but the situation we found ourselves presently is so confusing.\nGovernor Bello is not here and Governor Buni they touted will return to the secretariat is still at large.\nMeanwhile, former Director-General APC Progressive Governors Forum (PGF), Salihu Moh Lukman, has come down hard on his party, claiming that there is nothing fundamentally different between APC and the opposition party, the Peoples Democratic Party (PDP)."
  },
  {
    "headline": "BREAKING: Cocaine scam trial: Kyari’s wife slumps in Court",
    "summarized_story": "From Godwin Tsa, AbujaA near tragedy occurred at the resumed trial of the suspended Deputy Commissioner of Police(DCP), Abba Kyari and six others when a middle aged woman identified as Kyari’s wife fainted after slumping at the Abuja division Federal High Court.\nThis came as the National Drug Law Enforcement Agency (NDLEA), had urged the court to deny Kyari and all the other Defendants bail.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe anti-narcotic agency told the court that Kyari, a former chairman of the Police Intelligence Response Team, IRT, would escape from the country and make himself unavailable for trial, should he be released from custody.\nClad in a black Hijab, she fell on the floor while armed operatives of the National Drug Law Enforcement Agency, NDLEA, were leading Kyari and the others away from the court premises."
  },
  {
    "headline": "INEC clears 16 political parties for Ekiti governorship poll",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC) on Monday cleared 16 political parties to contest the Ekiti State governorship election.\nThe breakdown of the participants, according INEC showed that 16 political parties that will fight it out at the poll comprise 14 male candidates, and two female candiates.\nIn compliance with the Electoral Act 2022, the Commission hereby publishes the final list of candidates for the election following the close of nominations by political parties.\n“Furthermore, the attention of parties is drawn to Section 32(3) of the Electoral Act 2022, which provides that failure to notify the Commission “shall not be ground to invalidate the election”.\nPolitical parties are enjoined to note the provision of the law for compliance,” the statement from the Commission read"
  },
  {
    "headline": "BREAKING: ASUU extends strike to 2 months",
    "summarized_story": "From Adanna Nnamani, AbujaThe Academic Staff Union of Universities (ASU) has extended its warning strike for another two months.\nASUU took the decision to continue the strike at a marathon National Executive Council (NEC) held at the union’s national secretariat at the University of Abuja over the weekend.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid .\nAccording to the source said, the outcome of the meeting was being drafted to be released in a statement to the media soon."
  },
  {
    "headline": "APC Moves to Retain Buni as Interim Chairman, Bello as Acting Chair",
    "summarized_story": "Buni had travelled for medical reasons and transmitted power to Bello in writing to act as the CECPC chairman.\nIt was gathered yesterday that the party is maintaining the letter of transition remains in force even as Buni remains interim caretaker chairman.\nBello had announced a few days ago that he had taken over affairs at the APC national headquarters, disclosing that he was acting as Chairman in the absence of Buni.\nAccording to one of the sources, some of the president’s associates noted that by the framework of the Party’s NEC, Buni was never removed as CECPC chairman.\nMeanwhile, the All Progressives Congress Youth Development and Solidarity Network (APC-YDSN) has alleged fresh plot by some APC Governors to get a court injunction to effectively sack Buni as CECPC Chairman."
  },
  {
    "headline": "Gencos: Nation in Darkness Because We are Owed N1.6trn Since 2013",
    "summarized_story": "*NBET disputes power generators’ debt claimEmmanuel Addeh in AbujaPower Generation Companies (Gencos) under the Association of Power Generation Companies (APGC) yesterday stated that the power supply situation in the country was worsening because they were owed over N1.6 trillion since 2013.\nAccording to her, issues of gas volume, gas quality, gas pressure and gas transportation have consistently curtailed capacity utilisation by Gencos thereby affecting generation.\nFirstly, it is wrong to claim that only five generation companies have gas supply agreement, meaning that there is no level playing field.\nFurthermore, a lot of the gas companies were also doing maintenance work on their infrastructure, limiting supply of gas to generation companies.\nAll these put together made power supply epileptic in the countryShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Osinbajo: Buhari and I Have Not Had Any Religious Dispute in Seven Years",
    "summarized_story": "*Wants religion to be used for unity, improvement of people’s livesDeji Elumoye in AbujaThe vice president, Professor Yemi Osinbajo, declared at the weekend that in the last seven years of working with President Muhammadu Buhari, there has not been any religious dispute between them.\nOsinbajo called on religious leaders to use faith to unite the country and improve the lives of the citizens.\nOsinbajo described Buhari as a leader who accommodated people of different religious backgrounds, citing his relationship with the president spanning over seven years as a perfect example.\nEarlier in his remarks, Sheikh Niass, who spoke in French with interpretation by a spokesman, thanked the vice president for the opportunity to meet with him.\nHe also prayed for peace in Nigeria, Africa, and the world."
  },
  {
    "headline": "Buhari Reads Riot Act to APC Leaders, Cautions against Name-calling, Backstabbing",
    "summarized_story": "Rather, he said, the party must be ready to put its house in order ahead of the planned national convention of the party holding in Abuja on March 26, 2022.\nHe stressed that whenever the substantive chairman comes back, the acting chairman would have to give way.\nINEC as an institution has said that as far as it is concerned, Governor Buni remains the chairman of the party.\nAt the meeting, it was gathered that the party chieftain urged Akpanudoedehe to sign the notice of the NEC meeting.\nThe source noted that all efforts are to ensure that the convention date of the party is not postponed."
  },
  {
    "headline": "Anxiety as PDP National Caucus, NEC Meet Over Presidential Ticket",
    "summarized_story": "Chuks Okocha in AbujaThere is anxiety among members of the Peoples Democratic Party (PDP) as the national caucus of the main opposition party and the party’s National Executive Committee (NEC) meet on Monday (tomorrow) and Tuesday to take a decision on the presidential ticket of the party, THISDAY has learnt.\nThe party also urged its national caucus to determine the implications of throwing the presidential ticket open.\nTHISDAY gathered that the report of the Bauchi State governor’s committee would form the main agenda of the national caucus meeting and NEC meetings of the PDP.\n“In the memo to the national caucus, there are variables we want them to consider.\nOne is whether geopolitical zoning is in the interest of the PDP in winning the presidential election come 2023 and two, what will it cost the PDP if it throws the presidential ticket open."
  },
  {
    "headline": "Osinbajo To Challenge Tinubu For APC Ticket As Vice President Informs Buhari Of Presidential Ambition",
    "summarized_story": "Vice President Yemi Osinbajo has finally informed President Muhammadu Buhari of his presidential ambition.\nAccording to Daily Trust, Osinbajo told the president of his desire to take over from him at the expiration of his tenure in 2023.\nVice President Yemi OsinbajoWith the intent, which has not been made public, the vice president will fight for the ticket of the ruling All Progressives Congress (APC) with the National Leader of the party, Bola Tinubu.\n“Certainly, VP Osinbajo has told the president that he wants to succeed him,” the newspaper quoted a source as saying.\n“The vice president had first consulted some prominent Nigerians who encouraged him to vie for the presidency and they also encouraged him to tell the president himself."
  },
  {
    "headline": "Osinbajo To Challenge Tinubu For APC Ticket As Vice President Informs Buhari Of Presidential Ambition",
    "summarized_story": "Vice President Yemi Osinbajo has finally informed President Muhammadu Buhari of his presidential ambition.\nAccording to Daily Trust, Osinbajo told the president of his desire to take over from him at the expiration of his tenure in 2023.\nVice President Yemi OsinbajoWith the intent, which has not been made public, the vice president will fight for the ticket of the ruling All Progressives Congress (APC) with the National Leader of the party, Bola Tinubu.\n“Certainly, VP Osinbajo has told the president that he wants to succeed him,” the newspaper quoted a source as saying.\n“The vice president had first consulted some prominent Nigerians who encouraged him to vie for the presidency and they also encouraged him to tell the president himself."
  },
  {
    "headline": "EXCLUSIVE: How Rivers Governor, Wike Exposed Judge He Uses At Federal High Court For ‘Dirty Jobs’",
    "summarized_story": "Rivers State Governor, Nyesom Wike has revealed Justice Inyang Ekwo of the Federal High Court, Abuja as the judge he uses for ‘dirty jobs’.\nHowever, sources at the Federal High Court in Abuja told SaharaReporters on Saturday night that Justice Ekwo is known as “Wike Judge”.\n“Were you surprised when Governor Umahi criticised Justice Ekwo over the judgment, describing him as a hatchet man?\nJustice Ekwo is known as ‘Wike Judge’ here.\n“He is so enmeshed with Wike that Wike permanently has lawyers stationed in his court to monitor his cases."
  },
  {
    "headline": "EXCLUSIVE: How Rivers Governor, Wike Exposed Judge He Uses At Federal High Court For ‘Dirty Jobs’",
    "summarized_story": "Rivers State Governor, Nyesom Wike has revealed Justice Inyang Ekwo of the Federal High Court, Abuja as the judge he uses for ‘dirty jobs’.\nHowever, sources at the Federal High Court in Abuja told SaharaReporters on Saturday night that Justice Ekwo is known as “Wike Judge”.\n“Were you surprised when Governor Umahi criticised Justice Ekwo over the judgment, describing him as a hatchet man?\nJustice Ekwo is known as ‘Wike Judge’ here.\n“He is so enmeshed with Wike that Wike permanently has lawyers stationed in his court to monitor his cases."
  },
  {
    "headline": "EXCLUSIVE: How Rivers Governor, Wike Exposed Judge He Uses At Federal High Court For ‘Dirty Jobs’",
    "summarized_story": "Rivers State Governor, Nyesom Wike has revealed Justice Inyang Ekwo of the Federal High Court, Abuja as the judge he uses for ‘dirty jobs’.\nHowever, sources at the Federal High Court in Abuja told SaharaReporters on Saturday night that Justice Ekwo is known as “Wike Judge”.\n“Were you surprised when Governor Umahi criticised Justice Ekwo over the judgment, describing him as a hatchet man?\nJustice Ekwo is known as ‘Wike Judge’ here.\n“He is so enmeshed with Wike that Wike permanently has lawyers stationed in his court to monitor his cases."
  },
  {
    "headline": "2nd Niger bridge: It'll be ingratitude to say Buhari neglected south-east, says Uzodimma",
    "summarized_story": "Hope Uzodimma, governor of Imo, says it will amount to “ingratitude” for people from the south-east to say President Muhammadu Buhari neglected the region.\nUzodimma said only the Buhari-led administration fulfilled the promise of completing the second Niger bridge.\nOn March 8, Babatunde Fashola, minister of works and housing, said the second Niger bridge will be completed in April.\nFrom 1979 to 1983 — the second republic — we were promised the second Niger bridge.\n“From 1999 to 2007, we were promised the second Niger bridge."
  },
  {
    "headline": "2nd Niger bridge: It'll be ingratitude to say Buhari neglected south-east, says Uzodimma",
    "summarized_story": "Hope Uzodimma, governor of Imo, says it will amount to “ingratitude” for people from the south-east to say President Muhammadu Buhari neglected the region.\nUzodimma said only the Buhari-led administration fulfilled the promise of completing the second Niger bridge.\nOn March 8, Babatunde Fashola, minister of works and housing, said the second Niger bridge will be completed in April.\nFrom 1979 to 1983 — the second republic — we were promised the second Niger bridge.\n“From 1999 to 2007, we were promised the second Niger bridge."
  },
  {
    "headline": "NGF: Insecurity, political uncertainties may ground businesses if not promptly tackled",
    "summarized_story": "The Nigeria Governors Forum (NGF) has warned that the spate of insecurity as well as political and economic uncertainties in the country may ground businesses if they are not promptly tackled.\nKayode Fayemi, chairman of the forum, spoke on Monday at a meeting of the NGF with the attorneys-general of the 36 states.\nAdvertisement“You are all aware of the controversy occasioned by the question of the autonomy of the judiciary and legislature,” he said.\n“The forum has often been in support of autonomy, but we felt that the onus was on the states to determine and implement it.\n“It is, therefore, expedient that as chief law officers, you exercise the right to review and monitor the extent of implementation in your states.”"
  },
  {
    "headline": "NGF: Insecurity, political uncertainties may ground businesses if not promptly tackled",
    "summarized_story": "The Nigeria Governors Forum (NGF) has warned that the spate of insecurity as well as political and economic uncertainties in the country may ground businesses if they are not promptly tackled.\nKayode Fayemi, chairman of the forum, spoke on Monday at a meeting of the NGF with the attorneys-general of the 36 states.\nAdvertisement“You are all aware of the controversy occasioned by the question of the autonomy of the judiciary and legislature,” he said.\n“The forum has often been in support of autonomy, but we felt that the onus was on the states to determine and implement it.\n“It is, therefore, expedient that as chief law officers, you exercise the right to review and monitor the extent of implementation in your states.”"
  },
  {
    "headline": "Enter Nyesom Wike — Obaseki’s new godfather",
    "summarized_story": "This article uncannily predicted the current dogfight between Nyesom Wike, governor of Rivers state, and Godwin Obaseki, governor of Edo state.\nThe Edo governorship election has taken its place in the past of gritty and rousing contests.\nThe governor will realise soon enough that his new political benefactor, Nyesom Wike is an absolutist; a one of kind godfather.\nAdvertisementWike was named PDP Edo campaign DG principally as a recognition of his pre-eminence in the affairs of the party.\nBut how well can Obaseki navigate through the relationship maze with Wike who is erratic, impulsive, short-tempered and domineering?"
  },
  {
    "headline": "The untold story of how ThriveAgric survived a turbulent 2020",
    "summarized_story": "He was one out of hundreds of ThriveAgric’s retail investors who hadn’t received the payments.\nThis affected ThriveAgric’s communication with its retail investors as it repeatedly failed to fulfil the promises it made to its retail investors.\nAll through this turbulent phase, the company maintains it didn’t take its retail investors for granted.\nUnexpected support and lessonsDuring the turbulent period, there was a lot of pushback from retail investors but also surprisingly a lot of support from investors, financiers, and friends.\n“Essentially, I ensured that the core business operations ran smoothly and built a system to ensure that the defaulting offtakers paid,” Eje said."
  },
  {
    "headline": "Moove secures $105 million to take its vehicle financing model global",
    "summarized_story": "Moove, a Nigerian automobile financing startup and Uber’s exclusive vehicle supply partner in Africa, on Monday, said it has raised $105 million in equity and debt to power a global expansion.\nLaunched in 2020 by Ladi Delano and Jide Odunsi, Moove provides mobility entrepreneurs with access to revenue-based financing in markets where there’s low access to credit.\n“That’s why we’re excited to be expanding to new emerging markets in Asia and the MENA region.”The mobility space in emerging markets is often highly fragmented and informal.\nAlso, insufficient purchasing power among middle-class citizens coupled with limited or no access to vehicle financing often put cars out of reach for the majority of populations in these countries.\nWith its revenue-based financing model, Moove is addressing this problem albeit for a segment of the population: mobility entrepreneurs."
  },
  {
    "headline": "Nigerian government shuts down 6 illegal digital loan companies",
    "summarized_story": "According to Punch, digital lending platforms like GoCash, Okash, EasyCredit, Easi Moni, KashKash, and Speedy Choice were among the busted companies.\n“This information started quite a while ago.\nThese companies move around a lot, and it took us several months visiting each of their locations,” he said.\nWith no address, all these companies have are mobile apps that can be downloaded on both Google and Apple Stores.\nWe also understand that there are between 5 and 7 companies operating at the same location,” said Irukera, hinting at the agency’s ambition to cleanse the nation of all illegal digital lending practices."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "How Pivo is providing fast and reliable financial services for Africa’s supply chain businesses",
    "summarized_story": "Source: SuppliedThe duo also ran businesses together, and their experience showed them that many small businesses in the supply chain industry struggled with financing.\nFinancial services for supply chain SMEsPivo is a financial services provider targeted at SMEs in Africa’s supply chain sector.\nThe decision to focus on businesses in the supply chain sector comes from the founders’ expertise working in the industry and an understanding that there’s a supply chain segment to most sectors of the African economy.\nIt plans to offer every financial service that a supply chain business needs, including inventory financing, corporate account services, asset financing, etc.\nThe startup has three core products – Pivo Capital, Pivo Finance, and Pivo Plus."
  },
  {
    "headline": "Inside Cadana’s plan to provide salary on-demand without payback or interest charge",
    "summarized_story": "In a conversation with Techpoint Africa, Cadana Co-founder and CEO, Owusu-Asare, discussed his motivation for creating the startup and why he thinks on-demand salary could help Africans accelerate wealth creation.\nCadana websiteWhile Cadana provides salary on-demand, there are limits to the time and amount of the salary that can be demanded.\nCadana pays the salary and gets the money back from the employer when the payment is due.\nIt is essential to see Cadana as a payment platform and a salary on-demand platform.\nHowever, its on-demand salary offering sets it apart."
  },
  {
    "headline": "A raid to end them all",
    "summarized_story": "Share this article:Hi, thereToday I’m discussing:The latest development on the Nigerian data privacy front, andArtificial Intelligence’s role in racial biasA raid to end them allRecall that in November 2021, we discussed six Nigerian agencies banding together to fight data privacy abuse by money lending fintechs.\nAccording to FCCPC’s CEO, Babatunde Irukera, investigations began in 2020, and this raid is a culmination of that.\nFighting racially-biased technologyFor my second trick, I’ll be stringing together three words to make a story: Artificial Intelligence (AI), bias, race.\nThe centre is located in the Denis Sassou-N’guesso University of Kintélé and offers a Masters of Science Degree in Artificial Intelligence and data science in collaboration with the university.\nAlso, in 2018, Data Science Nigeria created Nigeria’s first AI hub."
  },
  {
    "headline": "Shell, Eni SpA declare force majeure on Nigeria oil shipment",
    "summarized_story": "Shell Plc and Eni SpA have both declared force majeure on critical Nigerian oil shipments, threatening to disrupt supplies in a market already concerned over Russia’s invasion of Ukraine.\nForce majeure is a legal provision that permits businesses to avoid contractual obligations due to circumstances beyond their control.\nA declaration of force majeure does not always imply that the entire supply chain will be disrupted for an extended length of time.\nThe market is keeping a careful eye on Russian oil supplies in the aftermath of the country’s invasion of Ukraine.\nThe start of Eni’s force majeure remained unclear."
  },
  {
    "headline": "Nigerians feel pinch as soaring costs hit FMCG firms",
    "summarized_story": "BusinessDay gathered that the continued rise in the production cost of manufacturing companies, especially those in the FMCG segment, was affecting profitability, product quality, and consumer demand.\nMost manufacturers have had to increase their retail prices while maintaining the same value or, in some cases, reducing the value of their products.\nAnd this is in addition to all the challenges of poor infrastructure, supply chain disruptions and logistics,” he said.\nPascal Odibo, group country director at Jeff & O’Brien Knowledge, Africa, highlighted the need for FMCG companies to find innovative ways to attract more customers.\nAyorinde Akinloye, an analyst at United Capital Plc, said most FMCG companies were stuck between maintaining product quality and increasing the prices of their products."
  },
  {
    "headline": "Aviation fuel scarcity: We may shutdown in 3 days – Airlines",
    "summarized_story": "Airlines Operators in Nigeria said they have only three days left to shut down their operations over the skyrocketing cost and acute scarcity of aviation fuel which is selling over N600 per litre.\nAllen Onyema, Chief Executive Officer of Airpeace said this while speaking for airline operators before the House Committee investigating the scarcity and high cost of aviation fuel, insisting that they can no longer afford the product.\nOnyema who demanded that airline operators should be given a licence to import aviation fuel said if they must continue flying, an average Nigerian will spend N120, 000 for an economy ticket.\nRead also: Businesses relying on airlines squeezed over aviation fuel scarcityIn their presentation, the oil markers said the high dollar rate was responsible for the high cost of the fuel, refusing to tell lawmakers the landing cost which caused a commotion.\nMele Kyari the Group Managing Director of NNPC Limited said currently, there were 19 oil companies with 88 million litres of aviation fuel in the country."
  },
  {
    "headline": "Obaseki: Biting economic hardship threatening fight against irregular migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… Edo sets to launch Migration 2.0BENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, expressed worry that the excruciating hardship resulting from the bad shape of the nation’s economy was threatening the government’s fight against human trafficking and illegal migration.\nThe governor hailed Action Aid and the European Union, among others, for partnering with his administration to checkmate and tackle the challenge of irregular migration.\nHe noted that the state has finalized plans to launch Edo Migration 2.0 to sustain gains recorded in the fight against the global menace.\nI don’t believe that our response should be the same as we did in Migration 1.0 as we may not be able to prevent irregular migration,” Obaseki added.\nThe governor continued: “Our strategy for Migration 2.0 is to work with destination countries and the federal government to look for pathways for regular migration."
  },
  {
    "headline": "ASUU extends strike by eight weeks – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Academic Staff Union of Universities (ASUU) has extended the ongoing industrial strike by eight weeks due to the inability of the Federal Government to satisfactorily address all the issues raised in the 2020 FGN/ASUU Memorandum of Action within the four-week warning strike.\nPresident of the union, Emmanuel Osodeke, made this statement known to the public, yesterday.\nThe statement reads, “NEC acknowledged the intervention efforts, in various ways, by patriots and friends of genuine national development (students, parents, journalists, trade union leaders, civil society activists etc.)\n“However, ASUU, as a union of intellectuals, has historic obligations to make governments honour agreements.\n“The roll-over strike shall commence by 12.O0 am on Monday, 14th March 2022.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Godbless, Nicholas shine in AFN AllComers athletics meet as Sabina reveals plans of Edo Sports Commission – Nigerian Observer",
    "summarized_story": "It was the first major track competition in Nigeria this season aimed at talents discovery which lasted between Saturday and Sunday in Benin.\nAlso speaking at the occasion, the Permanent Secretary, Edo State Sports Commission, Mrs Sabina Amiemenoghena Chikere said she was pleased with the performance of the athletes and the choice of Benin by AFN hosting the event.\nThat is one of our objectives here, to make Edo the sports hub, return sports activities to its prime place in Edo State.\n“There would be more competitions coming to Edo State and to be hosted by Edo State.\nEdo people should expect more sporting activities.” Sabina enthused."
  },
  {
    "headline": "Obaseki to Wike: PDP is not your personal property, Edo cannot be procured – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor has described the personal attacks by his Rivers State counterpart, Hon.\nIf Governor Wike cannot understand and adequately respond to the style and character of the Nigerian youth, how can he aspire to lead them?\n“It is therefore curious why this type of political solution is no longer tenable to resolve the political impasse in Edo State PDP.\nOn September 12, 2019, Governor Wike also threatened to cause trouble for the party over the emergence of Hon.\nEdo State cannot and will not be procured for anyone’s personal ambition."
  },
  {
    "headline": "Hope rises as Anambra awaits Soludo",
    "summarized_story": "We, in ADF expect him to become one of the major rallying-points in the liberation of Anambra state in particular and Igboland in general.\nIt is not even in total control of Anambra state; it is just in control of the executive and a substantial part of the state assembly.\nIf in the first attempt, we got Anambra State which was 2003, the chances were so bright.\nIt is going to be work, work, work, and that is what we epitomize.”The governor-in-wait has also rejected His Excellency title, and opted for Mr.\nIf that one is so difficult for you that you must be formal in addressing me, then you can address me as Mr. Governor.”"
  },
  {
    "headline": "Placing Ngwadom Family Claims Properly In Mbubu Amiri Ezeship Context",
    "summarized_story": "In his capacity and disposition as Eze Amiri he presided over cases most profoundly proven by the official records with Ugwu Apali ( Orlu).\nWith this, it is safe and sacrosanct to add here that Eze Ngwadom Okorie was the first Eze of Amiri clan.\nThe details were well captured in the book “History of Amiri” (Ngwadom E.).\nIt is noteworthy that Ngwadom family has been the figure head of Mbubu people and for thishas relentlessly, righteously, laid claim to the Ezeship of the Mbubu Amiri.\nUnfortunately, on the day of presentation of the certificate, Eze Ngwadom was kidnapped by a group of people led by Mr. Charles Ndobi."
  },
  {
    "headline": "Equity market: Investors reap N3.1trillion",
    "summarized_story": "In fact, the sub-sectors of the equities market have also recorded good advances.\nMost times, a rise in the price of crude has a way of impacting the equities market positively.\nThis is incontrovertible given that the country reaps more revenue which trickles down even to drag up the equities market.\nThere is also some consensus that the Russia/ Ukraine war has already started affecting markets negatively, and the Nigerian equities market is not an exception.\nBut he noted however that the policy might have the adverse effect of discouraging high-end investors including institutional investors."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Our Traditional System Back On Track , Says Makinde",
    "summarized_story": "Oyo State Governor Seyi Makinde has said his administration has put Ibadan’s traditional system back on track.\nNo matter how much we try as mortals, nothing we try to achieve will succeed without God.\nIf not for the challenges we faced, the Ibadan traditional system is such that the process of installation would take only one or two weeks.\nAnd to the glory of God, the ongoing Ibadan Week is being observed with the new Olubadan on the throne,” the governor added.\nThe CCII president, Prince Oluyemisi Adeaga, appreciated Governor Makinde for the way he settled the issues surrounding the Olubadan stool, saying that Ibadan will never forget his administration."
  },
  {
    "headline": "New Lagos Sexual Abuse Act Will Aid Dispensation Of Justice – Lawmakers",
    "summarized_story": "Chairman of Lagos State House of Assembly Committee On Women Affairs, Poverty Alleviation and Job Creation, Hon.\nMojisolaoluwa Ali Macaulay, has said the signing into law of a bill for the establishment of Lagos State Agency For Domestic Violence and Sexual Abuse will to a large extent accelerate dispensation of justice and reduce fear of reporting such cases.\nADVERTISEMENTThe lawmaker advocated that women should be given at least 20 per cent of positions in the National Assembly and other hierarchy of governments.\nWhile acknowledging the fact that women should be celebrated every day, he disagreed with the advocacy that women should be given special seats in the national assembly.\nSanai Agunbiade, Majority Leader of the House, maintained that women have a special pain threshold and are more courageous than men in terms of distress."
  },
  {
    "headline": "Olubadan Vows To Sanitise Appointment Of Title Chiefs",
    "summarized_story": "The new Olubadan of Ibadanland, Dr. Lekan Balogun, Alli Okunmade ll has said he would be holding periodic meetings with all Ibadan chieftaincy title holders from across the country to justify the purpose for which eminent personalities are honoured with chieftaincy titles.\nSpeaking through his brother, Senator Kola Balogun, who received the team on the visit, Olubadan said the periodic meetings could either be once or twice in a year to wine and dine together and ensure that the relationship between Ibadan and her chiefs was kept alive and active.\nADVERTISEMENTAmbassador Buratai had earlier described the new Olubadan as a person whose name and personality preceded his enthronement as Olubadan owing to his philanthropic gestures, detribalised posture, politics and activism.\nThe former COAS said the enthronement of Balogun as the new Olubadan, “Is a well deserved one for he has always been a man of honour with good poise and carriage that befits royalty.\nCongratulating the people of Ibadan for having Balogun as their monarch, the retired Army General said all the attributes mentioned earlier would come into play during the reign of the new king."
  },
  {
    "headline": "2023: Abisoye Fagade Joins Oyo Governorship Race",
    "summarized_story": "Marketing communications specialist and managing director, Sodium Group of companies, Abisoye Fagade has declared his interest in governing Oyo State come 2023.\nFagade who stated this at a star-studded birthday party organised for him by his friends, partner and family at the Civic Centre, Lagos, said that Oyo State needs fresh ideas and urgent solutions and strategic leadership.\nIn a speech at the event, Fagade announced the official launch of his foundation – OSMD Network, and pledged his support to the state.\n“As you already know, I have been giving back to my state and local communities in Oyo, through the Oyo Si Maa Dun project.\nThe event was well attended by political heavyweights such as Otunba Femi Pedro, former deputy governor, Lagos State; Shina Peller, member, House of Representatives; Steve Ayorinde, former Lagos State commissioner for tourism, arts and culture and Hon."
  },
  {
    "headline": "Step Down For Saraki To Fix Nigeria, Group Tells Atiku, Tambuwal",
    "summarized_story": "A political support group, Saraki Is Coming Door To Door organisation, has said that only former Senate President Bukola Saraki can fix Nigeria even as it called on former Vice President Atiku Abubakar and Governor Aminu Waziri Tabuwal of Sokoto State, to step down from the presidential race and support Saraki.\nIn a terse statement on Monday, coordinator of the group, Umar Faringado Kazaure, said the call to Atiku and Tambuwal became necessary since Saraki possesses the strength and know-how to take Nigeria out of the woods.\n“Without being immodest, Dr. Abubakar Bukola Saraki is the candidate to be beat.\nHe is the one with the strength and know-how to fix Nigeria and take the country out of the woods, a condition occasioned by the maladministration of the incumbent government of the All Progressives Congress.\nADVERTISEMENTHe added that Saraki deserve the chance to fly the PDP flag at the 2023 presidential election given his popularity among the youths and his connection with other strata of the Nigerian society."
  },
  {
    "headline": "World Court rules tomorrow in Ukraine's case against Russia",
    "summarized_story": "The International Court of Justice (ICJ) on Monday said it will rule in the case that Ukraine has brought against Russia on March 16.\nIn a hearing which was boycotted by Russia on March 7, Ukraine asked the court to order Russia to cease military activities.\nUkraine argued that Russia – which boycotted the hearing – had falsely applied genocide law to justify its invasion.\nAfter the hearing Korynevych stressed that Russia’s absence would not impact the proceedings and Moscow would have to heed any court orders.\n“They need to listen and they must listen to the court, under international law,” he told reporters."
  },
  {
    "headline": "Madrid extend lead in LaLiga",
    "summarized_story": "A second-half Karim Benzema brace and Vini Jr. strike handed Real Madrid victory at Mallorca on Monday and extended the lead at the summit to 10 points.\nTen matchdays remain in LaLiga with Madrid leading with 66 points.\nThough Madrid had the lion’s share of possession right from the get-go, they were unable to record a goal in the first half.\nReal Madrid took the lead 10 minutes after the break after Valverde pressed Baba well.\nBenzema picked up the ball on the edge of the area and played in Vini Jr., who expertly finished with his left foot, sliding the ball under Sergio Rico."
  },
  {
    "headline": "Umahi hits back: Wike's envious of my achievements",
    "summarized_story": "Ebonyi State Governor, David Umahi has hit back at Governor Nyesom Wike of Rivers State, saying he is only envious of his numerous achievements.\nWike had attacked Umahi, saying even if he goes to the Supreme Court, the PDP would be there to claim its mandate from him.\n“You have called somebody a thief in the market and you’re saying I’m sorry, it is late.\n“Not minding his looney voice, we want to emphasize that Governor Umahi and Ebonyians have absolute confidence in the Nigeria Judiciary to carry out an unbiased adjudication which would open a new vista of precedence in justice dispensation in Nigeria.\n“We also enjoin Ebonyi citizens and the reading public to disregard the hapless surmise of a man reputed for orchestration of unhealthy and brutish governance under a Democracy.”"
  },
  {
    "headline": "Russia-Ukraine War: Moscow To Suspend Instagram",
    "summarized_story": "In reaction to Facebook “temporarily” modifying its limitations to allow for calls for violence against Russian military and President Vladimir Putin, Russia has suspended the social media platform Instagram.\nIn a Telegram post on Sunday, Russia’s national regulator Roskomnadzor said that Instagram’s service will be suspended for its 80 million users on Monday.\n“Messages are circulating on the Instagram social network encouraging and provoking violent acts against Russians, in connection with which the Russian Prosecutor General’s Office demanded that Roskomnadzor restrict access to this social network,” Roskomnadzor posted on its Telegram account.\n“Roskomnadzor decided to complete the procedure for imposing restrictions on access to Instagram at 00:00 on March 14, providing users with an additional 48 hours of transition period.”In a statement on Friday, Meta’s President of Global Affairs Nick Clegg addressed the recent rule change.\n“The fact is, if we applied our standard content policies without any adjustments we would now be removing content from ordinary Ukrainians expressing their resistance and fury at the invading military forces, which would rightly be viewed as unacceptable,” Mr Clegg said on Twitter“There is no change at all in our policies on hate speech as far as the Russian people are concerned,” Mr Clegg added."
  },
  {
    "headline": "BREAKING: Finally, FG Gifts Winners Of 1994 African Cup Of Nations Houses",
    "summarized_story": "The federal government has fulfilled its promise of allocating houses in the preferred state of choice to winners of the 1994 African Cup of Nations, saying it is better late than never.\nThis was disclosed on Monday by President Muhammadu Buhari, at the official commissioning of the Housing Project under the National Housing Programme (NHP) Phase 1 in Abere, Osun State.\n“But there is more to our message of change and improving the human condition in these housing projects.\nIt provides an opportunity to remember our heroes, the valiant Super Eagles, to whom our country made a promise of providing housing for winning the 1994 African Cup of Nations, which has remained unfulfilled before now.\n“Any one of them can pick houses from any of the 36 states."
  },
  {
    "headline": "2023: Tambuwal’s Consultations In Northwest Successful",
    "summarized_story": "2023: Tambuwal’s Consultations In Northwest SuccessfulThe consultations by the Sokoto State Governor, Aminu Waziri Tambuwal, in the North West geo-political zone towards gauging whether or not to aspire to the highest office in the land in 2023 has ended on a successful note.\nTambuwal was accompanied on the visit by former Governor of Sokoto State, Alhaji Attahiru Bafarawa; Deputy Governor of Zamfara State, Mr. Mahdi Gusau; former Deputy Governor of Sokoto State, Alhaji Mukhtar Shagari; former Minister of Power, Engr.\nThe next day, Tambuwal’s consultative train moved to Kebbi State.\n“When it is time to decide who becomes our party’s Presidential candidate, we may exceed even Sokoto state.\nThe PDP in Kebbi state is compact and strong."
  },
  {
    "headline": "Abba Kyari’s Wife Slumps As Court Denies Him Bail",
    "summarized_story": "On Monday, a woman believed to be the wife of suspended Deputy Commissioner of Police, DCP, Abba Kyari, slumped in front of the Federal High Court in Abuja.\nShe slumped after Justice Emeka Nwite granted bail to Abba Kyari and six other people accused of cocaine trafficking.\nWhile armed officers of the National Drug Law Enforcement Agency, NDLEA, were escorting Kyari and the others away from the court premises, the middle-aged woman, wearing a black Hijab, passed out.\nSome NDLEA officials and attorneys carried her and rushed her inside one of the court’s offices on the third floor.\nShe was diagnosed as asthmatic at the time of filing this report."
  },
  {
    "headline": "Ekiti guber: INEC publishes final list of candidates",
    "summarized_story": "In compliance with the Electoral Act 2022, the Independent National Electoral Commission (INEC) has published the final list of candidates for the June 18 governorship election following the close of nominations by political parties.\nThe statement read: “In compliance with the Electoral Act 2022, the Commission hereby publishes the final list of candidates for the election following the close of nominations by political parties.\n“Furthermore, the attention of parties is drawn to Section 32(3) of the Electoral Act 2022, which provides that failure to notify the Commission “shall not be ground to invalidate the election”.\n“The final list is published in our State and Local Government offices in Ekiti State as well as our website and social media platforms for public information as required by law.\n“Political parties are enjoined to note the provision of the law for compliance.”"
  },
  {
    "headline": "Npower Nexit begins training nationwide *See training centres nationwide",
    "summarized_story": "The proposed Central Bank of Nigeria (CBN) empowerment options Nexit training will kick off, starting with the official launch by the Minister of Humanitarian affairs, Sadiya Umar Farouq, on Monday March 14, 2022 followed by the training across Nigeria on Tuesday.\nBlueprint gathered that the training will come in three batches of A,B,C.\nThose who are not invited in the first batch will be in the other batch as long as they have confirmed their training availability using the USSD code."
  },
  {
    "headline": "Breaking: ASUU fails to reach truce with FG, may extend strike",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) will mostly likely on Monday announce the extension of their strike after the lecturers failed to reach any truce with the federal government.\nThis is after National Executive Committee (NEC) which held between late Sunday night and early Monday morning.\nThe Union has been on one month warning strike before now.\nJust few hours ago, the federal government stated that the much-talked about UTAS, a salary payment option for lecturers has experienced failure.\nBut the leadership of ASUU countered government’s claim."
  },
  {
    "headline": "Stakeholders Reach Agreement To Prevent Shut Down Of Airlines",
    "summarized_story": "Aviation jet A1 fuel is to be sold at N500 within the next three days to prevent airlines from shutting down.\nThis is according to the Group Managing Director of the Nigerian National Petroleum Corporation, Mele Kyari after a meeting with marketers, regulators and operators in the aviation industry.\nREAD ALSO: Deputy Speaker Meets Aviation Stakeholders Over Fuel ScarcityThe meeting, which was presided over by the Deputy Speaker of the House of Representatives, Ahmed Wase, was in continuation of the investigation over the scarcity and high cost of aviation fuel, which has led to an increase in air fares.\nMr Kyari said a better pricing mechanism is to be put in place within the next three days to arrive at an acceptable price.\nHe added that airline operators will be granted license to import aviation fuel."
  },
  {
    "headline": "Buni Remains APC Caretaker Chairman – Gov Uzodimma",
    "summarized_story": "﻿Imo State Governor Hope Uzodimma on Monday said his Yobe State counterpart Mai Mala Buni remains the the Chairman of the All Progressives Congress’ Caretaker Extraordinary Convention Planning Committee.\nBuni’s position had come under scrutiny last week after Governor Abubakar Bello of Niger State assumed the Chairmanship position.\nHowever, speaking on Channels Television’s Politics Today on Monday, Uzodimma said due process will have to be followed for Buni to be removed from his position.\n“Everything going on at the secretariat now are going on with the knowledge of Mai Mala Buni.\nAnd as soon as he comes back, he will also take over the realms of the party.”To remove Buni, a meeting of the National Executive Committee must be convened, Uzodimma added."
  },
  {
    "headline": "Abba Kyari’s Wife Slumps In Court",
    "summarized_story": "Ramatu Kyari, wife of the suspended Deputy Commissioner of Police (DCP), Abba Kyari, on Monday, fainted and slumped at the Federal High Court in Abuja.\n﻿Ramatu, who wore a black hijab, fell on the floor while armed operatives of the National Drug Law Enforcement Agency (NDLEA) were leading Kyari and the others away from the court premises.\nThe NDLEA had on Monday, urged the court to deny Kyari and all the other defendants bail.\nEarlier, the two co-defendants of the Abba Kyari, pleaded guilty to parts of the drug trafficking charges brought against them.\nThe defendants, Chibuinna Patrick Umeibe and Emeka Ezenwanne, made their plea on Monday at the Federal High Court, Abuja."
  },
  {
    "headline": "ASUU Extends Strike By Eight Weeks, Accuses FG Of ‘Nonchalant Attitude’",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has extended its warning strike by eight weeks, the union said on Monday.\nASUU reached the decision after its National Executive Council (NEC) meeting held at the University of Abuja secretariat of the union following the expiration of its one-month warning strike.\n“The roll-over strike shall commence by 12.01 am on Monday, 14 March 2022.”ASUU blamed its decision on the insincerity of the government since it started the warning strike a month ago.\nRELATEDASUU Strike: FG Gives Committee Three Months To Renegotiate With UnionStrikes: Call ASUU To Order, FG Tells NLCUnfair Evaluation?\nWhile the ASUU strike lingers, members of the Senior Staff Association of Nigerian Universities (SSANU), are also threatening to down tools over agreements reached with the union."
  },
  {
    "headline": "PDP Will Crumble If I Leave – Kwankwaso",
    "summarized_story": "Former Kano State Governor, Senator Rabiu Kwankwaso, is confident that the Peoples Democratic Party (PDP) will crumble if he leaves the party.\nAlthough Kwankwaso says he is not happy with the main opposition party at the present, he affirmed that he has yet to defect from the party.\nHe made the remarks during an interview on a Channels Television programme, Political Paradigm where he spoke about his political ambitions.\nAccording to him, the NNPP which is seen as the third force will get stronger than the PDP and become the second force if he joins the party.\n“Ideally, I should be one of the most important individuals in a party like PDP,” he said."
  },
  {
    "headline": "PDP youth group mobilises for Gov Ishaku's senatorial ambition -",
    "summarized_story": "A Coalition of many political Youth groups under the aegis of the Peoples Democratic Party in Taraba State has started mobilising for the actualisation of the Senatorial ambitions of Governor Darius Ishaku and his deputy, Haruna Manu.\nThe group argued that Governor Ishaku has invested a lot in restoring peace across the State, especially in the southern senatorial zone.\nThe three senatorial districts in Taraba have produced governors since inception of this democracy.\nThe northern senatorial district produced Jolly Nyame, (8years) Sani Danladi (1year) Umar Garba (1year) while the central district produced Danbaba Suntai who spent six years in office before he was involved in an accident.\nGovernor Darius Ishaku is in his second tenure for the southern senatorial district."
  },
  {
    "headline": "APC swears in 37 State Executives in Lagos",
    "summarized_story": "The All Progressives Congress, Lagos State Chapter has sworn in 37 state executives at the party’s secretariat along Acme road, Ikeja.\nThis is coming a week after the acting national chairman of the Caretaker Extraordinary Convention Planning Committee (CECPC) caretaker committee and Niger State governor, Sani Bello sworn in 35 state chairmen at the party’s national secretariat in Abuja."
  },
  {
    "headline": "Presidential aspirant, Senator Okorocha dissects Politics of Negotiation -",
    "summarized_story": "In this edition of #PoliticsOnSunday, a former governor of Imo State and serving Senator, Rochas Okorocha, speaks on politics of negotiation ahead of the APC national convention.\nSenator Okorocha, a Presidential aspirant also added his voice to the new electoral act and some other national issues."
  },
  {
    "headline": "There's no need to remove Mai Buni as APC Caretaker Chairman",
    "summarized_story": "In this interview, Babajide Kolade-Ototiju suggests ways the ruling All Progressives Congress crisis can be resolved.\nThe veteran journalist believes that since there is not enough time between his removal and the scheduled convention date, “there is no need to remove him at this stage”."
  },
  {
    "headline": "Nigeria: Embattled Cop Abba Kyari’s Wife Slumps in Court Over Bail Application Ruling – Arise News",
    "summarized_story": "A Federal High court sitting in Abuja has fixed March 28 for ruling on the bail application by suspended deputy police commissioner Abba kyari and four other police officers.\nIn a dramatic twist of events just inside the court premises, a lady said to be the wife of Kyari, slumped and fainted upon hearing the ruling on kyari’s bail application.\nIn a viral video the woman can be seen carried out and rushed into one of the offices in the court.\nIn a dramatic twist of events just inside the court premises, a lady said to be the wife of Abba Kyari, slumped and fainted upon hearing the ruling on kyari’s bail application.\nIn a viral video the woman can be seen carried out and rushed into one of the offices in the court."
  },
  {
    "headline": "Wike Battles Shaibu, Obaseki Accuses Wike Of Being A Bully – Trending With Ojy Okpe",
    "summarized_story": "The Governor of Rivers State Nyesom Wike, described Philip Shaibu the Edo state Deputy Governor as an ingrate for threatening to leave the Peoples Democratic Party.\nIn another development, The All Progressive Congress in Ebonyi state slammed Governor Wike Over his outburst against Governor David Umahi’s defection.\nThe attorney general of the federation and minister of Justice Abubakar Malami has clarified his stance on the investigation of Abba Kyari the suspended deputy commissioner of police over his case of alleged money laundering.\nUgochukwu Ekwem the general overseer of Christ Living Hope Church was arrested by the National Drug Law Enforcement Agency for smuggling 54 sticks of cannabis that were found wrapped around his body."
  },
  {
    "headline": "Ali Ndume: Buhari Has Done Very Well in Repositioning the APC",
    "summarized_story": "However, the question of who its members should settle for as the next national chairman of the APC, appears to be up in the air as Buhari was said to have denied endorsing anyone to lead the party for the next four years.\nBuhari’s position contradicts earlier reports that he had endorsed former Governor Abdullahi Adamu of Nasarawa State to emerge as the next chairman of the APC.\nThose reported to have mounted pressure on the president to jettison Adamu as his preferred candidate for chairman are members of the defunct Congress for Progressive Change – one of the four political parties, which coalesced in 2013 to form the APC.\nPersons against the choice of Adamu would rather the contest for the post of chairman be thrown open, which will throw the zoning formula for the party’s elective offices into disarray.\nTo discuss the recent turn of events in Nigeria’s ruling party and what its members should be focused on in order to avoid the landmines that led to the PDP’s implosion before the 2015 elections, is Senator Ali Ndume, the ranking senator representing Borno South in the National Assembly and former Senate Majority Leader."
  },
  {
    "headline": "“Defection is No Grounds for Removal of Political Office Holders” – Jiti Ogunye",
    "summarized_story": "The decision of the Federal High Court in Abuja presided by Justice Inyang Ekwo to order the immediate sack of the Governor of Ebonyi and his deputy for defecting from the PDP to the APC on Barrister Jiti Oguye speaks on the legality of the defection and removal of the Ebonyi state governor David Umahi and his Deputy by the Supreme Court."
  },
  {
    "headline": "Nigeria: APC Moves to Retain Buni as Interim Chairman, Bello as Acting Chair",
    "summarized_story": "Buni had travelled for medical reasons and transmitted power to Bello in writing to act as the CECPC chairman.\nIt was gathered on Sunday that the party is maintaining the letter of transition remains in force even as Buni remains interim caretaker chairman.\nBello had announced a few days ago that he had taken over affairs at the APC national headquarters, disclosing that he was acting as Chairman in the absence of Buni.\nAccording to one of the sources, some of the president’s associates noted that by the framework of the Party’s NEC, Buni was never removed as CECPC chairman.\nCertainly, if he personally withdraws, resigns or a NEC meeting takes place to remove him, then we can be talking about having a new CECPC chairman."
  }
]