[
  {
    "headline": "Okagbare: Nigeria disqualified from World Championships women’s relay",
    "summarized_story": "Nigeria have lost their potential qualification place for the women’s 4×100-metre relay at next month’s World Athletics Championships in the United States of America.\nAccording to him, this is because Blessing Okagbare, who was part of the team that secured Nigeria’s qualification, was found to have committed anti-doping rule violations.\nHe explained that six days after Okagbare evaded sample collection in June 2021, she competed in the 4x100m relay event at the Nigeria Olympic Trials, with her relay squad qualifying for this year’s World Championships.\n“In a relay team, if one member violates the anti-doping rules, everyone bears the brunt of results being expunged.\nAccording to a copy of the document obtained by our correspondent, Okagbare is deemed to have admitted the anti-doping rule violations (under Rule 2.3 and Rule 2.5 of the World Athletics Anti-Doping Rules) and to have accepted the consequences."
  },
  {
    "headline": "Scarcity: FG to sanction erring fuel stations, maintains N165 pump price",
    "summarized_story": "The Federal Government has threatened to sanction any fuel stations or depot selling above the stipulated approved pump price of Premium Motor Spirit (PMS).\nMr Farouk Ahmed, Authority Chief Executive, Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) gave the warning on Monday during a joint inspection on fuel stations in Abuja.\nThe revised freight rate of PMS took effect from June 1, still maintaining the current regulated pump price of N165 per litre.\nNAN reports that the fuel stations inspected were Shafa Energy, Shema, Ardova Plc.\nand NIPCO fuel stations on Lugbe – Airport Road."
  },
  {
    "headline": "Irabor to AGF: Does Zamfara gov have powers to tell people to carry gun?",
    "summarized_story": "Speaking at the opening of a Joint Exercise for the National Defence College and War Colleges of the Armed Forces of Nigeria, code named “Exercise Grand Nationale,” in Abuja, Irabor said the directive to citizens was not right, as the armed forces and other security agencies were there to handle the challenges.\n“I believe that, in my view, it is not the right way to go.\n“Of course, there are actions that members of the security agencies and the armed forces, in particular, the police and other security agencies, are doing to address insecurity in Zamfara and environs.\nHis words, “I believe that what we are doing in Zamfara and of course, across the states of the federation, is in deference to the provisions of the constitution.\n“So, we are there because we are there to give support to the civil authority, in this case, the police."
  },
  {
    "headline": "Osun polls: PDP sets up 128 member campaign council",
    "summarized_story": "CHIEF BARR.\nDR. SAMUEL ORTOM MEMBER10 H.E.\nTAOFEEK ARAPAJA MEMBER15 SEN. SAMUEL N. ANYANWU MEMBER16 ARCH.\nOLASOJI ADAGUNODO MEMBER18 CHIEF DR. ALI OBASI ODEFA MEMBER19 CHIEF DAN OSI ORBIH MEMBER20 HON.\nBENSON AMUWA MEMBER122 CHIEF MRS. AYO AWOLOWO MEMBER123 DR. B.T."
  },
  {
    "headline": "Uzodimma’s Political Adviser resigns",
    "summarized_story": "By Chinonso AlozieThe Imo state governor, Hope Uzodimma’s Special Adviser on Political Matters, Batos Nwadike, on Monday resigned from his position alleging that the government of Uzodimma, was not running inclusive governance.\nYour political opponents have been my political opponents and your allies have been my allies.\nI have been appalled not merely for my political interest but on account of common decency.\nReacting, the Imo state governor, through his State Commissioner for Information and Strategy, Declan Emelumba, said: “The state government has received the resignation letter of Batos Nwadike as the Special Adiviser to the Governor on Political Afffairs.\nHis Excellency, the Governor of Imo state Senator Hope Uzodimma has accepted his resignation."
  },
  {
    "headline": "Hijab: MSSN urges Lagos govt to sanction erring principals",
    "summarized_story": "He said, “This is not to castigate the Lagos State Government but to appeal for the prompt implementation of the Supreme Court judgement.\nThe majority decision affirmed the earlier Court of Appeal’s decision which restored the use of hijab by female Muslim students in Lagos State.\n“For no reason should a girl-child be denied education again in Lagos State and Nigeria as a whole.\n“We demand that the Lagos State Government issue a circular within 30 days after the delivery of the judgement allowing Hijab.\nOn his part, the National Amir of MSSN, Uthman Abubakar, lamented that Muslim students have for long suffered discrimination."
  },
  {
    "headline": "Kwara: NPC Federal Commissioner issues matching order to trial census functionaries",
    "summarized_story": "The Federal Commissioner, National Population Commission, NPC, Alhaji Abdulrazaq Folorunsho Gidado, has issued a matching order to functionaries of the trial census to quit if they are not prepared for the job.\nIn Kwara Central Senatorial District, the exercise will hold in Ilorin South, Ilorin East and Asa Local Government Areas, while Oyun, Ekiti and Oke-Ero Local Government Areas have been designated for the exercise in Kwara South Senatorial District.\nFor Kwara North Senatorial District, the Commissioner, said the exercise will hold in Edu, Moro and Baruten Local Government Areas of the state.\n“In total, 4,608 enumeration areas have been selected for this trial census to test run their suitability and readiness for the actual census,” he added.\nGidado further informed that the commission will use a total of 13,500 field functionaries comprising 11,510 enumerators, 1,529 supervisors and 823 facilitators for the trial census."
  },
  {
    "headline": "Osun 2022: INEC, CSOs partner to sensitize electorate on invalid votes",
    "summarized_story": "Ahead of the gubernatorial election in Osun State, the Independent National Electoral Commission, INEC and Civil Society Organisations met to foster peace and boost inclusive election at the grassroots.\nThe objective was also to have a peaceful election, to have an inclusive governorship election and reduce, if not eliminated, invalid votes.\nSpeaking at the programme in Osogbo on Monday tagged: ‘One-Day Discourse By INEC/CSO For Peaceful Osun Governorship Election’, Ndidi Okafor who is the Deputy Director of CSO/INEC said the gathering is tilted towards a peaceful election.\nThe sensitization would be taken to citizens in Osun State, who have registered and have collected their PVCs.\nIf you sell your vote then you don’t have moral rights to make demands anymore from those you elected."
  },
  {
    "headline": "Terrorists own guns, Nigerians should carry too – Yoruba council backs Zamfara govt",
    "summarized_story": "The council of the Aare Onakakanfo of Yorubaland has hailed the decision of the Zamfara State Government to approve gun licenses.\nThe government gave the approval to enable individuals to carry a firearm for defence against terrorists.\nIn a statement on Monday, the Gbonka Aare-Onakakanfo, Gboyega Adejumo urged South-West governors to take a cue from Zamfara.\nThe Yoruba chiefs warned them to stop tolerating the activities of terrorists “masquerading as bandits and kidnappers, killing innocent people at will”.\nThe chiefs urged South-West governors to ensure the South West Security Stakeholders Group (SSSG) and the Western Nigeria Security Network (Amotekun) close ties to further secure the region."
  },
  {
    "headline": "1.3 tons of drugs exhibits seized, 500 offenders arrested in Katsina – NDLEA",
    "summarized_story": "The Katsina State Command of the National Drug Law Enforcement Agency (NDLEA) has seized a total of 1,310.3184 KG of drug exhibits, amounting to about 1.3 tons in the State.\nThe seized exhibits consist of 1,294.131KG of Cannabis Sativa, 16.2KG of psychotropic substances and 105 litres of codeine.\nIbrahim further disclosed that its operatives arrested over 500 suspected drug dealers and traffickers in the process.\nIn addition to that, he said the Katsina NDLEA Command also counseled and rehabilitated 388 substance users within the period under review.\nMasari, who was represented by the State Commissioner for Health, Engineer Yakubu Nuhu Danja, said the state government will continue to support the state command of the NDLEA."
  },
  {
    "headline": "Parents accuse FG college of negligence over death of schoolgirl in Akwa Ibom",
    "summarized_story": "Parents of students at the Federal Government College (FGC), Ikot Ekpene Local Government Area of Akwa Ibom State have accused the school authority of negligence following the death of a Junior Secondary One, JSS1 student, Rita Emmanuel, over the weekend.\nIt was further gathered that the girl was also taken to a hospital on referral but was later pronounced dead by the doctor.\nAnother parent, Enobong Bassey, lamented that, “This is a clear case of avoidable death.\n“When my husband tried to arrest the student, the school management promised to handle it.\nThe following morning, while her house mistress was on routine check, she ordered that Rita be taken to the sickbay."
  },
  {
    "headline": "Ekweremadu, wife ask court to compel NIMC, NIS, UBA, others to provide details of organ 'donor' The Nation Newspaper",
    "summarized_story": "Named with NIMC as respondents in the suit are the Comptroller General (C-G), Nigeria Immigration Service (NIS); Stanbic-IBTC Bank; United Bank of Africa (UBA) and Nigeria Inter-Bank Settlement System Plc.\nThey stated among the grounds, that the information/documents required from the respondents are needed for their defence in the case against them in a United Kingdom court.\n“David Nwamini Ukpo, offered to donate one of his kidneys for the daughter of the applicants if his kidney is compatible with that of Miss Sonia Ekweremadu.\n“David Nwamini Ukpo informed the applicants that he is Twenty One (21) years of age having being born In the year 2000.\n“The said David Nwamini Ukpo is presently in care in the custody of British Authorities and he cannot be accessed by the applicants."
  },
  {
    "headline": "BDCs eye $20b Diaspora market for forex inflows The Nation Newspaper",
    "summarized_story": "Gwadabe said globally, BDCs remain one of the channels through which the diaspora remittance funds come into countries.\nHe said success of BDCs would be boosted by access to multiple streams of forex earnings to deepen the market, keep the naira stable and boost BDCs operations.\n“Making BDCs one of the channels through which over $20 billion annual Diaspora remittances enter the economy will give depth to forex market and boost BDCs operations.\nNigerian BDCs operators have also identified with the immense opportunities presented by Diaspora remittances and want to play greater role in attracting more foreign capital into the economy.\nGwadabe said Nigeria’s huge population and diaspora market, which attracts an average of $20 billion yearly could be explored to deepen dollar inflows to the economy."
  },
  {
    "headline": "Industrial & Medical Gases’ shareholders get 20% bonus shares The Nation Newspaper",
    "summarized_story": "Shareholders of Industrial & Medical Gases Nigeria (IMG) Plc at the weekend approved the distribution of bonus shares as scrip dividends for the 2021 business year.\nShareholders will receive a bonus share for every five shares held as at the qualification date.\nShareholders lauded the bonus shares as a strategic decision to reinvest profit in building a stronger financial base in the nearest future.\nChairman, Industrial & Medical Gases Nigeria (IMG) Plc, Mr Abiodun Alabi, explained that IMG posted remarkable profits despite the inclement operating environment and the constraints in the gas industry.\nManaging Director, Industrial & Medical Gases Nigeria (IMG) Plc, Mr Ayodeji Oseni, outlined that IMG’s strategic objectives were to position it for global competitiveness and enhanced shareholder value through creation of innovative products and services."
  },
  {
    "headline": "Forex shortage heightens Nigeria’s macroeconomic risks The Nation Newspaper",
    "summarized_story": "Naira weakens to N614 per dollarNigeria may slip to lowest global rankingPersistent foreign exchange (forex) shortage has heightened apprehensions over the stability of Nigeria’s macroeconomic outlook as the country struggles to cope with gaps at the forex market.\nNigeria has been rationing dollars because of lower oil income that accounts for about 90 per cent of foreign exchange earnings.\nThe nation’s foreign exchange reserves have dropped four per cent this year to $38.8 billion, despite the government tapping the overseas bond market twice.\nCordros Capital reported at the weekend that Nigeria’s foreign exchange reserves recorded another accretion this week, as it grew by $220.04 million week-on-week to $38.88 billion.\n“Given the difficulty in repatriating funds from Nigeria, this has placed the MSCI Nigeria Indexes in the crosshairs."
  },
  {
    "headline": "Telecom companies’ assets hit N3.96tr The Nation Newspaper",
    "summarized_story": "Nigeria’s mobile network operators (MNOs) last year recorded 14.86 per cent increase in total assets, despite global challenges and domestic inflationary trend that impacted operating expenses.\nThe report also showed total operating cost (opex) of N1.658 trillion in 2021 compared with N1.395 trillion recorded the previous year.\nThe teledensity was 102.40per cent in 2021 as against 107.18per cent recorded in 2020, which indicates a decrease of 4.78 per cent in Teledensity as at last December.\nThis indicates a 4.5per cent loss in GSM active voice subscriptions year on year.\nIn that order MTN; GLO; AIRTEL and EMTS had 37.7per cent; 28.1per cent; 27.6per cent and 6.6per cent share of the mobile GSM market respectively of the Mobile GSM Market Segment."
  },
  {
    "headline": "Untold story of CJN’s resignation",
    "summarized_story": "Born on December 31, 1953 his resignation came about 18 months ahead of the mandatory retirement age of 70 years.\nAlthough he cited health condition as grounds for his resignation, there are speculations that his decision may not be unconnected with raging crisis at the apex court.\nThe letter which was leaked to the public further fueld the impasse between him and his brother Justices.\nThat is what I will do especially with the cooperation of my brother Justices of the Supreme Court.\nWe shall not fail Nigerians.”On how he intends to handle the controversy in the Supreme Court, he said: “There is no controversy in the Supreme Court."
  },
  {
    "headline": "Obasanjo under fire over comment on Atiku",
    "summarized_story": "From Noah Ebije, KadunaChairman, Board of Trustees (BOT) of Peoples Democratic Party (PDP), Senator Walid Jibrin, has tackled the former president, Olusegun Obasanjo, over recent comments that he made a mistake choosing Atiku Abubakar as vice president in 1999.\nSenator Jibrin, second republic lawmaker, said if the former president failed to clarify the statements within 48 hours, the party would be left with no option than to expose him (Obasanjo) and tell Nigerians his true colour when he ruled the country for eight years.\nHe pointed out that if not for Atiku that kicked against third term agenda under Obasanjo government between 1999 and 2007, the country would have suffered unimaginable crisis.\n“There is no doubt Obasanjo may still be angry with Atiku even after helping him to succeed but perhaps for truncating his third term agenda.\nIn any case, Alhaji Abubakar Atiku is our presidential candidate and I can tell you for sure that he will be the president in 2023 insha Allah”."
  },
  {
    "headline": "Insecurity worsening, SMBLF tells Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Southern and Middle Belt Leaders’ Forum (SMBLF) has declared that insecurity across the nation was getting worse under the watch of President Muhamadu Buhari’s administration.\nThe Forum also denounced the spate of targeted terrorist attacks on churches and abduction of church leaders.\nThe Forum also condemned the incessant killings of indigenous peoples and decimation of communities in the Middle Belt region, in particular, the current escalated war on Southern Kaduna, targeting communities and Churches in Kajuru Local Government Area with reports of helicopters dropping weapons and supplies to terrorists in their locations.\nSMBLF equally decried the continued confinement of victims of the Kaduna train attack in the terrorists’ labyrinth after 89 days as well as several other Nigerians who have been held by terrorists and criminals for months; calling on the Federal Government and security agencies to secure the safe release of all victims.\nIt warned that the ambiguity of the Federal Government and the failure of the security agencies to decisively deal with these situations, buttress concerns that officials of the Federal Government and security agents are complicit in the security anomalies in the country."
  },
  {
    "headline": "State police not self defence –Akeredolu",
    "summarized_story": "However, Chairman, Southern Nigeria Governors Forum and Ondo State Governor, Rotimi Akeredolu, reiterated the need for the establishment of state police saying it was the panacea to the spate of insecurity ravaging the country.\nThe government and the people of Zamfara State have been pushed to the wall.\n“The directive of the state governor to the Commissioner of Police to issue licenses to qualified citizens to bear arms in the defence of their immediate environments and the state in general is commendable.\nBut the NSA and Inspector General of Police may have to issue licence to possess a certain category of arms.\nTherefore, this directive, attractive and compelling in the current circumstances, may be stifled by existing federal arrangement.”"
  },
  {
    "headline": "We’ve not abandoned Ekweremadu –Ohanaeze",
    "summarized_story": "From Geoffrey Anyanwu, EnuguOhanaeze Ndigbo, yesterday, said it has not abandoned Senator Ike Ekweremadu who is facing trial in the United Kingdom over alleged organ harvest of a minor.\nThe apex Igbo socio-cultural organisation debunked insinuations that it has disowned Ekweremadu following his ordeal, attributing the remarks to the handiwork of impostors.\nA statement by the National Publicity Secretary of the group, Alex Ogbonnia, said while it owed it a duty to stand with its own, especially in times of difficulty, it was, however, not in its character to hurriedly make statements over issues it lacked sufficient facts.\nOgbonnia expressed concerns over Miss Sonia Ekweremadu and fervently prayed that Ekweremadu, his wife, Lady Nwanneka and family would overcome the current travails.\n“It is noteworthy that eminent Igbo patriots have at one time or the other, pleaded with impostors and pretenders to desist from reckless and unguarded statements that portray the Igbo in a bad light using the platform of the Apex Igbo socio-cultural organisation, the Ohanaeze Ndigbo Worldwide."
  },
  {
    "headline": "Super Falcons Arrive Morocco in Search of 10th Continental Title – THISDAYLIVE",
    "summarized_story": "Duro IkhazuagbeNigeria’s Super Falcons flew into Casablanca yesterday enroute Rabat, Morocco, one week before the kickoff of the 12th Women’s Africa Cup of Nations.\nThe Nigerian ladies are also scheduled to play Botswana on Thursday, July 7 and complete the group phase with Burundi on Sunday, July 10.\nBefore flying out of Lagos, Super Falcons were serenaded with a send-forth sumptuous dinner at Eko Hotel & Suites in Lagos on Sunday night by President of the Nigeria Football Federation and FIFA Council Member, Mr Amaju Melvin Pinnick.\nHe however admonished the Falcons not to think they will have a smooth sail to their 10th trophy without stiff opposition.\n“Surely, there will be teams that would believe they can topple you from your throne; from your position as champions."
  },
  {
    "headline": "Okagbare’s Ban Disqualifies Nigeria from World Championships’ Women’s 4x100m – THISDAYLIVE",
    "summarized_story": "Sadly for Nigeria, this decision against the former Nigerian and African champion, the country has lost the opportunity to field her ladies for the women’s 4x100m relay at next month’s World Athletics Championships in Oregon, USA.\n“This is because six days after Okagbare evaded sample collection (13 June 2021), she competed in the 4x100m relay event at the Nigeria Olympic Trials, with her relay squad qualifying for this year’s World Championships,” observed the AIU last night.\n“Therefore, all individual and relay results involving Okagbare, from 13 June 2021, are now disqualified under the rules,” concludes the statement from AIU last night.\nOkagbare was suspended on July 31, 2021 from the semi finals of the women’s 100m of the last Olympic Games in Tokyo.\nUnited States Department of Justice under the Rodchenkov Act picked Mr Lira for his involvement in supply of performance-enhancing drugs to athletes."
  },
  {
    "headline": "VIP Shelter for Abuja Stadium Delivered – THISDAYLIVE",
    "summarized_story": "The Permanent Secretary of the Federal Ministry of Youth and Sports Development, Alhaji Ismaila Abubakar, has taken delivery of a world-class, FIFA standard VIP team shelter for the Moshood Abiola National Stadium, Abuja.\nThe facility, which is the first of its kind in the country, is a new customised portable VIP facility(FIFA designed and approved) with ergonomic seat and back in Nigeria’s green and white colourful.\nAkanni, a former Nigerian international played for both the Flying Eagles and Super Eagles before traveling abroad for further studies.\nHe commended the Sports Ministry for doing everything to give the Abuja stadium the very best of facilities.\nThe Permanent Secretary, Alhaji Abubakar used the occasion to thank President Muhammadu Buhari for his commitment to developing sports infrastructure for Nigerian youth and also highlighted the foresight of the Minister Sunday Dare in rehabilitating the Moshood Abiola National Stadium, Abuja."
  },
  {
    "headline": "Transfer News: Chelsea Contact City over Sterling – THISDAYLIVE",
    "summarized_story": "Chelsea have made contact with Manchester City about a move for England forward Raheem Sterling.\nSterling, who joined from Liverpool in a £49m deal in 2015 and has scored 131 goals in 339 games, is a major transfer target for new Blues owner Todd Boehly.\nIt is understood Chelsea are yet to lodge a formal bid for the 27-year-old, but one is expected shortly.\nHe could be the Blues first major signing since they were taken over by a consortiumled by Boehly in May.\nSince Pep Guardiola became manager in 2016, only Sergio Aguero (124) has scored more goals for City than Sterling (120)."
  },
  {
    "headline": "Masai Ujiri Receives Honorary Doctorate Degree from University of Toronto – THISDAYLIVE",
    "summarized_story": "President of Toronto Raptors, Masai Ujiri, has been conferred with a Doctor of Laws (honoris causa) by the University of Toronto.\nThe former D’Tigers player was honoured for his achievements as an NBA team president and a humanitarian committed to meaningful social change.\nHe was lured to the Denver Nuggets with a paid position and, over the next several years, worked in increasingly senior jobs for Denver and the Toronto Raptors before being named the Raptors’ president and general manager in 2013.\nHe was the first African to lead a North American major-league sports team – a distinction that Ujiri struggles with.\n“It’s fine, being the first – I have a problem with being the only one.”In his senior role, Ujiri says it’s his responsibility to promote diversity."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "PDP gives Obasanjo 48 hours to clarify comment on 'regrettable' choice of Atiku as VP",
    "summarized_story": "The Peoples Democratic Party (PDP) has asked former President Olusegun Obasanjo to clarify his recent comments on regretting picking Atiku as vice-presidential candidate in 1999.\nFor instance, one of the mistakes I made was picking a number two when I was going to become president,” Obasanjo said.\nAtiku Abubakar, the PDP presidential candidate for the 2023 general election, was vice-president during the Obasanjo administration from 1999 to 2007.\nAdvertisement“Obasanjo should come out and clarify the statement — whether he was misquoted or he meant what he said,” Jibrin said.\n“I will also tell Nigerians and the whole world who Obasanjo is, how Atiku assisted him to rule Nigeria, and how Atiku refused his third term ambition."
  },
  {
    "headline": "PDP gives Obasanjo 48 hours to clarify comment on 'regrettable' choice of Atiku as VP",
    "summarized_story": "The Peoples Democratic Party (PDP) has asked former President Olusegun Obasanjo to clarify his recent comments on regretting picking Atiku as vice-presidential candidate in 1999.\nFor instance, one of the mistakes I made was picking a number two when I was going to become president,” Obasanjo said.\nAtiku Abubakar, the PDP presidential candidate for the 2023 general election, was vice-president during the Obasanjo administration from 1999 to 2007.\nAdvertisement“Obasanjo should come out and clarify the statement — whether he was misquoted or he meant what he said,” Jibrin said.\n“I will also tell Nigerians and the whole world who Obasanjo is, how Atiku assisted him to rule Nigeria, and how Atiku refused his third term ambition."
  },
  {
    "headline": "Ekweremadu asks court to order NIMC, immigration to release biodata of 'kidney donor'",
    "summarized_story": "Ike Ekweremadu, former deputy senate president, and his wife, Beatrice, have sued the National Identity Management Commission (NIMC) over the controversy surrounding the real age of David Ukpo.\nThe former deputy senate president and his wife were recently arrested for allegedly bringing a child to the UK for organ harvesting.\nHowever, according to a letter seen by TheCable, Ekweremadu had written to the UK high commission to support the visa application of a “kidney donor” for his daughter Sonia.\nThey also sought an order directing the NIS comptroller-general to supply the applicants with Ukpo’s documents and application form presented for the issuance of his international passport.\n“After conducting various medical tests, the Royal Free Hospital in London decided that the said David Nwamini Ukpo was not a suitable donor because his kidney is not compatible with that of Sonia Ekweremadu,” he said."
  },
  {
    "headline": "Ekweremadu asks court to order NIMC, immigration to release biodata of 'kidney donor'",
    "summarized_story": "Ike Ekweremadu, former deputy senate president, and his wife, Beatrice, have sued the National Identity Management Commission (NIMC) over the controversy surrounding the real age of David Ukpo.\nThe former deputy senate president and his wife were recently arrested for allegedly bringing a child to the UK for organ harvesting.\nHowever, according to a letter seen by TheCable, Ekweremadu had written to the UK high commission to support the visa application of a “kidney donor” for his daughter Sonia.\nThey also sought an order directing the NIS comptroller-general to supply the applicants with Ukpo’s documents and application form presented for the issuance of his international passport.\n“After conducting various medical tests, the Royal Free Hospital in London decided that the said David Nwamini Ukpo was not a suitable donor because his kidney is not compatible with that of Sonia Ekweremadu,” he said."
  },
  {
    "headline": "CJN resignation: Public confidence in judiciary at all-time low, says NBA",
    "summarized_story": "Olumide Akpata, president of the Nigerian Bar Association (NBA), says public confidence in the judiciary is currently at “an all-time low”.\nFourteen justices of the supreme court had accused the CJN of abandoning his responsibility as the leader of the court.\nIn the statement, Akpata thanked the retired CJN for his service to the nation and prayed for his quick recovery.\n“Beyond this, there is near universal agreement that public confidence in the judiciary and indeed the legal profession is at an all-time low.”The NBA chairman added that “there is now more than ever the need for urgent reforms in the judiciary and to rebuild the almost dissipated confidence that Nigerians have in the judiciary and the wider legal profession in Nigeria”.\n“These should form the immediate first tasks for honourable Mr Justice Olukayode Ariwoola, who is expected to now take over as the acting chief justice of Nigeria,” he said."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "MTN alleges $53.7 million mobile money fraud",
    "summarized_story": "Telecommunications MTN has reportedly taken 18 Nigerian banks to court over a ₦22.3 billion ($53.7 million) mobile money fraud.\nAccording to the suit dated May 30, MTN is alleging that its recently-licensed mobile money Payment Service Bank, MoMo, has suffered a fraudulent loss from its partner banks.\nUpon realising the fraud on May 24, MoMo PSB reportedly shut down its service to prevent further liability.\nMoMo PSB is now seeking a court’s order for a refund for the ₦22.3 billion ($53.7 million) it claims.\nThis event is coming 2 months after MTN gained approval from the Central Bank of Nigeria to run a payment service bank."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Obaseki pays harmonized pension to Edo retirees – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn fulfillment of the implementation of the harmonized pension announced on Workers’ Day, Governor Godwin Obaseki has paid verified pensioners in the state their pension for the month of June, reflecting the harmonized rate.\nIn a statement, Secretary to the State Government, Osarodion Ogie said: “With the approval of the Edo State Governor, Mr. Godwin Obaseki for the harmonization of monthly pension, retirees with the state government who took part in the last verification exercise held across the state, have been paid their pension for the month of June, today, June 27, 2022, reflecting the harmonized rate.”He added, “The payment of the harmonized pension to the verified retirees is in line with the government’s commitment to provide succour to pensioners, who are overburdened with the weight of the harsh economic realities in the country.”Governor Obaseki had on Workers Day announced the payment of harmonized pension to retirees in the state after 21 years, as well as the increment of the minimum wage in the state from N30,000 to N40,000.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "How Rev Father, four others were killed in Edo kidnap – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- At least, three lives including that of two suspected kidnappers were lost when gunmen abducted and killed the parish priest of St Michael Catholic church, lkhabigbo , Etsako West local government area of Edo state, Rev Father Christopher Odia, last Sunday.\nIt was gathered that the Rev Father was in his rectory about to go out for mass on Sunday June 26, 2022 when the gunmen struck.\nIt was scooped that the said Kabiru, an old Fulani man in the community connived with four other Fulanis in Aviele town to kidnap the Rev Father.\n‘In fustration, the kidnapped Rev Father Christopher Odia was killed by his abductors.\nCP Abutu further encouraged Edo state people not to relent in providing the police with prompt and useful information."
  },
  {
    "headline": "Police kill 2 robbery suspects in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Police Command says its operatives have killed two armed robbery suspects in a gun duel in Benin City.\nThe police command further stated that the two suspects were members of a robbery gang that robbed an Oil and Gas station Off Murtala Mohamed way Benin City, yesterday.\n“The Armed robbers were later successfully trailed to a different location where they were carrying out another Armed Robbery operation.\n“On sighting the team of Security Operatives, the armed robbers opened fire on them which led to a gun duel.\n“The two suspected Armed robbers were taken to the Police Cottage hospital in Benin city where they were confirmed dead by the doctor and their bodies deposited at the mortuary”."
  },
  {
    "headline": "Firm invests N24bn in integrated farm in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestSaro Group of Companies has invested not less than N24bn in an integrated farm in Edo State, in a concerted effort to boost local production of raw materials for use in the manufacturing sector, especially the food and beverages sub-sector.\nMr. Sarumi said the project is valued at N24 billion, adding, “This is an integrated agricultural project.\nAccording to him, “It’s a very innovative finance method; the first to be used by a state government in Nigeria.\nThe federal government does tax credit for big, large corporate organizations but here, we, as a state, have been able to attract an investor and used his tax credit to enhance infrastructural development in the state.\nThese projects were conceptualized about five years ago but construction could not commence until last year due to various challenges.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "10.4m more Nigerians have done voter registration – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) has revealed that over 10 million new voters have registered in the ongoing Continuous Voter Registration (CVR) exercise across the country.\nA breakdown of the figure showed that while fresh registrants hit 10,487,972, completed registration was pegged at 8,631,696.\nOnline registration as of 7 am, Monday 27th June 2022 was pegged at 3,250,449, and physical registration, at 5,381,247.\nBefore now, the electoral body has said extending the voters’ registration was now inevitable following a surge in interest and calls by Nigerians for the exercise to be extended.\n“But we are convinced, given the enthusiasm of Nigerians, given the new resolve of Nigerians to register, that an extension is inevitable."
  },
  {
    "headline": "Doping: Okagbare’s ban extended to 11 years",
    "summarized_story": "The Athletics Integrity Unit has extended the ban on Blessing Okagbare, Nigerian athlete, to 11 years.\nThe 2008 long jump silver medalist was previously suspended for 10 years for doping in February 2022.\nBut the AIU in a document obtained on Monday added one additional year to Okagbare’s ban after she allegedly failed to respond to the charges by the extended deadline -June 21, 2022.\nThe document said Okagbare is deemed to have admitted the anti-doping rule violations (under Rule 2.3 and Rule 2.5 of the World Athletics Anti-Doping Rules) and to have accepted the consequences.\n“This decision constitutes the final decision of the AIU pursuant to Rule 8.5.6 ADR."
  },
  {
    "headline": "Supreme Court controversy: NBA demands urgent reform of the judiciary",
    "summarized_story": "The President of the Nigerian Bar Association (NBA), Olumide Akpata, has demanded urgent reforms in the judiciary.\nAkpata made the demand on Monday while reacting to the unceremonious exit of the embattled Chief Justice of Nigeria (CJN), Tanko Muhammad.\nIt would be recalled that fourteen justices of the Supreme Court had last week accused the CJN of abandoning his responsibility as the leader of the court.\nReacting to the development, the NBA president while lamenting that the public had lost confidence in the judiciary, demanded urgent reforms in the sector.\n“These should form the immediate first tasks for honourable Mr Justice Olukayode Ariwoola, who is expected to now take over as the acting chief justice of Nigeria."
  },
  {
    "headline": "Police arrest herders who stabbed man to death over cow in Lagos",
    "summarized_story": "The Lagos State police command has arrested two herders at the Age Mowo area of Badagry for stabbing a man to death over a cow.\nThe cattle herders were taken into custody on Monday over the alleged killing of a man.\nLagos police spokesman, SP Benjamin Hundeyin who provided details of the incident said the herders stabbed a man they mistook for the bus conductor and not the conductor himself.\n“The two cattle herders attacked someone they mistook for the vehicle conductor, resulting in his death.\nThe command said it is false that the victim was turned back when he sought refuge in a police station."
  },
  {
    "headline": "Tinubu graduated with honours from our institution, says Chicago State University",
    "summarized_story": "The Chicago State University on Monday reaffirmed that the presidential candidate of the All Progressives Congress (APC), Asiwaju Bola Tinubu, attended the university.\nHowever, the official in charge of the office of Records and Registration of Chicago State University, Caleb Westberg, confirmed Tinubu’s attendance in a terse email response on Monday.\nWestberg also confirmed that Tinubu was awarded a Bachelor of Science degree in Business Administration with Honours.\nA. Tinubu attended Chicago State University from August 1997 – June 1979.\nHe was awarded a Bachelor of Science degree in Business Administration with Honours on June 22, 1979."
  },
  {
    "headline": "NNPC Achieved This By Teamwork",
    "summarized_story": "BY NSE ANTHONY-UKO, AbujaThe group managing director of the Nigerian National Petroleum Company (NNPC) Limited, Mallam Mele Kyari has attributed the LEADERSHIP Award to the teamwork of the management and staff of the company, noting that the recognition would not have been possible without the collective efforts of all NNPC staffers.\nKyari emerged LEADERSHIP CEO of The Year2021 for his strategic intervention in turning the NNPC into a profit-making national oil company and driving the present administration’s gas revolution among other innovations.\nHe said, “They (multinational oil companies) know that we have better-skilled people in NNPC than they do.\nEarlier, the Editor-in-Chief of LEADERSHIP, Mr Azu Ishiekwene told the NNPC Management that the award was in recognition of Kyari’s modest efforts in repositioning the NNPC and putting it on the path to profitability.\nMr Ishiekwene was accompanied on the visit by the group managing director, LEADERSHIP Group Ltd, Muazu Elazeh and director, LEADERSHIP Group Ltd, Mr Abraham Nda-Isaiah."
  },
  {
    "headline": "JUST-IN: Terrorists Kidnap DPO On His Way To Resume Duty In Kaduna",
    "summarized_story": "A newly posted Divisional Police Officer (DPO) to Birnin Gwari local government area of Kaduna State, ‎has been abducted.\nThe DPO was abducted along the notorious Kaduna-Birnin Gwari highway around 9am on Monday on his way to assume duty at his new place of assignment, according to sources who confirmed the incident to journalists on condition of anonymity.\nAlthough it was not clear whether the police officer was travelling alone in the vehicle when he was abducted or not, as the Kaduna State Police Command was yet to issue an official statement on the development.\nRecall that the Birnin Gwari local government area of the State has been in the news lately for various attacks and abductions by terrorists, and it was on Sunday that a Terrorist group known as Ansaru issued a statement banning political activities in some communities of the local government area.\nMeanwhile, when contacted on his mobile phone for reaction, the Police Public Relations Officer (PPRO) of Kaduna Command, DSP Mohammed Jalige, neither not pick his calls nor return calls placed to his known mobile line by our correspondent as the time of filing this report."
  },
  {
    "headline": "JUST-IN: Terrorists Kidnap DPO On His Way To Resume Duty In Kaduna",
    "summarized_story": "A newly posted Divisional Police Officer (DPO) to Birnin Gwari local government area of Kaduna State, ‎has been abducted.\nThe DPO was abducted along the notorious Kaduna-Birnin Gwari highway around 9am on Monday on his way to assume duty at his new place of assignment, according to sources who confirmed the incident to journalists on condition of anonymity.\nAlthough it was not clear whether the police officer was travelling alone in the vehicle when he was abducted or not, as the Kaduna State Police Command was yet to issue an official statement on the development.\nRecall that the Birnin Gwari local government area of the State has been in the news lately for various attacks and abductions by terrorists, and it was on Sunday that a Terrorist group known as Ansaru issued a statement banning political activities in some communities of the local government area.\nMeanwhile, when contacted on his mobile phone for reaction, the Police Public Relations Officer (PPRO) of Kaduna Command, DSP Mohammed Jalige, neither not pick his calls nor return calls placed to his known mobile line by our correspondent as the time of filing this report."
  },
  {
    "headline": "I’m Committed To Advancing Judicial Independence, Atiku Assures New Acting CJN",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party (PDP) for the 2023 elections, Alhaji Atiku Abubakar, has commended the immediate-past Chief Justice of Nigeria (CJN), Justice Tanko Muhammad, for his service to the nation.\nThis is even as Atiku, a former vice president of Nigeria, also assured the newly appointed acting CJN, Justice Olukayode Ariwoola, of his commitment to advancing judicial independence and the promotion of separation of powers among the three arms of government.\nAtiku, who took to his verified Facebook page on Monday evening to react to the change of baton at the highest level of the nation’s Judicial arm, added that he wished the new acting CJN success in his new assignment.\nThe PDP presidential candidate wrote: “The decision of Justice Tanko Muhammad to vacate office as the Chief Justice of Nigeria is commendable.\n“I wish the newly sworn-in Acting CJN, Justice Olukayode Ariowoola, success as he steps in to fill the gap and assure him of my commitment to advancing the frontiers of judicial independence and the promotion of separation of powers as the bedrock of deepening democracy and development."
  },
  {
    "headline": "I’m Committed To Advancing Judicial Independence, Atiku Assures New Acting CJN",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party (PDP) for the 2023 elections, Alhaji Atiku Abubakar, has commended the immediate-past Chief Justice of Nigeria (CJN), Justice Tanko Muhammad, for his service to the nation.\nThis is even as Atiku, a former vice president of Nigeria, also assured the newly appointed acting CJN, Justice Olukayode Ariwoola, of his commitment to advancing judicial independence and the promotion of separation of powers among the three arms of government.\nAtiku, who took to his verified Facebook page on Monday evening to react to the change of baton at the highest level of the nation’s Judicial arm, added that he wished the new acting CJN success in his new assignment.\nThe PDP presidential candidate wrote: “The decision of Justice Tanko Muhammad to vacate office as the Chief Justice of Nigeria is commendable.\n“I wish the newly sworn-in Acting CJN, Justice Olukayode Ariowoola, success as he steps in to fill the gap and assure him of my commitment to advancing the frontiers of judicial independence and the promotion of separation of powers as the bedrock of deepening democracy and development."
  },
  {
    "headline": "Sgt. Aondona arrested for killing truck driver over N3000 bribe",
    "summarized_story": "James Aondona of Benue Police Command has been arrested for killing Aondohemba Terkula, a truck driver in Katsina-Ala Local Government Area of the state.\nAondona killed Terkula during altercation at a checkpoint at Ngibo, Kastina-Ala on Sunday.\nAccording to independent reports, Aondona and other cops at the checkpoint on Katsina-Ala-Zaki-Biam road, demanded a toll of N3,000 from the driver.\nAccording to human rights activist, Ukan Kurugh, the trailer driver offered to pay N1500, stating that he didn’t have a full truck.\nAn eyewitness said that the trailer driver was heading to Katsina-Ala Local Government Area of Benue State when the incident occurred."
  },
  {
    "headline": "Actress Chacha Eke Faani announces break-up of her marriage",
    "summarized_story": "Popular Nollywood actress, Chacha Eke Faani has ended her nine-year-old marriage with her husband Austin Faani.\nChacha took to her Instagram page late Monday night to announce that she is done with her marriage to Austin.\nWith the tone and manner she composed her message, she may have been going through hell in her marriage.\n“For the 2nd time in 2 years, I am here again on social media boldly declaring that I am done with my marriage.\nMy long overdue/relentless stance on this is of course no news to Austin Faani, the doctors and my parents,” she sated."
  },
  {
    "headline": "BREAKING: APC outraged as ‘fake document’ outlines ruling party’s N6.5tr election rigging plans",
    "summarized_story": "By its projection, other parties in the contest would in total score slightly above a million votes while rejected votes would cinstituted 804, 330.\nEqually, over N3.153 trillion would be spent via programmes like Conditional Funds Transfer, Food Distribution, Free Fertilizer Distribution, Artisans and MSMEs Support Funds, Transportation Support Funds and IDP Support Funds.\nIn the document, election tribunal expenses is to gulp nearly N153.5 billion while APC Governors would be given o er N730 billion.\nAPC States and Local Government Area offices are to be given a combined sum of N300 billion while APC Support Groups would get N100 billion.\nPDP-sponsoredBut the ruling party has accused the opposition Peoples Democratic Party PDP of manufacturing the said document in an attempt to smear its image."
  },
  {
    "headline": "BREAKING: Gunmen abduct 3 in Ondo, demand N40m ransom",
    "summarized_story": "Abductors of three indigenes of lkaram Akoko, area of Ondo state have demanded for N40 million ransom before their released from captivity.\nRecall that the three persons were travelled from Kogi state to Ondo for a social function when they were kidnapped at Ayere, a neighbouring town between Kogi and Ondo states.\nSpeaking on the incident, the spokesperson for the state police command, Funmi Odunlami said that the incident happened in kogi statenot Ondo state, her jurisdiction.\nThe victims reportedly left Ogbagi Akoko to sell soft drinks in Okene and were abducted on their way back to their home state.\nTheir abductors had demanded for a ransom of N10 million but they were later released after paying N2 million to the gunmen."
  },
  {
    "headline": "BREAKING: Terrorists Abduct Divisional Police Officer In Kaduna",
    "summarized_story": "Gyadi Gyadi, a Divisional Police Officer in Pambegua, Kubau Local Government Area of Kaduna State has been abducted.\nCalls put across by SaharaReporters to Kaduna police spokesman, Mohammed Jalige were not answered nor returned.\nThe incident comes a few days after the Divisional Police Officer in charge of Nasarawa Eggon Local Government of Nasarawa State, CSP Haruna Abdulmalik was abducted by terrorists.\nIn recent months, Kaduna has witnessed a spate of violent attacks which has led to killings and abduction of residents.\nDays after the train attack, 11 soldiers were killed in an attack by gunmen on a military base in Birnin Gwari LGA of Kaduna state."
  },
  {
    "headline": "I Was Admitted Into Secondary School But Dropped Out Due To Poverty –Tinubu Once Admitted Not Attending Government College Ibadan",
    "summarized_story": "I Was Admitted Into Secondary School But Dropped Out Due To Poverty –Tinubu Once Admitted Not Attending Government College IbadanReactions have continued to trail the reports that the Presidential Candidate of the All Progressives Congress (APC), Asiwaju Bola Tinubu, did not submit his primary and secondary school certificates to the Independent National Electoral Commission (INEC).\nThe latest claims however contradict his previous election submission in 1999 when he contested as Lagos State Governor.\n“That the governor did not attend Government College, Ibadan, as was stated in his profile and INEC FORM CF.001.\nIn the form, which he personally filled, the governor attached the certificates of Richard Daley College and Chicago State University.\nAfter his primary education, the Governor said he was admitted into secondary school but he could not further his education because of his poverty."
  },
  {
    "headline": "Wizkid, Tems among winners at 2022 BET Awards *See full list of winners",
    "summarized_story": "The 2022 BET awards was held on Sunday June 2022 at the Microsoft Theater in Los Angeles.\nThe Show was hosted by famous actress Taraji P Henson and it featured performances from Roddy Rich, Fireboy DML, Jack Harlow, Babyface, Chance the Rapper, GIVĒON, Chlöe, Joey Bada$$, amongst others.\nThe awards which is targeted towards celebrating the performances in music, film, television and sports that’ve made the biggest impact on culture over the past year.\nBelow, find all the 2022 BET Awards winners:Album of the yearAn Evening With Silk Sonic, Silk SonicBest female R&B/pop artistJazmine SullivanBest male R&B/pop artistThe WeekndBest female hip hop artistMegan Thee StallionBest male hip hop artistKendrick LamarBest groupSilk SonicBest collaboration“Essence,” Wizkid Feat.\nJustin Bieber & TemsBest new artistLattoVideo of the year“Family Ties,” Baby Keem & Kendrick LamarVideo director of the year“We Win,” Lil Baby X Kirk FranklinBET Her“Good Morning Gorgeous,” Mary J. BligeBest international actTems (Nigeria)Best movieKing RichardBest actorWill Smith, King RichardBest actressZendaya, Euphoria | Spider-Man: No Way HomeYoungStars awardMarsai MartinSportswoman of the year awardNaomi OsakaSportsman of the year awardStephen CurryShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Breaking: Buhari swears in Justice Olukayode Ariwoola as new CJN",
    "summarized_story": "President Muhammadu Buhari on Monday swore in Justice Olukayode Ariwoola as the acting Chief Justice of Nigeria (CJN).\nJustice Ariwoola who was born on Aug. 22, 1958 and appointed a Justice of the Supreme Court of Nigeria in 2011.\nJustice Ariwoola was first appointed a Judge of Superior Court of record in Oyo State in 1992 from private legal practice.\nBefore his elevation to the Supreme Court, he served as Justice of Court of Appeal in Kaduna, Enugu and Lagos Divisions.\nNAN reports that Justice Tanko Muhammad resigned as the CJN on the grounds of ill-health."
  },
  {
    "headline": "Breaking: Behold ex-court of appeal Justice set to take over as CJN",
    "summarized_story": "Following the resignation of Justice Ibrahim Tanko Muhammad, President Muhammadu Buhari will later on Monday swear in Justice Olukayode Ariwoola as acting Chief Justice of Nigeria (CJN), a Judiciary source has revealed.\nJustice Ariwoola is the most senior Justice of the Supreme Court.\nBorn on 22 August 1958, Justice Ariwoola was formerly a Justice of the Court of Appeal and was elevated to the Supreme Court bench.\nThe swearing-in event is reportedly scheduled for 2pm.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Amazing Discounts On Itel Smartphones As Jumia Celebrate 10th Anniversary",
    "summarized_story": "This time around, itel has partnered with Jumia for its 10th anniversary celebration.\nOnline shoppers can get up to 2,000 naira discounts, free gifts, and itel accessories when they purchase itel smartphones and other products on itel’s online store on the Jumia app or website.\nCustomers will also enjoy discounts on the itel A25 Pro, P37, S17, A58, and A37.\nCustomers in Ibadan, Abuja, and Lagos will not have to pay for the delivery of their smartphones when they buy from the itel store on Jumia.\nTo get shopping on itel’s store and to get amazing discounts, click on this link to get started."
  },
  {
    "headline": "MTN’s Mobile Money Bank suffers N22b fraud, drags18 banks to court for recovery",
    "summarized_story": "By Kenneth AtavtiNewly licensed Mobile Money Payment Service Bank Limited (MOMO PSB) a banking subsidiary of MTN Communications Limited has in less than a month operations suffered a massive fraud worth over N22 billion on its network.\nIn an affidavit in support of the originating summons, the Chief Executive Officer (CEO), MOMO PSB Ltd, Mr. Anthony Usoro Usoro claimed that MOMO PSB Ltd is the bona fide owner of the aggregate sum of N22.3 billion which is maintained in its MOMO settlement account.\nAnthony in the affidavit further claimed that a total of about 700, 000 transactions were processed with credits made into about 8,000 various accounts in the listed 18 banks.\nThe erroneous transfers, he claimed, were due to the fact that MOMO PSB Ltd suffered a system exploitation which led to the said debits.\nIt added that its resort to the court was informed by the insistence of the 18 banks that they needed to be ordered by the Federal High Court before they could act."
  },
  {
    "headline": "Collaboration is success path to 5G deployment in Nigeria – NCC",
    "summarized_story": "According to him, the policy framework for the deployment has come into place and will facilitate deployment of services by the recent winners of the 3.5GHz spectrum auction, MTN Nigeria Communications Ltd and MAFAB Communications Ltd.\nHe said the Commission has set out the regulatory instruments needed for fast deployment of the new versatile technology for the benefit of the consumers and the stakeholders.\nProf. Danbatta, therefore, invited the support of all stakeholders to ensure that 5G technology is deployed in Nigeria in a manner beneficial to all telecom consumers and to support the emergent Digital Economy Policy of the Federal Government of Nigeria.\nHe highlighted the potential use cases for 5G networks as broadly categorised by the International Telecommunication Union (ITU) to include Enhanced Mobile broadband (eMBB), Massive Machine-type Communications (mMTC), as well as Ultra-reliable and Low-latency Communications (uLLC)“We will continue to collaborate with stakeholders across sectors to ensure faster deployment of 5G services, and accelerate the growth of Nigeria’s broadband infrastructure,” he said.\nHe identified some challenges in the deployment to include limited frequencies with the required spectral efficiency, skilled professionals with requisite knowledge of the technology, fewer number of 5G-enabled devices, and cost of deployment but stated that the industry must work to turn the challenges into opportunities rather than seeing them as obstacles."
  },
  {
    "headline": "Effective service delivery in hospitality, tourism industry dependent on quality of practitioners in the sector – Experts",
    "summarized_story": "By Palma IleyeExperts at a One-Day Interactive Workshop on Effective Customer Service Delivery for Tourism and Hospitality Professionals organized by the FCT Chapter of the Institute for Tourism Professionals of Nigeria, ITPN, have asserted the obvious fact that an effective service delivery in the sector was dependent on the quality of practitioners and their professional competence.\nIn the paper titled ‘Effective Customer Service Delivery for Tourism and Hospitality Professionals’ presented at the occasion, Alhaji Abdulmalik Hassan, an advocate for quality service, stated that excellent customer service delivered in the appropriate way, is a prerequisite for effective and efficient business management that guarantees customer satisfaction, patronage and retention.\nLordsGreat stressed that Customers are increasingly becoming aware of the need to get value for their money and will frown at poor quality service delivery from mediocre organizations.\n” What drive customers away is rude and discourteous behaviour, inept, and incompetence dispositions of staff during service delivery,” he added.\nCertificates were later presented to participants at the workshop as testimony of attendance and acquisition of the requisite knowledge and skills in the ethics of customer service delivery as professionals in the travel tourism and hospitality industry."
  },
  {
    "headline": "ACCI Member, Esther Eghobamien-Mshelia Elected into UN Committee on CEDAW",
    "summarized_story": "The Federal Ministry of Women Affairs and Social Development (FWASD) has announced the election of Abuja Chamber of Commerce and Industry (ACCI) member, Mrs Esther Eghobamien-Mshelia as Nigeria’s representative on the Convention On the Elimination of All Forms Discrimination Against Women (CEDAW) Committee.\nMrs Eghobamien-Mshelia, who is the founder, Women Arise Development Initiative (WADHI) was one of the 12 members elected by states parties of the committee on the elimination of discrimination against women to replace those whose terms of office are due to expire on 31 December 2022.\nThe terms of the new elected members would commence 1st January 2023 and run through a period of four years, later on 31 December 2026.\nWhile congratulating her election into the CEDAW committee, Mrs Tallen stated that she has no doubt that Mrs Eghobamien-Mshelia will do us proud in the journey ahead adding that we must therefore rise above our differences to ensure that we succeed in flying the Nigeria colours high.\nThe Minister lauded the role of the Managing Director, Bank of Industry, Mr. Olukayode Pitan and the Director-General ACCI, Dr Victoria Akai for the great role they played in the realization of the mandate."
  },
  {
    "headline": "Voter Registration: New Registrants Now 10.4m, Says INEC",
    "summarized_story": "Over 10 million new voters have registered in the ongoing Continuous Voter Registration (CVR) exercise across the country.\nA breakdown of the figure showed that while fresh registrants hit 10,487,972, completed registration was pegged at 8,631,696.\nOnline registration as of 7 am, Monday 27th June 2022 was pegged at 3,250,449, and physical registration, at 5,381,247.\nFurthermore, the update noted that the fresh registrants are made up of 4,292,690 males; females: 4,339,006; Persons Living with Disabilities (PWDs): 67,171 and youths: 6,081,456.\nCVR Update: Quarter 4, WK 11 as at 7am, Monday 27th June 2022."
  },
  {
    "headline": "PDP Tackles Obasanjo Over Comments On Choice Of Deputy In 1999",
    "summarized_story": "The Peoples Democratic Party has tackled former President Olusegun Obasanjo over comments that he made mistake when he picked his Vice President in 1999.\nObasanjo had over the weekend said he made a mistake in the choice of his number two ahead of the 1999 presidential election.\nHe was elected as President in 1999 along with the current PDP presidential candidate, Atiku Abubakar, as his vice-president.\nHe further accused Obasanjo of being angry with Atiku Abubakar for truncating his third term agenda despite the latter’s contribution to the Obasanjo administration.\n“I wish to appeal to former President Obasanjo to come out openly to repeat what he has said,” Jibril said."
  },
  {
    "headline": "UPDATED: Justice Olukayode Ariwoola Takes Oath Of Office As Acting CJN",
    "summarized_story": "Justice Olukayode Ariwoola of the Supreme Court on Monday took the judicial oath of office as the acting Chief Justice of Nigeria (CJN).\nPresident Muhammadu Buhari administered the oath of office to Justice Ariwoola during a swearing-in ceremony held at the Council Chamber of the Presidential Villa in Abuja, the nation’s capital.\nJustice Muhammad had resigned as the Chief Justice of Nigeria on Sunday night, citing ill-health as the reason for his decision.\nThis led to the inauguration of Justice Ariwoola – the next most senior justice of the Supreme Court at the time of Justice Muhammad’s resignation.\nIn the leaked letter, the justices alleged that Justice Muhammad failed to address the issues raised despite drawing his attention to them."
  },
  {
    "headline": "Justice Tanko Muhammad Resigns As CJN",
    "summarized_story": "The Chief Justice of Nigeria, Justice Tanko Muhammad, has resigned, Channels Television learned on Monday.\nSources told Channels Television that Justice Muhammad resigned on Sunday night, citing ill-health as the reason for his decision.\nInformation also has it that arrangements are ongoing to swear in the next most senior justice of the Supreme Court, Justice Olukayode Ariwoola, as the acting Chief Justice of Nigeria.\nAlthough no Supreme Court Justice is present at the event.\nhowever, the Administrator of the Institute, Justice Garba has opened the session."
  },
  {
    "headline": "Gun Acquisition Directive To Complement Security Forces, Says Matawalle",
    "summarized_story": "Zamfara State Governor Bello Matawalle has clarified that his directive urging people to acquire firearms is for them to complement the efforts of security forces in the ongoing war against insurgency.\nHe made the clarification on Monday while inaugurating four special committees at the Government House in Gusau, the State capital.\nThe governor explained that the committees were being inaugurated to ensure proper implementation of the security measures being taken to tackle the upsurge of banditry in the State.\nREAD ALSO: Zamfara Governor Cannot Instruct CP To Issue Gun Licences – General IraborThe four special committees established today include Committee on Intelligence Gathering and Bandits’ Informants, Committee on Prosecution of Banditry Related Offences, Management of Community Protection Guards and Special Standing Security Committee.\nGovernor Matawalle disclosed that the state government has provide 20 Hilux vehicles and 500 motorbikes to the special Committees to make their jobs and movements easier."
  },
  {
    "headline": "Rivers Utd crowned NPFL champions despite 1-2 defeat",
    "summarized_story": "League leaders and now champions, Rivers United dropped three points in the Nigeria Professional Football league after losing 2-1 at Nasarawa United on matchday 35.\nThese results mean Rivers United maintain their 10 points lead with only three rounds of matches left to play.\nElsewhere, Gombe beat Wikki Tourists 2-1, Shooting Stars settled for a 2-2 draw with Abia Warriors while Sunshine stars edged struggling MFM 2-1.\nRivers United still lead the the pack despite the set back with 71 points.\nPlateau United are on 61 points ,Remo Stars has 54 points ,Enugu Rangers are on 52 points while Enyimba also has 52 points ."
  },
  {
    "headline": "Atiku commends Tanko Muhammad's resignation as CJN",
    "summarized_story": "Presidential candidate of the People’s Democratic Party, Atiku Ababukar has described the decision of Justice Tanko Muhammad to vacate office as the Chief Justice of Nigeria as commendable.\nIn a statement by his media office, the former vice president also wished Justice Muhammad well even as he commended him for his action and service to the nation.\nThe presidential candidate also wished the newly sworn in acting Chief Justice success as he takes over the leadership of the nation’s judiciary.\n“I wish the newly sworn-in Acting CJN Justice Olukayode Ariowoola success as he steps in to fill the gap and assure him of my commitment to advancing the frontiers of judicial independence and the promotion of separation of powers as the bedrock of deepening democracy and development.”"
  },
  {
    "headline": "Troops arrest four kidnappers, kill three bandits in Benue",
    "summarized_story": "The Defence Headquarters said the troops of Operation Whirl Stroke have arrested four kidnappers, neutralised three bandits and rescued a kidnapped victim in recent operations in parts of Benue.\nBernard Onyeuko, a major general, said the troops had on June 24 arrested four suspected kidnappers at Igumale council ward of Ado local government area of the state.\nBernard Onyeuko said the troops also conducted a raid at a bandits’ hide out at Mbahuwuhe village in Utange council ward in Katsina-Ala local government area.\nAccording to him, the rescued victim is presently undergoing treatment.\nHe said, “The military high command commends the troops and encourages the general public to avail troops with credible and timely information on criminal activities.”"
  },
  {
    "headline": "UK, WHO launch climate change platform to aid COP26 goals",
    "summarized_story": "The United Kingdom and the World Health Organization on Monday established a new health and climate change platform to assist countries in fulfilling pledges set at last year’s UN Climate Change Conference (COP26).\nThe alliance will act as a meeting place for the government bodies that supported the COP26 Health Program during the summit, which ended on November 13 in Glasgow, Scotland.\nIn addition, ATACH will bring together relevant partner organistions to coordinate efforts, exchange information and best practices, build networks, and get access to technical and financial support.\nIt will also connect current efforts, address shared obstacles, and track global success.\nAt the moment, 60 nations have committed to at least one of the activities on climate-resilient and low-carbon sustainable health systems championed by the COP26 Health Program."
  },
  {
    "headline": "Tinubu’s Education Queried By Nigerians – Trending With Ojy Okpe",
    "summarized_story": "Nigerians have questioned the educational qualifications of the flag bearer of the All progressives Congress Asiwaju Bola Ahmed Tinubu after the Independent National Electoral Commission published the personal particulars of the 16 presidential candidates and their running mates who will be standing for the 2023 election, and revealed, that the APC presidential candidate did not provide information of his primary and secondary education and also did not attach the certificates for his tertiary education."
  },
  {
    "headline": "Sudan Recalls Ambassador to Ethiopia after Alleged Execution of 7 Soldiers",
    "summarized_story": "Sudan said on Monday it was recalling its ambassador in Addis Ababa to protest against what it says was the execution by Ethiopian forces of seven Sudanese soldiers and a civilian who were captured last week.\nIt said the soldiers and the civilian were “kidnapped” on Sudanese soil on June 22 and taken to Ethiopia.\nSudan, it said, intends to file a complaint against Ethiopia to the UN Security Council and relevant regional and international organisations.\nRelations between Sudan and Ethiopia have been fraught in recent years, mostly over the contested border region of Fashaqa, a fertile farming strip long settled by Ethiopian farmers protected by pro-government militias.\nThe eastern territories of Sudan, which border Ethiopia’s Tigray region, have been the site of deadly clashes between the Sudanese and the Ethiopian sides in the past 18 months."
  },
  {
    "headline": "Ecuador Promises Fuel Price Cuts Amid Protests",
    "summarized_story": "Ecuador’s president has promised to lower fuel prices across the country after weeks of disruptive mass protests over the cost of living.\nProtesters have blocked key roads and staged mass rallies demanding action on fuel and food prices – some of which have turned violent.\nIn response, Guillermo Lasso vowed to cut 10 cents a gallon from both petrol and diesel prices.\nPresident Lasso also said that despite his move to lower fuel prices, any violent protesters would face consequences for their actions.\nThe blocking of key roads has led to fears of food shortages in the capital, Quito, as agricultural workers outside of it campaign for fairer food prices."
  },
  {
    "headline": "Anger, Tears in South Africa after 21 Teens Likely Accidentally Poisoned in Pub",
    "summarized_story": "South African mourners expressed anger and despair on Monday at the death of 21 teenagers in a tavern over the weekend, as investigating authorities said the youths were probably accidentally poisoned by something they ate, drank or smoked.\nWe can’t accept it,” said Yandiswa Ngqoza, an aunt, as she choked back tears outside the morgue dressed in black attire.\n“By the look of the child she has no visible injuries,” Ngqoza said, before breaking down sobbing.\n“We are ruling out a stampede,” he added, after initial media reports suggested this may have been the cause.\nIt is illegal to serve drinks to under-18s in South Africa."
  },
  {
    "headline": "Buhari Swears-In Olukayode Ariwoola as Acting Chief Justice of Nigeria, Bestows National Honour on Tanko Muhammad – Arise News",
    "summarized_story": "Nigeria President Muhammadu Buhari has sworn-in Justice Olukayode Ariwoola as the acting Chief Justice of Nigeria (CJN).\nHowever, President Buhari has bestowed on Muhammad, the second highest national honour of the Grand Commander of the Order of the Niger (GCON).\nMeanwhile, Justice Ariwoola says there is no controversy at the Supreme Court, insisting his predecessor left office on health grounds.\nOn November 22, 2011, he was appointed to the bench of the Supreme Court of Nigeria as Justice, and sworn-in by the then Chief Justice of Nigeria.\nCurrently, he is also a member of the Nigerian Bar Association, the International Bar Association, and the Nigerian Body of Benchers."
  }
]