[
  {
    "headline": "Group calls for deliberate, proactive solution to insecurity",
    "summarized_story": "A socio-cultural group, Oodua Youth Coalition, on Thursday in Akure urged President Muhammadu Buhari to provide the military with necessary institutional and moral support to tackle insecurity.\n“President Buhari should also unite and support patriots in the Nigeria Armed Force as he declares war on bandits stirring the calm water of the country.\n“Bank robberies, which claimed the lives of innocent citizens have been recorded more than once lately in Ondo, Oyo and Ogun States.\n“It is important that necessary attention is given to the situation before it becomes the new normal,” the group added.\nThe statement was signed by Mr Tayo Oluyi, and Mr Oluwagbenga Ajongolo, president and national publicity secretary of the group respectively."
  },
  {
    "headline": "Video of Senator confessing he rigged elections re-emerges on social media after death",
    "summarized_story": "Days after his death, a video has re-emerged on social media showing former Deputy Senate President, Ibrahim Mantu, confess how he rigged elections in Nigeria.\nHe was the National Chairman, defunct Peoples Democratic Alliance; and National Publicity Secretary defunct United Nigeria Congress Party, amongst others.\nIn a video that has since gone viral, Mantu had said that he was a born-again politician after he graphically painted how he rigged elections for himself and his party.\nResponding to a question on whether he rigged elections in the past, the senator had said, “Yes, I did because I am now confessing the truth.\n“We look forward to the day when highly placed sponsors of thuggery, including party chieftains and candidates that seek to benefit from violations of the law, are apprehended."
  },
  {
    "headline": "Vanguard Mental Health Summit: Over N1bn worth of illicit drugs seized from dealers ― NDLEA boss",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA, Chairman, Brig Gen Mohammed Buba Marwa (Retd), disclosed that his administration has seized illicit drugs worth over N1billion from various suspected dealers in the fight against drug abuse.\nMarwa, stated this on Thursday, in his address during the maiden Vanguard Mental Health Summit at the Eko Hotel and Suites, Victoria Island.\nSpeaking on the theme: Mobilizing for Systemic Change and Better Mental Health Care in Nigeria,” NDLEA boss, described the summit as “apt” at a time when mental health crisis caused by various factors is ravaging a good number of Nigeria’s population.\nMarwa, represented by Assistant State Commander, Lagos State Command, NDLEA, Marcus Ayuba, stated: “Under the current administration in the fight against drug abuse, has seized illicit drugs from various dealers worth N1 billion so far.\n“Substance abuse which is one of the major factors that predisposes people to mental health challenge."
  },
  {
    "headline": "No troublemakers in South, PANDEF tells Army",
    "summarized_story": "Speaking Wednesday, Ken Robinson, National Publicity Secretary of Pan Niger Delta Forum, PANDEF, said several things have gone wrong in Nigeria but they continued to blame the south.\n“Again very paradoxically, and very ridiculously they are warning trouble makers in the South-South and South-East.\n“It is highttime they stopped all these jokes and face reality and go for the real trouble makers in this country.\n“Nigeria belongs to all of us and we have contributed so much to what the country is today.\nThe happiness in this country is the resource that comes from Niger Delta."
  },
  {
    "headline": "IPOB worries over Nnamdi Kanu’s safety after NDA attack",
    "summarized_story": "File image of Nnamdi Kanu when he was first brought to court on after his extradition to Nigeria from Kenya.\nIPOB wondered if bandits with the aid of alleged compromised Nigerian military can successfully attack the NDA and kill Igbo military officers, why will one think Fulani bandits can’t attack DSS headquarters with the aim of killing Nnamdi Kanu.\n“This attack at the NDA Kaduna is also an indication that they may be planning to attack the Headquarters of the Department of State Services, DSS, where our leader Mazi Nnamdi Kanu is currently detained.\n‘If Fulani bandits with the aide of compromised Fulani controlled Military can successfully attack the NDA Kaduna as heavily guarded as it is, killing Igbo military officer, why will one think Fulani bandits can’t attack DSS headquarters to kill Nnamdi Kanu?\nOur leader Mazi Nnamdi Kanu, predicted what is happening now and how the cabal running the country wants to actualise the Fulanization and Islamization of Nigeria agenda."
  },
  {
    "headline": "Plateau crisis: Okowa orders evacuation of Delta students from Jos",
    "summarized_story": "Ifeanyi OkowaGovernor Ifeanyi Okowa has ordered the immediate evacuation of students of Delta origin from crisis troubled Jos, the Plateau state capital, following renewed crisis and security concerns in the North Central state.\nHe commended Governor Ifeanyi Okowa for his prompt approval for the exercise, adding that the lives of Delta students were very dear to the state.\nHe stated further that 3 buses with police escort have been despatched to move Delta students from the troubled zone.\n“When we heard about the incident in Jos, I wrote to the governor, informing him on the need to evacuate students of Delta origin from the crisis zone.\n“With this approval, Governor Okowa has once again demonstrated his love for Delta students by ensuring that their safety is a topmost priority to the state government."
  },
  {
    "headline": "Stop intimidating S-East, S-South; Ohanaeze, PANDEF tells Army",
    "summarized_story": "In a related development, Ohanaeze Youth Wing attributed the insecurity to the activities of herders including open grazing which it described as the source of the current security challenges ravaging the country.\nOhanaeze urges army to be humaneObiozor who made the call Tuesday when the GOC of the 82 Division of Nigerian Army, Major General T.A Lagbaja paid him a courtesy visit at the National Secretariat of Ohanaeze Ndigbo, Enugu, commended the GOC for the visit to exchange ideas.\nIn his remarks, Gen. Lagbaja promised to look into the complaints, including the issue of demanding that commuters come out of their vehicles and raise their hands while crossing the checkpoints.\nThey resolved to be having constant consultations to ensure a cordial relationship between soldiers and the people.\nVanguard News Nigeria"
  },
  {
    "headline": "Banks will now be held liable for fraud – EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has placed banks in Nigeria under surveillance.\nHe spoke at a meeting with the Association of Chief Audit Executives of Banks in Nigeria (ACAEBIN).\nThe EFCC chief announced that from September 1, 2021, “it will no longer be business as usual”.\n“The commission will hold banks liable where there are established cases of institutional complicity in fraud in the sector.”Bawa had alerted that individuals and companies who illegally take funds out of Nigeria get assistance from banks.\n“There are conspirators; engineers, professionals, accountants and financial institutions are helping them”, he said."
  },
  {
    "headline": "Delay in assent: CLO Urges Akwa Ibom Assembly to override Governor Emmanuel’s on bills",
    "summarized_story": "The Civil Liberties Organisation (CLO), Akwa Ibom State has called on members of the State House of Assembly to invoke Section 100(5) of the Constitution of the Federal Republic of Nigeria, 1999 (as amended) and pass into Law, Bills which have been passed and forwarded to the Governor, Mr. Udom Emmanuel, for assent but have remained un-assented to.\nChristopher Ekpo, respectively, noted with dismay that the State Governor had withheld assent to many laudable and people-oriented Bills passed by the 7th House of Assembly without the requisite constitutional action by the House of Assembly pursuant to Section 100(5) of the Constitution of the Federal Republic of Nigeria, 1999 (as amended).\nCLO listed such Bills to include: the Akwa Ibom State College of Science and Technology Bill; the Customary Courts Bill; the Akwa Ibom Youth Development Fund Bill (AKYDF), among others.\nCLO, therefore, urged the State House of Assembly to invoke the provision of Section 100(5) of the Constitution of the Federal Republic of Nigeria, 1999 (as amended) and pass such Bills into Law for the benefit of the State.\nIt urged the State Governor, Mr. Udom Emmanuel, to expeditiously assent to the Bills once they are passed by the State House of Assembly and forwarded to him."
  },
  {
    "headline": "Jigawa at 30: Gov. Badaru declares Friday work-free day",
    "summarized_story": "The Jigawa State Government has declared Friday, the 27th of August, 2021, as holiday in commemoration of the 30th Anniversary of the creation of the State.\nThis was contained in a statement, signed by the State Head of the Civil Service, Alhaji Hussaini Ali Kila issued to DAILY POST.\nThe statement said the Governor Muhammad Badaru Abubakar congratulated the Civil Servants and the entire people for the thirty-year anniversary of the State.\nHe further enjoyed the people to pray for the State and the country at large while celebrating the day.\nBadaru also appealed to all Pubic Servants and the entire people of the State to utilize the one day break in thanking the Almighty Allah for conducive atmosphere, peaceful co-existence and various developmental projects so far recorded in the State."
  },
  {
    "headline": "Anambra Guber: APGA, APC are united on Southeast pragmatic politics – VON DG, Okechukwu",
    "summarized_story": "“So, that suggestion was made from the prism of the pragmatic Zikist political model, which joins us with APGA.\n“With three strategic states of Southeast in APC’s kitty, that is a halfway stroke to Ndigbo’s ambition of achieving Nigeria president of Igbo extraction in 2023.\nTherefore, I implore to kindly consider the fruit in APGA joining APC to win the Anambra governorship.\nIn 2017, President Muhammadu Buhari restored Governor Obiano’s security details on the APC governorship campaign ground.\nIn 2019, Obiano led APGA to reciprocate the grand political gesture of understanding by Mr. President."
  },
  {
    "headline": "Northern youths issue 14-day ultimatum to President Buhari over Boko Haram, ISWAP sponsors",
    "summarized_story": "Northern Youths Council of Nigeria (NYCN), has issued a 14-day ultimatum, urging the Federal Government to unveil the identity of the sponsors of the killers of innocent Nigerians.\nThe group said failure to do so, they would occupy the 19 Northern States and the Federal Capital Territory.\nThe NYCN also suggested that President Muhammadu Buhari should sack Abubakar Malami, Attorney General and Minister of Justice for not doing anything to prosecute members of Boko Haram and ISWAP that have been arrested.\nThe forum added that the Minister had failed to prosecute over 400 Bureau de Change operators that are either in custody of the security agents or probably regained their freedom.\nAccording to the statement, he (Prof. Kunle Olawunmi) further stated that: “In April this year, the government said they had arrested 400 Bureau De Change (BDCs)-related people that were sponsoring Boko Haram."
  },
  {
    "headline": "Tobi Bakre hires Timi Dakolo to serenade wife",
    "summarized_story": "BBNaija Season 4 Double Wahala housemate, Tobi Bakre has invited singer Timi Dakolo to serenade his wife, Anu in their home.\nThe “Great Nation” singer arrived the media personality’s home with a bouquet of flowers for his wife who opened the door to her absolute surprise.\nADVERTISEMENTOn entering the apartment, Dakolo began singing one of his hit songs “Iyawo Mi” as Anu received the bouquet of flowers from the him with thanks while the singer continued to serenade her with his melodious voice.\nTobi Bakre, who entered the apartment behind Timi Dakolo, was holding out his phone videoing the event.\nThe immensely excited wife was full of appreciation for the singer and hubby, who while still videoing gave her a loving hug."
  },
  {
    "headline": "Niger pupils fed with expired rice, lawmakers allege",
    "summarized_story": "Niger pupils, benefiting from the national home-grown school feeding programme, are being fed expired rice and given a quarter of an egg for their meals, Niger lawmakers have alleged.\n“We wonder why primary school pupils in the state are served with poor and under nutritious meals.\nOur investigation showed that the type of rice is an expired quantity of rice and God knows how it was prepared.\nCertain meals that should be for one person are shared among three pupils.\nAt the end of the deliberation, Niger Speaker Abdullahi Bawa Wuse said the state focal person for the programmes should appear to defend the allegations."
  },
  {
    "headline": "378 Afghan co-workers, family members arrive in S/Korea",
    "summarized_story": "No fewer than 378 Afghans arrived in South Korea on Thursday as part of Seoul’s efforts to evacuate local co-workers of the country’s embassy and other facilities in the war-torn nation after the Taliban’s seizure of power.\nAnnouncing the operation, codenamed Operation Miracle, South Korea has stressed its moral responsibility to help the Afghan people facing serious security risks after the Taliban took over Afghanistan.\nAfter the U.S. started the war on terror in Afghanistan in 2001, South Korea conducted various military and relief operations, including Provincial Reconstruction Team (PRT) activities from 2010-14.\nADVERTISEMENT“The success of the Operation Miracle was possible thanks to full cooperation from our U.S. ally,’’ the defense ministry said in a release.\n“The defense ministry will continue cooperation for the Afghans’ stable resettlement in the country, providing our logistics resources or medical support when necessary,’’ it said."
  },
  {
    "headline": "Three die as gunmen ambush van conveying murder suspects to Osun correctional centre",
    "summarized_story": "No fewer than three hoodlums have been killed along Osogbo/Ilesha road during an ambush for a vehicle conveying murder suspects to the facility of Nigeria Correctional Service, Ilesha, Osun State.\nThe Nation reports the combined efforts of police and hunters engaged the gunmen, who were shot dead.\nFindings by The Nation on Thursday morning revealed that gunmen laid ambush for a vehicle at Osunjale in Atakunmonsa West Local Government Area.\nA statement by Opalola noted around 3:30pm, Osun Police tactical team’s vehicle, while taking some murder suspects to Ilesa Correctional centre, after Osunjela river along Osogbo/Ilesa Road, developed mechanical fault.\n“In the process, three murder suspects sustained several degrees of injuries and later died at Asubiaro hospital in Osogbo and were deposited in the same hospital morgue."
  },
  {
    "headline": "Nigeria’s GDP records 5% growth for second quarter",
    "summarized_story": "BY AMECHI OGBONNA, BUSINESS EDITORNigeria’s gross domestic product (GDP) rose by 5.01 percent in the second quarter of 2021 to witness its strongest growth since fourth quarter of 2014.\nIt explained that the increase in the GDP index marked three consecutive quarters of growth following the negative growth rates recorded in the second and third quarters of 2020.\nIn the quarter under review, the NBS revealed that the aggregate GDP stood at N39,123,713.32 million in nominal terms – higher than the second quarter of 2020 with aggregate GDP of N34,023,197.60 million, indicating a year-on-year nominal growth rate of 14.99%.\nIt added that the nominal GDP growth rate in Q2 2021 was higher than -2.80% growth recorded in the second quarter of 2020 when economic activities slowed sharply at the outset of the pandemic.\n“The Q2 2021 nominal growth rate was also higher than 12.25% growth recorded in Q1 2021,” the agency said."
  },
  {
    "headline": "Eight die of Diarhea disease in kogi",
    "summarized_story": "The statement signed by the state Epidemiologist,Dr Austin Ojotule said that a total of seven communities including three in Kogi, Lokoja and Ankpa Local government Areas have been infected.\nSo far local governments namely, Kogi, Bassa, Lokoja, Ankpa and Kabba Bunu have been affected between February and August, 2021.\n“However we were able to confirm cholera in three of the communities in Kogi, Lokoja and Ankpa LGAs with 66 persons affected and 8 deaths (CFR=12.12%).These are Border Communities with hard to reach terrains”.\nAccording to him, “the State Ministry of Health has supported the outbreak response with response commodities and technical support.\n“We will work with relevant agencies ensure provision of portable water in communities within the state to ensure that diarrhoea disease is reduced to the barest minimum in the State”."
  },
  {
    "headline": "Heads may roll over NDA terror attack",
    "summarized_story": "From Molly kilete, AbujaChief of Defence Staff (CDS), General Lucky Irabor, has constituted a Board of Inquiry (BoI) to investigate the attack on the Nigerian Defence Academy (NDA), Kaduna, by bandits.\nGunmen had in the early hours of Tuesday, attacked the institution after gaining access through the residential area within the Academy in Afaka.\nTwo personnel died while one was abducted, according to a statement by the academy’s public relations officer, Major Bashir Jajira.\nHe described the report as untrue and challenged anyone with proof of the allegation to make it public.\nServing and retired military officers, who spoke to Daily Sun, expressed sadness over the attack, which they attributed to the poor security measures put in place at the academy."
  },
  {
    "headline": "Igbo, Yoruba dare FG on open grazing routes",
    "summarized_story": "From Stanley Uzoaru, OwerriThe Igbo National Movement (INM) and Coalition of South East Youth Leaders (COSEYL) have rejected the proposed open grazing routes policy of the Federal Government.\n“INM categorically asserts that no grazing routes exist in Igboland.\n“We condemn in strongest terms the approval for review of 368 grazing routes with dispatch by President Muhammadu Buhari despite condemnations by Nigerians.\nOpen grazing routes: Not in Yoruba land•Region’s self-determination group, OPSOM, dares FGFrom Oluseye Ojo, IbadanOn Thursday, August 19, 2021, President Muhammadu Buhari, approved 368 grazing routes in 25 states.\nOne such group, a pan-Yoruba self-determination group, Oodua People’s Sovereign Movement (OPSOM), has vowed to resist establishment of grazing routes in Yoruba land."
  },
  {
    "headline": "PIA: Ex-militants blow hot, blame Sylva, senators",
    "summarized_story": "From Paul Osuyi, AsabaFormer Niger Delta agitators have vowed to make the region ungovernable until provision in the Petroleum Industry Act (PIA) for oil bearing communities is reviewed upward from the current three per cent equity.\nThey said the minister and senators from the region backed President Muhammadu Buhari in hurriedly signing the bill into law for their selfish interests.\nThey vowed that the region would not know peace if the review was not done.\nThey said host communities had suffered several degradation over the decades of oil exploration by oil companies and that the PIB was geared to address this injustice.\nAccording to them, the region can no longer be short changed, intimidated and oppressed."
  },
  {
    "headline": "Nigeria’s GDP Grows 5.01% in Q2",
    "summarized_story": "By James EmejoNigeria’s Gross Domestic Product (GDP) grew to 5.01 per cent (year-on-year) in real terms in the second quarter of the year (Q2 2021), compared to -6.10 per cent in the preceding quarter.\nThis marks three consecutive quarters of growth following the negative growth rates recorded in the second and third quarters of 2020, the NBS noted.\nThe statistical agency pointed out that the Q2 growth rate was also higher than the 0.51 per cent recorded in Q1 2021 year on year, indicating the return of business and economic activity near levels seen prior to the nationwide implementation of COVID-19 related restrictions.\nAccording to the GDP estimated for Q2, released Thursday, the “steady recovery observed since the end of 2020, with the gradual return of commercial activity as well as local and international travel, accounted for the significant increase in growth performance relative to the second quarter of 2020 when nationwide restrictions took effect.”Year to date, real GDP grew 2.70 per cent in 2021 compared to -2.18 per cent for the first half of 2020, the NBS added.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: NDA Attack Will Accelerate Total Uprooting of Evil in Polity",
    "summarized_story": "The Defence Headquarters has ordered an intensive probe of the audacious invasion of the strategic military training institution.\nBut he urged those playing hateful politics with the base assault on the military academy to desist from such.\nThey called for forensic investigation into the circumstances that enabled the invasion of the NDA and subsequent killing and abduction of officers.\n“Military officers, like other security personnel, are entitled to carry out their duties in relative safety and security.\nHe stated, “Igbo youths condemn in its entirety the invasion of NDA, Afaka, where two army officers were shot dead and another abducted."
  },
  {
    "headline": "Presidency to Ortom: You’re Ethnic Jingoist Fanning Embers of Disunity",
    "summarized_story": "The presidency described the governor as an ethnic jingoist out to cause disunity among Nigerians.\nAccording to the statement, Ortom stirred up hatred by targeting one single ethnic group in Nigeria – using language reminiscent of the Rwandan genocide.\nWe can see this from the fact that he has changed political party five times during his undistinguished career.\n“Unfortunately, for the good citizens of Benue State, the most dangerous direction he blows in today is that of sectarianism and ethnicity.\n“The good, and fair-minded people of Benue State deserve more than this, and we look forward to the next elections, when they have an opportunity to restore its greatness.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Presidency Accuses Ortom of Fanning Embers of Disunity",
    "summarized_story": "*Describes Benue gov as ethnic jingoist, political failure that has changed party five timesDeji ElumoyeThe Presidency has reacted to recent utterances by Governor Samuel Ortom of Benue State saying he is all out to cause disunity among Nigerians.\nAccording to the statement, Ortom stirs up hatred by targeting one single ethnic group in Nigeria – using language reminiscent of the Rwandan genocide.\nWe can see this from the fact that he has changed political party five times during his undistinguished career.\nUnfortunately, for the good citizens of Benue State, the most dangerous direction he blows in today is that of sectarianism and ethnicity.\n“The good, and fair-minded people of Benue State deserve more than this, and we look forward to the next elections when they have an opportunity to restore its greatness”, the Presidency stated."
  },
  {
    "headline": "Plateau Killings: House Speaker Calls for Calm as Community Takes Corpses to Assembly",
    "summarized_story": "The Speaker, Plateau House of Assembly, Abok Ayuba, has called for calm and restraint over Tuesday’s attack on Yelwa Zangam community in the state by gunmen.\nAbok made the call when members of the Yelwa Zangam community took corpses of their loved ones killed in the attack, to the Assembly.\nYelwa Zangam, a community in Jos North Local Government Area of the state, was attacked by hoodlums on Tuesday night during which 35 people were reportedly killed.\nMembers of the community cried to the assembly and urged it to liaise with other arms of government to tackle the menace.\n“We are all affected by what is happening in Plateau, but please, calm down as government is doing everything possible to end the killings."
  },
  {
    "headline": "2023: Ailing Tinubu Receives Two Governors In London On Solidarity Visit",
    "summarized_story": "SaharaReporters had reported that the APC leader underwent two surgeries within a month.\nThe duo were captured in a trending picture on Wednesday with Tinubu in London on a purported solidarity visit.\nAsides Fayemi and Akeredolu, Lagos State Governor, Babajide Sanwo-Olu, Tinubu’s godson, had first visited the APC National Leader in July.\nPresident Muhammadu Buhari also made a surprise visit to Tinubu in London where the former governor was seen leaning on a walking stick.\nThe APC National Leader has been off official and party functions in the country for a while, amidst talks that he is being positioned for the 2023 presidency to succeed the incumbent repressive regime of Buhari."
  },
  {
    "headline": "2023: Ailing Tinubu Receives Two Governors In London On Solidarity Visit",
    "summarized_story": "SaharaReporters had reported that the APC leader underwent two surgeries within a month.\nThe duo were captured in a trending picture on Wednesday with Tinubu in London on a purported solidarity visit.\nAsides Fayemi and Akeredolu, Lagos State Governor, Babajide Sanwo-Olu, Tinubu’s godson, had first visited the APC National Leader in July.\nPresident Muhammadu Buhari also made a surprise visit to Tinubu in London where the former governor was seen leaning on a walking stick.\nThe APC National Leader has been off official and party functions in the country for a while, amidst talks that he is being positioned for the 2023 presidency to succeed the incumbent repressive regime of Buhari."
  },
  {
    "headline": "Buhari Government Moves To Shut Channels TV, Orders Arrest Of Journalists Over Governor Ortom's ‘Anti-Government’ Interview",
    "summarized_story": "The Muhammadu Buhari regime is subtly moving to sanction a media organization, Channels Television, and arrest some of its journalists over recent interviews aired by the platform which are considered to be anti-government.\n“Buhari attacks Section 39(1) of the constitution – the government plans to shut Channels TV and arrest pressmen.\nAnother source familiar with the order stated that the Buhari government had issued a directive to the NBC to sanction Channels TV for airing the two “unpleasant” interviews.\n“Channels TV license is to be suspended by the Federal Government over the interview of Governor Ortom and retired naval personnel.\nAlso in April 2021, NBC suspended Channels Television for airing an Indigenous People Of Biafra interview."
  },
  {
    "headline": "Buhari Government Moves To Shut Channels TV, Orders Arrest Of Journalists Over Governor Ortom's ‘Anti-Government’ Interview",
    "summarized_story": "The Muhammadu Buhari regime is subtly moving to sanction a media organization, Channels Television, and arrest some of its journalists over recent interviews aired by the platform which are considered to be anti-government.\n“Buhari attacks Section 39(1) of the constitution – the government plans to shut Channels TV and arrest pressmen.\nAnother source familiar with the order stated that the Buhari government had issued a directive to the NBC to sanction Channels TV for airing the two “unpleasant” interviews.\n“Channels TV license is to be suspended by the Federal Government over the interview of Governor Ortom and retired naval personnel.\nAlso in April 2021, NBC suspended Channels Television for airing an Indigenous People Of Biafra interview."
  },
  {
    "headline": "EXPOSED: Buhari’s Minister, Sadiya Farouq Withholds Promised Loans To 500,000 Disengaged NPower Beneficiaries, Owes 14,000 Volunteers Five Months’ Stipends",
    "summarized_story": "The Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq, failed to give out the Nigerian government back-up loans, known as N-Exit to the 500,000 disengaged Npower Scheme beneficiaries, SaharaReporters has learnt.\nNigerian Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq.\nThe Farouq-headed Humanitarian Affairs Ministry launched the project to lift 100million Nigerians out of poverty but the beneficiaries of batches A and B were disengaged in 2016 and 2017.\n“While she launched another portal for exited Npower beneficiaries to apply for their exit package which the Federal government promised to give all the exited beneficiaries after serving for about three years.\n“I have received more than a hundred calls every day from the disengaged beneficiaries; the same thing on my WhatsApp."
  },
  {
    "headline": "‘Like Buhari, Osinbajo is incompetent’ -- Mr Macaroni reacts to NDA attack",
    "summarized_story": "Mr Macaroni, the Nigerian actor and comedian, says he is disappointed in Yemi Osinbajo, the vice-president, over his performance in government since 2015.\nAdvertisementThe entertainer was reacting to the recent attack on the Nigerian Defence Academy (NDA) by suspected bandits and the widespread insecurity in the country.\n— DeboMacaroni (@mrmacaronii) August 25, 2021 Advertisement“If you like spread lies about me.\n— DeboMacaroni (@mrmacaronii) August 25, 2021 Advertisement“Saying it one more time for emphasis!!!\n😭💔 — DeboMacaroni (@mrmacaronii) August 25, 2021Copyright 2021 TheCable."
  },
  {
    "headline": "‘Like Buhari, Osinbajo is incompetent’ -- Mr Macaroni reacts to NDA attack",
    "summarized_story": "Mr Macaroni, the Nigerian actor and comedian, says he is disappointed in Yemi Osinbajo, the vice-president, over his performance in government since 2015.\nAdvertisementThe entertainer was reacting to the recent attack on the Nigerian Defence Academy (NDA) by suspected bandits and the widespread insecurity in the country.\n— DeboMacaroni (@mrmacaronii) August 25, 2021 Advertisement“If you like spread lies about me.\n— DeboMacaroni (@mrmacaronii) August 25, 2021 Advertisement“Saying it one more time for emphasis!!!\n😭💔 — DeboMacaroni (@mrmacaronii) August 25, 2021Copyright 2021 TheCable."
  },
  {
    "headline": "Cholera outbreak: Kogi records eight deaths, 129 cases",
    "summarized_story": "Austin Ojotule, chief epidemiologist in Kogi, says the state has recorded eight deaths from cholera.\nAdvertisementIn a statement on Wednesday, Ojotule said the cases were recorded in seven communities across five LGAs of the state.\nThe epidemiologist said while a total of 129 cases have been confirmed, 66 persons have been infected, and that they are in terrains that cannot be reached easily.\nAdvertisement“So far, local governments namely, Kogi, Bassa, Lokoja, Ankpa and Kabba Bunu have been affected between February and August, 2021,” the epidemiologist said.\n“However, we were able to confirm cholera in three of the communities in Kogi, Lokoja and Ankpa LGAs with 66 persons affected and eight deaths (CFR=12.12%)."
  },
  {
    "headline": "Cholera outbreak: Kogi records eight deaths, 129 cases",
    "summarized_story": "Austin Ojotule, chief epidemiologist in Kogi, says the state has recorded eight deaths from cholera.\nAdvertisementIn a statement on Wednesday, Ojotule said the cases were recorded in seven communities across five LGAs of the state.\nThe epidemiologist said while a total of 129 cases have been confirmed, 66 persons have been infected, and that they are in terrains that cannot be reached easily.\nAdvertisement“So far, local governments namely, Kogi, Bassa, Lokoja, Ankpa and Kabba Bunu have been affected between February and August, 2021,” the epidemiologist said.\n“However, we were able to confirm cholera in three of the communities in Kogi, Lokoja and Ankpa LGAs with 66 persons affected and eight deaths (CFR=12.12%)."
  },
  {
    "headline": "Forty eight insurgents killed as troop repels terrorist attack in Niger",
    "summarized_story": "Some members of Boko Haram and Islamic State in West Africa Province (ISWAP) have been killed by troops of the multinational joint taskforce (MNJTF) stationed in the Lake Chad region.\nHe said the taskforce destroyed the insurgents’ ammunition and recovered their gun trucks.\nAdvertisementHe said seven soldiers were killed in the operation and that four soldiers who sustained injuries are being treated in a military hospital.\n“At the end of the encounter, a total of Forty-Three (43) dead bodies of BHT/ISWAP insurgents were scattered around the engagement areas.\n“Extremely regrettably however, seven gallant MNJTF soldiers paid the supreme sacrifice, while four other soldiers sustained varying degrees of injuries and are being treated in a military hospital.”"
  },
  {
    "headline": "Nigerian fintech apps users confident despite regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd in Nigeria, where more than 80 million citizens live below the poverty line, trust is even more paramount.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "Ethiopia is building local competitors to Facebook, WhatsApp, Twitter and Zoom",
    "summarized_story": "Ethiopia has begun developing its own social media platforms to rival Facebook, Twitter, WhatsApp and Zoom, as per Reuters.\nIn a local media outlet on Friday, Shumete accused Facebook of blocking users who were “preaching national unity and peace”.\nSupporters of the different sides have taken the conversation over to social media.\nTo build these platforms, Ethiopia is relying solely on local expertise.\nThis begs the question of whether investing in state-owned social network platforms should be on its list of priorities."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Obaseki pays August salaries, pensions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has paid workers salaries and pension for the month of August, in line with its commitment to the welfare of civil and public servants in the state.\nSecretary to the State Government, Osarodion Ogie Esq., said the Governor Godwin Obaseki-led administration has been consistent with meeting its statutory obligations to workers in the state.\nAccording to him, “The Edo State Government has paid salaries and pensions of its workers for the month of August 2021.\nThis is in line with the tradition of meeting this obligation on or before the 26th of every month.”Ogie noted that the state government will continue to prioritise the welfare of workers and ensure they are provided a conducive work environment to optimally serve the good people of Edo State."
  },
  {
    "headline": "Obaseki engages stakeholders on career devt, entrepreneurship initiatives – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will tomorrow, Thursday, August 26, 2021, play host to religious and traditional leaders, as well as other stakeholders to deliberate on their collaborative role in the career advancement of youths and how to better leverage government’s entrepreneurship initiatives.\nIn a statement, Managing Director of the Edo State Skills Development Agency (EdoJobs), Ukinebo Dare, said Governor Obaseki will play host to the stakeholders in Government House, Benin City, the state capital.\nShe noted that the session will explore areas of potential collaboration to bring job creation initiatives closer to youths across the state.\nAccording to her, the topmost priority of the Obaseki-led administration is how residents in Edo State can fully participate and benefit from EdoJobs initiatives.\n“Through EdoJobs, the Governor Obaseki-led administration provides unique career development opportunities and entrepreneurship programmes."
  },
  {
    "headline": "Olu Of Warri Performs First Spiritual Duty , Reverses Curse And Pronounces Blessings – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – The newly crowned Olu of Warri, Ogiame Atuwatse III, who was crowned the 21st Olu of Itsekiri, on Saturday,21 August, 2021, has performed his first spiritual duty by reversing a longtime curse on Iwere land.\nThe Olu recalled that , after the curse was placed on the land, there was no record anywhere, when the said curse was reversed.\n“In reaction , a curse was placed on the land by both of them.It is not recorded that Olu Erejuwa II reverse the curse over the land neither is it recorded that Oba Akenzua II did the same.\nOlu Atuwase Ill is the eldest son of the 19th Olu of Warri Atuwatse II ,who reigned for 28 years (1987-2015).\nHe attended the Nigerian National Petroleum Corporation (NNPC) Primary School Warri, Delta State, from where he proceeded to Adesoye College, Offa in Kwara State from 1995 to 2001."
  },
  {
    "headline": "Edo@ 30: Prince Akenzua sues for Recognition of Oba Erediauwa, other Founding Fathers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY_ As Edo State celebrates its 30th Anniversary as a state, His Royal Highness, Prince Edun Akenzua, the Enogie of Obazuwa- Iko dukedum, has called on Edo youths to emulate the sterling qualities of the founding fathers of the state.\nHe gave the admonition during a press briefing with Journalists at his Palatial house in Benin City, the Edo State Capital yesterday.\nAt that time, Edo state had not formed requested for the creation of a state.\n“It is necessarily to tell this story in full because most Edo people and Nigerians do not know the Genesis of the formation of Edo state.\n“Those in authority now may wish to honour the founding fathers of the state whose 30th Anniversary is coming up on August 27th, 2021."
  },
  {
    "headline": "2020 Tokyo Paralympics: Latifat Tijani wins first gold for Nigeria",
    "summarized_story": "ADVERTISEMENTTeam Nigerian has registered its first major success at the ongoing 2020 Tokyo Paralympic Games as one of the country’s powerlifters, Latifat Tijani, won the gold medal in the female 45kg event.\nThe feat by Tijani is an improvement on her previous record of 106kg at the 2016 Summer Paralympics in Rio.\nBefore Tijani’s success, one of Nigeria’s para powerlifting medal hope at the Tokyo 2020 Paralympic Games, Yakubu Adesokan, failed to reach the podium in the finals of his -49 class on Thursday morning.\nBoth Qarada and Le Cong made final lifts of 173kg but Qarada gained the advantage with more points from earlier lifts to edge Le Cong.\nThe result means they exchanged their positions from the Rio 2016 Games in which Le Cong won the gold with 181kg while Qarada finished in silver with 177kg."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigeria records seven deaths, 637 cases of Covid-19 amid surge of Delta variant",
    "summarized_story": "Nigeria has lost seven more persons to Covid-19 amid surge in third wave of the virus driven by the Delta variant.\nThis is even as 637 new infections were recorded on Wednesday according to an update on the Facebook page of Nigeria Centre for Disease Control (NCDC).\nThe FCT recorded 29 cases, followed by three states in the South-eest, Ekiti State with 17 cases, Ogun State, 14 and Osun State with 10 cases.\nKebbi State in the North-west recorded eight cases, while Cross River in the South-South reported five cases, followed by Plateau and Taraba with three cases each.\nAccording to the NCDC, of the over 188,000 total cases, 169,382 people have recovered and have been discharged from hospitals across the country."
  },
  {
    "headline": "Uzodinma meets Buhari, rejects Southern governors anti open grazing initiative",
    "summarized_story": "Governor of Imo State, Senator Hope Uzodinma has opted out of the anti open grazing resolution of Southern governors after meeting with President Muhammadu Buhari on Wednesday, opting instead for collaboration between “farmers and herders” in the state.\nBut before the resolution of the governors, the anti-open grazing law was already operational in Ogun, Abia, Oyo, Ekiti, and Ebonyi states.\nBut what we have done is that we are regulating grazing activities in Imo State under a partnership between our farmers and herders.\n“To the extent of what I know on the sit-at-home order, even the people on their own called off the sit-at-home order.\nAnd for now, I told you that Imo State is relatively calm.”"
  },
  {
    "headline": "Buhari govt accuses Ortom inciting violence against Fulani",
    "summarized_story": "The President Muhammadu Buhari government has accused Benue State governor, Samuel Ortom of inciting violence against people of Fulani ethnic group in the country.\nOrtom, whose state has been under series of attacks by suspected Fulani herdsmen, is a vocal critic of President Buhari who he accuses of protecting the interest of the Fulani to the detriment of those of other Nigerians.\n“Unfortunately, for the good citizens of Benue State, the most dangerous direction he blows in today is that of sectarianism and ethnicity.\n“Specifically, Ortom stirs up hatred by targeting one single ethnic group in Nigeria – using language reminiscent of the Rwandan genocide.\n“The good, and fair-minded people of Benue State deserve more than this, and we look forward to the next elections when they have an opportunity to restore its greatness.”"
  },
  {
    "headline": "Zenith Bank launches AI powered Ziva WhatsApp banking",
    "summarized_story": "OBINNA EZUGWUTop Nigerian lender, Zenith Bank Plc, has introduced an Artificial Intelligence (AI) powered Chatbot on WhatsApp named ZIVA (Zenith Intelligent Virtual Assistant), which enables customers to perform financial transactions and enjoy real-time customer service from their mobile phones.\nThis product provides the convenience for the bank’s customers to interact and transact on a 24 hours basis on the encrypted WhatsApp platform.\nCommenting on the new banking solution, the Group Managing Director/Chief Executive of Zenith Bank Plc, Mr. Ebenezer Onyeagwu said: “The launch of ZIVA is driven by the need for additional secured channels of communication with our customers as we deepen our retail penetration”.\nZenith Bank has continued to distinguish itself in the Nigerian financial services industry through superior service offerings, unique customer experience and sound financial indices.\nZenith Bank places a premium on its core business strategy anchored on People, Technology and Service, to create value for its numerous clientele."
  },
  {
    "headline": "Reps Hail NNPC GMD Over 2022/2023 Revenue Projection",
    "summarized_story": "Chairman of the House of Representatives Committee on Finance, Hon Abiodun James Faleke, has commended the group managing director of the Nigerian National Petroleum Corporation (NNPC), Engr.\nMele Kyari, for providing a detailed analysis of the Medium Term Revenue Framework for 2022 and 2023.\nThe legislative committee also said Kyari cleared the air on sensitive issues surrounding the operations of the NNPC and the oil industry.\nThese are reflected in the Medium Term Revenue Framework, ” he said.\nHe explained that people who are smuggling are not looking for officially priced petroleum products."
  },
  {
    "headline": "Reps Hail NNPC GMD Over 2022/2023 Revenue Projection",
    "summarized_story": "Chairman of the House of Representatives Committee on Finance, Hon Abiodun James Faleke, has commended the group managing director of the Nigerian National Petroleum Corporation (NNPC), Engr.\nMele Kyari, for providing a detailed analysis of the Medium Term Revenue Framework for 2022 and 2023.\nThe legislative committee also said Kyari cleared the air on sensitive issues surrounding the operations of the NNPC and the oil industry.\nThese are reflected in the Medium Term Revenue Framework, ” he said.\nHe explained that people who are smuggling are not looking for officially priced petroleum products."
  },
  {
    "headline": "Nigeria’s GDP Grew -0.79% In Q2 2021, Says NBS",
    "summarized_story": "Year to date, real GDP grew 2.70% in 2021 compared to -2.18% for the first half of 2020.\nThe Q2 2021 nominal growth rate was also higher than 12.25% growth recorded in Q1 2021.\nQuarter-on-quarter, the oil sector recorded a growth rate of -20.35% in Q2 2021.\nThe non-oil sector grew by 6.74% in real terms during the reference quarter (Q2 2021).\nThe Q2 2021 growth rate was higher by 12.80% points compared to the rate recorded in the same quarter of 2020 and 5.95% points higher than the first quarter of 2021."
  },
  {
    "headline": "Nigeria’s GDP Grew -0.79% In Q2 2021, Says NBS",
    "summarized_story": "Year to date, real GDP grew 2.70% in 2021 compared to -2.18% for the first half of 2020.\nThe Q2 2021 nominal growth rate was also higher than 12.25% growth recorded in Q1 2021.\nQuarter-on-quarter, the oil sector recorded a growth rate of -20.35% in Q2 2021.\nThe non-oil sector grew by 6.74% in real terms during the reference quarter (Q2 2021).\nThe Q2 2021 growth rate was higher by 12.80% points compared to the rate recorded in the same quarter of 2020 and 5.95% points higher than the first quarter of 2021."
  },
  {
    "headline": "BACK STORY OF THE DAY: A Call For All Hands On Deck To End Modern Day Slavery",
    "summarized_story": "Findings show that the most common forms of modern slavery in Nigeria are human trafficking and child labour.\nBecause modern slavery is difficult to recognise, it has been difficult to combat this practice despite international and national efforts.\nHe, however, said the Chinese government was ready to work with Nigeria to halt Modern Day Slavery and also protect the future generation.\nThe secretary general, NAT-COM UNESCO, Idowu Olagunju says that Modern Day Slavery is not history as it still manifests today in form of “child labour, forced marriages, death bondage among others”.\nQuoting the International Labour Organisation, he said “more than 40 million people worldwide are victims of Modern Day Slavery which includes minorities, migrants and indigenous people in the country.”"
  },
  {
    "headline": "Nigerian Red Cross Society names Chinwe Bode-Akinwande, others as patrons",
    "summarized_story": "By GRACE ETIMThe Nigerian Red Cross Society (NRCS), has appointed Mrs. Chinwe Bode-Akinwande, the founder of the Chinwe Bode-Akinwande (CBA) Foundation, Mr. Samson Apeh and Mrs. Mojisola Ishola-Bamidele, as patrons for its Eti-Osa, Lagos division.\nAt the investiture and fund-raising ceremony held on Saturday, 14th August 2021, at the Red Cross headquarters in Lagos, the three patrons were honoured and inducted as members of the society to support in the humanitarian works.\nIn their acceptance speech, the patrons commended the branch and all members of the National Society for rendering selfless service and exhibition of good conduct in the society.\nThe Nigerian Red Cross Society is a humanitarian voluntary organization with a mission to meet the needs of the most vulnerable people.\nThe society depends solely on donations by spirited individuals, organization and support from its international partners."
  },
  {
    "headline": "Nigerian Red Cross Society names Chinwe Bode-Akinwande, others as patrons",
    "summarized_story": "By GRACE ETIMThe Nigerian Red Cross Society (NRCS), has appointed Mrs. Chinwe Bode-Akinwande, the founder of the Chinwe Bode-Akinwande (CBA) Foundation, Mr. Samson Apeh and Mrs. Mojisola Ishola-Bamidele, as patrons for its Eti-Osa, Lagos division.\nAt the investiture and fund-raising ceremony held on Saturday, 14th August 2021, at the Red Cross headquarters in Lagos, the three patrons were honoured and inducted as members of the society to support in the humanitarian works.\nIn their acceptance speech, the patrons commended the branch and all members of the National Society for rendering selfless service and exhibition of good conduct in the society.\nThe Nigerian Red Cross Society is a humanitarian voluntary organization with a mission to meet the needs of the most vulnerable people.\nThe society depends solely on donations by spirited individuals, organization and support from its international partners."
  },
  {
    "headline": "NLNG prize for literature: My book, Neglected should emerge the winner – Lucy Okwuma – Daylight",
    "summarized_story": "LUCY CHIAMAKA OKWUMA is among the few medical practitioners who have also crossed into the arena of fiction writing.\nWith her novel Neglected, Okwuma has dealt with a major health challenge, mental health.\nHer book is in the race for the huge prize money The Nigeria Prize for Literature 2020 is offeringShe heard news of her being among the best 11 fiction writers in the country after church service from a friend’s telephone call announcing the good news.\nHowever, I think my book Neglected should emerge the winner because it’s a new voice speaking on a subject matter that hasn’t been dived into a lot.\nI’m no expert in giving ways out of these challenges, but as I’ve written in my book Neglected, especially on mental health disorders, awareness and education play major roles in the solutions."
  },
  {
    "headline": "NLNG prize for literature: My book, Neglected should emerge the winner – Lucy Okwuma – Daylight",
    "summarized_story": "LUCY CHIAMAKA OKWUMA is among the few medical practitioners who have also crossed into the arena of fiction writing.\nWith her novel Neglected, Okwuma has dealt with a major health challenge, mental health.\nHer book is in the race for the huge prize money The Nigeria Prize for Literature 2020 is offeringShe heard news of her being among the best 11 fiction writers in the country after church service from a friend’s telephone call announcing the good news.\nHowever, I think my book Neglected should emerge the winner because it’s a new voice speaking on a subject matter that hasn’t been dived into a lot.\nI’m no expert in giving ways out of these challenges, but as I’ve written in my book Neglected, especially on mental health disorders, awareness and education play major roles in the solutions."
  },
  {
    "headline": "Champions League 2021-22 group stage draw: All you need to know",
    "summarized_story": "The 2021/22 UEFA Champions League group stage draw ceremony begins on Thursday 26 August.\nTwenty-six teams qualified automatically for the group stage, with the final six berths being decided via the play-offs.\nWhen are the group stage games?\nThe full fixture list for the group stage will be communicated following the draw.\nThe following award winners will also be announced during the course of the draw ceremony:Robert Lewandowski: Men’s Player of the Year 2019/20UEFA Men’s Player of the YearUEFA Women’s Player of the YearUEFA Men’s Coach of the YearUEFA Women’s Coach of the YearGoalkeeper of the 2020/21 UEFA Champions League seasonDefender of the 2020/21 UEFA Champions League seasonMidfielder of the 2020/21 UEFA Champions League seasonForward of the 2020/21 UEFA Champions League seasonGoalkeeper of the 2020/21 UEFA Women’s Champions League seasonDefender of the 2020/21 UEFA Women’s Champions League seasonMidfielder of the 2020/21 UEFA Women’s Champions League seasonForward of the 2020/21 UEFA Women’s Champions League season2022 Champions League finalThe 2021/22 campaign will conclude on Saturday 28 May, with the final set to take place at the Saint Petersburg Stadium in Russia."
  },
  {
    "headline": "Tokyo Paralympics: Nigeria wins first gold medal",
    "summarized_story": "Latifat Tijani put Team Nigeria on the medals table at the ongoing 2020 Paralympic Games in Tokyo on Thursday by winning the women’s -45kg event of the powerlifting competition.\nThe 39-year-old Ogun indigene had the best lift of 107kg to rank first and win the competition’s gold medal at the Tokyo International Forum.\nTijani failed his first attempt at 105kg but went on to lift it at the second attempt.\nFollowing Tijani in the competition was China’s Cui Zhe who lifted 102kg for the silver medal.\nPoland’s Justyna Kozdryk won the bronze medal with a lift of 101kg."
  },
  {
    "headline": "Jigawa at 30: Gov. Badaru Declares Friday Work-free Day",
    "summarized_story": "In honor of the 30th anniversary of the state’s formation, the Jigawa State Government has proclaimed Friday, August 27, 2021, as a holiday.\nThis was contained in a statement released to DAILY POST by the State Head of the Civil Service, Alhaji Hussaini Ali Kila.\nAccording to the announcement, Governor Muhammad Badaru Abubakar congratulated the Civil Servants and the general population on the State’s thirty-year anniversary.\nHe also encouraged people to pray for the state and the country as a whole as they celebrated the day.\nBadaru also urged all public servants and the entire population of the state to take advantage of the one-day break to thank Almighty Allah for the pleasant climate, peaceful coexistence, and many development initiatives that have been documented in the state thus far."
  },
  {
    "headline": "Buhari Govt Planning To Suspend Channels TV, Arrest Journalists Over Recent Interview — Sowore",
    "summarized_story": "Omoyele Sowore, a former African Action Congress presidential candidate, has accused President Muhammadu Buhari’s government of planning to censure Channels Tv and detain several journalists over a recent interview that the government did not like.\nIn a Facebook post, the publisher of SaharaReporters stated that President Buhari issued the directive following an interview with Benue State Governor Samuel Ortom and Rtd.\nThe human rights activist wrote, “Criminal Muhammadu Buhari reportedly orders NBC to go after Channels Television licence to be suspended by the Federal Govt of Nigeria over the interview of Gov.\nLet’s be vigilant and stand with these journalists.\nMuhammadu Buhari will be defeated and ultimately disgraced out of power.”A source that spoke with SaharaReporters said, “Buhari attacks Section 39(1) of the constitution – the government plans to shut Channels TV and arrest pressmen."
  },
  {
    "headline": "Plateau Massacre: Youths Dump Over 20 Corpses At State’s Government House",
    "summarized_story": "Following an attack on Yelwan Zangam village in the state’s Jos North Local Government Area, more than 20 bodies were dumped at the main entrance of Plateau State Government House in Little Rayfield on Wednesday.\nFamilies of some of the victims claimed that the attack was carried out by herders, however Fulani officials in Plateau State refuted this assertion.\nSome speculated that the incident was linked to a land dispute between members of Yelwan Zangam and Yelwan Mista Bow, a neighboring hamlet.\nWhile Plateau State police have acknowledged the incident, they have yet to reveal the exact number of individuals slain or the identity of the perpetrator.\nAccording to the Daily Trust, residents of Yelwan Zangam transported the victims’ bodies to Plateau Hospital on Wednesday to be deposited in the mortuary."
  },
  {
    "headline": "NCDC Records 7 COVID-19 Deaths, Over 600 New Cases In 18 States, FCT",
    "summarized_story": "The Nigeria Center for Disease Control (NCDC) has confirmed 637 COVID-19 cases across 18 states and the Federal Capital Territory of Abuja.\nOn Thursday morning, the NCDC announced on its verified Facebook page that seven patients had died as a result of the virus’s complications.\nSince the onset in 2020, Nigeria has registered 188,880 cases of the disease.\nHowever, a total of 2, 288 deaths have been reported across Nigeria, with Lagos State remaining the virus’s epicenter.\nThe post reads, “637 new cases of #COVID19NigeriaLagos-322Rivers-70Edo-54Delta-34Akwa Ibom-31Kwara-31FCT-29Ekiti-17Ogun-14Osun-10Kebbi-8Cross River-5Plateau-3Taraba-3Kaduna-2Bayelsa-2Benue-1Enugu-1Kano-1188,880 confirmed169,382 discharged2,288 deaths“States with zero cases reported (6): Gombe, Kano, Nasarawa, Oyo, Sokoto, and Zamfara”."
  },
  {
    "headline": "Breaking – 2020 Paralympics: Latifat wins gold, becomes first Nigerian to pick medal in Tokyo (VIDEO)",
    "summarized_story": "Tijani Latifat became the first athlete to pick Nigeria’s gold medal in the ongoing 2020 Paralympic Games in Tokyo.\nLatifat put up a scintillating performance after her first lift of 105kg was disallowed.\nThe Ogun state-born athlete, came back strong with burning enthusiasm to write her name in gold with her second attempt of 105kg and her third attempt was 107kg but she did that in a style with 117kg in her fourth attempt getting close to world record of 118kg to lift the first medal for team Nigeria in Tokyo.\nThe gold won by Latifat is Nigeria’s 71st medal in Paralympics.\nRelatedNo tags for this post."
  },
  {
    "headline": "Breaking: Kaduna govt evacuates ‘trapped’ students from Jos",
    "summarized_story": "The Kaduna State Scholarship and Loans Board said it has evacuated 87 students of the state origin studying in University of Jos and other tertiary institutions in Plateau state, following the recent crises in the state.\nThe Executive Secretary of the Board, Malam Hassan Rilwan disclosed in a statement made available to Blueprint on Thursday.\n“The Scholarship and Loans Board shall continue to remain proactive in such kind of volatile situations.\nWe are assuring Kaduna state citizens of our commitment to securing the lives of the state’s students in Plateau state and elsewhere.\n“The board also noted the support it received from the Senator representing Kaduna Central, Senator Uba Sani who assisted immensely in the evacuation of the students,” the statement added."
  },
  {
    "headline": "11 days after Jos attack: 36 killed in reprisal, gunmen cut bridge to deny victims help",
    "summarized_story": "In what is believed to be a reprisal, some 36 persons were reported killed Tuesday night in Zangam enclave of Yelwan Mr.\nBow of Jos North local government area of Plateau state, a local source has said.\nIn his own statement, Takwa said: “The Zagam Community of Yelwa in Jos north local government area of Plateau state yesterday 24 August 2021 came under attack by suspected gunmen.\nHe said the Jos paramount ruler, the Ujah Anaguta, and chairman of Jos North local government council intervened in the past conflicts where they both sued for peaceful living.\n“This has brewed tension and we instantly informed the chairman of Jos North Local Government Council, we equally called the DPOs of Anguwan Rogo and Katako, who have all come and have seen what happened,” he said."
  },
  {
    "headline": "FG seeks support of Russia to tackle insecurity -NigPilot",
    "summarized_story": "The Federal Government has signed a Military-Technical Cooperation Agreement with the Russian Federation to boost its fight against terrorism and other sundry crime in the country.\nNaval Spokesperson also explained that the Agreement on Military-Technical Cooperation between both countries provides a legal framework for the supply of military equipment, provision of after-sales services, training of personnel in respective educational establishments and technology transfer, among others.\nHe added that the signing of the Military-Technical Cooperation Agreement is a landmark development in the bilateral relations between Nigeria and the Russian Federation.\n“This Agreement terminates the earlier Agreement between the two countries signed on 6 March 2001.\n“Our army and navy are being modernised at a fast pace as they receive the latest generation military assets."
  },
  {
    "headline": "Niger Delta Ministry awards outstanding staff -NigPilot",
    "summarized_story": "Permanent Secretary, Ministry of Niger Delta Affairs Dr. Babayo Ardo has recognized outstanding and dedicated staff of the ministry, in line with the current Reform Policy in the Federal Civil Service to boost staff morale.\nDr. Babayo gave the recognition during the celebration of the outstanding awardees in the Ministry on Wednesday in Abuja.\nOfficer (PRS), Yohanna Daniel, Snr Quantity Surveyor (HUD), Togor Benjul, Senior Forest Officer, (EM), Sadiku Malietu, Princ.\nSecretary II (EE), Kenubia Vivian, Senior Admin.\nScientific Officer, (EM), Tenam Jude Lumo, Quantity Surveyor II, (HUD), Isah Ibrahim, Prin."
  },
  {
    "headline": "Army denies colluding with criminals in Abia State -NigPilot",
    "summarized_story": "The Nigerian Army has denied the allegation that its officers are colluding with criminals in Abia State who perpetrate criminality in the state.\nThe service, however, accused the member representing Isuikwuato constituency of Abia State in the House of Assembly of engaging in media trial.\nIt is most unfair for anyone at that height of the social ladder to sponsor a smear campaign against the Nigerian Army for whatever reason; particularly knowing that he has access to the leadership of the military.\n“The Nigerian Army, therefore, wishes to state that the misguided report is actually an abysmally failed attempt at blackmailing the NA for denying unscrupulous elements the freedom of action to foist lawlessness and violence on the good people and government of Abia state.\nWe, therefore, appeal to members of the public to approach the Army on any issue requiring clarification rather than resorting to blackmail”."
  },
  {
    "headline": "CDS orders NDA to probe invasion of the academy -NigPilot",
    "summarized_story": "The Chief of Defence Staff (CDS), General Lucky Irabor has ordered the hierarchy of the Nigerian Defence Academy (NDA) , to probe the circumstances surrounding the invasion of the Academy by armed bandits, with the view to unravel the remote and immediate cause of the compromised security.\nThe statement also noted that the alleged publication by an online news portal that the Nigerian Defence Academy (NDA) CCTV monitoring room was sleeping when bandits attacked the officers’ residential quarters leading to the death of two officers and the abduction of 1 other officer, was false.\n“The Nigerian Armed Forces wishes to state categorically that the allegation is untrue and hence challenge the Cable Online to publish forthwith a verifiable proof of personnel sleeping during the incident.\n“It is therefore imperative to caution the Cable Online media to guide against being used as a propaganda tool by enemies of our dear country.\n“The troops of the Armed Forces of Nigeria will continue with it’s operations to ensure all those involved in the dastardly act are brought to justice,” the statement conclueded."
  },
  {
    "headline": "UPDATED: Nigeria’s GDP Records 5% Growth For Second Quarter",
    "summarized_story": "Nigeria’s Gross Domestic Product (GDP) grew by 5.01% (year-on-year) in real terms in the second quarter of 2021, the National Bureau of Statistics (NBS) has said.\nThe NBS disclosed this in the latest report on the nation’s GDP entitled Nigerian Gross Domestic Product Report (Q2 2021) released on Thursday.\nIt added that the nominal GDP growth rate in Q2 2021 was higher than -2.80% growth recorded in the second quarter of 2020 when economic activities slowed sharply at the outset of the pandemic.\n“The Q2 2021 nominal growth rate was also higher than 12.25% growth recorded in Q1 2021,” the agency said.\n“Quarter-on-quarter, the oil sector recorded a growth rate of -20.35% in Q2 2021."
  },
  {
    "headline": "NDA Attack, Worst Form Of Human Rights Violation – Ojukwu",
    "summarized_story": "The Executive Secretary of the National Human Rights Commission (NHRC), Tony Ojukwu, has condemned in strong terms the attack on the Nigerian Defence Academy (NDA).\nIn a statement on Wednesday by the spokesperson for NHRC, Fatimah Mohammed, Ojukwu described the incident as an affront on Nigeria’s security that was unacceptable.\n“The invasion of the institution with high international repute where very intelligent military officers are produced is most unfortunate, unexpected, and condemnable” the NHRC chief lamented.\n“This is the worst form of human rights violation of our time,” said Ojukwu.\nBy doing so, the NHRC chief believes this will discourage further attacks on other national critical assets and infrastructure."
  },
  {
    "headline": "Plateau Govt Re-Imposes 24-Hour Curfew On Jos North LGA",
    "summarized_story": "The Plateau State government has re-imposed a 24-hour curfew on Jos North Local Government Area (LGA).\nDirector of Press and Public Affairs to Governor Simon Lalong, Dr Makut Macham, announced this in a statement on Wednesday.\nImposing curfew on the local government follows tensions sparked by the attack on Yelwa Zangam – a village in Zangam District of the state.\nAccording to Governor Lalong, the 24-hour curfew will come into force from 4pm on August 25 until further notice.\nGovernor Lalong equally states that the 6pm to 6am curfew in Jos South and Bassa LGAs still remains in place until further notice."
  },
  {
    "headline": "Matawalle Calls For State Of Emergency On Security In Northern Nigeria",
    "summarized_story": "Zamfara State Governor, Bello Matawalle, has called for a state of emergency in the northern part of the country over the security challenges in the region.\nFollowing the meeting with the senior police officer on Wednesday, Governor Matawalle briefed the people of the state on the present security situation in Zamfara.\nRead the full text of the briefing below:My dear people of Zamfara State.\nThe amazing successes of our peace efforts made our initiative appealing to some of the states sharing similar experiences as our state.\nMy good people of Zamfara state, you are living witnesses to all our unwavering commitments to peace."
  },
  {
    "headline": "Ex-Matron Jailed For Buying And Selling Six-Year-Old Boy",
    "summarized_story": "A 47-year-old mother of three has been convicted and sentenced to 10 years in prison for child trafficking in Akwa Ibom State.\nThe woman, Gertrude Akpan, a retired hospital matron was convicted by the Akwa Ibom State High Court sitting in Uyo, the state capital, for trafficking a 6-year-old boy.\nPresided over by Justice Okon Okon, the court found Akpan guilty of the offence and thereafter, gave the sentence without an option of fine.\nThe presiding judge ruled that the convict was “guilty of unlawful removal and transfer of the child victim from Akwa Ibom State to Owerri, Imo State”.\nGiving the sentence, the court held further that “buying and selling of children is against social and moral values of the people of Akwa Ibom State.”"
  },
  {
    "headline": "Delta: Four dead, many injured in fatal auto crash",
    "summarized_story": "Four people have been confirmed dead in an auto crash on the Benin-Asaba Expressway, Emuhu axis in Delta State.\nAccording to reports, the victims were charred to death after a diesel-laden tanker collided with an 18-seater commercial bus.\nThe acting Police Public Relations Officer in the state, DSP Bright Edafe, who confirmed the accident said, “Four persons died on the spot, while many who were injured were taken to hospitals.\nAdvertisement“The accident caused gridlock on the busy road, but security agents, including the police, were on ground to divert traffic to alternative routes.”The crash happened barely 24 hours after seven wedding guests died in an accident at Orogun, in the Ughelli North LGA of the state."
  },
  {
    "headline": "Nigerian man and Thai Wife charged with smuggling Crystal Meth in Thailand",
    "summarized_story": "Police apprehended Henry Kelechi Alaeto, 24, and Wanwisa Pilatan, 24, in their room in Bangkok’s Ratchathewi district on Tuesday, Pol Maj Gen Jirabhop Bhuridej, deputy commissioner of the Central Investigation Bureau (CIB), told reporters on Wednesday.\nAdvertisementPol Maj Gen Jirabhop said the extended investigation found that the sender was a woman, identified later as Ms Wannisa.\nIn a separate operation, police arrested two Nigerian men in Samut Prakan for other offences.\nAdvertisementOfficers from the Crime Suppression Division and the Immigration Bureau apprehended all four suspects after searches in four locations in Samut Prakan and Bangkok.\nAccording to Pol Maj Gen Jiraphop."
  },
  {
    "headline": "Video: More Nigerian doctors head for Saudi Arabia",
    "summarized_story": "At least 500 Nigerian doctors turned up for a recruitment exercise the Saudi health ministry organised in Abuja on Tuesday.\nIt would be recalled that the Saudi Ministry of Health had earlier called on doctors with different specialties to attend the interview.\nThe specialties are anesthesia, ICU, pediatric surgery, family medicine, obstetrics and gynecology, ENT, and emergency medicine.\nOthers are all sub-specialties of internal medicine, orthopedic surgery, radiology, and hematology.\nAdvertisementMeanwhile, the minister of Labour and employment, Chris Ngige, has berated the doctors for turning up for the exercise."
  },
  {
    "headline": "Nigeria’s GDP Grows 5.01% in Q2 2021, Highest In Six Years",
    "summarized_story": "Nigeria’s gross domestic product (GDP) has seen a sharp increase of 5.01 percent in the second quarter of 2021, the highest economic growth recorded under the Muhammadu Buhari administration in six years.\nThe National Bureau of Statistics, in its Q2 GDP report, said the 5.01% growth rate recorded year on year, was higher than the -6.1% growth recorded in Q2 2020 and the 0.51% recorded in Q1 2021.\nThe Agency statement reads, “The Q2 2021 growth rate was higher than the -6.10% growth rate recorded in Q2 2020 and the 0.51% recorded in Q1 2021 year-on-year, indicating the return of business and economic activity near levels seen prior to the nationwide implementation of COVID-19 related restrictions”.\nIt added that the nominal GDP growth rate in Q2 2021 was higher than -2.80% growth recorded in the second quarter of 2020 when economic activities slowed sharply at the outset of the pandemic.\n“The Q2 2021 nominal growth rate was also higher than 12.25% growth recorded in Q1 2021,” the agency said."
  },
  {
    "headline": "Guardiola To Leave Man City When Contract Expires in 2023",
    "summarized_story": "Pep Guardiola has said that he will leave Manchester City when his contract runs out in 2023 – and hopes to manage a national team.\nThe 50-year-old, who joined City in 2016, plans to “have a break” after seven years at the helm of the Premier League club.\n“I think I’m going to have a stop.\nI’m going to have to take a break, see what we’ve done,” Guardiola said.\nGuardiola, who has won three Premier League titles, one FA Cup and four successive League Cups with City, took a 12-month break from management after leaving Barcelona in 2012 before joining Bayern Munich."
  },
  {
    "headline": "South Africa’s Economy is $37bn Bigger Than Previously Thought",
    "summarized_story": "South Africa’s economy is 11% bigger than previously estimated after statistics authorities changed the way they calculate the gross domestic product.\nGDP at current prices measured 5.52 trillion rand ($369 billion) in 2020, compared with a previous estimate of 4.97 trillion rand, said Joe de Beer, deputy director-general of economic data at Statistics South Africa, told reporters Wednesday in the capital, Pretoria.\nThe economy remains Africa’s second-biggest, lagging behind Nigeria.\nRatios in which GDP is the denominator will decline if the numerator remains the same, he said.\nIts statistics office plans to publish overhauled GDP data in late 2022 or in the first quarter of 2023."
  },
  {
    "headline": "Japan Suspends 1.63 Million Doses of Moderna Over Contamination",
    "summarized_story": "Japan suspended use of about 1.63 million doses of Moderna vaccine Thursday after contamination was found in unused vials, raising concern of a supply shortage as the country tries to accelerate vaccinations amid a COVID-19 surge.\nThe health ministry said contamination was reported from multiple vaccination sites.\nSome doses might have been administered, but no adverse health effects have been reported so far, officials said.\nThe health ministry and Takeda did not give details on the type of contamination or if the doses in question may have been distributed outside Japan.\nAbout 43% of the Japanese population have been fully vaccinated, with daily doses of about 1 million."
  },
  {
    "headline": "Afghans Told to Leave Kabul Airport Over ‘Very Credible’ Islamic State Terrorist Threat",
    "summarized_story": "“There is now very, very credible reporting of an imminent attack,” British armed forces minister James Heappey told BBC radio.\nA NATO diplomat at the airport and a Taliban official both said the threat came from Islamic State, though none of the three goverments had specified.\nA Western diplomat in Kabul said areas outside the airport gates continued to be “incredibly crowded” despite the warnings.\nThe Taliban, whose fighters are guarding the perimeter outside the airport, are enemies of the Afghan affiliate of Islamic State, known as Islamic State Khorasan (ISIS-K), after an old name for the region.\n“Our guards are also risking their lives at Kabul airport, they face a threat too from the Islamic State group,” said a Taliban official, who spoke on condition of anonymity."
  }
]