[
  {
    "headline": "BREAKING: Algeria become first African team to record 27-match unbeaten run",
    "summarized_story": "Captain Riyad Mahrez scored as Algeria defeated Tunisia 2-0 in an international friendly this weekend to create a record 27-match unbeaten run by an African national team.\nFacing Tunisia away was a huge challenge as reigning African champions Algeria sought to overtake the mark set by the Ivorian ‘golden generation’.\nThe Tunisians are ranked second in Africa, two places above Algeria, had home advantage and took a 12-match unbeaten run into the north African showdown.\nHaving broken the African record, coach Djamel Belmadi can now adjust his sights to the 36-match world mark set by then world champions Brazil in 1996.\nAlgeria are scheduled to play back-to-back 2022 World Cup qualifiers in September, October and November in a group that includes Djibouti, Burkina Faso and Niger."
  },
  {
    "headline": "Buhari’s provocative order on grazing route",
    "summarized_story": "), instigated fresh controversy on Thursday by declaring strong support for open cattle grazing.\nWith a national stock of 20 million-plus cattle head, Buhari’s open cattle grazing scheme is a threat to settled farming communities across the country.\nGlobally, open grazing has been replaced by pragmatism: ranching, undertaken as a private business.\nOpen grazing belongs to the distant past of Nigeria’s history.\nWithout getting emotional, Singapore’s founding father, Lee Kuan Yew, eradicated open grazing though it was the culture there."
  },
  {
    "headline": "June 12 protest: Why police fired tear gas -Sanwo-Olu’s aide",
    "summarized_story": "Anthony Adeyinka, Senior Special Assistant on Sports to Lagos State Governor, Babajide Sanwo-Olu, has commended operatives of the Lagos State Police Command over their handling of the June 12 protest in the state.\nHe spoke with The PUNCH team at the Lekki Toll Plaza on Saturday morning.\nAccording to him, the police rose to the occasion to disperse hoodlums, who wanted to hijack the protest at the Gani Fawehinmi Park in the Ojota area in Lagos State.\nThe PUNCH had earlier reported that policemen fired tear gas canisters and gunshots at the Ojota venue of the protest earlier on Saturday.\nWhen asked to comment on the case of police firing tear gas at the Gani Fawehinmi Park, the governor’s aide said, “I was impressed with the way the police handled that situation, it was not the activists, it was the hoodlums that wanted to hijack that protest."
  },
  {
    "headline": "The pains & gains of democracy",
    "summarized_story": "From the great city of Athens to the famed halls of the American Capitol building, democracy has garnered strength all over.\nSadly, my dear state, Ekiti, has not been entirely immune to these multitudes of woes.\nThe journey so far has not been all bleak for my country Nigeria as well as my State Ekiti.\nWe must agree that Democracy is far better than military dictatorship.\nGod bless the people of Ekiti state, God bless Nigeria."
  },
  {
    "headline": "June 12: N’Delta group disassociates self from planned nationwide protest",
    "summarized_story": "Raises alarm over plans by hoodlums to hijack protestUrges Niger Delta youths not to participateBy Gabriel Ewepu – AbujaA Niger Delta group, Niger Delta Youth Congress, NDYC, Friday, disassociated self from planned protest on Saturday June 12 across the country by some groups as Nigerians commemorate 2021 Democracy Day.\nThis was contained in a statement signed by the National Coordinator, NDYC, Comrade Israel Uwejeyan, where it raised the alarm over plans by hoodlums to hijack protest across the country, especially in the Niger Delta region, to create chaos and civil unrest that could be bloody.\nAccording to the statement, with information gathered there are planned moves to hijack the protest by miscreants who are sponsored by unscrupulous politicians who are bent to set the country on fire.\nThe group also expressed concern that innocent Nigerians are already apprehensive and talking in groups about the information flying around about bloody hijack of the protest, and urged secret officials to act swiftly on available information to prevent any possible breakdown of law and order.\nThe statement reads in part, “We the Niger Delta Youth Congress (NDYC) wants to succinctly state that we are not a party to the planned Nationwide June 12th 2021 protest."
  },
  {
    "headline": "Apprehension as petrol station Manager dies in Delta",
    "summarized_story": "By Festus Ahon & Ochuko Akuopha, UGHELLIAPPREHENSION has enveloped Ughelli, headquarters of Ughelli North Local Government Area, Delta State, following the death of a Petrol station Manager, (names withheld).\nThe source who pleaded anonymity, alleged that when other workers resumed, discovered the Manager in the manhole leading to the underground tank struggling for breath.\nEfforts made to reach the management of the petrol station and family of the deceased Manager for comments on the matter, proved abortive as at press time.\nHowever, a Senior Police Officer in the area, confirmed that the matter was reported, adding that the Police has deposited the corpse in the morgue.\nThe Police officer who does not want his name in print, said the matter was already being investigated."
  },
  {
    "headline": "Democracy Day: Amechi congratulates Ndokwa Nation",
    "summarized_story": "One of the illustrious sons of Umusadege and CEO of Tony Amechi Foundation (TAF), Chief Tony Amechi congratulates every Ndokwa son and daughters for witnessing another democracy day.\nThis was contained in a statement issued in Asaba, the Delta State capital, over the weekend adding that, the people of Ndokwa even though marginalised over the years have reasons to celebrate this day.\n“Since Independence particularly from the berth of the fourth republic in 1999, nothing has really changed in Ndokwa Nation, and Delta State at large.\n“Ndokwa nation nay; Nigeria, needs collective efforts of all to function and develop because we have no other place to call our home and we must endeavour to build a virile nation where our children yet unborn can be proud to live in.\nLooking round Delta State since creation, there is no visible change and even change in character is at its lowest ebb and such adds no value to any nation."
  },
  {
    "headline": "Nigeria’s dissolution unavoidable with FG encouraging injustice ― Bishop Amah",
    "summarized_story": "The position of the Diocese is contained in its Bishop, Rt.\n“For some, restructuring means the creation of additional states, particularly in South East.\nFor others, it is about moving certain items from the exclusive legislation list to concurrent list.\nFor others, it is about devotion of power and local government and judiciary autonomy.\nHowever, the need to restructure Nigeria is now because Nigeria is not working”."
  },
  {
    "headline": "Niger govt bans protests over insecurity",
    "summarized_story": "The Niger State Government has announced a ban on demonstrations in the state.\nAhmed Matane, Secretary to the State Government (SSG), issued the directive on Saturday.\nThe SSG said the order, which followed plans by groups to protest against insecurity, is with immediate effect.\n“The decision to ban all forms of processions was as a result of the security situation in the state”, he said.\nMatane added that security agencies have been directed to deal with persons and organizations that violate the order."
  },
  {
    "headline": "June 12: Streets deserted as ‘Buhari Must Go” protest holds in Benin",
    "summarized_story": "Following threats posed by the nationwide Democracy Day protests, fear of possible attacks and other related events have kept most residents of Benin City, the capital of Edo State, indoors.\nSpeaking during the procession, Comr Lucky Afenokhuae told DAILY POST that the protest was necessary owing to the situation surrounding the mismanagement of the country by few individuals.\n“Security is now on holiday in Nigeria, foodstuffs, other company’s consumables have skyrocketed.\nAs at the time of filling this report, the city remained calm as the protesters are demonstrating under the protection of security operatives.\nBanditry, kidnapping, herdsmen crisis leading to calls for Nigeria’s breakup – Lai Mohammed"
  },
  {
    "headline": "Army announces shooting exercise in Rivers",
    "summarized_story": "The Nigerian Army 6 Division, Port Harcourt, Rivers State, will commence its annual range classification exercise from Sunday June 13, to Sunday, June 27.\nThe spokesman said the exercise is to ascertain the professional competence of troops on the use of firearms.\nTroops from the division and affiliated formations and units would conduct the exercise at the Army Shooting Range in Igwuruta and Elele Barracks, both in Ikwerre.\n“The shooting exercise is a routine activity in the Nigerian Army which involves the firing of various caliber live ammunition”, Ekeocha noted.\nResidents of Igwuruta and Elele and environs were advised to keep away from the general shooting area."
  },
  {
    "headline": "June 12: Kwara residents obey govt directive, shun protests",
    "summarized_story": "The Democracy Day celebration on Saturday, June 12, has been peaceful in Ilorin, Kwara State capital.\nSome shops did not open for business in the early part of the day, but others were observed transacting business with caution.\nProtests were not carried out in all the towns mentioned according to statewide intelligence reports received by DAILY POST.\nOur correspondent also reports that the National Association of Nigerian Students (NANS), Kwara State branch, kept its promise not to participate in the planned nationwide protest for Saturday.\nFinancial autonomy: Osun govt assures JUSUN of implementation, commends union for peaceful protest"
  },
  {
    "headline": "Democracy Day: Kaduna residents lament hardship, insecurity",
    "summarized_story": "As Nigerians marked Democracy Day on June 12, residents of Kaduna State have lamented insecurity, hardship, and hike in prices of foodstuff in the market.\nMurtala, who said he is not comfortable with the present government, explained that he has never witnessed insecurity in his life as it happens in the state today.\nWe are going through tough times in Kaduna State.\nFear, tension as JUSUN, NARD, ASUP shut downHowever, the Speaker, Kaduna State House of Assembly, Yusuf Ibrahim Zailani, is of a different opinion.\nThough there are no protests in Kaduna State as seen in other places like Lagos and Abuja, the message on the faces of people rightly tell ordinary Nigerian that hardship is on the increase."
  },
  {
    "headline": "Hazard: I’m still not 100 percent",
    "summarized_story": "Belgium captain Eden Hazard has admitted that he will not be in top condition for his country’s opening Euro 2020 game against Russia.\nThe Red Devils kick off their tournament on Saturday and Hazard’s preparation has been less than ideal.\n“I’ve only had one full week of training,” Hazard told Belgian media channel RTBF.\nADVERTISEMENT“We’ll see, with the medical team what I’ll do for the first match.\n“To begin with, it will be the head coach’s decision, but I’m still not 100 percent so we’ll see what we’ll do.”The 30-year-old has been unable to gain any consistency in the last two seasons and joined the Belgian camp still struggling with some niggles in his leg."
  },
  {
    "headline": "Suspected herdsmen raid Ekiti community, kidnap farmer",
    "summarized_story": "By Rasaq Ibrahim, Ado EkitiArmed men suspected to be herdsmen have abducted a farmer, Alhaji Jimoh Olodan, at Iyemero Ekiti, in Ikole Local government Area of Ekiti State.\nThe Nation gathered that the incident occurred around 11:15 pm on Friday at Elegure farm settlement which is three kilometers to the community.\nADVERTISEMENTAn eye-witness, Chief Ajayi Ogungbemi, who is the Babaloja of Iyemero said that the gun-wielding abductors, numbering 18, invaded the farm settlement and shot sporadically into the air before whisking away the farmer.\n“The manner at which they operated showed that they had a target, who was Alhaji Olodan.\nThe community leader appealed to the Ekiti State Police command and the Amotekun corps to expedite actions and free the victim from his captors."
  },
  {
    "headline": "BREAKING: Low turn out as Sowore’s supporters commence “Buhari Must Go” protest",
    "summarized_story": "By Toba Adedeji, OsogboLow turnout marked the “Buhari Must Go” protest in the Osogbo capital of Osun State on Saturday.\nActivist Omoyele Sowore had called on Nigerians to come out en mass to join a protest tagged “Buhari Must Go” on June 12, 2021.\nADVERTISEMENTTheir demands are: reduce the bogus salaries of politicians, Justice for #ENDSARS victims, Abolish 1999 constitution, End Insecurity, End Terrorism and Banditry constitution, Free all detained activists.\nThe list also includes; Reverse electricity tariff, End ASUP Strike, Revert fuel price and stop further increment, Reverse party Deregistration, Pantami must go and Buhari Must Go.\nThe youths later marched towards Old-Garage via Nelson Mandela Freedom Park, Osogbo chanting anti-government songs."
  },
  {
    "headline": "BREAKING: Police fire teargas at June 12 protesters in Lagos",
    "summarized_story": "Our ReporterPolice in Lagos state on Saturday morning fired tear gas at protesters that gathered at the Gani Fawehinmi Park in Lagos.\nThe Park is a point of convergence for the June 12 Democracy Day protest in the state.\nADVERTISEMENTThey had converged to demand for an end to bad governance and others.\nDetails later"
  },
  {
    "headline": "‘We can’t imagine life without T.B. Joshua’",
    "summarized_story": "“Prophet Joshua was extremely humble and generous.\nADVERTISEMENT“God used Prophet Joshua to heal me of prolonged acute knee pain on a particular service day.\nShe first encountered the man T. B. Joshua back in 1985 in Ikole-Ekiti when he was virtually unknown.\nShe recounted how Joshua told the whole church to stand up for her that day.\nTB Joshua is not a selfish person that would want whatever he was doing to end with his death."
  },
  {
    "headline": "BREAKING: Again, herdsmen kill six farmers in Nasarawa State",
    "summarized_story": "By Leo Nzwanke, LafiaAbout six farmers are said to have been killed by suspected herdsmen in keana local government area of Nasarawa state.\nConfirming the killings, President, Tiv Development Association (TIDA) Nasarawa State Comrade Peter Ahemba said that about six Tiv farmers in Nasarawa State were killed by suspected herdsmen.\nComrade Ahemba said the suspected Fulani herdsmen evaded Tse-Jimin village, Aloshi kingdom of Keana local government at about 9:45pm yesterday.\nComrade Ahemba also said those killed are Batholomi Yahaya, Mnena Gideon, Ityokugh Yakubu, Timothy Aye, Ababi Tsavbee and Blessing Oliver.\nThe TIDA president said one of the woman who survived the attacked confirmed that they were Fulani herdsmen."
  },
  {
    "headline": "Full text of President Muhammadu Buhari's Democracy day 2021 address – The Sun Nigeria",
    "summarized_story": "It is a celebration of freedom and a victory for one people, one country and one Nigeria.\nI have also recently approved the National Poverty Reduction with Growth Strategy Plan that augments existing plans to further reduce poverty in Nigeria.\nI am very convinced that this 100 million target can be met and this informed the development of a National Poverty Reduction with Growth Strategy.\nThe day I joined the Nigerian Army I was prepared to lay down my life for Nigeria.\nI thank you for your patience and attention and more importantly your resolve to join hands in making Nigeria the country of our dream."
  },
  {
    "headline": "I’m lazy in bed –Eka Duke",
    "summarized_story": "For Nollywood actress, Eka Duke, being good in bed is a natural gift; it has nothing to do with where you come from.\nAs a matter of fact, Duke is against the notion that Calabar girls like her have special prowess in sex matters.\nAccording to the microbiology graduate, being good in bed is nothing but a gift; it has nothing to do with being Calabar girl.\n“It is generally assumed that Calabar girls are very good in bed and also good at taking care of their men.\nAs for me, I’m very lazy in bed."
  },
  {
    "headline": "June 12: Embrace democratic virtues, Kalu tells political class",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has called on the political class to demonstrate and uphold the tenets of democracy in all endeavours.\nCommending the President Muhammadu Buhari-led Federal Government for its concerted efforts in repositioning the country, Kalu stressed that the President has built critical infrastructure across the nation.\nIn a goodwill message in commemoration of this year’s democracy day, Kalu commended Nigerians for embracing democracy, adding that the country has benefited from the dividends of democracy.\n“The political class, regardless of party affiliations, should support the president’s agenda of building a prosperous Nigeria.\n“The political class should emulate the qualities of the late Chief M.K.O Abiola, who was a widely accepted business mogul and political leader beyond the shores of Africa."
  },
  {
    "headline": "Igangan massacre: Yoruba elders, groups blast Buhari for keeping mute",
    "summarized_story": "Secretary-General of YCE, Dr. Kunle Olajide, told Saturday Sun: “The two projects that President Buhari came for in Lagos on Thursday were worth it.\nComing to Lagos, he should have made comments on the Igangan massacre.\nPresident Buhari should have made comments on the Igangan massacre, especially when he was in Lagos on Thursday.\nThis is an affirmation that President Buhari is president of the North.\nAdegoke, in a separate interview, said: “It was expected that the President would commiserate with the victims of violence in different parts of Nigeria, Igangan inclusive."
  },
  {
    "headline": "Buhari: I Joined Army Prepared to Die for Nigeria, As President I’ll Defend Its Corporate Existence",
    "summarized_story": "President Muhammadu Buhari has said that he was prepared to die for Nigeria the day he joined the army, vowing that as President, he will defend the country’s corporate existence.\n“Overcoming the present challenges is but one of a necessary process that we have to undergo as a nation so that we can come out stronger.\nThe day I joined the Nigerian Army I was prepared to lay down my life for Nigeria.\n“As your President I remain ever committed to upholding and defending Nigeria’s corporate existence,” the president said, in a national broadcast to mark Nigeria’s 2021 Democracy Day Saturday.\nPresident Buhari said, “overcoming the present challenges is but one of a necessary process that we have to undergo as a nation so that we can come out stronger.”He further said, “My strong belief in the Nigerian spirit gives me comfort that we are facing these challenges with renewed commitment to keep our country one.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: I Will Ensure Security, Welfare of Nigerians",
    "summarized_story": "President Muhammadu Buhari has said that he will do all within his power to ensure that the security and welfare of Nigerians remain the primary purpose of government.\nSpeaking during a broadcast to commemorate the 2021 Democracy Day, the president said: “In adhering to the Fundamental Objectives and Directive Principles of State Policy notably section 14(2)(b) I shall do all within my power to ensure that the Security and welfare of the people remain the primary purpose of government.\n“I have, throughout my tenure, provided the security agencies with all they require relative to available resources and will be providing more as the dynamics unfold to put an end to our security problems.”Details.\nlater..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "On Democracy Day, Buhari Vows to Punish ‘Enemies of State’",
    "summarized_story": "He expressed his commitment towards providing an enabling environment for a free, fair and credible electoral system while his tenure lasts.\n“The CBN’s N50 billion Textile Sector intervention Facility increased capacity utilization of ginneries from 30% to nearly 90%.\n“The Economic Sustainability Plan – our rebound plan for the COVID-19 pandemic developed in 2020 is currently being executed.\nThe plan is primarily focused on the non-oil sector, which has recorded phenomenal growth contributing over 90% to the GDP growth in Q1 2021.\nThough marginal we have recorded GDP growth over two quarters; Q2 2020 and Q1 2021."
  },
  {
    "headline": "For the Record: Buhari’s Democracy Day Speech",
    "summarized_story": "Fellow Nigerians,I join you all today to commemorate and celebrate our Democracy Day.\nI have also recently approved the National Poverty Reduction with Growth Strategy Plan that augments existing plans to further reduce poverty in Nigeria.\nI am very convinced that this 100 million target can be met and this informed the development of a National Poverty Reduction with Growth Strategy.\nThe day I joined the Nigerian Army I was prepared to lay down my life for Nigeria.\nSpeech by President Muhammadu Buhari, on the celebration of Democracy Day on June 12, 2021Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Condoles with Families of Fallen Soldiers, Victims of Insecurity",
    "summarized_story": "President Muhammadu Buhari has sent his condolences to the families of military personnel who lost their lives in the line of duty and Nigerians who are unfortunate victims of such senseless arsons, kidnappings and murders.\nIn his national broadcast on Saturday to mark this year’s democracy day, Buhari said: “Once again, I want to render my sincere and heart-felt condolences to the families and friends of our gallant service men and women who lost their lives in the line of duty and as a sacrifice to keep Nigeria safe.\n“I extend the same condolence to the families and friends of our country men, women and children who were unfortunate victims of such senseless arsons, kidnappings and murders.\n“I also share the pains of families and direct victims of ransom-seeking, kidnaped victims who went through unimaginable trauma in the course of their forced imprisonment.”“Let me assure my fellow citizens that every incident, however minor gives me great worry and concern and I immediately order security agencies to swiftly but safely rescue victims and bring perpetrators to justice.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Nigerian Soldiers Fighting Bandits In North-West Yet To Receive March, April Allowances",
    "summarized_story": "Soldiers of the Nigerian Army attached to Exercise Harbin Kunama, which is an anti-banditry operation in the North-West region, are being owed March and April allowances – a situation which is currently affecting their morale.\nSome of the affected soldiers under 31 Artillery Brigade told SaharaReporters that they were told they would spend only six months fighting bandits in Niger State, but had now spent about two years, while their allowances were not regularly paid and underpaid when it came.\nWe were told that we were to spend three months only on this operation, but we have spent two years.\nWe believe they are giving them (army authorities) the money but they decided to feed us and use us as slaves.\nPlease, this should be an open letter to the Chief of Army Staff and the General Officer Commanding, 1 Division,” another soldier lamented."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Soldiers Fighting Bandits In North-West Yet To Receive March, April Allowances",
    "summarized_story": "Soldiers of the Nigerian Army attached to Exercise Harbin Kunama, which is an anti-banditry operation in the North-West region, are being owed March and April allowances – a situation which is currently affecting their morale.\nSome of the affected soldiers under 31 Artillery Brigade told SaharaReporters that they were told they would spend only six months fighting bandits in Niger State, but had now spent about two years, while their allowances were not regularly paid and underpaid when it came.\nWe were told that we were to spend three months only on this operation, but we have spent two years.\nWe believe they are giving them (army authorities) the money but they decided to feed us and use us as slaves.\nPlease, this should be an open letter to the Chief of Army Staff and the General Officer Commanding, 1 Division,” another soldier lamented."
  },
  {
    "headline": "Nigerian Soldier Leaks Shoot-At-Sight Order, Advises Orlu Residents To Relocate",
    "summarized_story": "A yet-to-be-identified Nigerian Army soldier has warned residents of Orlu town in Imo State to either relocate or be vigilant as some personnel had allegedly been given a shoot-at-sight order in the ongoing battle with the Eastern Security Network operatives.\nThe soldier, who is attached to the 302 Artillery Regiment, Onitsha, Anambra State, warned residents of the town to relocate based on their commander's alleged order.\nIn the audio obtained by SaharaReporters, the soldier said, \"They first carried us (deployed us) to Maiduguri (Borno State).\nAll of us were inside the barracks in Onitsha till 12pm this afternoon.\n\"When the fight ended in Orlu, the commander now said anybody we see, we should fire them."
  },
  {
    "headline": "Nigerian Soldier Leaks Shoot-At-Sight Order, Advises Orlu Residents To Relocate",
    "summarized_story": "A yet-to-be-identified Nigerian Army soldier has warned residents of Orlu town in Imo State to either relocate or be vigilant as some personnel had allegedly been given a shoot-at-sight order in the ongoing battle with the Eastern Security Network operatives.\nThe soldier, who is attached to the 302 Artillery Regiment, Onitsha, Anambra State, warned residents of the town to relocate based on their commander's alleged order.\nIn the audio obtained by SaharaReporters, the soldier said, \"They first carried us (deployed us) to Maiduguri (Borno State).\nAll of us were inside the barracks in Onitsha till 12pm this afternoon.\n\"When the fight ended in Orlu, the commander now said anybody we see, we should fire them."
  },
  {
    "headline": "EXCLUSIVE: Faces Of \"Innocent\" South-East Residents Killed By Police, Army After Being Labelled As Gunmen",
    "summarized_story": "Operatives of the police and the Nigerian Army, in carrying out mass raids and arrests of South-East residents, have shot dead some of the suspects, allegedly labelled as gunmen terrorising the region.\nSaharaReporters obtained the photographs of two of the victims living in Umuahia, Abia State, whom residents confirmed to be part of them and not unknown gunmen as the police and the army labelled them.\nThe security operatives killed both men on May 29, and after that, labelled them as Eastern Security Network members.\n“The army and police have a certain NHSS Tactical Squad – whatever that means – which has been arresting the South-East residents, mainly youths, and locking them up in these discreet military underground camps.\n“They are labelled as members of the Indigenous People of Biafra members and Eastern Security Network members and denied access to family members and lawyers."
  },
  {
    "headline": "Democracy Day: Twitter CEO tweets Nigerian flag -- despite suspension",
    "summarized_story": "Jack Dorsey, the co-founder and chief executive officer of Twitter, a microblogging platform, has tweeted the green and white colour of the Nigerian flag.\nAdvertisementOn June 4, the federal government indefinitely suspended Twitter operations in Nigeria.\nThe suspension came two days after Twitter took down President Muhammadu Buhari’s tweet in reference to the civil war, which it said violated its rules.\nAs Nigeria celebrates the June 12 Democracy Day Saturday, Dorsey took to his Twitter handle, which has over 5 million followers to tweet the Nigerian flag.\nAdvertisementThe suspension of the microblogging platform has sparked a series of condemnations among many Nigerians and international organisations."
  },
  {
    "headline": "Democracy Day: Twitter CEO tweets Nigerian flag -- despite suspension",
    "summarized_story": "Jack Dorsey, the co-founder and chief executive officer of Twitter, a microblogging platform, has tweeted the green and white colour of the Nigerian flag.\nAdvertisementOn June 4, the federal government indefinitely suspended Twitter operations in Nigeria.\nThe suspension came two days after Twitter took down President Muhammadu Buhari’s tweet in reference to the civil war, which it said violated its rules.\nAs Nigeria celebrates the June 12 Democracy Day Saturday, Dorsey took to his Twitter handle, which has over 5 million followers to tweet the Nigerian flag.\nAdvertisementThe suspension of the microblogging platform has sparked a series of condemnations among many Nigerians and international organisations."
  },
  {
    "headline": "Transport union workers disperse June 12 protesters in Lagos",
    "summarized_story": "Transport union workers and security operatives have dispersed June 12 protesters from the Gani Fawehinmi Park in Ojota area of Lagos state .\nAdvertisementProtesters had converged on the Park on Saturday to demonstrate against bad governance, insecurity, the unemployment level, among other issues.\nThereafter, the protesters moved upward with their placards, chanting solidarity songs.\nAdvertisementSuddenly, the union workers, after having a meeting with themselves, moved towards the protesters and ordered everyone to vacate the premises.\n“Anyone that creates unnecessary havoc here will die.”Advertisement“What are these hoodlums doing here?” one of the union workers said while pointing at the protesters."
  },
  {
    "headline": "Transport union workers disperse June 12 protesters in Lagos",
    "summarized_story": "Transport union workers and security operatives have dispersed June 12 protesters from the Gani Fawehinmi Park in Ojota area of Lagos state .\nAdvertisementProtesters had converged on the Park on Saturday to demonstrate against bad governance, insecurity, the unemployment level, among other issues.\nThereafter, the protesters moved upward with their placards, chanting solidarity songs.\nAdvertisementSuddenly, the union workers, after having a meeting with themselves, moved towards the protesters and ordered everyone to vacate the premises.\n“Anyone that creates unnecessary havoc here will die.”Advertisement“What are these hoodlums doing here?” one of the union workers said while pointing at the protesters."
  },
  {
    "headline": "Buhari supporters mob June 12 protester in Abuja",
    "summarized_story": "Some persons who identified themselves as supporters of President Muhammadu Buhari mobbed a June 12 protester at Unity Fountain, Abuja.\nAdvertisementAs Nigeria celebrated Democracy Day, protesters stormed major cities nationwide to kick against “bad governance” under the Buhari administration.\nIn Abuja, a pro-Buhari rally is also being held at the Unity Fountain to show support for the president.\nThe president’s supporters gathered with customised T-shirts and placards, some of which read, ‘Nigerians say no to fake activist’, ‘Nigerians say no to violence’.\nThe mob action was similar to what played out during the #EndSARS protests in October last year when the demonstrators were attacked in Abuja at various locations."
  },
  {
    "headline": "MultiChoice is increasing its stake in BetKing for $281.5 million",
    "summarized_story": "Seven months after taking up an initial 20% stake in BetKing, South African pay TV operator MultiChoice plans to increase its shareholding in the online gambling company to 49% in a $281.5 million deal.\nBetKing is the trading name of Blue Lake Ventures Limited, a pan-African sports betting and entertainment business with major operations in Nigeria.\nThe value of MultiChoice’s initial investment in BetKing was said to be worth more than $100 million.\nBetKing’s annual statement for the financial year ended December 2020 shows a growth in revenue to $77.9 million, from $54.7 million in the previous year.\nYet, Africa accounts for only 2% of global sports betting revenue."
  },
  {
    "headline": "Nigeria’s Central Bank to launch digital currency before 2022",
    "summarized_story": "Nigeria may pilot an official digital currency in 2021, going by the words of Rakiyat Mohammed, a Central Bank Director in charge of the Information Technology Department, who revealed on Thursday that the banking regulator will soon launch a digital currency.\nA Central Bank Digital Currency (CBDC) represents a country’s official currency in digital form.\nAccording to the CBN director, about 80% of central banks in the world are currently exploring the possibility of issuing central bank digital currency and Nigeria could not be left behind.\nLast year, the Bahamas launched the world’s first central bank digital currency.\nWhen it eventually becomes operational, the digital currency will complement the existing forms of currency in the country and could help reduce the high cost of managing and transferring cash."
  },
  {
    "headline": "What is a VPN and how does it work in Nigeria?",
    "summarized_story": "On the internet, different computers send and receive information between Internet Protocol (IP) addresses.\nBefore turning on my VPN, my device was in Lagos, NigeriaAfter turning on my VPN, my device is in Santo Domingo, Dominican RepublicThe images above show how my location changed from Nigeria to Dominican Republic after turning on my VPN.\nNo monitoring: As we mentioned earlier, your internet service provider (ISP) can see your internet traffic and probably log your browsing history.\nWhat is the difference between a VPN app, a VPN plugin, and a VPN browser?\nAlso, some sites and services look at VPN traffic as suspicious and won’t let you connect."
  },
  {
    "headline": "TECNO CAMON 17 Pro: A Creative Nod to the Selfie and the Selfie Culture",
    "summarized_story": "A few weeks back, TECNO launched the TECNO CAMON 17 Pro smartphone, focusing on the selfie with a 48MP AI selfie camera and 90 Hz super-high refreshing rate at 6.8-inch FHD Screen.\nSo, today, I am going to be sharing the things I love about the Camon 17 Pro.\nThe selfie camera of the Camon 17 Pro is one of the highlights of the phone.\nCamera LAB – The TAIVOS™ Imaging LaboratoryThe TECNO CAMON 17 Pro comes with trademarked TAIVOS technology.\nFurthermore, the TECNO CAMON 17 Pro comes with fast charging so, the TECNO CAMON 17 Pro will be ready to leave when you are."
  },
  {
    "headline": "Fostering Gender Inclusion in Technology with the Bolt Drive4WITech Initiative",
    "summarized_story": "The journey into tech for women in Africa is an ongoing discussion largely influenced by cultural norms and societal expectations concerning gender.\nBolt, an inclusive mobility company, recognises this and as part of efforts to drive participation and inclusion for women in technology, launched the #Drive4WITech (Drive for Women in Tech) initiative to support young women in Africa.\nQ: Among the many applications received, you were selected to intern with Bolt in the #Drive4WITech initiative.\nOluwakorede: I supported the marketing team at Bolt Nigeria.\nI am more equipped to confidently make significant contributions to my future work team."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Global Wellness Day: Protecting mental health with technology",
    "summarized_story": "In Africa, mental health resources are scarce, reflecting the weakness of mental health services on the continent.\nA World Health Organization (WHO) fact sheet reveals that mental health disorders, otherwise known as mental health illnesses, vary and come with different presentations.\nNonetheless, a mental health concern becomes a mental health disorder when signs and symptoms cause recurring stress and affect the ability to function.\nProtecting your mental health with technologyImage by Firmbee from PixabayThere are effective strategies to prevent and alleviate the suffering caused by mental health disorders, and technology is one of them.\nMANI attempts to fight stigma, improve mental health literacy, and drive policies that benefit mental health service users and those at risk."
  },
  {
    "headline": "Increase in fintech app installations, Apple Health new features, Plentywaka partners with GUO",
    "summarized_story": "Today, I’m discussingIncrease in fintech app installationsApple Health features for the elderlyPlentywaka partners with GUOIncrease in fintech app installations in Nigeria, South Africa, and KenyaThe global fintech industry recorded impressive growth in 2020.\nThe report reveals that beyond funding, fintech app installations grew by160% in the last quarter of 2020.\nSimilarly, Kenya saw 100% growth, and South Africa 52% growth, in fintech app installations.\nThe economic effects of COVID-19 led to the rise in fintech app installations.\nSource: PlentyWaka TwitterPlentywaka, a Nigerian bus-hailing tech company, has announced its partnership with interstate bus company, GUO Transport, to expand its reach."
  },
  {
    "headline": "An insight into how Texas-based VC, Sputnik ATX, invests in African startups",
    "summarized_story": "In May 2021, CribMD, a Nigerian healthtech startup, closed a $2.6 million seed round led by US-based venture capital firm, Sputnik ATX.\nTell us how Sputnik ATX came aboutMy business partner, Oksana Malysheva, and I founded ATX in 2017 after we had managed a fund together.\nWe founded Sputnik ATX so that we could do that.\nWhat does VC investment mean to Sputnik ATX?\nTell us what market(s) Sputnik ATX is interested in and why?"
  },
  {
    "headline": "June 12: Police arrest, shoot gas canisters to disperse protesters",
    "summarized_story": "Personnel of the Nigerian police deployed at Ojota, Lagos State, ahead of the anticipated June 12 protest is determined to stop protesters from exercising their civic rights aimed at ending bad governance.\nThe protest started at Mile 12 and progressed to the Gani Fawehinmi Park in Ojota—the original venue.\nRead Also: Full text: Buhari’s Democracy Day message to the nationThe police, however, began mounting pressure on the group.\nWhen that failed, they shot multiple gas canisters at the protesters and shot multiple rounds in the air.\nAt the time of filing this report, individual protesters are speaking to the press, and gradually rebuilding."
  },
  {
    "headline": "22 years of democracy: Non-state actors dictate the pace in Nigeria",
    "summarized_story": "22 years of democracy: Non-state actors dictate the pace in NigeriaIt was 28 years ago today that the military junta under the then General Ibrahim Badamasi Babangida buccaneered the efforts of the Nigerian people for a safe return to a democratic rule.\nMoshood Kashimawo Olawale (MKO) Abiola contested for the presidency in 1993, but the election results were annulled by the junta because of allegations…"
  },
  {
    "headline": "Young Nigerians are losing their voice in a tainted democracy",
    "summarized_story": "I was carrying out a test of what democracy meant to young Nigerians and there I got my answer.\nAcross the world, the pandemic led governments to take away their citizens’ freedoms and suspend civil liberties.\nThe unprecedented suspension of individual freedoms, at least in countries where liberty prevailed before the pandemic, accounts for the sharp democratic regression recorded in the 2020 Democracy Index.\nNigeria’s democracy suffers under BuhariNigeria’s democracy index score declined to 4.10 in 2020 from 4.12 in 2019.\nThe deafening silence of Nigerians amid the country’s economic realities should be an indictment of its democracy, but it doesn’t seem to be, at least not yet."
  },
  {
    "headline": "Obaseki salutes Nigerians on Democracy Day, urges eternal vigilance to consolidate ideals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, felicitates with Nigerians, as the country marks this year’s Democracy Day.\nThe people and the government hold the key to the solution of our problems and we must work together to make our country truly great.\nWe have a ready example in Edo State, which today is a beacon of hope for democracy.\nIt takes eternal vigilance to keep our country one and prosperous.\nHappy Democracy DayLong live the Federal Republic of NigeriaGodwin N. ObasekiGovernor, Edo State."
  },
  {
    "headline": "Obaseki congratulates Osikhekha, Ibrahim, others on Guild of Editors roles – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with the reelected President of the Nigerian Guild of Editors (NGE), Mr. Mustapha Isah Osikhekha, on retaining the highly exalted position in the Guild at the recent NGE convention in Kano.\nThe governor also congratulated two other Edo-born editors, Mr. Iyobosa Uwugiaren, who was returned as General Secretary of the Guild and Mr. Umoru Ibrahim, a member of the Guild’s Standing Committee representing the North.\n“As a worthy son of Edo State, we celebrate his new feat and encourage him to keep the spirit of excellence alive.\nAt a time that Edo youths are seeking for mentors and sources of inspiration, the feat singles Osikhekha out as someone worth emulating.\nUmoru Ibrahim, also from Edo State, is a member of the Guild’s Standing Committee representing the North."
  },
  {
    "headline": "Edo govt moves to protect forest reserves, seeks stakeholders support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has called for the support and collaboration of all stakeholders to restore and preserve forest reserves in the state.\nJimoh Ijegbai, said the forest is important to the economy of Edo State.\nIjegbai said: “It’s no longer news that our forest is seriously degraded and it affects everyone in Edo State.\nWe plan to plant one million seedlings a year and hope to achieve 10 million seedlings in 10 years.\nWe will collaborate with other investors and private bodies to plant one million seedlings a year,” Lei stated."
  },
  {
    "headline": "Obaseki, firm sign agreement on realization of Edo Inland Dry Port, as project attains 70% completion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has signed a Joint Venture Agreement (JVA) with promoters of the Edo Inland Dry Port, Atlantique Marine Engineering Services, formalising the framework as equity owners for the investment, on behalf of Edo people.\nVery soon, the contract will be awarded.”Earlier in his remarks, the Chief Executive Officer (CEO) of AMES-Edo, Dr. Charles Akhigbe, said the Edo Inland Dry Port, which is 70 percent complete, is the first dry port in the South-South region.\nHe added that the primary purpose of the Edo Inland Dry Port was to bring the port activities closer to industries, manufacturers, individual importers and exporters.\n“This is because you can directly consign your cargo to and from the Edo Dry Port from wherever port abroad you may wish to ship from or to.\nThe CEO also said that as a future Customs port, the Edo Inland Dry Port would operate according to the custom and excise laws facilitating trade and ensuring revenue collection."
  },
  {
    "headline": "COVID-19: Hard choices made by Nigeria responsible for successful impact – Buhari",
    "summarized_story": "President Muhammadu Buhari has said the hard choices made by his administration to tackle the coronavirus pandemic ravaging the world have yielded successful impacts.\nMr Buhari said; “Our response to the pandemic involved making hard choices in balancing livelihoods and public health concerns.\n“You are all living witnesses to how successful this has been due to a number of proactive measures put in place.\nPresident Buhari had declared a two-week lockdown of Lagos, Abuja and Ogun during his first address on the pandemic on March 29 to enable the country to tackle the coronavirus pandemic.\nThe Buhari administration declared June 12 Democracy Day, although the country also celebrates May 29 as the day of transfer of power between administrations."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "June 12: Heavy security as activists stage protest in Osogbo",
    "summarized_story": "The activists who had earlier converged at the popular Oke-Fia roundabout, condemned the spate of killings, kidnapping and all forms of insecurities in the country.\nThe group said the current government structure is responsible for the myriad of problems choking the country’s development.\nOlowu said security situation in the country is worrisome, while calling for adequate funding of security outfits.\nThe current government structure is responsible for the myriad of problems which is choking the country’s development.\n“Also, it is a known fact that Nigeria’s security structure has collapsed, which has thrown up a call for total overhauling of our security system."
  },
  {
    "headline": "Buhari’s Democracy Day message to the nation: Full Text",
    "summarized_story": "President Muhammadu Buhari’s democracy day speech today, June 12, 2021Fellow Nigerians, I join you all today to commemorate and celebrate our Democracy Day.\nI have also recently approved the National Poverty Reduction with Growth Strategy Plan that augments existing plans to further reduce poverty in Nigeria.\nOur over-all economic target of lifting 100 million Nigerians out of poverty in 10 years is our goal notwithstanding COVID-19.\nDuring the pandemic, we disbursed N5,000 to 1 million Nigerians using a Rapid Response Register and advanced N20,000 to 750,000 beneficiaries of the Conditional Cash Transfer Progamme and provided 1.37 million Nigerians with palliatives from CACOVID.\nThe day I joined the Nigerian Army I was prepared to lay down my life for Nigeria."
  },
  {
    "headline": "Ban: Twitter expresses readiness to open discussions with Nigerian govt",
    "summarized_story": "OBINNA EZUGWUSocial media platform, Twitter, has said it informed the Nigerian government that it’s ready for an open discussion to address mutual concerns and see the microblogging service restored.\nThe comments of the American company comes two days after information minister Lai Mohammed said Twitter had reached out to discuss the possibilities of lifting the ban, without giving further details..“Today marks it one week sine Twitter was blocked in Nigeria, We have informed the Nigerian government that we are ready to meet for an open discussion to address mutual concerns and see the service restored,” Twitter Public Policy said in a statement.\nIt added further that, “we remain advocates for the free and #OpenInternet everywhere"
  },
  {
    "headline": "We’re committed to one Nigeria where there is justice, equity, equality – Igbo leaders",
    "summarized_story": "OBINNA EZUGWUThe leaders of the South East geopolitical zone have reaffirmed their commitment to the sustenance of a united Nigeria where there is justice, equity and equality of all Nigerians.\nThe leaders stated this today after their meeting with representatives of the Federal Government held at the Government House, Enugu.\nSpeaking through the Chairman of the South East Governors’ Forum, Governor Dave Umahi of Ebonyi State, the South East leaders stated clearly that the people of the South East are not disposed to secession from Nigeria because no other tribe has demonstrated belief and commitment to the unity of the country more than our people.\nThe leaders also condemned the unjustified attacks on security formations in the region and assured that another meeting of the leaders will hold later this month after which the leadership of Ndigbo will meet with the President.\nAll the Governors of the South East were present, except for Anambra State which was represented by the Deputy Governor."
  },
  {
    "headline": "Uzodinma, Umahi Visit South-East APC Secretariat",
    "summarized_story": "The governors of Imo and Ebonyi States have paid a working visit to the South-East APC secretariat in Enugu on Saturday.\nThe duo, who are of the All Progressives Congress (APC) had earlier attended a meeting with their other South-East counterparts before deciding to visit the zonal secretariat to assess its readiness for commissioning.\nAwed by its state of readiness as well as state-of-the-art facilities, both governors commended the leadership of Senator Ken Nnamani for his vision and dedication to ensuring that the APC is established in the South-East region as a party of reckoning.\nFor Governor Uzodinma, who described the visit as a working one, the facility was indeed befitting of a ruling party and a pointer of the South-East readiness to participate actively in the nation’s politics.\nRecall that the South-East APC zonal secretariat had been scheduled for commissioning last week but was suspended owing to the gruesome murder of Barr."
  },
  {
    "headline": "Uzodinma, Umahi Visit South-East APC Secretariat",
    "summarized_story": "The governors of Imo and Ebonyi States have paid a working visit to the South-East APC secretariat in Enugu on Saturday.\nThe duo, who are of the All Progressives Congress (APC) had earlier attended a meeting with their other South-East counterparts before deciding to visit the zonal secretariat to assess its readiness for commissioning.\nAwed by its state of readiness as well as state-of-the-art facilities, both governors commended the leadership of Senator Ken Nnamani for his vision and dedication to ensuring that the APC is established in the South-East region as a party of reckoning.\nFor Governor Uzodinma, who described the visit as a working one, the facility was indeed befitting of a ruling party and a pointer of the South-East readiness to participate actively in the nation’s politics.\nRecall that the South-East APC zonal secretariat had been scheduled for commissioning last week but was suspended owing to the gruesome murder of Barr."
  },
  {
    "headline": "Lawan Leads Senate Delegation To Visit Injured Soldiers In Kaduna Hospital",
    "summarized_story": "President of the Senate, Senator Ahmad Lawan, has departed Abuja Saturday morning at the head of a Senate delegation to a military hospital in Kaduna.\nThe delegation is scheduled to visit 44 Nigerian Army Reference Hospital to commiserate with soldiers brought their for treatment from various theater of operations in the country.\nOther members of the delegation are the Senate Leader, Yahaya Abdullahi; Chief Whip, Orji Uzor Kalu; Deputy Senate Leader, Ajayi Borofice; Senate Deputy Chief Whip Sabi Abdullahi; Senate Deputy Minority Whip, Sahabi Ya’u, and the chairman, Senate Services Committee, Senator Sani Musa.\nAccording to the media adviser to the Senate President, Ola Awoniyi, in a statement sent to LEADERSHIP, the sympathy visit is part of the activities to mark the second anniversary of the 9th Senate.\nSimilar Senate delegation was at the Internally Displaced Persons (IDPs) camp at Wassa, at the outskirt of Abuja on Thursday where relief items worth N10 million were donated to them."
  },
  {
    "headline": "Lawan Leads Senate Delegation To Visit Injured Soldiers In Kaduna Hospital",
    "summarized_story": "President of the Senate, Senator Ahmad Lawan, has departed Abuja Saturday morning at the head of a Senate delegation to a military hospital in Kaduna.\nThe delegation is scheduled to visit 44 Nigerian Army Reference Hospital to commiserate with soldiers brought their for treatment from various theater of operations in the country.\nOther members of the delegation are the Senate Leader, Yahaya Abdullahi; Chief Whip, Orji Uzor Kalu; Deputy Senate Leader, Ajayi Borofice; Senate Deputy Chief Whip Sabi Abdullahi; Senate Deputy Minority Whip, Sahabi Ya’u, and the chairman, Senate Services Committee, Senator Sani Musa.\nAccording to the media adviser to the Senate President, Ola Awoniyi, in a statement sent to LEADERSHIP, the sympathy visit is part of the activities to mark the second anniversary of the 9th Senate.\nSimilar Senate delegation was at the Internally Displaced Persons (IDPs) camp at Wassa, at the outskirt of Abuja on Thursday where relief items worth N10 million were donated to them."
  },
  {
    "headline": "Security Agencies Embark On ‘Show Of Force’ In Kwara",
    "summarized_story": "Ahead of the June 12 celebration, operatives of security agencies in Kwara State have embarked on ‘show of force’ in Ilorin, the state capital.\nSecurity agencies that participated in the exercise include the police, department of the state security service (DSS), the military, and the Nigeria Security and Civil Defence Corps (NSCDC).\nOperatives of the security agencies were seen marching round some strategic locations in Ilorin metropolis.\n“It comprises of all the security services – the police, military, DSS, NSCDC and others.\nADVERTISEMENTHe said”: The exercise is to further show Governor AbdulRahman AbdulRazaq’s commitment to the security of lives and property in every part of the state.”"
  },
  {
    "headline": "June 12: Many do not care about Nigeria’s democracy – Tinubu",
    "summarized_story": "The National Leader of the governing All Progressives Congress (APC), Bola Ahmed Tinubu, has said some Nigerians do not care about the country’s path to democracy.\nThe former Lagos State governor said this in a statement he signed on Friday titled, ‘June 12, 2021: Democracy Day Statement’ – amid secessionist agitations from the South-East and South-West.\nThe statement read, “On this memorable day, we mark, with respect, and honour the sacrifices that have allowed democracy to come to pass.\nThese people hate democracy and despise you for choosing democracy over them and their oppressive ways.\nAsk this question 10, 20, 100 years from now, the answer must remain the same: the people of Nigeria stand for democracy and stand against that which would chase democracy from our land."
  },
  {
    "headline": "Ogun State Gov, Abiodun begs residents not to protest as protesters begin mobilization",
    "summarized_story": "As the nation celebrates June 12 as Democracy Day, Governor Dapo Abiodun has urged residents of Ogun State not to join any protest.\nGov Abiodun feared that resorting to protest could breed violence, saying such protests could be hijacked by those he called hoodlums and enemies of democracy, harbouring ulterior motives.\nIn a statement made available by his new media aide, Emmanuel Ojo, the governor charged Ogun people to celebrate June 12 peacefully.\nThis, he said, became necessary to avoid any act that could threaten the security of the State and the nation at large.\nOur correspondent gathered that the protesters from the three senatorial districts of Ogun State have agreed to converge on the NUJ Secretariat, Iwe-Iroyin, Abeokuta by 7am."
  },
  {
    "headline": "How Twitter CEO, Jack Dorsey joined Nigerians to mark June 12 democracy day",
    "summarized_story": "Twitter CEO, Jack Dorsey has tweeted a photo of the Nigerian flag on his official Twitter handle in likely solidarity of Nigeria’s Democracy day.\nThe photo was shared at exactly 12am (Nigerian time) on June 12, which is now being celebrated in Nigeria as “Democracy Day”.\nREAD ALSO: Creative industry will continue to get attention of..\nIt is also coming ahead of planned nationwide protest which has been trending on the social media platform in different countries with the hashtag #June12Protest."
  },
  {
    "headline": "June 12: Read MKO Abiola’s Letter To Gani Fawehinmi Two Days Before He Was Murdered",
    "summarized_story": "Two days before the winner of the annulled June 12, 1993 election, MKO Abiola, was assassinated, he wrote a letter to a renowned constitutional lawyer, Chief Gani Fawehinmi.\nRead the letter below:My Dear Gani,Praise be to God for your life and the courage, fortitude and determination with which He endowed you.\nTRUTH, which is what June 12 is, is SPIRITUAL AL-HAQQU in Islam – one of the sacred names of God.\nAll my life I had worked for the result which God in His mercies, gave us on June 12, 1993.\nThe spiritual consequence of any desertion of a sacred cause like June 12 is HELL, which God forbids."
  },
  {
    "headline": "French Open: Djokovic defeats Nadal in epic semi-final",
    "summarized_story": "Novak Djokovic handed 13-time champion Rafael Nadal only his third defeat in 16 years and 108 matches at the French Open on Friday to reach his sixth Roland Garros final after an epic showdown which even beat the country’s Covid-19 curfew.\nDjokovic, the 2016 champion in Paris who had also beaten Nadal at the 2015 tournament, will face Stefanos Tsitsipas in Sunday’s final in what will be his 29th championship match at the Slams.\nTsitsipas had earlier become the first Greek to reach a Grand Slam final with a 6-3, 6-3, 4-6, 4-6, 6-3 victory over Germany’s Alexander Zverev.\n“It was a privilege to face Rafa in such an incredible match,” said Djokovic after four hours and 11 minutes of intense action.\n“Tonight it was my greatest ever match in Paris.”He now leads Nadal 30-28 in their career rivalry."
  },
  {
    "headline": "French Open: Djokovic defeats Nadal in epic semi-final",
    "summarized_story": "Novak Djokovic handed 13-time champion Rafael Nadal only his third defeat in 16 years and 108 matches at the French Open on Friday to reach his sixth Roland Garros final after an epic showdown which even beat the country’s Covid-19 curfew.\nDjokovic, the 2016 champion in Paris who had also beaten Nadal at the 2015 tournament, will face Stefanos Tsitsipas in Sunday’s final in what will be his 29th championship match at the Slams.\nTsitsipas had earlier become the first Greek to reach a Grand Slam final with a 6-3, 6-3, 4-6, 4-6, 6-3 victory over Germany’s Alexander Zverev.\n“It was a privilege to face Rafa in such an incredible match,” said Djokovic after four hours and 11 minutes of intense action.\n“Tonight it was my greatest ever match in Paris.”He now leads Nadal 30-28 in their career rivalry."
  },
  {
    "headline": "Brass Products Terminal: Sylva Hails Buhari’s Impact in Niger Delta",
    "summarized_story": "By KEN EMORDI…Project Will Generate 6,000 Jobs, Says KyariThe Minister of State for Petroleum Resources, Chief Timipre Sylva has commended President Muhammadu Buhari for his giant strides in the Niger Delta which is making a huge impact on the people of the area.\n“I make bold to say today without any fear of contradiction that no President has impacted the people of the Niger Delta like President Muhammadu Buhari.\n“This Terminal will create 1,000 direct jobs during the construction phase, and over 5,000 indirect jobs during its operation.\nConsidering the potential for employment when completed, this will definitely reduce youth restiveness in the Niger Delta area and will also address the problem of illegal refining in the area,” Kyari stated.\nEarlier, the Coordinator of the Project and Group General Manager, National Petroleum Investment Management Services (NAPIMS), Mr. Bala Wunti stated that the project would enhance the economics of marine petroleum products distribution."
  },
  {
    "headline": "Brass Products Terminal: Sylva Hails Buhari’s Impact in Niger Delta",
    "summarized_story": "By KEN EMORDI…Project Will Generate 6,000 Jobs, Says KyariThe Minister of State for Petroleum Resources, Chief Timipre Sylva has commended President Muhammadu Buhari for his giant strides in the Niger Delta which is making a huge impact on the people of the area.\n“I make bold to say today without any fear of contradiction that no President has impacted the people of the Niger Delta like President Muhammadu Buhari.\n“This Terminal will create 1,000 direct jobs during the construction phase, and over 5,000 indirect jobs during its operation.\nConsidering the potential for employment when completed, this will definitely reduce youth restiveness in the Niger Delta area and will also address the problem of illegal refining in the area,” Kyari stated.\nEarlier, the Coordinator of the Project and Group General Manager, National Petroleum Investment Management Services (NAPIMS), Mr. Bala Wunti stated that the project would enhance the economics of marine petroleum products distribution."
  },
  {
    "headline": "Osun Police arrest man with unknown lady’s body parts",
    "summarized_story": "By Taiwo OkanlawonThe Osun Police Command has arrested one Kabiru Oyedun, a suspected ritualist, for being in possession of body parts of a yet-to-be-identified lady, killed for money rituals.\nThe suspect who claimed to be a bricklayer and night guard, was arrested with the body parts kept in his house following credible information from the public.\nHe said his friend, a herbalist in Ikoyi Town, later took away the girl’s heart after dismembering the body.\nMr Olawale Olokode, the Osun Police Commissioner, said the suspect was arrested on Thursday, at about 9pm in his house, in Apomu Town, Isokan Local Government Area of the state.\nOlokode said the Divisional Police Officer at Apomu led police officers to recover the body parts of the victim, adding that the police are on the trail of the victim’s boyfriend (Akin)."
  },
  {
    "headline": "My agenda for Anambra – Okwuosa",
    "summarized_story": "By Muhaimin OlowoporokuAspiring governor of Anambra State, Azuka Okwuosa has said that he will focus on employment and create not less than one million jobs if elected governor by November.\nHe noted that he would maximize resources made available to him as Governor to create over one million jobs in Anambra.\nOkwuosa assured his administration would strive to provide a stable and affordable power supply to reduce the overhead costs for businesses.\nAccording to him: “Anambra is in need of a Governor that is well experienced in harvesting and harnessing human resources.\n“The next government must have concrete plans to create relevant avenues for the youth of Anambra state”, he said."
  },
  {
    "headline": "Police teargas June 12 protesters in Abuja, Ibadan [Video]",
    "summarized_story": "In Abuja, police fired teargas at peaceful protesters, who had gathered at Gudu market area.\nIn Ibadan, police challenged the protesters, fired teargas at them and destroyed placards.\nThe protesters, undeterred burst into songs: “Another challenge, double double challenge”.\nThe protesters in Abuja gathered around 8:30 am to express their displeasure over the state of the nation were dispersed with tear-gas.\nIn Lagos, although there was police presence at Lekki Toll Gate, scene of the EndSARS rebellion in October, peaceful protesters gathered in Ojota."
  },
  {
    "headline": "Comedian Mr Macaroni Joins June 12 Protest In Lagos",
    "summarized_story": "Mr Macaroni, a popular comedian, has joined demonstrators at Gani Fawehinmi Park in the Ojota region, the site of the June 12 protest in Lagos State, according to NEWS DIRECT.\nThe police had already dispersed the protesters by firing tear gas canisters and firing firearms into the air.\nThey gathered with placards in front of a motor park approved by the Lagos State Ministry of Transportation, screaming “Buhari must go” and demanding good governance and an end to the country’s insecurity.\nAddressing journalists, Mr Macaroni wondered why the President, Major General Muhammadu Buhari (retd.\nIn February 2021, Mr Macaroni was arrested for protesting at the Lekki toll gate where he demanded that justice be served to the victims of the October 20 2020 #EndSARS protest at the toll plaza."
  },
  {
    "headline": "BREAKING: NANS Makes U-turn, Joins June 12 Protest In Osogbo",
    "summarized_story": "The National Association of Nigeria Students (NANS) has reversed its decision to order members to boycott the statewide demonstration on June 12.\nOn Saturday, the association’s Osun State chapter joined a statewide demonstration in Osogbo, the state capital.\nSunday Asefon, the president of the NANS, announced on Friday that the scheduled statewide protest on June 12 had been postponed.\nHowever, a civil society coalition in Osun has organized a big march against Nigerian insecurity and unemployment.\nComrade Oyelayo Afeez, the Chairman of NANS JCI in Osun State, led the organization’s members en masse to Oke-Fia."
  },
  {
    "headline": "#IStandWithBuhari Protesters Fight Over Money In Abuja",
    "summarized_story": "A battle broke out at the Unity Fountain in Abuja on Saturday morning between members of the #IStandWithBuhari protest group.\nThe leaders of the various groups were observed having a heated discussion about the distribution of monetary resources intended for organizing counter-protests.\nHuman rights campaigners and civil society organizations had called for a statewide protest on June 12 against President Muhammadu Buhari’s administration.\nFree Kogi2 (two anti-President Muhammadu Buhari demonstrators, Larry Emmanuel and Victor Anene Udoka, who are being held in Kogi State), Buhari Must Go, and others are among the others.\nRestore electricity tariffs, end the ASUP (Academic Staff Union of Polytechnics) strike, restore fuel prices, reinstate party deregistration, and release Nicholas Mbah."
  },
  {
    "headline": "BREAKING: June 12 Protest Kicks Off In Osogbo, Akure",
    "summarized_story": "On Saturday, youths protesting bad governance and insecurity stormed Osogbo, the capital of Osun State, and Akure, the capital of Ondo State.\nYouths from Osun State’s Coalition of Civil Society congregated on the renowned Oke-Fai roundabout, according to reports.\n“We cannot allow our state’s economic activity to be ruined in the name of few secessionist agitators.\nWe are here today to demand a better country that works for everyone; we want a safe environment,” Waheed Saka, one of the Osun protestors, stated.\n“We need a good and working Nigeria,” “stop the killings,” and “End terrible governance” are among the slogans on banners hoisted by protestors in Akure."
  },
  {
    "headline": "Breaking: Money tears #IStandWithBuhari supporters apart as Police disperse anti-government protesters",
    "summarized_story": "There is disunity among members of a group known as #IStandWithBuhari as they engaged themselves in a fight at the Unity Fountain, Abuja on Saturday.\nBlueprint learnt that the leaders of the group were seen in a heated exchange of words over the sharing of monetary resources meant for organising counter protests.\nEarlier, Police had thwarted a June 12 protest in the Gudu area of the Federal Capital Territory when they stormed the area and started firing teargas canisters.\nThe protest began around 08:30 am and was going on smoothly with the protesters, mostly youths, expressing their dissatisfaction with the state of the nation.\nThe protesters, who chanted “Buhari must go”, “Say no to injustice”, amongst other solidarity phrases, took to their heels and scampered for safety when the security operatives started shooting."
  },
  {
    "headline": "Pictures: Deji Adeyanju leads #june12protest in Abuja",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Youths begin #june12protest in Akure, demand end to open grazing",
    "summarized_story": ""
  },
  {
    "headline": "President Buhari Appoints Ilelah as NBC Director-General -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Army redeploys 11 Generals, 3 colonels in latest shake up -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Army , last night redeployed eleven Generals, 3 Colonels in the latest shakeup.\nThe outgone Director Army Public Relations, Brigadier General Mohammed Yerima announced the redeployment in a statement in Abuja.\nAccording the statement, “Nigerian Army (NA) has released posting and appointments of senior officers.\nThis is in line with the Chief of Army Staff vision to have a professional Nigerian Army ready to accomplish assigned missions within a Joint Environment in Defence of Nigeria.\nThe Chief of Army Staff, Major General Faruk Yahaya urged all the affected senior officers to justify the confidence reposed on them."
  },
  {
    "headline": "Buhari flags-off Commercial operation of Lagos-lbadan Train service -NigPilot",
    "summarized_story": "President Muhammadu Buhari has officially flagged off commercial operations of the Lagos-Ibadan standard gauge railway project yesterday.\n” This is already yielding the desired result as construction activities on the railway segment, Kaduna – Kano has commenced with back-end engineering activities.\nRotimi Amaechi earlier in his remarks expressed gratitude to President Muhammadu Buhari for summoning the courage to take the loan from China Exim bank to execute the rail project.\nThanking President Buhari for his support in ensuring the project is a success, he stressed that the occasion is the third time of the President commissioning railway project completed during his tenure.\nHe equally thanked the Minister for being the chief pilot of the project in which the project wouldnt have been successful without his tenacity."
  },
  {
    "headline": "UNODC trains Migration, NAPTIP on data collection on human trafficking -NigPilot",
    "summarized_story": "United Nations Office on Drugs and Crime, UNODC, with funding from the Government of Canada, organized a four-day long training of trainers on data collection and analysis on trafficking in persons and smuggling of migrants, TIP and SOM for officers of Nigeria Immigration Service, NIS, National Agency for the Prohibition of Trafficking in Persons, NAPTIP.\nUNODC said the training would equip officers from the Nigeria Immigration Service, NIS, and the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, with the necessary tools when working with data, but also to train data providers at federal and state levels to improve the overall national reporting on TIP and SOM in Nigeria.\nAccording to the agency, it further engaged in the upcoming months with trained NAPTIP and NIS officers to conduct step-down trainings for NAPTIP and NIS zonal commands, recently established State Task Forces and other data providers.\n“Strengthening evidence-based response to trafficking in persons and smuggling of migrants in Nigeria, project funded by Canada, UNODC is currently conducting a threat assessment of trafficking in persons and related organized crime in Nigeria that will support NAPTIP and NIS in developing evidence-based policies and law enforcement strategies,” said UNODC.\nAlso, NIS Deputy Comptroller General, Ms. Anthonia Ifeoma Opara, said in her opening remarks that “this training of trainers is a commendable attempt by UNODC to strengthen the capacity of relevant agencies to generate and process data on trafficking in persons and smuggling of migrants.”Speaking also, NAPTIP’s Director of Research and Programme Development, Mr. OlusayoOlubiyi, added that “UNODC’s training will go a long way in enriching the knowledge and skills necessary to ensure our data is accurate and precise.”"
  },
  {
    "headline": "Democracy Day: Police Shoot Teargas At Protesters In Abuja, Lagos",
    "summarized_story": "﻿The police on Saturday shot teargas to disperse protesters in the Gudu area of Abuja and Ojota area of Lagos as the country marked Democracy Day on June 12.\nThe Unity Fountain in Abuja, which is a popular venue for protests in the nation’s capital, had been shy of protesters as of 8:15am.\n‘Resign from office’According to our correspondent, the protesters in Gudu had turned out in their numbers carrying placards and banners with various inscriptions.\nProtest holds in Oyo, OndoThe Democracy Day protests held at Mokola, Ibadan amid heavy police presence.\nChannels Television reporters also observed protests in Osun state."
  },
  {
    "headline": "We Have Lifted 10.5m Nigerians Out Of Poverty In Two Years – Buhari",
    "summarized_story": "President Muhammadu Buhari on Saturday said his administration has lifted 10.5 million people out of poverty in the past two years.\nIn 2019, the President had promised to work towards lifting 100 million Nigerians out of poverty in 10 years.\n“Our over-all economic target of lifting 100 million Nigerians out of poverty in 10 years is our goal notwithstanding COVID-19.\n“Our conditional cash transfer program has benefited over 1.6 million poor and vulnerable households comprising more than 8 million individuals.\n“I have also recently approved the National Poverty Reduction with Growth Strategy Plan that augments existing plans to further reduce poverty in Nigeria."
  },
  {
    "headline": "Tension Surrounding June 12 Forced Us To Cancel Protest – Nigerian Students",
    "summarized_story": "The National Association of Nigerian Students on Friday said it has suspended its planned June 12 protest, citing concerns of the safety of the protesters and the fear of a possible hijack by politicians.\nThe President of the association, Mr Sunday Asefon, said while every Nigerian has the right to protest, security agencies have shared credible intelligence report, that the protest would be hijacked.\n“While everyone agreed that the content of the planned protest is genuine, and we reserve the right to protest, the tension surrounding the date has come under a special security.\n“Our planned protest was never part of the Buhari-Must-Go campaign or secession campaign.\nOur planned protest was borne out of our genuine concern for the safety of our students around our campuses."
  },
  {
    "headline": "VIDEO: Eight Students, Two Lecturers Kidnapped As Gunmen Attack Nuhu Bamali Polytechnic",
    "summarized_story": "Eight students and two lecturers have been kidnapped after gunmen invaded Nuhu Bamali Polytechnic in the Zaria Local Government Area of Kaduna State.\nThe bandits attacked the school located along the Kaduna- Zaria road last night, shooting at students and leaving several others injured.\nThe Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan confirmed this incident to Channels Television early on Friday.\nREAD ALSO: Army Releases New Postings, Appointments Of Senior OfficersAruwan disclosed that one student who was shot died on the spot.\nThe latest incident comes barely three months after bandits attacked the Federal College of Forestry Mechanization Afaka in Igabi local government area of Kaduna state and Greenfield University in Chikun local government areas, where they kidnapped over fifty students and killed five others."
  },
  {
    "headline": "Saudi To Allow 60,000 Vaccinated Residents To Perform Hajj",
    "summarized_story": "Saudi Arabia announced Saturday it will allow 60,000 vaccinated residents of the kingdom to perform the annual hajj, state media reported.\nThe hajj ministry said this year’s pilgrimage would be “open for nationals and residents of the kingdom, limited to 60,000 pilgrims”, according to the official Saudi Press Agency.\nIt will be the second year in a row that the kingdom hosts a downscaled hajj amid the coronavirus pandemic.\nThe limit on umrah pilgrims is 20,000 a day, with a total of 60,000 worshippers allowed to perform daily prayers at the mosque.\n“Considering the large crowds that perform hajj, spending long periods of time in multiple and specific places… required the highest levels of health precautions,” it added in the statement carried by SPA."
  },
  {
    "headline": "Streets of Enugu calm, businesses go on as usual",
    "summarized_story": "The atmosphere in Enugu the south East capital is calm and serene as the streets are as clear as air and people are going about their lawful businesses unhindered.\nMajor streets of Independence layout, Ogui, New Layout, New Heaven even Abakpa in the capital city are calm without any sign of the NANS planned protest in sightA visit to the Micheal Okpara Square, depicts the regular Saturday morning exercise as Residents are seen conducting themselves peacefully .\nThe state chapter of the NANS executive had earlier extended a press conference invitation to TVC News by noon today to make their position known on the planned nationwide protest.\nAdvertisementTVC News can confidently affirmed that there are presence of security operatives moving around streets to ensure that peace is maintained."
  },
  {
    "headline": "Youth Protest in Akure, Ondo State, demand good governance",
    "summarized_story": "Scores of youths in Akure, Ondo state capital staged a peaceful protest to mark the June 12 Democracy day.\nThey marched through major streets, chanting different songsArmed with placards with various scriptions, the protesting youths demanded for good governance, end to insecurity among others.\nThey emphasized that the security situation of the country is now at alarming rate, hence the need for government to be alive to its responsibilities."
  },
  {
    "headline": "No protests in Ilorin as people go about their businesses",
    "summarized_story": "It is business as usual on the street of Ilorin, the Kwara state capital as there are no signs of protesters.\nVehicular and human movements go on unhindered while security operatives are stationed at strategic locations.\nMost of the shops along the popular Challenge-Post Office road, Ilorin are open for business while a handful of them are under lock and key.\nThe police in Kwara state had in a statement issued by the Police Public Relations Officer, SP Ajayi Okasanmi enjoined the people of the state to go about their lawful businesses without any fear of molestation."
  },
  {
    "headline": "Democracy Day: 10.5m Brought Out of Poverty, Buhari Says",
    "summarized_story": "Nigeria’s President Muhammadu Buhari says his administration’s has ensured 10.5 million citizens have been brought out of poverty since 2019.\nThe Nigerian leader stated this during a live broadcast to commemorate the June 12 Democracy Day.\nMr Buhari noted that the government is still determined to ensure that the overall economic target of lifting 100 million Nigerians out of poverty in 10 years is accomplished notwithstanding COVID-19.\n“Our overall economic target of lifting 100 million Nigerians out of poverty in 10 years is our goal notwithstanding COVID-19.\n“I am very convinced that this 100 million target can be met and this informed the development of a National Poverty Reduction with Growth Strategy."
  },
  {
    "headline": "UFC’S Kamaru Usman to Build Academy in Nigeria",
    "summarized_story": "Nigeria born Ultimate Fighting Championship (UFC) Welterweight Champion, Kamaru Usman has disclosed his plan to set up a sporting academy in the country.\nUsman, nicknamed Nigeria’s Nightmare, made this known during his visit to the Nigerians in Diaspora Commission (NiDCOM) in Abuja on Friday.\nThe professional mixed martial artist, who have been away from Nigeria for over a decade, said he was happy to be home, despite discouragement from individuals.\nThe Auchi-born international sports celebrity, made known his intention of setting up an academy to train Nigerian youths on his expertise: kick-boxing, boxing and mixed martial arts.\nShe called on other Nigerian Diaspora to follow Usman’s noble example, in contributing to the country’s development, in their various capacities."
  },
  {
    "headline": "South Africa Expels Lesotho Ambassadors Over Illegal Alcohol",
    "summarized_story": "South Africa has given several diplomats from Lesotho 72 hours to leave the country over the illegal sale of duty-free alcohol.\nA notice from the South African authorities listed the diplomats and their dependants and stated that they had “abused their diplomatic privileges”.\nLesotho has distanced itself from the actions of the diplomats and said that it was working on their return.\nThe South African government has declared all those involved as “persona non grata”.\nThe illegal sale of alcohol in South Africa grew in 2020 during the coronavirus lockdowns that saw stores and bars close to prevent the spread of the virus."
  },
  {
    "headline": "Court Clears Lungu to Run For Zambian President Again",
    "summarized_story": "Zambia’s constitutional court has cleared President Edgar Lungu to run for another term in office in August’s elections.\nThe opposition was trying for a second time to get him barred over the constitutional two-term limit.\nMr Lungu was first elected president in 2015 in the wake of the death in office of his predecessor Michael Sata.\nBut, in line with Zambia’s constitution, he only served the remainder of Sata’s term before running and winning the 2016 election.\nIn other words, 2016 to 2021 is his first full term."
  },
  {
    "headline": "Italy Open 2020 Euro With Emphatic Win over Turkey",
    "summarized_story": "Italy rode three second-half goals to a 3-0 win over Turkey in Group A of the opening match of the 2020 European Championship in Rome on Friday.\nRoberto Mancini’s Italy came into the match on a 27-match unbeaten run and their fine form showed early on as the Azzurri dominated possession and went close with a pair of headers from corner kicks just past the 20-minute mark.\nThe pressure on the Turkish defence finally told when Merih Demiral inadvertently chested the ball into his own net from a Domenico Berardi cross and Italy took the lead shortly after the restart.\nLorenzo Insigne put the game away for Italy in the 79th minute, curling home a beautiful first-time shot after Turkey’s Cakir hooked a goal kick right to the opposing side and Italy pounced for their third.\nTurkey will face Wales next in Group A action, while Italy play Switzerland, with both games played on Wednesday, June 16."
  }
]