[
  {
    "headline": "JUST IN: NCDC confirms 66 suspected monkeypox cases, one death",
    "summarized_story": "The monkeypox situation report released on Sunday night by the Nigeria Centre for Disease Control revealed that no fewer than 66 suspected cases of monkeypox disease have been reported in Nigeria.\nThe PUNCH reports that monkeypox is a rare disease caused by infection with the Monkeypox virus which belongs to the Orthopoxvirus genus in the family Poxviridae.\n“A total of 66 suspected cases have been reported between January 1st to May 29th, 2022.\n“The six (6) new confirmed positive cases (out of the 20 suspected cases) in May 2022 were confirmed from four (4) states – Bayelsa (2), Adamawa (2), Lagos (1), and Rivers (1),” the agency stated.\nThe PUNCH reports that from September 2017 to May 29th, 2022, a total of 578 suspected cases have been reported from 32 states in the country."
  },
  {
    "headline": "Motorcyclists attack: FCT police restore order, urge residents to remain calm",
    "summarized_story": "The Federal Capital Territory Police Command has assured Abuja residents of their safety after restoring order at Same Global Estate, in the Lokogoma area of Abuja that was earlier attacked by ravaging commercial motorcyclists.\nThe PUNCH had reported that earlier today the Okada riders set some buildings on fire over their colleagues’ death.\nIn a statement signed by the FCT Command’s Public Relations Officers, Josephine Adeh, the police said the Commissioner of Police, Babaji Sunday, assured residents of the Command’s dedication to the safety of lives and property within the FCT.\nThe statement partly read, “The FCT Commissioner of Police, Babaji Sunday, was on the ground with a heavy deployment of operatives for an on-the-spot assessment concerning the incident that took place at Same Global Estate.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "2023: I’ll contest Oyo gov election, Adelabu assures supporters",
    "summarized_story": "A former Deputy Governor of the Central Bank of Nigeria, Chief Adebayo Adelabu, has assured his supporters and people of Oyo State that he will contest the governorship election in the state in 2023.\nSen. Teslim Folarin had emerged as the party’s flag bearer at the governorship primary, held at Obafemi Awolowo Stadium in Ibadan on Friday.\nAdelabu described the primary as a charade, alleging that the delegates’ list for the governorship primary was compromised.\n“I hereby use this opportunity to plead with my supporters throughout the nooks and crannies of Oyo State to remain calm and be law-abiding.\n“The provision of more abundant life for the great people of Oyo State is non-negotiable,” he said."
  },
  {
    "headline": "Sri Lanka police tear-gas students in fresh protests",
    "summarized_story": "Police fired tear gas to disperse thousands of students trying to storm the Sri Lankan president’s home Sunday as the government offered an appointment to demonstrators demanding his resignation.\nPrime Minister Ranil Wickremesinghe went on national television on Sunday evening offering young protesters a greater say in how the country is administered.\nWickremesinghe is the sole parliamentary representative of the United National Party, a once-powerful political force that was nearly wiped out in Sri Lanka’s last elections.\nRajapaksa’s party, which has a majority in the legislature, has offered to provide him with the necessary support to run a government.\nIts currency had depreciated by 44.2 percent against the US dollar this year, while inflation hit a record 33.8 percent last month."
  },
  {
    "headline": "Monkeypox: NCDC confirms 1 death, 21 cases in Nigeria",
    "summarized_story": "*Activates emergency operations centreBy Joseph ErunkeTHE Nigeria Centre for Disease Control,NCDC,has reported 21 confirmed cases of Monkeypox with one death from nine states and the Federal Capital Territory,FCT.\nThe national Monkeypox response guidelines can be accessed via – https://ncdc.gov.ng/themes/common/docs/protocols/96_1577798337.pdf.\n“Furthermore, a national One-health risk surveillance and information sharing (NOHRSIS) group has been inaugurated to facilitate timely information exchange on all prioritised zoonotic diseases.\nThe EOC will continue to monitor the evolving situation to inform public health action accordingly.\nThe Monkeypox public health advisory can be accessed via – https://ncdc.gov.ng/news/367/public-health-advisory-on-monkeypox."
  },
  {
    "headline": "ATIKU 2023: Race to rescue Nigeria has began — Oborevwori",
    "summarized_story": "By Festus Ahon, AsabaDELTA State Peoples Democratic Party, PDP Governorship flagbearer and Speaker of the State House of Assembly, Rt Hon Sheriff Francis Orohwedor Oborevwori, Sunday, said the race to rescue Nigeria has began with the nomination of former Vice President Atiku Abubakar as the Presidential flagbearer of the Party.\nContinuing, Oborevwori in the statement, said: “On behalf of my family, I heartily congratulate His Excellency, Atiku Abubakar, Wazirin Adamawa, on his emergence as the presidential flagbearer of the PDP for the 2023 elections.\nWith Atiku’s nomination, the race to rescue Nigeria has begun in earnest.\nWith the party primaries now over, it is my hope and expectation that they will join hands with Atiku to return PDP to the centre”.\nThe PDP has demonstrated once again that it is the most organized party in Nigeria."
  },
  {
    "headline": "DELTA APC PRIMARIES: Peaceful conduct, sign of good omen — Omo-Agege",
    "summarized_story": "While felicitating with those that won the party’s primaries at the House of Assembly, House of Representatives and Senatorial levels, he commended the leadership of the party for ensuring successful primaries.\nHe also thanked the party leadership for effectively mobilizing members of the APC to participate fully in the electoral process.\nOmo-Agege in the statement noted thatSenator Peter Nwaoboshi, Chief Ede Dafinone and Chief Thomas Joel-Onowakpo were returned unopposed in Delta North, Delta Central and Delta South senatorial districts respectively.\nThe Deputy Senate President, said: “The outcome of the primaries will best be described as no victor no vanquished.\nAll the aspirants gave a good account of themselves and congratulated each other for a good contest”."
  },
  {
    "headline": "DELTA PDP HoR PRIMARIES: Akpodiete concedes defeat, says election free, fair",
    "summarized_story": "…Rejoices with Taleb Tebite…urge other aspirants to accept defeatBy Festus Ahon, AsabaA House of Representatives aspirant, Dr Olotu Akpodiete, Sunday, described the Peoples Democratic Party, PDP House of Representatives primaries for the Ughelli North/Ughelli South/Udu Federal Constituency conducted last week Sunday as free, fair and credible.\nWhile congratulating winner of the primaries, Olorogun Taleb Tebite, Akpodiete in a statement, urged all other aspirants who contested with him to concede defeat and work for the victory of the party in the general election.\nAkpodiete said; “I congratulated Olorogun Taleb Tebite who won in the PDP primary election in Ughelli North/Ughelli South/Udu Federal Constituency”.\nHe implored Olorogun Taleb Tebite to reconcile with other PDP aspirants who lost out for same position, so as to work as a team to recover the lost mandate back to the party during the next election come 2023.\nHe prayed God to meet all his supporters at the point of their needs."
  },
  {
    "headline": "AGF’s probe over N84b loot: EFCC arrests ex-Zamfara Gov, Yari, firm CEO",
    "summarized_story": "Soni Daniel, AbujaThe former governor of Zamfara State, Abdullaziz Yari, has been arrested by the Economic and Financial Crimes Commission over his complicity in the N84 billion loot for which the Accountant-General of the Federation, Ahmed Idris, is being detained.\nThe former governor, according to a top EFCC source, was arrested at about 5pm on Sunday along with the managing director of a firm known as Finex Professional.\nThe former governor is mentioned as having benefitted to the tune of N22 billion out of the N84 billion which the suspended AGF is being accused of diverting.\nThe former governor is reported to have received the huge cash through Finex Professional but the details of the transaction remained under wraps as at the time of filing the report.\nThe huge cash is said to have been paid to one Akindele, whose full identity is yet to be unveiled."
  },
  {
    "headline": "NiMet predicts extreme heat in 10 northern states for 3 days",
    "summarized_story": "The Nigerian Meteorological Agency (NiMet), on Sunday, predicted that there would be extreme heat for the next three days in some parts of the country.\nThe agency in its high-temperature outlook signed by the Director-General, Prof. Mansur Matazu, said most parts of the Northern cities are expected to record temperatures between 35°C to 40°C.\nAlthough, it said parts of Kano, Jigawa, Bauchi, Gombe, YobeKebbi, Sokoto, Zamfara, Katsina, , and Borno are expected to experience temperatures greater than 40°C, it stated that parts of Kebbi, Sokoto, Katsina, Kano, Dutse, Nguru, and Maiduguri indicate chances of experiencing high thermal discomfort starting from Sunday.\nIt further said parts of Kebbi, Sokoto, Zamfara, Katsina, Kano, Jigawa, Bauchi, Gombe, Yobe, and Borno are expected to experience temperatures greater than 40°C.on May 31,2022According to it, Niger, Plateau, FCT, Kwara, Kogi, Benue, Nasarawa, Taraba, and Adamawa are expected to record temperatures between 35°C to 40°C."
  },
  {
    "headline": "Ambazonian soldiers kill 20 in Boki, Cross River",
    "summarized_story": "At least, 20 Cameroonians have been killed by Ambazonian soldiers who are fighting for independence in Southwest Cameroon.\nEyewitnesses in Boki village in Nigeria said, the Ambazonian soldiers crossed into the Nigeria community near Bashu in Boki LGA of Cross River State to attack their compatriots who fled and refused to join them to intensify the fight against President Paul Biya government.\nChief Cletus Obun, a one time member of Cross River House of Assembly, and an aspirant of House of Reps for Boki/Ikom federal constituency, confirmed the incident.\n“I can confirm that the Ambazonian soldiers crossed the Nigerian border Sunday morning to attack their compatriots who fled into Nigeria and refused to join their forces to fight.\nHowever, the Public Relations Officer of 13 Brigade of Nigerian Army Calabar, Captain Tope Aluko, said she contacted their Officer Operations and he said they did not receive such report."
  },
  {
    "headline": "Methodist Church Prelate, Samuel Kanu abducted in Abia",
    "summarized_story": "The Prelate of the Methodist Church Nigeria, His Eminence, Samuel Kanu Uche, was on Sunday, reportedly, Kidnapped along Enugu-Port Harcourt Expressway, in Umunneochi Local Government Area of Abia State.\nDAILY POST gathered that the kidnappers took him alongside Rt.\nDennis Mark, the Methodist Bishop of Owerri and the Prelate’s Chaplain.\nIt was revealed that the clergymen were kidnapped in the afternoon while they were on their way from a programme in the council area.\nAccording to him, the police Command solicited credible information from the public toward their rescue."
  },
  {
    "headline": "Bauchi civil unrest: Gov Mohammed preaches peace, tolerance",
    "summarized_story": "Speaking at Lukshi where the crisis started, Governor Mohammed regretted the unfortunate incident and said that his administration would establish a police outpost in the areas to further provide security to the people.\nGovernor Mohammed enjoined people in the affected areas to live in peace and equally be their brothers’ keepers, irrespective of any differences.\nThe governor admonished parents and guardians to ensure proper upbringing of their children and wards.\nAccording to the governor, “we did not do it (curfew) to make you suffer; it is for our collective good.\nHe added that two lives were lost, while several houses were burnt with properties worth millions of Naira destroyed."
  },
  {
    "headline": "Atiku: ‘PDP betrayed Igbos, Nigerians will face the consequences’ – Ohanaeze chieftain",
    "summarized_story": "Ibegbu made the remark while reacting to the emergence of former Vice President Atiku Abubakar as PDP presidential candidate.\nSpeaking exclusively with DAILY POST, Ibegbu said PDP went contrary to the nation’s mood by picking Atiku as its presidential flag bearer.\nHe, however, said the Igbos should not rely on political parties but on individuals if the Southeast must achieve its goal of producing Nigeria’s president.\nHowever, the door is not yet closed; other political parties are there.\nAnd I think we should not be relying on political parties but on individuals if we want to move Nigeria forward."
  },
  {
    "headline": "Jibrin wins Kano North APC’s ticket",
    "summarized_story": "Senator Barau Jibrin has been declared winner of the All Progressives Congress (APC) primary election for Kano North senatorial district.\nIt was gathered Governor Abdullahi Umar Ganduje had stepped down for Jibrin, thus easing his victory.\nThe governor said his decision was part of the reconciliation efforts among the APC stakeholders in Kano.\nSome delegates told reporters that they voted for Jibrin because of his footprints in the 16 local government areas under Kano Northern senatorial district in the last eight years of his tenure.\nIn a statement over the exercise, the senator accused Governor Ganduje of “intimidating the delegates” to vote for Zaura."
  },
  {
    "headline": "Ex-minister Nweke is Enugu APGA governorship candidate",
    "summarized_story": "Former Minister of Information, Chief Frank Nweke, has won the governorship ticket of the All Progressives Grand Alliance (APGA) for Enugu State.\nNweke was elected yesterday in a governorship primary organised by the party’s Electoral Committee, led by Chief Uchenna Okagbue.\nHe said: “I will run an inclusive campaign to redeem our state, and I passionately appeal to other aspirants to support the APGA movement to take over Enugu State government affairs by 2023.\n“Our business is to take over Enugu State government.\nThis victory, which is for the party, is just one step towards taking over government in Enugu State."
  },
  {
    "headline": "Niger Governor Bello defeats incumbent for senatorial ticket",
    "summarized_story": "Niger State Governor Abubakar Sani Bello has won the All Progressives Congress (APC) ticket for the Niger North Senatorial District in the 2023 general election.\nBello won the primary with 335 votes against incumbent Senator Aliyu Sabi who got seven votes.\nAlso, Chairman of the Electoral Committee for the Niger East Senatorial District, Mr. Raymond Mofe, declared incumbent Senator Mohammed Musa as winner.\nMofe said Musa polled 492 votes to defeat Mr. Ibrahim Dada who got two votes.\nAlso, incumbent senator for Niger South, Bima Enagi, won the primary election with 314 votes."
  },
  {
    "headline": "Kwara lawmaker loses bid to return to Senate",
    "summarized_story": "The senator representing Kwara Central at the National Assembly, Dr. Ibrahim Yahaya Oloriegbe, has lost his bid to return to the Senate in 2023.\nOloriegbe scored the least votes amongst the three All Progressives Congress (APC) aspirants that participated in the senatorial primary held in Ilorin, the state capital.\nA former APC national chairmanship aspirant, Mallam Saliu Mustapha, scored 136 votes to win the senatorial primary election.\nA businessman, Abdullfatai Serki-Gambari, scored 78, while Oloriegbe polled 15 votes."
  },
  {
    "headline": "Abiru gets APC Lagos East ticket",
    "summarized_story": "The senator representing Lagos East, Mukhail Adetokunbo Abiru, has won the All Progressives Congress (APC) ticket for the 2023 general election.\nIn his acceptance speech, Abiru said he would not relent in his #DoingGood Agenda for the people.\n“I want to let you know that I will continue to be passionate about ensuring ‘greater good for greater and larger number’.\n“The tactics to drive home this strategy is encapsulated in the resonating and reassuring ‘Doing Good’ drive mantra,” he said.\nWhile acknowledging the unwavering support of party’s leaders and members, the senator said he was honoured to be an unopposed candidate of the ruling party for the Lagos East Senatorial District."
  },
  {
    "headline": "Rivers: Judicial commission lacks powers to try Ameachi –Supreme Court",
    "summarized_story": "The apex court held that “in doing so, it is not trying any person for the commissionof any misconduct or crime.\nPremature Ejaculation & \"Small Joystick\" Resolved in 7Days... Click Here For Details .\nIt does not engage in the trial of any person for anything.\nIt merely gathers facts on the subject of the inquiry.”"
  },
  {
    "headline": "Breaking: Methodist Prelate, Bishop abducted in Abia",
    "summarized_story": "From Okey Sampson, UmuahiaThe Prelate of Methodist Church Nigeria, His Eminence Dr. Kalu Samuel Uche, and a Bishop of his church, have been reportedly abducted by gunmen.\nThe source equally said the incident has thrown the hierarchy of the church into confusion and fear over the safety of their Prelate.\nIt was not clear if the gunmen have made any contact with the church hierarchy or the family of the Prelate or made any demand for ransom.\nIt was not yet clear whether the Prelate travelled to Abia as part of his nationwide valedictory tour preparatory for his retirement that was near, before his abduction.\nAbia command Police Public Relations Officer (PPRO), Geoffrey Ogbonna confirmed the ugly incident to newsmen."
  },
  {
    "headline": "Ex-gov Yari in EFCC net over alleged role in AGF N80bn fraud",
    "summarized_story": "From Fred Itua, AbujaPartner with me, let's get you making N500K to N500K a month!\nThe Economic and Financial Crimes Commission (EFCC), on Sunday evening, reportedly arrested a former Zamfara state governor, Abdulaziz Yari, in connection with the N80 billion linked to ongoing investigation of the suspended Accountant-General of the Federation, Ahmed Idris.\nAccording to EFCC sources, Yari was arrested on Sunday at his Abuja residence.\nEFCC sources, who confirmed the arrest, said Yari is alleged to be one of the suspected accomplices of the embattled AGF in the alleged N80 billion fraud.\nOn the other hand, the AGF, Idris has been in EFCC custody since May 16 after he was arrested for N80 billion fraud and other corruption allegations."
  },
  {
    "headline": "BREAKING! Killer of Anambra lawmaker arrested",
    "summarized_story": "A member of the notorious gang allegedly responsible for beheading a member of the Anambra State House of Assembly has been arrested.\nThe lawmaker, Okechukwu Okoye representing Governor Chukwuma Soludo’s constituency, was brutally murdered by some suspected criminal who had earlier kidnapped him.\nThe alleged killer was arrested today at Amichi in Nnewi South local government area of Anambra State.\nAre you a Man 40 yrs and above?\nThe man whose name was given as Nnahadi Michael, was arrestedPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "2023: Northern leaders, others insist on Southern Presidency",
    "summarized_story": "The statement reads: “We wish to respond to the emergence of the former Vice President, Alhaji Atiku Abubakar as the Presidential candidate of the People’s Democratic Party (PDP) for the 2023 presidential election.\nAlhaji Atiku, a northern Muslim, defeated a plethora of PDP presidential aspirants in a contentious primary election in Abuja to lead the PDP charge for the general elections.\nWe consider it to be very inequitable, unfair and potentially dangerous for the Presidency to remain in the North after President Buhari’s tenure.\n“We therefore totally condemn the decision of the PDP to elect a northern Muslim presidential candidate at this point of our national life.\nThis would demonstrate that the APC has better understanding of the Nigerian society and is a Party built on trust, goodwill, and diversity."
  },
  {
    "headline": "Breaking: Methodist Church Prelate, Uche, 2 Others Kidnapped in Abia",
    "summarized_story": "The Prelate of the Methodist Church Nigeria, His Eminence, Samuel Kanu, was on Sunday, kidnapped along Enugu-Port Harcourt Expressway, in Umunneochi Local Government Area of Abia.\nHe was kidnapped alongside Rt.\nThe Police Public Relation Officer in Abia, SP Geoffrey Ogbonna, confirmed the incident to our correspondent.“It’s quite unfortunate.\nEfforts are on top gear toward his rescue as well as other priests with him.“We solicit credible information from the public toward their rescue, please,” he said.\n(NAN)Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Atiku Defeats Wike, Becomes PDP Presidential Candidate",
    "summarized_story": "The former vice president had in 1993, contested the Social Democratic Party presidential primary, losing to Moshood Abiola and Baba Gana Kingibe.\nHe was a presidential candidate of the Action Congress in the 2007 presidential election, coming third to Umaru Musa Yar’Adua of the PDP and Muhammadu Buhari of the ANPP.\nHe contested the presidential primary of the PDP during the 2011 presidential election losing out to incumbent President Goodluck Jonathan.\nIn 2014, he joined the APC ahead of the 2015 presidential election and contested the presidential primary but lost to Muhammadu Buhari.\nIn 2017, he returned to the PDP and was the party’s presidential candidate during the 2019 presidential election, but lost again to incumbent President Buhari."
  },
  {
    "headline": "Fresh Crisis Looms in APC as National Vice Chairman Blasts Adamu",
    "summarized_story": "Indications of the looming crack in APC’s NWC emerged following a letter by the party’s National Vice Chairman, North-west, Salihu Mohammed Lukman to the National Chairman, Adamu, which THISDAY sighted in Abuja yesterday.\n“Presidential aspirants are yet to be screened.\nBuhari May Unveil Consensus Presidential Candidate This WeekMeanwhile, indications have emerged that Buhari will meet with all APC presidential aspirants this week to inform them of the consensus arrangement ahead of the party’s primary election.\nOnce the president is back in the country, he will have a meeting with all the presidential aspirants,” the source explained.\nJonathan Option Unsettles Other APC Presidential AspirantsMeanwhile, the alleged plan to adopt former President Jonathan as APC’s consensus presidential candidate at the June 6 -8 presidential primary has continued to unsettle other presidential aspirants."
  },
  {
    "headline": "CBN Rallies Banks to Support Nigerian Firms to Expand Forex Earnings",
    "summarized_story": "*AfDB plans youth entrepreneurship banks in Nigeria, 12 others*Gets the nod to develop Index Bond to address insecurity in AfricaFestus AkanbiThe Central Bank of Nigeria (CBN) has urged Nigerian banks to support indigenous companies to increase foreign exchange inflows and boost economic growth.\nA CBN team on inspection of projects funded through Deposit Money Banks in Lagos advised the banks late on Friday.\nThe Head, Legal Services Department of CBN, Mr Kofo Salam-Alada, during a visit to Candel Company Limited., called on banks to support Nigerian companies to grow production in the country.\n“Security is now part of our thinking in the AfDB because we will support the countries to address security.\nHe said the Bank’s meetings also focused on the debt management for Africa."
  },
  {
    "headline": "Tambuwal: I Will Work With Atiku for PDP’s Victory",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto State has congratulated Peoples Democratic Party presidential candidate, Alhaji Atiku Abubakar, on his victory at the premaries, promising to work with him to enssre victory for PDP in the general election.\nTambuwal, a top presidential aspirant, had stepped down from the race at the convention venue shortly before the commencement of voting, and urged his supporters to vote for Atiku, a development that became a game changer for the former Vice President.\nCONGRATULATORY MESSAGE TO ALHAJI ATIKU ABUBAKAR (GCON, WAZIRIN ADAMAWA)It is history that after far reaching consultations and firm convictions on my part, I decidedly, with our great party and nation at heart, withdrew my aspiration to be nominated as a presidential candidate our party in your support.\nI assure you that we are desirous of working very closely with you to ensure our party’s victory next year by God’s grace.\nAminu Waziri Tambuwal (CFR, Mutawallen Sokoto)May 29, 2022SokotoShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Organisers Of Headies 2022 Petition Inspector-General Police Over Singer, Portable’s Alleged Threats To Kill Nominees",
    "summarized_story": "The organisers of one of Nigeria’s prestigious awards, Headies, have written a petition to the Inspector-General of Police, Usman Baba, concerning the threat to the life of some nominees of the award ceremony by artiste, Habeeb Okikiola popularly known as Portable.\nAnybody else who wins, I will ask for them to be killed.\nIn the petition, the organisers of the award demanded a retraction from the up-and-coming artiste.\nFurthermore, it was demanded by the organisers of The Headies that Portable should publish a written apology to all the nominees in the two categories.\nThe organisers of the award further stated that if the singer does not meet their demands, they will not only disqualify him from participating in the Headies but “also enforce the instrumentalities of the law to the fullest.”"
  },
  {
    "headline": "Peter Obi, Pat Utomi to contest Labour Party presidential primary on Monday",
    "summarized_story": "Peter Obi, former governor of Anambra, and Pat Utomi, a professor of political economy, are set to contest the presidential ticket of the Labour Party (LP).\nTheCable understands that the national convention of the party is set to hold on Monday in Asaba, the Delta capital.\nA source in the party told TheCable that Obi and Utomi are the two leading presidential candidates of the party.\nOn Friday, Obi, a presidential aspirant, joined LP hours after announcing the resignation of his membership of the Peoples Democratic Party (PDP).\nUtomi, co-convener the National Consultative Front (NCFront), is one of the stakeholders creating awareness on the need for a third force that will break the dominance of two major political parties in the country."
  },
  {
    "headline": "Peter Obi, Pat Utomi to contest Labour Party presidential primary on Monday",
    "summarized_story": "Peter Obi, former governor of Anambra, and Pat Utomi, a professor of political economy, are set to contest the presidential ticket of the Labour Party (LP).\nTheCable understands that the national convention of the party is set to hold on Monday in Asaba, the Delta capital.\nA source in the party told TheCable that Obi and Utomi are the two leading presidential candidates of the party.\nOn Friday, Obi, a presidential aspirant, joined LP hours after announcing the resignation of his membership of the Peoples Democratic Party (PDP).\nUtomi, co-convener the National Consultative Front (NCFront), is one of the stakeholders creating awareness on the need for a third force that will break the dominance of two major political parties in the country."
  },
  {
    "headline": "Frank Nweke II wins Enugu APGA governorship primary",
    "summarized_story": "Frank Nweke II, a former minister of information, has won the All Progressives Grand Alliance (APGA) governorship primary in Enugu state.\nIn April, Nweke declared his intention to contest the Enugu governorship seat on the platform of APGA – after defecting from the Peoples Democratic Party (PDP).\n“I am honored to accept the nomination of the All Progressives Grand Alliance #APGA as the party’s flagbearer for the 2023 gubernatorial election in Enugu State,” the tweet reads.\n“I thank all the Enugu APGA delegates for the faith shown in me and in my vision for Enugu.\n#Okeifufe2023 #Enugu2023.”Nweke is a Nigerian politician who was minister of youth, minister of information and then minister of information and communications during the second term of former President Olusegun Obasanjo."
  },
  {
    "headline": "Frank Nweke II wins Enugu APGA governorship primary",
    "summarized_story": "Frank Nweke II, a former minister of information, has won the All Progressives Grand Alliance (APGA) governorship primary in Enugu state.\nIn April, Nweke declared his intention to contest the Enugu governorship seat on the platform of APGA – after defecting from the Peoples Democratic Party (PDP).\n“I am honored to accept the nomination of the All Progressives Grand Alliance #APGA as the party’s flagbearer for the 2023 gubernatorial election in Enugu State,” the tweet reads.\n“I thank all the Enugu APGA delegates for the faith shown in me and in my vision for Enugu.\n#Okeifufe2023 #Enugu2023.”Nweke is a Nigerian politician who was minister of youth, minister of information and then minister of information and communications during the second term of former President Olusegun Obasanjo."
  },
  {
    "headline": "IN FULL: Jonathan missing as APC lists 23 presidential hopefuls for screening",
    "summarized_story": "Former President Goodluck Jonathan is not on the list of presidential hopefuls expected to be screened by the All Progressives Congress (APC).\nIn April 2022, after supporters besieged his Abuja residence to ask him to contest the 2023 presidential election, Jonathan had not given a definite response.\nDays after, a northern coalition bought the APC presidential expression of interest and nomination forms for him, but the former president had denied approving the purchase.\nA form was also purchased for Akinwumi Adesina, president of the African Development Bank (AfDB), but he had said he was not interested in contesting.\nAdvertisementBelow are the names of the presidential hopefuls for screening as listed by APC."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Elon Musk’s Starlink receives approval to provide internet service in Nigeria and Mozambique",
    "summarized_story": "On Friday, Tesla CEO Elon Musk announced on Twitter that Starlink, the satellite internet service launched by SpaceX, his space exploration company, has been approved in Nigeria and Mozambique.\nThis licensing follows a visit to Nigeria by the company’s team in May last year to discuss the possibility of obtaining a licence.\n“The company received two licenses, which include the International Gateway license and Internet Service Provider (ISP) license, and will be trading as Starlink Internet Services Nigeria Ltd.\nStarlink approved by Nigeria 🇳🇬 & Mozambique 🇲🇿https://t.co/Q1VvqVmJ2i — Elon Musk (@elonmusk) May 27, 2022Starlink is a low latency broadband internet system created to meet the needs of consumers in rural areas with low internet penetration across the globe.\nStarlink enters a Nigerian Internet service provider space that is dominated by telcos like MTN and Airtel, as well as individual ISPs such as Spectranet, SMILE and others."
  },
  {
    "headline": "Kenya’s digital products for PwDs",
    "summarized_story": "AdvertisementThis weekend, I’m also following my advice and billing you.\nKenya’s digital products for people with disabilitiesAccording to a report, approximately 40% of Africa’s population is disabled, including 10-15% of school-age children.\nThis means that people with disabilities, and older people who are largely disconnected from most e-government services and business-owned digital platforms, will be connected, supported, and empowered by digital products to increase their digital inclusion.\nAlso, public and private sector digital products and services (like websites and mobile applications) will be more accessible and usable by all Kenyan citizens.\nThis is similar to EnableMe Kenya, an online platform, aimed at providing community-oriented technological support and increasing digital inclusion for people with disabilities."
  },
  {
    "headline": "Dear healthtech startups, Jumia is coming for your bread!",
    "summarized_story": "It also represents a more formidable competitor for existing healthcare startups.\nThis makes it imperative that healthtech startups build solutions for this purpose.\nIn a chat with Techpoint Africa, he said, “Jumia can potentially build out its healthtech play through more partnerships to facilitate diagnostics.\nHealthtech startups, for example, can provide faster and more efficient services by partnering with Jumia.\nDespite being boosted by the COVID-19 pandemic, healthtech startups are still a long way from meeting Africa’s healthcare needs."
  },
  {
    "headline": "Reclaiming stolen African artefacts",
    "summarized_story": "Also, a Nigerian, Chidi Nwaubani, launched the “Looty” project to reclaim African artefacts stolen by European colonists.\nThe project will create 3D images of these artefacts, sell them as non-fungible tokens (NFTs), and use the proceeds to support young African artists.\nThis is because some of us mistake mental health for a mental illness, which it is not.\nMental health is more than just the absence of a mental disorder.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with mental disorders."
  },
  {
    "headline": "How to Transition into Tech in 1 Year",
    "summarized_story": "This piece answers some of your questions about pursuing a career in tech and how to transition.\nA sizeable number of people that transition to tech do so by leveraging their previously acquired skills—though these skills are mostly no-code or non-technical.\nOn a final note:It is very much possible to transition into tech within one year.\nIn the meantime, let’s circle back to where we began:A quick guide on How to Transition into Tech in 1 Year?\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Get a foreign bank account and card in minutes on Geegpay by Raenest",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:The world is now fully digital.\nWith Geegpay, African talents can create USD, GBP, and EUR virtual bank accounts for faster payments for their work.\nThey can automate their employer billing through our smart invoicing, and build their credit score while spending with Geegpay virtual card.\nAfter your identity verification, you can then request a virtual bank accountAnd that’s itGeegpay PageIdentity verification and request for a virtual bank account are instant!\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Presidency: Tinubu sees Atiku as ‘worthy opponent’",
    "summarized_story": "Tinubu said this while congratulating Abubakar on his emergence as the presidential candidate of the Peoples Democratic Party (PDP).\nAccording to Tinubu, Nigerians are yet to forget the national ruin and mismanagement of the country for 16 years by successive PDP administrations.\nThe two-term Lagos State governor stressed that this bad memory would dog the campaign of the PDP candidate.\n“Nevertheless, I once again congratulate our former vice-president for his victory at his party’s primary election,’’ he said.\nHe said: “I welcome the victory of Alhaji Atiku Abubakar as the candidate of the PDP at the just-concluded primary election."
  },
  {
    "headline": "How Atiku emerged victorious",
    "summarized_story": "Atiku Abubakar, a former vice-president, has emerged the People’s Democratic Party (PDP) presidential candidate for the 2023 general election, amid horse trading and strong determination to wrest power from the incumbent All Progressives Congress (APC).\nAtiku was declared victorious after a keenly contested primary held at MKO Abiola Stadium in Abuja, Saturday.\nIn the result, Atiku scored 371 votes to defeat his closest rival, Rivers State Governor, Nyesom Wike, who polled 237 votes.\nThe last few months leading to the presidential convention had been trailed by debates on whose region the PDP presidential ticket should be zoned to.\n“In December when we took over, I urged you all to keep hopes alive that with PDP, Nigeria shall rise again."
  },
  {
    "headline": "Nigeria’s promise fades as economy stutters",
    "summarized_story": "O’Neill did not immediately respond to an email seeking comments particularly about Nigeria’s economic trajectory in that period.\nAt no point in its 60-year history has Nigeria’s economy expanded slower than its population for a longer period than between 2015 and 2020, an indictment on Buhari’s administration.\nAfrica’s largest economy failed for six years to match its average population growth rate of 2.6 percent.\nWhen economic growth fails to match population growth, it means the economy is not creating new opportunities to accommodate a fast-rising population and is a sign of worsening poverty levels.\nNigeria’s GDP per capita declined by 0.02 percent, 4.16 percent and 1.78 percent in 2015, 2016 and 2017, respectively."
  },
  {
    "headline": "UNIBEN former VC, Oshodin dies at 71 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A former Vice Chancellor of the University of Benin (UNIBEN), Professor Osayuki Godwin Oshodin is dead.\nHe died in Benin City in the early hours of yesterday after a brief illness, according to a statement by his brother, Mr Christopher Oshodin, on behalf of the Oshodin familyHe was aged 71 years.\nA Professor of Health Education, born on August 9, 1950, and was Vice Chancellor of UNIBEN from 2009 to 2014.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "NNL WK 14: Efe Aghama debut as Insurance tame Stormers in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBendel Insurance Football Club of Benin,weekend defeated Abeokuta Stormers 2-0 in one of Match Day 14 fixtures in the Nigeria National League (NNL) to climb to the top of group B1 table.\nThe Benin Arsenal completed the task of securing the important six points in the first half with goals from Meyiwa Oritseweyinmi (19 minutes) and Zaidu Ayuba’s spot kick in the 26th minute to seal victory.\nIn the 25th minute, Sarki Ismael was brought down inside the Stormers box,resulting in a penalty which zaidu Ayuba confidently converted to increase the tally to 2-0 .\nEfe Joka Aghama graduated from the Insurance Feeders team after helping the young Insurance to lift Stephen Keshi National U-17 Football Tournament for the second time in 2021.\nHe was voted the most valuable and highest goalscorer of the tournament which held in Benin."
  },
  {
    "headline": "Obaseki congratulates Atiku on his emergence as PDP flagbearer – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has congratulated Nigeria’s former Vice President, Atiku Abubakar, on his victory at the Peoples Democratic Party (PDP) Presidential primary election.\nIn his message, the governor hailed other aspirants who submitted themselves to transparent democratic exercise that has set the PDP as a worthy example to all other political parties in the country.\nHe said, “I heartily congratulate His Excellency, Atiku Abubakar (GCON) on his victory at the Peoples Democratic Party Presidential primary election.\nCongratulations,” he added.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "#40,000 minimum wage: Edo tasks workers on performance, efficient service delivery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has tasked workers in the state to reciprocate the kind gestures of the state governor, Mr. Godwin Obaseki in the wake of the increment of the minimum wage in the state from N30,000 to N40,000 by ensuring effective delivery of quality service to Edo people.\nThe Edo State Head of Service, Anthony Okungbowa Esq., who spoke to journalists in Benin City, charged the workers to remain productive and committed to carrying out their duties.\nOkungbowa said the Obaseki-led government remains committed to the welfare of workers and pensioners in the state and will sustain programmes and initiatives to improve the living standards of the workers and Edo citizens.\nAmid the increase, Edo State has continuously and steadily paid its workers as and when due.”Okungbowa charged every worker in Edo to put in their best and remain dedicated to their duties, noting, “The increment of the minimum wage is part of measures to ensure that our people are enabled to do their job, much more than they did before.\nSo, every worker in the civil and public service must put in a lot more effort to justify the confidence reposed on them by ensuring that the bureaucracy of government is adequately productive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "SEC DG makes case for regular assessments of markets for better efficiency",
    "summarized_story": "The efficient functioning of capital markets in the West African Region demands a regular assessment of policies and programmes to fit current realities, and address the region’s peculiar challenges.\nHe reiterated that against the backdrop of innovation and dynamism in the capital markets, there is the need for regulators to keep pace with this trend.\nAccording to him, “We are not unaware that in some member states, capital markets activities are still in their nascent stage.\nWe intend to engage and partner with them to build capital markets that will support the growth and development of their respective countries while advancing our regional market integration efforts.\nThe focus of this conference, and rightly so, is on how effective regulation can enable the deepening and strengthening of the capital markets in the sub-region."
  },
  {
    "headline": "Lagos airport runway to be closed for repairs – FAAN",
    "summarized_story": "Federal Airports Authority of Nigeria, (FAAN), has notified airlines flying into the country that Murtala Muhammed International Airport, MMIA, Lagos Runway 18R/36L will be closed for repair works and flights will be diverted to Runway 18L.\nFAAN in a letter on Sunday, to the Station Manager at the MMIA titled, ‘Rehabilitation of Runway 18R/36L,’ signed by Dr. Al-ihekwaba N.E for; Airport Manager/Regional General Manager (SW) said the runway will be closed this weekends (Saturdays and Sundays) of 28th-29th May, 2022 and 4th-5th June, 2022 from 0600hours-1300hours-UTC to repair a bad patchThe letter read: ”As a result of the deplorable condition of Runway 18R/36L pavement, I wish to inform you that FAAN civil department will commence an emergency remedial work on the failed distressed pavement.”“Rehabilitation work will only be on the following weekends [Saturdays & Sundays] as follows: 28th-29th May, 2022, 4th-5th June, 2022 Time: 0600hours-1300hours-UTC Daily.”“Runway 18R/36L will be closed during the period of this work and Runways 18L/36R will be used for arrivals and departures.\nFAAN Management sincerely apologies for the inconveniences,” it read."
  },
  {
    "headline": "Peter Mbah, Enugu PDP guber candidate not assassinated",
    "summarized_story": "Dan Nwomeh, media officer to Peter Mbah, Enugu governorship candidate of the Peoples Democratic Party (PDP), has refuted reports alleging the assassination of his principal.\nMbah was declared winner of the Enugu PDP governorship primary on Wednesday.\nA video is being circulated on social media showing a vehicle riddled with bullets, with reports claiming that the politician was assassinated by unknown gunmen in Enugu.\n“We have been inundated with calls over a fake news in circulation on some social media platforms on the purported assassination of the Enugu state PDP governorship flagbearer, Peter Ndubuisi Mbah,” the statement said.\nTo the glory of God, I’m alive, strong, determined and ready to face challenges of our state,” he wrote via @Peter_Mbah_"
  },
  {
    "headline": "Again, Abuja Okada riders go berserk, set houses on fire over colleagues’ death",
    "summarized_story": "More than 100 Okada riders, on Sunday, attacked Same Global Estate in the Lokogoma area of Abuja to avenge the death of two colleagues.\nThe incident happened after a motorist reportedly hit the Okada rider and ran into the estate for safety.\nThe Okada riders, it was gathered, set fire to two buildings in the estate in bid to apprehend the motorist.\nThe incident comes days after Okada riders burnt several shops on fire at Dei Dei building materials market on fire."
  },
  {
    "headline": "Osun APC Senatorial Primary: Oriolowo lauds delegates, party leaders, says no victor no vanquished",
    "summarized_story": "Senator Adelere Oriolowo, the current senator representing the Osun West Senatorial District, has appreciated his teeming supporters, delegates, party leaders as well as all members of the ruling All Progressives Congress (APC) across the district for the confidence reposed in him since he joined the senate in 2019.\nOriolowo in a release issued by his media office shortly after the APC Osun West senatorial primary on Saturday applauded the doggedness and support of the party members since 2019 till date.\nThe senator who was in the contest to secure the ticket of the party for the second term in the aenate said, “the contest is a game which you either win or lose.\nThe release further stressed that having lost in the contest, he would not stop contributing his quota to the development of human kind.\nAccording to Senator Oriolowo, “I am highly elated for the demonstration of your love to me in the district and thank you for your affection and support, as well as the mandate I am currently enjoying in the senate, it is humbly appreciated."
  },
  {
    "headline": "Hamzat, Ofadaboy, Remmy Hazzan, others for award",
    "summarized_story": "As part of effort to reward excellence in the society, the 2022Sparklight winners have been unveiled following nomination and votingfrom Nigerians.\nAmong those who stood out with sterling qualities during the selection include Oyo State Governor Seyi Makinde, who emerged Governor of the Year while OgunState deputy governor, Engr.\nOther winners include Hon.\nThe event, according to the Chairman of the Award Planning Committee,Mr Tosin Adesile is scheduled to hold in Lagos on Sunday, June 12,2022.\nSpeaking on the reason for the award, he added, the essence of the award is to celebrate excellence and to encourage Nigerians to contributepositively to the development of Nigeria at this crucial time."
  },
  {
    "headline": "2023 Presidency: ‘You’ll be my opponent by God’s grace’, Tinubu congratulates Atiku",
    "summarized_story": "National Leader of All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, has congratulated former Vice President Atiku Abubakar for emerging as the flag bearer of the opposition Peoples Democratic Party (PDP) for the 2023 general elections.\nAtiku secured the highest votes at the primary election conducted at the Moshood Abiola Stadium in Abuja on Saturday.\n“I welcome the victory of Alhaji Atiku Abubakar as the candidate of the Peoples Democratic Party in the just concluded primary.\nI have known the former Vice President as a formidable politician and a patriot who believes in the unity and progress of our dear country.\nElection season should be a festival of ideas that will uplift our country and improve the living condition of all our people."
  },
  {
    "headline": "BREAKING: Atiku Wins PDP Presidential Primaries",
    "summarized_story": "Atiku Abubakar, Nigeria’s former vice-president, has emerged as the flagbearer of the Peoples Democratic Party [PDP] for the 2023 presidential election.\nMr Atiku defeated his closest rival, the Rivers state governor, Nyesome Wike who polled 237 votes.\nAtiku emerged victorious after polling 371 votes.\nBelow are the results from the Primaries;Atiku Abubakar – 371Nyesom Wike – 237 votesBukola Saraki – 70 votesAnyim Pius – 14 votesBala Mohammed – 20 votesEmmanuel Udom – 38 votesSam Ohuabunwa – 1 voteOliver Teriela Diana – 1 voteVoid Votes – 12Earlier, the Sokoto state governor, Aminu Tambuwal had stepped down for the former VP.\nTwo candidates were disqualified by the David Mark-led screening committee while Former Governor of Anambra State, Mr. Peter Obi opted out of the race and resigned from the party, leaving 14 contenders."
  },
  {
    "headline": "Atiku Abubakar Emerges PDP Presidential Candidate For 2023 Election",
    "summarized_story": "Former Vice President Atiku Abubakar has been elected president of the Peoples Democratic Party, making him the party’s frontrunner in the race for the general elections in 2023.\nThe PDP held its presidential primary polls on Saturday at the Moshood Abiola Stadium in Abuja, despite the Independent National Electoral Commission’s decision to extend the primaries (INEC).\nAminu Tambuwal, the governor of Sokoto state and a fellow presidential candidate, had previously withdrawn from the contest.\nMr Tambuwal asked delegates to vote for the former vice president, putting him ahead of his major rival Nyesom Wike.\nThe former vice president had tried five times unsuccessfully to become Nigeria’s president, starting in 1992 when he ran under the Social Democratic Party."
  },
  {
    "headline": "Why Ndigbo will rise against PDP, Atiku – Ohanaeze",
    "summarized_story": "The Ohanaeze Ndigbo Worldwide – the apex Igbo socio-political organisation – has described the Peoples Democratic Party (PDP) presidential primaries that produced former Vice President Atiku Abubakar as its 2023 presidential candidate as corrupt and erratic.\nOhanaeze said: “It’s amusing that PDP is now a Political party for the Northern region, with Dr. Iyochia Ayu as PDP chair, Walid Jubril as BOT Chair and Atiku Abubakar as 2023 PDP Presidential candidate.\n“Atiku Abubakar will be opposed in the South-East, and no Igbo is anticipated to champion or project Atiku Presidency in the East.\n“Ndigbo will rise against PDP and Atiku Abubakar as a prize for PDP’s ingratitude and dishonesty against Igbo.”Work with me, Atiku begs Wike, Saraki, othersNotwithstanding the opposition from the Ohanaeze, Alhaji Abubakar has urged his fellow contestants in the primary election to work with him for the party’s victory.\nA total of 15 aspirants were cleared to contest the PDP presidential primary although some of them withdrew before the contest started on Saturday."
  },
  {
    "headline": "2023 President ticket:Atiku’s emergence as PDP candidate unsettles APC",
    "summarized_story": "The emergence of former Vice President Atiku Abubakar as the presidential candidate of the Peoples Democratic Party (PDP) in the 2023 general elections is unsettling the camp of the governing All Progressives Congress (APC).\nAPC, PDP game plan?\nOn the options before the party on best way to confront the PDP candidate, Blueprint gathered that the APC is “re-strategising” in this regard.\nHe urged other APC presidential aspirants to drop their ambition and support Lawan, whom he is supporting after dropping his own presidential ambition.\nSpeaking with newsmen, Sunday, in Abuja, Okechukwu decried the alleged dollar rain during the PDP presidential primaries at the National Stadium Abuja."
  },
  {
    "headline": "Breaking: Gunmen kidnap Methodist church leader, 2 others",
    "summarized_story": "Report from Abia state indicates that gunmen have kidnapped Prelate of the Methodist Church Nigeria, His Eminence, Samuel Kanu.\nBlueprint gathered that he was kidnapped alongside two other senior priest of the Church on Sunday afternoon.\nIt was further gathered that the trio were abducted along Enugu/Portharcourt expressaay on their way from a church programme.\nAlready, Police authorities have confirmed the development with assurance of making efforts to rescue them.\nShare this: TwitterFacebook"
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "FBNInsurance Shareholders Approve 74 Kobo Dividend",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSSHAREHOLDERS of FBNInsurance Limited has approved a full year dividend of 74 kobo per ordinary share for the year end 2021.\nSpeaking at the Annual General Meeting, Mr. Val Ojumah, the Managing Director/Chief Executive Officer of FBNInsurance Limited, stated that FBNInsurance financial performance in 2021 demonstrates the company’s strong footing despite the challenging operating environment in 2021.\nThe dividend declared for year 2021 is a 6% increase from 70k that was declared in 2020.\nIt is worthy to note that FBNInsurance Limited has consistently paid dividend to its shareholders in the last eight years.\nFBNInsurance is also a member of the Sanlam Group, a leading diversified, pan-African financial services group."
  },
  {
    "headline": "FCMB Offers Up to N30m Auto Loan to Make Vehicle Ownership Easy",
    "summarized_story": "The FCMB auto loan supports acquiring brand new and pre-owned vehicles (popularly known as “Tokunbo”), with N500,000 as the minimum loan amount that a customer can access for a repayment duration of up to 5 years.\nNigerians can now finance their dream vehicle with an auto loan from FCMB at a low-interest rate with monthly or yearly payment options depending on their income.\nWe, therefore, urge the populace, including, but not limited to salaried individuals, to take advantage of this opportunity to fulfil their vehicle ownership dream”.\nFCMB Auto Loan empowers qualified Nigerians to part-finance the purchase of brand-new and pre-owned vehicles while spreading the repayment between one and five years.\nHowever, vehicle ownership in the country has been declining because of increased prices."
  },
  {
    "headline": "Excess Crude Account, $35.377m as of 25th May 2022 – FG",
    "summarized_story": "602bn in AprilBY ONU OKORIEFederal Government has revealed that the balance in the Nigeria’s Excess Crude Account as of 25th May 2022 stands at $35.377 million.\nThe communiqué indicated that the Gross Revenue available from the Value Added Tax (VAT) for April 2022 was N166.522 billion.\nThe distribution is as follows; Federal Government got N24.978 billion, the States received N83.261 billion, Local Government Councils got N58.283 billion.\nAccording to the communique, Gross Statutory Revenue of N461.189 billion, from which the Federal Government was allocated the sum of N217.412 billion, States got N110.275 billion, LGCs got N85.017, Derivation (13% Mineral Revenue) got N48.485 billion.\nThe communiqué also revealed that Petroleum Profit Tax (PPT), Oil and Excise Duty increased marginally, while Oil and Gas Royalties, Import Duty, Companies Income Tax (CIT) and Value Added Tax (VAT) all recorded significant decreases."
  },
  {
    "headline": "UPDATED: EFCC Arrests Ex-Zamfara Governor Yari",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested a former governor of Zamfara State, Abdul’aziz Yari.\nAccording to the sources, the anti-graft agency also arrested one Anthony Yaro who is the Chairman and Managing Director of Finex Professional – the company through which former Governor Yari allegedly benefited from the fund.\nChannels Television had reported that the primary was witnessed by Governor Bello Matawalle of Zamfara alongside party officials from both the APC national headquarters and the state executives, among others.\nFormer Governor Yari contested for the APC ticket unopposed at the exercise monitored by a team of officials of the Independent National Electoral Commission (INEC) and security agencies in Talata Mafara Local Government Area of the state.\nHe was reportedly intercepted in Kano State by EFCC operatives and flown to Abuja for interrogation."
  },
  {
    "headline": "UPDATED: Methodist Church Prelate, Two Others Abducted In Abia",
    "summarized_story": "A Prelate of the Methodist Church of Nigeria, Dr Samuel Uche, has been kidnapped by yet-to-be-identified men in Abia State.\nThe Police Public Relations Officer in the state, Geoffrey Ogbonna, confirmed this to Channels Television on Sunday in Umuahia, the state capital.\nAccording to him, the clergyman was abducted alongside two others – the Bishop of Methodist Church, Owerri Diocese, and the prelate’s chaplain.\nOgbonna explained that the clergymen were abducted at about 2pm on their way from a church event in Okigwe (Imo State) to Isuochi in Umu Nneochi Local Government Area of Abia State.\n“We have mobilised all the tactical teams to ensure they are rescued and for the possible arrest of the hoodlums,” said Ogbonna."
  },
  {
    "headline": "‘An Affront’: Southern, Middle Belt Leaders Blast PDP Over Atiku’s Victory",
    "summarized_story": "Leaders in the southern and central regions of the country under the auspices of the Southern and Middle Belt Leaders Forum (SMBLF) have faulted the Peoples Democratic Party (PDP) for electing a northern presidential candidate in the 2023 general elections.\nThey described the outcome of the exercise as “an affront” to the people of the South and asked politicians in the region to reject any nomination for the office of the Vice President.\nIn a communique jointly signed on Sunday by leaders of the groups that made up the forum, they specifically faulted the emergence of former Vice President Atiku Abubakar as the main opposition party’s flagbearer.\nThe SMBLF, however, urged presidential hopefuls in the South to shun the attitude of individualism and self-confidence, and work collectively to achieve the shared objective of producing President Muhammadu Buhari’s successor in the forthcoming elections.\nRead the full text of the communique below:"
  },
  {
    "headline": "PDP Cancels All Primaries In Ebonyi, To Announce New Date",
    "summarized_story": "The Peoples Democratic Party (PDP) cancelled all primaries in Ebonyi State on Sunday.\nA statement by the National Publicity Secretary, Hon Debo Ologunagba, says that the decision was made after extensive consultations and deliberations by the National Working Committee (NWC) of the party.\ndeliberations and review of all issues, the National Working Committee (NWC) of the Peoples Democratic Party (PDP) has approved the cancellation of all Party primaries in Ebonyi State.\n“To this effect, all State House of Assembly, National Assembly, and Governorship primaries of our Party in Ebonyi State are hereby cancelled.\nThe NWC will announce new dates for the affected Party exercises in the state,” the statement read in part."
  },
  {
    "headline": "APC Primary Committee Members Escape Mob Attack In Taraba",
    "summarized_story": "Police in Taraba have rescued members of the Primary Election Committee of the All Progressive Congress (APC) sent to conduct the elections for the party’s senatorial tickets in the state.\nThe members were reportedly ambushed and almost lynched by aggrieved party members on Saturday for allegedly conniving with a faction of the party to manipulate the outcomes of the exercise.\n“We are not under duress to address you, but here are the resolutions reached; that result sheets were not made available to us from the APC National Secretariat,” he said.\n“That the results were sent and received by Taraba State APC Chairman earlier and on arrival, we were informed that the result sheets were vandalised and that soft copies were consequently sent to us for the primary election.\n“That indirect mode of primary elections be adopted for northern and central senatorial zones, while the southern zone shall use the direct mode for senatorial primary elections.”Elsewhere, two results emerged at the just-concluded House of Representative primary with losers threatening legal action if internal mechanisms of resolution fail."
  },
  {
    "headline": "I will defeat Atiku in 2023 as APC candidate",
    "summarized_story": "APC’s youngest Presidential aspirant, Nicolas Felix has boasted that he will defeat the candidate of the People’s Democratic Party, Atiku Abuabakar in the 2023 presidential election, if elected candidate of the party.\nThe youngest presidential aspirant who acknowledged that the ruling All Progressives Congress has won so many elections at various levels but said the 2023 election will the easies win for APC if he’s elected as candidate.\n“To all APC Delegates, come June 6th, elect me, Dr. Nicolas Felix as your Presidential Candidate and together we will bring victory to our Party and our dear country- Nigeria.\n“APC has won so many elections at various levels but if am elected as your Candidate, this will be the easiest win APC ever gets.\nThank you once again for your support,” Nicolas Felix."
  },
  {
    "headline": "Adamu Aliero, supporters dump APC for PDP",
    "summarized_story": "Former Kebbi state Governor and Senator representing Kebbi central senatorial district, Adamu Aliero has defected from the All Progressives Congress APC to the People’s Democratic Party PDP.\nA close political ally of the former Minister of the Federal Capital Territory and former chairman of Kebbi State Emergency Management Agency, Sani Dodo confirmed the defection to TVC News in a telephone interview.\nMr. Dodo stated further that, the former governor and all his political structures have decided to leave the APC and now pitch their tent with the PDP.\nHe said they are only making necessary contacts and consultation with relevant stakeholders to cement their place in their new political party."
  },
  {
    "headline": "Fmr Kebbi Governor Adamu Aliero dumps APC for PDP",
    "summarized_story": "A former governor of Kebbi state and senator representing Kebbi central senatorial district, Adamu Aliero, has defected from the All Progressives Congress to the People’s Democratic Party.\nIn a telephone interview with TVCNEWS, Sani Dodo, a close political ally of former Minister of the Federal Capital Territory and former chairman of the Kebbi State Emergency Management Agency, confirmed Adamu Aliero’s defection from the APC to the PDP.\nAccording to Mr. Dodo, the former governor and all of his political structures have decided to leave the APC and join the PDP.\nHe stated that they are only making the necessary contacts and consulting with relevant stakeholders to solidify their position in their new political party."
  },
  {
    "headline": "Tinubu has the wining recipes, APC delegates to heed the call",
    "summarized_story": "A Socio-Cultural group, Yoruba Ronu has called on the ad-hoc delegates of the All Progressives Congress to vote massively for Asiwaju Bola Tinubu as the party’s flagbearer to guarantee the party’s wining the 2023 presidential election.\nThe Director of Communications of the group, Mr Steve Bayode, made this appeal during the visit of Asiwaju Ahmed Tinubu to Akure, Ondo State capital, as part of his final lapse of consultations with delegates across the country.\nBayode said with the election of Asiwaju Tinubu by APC delegates during the party’s primary, Nigeria is on the threshold of greatness for guaranteed development of the nation economy and infrastructure gains beyond 2023.\n“Asiwaju Tinubu is one who knows the way, goes the way and shows the way.\nSo, as APC delegates file out to effect their franchise, they should put the interest of the party first and foremost by voting wisely and casting their votes for the man who can truly win the presidency for the party – ASIWAJU BOLA AHMED TINUBU."
  },
  {
    "headline": "Nigeria: Oshiomhole, Lalong, Niger Governor Bello, Shettima, Abaribe, Gbenga Daniel Clinch Senatorial Tickets",
    "summarized_story": "A former National Chairman of All Progressives Congress (APC), Comrade Adams Oshiomhole; Plateau State Governor, Hon.\nSimon Lalong; Niger State Governor, Alhaji Sani Bello; former Ogun State Governor, Mr Gbenga Daniel and former Borno State Governor, Senator Kashim Shettima on Saturday secured tickets to contest the 2023 senatorial elections on the platform of the APC.\nLike Oshiomhole, former Borno State Governor, Senator Kashim Shettima won the return ticket of the APC to represent Borno with 479 votes.\nIn Niger State, Sani Bello clinched the senatorial ticket of the APC for Niger North.\nIn Ogun East, Mr Gbenga Daniel clinched the senatorial ticket of the APC."
  },
  {
    "headline": "Nigeria to Have 29 Million Child Brides by 2050, Says UNICEF",
    "summarized_story": "A report by the United Nations International Children’s Emergency Fund (UNICEF) has projected that Nigeria will have 29 million child brides by 2050.\nThe report put the country’s current number of child brides at 22 million, representing 40 per cent of such cases in West and Central Africa, warning that seven million more child brides will be added by 2050.\n“The rate of decline is also not enough to significantly reduce child marriage in Nigeria under current conditions.\nEven if efforts are redoubled, Nigeria will add about seven million child brides by 2050.\n“To effectively reduce child marriage in Nigeria, some challenges would need to be overcome."
  },
  {
    "headline": "Buhari Backs Establishment of African Standby Force on Terrorism",
    "summarized_story": "President Muhammadu Buhari has backed the recommendation of the African Union Commission for the setting up of a Standby Force on Terrorism in the continent.\nChairman, these efforts however, need to be strengthened and complemented by the African Union, through the African Union Peace and Security Architecture.\nPresident Buhari said he greatly valued his meeting with President Chakwera, giving assurances that he would pay attention to the issues brought to the meeting.\nIn his remarks, President Chekwara described President Buhari as a statesman and role model.\nPresident of São Tomé, Carlos Vila Novo and his spouse also met President Buhari and the First Lady, Mrs. Aisha Buhari."
  },
  {
    "headline": "Elon Musk’s Starlink Gets ISP Licence to Operate in Nigeria",
    "summarized_story": "The world’s richest man, Elon Musk has revealed that the Nigerian Communications Commission (NCC) has issued its firm, Starlink Internet Limited, with two licences to operate in Nigeria.\nStarlink Internet Limited, which is operated by SpaceX, will be trading as Starlink Internet Services Nigeria Limited.\nThe company received the two licences, which include the International Gateway licence and Internet Service Provider (ISP) licence, after months of negotiations with the NCC.\nStarlink offers satellite internet access coverage to 32 countries where its use has been licensed.\nTHISDAY gathered that the International Gateway licence has a 10-year tenure while the ISP licence is to last for five years."
  },
  {
    "headline": "AfDB Plans Youth Entrepreneurship Banks in Nigeria, 12 Other African Countries",
    "summarized_story": "The African Development Bank (AfDB) has embarked on the designing of youth entrepreneurship investment banks in 13 African countries, including Nigeria, even as it disclosed that it had obtained approval from its Board of Governors to develop a Security Index Investment Bond to address insecurity in Africa.\n“Security is now part of our thinking in the AfDB because we will support the countries to address security.\n“There must be a link between security, investment, growth, and development,” he said.\n“In the meetings, we talked of the African Development Fund (ADF).\nthe African Development Bank (AfDB) has embarked on the designing of youth entrepreneurship investment banks in 13 African countries, including Nigeria, even as it disclosed that it had obtained approval from its Board of Governors to develop a Security Index Investment Bond to address insecurity in Africa."
  }
]