[
  {
    "headline": "Don’t leave the country, medical college begs doctors",
    "summarized_story": "Angela OnwuzooPresident, National Postgraduate Medical College of Nigeria, Dr. Musa Muhammed Borodo has begged doctors leaving the country to show more understanding about the state of the nation, noting that things will soon improve.\nBorodo also urged the Federal Government to declare brain drain a national emergency, stressing that it is now imperative to improve the working environment of medical doctors.\nThe College President made the plea during a press briefing on Tuesday on the forthcoming College’s 39th Convocation ceremony billed to hold 16th September 2021.\nAccording to Borodo, this year’s graduation ceremony brings to almost 7,000 the number of Fellows by examination that the college has graduated since its inception.\n“Meanwhile, the college continues to recognise and commend the effort of frontline health workers, in many instances led by fellows of this college, in the fight against the pandemic,” he said."
  },
  {
    "headline": "Don’t leave the country, medical college begs doctors",
    "summarized_story": "Angela OnwuzooPresident, National Postgraduate Medical College of Nigeria, Dr. Musa Muhammed Borodo has begged doctors leaving the country to show more understanding about the state of the nation, noting that things will soon improve.\nBorodo also urged the Federal Government to declare brain drain a national emergency, stressing that it is now imperative to improve the working environment of medical doctors.\nThe College President made the plea during a press briefing on Tuesday on the forthcoming College’s 39th Convocation ceremony billed to hold 16th September 2021.\nAccording to Borodo, this year’s graduation ceremony brings to almost 7,000 the number of Fellows by examination that the college has graduated since its inception.\n“Meanwhile, the college continues to recognise and commend the effort of frontline health workers, in many instances led by fellows of this college, in the fight against the pandemic,” he said."
  },
  {
    "headline": "COVID-19: Nigeria, Jamaica, others may be added to travel risk list",
    "summarized_story": "Lara AdejoroNigeria, Jamaica and Grenada are among the countries that could be moved to the red list today, according to a data expert.\nThe government is set to update its COVID-19 travel list as part of a review that happens every three weeks.\nCountries and territories are listed as red, amber or green – with different rules for each of the three lists.\nAccording to Mr. White, Jamaica and Grenada which are popular destinations for tourists in the Caribbean, could be added to the red list.\nHe thinks a few other small islands in the Americas could be added to the red list, but the only concerns in Europe this time are in the Balkans."
  },
  {
    "headline": "COVID-19: Nigeria, Jamaica, others may be added to travel risk list",
    "summarized_story": "Lara AdejoroNigeria, Jamaica and Grenada are among the countries that could be moved to the red list today, according to a data expert.\nThe government is set to update its COVID-19 travel list as part of a review that happens every three weeks.\nCountries and territories are listed as red, amber or green – with different rules for each of the three lists.\nAccording to Mr. White, Jamaica and Grenada which are popular destinations for tourists in the Caribbean, could be added to the red list.\nHe thinks a few other small islands in the Americas could be added to the red list, but the only concerns in Europe this time are in the Balkans."
  },
  {
    "headline": "Prof Ibiyemi, Tunji Bello’s wife is new LASU VC",
    "summarized_story": "The wife of Tunji Bello, Lagos State Commissioner for Environment and Water Resources, Professor Ibiyemi Olatunji-Bello, has been appointed the new Vice Chancellor of Lagos State University, LASU.\nOlatunji-Bello, a professor of medicine, born on April 23, 1964 in Lagos, had served as Acting Vice Chancellor before the elevation.\nShe becomes the ninth Vice Chancellor of LASU after a rigorous exercise laced with intrigues and suspense.\nIbiyemi attended the Anglican Girl Grammar School, Surulere, 1974-1979; Methodist Girls High School, Yaba; Lagos State College of Science and Technology; University of lbadan, 1982-85; University of Lagos 1987 and University of Texas, Health Science Centre, San Antonio, USA, 1994-1998.She was an Assistant Lecturer, College of Medicine, University of Lagos, Idi-Araba; Lecturer, 1988; Lecturer 11, 199; Lecturer 1, 1996; Senior Lecturer 1999; Associate Professor 2005; Professor of Physiology, LASU College of Medicine, 2007; Deputy Vice-Chancellor, LASU since 2008, among others."
  },
  {
    "headline": "NAF probes attack on civilians in Yobe",
    "summarized_story": "By Kingsley Omonobi – AbujaThe Nigerian Airforce said on Thursday that it has commenced investigation into the alleged bombing of civilian settlements in Yobe State by fighter aircraft while trailing suspected Boko Haram terrorists.\n“The aircraft while operating South of Kanama observed suspicious movement consistent with Boko Haram terrorists behaviour whenever a Jet aircraft is overhead.\nIt is important to state that the area is well known for continuous Boko Haram /ISWAP activities.\n” Unfortunately reports reaching Nigerian Air Force (NAF) Headquarters alleged that some civilians were erroneously killed while others were injured.\n“Initial release denying the involvement of NAF aircraft was based on the first report available to the Air Component which was subsequently forwarded to NAF headquarters that civilians were bombed as the aircraft detailed for the mission was not carrying bombs."
  },
  {
    "headline": "Police arrest 4 robbery/cult suspects, reject N500,000 bribe in Lagos",
    "summarized_story": "The Police in Lagos State, said they have arrested four suspected armed robbers and cultists, rejecting a N500,000 bribe offered by the suspects to secure their freedom.\nThe police spokesman in Lagos, CSP Adekunle Ajisebutu, confirmed the arrest on Thursday in a statement.\nHe said that one of the suspects simply identified as Timothy, 23 years old, a resident of No.\nThe image maker further said that two more suspects were arrested for allegedly offering N500,000 bribe to the police to secure the release of the two suspects earlier arrested.\n“Determined to ensure justice through thorough investigation, the uncompromising police officers in charge of the case rejected the bribe,” he said."
  },
  {
    "headline": "Edo govt urges vaccinations as COVID-19 infections rise to 1,098, with 54 deaths",
    "summarized_story": "Governor Godwin Obaseki of Edo StateThe Edo state government has said that unvaccinated persons account for over 98.7 per cent of deaths recorded in the state in the third wave of the pandemic, with the total number of mortalities reaching 54.\nThe state COVID-19 Incident Manager, Dr Andrew Obi made the disclosure at the daily virtual meeting of the State COVID-19 Taskforce, chaired by Gov.\nHe added that the state recorded the death of another person, who had not taken the jab as the state’s tally of new infections spiral to 63.\nSo far, he said, 56,482 persons had been vaccinated with Moderna, while 12,051 others took the AstraZeneca vaccine.\nAccording to him, the state has so far in the third wave of the pandemic collected 13,721 samples and recorded 1,098 confirmed cases with 498 recoveries."
  },
  {
    "headline": "Our objective is to promote women’s football – Aisha Buhari",
    "summarized_story": "The First Lady, Mrs Aisha Buhari, says the objective of the ongoing Aisha Buhari Invitational Women’s football tournament was to promote football among women and girl-child for greater opportunities ahead.\nMrs Buhari said this at a reception organised by businessman Aliko Dangote, in honour of the visiting FIFA President, Gianni Infantino, in Lagos.\nMrs Buhari thanked the FIFA President for creating more chances for women’s participation in football.\n”Our objective for this tournament, Mr Infantino, is to use the event to promote women football and highlight its critical linkage to women development and the challenges facing women and girl-child, not only in Nigeria but on the African continent,” she said.\nMrs Buhari, therefore, called on stakeholders to support women’s football and girl-child education."
  },
  {
    "headline": "Insecurity: Nigeria’s image suffering due to media reports – Lai Mohammed",
    "summarized_story": "Lai Mohammed, the Minister of Information and Culture, said Nigeria is experiencing image problems due to unflattering reports by the media.\nThe minister accused the media of not being factual in their report of security agents in the fight against insecurity.\nAccording to Mohammed: “Whatever image problem Nigeria is suffering from today is mostly due to the unflattering portrayal of the country by the country’s media.\n“Even when some media organizations report fake news, they never have the decency to retract such stories and apologise.\n“We are not saying the media should not report on the security challenges we face."
  },
  {
    "headline": "BREAKING: EFCC Chairman, Abdulrasheed Bawa slumps in Abuja",
    "summarized_story": "Abdulrasheed Bawa, Chairman of Economic and Financial Crimes Commission (EFCC), on Thursday reportedly collapsed while delivering a speech at the Presidential Villa, Abuja.\nAccording to Daily Trust, Bawa was giving a goodwill message at the National Identity Day celebration when he suddenly stopped speaking.\nHe was later assisted to his seat by the Minister of Communications and Digital Economy, Dr Isa Ali Pantami, and other senior officials at the event and was rushed out.\nBefore the incident, Bawa was speaking about a man who was arrested in Ibadan, Oyo State, with 116 SIM cards.\nDetails later…"
  },
  {
    "headline": "BREAKING: Nnamdi Kanu drags Kenyan Government to court over rearrest",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has dragged the Kenyan Government to court.\nKanu instituted a case against the Kenyan Government through his legal team.\nThe Special Counsel to the IPOB leader, Aloy Ejimakor, disclosed this via his Twitter handle on Thursday.\n“UPDATE: Extraordinary Rendition: Onyendu’s legal team has filed a suit in Kenya against the Kenyan government,” Ejimakor wrote.\nThe Kenyan High Commissioner, Wilfred Machage, refuted the claim that Kenyan police arrested Kanu."
  },
  {
    "headline": "Nnamdi Kanu: Govt hoodlums responsible – IPOB speaks on ESN killing Anglican priest",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has said its members have no hands in the killing of an Anglican priest in Nkwere Local Government Area of Imo State.\nIPOB claimed that hoodlums created by security operatives were responsible for such crime in the Southeast and not its members.\nRev Emeka Merenu of the Church of Nigeria (Anglican Communion) was killed by unknown gunmen during the sit-at-home order on Monday.\nFollowing the incident, members of IPOB’s Eastern Security Network, ESN, were linked to the killing.\nAnyone pointing accusing fingers at IPOB for such a dastardly act is only doing so to demonise IPOB."
  },
  {
    "headline": "Kano controversial Sheikh, Abduljabar’s lawyers withdraw their services",
    "summarized_story": "In a swift twist of events, the team of lawyers defending Kano controversial sheikh, Abduljabar Nasiru Kabara, accused of blasphemous statement against the Prophet of Islam, have all withdrawn their services.\n“We took the decision to withdraw from the case after meeting with our Client at the Kurmawa Correctional Center, by this, we are informing the Court of our withdrawal from the case as defence lawyers”, Barrister Saleh M Bagoro said.\nSheikh Abduljabar refused to talk after the government’s lead counsel, Suraj Said, filed fresh charges against the sheikh, something that created misunderstanding between the defendant counsels and government counsels.\nHowever, the presiding judge, Sarki Yola, agreed to approve the inclusion of the fresh charges filed by the lawyers representing the Kano State Government, but only if the accused Sheikh Abduljabar answer in the affirmative or reject the charges.\nThe judge overruled their objections and ordered Abduljabbar to respond to the new charges, but his lawyers asked him to keep mute- which he obliged."
  },
  {
    "headline": "PHOTOS: Buhari receives FIFA President, Infantino",
    "summarized_story": ""
  },
  {
    "headline": "NAF probes ‘unfortunate’ bombing of civilians in Yobe",
    "summarized_story": "Agency ReporterThe Nigerian Air Force (NAF) has begun an investigation into fighter jet airstrike in ”Buhari village” in Yunusari Local Government Area of the state.\nThis is contained in a statement by the Director of Public Relations and Information, NAF Headquarters, Air Commodore Edward Gabkwet, on Thursday in Abuja.\n“The aircraft while operating South of Kanama observed suspicious movement consistent with the insurgents behaviour whenever a Jet aircraft is overhead.\n“But unfortunately, reports reaching NAF Headquarters alleged that some civilians were erroneously killed while others were injured.”According to the director, the initial release denying the involvement of NAF aircraft was based on the first report available to the Air Component which was subsequently forwarded to NAF headquarters.\nHe added that the report stated that civilians were bombed as the aircraft detailed for the mission was not carrying bombs."
  },
  {
    "headline": "Igala apex body raises security concerns in Kogi East",
    "summarized_story": "By Kolade Adeyemi, Jos- Advertisement -A leading sociocultural body Ukomu Igala Organisation (UIO) has raised concerns over security threats in Kogi East senatorial zone.\n“On July 18, 2021, a medical doctor, Dr Solomon Nidiamaka, working with General Hospital Ugwolawo, in Ofu Local Government Area of Kogi state was kidnapped by gunmen in similar circumstance.\nFew day later, precisely on September 11, 2021, one Idris Bala was killed by Fulani herdsman at Ojapata Oganigu village in Dekina local government of Kogi state.\nIt called on Federal and State government as well as security agencies, local government chairmen, traditional rulers, and security experts, to put in place an effective security arrangement to respond to the peculiar challenges facing Igala land and Kogi State at large.\nUIO calls on all communities in Igala land to put in place dependable and formidable Community Security outfits, which could assist the efforts of the security agencies."
  },
  {
    "headline": "Sanwo-Olu appoints Prof Olatunji-Bello as 9th LASU VC",
    "summarized_story": "By Gabriel DikeGovernor Babajide Sanwo-Olu on Thursday approved the appointment of Prof. Ibiyemi Olatunji-Bello, as the 9th Vice Chancellor of Lagos State University (LASU).\nProf. Olatunji-Bello, a Professor of Physiology, Lagos State University College of Medicine (LASUCOM).\nGovernor Sanwo-Olu picked her among three professors recommended by the Sir David Sunmoni-led Governing Council.\nShe is expected to resume office in the first week of October.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "IPOB Leader Nnamdi Kanu drags Kenya to court over extradition",
    "summarized_story": "The leader of the Indigenous People of Biafra, Mazi Nnamdi Kanu, has dragged Kenya court over his extradition to Nigeria.\nThose named as respondents are Kenya’s Interior CS, Director of Immigration, Director of Criminal Investigations, OCPD Jomo Kenyatta International Airport, and the Attorney General.\nNigerian officials on June 29 claimed Kanu was brought back to face trial after he jumped bail and went on the run in 2017.\nThe petition revealed that Kanu was in Kenya to seek medical attention for a heart challenge and for “Indigenous People of Biafra-related work”.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "NAF probes alleged killing of civilians by fighters jet in Yobe State",
    "summarized_story": "The aircraft while operating South of Kanama observed suspicious movement consistent with Boko Haram terrorists behaviour whenever a Jet aircraft is overhead.\nIt is important to state that the area is well known for continuous Boko Haram /ISWAP activities.\nUnfortunately reports reaching Nigerian Air Force (NAF) Headquarters alleged that some civilians were erroneously killed while others were injured.\n“Initial release denying the involvement of NAF aircraft was based on the first report available to the Air Component which was subsequently forwarded to NAF headquarters that civilians were bombed as the aircraft detailed for the mission was not carrying bombs.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Osinbajo to represent Buhari in Accra at 2nd ECOWAS meeting on Guinea’s political situation – Presidency",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has sent Vice President Yemi Osinbajo, to represent him at the 2nd Extraordinary Summit of the Economic Community of West African States (ECOWAS) Authority of Heads of State and Government on the political situation in the Republic of Guinea in Accra, Ghana.\nAccording to a statement by the Senior Special Assistant to the President on Media and Publicity, Office of the Vice President, Laolu Akande, Osinbajo had participated last week at the previous ECOWAS Extraordinary Summit on the political situation in Guinea and Mali.\nThe physical meeting taking place in Accra will review the situation in Guinea in light of the report of the ECOWAS high-level mission to Conakry.\nThe Vice President who left Abuja Thursday morning has in his delegation the Minister of State of Foreign Affairs, Ambassador Zubairu Dada.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Relocation of insurgents wake-up call –CAN",
    "summarized_story": "From Sola Ojo, Kaduna, Molly Kilete, Abuja and Chinelo ObogoChairman, Christian Association of Nigeria (CAN), Kaduna State Chapter, Revd Joseph Hayab, has described the alleged relocation of Boko Haram leaders to Southern Kaduna as a wake-up call on people of the area.\n“The relocation of Boko Haram to Southern Kaduna is not new.\nThe church, SOKAPU and the people have been complaining about killings in Southern Kaduna but only fell on the deaf ear of those in authority.\nBoko Haram fleeing North East to Southern Kaduna is simply a wake-up call for the southern Kaduna people to rise to the occasion,” he said.\nA leaked DSS memo had said insurgents were relocating from Sambisa forest in Borno state to Chikun LGA in Kaduna state."
  },
  {
    "headline": "DPR to Exceed N3.2trn Revenue Benchmark, Adjusts to N5trn By Year End",
    "summarized_story": "It called for industry synergy to ensure that President Muhammadu Buhari’s vision for the sector was realised.\nThe DPR executive secretary explained, “Last year, we exceeded our revenue target.\n“We are targeting N5 trillion for government, but as it is now, the N3.2 trillion as of 30 August, we had generated 70 per cent.\nWe have producing reservoirs of 1,700, but we are not producing from all these oil and gas reservoirs.\nIn his remarks, Gusau stated that the managements of both organisations were sorting out all the issues raised during the PTDF’s earlier visit to the DPR."
  },
  {
    "headline": "Salami: With Debt Service-to-Revenue at 98%, Nigeria’s Borrowing Unsustainable",
    "summarized_story": "Salami also lamented that with debt service-to-revenue ratio at 97.7 per cent (January to May 2021), the country’s public debt profile was unmaintainable.\nThis is just as the Debt Management Office (DMO) yesterday disclosed that Nigeria’s total public debt, comprising states and federal government debt obligations, grew by 7.75 per cent, from N32.916 trillion in December 31, 2020, to N35.465 trillion as of June 30, 2021.\nHe added that public debt had continued to expand on the back of growing fiscal deficit.\nNigeria’s Public Debt Grows to N35tnMeanwhile, Nigeria’s total public debt, comprising states and federal government debt obligations, rose by 7.75 per cent, from N32.916 trillion in December 31, 2020, to N35.465 trillion as of June 30, 2021.\nOf the N13.711 trillion external debt, the federal government only accounts for N11.828 trillion while the states and FCT make up the balance of N1.883 trillion."
  },
  {
    "headline": "Odili Sues Immigration over Seized Passport, NIS Says Ex-gov on EFCC’s Watch List",
    "summarized_story": "In the fundermental rights enforcement suit, he claimed that the international passport with numbers B50031305 was seized from him on June 20, 2021 by operatives of the Immigration Service and had since been witheld.\nHowever in a counter affidavit by the Immigration Service, It was revealed that Odili’s passport was seized because he was on the watch list of the EFCC.\nThe affidavit deposed to by one Okwe Ernest of the Legal Department of the Immigration Service averred that Odili was watch listed at the request of the EFCC.\nThe Immigration Service claimed that the former governor was not entitled to the request presented before the court and that his suit should be dismissed for being premature.\nThe affidavit said that since the passport was seized, Odili had never for once demanded for its release or cared to know why it was seized."
  },
  {
    "headline": "Twitter Ban to be Lifted Soon, Says Information Minister",
    "summarized_story": "By Deji ElumoyeThe Federal Government has disclosed that the suspension placed on the operations of the microblogging platform, Twitter, in Nigeria will be lifted soon.\nInformation and Culture Minister, Lai Mohammed, told newsmen Wednesday at the end of the weekly Federal Executive Council (FEC) meeting presided over by President Muhammadu Buhari at the State House, Abuja that the issue was almost being resolved between the government and the microblogging site.\nAccording to him: “We have gone very far, I won’t be specific but we have gone very far, and honestly, it’s just going to be very, very soon, just take my word for that.\n“Honestly, I can’t be more specific than what I’ve told you that lifting of the suspension is going to be very soon.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Malami Writes Govs over Stamp Duty, Says No Recoveries Yet",
    "summarized_story": "Says no recoveries yetBy Alex EnumahThe Attorney General of the Federation (AGF) and Minister of Justice, Abubakar Malami (SAN), has written the 36 state governors of the federation regarding the state of stamp duty collection and remittance in the country.\nGwandu noted that Section 111 of the Stamp Duty Act granted the AGF an exclusive power to recover any outstanding payment or remittances related to stamp duty.\nHe explained that what the AGF did was to activate those powers, conduct the audit and recovery of back years stamp duty in collaboration with stakeholders.\nOnly last month, the attorneys-general of the 36 states have sued Malami over the alleged failure of the federal government to remit funds generated from stamp duties into states’ accounts.\nThe states argued that they are the sole authority to collect stamp duties and not the federal government."
  },
  {
    "headline": "BREAKING: IPOB Leader, Nnamdi Kanu Sues Kenya Government For 'Illegally Detaining, Extraditing' Him To Nigeria",
    "summarized_story": "Germany-based Kingsley Kanu has filed a suit against the Kenyan government at the High Court of Kenya, Nairobi for its involvement in the abduction and extraordinary rendition of his brother and leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu to Nigeria.\nNnamdi KanuKanu's special counsel in Nigeria, Aloy Ejimakor disclosed this to SaharaReporters on Thursday with evidence of court documents.\nDefinitely, he was kidnapped.”Wajackoyah further told BBC, “Why on earth will the Kenyan government deport a British citizen to Nigerian territory.\nIt is an abuse of the court process for the Nigerian court to try a British citizen who has no connection with Nigeria and without due process.\nSo, I have been given instruction by his family in London and his brother in Germany to file a lawsuit against the Kenyan government.”"
  },
  {
    "headline": "BREAKING: IPOB Leader, Nnamdi Kanu Sues Kenya Government For 'Illegally Detaining, Extraditing' Him To Nigeria",
    "summarized_story": "Germany-based Kingsley Kanu has filed a suit against the Kenyan government at the High Court of Kenya, Nairobi for its involvement in the abduction and extraordinary rendition of his brother and leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu to Nigeria.\nNnamdi KanuKanu's special counsel in Nigeria, Aloy Ejimakor disclosed this to SaharaReporters on Thursday with evidence of court documents.\nDefinitely, he was kidnapped.”Wajackoyah further told BBC, “Why on earth will the Kenyan government deport a British citizen to Nigerian territory.\nIt is an abuse of the court process for the Nigerian court to try a British citizen who has no connection with Nigeria and without due process.\nSo, I have been given instruction by his family in London and his brother in Germany to file a lawsuit against the Kenyan government.”"
  },
  {
    "headline": "EXCLUSIVE: Many Nigerian Soldiers Killed In Fresh Boko Haram Ambush In Borno",
    "summarized_story": "A yet-to-be confirmed number of soldiers have been killed and several others missing after an ambush by militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State.\nMay their souls rest in peace,” a military source told SaharaReporters.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in northeastern Nigeria.\nSome soldiers were killed during the year when two explosive-laden vehicles rammed into a military convoy in Wulgo.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents."
  },
  {
    "headline": "EXCLUSIVE: Many Nigerian Soldiers Killed In Fresh Boko Haram Ambush In Borno",
    "summarized_story": "A yet-to-be confirmed number of soldiers have been killed and several others missing after an ambush by militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State.\nMay their souls rest in peace,” a military source told SaharaReporters.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in northeastern Nigeria.\nSome soldiers were killed during the year when two explosive-laden vehicles rammed into a military convoy in Wulgo.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents."
  },
  {
    "headline": "EXCLUSIVE: Why Former President Jonathan Is Delaying Joining Buhari, Others In All Progressives Congress Party",
    "summarized_story": "Amid reports of his plan to defect to the All Progressives Congress (APC) from the Peoples Democratic Party (PDP), former President Goodluck Jonathan is only biding his time for some of the conditions he had given the ruling party to be met.\nAccording to the source, the Presidency cabal wants to make Jonathan the next president as they know he won't investigate atrocities committed by Buhari's regime.\n“About a year ago Jonathan started consulting with APC to see how he could join the party.\nJonathan assisted APC candidate in his state to win election but a court squashed his victory before he could be sworn in.\nThe source continued, “Buhari cabal knew Jonathan could only do one term, in fact only 2 years constitutionally."
  },
  {
    "headline": "Coinbase: Despite ban, Nigerians using crypto to import goods from China",
    "summarized_story": "Coinbase, one of the biggest cryptocurrency exchanges in the world, says Nigerians are using cryptocurrencies to buy goods from China — despite the ban in the country.\nDespite the ban, Nigerians have been using peer-to-peer crypto networks to trade cryptocurrencies, driving some of the biggest adoptions in the world.\nIn its most recent crypto newsletter, Coinbase said Nigerians were using the alternative currency to import goods from China.\nAdvertisement“Digital currencies have become many Nigerians’ on-ramp to the global economy, despite government efforts to restrict crypto,” Coinbase said.\n“Some Nigerians are using crypto to import goods — from China, for example — that can then be resold domestically."
  },
  {
    "headline": "Coinbase: Despite ban, Nigerians using crypto to import goods from China",
    "summarized_story": "Coinbase, one of the biggest cryptocurrency exchanges in the world, says Nigerians are using cryptocurrencies to buy goods from China — despite the ban in the country.\nDespite the ban, Nigerians have been using peer-to-peer crypto networks to trade cryptocurrencies, driving some of the biggest adoptions in the world.\nIn its most recent crypto newsletter, Coinbase said Nigerians were using the alternative currency to import goods from China.\nAdvertisement“Digital currencies have become many Nigerians’ on-ramp to the global economy, despite government efforts to restrict crypto,” Coinbase said.\n“Some Nigerians are using crypto to import goods — from China, for example — that can then be resold domestically."
  },
  {
    "headline": "APC: Jonathan will be given chance to contest in 2023 -- like we would any Nigerian",
    "summarized_story": "The All Progressives Congress (APC) says former President Goodluck Jonathan will be allowed to contest for presidency in 2023 if he joins the party.\nAdvertisementJohn Akpanudoedehe, national secretary of the APC caretaker committee, said this in a chat with Channels TV on Wednesday.\nThe national secretary said the former president joining the APC “will be great news” to “strengthen the party”.\nHe said Jonathan will be given the opportunity to contest for the office of the president in 2023 under the auspices of the party, just like any other individual who is interested to run for office.\n“So, anyone who joins today has the same opportunity to run for any office in this party."
  },
  {
    "headline": "APC: Jonathan will be given chance to contest in 2023 -- like we would any Nigerian",
    "summarized_story": "The All Progressives Congress (APC) says former President Goodluck Jonathan will be allowed to contest for presidency in 2023 if he joins the party.\nAdvertisementJohn Akpanudoedehe, national secretary of the APC caretaker committee, said this in a chat with Channels TV on Wednesday.\nThe national secretary said the former president joining the APC “will be great news” to “strengthen the party”.\nHe said Jonathan will be given the opportunity to contest for the office of the president in 2023 under the auspices of the party, just like any other individual who is interested to run for office.\n“So, anyone who joins today has the same opportunity to run for any office in this party."
  },
  {
    "headline": "Ibiyemi Olatunji-Bello appointed LASU VC",
    "summarized_story": "Ibiyemi Olatunji-Bello has been appointed as the ninth substantive vice-chancellor (VC) of the Lagos State University (LASU).\nAdvertisementLASU has been in crisis since the tenure of Olarewaju Fagbohun, the institution’s eighth VC, expired on January 11.\nThe new VC attended the University of Ibadan (UI) from 1982 to 1985 where she bagged a BSc in Physiology.\nIn 1987, she was awarded MSc (Physiology) at the University of Lagos (UNILAG).\nUntil her election as the first female deputy vice-chancellor of LASU, she was the first substantive head of the Department of Physiology at LASU."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nSouth AfricaIn South Africa, the iPhone 13 will reportedly be available from October 8 according to iStoreZA, an Apple premium reseller.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "How BFree is improving trust in the lending space",
    "summarized_story": "This incident is one out of many which indicate that digital lenders will go the extra mile, sometimes using unethical methods, to get their loans back.\nThe sanction served as a clarion call for digital lenders to use ethical alternative methods to collect loans.\nBut it didn’t take long to see that there were some cracks in the collection process.\nAt BFree customers are appraised based on two factors: willingness and capability to pay.\nFlosbach believes that BFree’s ultimate goal is to increase trust in the African lending space."
  },
  {
    "headline": "Goldman Sachs-backed Jumo launches its first loan product in Ivory Coast",
    "summarized_story": "South Africa-based Jumo has partnered with MANSA Bank and MTN Mobile Financial Services to provide loans to entrepreneurs and small businesses in Ivory Coast.\nIn Ivory Coast, which is Jumo’s most recent market, the collaboration will see the company introduce its new short-term and small-scale loan product, VitKash, built in partnership with MANSA and offered through MTN’s mobile money platform.\nThe recent expansion was driven by a number of factors, which according to Kone make the West African nation an “attractive market” for Jumo.\n“Ivory Coast has all the characteristics of an attractive market with high growth potential.\n“In the WAMU (West African Monetary Union) zone, there is a strong will from the BCEAO (the central bank of 8 Francophone West African States) to improve financial inclusion and financial literacy,” Kone said."
  },
  {
    "headline": "These ten African countries have the cheapest data plans",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango /birdIn Africa, internet data is expensive currencySudan leads nine other African countries that charge its citizens less than $1 for a gigabyte (1 GB) of mobile data, a report by British technology research firm Cable shows.\nThe Northeastern Africa nation offers the lowest cost of internet access over a smartphone anywhere in Africa and ranks among the top five cheapest countries for mobile data, in the world, according to the Worldwide Mobile Data Pricing 2021.\nThe cost of mobile internet in Sudan is $0.27 for every gigabyte of data.\nAlgeria is second-cheapest at $0.51, while Somalia takes the third-cheapest slot on the continent, at $0.60 per 1GB of mobile data.\nThe report, which featured more than 230 countries across 12 regions and compared the cost of 1GB from over 6,000 mobile data plans, also pointed out that North Africa (at an average of $1.53) has the cheapest data plans in the world."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "INEC tasks new Commissioners to be more proactive – Nigerian Observer",
    "summarized_story": "The chairman made known at the headquarters of the Commission during the swearing in ceremony of the RECs, in Abuja.\nAccording to Prof. Yakubu, RECs as election managers, must know that their integrity is paramount to the success of their duty.\n“Let me draw the attention of the new National and Resident Electoral Commissioners to the reality of serving in INEC.\n“Only last weekend, we piloted yet another innovation in the Isoko South 1 State Constituency bye-election in Delta State.\n“This mechanism will be activated ahead of the forthcoming Anambra State Governorship election”, Prof Yakubu said."
  },
  {
    "headline": "NAPVID donates to special schools in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin – In its bid to boost learning amongst persons living with disabilities in Edo state, the Network for the Advancement of Persons with Visible Disabilities (NAPVID) has donated educational materials to special schools in Benin City.\nOmosar said it is to boost the morale as well as serve as incentive for students with disabilities in the “special” educational institutions in the state.\nHe commended the teachers of the schools, while urging the pupils to remain steadfast in their educational pursuit regardless of their physical challenges.\nOmosah remarkedAlso, Chairman of the State Universal Basic Education Board (SUBEB), Joan Oviave lauded NAPVID for promoting special education and sustaining it partnership with the board over the years.\nHeads of the schools, Enobakhare Fabulous, Iwusa Shaibu and Owoeye Josephine expressed appreciation to NAPVID and Edo State government for their support to the institutions."
  },
  {
    "headline": "COVID-19 infection in Edo rises to 1098, mortalities hit 54, as govt urges vaccination – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has intensified the vaccination of citizens across the state’s 18 local government areas, urging those who have been inoculated to get vaccinated in order to remain healthy and protected against the deadly virus.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nHe said the state recorded the death of another person who has not been inoculated with the COVID-19 vaccine, as the state confirmed 63 new cases.\nThe total number of mortalities in the third wave of the pandemic stands at 54.\nReassuring the government’s commitment to containing the pandemic and protecting Edo citizens, the Incident Manager said Edo has inoculated over 68,533 persons since the commencement of the second phase vaccination exercise, with 56,482 persons vaccinated with Moderna, while 12,051 others were inoculated with the AstraZeneca vaccines."
  },
  {
    "headline": "Ekewan Road Project to be completed Sept 2022 – Edo Govt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State government has assured commuters and residents of Ekewan Road axis of Benin City that government would complete the ongoing construction and dualisation of the road by September next year.\nFerguson Enabule gave the assurance in Benin City during an inspection visit to the area to assess the level of work done so far by the contractor.\nHe appealed to the residents to be patient with government, noting that work on the project would resume after the rains.\nAccording to him, the contract has cash backing as government was not owing the contractor, a position attested to by Mr. Yehya.\nThe youths expressed satisfaction with the state of work done on the project so far, and lauded the developmental strides of the state Governor, Mr Godwin Obaseki in the area."
  },
  {
    "headline": "We’re building three flyovers, interchange to decongest Lagos-Ibadan expressway — Fashola",
    "summarized_story": "ADVERTISEMENTThe federal government is collaborating with Ogun Government to secure the Right of Way (RoW) for the construction of three bridges and an interchange on the Lagos-Ibadan expressway.\nThe Minister of Works and Housing, Babatunde Fashola, said this during an inspection of the highway on Wednesday.\nThe bridges are under construction at Makun, MFM, and Lotto (Mowe) areas on the Lagos-Ibadan expressway.\nMr Fashola expressed satisfaction with the progress of work on the ongoing reconstruction/rehabilitation of the Lagos-Ibadan Expressway.\nHe said that section one of the Lagos-Ibadan Expressway project, which spans from Ojota in Lagos to Sagamu Interchange “has achieved 56 per cent completion”."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "APC says ex president, Jonathan will be allowed to contest in 2023 if he joins party",
    "summarized_story": "Nigeria’s ruling party, the All Progressives Congress (APC), has said former president, Goodluck Jonathan will be allowed to contest for president under its platform in 2023 if he joins the party.\nNational secretary of the APC caretaker committee, John Akpanudoedehe, said this in a chat with Channels TV on Wednesday amid speculations about the former president joining the ruling party.\n“I am hearing that for the first time that we are expecting the former President.\n“The last National Executive Council (NEC) of the party actually gave blanket approval to any individual that if you join APC today, it is as if you are a founding member of the party.\n“So, anyone who joins today has the same opportunity to run for any office in this party."
  },
  {
    "headline": "Tunji Bello’s spouse, Ibiyemi Bello emerges Vice Chancellor of Lagos State University",
    "summarized_story": "Wife of Tunji Bello, Lagos State commissioner for environment, Professor Ibiyemi Olatunji-Bello has been appointed as the 9th substantive Vice-Chancellor of the Lagos State University (LASU).\nThe new vice-chancellor emerged after several disruptions in the process of appointing the successor of Professor Lanre Fagbohun, the former vice-chancellor, whose tenure ended nine months ago.\nAmid the crisis, Sanwo-Olu dissolved the governing council of the institution and reconstituted the VC selection panel.\nGbenga Omotoso, the state Commissioner for Information, in a statement on Thursday, said Olatunji-Bello was appointed following recommendation by the Joint Committee of Council and Senate of LASU in accordance with the LASU Law, Cap 169 Vol 7, Laws of Lagos State.\n“A member of the National Institute (mni), Mrs. Olatunji-Bello holds a Fellowship Award of the Physiological Society of Nigeria and was also appointed a Fellow of the Environmental Toxicology and Pollution Mitigation in the year 2019.”Olatunji-Bello as well as two other candidates, Professor Omotayo R. Awofolu and Professor Senapon Bakare, were recommended for the position in order of ranking respectively."
  },
  {
    "headline": "Nigeria’s public debt now N35.5trn – DMO",
    "summarized_story": "Nigeria’s public debt stock stood at N35.465 trillion as at June 30, Director-General of the Debt Management Office, DMO, Ms. Patience Oniha, disclosed yesterday.\nNigeria’s total public debt stock was N33.107 trillion or USD87.239 billion, as at March 31, 2021, Vanguard reported.\nA breakdown of the public debt figure under review indicated that that external debt was N13.711 trillion, representing 38.66 per cent.\nStates and the FCT’s external debt stood at N1.883 trillion, with a domestic debt stock of N4.122 trillion.\nShe said, “We are working towards recognizing it, getting the proper approvals to include it in the public debt stock."
  },
  {
    "headline": "Boko Haram reportedly kills many Nigerian soldiers in an ambush",
    "summarized_story": "A number of Nigerian soldiers have reportedly been killed by the Islamic State West Africa Province (ISWAP), a breakaway faction and Boko Haram formerly known as Jamā’at Ahl as-Sunnah lid-Da’wah wa’l-Jihād in an ambush in Borno State.\nThe attack took place in Monguno area of the state on Thursday, a report by Sahara Reporters said.\nMay their souls rest in peace,” a military source told the medium.\nThe source added that military vehicle, several weapons and ammunition were stolen during the attack.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in northeastern Nigeria."
  },
  {
    "headline": "JUST-IN: NAF Probes Alleged Killing Of Civilians By Fighter Jet In Yobe",
    "summarized_story": "The Nigerian Air Force (NAF) has constituted a Board of Inquiry to unravel the circumstances surrounding the alleged killing of civilians by a NAF fighter jet in Yobe State.\nThe director of public relations and information, NAF, Air Cdre Edward Gabkwet, in a statement said the Service has received reports that it fighter jet deployed to attack Boko Haram Terrorists/Islamic State West Africa Province (ISWAP) erroneously killed civilians in Yobe State.\nADVERTISEMENT“Therefore a Board of Inquiry has been set up to thoroughly investigate the circumstances of the incident,” he said.\nAir Cdre Gabkwet said the aircraft while operating South of Kanama observed suspicious movement consistent with Boko Haram terrorists behaviour whenever a Jet aircraft is overhead.\nHe noted that the area is well known for continuous Boko Haram/ISWAP activities, adding that “Unfortunately reports reaching Nigerian Air Force (NAF) Headquarters alleged that some civilians were erroneously killed while others were injured.”"
  },
  {
    "headline": "Sanwo-Olu Approves Olatunji-Bello’s Appointment As LASU VC",
    "summarized_story": "Lagos State governor, Mr. Babajide Olusola-Sanwo-Olu, has approved the appointment of Professor Ibiyemi Olatunji-Bello as the 9th substantive Vice-Chancellor of the Lagos State University (LASU).\nProfessor Olatunji-Bello was appointed following the recommendation of the Joint Committee of Council and Senate of LASU in accordance with the LASU Law, Cap 169 Vol 7, Laws of Lagos State.\nProf. Olatunji-Bello as well as two other candidates, Professor Omotayo R. Awofolu and Professor Senapon Bakare, were recommended for the position in order of ranking respectively.\nThe process of selecting a substantive Vice-Chancellor for LASU commenced with advertisement for the vacant position in three national dailies on Friday, July 30 and Friday, August 13, 2021 respectively.\nThe tenure of the 8th substantive Vice-Chancellor of the University, Professor Olanrewaju Adigun Fagbohun, lapsed on January 11, 2021."
  },
  {
    "headline": "Guinea Coup: Osinbajo To Represent Nigeria At ECOWAS Meeting",
    "summarized_story": "President Muhammadu Buhari would be represented by his deputy, Vice President Yemi Osinbajo (SAN), at the 2nd Extraordinary Summit of the ECOWAS Authority of Heads of State and Government on the political situation in the Republic of Guinea this Thursday.\nProf. Osinbajo had participated last week at the previous ECOWAS Extraordinary Summit on the political situation in Guinea and Mali.\nAccording to a statement by his media aide, Laolu Akande, the Authority decided then that Guinea be immediately suspended from all ECOWAS governing bodies and statutory meetings.\nThe physical meeting taking place this Thursday will review the situation in Guinea in light of the report of the ECOWAS high-level mission to Conakry.\nThe Vice President who left Abuja Thursday morning would be accompanied by the Foreign Affairs Minister of State, Ambassador Zubairu Dada and is expected back in Abuja later on Thursday."
  },
  {
    "headline": "Buhari’s COVD 19 Response Creating Inclusive growth, Says APC Group",
    "summarized_story": "The administration of President Muhammadu Buhari has received commendation for its prompt response to move Nigeria out of the COVID-19 challenges.\nThe APC Legacy Awareness and Campaign, a voluntary think-tank group of the governing party, acknowledged what it described as the remarkably clear and firm response of the APC-led government of President Muhammadu Buhari to Covid-19 pandemic.\n“Approving the establishment of a 500 billion Naira COVID-19 Crisis Intervention Fund, dedicated to various programs ranging from health infrastructure upgrades to a national public works programme.\n“Another aspect of the CBN’s stimulus programme is the reduction in interest rates on CBN intervention facilities, from 9 percent per annum to 5 percent, from March 1, 2020 to February 28, 2022.\nIt further expressed confident that the administration’s economic efforts and initiatives will continue to yield fruit and translate into inclusive growth and prosperity for all Nigerians."
  },
  {
    "headline": "Comment on Buhari: I have no apologies – Umahi",
    "summarized_story": "Governor David Umahi of Ebonyi State says he has no apologies for describing President Muhammadu Buhari as a man with a good heart and father to him.\nUmahi said this on Wednesday while receiving the former Chairman of the Peoples Democratic Party, Alhaji Ali Modu Sheriff, at the Government House, Abakiliki.\nShariff was in the state to consult with the governor over his ambition to run for the National Chairmanship of the All Progressives Congress.\n“The president can say in the interest of the party, let another person be there, we will obey him,” Umahi said.\nIn a speech, Sheriff said he decided to inform Umahi of his decision to contest the APC national chairmanship because he is a “political Iroko” in the South-East."
  },
  {
    "headline": "Comment on Buhari: I have no apologies – Umahi",
    "summarized_story": "Governor David Umahi of Ebonyi State says he has no apologies for describing President Muhammadu Buhari as a man with a good heart and father to him.\nUmahi said this on Wednesday while receiving the former Chairman of the Peoples Democratic Party, Alhaji Ali Modu Sheriff, at the Government House, Abakiliki.\nShariff was in the state to consult with the governor over his ambition to run for the National Chairmanship of the All Progressives Congress.\n“The president can say in the interest of the party, let another person be there, we will obey him,” Umahi said.\nIn a speech, Sheriff said he decided to inform Umahi of his decision to contest the APC national chairmanship because he is a “political Iroko” in the South-East."
  },
  {
    "headline": "Kanu’s detention: South-East National Assembly caucus raises panel",
    "summarized_story": "THE South-East caucus in the National Assembly has set up a committee to work out modalities of setting the Leader of the Indigenous Peoples of Biafra, Nnamdi Kanu, free from detention.\nThis is contained in the communique issued at the end of an extraordinary meeting of the caucus held at the residence of the former Deputy President of the Senate, Ike Ekweremadu, on Wednesday.\nWe will keep Ndigbo abreast of developments in that regard.\n“We appeal to our people not to allow anyone to destroy the South- East region.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Kanu’s detention: South-East National Assembly caucus raises panel",
    "summarized_story": "THE South-East caucus in the National Assembly has set up a committee to work out modalities of setting the Leader of the Indigenous Peoples of Biafra, Nnamdi Kanu, free from detention.\nThis is contained in the communique issued at the end of an extraordinary meeting of the caucus held at the residence of the former Deputy President of the Senate, Ike Ekweremadu, on Wednesday.\nWe will keep Ndigbo abreast of developments in that regard.\n“We appeal to our people not to allow anyone to destroy the South- East region.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Drags Kenyan Government To Court Over Rearrest",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB, has filed a lawsuit against Kenya’s government.\nKanu and his legal team filed a lawsuit against the Kenyan government.\nAloy Ejimakor, the Special Counsel to IPOB leader, announced this on his Twitter account on Thursday.\n“UPDATE: Extraordinary Rendition: Onyendu’s legal team has filed a suit in Kenya against the Kenyan government,” Ejimakor wrote.\nThe assertion that Kenyan police detained Kanu was disputed by Kenyan High Commissioner Wilfred Machage."
  },
  {
    "headline": "BREAKING: Kano Controversial Sheikh, Abduljabar’s Lawyers Withdraw Their Services",
    "summarized_story": "The legal team defending Kano’s notorious sheikh, Abduljabar Nasiru Kabara, who is accused of making blasphemous statements against the Prophet of Islam, has abruptly withdrew their services.\nIt will be recalled that the case’s presiding judge, Justice Sarki Yola, had ordered the sheikh’s health to be checked after he refused to answer a series of questions posed to him in court at the previous sitting.\nSheikh Abduljabar refused to speak after the government’s main attorney, Suraj Said, submitted new allegations against him, causing a misunderstanding between the defendant’s lawyers and the government’s lawyers.\nHowever, the presiding judge, Sarki Yola, consented to allow the new allegations brought by the Kano State Government’s lawyers to be included in the case, but only if the accused, Sheikh Abduljabar, answers affirmatively or rejects the charges.\nSheikh Abduljabar’s lawyers protested to the new charges and urged him not to respond to anything said against him, which caused him to remain silent when the presiding judge questioned him if he was guilty or not."
  },
  {
    "headline": "BREAKING: EFCC Chairman, Abdulrasheed Bawa, Slumps At Aso Rock",
    "summarized_story": "Abdulrasheed Bawa, Chairman of Economic and Financial Crimes Commission (EFCC) was rushed out of the Presidential Villa, Abuja, on Thursday, after he slumped at a programme.\nMr. Bawa was delivering a goodwill message at the National Identity Day celebration when he suddenly stopped speaking, staggered back to his seat, and laid down.\nProfessor Isa Pantami and other dignitaries held him, after some time, he was guided out of Nigeria’s seat of power.\nBawa, aged 40, holds a B.Sc degree in Economics, and Masters in International Affairs and Diplomacy was Head of Operations of the Commission’s Lagos office before emerging as EFCC chairman.\nHe replaced Ibrahim Magu as chairman of the anti-graft agency."
  },
  {
    "headline": "BREAKING: Lagos Environment Commissioner’s Wife, Prof. Ibiyemi Bello New LASU VC",
    "summarized_story": "Professor Ibiyemi Olatunji-Bello has been named Vice-Chancellor of Lagos State University (LASU).\nAfter months of deliberation, Ibiyemi has been named the ninth VC at LASU.\nUntil now, LASU’s acting VC was Ibiyemi, a professor of medicine.\nShe went to Anglican Girl Grammar School in Surulere from 1974 to 1979, Methodist Girls High School in Yaba, and Lagos College of Science and Technology.\nIbiyemi was an Assistant Lecturer at the University of Lagos’ College of Medicine in Idi-Araba; Lecturer in 1988; Lecturer 11 in 1991; Lecturer 1 in 1996; Senior Lecturer in 1999."
  },
  {
    "headline": "Breaking: LASU gets substantive female VC",
    "summarized_story": "The Lagos State University (LASU) now has a new substantive female Vice Chancellor.\nShe is Prof (Mrs) Ibiyemi Olatunji-Bello.\nThe new school head is a Professor of Physiology who had served as acting Vice Chancellor of the institution before her elevation.\nDetails loading…"
  },
  {
    "headline": "(PICTURES) Happening now: 3 injured as car crashes around popular NICON junction in Abuja",
    "summarized_story": "Three women are in critical conditions after an ash colour Toyota Matrix vehicle crashed at the popular NICON junction Maitama on Thursday morning.\nThe vehicle with plate number BWR 409 BC, according to an eyewitness, summersaulted when its driver tried to manoeuvre some wrongly-packed cars along the expressway.\nHe said it took the intervention of officials of the Federal Road Safety Corps (FRSC) who immediately rescued and evacuated the driver alongside other victims to a nearby hospital.\nFRSC authorities were yet to speak on the incident as at the time of filling this report."
  },
  {
    "headline": "Npower batch C employment: What you need to know about payment",
    "summarized_story": "As N-Power Batch C physical verification ends on the September 24, 2021, beneficiaries of the scheme to receive their monthly stipend after successfully being verified.\nAn official in Sokoto south local government who spoke to our correspondent on condition of anonymity said, “The payment will commence as soon as Nigerian Inter Bank Settlement Scheme (NIBSS) completely validates the BVN of Npower Batch C Beneficiaries after physical verification.”He said: “The Npower Non Graduate category will receive devices to harness their skill set, but the Npower Graduate Category will not be given devices this time around.\n“Those who may not be paid when payment commences are those whom their BVN was not validated by Nigerian Inter Bank Settlement Scheme probably due to names mismatch.”He disclosed that all N-Power Graduate category will last for 12 months.\n“Npower Batch C Volunteers under this category will earn a monthly stipend of ₦30,000 while the non graduate Npower category will run for an average period of 9 months and N-Power Batch C Volunteers under this category will earn a stipend of ₦10,000.”the source said.\nAll N-Power Batch C categories are advised to keep checking their NASIMS portal for updates."
  },
  {
    "headline": "GX gallery series OLED TV feels completely natural – Ahn -NigPilot",
    "summarized_story": "Home Entertainment, TV Division Product Manager, LG Electronics West Africa Division, Mr. Mike Ahn has described it GX Gallery series OLED TV as completely natural making daily life better through technological innovation and design.\n“Like all great designs, the design of the GX Gallery series feels completely natural and entirely unforced”.\n“Introducing LG GX Gallery series OLED TV, available in 65- and 77-inch screen sizes, LG’s GX Gallery series TVs deliver everything that was cutting-edge about the wallpaper TV without the need for a separate soundbar to house all the electronics.\nA triumph of human-centered industrial design, the GX Gallery lineup would not look out of place in an art gallery exhibit, displayed as a series of understated, ultra-modern sculptures.\nFeatured in the OLED Gallery Series is the α (Alpha) 9 Gen 3 AI Processor."
  },
  {
    "headline": "COAS vows to hold Commanders responsible for security bridge on facilities -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS), Lt Gen Faruk Yahaya on Wednesday in Abuja vowed that he will henceforth hold Commanders at all levels responsible for attacks on military facilities including bases, barracks and Cantonments.\n“I want to remind Formation and Unit Commanders on the need to ensure adequate security of their bases, h barracks, and cantonment.\nCommanders would be held responsible for any security breach.\nThe COAS added, “in the conduct of our operations, Commanders must ensure that their troops maintain a state of constant alertness and vigilance at all times to avoid any surprise attack by the adversary.\nI assure Nigerians that in days ahead, there shall be more visible signs of improved security across the country."
  },
  {
    "headline": "CAS receives interim report in air mishap that killed COAS, ten others -NigPilot",
    "summarized_story": "The Chief of Air Staff (CAS), Air Marshal Oladayo Amao on Wednesday received the interim reports of the joint investigation into the remote and immediate cause of the air mishap that involved Nigerian Air Force (NAF) King Air -350 which killed all passengers and crew members on board including the former Chief of Army Staff COAS Lt Gen Ibrahim Attahiru and ten other top military brass.\nWhile receiving the report, the Chief of the Air Staff (CAS) Air Marshal Oladayo Amao reiterated the main essence of activating the ‘joint investigative’ clause contained in the Memorandum of Understanding (MOU) signed between the NAF and the AIB on 1 July, 2020.\nHe also noted that copies of the report, with the endorsement of the CAS, will also be submitted to the Hon.\nMinister of Aviation and Nigerian Civil Aviation Authority (NCAA) to ensure that the recommendations addressed to aviation agencies are implemented.\nHe added that the involvement of AIB in the investigation by the Nigerian Air Force would help in closing the gaps on the civil aviation side."
  },
  {
    "headline": "NAF refutes alleged killing of civilians in Yobe -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF), on Wednesday, denied the trending reports that its fighters jet mistakingly bombed a wrong location killing many civilians at Buhari village in Yobe State, Northeast Nigeria.\nResponding to the trending report, the Director of Public Relations and Information Nigerian Air Force, Air Commodore Edward Gabkwet in a one paragraph statement dismissed the report as false.\nThe NAF last conducted a mission into Yobe State (Not Yunusari LGA) on 5 September 2021 and it was an armed recce.\nRecall that a similar event happened in 2017 when the Nigerian Air Force mistakenly bombed an Internal Displaced Persons’ camp in Rann, Borno State”.\n“This area is in the northern part of Yobe, close to BH/ISWAP’s area of operation, so it is possible that the jets were on anti-BH operation."
  },
  {
    "headline": "Okonjo-Iweala, Biden Listed Among Time’s 100 Most Influential People",
    "summarized_story": "The Director-General of the World Trade Organization (WTO), Ngozi Okonjo-Iweala, has been named in Time Magazine’s 100 Most Influential People for 2021.\nOkonjo-Iweala made the list – released on Wednesday – alongside US President Joe Biden, Angelique Kidjo, and the Duke and Duchess of Sussex, Prince Harry and Meghan.\nThe list recognises “people whose ideas, example, talent, or discoveries transform the world we live in”.\nShe was named in the leaders category alongside US Vice President, Kamala Harris; Chinese President, Xi Jinping, and India’s Prime Minister, Narendra Modi.\nOthers who also made Time’s list include Naomi Osaka, Britney Spears, Donald Trump, and Elon Musk."
  },
  {
    "headline": "BREAKING: EFCC Chairman Abdulrasheed Bawa Slumps In Abuja",
    "summarized_story": "Chairman of the Economic and Financial Crimes Commission (EFCC), Abdulrasheed Bawa, on Thursday slumped at a programme at the Presidential Villa, Abuja.\nBawa was giving his goodwill message at the National Identity Day celebration when he suddenly stopped speaking.\nMore to follow…"
  },
  {
    "headline": "Air Force Makes U-Turn, To Investigate ‘Bombardment’ Of Yobe Community",
    "summarized_story": "The Nigerian Air Force (NAF) says it has commenced an investigation into the ‘bombing’ of a community in Yobe State.\nInitial reports on Wednesday suggested that a NAF fighter jet had carried out the bombing which reportedly left several persons killed and many more injured.\nThe Air Force had earlier denied any involvement in the incident but in a brief statement on Thursday, the force spokesman, Air Commodore Edward Gabkwet said a proper investigation is ongoing.\nThe Air Force spokesman emphasized that the area is well known for continuous Boko Haram /ISWAP activities.\nIn July 2019, at least 13 civilians were killed when a Nigerian fighter jet hit Gajiganna village, as it targeted fleeing jihadists who had attacked a nearby base."
  },
  {
    "headline": "‘We Are Not Unmindful Of The Anxiety:’ FG Promises To Restore Twitter",
    "summarized_story": "﻿The Federal Government has again pledged to restore Twitter services in the country, hundred days after the tech giant was banned in Nigeria.\nHe said that the government is working hard to restore Twitter’s operations in Nigeria.\nAs to how soon is soon, if the operation has been successful for hundred days now, we are just talking about a few more days.\nThe country joins nations like North Korea, China, and Iran in halting operations of the social media platform.\nIn spite of the development, many in the country have devised means to sidestep the ban including the use of Virtual Private Networks (VPNs)."
  },
  {
    "headline": "Security Agencies Winning The War Against Banditry – IGP",
    "summarized_story": "﻿The Inspector-General of Police (IGP), Usman Alkali Baba, says Nigeria’s security agencies are making headway in the fight against banditry.\n“All other security agencies, in synergy, are fighting the bandits, including the military, which is leading the war and we’re winning.”According to the IGP, President Muhammadu Buhari has given approval for the recruitment of more police officers to boost the fight against crime in the country.\n“So, we are expecting to increase our strength by 20,000, latest by the end of 2022,” he added.\nWhile assuring the police operatives that their welfare will be taken care of, the IGP called on them to be dedicated to duty and show professionalism.\n“I am here to tell you that there is no problem about the Nigerian police that I don’t know about."
  },
  {
    "headline": "17 Southern governors meet again in Enugu",
    "summarized_story": "The Southern Governors Meeting scheduled to hold in Enugu has commenced with eight Governors, eight deputies, in attendance.\nThe first and second meetings of the governors were held in Asaba, Delta State and Lagos State respectively.\nLagos state governor Babajide Sanwo-Olu, Ondo State Governor, Rotimi Akeredolu, Rivers state Governor, Nyesom Wike, Osun state Governor Adegboyega Oyetola, Delta State Governor Ifeanyi Okowa and their Bayelsa state counterpart, Doye Diri are present at the meeting.\nAlso the governor of Ogun state Dapo Abiodun and the Akwa Ibom state counterpart, Emmanuel Udom are physically present.\nMeanwhile, the Governor of Ekiti State, Kayode Fayemi and his Oyo state counterpart, Seyi Makinde are presented by their deputies – Otunba Bisi Egbeyemi and Rauf Olaniyan respectively."
  },
  {
    "headline": "Gbajabiamila denies comparing IPOB, Yoruba Nation Agitators with ISWAP, Boko Haram -",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila has denied comparing the Indigenous People of Biafra, Yoruba Nation Agitators with ISWAP and Boko Haram terrorists.\nSpeaker Gbajabiamila made the clarification at the opening of the day’s plenary.\nHe said his comments were misquoted.\nMeanwhile, the house of Representatives has urged the federal government to comply with the principle of federal character in appointment of Federal Character Commission Chairman, Secretary.\nAlso, House of Representatives is seeking mining companies’ compliance with environmental obligationsIn a different development, House of Representatives member, Chisom Dike from Rivers state has defected from the People’s Democratic Party ti the All Progressives Congress."
  },
  {
    "headline": "IGP visits Niger, urges parents to allow their wards to join Police",
    "summarized_story": "The Inspector General of Police, Usman Alkali Baba is currently in Niger state as part of his familiarisation tour of state police commands and formations across the country to intimate them on his vision for the force under his leadership.\nThe IGP acknowledged the level of insecurity that has bedeviled the state over time noting that the narrative has fairly changed but still has room for improvementHe disclosed that the police force has the mandate of recruiting 10,000 men every year and parents should encourage their children to join the service.\nHe added that the prospective candidates will be recruited from the 774 local government areas in the country and posted back to their LGAs to serve.\nThe IGP acknowledged the peculiarity of the state when it comes to crime and prevention, adding that the narrative has fairly changed but can still be improved.\nHe said their welfare will be taken care of and improved, adding that adequate logistics and equipment will be supplied."
  },
  {
    "headline": "Prof. Ibiyemi Olatunji-Bello appointed as LASU Vice Chancellor -",
    "summarized_story": "A Professor of Medicine, Ibiyemi Olatunji-Bello has been appointed the new Vice Chancellor of the Lagos State University.\nProfessor Ibiyemi is the wife of Lagos State Commissioner for the Environment, Tunji Bello.\nShe becomes the ninth Vice Chancellor of LASU after a rigorous exercise laced with intrigues and suspense.\nProfessor Olatunji-Bello had served as Acting Vice Chancellor of the institution before her elevation."
  },
  {
    "headline": "French Forces Kill Islamic State Leader in Sahara",
    "summarized_story": "The head of the Islamic State group in the Sahara has been killed by French troops, President Emmanuel Macron has said.\nAdnan Abu Walid al-Sahrawi formed Islamic State in the Greater Sahara (ISGS) in 2015.\nThe group is blamed for most attacks in the region, including the targeted killing of French aid workers in 2020.\nLast August, Sahrawi personally ordered the killing of six French charity workers and their Nigerien guides and drivers, the French presidency said.\nIn June, Mr Macron announced that Operation Barkhane would end in its current form, and that French troops would be cut in the region over the course of several years."
  },
  {
    "headline": "Attacks on Eritrean Refugees in Tigray ‘Clear War Crimes’",
    "summarized_story": "Eritrean soldiers and Tigrayan militias raped, detained and killed Eritrean refugees in Ethiopia’s northern region of Tigray in attacks that amounted to “clear war crimes”, an international rights watchdog has said.\nTens of thousands of Eritrean refugees live in Tigray, a mountainous and poor province of about five million people.\n“The horrific killings, rapes, and looting against Eritrean refugees in Tigray are clear war crimes,” said Laetitia Bader, the Horn of Africa director at Human Rights Watch (HRW), whose work drew on interviews with 28 refugees and other sources, including satellite imagery.\nPrior to the Tigray conflict, Ethiopia hosted around 150,000 Eritrean refugees, fleeing poverty and an authoritarian government.\nTigrayan forces marched fleeing refugees back to Hitsats, shooting some stragglers, refugees reported to HRW."
  },
  {
    "headline": "Simone Biles Blames System That ‘Enabled Larry Nassar Abuse’",
    "summarized_story": "Elite US gymnast Simone Biles has testified before the Senate about abuse she suffered at the hands of disgraced former team doctor, Larry Nassar.\n“I blame Larry Nasser, and I also blame an entire system that enabled and perpetrated [sic] his abuse,” said Ms Biles, the most decorated Olympic gymnast of all-time.\nGymnast Maggie Nichols – the first victim to report her abuse to USA Gymnastics – also testified.\nFour-time Olympic gold medallist Simone Biles – one of the most famous figures in world sports – called for the agents involved to be federally prosecuted.\nIn total, Nassar was accused of sexual abuse by more than 330 women and girls at USA Gymnastics and Michigan State University."
  },
  {
    "headline": "US Donates $6.8m to Combat Human Trafficking in Nigeria",
    "summarized_story": "The United States has donated $6.8 million for projects to combat trafficking in persons in Nigeria.\nA statement by the US Embassy in Nigeria on Wednesday, explained that the INL donation would fund UNODC to train the Nigeria Correctional Service in the north-eastern states of Borno, Gombe, and Adamawa.\nThe project also aims to improve the capacity of local courts and prosecutors by increasing transparency and adherence to due process for cases related to the activities of Boko Haram and ISIS-West Africa.\nThe statement noted that the United States values its relationship with Nigeria and, through her partnership with the UNODC, provides support to its work combatting drugs, crime, and corruption, and building the capacity of the Nigerian National Agency for the Prohibition of Trafficking in Persons (NAPTIP).\nIt further revealed that the INL funds were made possible through appropriations made by Congress to the U.S. Department of State to support efforts in the fight against organised crime and drug trafficking worldwide."
  },
  {
    "headline": "Prince Harry and Meghan Write on Okonjo-Iweala for TIME 100",
    "summarized_story": "TIME Magazine has named the Director General of the World Trade Organisation (WTO), Dr. Ngozi Okonjo-Iweala, in its 2021 TIME100, the annual list of the 100 most influential people in the world.\nPrince Harry and Meghan in an article on the selection of Okonjo-Iweala hailed the WTO boss, especially in her efforts to ensure vaccine equity.\nUnity, cooperation—and leaders like Ngozi Okonjo-Iweala,” wrote Prince Harry and Meghan wrote.\nPrince Harry and Meghan pointed out that their, “conversations with her have been as informative as they are energising.\nAs finance minister, Okonjo-Iweala steered Nigeria through the varying degree of reforms, particularly on macroeconomic, trade, financial and real sector issues."
  }
]