[
  {
    "headline": "Living with lupus exhausting, frustrating –Sad tales of women managing incurable autoimmune disease",
    "summarized_story": "No one in her family, including her parents, could figure out what the severe joint pain was all about.\nAccording to experts, lupus is a systemic autoimmune disease that occurs when the body’s immune system attacks its tissues and organs.\nThey also described lupus as a disease with 1000 faces because it has an extremely variable course.\nSharing her ordeal with PUNCH HealthWise, Deborah said, “It started in 2018 with mostly joint pain and then swelling in my fingers; then it led to weakness and loss of appetite.\nI had joint pain, neck pain, and shoulder pain."
  },
  {
    "headline": "Living with lupus exhausting, frustrating –Sad tales of women managing incurable autoimmune disease",
    "summarized_story": "No one in her family, including her parents, could figure out what the severe joint pain was all about.\nAccording to experts, lupus is a systemic autoimmune disease that occurs when the body’s immune system attacks its tissues and organs.\nThey also described lupus as a disease with 1000 faces because it has an extremely variable course.\nSharing her ordeal with PUNCH HealthWise, Deborah said, “It started in 2018 with mostly joint pain and then swelling in my fingers; then it led to weakness and loss of appetite.\nI had joint pain, neck pain, and shoulder pain."
  },
  {
    "headline": "7,625 new COVID-19 deaths, 367,152 new cases recorded globally",
    "summarized_story": "On Saturday, 7,625 new deaths and 367,152 new cases were recorded worldwide.\nThe United States is the worst-affected country with 603,891 deaths from 33,621,535 cases.\nAfter the US, the hardest-hit countries are Brazil with 512,735 deaths from 18,386,894 cases, India with 395,751 deaths from 30,233,183 cases, Mexico with 232,521 deaths from 2,503,408 cases, and Peru with 191,584 deaths from 2,046,057 cases.\nLatin America and the Caribbean overall has 1,262,881 deaths from 37,013,839 cases, Europe 1,164,979 deaths from 54,270,675 infections, and the United States and Canada 630,105 deaths from 35,034,303 cases.\nAsia has reported 570,707 deaths from 39,754,920 cases, the Middle East 149,367 deaths from 9,210,666 cases, Africa 140,638 deaths from 5,387,784 cases, and Oceania 1,124 deaths from 53,289 cases."
  },
  {
    "headline": "7,625 new COVID-19 deaths, 367,152 new cases recorded globally",
    "summarized_story": "On Saturday, 7,625 new deaths and 367,152 new cases were recorded worldwide.\nThe United States is the worst-affected country with 603,891 deaths from 33,621,535 cases.\nAfter the US, the hardest-hit countries are Brazil with 512,735 deaths from 18,386,894 cases, India with 395,751 deaths from 30,233,183 cases, Mexico with 232,521 deaths from 2,503,408 cases, and Peru with 191,584 deaths from 2,046,057 cases.\nLatin America and the Caribbean overall has 1,262,881 deaths from 37,013,839 cases, Europe 1,164,979 deaths from 54,270,675 infections, and the United States and Canada 630,105 deaths from 35,034,303 cases.\nAsia has reported 570,707 deaths from 39,754,920 cases, the Middle East 149,367 deaths from 9,210,666 cases, Africa 140,638 deaths from 5,387,784 cases, and Oceania 1,124 deaths from 53,289 cases."
  },
  {
    "headline": "Jitters as N/Delta Avengers returns, threatens hostilities",
    "summarized_story": "We have people in the Niger Delta now who have become laptop militants.\nWe visited Mr. President on November 1, 2016 and presented to a 16-point demand that cuts across critical issues across the Niger Delta.\n“The Acting President, at that time, made very far-reaching pronouncements, including relocation of International Oil Companies (IOCs) headquarters to the Niger Delta.\n“We will want to align with the Niger Delta Avengers, the only language the Federal government understands is violence and agitation.\nWhen will the federal government be sincere to the plight of the Niger Delta people?"
  },
  {
    "headline": "Ataga’s Murder: Go beyond Chidinma’s arrest — Family urges Police",
    "summarized_story": "The family of late Michael Usifo Ataga has issued a statement calling for an in-depth investigation of the murder of Usifo Ataga and urged the police to go beyond the arrest of the suspect to get to the root of the case.\nYes, we know that Chidinma Adaora Ojukwu has been arrested and yes we know that investigation is continuing.\nOur client is however convinced that there is much more to this than is already apparent from the police investigation,” Jolaawo said in the statement.\n“Our client at this juncture requests that the well-meaning public allow the family to mourn their departed son, father and husband with some privacy and decency.\nThe family will not be intimidated by these bloggers’ activities and insist that the police be allowed to do their work,” Jolaawo said in the statement."
  },
  {
    "headline": "- EXCLUSIVE: Who will speak for Usifo Ataga?",
    "summarized_story": "All parties involved in this ugly incident have now spoken, barring Usifo Ataga, who is no more.\nWho will speak for Usifo Ataga?\nShe claims that Usifo Ataga tried to rape her.\nWas this done before or after Usifo Ataga had been killed?\nOne person, however strong could not have tied and gagged Usifo Ataga and then carried out all that was done, talkless of this woman."
  },
  {
    "headline": "Nigeria's strength lies in citizens' collective unity",
    "summarized_story": "Delta Governor Dr. Ifeanyi Okowa, has urged Nigerians not to compromise the country’s unity as its strength lay in citizens’ collective bond.\nHe said that the country was facing serious challenges that required leaders to preach hope to the people and ensure that the unity of the nation was not breached.\n“We are one people in this country and I believe that the strength of Nigeria lies in our collective responsibility because in that truly lies our strength.\nAbubakar Suleiman, commended Governor Okowa for his passion in the development of Delta.\nSheriff Oborevwori, thanked Governor Okowa for agreeing to host the conference."
  },
  {
    "headline": "Feels good having one of the biggest bums in Nollywood – Didi Ekanem",
    "summarized_story": "But belying her secret wish is the smugness that lights up her face when she gets compliments over Mother Nature’s gift.\n“It’s a good feeling and a wonderful one,” she had beamed when asked how she feels having one of the biggest bums in Nollywood.\nBut my bum is not allowing people to see me deep down, to see the person and the talent,” she quickly added.\nMy bum is real, it’s like 101% real, I was born this way, I was born like this.\nI’ve had it since I was in JS1, in fact that was when I started noticing it."
  },
  {
    "headline": "FG threatens churches, mosques over noise making",
    "summarized_story": "The National Environmental Standards and Regulations Enforcement Agency (NESREA) has threatened to prosecute worship centres for noise pollution.\nNESREA said it’s empowered to prosecute churches and mosques for using loud speakers without control.\nHe said: “Once they are subjected to the noise, it leads to a lot of health problems ranging from hypertension and other diseases.\nWe receive complaints from a lot of people.\n“For instance, places like churches, mosques, even industries are causing a lot of noise which we receive complaints from people, so we do visit such areas, sensitising them about the problem people are facing.”"
  },
  {
    "headline": "FG speaks on banning importation of gas cylinders",
    "summarized_story": "The Federal Government has said that it has no immediate plan to ban the importation of gas cylinders into the country as part of its LPG expansion and implementation plan.\nOgun explosion: Arrest, prosecute suppliers of fake gas, cylinders – NANS tells govtHe explained that Nigeria still has a lot of cylinder deficits to fill in meeting the LPG expansion plan.\nAccording to him, for the nation’s over 200 million population, there were only about two million gas cylinders, which he said, was poor compared to other countries.\n“But Nigeria, with over 200 million people, has less than two million cylinders.\n13 injured, 25 cars destroyed as LPG tanker explodes in Lagos“Banning importation is not going to solve the problem."
  },
  {
    "headline": "BREAKING: Jubilation in Delta as police gun down notorious armed robber, Fowlboy",
    "summarized_story": "There was jubilation in Delta State as a combined team of policemen and vigilantes in the Sapele area of the state gunned down a notorious armed robbery suspect, Diamond ‘m’ (surname unknown) a.k.a FOWLBOY, who had been terrorizing residents of the area and its environs.\nThe police also recovered one cut-to-size locally-made gun, a military camouflage sweater and seven different phones from the suspect.\nThe police were informed as they promptly mobilized to the scene, where the armed robbers engaged them in a heavy gun fight.\nIn the process, the police shot and injured the notorious armed robber who was rushed to the hospital where he was confirmed dead by the doctor on duty.\nThe Delta State Police Command, led by CP Ari Muhammed Ali, confirmed the report in a statement signed by the Acting Police Public Relations Officer, DSP Bright Edafe."
  },
  {
    "headline": "LG election: Security personnel, election officials held hostage in Jigawa",
    "summarized_story": "Voters have kept hostage security personnel and election officials at Kiyako ward in Birnin Kudu Local Government Area of Jigawa State.\nAlso five police officers and seven vigilante members were also kept hostage at the premises of the ward collation center.\n2023: INEC to resume voter registration“As a result, members of the party converged and kept the election officials hostage until what they had voted for was declared.\nA resident of Kiyako, who gave his name as Adamu, told DAILY POST that the election officials were kept hostage in a classroom since Saturday around 4:00PM and they will not release them until the election results are announced.\nKiyako ward is a political ward of ex-governor, Alh Sule Lamido."
  },
  {
    "headline": "Go beyond Chidinma’s arrest in Usifo Ataga’s murder – Family tells police",
    "summarized_story": "The family of late Michael Usifo Ataga has issued a statement calling for an in-depth investigation of the murder of the Chief Executive Officer of Super TV.\nThe family also urged the police to go beyond the arrest of the suspect, Chidinma Ojukwu, to get to the bottom of the case.\nYes we know that Chidinma Adaora Ojukwu has been arrested and yes we know that investigation is continuing.\n“Our client at this juncture requests that the well-meaning public allow the family to mourn their departed son, father and husband with some privacy and decency.\nWhile confessing to the crime, the suspect had claimed that she stabbed the deceased after he forcefully had sex with her."
  },
  {
    "headline": "FG expects equitable outcomes on WTO’s fisheries negotiations, says trade minister",
    "summarized_story": "Agency ReporterThe Federal Government says it will continue to engage in fisheries subsidies negotiations, in order to achieve balanced and equitable outcomes from the forthcoming WTO’s 12th Ministerial Conference (MC-12) on fisheries subsidies.\nOtunba Adeniyi Adebayo, Minister of Industry, Trade and Investment, said this at a virtual meeting of the African, Caribbean and Pacific (ACP) Ministers of Trade on Fisheries Subsidies Negotiations.\nThe minister noted that the sustainable development of the fisheries sector was central to Nigeria’s quest for economic diversification and sustained growth.\nAccording to the minister, it is of critical fundamental importance that the outcomes of the MC-12 are consistent with the Sustainable Development Goal (SDG) 14.6 and our mandate.\nAdebayo thanked Dr Ngozi Okonjo-Iweala, Director-General, World Trade Organisation (WTO), and the Chair of the Fisheries Subsidies Negotiations, Amb."
  },
  {
    "headline": "Osun 2022: Lead actors commence mobilisation",
    "summarized_story": "INEC has fixed date for the conduct of the 2022 governorship election in the state for July 16, 2022.\nAccording to the commission, “The tenure of the Governor of Osun State will expire on the 26th November 2022.\nBattle of the Lords kicks offIn the opposition Peoples Democratic Party (PDP) in Osun State, the battle of the political lords has already become a public issue.\nHe said that “desperate attempts at blowing off Ogunbiyi’s candle would not brighten Ademola Adeleke’s chances in the 2022 governorship election.\nNotwithstanding the intrigues already playing out amongst the top political leaders, some possible aspirants, aside Adeleke and Ogunbiyi have been mentioned in the media."
  },
  {
    "headline": "Protest rocks Plateau APC over imposition of candidates without primaries",
    "summarized_story": "By Kolade Adeyemi, JosFour All Progressive Congress (APC) aspirants in Quan Pan Local Government in the forthcoming local government elections in Plateau State have protested against the imposition of candidates without primaries.\nThe aspirants with their supporters besieged the party secretariat in Doemark to express their grievances.\nIt would be recalled that the APC held its primaries across the 17 local governments on Wednesday.\nAccording to her, the purported names of candidates allegedly submitted to the party executives were not the mandate of APC in Quan’pan.\n“We were told to converge at the party secretariat in Doemark for the party primaries, but the people didn’t come."
  },
  {
    "headline": "Restructuring: Niger Delta leaders give FG 90-day ultimatum",
    "summarized_story": "The communique was read by prominent Niger Delta activist and President of Agape Birthrights Development Initiative, Ms. Ann Kio-Brigss.\n“At the expiration of this three months window, we the people of the Niger Delta will commence the process that will guarantee our freedom and progress.\n“We the people of the Niger Delta hereby reaffirm their commonality, unity and oneness despite our multi-ethnic diversities.\n“We the people of the Niger Delta demand restructuring, with the states as the federating units and devolution of more powers to the states.\nThe Niger Delta People demand their enjoyment of the right to own and bear arms for self defence as law-abiding citizens."
  },
  {
    "headline": "Andy Uba hails Anambra APC on successful primary",
    "summarized_story": "From Magnus Eze, EnuguThe Senator Andy Uba Campaign Organization has congratulated members of the All Progressives Congress (APC) in Anambra State for a successful governorship primary held across the 21 LGAs despite initial logistical issues.\nDirector-General of the campaign organization, Chief Paul Chukwuma in a statement in Awka, praised the doggedness of APC members who remained patient all through the process.\nChukwuma, also berated those aspirants that alleged irregularities in the primary election for raising false alarms.\nHe noted that all the aspirants were given everything they needed by the Primary Election Committee but some were angry that they could not hijack the whole process hence the resort to blackmail and cheap propaganda.\nThe statement called on well-meaning members of the APC to maintain confidence in the Gov."
  },
  {
    "headline": "I like smart, God-fearing men –Jemeriye Adeniji, singer",
    "summarized_story": "Adeniji, whose Ewa Global Initiative showcases the beauty of Africa, in this interview dwells on her kind of man, among other issues.\nWhat is the difference between being an artiste in the US and an artiste in Nigeria?\nIt is not about ‘man know man’ as it is here.\nI don’t want to knock anybody’s hustles because I don’t know what works for you.\nI like a God-fearing man, a man who appreciates and feels confident in his own woman and also in himself."
  },
  {
    "headline": "Anambra guber: How Valentine Ozigbo emerged PDP’s candidate",
    "summarized_story": "From Obinna Odogwu, AwkaFormer Chief Executive Officer of TRANSCORP Plc, Valentine Ozigbo, has emerged the winner of the primary election of the Peoples Democratic Party (PDP) held at Prof. Dora Akunyili Women’s Development Centre, Awka.\nOzigbo secured 62 votes to defeat his closest rival, Dr Obiora Okonkwo, who got 58 votes in the keenly contested election conducted by an electoral committee set up by the national leadership of the party.\nMeanwhile, a factional group in the party led by Chukwudi Umeaba elected Senator Ugochukwu Uba as its standard bearer for the governorship election slated for November 6 this year.\nTheir returning officer, Chief Obidi Ebede, said that Uba got 275 votes to defeat his closest rival, Godwin Ezeemo, who got 114 votes.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Agitations: Nigeria’s break up real –Prophet Olagunju",
    "summarized_story": "By Olakunle OlafioyeThe division among Yoruba leaders over the quest for the independence of Yoruba nation will not affect the realization of the agenda.\nConsidering the agitations by the Yoruba and the Igbo, would you say this has a link to your prophecy?\nProf Banji Akintoye and Pa Ayo Adebanjo who are believed to be the leaders of the Yoruba are not on the same page as far as the agenda for an independent Yoruba nation is concerned.\nDon’t you think this will create confusion which will may make the realization of the Yoruba agenda a tall dream?\nIf Tinubu is truly a Yoruba leader which he claimed to be, he should always be found allying with the Yoruba agenda."
  },
  {
    "headline": "Asaba Accord: Southern governors are broken records –Senator",
    "summarized_story": "In this interview, he indicted state governors for not doing enough to police their domains.\nHe spoke on other national issues: What do you make out of this current situation in the country?\nThere are people from every part of this country in the National Assembly and also in the executive.\nBefore the Asaba Accord, there was a meeting of all the state governors.\nLess than a week of that meeting, some people came out and claimed Southern Governors Forum."
  },
  {
    "headline": "Buhari: Drug Trafficking, Abuse Pose More Threat than Insurgency, Banditry",
    "summarized_story": "•Says drug abuse already stretches across three generationsDeji Elumoye in Abuja and Laleye Dipo in MinnaPresident Muhammadu Buhari, yesterday, identified drug trafficking and abuse as more threatening to the stability of the nation than banditry and insurgency that are prevalent in some parts of Nigeria.\nThe enormity of the danger of drug abuse calls for an urgent need to nip the problem in the bud.\n“Today, it is a glaring fact that Nigerian youths are involved in drug abuse.\nHe said: “And in this campaign, we are tackling the scourge of drug abuse and trafficking on all fronts.\nIn addition to the arrest and prosecution of drug offenders, we have worked out intensive drug abuse awareness and sensitisation programmes targeting different groups, with an emphasis on youths."
  },
  {
    "headline": "Army Chief Orders Destruction of All Boko Haram, ISWAP Enclaves in North-east",
    "summarized_story": "The army chief also declared that traditional institutions were critical to bringing the insurgency war to an end.\nA statement issued by the Nigerian Army Headquarters said the army chief ordered troops of Sector 2 Joint Task Force North-east Operation Hadin Kai to destroy all Boko Haram and Islamic State West Africa Province (ISWAP) enclaves in their various locations.\nAmong the dignitaries, who accompanied the COAS were the Chief of Operations (Army) Major General Ibrahim Yusuf and the Theatre Commander Operation Hadin Kai, Major General Christopher Musa.\nMeanwhile, the army chief said traditional institutions were critical to the success of ongoing operation to end Boko Haram insurgency and terrorism in the North-east.\nMeanwhile, the Nigerian Air Force yesterday denied that the Nigerian Air Force Base, Kaduna, was attacked by Boko Haram."
  },
  {
    "headline": "NEITI: $584m Oil, Gas Deals Sealed in Asset Ownership Changes in 2019",
    "summarized_story": "Besides, Nigerian Petroleum Development Company (NPDC) acquired OML 11, formerly operated by Shell Petroleum Development Company (SPDC), in a contract totalling $456.03 million.\nDuring the year under review, seismic data acquisition was up by 348 per cent, field development plans 65 per cent, well activities 45 per cent, while gas development plan was down by 75 per cent, with six approved for 2019, as opposed to 24 in 2018.\nSeplat was next with 7 million barrels, followed by SNEPCo, with 3.8 million barrels.\nIn addition, NPDC and Neconde suffered losses and subsequent deferment of 3.7 million barrels, Newcross’ was 3.2 million barrels, Aiteo deferred 2.84 million barrels, Energia’s share of deferment was 1.7 million barrels, while APDNL’s loss was 733,000 barrels during the year.\nAll deferred production amounted to 55.2 million barrels while there were 1,387 pipeline breaks, with Mosimi recording the highest with 637 breaks, followed by Port Harcourt, 536, and Warri with 96 breaks."
  },
  {
    "headline": "UK Health Secretary Quits after Breaking Social Distance Guidance",
    "summarized_story": "Tobi SoniyiFollowing pressure on him to quit, United Kingdom Health Secretary Matt Hancock yesterday resigned his appointment after he breached social distancing guidance by kissing a colleague.\nIn a video posted on Twitter, Hancock said: “I have been to see the prime minister to resign as secretary of state for health and social care.\nHe has appointed former chancellor Sajid Javid as the new health secretary.\nAlso yesterday Coladangelo, seen in kissing video, also announced she was leaving the Department of Health and Social Care.\nFellow Tory MPs, as well as Labour and the Covid-19 Bereaved Families for Justice group, had called for the health secretary to be sacked."
  },
  {
    "headline": "PDP Faction Elects Uba as Guber Candidate",
    "summarized_story": "By David-Chyddy ElekeA faction of the Peoples Democratic Party (PDP) in Anambra State has elected Senator Ugochukwu Uba as the standard bearer of the party in the November 6 poll.\nThe returning officer in the election, Chief Obidi Ebede, said Uba got 275 votes to defeat his closest rival, Godwin Ezeemo, with 114, while Senator Uche Ekwunife scored 56 votes to come third.\nHe said there were 665 accredited delegates.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "EXPOSED: National Health Insurance Scheme Awards N66million Shady Contracts To Staff, Spends N32million On Non-Enrollees",
    "summarized_story": "The authorities of the National Health Insurance Scheme (NHIS) disbursed N32 million in financial aid to individuals not enrolled on the scheme in contravention of its statutory responsibility, SaharaReporters has learnt.\nThe report mandated the Executive Secretary to recover the monies misspent and return them to the coffers of the Nigerian Government.\nProf Mohammed Sambo is the current NHIS Executive Secretary and Chief Executive Officer.\nAlso, the Entity may be jeopardising the purpose of the scheme as all citizens are expected to enrol on the scheme.\n“The above anomaly is the failure of the Accounting Officer to adhere strictly to the procurement Act and other extant circulars."
  },
  {
    "headline": "EXPOSED: National Health Insurance Scheme Awards N66million Shady Contracts To Staff, Spends N32million On Non-Enrollees",
    "summarized_story": "The authorities of the National Health Insurance Scheme (NHIS) disbursed N32 million in financial aid to individuals not enrolled on the scheme in contravention of its statutory responsibility, SaharaReporters has learnt.\nThe report mandated the Executive Secretary to recover the monies misspent and return them to the coffers of the Nigerian Government.\nProf Mohammed Sambo is the current NHIS Executive Secretary and Chief Executive Officer.\nAlso, the Entity may be jeopardising the purpose of the scheme as all citizens are expected to enrol on the scheme.\n“The above anomaly is the failure of the Accounting Officer to adhere strictly to the procurement Act and other extant circulars."
  },
  {
    "headline": "'Zamfara is back home' -- Buhari's aide hints at Matawalle's defection to APC",
    "summarized_story": "Welcome Matawalle,” the Facebook post read.\nAt the moment, Matawalle has not confirmed his rumoured defection to APC, despite speculation of the defection from different quarters and the subsequent denial.\nAdvertisementIn April, some APC governors visited Matawalle in Zamfara to commiserate with him over the activities of bandits in the state.\nThe visit of the APC governors was followed by their PDP counterparts in a move to persuade Matawalle from not joining the APC.\nAdvertisementMeanwhile, some APC chieftains have been boasting that more PDP governors will join them."
  },
  {
    "headline": "'Zamfara is back home' -- Buhari's aide hints at Matawalle's defection to APC",
    "summarized_story": "Welcome Matawalle,” the Facebook post read.\nAt the moment, Matawalle has not confirmed his rumoured defection to APC, despite speculation of the defection from different quarters and the subsequent denial.\nAdvertisementIn April, some APC governors visited Matawalle in Zamfara to commiserate with him over the activities of bandits in the state.\nThe visit of the APC governors was followed by their PDP counterparts in a move to persuade Matawalle from not joining the APC.\nAdvertisementMeanwhile, some APC chieftains have been boasting that more PDP governors will join them."
  },
  {
    "headline": "Sylva: We've accidentally discovered 206trn cubic feet gas reserves",
    "summarized_story": "Timipre Sylva, minister of state for petroleum resources, says the country has “accidentally” discovered 206 trillion cubic feet of gas reserves while in search of crude oil.\nAdvertisementSylva, who disclosed this at a News Agency of Nigeria (NAN) forum on Sunday, said that the country could discover an additional 600 trillion cubic feet reserve to enable it to achieve the desired development required of a gas nation.\nWe have 206 trillion cubic feet of gas reserves,” Sylva said.\n“This number is already discovered in gas reserves and this 206 trillion cubic feet reserve was found while looking for oil, so it was accidentally discovered.\nAdvertisement“We were actually going to look for crude oil and we found gas, and in that process of accidentally finding gas, we have found up to 206 tcf."
  },
  {
    "headline": "Sylva: We've accidentally discovered 206trn cubic feet gas reserves",
    "summarized_story": "Timipre Sylva, minister of state for petroleum resources, says the country has “accidentally” discovered 206 trillion cubic feet of gas reserves while in search of crude oil.\nAdvertisementSylva, who disclosed this at a News Agency of Nigeria (NAN) forum on Sunday, said that the country could discover an additional 600 trillion cubic feet reserve to enable it to achieve the desired development required of a gas nation.\nWe have 206 trillion cubic feet of gas reserves,” Sylva said.\n“This number is already discovered in gas reserves and this 206 trillion cubic feet reserve was found while looking for oil, so it was accidentally discovered.\nAdvertisement“We were actually going to look for crude oil and we found gas, and in that process of accidentally finding gas, we have found up to 206 tcf."
  },
  {
    "headline": "Andy Uba wins Anambra APC guber primary",
    "summarized_story": "Andy Uba, a former senator representing Anambra south senatorial zone, has won the All Progressives Congress (APC) governorship primary election in Anambra stateAdvertisementUba scored 230,201 votes to beat other aspirants to emerge as the APC flagbearer for the November 6 governorship election.\nDapo Abiodun, governor of Ogun state and chairman of the APC primary election committee, announced the result of the primary at Golden Tulip hotel, early on Sunday.\nThe Ogun governor said the total vote cast was 348,490.\nThe election committee said they adopted the open ballot mode also known as Option A4 to conduct the primary election.\nEarlier on Saturday, 11 of the of the 14 governorship aspirants of APC in Anambra said the June 26 governorship primary in the state did not hold."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How technology is helping this AC technician scale his business",
    "summarized_story": "AdvertisementIt’s why when we were asked to pitch possible stories for an article, the event “World Refrigeration Day” caught my attention.\nWorld Refrigeration DaySince 2019, World Refrigeration Day is celebrated every June 26.\nIt is an international awareness campaign established by the World Refrigeration Day Secretariat to raise the profile of the refrigeration, air-conditioning, and heat-pump sector.\nAfter watching several hours of AC installation and work tools videos on YouTube myself, I am inclined to agree.\nA vacuum pump is an essential tool used to repair cooling units to clean the compressor by removing unwanted air and water vapour."
  },
  {
    "headline": "Malawi’s 3D-printed school, learning disabilities and technology, Chrome’s third-party cookies",
    "summarized_story": "Good day,Today, I’m discussing:The world’s first 3D-printed school opening in MalawiLearning disabilities and assistive technologyGoogle’s delay in blocking third-party cookies in ChromeWorld’s first 3D-printed school opens in MalawiPhoto credit: NairametricsWhat happened?\nLearning disabilities (LDs) and assistive technology (AT)Photo by Wulan Sari on UnsplashJust two questions before you proceed: What are learning disabilities?\nAlthough there is no cure for LDs, technology has made learning easier for people with learning disabilities.\nGoogle delays plan to block third-party cookies in ChromePhoto by Brett Jordan on UnsplashAnother announcement?\nGoogle has said that it will delay its plans to block third-party cookies in the Chrome browser until 2023, a year later than planned."
  },
  {
    "headline": "Trying clothes online, virtual store attendants, Facebook plans to over overhaul eCommerce",
    "summarized_story": "Statista showed a rise in eCommerce sales in 2020, with global online sales increasing from $3.35 trillion in 2019 to $4.89 trillion in 2020.\nTo take advantage of this unprecedented rise, the company rolled out Facebook Shops on May 19, 2020.\nAlso, Facebook Shops is coming to WhatsApp soon.\nMeanwhile, the new feature will not be available for Whatsapp users globally.\nIn December 2020, WhatsApp gave an ultimatum for users to accept updated privacy policy."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "OutlookIn the coming week, oil prices are expected to be bullish on signs of demand growth.\nOutlookMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold in the NAFEX window.\nMoney market outlookFinancial system liquidity opened the previous week at N75.53bn which pushed funding rates lower at the start of the week.\nTreasury bills market outlookThe Treasury Bills Market started last week on a quiet note and a similar sentiment was sustained till the close of the week.\nMeanwhile, further disaggregation of Nigeria’s domestic public debt showed that the Federal Government’s domestic debt stock was put at N16.51trn while the domestic debt of States and FCT domestic debt stock was given as N4.12trn."
  },
  {
    "headline": "When fight against insecurity becomes govt’s main preoccupation",
    "summarized_story": "If half of the time devoted to meetings on security at the Presidential Villa were focused on economy-related sessions, Nigeria would not be rated as the world poverty headquarters.\nYet, despite the resources and enormous time spent on such security meetings, insecurity has remained Nigeria’s worst nightmare.\nConsidering the high rate of insecurity across the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Is Buhari trapped in the past?",
    "summarized_story": "Is Buhari trapped in the past?\nIn hindsight, President Buhari’s handlers will rue the Arise TV interview.\nIt presented to viewers a man who looked trapped in a time warp.\nIt removed the mystique around a taciturn ruler, revealing an insular president, stuck in the past, with self-preservation as his sole preoccupation.\nBuhari spoke at last, but only to…"
  },
  {
    "headline": "Contract on renovation of NASS complex undergoing procurement process – FCDA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Capital Development Authority (FCDA) says proposed contract for rehabilitation of National Assembly Complex is currently undergoing procurement process in line with the Procurement Act of 2007.\nThe Head, Public Relations and Information, FCDA, Mr Richard Nduul, made the disclosure in a statement on Friday in Abuja.\nAccording to him, this has been the tradition with every other assignment which the FCDA has undertaken.\n“The attention of the FCDA has been drawn to recent flooding of the lobby of the national assembly complex, Abuja resulting from leakages from the roof.\n” Full waterproofing of the roof of the White House building is a major aspect of the proposed renovation of the complex,” he said."
  },
  {
    "headline": "Ologbo modular refinery ready for production- Gov. Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo, says the modular refinery in Ologbo, Ikpoba – Okha Local Government Area (LGA) of the state was ready for production.\nObaseki stated this shortly after he was conducted round the facility by the Managing Director of the refinery, Mr Tim Tian.\n“The plant is ready to receive crude oil; it is ready to process and it is ready to deliver products.\n“The governor has this project dear to his heart, not only this project, the power plant is also situated in Ologbo.\nMr Tim Tian, the Managing Director of the Ologbo modular refinery, commended the governor for his efforts towards actualising the project."
  },
  {
    "headline": "Obaseki unveils plans for Benin City Cultural District, EMOWAA pavilion …chronicles journey for return of Benin artifacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has unveiled plans for the Benin City Cultural District, which will house the Edo Museum of West African Arts (EMOWAA).\nObaseki disclosed this at the 2021 National Commission for Museums and Monuments (NCMM) Retreat for management staff and curators held in Benin City, the Edo State capital.\n“In this plan, we have included the carving out of a large area as a Cultural District and the Museum will be located in the Cultural District.\nIf we host 5,000 visitors every year as a result of the attraction to the Museum, the state will benefit from it.\n“The Edo Museum of West African Arts (EMOWAA) is a big opportunity for us to be at the forefront of promoting and establishing this museum."
  },
  {
    "headline": "Edo govt, NDLEA link rising crime rate to drug use, lead walk against drug abuse – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government and the National Drug Law Enforcement Agency (NDLEA), as part of activities to mark the 2021 International Day Against Drug Abuse and Illicit Trafficking, led other stakeholders in a sensitization road walk against drug abuse and trafficking across the Benin metropolis.\nThe International Day Against Drug Abuse and Illicit Trafficking is observed globally every June 26 to strengthen action and cooperation to achieve the goal of an international society free of drug abuse.\nTo raise awareness on the dangers of the menace, the Edo State Drug Control Committee (ESDCC) and NDLEA staged a walk from Edo State Secretariat to Sakponba Road, Ring Road, and Sapele Road, warning residents against the intake of drugs.\nAccording to him, “We took this walk against drug abuse today to create the necessary information in society.\nDrug abuse is an ill that must be eradicated completely."
  },
  {
    "headline": "COVID-19: Lagos leads as Nigeria records 35 new cases",
    "summarized_story": "ADVERTISEMENTNigeria on Saturday recorded 35 new cases of coronavirus disease, Nigeria Centre for Disease Control (NCDC), has said.\nThe commercial city of roughly 20 million people has recorded over 60,000 cases and more than 450 deaths.\nAccording to the NCDC update, nobody died from the disease in the last 24 hours.\nSpecificsAside Lagos, the three other states that contributed to the 35 new cases on Saturday are Kwara with three cases while Gombe and Kano reported one each.\nThe NCDC, in the update, said Nigeria has tested 2,231,409 samples since the pandemic spread to the country in 2020."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Group Chides Gumi On Collusion Allegation",
    "summarized_story": "A group, Mothers for United Nigeria (MUN), has condemned statement credited to Islamic scholar, Sheikh Ahmad Gumi that some Nigerian soldiers were conniving with bandits and worsening the security situation in the country.\n“We are glad the meeting will be replicated in other geo- political zones as issues at stake will be aggregated.\nWe feel the pains of members and families of military personnel who are paying the ultimate sacrifice to safeguard the country.\n“We also condemn the statement by Sheik Gumi, this is not the time to weaken the resolve of the military in the fight against insurgency and banditry.\n“This is the time for the carnage to stop and we commend the Defence Headquarters for this bold initiative.”Furthermore, they hailed the Armed Forces of Nigeria for its determination to restore peace in the country."
  },
  {
    "headline": "Group Chides Gumi On Collusion Allegation",
    "summarized_story": "A group, Mothers for United Nigeria (MUN), has condemned statement credited to Islamic scholar, Sheikh Ahmad Gumi that some Nigerian soldiers were conniving with bandits and worsening the security situation in the country.\n“We are glad the meeting will be replicated in other geo- political zones as issues at stake will be aggregated.\nWe feel the pains of members and families of military personnel who are paying the ultimate sacrifice to safeguard the country.\n“We also condemn the statement by Sheik Gumi, this is not the time to weaken the resolve of the military in the fight against insurgency and banditry.\n“This is the time for the carnage to stop and we commend the Defence Headquarters for this bold initiative.”Furthermore, they hailed the Armed Forces of Nigeria for its determination to restore peace in the country."
  },
  {
    "headline": "CIIN Unveils Insurance Textbooks For Secondary Schools",
    "summarized_story": "The Chartered Insurance Institute of Nigeria (CIIN) has unveiled the second edition of its insurance textbooks for secondary school students across the country.\nAdvertisementsThe second edition of the insurance textbooks were an improvement on the first edition in terms of; quality, design and contents.\nThe Lagos State ministry of education, had earlier approved the institute’s secondary school textbooks as a recommended course book for insurance in all secondary schools across the state.\nThe president/chairman of council, Sir Muftau O. Oyegunle, explained that the release of the new edition of the secondary school textbook will facilitate better education of the students on Insurance.\nOyegunle applauded the support of council members, the National Insurance Commission(NAICOM) and other relevant stakeholders on this laudable feat."
  },
  {
    "headline": "CIIN Unveils Insurance Textbooks For Secondary Schools",
    "summarized_story": "The Chartered Insurance Institute of Nigeria (CIIN) has unveiled the second edition of its insurance textbooks for secondary school students across the country.\nAdvertisementsThe second edition of the insurance textbooks were an improvement on the first edition in terms of; quality, design and contents.\nThe Lagos State ministry of education, had earlier approved the institute’s secondary school textbooks as a recommended course book for insurance in all secondary schools across the state.\nThe president/chairman of council, Sir Muftau O. Oyegunle, explained that the release of the new edition of the secondary school textbook will facilitate better education of the students on Insurance.\nOyegunle applauded the support of council members, the National Insurance Commission(NAICOM) and other relevant stakeholders on this laudable feat."
  },
  {
    "headline": "Matt Hancock, Britain’s Health Secretary, Resigns After Being Caught Kissing Aide",
    "summarized_story": "Matt Hancock resigned as Britain’s Health Secretary Saturday, one day after he apologized for breaching COVID-19 regulations.\nAdvertisementsThe married politician was pictured kissing and embracing his adviser, with whom British tabloid The Sun alleged he is having an affair.\n“I’ve been to see the Prime Minister to resign as Secretary of State for Health and Social care.\nThe British government has also been criticized for neglecting care homes, allowing many facilities to go without sufficient PPE, testing and clear guidelines.\nThe chaos around Hancock had already reached such a scale that it even drew the attention of the Queen."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Opinion: In Support Of Ban On Open Grazing In Southern Nigeria – By SUNDAY EZE",
    "summarized_story": "Therefore, every right thinking, peace-loving individual and government should embrace the ban on open grazing and buy in to ranching.\nSome of them have recently asked government to provide alternative to open grazing.\nThe collective decision of all the southern state governors should be backed up by an Act of the State Houses of Assembly.\nSouthern state governors should also take a deliberate step further by enlightening the herders on the rewards for an end to open grazing.\nEvery well meaning and peace loving Nigerian should queue behind the decision of the southern state governors on banning open grazing."
  },
  {
    "headline": "Opinion: In Support Of Ban On Open Grazing In Southern Nigeria – By SUNDAY EZE",
    "summarized_story": "Therefore, every right thinking, peace-loving individual and government should embrace the ban on open grazing and buy in to ranching.\nSome of them have recently asked government to provide alternative to open grazing.\nThe collective decision of all the southern state governors should be backed up by an Act of the State Houses of Assembly.\nSouthern state governors should also take a deliberate step further by enlightening the herders on the rewards for an end to open grazing.\nEvery well meaning and peace loving Nigerian should queue behind the decision of the southern state governors on banning open grazing."
  },
  {
    "headline": "Nigerian becomes first black woman to be elected Mayor in Ireland",
    "summarized_story": "Nigerian becomes first black woman to be elected Mayor in IrelandNigerian becomes first black woman to be elected Mayor in IrelandA UK-based Nigerian woman, Mrs. Uruemu Omeru Adejinmi, has made history, with her election as the new Cathaoirleach of Longford Municipal District in Ireland.\nShe is the daughter of the current Ovie of Agbon Kingdom in Delta State, His Royal Majesty, Mike Omeru, Ogurime-Rime Ukori I.\nHer father, a business mogul and chairman of Niger Cat Construction Company, was crowned the Ovie (paramount ruler) of Agbon Kingdom in February 2013.\nShe became the first black woman to be elected as Mayor in Ireland.\nAccording to Iris Examiner, Adejinmi would now function as Leas Cathaoirleach (Mayor), a feat that has never been achieved by any black woman in the country."
  },
  {
    "headline": "Nigerian becomes first black woman to be elected Mayor in Ireland",
    "summarized_story": "Nigerian becomes first black woman to be elected Mayor in IrelandNigerian becomes first black woman to be elected Mayor in IrelandA UK-based Nigerian woman, Mrs. Uruemu Omeru Adejinmi, has made history, with her election as the new Cathaoirleach of Longford Municipal District in Ireland.\nShe is the daughter of the current Ovie of Agbon Kingdom in Delta State, His Royal Majesty, Mike Omeru, Ogurime-Rime Ukori I.\nHer father, a business mogul and chairman of Niger Cat Construction Company, was crowned the Ovie (paramount ruler) of Agbon Kingdom in February 2013.\nShe became the first black woman to be elected as Mayor in Ireland.\nAccording to Iris Examiner, Adejinmi would now function as Leas Cathaoirleach (Mayor), a feat that has never been achieved by any black woman in the country."
  },
  {
    "headline": "BMO: Hypocrites will condemn Kano-Maradi rail not Enugu-Bemanda highway",
    "summarized_story": "By Nimot SulaimonBuhari Media Organisation says that only hypocrites will condemn the Kano-Maradi rail but keep mute over the Enugu-Bamenda highway.\nAs the motivation and philosophy behind the Kano- Maradi rail project are the same as that of the 403-kilometre highway linking Enugu to Bamenda in Cameroon.\nAccording to the Buhari Media Organisation (BMO) in a statement signed by its Chairman Niyi Akinsiju and Secretary Cassidy Madueke, it would be sheer hypocrisy for anyone to condemn the rail project but remain silent on the highway project in the South.\nBMO also took a swipe at the Peoples Democratic Party (PDP) which was critical of the Kano-Maradi rail project.\nBMO reassured Nigerians that the President will keep to the terms of his vow to improve on the country’s infrastructure, regardless of dwindling oil revenue."
  },
  {
    "headline": "Makinde to establish special health insurance for orphans",
    "summarized_story": "By David AdeoyeOrphans in Oyo state will soon enjoy a special health insurance programme, says Gov.\nSeyi Makinde as he hosted orphanage administrators at Government House, Agodi, Ibadan, on Saturday.\nThe governor, who stated that his administration would continue to give the needed support to orphans in the state, added that the State’s Health Insurance Agency (OYSHIA) would promptly facilitate the programme.\nAccording to him, the special health programme will enable the orphans to begin to access qualitative medical services in the primary health care centres nearest to them.\nMakinde charged the children in the orphanages to be good and take their studies serious, while praying to God to endow them with wisdom and understanding."
  },
  {
    "headline": "ICYMI: Niger Delta Avengers names woman Tu-ere as new leader",
    "summarized_story": "By Jethro IbilekeThe Niger Delta Avengers (NDA), has named a woman, identified as Tu-ere, aka Queen of the Creeks as its new leader and Field Commander.\nThe Niger Delta militant group, in a statement on Saturday said “The high command of the NDA has promoted and appointed one of our finest operatives, Field Commander Tu-ere, aka Queen of the Creeks to the rank of Brigadier-General.\nWe advise other female operatives to emulate her and be dedicated to our mission at all times.\n“Conclusively, we wish to state unequivocally and in simple terms that we are back with Operation Humble, with the aim of humbling the economy into permanent recession and political players from the Niger Delta extraction to political retirement.\n“There will be no going back until the Nigerian economy is humbled into recession never to rise again!”, the statement concluded,” the group said."
  },
  {
    "headline": "I Never Insulted Buhari, I Wanted Him To Succeed – Gov Ortom [Video]",
    "summarized_story": "Despite a public spat with President Muhammadu Buhari, Governor Samuel Ortom of Benue State has stated that he has never insulted him.\nSome Nigerians misinterpreted the governor’s criticism of the president over the security situation in his state, according to a 24-second video shared on his official Facebook page on Sunday morning.\nHe said, “Sometimes I talk about the presidency and at one point some ignorant people said that I was castigating President Muhammadu Buhari.\n“Some were so ridiculous to the extent of saying that I insult Mr President, I did not insult him.\nNEWSDIRECT reports that the Benue State Government and the presidency have several times engaged in face-off over alleged inability of President Buhari to tackle insecurity in the state."
  },
  {
    "headline": "LG Election: Security Personnel, Election Officials Held Hostage In Jigawa",
    "summarized_story": "At Kiyako ward in Jigawa State’s Birnin Kudu Local Government Area, voters have taken prisoner security personnel and electoral officials.\nOn the premises of the ward collation center, five police officers and seven vigilante members were also held prisoner.\n“As a result, members of the party converged and kept the election officials hostage until what they had voted for was declared.\nThe election officials have been held hostage in a classroom since Saturday at 4:00 p.m., according to a resident of Kiyako named Adamu, who told DAILY POST that they will not be released until the election results are disclosed.\nKiyako ward is a political ward of Alh Sule Lamido, the ex-governor."
  },
  {
    "headline": "JUST IN: Gov Bello Dumps PDP For APC",
    "summarized_story": "Bello Matawalle, the governor of Zamfara State, has abandoned the Peoples Democratic Party (PDP).\nMatawalle has defected to the All Progressive Congress, according to NEWS DIRECT.\nPersonal Assistant to Nigeria’s President, Muhammadu Buhari on Digital and New Media, Bashir Ahmed disclosed this on his verified Facebook page on Sunday morning.\nThe presidential aide wrote ‘’So Zamfara is back home!\nHowever, the Governor is yet to confirm his defection officially."
  },
  {
    "headline": "Oduduwa Republic: God sent Sunday Igboho, don’t fight him – CAC pastor warns Gani Adams",
    "summarized_story": "God sent Yoruba freedom fighter Sunday Adeyemo, better known as Igboho, according to Pastor Segun Adebayo of Christ Apostolic Church, CAC.\nThe clergyman made the comment while advising Gani Adams, Yorubaland’s Onakakanfo, to avoid battling Igboho.\nThat was why I said Sunday Igboho and Gani Adams should not fight each other.\nLet Gani Adams not let people push him.\nIgboho recently warned armed Fulani herders to vacate the Southwest, while insisting that Oduduwa Republic will be actualized soon."
  },
  {
    "headline": "VIDEO: Watch as Naija Ratels thrash Kwara Ladies on matchday 2 of NWFL Championship",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Valentine Ozigbo emerges PDP candidate ahead 2021 Anambra guber poll",
    "summarized_story": "Unofficial result has just revealed that a former President of Transnational Corporation of Nigeria (Transcorp) Valentine Ozigbo has narrowly emerged victorious after the primary of Peoples Democratic Party (PDP) ahead of Anambra state governorship election on Saturday night.\nThe result yet to be made official by the party has it that Ozigbo scored 62 to closely beat Obiorah Okonkwo who got 58 votes.\nServing Senator Iyom Uche Ekwunife polled 44 votes while Winston Udeh and Dr Godwin Maduka scored 12 and five votes respectively.\nDetails loading…"
  },
  {
    "headline": "Hunger, starvation imminent over security concerns",
    "summarized_story": "BENJAMIN SAMSON in this report examines the effects of the ugly security situation on food production and availability.\n“The security situation has crippled the economy as travelling on the highways across the country has become a nightmare to Nigerians.\nFAO, ActionAid’s alarmsIn the same vein, the Food and Agriculture Organisation (FAO) has raised the alarm over the worsening state of food security in the country.\nIt, therefore, stressed the need for urgent measures to protect the most vulnerable, keep the national agricultural supply chains functional and efficient, and mitigate the food security impacts of the Covid-19 pandemic.\nFor example, wheat remains an imported production input costing Nigeria about N222 billion in the first quarter of 2021 alone."
  },
  {
    "headline": "Okowa tasks States’ legislatures on constitutional amendment -NigPilot",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has called on the States’ House of Assembly to ensure that the Constitutional Amendment Bill is passed when passed to them by the National Assembly.\nOkowa made the call on Friday when he received the Conference of Speakers of States’ Legislatures in Nigeria led by its Chairman and Speaker of Bauchi State House of Assembly, Rt.\nHe stated that as states’ legislatures, the onus was on them to pass the Constitutional amendments in the interest of the nation.\n“The fear of legislative autonomy is unfounded because our state House of Assembly has been operating in autonomy since 2019,” he said.\nSpeaker of Delta House of Assembly and Deputy Chairman of the Conference of Speakers, Rt Hon."
  },
  {
    "headline": "NAF base was not attacked by terrorists in Kaduna -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) on Saturday denied a trending report that its Base in Kaduna was attacked by terrorists.\nAccording to the statement, “Merchants of fake news are at it again.\nThis time around, their focus is on the premier Nigerian Air Force Base at Kaduna , which they claimed came under terrorist attack in the early hours of today, 26 June 2021.\n“Members of the public should please disregard the news as it is entirely false”.\nAir Commodore Edward Gabkwet concluded thatthere was nothing of such as the inhabitants of the entire Base are going about their normal activities and duties without any threat whatsoever."
  },
  {
    "headline": "Troops kill scores of bandits in Zamfara State -NigPilot",
    "summarized_story": "The troops of the 8 Division Nigerian Army (NA) , killed scores of bandits while on a fighting patrol, along with Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\nHe said that in the fierce encounter that ensued, the bandits were overwhelmed by the superior firepower of the troops.\nIn a related development, the Army Spokesperson said that troops again killed five bandits in another encounter at Bingi village, in Bungudu LGA of Zamfara.\nThe gallant troops recovered one AK-47 rifle, one Motorcycle, and three mobile phones from the routed criminals,” he said.\nHe also tasked communities in the North West to support the troops with useful information at all times to enhance anti-banditry operations."
  },
  {
    "headline": "Kumuyi urges Nigerians to connect with God for divine intervention -NigPilot",
    "summarized_story": "…begins 6 days crusade in Abuja, othersAmidst daunting challenges the country grapples with, the General Superintendent, Deeper Life Bible Church, Pastor William Kumuyi , yesterday, urged Nigerians to connect to God for divine intervention.\nHe said: “Suffering came with sinning against God.\n“You can invite sin with one finger but at the end, ten fingers will not be enough to remove them.\nHe knows where your goodness, prosperity, satisfaction and sufficient supplies are, and He will lead you to them as you connect to Him.\n“When God calls you to repentance, you have to come to Him and do away with all those things which cause disconnection, chief of which is sin”, he said."
  },
  {
    "headline": "Drug Abuse Deadlier Than Insecurity – Buhari",
    "summarized_story": "Gloria Ume-Ezeoke, AbujaPresident Muhammadu Buhari on Saturday suggested that the effects of drug abuse in the country was worse than acts of insecurity and banditry.\nThe President made the comment at the launch of War Against Drug Abuse at the State House in Abuja.\nThe launch event was held in commemoration of the United Nations International Day against Drug Abuse and Illicit Drug Trafficking.\n﻿NDLEA Chairman, Buba Marwa, at the launch event, also lamented the pervasive abuse of cannabis among Nigerians.\nHe said Nigeria is the highest user of cannabis globally, a trend which has contributed to the insecurity in the country."
  },
  {
    "headline": "We Want To Conclude North-East Insurgency – Army Chief",
    "summarized_story": "﻿Musa Mingyi in Damaturu and Blessing Tunoh in MaiduguriThe Chief of Army Staff, Major-General Farouk Yahaya on Saturday said the army is committed to ending the insurgency in the North-East.\nThe army chief made the comment while on an operation visit to frontline troops of Sector 2, Joint Taskforce of the Nigeria Army ‘Operation Hadin Kai’ in Damaturu, Yobe State.\nMajor-General Yahaya said ending the insurgency will allow the army move on to other things.\nMajor-General Yahaya was last at the command on the entourage of the immediate past late Chief of Army Staff, Lieutenant-General Ibrahim Attahiru on March 14.\nThe army chief, at the meeting, said such collaborations have paid off in the past."
  },
  {
    "headline": "Borno Govt Suspends French NGO Over Shooting Training At Maiduguri Hotel",
    "summarized_story": "Blessing Tunoh, MaiduguriBorno Governor, Babagana Zulum, has directed the immediate suspension of ACTED, an international Non-Governmental Organization (iNGO) following Saturday’s discovery that the humanitarian organisation was using a hotel in Maiduguri for training some persons on shooting.\nZulum’s spokesperson, Malam Isa Gusau, who announced the Governor’s directive, said the French iNGO was found using toy guns and simulators in training exercises at a hotel located off circular road in Maiduguri.\nGusau explained that residents near the hotel had reported to officials that they were hearing sounds of gunshots from the hotel, following which government officials reported the matter to GRA Divisional Police Headquarters which oversees the hotel’s location.\nThe statement said pending the outcome of police investigation, Governor Zulum has directed sealing of the hotel and suspension of ACTED from any humanitarian activity in Borno State.\nGusau noted that Governor Zulum acknowledges and deeply appreciates the roles of credible iNGOs which have been providing critical humanitarian interventions in different parts of Borno."
  },
  {
    "headline": "Deep Impact: How COVID-19 Exposed The Education Sector’s Digital Flaw",
    "summarized_story": "“Because if it’s the same standards as what we had three, four years ago, I’m obviously scared for public school students.\n“I kind of feel like it’s very unfair that public school students and private school students would sit for the same exams.\nThe importance of digital toolsSamuel Onyeledo, 35, still remembers vividly the first day he walked into a public primary school in Kaduna.\nBecause a basic thing the child should get before leaving primary education is literacy.\nThere were radio programs, but he wasn’t sold on their effectiveness for primary school students."
  },
  {
    "headline": "Macron And Le Pen Face New Test In French Regional Vote",
    "summarized_story": "Four hours after polls opened, turnout on Sunday stood at the same dismal 12.66 percent as during the first round.\n“2022: What if it wasn’t them?” asked the headline in the left-wing Liberation newspaper over a picture of Macron and Le Pen.\nThe Socialists are expected to pick up some regions, partly due to support from the far-left France Unbowed party.\n“LREM lacks a local presence, but in 2017 that did not prevent them from winning the presidential and legislative elections,” said Sainty.\nVoting began at 8:00 am (0600 GMT) on Sunday, with the last polling stations due to close 12 hours later."
  },
  {
    "headline": "Anti-drug trafficking: Osinbajo, Marwa attend premiere of movie, “The Silent Baron” in Abuja",
    "summarized_story": "Vice President Yemi Osinbajo on Friday attended the premiere of “The Silent Baron,” a film directed by Mr. Ifeanyi Ukaeru and created in collaboration with the National Drug Law Enforcement Agency to raise awareness about the risks of drug misuse and trafficking in Nigeria.\nThe participation of Prof. Osinbajo at the film’s premiere was intended to show his support for the global fight against drug abuse and illicit drug trafficking.\nThe premiere is part of the celebrations commemorating the United Nations International Day Against Drug Abuse and Illicit Drug Trafficking, which is observed every year on June 26th.\nThe film highlights the NDLEA’s admirable role in the fight against drug trafficking, particularly at a time when the agency is aggressively exposing the threat with a large number of arrests in recent months.\nAfter watching the movie, the Vice President met some of the actors who were also present at the premiere, interacted briefly and took group photographs with the actors, movie producers and the production crew."
  },
  {
    "headline": "Insecurity: Mairo Tambuwal prays for Nigeria, urges Nigerians to support security agencies, government",
    "summarized_story": "She made the request during a special prayer session for Nigeria as part of a two-day special program on the impact of climate change on the income of vulnerable Nigerians.\nAdvertisementAccording to her, security concerns combined with the effects of climate change are affecting Nigerians’ economic condition, particularly farmers in rural communities whose livelihoods have been impacted.\nShe said the empowerment is to enable them cushion the effect of the climate change on their means of livelihood.\nShe also engaged youth and school children for sensitization on the impact of climate change and how they can be mitigated through deliberate actions.\nNigeria is one of the countries suffering the adverse effect of climate change because of the type of Agriculture practice in the country that depend of rain."
  },
  {
    "headline": "Andy Uba declared winner in Anambra APC primary election",
    "summarized_story": "Andy Nnamdi Uba, an APC governorship candidate has been declared winner of the primary election in Anambra State.\nMr. Uba defeated 13 other aspirants to become the party’s governorship candidate in the November 6 elections.\nPrince Dapo Abiodun, the chairman of the APC primary election panel and the governor of Ogun State, declared the results of the election early on Sunday at the Golden Tulip Hotel in Agulu Lake.\nAdvertisementThe full results as announced by the election committee for each of the candidates are:i.\nMaxwell Okoye – 2,540The election committee adopted the open ballot mode also known as Option A4 to conduct the primary election."
  },
  {
    "headline": "Euro 2020: Lukaku vs Ronaldo as Belgium Face Portugal in Spain for Quarter-final Spot",
    "summarized_story": "The world’s number-one ranked side Belgium take on holders Portugal in a standout Euro 2020 tie in Spain for a place in the quarter-finals.\nAll eyes will be on Belgium forward Romelu Lukaku and Portugal captain Cristiano Ronaldo, who have scored eight goals between them at Euro 2020.\nDespite being top of Fifa’s world rankings, Belgium have yet to win a major tournament.\nEuro 2016 winners Portugal made it through to the last 16 as one of the best four third-placed teams.\nPortugal have conceded six goals in three games at Euro 2020 so far, already one more than they did at Euro 2016 when they went on to lift the trophy."
  },
  {
    "headline": "Trump Returns to Rally Stage in Ohio, Urges Votes for Republicans",
    "summarized_story": "Trump has pledged to back those who challenge the 10 legislators in the upcoming Republican primaries.\nSo far, nine of the 10 House Republicans who voted for Trump’s impeachment have drawn primary challengers.\nWe won that election in a landslide.”The crowd chanted “Trump won” and “four more years!\nThe former president also used the Ohio rally to lambast Biden, calling him a “catastrophe” and focusing on the rising number of immigrants crossing over the US southern border – an issue Republicans have zeroed in on to rally their voters.\nRepublican strategist Matt Dole said both Trump and those vying to stay close to him benefited from the public bonhomie on display at the Ohio event."
  },
  {
    "headline": "Covid: Several Countries Reintroduce Restrictions Amid Struggle to Contain Delta Variant",
    "summarized_story": "“There is currently a lot of concern about the Delta variant,” World Health Organization (WHO) chief Tedros Adhanom Ghebreyesus told a Friday news briefing.\nMeanwhile, Russia’s Euro 2020 host Saint Petersburg on Saturday reported the country’s highest daily COVID-19 death toll for a city since the start of the pandemic.\nThis came as Russia has seen an explosion of new cases since mid-June, driven by the Delta variant.\nIn neighbouring Finland, health officials said they had detected a spike in coronavirus infections that was traced to football fans returning from Saint Petersburg.\nIn South Africa, the continent’s worst-hit country, scientists said on Saturday the Delta variant appeared to be dominating new infections."
  },
  {
    "headline": "Outcry Over South Africa’s Multiple Husbands Proposal",
    "summarized_story": "A proposal by the South African government to legalise polyandry – when a woman has more than one husband at the same time – has led to howls of protest from conservative quarters.\nHow will they know their identity?” asks Mr Mseleku, who stars in a South African reality TV show about his polygamous family.\nWill the man be expected to take her surname?”Prof Machoko researched polyandry in his country of birth – neighbouring Zimbabwe.\nWhen she was an adult she started having sex with multiple partners who were all aware of each other.\nProf Machoko said he was unaware of polyandrous marriages in South Africa."
  },
  {
    "headline": "UK Health Secretary Matt Hancock Quits after Breaking Covid Rules by Kissing Aide",
    "summarized_story": "British Health Minister Matt Hancock has resigned, a day after being called out for breaking social distancing rules by kissing an aide.\nThe pictures that enraged the public and politicians were taken on May 6 – 11 days before lockdown rules were eased to allow hugs and other physical contact with people outside one’s own household.\nHancock has been at the centre of the government’s fight against the coronavirus pandemic, routinely appearing on television and radio to tell people to follow the strict rules to contain the virus.\nJohnson had said on Friday he had accepted an apology from Hancock and considered the matter to be closed, but the latter had faced rising pressure to step down.\nLabour leader Keir Starmer said on Twitter that Hancock was right to resign."
  }
]