[
  {
    "headline": "BREAKING: Buhari seeks National Assembly approval for fresh external loans",
    "summarized_story": "), has requested the National Assembly to approve for it $4,054,476,863 and €710 million.\nBuhari is also seeking the nation’s legislature’s approval for grant components of $125 million in the 2018-2020 external rolling borrowing plan.\nPart of the letter read, “I write on the above subject and submit the attached addendum to the proposed 2018-2020 external rolling borrowing plan for the consideration and concurrent approval of the senate for the same to become effective.\n“The distinguished Senate President may recall that I submitted a request on 2018-2020 borrowing plan for the approval of the senate in May 2021.\n“The projects listed in the external borrowing plan are to be financed through sovereign loans from the World Bank, French Development Agency, EXIM Bank and IFAD in the total sum of $4,054,476,863 and €710 million and grant components of $125 million.”Details later…"
  },
  {
    "headline": "Bandits’ attack: NDA commandant briefs Reps",
    "summarized_story": "Maj.-Gen Ibrahim Yusuf, Commandant of the Nigerian Defence Academy (NDA), has briefed the House of Representatives Committee on Defence on the recent attack by suspected bandits on the academy.\nDuring the attack on Aug. 24, two officers were killed and one abducted.\nThe briefing was done behind closed doors, as the commandant said that the documents to be presented to the committee members were classified.\nYusuf had before the meeting went into close door, said he would brief the committee on the ongoing effort of the military to rescue the abducted officer.\nHe disclosed that the Chief of Defence Staff, Lt Gen. Lucky Irabor had visited the scene of the attack the day it happened, adding that many other serving and retired military officers also visited."
  },
  {
    "headline": "Breaking: Buhari writes Senate, seeks approval of fresh loan of $4bn, €710 million",
    "summarized_story": "By Henry Umoru – AbujaPresident Muhammadu Buhari has written the Senate, seeking for the approval of of fresh borrowing to the tune of $4,054,476,863 and €710 million in an addendum to the 2018-2020 borrowing plan.\nThe letter was read during plenary today, Tuesday by the Presidentof the Senate, Senator Ahmad Lawan as Buhari is asking the National Assembly to approve grant components of $125 million.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "ALLEGED SIEGE TO EDO COMMUNITY: I didn’t hijack Inikorogha—Robert Okubo, ex-militant leader",
    "summarized_story": "The Amaokosuwei to be has not even been installed as the community leader,” he stated.\nNothing like militancy —IgiriAndrew Igiri, speaking to Niger Delta Voice, NDV, said: “There is nothing like militancy, nor any harassment going on in Inikorogha Community.\nThe community executive is headed by Timi Edu, while the youth body is headed by Pereke Ukulor.\nNow, the only option they have is to instigate the Edo State government against the community.\nIgiri urged Edo State government to disregard those bent on fomenting non-existent crisis in Inikorogha, for selfish reasons."
  },
  {
    "headline": "2 men jailed 2 years each for being in possession of Cannabis",
    "summarized_story": "A Magistrates’ Court in Gwagwalada, FCT, on Tuesday sentenced Abdulwahab Ibrahim and Abubakar Umar to two years imprisonment each for being in possession of Cannabis.\nThe police charged Ibrahim, Abubakar and Ibrahim Hamza with constituting public nuisance and being in possession of dry leaves suspected to be Cannabis.\nThe Magistrate, Mrs Punarimam Balogun sentenced Ibrahim, Abubakar after they pleaded guilty and begged the court for leniency.\nShe also ordered the two convicts to pay N15,000 each for being in possession of the dry leaves suspected to be cannabis.\nHe said that they on a motorcycle and dry leaves suspected to be Cannabis were recovered from themThe prosecution counsel added that during investigation they confessed to have bought the Cannabis in Gwagwalada main market."
  },
  {
    "headline": "Pawpaw blooming on unusual “soil” inspires",
    "summarized_story": ""
  },
  {
    "headline": "IPOB sit-at-home: Empty streets in Umuahia",
    "summarized_story": "By Steve OkoThe streets were literally empty, Tuesday in Umuahia, Abia State capital as residents stayed indoors in full compliance with the sit-at-home order by the Indigenous People of Biafra, IPOB.\nIPOB had directed a sit-at-home “throughout Biafra land” as a mark of honour for victims of September 14, 2017 military raid of the Afaraukwu Ibeku country home of its Leader, Mazi Nnamdi Kanu during Operation Python Dance ii.\nSome of the major streets monitored by our Correspondent were virtually deserted except for occasional human and vehicular movements.\nIt was also observed that some of the streets were converted to temporary football pitches by youths.\nOne of the residents told our Correspondent that ” the sit-at-home thing is becoming confusing”, and appealed to IPOB to consider the economic and other implications on the people."
  },
  {
    "headline": "BREAKING: Buhari seeks Senate’s approval for fresh $4bn, €710m loans",
    "summarized_story": "Despite public outcry over incessant borrowing by the current administration, President Muhammadu Buhari on Tuesday, asked the Senate to approve $4 billion and €710 million external loans.\nThe development was captured in a letter addressed to Senate President Ahmad Lawan and read at plenary.\nAccording to the president, the proposed loan would be financed through sovereign loans from the World Bank, French Development Agency, EXIM Bank and IFAD.\n“The distinguished Senate President may recall that we submitted a request on 2018-2020 borrowing plan for the approval of the Senate in May 2021.\n“However, in view of other emerging needs and to ensure that all critical projects approved by FEC as of June 2021 are incorporated, I hereby forward an addendum to the proposed borrowing plan."
  },
  {
    "headline": "Ex-Oyo first lady, Florence Ajimobi loses mother",
    "summarized_story": "Mrs. Victoria Amudoaghan, mother of Florence Ajimobi, the immediate past first lady of Oyo State is dead.\nDAILY POST learnt about the death of the deceased on Tuesday.\nOur correspondent recalls that Mrs. Ajimobi is the wife of the immediate past Governor of the State, late Abiola Ajimobi.\nAlthough details of the death of the deceased are still sketchy, our correspondent learnt that the deceased was a member of the Catholic church.\nBolaji Tunji, Special Adviser on Communications to the former governor, confirmed the death of the deceased to DAILY POST on Tuesday."
  },
  {
    "headline": "Religious leaders important in promoting peaceful coexistence – Niger Gov",
    "summarized_story": "Governor Abubakar Sani Bello of Niger State says religious leaders in the country are critical in the dissemination of right messages to promote peaceful coexistence among the people.\nHe described the deceased monarch as a selfless leader and a philanthropist who contributed a lot to the welfare of the less privileged.\nThe governor noted that as a leader of the state, he cannot act against the law he assented to.\n“I also advise you to select another Chairman in the event your request is not granted by the State House of Assembly.\nI encourage you to continue to give proper direction to the public through their sermons,” he stated."
  },
  {
    "headline": "Yobe govt inaugurates first State Education Council",
    "summarized_story": "It inline with its aspiration of taking basic and secondary education to an enviable height, Yobe State Governor, Mai Mala Buni has inaugurated a 13-man State Education Council to assist in revamping the sector in the state.\nBuni explained that on 30th of February, 2021, he had approved the establishment of the Yobe State Education Council as an executive organ with the objective to strengthen the expeditious and articulate implementation of the report on the Revitalization of Basic and Secondary Education in the state.\nDrawing its membership from a broad spectrum of experienced and sure-to-deliver educationists, academics, and administrators, amongst others, the Education Council is expected to play proactive advisory roles in ensuring that Yobe’s basic education infrastructure is brought at par with today’s requirements of a functional education system.\n“To provide the unfettered political will to implement the framework for the revitalization of Basic and Secondary Education; to facilitate institutional cooperation through coordination of issues relating to Basic and Secondary Education amongst Ministries, Departments and Agencies (MDAs).\nBuni, the Yobe State Education Council is to be chaired under him with top government functionaries as members which include: Hon."
  },
  {
    "headline": "Collapse of local govts contributing to insecurity – Ex-officials",
    "summarized_story": "The loss of relevance and usurping of administrative functions at the local government level by state governments has been ascribed as one of the causes of insecurity in Nigeria.\nSpeaking, the duo noted that the development was not peculiar to Osun and accused previous administrations in the state of unnecessarily interfering in the running of activities at the local government level.\nOlanipekun and Babatola argued that the 1999 constitution guarantees a local government but alleged that the All Progressives Congress (APC) policy sees it otherwise.\nThey appealed to President Muhammadu Buhari to implement local government autonomy in order for the people to fully enjoy the dividends of democracy.\nIn the case of Osun, they also opined that the supervisory function from the Ministry of Local Government and Chieftaincy Affairs should be maintained."
  },
  {
    "headline": "Ex-Gov Ajimobi’s wife loses mum",
    "summarized_story": "- Advertisement -By Segun Showunmi, IbadanMrs. Victoria Amudoaghan, mother of the immediate past Oyo First Lady, Florence Abiola Ajimobi, is dead.\nThe Nation leant that the Delta-born Catholic died on Saturday.\nChairman, Senate Committee on Local Content and lawmaker representing Oyo Central Senatorial District, Senator Teslim Folarin commiserated with Mrs Ajimobi over the passing of her mother.\nRead Also: Actress Bimbo Oshin loses husbandFolarin, in a condolence message he personally signed conveyed his condolences, praying for eternal rest for Mrs. Victoria.\nHe said: “I commiserate with Her Excellency Chief (Dr.) Florence Ajimobi and other members of Amudoaghan family over the passing of their matriarch.”"
  },
  {
    "headline": "BREAKING: Buhari seeks Senate’s approval for $4bn, Euro 710m external loan",
    "summarized_story": "By Sanni Onogu, Abuja- Advertisement -President Muhammadu Buhari has urged the Senate to approve a fresh loan of $4,054,476, 863.00, Euro 710million and a grant of $125million to finance critical projects in the 2021 budget.\nBuhari’s request was contained in his letter read by Senate President Ahmad Lawan at plenary following the resumption of the Upper Chamber from its two-month annual vacation.\nAccording to the President, the request is an addendum to the proposed 2018 – 2021 Federal Government External Borrowing Rolling Plan earlier approved by the National Assembly.\nHe said that the projects listed in the addendum to the 2018 – 2021 Federal Government External Borrowing Rolling Plan are to be financed through sovereign loans from the World Bank, French Development Agency, China Exim Bank, International Fund for Agricultural Development (IFAD) and Credit Swiss Group, among others.\n“In view of other emerging needs and to ensure that all critical projects approved by FEC as at June 2021 are incorporated, I hereby forward an addendum to the proposed borrowing plan,” Buhari said."
  },
  {
    "headline": "BREAKING: Nigeria to join New York, Singapore, London as international financial hub",
    "summarized_story": "By Nduka Chiejina (Assistant Editor)- Advertisement -Nigeria is set to join a very small elite group of countries operating an international financial hub.\nThe international financial centre will take in September 2022 when the Central Bank of Nigeria will establish The Nigerian International Financial Centre (NIFC).\nCentral Bank of Nigeria(CBN) Governor Godwin Emefiele disclosed this in Abuja on Tuesday at the 14th Annual Banking and Finance Conference organized by the Chartered Institute of Bankers of Nigeria (CIBN).\nEmefiele revealed that “the NIFC will act as an international gateway for Capital and investments, driven by technology and payment system infrastructure”.\nWhen operational, “the NIFC will be a 24/7 Financial Centre that will complement London, New York and Singapore financial centers and enable an acceleration of our home -grown initiatives”."
  },
  {
    "headline": "BREAKING: Imo SSCE students: IPOB to rebuild damaged school property",
    "summarized_story": "“Any other purported sit-at-home including the suspended weekly sit-at-home on Mondays does not exist in the dairy of IPOB.\n“Anybody trying to enforce any sit-at-home order using the name of IPOB is a saboteur, and does so at his peril.\nExplaining why the order was relaxed on Mondays ,Powerful said “IPOB is a responsible organisation with reasoning and empathy.\nThat was why we reduced the sit-at-home protests to the days our leader, Mazi Nnamdi Kanu will be making appearances in court.\nAnybody trying to impose another sit-at-home order on our people or enforce illegal or imaginary sit-at-home is not IPOB, and must be dealt with."
  },
  {
    "headline": "Tension as gunmen kill soldiers, free 240 inmates at Kogi Custodial facility – The Sun Nigeria",
    "summarized_story": "From Emmanuel Adeyemi, LokojaThe Federal Government yesterday, said security forces have launched a manhunt for gunmen who attacked Kabba Medium Security Custodial Centre in Kogi State on Sunday.\nDaily Sun learnt that the gunmen attacked a military checkpoint located a few metres away from the correctional centre with heavy gunfire before attacking the prison.\nAnother eye witness account, however, said the gunmen attacked an uncompleted building where the soldiers normally hibernate and after that broke into the correctional centre releasing over 100 inmates.\nHe said during the attack, security officers on duty, comprising 15 soldiers, 10 police officers and 10 armed guards of the service fought gallantly to repel the attack.\nMeanwhile, some of the inmates who escaped have also voluntarily returned to the facility this morning,” he said."
  },
  {
    "headline": "12 die in latest Kaduna attack",
    "summarized_story": "From Sola Ojo, KadunaSuspected bandits last weekend invaded the Apiyejim community in Zango-Kataf Local Government Area (LGA) of Kaduna State, leaving 11 persons dead.\nThough the spokesman of the Kaduna State Police Command, ASP Muhammed Jalige, did not pick up his call for confirmation, a media source quoted one Jonathan Ishaya who confirmed the development.\n“The victims are six women, three children and three men,” the media source quoted Jonathan.\nMeanwhile, Kaduna State Governor, Nasir El-rufai, has appealed for calm over the killing of a Pastor in Zangon Kataf LGA.\n“Security agencies have reported to the Kaduna State Government the killing of Pastor of ECWA Church, Kibori-Asha Awuce, in Zangon Kataf LGA, by assailants."
  },
  {
    "headline": "Lagos’ll implement VAT law despite A’Court’s ruling – Lawmaker",
    "summarized_story": "Following Rivers State which signed its VAT bill into law last month, Governor Babajide Sanwo-Olu, last Friday, signed the state VAT Bill into law a day after it was passed by the House of Assembly.\n“In Lagos State, we have always clamoured for true federalism.\nWe are happy that the Rivers State Government went to court and the court was very clear that VAT was supposed to be a state affair.\n“By our own understanding, what subsists in Lagos is our own law, until that law is set aside by the Court of Appeal.\nSo, as far as Lagos is concerned, VAT in Lagos will be collected by the Lagos State Government.”He lamented that the state does not enjoy special status despite generating over half of the country’s VAT."
  },
  {
    "headline": "FG approves over 200% raise on ground handling charges for airlines",
    "summarized_story": "By Chinelo ObogoExactly 35 years after an amendment on ground handling charges, the Nigeria Civil Aviation Authority, (NCAA) has approved new safety threshold charges for air cargo companies.\nNarrow body aircraft include Boeing B737, Airbus A320, ER 135 and ATR, while wide body aircraft are B767, A330, B777, B747 and B787.\nOther African ground handling companies charge operators as much as $4,000, while in Nigeria, airlines pay $400 for the same services.\nBut with this approval, Nigerian ground handling companies can now charge the same handling rates as their counterparts in the sub-African countries.\nAll stakeholders are directed to ensure full compliance with the safety threshold ground handling charges."
  },
  {
    "headline": "Army Chief to War Commanders: I Won’t Accept Any More Excuses over Attacks",
    "summarized_story": "Yahaya asked commanders in the various theatres of operation to seize initiative and take decisive actions to defeat threats in their respective areas of responsibility.\nHe stated, “I have directed that serious attention be given to sustaining and improving the tempo in all on-going Nigerian Army operations across the country.\n“Commanders must, therefore, glean from my command philosophy to ensure that operational and administrative proficiencies of the Nigerian army units and formations are sustained and improved upon.\nThe Chief of Army Staff Combined Second and Third Quarter Conference 2021 was the first edition of the conference under Yahaya as army staff.\nThe quarterly programme of the Nigerian Army brought together Principal Staff Officers, General Officers Commanding, Commandants of Strategic Army formations, and operational commanders to brainstorm and interact with the Chief of Army Staff on the state of affairs of the Nigerian Army and review its plans for the next quarter."
  },
  {
    "headline": "Aviation Security Experts Worried over Designation of Two Sudanese Airlines to Nigeria",
    "summarized_story": "Reacting to the decision of the federal government, former Chief Security Officer of the Murtala Muhammed International Airport (MMIA), Festus Adeboye, told THISDAY that the regulatory authority, NCAA, should have considered the security implication of designating two Sudanese airlines to operate to Nigeria.\nAccording to him, “Our regulatory body ought to have considered the security implication of that decision.\nThey should know the security undertone of designating two Sudanese airlines to Nigeria, but maybe NCAA may have made recommendations against it, but the federal government decided to suppress it.\nWhy are the airlines not coming to Lagos, which has all the security apparatus?\nUnited Nations airport security personnel and the US Transport Security Administration (TSA) visit and inspect Lagos airport regularly."
  },
  {
    "headline": "Twitter Ban: Nigeria Loses $360m Revenue within 100 Days",
    "summarized_story": "By Ugo Aliogo and Oluchi ChibuzorA group of social enterprises yesterday announced that the continued suspension of the micro blogging site, Twitter, in Nigeria has cost the country about $360 million in economic revenue in 100 days of its suspension.\nThe coalition, which made the announcement, includes groups like Enough is Enough Nigeria (EiE), Paradigm Initiative (PIN), Media Rights Agenda (MRA), Socio-Economic Rights And Accountability Project (SERAP) among others.\n“This action is founded on the belief that the telecommunications operators have no legal authority to block our access to Twitter.\nThey also maintained that since June 4, 2021, Nigeria has not been the same as the effect of the Twitter ban touches all aspects of social and economic growth.\n“Nigeria has lost at least $360 million in the past 100 days since the twitter ban,” they revealed."
  },
  {
    "headline": "Entertainment Industry Can Tackle Internet Fraud, UK-based Nigerian Artiste Tells FG",
    "summarized_story": "By Victor OgunjeA United Kingdom based Nigerian Artiste, Busayo Osakuade , has appealed to the Federal Government to invest hugely in entertainment industry to wean Nigerians from criminal engagements in internet fraud.\nThe Ekiti born Nigerian afrobeat star said many of the youth engaging in internet fraud and other criminal activities could have been gainfully engaged in entertainment, if government had made the sector attractive .\nApart from checkmating ICT fraud, Osakuade added that entertainment industry had the proclivity to propel the country’s foreign earnings that can help in turning around the nosediving fortunes of the country’s economy.\nThe Artiste said this in Ado Ekiti on Monday while interacting with the newsmen on how best to develop Nigeria’s entertainment industry to develop talents.\nHe said: “Nigerian government should find a platform to bring out more artists especially upcoming artists."
  },
  {
    "headline": "Prominent Edo PDP Chieftain, Two Others Kidnapped",
    "summarized_story": "By Adibe EmenyonuA prominent chieftain of the Peoples Democratic Party (PDP) in Edo State, Pa Owere Dickson Imasogie, has been kidnapped.\nHe was said to have been abducted with his driver and another person, whose identity was not ascertained at press time on the Benin-Agbor highway on their way to the farm.\nApart from politics, Imasogie is a commercial farmer, who owns lot of farmlands where he cultivates both food and cash crops.\nThe abduction of Imasogie and two others with him was disclosed this morning on a platform of a group known as ‘Edo State Decide Movement’.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: How Director Of Nigeria’s Healthcare Agency, NPHCDA Uses COVID-19 Vaccination Exercise To Enrich Pocket – Workers",
    "summarized_story": "The recent drive by the Nigerian government to make COVID-19 vaccination compulsory for civil servants has been attributed to the lacklustre performance of the National Primary Healthcare Development Agency in the handling of the vaccination exercise across the country.\nSources in the agency told SaharaReporters that its Executive Director, Dr Faisal Shuaib, politicised the whole exercise at the detriment of getting Nigerians vaccinated.\nAnother source alleged that the agency’s Executive Director saw the vaccination programme as an avenue to enrich his pocket.\n\"In our agency, everything is overinflated, and no one dares to question the executive director.\nHe stated that with how the agency is undertaking the vaccination exercise, Nigeria might never attain effective vaccination of Nigerians against COVID-19."
  },
  {
    "headline": "EXCLUSIVE: How Director Of Nigeria’s Healthcare Agency, NPHCDA Uses COVID-19 Vaccination Exercise To Enrich Pocket – Workers",
    "summarized_story": "The recent drive by the Nigerian government to make COVID-19 vaccination compulsory for civil servants has been attributed to the lacklustre performance of the National Primary Healthcare Development Agency in the handling of the vaccination exercise across the country.\nSources in the agency told SaharaReporters that its Executive Director, Dr Faisal Shuaib, politicised the whole exercise at the detriment of getting Nigerians vaccinated.\nAnother source alleged that the agency’s Executive Director saw the vaccination programme as an avenue to enrich his pocket.\n\"In our agency, everything is overinflated, and no one dares to question the executive director.\nHe stated that with how the agency is undertaking the vaccination exercise, Nigeria might never attain effective vaccination of Nigerians against COVID-19."
  },
  {
    "headline": "EXCLUSIVE: How Director Of Nigeria’s Healthcare Agency, NPHCDA Uses COVID-19 Vaccination Exercise To Enrich Pocket – Workers",
    "summarized_story": "The recent drive by the Nigerian government to make COVID-19 vaccination compulsory for civil servants has been attributed to the lacklustre performance of the National Primary Healthcare Development Agency in the handling of the vaccination exercise across the country.\nSources in the agency told SaharaReporters that its Executive Director, Dr Faisal Shuaib, politicised the whole exercise at the detriment of getting Nigerians vaccinated.\nAnother source alleged that the agency’s Executive Director saw the vaccination programme as an avenue to enrich his pocket.\n\"In our agency, everything is overinflated, and no one dares to question the executive director.\nHe stated that with how the agency is undertaking the vaccination exercise, Nigeria might never attain effective vaccination of Nigerians against COVID-19."
  },
  {
    "headline": "BREAKING: Explosion Rocks Airport Road In Adamawa",
    "summarized_story": "A fuel tanker has exploded in the early hours of Monday in Yola, the capital of Adamawa state.\nThe incident happened at the busy PZ Roundabout along Airport Road.\nSaharaReporters learnt that the fuel compartment of the tanker, owned by Conoil, detached and fell while the driver was negotiating the roundabout.\nVehicles and shops within an 80-metre radius were burnt, causing losses yet to be evaluated.\nA combined team of firefighters from the state and federal fire services, Air Force, and Faro bottling company were seen working to put out the fire."
  },
  {
    "headline": "BREAKING: Explosion Rocks Airport Road In Adamawa",
    "summarized_story": "A fuel tanker has exploded in the early hours of Monday in Yola, the capital of Adamawa state.\nThe incident happened at the busy PZ Roundabout along Airport Road.\nSaharaReporters learnt that the fuel compartment of the tanker, owned by Conoil, detached and fell while the driver was negotiating the roundabout.\nVehicles and shops within an 80-metre radius were burnt, causing losses yet to be evaluated.\nA combined team of firefighters from the state and federal fire services, Air Force, and Faro bottling company were seen working to put out the fire."
  },
  {
    "headline": "Bandits abduct Catholic priest in Kaduna",
    "summarized_story": "Bandits have abducted Luka Yakusak, the priest in charge of St Matthew’s Catholic Church, Anchuna village, Zangon Kataf LGA, Kaduna state.\nWitnesses said the bandits shot sporadically when they invaded the community before heading to the official residence of the Catholic priest.\nHowever, Luka Binniyat, spokesman of the Southern Kaduna Peoples Union (SOKAPU), confirmed the abduction of the Catholic priest.\nAdvertisement“Yes, I can confirm that a Catholic priest in Achuna, Bishop Kukah’s village was abducted on Monday at about 8pm,” Binniyat said.\n“These persistent attacks and killings in the southern Kaduna communities, especially in Zangon Kataf LGA, and the seeming inability of security agencies to stop the attacks have made our people helpless."
  },
  {
    "headline": "Bandits abduct Catholic priest in Kaduna",
    "summarized_story": "Bandits have abducted Luka Yakusak, the priest in charge of St Matthew’s Catholic Church, Anchuna village, Zangon Kataf LGA, Kaduna state.\nWitnesses said the bandits shot sporadically when they invaded the community before heading to the official residence of the Catholic priest.\nHowever, Luka Binniyat, spokesman of the Southern Kaduna Peoples Union (SOKAPU), confirmed the abduction of the Catholic priest.\nAdvertisement“Yes, I can confirm that a Catholic priest in Achuna, Bishop Kukah’s village was abducted on Monday at about 8pm,” Binniyat said.\n“These persistent attacks and killings in the southern Kaduna communities, especially in Zangon Kataf LGA, and the seeming inability of security agencies to stop the attacks have made our people helpless."
  },
  {
    "headline": "Buhari seeks national assembly's approval to borrow fresh $4bn, €710m",
    "summarized_story": "President Muhammadu Buhari is seeking the approval of the national assembly to borrow fresh sums of $4,054,476,863 and €710 million in an addendum to the 2018-2020 borrowing plan.\nAdvertisementThe president also asked the national assembly to approve grant components of $125 million.\nThe request was in a letter read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday.\nIn July, the national assembly approved the sums of $8.3 billion and €490 million loans contained in the initial 2018-2020 borrowing plan.\n“The distinguished senate president may recall that u submitted a request on 2018-2020 borrowing plan for the approval of the senate in May 2021."
  },
  {
    "headline": "Buhari seeks national assembly's approval to borrow fresh $4bn, €710m",
    "summarized_story": "President Muhammadu Buhari is seeking the approval of the national assembly to borrow fresh sums of $4,054,476,863 and €710 million in an addendum to the 2018-2020 borrowing plan.\nAdvertisementThe president also asked the national assembly to approve grant components of $125 million.\nThe request was in a letter read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday.\nIn July, the national assembly approved the sums of $8.3 billion and €490 million loans contained in the initial 2018-2020 borrowing plan.\n“The distinguished senate president may recall that u submitted a request on 2018-2020 borrowing plan for the approval of the senate in May 2021."
  },
  {
    "headline": "Report: Anthony Stimler, former Glencore trader, exposes Diezani over bribery scheme in Nigeria",
    "summarized_story": "Anthony Stimler, a former employee of Glencore Plc West Africa desk, has exposed Diezani Alison-Madueke, ex-petroleum minister in Nigeria, in a bribery scheme in Nigeria.\n“I intended that a proportion of the payment to intermediaries operating in Nigeria were to be passed on to Nigerian state-owned oil company officials.\nAdvertisement“One of the primary trading houses that stepped up to buy those cargoes, according to prosecutors: Glencore.\n“Stimler ‘requested and received approval’ for a Glencore subsidiary to make the payment, prosecutors said, without specifying who granted it.\nNagle also mentioned that Glencore no longer works with intermediaries in a move to reduce the company’s business in high-risk jurisdictions."
  },
  {
    "headline": "These ten African countries have the cheapest data plans",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango /birdIn Africa, internet data is expensive currencySudan leads nine other African countries that charge its citizens less than $1 for a gigabyte (1 GB) of mobile data, a report by British technology research firm Cable shows.\nThe Northeastern Africa nation offers the lowest cost of internet access over a smartphone anywhere in Africa and ranks among the top five cheapest countries for mobile data, in the world, according to the Worldwide Mobile Data Pricing 2021.\nThe cost of mobile internet in Sudan is $0.27 for every gigabyte of data.\nAlgeria is second-cheapest at $0.51, while Somalia takes the third-cheapest slot on the continent, at $0.60 per 1GB of mobile data.\nThe report, which featured more than 230 countries across 12 regions and compared the cost of 1GB from over 6,000 mobile data plans, also pointed out that North Africa (at an average of $1.53) has the cheapest data plans in the world."
  },
  {
    "headline": "Meet the startup transforming informal recycling in Nigeria",
    "summarized_story": "Waste collection methods driven by local authorities remain inadequate, particularly in rural areas.\nIt serves two broad sets of users – waste producers and recycling businesses.\nOn the business side are mobile collectors – typically young, low-income Nigerians – that fulfill on-demand recovery requests from waste producers within an area.\nWaste producers get paid directly in mobile wallets and funds can be redeemed in cash or directly transferred to the individual’s account.\nImage Credit: SuppliedFormalising recycling in NigeriaIn Nigeria, the bulk of recyclable waste collection and processing is carried out by informal waste pickers and processors, with unregistered SMEs dominating the billion-dollar recycling sector."
  },
  {
    "headline": "Why Nigeria’s vehicle financing culture is struggling to take flight",
    "summarized_story": "But insufficient purchasing power among middle-class Nigerians coupled with limited or no access to vehicle financing puts cars out of reach for over 90% of the population.\nIn developed economies, car loans and vehicle financing schemes help people spread out vehicle payments over several months or even years.\nTwo major factors that influence the access and affordability of vehicle financing in Nigeria are interest rates and the value of the vehicle being financed, according to Gbenro Dara.\nAccording to Dara, the latter factor is the biggest drawback when it comes to vehicle financing in Nigeria.\nSeveral microlenders have developed vehicle financing programs, which take the asset as collateral."
  },
  {
    "headline": "MTN Group, Africa’s largest telecom, reportedly in talks to sell Afghanistan arm",
    "summarized_story": "Africa’s largest telecom company MTN Group is reportedly in talks with potential international buyers for its wireless business in Afghanistan per Bloomberg.\nThe South Africa headquartered company is currently the market leader in Afghanistan with a 40% share and is in discussions with several parties in ongoing negotiations to sell its Afghanistan arm.\nA writedown of MTN’s Afghanistan business without any proceeds from disposal is estimated to cost about R700 million ($49 million) according to undisclosed sources familiar with the negotiations.\nThe sale of its Afghanistan unit is crucial to MTN as it plans to raise about R15 billion ($1 billion) from shareholding sales in markets outside Africa.\nMTN currently serves over six million customers in Afghanistan, its planned exit could serve as an opportunity for other Afghanistan telecom players to expand their market share, while MTN does the same in Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Edo to collaborate with POWA on healthcare, education, others – Nigerian Observer",
    "summarized_story": "Edo to collaborate with POWA on healthcare, education, othersShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has disclosed plans to partner with the Police Officers Wives Association (POWA) in the area of education, healthcare and empowerment, among others.\nAccording to him, “Following the success recorded with the introduction of EdoBEST, the state government introduced EdoBEST 2.0, to address secondary, tertiary and technical education in Edo State.\n“We have also revamped our healthcare sector to bring healthcare closer to the people, making it accessible and affordable for Edo citizens.\nOn her part, the National President of POWA said the team, under her leadership, is focusing on three agenda; including education, healthcare and empowerment.\n“We have done a lot in healthcare, education and empowering our women with skills to advance the course of our women,” she added."
  },
  {
    "headline": "Obaseki prioritises female entrepreneurs, persons living with disabilities in disbursement of MSME support fund – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the government will give priority to female entrepreneurs and persons living with disabilities in the disbursement of Micro Small and Medium Enterprise (MSME) development fund.\nObaseki disclosed this while inaugurating the MSME Advisory Committee, led by Peter Obaseki at the Government House in Benin City.\nOther members of the committee include Mr. Joseph Eboigbe, Mrs. Ukinebo Dare, Mr. Kadiri and Mr. Philip Edigin.\n“We expect to target about 50,000 beneficiaries and also to help mentor at least 500 small businesses.\nWe hope that you help us build robust relationships with other local partners who have similar resources available to fund small and medium enterprises.”..."
  },
  {
    "headline": "Obaseki commiserates with Osaro Idah over mother’s demise – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commiserated with the Obazelu of Benin Kingdom and his former Special Adviser on Political Matters, Chief Osaro Idah, over the death of his mother, Madam Ayo Edna Awo-Osagie.\nObaseki, in a statement, expressed grief over her demise, praying that God grants the family the fortitude to bear the irreparable loss.\nThe governor noted: “I commiserate with Chief Osaro Idah over the passing of his mother, Madam Ayo Edna Awo-Osagie.\nShe was an inspiration to many, contributing immensely to the peace and development of her community.\n“I pray for the repose of her soul and may God grant you and your entire family the fortitude to bear this irreparable loss.”..."
  },
  {
    "headline": "COVID-19 3rd wave: 16 more unvaccinated persons die in Edo, as mortality rises to 50 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State has confirmed the death of 16 more persons who have not been inoculated with the COVID-19 vaccines, as the government intensifies vaccination across all communities in the state to protect citizens and achieve herd immunity against the COVID-19 virus.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nObi noted that the 16 new deaths recorded in the last 72 hours raised the total number of mortalities in the third wave of the pandemic in the state to 50.\nAccording to him, “Edo State is witnessing a steady rise in the number of deaths of persons who have not been inoculated with the COVID-19 vaccines, as the state, in the last 72 hours, recorded the death of 16 more unvaccinated persons.\n“The new fatality brings to 50, the total number of deaths recorded in the third wave of the pandemic in the state."
  },
  {
    "headline": "BREAKING: Buhari seeks NASS approval to borrow another $4bn, €710m loan",
    "summarized_story": "ADVERTISEMENTPresident Muhammadu Buhari is seeking the approval of the National Assembly to borrow another $4 billion ($4,054,476,863) and €710 million loan from bilateral and multilateral organisations to fund the deficit in the 2021 budget.\nThe president, in a letter to the Senate, said the loan request is an addendum to the 2018-2020 borrowing plan.\nHis request was contained in a letter read out by Senate President Ahmad Lawan, at the start of plenary on Tuesday.\n“The distinguished senate president may recall that u submitted a request on 2018-2020 borrowing plan for the approval of the senate in May 2021.\nHis recent loan request comes barely two months after the National Assembly approved his earlier request to borrow $8.3 billion and €490 million loans contained in the initial 2018-2020 borrowing plan."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun govt committed to training and retraining of its workforce – Adedeji",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State government under the leadership of governor Adegboyega Oyetola has restated its commitment to training and retraining of its workforce to sharpen their skills and widen their horizon for better performance.\nChairman, Osun State Local Government Service Commission, Elder Tunde Adedeji, stated this while declaring open a four-day Improvement Workshop on Effective Office Management for Clerical officers from grade level 04 to 06 in the Local Government Service.\nElder Adedeji explained that the training programme for the junior officers is important because they are the bedrock of the Local Government Service, hence the need for them to acquire work ethics to make them better leaders in future.\nThe Commission’s Boss commended the state governor, Mr. Oyetola who in his magnanimity in providing the necessary resources for the training programme despite the dwindling resources.\nAlso in his goodwill message, the NULGE President in the State, Dr. Kehinde Ogungbamigbe eulogised the state helmsman Mr. Oyetola for keeping to his promise of building the capacity of the workers in the state."
  },
  {
    "headline": "No inch of Igbo ancestral land will be given for grazing – elders warn SE governors",
    "summarized_story": "Elders in Igboland under the aegis of Igbo Elders Consultative Forum (IECF), have warned governors of the Southeast zone against any attempt to cede land to federal government for grazing by herdsmen.\nThe elders decried what it called delay by some states in the zone to pass their anti-open grazing laws, as resolved by the recent meeting of the Southern Governors’ Forum, vowing that no antics would make the region give out its ancestral land for grazing.\nWhile reaffirming the commitment of the Igbo to one Nigeria, the elders said they would not, however, allow any plot to enslave the Igbo in their own land.\n“Our people have stated clearly that our ancestral land should never be given to anybody and there is no grammar in governance that can make it happen.\nAnybody who wants to waste money should give money to incumbent governors, but when those governors go, nobody will follow the agreement reached."
  },
  {
    "headline": "Nigeria spends N11.679tn on debt servicing in five years – Report",
    "summarized_story": "The sums of N2.254 trillion and N2.951 trillion went into debt service in 2019 and 2020, respectively.\nIn 2018, 2019 and 2020, public debt stood at N24.387 trillion, N27.401 trillion, and N32.915 trillion, respectively.\nThe CSJ chief executive stated that the debt service figures provided the factual background to the presentation of the Medium Term Expenditure Framework (MTEF’s) position on consolidated debt.\nHe said, “The Consolidated Debt Statement affirms the Medium-Term Debt Management Strategy (MTDS) 2020-2023 as the governing policy strategy.\n“Special interventions funds amounts to 3.04 per cent, 2.94 per cent, 2.61 per cent and 2.39 per cent respectively for the years 2021, 2022, 2023 and 2024."
  },
  {
    "headline": "Fitch upgrades Lagos ratings to triple A, says state is in good standing",
    "summarized_story": "OBINNA EZUGWUGlobal rating agency Fitch, has upgraded its rating of Lagos State from AA+ (nga) to AAA(nga) for its good standing in terms of its debt sustainability and resilience.\nFitch in its recent publication outlining the standing of the state, said it benefits from a solid revenue structure driven by IGR, which represents 70% of its N620bn operating revenue at the end of Y2020.\nCommunicating the development to the Honourable Commissioner for Finance, Dr. Rabiu Olowo, FitchRatings said the feat was published in the Y2020/2021 rating report, noting that the upgrade of the National Long-Term Rating reflects Lagos State’s strength compared with national peers as well as its resilient operating performance during the Pandemic.\nThe congratulatory message signed by the Senior Director, Head Sub-Saharan Africa, Mr. Andrew Parkinson, said: “I just wanted to say congratulations on the upgrade to AAA (nga).\n“The assessment reflects Fitch’s view of risk relative to international peers with the ability to recover debt service with the operating balance,” he said."
  },
  {
    "headline": "UAE Declares 6 Nigerians Wanted For Terrorism",
    "summarized_story": "The United Arab Emirates (UAE) has added 38 individuals including six Nigerians and 15 entities to its terror designation list, according to state-run WAM news agency.\nThe decision, WAM stated, comes within the framework of the UAE’s efforts to target and disrupt networks associated with the financing of terrorism and its associated activities.\nThe UAE labeled four Emiratis, two Lebanese, eight Yemenis, five Syrians, five Iranians, six Nigerians, two Iraqis, one each from India, Afghanistan, Britain, Saint Kitts-Navis, Russia, and Jordan.\nADVERTISEMENTThe following is the full list of added individuals:Ahmed Mohammed Abdulla Mohammed Alshaiba Alnuaimi (UAE) Mohamed Saqer Yousif Saqer Al Zaabi (UAE) Hamad Mohammed Rahmah Humaid Alshamsi (UAE) Saeed Naser Saeed Naser Alteneiji (UAE) Hassan Hussain Tabaja (Lebanon) Adham Hussain Tabaja (Lebanon) Mohammed Ahmed Musaed Saeed (Yemen) Hayder Habeeb Ali (Iraq) Basim Yousuf Hussein Alshaghanbi (Iraq) Sharif Ahmed Sharif Ba Alawi (Yemen) Manoj Sabharwal Om Prakash (India) Rashed Saleh Saleh Al Jarmouzi (Yemen) Naif Nasser Saleh Aljarmouzi (Yemen) Zubiullah Abdul Qahir Durani (Afghanistan) Suliman Saleh Salem Aboulan (Yemen) Adel Ahmed Salem Obaid Ali Badrah (Yemen) Ali Nasser Alaseeri (Saudi Arabia) Fadhl Saleh Salem Altayabi (Yemen) Ashur Omar Ashur Obaidoon (Yemen) Hazem Mohsen Farhan + Hazem Mohsen Al Farhan (Syria) Mehdi Azizollah Kiasati (Iran) Farshad Jafar Hakemzadeh (Iran) Seyyed Reza Mohmmad Ghasemi (Iran) Mohsen Hassan Kargarhodjat Abadi (Iran) Ibrahim Mahmood Ahmed Mohammed (Iran) Osama Housen Dughaem (Syria) Abdurrahaman Ado Musa (Nigeria) Salihu Yusuf Adamu (Nigeria) Bashir Ali Yusuf (Nigeria) Muhammed Ibrahim Isa (Nigeria) Ibrahim Ali Alhassan (Nigeria) Surajo Abubakar Muhammad (Nigeria) Alaa Khanfurah – Alaa Abdulrazzaq Ali Khanfurah – Alaa Alkhanfurah (Syria) Fadi Said Kamar (Great Britain) Walid Kamel Awad (Saint Kitts and Nevis) Khaled Walid Awad (Saint Kitts and Nevis) Imad Khallak Kantakdzhi (Russia) Mouhammad Ayman Tayseer Rashid Marayat (Jordan)The following is the full list of the added entities:1.\nRay Tracing Trading Co LLC"
  },
  {
    "headline": "UAE Declares 6 Nigerians Wanted For Terrorism",
    "summarized_story": "The United Arab Emirates (UAE) has added 38 individuals including six Nigerians and 15 entities to its terror designation list, according to state-run WAM news agency.\nThe decision, WAM stated, comes within the framework of the UAE’s efforts to target and disrupt networks associated with the financing of terrorism and its associated activities.\nThe UAE labeled four Emiratis, two Lebanese, eight Yemenis, five Syrians, five Iranians, six Nigerians, two Iraqis, one each from India, Afghanistan, Britain, Saint Kitts-Navis, Russia, and Jordan.\nADVERTISEMENTThe following is the full list of added individuals:Ahmed Mohammed Abdulla Mohammed Alshaiba Alnuaimi (UAE) Mohamed Saqer Yousif Saqer Al Zaabi (UAE) Hamad Mohammed Rahmah Humaid Alshamsi (UAE) Saeed Naser Saeed Naser Alteneiji (UAE) Hassan Hussain Tabaja (Lebanon) Adham Hussain Tabaja (Lebanon) Mohammed Ahmed Musaed Saeed (Yemen) Hayder Habeeb Ali (Iraq) Basim Yousuf Hussein Alshaghanbi (Iraq) Sharif Ahmed Sharif Ba Alawi (Yemen) Manoj Sabharwal Om Prakash (India) Rashed Saleh Saleh Al Jarmouzi (Yemen) Naif Nasser Saleh Aljarmouzi (Yemen) Zubiullah Abdul Qahir Durani (Afghanistan) Suliman Saleh Salem Aboulan (Yemen) Adel Ahmed Salem Obaid Ali Badrah (Yemen) Ali Nasser Alaseeri (Saudi Arabia) Fadhl Saleh Salem Altayabi (Yemen) Ashur Omar Ashur Obaidoon (Yemen) Hazem Mohsen Farhan + Hazem Mohsen Al Farhan (Syria) Mehdi Azizollah Kiasati (Iran) Farshad Jafar Hakemzadeh (Iran) Seyyed Reza Mohmmad Ghasemi (Iran) Mohsen Hassan Kargarhodjat Abadi (Iran) Ibrahim Mahmood Ahmed Mohammed (Iran) Osama Housen Dughaem (Syria) Abdurrahaman Ado Musa (Nigeria) Salihu Yusuf Adamu (Nigeria) Bashir Ali Yusuf (Nigeria) Muhammed Ibrahim Isa (Nigeria) Ibrahim Ali Alhassan (Nigeria) Surajo Abubakar Muhammad (Nigeria) Alaa Khanfurah – Alaa Abdulrazzaq Ali Khanfurah – Alaa Alkhanfurah (Syria) Fadi Said Kamar (Great Britain) Walid Kamel Awad (Saint Kitts and Nevis) Khaled Walid Awad (Saint Kitts and Nevis) Imad Khallak Kantakdzhi (Russia) Mouhammad Ayman Tayseer Rashid Marayat (Jordan)The following is the full list of the added entities:1.\nRay Tracing Trading Co LLC"
  },
  {
    "headline": "IGP Appoints DSP Adeh As FCT Command Spokesperson",
    "summarized_story": "The inspector-general of police, IGP Usman Alkali Baba, has approved the posting of DSP Adeh Josephine as the new Police Public Relations Officer (PPRO) of the Federal Capital Territory Police Command.\nDSP Adeh before her current posting as FCT PPRO, was the 2 i/c in charge of Strategic Communications at the Force Public Relations Department.\nThe PPRO was also a one-time deputy police adviser as a police attaché in New York, United States of America.\nADVERTISEMENTDSP Josephine is an associate Member of the Nigerian Institute of Public Relations (ANIPR) and member of the International Association of Chiefs of Police (IACP).\nThe IGP said the appointment is with immediate effect."
  },
  {
    "headline": "IGP Appoints DSP Adeh As FCT Command Spokesperson",
    "summarized_story": "The inspector-general of police, IGP Usman Alkali Baba, has approved the posting of DSP Adeh Josephine as the new Police Public Relations Officer (PPRO) of the Federal Capital Territory Police Command.\nDSP Adeh before her current posting as FCT PPRO, was the 2 i/c in charge of Strategic Communications at the Force Public Relations Department.\nThe PPRO was also a one-time deputy police adviser as a police attaché in New York, United States of America.\nADVERTISEMENTDSP Josephine is an associate Member of the Nigerian Institute of Public Relations (ANIPR) and member of the International Association of Chiefs of Police (IACP).\nThe IGP said the appointment is with immediate effect."
  },
  {
    "headline": "2023: Elumelu Urges Okowa To Run For Presidency",
    "summarized_story": "Ndudi Elumelu, has urged the Delta State governor, Dr. Ifeanyi Okowa, to contest the 2023 presidential election.\nHe made the call in a statement titled, ‘2023: Elumelu urges Gov.\nOkowa to run for Presidency,’ signed by his Senior Legislative Aide, Tony Ayaegbunam, in Abuja, on Sunday.\n“Governor Okowa is a rare gift not only to Delta state but also to our nation Nigeria, at large.\nHe said, “I, therefore, beckon on all Nigerians to join hands in the collective democratic efforts to rescue our nation from the stranglehold of the APC.”"
  },
  {
    "headline": "Alleged fraud: Governor Ganduje’s son drags mother to EFCC",
    "summarized_story": "According to Premium Times, Mrs Ganduje was invited to report last Thursday to the Abuja headquarters of the EFCC.\nAbdulazeez had dragged his mum, Hafsat Ganduje, to the EFCC, sources familiar with the matter said, suggesting a pattern of corruptly using family access to power for private enrichment.\nGanduje, the governor, had previously been involved in a corruption-related scandal.\nAsked to comment on the matter, a spokesperson for Kano State Government, Mohammed Garba, said, “I am not aware” and, so, he could not comment.\nEFCC’s spokesperson, Wilson Uwujaren, did not comment on the matter when contacted on Monday."
  },
  {
    "headline": "Alleged fraud: Governor Ganduje’s son drags mother to EFCC",
    "summarized_story": "According to Premium Times, Mrs Ganduje was invited to report last Thursday to the Abuja headquarters of the EFCC.\nAbdulazeez had dragged his mum, Hafsat Ganduje, to the EFCC, sources familiar with the matter said, suggesting a pattern of corruptly using family access to power for private enrichment.\nGanduje, the governor, had previously been involved in a corruption-related scandal.\nAsked to comment on the matter, a spokesperson for Kano State Government, Mohammed Garba, said, “I am not aware” and, so, he could not comment.\nEFCC’s spokesperson, Wilson Uwujaren, did not comment on the matter when contacted on Monday."
  },
  {
    "headline": "Again, Naira crashes to N550/$1 in parallel market",
    "summarized_story": "The naira on Monday suffered a major setback, losing N5 to close at N550 to dollar at the parallel market.\nThe naira exchanges at N410.51 to dollar at the official market.\nThe N139.49 rate disparity between the official and parallel market rates has led to massive hoarding of scarce dollars and abuse of Central Bank of Nigeria (CBN) guidelines on foreign exchange trading.\nHe said naira rates convergence would require adoption of a full floating exchange rate system determined by the forces of demand and supply.\nLikewise, the International Monetary Fund (IMF) said exchange rate rigidities have constrained the economy’s ability to absorb external shocks."
  },
  {
    "headline": "Again, Naira crashes to N550/$1 in parallel market",
    "summarized_story": "The naira on Monday suffered a major setback, losing N5 to close at N550 to dollar at the parallel market.\nThe naira exchanges at N410.51 to dollar at the official market.\nThe N139.49 rate disparity between the official and parallel market rates has led to massive hoarding of scarce dollars and abuse of Central Bank of Nigeria (CBN) guidelines on foreign exchange trading.\nHe said naira rates convergence would require adoption of a full floating exchange rate system determined by the forces of demand and supply.\nLikewise, the International Monetary Fund (IMF) said exchange rate rigidities have constrained the economy’s ability to absorb external shocks."
  },
  {
    "headline": "Pastor Yongi Cho, who used to have world's largest congregation, is dead",
    "summarized_story": "South Korean Pastor David Yongi Cho, who used to have the largest church and congregation in the world has died at the age of 85.\nThe son of Cho Doo-chun and Kim Bok-sun, Cho was the eldest of five brothers and four sisters.\nCho had spent more than 44 years emphasizing the importance of cell group ministry, which he believed was the key to church growth, as well as team ministry.\nIn November 1976, Cho founded Church Growth International, an organization dedicated to teaching the principles of evangelism and church growth to pastors all over the world.\nIn 2008, Cho retired, with Young Hoon Lee succeeding him as senior pastor."
  },
  {
    "headline": "Jonathan, Sirleaf billed for AFBA conference on ending conflicts in Africa",
    "summarized_story": "Former President Goodluck Jonathan will join other former presidents, top lawyers, policymakers, and other stakeholders in the justice sector for the 2021 African Bar Association (AfBA) Annual Conference in Niamey, Republic of Niger.\nThe conference, scheduled to hold between Oct. 3 and 7, 2021 will feature stakeholders from across Africa, Vice Chairman (Nigerian Forum AFBA), Mr. Owoicho Adejo-Ogiri.\nSpeaking with newsmen on Tuesday in Abuja, Adejo-Ogiri disclosed that the keynote speaker at the conference will be the 2018 Nobel Prize winner from DR Congo, Dr Denis Mukwege.\nHe said that the conference which is to be held at the Mahatma Gandhi International Conference Centre will have stakeholders advance discussion on the theme `Accountable Governance as a Panacea for the Unending Conflicts in Africa: The Legal Profession as the Driver’.\nOthers are Judge Navanethem Pillay, the first woman of colour to be appointed as Judge in South Africa; and 2016 AfBA Conference keynote speaker, Mr Joseph Daudu (SAN); as well as Dr Abdulsamad Rabiu, Founder/Chairman of BUA Group, among others."
  },
  {
    "headline": "BREAKING: Putin In COVID-19 Scare, Self Isolates",
    "summarized_story": "Russia’s President Vladimir Putin is self-isolating after many of his acquaintances were found to be COVID-19 positive.\nBut the Kremlin said Putin is “absolutely” healthy and does not have the disease himself.\nKremlin spokesman Dmitry Peskov told reporters that Putin had been in touch with several people in his entourage who had fallen ill with COVID-19.\n“Of course we know who fell ill in the president’s entourage and the self-isolation (regime) does not directly affect the president’s work,” said Peskov.\nBut that does not affect their frequency and the president will continue his activity via video conferences.”Asked if Putin had tested negative for COVID-19, Peskov said: “Of course yes."
  },
  {
    "headline": "Sit-At-Home Order: Gunmen Invade School As WASSCE Students Run For Dear Lives",
    "summarized_story": "Opeyemi Damilare aka Mario is a writer who loves to share and inform the masses with contents relating to their beliefs, lifestyle and entertainment.\nStudying Computer Science at Tai Solarin University of Education.\nWhenever I’m not writing, I play the drums or read."
  },
  {
    "headline": "BREAKING: Buhari Seeks N’Assembly’s Approval To Borrow Fresh $4Bn, €710m",
    "summarized_story": "President Muhammadu Buhari is seeking the approval of the national assembly to borrow fresh sums of $4,054,476,863 and €710 million in an addendum to the 2018-2020 borrowing plan.\nThe president also asked the national assembly to approve grant components of $125 million.\nThe request was in a letter read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday.\nIn July, the national assembly approved the sums of $8.3 billion and €490 million loans contained in the initial 2018-2020 borrowing plan.\n“The distinguished senate president may recall that u submitted a request on 2018-2020 borrowing plan for the approval of the senate in May 2021."
  },
  {
    "headline": "BREAKING: UAE Names Six Nigerians Among 38 Global Sponsors Of Terrorism",
    "summarized_story": "Six Nigerians have been placed on the Middle East giant’s watch list: Abdurrahaman Ado Musa, Salihu Yusuf Adamu, Bashir Ali Yusuf, Muhammed Ibrahim Isa, Ibrahim Ali Alhassan, and Surajo Abubakar Muhammad.\nAhmed Mohammed Abdulla Mohammed Alshaiba Alnuaimi (UAE)2.\nMohammed Ahmed Musaed Saeed (Yemen)8.\nRashed Saleh Saleh Al Jarmouzi (Yemen)13.\nNaser Aljarmouzi Cargo & Clearing LLC49."
  },
  {
    "headline": "Open grazing: Abdullahi Adamu slams El-Rufai, Masari, Ortom, advocates free movement of cattle",
    "summarized_story": "A former governor of Nasarawa state and serving federal lawmaker, Senator Abdullahi Adamu, has faulted northern governors planning to ban open grazing in their states.\nAs at the time of this report, Ondo state Governor Rotimi Akeredolu and his Enugu counterpart, Ifeanyi Ugwuanyi had signed the anti-open grazing law, making open grazing an offence in their states.\nEl-Rufai, Masari, Ortom on open grazingAlthough the former governor was not specific on any northern governor, but Kaduna state Governor Nasir El-Rufai and his Katsina counterpart, had at different times faulted the open grazing by cattle herders.\nAlso, Benue state Governor David Ortom has signed into law the ban on open grazing amidst criticisms from certain quarters.\nSpeaking earlier in the year during a visit to Yola, Adamawa state, Governor El-Rufai had said:“I am a Fulani man."
  },
  {
    "headline": "Kogi jailbreak: We ‘re mobilising Interpol to track 256 escaped inmates – FG",
    "summarized_story": "Armed men have attacked a prison facility in Kabba, Kogi state, killing two officials and freeing many inmates, the federal government has confirmed.\nFasure also said security officers on duty, comprising 15 soldiers, 10 Police officers and 10 armed guards of the Nigeria Correctional Service “fought gallantly to repel the attack.\n“During the attack, security officers on duty which comprised of 15 Soldiers, 10 Police Officers and 10 armed guards of the NCoS on duty fought gallantly to repel the attack.\n“The Controller General of the Nigeria Correctional Service, Haliru Nababa, is currently monitoring the situation.\n“The Nigeria Correctional Service shall not be cowed by elements seeking to compromise the security of our nation; we shall deal with this situation with absolute resolve."
  },
  {
    "headline": "Breaking: Kogi state breaks silence on attack at correctional centre",
    "summarized_story": "The Kogi state government has confirmed the attack by some unknown gunmen at the Kabba correctional centre.\n“The State Security Adviser, Commander Jerry Omodara (rtd) is currently at the Centre with the Kogi state Commissioner of Police and the Commander, Army Records, Lokoja.\nSecurity agencies have zeroed in to ensure those who escaped are rearrested as well as trail the masterminds of the attack.\n“We have confidence in our security agencies to unmask the masterminds responsible for the attack and get them apprehended.\n“Our people should go about their normal businesses as security agencies are doing their best to ensure security of lives and property in the face of the unfortunate breach,” the commissioner said."
  },
  {
    "headline": "PILA Africa tasks women on collaboration, seeks opportunity for more women in governance -NigPilot",
    "summarized_story": "Statistics show that women constitute a significant chunk of the demography of African continent with population of approximately 691m.\n“PILA Africa is an initiative of PILA Nigeria, which has snowballed into many other African countries establishing similar associations and a lot more at the verge of concluding their modalities.\nIt is expected that many other African countries here represented, will be encouraged to establish their local associations.\nOn how women can take control of their narrative, she emphasized the need for women to strategize, ensure female child education as well as women participation in politics and policy formulation.\nShe also listed the benefits of women Collaboration to include economic growth; achieving the 2030 agenda for sustainable development; achieving the gender parity realization of women rights and gender equality amongst others."
  },
  {
    "headline": "AIO president unveils 5-point agenda -NigPilot",
    "summarized_story": "THE Vice President of the African Insurance Organisation (AIO), Mr. Tope Smart, has assumed the leadership of AIO, just as he unveiled a five-point agenda that will serve as a compass for his one-year administration.\nThe baton of leadership and insignia of office of the President of AIO was handed over to Mr. Smart at the gala dinner marking the end of the 47th Conference and General Assembly of the AIO in Lagos, Nigeria.\nHe charged the new AIO President to collaborate with governments of various member countries to persuade them to play their roles well especially in the promotion of healthy competition and industry-friendly regulations and policies.\nWhile promising government support for the new AIO president, Thomas equally urged him to leave no stone unturned by ensuring that great achievements are recorded when his tenure is over.\nThe event was also used to give recognition awards to some insurance professionals in Africa who contributed in one way or the other to the growth of the African Insurance market."
  },
  {
    "headline": "Access Bank, Xploits Consulting organise business innovation program for widows, vulnerable -NigPilot",
    "summarized_story": "In concerted efforts to provide succor and alleviate poverty levels, Xploits Consulting Limited has partnered with Access Bank Limited to organize a business innovation program for widows, vulnerable persons in the FCT to enable them to provide for their homes.\nSpeaking during the workshop, the Director Communication, Xploits Consulting Limited Abuja, Mrs Grace Taiwo said that the aim of the workshop was to equip widows and vulnerable people especially in IDPs, single mothers and female orphans with business ideas development and application skills.\nShe further thanked Access Bank Plc for considering Xploits Consulting Ltd as a partner in implementing their sustainability programs in Northern Nigeria.\nIn a related development Xploits Consulting Limited and Access Bank Plc also organized a 2 day skills acquisition for widows to mark the International Day for Widows and to provide succour and support to enable cater for the household.\nSpeaking on behalf of the participants at the end of the training, Mrs Esther Adoyi thanked Xploits consulting Ltd for facilitating the training and Access Bank Ltd for their support."
  },
  {
    "headline": "NGSA assures on adequate predictive analysis to check earth tremors -NigPilot",
    "summarized_story": "He said that they were able to capture predictive analysis from the Ilorin which monitors Shaki and areas surrounding it.\nThe DG noted that consistent monitoring of tremors would help alert appropriate authorities and help study, mitigate and manage such situations.\n“Earth tremor is a natural occurrence which humans don’t have control over.\nBefore the end of the year and early next year we will have more monitoring stations.\nRecall that an earth tremor was recorded in the Mpape axis of the Federal Capital Territory of which NGSA had commissioned and put in place equipment to monitor future occurrences."
  },
  {
    "headline": "12 Killed As Gunmen Attack Kaduna Community",
    "summarized_story": "No fewer than 12 people have been killed following an attack by gunmen on Peigyim village, near Kibori at Atyap Chiefdom in Zangon Kataf Local Government Area of Kaduna State.\nCommissioner for Internal Security and Home Affairs in Kaduna, Samuel Aruwan, confirmed the attack in a statement on Monday.\nHe explained that the gunmen invaded the community on Sunday night and opened fire on the residents, leading to the death of 12 locals.\nIn his reaction, Governor Nasir El-Rufai condemned the attack and condoled with the grieving families of the victims.\nThe attack comes barely 24 hours after a pastor of the ECWA Church was murdered in the same community."
  },
  {
    "headline": "COVID-19: Nigeria Records 387 New Cases, 21 More Deaths",
    "summarized_story": "Nigeria has recorded 387 new cases of the COVID-19 with 21 more deaths across the country.\nThe Nigeria Centre for Disease Control (NCDC) disclosed this in an update on Monday night.\nTill date, 199,538 cases have been confirmed, 188,427 patients have been discharged and 2,619 deaths have been recorded in 36 states and the Federal Capital Territory.\nThe United States remains the worst-hit country with 660,177 deaths, followed by Brazil with 586,851, India with 442,874, Mexico with 267,748 and Peru with 198,764.\nBelow is a breakdown of the COVID-19 cases across Nigeria."
  },
  {
    "headline": "Kogi Jailbreak: Soldier, Policeman Killed, Two NCoS Officials Missing – FG",
    "summarized_story": "Two security operatives were killed when gunmen invaded the Kabba Medium Security Custodial Centre in Kogi State, authorities have said.\nGiving more details regarding the event, Aregbesola explained that security officers – comprising 15 soldiers, 10 police officers, and 10 armed guards of the NCoS – on duty “fought gallantly” to repel the attack.\nAccording to the minister, the controller-general of NCoS is currently monitoring the situation and a ‘crisis response centre’ has been activated.\nTo the fleeing inmates, the minister warned that “escaping from lawful custody is a serious criminal offence.\nLaw enforcement agencies and citizens are lawfully empowered to use all necessary means to arrest and bring you to justice."
  },
  {
    "headline": "VIDEO: Properties, Businesses Destroyed As Tanker Explodes In Yola",
    "summarized_story": "﻿No fewer than 30 business centres and shops were razed on Monday morning following a tanker explosion in Yola, Adamawa State.\nTragedy struck after the tanker, laden with Premium Motor Spirit (PMS), also known as petrol, attempted to negotiate the popular Maidoki Roundabout in the state capital.\nThereafter, the tanker overturned, separating from the main vehicle and spilled its content on the road and into a nearby drainage around the busy PZ industrial layout along the Airport Road.\nThe emergency responders were supported by their counterparts from the Nigerian Air Force (NAF) Base in Yola, and others.\nThey battled the raging fire and brought it under control, preventing further damage to the nearby petrol and gas stations in the area."
  },
  {
    "headline": "AGF Tasks Appeal Court Judges On Speedy Dispensation Of Justice",
    "summarized_story": "﻿ ﻿ ﻿The Attorney General of the Federation, Abubakar Malami, has asked justices of the Court of Appeal to contribute positively to the judicial system by speedily concluding cases before them at the level of the Appeal Court.\nMalami made the appeal on Monday at the special session to mark the 2021 Legal Year of the Court of Appeal.\nHe also reminded the justices that a lot is expected of them in the delivery of credible judgement that will foster and promote public confidence in all rulings that emanate from the courts.\nMore to follow."
  },
  {
    "headline": "Flood cuts off Adamawa/Borno bridge, paralyses economic activities -",
    "summarized_story": "Flood caused by heavy downpour has cut off the bridge linking Adamawa and Borno States, thereby affecting the business activities in the two states as goods particularly farm produce can no longer be moved in and out.\nThe damaged bridge is between Shuwa and Gulak in Madagali Local Government, Adamawa State.\nHe had visited the NEDC twice to complain about abandoned projects including the collapsed bridge.\nGov Fintiri acknowledges that floods have greatly affected the livelihood of his people in KirchingaHe insists he has used the state resources to rebuild some damaged infrastructure in the area to alleviate difficulties his people were going through, in line with his political promises.\nThe NEDC must rise up to the task by working round the clock to bring relief to residents of madagaliTheir expectation is to see the collapsed bridge linking them to the rest of the word fixed at the shortest possible time."
  },
  {
    "headline": "House resumes, suspends plenary in honour of late member",
    "summarized_story": "The House of Representatives has resumed plenary activities after two months of annual vacation.\nBut it suspended all legislative actions for the day to honour of one its members, Adedayo Omolafe, who died on the 15th of August.\nSpeaker Femi Gbajabiamila, officially announced the death of the Ondo legislator popularly called Expensive and a minute of silence held in his honour.\nIslamic and Christian prayers were held for the repose of the deceased before the House Leader, Alhassan Ado-Doguwa, moved for adjournment of the plenary to Wednesday, 15th August."
  },
  {
    "headline": "Ondo Approves Deji Of Akure As Chairman, Ondo Council Of Obas -",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has approved the appointment of the Deji of Akure, His Royal Majesty, Oba Aladetoyinbo Ogunlade Aladelusi as the Chairman, Ondo State Council of Obas.\nOba Aladelusi’s appointment follows the expiration of the two-year single tenure of the immediate past Chairman of the council, Oba (Dr.) Fredrick Eniolorunda Obateru Akinruntan, Olugbo of Ugbo, who was appointed on the 13th September, 2019.\nThe tenure of the new Chairman starts today, 14th September, 2021.\nGovernor Akeredolu appreciates the council under the leadership of the erstwhile Chairman, the Olugbo of Ugbo, who did excellently well and gave all necessary support to ensure that the good people of Ondo State enjoy good governance.\nThe Governor urges the new chairman to improve on the record of his predecessor by working in harmony with his brother Obas and the government in ensuring the development of the state."
  },
  {
    "headline": "ICPC invites Former IGP, Suleiman Abba., Others over police Trust Fund -",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) has commenced a probe into the N11 billion contracts by the Nigeria Police Trust Fund (NPTF).\nThe ICPC has invited ex-Inspector General of Police Suleiman Abba and seven others to appear before it on the matter.\nThough a source within the Trust Fund denied the allegations saying the Executive Secretary has been operating within the law.\nPursuant to the Nigeria Police Trust Fund Establishment Act 2019, President Muhammadu Buhari on May 6, 2020 approved the appointment ex-IGP Suleiman Abba and six others as members of the Board of Trustees of NPTF.\nMansur Ahmed – Representing Organized Private Sector being Executive Director, Dangote Group and President, Manufacturers Association of Nigeria (MAN); and Dr. Michael Bamidele Adebiyi – Representing Civil Society Group."
  },
  {
    "headline": "South Korea’s Antitrust Regulator To Fine Google $177m Over Improper Mobile Market Dominance",
    "summarized_story": "South Korea’s competition regulator has vowed to fine Google the U.S. tech giant, $176.9 million (207.4b Korean won) for allegedly using its dominant market position in the mobile operating system space to stifle competition.\nThe announcement which was made on Tuesday by the antitrust regulator or Korea Fair Trade Commission, allegedly stated that Google used its market position to block smartphone makers like Samsung from using operating systems developed by rivals.\nGoogle’s Android operating system which currently holds the lion’s share of the smartphone market, ahead of Apple’s iOS platform, was also allegedly practice stifled innovation in the development of new operating systems for smartphones, according to Yonhap News.\nThat agreement prevented device makers from installing modified versions of the Android operating system, known as “Android forks,” on their handsets, Yonhap reported.\nA Google spokesperson argued that Android’s compatibility program has spurred hardware and software innovation, and brought success to Korean phone makers and developers."
  },
  {
    "headline": "Rwandan Businessman Shot Dead in Mozambique",
    "summarized_story": "Revocant Karemangingo, a Rwandan businessman has been shot dead in Matola municipality, a few kilometres outside the Mozambican capital, Maputo.\nMr Karemangingo was shot about 50m from his residence in the Liberdade neighbourhood on Monday afternoon.\nThe killers are so far not known, much less the reasons for the crime that shocked the neighbourhood and the Rwandan community in Mozambique.\nThe Rwandan community has asked the Mozambican government to provide more protection.\nIn 2019, another Rwandan, Louis Baziga, was shot dead in a similar style in a Maputo suburb after gunmen intercepted his car."
  },
  {
    "headline": "Nigeria Targets 52m Vaccines by Q2 2022, Removes India From List of Flagged Countries",
    "summarized_story": "The federal government has projected that it will receive about 55 million doses of vaccines by April 2022 to ensure that more Nigerians are vaccinated against the dreaded COVID-19.\n“To ease travels for fully vaccinated Nigerians, we are exploring the principles of reciprocity between Nigeria and other nations.\nHe also disclosed that as of Monday, September 12, 2021, the country had attained a national average of 70.4 per cent utilisation of the 2,000,040 doses of Moderna vaccines it received.\nHe warned against an attempt by anyone to produce, procure and sell fake Covid-19 vaccination cards, saying anyone caught illegally transacting would be apprehended and made to face the law.\nAccording to him, any state found to be condoning these acts of corruption would no longer be allocated vaccines."
  },
  {
    "headline": "Nigeria: 99 Inmates Recaptured, Over 150 Still at Large after Kogi Jailbreak",
    "summarized_story": "Security operatives on Monday recaptured about 99 inmates out of the 294 that escaped from the Kabba Correctional Centre in Kogi State, after some gunmen attacked the facility at about 11.03 Sunday night.\nThe gunmen, however, had a field day shooting sporadically into the air, which enabled them to carry out their mission.\nThe Comptroller General, Haileru Dan Baba, said investigation into the development had commenced but declined further comment on the matter.\nAll heads of security agencies, including the Assistant Inspector General of Police, State Commissioner of Police, Commander, Army Records, Director State Security Service and special adviser to the Kogi State Governor, Jerry Omodara had also visited the scene of attack.\nThe minister, therefore, assured the citizenry that Nigeria’s security forces would find the attackers and bring them to justice."
  },
  {
    "headline": "OPEC Increases 2022 Global Oil Demand Forecast By 1mbpd",
    "summarized_story": "The Organisation of Petroleum Exporting Countries (OPEC) on Monday expanded its global oil demand forecast for 2022 by almost one million barrels per day (bpd), to 100.83 million bpd.\nThis was a 4.15 million bpd increase from the 2021 figure and a steep hike from the 3.28 million bpd growth projection it made last month.\nIt trimmed its world oil demand forecast for the last quarter of 2021 due to the Delta coronavirus variant, saying a further recovery would be delayed until next year when consumption would exceed pre-pandemic rates.\nOPEC said in the report, “The increased risk of COVID-19 cases primarily fuelled by the Delta variant is clouding oil demand prospects going into the final quarter of the year.\nAs a result, second-half 2021 oil demand has been adjusted slightly lower, partially delaying the oil demand recovery into first-half 2022.”On the back of the new report, oil prices rose for a second session on Monday, fuelled by concerns over shut output in the United States, following damage from Hurricane Ida."
  }
]