[
  {
    "headline": "‘14% women raped, 91% sexually harassed by bosses’",
    "summarized_story": "About 91 per cent of cases of sexual harassment in workplaces faced by women were being perpetrated by their bosses and superiors, research by a civil rights organization, HEIR Women Development Initiative, revealed.\nHEIR Women Development is a social enterprise borne out of the need to see young women take on more decision-making positions, and venture into leadership opportunities.\n14 per cent of the respondents revealed that they have been raped at work.\nThe major perpetrators of sexual harassment at work are seen to be bosses or superior, 91 per cent reported.\nTherefore, this germane project seeks to identify with evidential data, the career barriers confronting young women with a lens into sexual harassment menace."
  },
  {
    "headline": "Osinbajo, Makinde eulogise Alao-Akala as ex-gov buried in Ogbomoso",
    "summarized_story": "Vice President of Nigeria, Prof. Yemi Osinbajo, on Friday led prominent Nigerians to pay their last respect to former governor, Adebayo Alao-Akala, who was buried at his residence in Ogbomoso.\nApart from the Vice President, the Ekiti State Governor, Dr Kayode Fayemi, who is also the Chairman of Nigerian Governors’ Forum; Oyo State Governor, Seyi Makinde; his deputy, Rauf Olaniyan; Ogun State Deputy Governor, Noimot Oyedele Salako, attended the service.\nThe Vice President Yemi Osinbajo described Alao-Akala as an open-minded politician, who would be missed for his magnanimity and compassion.\nHe said the late governor served the interest of his people when he was in power and gave quality counsel to those who were around him.\nHe said the late politician would be missed for his counsel and compassion."
  },
  {
    "headline": "A’Ibom first Lady cautions against out-of-court settlement for rape cases",
    "summarized_story": "By Chioma Onuegbu, UyoThe Akwa Ibom State First Lady, Dr Martha Udom Emmanuel, has advised the state police command not to encourage granting of bail and out-of-court settlement for rape cases.\nThe first Lady who was accompanied by the GBV management committee, also noted that demanding money from already wounded and traumatized victims was an act of insensitivity.\nWe’ve been fighting this menace over the years now, especially cases of rape that has been on the high side.\nAlso, settlement of rape cases and granting of bails should not be encouraged.\nThe CP, however, noted that most rape victims were reluctant to come forward to pursue their cases when they are offered money, and blamed the development on the high level of poverty."
  },
  {
    "headline": "Scammers target hotel customers in Lagos",
    "summarized_story": "By David RoyalThe management of a Lagos hotel has raised the alarm on how scammers are targeting customers by deceiving them into paying money into a private bank account belonging to the scammers instead of the hotel’s approved bank account for bookings.\nThis allegation was made by the management of Integrity Hotels & Suites situated at Abagbon close, Victoria Island, Lagos, noting that it uncovered plans by the scammers to swindle money from more of its customers.\nSome customers had complained that they were involved in series of unfulfilled hotel room bookings online without getting values after making payments into an individual’s account, who claimed to be the manager of the hotel.\nThe hotel said it gathered that the scammers offered hotel room bookings on an online platform, but buyers purportedly did not receive their bookings after making payment.\nPosing as the hotel managers, the scammers have diverted thousands of money into their bank accounts, a practice they began last year."
  },
  {
    "headline": "Benue to access $3million counterpart fund for immunization- Ortom",
    "summarized_story": ".flags off Polio Outbreak Response Vaccination CampaignBy Peter Duru, MakurdiBenue state government is to access a $3million counterpart fund for immunization programmes in the state.\nGovernor Samuel Ortom who made this known Friday while flagging off the Polio Outbreak Response Vaccination Campaign in Makurdi said his government had already paid the sum of $100,000 counterpart fund to access the fund.\n“We have already inaugurated a task-force on immunization and have also gone ahead to pay the counterpart fund of $100,000 so that we can access $3million for immunization.\n“It may interest you to know that Benue State has not recorded a case of Wild Polio Virus in the past 12 years.\nThis is because, the Government of Benue State and Partners have continuously supported this programme,” he said."
  },
  {
    "headline": "Elect youths or risk our votes, Arewa youths tell APC, PDP, others",
    "summarized_story": "Nuhu Sani Lere, who spoke on behalf of the Arewa youths said the northern region has resolved to support only political parties that will present worthy youths as candidate for political positions.\nHe said: “We are in consultations and have resolved unanimously to vote only parties that elect youths into offices.\n“my message to young people like me is that as young people we have never been close to leadership of this country, when it comes to political party.\nSo, it is Youth for Youth.\nWhile she pointed the importance of youths engagement in politics, she advised the women to see themselves as fit in the political community of Nigeria."
  },
  {
    "headline": "2023 Presidency: Don’t sacrifice competence for zoning, group warns",
    "summarized_story": "People wait to cast their votes in the presidential election in Lome, Togo, Saturday, Feb. 22, 2020.\n(AP Photo/Sunday Alamba)…Says Atiku has no burdenBy Dirisu YakubuABUJA- A political pressure group, the Northern Progressive League has said former Vice President, Atiku Abubakar is fit to run for the Office of President of Nigeria in 2023, saying competence must not be substituted for zoning in the interest of the nation.\nIn all of these, be it party primaries or the main elections, the voters hold the aces.\nThey decide who they want at every stage of the elections and not the obviously hired voices of a nebulous coalition.\nRightly, the Peoples Democratic Party, PDP, in this Project 2023 is not subscribing to this platform and has therefore opted for a level-playing field for all."
  },
  {
    "headline": "Nigeria power projects: FG engages governors over right-of-way conflict",
    "summarized_story": "The Federal Government of Nigeria has confirmed engagement with governors to address disagreement over right-of-way (ROW).\nMinister of Power, Abubakar Aliyu, lamented that the conflict was delaying many power projects across the country.\nAliyu spoke on Friday, when he received the leadership of Eko Electricity Distribution Company (EKEDC) in Abuja.\nHe announced that the Buhari administration was liaising with the Nigeria Governors Forum (NGF) to ensure timely completion of projects.\nOtubu, accompanied by the Managing Director, Fadeyibi Adeoye, charged the government to step up the fight against electricity theft."
  },
  {
    "headline": "Taraba: Council boss declares curfew as two communities clash in Ussa",
    "summarized_story": "The Chairman of Ussa Local Government Area of Taraba State, Rimamsikwe Hassan Karma, has imposed a dusk-to-dawn curfew on the council.\nThe people Rufu and Lissam communities, where said to have on Friday engaged themselves in a battle that led to massive destruction of property.\nKarma noted that problem started when masquerades from one of the communities allegedly went berserk, flogging innocent people.\nHe said heavily armed mobile policemen and soldiers have been deployed to the area to calm the situation.\nKarma added that the curfew, which according to him starts from 7p.m to 6a.m, he believes, would restore back the much desired normalcy to the council."
  },
  {
    "headline": "Hajj: NAHCON visits NDLEA over drug trafficking to Saudi Arabia",
    "summarized_story": "They were received by the NDLEA Chairman, Brig Gen. Mohamed Buba Marwa (Rtd).\nDisclosing the reason for the visit, the Hajj Commission Chairman recalled that illicit drug trafficking is one of the endemic vices challenging security personnel globally.\nWhen that happens, the NAHCON Chairman assured that the Commission would transparently distribute Nigeria’s allocated slots to states through an endorsed formular.\nIn addition, the Deputy Governor informed NAHCON Chairman that beyond the ordinary approval, the Ministry of Home Affairs shall oblige NAHCON with architectural support when needed.\nThe trip ended with re-inspection of NAHCON land in Lagos State."
  },
  {
    "headline": "South-West pensioners protest in Ogun, accuse PenCom of holding their entitlements",
    "summarized_story": "Pensioners in the South-West region of Nigeria, on Friday, protested the non-payment of their gratuity shortfall by the Federal Government.\nThe pensioners, under the aegis of the Nigeria Union of Pensioners, Contributory Pension Scheme Sector (NUPCPS), Southwest zone, alleged that top officials of the National Pension Commission were holding on to their allowances.\nWhen we were retiring and they were calculating our money by Pencom, they used the salary grade level of every parastatals.\nHe said “It is not possible for the Federal Government to pay money into somebody’s account without due process.\nThey have complained to Pencom, saying they are not entitled to a shortfall.”"
  },
  {
    "headline": "Magodo: Lagos dares Nigerian govt, returns to Supreme Court",
    "summarized_story": "Lagos State Government is not ready to concede to the Federal Government of Nigeria on the Supreme Court ruling on the occupation of Magodo.\nThe FGN had accused the state of delaying the enforcement of the February 10, 2012, judgement in suit no.\nMalami told them that his office “belongs to the Executive arm of the Government, while the Supreme Court belongs to the Judiciary.”The Senior Advocate of Nigeria (SAN) criticized their “unjustifiable insinuation of impunity” over the execution of a judgment of the Supreme Court.\nHe said following Sanwo-Olu’s intervention, Lagos officials and representatives of the Shangisha Landlords Association (the judgment creditors) held a series of meetings.\nThe statement reiterated the Lagos government commitment to comply with the Supreme Court judgement “once these two issues are resolved.”"
  },
  {
    "headline": "Again, gunmen attack Okomu oil palm plantation in Edo",
    "summarized_story": "Gunmen yesterday again attacked the Okomu Oil Palm Company’s plantation in Ovia Southwest Local Government Area of Edo State, a day after two suspects were paraded by the state’s police command on their involvement in the February 1 this year’s attack.\nThe sudden attack by the suspected criminals led to the death of two staff of Okomu company and the burning of 90 hectares of rubber plantation and three excavators.\nOkomu oil palm company’s Communication Officer, Fidelis Olise, yesterday in Benin, disclosed that the gunmen also carried out an attack at the plantation on Tuesday, thereby making it two attacks in three days.\nIt will be recalled that police in Edo state on Thursday at Gelegele near Benin in Ovia Northeast LGA of Edo, paraded two arrested men: Destiny Tibhor, 22, and Lucky Clark, 52, for invading Okomu oil palm company, and stealing rubber lumps belonging to the firm, while they were apprehended on February 15.\nKontongs revealed that the marine police component, led by Courage Ogonmwan, SP, while on patrol in the area, intercepted the suspects on Okomu waterway, while adding that further investigation would determine whether the two suspects were among the criminals who were involved in the attacks on Okomu oil palm plantation or not."
  },
  {
    "headline": "Minister to INEC: Improve on faulty BVAS machine",
    "summarized_story": "Following the outcomes of the just-concluded area council elections, Federal Capital Territory (FCT) Minister of State, Dr. Ramatu Aliyu, has called on the Independent National Electoral Commission (INEC), to as a matter of urgency improve on the functionality of the Bimodal Voters Accreditation System (BVAS).\nAliyu stressed that in the course of monitoring the voting process it was observed that the process was slow at several polling units owing to faulty BVAS machines.\nThe minister, therefore, tasked the Independent National Electoral Commission (INEC), to as a matter of urgency look into BVAS machines malfunctioning or in the alternative allow electorate accredited to vote manually as the nation approaches general elections.\n“The Independent National Electoral Commission (INEC) should as a matter of urgency look into BVAS machine malfunctioning or in the alternative allow electorate accredited to vote manually.\nI did not say cancel the BVAS, because I am not a contestant in any way here.”"
  },
  {
    "headline": "FG reforms to meet demand for additional 15,262Mw",
    "summarized_story": "On how to bridge the gap, he said: “For you to bridge the gap between Peak Demand and Peak Generation, it speaks to these market reforms because two things need to happen.\nTwo, if the system can move that additional power and GenCos are to bring that additional power.\nHe explained that NBET’s function in a Transition Electricity Based Market is characterized by a market-based agreement for electricity trading.\nEwelukwa noted that the NBET is designed to be a temporary bridge in the electricity market.\nNBET, he said, has a long term role to drive market competition by ensuring that it is moved from a government centres market to a private sector-driven electricity market."
  },
  {
    "headline": "17 die as tanker explodes on Lagos-Ibadan Expressway",
    "summarized_story": "Early morning multiple vehicle accident on Lagos – Ibadan Expressway on Friday has claimed the lives of 17 people with 14 of them burnt beyond recognition.\nThe fatal crash which occurred at about 05.00a.m by the Isara bridge stretch of the highway, involved two vehicles with registration number ZT728 KLD (Mazda bus) and a nondescript tanker.\n- Advertisement -“The total number of people involved is not ascertained but a total of 17 bodies (killed) have been identified.\n“A total of two vehicles were involved with registration numbers ZT728 KLD a Mazda bus and an unknown vehicle of unknown make (tanker).\n“The Sector Commander FRSC Ogun described the crash as an avoidable one if cautions were put in place and traffic rules and regulations were obeyed."
  },
  {
    "headline": "Economy: PDP not qualified to cast aspersion – APC",
    "summarized_story": "The ruling All Progressives Congress (APC) said the opposition Peoples Democratic Party (PDP) lacks the locus to cast aspersions on the economic growth recorded by the Federal Government.\n“The question begging for answers is the reason behind the Peoples Democratic Party (PDP) pessimism and gloom over the NBS Report.\nAgainst the backdrop of the opposition Party’s doomsday wishes for the country, deflated PDP says the NBS Report is fake.\nAkpanudoedehe maintained, “Our economic growth is not mere happenstance, but as a result of deliberate programmes and policies of the President Muhammadu Buhari government to reflate, diversify and grow the economy from its former shoddy state.\nBesides, the fact that PDP governments are solely responsible for Nigeria’s economic mess which the APC government is repairing leaves the PDP least qualified to cast aspersions on the economic growth being recorded."
  },
  {
    "headline": "Osun: Oyetola, Adeoti, Yusuf meet ahead APC governorship primary",
    "summarized_story": "From Lateef Dada, OsogboOsun State Governor, Adegboyega Oyetola, and other aspirants in the governorship primary of the All Progressives Congress (APC), have met with the committee headed by Kwara state governor, AbdulRahman Abdulrazak.\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nThe aspirants met at the party secretariat at Ogo-oluwa along Gbongan-Ibadan road, Osogbo, Friday afternoon.\nThe committee urged the aspirants to cooperate with them to ensure credible process."
  },
  {
    "headline": "Road accident kills 3 in Rivers",
    "summarized_story": "From TONY JOHN, Port HarcourtThree persons have been confirmed dead after an accident occurred along Akpajo-Elelenwo road in Obio/Akpor Local Government Area of Rivers State.\nSaturday Sun gathered that several others, who sustained various degrees of injury in the accident were in critical condition.\nNigerians can now work and earn dollars DAILY from home.\nAn eyewitness confirmed that the crash occurred yesterday, and it was caused by over-speeding.\nThe eyewitness, who simply identified himself as Chinedu, operates a POS outlet on the road."
  },
  {
    "headline": "Five feared killed by herdsmen in Benue communities",
    "summarized_story": "From Rose Ejembi, MakurdiNo fewer than five persons have been feared killed in a renewed hostilities by suspected Herdsmen in two separate attacks on some communities in Gwer West local government area of Benue State.\nThe latest attack reportedly occurred on Thursday at Tse-Udeghe in Mbapa Council Ward of the Local government area.\nSources from the area disclosed that the attack occurred around 4:30 pm when suspected herdsmen invaded the community in their number and shooting sporadically in all directions.\nContacted, Council boss of the Local government area, Mrs Grace Igbabon confirmed the report saying five people were killed and several thatched houses burnt in the two separate attacks by suspected herdsmen.\nWe were at the venue where we were donating motorcycles to security operatives when the report came to me that Fulani herdsmen were attacking Mbapa council ward."
  },
  {
    "headline": "Adulterated fuel: Coalition absolves NNPC of blame, asks FG to sanction oil marketers",
    "summarized_story": "The coalition, comprising Nigeria First and 100 Pro-Buhari Support Group at a press briefing in Abuja on Friday urged the federal government to immediately sanction oil marketers for the ensuing chaos, which it described as economic sabotage.\n(DSDP)“We must be mindful that the DSDP agreement is a type of swap whereby a certain amount of crude is exchanged in return for the equivalent amount of refined petroleum products.\n“We are consequently tempted to believe that the companies involved in importing the adulterated petroleum products into the country must have willingly undertaken to compromise standards to maximize profit.\n“This position is hinged on the fact that it is common knowledge that the NNPC has on numerous occasions raised the alarm on the nefarious activities of oil marketers in this regard.\nWe are also aware that the NNPC has multiple checks to ensure adherence to stipulated terms and conditions in importing petroleum products into the country."
  },
  {
    "headline": "Gunmen attack Okomu Oil Palm Company to avenge arrest of two suspects – Olise",
    "summarized_story": "The Company’s Communication officer, Fidelis Olise, who disclosed this yesterday, said the gunmen had earlier carried out attack on Tuesday, making it two attacks in the three days.\nDescribing the gunmen as terrorists, Olise said they carried out the latest attacks in retaliation of the arrest of two of their supposed members.\n“The same terrorists, seemingly angered by the arrest of two of their supposed members carried out further attacks on innocent workers on the Okomu Oil Palm Company’s property to avenge the arrest of their accomplices who apparently confessed to the theft of rubber.\nThey were arrested by the Marine Police on a boat after it had left the Okomu Ijaw Community on its way to Delta State.\nThe army too should be deployed to ensure that this area of Ovia South West Local Government Area is safe for all, while terrorists and cultists are rooted from this area for good”, the Okomu Oil Palm Company further stated."
  },
  {
    "headline": "365 Days to Presidential Election, the Aspirants are Emerging",
    "summarized_story": "He said the greatest challenge that propelled his presidential ambition was the need to produce a new Nigeria where injustice is ruled out.\nAnyim Pius AnyimThe former Senate President, and one time Secretary to the Government of the Federation, Ayim Pius Anyim has declared his interest in the presidential race.\nDele MomoduDele Momodu last month declared his presidential ambition in his hometown, Ihevbe, Owan East Local Government Area of Edo State.\nAminu TambuwalAminu Tambuwal, is the current Sokoto state governor.\nSome believe that at 56, Amaechi does not have the burden of old age-related health challenges associated with some aspirants."
  },
  {
    "headline": "Nigeria Set for 5G Rollout as FG Releases Spectrum Allocation",
    "summarized_story": "Aside the official handover of the 5G spectrum to the NCC, the Minister also did an official public handover of the National Policy on 5G Network for Nigeria’s Digital Economy to the NCC.\nBased on the official handover of the 5G spectrum, the NCC was expected to licence winners of the 5G spectrum after February 27, when it must have given full update of the payment of the licence fees by the winners, to enable 5G network rollout in the country.\nNCC was expected to make formal announcement on the update of payment for 5G licence on February 27, 2022, in line with the Information Memorandum for 3.5GHz spectrum, which is the 5G licence spectrum.\nThe successful auction of the 3.5GHz spectrum band would pave way for the issuance of a fifth generation (5G) licence that would facilitate the deployment of 5G network across Nigeria.\nIn his contribution, Danbatta said: “On the 25th January, 2022, President Muhammadu Buhari, unveiled the National Policy on 5G Networks at the Presidential Villa."
  },
  {
    "headline": "Emefiele: CBN Passionate about Youth Empowerment, Economic Restructuring",
    "summarized_story": "Omon-Julius Onabu in AsabaGovernor of Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, has expressed commitment to various programmes targeted at youth empowerment and restructuring of the Nigerian economy in order to move it away from its over-dependence on oil revenue.\nHe stressed the need for all hands to be on the deck to tackle the economic challenges facing Nigeria.\n“What the CBN is doing is to diversify the economic base of this country.\n“Today, we to talk about a web economy, we talk about internet economy, we talk about quantum computing and the rest of them.\nTwo, to understand that there are interventions of the CBN and to know how to leverage these interventions.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Power Supply: FG Targets 27,000 Homes, Signs €9.3m Deal for Provision of 23-Mini-grids Nationwide",
    "summarized_story": "Emmanuel Addeh in AbujaThe federal government has signed an Interconnected Mini-grid Acceleration Scheme (IMAS) deal with eight indigenous solar mini-grid developers for the establishment of 23 mini-grids across 11 states of the country.\n“It is our hope that the signatures we put down today in these documents set a precedent for the new and improved power and energy sector in Nigeria.\n“As an agency, we encourage investors to explore the solar mini-grid sector.\n“We do this by providing in-kind grants to selected mini-grid developers on favourable and encouraging terms as contained in the grant agreement,” he stressed.\nThis is to say that the Nigerian energy sector has come a long way from what it used to be and we are proud of this,” he explained."
  },
  {
    "headline": "Again, NNPC Apologises to Nigerians, Reveals Five Vessels of Substandard Fuel Rejected",
    "summarized_story": "“For this current situation, I assure you that we have taken every necessary step to restore supply into this country.\nThe statement added that it was working with the regulatory authorities and the Nigerian National Petroleum Company (NNPC) Limited towards a resolution of the current fuel crisis.\nMost importantly, Adeosun maintained that MOMAN members had committed resources towards enhanced operations and associated activities to reduce the burden of the current fuel scarcity to customers.\nNANS also bemoaned the serious fuel supply disruption across the country occasioned by the importation of bad petrol, allegedly, by some approved dealers of the NNPC.\nThe association demanded a speedy resolution of all issues and the normalisation of fuel supply across the country to ameliorate the hardship being experienced by Nigerians."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "Cocaine Saga: Nigerian Anti-drug Agency, NDLEA Moves To Extend Abba Kyari’s Detention To Investigate Disgraced Police Officer's Choice Assets",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) on Thursday filed a court application seeking the extension of the detention of the suspended Deputy Commissioner of Police, Abba Kyari and four other suspects involved in an alleged drug deal.\nThe extension is for the agency to investigate the assets Kyari claimed to own in a viral video.\nAbba Kyari confessed to the ownership of the choice estates in Lekki, Victoria Island, Lagos; Gussappe and Highbrow Asokoro in the Federal Capital Territory, Abuja, Vanguard reports.\nIt was learnt that NDLEA operatives gave him an asset verification form to fill and are attempting to verify the properties he claimed he claimed were his in the video.\nIt was also learnt that forensic analysis of the exhibits recovered from the suspects and other accomplices was done to get more suspects involved in the cocaine deal arrested."
  },
  {
    "headline": "Cocaine Saga: Nigerian Anti-drug Agency, NDLEA Moves To Extend Abba Kyari’s Detention To Investigate Disgraced Police Officer's Choice Assets",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) on Thursday filed a court application seeking the extension of the detention of the suspended Deputy Commissioner of Police, Abba Kyari and four other suspects involved in an alleged drug deal.\nThe extension is for the agency to investigate the assets Kyari claimed to own in a viral video.\nAbba Kyari confessed to the ownership of the choice estates in Lekki, Victoria Island, Lagos; Gussappe and Highbrow Asokoro in the Federal Capital Territory, Abuja, Vanguard reports.\nIt was learnt that NDLEA operatives gave him an asset verification form to fill and are attempting to verify the properties he claimed he claimed were his in the video.\nIt was also learnt that forensic analysis of the exhibits recovered from the suspects and other accomplices was done to get more suspects involved in the cocaine deal arrested."
  },
  {
    "headline": "Lagos shuts school over ‘brutal flogging’ of two-year old pupil",
    "summarized_story": "The Lagos state government has shut down Unic Vilos Montessori school after a two-year-old pupil was allegedly brutalised by her teacher.\nAdvertisementAccording to Channels TV, Folashade Adefisayo, the state’s commissioner for education, confirmed that the ministry has ordered the closure of the school.\nIt also raised concerns over the rising cases of teachers subjecting their pupils to hostile treatments.\nIn his reaction, Jubril Gawat, special assistant on new media to Babajide Sanwo-Olu, Lagos governor, said the case is already under probe.\nThe incident occurred at about the same time when another teacher in Delta was accused of subjecting a 19-month-old pupil to “brutal flogging”."
  },
  {
    "headline": "Meet Umeonyirioha — Oxford varsity’s first Igbo language lecturer",
    "summarized_story": "A Nigerian man identified as Emmanuel Ikechukwu Umeonyirioha says he is now the first Igbo language lecturer at the University of Oxford in England.\n“It is official that I am the first official Igbo Language lecturer at the number one university in the world, the University of Oxford,” he wrote.\n“Our induction happened today by Marion Sadoux, Head of Modern Language Programmes, University of Oxford Language Centre.\nThis is the first time the Igbo language will be taught at the university.\nIgbo, on the other hand, is the principal native language of the Igbo people, an ethnic group from Eastern Nigeria."
  },
  {
    "headline": "Panic as fire guts Nigerian Law School campus in Lagos",
    "summarized_story": "There was panic at the Lagos campus of the Nigerian Law School on Wednesday night after a fire broke out causing a stampede.\nAdvertisementA source told TheCable Lifestyle on Thursday morning that the fire was due to an electrical fault at the institution situated at the Ozumba Mbadiwe street in the Victoria Island axis of the state.\nThe fire was due to an electrical fault,” the source said.\nAdvertisementThe fire was said to have started at around 10 pm from the first floor of the five-storey building hostel housing over 1,500 law graduates.\nIn a now-viral video of the fire incident, a student could be heard screaming amid sparks from the electrical cables."
  },
  {
    "headline": "Oromoni: Father alleges cover up by Lagos, police as court invites more witnesses",
    "summarized_story": "The father of Sylvester Oromoni (Jnr), the late student of Dowen College, has accused the police and the Lagos state directorate of public prosecutions (DPP) of attempt to cover-up the case.\nAdvertisementAccording to NAN, Oromoni (Snr) spoke on Tuesday at the Ikeja coroner’s court, while being cross-examined by Akin George, counsel to the Lagos state government.\nOromoni (Jnr) died last November after he was alleged to have been beaten by five colleagues for refusing to join a cult.\nWitnesses to be summoned by the coroner include roommates of the late student at Dowen College, the investigating police officer (IPO) of the case in Warri, Delta, and the Dowen College nurse that attended to the deceased.\nAdvertisementOther witnesses to be invited include Opudu Boro, a friend to the Oromoni family, two independent pathologists and Clement Vhriterhire, the doctor who performed the first autopsy on the late student in Warri."
  },
  {
    "headline": "Kanye West: ‘Donda 2’ will not be available on streaming platforms",
    "summarized_story": "Kanye West, the US rapper, says ‘Donda 2’, his forthcoming album, will not be available on any streaming platform.\nIn one of the posts, the 45-year-old said his album would not be available on Amazon, Apple Music, Spotify or YouTube.\nAccording to him, the project — scheduled to be released on February 22 — would only be available on Stem Player, his newly launched platform.\nIt also has a MP3 player available.\n“Donda 2 will only be available on my own platform, the Stem Player."
  },
  {
    "headline": "Flutterwave launches SME lending, fintech-as-a-service in vision 3.0",
    "summarized_story": "Led by founder and CEO Olugbenga Agboola, the company facilitates cross-border payments transactions of small-to-large businesses in Africa via one API.\nGet the best African tech newsletters in your inboxFlutterwave Capital, the new SME loans product, is offered in partnership with the company’s lending partners—CashConnect Microfinance Bank, MoneyWise Microfinance Bank, Wema Bank, Zenith Bank, Stanbic IBTC Bank, and Sterling Bank.\n“With Flutterwave Capital, we’re making it easier for business owners to access the funds they require to grow their businesses.\nFlutterwave also helps businesses outside Africa expand their operations on the continent with an international clientele that includes Booking.com, Flywire, and Uber.\nThe latest financing thus brings its total investments secured since launched in 2016 to $475 million (plus a $35 million Series B in 2020 and a $20 million Series A in 2018)."
  },
  {
    "headline": "Crypto crime grows to $14 billion as crypto popularity increases",
    "summarized_story": "In 2021, crypto criminals made a killing, as illicit crypto transactions hit $14 billion, a 79% jump from the $7.8 billion recorded in 2020, according to a report by US-based blockchain analytics company, Chainalysis.\nThe growth in illicit crypto transactions is attributed to a 567% jump in overall transaction volume in 2021.\nGiven that overall crypto transactions grew to $15.8 trillion in 2021, it is not surprising that cybercriminals are increasingly using crypto.\nDespite the increase in the total volume of illicit transactions, illicit transactions represented just 0.15% of the total cryptocurrency transaction volume in 2021—its lowest ever.\nWhat this means is that legitimate crypto transactions far outstrip illegal transactions."
  },
  {
    "headline": "Inside Ckrowd’s plan to help African creators monetise their content",
    "summarized_story": "This means African creators are still struggling to earn much from their craft, compared to their global counterparts.\nAt KAM Africa, Adebayo started an initiative that would help creative professionals like musicians and actors understand the business part of their craft.\nThink of a marriage between OnlyFans, Patreon, and YouTube—in fact, a combination of all the streaming platforms out there—but now for African content.\nOn Ckrowd, creators can livestream their content like uduX live and upload on-demand contents like on Netflix.\nThe platform pays 70% of total income on content to creators, which we believe is the highest pay-out on digital content to African creators,” said Adebayo."
  },
  {
    "headline": "From telecoms to tech: MTN changes logo to look the part",
    "summarized_story": "Africa’s biggest telecom company MTN is preparing for a brand refresh that’ll position it as a technology company, rather than a telecommunications company.\nThe brand refresh includes forgoing the white, yellow and red lettering in favour of a black lettered MTN logo surrounded by an oval, similar in shape to a rugby ball.\nThe new look is “aligned to our evolution from a telecommunications company to a technology company underpinned by one simple and consistent yet striking brand”, Morafo said.\nCurrent MTN logoNew MTN LogoMTN’s expansion drive to become a fully-fledged technology services company also means that it’s on a hiring drive to hire 150 digital experts in South Africa.\nThis rebrand will help shift public perception of the MTN brand and also influence its market valuation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "It’s all about seed rounds ￼",
    "summarized_story": "For example, some freight companies in Africa still manage their shipments using outdated methods like spreadsheets, phone calls, and emails.\nAnd this company has announced $4 million in seed funding to expand across the country and into neighbouring regions.\nIt also saw participation from XYZ Ventures, Village Global, Musha Ventures, Ventures Platform, Voltron Capital, and Paystack CEO Shola Akinlade.\nNonso Onwuzulike officially launched the company in January 2022 to improve employees’ financial well-being.\nWhat’s more, the company will use the seed funding to speed up the development of its platform to serve large enterprise employers."
  },
  {
    "headline": "Learning the VC game, Flutterwave’s $3bn valuation and CrowdForce’s $3.6m raise",
    "summarized_story": "AdvertisementToday, we’re discussing:Why female founders should learn the venture capital gameFlutterwave’s $3bn valuationCrowdForce’s $3.6m pre-Series AWomen should play the VC gameIn 2021, women got less than 1% of startup funding.\nAccording to her, women need to learn the rules of the VC game and know what works and what doesn’t.\nIn her chat with Chimgozirim, she detailed the rules and tactics that could mean better odds for women in winning the venture capital game.\nRead all about it here: Female founders need to learn how to play the venture capital game– Sarah DusekFlutterwave’s $3bn valuationFlutterwave has come a long way since it was founded in 2016.\nAway from fintech: Flutterwave also displayed interest in the creator economy with the acquisition of Disha, a platform that allows creators to curate content and receive payment."
  },
  {
    "headline": "Female founders need to learn how to play the venture capital game — Sarah Dusek",
    "summarized_story": "Share this article:A cursory look at the venture capital landscape in Africa will reveal an impressive number of deals and the triumph of innovation over regulation.\nAccording to Sarah Dusek, Managing General Partner at Enygma Ventures, who spoke to Techpoint Africa on Zoom, a second reason is that most women don’t know how to play the venture capital game.\nWith venture capital a novel concept in Africa, not too many people, regardless of gender, understand how it works.\nThat decision birthed Enygma Ventures, a sector-agnostic firm providing women with the capital required to scale and grow their businesses.\nVenture capital is, in many ways, a numbers game, and the more women there are building companies that investors like, the higher the chances of women receiving investments."
  },
  {
    "headline": "Nigeria’s shrinking economy records highest ‘growth’ under Buhari",
    "summarized_story": "Nigeria’s economy may have grown by the most since 2015 when President Muhammadu Buhari was first voted into office, but the size of the economy has shrunk since then and Nigerians are worse off.\n“The data gives the impression that things are finally getting better now that GDP growth has outpaced population growth for the first time since 2015,” Obe said.\nBut the economy is valued at only $436.29 billion, 20 percent less than it was worth in 2014 ($546.67 billion).\nRead more: IMF raises red flag over Nigeria’s economy again“The magnitude at which the economy contracted in 2020 has certainly had a big role to play in the 2021 growth numbers so it is no surprise,” said Taiwo Oyedele, an economist and partner at consulting firm, PriceWaterhouseCoopers (PWC).\nNigeria’s 2021 GDP growth beats estimates"
  },
  {
    "headline": "Nigeria’s shrinking economy records highest ‘growth’ under Buhari",
    "summarized_story": "Nigeria’s economy may have grown by the most since 2015 when President Muhammadu Buhari was first voted into office, but the size of the economy has shrunk since then and Nigerians are worse off.\n“The data gives the impression that things are finally getting better now that GDP growth has outpaced population growth for the first time since 2015,” Obe said.\nBut the economy is valued at only $436.29 billion, 20 percent less than it was worth in 2014 ($546.67 billion).\nRead more: IMF raises red flag over Nigeria’s economy again“The magnitude at which the economy contracted in 2020 has certainly had a big role to play in the 2021 growth numbers so it is no surprise,” said Taiwo Oyedele, an economist and partner at consulting firm, PriceWaterhouseCoopers (PWC).\nNigeria’s 2021 GDP growth beats estimates"
  },
  {
    "headline": "Trade sector records positive growth first time in 6yrs",
    "summarized_story": "For the first time in six years, activity in Nigeria’s wholesale and retail trade sector grew in 2021, according to data by the National Bureau of Statistics (NBS).\nAccording to the GDP report released Thursday by the NBS, the trade sector grew 8.62 percent.\n“The fourth quarter growth indicates a steady economic recovery accounting for an annual growth of 3.40 percent in 2021,” it states.\nIn terms of contribution to GDP, the trade sector contributed 15.66 percent, higher than the 15.46 percent it represented in the previous year, and higher than the 14.93 percent recorded in Q3 ‘2021.\nTrade, which is the second biggest sector by output production, can be likened as the barometer of consumer purchasing power."
  },
  {
    "headline": "SERMON: THIS DRUNKENNESS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest1 “ Wine is a mocker strong drink is raging and whosoever is deceived thereby is not wise” Prov.\nNow therefore, beware, I pray thee and drink not wine or strong drink, and eat not any Maclean thing.” Judges 13:3-4 she obeyed God.\nMany have been deceived into alcohol because they see Priests and Pastors who drink alcohol.\nWhat you have to do now if you still drink alcohol, is to come truly to Christ and surrender your life to him and ask for a new life.\nRemember that all that God would use would be filled with the Holy Spiritand not with alcohol or strong drink."
  },
  {
    "headline": "Presidency faults reports by IMF, others on Nigeria debt profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Presidency on Tuesday faulted the recent reports by International monetary fund (IMF) and Agusto and CO. on the growth of Nigeria’s debt service and debt levels over the years.\nA press statement emanating from the office of the Debt management office, Abuja and made available to the Nigerian OBSERVER in Benin City yesterday Stated that the author of the alleged evil reports have failed to consider the challenges experienced by Nigeria in recent times as a result of two recessions, sharp drop in Revenues and security challenges.\nThe presidency further noted that the analysis as reported do not acknowledged the improvements in infrastructure which have been achieved through borrowing as well as the strong measures by the Government to grow revenues.\nAccording to the Presidency, “The DMO reiterated the fact that the Government is already implementing policies towards increasing revenues and developing infrastructure through Public Private Partnership arrangements both of which improve debt sustainability”.\nContinuing, the DMO also noted that the Government has active and regular engagements with the IMF on borrowing and debt management, adding that with this case the reports have fail to consider the challenges experienced by Nigeria in recent times."
  },
  {
    "headline": "Industrialisation: 2,500bpd modular refinery, 5MW power plant, others set to go live in Edo next month – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Barring any last-minute changes, a 2,500 barrel per day (bpd) modular refinery, five megawatts power plant, 40-million-scf gas processing facility, and a data centre, among others, will come on stream in Edo State in March, 2022, after necessary regulatory certifications from the Nigerian Midstream and Downstream Regulatory Authority (NMDRA).\nThe company plans to develop the park in phases, with the first phase comprising a 10,000 barrel per day refinery, 60-million-scf gas processing facility, 10-million-scf compressed natural gas (CNG) facility, 50 megawatts power plant and a data centre.\nThe project is financed by the First City Monument Bank (FCMB), Nigerian Content Development & Monitoring Board (NCDMB), among others.\nChief Executive Officer of the DMCL, Dr. Akintoye Akindele, during an inspection of the facility, said the plant will be ready by the end of March.\nIn that way, we will be able to utilize assets optimally, avoid wastage, look after the environment and create jobs,” he said."
  },
  {
    "headline": "Revamped Edo College of Education kicks off academic activities Q3 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the newly revamped multi-campus Edo College of Education with sites in Igueben, Abudu and Afuze, will begin academic activities before the end of 2022.\nThe government, however, said the academic calendar of the defunct College of Education in Igueben will not be truncated, promising that students of the defunct college will graduate as and when due.\n“Edo College of Education is yet to take off but the College of Education, Igueben no longer exists.\nIgueben is the main campus and it will focus on training secondary school as well as technical and vocational education teachers.\nAbudu is one of the campuses focusing on training early childhood and basic education teachers."
  },
  {
    "headline": "Osun APC Primary: Aregbesola accuses Oyetola of importing thugs to disrupt Saturday’s election",
    "summarized_story": "Rasaq Salinsile led faction of the All Progressives Congress (APC) in Osun State, has accused Governor Adegboyega Oyetola of importing thugs into the state for tomorrow’s governorship primary election.\nTomorrow’s governorship primary cannot be fair, free, and equitable if Governor Oyetola is still a member of NCECPC.\nAccording to Adeoti, Governor Oyetola has refused to release the register of party members which will be used for the primary election.\nAdeoti, however, said in spite of the anomalies raised, he and his supporters will not boycott the primary election.\n“My supporters and I are going to participate in the primary election tomorrow."
  },
  {
    "headline": "AFA celebrates Ugwu Abia, Dr Alex Otti, at 57",
    "summarized_story": "The Abia Freedom Alliance (AFA), an association of concerned Abia technocrats, professionals, businessmen and religious leaders, has congratulated its leader, Dr Alex Chioma Otti OFR, on the occasion his 57th birthday anniversary, February 18.\n“We note with joy your various accomplishments and how you have impacted positively on the lives of our fellow citizens in Abia State.\n“Because of your resilience, we remain hopeful and can see light at the end of the tunnel.\n“Our prayer for you as you celebrate is that God will continue to protect you from every prying evil eye and perfect all that concerns you and your destiny with Abia.\n“Happy birthday, to the Pride of Abia, Ugwu Abia!”"
  },
  {
    "headline": "Nigerian Sprinter Blessing Okagbare Banned For 10 Years For Doping",
    "summarized_story": "Nigerian athlete, Blessing Okagbare, has been banned for 10 years for doping, the Athletics Integrity Unit (AIU) announced on Friday.\n“The Disciplinary Tribunal has banned Nigerian sprinter Blessing Okagbare for a total of 10 years,” read an AIU statement.\nIn a later message, Lira said Okagbare was poised to “dominate” in Tokyo.\nThe law, named after Russian whistleblower Grigory Rodchenkov, enables US authorities to prosecute individuals involved in international doping fraud conspiracies.\n“The sole arbitrator concluded that Athlete 1 named in the criminal complaint is Blessing Okagbare.”"
  },
  {
    "headline": "LASAA launches e-Sticker verifier app for mobile advert registration",
    "summarized_story": "The Lagos State Signage and Advertisement Agency (LASAA), the agency responsible for the regulation and control of all forms of signs and outdoor advertisement displays in Lagos State, has launched a dedicated e-Sticker Verification Application (app) for mobile avert registration by its clients.\nThe app which, according to the Agency, is available on Google and IOS store will help clients to authenticate the mobile advert Quick Response (QR) code issued to them by LASAA.\n“This innovation from the Lagos Signage Advertising Agency is a user-friendly interface that detects the brand registration information on stickers generated by LASAA to organisations and individuals respectively,” he said.\n“This platform has been developed to ensure branded automobiles have authorised stickers and to eradicate any occurrence of falsified brand information,” Akande said.\nTo use the application, clients should simply download and install the LASAA e-Sticker Verifier App from the Google store or App store."
  },
  {
    "headline": "MSME: Young Professionals Hold 2nd Entrepreneurial Summit In Delta",
    "summarized_story": "In order to productively engage the youths of the Niger Delta region, the 2nd Niger Delta Micro, Small and Medium Enterprise (MSME) Summit, will hold in Asaba, Delta State on Saturday, February 19, 2022.\nThe event which is organised by the Niger Delta Young Professionals (NDYP), is a sequel to the pioneer edition held in Port Harcourt, the Rivers State capital in February last year.\nA statement issued by the organisers of the summit led by the convener, Moses Siloko Siasia, said the Saturday’s event was aimed at consolidating on the gains of the inaugural edition.\n“Even the success story of the Presidential Amnesty Programme has not been far reached because there is no well thought-out strategic evaluation process.\n“The culture of entrepreneurship is paramount to the peculiarity of the situation of the Niger Delta,” Siasia said."
  },
  {
    "headline": "2023: Pro-Osinbajo Group Seeks Ooni’s Support For VP",
    "summarized_story": "Ahead of the 2023 general election, the National Coalition Group (NCG) for Osinbajo 2023, on Friday, sought the royal blessing for the project at the palace of the Ooni of Ife, Oba Adeyeye Enitan Ogunwusi, Ojaja II.\nThis is even as the group described the presidential aspiration of Vice President Yemi Osinbajo as a welcome development considering his competence and readiness to make Nigeria a better place.\nAddressing the monarch, Dr. Dibia said, “His Imperial Majesty, you must bring Yoruba nationalities united for Professor Yemi Osinbajo Presidency in 2023.\nThe first-class traditional ruler admonished the delegation of NCG campaigners to count on his royal support while urging them to go about the project peacefully.\nADVERTISEMENTIn the delegation to the Ooni of Ife’s palace were NCG national treasurer, Aisha Shehu; NCG national woman leader, Mrs Mary kemi Oluwajana, as well as coordinators of Lagos and Osun State chapters of NCG, among others."
  },
  {
    "headline": "Saraki Seeks Release Of Ebonyi PDP Spokesman, Nwoba",
    "summarized_story": "Former Senate President, Dr Abubakar Bukola Saraki, has urged the police in Ebonyi State to release the state publicity secretary of the Peoples Democratic Party (PDP), Mr Chika Nwoba, who was arrested in January, 2022.\n“The remand in police cell of Mr Nwoba, the PDP Publicity Secretary in Ebonyi State, is of great concern for me as a person who loves Nigeria and above all as someone who loves justice.\n“Mr Nwoba is a dutiful member of our great party, PDP, and he is paying the price of speaking truth to power.\nThis is a time for every well meaning Nigerian and most especially the leaders of our party, the PDP, to stand up and Stand with one of our own.\nADVERTISEMENT“We all need to save our nation from the misfortune wreaked by injustice and miscarriage of Justice."
  },
  {
    "headline": "Saraki Seeks Release Of Ebonyi PDP Spokesman, Nwoba",
    "summarized_story": "Former Senate President, Dr Abubakar Bukola Saraki, has urged the police in Ebonyi State to release the state publicity secretary of the Peoples Democratic Party (PDP), Mr Chika Nwoba, who was arrested in January, 2022.\n“The remand in police cell of Mr Nwoba, the PDP Publicity Secretary in Ebonyi State, is of great concern for me as a person who loves Nigeria and above all as someone who loves justice.\n“Mr Nwoba is a dutiful member of our great party, PDP, and he is paying the price of speaking truth to power.\nThis is a time for every well meaning Nigerian and most especially the leaders of our party, the PDP, to stand up and Stand with one of our own.\nADVERTISEMENT“We all need to save our nation from the misfortune wreaked by injustice and miscarriage of Justice."
  },
  {
    "headline": "UPDATED: 2 Die, 20 Injured As Fire Razes Borno IDPs Camp",
    "summarized_story": "An afternoon fire outbreak at an internally displaced persons (IDPs ) camp in Kaleri area of Maiduguri has killed two persons and injured 20 others.\nMeanwhile, in an update later sent by Mr Ibrahim following the assessment, he confirmed one person dead with unspecified number of IDPs injured.\nHe said: “Update on fire incident at Kalari Muna Elbadawy camp Maiduguri.\nOne person died with unspecified number of internally displaced persons injured.\nOfficials of NEMA, BOSEMA, Nigerian Red Cross and other stakeholders have administered first aid to the injured victims."
  },
  {
    "headline": "Russia set to invade Ukraine in days: Joe Biden",
    "summarized_story": "US President Joe Biden said Russian leader Vladimir Putin will order an invasion of Ukraine in a matter of days as Russia stepped up a flurry of misinformation campaign.\nBiden spoke Friday evening in White House and also addressed the misinformation as the threat of invasion hangs over Ukraine.\nJust like he has said umpteenth times, Biden warned Putin of grave consequence if he chose war over diplomacy.\nHe said the U.S. and its NATO allies are united in ensuring that the Russian aggression against Ukraine is checkmated.\n“We agreed on our support for Ukraine, to continue diplomatic efforts, and affirmed our readiness to impose massive costs on Russia should it choose further conflict”, Biden said."
  },
  {
    "headline": "Kano APC still united not scattered, says Ganduje",
    "summarized_story": "By Zubairu IdrisGovernor Abdullahi Ganduje says the All Progressives Congress (APC) Kano chapter is still united and not scattered as reported.\nHe stated this while addressing party supporters, adding that his intention of having a united and strong party is still on.\n“What recently transpired between party members was purely internal party wrangling.\n“APC is solid in Kano state, it is the strongest party in Kano state and we assure you that APC is still one, what happened is mere controversy among children of the same parents.\n“Our great party, APC, is still one in Kano."
  },
  {
    "headline": "Two Prominent PDP Chieftains Join APC In Yobe",
    "summarized_story": "Yobe State Governor and Chairman APC Caretaker Extraordinary Convention Planning Committee, Mai Mala Buni, on Friday, received two Peoples Democratic Party, PDP, chieftains into the fold of his party.\nHe assured them that the APC would carry every member along.\nBuni also stressed that the entrants would be treated as full members of the ruling party without any discrimination while admonishing them to register and get their new party’s membership cards from their respective wards.\nOne of the defectors, Abdu Yakubu Dira, explained that they decided to dump PDP for the APC due to an unresolved issue.\nHe assured the governor that their teeming supporters will massively join the ruling APC soon."
  },
  {
    "headline": "PHOTOS: VP Yemi Osinbajo, State Governors, Others Attend Funeral Of Former Oyo State Governor, Christopher Alao-Akala",
    "summarized_story": "PHOTOS: VP Yemi Osinbajo, State Governors, Others Attend Funeral Of Former Oyo State Governor, Christopher Alao-AkalaThe funeral mass of former Oyo state governor, Christopher Alao-Akala, was held at the Beulah Baptist Conference Centre, Ogbomoso today February 18.\nThe former governor died on January 12 after a brief illness.\nGuests at the funeral mass included Vice President Yemi Osinbajo, Oyo state governor Seyi Makinde, Governor Kayode Fayemi of Ekiti state and many other government functionaries.\nSee more photos below;"
  },
  {
    "headline": "“I’m Tired Of Trying” – Nigerian Footballer, Asisat Oshoala Posts Disturbing Tweet",
    "summarized_story": "Fans and Twitter users have expressed concerns over Super Falcons captain and FC Barcelona forward, Asisat Oshoala, after she shared a disturbing tweet.\nIn the now-deleted tweet, Oshoala said, “Life is just unfair…tired of trying.”"
  },
  {
    "headline": "Black Friday: 17 Burnt To Death In Lagos-Ibadan Expressway Accident",
    "summarized_story": "No fewer than 17 persons were burnt to death on Friday in an accident involving a Mazda bus and a tanker at Isara Bridge on the Lagos-Ibadan Expressway.\nThe Sector Commander, Federal Road Safety Corps (FRSC) in Ogun, Mr Ahmed Umar, confirmed the incident in Abeokuta.\nUmar said that the accident occurred at about 5.00 a.m., adding that the number of people involved in the accident could not be ascertained.\nThe sector commander noted, however, that he could not ascertain which of the vehicles was at fault.\nThe sector commander said that the accident was avoidable if the traffic rules and regulations had been obeyed."
  },
  {
    "headline": "2023: Power not served a la carte, youth told",
    "summarized_story": "Notably, the Nigerian youth aged 18-40 constitute more than 60 per cent of the registered voters.\nThis is an indication that the Nigerian youth have the power to change the direction of Nigeria, even if the political leadership is not ready to share power with them.\nAs many political analysts said, power is not served a la carte.\nA few pundits, politicians and other political stakeholders have expressed concern over the chances of Nigeria youths as we approach the 2023 general elections.\nHe noted that their concern was not about political parties, but that Nigerian youths should occupy critical leadership positions."
  },
  {
    "headline": "Breaking: Nigeria’s Blessing Okagbare banned for 10 years over doping",
    "summarized_story": "Nigerian sprinter, Blessing Okagbare, has been banned for 10 years for multiple breaches of anti-doping rules by the World Athletics body.\nThe 33-year-old has been handed five years for the presence and use of multiple prohibited substances and five years for her refusal to co-operate with the AIU’s investigation into her case.\nDetails loading…"
  },
  {
    "headline": "Breaking: ‘Depressed’ Asisat Oshoala out as Waldrum releases Super Falcons list vs Cote d’ivoire in crucial AWCON qualifier",
    "summarized_story": "Super Falcons coach Randy Waldrum has kept out Barcelona star Asisat Oshoala from the squad expected to face Cote d’ivoire in the Africa Women Cup of Nations qualifier scheduled for Friday February 18, 2022 inside Moshood Abiola National stadium Abuja.\nThe match kicks off 4pm.\nOshoala exclusion may not be unconnected to a strange ‘depression-like’ post she tweeted on her Twitter account, before she eventually removed it.\nSee full list of the Super Falcons on the lineup to face Lady Elephants."
  },
  {
    "headline": "Buhari Demands Weighty Sanctions For Coup Plotters In Africa",
    "summarized_story": "In his contribution to the roundtable discussion on Peace, Security, and Governance at the ongoing 6th EU-AU Summit, President Buhari equally stressed the need to nip the root causes of extremism, conflicts, and tensions in Africa at inception.\nREAD ALSO: PDP Governors Ask Buhari To Resign As Petroleum Minister“Africa has continued to witness different waves of violent extremism, community-based conflicts, and inter-ethnic tensions, notably in rural areas.\nFor many decades, our continent has been deprived of political stability and socio-economic development due to terrorism and violent extremism,” he said.\n“The African Union has often responded to these challenges through its different structures, such as the African Peace and Security Architecture and the African Governance Architecture.\n“Through enhanced collaboration with our development partners, especially the European Union, we can identify areas of cooperation for quick and substantive results."
  },
  {
    "headline": "Doping: Nigerian Sprinter Blessing Okagbare Banned For 10 Years",
    "summarized_story": "Nigeria’s 2008 Olympics long jump silver medalist Blessing Okagbare has been banned for 10 years for doping, the Athletics Integrity Unit (AIU) announced on Friday.\n“The Disciplinary Tribunal has banned Nigerian sprinter Blessing Okagbare for a total of 10 years,” read an AIU statement.\nIn a later message, Lira said Okagbare was poised to “dominate” in Tokyo.\nThe law, named after Russian whistleblower Grigory Rodchenkov, enables US authorities to prosecute individuals involved in international doping fraud conspiracies.\n“The sole arbitrator concluded that Athlete 1 named in the criminal complaint is Blessing Okagbare.”See AIU’s full press release below:"
  },
  {
    "headline": "Nigeria, Five Other African Countries To Begin Production Of Covid Vaccines – WHO",
    "summarized_story": "Nigeria and five other African countries have been chosen to begin production of COVID-19 vaccines, with the continent having had limited access to jabs.\nEuropean Commission chief Ursula von der Leyen said: “We have been talking a lot about producing mRNA vaccines in Africa.\nAs used in the Pfizer/BioNTech and Moderna Covid-19 vaccines, mRNA technology provokes an immune response by delivering genetic molecules containing the code for key parts of a pathogen into human cells.\nThe South African hub is already producing mRNA vaccines at laboratory scale and is currently scaling up towards commercial scale.\nUS jabs for Egypt, NigeriaThe United States ships nearly 5.2 million doses of the Pfizer Covid-19 vaccine to Egypt and Nigeria, a White House official tells AFP."
  },
  {
    "headline": "Court Sentences Two Ex-Policemen To Death Over Armed Robbery",
    "summarized_story": "A Federal Capital Territory High Court, Abuja, has sentenced two ex-policemen, James Ejeh and Simeon Abraham, to death for armed robbery.\nThey were arraigned on October 20, 2017, by the Police on two counts bordering on conspiracy and armed robbery.\nRead Also: Nigeria, Five Other African Countries To Begin Production Of Covid Vaccines – WHOKekemeke held that the evidence before the court proved that, there was a robbery by the defendants and they were also armed.\nHe added that there was an admission of guilt by the defendants and no evidence was stronger than their own admission.\nHe added that the offence contravened the provisions of sections 6 and 1(2) of the Robbery and Firearms (Special provisions) Act, 2004."
  },
  {
    "headline": "Eight Dead As Storm Eunice Batters Europe",
    "summarized_story": "Storm Eunice killed at least eight people in Europe on Friday, pummelling Britain with record-breaking winds and forcing millions to take shelter as it disrupted flights, trains and ferries across Western Europe.\nA motorist was killed when their car crashed into a tree that had fallen across a road near Adorp in the Netherlands’ northern province of Groningen.\nOne wind gust of 122 miles (196 kilometres) per hour was measured on the Isle of Wight off southern England, “provisionally the highest gust ever recorded in England”, the Met Office said.\nEunice caused high waves to batter the Brittany coast in northwest France, while Belgium, Denmark and Sweden all issued weather warnings.\nAnother storm, Dudley, had caused transport disruption and power outages when it hit Britain on Wednesday, although damage was not widespread."
  },
  {
    "headline": "Zamfara APC Factions in War of Words over invasion of Court by Thugs -",
    "summarized_story": "The All Progressives Congress loyal to Senator Kabiru Marafa in Zamfara State is accusing the Matawalle Faction of sponsoring hoodlums to attack its Members and lawyers at the state high court in GusauThe Marafa faction says they were attacked shortly after a court sitting on the Ward, Local Government and State Congresses which held in the state in November 2021AdvertisementThey want security agencies to Investigate the incident and arrest perpetratorsAdvertisementAdvertisementThe Crisis between the Senator Kabiru Marafa faction of the APC and that of Governor Bello Matawalle started a few days after the formal Defection of Governor Bello Matawalle from the PDP to the Ruling APCThis time around, the Marafa faction is accusing the Zamfara state APC of Sponsoring thugs to attack its Lawyers and party members at the state high courtAdvertisementSpokesperson for the Marafa faction, Bello Bakyaswa says the attack was targeted at eliminating himHe calls on the security agencies to Investigate the incident and arrest perpetrators of the attackAdvertisementResponding to the allegations, Spokesperson of the Matawalle faction Yusuf Idris Gusau denies sponsoring thugs to attack the court, describing the allegations as false, baseless and is a sign of failure on the side of the accusersYusuf Idris insists that the party under Governor Bello Matawalle will not fold it’s hands and watch hoodlums disrupt the peace in the stateAdvertisementHe warns Politicians against using Politics to set the state on fire."
  },
  {
    "headline": "Alao-Akala will be missed for his magnanimity and compassion- Osinbajo -",
    "summarized_story": "Vice President Yemi Osinbajo has described the former governor of Oyo state Adebayo Alao-Akala as an open minded politician who would be missed for his magnanimity and compassion.\nHe said the late governor served the interest of his people when he was in power and gave quality counsel to those who were around him.\nAdvertisementThe Vice President said this while speaking at the final burial ceremony of the former Governor of Oyo state in his Ogbomoso home.\nAccording to him, he was responsible and respectful to the views of individuals and will be missed for his counsel and compassion.\nAdvertisementIn his remarks, Governor of Oyo state, Seyi Makinde Eulogised the former governor, describing him as one who loved everyone regardless of their political differences."
  },
  {
    "headline": "CSOs threaten protest if President Buhari fails to sign Electoral bill by Feb 22",
    "summarized_story": "A coalition of Civil Society groups has threatened to embark on nationwide protest if President Muhammadu Buhari failed to sign the Electoral Act Amendment bill by 22nd FebruaryNigeria Civil Society Situation Room said it is frustrated by non assent to Bill and described it as a subversion of popular will.\nAdvertisementThe group said President Buhari does not have any more excuses not to sign the bill.\nPresident Buhari had during an interview with Channels that he will sign the bill if the necessary corrections are made."
  },
  {
    "headline": "Marafa seeks nullification of Zamfara congresses, accuses NWC of breach of party's constitution",
    "summarized_story": "Senator Kabiru Marafa’s faction of the All Progressive Congress in Zamfara state wants the state high court to nullify the last November Ward, Local Government and State Congresses conducted in the state.\nThe faction is is challenging the illegality and denial of it’s members to participate fully in the last November CongressesAdvertisementThey describe the exercise as illegal ,unlawful and bridge of the APC ConstitutionLead counsel to the Marafa’s faction Jesse Shaka says members of it’s faction had paid for their forms to contest in various positions during the congresses but we’re denied the formsAdvertisementShaka adds that the APC Congresses at the State, Local government and Ward levels in Zamfara are illegalAlso, Counsel to the Matawalle’s faction Ishaka Dikko arguered that his client had asked for an extension of time to file in an application to challenge the jurisdiction of the court to entertain the case and the plaintiff does not have the locus standing to institute a suit against the APC as he is not a member of the National Working Committee and did not participate in the state congressesAdvertisementAfter hearing from both parties, the presiding judge, Justice Bello Kucheri adjourned the case to 14th, March for an extension of time for the defendants to adopt counter-affidavits and written addresses and for the plaintiff to present preliminary objections."
  },
  {
    "headline": "Abba Kyari Says IPOB Are Out To Destroy Him- Trending With Ojy Okpe",
    "summarized_story": "On Thursday, the Police Service Commission suspended an Assistant Commissioner of Police, Sunday Ubua and an Assistant Superintendent of Police James Bawa who both worked under Kyari in the Intelligence Response Team of the Nigeria Police Force.\nA report by the daily trust quotes Abba Kyari saying that members of the Indigenous People of Biafra and the Eastern Security Network, are behind his travails.\nThe minister, of humanitarian affairs, disaster management and social development, Sadiya Umar Farouq has come under fire on social media for saying that it is elitist to assume that the N5,000 Naira monthly national cash transfer to vulnerable households is insignificant.\nNonye Josephine Ezeanyaeche a 102-year-old woman, who is also referred to as the living legend or Mama Africa, has declared her intention to contest in the 2023 Presidential election."
  },
  {
    "headline": "Leah Sharibu is Not Forgotten Says Reno Omokri – Arise News",
    "summarized_story": "RelatedStories No Content AvailableTo mark the fourth anniversary of the abduction of Leah Sharibu by Boko Haram terrorists from Government Girls’ Science and Technical College in Dapchi, Yobe State, northeast Nigeria, on February 19, 2018, the promoter of the #FreeLeahSharibu Movement, Reno Omokri, releases a single titled, Angels on Guard: A Song for Leah.\nWritten by acclaimed music diva, broadcaster and actress, Onyeka Onwenu, the song is performed by Onyeka and features foremost gospel singer, Panam Percy Paul; Leah’s father, Nathan Sharibu, and Omokri.\nThe song is executive produced by Omokri and is intended to draw global attention to Leah Sharibu’s plight and continued stay in captivity.\nShe was abducted alongside 109 other students of the school, aged 11 to 19, by the radical Islamist group exactly four years ago.\nNow, joining us to discuss the fourth anniversary of her abduction and his unrelenting drive for her release, is Reno Omokri, a lawyer, rights activist, and former aide to President Goodluck Jonathan."
  },
  {
    "headline": "Nigeria’s 3.4% GDP Growth Rate is Big For The Economy Says Bismark Rewane",
    "summarized_story": "CEO, Financial Derivatives Company Limited, Bismarck Rewane in an interview on Global Business Report says that ICT is directly responsible for 11% of the country’s GDP but is indirectly the main driver for the Nigerian economy."
  },
  {
    "headline": "Canada Police Set to End Seige of Protesters Fighting Covid Measures",
    "summarized_story": "We have the plan, we have the commitment, we have the resources,” interim police chief Steve Bell told reporters on Thursday.\nPolice will set up a perimeter with 100 checkpoints around downtown to stop people without legitimate reason from entering, he said.\nThe truckers’ protests started against vaccine mandates for cross-border drivers, a measure in place in the United States, too.\nCalling the blockades a threat to democracy, Trudeau invoked emergency measures on Monday giving his government temporary powers to end the unrest.\nMany protesters on Parliament Hill said they would not leave until their demands were met."
  },
  {
    "headline": "Rebels Accuse Ukraine of Shelling as Russian Media Reports Tank Withdrawals",
    "summarized_story": "Pro-Russia rebels in Ukraine accused government forces of shelling a village on Friday while Russian media reported more infantry and tank units were returning to their bases in contrast to Western fears of an imminent Russian invasion.\nFor a second consecutive day, pro-Russian separatists who have been at war with Ukraine for years said they had come under mortar and artillery fire from Ukrainian forces, according to the Interfax news agency.\nThe Kremlin said on Thursday it was “deeply concerned” with the flare-up in Ukraine and was watching the situation closely.\nPro-Russia rebels in Ukraine accused government forces of shelling a village on Friday while Russian media reported more infantry and tank units were returning to their bases in contrast to Western fears of an imminent Russian invasion.\nThe Kremlin said on Thursday it was “deeply concerned” with the flare-up in Ukraine and was watching the situation closely."
  }
]