[
  {
    "headline": "Igboho files N5.5bn suit against AGF, DSS over Ibadan house invasion",
    "summarized_story": "Igboho, who is currently in detention in Benin Republic, filed the suit on Friday through his counsel, Chief Yomi Alliyu (SAN).\nHe is, in the suit, contending that the invasion of his house in the Soka area of Ibadan, during which DSS operatives gunned down two of his associates and arrested 12 others, was not only malicious but also amounted to a violation of his fundamental human rights.\nHe wants the court to order the defendants to return his personal belongings, which they allegedly carted away during the operations.\nThe court has yet to fix a date for the hearing of the suit.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Moghalu, Yesufu, others to speak at young leaders’ forum",
    "summarized_story": "The Future Project Africa, in partnership with a talk show, Rubbin’ Minds, is set to host the sixth edition of the Nigeria Symposium for Young and Emerging Leaders on Sunday.\nAccording to the organisation, the event with the theme ‘A State of Flux: Where do we go from here?’ will be hosted by the host of Rubbin’ Minds, Ebuka Obi-Uchendu, and televised.\n“Nigerians are plagued with varying levels of challenges ranging from severe poverty, increasing insecurity, and a high rate of unemployment, among others.\nOthers are socio-political activists, Aisha Yesufu, Debo Adedayo (Aka Mr Macaroni), Rinu Oduala and Obianuju Catherine Udeh (DJ Switch); former BBNaija housemate, Tacha Akide; and tech lawyer and policy consultant, Timi Olagunju, among others.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Buni Salutes Security Operatives in Geidam",
    "summarized_story": "Mai Mala Buni has commended the Nigerian Army and other security operatives in Geidam for their uncommon bravery in confronting and repelling an attempt to attack the town yesterday by Boko Haram.\nGovernor Buni saluted the Commanding Officer who mobilised his men and moved out of Geidam to confront the enemy outside the town.\n“You have done us proud, the government and people of the state will continue to support you” Governor Buni assured.\nHe called on the people to always volunteer useful and timely information to the security operatives to enhance proactive measures against such attacks.\n“You are advised to volunteer timely information on suspicious movements around your communities to the security and other relevant authorities to enhance timely response,” he said."
  },
  {
    "headline": "2 men docked over alleged possession of stolen goods",
    "summarized_story": "Two unemployed men, Francis Azampo and Thoji Agosu, on Friday appeared before an Ikeja Chief Magistrates’ Court over unlawful possession of goods suspected to have been stolen.\nAzampo, 33; and Agosu, 23; both residents of Makoko area, Yaba, Lagos, are being tried for conspiracy and unlawful possession.\nThe Prosecutor, ASP Raji Akeem, told the court that the offences were committed on April 13 at Makoko area, Yaba, Lagos.\nHe said the offences contravened Sections 329 and 411 of the Criminal Laws of Lagos State, 2015.\nA. Adelaja, granted the defendants bail in the sum of N50,000 each with two sureties each in like sum."
  },
  {
    "headline": "Death row inmates now 3,008 as FG urges quick action by states",
    "summarized_story": "Disclosing that Nigeria now has 3,008 condemned criminals consisting of 2,952 males and 56 females, the federal government also urged states to build holding centres for awaiting trial suspects to decongest custodial facilities.\nMinister of Interior, Ogbeni Rauf Adesoji Aregbesola, gave the charge on Friday at the commissioning of the Osun State Command office complex of the Nigerian Correctional Service NCoS, Osogbo.\nThe minister’s charge was contained in a statement by his Media Adviser, Sola Fasure issued Friday in Abuja.\nThis can be done by putting in place a system of amnesty and prerogative of mercy that will review all cases of convicts on death row periodically”.\nOn his part, Speaker of the Osun State House of Assembly, Timothy Owoeye, in his goodwill message, commended Ogbeni Aregbesola for his passion for infrastructural development in the state, and urged him not to relent in his efforts."
  },
  {
    "headline": "Crisis: NULGE president says Ebonyi election may hold elsewhere",
    "summarized_story": "Mr Hakeem Ambali, the President of the National Union of Local Government Employees (NULGE), says the Ebonyi election for a new executive may be moved to another state.\nThe News Agency of Nigeria (NAN) reports that the election fixed for Thursday was cancelled for the second time due to the crisis rocking the chapter.\nThe NULGE president regretted that the election, which was fixed the first time in February, failed to take place.\n“We are in Ebonyi for the second time to conduct NULGE election.\n“But that 90 days is not sacrosanct because the election can still hold any day and anytime within the period of 90 days."
  },
  {
    "headline": "Court dismisses suit seeking to halt Lagos LG election",
    "summarized_story": "By Henry OjeluA Federal High Court Ikoyi has refused requests by 11 political parties to halt the Chairmen and Councillors election into the 57 Local Government Councils and Local Council Development Areas in Lagos state.\nHonourable Justice Akintayo Aluko made the decision in a ruling delivered on Friday July 23, 2021, in Suit No FHC/L/CS/596/2021 which was filed by the Alliance of Social Democrats and 10 Other Political Parties against Lagos State Independent Electoral Commission (LASIEC) and Lagos State Government.\nALSO READ: Lagos LG Poll: We ll’ ensure success of election ― Justice Philips, LASIEC ChairmanJustice Aluko in the ruling upheld the submissions of the Lagos State Attorney-General and Commissioner for Justice, Mr Moyosore Onigbanjo (SAN) on behalf of the Lagos State Government.\nThe Court declined jurisdiction to hear and determine the suit seeking to stop the conduct of the election slated for tomorrowIn a similar decision upheld in another matter filed by the Youth Party against LASIEC & Another in Suit No FHC/L/CS/625/2021.\nThe Court not only declined jurisdiction but vacated the Interim Order of Injunction earlier granted in the matter on July 12, 2021."
  },
  {
    "headline": "Buhari returns to Abuja, sends gifts to military officers",
    "summarized_story": "President Muhammadu Buhari returned to Abuja Friday evening after eight days working visit to Katsina.\nThe President commissioned Zobe Regional Water project, and the first NALDA Integrated Farm Estate with modern farming techniques for crops and livestock.\nOn Sallah day, the President met with NYSC members serving in Daura.\nHe hosted House of Representatives Speaker, Femi Gbajabiamila and some lawmakers, 12 APC governors, members of Katsina State House of Assembly, among others.\nBefore departure, the President donated 22 cows to military officers serving in Katsina and Daura."
  },
  {
    "headline": "2023 presidency: Tinubu’ll be worse than Buhari, runs Lagos like pig farm – Adeyanju",
    "summarized_story": "Popular Nigerian rights activist, Deji Adeyanju has predicted that the tenure of Bola Tinubu, National Leader of the All Progressives Congress, APC, would be worse than that of President Muhammadu Buhari, if elected as president of Nigeria in 2023.\nThe convener of Concerned Nigerian advocacy group said Tinubu runs Lagos State like a pig farm.\nThe APC National Leader’s campaign posters have been sighted in some states of the federation.\nDespite such claims, the APC National Leader has remained silent.\nHowever, the INRI Evangelical Spiritual Church leader, Primate Ayodele, had warned Tinubu against pushing for the presidency."
  },
  {
    "headline": "Osun 2022: INEC to deploy voter enrollment devices",
    "summarized_story": "The Independent National Electoral Commission (INEC) in Osun has stated that it has concluded arrangements towards deploying the INEC Voter Enrollment Devices (IVED) to all the local governments across the state as it gets ready to commence the physical registration which begins on Monday, July 26, 2021.\nThis was made known in a press release signed by the Osun Resident Electoral Commissioner (REC), Olusegun Agbaje and made available to DAILY POST in Osogbo.\nAccording to him, the Commission would be conducting quarterly displays as well as using the Automated Biometric Identification System (ABIS) to identify and remove irregular registrants.\nOthers include: registered voters who want to correct issues with their data such as misspelt names, dates of birth and registered voters whose Permanent Voter’s Card are damaged, defaced or lost.\nAgbaje assured that the Continuous Voter Registration will be in place until the middle of May, 2022 to enable the Commission print the voters cards and bring them to Osun State for distribution before the gubernatorial election slated for Saturday, 16th July, 2022."
  },
  {
    "headline": "Nigerian prison congested – FG",
    "summarized_story": "The Federal Government of Nigeria through the Ministry of Interior, has sought the cooperation of state governments in dealing with the challenges of prison congestion.\n“There are presently 3,008 condemned criminals waiting for their date with the executioners in our meagre custodial facilities.” Aregbesola asserted.\n“The State Governments can therefore do three things.\nThe second way the states can share in the burden of decongesting custodial facilities is to join in building holding centres.\nThere are presently 3,008 condemned criminals waiting for their date with the executioners in our meagre custodial facilities.” he concluded."
  },
  {
    "headline": "Cyber crime: FBI declares 6 Nigerians most wanted [PHOTOS]",
    "summarized_story": "The FBI in the United States of America, has declared six Nigerians most wanted for cyber crimes.\nThe Nigerian were declared wanted for cyber crime involving a $6 million swindle of over 70 U.S. businesses.\nTheir names were given as Michael Olorunyomi, Richard Izuchukwu Uzuh, Alex Afolabi Ogunsakin, Felix Osilama Okpoh, Abiola Ayorinde Kayode and Nnamdi Orson Benson.\nThe others on the list, according to FBI, are Uzuh, declared wanted for sending spoofed emails to thousands of U.S. businesses, requesting fraudulent wire transfers alongside his co-conspirators such as Uzuh, who provided hundreds of bank accounts.\nOkpoh’s warrant of arrest was issued August 22, same year with Afolabi Ogunshakin."
  },
  {
    "headline": "Eight moments to expect from BBNaija season six",
    "summarized_story": "By Gbenga BadaAfrica’s biggest reality show, Big Brother Naija, will premiere a brand new season on Saturday, June 24, 2021.\nLike he does every season, Big Brother is bringing a lot of twists and surprises to the show this year.\nMore engaging tasks: If you thought Big Brother Naija Lockdown had the most engaging and rewarding tasks, think again.\nBig Brother Naija season 6 will have even more incredible and financially rewarding activities for the housemates.\nA revamped BBNaija house: Biggie’s House is going to look completely different from the way it did last year."
  },
  {
    "headline": "Tearful procession, tributes for lady hit by stray bullets during Lagos ‘Yoruba Nation’ rally",
    "summarized_story": "By Alao AbiodunIt was an evening of tears and tributes for family members and sympathisers on Friday in the Ojota area of Lagos during a candlelight procession in honour of Jumoke Oyeleke.\nThe Nation reports Oyeleke, a 25-year-old sales lady was hit by stray bullets after police allegedly shots to disperse agitators of ‘Yoruba nation’ rally on July 3.\nBut the police denied responsibility for her death, saying its officers never fired a “single live bullet” at the rally.\nThe Nation reports Lagos Governor Babajide Sanwo-Olu had ordered investigation into her death.\nWe need to honour the dead and ensure we get justice but we all know the country we are in."
  },
  {
    "headline": "'Why Senator Manager knelt before James Ibori'",
    "summarized_story": "By Oluwatomisin AmokeojaAn associate of Senator representing Delta South, James Manager, has explained why he was seen kneeling before a former Governor, James Ibori, in a picture that has gone viral.\nHe confirmed the picture was taken on Wednesday when Manager paid Ibori a courtesy visit.\n“Whenever you go to pay homage to an Urhobo elder or someone you hold in high esteem, you kneel down.\n“You don’t expect the senator to stand up to address Ibori.\n“Senator came to pay homage to him because he had not seen Ibori in a long time and he took drinks."
  },
  {
    "headline": "Obi Cubana on the list of ‘person of interest’ when abroad – Adeyanju",
    "summarized_story": "By Ekaete BasseyActivist Deji Adeyanju has explained the probable consequence of the grandiose ceremony and excessive money splash at ‘Oba’ on the billionaire business man, Obi Cubana.\nAfter the glaring ‘show of wealth’ by the nightlife boss and his numerous associates at the burial ceremony/carnival of his late mum, Deji Adeyanju warned Obi Cubana to slow down on his open display of opulence to avoid ending up in jail.\nAccording to Adeyanju, the Cubana Group boss money show during his late mum’s funeral has now necessitated his dishing out series of explanations.\nHe wrote: “If Obi Cubana had acted responsibly last week, he won’t need all these explanations now.\nADVERTISEMENT“Every time he’s travelling abroad, he will be watched as a “Person of Interest”."
  },
  {
    "headline": "Igboho: Cotouno court shifts extradition trial to Friday",
    "summarized_story": "From Godwin Tsa, AbujaHearing in the extradition trial of detained Yoruba Nation agitator, Sunday Adeyemo, also known as Igboho has been shifted to Friday by Court D’Appeal in Cotouno, Republic of Benin.\nThe development came as the Federal Ministry of Justice on Thursday said it has no information about the planned arraignment and trial.\nIt was reported that Igboho, who was arrested alongside his German wife, Ropo, where taken to court for a scheduled extradition trial.\nIgboho was arrested in Cotonou with his German wife, Ropo, while trying to travel out of the country.\nHowever, according to agency report, the Igboho’s who were taken to court earlier today, were however returned to to cell in Benin Republic, after court proceedings were adjourned to Friday, July 23."
  },
  {
    "headline": "Igboho: Move to fasttrack his extradition suffers set back?",
    "summarized_story": "From Oluseye Ojo, IbadanThe efforts by the Federal Government of Nigeria to fast track the extradition of Yoruba nation activist, Chief Sunday Adeyemo, fondly called Sunday Igboho, may have suffered a setback.\nThis came as indications have emerged that the government of Benin Republic has resolved to in the first instance try Igboho in court allegedly obtaining a fake Beninoise international passport in Cotonou.\nReports from Benin Republic said Igboho and his wife, who were arrested on Monday night on their way to Germany at Cadjèhoun Airport, Cotonou, were taken to court on Thursday.\nSources said the the Beninoise government said it would not handle a request for Igboho’s extradition, until he has been tried for the local offense he was arrested for on the Beninoise international passport.\nA Beninoise lawyer, identified as Rafael Huvehnou, was said to have been hired to defend Igboho in the court."
  },
  {
    "headline": "BREAKING: First batch of Super Tucano aircraft arrives",
    "summarized_story": "The first batch of A-29 Super Tucano aircraft has arrived in Kano, sunnewsonline.com can report authoritatively.\nThe aircraft arrived Nigerian Air Force base in Kano on Thursday July 22, 2021 at about 12.34 pm.\nAir Commodore Edward Gabkwet, NAF Director of Public Relations and Information confirmed the arrival of the fighter aircraft in a statement.\nMinister of Defence, Major General Bashir Magashi (Rtd), Chief of Army Staff, Lieutenant General Faruk Yahaya and Chief of Air Staff, Air Marshal Oladayo Amao”, he said.\nDetails shortly…Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Igboho arrives court in Cotonou",
    "summarized_story": ""
  },
  {
    "headline": "9 die, 16 injured on Lagos-Ibadan expressway accident",
    "summarized_story": "Federal Road Safety Corps (FRSC) in Ogun State has confirmed the death of nine people in an accident involving two vehicles on the Lagos-Ibadan expressway, yesterday.\nFRSC Sector Commander in the state, Ahmed Umar, said 16 other persons sustained varying degrees of injuries.\nThe sector commander further said the accident involved 25 persons, with nine killed and 16 injured.\nUmar said the cause of the accident could be traced to speed violation and overloading on the part of the commercial bus driver.\nHe said the commercial bus lost control due to excessive speeding and rammed into the truck."
  },
  {
    "headline": "World Bank: Nigeria Going through Its Worst Unemployment Crisis",
    "summarized_story": "*Says country’s asylum seekers grew from 27,557 to 408,078 in 10 Years*Applications for refugee status increased by 1,380%* Estimates 4,000 Nigerian children made orphans by COVID-19 World Bank: Nigeria Going through Its Worst Unemployment CrisisBy Ndubuisi Francis and Emmanuel AddehNigeria is currently going through one of its worst unemployment crises in recent times, a new report by the World Bank has stated.\nThis is as the World Bank, in a separate report, has estimated that about 4,000 Nigerian children were made orphans by the COVID-19 pandemic between March 2020 and July 2021.\nThe report, which expressed concern about the country’s rising unemployment situation was published by the Washington-based institution with support from the Korea World Bank Partnership Facility (KWPF) and the Rapid Social Response (RSR) trust funds.\nWorld Bank, however, blamed a combination of rising unemployment, booming demographics, and unfulfilled aspirations as resulting in increasing pressure on young Nigerians to migrate in search of gainful employment overseas.\n“The expanding working-age population combined with scarce domestic employment opportunities is creating high rates of unemployment, particularly for Nigeria’s youth,” the World Bank report noted."
  },
  {
    "headline": "CBN Targets October for Digital Currency Launch",
    "summarized_story": "James Emejo with agency reportThe Central Bank of Nigeria (CBN) yesterday disclosed that its much-anticipated digital currency will be launched on October 1.\nMohammed said the digital payment instrument would further improve payment efficiency, revenue tax collection, remittance improvement, and targeted social intervention.\n“We have spent over two years studying this concept of central bank’s digital currency and we have identified the risks.\nSo, the central bank’s digital currency is the third form of fiat money.\n“The central bank digital currency will just be as good as you having cash in your pocket."
  },
  {
    "headline": "COVID-19: Ehanire Worries Over Possible Spike in Delta Variant",
    "summarized_story": "The Minister’s worry came just as Nigeria Centre for Disease Control (NCDC) said yesterday that it had confirmed 238 new cases of Covid-19 in the country.\nHowever, speaking during a meeting with the leadership of the National Association of Resident Doctors (NARD) at the Federal Ministry of Labour and Employment in Abuja, Ehanire said: “Covid-19 Delta variant is already entering Africa.\nIn Nigeria, the Delta variant was first detected two weeks ago, and we have begun to see an increase in the number of new cases,” he said.\nShe explained that without the data from South Africa, cases rose in Africa by 18 per cent to over 182 000 in the week ending on July 18.\n“Around 3.5 million to four million doses are administered weekly on the continent, but to meet the September target this must rise to 21 million doses at the very least each week,” she said."
  },
  {
    "headline": "A-29 Super Tucano Fighter Planes Arrive Nigeria",
    "summarized_story": "By Kingsley NwezehThe Nigerian Air Force Thursday announced the arrival of A29 Super Tucano fighter planes from the United States.\nThe fighter jets were received by the Minister of Defence, Maj. Gen.Bashir Magashi (rtd) and the service chiefs.\n“The first batch of A-29 Super Tucano aircraft have arrived Kano, today, (Thursday) July 22, 2021 at about 12.34pm.\n“On hand to receive the aircraft were the Honourable Minister of Defence, Major General Bashir Magashi (rtd), Chief of Army Staff, Lieutenant General Faruk Yahaya and Chief of Air Staff, Air Marshal Oladayo Amao,”it said.\nThe aircraft flew through five countries, notably Canada, Spain, Greenland, Iceland and Algeria before arriving Nigeria."
  },
  {
    "headline": "Igboho Arrives Beninoise Court Ahead of Trial",
    "summarized_story": "By Sunday EhigiatorEmbattled Yoruba Nation Activist, Sunday Adeyemo, popularly known as Sunday Igboho earlier today, arrived at the Court De’appal De Cotonou, ahead of his arraignment by the authorities of Benin Republic for immigration-related offences.\nHe was then arrested at Cardinal Bernardin International Airport, Cotonou, Republic of Benin, with his wife on their way to Germany on Monday night.\nAn inside source had on Wednesday night hinted that Igboho might be charged for passport-related reasons.\nThe source said, “Igboho may be arraigned for passport-related offences in Benin Republic tomorrow.\nYoruba leaders in the Benin Republic have been supportive as well.”It was gathered that some Yoruba living in and around Cotonou on Thursday thronged the court awaiting the commencement of the trial."
  },
  {
    "headline": "How Oyedepo's Living Faith Church Paid Graduate Pastors N38,000 Monthly — Another Pastor Opens Up",
    "summarized_story": "Another pastor, who was among the 40 recently sacked pastors by the Bishop David Oyedepo’s Living Faith Church, has explained how pastors who were graduates got N38,000 as salaries.\nThe pastor noted that the gross salary was N53,000 but they were paid N38,000 as the rest was supposed to cover for pension and housing allowance.\nSomeone went online to post lies in support of the church that the recently sacked pastors were being paid N80,000 and house rent of N150,000.\n“I will just say a little here; no employed pastor was paid N80,000 in the church.\nIt was when they sacked us that they started paying into the pension accounts."
  },
  {
    "headline": "How Oyedepo's Living Faith Church Paid Graduate Pastors N38,000 Monthly — Another Pastor Opens Up",
    "summarized_story": "Another pastor, who was among the 40 recently sacked pastors by the Bishop David Oyedepo’s Living Faith Church, has explained how pastors who were graduates got N38,000 as salaries.\nThe pastor noted that the gross salary was N53,000 but they were paid N38,000 as the rest was supposed to cover for pension and housing allowance.\nSomeone went online to post lies in support of the church that the recently sacked pastors were being paid N80,000 and house rent of N150,000.\n“I will just say a little here; no employed pastor was paid N80,000 in the church.\nIt was when they sacked us that they started paying into the pension accounts."
  },
  {
    "headline": "How Oyedepo's Living Faith Church Paid Graduate Pastors N38,000 Monthly — Another Pastor Opens Up",
    "summarized_story": "Another pastor, who was among the 40 recently sacked pastors by the Bishop David Oyedepo’s Living Faith Church, has explained how pastors who were graduates got N38,000 as salaries.\nThe pastor noted that the gross salary was N53,000 but they were paid N38,000 as the rest was supposed to cover for pension and housing allowance.\nSomeone went online to post lies in support of the church that the recently sacked pastors were being paid N80,000 and house rent of N150,000.\n“I will just say a little here; no employed pastor was paid N80,000 in the church.\nIt was when they sacked us that they started paying into the pension accounts."
  },
  {
    "headline": "Bandits Kill 3 Persons In Zamfara, Burn Military Armoured Vehicle During 4-Hour Operation",
    "summarized_story": "Gunmen suspected to be bandits have attacked Dansadau community in the Maru Local Government Area of Zamfara state, killing three persons.\nResidents told SaharaReporters that the bandits stormed the community around 2:30 am on Friday and operated for four hours.\nDeadly attacks have raged across Zamfara State where bandits have thrived.\nAbout 15 brand new Hilux vehicles and cash gifts were also given to leaders of different 'repentant' gangs of bandits by the governor in 2020.\nBut despite all these, communities in the state are still being attacked and residents kidnapped and/or killed."
  },
  {
    "headline": "Bandits Kill 3 Persons In Zamfara, Burn Military Armoured Vehicle During 4-Hour Operation",
    "summarized_story": "Gunmen suspected to be bandits have attacked Dansadau community in the Maru Local Government Area of Zamfara state, killing three persons.\nResidents told SaharaReporters that the bandits stormed the community around 2:30 am on Friday and operated for four hours.\nDeadly attacks have raged across Zamfara State where bandits have thrived.\nAbout 15 brand new Hilux vehicles and cash gifts were also given to leaders of different 'repentant' gangs of bandits by the governor in 2020.\nBut despite all these, communities in the state are still being attacked and residents kidnapped and/or killed."
  },
  {
    "headline": "Lagos LG poll: Results maybe transmitted electronically, says LASIEC",
    "summarized_story": "The Lagos state Independent Electoral Commission (LASIEC) has said that it may transmit results of the local government and council development area elections electronically.\nAdvertisementAyotunde Phillips, chairperson of LASIEC, who spoke on Politics Today, a Channels Television programme, on Friday, said the agency’s website is currently experiencing difficulties but its technicians are working to resolve the issue.\nThe LASIEC boss said voters in possession of the either temporary voter cards (TVCs) or permanent voters card (PVCs) are eligible to vote in Saturday’s local government election in the state.\n“Apart from the website, all the results will go into a cloud and we have paid we have paid for use of that cloud for one year.\nI’m sure we will find a way of allowing access to that information, our technicians will just have to work on it."
  },
  {
    "headline": "Lagos LG poll: Results maybe transmitted electronically, says LASIEC",
    "summarized_story": "The Lagos state Independent Electoral Commission (LASIEC) has said that it may transmit results of the local government and council development area elections electronically.\nAdvertisementAyotunde Phillips, chairperson of LASIEC, who spoke on Politics Today, a Channels Television programme, on Friday, said the agency’s website is currently experiencing difficulties but its technicians are working to resolve the issue.\nThe LASIEC boss said voters in possession of the either temporary voter cards (TVCs) or permanent voters card (PVCs) are eligible to vote in Saturday’s local government election in the state.\n“Apart from the website, all the results will go into a cloud and we have paid we have paid for use of that cloud for one year.\nI’m sure we will find a way of allowing access to that information, our technicians will just have to work on it."
  },
  {
    "headline": "PHOTOS: Benin Republic's 'EFCC' where Igboho is being held",
    "summarized_story": "Sunday Adeyemo, the Yoruba nation agitator better known as Sunday Igboho, is being held at the Economic and Financial Brigade station in Cotonou, Benin Republic, TheCable can report.\nAdvertisementThe Economic and Financial Brigade known in Cotonou as Brigade économique et financière (BEF) is seen as an equivalent of Nigeria’s Economic and Financial Crimes Commission (EFCC).\nThe BEF is one of the buildings within the ministry of interior and public security premises.\nIgboho was, therefore, returned to BEF, where he is expected to remain till he is needed in court.\nHere are pictures of the facility where Igboho is being held:"
  },
  {
    "headline": "PHOTOS: Benin Republic's 'EFCC' where Igboho is being held",
    "summarized_story": "Sunday Adeyemo, the Yoruba nation agitator better known as Sunday Igboho, is being held at the Economic and Financial Brigade station in Cotonou, Benin Republic, TheCable can report.\nAdvertisementThe Economic and Financial Brigade known in Cotonou as Brigade économique et financière (BEF) is seen as an equivalent of Nigeria’s Economic and Financial Crimes Commission (EFCC).\nThe BEF is one of the buildings within the ministry of interior and public security premises.\nIgboho was, therefore, returned to BEF, where he is expected to remain till he is needed in court.\nHere are pictures of the facility where Igboho is being held:"
  },
  {
    "headline": "China donates 470,000 doses of COVID vaccine to Nigeria",
    "summarized_story": "The federal government has received 470,000 doses of COVID vaccine donated by the Chinese government.\nJianchun said the gesture was as a result of the good relationship between Nigeria and China.\nWe need unity to overcome COVID-19.”He added that China would support Nigeria in vaccine production in the long run.\nThe minister said that Nigeria stopped vaccination on July 8 due to lack of vaccines but with the donation, vaccination of citizens would resume in earnest.\nAdvertisementEhanire called for collaborations and exchange of information on ways to eliminate COVID-19."
  },
  {
    "headline": "CBN regulations holding back mobile money revolution in Nigeria",
    "summarized_story": "In Ghana, it would be an “anomaly” for a supermarket, small store, or business merchant to not use a mobile money service for transactions.\nNew agent and electronic money guidelines were released in 2014, allowing network operators to run mobile money services, with supervision from the banking regulator.\nUptake in mobile money services and financial inclusion have equally increased across the country.\nThe regulatory framework is one of the core reasons why mobile money uptake has been relatively slow in Nigeria.\n“The CBN recognises the importance of Mobile Network Operators in the operations of mobile money services and appreciates the criticality of the infrastructure they provide."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October..."
  },
  {
    "headline": "Nigeria’s apex bank chooses open-source blockchain to run digital currency pilot on October 1, 2021",
    "summarized_story": "Share this article:The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October 1, 2021.\nThe apex bank announced earlier on June 10, 2021, that it would launch a pilot scheme for its digital currency before the end of the year.\nHyperledger Fabric blockchainThe Hyperledger Fabric blockchain is a private and permissioned blockchain network designed by computer hardware company, International Business Machines Corporation (IBM).\nIn a Cointelegraph article on July 2, 2019, Stuart Popejoy, blockchain expert and founder of hybrid blockchain platform, Kedena, said that “Fabric’s architecture is far more complex than any blockchain platform while also being less secure against tampering and attacks.\nAdvertisementMeanwhile, CBN says Nigeria cannot be left behind when 80% of central banks globally are considering issuing a central bank digital currency (CBDC)."
  },
  {
    "headline": "Twitter’s downvote button, Cellulant’s licence approval, Convergence Partners’ $120m round",
    "summarized_story": "Today, I’m discussing:Twitter’s shiny new downvote buttonConvergence’ Partners’ $120m roundCellulant’s licence approval in TanzaniaTwitter is testing out a downvote buttonPhoto by Claudio Schwarz | @purzlbaum on UnsplashWhat happened?\nTwitter says while the downvote button will be visible, only the reply owner can know the exact number received.\nHowever, according to Twitter, this is not a dislike button and while it bears some resemblance to Reddit’s downvote button, it will not affect the order of replies.\nCellulant’s new approval will allow it connect to banks, online merchants, payment processors, merchants, state governments, and customers to meet their digital payment demands in Tanzania.\nConvergence Partners raises $120 millionSouth African tech investment firm, Convergence Partners, has raised $120 million to drive inclusion in Africa."
  },
  {
    "headline": "Google x Maliyo Games, Instagram and YouTube’s new features, and Clubhouse leaves beta",
    "summarized_story": "Mobile gaming: Per Business Wire, the mobile gaming market was worth $98 billion globally in 2020 and is expected to grow to $272 billion by 2030.\nAccording to Kevuru games, 59.9% of games were played on mobile in 2020, while 28.70% and 16.11% were played on PC and console, respectively.\nOn July 20, 2021, the company announced in a blog post that it was launching Sensitive Content Control.\nAccording to Instagram, sensitive content isn’t content that breaks the rules but could upset some users.\nOn July 20, 2021, YouTube announced it is rolling out a beta version of its new feature, Super Thanks."
  },
  {
    "headline": "We banned Twitter because of Nnamdi Kanu, EndSARS protests – Malami",
    "summarized_story": "The federal government has said the decision to ban microblogging platform Twitter was because it was being used by Nnamdi Kanu, the leader of the Indigenous People of Biafra (IPOB), and to promote EndSARS protests on October 1.\nIn the counter-affidavit filed by the AGF, the government said it at no time restrained Nigerians from using Twitter.\nThe motion filed at the Federal High Court had contended that the Twitter ban was a fundamental human rights bridge breach.\nBut the AGF countered, saying Nigerians were still using Twitter despite the suspension.\nThe government told the court that the Twitter suspension would be lifted once the platform registers with the NBC and the Corporate Affairs Commission."
  },
  {
    "headline": "Nigeria risks a lost generation on mass abductions of students",
    "summarized_story": "With mass kidnapping of students from schools becoming frequent, Nigeria risks a lost generation who might find it difficult to get ahead in life as they are stripped of the right to education.\nAlready, Nigeria has the highest number of out-of-school children in the World.\nAt 13.5 million, one in five of the world’s out-of-school…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria napping as $173trn energy transition opportunity opens",
    "summarized_story": "The world will need to invest $173 trillion in energy transition systems to achieve net-zero carbon emissions by 2050, opening up new opportunities for the energies of the future, a new study has found.\nBloombergNEF’s (BNEF) New Energy Outlook for 2021, which published the study, relied on long-term scenario analysis on the future of the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Cabinet: Obaseki receives screening committee’s report on 818 nominees – Nigerian Observer",
    "summarized_story": "Godwin Obaseki has received names of potential political appointees that will make his cabinet from the 15-man screening committee he inaugurated for the exercise.\nAccording to him, the political elite in Edo have a sense of preservation, knowing where the state should be rather than where they will be.\n“The purpose of political appointment in government and the role of the civil servants are different and should not be mixed.\nEarlier, the Chairman of the screening Committee Prof. Dennis Agbonlahor, said that the committee examined and screened 129 Commissioner nominees, 113 Senior Special Assistants (SSAs) and 576 Special Assistants (SAs).\nAgbonlahor said that the committee did a good job as all the political appointees were properly examined, screened and their performances scored accordingly."
  },
  {
    "headline": "Obaseki pledges increased support, partnership with security agencies to combat crime in Edo – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the Edo State Commandant of NSCDC, Mr. Aniekan Udoeyup, who was on a courtesy visit at the Government House, Benin City.\n“I want to assure you that we will continue to work with your command.\nI still have to pay salaries, so it will be very challenging for us to bear the burden of other federal security agencies in totality,” Obaseki added.\nEarlier, Udoeyup commended the governor for his support towards the command, adding that they would continue to provide security for all in the state.\nThe commandant, however, appealed to the governor to support the command with logistics to enable them to combat crimes on the highway."
  },
  {
    "headline": "Shaibu hails Edo Beads as state’s basketball team qualifies for national league after 23 years – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Deputy Governor, Rt.\nPhilip Shaibu, has congratulated the state’s basketball team, the Edo Beads, for the team’s qualification for the National Premier League after 23 years.\nShaibu, who received the team led by its coach, Victor Umoru, at the Government House in Benin City, saluted the Edo Beads for making the state proud.\nThe Deputy Governor further reassured the commitment of the state government towards the development of sports, noting that the state is determined to reclaim its lost glory in sports in the country.\nNarrating the team’s success story, the coach noted that for the past 23 years the basketball team has not been in any of the national leagues."
  },
  {
    "headline": "Eid-El-Kabir: Edo govt hails residents on peaceful celebration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commended residents, especially Muslims, on the peaceful Eid-El-Kabir celebration across the state.\nChief of Staff to Edo State Governor, Hon.\nOsaigbovo Iyoha, said the peaceful celebration of Eid-El-Kabir across the state reaffirms the peaceful disposition of Edo people, noting that Governor Godwin Obaseki-led administration will continue to implement policies that foster religious harmony among members of different religious groups.\nHe noted that Muslims in Edo State constitute major stakeholders for sustainable peace and progress in their different endeavours, adding, “Muslims in Edo State have always upheld the import of the Prophet’s teachings.\nIyoha expressed appreciation to Muslims for supporting the Obaseki-led administration MEGA agenda, adding, “The spirit of the Eid-El-Kabir celebration should guide us to live in peace and accommodate one another in building strong coalitions that will entrench development and progress in our state.”..."
  },
  {
    "headline": "EXCLUSIVE: Critical Letter to Buhari divides NIDO Americas as members battle",
    "summarized_story": "NIDO Americas is one of five continental zones that make up NIDO Worldwide, the others are NIDO Europe, NIDO Asia, NIDO Oceania and NIDO Africa.\nThus, NIDO Americas is the continental home of NIDO Americas USA, NIDO Americas Canada, NIDO Americas Belize, etc.\nThat is what NIDO Americas is and I am the chairman Board of Trustees of NIDO Americas”.\nHe however insists that any communication referencing NIDO Americas is construed to be a reference to NIDO Americas BoT, “more so when they are communicating with the presidency,” he added.\nHe traces the disagreement over the letter to what he describes as NIDO Americas Board of Trustees’ interference in the day-to-day affairs of NIDO Americas USA."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "We’re determined to ensure food sufficiently, job creation in Ogun – Gov Abiodun",
    "summarized_story": "Olakunle IdowuOgun State governor, Prince ‘Dapo Abiodun, yesterday said his administration is determined to make sure there is food in abundance in the state while people also live without fear.\nAbiodun added that part of his government’s initiative is also to create employment opportunities for the people especially the youth.\nA beneficiary, Ogunkola Gbemisola, while commending the state governor for providing them with different anchors for their various agricultural produce, noted that the agric scheme has helped in developing their economic worth.\nThe monarch called on the party candidates not to betray the trust of the people when they eventually get into office.\nResponding, Abiodun informed Alake of his administration’s decision to regenerate the state capital."
  },
  {
    "headline": "Lagos agberos generate N123 billion annually – Report",
    "summarized_story": "Analysts say with this size of revenue, if Lagos agberos were to constitute themselves into a state, they would be richer than 35 Nigerian states, second only to their home base, Lagos state.\nIn 2020, Lagos State recorded the highest Internally Generated Revenue of N418.99 billion, accounting for 32.1% of the total, closely followed by Rivers State with N117.19 billion.\nOther states with the highest IGR in 2020 include Abuja (N92.06 billion), Delta (N59.73 billion), Kaduna (N50.75 billion), Ogun (N50.75 billion), and Oyo State (N38.04 billion).\nEstimated daily total collection: N225 millionEstimated monthly total collection: N6.75 billionEstimated yearly total collection: N82.125 billionLevies on Tricycle operators (keke napep)Each keke napep rider pays at least N1,800 to Agberos per day.\nEstimated daily total collection: N90 millionEstimated monthly total collection: N2.7 billionEstimated yearly total collection: N32.85 billionLevies on motorcycle operators (okada)"
  },
  {
    "headline": "Benin court frees Sunday Igboho’s wife, shifts his trial till Monday as Nigeria fails to file charges",
    "summarized_story": "The Cour De’appal De Cotonou, Benin Republic, has adjourned the hearing of the case of Yoruba Nation activist, Sunday Adeyemo, alias Sunday Igboho till Monday, July 26.\nThe umbrella body of the Yoruba self-determination group, Ilana Omo Oodua confirmed this in a statement on Friday.\n“That Nigeria has not been able to come up with charges that could lead the court to order lgboho’s extradition to Nigeria.\nThe court, however, ruled that Igboho be remanded in police custody till the next date of adjournment.\nThis comes as the Department of State Services declared Igboho wanted for allegedly stockpiling arms, an allegation he has denied."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Softcom Sets To Release New Growth Tools For Humans, Businesses",
    "summarized_story": "In order to advance designing solutions that will enable sustainable growth for people and businesses and also unlock potentials that exists in individuals, Softcom will be releasing a bouquet of growth tools for humans and businesses on its platform, Day X; on July 29,2021.\n“Initiatives and platforms have been designed with the entrepreneur to enable ambitious and early stage businesses to position themselves for rapid growth,” Adedji said.\nHe added that with over 14 years experience in innovation and building technology solutions that enable a world of equitable access for people and businesses at scale, Softcom is reiterating its commitment to inclusive human growth with these giant strides.\nSoftcom has worked with these orgaisations to deepen customer intimacy, serve customers,increase revenue, improve decision making, and deliver on their various objectives using technology.\nSoftcom now proud itself as a “Business 2 Entrepreneur” company – a proud partner of potential to dreamers and doers with the company solutions."
  },
  {
    "headline": "Softcom Sets To Release New Growth Tools For Humans, Businesses",
    "summarized_story": "In order to advance designing solutions that will enable sustainable growth for people and businesses and also unlock potentials that exists in individuals, Softcom will be releasing a bouquet of growth tools for humans and businesses on its platform, Day X; on July 29,2021.\n“Initiatives and platforms have been designed with the entrepreneur to enable ambitious and early stage businesses to position themselves for rapid growth,” Adedji said.\nHe added that with over 14 years experience in innovation and building technology solutions that enable a world of equitable access for people and businesses at scale, Softcom is reiterating its commitment to inclusive human growth with these giant strides.\nSoftcom has worked with these orgaisations to deepen customer intimacy, serve customers,increase revenue, improve decision making, and deliver on their various objectives using technology.\nSoftcom now proud itself as a “Business 2 Entrepreneur” company – a proud partner of potential to dreamers and doers with the company solutions."
  },
  {
    "headline": "Tension In Enugu As Security Forces Raid ESN Camp",
    "summarized_story": "Tension heightened on Friday at Akpawfu community in Nkanu East local government area of Enugu State following the reported raiding of the secret camp of the Eastern Security Network (ESN) arm of the proscribed Independent People of Biafra (IPOB) by a combined team of security operatives.\nIt was further learnt that the ESN members reportedly resisted the security operatives from accessing their camp, thereby engaging them in a gun duel which reportedly lasted for several hours.\nResidents of the three communities were said to have fled their homes and sought refuge in the bush for fear of being arrested by security operatives who eventually made several arrests.\nIt was further learnt that Akpawfu and neighbouring communities of Akpugo and Amagunze have been deserted as the security men have invaded the entire area searching for the ESN members.\nSome of the residents who spoke to our correspondent claimed that the heavy sound of gunfire could be likened to that of a raging war."
  },
  {
    "headline": "Tension In Enugu As Security Forces Raid ESN Camp",
    "summarized_story": "Tension heightened on Friday at Akpawfu community in Nkanu East local government area of Enugu State following the reported raiding of the secret camp of the Eastern Security Network (ESN) arm of the proscribed Independent People of Biafra (IPOB) by a combined team of security operatives.\nIt was further learnt that the ESN members reportedly resisted the security operatives from accessing their camp, thereby engaging them in a gun duel which reportedly lasted for several hours.\nResidents of the three communities were said to have fled their homes and sought refuge in the bush for fear of being arrested by security operatives who eventually made several arrests.\nIt was further learnt that Akpawfu and neighbouring communities of Akpugo and Amagunze have been deserted as the security men have invaded the entire area searching for the ESN members.\nSome of the residents who spoke to our correspondent claimed that the heavy sound of gunfire could be likened to that of a raging war."
  },
  {
    "headline": "PIB: Degi-Eremienyo Accuses Dickson Of Instigating Violence In N’Delta",
    "summarized_story": "According to him, if Senator Dickson was not cautioned, his comments could lead to civil unrest in the Niger Delta region.\nDegi-Eremienyo accused Dickson of contributing nothing to the realisation of the PIB and development of host communities as a governor, saying he was only interested in derivation funds for his villages.\nLawmakers from the Niger Delta region including myself spoke, argued for upward increase commensurate to our contributions and sacrifices.\n“During the public hearing at various centres, host communities canvassed same postion.\n“This was the decision of the National Assembly and not that of the Minister of State for Petroleum Resources, Chief Timipre Sylva."
  },
  {
    "headline": "DSS warns: Public display of affluence dangerous",
    "summarized_story": "The Department of State Services has warned Nigerians on the dangers of public display of affluence, saying it is great security risk.\nMr. Paul Oduh, the Deputy Director, Security Enforcement of the Service in Kwara Command, gave the warning on Friday in Ilorin.\nHe said this in a paper presentation, entitled: “Security tips for health practitioners in Kwara,” at a symposium organised by the state branch of the Nigeria Medical Association.\nOduh hinted that such show of affluence in public was one of the factors that usually attract attention of criminal elements.\nOduh described security tips as protection tips given to protect and secure lives and property."
  },
  {
    "headline": "DSS warns: Public display of affluence dangerous",
    "summarized_story": "The Department of State Services has warned Nigerians on the dangers of public display of affluence, saying it is great security risk.\nMr. Paul Oduh, the Deputy Director, Security Enforcement of the Service in Kwara Command, gave the warning on Friday in Ilorin.\nHe said this in a paper presentation, entitled: “Security tips for health practitioners in Kwara,” at a symposium organised by the state branch of the Nigeria Medical Association.\nOduh hinted that such show of affluence in public was one of the factors that usually attract attention of criminal elements.\nOduh described security tips as protection tips given to protect and secure lives and property."
  },
  {
    "headline": "killed policemen: Soldiers ‘sack’ Enugu community",
    "summarized_story": "Residents of Akpawfu community in Nkanu East Local Government Area of Enugu State on Friday fled from their homes when men of the Nigerian Army allegedly invaded the community.\nIt was gathered the operation followed the killing of some policemen at checkpoints in nearby communities in the area on Wednesday night.\nThe soldiers reportedly took over the community as early as 4 am on Friday, searching all houses and arresting scores of youths and able bodied men.\nNo fewer than five policemen were reportedly killed during the attack that also three passersby dead, including a pastor and young lady.\nThe operation by the soldiers, it was learnt, turned the once peaceful community into a ghost town."
  },
  {
    "headline": "killed policemen: Soldiers ‘sack’ Enugu community",
    "summarized_story": "Residents of Akpawfu community in Nkanu East Local Government Area of Enugu State on Friday fled from their homes when men of the Nigerian Army allegedly invaded the community.\nIt was gathered the operation followed the killing of some policemen at checkpoints in nearby communities in the area on Wednesday night.\nThe soldiers reportedly took over the community as early as 4 am on Friday, searching all houses and arresting scores of youths and able bodied men.\nNo fewer than five policemen were reportedly killed during the attack that also three passersby dead, including a pastor and young lady.\nThe operation by the soldiers, it was learnt, turned the once peaceful community into a ghost town."
  },
  {
    "headline": "Buhari gifts soldiers in Katsina 22 cows",
    "summarized_story": "For soldiers in Katsina state and Daura, the memories of President Buhari’s eight day visit will linger for some time, as he gifted them 22 cows.\nHe donated five cows each to the Brigade and Air Force base in Katsina, the state capital.\nDuring the 8-day visit, Buhari commissioned Zobe Regional Water project, which will provide 50 million litres of water to the state.\nOn Sallah day, the President met with NYSC members serving in Daura, and gave them two cows, N1 million and 20 bags of rice.\nPresident Buhari also hosted Speaker of the House of Representatives, Femi Gbajabiamila and some lawmakers, 12 APC governors, members of Katsina State House of Assembly."
  },
  {
    "headline": "Ogun goes to LG poll today, slams movement restriction",
    "summarized_story": "By Adejoke AdeleyeThe Ogun State Government has announced a statewide restriction of movement today to allow for a smooth and peaceful conduct of local government election.\nThe nine-hour restriction will take place between the hours of 7.00am and 4.00pm, according to a statement by the State Commissioner for Information and Strategy, Alhaji Abdulwaheed Odusile.\nThe restriction, was at the instance of the Ogun State Independent Electoral Commission (OGSIEC) which is conducting the councillorship and chairmanship elections in all the 236 wards across the 20 local government areas in the state.\nHowever, during the period of the restriction, voters will be free to move to their polling centers within their neighborhood and cast their votes for the candidates of their choice.\nThe statement urged the electorate to be peaceful and avoid any act that could tarnish the hard-earned reputation of Ogun State as one of the most peaceful states in the country."
  },
  {
    "headline": "Rogue bank cashier Adeolu Longe sends self, wife, mother-in-law to prison",
    "summarized_story": "A rogue bank cashier, Ebenezer Adeolu Longe, his wife, Isakunle Olamide Oyinlola and his mother-in- law, Isakunle Eunice Moradeke were today sentenced to 60-year imprisonment each.\nIt was alleged that sometime in February 2018 the bank received a complaint concerning the missing N62, 400.00 in a customer’s account.\nIn the course of investigation, the said transaction was allegedly traced to Ebenezer Alonge’s wife’s account.\nFurther investigation however, revealed that there was a turnover of over N21, 000,000.00 as deposit from other customers in his wife’s account.\nThe court ordered Alonge to forfeit his house, which shall be sold and the proceeds used to restitute the bank."
  },
  {
    "headline": "BREAKING: Another Nigerian Army Officer Shot Dead",
    "summarized_story": "According to a wireless communication seen by Peoples Gazette, Abbas Fatai, a military officer of the 16 Brigade in Yenagoa, was shot dead by suspected members of the Icelanders cult group.\nAccording to preliminary army investigations, Mr Fatai was shot dead at Igbogene Junction in Yenagoa Local Government Area of Bayelsa State, where he resided, at around 09:12 p.m. on July 22.\nThe officer was ambushed and shot by a cult lead by a man named Confidence, who was then brought to the hospital where he was pronounced dead.\nHassan Ahmed, a Nigerian Army general, was killed by gunmen on the Abuja-Lokoja expressway on July 15.\nBrig.-Gen. Onyema Nwachukwu, Director, Army Public Relations, issued a statement announcing Mr. Ahmed’s death."
  },
  {
    "headline": "Nigeria Has Remained Together Only By God’s Grace – Buhari",
    "summarized_story": "President Muhammadu Buhari said Friday in Daura, Katsina State, that Nigeria is still together solely by God’s grace.\nWhen Buhari paid a visit to the Emir of Daura, Dr. Umar Faruk Umar, in his palace, he said this.\nDespite divisions that led to a 30-month civil war, he claimed that God’s favor had kept Nigeria together as a country.\n“We want to thank God always for keeping us together as a country.\n“We still thank God for keeping us together."
  },
  {
    "headline": "Nnamdi Kanu To Appear In Court On Monday Despite Judges’ Vacation",
    "summarized_story": "The leader of the Indigenous People of Biafra, Nnamdi Kanu, is slated to appear in court on Monday July 26th as initially announced.\nIt was widely believed that Kanu’s case may not come up on the scheduled date due to an annual holiday for Nigerian Judges.\nThe Judges’ Vacation will be in effect until September 17, 2021.\nHowever, in a statement made available to report on Friday, Kanu’s lawyer, Barr.\n“Remember Mazi Nnamdi Kanu, and the entire Legal team in your prayers."
  },
  {
    "headline": "Igboho’s Lawyer Reacts To Claims Of Activist Being Arraigned For Fake Beninese Passport",
    "summarized_story": "Sunday “Igboho” Adeyemo’s lawyer in the Benin Republic, Ibrahim Salami, has dismissed reports that the activist was arrested with a fraudulent Beninese passport.\nMr. Igboho and his wife, Ropo, were apprehended while attempting to board a trip to Germany.\nAccording to allegations in the media, the separatist leader would be tried in Cotonou for obtaining a fraudulent Beninese international passport.\nIf proven guilty, possessing a forged Beninese passport carries a maximum punishment of 21 years in jail.\nHis wife had only her German passport on her at the point of arrest,” he added."
  },
  {
    "headline": "Pictures: Concerns as Senator James Manager kneels before ex- governor James Ibori over ‘gubernatorial ambition’",
    "summarized_story": "NextPatriarchy’ll be subdued, won’t be barrier to women – Talabi Taiwo Michael"
  },
  {
    "headline": "Breaking: At last, Jadon Sancho completes Manchester United switch",
    "summarized_story": "England winger Jadon Sancho says joining Manchester United is “a dream come true” after he completed his £73m move from Borussia Dortmund.\nSancho is the second most expensive English player of all time behind his new United team-mate Harry Maguire.\n“The chance to join Manchester United is a dream come true and I just cannot wait to perform in the Premier League.\nThe completion of the deal brings to an end United’s protracted pursuit of former Manchester City player Sancho.\n“Jadon epitomises the type of player I want to bring to the club – he is a forward player in the best traditions of Manchester United,” Solskjaer told the club website."
  },
  {
    "headline": "Credible polls: Unease over Electoral Act amendment",
    "summarized_story": "The contentious sections, the dramaThe electoral amendment report in the Senate contained 154 sections and out of this, the provision of Section 52 (3) of the Electoral Act (amendment) Bill 2021 was the most contentious.\nSecondly, the Electoral Act amendment, we have gone through a serious and probably torturous process to reach where we have to bypass it.\nOf course, the National Assembly has the power to flesh out the legal framework but that has to be consistent with the Constitution.\nSo, why should they now think they can subvert INEC’s independence by asking it to get approval from NCC and National Assembly.\nAnd I can tell you that there are so many people who will go to court to challenge the National Assembly."
  },
  {
    "headline": "NASS insensitive to concerned Nigerians on PIB, Electoral Act – Senator Dickson -NigPilot",
    "summarized_story": "Senator representing Bayelsa West District in the National Assembly, Seriake Dickson, has described the recently passed Petroleum Industry Bill, PIB , and the Electoral Act (Amendment) Bill, 2021 by the parliament as offensive and insensitive to concerned Nigerians.\nDickson, who addressed journalists yesterday in Abuja over the perceived shortcomings in the two bills, however, warned that the approved three percent Host Communities Trust Fund in the PIB may lead to unrest in the Niger Delta region.\n“Might and majority do not build a diversified nation like Nigeria, but presence of justice, fairness.\nHe therefore appealed to President Muhammadu Buhari not to assent to the bill, but send it back for more consultation and required Inclusiveness in its proposals.\n“Fortunately a window of striking out that amendment is already provided by the House of Representatives which adopted the clause as originally proposed."
  },
  {
    "headline": "Finally, Nigeria takes delivery of six Super Tucano aircraft -NigPilot",
    "summarized_story": "The statement added that top government functionaries and Service Chiefs received the modern platforms from the manufacturer.\nRecall that the Nigerian Air Force (NAF) on 15, July 2021, in a statement announced that the first batch of six A-29 Super Tucano aircraft departed the United States of America on Wednesday, 14 July 2021 enroute Nigeria.\nThe second batch of the remaining six aircraft brand would be delivered towards the end of the year.\nMilitary experts believe that the arrival of the six A-29 Super Tucano aircraft would change the paradigm in the war against insurgency and anti banditry operations.\n“With the delivery of the modern aircraft to government today, there is end in sight in the over one decade war against insurgency and terrorism,” they said."
  },
  {
    "headline": "Nigerian Army immortalize late COAS, Ibrahim Attahiru -NigPilot",
    "summarized_story": "The Nigerian Army on Thursday immortalized the immediate past Chief of Army Staff (COAS), late Lt Gen Ibrahim Attahiru who died in an air mishap in Kaduna.\nThe Chief of Army Staff (COAS) Lieutenant General Faruk Yahayadisclosed that the complex was christened after the late Chief of Army Staff, Lieutenant General Ibrahim Attahiru, to honor him for his contribution and sacrifice towards the upliftment of the Nigerian Army.\nThe structure, as described by the cantonment maintenance officer, Major Suleiman, has the capacity to accommodate eight staff officers and other supporting staff.\nThe new office accommodation consists of six medium size en-suite offices, two executive size en-suite offices, two Personal Assistants’ offices, as well as two offices for administrative staff.\nDignitaries present at the occasion were the Chief of Operations Army, Major General Olufemi Akinjobi, Theatre Commander OPHK, Major General Christopher Musa, Provost Marshal Army, Major General Olumuyiwa Aiyenigba, Chief of Military Intelligence (Army) Brigadier General Danladi Salihu, Acting General Officer Commanding 7 Division/Commander Sector 1 OPHK, Brigadier General Abdulwahab Eyitayo, Component Commanders OPHK and Principal Staff Officers, amongst others."
  },
  {
    "headline": "COAS presents new vehicle to Regimental Sergeant Majors -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS) Lieutenant General Faruk Yahaya has presented a new official vehicle to the Regimental Sergeant Majors (RSM) of the Nigerian Army to enhance their functionality.\nGeneral Yahaya handed over keys and official documents of a brand new Toyota Hilux to the Regimental Sergeant Major (RSM) of Headquarters 7 Division, Master Warrant Officer Mohammed Babayo, during an operational visit to the Divisions.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu in a statement saidthe move is aimed at restoring the prestige associated with the office of an RSM.\nGeneral Yahaya described RSM as the custodian of Nigerian Army customs, ethics, and traditions.\nIt will be recalled that the COAS had earlier presented two Hilux vehicles to Army Headquarters and Army Headquarters Garrison RSMs, during the Nigerian Army Day Celebration (NADCEL) 2021 in Abuja."
  },
  {
    "headline": "Police To Deploy Additional 25,000 Officers Ahead Of Lagos Council Polls",
    "summarized_story": "﻿An additional 25,000 policemen will be deployed to beef up security in the local government elections scheduled to hold on Saturday in Lagos State.\nThe Chairperson, Lagos State Independent Electoral Commission (LASIEC), Justice Ayo Philips, disclosed this on Channels TV’s Politics Today on Friday.\nPhilips explained that the Commissioner of Police for Lagos State gave her the assurance earlier in the day.\nOnigbanjo told the judge that the Federal High Court lacked the jurisdiction to entertain their claims.\nThe court also transferred the suit to the State High Court pursuant to Section 22 (2) Federal High Court Act."
  },
  {
    "headline": "‘Keep Your Cheque’, President Buhari Tells Businessmen To Remember The Needy",
    "summarized_story": "President Muhammadu Buhari has urged businessmen, contractors and other privileged Nigerians who are beneficiaries of government patronage to always engage in Corporate Social Responsibility, instead of seeking to favour individuals with gifts.\nSpeaking further, President Buhari noted that he would love to visit Daura more frequently, but for the high cost of presidential movements and exposing security personnel to the weather, assuring that his heart remains with the people.\nIn his remarks, the Emir of Daura thanked the President for always creating time to visit his hometown and the palace despite the tight schedule.\nAt the meeting, the Emir publicly announced the conferment of the title of Talban Daura on Yusuf Buhari, son of President Buhari.\nThe Emir also announced the creation of a District in the community of the President, with headquarters in Dumurkol."
  },
  {
    "headline": "Court Orders DSS To Produce Igboho’s Associates",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has ordered the Department of State Service (DSS) to produce the 12 aides of Sunday Adeyemo, also known as Sunday Igboho, who have been in their custody since the second of July, 2021.\nREAD ALSO: Sunday Igboho Arrested In Benin RepublicThey also claimed that their arrest and subsequent detention were unlawful.\nEarlier, Igbohos aides had sought an order of the court, through their counsel, Pelumi Olajenbasi, compelling the DSS to produce them before the court and to show why they shouldn’t be granted bail in accordance with the provision of section 32 of the criminal justice act 2015.\nTheir counsel told the court that his clients have remained underground for the past 20 days, and were denied freedom.\nHe added that they were Nigerian citizens and have inherent rights, just like others, and the world is watching how the judiciary, would vitalize the consciousness of Nigerians."
  },
  {
    "headline": "Bandits Invade Zamfara Community, Kill 3 Persons, Abduct 7",
    "summarized_story": "Bandits have again attacked the Dansadau community within Maru Local Government Area of Zamfara State, killing 3 persons and abducting 7 others.\nA source in the community told Channels TV that the armed bandits attacked the community around 2:30am and the siege lasted for about 4 hours, ending in the early hours of Friday morning.\nHe also confirmed that armoured personnel carrier belonging to the Nigerian military was also set ablaze by the bandits.\nAs of the time of filing this report, the state police command was yet to confirm the latest attack, though the public relations officer promised to get back to our correspondent with more information.\nDansadau community is about ninety-nine kilometers from Gusau the Zamfara State capital and is one of the hottest zones in terms of banditry, kidnappings, and other related crimes in the state."
  },
  {
    "headline": "Police Rescue 11-Year-Old Boy From Kidnappers In Edo",
    "summarized_story": "The police in Edo State on Friday rescued an 11-year-old boy from kidnappers, authorities confirmed to Channels Television.\nThis followed a report received by the Ososo Divisional Headquarters that the victim was abducted at Ososo in Akoko Edo Local Government Area of the state on July 19.\nUpon receiving the information, the Commissioner of Police, Philip Aliyu Ogbadu, immediately drafted operatives from the Anti-Kidnapping and Cyber-crime unit of the command.\nThe operation, led by its Commander, SP Patrick Balogun involved pain-staking/high-tech tracking and intelligence-led techniques that uncovered the hoodlums’ hideout in the Uneme Erunu/Okpella area of Akoko Edo.\nReacting to the success recorded, the police boss warned that Edo State can never be a safe haven for criminals and their activities."
  },
  {
    "headline": "Former PDP National Youth Leader Dennis Alonge, others defect to APC",
    "summarized_story": "A former National Youth Leader of the People’s Democratic Party (PDP), Dennis Alonge has detected to the All Progressives.\nHe led scores of his supporters to the APC at the party secretariat.\nA former council chairman, Akin Aibunuomo also led his supporters to join APC.\nGovernor Akeredolu said the new members will be fully integrated into the scheme of things.\nAdvertisementEarlier the leaders of the defectors, Dennis Alonge said they were attracted to the APC by the outstanding performance of Governor Akeredolu."
  },
  {
    "headline": "Ogun PDP will participate in tomorrow’s local government elections- Leke Shittu",
    "summarized_story": "The Peoples Democratic Party (PDP) leadership in Ogun State, led by the court-backed Leke Shittu, has announced that the party will run in the local government elections tomorrow, SaturdayIn a statement signed by him and made available to journalists in the state capital, Hon Leke Shittu stated that the clarification was necessary due to the confusion caused by a statement attributed to one Hon Sikirulai Ogundele claiming that the PDP had withdrawn from tomorrow’s local government elections.\nHon Shittu disclosed that ” this is to inform the general public and good people of Ogun State that the party has and will never pull out of tomorrow’s local government elections.\nWe have done all that we are supposed to do under the law and we will surely participate in tomorrow’s local government elections.\nIt’s all gimmicks to create confusion where there is none but as the authentic leadership of Ogun PDP, the opposition party is participating in tomorrow’s local government elections”.\nLeke Shittu has however urged the the residents of the state to disregard the statement credited to Hon Sikirulai Ogundele saying that “as the authentic leadership of PDP in Ogun State, we are going ahead with the local government elections as scheduled for tomorrow, July 24”."
  },
  {
    "headline": "Ogun state restricts movement for Local Government elections",
    "summarized_story": "The Ogun State Government has announced a statewide restriction of movement on Saturday July 24, 2021 to allow a smooth and peaceful conduct of local government elections scheduled to take place this weekend.\nThe nine-hour restriction will take place between the hours of 7am in the morning and 4pm in the evening, according to a statement by the State Commissioner for Information and Strategy, Alhaji Abdulwaheed Odusile.\nThe restriction, the statement said, was at the instance of the Ogun State Independent Electoral Commission (OGSIEC) which is conducting the councillorship and chairmanship elections in all the 236 wards across the 20 local government areas in the state.\nHowever, during the period of the restriction, voters will be free to move to their polling centers within their neighborhood and cast their votes for the candidates of their choice.\nThe statement urged the electorate to be peaceful and avoid any act that could tarnish the hard-earned reputation of Ogun State as one of the most peaceful states in the country."
  },
  {
    "headline": "Former Edo Commissioner Osemwingie-Ero Speaks on Stolen Benin Bronzes",
    "summarized_story": "As Nigeria continues in its global quest to secure the return of precious artefacts stolen from the ancient Kingdom of Benin by British colonial forces in 1897, controversy brews back home over where they should be warehoused and their ownership.\nFormer Edo State Commissioner for Arts, Culture and Tourism, Mr. Osaze Osemwingie-Ero, joined the Morning Show fo discuss the twists and turns surrounding the custody and ownership of the artefacts.\nWatch the interview for more…"
  },
  {
    "headline": "China’s Xi Urges People in Tibet to ‘Follow Party’ in Rare Visit",
    "summarized_story": "China’s President Xi Jinping made his first visit to the Tibet Autonomous Region as national leader this week and urged people there to “follow the party”, state news agency Xinhua said on Friday.\nThe visit also shows the ruling Chinese Communist Party’s confidence in having established order and gained support in the region, analysts say.\nHe also said that only when the people “follow the party” can the “rejuvenation of the Chinese nation” be realised.\nMore than 80 percent of the population in Tibet are ethnic Tibetan while Han Chinese are the minority.\nThe Chinese leader has previously visited Tibet twice, once in 1998 as Fujian province’s party chief and another time in 2011 as vice president."
  },
  {
    "headline": "Tokyo Olympics: Algerian Judoka Withdraws Over Potential Meeting with Israeli",
    "summarized_story": "Algerian judoka Fethi Nourine has withdrawn from Tokyo 2020 after the draw set him on course for a potential meeting with an Israeli opponent.\nNourine, 30, was due to face Sudan’s Mohamed Abdalrasool in Monday’s first round of the men’s -73kg class.\nNourine pulled out of the 2019 world championships, also in Tokyo, after being paired with Butbul – who has a first-round bye.\nWe made the right decision,” Nourine’s coach Amar Ben Yaklif told Algerian media.\nIran was banned by the International Judo Federation (IJF) for four years after it ordered Saeid Mollaei to pull out of the world championships in Japan in 2019."
  },
  {
    "headline": "Pandemic-hit Tokyo Olympics Open in Low-key Ceremony Without Fans",
    "summarized_story": "The virus-delayed Tokyo Summer Olympics have finally opened on Friday with cascading fireworks and made-for-TV choreography that unfolded in a near-empty stadium, a colourful but strangely subdued ceremony that set a striking tone to match a unique pandemic Games.\nJapanese tennis star Naomi Osaka lit the Olympic cauldron to mark the formal start of Tokyo 2020.\nFlagbearers Musa Bwogi and Kirabo Namutebi of Uganda lead their contingent in the athletes’ parade during the opening ceremony [Phil Noble/Reuters]Japanese Emperor Naruhito cheered on the athletes.\nThe ceremony was marked by major absences, including former Prime Minister Shinzo Abe, who wooed the Games to Tokyo.\nTokyo is also battling a surge in virus cases and is under emergency measures though they fall short of a strict lockdown."
  },
  {
    "headline": "Zuckerberg Wants Facebook to Become Online ‘Metaverse’",
    "summarized_story": "Mark Zuckerberg has laid out his vision to transform Facebook from a social media network into a “metaverse company” in the next five years.\nA metaverse is an online world where people can game, work and communicate in a virtual environment, often using VR headsets.\nThe Facebook CEO described it as “an embodied internet where instead of just viewing content – you are in it”.\nFacebook is also working on an “infinite office” that lets users create their ideal workplace through VR.\nZuckerberg admitted current VR headsets were “a bit clunky” and needed improving for people to work in them all day."
  }
]