[
  {
    "headline": "Consultants overwhelmed as resident doctors’ strike paralyses health services at LASUTH",
    "summarized_story": "Sodipo, who is also the Chairman of Medical Guild, said, “The consultants are definitely overwhelmed because the resident doctors play a critical role in rendering health services.\n“It’s impossible to render full services because the backbone of every hospital especially the specialist centres are the resident doctors and even in the ratio, we have fewer consultants to resident doctors.\n“It is consultants who manage patients; resident doctors are just special trainees.\n“This strike is total and indefinite, which means all services provided by resident doctors including emergency services, will not be available at LUTH.\n“Their strike is extremely justified and before resident doctors will go on strike, they choose their fight."
  },
  {
    "headline": "Consultants overwhelmed as resident doctors’ strike paralyses health services at LASUTH",
    "summarized_story": "Sodipo, who is also the Chairman of Medical Guild, said, “The consultants are definitely overwhelmed because the resident doctors play a critical role in rendering health services.\n“It’s impossible to render full services because the backbone of every hospital especially the specialist centres are the resident doctors and even in the ratio, we have fewer consultants to resident doctors.\n“It is consultants who manage patients; resident doctors are just special trainees.\n“This strike is total and indefinite, which means all services provided by resident doctors including emergency services, will not be available at LUTH.\n“Their strike is extremely justified and before resident doctors will go on strike, they choose their fight."
  },
  {
    "headline": "NARD tackles MDCN, says house officers have right to join strike",
    "summarized_story": "Lara AdejoroThe National Association of Resident Doctors on Tuesday said house officers are bonafide members of the association and have the right to join the ongoing strike initiated by the association.\nThe NARD was responding to the threat issued by the Medical and Dental Council of Nigeria on Monday that house officers who embark on strike will suffer a reposting with no remuneration.\nThe Registrar of the MDCN had, however, in a statement titled “Press release on professional ethics for house officers,” noted that house officers who join the ongoing strike should be reported immediately to the Chief Medical Director, Medical Director, or Medical Superintendent of the housemanship of the institution.\nGenerally, it is expected that on employment, house officers should complete their postings within 12 calendar months.\n“As we speak, some of our younger colleagues (house officers) are still being owned salaries ranging from one to three months."
  },
  {
    "headline": "NARD tackles MDCN, says house officers have right to join strike",
    "summarized_story": "Lara AdejoroThe National Association of Resident Doctors on Tuesday said house officers are bonafide members of the association and have the right to join the ongoing strike initiated by the association.\nThe NARD was responding to the threat issued by the Medical and Dental Council of Nigeria on Monday that house officers who embark on strike will suffer a reposting with no remuneration.\nThe Registrar of the MDCN had, however, in a statement titled “Press release on professional ethics for house officers,” noted that house officers who join the ongoing strike should be reported immediately to the Chief Medical Director, Medical Director, or Medical Superintendent of the housemanship of the institution.\nGenerally, it is expected that on employment, house officers should complete their postings within 12 calendar months.\n“As we speak, some of our younger colleagues (house officers) are still being owned salaries ranging from one to three months."
  },
  {
    "headline": "BREAKING: Gov Sanwo-Olu meets Tinubu in London [PHOTOS]",
    "summarized_story": "By Idowu BankoleLagos State Governor, Babajide Sanwo-Olu is currently in a meeting with the National Leader of the All Progressive Congress, APC, Asiwaju Bola Tinubu in LondonDetails of the meeting has not been revealed to reporters yet but it not unconnected to stories making rounds on the health status of the APC National Leader, Asiwaju Bola Tinubu.\nReports have it that the meeting is holding currently in London.\nBut there had been news making the rounds that Asiwaju Bola Tinubu was ill last week, a development which prompted his media aide to swiftly debunked the mendacious story.\nPolitical allies believe that Gov Sanwo-Olu’s visit will put to rest speculation surrounding Tinubu’s health status."
  },
  {
    "headline": "Secondus blasts Ude-Okoye, urges him to obey his sponsors",
    "summarized_story": "By Dirisu Yakubu, AbujaNational chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus has advised the national youth leader of the party, Hon.\nSunday Ude-Okoye to stay true to his sponsors rather than fixating on him.\nIn a statement signed by Ike Abonyi, media adviser to Secondus, the PDP chair questioned the rationale in asking for his resignation.\n“The media office of the national chairman has described as unfortunate the statement from the Party’s National Youth leader calling on the national chairman of the party, Prince Uche Secondus to resign from his position.\n“The media office wonders why it took the national youth leader three and half years before realizing that the national chairman is incompetent or that he is enriching himself."
  },
  {
    "headline": "MOWCA has no scribe for now, FG insists",
    "summarized_story": "In a statement signed by Eric Ojiekwe, Director, Press and Public Relations, Federal Ministry of Transportation, the Nigerian delegation to the election dismissed speculations that the country quit the body because it lost the plum office of Secretary-General.\n“It has come to our notice that a section of the media are reporting that Nigeria backed out of the Maritime Organisation of West and Central Africa, MOWCA, after losing election into the office of Secretary-General of the organization.\n“There is no substantive Secretary-General of the organization presently because of this impasse.\n“Nigeria left the discussions preceding elections because as a country we will not be a party to circumvention of laid down rules and extant procedures governing the 46-year-old body,” the statement read.\nVanguard News Nigeria"
  },
  {
    "headline": "COVID-19: Anxiety as over 20 corps members feared infected",
    "summarized_story": "File photo of Corps membersBy Ozioruva Aliu, Benin-CityThere is anxiety at the National Youth Service Corps (NYSC) orientation camp in Edo State as not less than 20 members have been isolated at the Stella Obasanjo Hospital after displaying symptoms related to COVID-19.\nA source at the hospital told Vanguard late Tuesday that “17 of them were brought over the weekend and by today, more have been brought but they are being monitored”.\n“One of the decisions to be made is the nature and preparation of facilities to receive patients for treatment in case we find ourselves in a difficult situation.\nThe Delta variant is very contagious and spreads very wide, with a greater impact on those that are yet to be vaccinated.\n“We are here at this center to check the readiness of the facilities and the availability of oxygen, as well as ensure that we have all it takes to move 100 patients for treatment.”Vanguard News Nigeria"
  },
  {
    "headline": "COVID-19: UAE lifts transit travel ban on Nigeria, others",
    "summarized_story": "By Lawani MikairuThe United Arab Emirates, UAE, today, announced that with effect from Thursday passengers on transit flights from Nigeria, India, Pakistan, Sri Lanka, Nepal, and Uganda can now enter UAE.\nHowever, direct flights from Nigeria and these other countries are still banned until further notice.\nThe lifting of the ban on transit flights was disclosed in a statement by the National Emergency and Crisis Management Authority made available in a series of tweets on Tuesday.\nNECMA said passengers would be able to transit through its airports from Thursday as long as they present negative PCR tests taken 72 hours before departure.\nALSO READ: Runsewe urges travel trade members to promote Nigerian cultureThe statement reads: “Travel for transit passengers from all countries from which transit passengers have been suspended will be resumed in advance provided that the passenger’s last destination is accepted with a laboratory check-up within 72 hours of departure and state airports will allocate special lounges for transit passengers."
  },
  {
    "headline": "Plateau Senator condemns incessant attack on communities",
    "summarized_story": "Senator Dame Nora Daduut representing Plateau South Senatorial district has condemned endless attacks on some communities in Plateau State that saw to the wanton destruction of properties and farm crops.\nPlateau North Senatorial district has been under attacks particularly at nights for some weeks and months by gun men suspected to be Fulani herders.\nShe pointed out that communities in Bassa and Riyom Local Government Council Areas in Plateau North have been under siege by armed criminals, adding that all necessary measures be put in place to stop the deteriorating situation.\nShe lauded governor Simon Lalong for his swift intervention as ensuring that the State Emergency Management Agency (SEMA) and the Peace Building Agency (PBA) immediately go to the affected communities to provide humanitarian assistance.\nWhile sympathising with the victims, she called for calm and assured the people of governments intervention."
  },
  {
    "headline": "Expose those behind gender-based violence – Yobe residents charged",
    "summarized_story": "Residents of Yobe State have been charged to expose and report anybody involved in Gender Based Violence, (GBV), to the appropriate authorities for necessary action.\nRepresented by his Vice Adamu Hamza Ngojin, the Chairman was impressed with the turnout of participants at the important training.\n“It is a symbol of commitment and success towards ensuring a peaceful society”.\nWhile giving out the overview of the programme, the WOYEIN Gender Officer, Hajiya Asabe Abdullahi applauded the participants for attending the workshop which according to her will enrich their knowledge on the concept of GBV.\nShe explained that these organizations are non-political, non-profit and non-governmental determined to care for the molested and abused youths and Women in society."
  },
  {
    "headline": "Again, three Bethel Baptist students escape from bandits in Kaduna",
    "summarized_story": "Three abducted Bethel Baptist School students on Tuesday, escaped from bandits’ den miraculously.\nA security source who did not want his name mentioned because he was not authorized to speak on the matter, told DAILY POST Tuesday evening that “In the course of our operations, we saw three of the students roaming inside the forest in Chikun Local Government Area.\nAnd when we asked them, they told us that they were among kidnapped Bethel Baptist School students.”According to the source, “They escaped from their abductors and were later found roaming inside the forest by troops.\nFour abducted students of Bethel Baptist High School escape, regain freedomAccording to him, “The students looked pale and sick, so we have to evacuate them.”Recall that several Kaduna Bethel Baptist School students were Kidnapped on Monday, 5th July, 2021.\nThe kidnappers first demanded for 10 bags of rice and beans and later demanded for N60 million Naira from parents and the same amount from the proprietor of the school."
  },
  {
    "headline": "Provide information on 400 Boko Haram sponsors – Falana writes Malami",
    "summarized_story": "A law firm of Femi Falana, a Senior Advocate of Nigeria (SAN), has written to the Attorney-General of the Federation (AGF), Abubakar Malami, requesting information on the charges brought against 400 persons arrested for allegedly sponsoring Boko Haram.\nThe suspects were arrested in an operation coordinated by the Defence Intelligence Agency (DIA), the Department of State Services (DSS), Nigerian Financial Intelligence Unit (NFIU), and the Central Bank of Nigeria (CBN).\nIn a freedom of information (FoI) request signed by Samuel Ogala on behalf of Falana & Falana‘s Chambers, Malami was asked to provide the information of their prosecution within seven days in accordance with the act.\nIt read: “On May 4 2021, it was widely reported in the print and electronic media that the Federal Government had concluded arrangements to prosecute about 400 alleged sponsors and financiers of terrorism in Nigeria.\n“Kindly ensure that we are furnished with the requested information within 7 days of the receipt of this letter in accordance with the provisions of the Freedom of Information Act, 2011.”"
  },
  {
    "headline": "Katsina custom seizes 13 cars, other items worth over N60.1M from smugglers",
    "summarized_story": "Vehicles and goods worth not less N60,160,175.784 million have been seized from smugglers bythe Customs Service Command in Katsina State between 8 July to 3rd August 2021.\nAmong the items seized were 13 vehicles, 314 bags of foreign rice, 4 motorcycles, 26 bags of maize,14 kegs of pms, 178 bags of foreign spaghetti among others.\nThe Acting Area Comptroller in the state, DC Wada Chedi, disclosed the development to newsmen on Tuesday in his office.\nCustoms react, confirms clash between smugglers, officers in IseyinHe said his men are on top of their game and have been successfully countering the strategies adopted by smugglers in the State.\nCome to us, and we will direct you to where you will succeed because there are so many advantages.”"
  },
  {
    "headline": "How I got two car gifts in one year, by gospel singer Yinka Alaseyori",
    "summarized_story": "Popular gospel singer, Adeyinka Alaseyori has explained how she received two car gifts in May and August respectively.\nADVERTISEMENTThe Nation reports founder of Champions Royal Assembly, Kubwa, Abuja, Pastor Joshua Iginla presented a car gift to the singer.\n“August 2021, Pastor Joshua Iginla blessed us with the SUV.\nPlease help me say a word of prayer for Pastor Joshua Iginla and the mother God used to answer this prayers.\n“For my online family and everyone we pray and worship together, indeed God answers prayer."
  },
  {
    "headline": "Seven feared dead as Okada riders clash in Ogun",
    "summarized_story": "The peace in Ibese community in Yewa North Local Government Area of Ogun State snapped on Tuesday following clashes among commercial motorcycle operators over hike in ticket fee.\nBut the crisis, which began on Monday as a union affair, snowballed into an ethnic crisis between Hausa and Yoruba in the area, leading to attacks.\nThe villagers reported seven persons have been feared killed while over 12 motorcycles were razed as the locals intercepted Dangote trucks and used them to barricade road to stop movement in the area.\nADVERTISEMENTAccording to a source among the locals, the clash escalated on Tuesday when soldiers allegedly shot aggrieved indigenes, killing one and wounding another.\nOgun Police spokesman Command, Abimbola Oyeyemi confirmed the clash but said nothing about casualties."
  },
  {
    "headline": "Bandits free three Baptist students in Kaduna",
    "summarized_story": "Three of the abducted students of the Bethel Baptist High School in Kaduna State have been freed after payment of unspecified amounts of ransom.\nThe freed students who escaped from their initial abductors fell into the hands of another bandits who held them captive.\nConfirming the situation to journalists on Tuesday night, Chairman of Kaduna Christian Association of Nigeria(CAN) Rev Joseph Hayab said the three students escaped three days before 28 others were released on Sunday July 25.\nThe students, who are still in the hands of the troops, will be handed over to the school authorities.\nADVERTISEMENT“They initially asked for N10 million then it was reduced to N5 million and finally we came to an amount that we agreed."
  },
  {
    "headline": "UPDATED: PDP calls for calm as seven NWC members resign",
    "summarized_story": "Seven members of the National Working Committee (NWC) of the People’s Democratic Party (PDP) have resigned.\nIt was gathered those who resigned include: the Deputy National Financial Secretary, Deputy Legal Adviser, Deputy National Auditor, Deputy National Publicity Secretary, Deputy Women Leader and Deputy Organising Secretary.\nThey promised to remain loyal to the PDP but said they will not be able to work with the current National Working Committee (NWC).\n“The meeting of the National Working Committee and the deputies immediately took place to dialogue on the issues that were raised.\nThe party will look into the grievances raised by members of NEC as well as members of the National Working Committee."
  },
  {
    "headline": "Ugwuanyi offers scholarship to young inventors of aircraft, MP3 radio set",
    "summarized_story": "Enugu Governor, Ifeanyi Ugwuanyi, has offered scholarships up to university level to the Enugu and Anambra-born young students of Government Technical College (GTC), Nsukka and Enugu, Master Emmanuel Maduabuchi Chukwu and Master Chukwuebuka Udoye, who locally manufactured two aircraft (helicopter and jet fighter) and an MP3 radio set, respectively, in the state.\n“I am proud of all of you; I am proud of the education system in Enugu State and I am excited.\nThe young student from Anambra State, we give you N500,000.00 and scholarship for manufacturing a radio set in our state,”Ugwuanyi said.\nCommissioner for Education, Prof. Eze, applauded Ugwuanyi for the premium placed on education and his gesture to meet the students to encourage and appreciate their talents.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Breaking: Panic in Jos as sporadically gunshots dominate Gada Biu",
    "summarized_story": "From Gyang Bere, JosThere is palpable tension in Gada Biu in Jos the Capital of Plateau State as suspected irate youths shoots sporadic.\nThe gunshots were said to have dominated thereby causing panic among the residents of the area.\nIt was observed that there was burning of tires and big trucks which were parked along President Goodluck Jonathan road.\nResidents of the area are running helter-skelter, with women trapped with the children seeking for refuge.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Three abducted students in Kaduna escape from kidnappers den",
    "summarized_story": "Three more abducted students of Bethel Baptist Secondary school in Kaduna state have been recovered by security operatives.\nThe three students were allegedly recovered by security operatives on Tuesday morning inside the forest in Chikun local government area of the state, after they escaped from their abductors.\nA Security source told our correspondent in Kaduna that the three students had escaped from where they were kept by the bandits who abducted them from their school on July 5th before they were found by troops inside the forest.\nChairman of the Christian Association of Nigeria, CAN, in Kaduna, Rev Joseph Hayab, hinted that the bandits are now demanding for a fresh humongous ransom of N80m before they could free the remaining 80 students.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Kaduna: Gunmen kill 6, burn houses in fresh attacks",
    "summarized_story": "From Noah Ebije, KadunaGunmen suspected to be bandits on Monday attacked Ungwan Magaji, Kigam, Kisicho and Kikoba villages in Kauru local government area of Kaduna State, killing six persons in the areas.\nThe statement further said, “Responding to a distress call, troops arrived the location and engaged the attackers, forcing them to retreat.\n“In addition to the casualties, it was reported that eight houses, six huts, one motorcycle and a generator were razed during the attack.\n“The Governor tasked security agencies working in the area to sustain thorough investigations into the incident.\n“Similarly, the military and other security agencies are working with the governments of Kaduna and Plateau States, towards containing the renewed cycle of violence in Kauru LGA of Kaduna State and Bassa LGA of Plateau State respectively”."
  },
  {
    "headline": "Buhari approves deployment of nine perm secs",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, has approved the deployment of nine Federal Permanent Secretaries to Federal Ministries.\nIn a circular HCSF/CMO/AOD/012/IX/59 dated 3rd August, 2021, the Head of Civil Service of the Federation, Dr. Folasade Yemi-Esan disclosed the deployment takes immediate effect and handing over and taking over process should be completed on or before Friday, 6th August, 2021 with the exception of the Permanent Secretary, Federal Ministry of Health whose take over will be on 13th August, 2021.\nThe deployed Permanent Secretaries are: Bitrus Bako Nabasu from Ministry of Petroleum Resource is deployed to the Federal Ministry of Communication and Digital Economy; Dr. Evelyn Ngige, Service Welfare Office, OHCSF has been deployed to the Federal Ministry of Industry Trade and Investment; Mammam Mahmuda, Career Management Office, OHCSF is now in the Federal Ministry of Health; Dr. Nasir Sani Gwarzo, Federal Ministry of Industry Trade and Investment has been taken to Ministry of Petroleum Resources and Dr. Anthonia Akpabio Ekpa, Federal Ministry of Women Affairs to Special Duties and Inter-governmental Affairs.\nOthers are the newly appointed Permanent Secretaries, Dr. Onwudiwe Maryanne Ngozi, Dr. Ogunbiyi Marcus Olaniyi, Yusuf Ibrahim Idris and Adebiyi Olusesan Olufunso who were deployed to Service Welfare Office, OHCSF; Career Management Office, OHCSF; Common Service Office, OHCSF and Federal Ministry of Women Affairs respectively.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "PDP Confirms Resignation of Seven Officials",
    "summarized_story": "By Chuks OkochaThe National Organising Secretary of the Peoples Democratic Party (PDP), Col. Austin Akobundu has confirmed the resignation of seven members of the National Working Committee (NWC) who resigned from their respective offices.\nAccording to the PDP constitution, THISDAY gathered, the seven deputies that resigned, are not entitled to attend meeting of the NWC.\nThey have been agitating that they should be allowed to attend the main NWC meeting as the information reaching them after NWC is secondary.\nThe seven national officers of PDP in their separate letters addressed to the National Secretary of the party, Senator Unaru Tsauri, on Tuesday, alleged being sidelined and unfairly treated by the National Chairman, Uche Secondus.\nAmong those who have tendered their letters of resignation are the Deputy National Financial Secretary, Deputy National Organising Secretary, Deputy National Legal Adviser, Deputy National Publicity Secretary, Deputy Woman Leader, and Deputy National Auditor."
  },
  {
    "headline": "Buhari Approves Deployment of Nine Permanent Secretaries",
    "summarized_story": "By Olawale AjimotokanPresident Muhammadu Buhari has approved the deployment of nine federal permanent secretaries to different ministries.\nThe new postings were communicated by the Head of Civil Service of the Federation, Dr. Folasade Yemi-Esan via a circular- HCSF/CMO/AOD/012/IX/59 dated August 3, 2021.\nAlso affected in the exercise were the four recently appointed Permanent Secretaries: Dr. Onwudiwe Maryanne Ngozi, Dr. Ogunbiyi Marcus Olaniyi, Yusuf Ibrahim Idris and Adebiyi Olusesan Olufunso.\nThey were deployed to Service Welfare Office, OHCSF; Career Management Office, OHCSF; Common Service Office, OHCSF and Federal Ministry of Women Affairs respectively.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Tokyo 2020: Oborududu Beaten, Settles for Nigeria’s First Wrestling Silver Medal",
    "summarized_story": "In the early hours of Tuesday, African Record holder in the women’s Long Jump, Ese Brume, won Nigeria’s first athletics medal since 2008, taking bronze with her best leap of 6.97m in a highly competitive final at the Olympic Stadium in Tokyo.\nSpeaking with members of the press after her spectacular feat, Brume, who finished third behind Germany’s Malaika Mihambo and USA’s Brittney Reese stated that the colour of her medal doesn’t really matter as she was just excited at having finished on the podium.\nThe Doha 2019 nronze medallist said, ” I’m just excited, I’m grateful.\nI’m super happy that I was able to make it to Top 3.\nI can’t contain my joy; it doesn’t matter the medal; I’m just super happy I made Top 3.”"
  },
  {
    "headline": "Sanwo-Olu: Lagos Recorded 4,300 Cases, 30 Fatalities in July",
    "summarized_story": "•Says only 1% of Lagos residents vaccinatedLagos State Governor, Mr. Babajide Sanwo-Olu, raised the alarm about the third wave of COVID-19 pandemic, saying in July alone, some 4,300 confirmed cases were recorded with 30 fatalities.\nThis has resulted in 4,300 confirmed cases in July alone and 352 admissions into our isolation facilities.\nHe said, “We have, sadly, recorded 390 fatalities in Lagos State, 30 of which have taken place in this current 3rd wave of the pandemic.\nIt is our expectation that as the epicentre of the epidemic, Lagos State will receive a sizeable amount of this allocation.\nAlso, representative of the World Health Organisation (WHO), Dr Anne Baptiste, said Moderna’s COVID-19 vaccine was effective against several variants of concern, including the Delta variant."
  },
  {
    "headline": "DCP ABBA KYARI’S 96 HOURS",
    "summarized_story": "Deputy Commissioner of Police (DCP) Abba Kyari just witnessed one.\nJust within 96 hours DCP Abba Kyari’s life flipped.\nJust 96 hours changed many things about Kyari’s 20 years promising career!\nThis is a strong indication that some public jobs are difficult.\nThe IGP also promised absolute respect for all the rights and privileges of DCP Kyari throughout the period of the investigations."
  },
  {
    "headline": "BREAKING: Lawless Department Of State Services Finally Bows To Pressure, Releases 5 #BuhariMustGo Activists Arrested At Dunamis Church",
    "summarized_story": "The five activists arrested at the Dunamis International Gospel Centre, Abuja and detained by the Department of State Services (DSS) have finally regained their freedom.\nThe five had filed a contempt suit against the Director-General of the Department of State Services (DSS), Yusuf Bichi, for disobeying the court order granting them bail.\nThe court notice warned that the DSS DG risked being jailed.\nThe judge, Justice Anwuli Chikere in his ruling, had ordered that the DSS should release the applicants with immediate effect.\n\"Their lawyers will also pursue a contempt of court proceeding against the DG of DSS, Yusuf Bichi Mogaji in coming days."
  },
  {
    "headline": "BREAKING: Lawless Department Of State Services Finally Bows To Pressure, Releases 5 #BuhariMustGo Activists Arrested At Dunamis Church",
    "summarized_story": "The five activists arrested at the Dunamis International Gospel Centre, Abuja and detained by the Department of State Services (DSS) have finally regained their freedom.\nThe five had filed a contempt suit against the Director-General of the Department of State Services (DSS), Yusuf Bichi, for disobeying the court order granting them bail.\nThe court notice warned that the DSS DG risked being jailed.\nThe judge, Justice Anwuli Chikere in his ruling, had ordered that the DSS should release the applicants with immediate effect.\n\"Their lawyers will also pursue a contempt of court proceeding against the DG of DSS, Yusuf Bichi Mogaji in coming days."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General, Malami Covered Up Identities, Prosecution Of Terror Funders",
    "summarized_story": "Three months after the Nigerian government promised to arraign about 400 alleged Boko Haram sponsors and financiers of the deadly sect, the government appears to have mellowed down on the prosecution.\nAbubakar Malami“Three months and no prosecution has been heard about the 400 sponsors and funders of Boko Haram and bandits.\nSaharaReporters had revealed that apart from Malami opposing the raid, he also opposed having the names of those arrested released to the public.\nSaharaReporters had also in the first week of May reported that the government was set to arraign the 400 alleged Boko Haram sponsors and financiers.\nSaharaReporters had also today reported that human rights lawyer, Femi Falana, SAN, wrote to the AGF, Malami, requesting for information on the prosecution of the over 400 suspects."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General, Malami Covered Up Identities, Prosecution Of Terror Funders",
    "summarized_story": "Three months after the Nigerian government promised to arraign about 400 alleged Boko Haram sponsors and financiers of the deadly sect, the government appears to have mellowed down on the prosecution.\nAbubakar Malami“Three months and no prosecution has been heard about the 400 sponsors and funders of Boko Haram and bandits.\nSaharaReporters had revealed that apart from Malami opposing the raid, he also opposed having the names of those arrested released to the public.\nSaharaReporters had also in the first week of May reported that the government was set to arraign the 400 alleged Boko Haram sponsors and financiers.\nSaharaReporters had also today reported that human rights lawyer, Femi Falana, SAN, wrote to the AGF, Malami, requesting for information on the prosecution of the over 400 suspects."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General, Malami Covered Up Identities, Prosecution Of Terror Funders",
    "summarized_story": "Three months after the Nigerian government promised to arraign about 400 alleged Boko Haram sponsors and financiers of the deadly sect, the government appears to have mellowed down on the prosecution.\nAbubakar Malami“Three months and no prosecution has been heard about the 400 sponsors and funders of Boko Haram and bandits.\nSaharaReporters had revealed that apart from Malami opposing the raid, he also opposed having the names of those arrested released to the public.\nSaharaReporters had also in the first week of May reported that the government was set to arraign the 400 alleged Boko Haram sponsors and financiers.\nSaharaReporters had also today reported that human rights lawyer, Femi Falana, SAN, wrote to the AGF, Malami, requesting for information on the prosecution of the over 400 suspects."
  },
  {
    "headline": "National officers' resignation: PDP governors to hold emergency meeting",
    "summarized_story": "Governors elected on the platform of the Peoples Democratic Party (PDP) have scheduled an emergency meeting to discuss the crisis rocking the party.\nAdvertisementSeven deputy national officers of the opposition party resigned on Tuesday in protest against what they called “poor leadership”.\nAminu Tambuwal, governor of Sokoto state and chairman of the PDP governors’ forum, in a statement issued on Tuesday, said the governors are saddened over the development.\nTambuwal, who did not state the date of the meeting, appealed to aggrieved members to remain calm.\n“To this end, the PDP Governors’ Forum has scheduled an emergency meeting to discuss the affairs of the Party and the way forward."
  },
  {
    "headline": "National officers' resignation: PDP governors to hold emergency meeting",
    "summarized_story": "Governors elected on the platform of the Peoples Democratic Party (PDP) have scheduled an emergency meeting to discuss the crisis rocking the party.\nAdvertisementSeven deputy national officers of the opposition party resigned on Tuesday in protest against what they called “poor leadership”.\nAminu Tambuwal, governor of Sokoto state and chairman of the PDP governors’ forum, in a statement issued on Tuesday, said the governors are saddened over the development.\nTambuwal, who did not state the date of the meeting, appealed to aggrieved members to remain calm.\n“To this end, the PDP Governors’ Forum has scheduled an emergency meeting to discuss the affairs of the Party and the way forward."
  },
  {
    "headline": "'Return to negotiating table' -- FG begs striking resident doctors",
    "summarized_story": "Olurunnimbe Mamora, the minister of state for health, has called on the striking resident doctors to return to the negotiating table with the federal government.\nAdvertisementThe minister made the appeal to the National Association of Resident Doctors (NARD) on Tuesday in Abuja.\n“In saying this, there cannot be a better time and opportunity for me to appeal to doctors who are currently on strike.\n“My appeal is that they return to the negotiating table so that whatever outstanding issues can be sorted out.\nAdvertisement“We as a country cannot afford to be complacent because the cost of complacency in infectious disease control can be enormous.”"
  },
  {
    "headline": "'Return to negotiating table' -- FG begs striking resident doctors",
    "summarized_story": "Olurunnimbe Mamora, the minister of state for health, has called on the striking resident doctors to return to the negotiating table with the federal government.\nAdvertisementThe minister made the appeal to the National Association of Resident Doctors (NARD) on Tuesday in Abuja.\n“In saying this, there cannot be a better time and opportunity for me to appeal to doctors who are currently on strike.\n“My appeal is that they return to the negotiating table so that whatever outstanding issues can be sorted out.\nAdvertisement“We as a country cannot afford to be complacent because the cost of complacency in infectious disease control can be enormous.”"
  },
  {
    "headline": "Re-abducted after escape, 3 Bethel Baptist School students finally regain freedom",
    "summarized_story": "Three students of Bethel Baptist High School, Kaduna, who escaped from captivity but were re-abducted by another set of bandits have regained their freedom after payment of ransom.\nHe told TheCable that the three students had escaped from captivity before the recent release of 28 of their colleagues.\n“The students had escaped from their captors three days before the recent release of 28 of their colleagues,” he told TheCable.\nOn July 5, bandits invaded the Bethel Baptist School and abducted 121 students.\nAdvertisementOne of the students who fell ill was released by the bandits while six others escaped, and on June 25, the bandits released 28 of the students."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Project Manager."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "Kuda Bank closes $55 million Series B round led by Paypal backers",
    "summarized_story": "Nigerian fintech startup, Kuda Bank, has raised $55 million in a Series B round at a valuation of $500 million.\nThis comes after a recent Series A of $25 million announced by the company just a little over four months ago.\nKuda plans to use the funds to build on its new services for Nigeria as well as prepare for a continental expansion.\nBeyond just basic financial services, Kuda now offers credit to its users by way of an overdraft allowance, which the company pre-qualifies the most active users for.\nAccording to Ogundeyi, Kuda has seen “minimal” default because of its approach."
  },
  {
    "headline": "The dawn of Ghana’s tech ecosystem: Here’s what you should know",
    "summarized_story": "Here’s what you should know about Ghana’s tech ecosystem, beyond cliches.\n“We are seeing more Ghanaian tech talents being headhunted by global companies.\n“When Impact Hub Accra started, we were pretty much the only Hub in town,” Kelechi Ofoegbu, COO Impact Hub Accra, said.\nA number of established Ghanaian tech companies like Hubtel, Farmerline, Sayetech, Green Afro-Palms began in Kumasi.\nJorge Appiah, who is also the CEO of SolarTaxi, believes the Ghanaian tech ecosystem is in its early days."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "South Africa-based agritech startup, Khula, raises $1.3 million seed to scale operations",
    "summarized_story": "Share this article:Khula, a South Africa-based agritech startup that connects subsistence and commercial farmers to agricultural supply and marketplaces, has announced a $1.3 million seed raise from SA-based agrochemical company AECI and E Squared Investments.\nThis announcement comes with the launch of Khula’s new app — KHULA!\nInputs — allows farmers to purchase agricultural inputs like fertilisers and agrochemicals and also access services from local and international suppliers.\nWith Khula’s Fresh Produce Marketplace, farmers can directly sell produce to local and international wholesalers.\nKhula claims to have signed up more than 3,000 farmers connected to over 100 suppliers and has 132 depots across South Africa."
  },
  {
    "headline": "Oluyomi Ojo steps down as Printivo CEO",
    "summarized_story": "Share this article:Six years after co-founding print-on-demand startup, Prinitivo, with Temitope Ekundayo and Ibukun Oloyede, Oluyomi Ojo has stepped down from his role as CEO.\nI just published My watch has ended… https://t.co/t6MIUmXpmj — Oluyomi Ojo (@OluyomiOjo) August 3, 2021Per the Medium post, Ojo will remain on Printivo’s board as a director, while Ekundayo and Oloyede continue to lead the company.\nAfter graduating with a degree in applied mathematics from the Ladoke Akintola University of Technology, Ojo started a design and advertising firm called Urbanbaze.\nPrintivo is a print-on-demand startup that enables small and medium enterprises to print items.\n“I love to build, I love to solve problems, and if there is anything we have an abundance of in today’s complex world, it is problems."
  },
  {
    "headline": "Nigerian SME lending platform, Payhippo, enters Y Combinator’s Summer 2021 batch",
    "summarized_story": "Share this article:Nigeria-based lending and business financing platform, Payhippo, has been accepted into Y Combinator’s Summer 2021 cohort, joining 167 startups, four of which are African.\nGetting into the Y Combinator accelerator programme will give the platform access to $125,000 seed fund and other networking and mentorship opportunities.\nPayhippo claims to have disbursed 3,000 loans worth over $4.1m SMEs in Nigeria in a year and eight months of operations.\n“We’ve been hiring like crazy, investing in and looking to hire a head of finance, engineers, and SME salespeople.\nAdvertisementProbably, the funding, mentorship, and network that Y Combinator provides can help the founders gain useful insight into reaching more people and tackling Nigeria’s unique crediting challenge."
  },
  {
    "headline": "Nigeria wins big in IMF $650bn SDR reserves allocation",
    "summarized_story": "The Board of Governors of the IMF has approved a general allocation of SDRs equivalent to US$650 billion (about SDR 456 billion) on August 2, 2021, to boost global liquidity.\n“This is a historic decision – the largest SDR allocation in the history of the IMF and a shot in the arm for the global economy at a time of unprecedented crisis.\nThe SDR allocation will benefit all members, address the long-term global need for reserves, build confidence, and foster the resilience and stability of the global economy.\nRead also: Naira bouncing back as uncertainty wanes“We see Nigeria as the largest relative winner within our coverage universe from the SDR allocation.\nAbout US$275 billion (about SDR 193 billion) of the new allocation will go to emerging markets and developing countries, including low-income countries."
  },
  {
    "headline": "Naira bouncing back as uncertainty wanes",
    "summarized_story": "That’s after the currency on Tuesday strengthened to N509 per dollar from N512 on Monday at the parallel market.\nTraders said the naira may strengthen further to N504 per dollar as uncertainty about the rate wanes.\nWithin the period, the naira weakened by 42.1% in the parallel market and the spread between the official and parallel rates widened from 38.1% to 54.0%.\nSimilar to 2016, this time, the initial market response to the ban was a 3.81% decline in naira in the parallel market to N525/US$1.\nConsequently, the spread between the I&E rate and the parallel market rate could continue to expand,” analysts at Coronation said."
  },
  {
    "headline": "Apapa: Multiple checkpoints frustrate electronic call-up system",
    "summarized_story": "Despite the implementation of electronic call-up system, security officials known as ‘enforcement team’ employed by the government to monitor truck movement in and out of Apapa and Tin-Can Island ports, have been found compounding the traffic gridlock by creating multiple checkpoints to extort money from truckers.\nHowever, with extortion, a trucker spend as much as N80,000 to N100,000 per trip due to the multiple checkpoints created by the traffic enforcement team.\nConfirming this, Mohammed Bello-Koko, acting managing director, Nigerian Ports Authority (NPA), states that the security officials including military men, policemen, officials of the NPA security department and others are sabotaging the smooth operations of the electronic call-up system by mounting several checkpoints.\nRead also: Haulage cost halves as electronic call-up eases port congestion“At night, military men escort vehicles (into the port), which is sabotage.\nThis number can be used to get an Eto ticket."
  },
  {
    "headline": "Word Day Against Trafficking In Persons: UNHCR Harps on Inter Agencies Collaboration – Nigerian Observer",
    "summarized_story": "“Although the Federal Governmental has put in measures to counter trafficking in persons, Nigeria remains a country of origin, transit, and destination for human trafficking.\n“We are making significant progress in the fight against human trafficking and we encourage all stakeholders to join the fight against human trafficking so that we can do more”, he said.\n(Mrs.), Chidiebere Oruruo-Ifedu, said that her agency is at the forefront in the fight against human trafficking in Africa.\n“Today, the whole world is celebrating the fight against human trafficking and in our continent, NAPTIP is the focal agency that fight human trafficking.\nWe are saying no to human trafficking”, she remarked..."
  },
  {
    "headline": "Obaseki hails Oba of Benin’s stance on new property protection law, assures on synergy to check activities of land grabbers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has saluted the Oba of Benin, His Royal Majesty, Omo N’Oba N’Edo, Uku Akpolokpolo, Oba Ewuare II, for his support and collaboration with the government to check the criminal activities of land grabbers in the state.\n“We are glad that we have promulgated and re-enacted the law on private property protection and banned the activities of community youths perpetrating this act.\nI am happy to inform you that the palace of the Oba of Benin is standing with the Edo State Government on this.\n“The Oba of Benin, Oba Ewuare II, is very much with the government on this, as youths protested to his palace on this and he stood firm with the action of the government.\nWe will ensure that we curtail it and recover as much land that has been encroached.”He further stated: “Land encroachment and land grabbing is something we are taking very seriously."
  },
  {
    "headline": "Human Trafficking: IOM launches Victims Identification, Reporting Tools – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA: The International Organisation for Migration (IOM) has commemorated the 2021 World Day Against Trafficking in Persons with the launch of identification and reporting tools for victims of human trafficking in Nigeria.\nHe said that it would be administered for victim identification and reporting by all relevant stakeholders across the country.\nThe inability to properly identify trafficked persons, he said increases their vulnerability to exploitation.\nHe added that this year’s theme, “Victims Voices Lead the Way,” highlights the importance of listening to and learning from the experiences of survivors of human trafficking.\nDue to the severity and the multidimensional nature of human trafficking, he said that IOM counter trafficking work focuses on facilitating assistance and protection to trafficked persons to reduce their vulnerability."
  },
  {
    "headline": "Edo College abuse video: Govt suspends Principal, House Master …to prosecute abusers with Child Rights Law – Nigerian Observer",
    "summarized_story": "In a statement, Secretary to Edo State Government, Osarodion Ogie Esq., said all the students involved in the abusive behaviour have been handed over to the Ministry of Justice for investigation and prosecution in accordance with the Child Rights Law.\nThe statement reads: “The Edo State Government has watched with disdain the disturbing viral social media video of abuse by students of Edo College, Benin City, the Edo State capital.\nHe is to remain on suspension until the investigation of the incident is concluded and government provides further directives on the matter.\n“The House Master for Akenzua Hall of Residence, Mr. Oamen Stanley, has also been suspended indefinitely, with immediate effect.\n“All the students involved in the abusive behaviour have been handed over to the Ministry of Justice for investigation and prosecution in accordance with the Child Rights Law."
  },
  {
    "headline": "Court orders EFCC to unfreeze Dokpesi’s bank account",
    "summarized_story": "The Federal High Court in Abuja, on Tuesday, issued an order unfreezing the bank account of the Chairman of Daar Communications Plc, Raymond Dokpesi.\nThe judge, John Tsoho, gave the order in a ruling on Mr Dokpesi’s application for the unfreezing of the account.\nMr Tsoho said in the absence of a stay of execution, the court was bound by law to recognise the judgment of the appellate court.\nHe further ordered that all documents seized from Mr Dokpesi should be immediately returned to him.\nHowever, the trial judge, Mr Tsoho, rejected the no-case submission and ordered Mr Dokpesi and his firm to enter their defence."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigeria’s Tokyo 2020 Olympics showing has been near disaster, but change is happening",
    "summarized_story": "But the country’s only wrestler at the event, Blessing Oborududu, and long jumper, Ese Brume, have ensured that it won’t return empty handed, by winning silver and bronze medals respectively.\nIndeed, the country won its first medal in the 1964 games held in Tokyo, with Nojim Maiyegun winning bronze in boxing.\nThis was followed in West Germany 1972, by another bronze won in boxing by Isaac Ikhouria.\nChika Chukwumerije and Mariam Usman won bronze in taekwondo and weightlifting respectively.\nOf the total 25 medals won by Nigeria since 1952, for instance, boxing accounted for six, athletics 13, football three, weightlifting two and taekwondo, one."
  },
  {
    "headline": "Report says $2.4m paid as ransom for kidnapped students since November",
    "summarized_story": "A report by the National Security Summit organised by the House of Representatives between May 26 and 29, 2021, had revealed that up to $2.4m has been paid to secure the release of schoolchildren in five separate mass kidnapping incidents in the North-West since November 2020.\nThe leadership of the House of Representatives had presented a copy of the report to President Muhammadu Buhari.\nThe report said though official sources denied paying such money, sources privy to the negotiations that led to the release confirmed the amount.\nIn the North West particularly, Nigeria is experiencing a crisis of armed banditry and kidnapping,” the report said.\n“Their negotiated release has cost the government as much as $2.4m, according to sources familiar with the details, although official sources insist that no ransoms were tendered."
  },
  {
    "headline": "Akinleye celebrates Osun PDP chair at birthday, describes him as a unifying factor",
    "summarized_story": "By Sunday Oguntuyi, OsogboA chieftain of People’s Democratic party, PDP in Osun State, Alhaji Kazeem Akinleye, has joined million of well wishers to rejoice with the chairman of the party in the state, Hon.\nSunday Bisi as he celebrates his birthday today, just as he described as a unifying factor who came to rebuild the party in the state.\nAkinleye in a congratulatory message made available to newsmen in Osogbo, alluded to the leadership quality possessed by the state party chairman which, he said has started manifesting inform of rebuilding the party.\nBisi for attaining another milestone in life and prayed to God for enablement to lead the people’s party to the promise land.\n“I, on behalf of my family and my associate wishing my amiable chairman, the capacity chairman a blissful birthday, I fervently prayed for God’s guidance in all your endeavour."
  },
  {
    "headline": "CBN assures customers it has no plans to convert foreign currency in dom accounts into naira",
    "summarized_story": "Nigeria’s apex bank, the Central Bank of Nigeria (CBN), has assured bank customers that it is not planning to convert foreign exchange in their domiciliary accounts into naira.\nActing Director in charge of Corporate Communications, Osita Nwanisobi, who gave the assurance pointed out that those behind the speculations are criminal elements looking to create panic in the foreign exchange market.\nHe gave the assurance that the CBN will ensure that the legitimate FX demands of customers are met by commercial banks, as he advised FX operators to go about their business without worries.\nAccording to ThisDay, he said this days after the CBN Governor, Mr. Godwin Emefiele, announced that deposit money banks will henceforth be in charge of the sale of foreign exchange to Bureaux De Change and other customers.\n”In particular, we have noted with disappointment and great concern that our BDC operators have abandoned the original objectives of their establishment which was to serve retail end users who need $5,000 or less,” he said."
  },
  {
    "headline": "FG Warns MDAs’ Heads, Boards Over Rivalry",
    "summarized_story": "Secretary to the government of the federation (SGF), Boss Mustapha has decried what he described as unhealthy and poor relationship existing between governing boards of government Ministries, Departments and Agencies (MDAs) and their chief executive officers in the country.\nThe SGF said it is unacceptable and that government would not allow it to continue as it affects smooth operations of public service in the country.\nThe induction was organised for the Governing Boards of the Federal Character Commission (FCC), Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC) and the Nigeria Electricity Management Agency (NEMSA).\nADVERTISEMENTAccording to him, “The observed poor and unhealthy relationships existing between Governing Boards and their Chief Executive Officers have become very worrisome to government and are unacceptable.\n“This could be avoided if chairmen and members of governing boards acquaint themselves with the instruments of establishment of their respective organisations, where the role and responsibilities of the Board are prescribed,” the SGF added."
  },
  {
    "headline": "FG Warns MDAs’ Heads, Boards Over Rivalry",
    "summarized_story": "Secretary to the government of the federation (SGF), Boss Mustapha has decried what he described as unhealthy and poor relationship existing between governing boards of government Ministries, Departments and Agencies (MDAs) and their chief executive officers in the country.\nThe SGF said it is unacceptable and that government would not allow it to continue as it affects smooth operations of public service in the country.\nThe induction was organised for the Governing Boards of the Federal Character Commission (FCC), Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC) and the Nigeria Electricity Management Agency (NEMSA).\nADVERTISEMENTAccording to him, “The observed poor and unhealthy relationships existing between Governing Boards and their Chief Executive Officers have become very worrisome to government and are unacceptable.\n“This could be avoided if chairmen and members of governing boards acquaint themselves with the instruments of establishment of their respective organisations, where the role and responsibilities of the Board are prescribed,” the SGF added."
  },
  {
    "headline": "IMF $650bn Loan Window To Boost Nigeria’s Reserves By 20%",
    "summarized_story": "The International Monetary Fund (IMF), has approved a general allocation of Special Drawing Rights (SDRs) equivalent to $650 billion (about SDR 456 billion) to boost global liquidity.\nThe latest approval, being the largest SDR allocation in the history of the IMF, could see Nigeria’s external reserves rising by as much as 20 per cent, according to a Reuters estimate.\nSDR is an international reserve asset created by the United Nations specialised agency to supplement its member countries’ official reserves.\n“The SDR allocation will benefit all members, address the long-term global need for reserves, build confidence and foster the resilience and stability of the global economy.\n“It will particularly help our most vulnerable countries struggling to cope with the impact of the COVID-19 crisis."
  },
  {
    "headline": "IMF $650bn Loan Window To Boost Nigeria’s Reserves By 20%",
    "summarized_story": "The International Monetary Fund (IMF), has approved a general allocation of Special Drawing Rights (SDRs) equivalent to $650 billion (about SDR 456 billion) to boost global liquidity.\nThe latest approval, being the largest SDR allocation in the history of the IMF, could see Nigeria’s external reserves rising by as much as 20 per cent, according to a Reuters estimate.\nSDR is an international reserve asset created by the United Nations specialised agency to supplement its member countries’ official reserves.\n“The SDR allocation will benefit all members, address the long-term global need for reserves, build confidence and foster the resilience and stability of the global economy.\n“It will particularly help our most vulnerable countries struggling to cope with the impact of the COVID-19 crisis."
  },
  {
    "headline": "Federal Govt Vows To Prosecute Rape, GBV Offenders",
    "summarized_story": "The Federal Government has vowed to deal decisively with all perpetrators of Rape and other Gender-Based Violence (GBV) in the country.\nThe vice president, Prof Yemi Osibanjo, made this known at the official launch of USAID’s Momentum Country and Global Leadership.\n“This declaration of Zero Tolerance to Rape and other forms of Gender Based Violence, including Harmful Traditional Practices is a giant stride and a step in the right direction in fighting Gender Based Violence in Nigeria.\nAs such, I want to join my voice to all the voices gathered here today to say no to Gender-Based Violence in Nigeria.\n“As a nation, we will continue to boldly condemn Gender-Based Violence (GBV), so long as it continues to impact negatively on survivors, victims, families, broader society and economies of Nations."
  },
  {
    "headline": "Kanu needs ‘medical care,’ says lawyer after visit",
    "summarized_story": "The leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, has again met with his lawyer, Ifeanyi Ejiofor while being detained in the facility of the Department of State Services.\nEjiofor disclosed this in a message titled, ‘Update’ issued on Monday evening.\nHe wrote, “After weeks of speculations and uncertainties, we have finally seen our client-Mazi Nnamdi Kanu.\nWe can authoritatively confirm this position to the world.\n“He is firm and stable, less the burden of solitary confinement and concomitant mental torture arising therefrom."
  },
  {
    "headline": "Kanu needs ‘medical care,’ says lawyer after visit",
    "summarized_story": "The leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, has again met with his lawyer, Ifeanyi Ejiofor while being detained in the facility of the Department of State Services.\nEjiofor disclosed this in a message titled, ‘Update’ issued on Monday evening.\nHe wrote, “After weeks of speculations and uncertainties, we have finally seen our client-Mazi Nnamdi Kanu.\nWe can authoritatively confirm this position to the world.\n“He is firm and stable, less the burden of solitary confinement and concomitant mental torture arising therefrom."
  },
  {
    "headline": "Fresh attack: Gunmen kill six in Kaduna, raze eight houses",
    "summarized_story": "Fresh attack: Gunmen kill six in Kaduna, raze eight housesFresh attack: Gunmen kill six in Kaduna, raze eight housesGunmen have killed six persons in an attack, which spanned across Ungwan Magaji, Kigam, Kisicho and Kikoba villages in Kajuru local government area of Kaduna State.\nThey also razed eight houses, six huts, motorcycles and a power generating set during the attack.\nCommissioner for Internal Security and Home Affairs Samuel Aruwan said Governor Nasir El-Rufai has condemned the attacks in strongest terms.\n“In addition to the casualties, it was reported that eight houses, six huts, one motorcycle and a generator were razed during the attack.\n“Governor Nasir El-Rufai expressed his sadness over the attack and condemned it as an action of depraved entities stripped of every shred of humanity."
  },
  {
    "headline": "Fresh attack: Gunmen kill six in Kaduna, raze eight houses",
    "summarized_story": "Fresh attack: Gunmen kill six in Kaduna, raze eight housesFresh attack: Gunmen kill six in Kaduna, raze eight housesGunmen have killed six persons in an attack, which spanned across Ungwan Magaji, Kigam, Kisicho and Kikoba villages in Kajuru local government area of Kaduna State.\nThey also razed eight houses, six huts, motorcycles and a power generating set during the attack.\nCommissioner for Internal Security and Home Affairs Samuel Aruwan said Governor Nasir El-Rufai has condemned the attacks in strongest terms.\n“In addition to the casualties, it was reported that eight houses, six huts, one motorcycle and a generator were razed during the attack.\n“Governor Nasir El-Rufai expressed his sadness over the attack and condemned it as an action of depraved entities stripped of every shred of humanity."
  },
  {
    "headline": "IPOB sues U.S. officials to stop sale of six A-29 Super Tucano to Nigeria",
    "summarized_story": "Agency ReportsThe Indigenous People of Biafra (IPOB) has made a legal move to block the transfer of six A-29 Super Tucano aircraft to Nigeria’s air force and to seek the return of six that were recently delivered.\nConstitutional lawyer Bruce Fein filed the case on behalf of IPOB and 10 unidentified individuals based in southeastern Nigeria.\nIPOB sued US Secretary of State Antony Blinken and Defence Secretary Lloyd Austin over the sale of attack planes that it says will be used to persecute its supporters.\nThe Super Tucano propeller aircraft are equipped with precision-guided munitions and have been used for counter-insurgency operations in countries from Afghanistan to Colombia.\nThe plaintiffs “reasonably fear that the A-29 Super Tucano aircraft will be used imminently to kill or maim them physically or to destroy their property”, according to the complaint."
  },
  {
    "headline": "Kidnappers of Bethel Baptist students demand N81m ransom",
    "summarized_story": "Agency ReportsKidnappers of 81 students of Bethel Baptist High School in Kaduna are demanding a ransom of one million naira each to release themA pastor involved in the negotiations for the release of the students disclosed the ransom on Tuesday.\nThe students were stolen from their boarding school last month by bandits,the 10th mass school kidnapping since December in northwest Nigeria.\n“(Bandits) are asking for one million naira on each of the 80 students remaining with them,” Reverend Ite Joseph Hayab said.\nKidnappers released 28 children last month after a first batch of 28 was released two days after the raid.\nHe was paid over one million naira by parents."
  },
  {
    "headline": "Photos of the day: Sanwo-Olu hits London for Tinubu",
    "summarized_story": "By Kazeem UgbodagaLagos State Governor, Babajide Sanwo-Olu on Tuesday was in London to visit the National leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu.\nReports last week suggested that Tinubu had undergone surgery in the United States.\nBut his media aide, Tunde Rahman rubbished the report published by Sahara Reporters, saying the former governor in deed travelled but was not admitted in any hospital.\nWith Sanwo-Olu’s visit to Tinubu in London on Tuesday, the reported ill-health of the APC national leader may just be a hoax.\nPictures from the visit showed the governor chatting with Tinubu, who appeared to be lively."
  },
  {
    "headline": "BREAKING: 3 More Students Kidnapped From Bethel Baptist School Escape From Bandits",
    "summarized_story": "Three additional Bethel Baptist High School pupils in Kaduna have reportedly escaped captivity.\nAccording to a security source in Kaduna on Tuesday, the students were discovered roaming in the forest in the state’s Chikun Local Government Area.\nAccording to the publication, the students were re-kidnapped by another gang of bandits following their escape and negotiated with their parents.\nThe sources said, “They escaped from their abductors and were later found roaming inside the forest by troops.\nThe students were abducted on the school premises along the Kaduna-Kachia Expressway, Damishi, Chikun Local Government Area of the state, around 2 a.m. on Monday, July 5, 2021."
  },
  {
    "headline": "BREAKING: Department Of State Services Finally Bows To Pressure, Releases 5 #BuhariMustGo Activists Arrested At Dunamis Church",
    "summarized_story": "The five activists detained by the Department of State Services (DSS) at the Dunamis International Gospel Centre in Abuja have finally been released.\nThe activists were released on Tuesday, 30 days after their arrest and imprisonment in the DSS’s custody, according to SaharaReporters.\nThe five had filed a contempt suit against Yusuf Bichi, the Director-General of the Department of State Services (DSS), for breaching the court’s bail order.\nThe DSS DG could face jail time, according to the court notice.\nFollowing their arbitrary arrest and detention, the activists sued the DSS, the church’s senior pastor, Paul Enenche, and others."
  },
  {
    "headline": "Tokyo Olympics: Minister Sunday Dare Promise Nigerian Athletes Dollars For Medals",
    "summarized_story": "Nigerian athletes who bring home medals from the Tokyo Olympics would receive a financial prize ranging from $7,500 to $15,000, according to Youth and Sports Minister Sunday Dare.\nWrestler Blessing Oborodudu won Team Nigeria’s second medal at the games on Tuesday, prompting the announcement.\nGold was for $5,000, silver was worth $3,000, and bronze was worth $2,000 in the previous award.\nQuadri Aruna, Team Nigeria’s captain at the Tokyo Olympics and Africa’s top-ranked table tennis player, mocked officials for shortchanging competitors at the games on Friday via his Instagram profile @quadriaruna.\nEse Brume, who won Nigeria’s first Olympic medal with a bronze in the long jump, is also anticipated to receive $7,500."
  },
  {
    "headline": "BREAKING: Sanwo-Olu Meets Tinubu In London (Photos)",
    "summarized_story": "In new photos obtained by NewsDirect, Lagos state governor, Babajide Sanwo-Olu paid a visit to ex Lagos state governor and national leader of the All Progressives Congres, Tinubu.\nSee the photos below:It was learnt that Tinubu, who has made multiple medical trips this year, had surgery last week and could be charged for another for an illness that is yet to be revealed.\nThe APC National Leader had been absent from official and party engagements in the country for some time, amid speculation that he is being groomed to succeed Muhammadu Buhari’s dictatorial dictatorship in 2023.\nHe couldn’t participate in launching his Arewa library, and he couldn’t participate in the Local Government Area elections last week.\nWell, a day after the story made rounds his aide came out with a statement debunking the reports claiming they were false."
  },
  {
    "headline": "Happening now: Hoodlums launch attack, set trucks on fire in Jos (VIDEO)",
    "summarized_story": "There is currently an uneasy calm at gada-biyu general area of Jos, the Plateau state capital following attack by suspected hoodlums.\nBlueprint reports that the hoodlums are attacking passerby and setting trucks on fire.\nChairman of Jos local government council, Shehu Bala, has confirmed the incident.\nHe said: “Yes there was incident at Gada-biyu area, some trucks were burnt.\n“Now things have been brought under control, but by tomorrow, I am sure we will get more information.”Details loading…"
  },
  {
    "headline": "Breaking: Fuel scarcity looms as IPMAN shuts down Calabar depot over ‘Police harassment’",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN), late Tuesday, shut down its operation in Calabar depot over what they described as incessant harassment of its members by the Police.\nObi said the action would continue until security operatives learn to treat IPMAN members with courtesy, noting, “The duration of the strike is uncertain as it emanates from the national president of the association.”Also, IPMAN national president, Alhaji (Engr.)\nSanusi Fari, in a solidarity message, said marketers in the Southeast and South south were constantly being harassed by the police and that the only way to check the impunity was to down tools.\n“The Independent Petroleum Marketers Association of Nigeria, Eastern zone wish to state with dismay, the incessant attack by men of Nigeria police force at our secretariats in Port Harcourt, Aba, Calabar, Enugu and Makurdi depots.\nHowever, the spokesman for the State Police command, Irene Igbo, when contacted on the alleged harrasment of IPMAN members, said her office was not aware of such allegation."
  },
  {
    "headline": "2020 Olympics: Nigeria moves up table standing as Blessing Oborodudu, Ese Brume win medals in Tokyo",
    "summarized_story": "PreviousPictures: Strange as Gabonese man marries four wives at once"
  },
  {
    "headline": "Don’t preach division of Nigeria, NYSC DG advises Corp members -NigPilot",
    "summarized_story": "Director-General, National Youth Service Corps, Brig.-Gen. Shuaibu Ibrahim has advised Corps members to promote peace and unity of Nigeria, urging them to shun any act that would encourage division.\nHe said as nation builders, Corp members should refrain from all forms of cybercrimes, and drive their vision with passion.\nHe urged the Corps members to respect the culture and values as well as contribute meaningfully to the development of their host communities.\nThe DG stressed the need for the Corps members to seek permission before travelling in view of the spate of road accidents and security challenges in the country.\n“Recently, corps members have been involved in a motor accidents, therefore, it is mandatory to take permission before embarking on a journey,” he said."
  },
  {
    "headline": "LG unveils smart home appliances with free stabilizer -NigPilot",
    "summarized_story": "LG Electronics has taken smart home appliances to another dimension with the introduction of stabilizer-free, non-plumbing, and auto restart refrigerators to present consumers with a more enriching smart home experience.\nKang said LG is set to deliver an unparalleled level of performance and convenience into the home with enhanced features.\n“One unique feature is the Stabilizer Free Operation on LG Refrigerators and as the name suggests, refrigerators with stabilizer-free operation features save you from spending extra money in buying a separate stabilizer for your refrigerator.\nOn LG Washing Machine, A unique feature is the Auto Restart feature.\nLG InstaView Refrigerator features a Non-Plumbing Dispenser."
  },
  {
    "headline": "Istochnik Initiative seeks support of Russian Embassy to promote Russian language, culture -NigPilot",
    "summarized_story": "A non-governmental organization (NGO) under the aegis of the Istochnik Initiative has solicited the support of the Russian Embassy in Abuja to promote Russian culture and language amongst the Russian community in Nigeria, as well as Nigerian professionals that were trained in Russia.\n“In addition, Istochnik Initiative aims to popularization Russian education in Nigeria and promote Russian universities in Nigeria.\nHe said: “This passion for the propagation of Russian language and literature had been evident since her lecturing days at the University of Ibadan when she organized Russian cultural activities and Russian language classes for the children of Russian women living in Ibadan.\n“Then, with the support of the Russian Embassy in Lagos, she established a Russian library that included Russian films and subscribed to Russian newspapers and journals for the benefit of the Russian-speaking community.\n“Accordingly, the Russian Embassy in Abuja had supported Mrs. Olga IGBO in her initiative to establish the Istochnik Initiative NGO and actively supported the NGO in the organization of several Russian cultural activities”."
  },
  {
    "headline": "West-African stakeholders embrace Universality of Internet -NigPilot",
    "summarized_story": "Stakeholders of the ICT sector in West Africa have agreed to embrace the universality of the internet with the aim of deepening internet penetration across the region and ensuring safe internet.\nUNESCO and the African ICT Foundation jointly organized a knowledge-sharing session on how to mainstream Internet Universality and ROAM principles (Rights, Openness, Access, and Multi-stakeholder approach).\nDorothy Gordon, Chair of UNESCO’ Information for All Programme, reaffirmed the need for strong advocacy from national and regional stakeholders to implement the national assessment of IUIs across the West-African countries.\nRepresenting Development House, Kafui Aheto introduced the initial findings of the ongoing national assessment of ROAM-X indicators in Ghana.\nUNESCO encourages all countries in the West-African sub-region to continue using the ROAM framework and join the Dynamic Coalition on Internet Universality Indicators (IUIs) to bring the Internet forward in the region."
  },
  {
    "headline": "Three More Secondary School Students Abducted In Kaduna Found",
    "summarized_story": "Three more abducted students of the Bethel Baptist Secondary school in Kaduna State have been found.\nRead Also: Tears, Joy As 28 More Kidnapped Students Regain Freedom In KadunaThe students have now been debriefed by the military, and will be handed over to the school authorities soon.\nIts been nearly a month since 121 students of the school were abducted from their hotels by bandits, after which the bandits demanded a ransom of ₦60 million for the release of the students.\nOn July 25, 28 students were found inside the Tsoho Gaya Forest in Chikun Local Government Area of the state.\nBut mass school abductions have soared this year, with almost 1,000 students kidnapped, according to UNICEF."
  },
  {
    "headline": "SDR: IMF Allocates $3.35bn To Nigeria",
    "summarized_story": "Nigeria has been allocated about $3.35 billion as part of a historic general allocation of Special Drawing Rights (SDRs) of the International Monetary Fund (IMF).\n“This is a historic decision – the largest SDR allocation in the history of the IMF and a shot in the arm for the global economy at a time of unprecedented crisis,” said IMF Managing Director, Kristalina Georgieva.\nIt is a potential claim on the freely usable currencies of IMF members and can provide a country with liquidity.\nSupporting Pandemic RecoveryThe amount allocated to Nigeria is as a result of the exchange rate of reference which is 0.702283 SDR to a dollar as of July 1, 2021, and Nigeria has 2.4545 billion SDRs.\n“The SDR allocation will benefit all members, address the long-term global need for reserves, build confidence, and foster the resilience and stability of the global economy,” the IMF managing director added."
  },
  {
    "headline": "Tokyo Olympics: Oborududu, Brume Give Nigerians Reasons To Cheer With Two Medals",
    "summarized_story": "By Akionla AjibolaNigerian duo Blessing Oborududu and Ese Brume gave their fellow compatriots back home some reasons to cheer as they hope for more medals at the 2020 Tokyo Olympic Games in Japan.\nShe later went on to face Stock Mensah Tamyra Marianna of the United States of America to jostle for the gold medal in that category in a keenly-watched final.\nShe also made history on Tuesday as the first wrestler to win an Olympic medal representing Nigeria at the Olympics.\nApart from the brilliant performances from Oborududu and Brume, Nigerians are hoping for more medals as second-seed Odunayo Adekuoroye begins her quest for an Olympic medal in the 57kg weight category at the ongoing games.\n“On behalf of the government and people of Delta, I congratulate our daughter and Nigerian wrestler, Blessing Oborududu, for winning a silver medal in the ongoing Tokyo 2020 Olympics."
  },
  {
    "headline": "UPDATED: Seven PDP National Officers Resign, Blame Secondus",
    "summarized_story": "Seven national officers of the Peoples Democratic Party have resigned from their roles in the party.\nThe party chieftains in different letters addressed to its National Secretary on Tuesday alleged being sidelined and unfairly treated by the National Chairman, Uche Secondus.\nSome of the executive members include the National Deputy Publicity Secretary, Diran Odeyemi; Deputy National Organising Secretary, Hassan Yakubu; and the Deputy National Woman Leader, Hadizat Umoru.\nAfegbua had called on the Economic and Financial Crimes Commission (EFCC) and the Independent Corrupt Practices and Other Related Offences Commission (ICPC) in April, to probe the party’s leadership.\nHe, therefore, stressed the need for the party’s leadership to lead by example by ensuring transparency and accountability."
  },
  {
    "headline": "Biden Asks New York Governor To Resign After Damning Harassment Report",
    "summarized_story": "US President Joe Biden joined leading Democrats Tuesday in calling on powerful New York Governor Andrew Cuomo to resign after an independent investigation concluded that he sexually harassed multiple women.\nBut his position was looking increasingly untenable late Tuesday after Biden and House speaker Nancy Pelosi said the three-term governor should step down and state lawmakers moved to impeach him.\n“I think he should resign,” Biden told reporters in Washington.\nThe five-month investigation “concluded that Governor Andrew Cuomo sexually harassed multiple women and in doing so violated federal and state law,” James told a news conference.\nAnd Kim said Cuomo and his staff fostered a “climate of fear” that kept women from speaking out."
  },
  {
    "headline": "UAE lifts ban on flights to and from Nigeria",
    "summarized_story": "The United Arab Emirates (UAE) has lifted flight its ban on Nigerian travellers with effect from Thursday August 5 five months after imposing the ban.\nEmirates airlines announced on its website that the UAE authorities have announced that effective 5 August 2021, eligible travellers from Nigeria and 10 other countries will be allowed to travel to/through the UAE.\nEmirates in the short notice said, “We will publish details of the latest protocols and requirements on our travel requirements page, as soon as these are available.”The ban has been in place since March this year with scheduled flights between Nigeria and the UAE stopped following a diplomatic row over Covid-19 protocols.\nThough, the ban was lifted, Emirates, on the instruction of the UAE government suspended flights to Nigeria.\nThe Lagos-Dubai and Abuja-Dubai routes are some of the most lucrative routes for airlines."
  },
  {
    "headline": "Gunmen kill six in Kaduna, raze eight houses",
    "summarized_story": "Unknown Gunmen have killed six persons in an attack, which spanned across Ungwan Magaji, Kigam, Kisicho and Kikoba villages in Kajuru local government area of Kaduna State.\nThe gunmen also razed eight houses, six huts, motorcycles and a power generating set during the attack.\nKaduna State Commissioner for Internal Security and Home Affairs Samuel Aruwan said Governor Nasir El-Rufai has condemned the attacks in strongest terms.\n“In addition to the casualties, it was reported that eight houses, six huts, one motorcycle and a generator were razed during the attack.\n“Governor Nasir El-Rufai expressed his sadness over the attack and condemned it as an action of depraved entities stripped of every shred of humanity."
  },
  {
    "headline": "3 More Bethel Baptist College Students Recovered",
    "summarized_story": "Three additional student abducted from Bethel Baptist College in Kaduna State have regained their freedom.\nAdvertisementThree of the students have been handed over to their Parents who immediately took them to a health facility for medical examination and treatment.\nThe latest development, therefore, brings the total number of the recovered students to 41 out of the 121 that were abducted by bandits on the fifth of July.\nAt least Eighty students are still in the custody of the bandits who are now demanding a ransom of Eighty million Naira for their release.\nThe Parents of the Abducted students and the School Management gather at the School premises everyday to pray for the safe return of the remaining students who have now spent a month in the hands of their abductors."
  },
  {
    "headline": "US President Biden Urges New York Governor Cuomo to Resign Over Sexual Harassment Accusations",
    "summarized_story": "Cuomo said he was hiring an expert to reform sexual harassment training for state employees, including the governor.\nI say they actually discredit the legitimate sexual harassment victims that the law was designed to protect,” Cuomo said.\nNew York state regulations say sexual harassment includes unwelcome conduct of a sexual nature — from unwanted flirtation to sexual jokes — that creates an offensive work environment, regardless of a perpetrator’s intent.\nCuomo championed a landmark 2019 state law that made it easier for sexual harassment victims to prove their case in court.\nAlleged victims no longer have to meet the high bar of proving sexual harassment is “severe and pervasive.”"
  },
  {
    "headline": "PDP Youth Leader Jailed For Insulting Buhari – What’s Trending",
    "summarized_story": "Chief Magistrate’s Court 4 sitting in Yola, Adamawa State on Monday, sentenced Youth Leader of the People’s Democratic Party in the Hong Local Government Area, Ikamu Kato, to one-year imprisonment for insulting the President, Muhammadu Buhari; and Secretary to the Government of the Federation, Boss Mustapha.\nA medical student of University of Calabar, Enya Egbe has expressed shock after discovering his friend’s body in his anatomy class.\nFinally, Usman Kyari, younger brother of embattled Deputy Commissioner of Police Abba Kyari, has deleted pictures of himself posing with several luxury vehicles in apartments on his Instagram handle."
  },
  {
    "headline": "New York Governor Cuomo Sexually Harassed Multiple Women, Probe Finds",
    "summarized_story": "Andrew Cuomo found that he sexually harassed multiple current and former state government employees, state Attorney General Letitia James announced Tuesday.\nCuomo sexually harassed current and former state employees, federal and state laws,” James said at a press conference on Tuesday.\nCuomo was also found to have harassed women outside of government, the investigation found.\nHis office has said he took the state’s mandated sexual harassment training, but has not provided any documentation proving he did.\nAlleged victims no longer have to meet the high bar of proving sexual harassment is “severe and pervasive.”"
  },
  {
    "headline": "Brazil to Play Spain for Olympic Gold Medal in Men’s Football",
    "summarized_story": "Defending champion Brazil will face Spain for the Olympic gold medal in men’s football on Saturday.\nSpain beat host Japan 1-0 Tuesday with Marco Asensio scoring a curling shot in the 115th minute in Saitama.\nBrazil was taken to penalties by Mexico, winning the shootout 4-1 after a scoreless draw in Kashima.\nBrazil won its first Olympic title at the 2016 Rio de Janeiro Games in a penalty shootout with Germany.\nSpain’s only Olympic title also came at home — at the 1992 Barcelona Games."
  },
  {
    "headline": "New York City Will Require Vaccination Proof for Indoor Dining, Gyms from Aug 16",
    "summarized_story": "New York City will soon require proof of COVID-19 vaccinations for indoor activities, Mayor Bill de Blasio announced Tuesday, making it the first big city in the U.S. to impose such restrictions.\nThe new requirement, which will go into effect Aug. 16, applies to indoor dining, gyms and indoor entertainment venues.\nDe Blasio said Monday he was making “a strong recommendation” that everyone wear a mask in public indoor settings but stressed that the city’s “overwhelming strategic thrust” remained getting more people vaccinated.\nThe mayor announced last week that city employees would be required to get vaccinated by mid-September or to face weekly testing, and he has offered a $100 incentive for city residents who get inoculated.\nAbout 66% of adults in New York City are fully vaccinated, according to official data."
  }
]